{"offset":0,"number":50,"available":12405,"news":[{"id":388843504,"title":"NORAD tracks Santa&#039;s Yuletide sleigh ride for 70th year","text":"DENVER, Dec 24 (Reuters) - Santa Claus drove his reindeer-powered sleigh over rooftops around the world on Wednesday, delivering gifts to millions of children in a magic Christmas Eve ritual that North American air defense officials say they began tracking 70 years ago. Still, despite its devotion to a tradition dating back to the Cold War era of 1955, the North American Aerospace Defense Command, or NORAD, possesses limited intelligence about the direction that Santa will take in any given year. Santa is not required to file a flight plan. So the only thing NORAD knows for sure in advance is that the red-suited jolly old elf, also known as Kris Kringle or Saint Nicholas, takes off every Christmas Eve from his home base at the North Pole. \"NORAD tracks Santa, but only Santa knows his route, which means we cannot predict where or when he will arrive at your house,\" a senior NORAD official said in a press statement. NORAD, a joint U.S.-Canadian military command at Peterson Air Force Base in Colorado Springs, Colorado, has provided images and updates on Santa's worldwide journey for seven decades, along with its main task of monitoring air defenses and issuing aerospace and maritime warnings. The Santa tracker tradition originated from a 1955 misprint in a Colorado Springs newspaper of the telephone number of a department store for children to call and speak with Santa. The listed number went to what was then known as the Continental Air Defense Command. An understanding officer took the youngsters' calls and assured them that Santa was airborne and on schedule to deliver presents to good girls and boys - at least those who believe in him - flying aboard his reindeer-powered sleigh. According to its website, NORAD detects Santa's liftoff with its polar radar network, then follows his journey with the same satellites used to warn of any possible missile launches aimed at North America. As soon as Santa's lead reindeer, Rudolph, switches on his shiny red nose, military personnel can zero in on his location using the satellites' infrared sensors. U.S. President Donald Trump appeared to be following NORAD's Santa tracker on Wednesday as he sat by a Christmas tree at his Mar-a-Lago residence in Florida, fielding telephone calls from children around the country. As he spoke to one youngster from Pennsylvania, Trump said, \"So Santa right now is in Copenhagen, Denmark, but he's heading toward our country. What would you like from Santa?\" Speaking to another caller, Trump jokingly explained the rationale for tracking Santa in terms of national security, saying, \"We want to make sure he's not infiltrated, that we're not infiltrating into our country a bad Santa.\" (Reporting by Keith Coffman in Denver; Writing and additional reporting by Steve Gorman in Los Angeles; Additional reporting by Jonathan Landay in Washington; Editing by Saad Sayeed) By Keith Coffman","url":"https://www.marketscreener.com/news/norad-tracks-santa-s-yuletide-sleigh-ride-for-70th-year-ce7e59dadc8df423","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-12/2025-12-25T005954Z_1_LYNXMPELBO00H_RTROPTP_4_USA-TRUMP.JPG","video":null,"publish_date":"2025-12-25 01:01:42","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"fr","sentiment":-0.257},{"id":388843980,"title":"Trump-Backed Nasry Asfura Wins Honduras Presidential Election","text":"TEGUCIGALPA: Nasry Asfura, a conservative businessman backed by US President Donald Trump, was declared winner of the Honduran presidential vote Wednesday, weeks after a razor-thin election marred by delays and allegations of fraud. Asfura, a 67-year-old son of Palestinian immigrants, defeated fellow conservative TV personality Salvador Nasralla, who had demanded a full recount due to alleged irregularities. The plenary session of the national electoral council CNE \"declares Nasry Juan Asfura Zablah elected for a four-year term,\" the council's president Ana Paola Hall said. Rixi Moncada, a lawyer from the leftist Libre Party, which currently runs the government, was trailing far behind in third. Within minutes of the declaration of the result, the United States welcomed the election of Asfura, saying it would help stop illegal immigration. \"We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries,\" Secretary of State Marco Rubio said in a statement. Following the lengthy counting process in the Central American country's election, Rubio called on all sides to \"respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority.\" The result was announced more than three weeks after the November 30 vote. The wait for the results has caused tensions among Hondurans, and the sluggish count has been accompanied by claims of irregularities and voter fraud. The recount of nearly 2,800 tally sheets with suspected inconsistencies was pored over by hundreds of electoral staff and political delegates to determine the winner. The National Electoral Council had had until December 30 to declare a winner. Last week, thousands of supporters of the ruling leftist Libre party of outgoing President Xiomara Castro staged a demonstration in the capital Tegucigalpa to protest what they consider \"fraud\" in the vote. On the eve of the election, Trump in a surprise move pardoned former Honduran president Juan Orlando Hernandez, a member of Asfura's party who was serving a 45-year prison sentence in the United States for drug trafficking. Extradited by Honduras to face justice in the United States, Hernandez insists he had been set up by the previous administration of US president Joe Biden because of his conservative policies. The pardon was widely seen as contradicting Trump's crackdown on alleged drug traffickers in Latin America. Trump also endorsed Asfura, saying they could \"work together to fight the narcocommunists,\" and warned \"there will be hell to pay\" if the conservative candidate's razor-thin lead was overturned in the count.","summary":"Asfura defeated fellow conservative TV personality Salvador Nasralla, who had demanded a full recount due to alleged irregularities","url":"https://www.deccanchronicle.com/world/trump-backed-nasry-asfura-wins-honduras-presidential-election-1926209","image":"https://www.deccanchronicle.com/h-upload/2025/12/25/1993404-aa-6167286.webp","video":null,"publish_date":"2025-12-25 01:01:08","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.454},{"id":388841218,"title":"The 11 biggest video game news stories of 2025 – from Switch 2 to GTA 6","text":"And what a year it’s been (Metro/Nintendo/Rockstar/Sandfall Interactive)\n\nGameCentral takes a look at the biggest video game news stories of 2025 and what impact they’ll have on the new year to come.\n\nIf you can say one thing about video games in 2025, it certainly wasn’t boring, although that’s not necessarily a good thing. It followed the pattern of the last couple of years, with plenty of incredible video games produced in spite of the industry’s machinations and not because of them.\n\nThis year brought with it more layoffs, more acquisitions, and more cynicism. Executives, and shows like Summer Game Fest and The Game Awards, will tell you everything is fine, and that gaming’s only going to get better, but that’s despite even the very biggest franchises faltering and struggling to meet financial expectations.\n\nThere’s certainly a chance that some of these issues will improve in 2026, especially after the great progress shown by indie studios this year, but clearly the future is not going to be a smooth ride.\n\n1. Nintendo Switch 2 launches and has an incredible first six months\n\nThis time last year, the news cycle was dominated by constant Nintendo Switch 2 leaks, most of which proved accurate when Nintendo finally lifted the lid on the new console. That did little to dilute peoples’ excitement, but the Switch 2’s reveal proved surprisingly contentious. Some weren’t impressed by it just being a more powerful Switch 1 and Nintendo’s decision to charge upwards of £75 for first party games attracted loud online complaints.\n\nDespite the criticisms, the Switch 2 hasn’t just sold well, it has sold incredibly well; becoming the fastest-selling video game console of all time. At 10.36 million sales worldwide, it’s also comfortably on track to meet Nintendo’s target of roughly 15 million sales by the end of March 2026.\n\nYet the Switch 2’s first six months have been… odd when it comes to the games themselves. Mario Kart World was a smart pick for a day one title and Nintendo’s efforts to revitalise Donkey Kong (complete with a redesign) with Donkey Kong Bananza appear to have paid off.\n\nBut these were the only big names Nintendo had and when it comes to first party output, the Switch 2 has mostly relied on upgraded Switch 1 ports and more niche games, like the less than impressive Hyrule Warriors: Age Of Imprisonment and Kirby Air Riders.\n\nIt says a lot that the console’s big Christmas game was Metroid Prime 4: Beyond, which while not completely awful has not pleased long-term fans.\n\nAnd then there were the digital-only oddities – Nintendo Switch 2 Welcome Tour and Drag X Drive – which are still baffling to think about and rare examples of genuine duds from Nintendo.\n\nThere wasn’t even a new 3D Super Mario game for the franchise’s 40th anniversary (we got Super Mario Galaxy re-releases to tie in with next year’s movie instead) and with no major releases scheduled for 2026 yet, the Switch 2’s future is looking awfully unclear.\n\n Compared to the Switch 1’s first six months, the Switch 2 feels far more experimental (Nintendo)\n\n2. GenAI grows more prevalent but not more popular\n\nThe games industry is always looking to capitalise on the latest tech trends, but whereas its obsessions with blockchain technology and NFTs quickly fizzled out, generative AI has remained a hot topic for the past couple of years and it’s only becoming more commonplace.\n\nAI generated artwork and voice performances were already creeping into games, but now companies are looking to further integrate the tech, if not use it to make entire games.\n\nMicrosoft, in particular, is all in on genAI, proudly announcing its Muse AI tech, which it swears is being used to ‘empower’ creators and not replace them; a promise pretty much every other AI-positive company makes. Microsoft even says its next Xbox console will be powered by AI, but it’s yet to explain what that actually means.\n\nThe PlayStation 6 is also said to make use of AI, with ChatGPT support, and leaked footage of a prototype of an AI-powered Aloy from the Horizon games – one that can converse with players and directly respond to questions – showed Sony is experimenting with the technology.\n\nIt’s abundantly clear, though, that there’s no real demand for genAI in games from actual players. Companies like it because, ideally, they can save money by not paying human developers, artists, voice actors, etc. For instance, staff who helped train AI tools for Candy Crush Saga found themselves out of work now that those tools could do their jobs instead.\n\nAs such, there remains a very vocal pushback against it. Some developers have publicly condemned its usage and now use the lack of genAI as a selling point for their own games. And they’re not a vocal minority either. AI tools remain a hard sell for most people, with The Information reporting that Microsoft has had to scale back its AI goals because not enough people are using them.\n\nMeanwhile, Clair Obscur: Expedition 33 had its awards stripped from it by The Indie Game Awards for breaking its rules over using AI.\n\nUnfortunately, genAI can only get harder to spot and even if companies don’t hide it (Steam, for instance, requires developers to state if genAI is used in their games), it’s increasingly being used in small ways that are deemed more acceptable.\n\nArc Raiders, for instance, openly admits to using AI voicework and yet the game has been a massive hit. As such, we’ll very likely see more major releases in 2026 make use of genAI in more ways than just placeholder art.\n\n If Arc Raiders can still find success despite pushback, is it only a matter of time before genAI is completely normalised in games? (Embark Studios)\n\n3. Sony does nothing – has a fantastic year anyway\n\n2025 should have been a bad year for Sony. Its live service game plans continued to implode, following the failure of Concord in 2024, with more unannounced projects (including a new God Of War) reportedly being cancelled.\n\nThose plans haven’t been completely abandoned but FairGame$ remains MIA and there’s so little enthusiasm for next year’s Marathon reboot that Bungie’s future under Sony looks increasingly bleak. As for the newly announced Horizon multiplayer game, it’s mostly being handled by an external studio and isn’t even coming to PlayStation 5.\n\nThe assumption is that Sony put too much stock in live service games and that’s why there’ve been few major single-player releases for the PlayStation 5. This year, Sony’s only published two console exclusives – Ghost Of Yōtei and Death Stranding 2 – and the second one wasn’t even made internally.\n\nNot to mention Sony’s had to start putting games on other platforms besides PC. Helldivers 2 (the one live service success Sony has) is now on Xbox and select PlayStation games have seen Switch ports. Things aren’t so bad for Sony that it’ll have to port major franchises to Xbox and Switch, but clearly they are willing to forgo some exclusivity to try and improve revenue.\n\nAnd yet 2025 has not been a fiscal disaster for Sony, far from it. Even before those generous Black Friday discounts, console sales shot up this year so there’s clearly still plenty of interest in both the PlayStation 5 and its software. Although this is likely less to do with Sony’s business decisions and more due to Xbox failing to offer any real competition anymore.\n\nThat said, 2026 could be a strong year for the PlayStation 5, thanks to Saros and Wolverine. While it’s apparently still more than a year away, Naughty Dog’s next game is also still in the pipeline and, with any luck, Sony has some welcome surprises that have yet to be announced.\n\n4. The Xbox you knew is dead\n\nNo matter how much of a positive spin Microsoft tries to put on its business decisions, it’s abundantly clear that Xbox’s name no longer carries any weight or glamour to it. The writing was on the wall when Xbox exclusives began appearing on PlayStation 5, but this year has only accelerated Xbox’s downfall.\n\nThe lack of any Black Friday discounts shows Microsoft has completely given up on selling the Xbox Series X/S, with even the Nex Playground, a console barely anyone had heard of, outselling it by catering specifically to young children and families.\n\nAnd even though it was hotly rumoured, confirmation of Halo (once the Xbox’s biggest exclusive) coming to PlayStation, through a remake of the first game, felt like the final death nail for the branding. If even Halo can be played elsewhere, why bother getting an Xbox at all?\n\nMicrosoft remains committed to new hardware, though, partnering with Asus to launch the ROG Xbox Ally. However, it’s an incredibly niche product and more a handheld PC than a portable Xbox.\n\nMost damning of all, though, were the widespread layoffs that look place in July. While it’s been far from the only one to let go of staff, Microsoft has drawn the most ire since it had the gall to brag to employees about how profitable the company and its gaming division were as it announced redundancies.\n\nThis also resulted in several cancelled projects, including the Perfect Dark reboot (the very first Xbox Series X exclusive Microsoft announced) and its developer The Initiative (which was formed specifically to handle Perfect Dark) being shut down. Combined with previous layoffs, more than 6,000 Xbox employees have been let go in the last two years, with more rumoured to go early next year.\n\nEven if Microsoft isn’t suffering financially, Xbox’s reputation is in the mud and there’s perhaps no salvaging it or at least not in terms of being a hardware manufacturer.\n\n5. GTA 6 gets delayed twice\n\nGTA 6 is such a huge deal for the video game industry that every other publisher is trying to plan around its release… something that’s incredibly hard to do when its release date keeps changing.\n\nInitially scheduled for a vague autumn 2025 window, Rockstar then announced in May that it would be pushing GTA 6 back to May 26, 2026, suddenly leaving that autumn window open for the rest of the industry.\n\nJust six months later, though, Rockstar delayed GTA 6 again, to November 19, 2026, saying that it needs extra polish. That’s a whole year later than the original release window, which is bad news for impatient fans but has at least given games coming out in early 2026 some breathing room.\n\nWhile that first delay did yield a new trailer, it didn’t reveal much new info outside of some possible gameplay glimpses and vague character profiles. Given how uncommunicative Rockstar’s being a third delay is not out of the question.\n\nThat’s far from the only issue Rockstar faces, though. The abrupt firing of over 30 staff members faced accusations of union busting and protests outside Rockstar’s offices, with some suggesting that the internal turmoil is one of the reasons for the new delay.\n\nRockstar may have hoped to simply weather it out but the issue’s become widespread enough that even Prime Minster Keir Starmer got involved. As such, the company now faces a full government investigation into the matter.\n\n GTA 6’s a slam dunk no matter what but Rockstar won’t want any negative press to linger (Rockstar)\n\n6. Next gen rumours\n\nAlthough neither the PlayStation 6 or next gen Xbox have been formally announced, Sony and Microsoft have already begun discussing new hardware, which means the next generation of consoles aren’t more than a year or two away now.\n\nThe only official details we know of either console is that they’ll involve AI somehow, but frequent leaks and rumours have helped paint a picture of what else you can expect.\n\nFor the PlayStation 6, the consensus is that Sony is actually working on two models: one being a traditional console and the other being a portable handheld akin to the Switch. Considering it’s supposed to be capable of natively running games, not just streaming them like the PlayStation Portal, it’s assumed it will be much less powerful than the PlayStation 5 or 6.\n\nHowever, people think the new power saver mode for the PlayStation 5 could demonstrate how the handheld will work, running games at a lower frame rate and resolution to reduce power consumption.\n\nAs for the new Xbox, everything points to it being more of a PC than a console, as it’s reportedly aiming to offer full backwards compatibility with all Xbox games. If so, it’s unlikely to be any more affordable than an actual PC.\n\nInitially, both consoles were expected to launch in 2027, but many worry that the increase in chip prices, especially RAM, brought on by the rise of AI may force those plans back.\n\nThere’s also the matter of GTA 6. With that coming to PlayStation 5 and Xbox Series X/S in late 2026, and guaranteed to drive up hardware sales, Sony and Microsoft will want to take advantage of that for as long as possible.\n\n Some don’t think there should ever be a new generation of consoles (Metro)\n\n7. Clair Obscur: Expedition 33 changes the game for indies\n\n2025 was another cracking year for independently developed video games, with the likes of Blue Prince, Ball x Pit, and, of course, Hollow Knight: Silksong just to name a few. But if one game defined 2025 for indies, it was Clair Obscur: Expedition 33.\n\nDeveloped by French studio Sandfall Interactive, which only consists of around 30 people (although they were assisted by hundreds of contractors), the game exceeded all expectations, becoming a poster child for how small teams with small budgets can still make incredibly successful and beloved video games.\n\nIf the rest of the industry wasn’t already paying attention upon Clair Obscur’s launch, it certainly should be now that it swept The Game Awards 2025, taking Game Of The Year along with eight other trophies.\n\nSandfall itself has said that it hopes Clair Obscur will spark a resurgence in double-A games; an area that has seriously dried up over the years, as big publishers focus almost solely on big budget triple-A fare.\n\nHowever, it’s naïve to assume Clair Obscur will single-handedly fix all of the industry’s problems. Traditional publishers have increasingly had an all or nothing approach to modern gaming and are only interested in the very biggest titles or, ideally, live service games that will run for years.\n\n8. Everything gets more expensive\n\nGaming has never been the cheapest hobby, but 2025 has made it abundantly clear that anyone who wants to enjoy the biggest new releases from day one will need a sizable income going forward. Whereas hardware used to get cheaper as it got older, the PlayStation 5 and Xbox Series X/S, which were already extremely pricey at launch, have instead grown more expensive.\n\nXbox’s price increases have been particularly egregious since they also impacted the Xbox Game Pass service. Subscriptions are now 50% higher and despite Microsoft adding further incentives to justify it, it was met with unanimous outrage from Xbox players and many cancelled subscriptions.\n\nEven Nintendo wasn’t immune to this. The Switch 2 itself, while more expensive than the Switch 1, is actually decently priced but Nintendo is willing to sell select games at upwards of £75 for the physical version, which will undoubtedly incentivise other publishers to follow suit.\n\nAside from general inflation, these price increases can be attributed to US president Donald Trump’s tariffs, which greatly impacted China, where most gaming hardware is manufactured.\n\nThe tariffs proved so chaotic that Nintendo had to delay Switch 2 pre-orders in the US and while the console avoided a price hike mere days after its announcement, accessories were affected and Nintendo is concerned the tariffs will impact its profits.\n\nSony, Microsoft, and Nintendo have worked to get around this by moving hardware production to other countries, like Vietnam, but prices stand to only climb upwards, not just for consoles but gaming PCs too.\n\nThe AI boom means companies are buying up RAM, something which AI technology requires a lot of, which has led to stock shortages that could last well into next year and thus increase prices on what is left.\n\nTo tie this back to the next gen consoles, this would give Sony and Microsoft another reason to hold off on releasing new hardware. With both expected to be very expensive (with price tags of over £1,000 being thrown around), barely anyone will be able to afford new consoles.\n\nAs evidenced by the success of the Switch 2 and the PlayStation 5’s increased sales, these price hikes have yet to negatively impact companies. So, publishers have little reason to fear a drop in revenue, even as some fans are forced to abandon day one purchases.\n\nAdditionally, this will only see more and more people put their time and money into free-to-play games, which in turn continues the cycle of companies trying to release their own games into an already oversaturated market, dominated by the likes of Fortnite, and then abandoning them because they don’t become overnight successes.\n\n Free-to-play is more enticing than ever (Epic Games)\n\n9. More consolidation with EA, Ubisoft, and Warner Bros. buyouts\n\nThe way things are going, there will barely be any major independent game publishers left. The idea that a company as large as EA would need to sell itself off seemed laughable years ago, but that’s exactly what’s happened. Assuming the $55 billion deal isn’t blocked (which it likely won’t be), EA will soon be under the ownership of a consortium of investors that includes the PIF (Public Investment Fund), the sovereign wealth fund of Saudi Arabia.\n\nAnd while it’s not technically been sold off, Ubisoft still required a £1 million bail out from Tencent, giving the Chinese conglomerate a lot of control over a new subsidiary that’s focused on Ubisoft’s biggest franchises.\n\nWhat this is likely to lead to is both companies tripling down on their core IPs. Indies and more experimental games will become far less of a priority because the end goal is to make back those investments, not take risks on unknown new titles.\n\nEA, especially, will need to make a lot of money, and fast, since the terms of its buyout means it’s now saddled with $20 million of debt. Unfortunately, aside from selling games, there are other means of recouping costs, such as laying off staff (which feels inevitable since EA reportedly has plans for AI usage) and shutting down studios.\n\nSome analysts believe EA could opt to sell studios and certain franchises, so perhaps the future will see the likes of BioWare and Mass Effect change ownership. Or, ideally, studios will buy themselves out and go fully independent.\n\nUbisoft may not end up doing things too differently than it has before, saying earlier this year that it will continue to focus on open world adventure games and trying to crack the live service games market.\n\nUbisoft has routinely failed to find success in the latter, but though the underperformance of Star Wars Outlaws suggested open world games were suffering diminishing returns, Assassin’s Creed Shadows’ success shows there’s still an appetite for such games.\n\nThis isn’t even getting into whatever’s happening with Warner Bros. and its gaming division. Aside from Hogwarts Legacy, the company’s gaming efforts have yielded enough negative results recently for it to shut down three studios, including Monolith Productions, and now sell off a significant portion of itself to Netflix (or Paramount, depending on how things are going by the time you read this).\n\nConsidering Netflix itself has found little success in releasing its own games, and it’s admitted Warner Bros.’ gaming library had very little influence on its acquisition offer (via PocketGamer.biz), it’s hard to imagine those studios thriving under new management.\n\nLooking back at all this, it really feels like the Western games industry is slowly collapsing, with the few remaining big publishers set to be stripped for parts.\n\n Fans are already fearful of how their favourite games could change under new ownership (EA/Metro)\n\n10. Fall Of Duty\n\nCall Of Duty has had bad years before. 2021’s Call Of Duty: Vanguard was a sales disappointment and 2023’s Modern Warfare 3 reboot was critically mauled for blatantly being DLC sold as a brand new game, but these did little to hurt the series’ momentum and stop people coming back each year.\n\nBut something has changed this year. Call Of Duty: Black Ops 7 was quickly labelled as a dismal follow-up to last year’s excellent Black Ops 6, for its awful campaign, lack of new ideas, and use of AI artwork.\n\nAnd this time, it’s led to a serious impact on the game’s sales. Activision and Microsoft have not shared official figures, but that itself is very telling, and it’s suggested that the numbers are certainly worse than last year’s game.\n\nMost importantly, Call Of Duty had had genuine competition this year, in the form of extraction shooter Arc Raiders and EA’s Battlefield 6, which quickly garnered popularity during its pre-launch period and stuck the landing, enjoying a bigger launch than Black Ops 6.\n\nWe’re sure EA will get cocky and screw things up (they’re already causing controversy with their vulgar use of AI), but for now it’s Activision which is on the back foot, especially when it reportedly dismissed Battlefield 6 as a serious rival, earlier in the year.\n\nMicrosoft may have claimed otherwise but Call Of Duty was obviously a big part of its Activision Blizzard buyout and was meant to become a key franchise for the company. But already new entries becoming day one additions to Game Pass seems to have backfired, since that obviously eats into the sales figures and it reportedly hasn’t even managed to improve the continually dwindling player numbers.\n\nIf you needed any further evidence, Activision itself has acknowledged how poorly Black Ops 7 is doing and pledged not to ever do back-to-back Modern Warfare or Black Ops games again. This doesn’t mean an end to annual releases in general, but it does mean studios like Treyarch won’t be asked to pump out new games two years in a row.\n\nIt’s also been rumoured that Activision is facing pressure from Microsoft to change its approach to the series, which could result in studio mergers and reworked monetisation, although Activision has denied these claims.\n\nA new Call Of Duty – Modern Warfare 4 – is expected to launch in 2026 and is rumoured to take the series to Korea, which is at least a new setting. But a change in scenery won’t be enough of a band-aid for Call Of Duty’s ongoing problems.\n\n11. Return of the Steam Machine\n\nIt’s too soon to tell, but theories are already flying that Valve’s Steam Machine will be quite the game changer in 2026, even potentially taking Xbox’s place in the market. Although that depends on how far Valve is willing to push its new hardware.\n\nAs a reminder, Valve attempted to break into the console market once before with the Steam Machine concept, which was marketed as an easier-to-access PC specifically meant for games. A sound idea for attracting console owners to the PC ecosystem, but it never caught on, partially due to an unattractive price tag.\n\nEven now, Valve’s yet to share pricing for this second attempt and it’s unlikely to be particularly affordable, especially since Valve won’t be selling it at a loss like Sony and Microsoft typically have with their consoles.\n\nBut if Valve is smart in how it advertises it, the Steam Machine could find a new audience outside of the hardcore Steam crowd. Especially since it’s becoming more expensive to build proper gaming PCs (thanks to the aforementioned supply issues) and the Steam Machine being tied to the Steam ecosystem means free online multiplayer; something you need to pay extra for on PlayStation, Xbox, and Switch.\n\nIt’s also rumoured that Half-Life 3 is in the works and will be a launch title for the Steam Machine. Half-Life 3 is one of those legendary games that’s long been demanded but seemed more like an urban legend than a real possibility. If it actually came out, even as a temporary exclusive, it would make for quite the killer app for the Steam Machine.\n\nSuch hardware, however, has always been niche. PC handhelds like the Steam Deck have their audiences, but they’ve never come close to the best-selling consoles. Even consoles like the PlayStation Vita, a metric failure by all other standards, sold more units than the Steam Deck.\n\nIt is entirely possible Valve has no grander ambitions for its Steam Machine, and the company is notoriously unpredictable. But for it to even consider bringing its not-console back after so many years suggests a shift within Valve’s priorities, which could dramatically shake up the console market, and the wider games industry, in an interesting way.\n\n Will you be getting the GabeCube? (Valve)\n\nEmail gamecentral@metro.co.uk, leave a comment below, follow us on Twitter.\n\nTo submit Inbox letters and Reader’s Features more easily, without the need to send an email, just use our Submit Stuff page here.\n\nFor more stories like this, check our Gaming page.","summary":"GameCentral takes a look at the biggest video game news stories of 2025 and what impact they'll have on the new year to come.","url":"https://metro.co.uk/2025/12/25/11-biggest-video-game-news-stories-2025-switch-2-gta-6-25506061/","image":"https://metro.co.uk/wp-content/uploads/2025/12/SEI_278107019-e9c8.jpg?quality=90&strip=all","video":null,"publish_date":"2025-12-25 01:00:00","author":"Michael Beckwith","authors":["Michael Beckwith"],"language":"en","source_country":"gb","sentiment":-0.14},{"id":388842034,"title":"Trump Touts ‘Clean, Beautiful Coal’ to Kid at Christmas","text":"President Donald Trump made it clear that getting coal for Christmas this year wasn’t all bad.\n\nAs the president and First Lady Melania Trump took calls from kids dialing the North American Aerospace Defense Command (NORAD) Santa Tracker hotline, Trump bragged about his “clean, beautiful coal.”\n\n“Not coal, no you don’t want coal... you mean clean, beautiful coal. I had to do that, I’m sorry,” Trump laughed.\n\n“No, coal is clean and beautiful. Please remember that at all costs,” he added. “But you don’t want clean, beautiful coal, right?”\n\nWhen the child confirmed, “no,” Trump asked, “What would you like?”\n\nThe child said they wanted Barbies, American Girl dolls, clothes, and candy.\n\nCalifornia Gov. Gavin Newsom, who has been trolling Trump for his erratic online posting for months, mocked the Trump administration for promoting coal this Christmas. \n\nTrump frequently touts coal as his preferred energy source as he rallies against clean energy sources, like wind farms. On Christmas, however, coal in one’s stocking is seen as a punishment by Santa for being naughty that year. \n\nAn eight-year-old girl later asked Trump if Santa would get mad if they did not leave out any cookies for him. Trump responded by calling Santa overweight.\n\n“I think he won’t get mad, but I think he’ll be very disappointed,” Trump replied. \n\n“Santa, he tends to be a little bit on the cherubic side,” he joked. “Do you know what cherubic means? A little on the heavy side. I think Santa would like some cookies.”\n\nTrump also touted his electoral successes in the state of Oklahoma as he took a call from a child there. \n\n“Santa loves you. Santa loves Oklahoma like I do. You know, Oklahoma was very good to me in the election. So I love Oklahoma. Don’t ever leave Oklahoma, OK?” he told the kid. \n\nThe child responded, “OK, I’ll try.”","summary":"Photo Illustration by Victoria Sunday/The Daily Beast/Getty ImagesPresident Donald Trump made it clear that getting coal for Christmas this year wasn’t all bad.\n\nAs the president and First Lady Melania Trump took calls from kids dialing the North American Aerospace Defense Command (NORAD) Santa Tracker hotline, Trump bragged about his “clean, beautiful coal.”\n\nWhen asked by Trump, 79, what he wanted Santa to bring him for Christmas, one child responded, “Uh, not coal.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-touts-clean-beautiful-coal-to-kids-at-christmas/","image":"https://www.thedailybeast.com/resizer/v2/4CH654VQVRF7LGUDUABQTTXY44.jpg?smart=true&auth=dd27f9fef66f54e37d694e8f7e76faff169ba9b1a87bddf1896c0f60a02dcca9&width=1440&height=1080","video":null,"publish_date":"2025-12-25 00:52:00","author":"Annabella Rosciglione","authors":["Annabella Rosciglione"],"language":"en","source_country":"us","sentiment":-0.416},{"id":388841554,"title":"Trump Says US Won't Allow \"Bad Santa\" Infiltration In Christmas Calls With Kids","text":"President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a \"bad Santa\" infiltrate the country and even suggesting that a stocking full of coal may not be so bad.Vacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participated in the tradition of talking to youngsters dialing into the North American Aerospace Defense Command, which playfully tracks Santa's progress around the globe.\"We want to make sure that Santa is being good. Santa's a very good person,\" Trump said while speaking to kids ages 4 and 10 in Oklahoma. \"We want to make sure that he's not infiltrated, that we're not infiltrating into our country a bad Santa.\"He didn't elaborate.Trump has often marked Christmases past with criticisms of his political enemies, including in 2024, when he posted, \"Merry Christmas to the Radical Left Lunatics.\" During his first term, Trump wrote online early on Dec. 24, 2017, targeting a top FBI official he believed was biased against him, as well as the news media.But Trump was in a jovial mood this time. He even said, I \"could do this all day long,\" but likely would have to get back to more pressing matters like efforts to quell the fighting in Russia's war with Ukraine.When an 8-year-old from North Carolina, asked if Santa would be mad if no one leaves cookies out for him, Trump said he didn't think so, \"But I think he'll be very disappointed.\"\"You know, Santa's — he tends to be a little bit on the cherubic side. You know what cherubic means? A little on the heavy side,\" Trump joked. \"I think Santa would like some cookies.\"The president and first lady Melania Trump sat side-by-side and took about a dozen calls between them. At one point, while his wife was on the phone and Trump was waiting to be connected to another call, he noted how little attention she was paying to him: \"She's able to focus totally, without listening.\"Asked by an 8-year-old girl in Kansas what she'd like Santa to bring, the answer came back, \"Uh, not coal.\"\"You mean clean, beautiful coal?,\" Trump replied, evoking a favored campaign slogan he's long used when promising to revive domestic coal production.\"I had to do that, I'm sorry,\" the president added, laughing and even causing the first lady, who was on a separate call, to turn toward him and grin.\"Coal is clean and beautiful. Please remember that, at all costs,\" Trump said. \"But you don't want clean, beautiful coal, right?\"\"No,\" the caller responded, saying she'd prefer a Barbie doll, clothes and candy.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"President Trump marked Christmas Eve by quizzing kids calling in about what presents they were excited about receiving, while promising to not let a \"bad Santa\" infiltrate country and even suggesting that a stocking full of coal may not be so bad.","url":"https://www.ndtv.com/world-news/donald-trump-says-us-wont-allow-bad-santa-infiltration-in-christmas-eve-calls-with-kids-9946232","image":"https://c.ndtvimg.com/2025-12/vesbriss_donald-trump_625x300_25_December_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-12-25 00:50:27","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":-0.182},{"id":388841182,"title":"Trump warns kids against infiltration by a &apos;bad Santa&apos;","text":"US President Donald Trump has marked Christmas Eve by quizzing children calling in about what presents they are excited about receiving, while promising not to let a \"bad Santa\" infiltrate the country and even suggesting a stocking full of coal might not be so bad. Holidaying at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participated in the tradition of talking to youngsters dialing into the North American Aerospace Defense Command, which playfully tracks Santa&apos;s progress around the globe. \"We want to make sure that Santa is being good. Santa&apos;s a very good person,\" Trump said while speaking to children aged four to 10 in Oklahoma. \"We want to make sure that he&apos;s not infiltrated, that we&apos;re not infiltrating into our country a bad Santa.\" He didn&apos;t elaborate. Trump has often marked Christmases past with criticisms of his political enemies, including in 2024, when he posted, \"Merry Christmas to the Radical Left Lunatics\". During his first term, Trump wrote online early on December 24, 2017, targeting a top FBI official he believed was biased against him, as well as the news media. But Trump was in a jovial mood this time. He even said he \"could do this all day long\", but likely would have to get back to more pressing matters like efforts to quell the fighting in Russia&apos;s war with Ukraine. When an eight-year-old from North Carolina asked if Santa would be mad if no one left cookies out for him, Trump said he didn&apos;t think so. \"But I think he&apos;ll be very disappointed,\" he said. \"You know, Santa&apos;s - he tends to be a little bit on the cherubic side. You know what cherubic means? A little on the heavy side,\" Trump joked. \"I think Santa would like some cookies.\" The president and first lady Melania Trump sat side-by-side and took about a dozen calls between them. At one point, while his wife was on the phone and Trump was waiting to be connected to another call, he noted how little attention she was paying to him: \"She&apos;s able to focus totally, without listening.\" Asked by an eight-year-old girl in Kansas what she&apos;d like Santa to bring, the answer came back, \"Uh, not coal.\" \"You mean clean, beautiful coal?\" Trump replied, evoking a favoured campaign slogan he&apos;s long used when promising to revive domestic coal production. \"I had to do that, I&apos;m sorry,\" the president added, laughing and even causing the first lady, who was on a separate call, to turn toward him and grin. \"Coal is clean and beautiful. Please remember that, at all costs,\" Trump said. \"But you don&apos;t want clean, beautiful coal, right?\" \"No,\" the caller responded, saying she&apos;d prefer a Barbie doll, clothes and candy. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9141764/trump-warns-kids-against-infiltration-by-a-bad-santa/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/1744e654-2348-4c90-8922-a0b72505f512.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-12-25 00:49:33","author":"Will Weissert","authors":["Will Weissert"],"language":"en","category":"politics","source_country":"au","sentiment":-0.171},{"id":388843816,"title":"Trump warns kids against infiltration by a &apos;bad Santa&apos;","text":"US President Donald Trump has marked Christmas Eve by quizzing children calling in about what presents they are excited about receiving, while promising not to let a \"bad Santa\" infiltrate the country and even suggesting a stocking full of coal might not be so bad. Holidaying at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participated in the tradition of talking to youngsters dialing into the North American Aerospace Defense Command, which playfully tracks Santa&apos;s progress around the globe. \"We want to make sure that Santa is being good. Santa&apos;s a very good person,\" Trump said while speaking to children aged four to 10 in Oklahoma. \"We want to make sure that he&apos;s not infiltrated, that we&apos;re not infiltrating into our country a bad Santa.\" He didn&apos;t elaborate. Trump has often marked Christmases past with criticisms of his political enemies, including in 2024, when he posted, \"Merry Christmas to the Radical Left Lunatics\". During his first term, Trump wrote online early on December 24, 2017, targeting a top FBI official he believed was biased against him, as well as the news media. But Trump was in a jovial mood this time. He even said he \"could do this all day long\", but likely would have to get back to more pressing matters like efforts to quell the fighting in Russia&apos;s war with Ukraine. When an eight-year-old from North Carolina asked if Santa would be mad if no one left cookies out for him, Trump said he didn&apos;t think so. \"But I think he&apos;ll be very disappointed,\" he said. \"You know, Santa&apos;s - he tends to be a little bit on the cherubic side. You know what cherubic means? A little on the heavy side,\" Trump joked. \"I think Santa would like some cookies.\" The president and first lady Melania Trump sat side-by-side and took about a dozen calls between them. At one point, while his wife was on the phone and Trump was waiting to be connected to another call, he noted how little attention she was paying to him: \"She&apos;s able to focus totally, without listening.\" Asked by an eight-year-old girl in Kansas what she&apos;d like Santa to bring, the answer came back, \"Uh, not coal.\" \"You mean clean, beautiful coal?\" Trump replied, evoking a favoured campaign slogan he&apos;s long used when promising to revive domestic coal production. \"I had to do that, I&apos;m sorry,\" the president added, laughing and even causing the first lady, who was on a separate call, to turn toward him and grin. \"Coal is clean and beautiful. Please remember that, at all costs,\" Trump said. \"But you don&apos;t want clean, beautiful coal, right?\" \"No,\" the caller responded, saying she&apos;d prefer a Barbie doll, clothes and candy. Australian Associated Press","url":"https://www.canberratimes.com.au/story/9141764/trump-warns-kids-against-infiltration-by-a-bad-santa/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/1744e654-2348-4c90-8922-a0b72505f512.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-12-25 00:49:33","author":"Will Weissert","authors":["Will Weissert"],"language":"en","category":"politics","source_country":"au","sentiment":-0.171},{"id":388839768,"title":"Trump warns against infiltration by a ‘bad Santa,’ defends coal in jovial Christmas calls with kids","text":"WEST PALM BEACH, Fla. — U.S. President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participated in the tradition of talking to youngsters dialing into the North American Aerospace Defense Command, which playfully tracks Santa’s progress around the globe.\n\n“We want to make sure that Santa is being good. Santa’s a very good person,” Trump said while speaking to kids ages 4 and 10 in Oklahoma. “We want to make sure that he’s not infiltrated, that we’re not infiltrating into our country a bad Santa.”\n\nHe didn’t elaborate.\n\nTrump has often marked Christmases past with criticisms of his political enemies, including in 2024, when he posted, “Merry Christmas to the Radical Left Lunatics.” During his first term, Trump wrote online early on Dec. 24, 2017, targeting a top FBI official he believed was biased against him, as well as the news media.\n\nShortly after wrapping up Wednesday’s Christmas Eve calls, in fact, he returned to that theme, posting: “Merry Christmas to all, including the Radical Left Scum that is doing everything possible to destroy our Country, but are failing badly.”\n\nBut Trump was in a jovial mood while talking with the kids. He even said at one point that he “could do this all day long” but likely would have to get back to more pressing matters like efforts to quell the fighting in Russia’s war with Ukraine.\n\nWhen an 8-year-old from North Carolina, asked if Santa would be mad if no one leaves cookies out for him, Trump said he didn’t think so, “But I think he’ll be very disappointed.”\n\n“You know, Santa’s -- he tends to be a little bit on the cherubic side. You know what cherubic means? A little on the heavy side,” Trump joked. “I think Santa would like some cookies.”\n\nThe president and first lady Melania Trump sat side-by-side and took about a dozen calls between them. At one point, while his wife was on the phone and Trump was waiting to be connected to another call, he noted how little attention she was paying to him: “She’s able to focus totally, without listening.”\n\nAsked by an 8-year-old girl in Kansas what she’d like Santa to bring, the answer came back, “Uh, not coal.”\n\n“You mean clean, beautiful coal?” Trump replied, evoking a favored campaign slogan he’s long used when promising to revive domestic coal production.\n\n“I had to do that, I’m sorry,” the president added, laughing and even causing the first lady, who was on a separate call, to turn toward him and grin.\n\n“Coal is clean and beautiful. Please remember that, at all costs,” Trump said. “But you don’t want clean, beautiful coal, right?”\n\n“No,” the caller responded, saying she’d prefer a Barbie doll, clothes and candy.\n\nWill Weissert, The Associated Press\n\nAssociated Press writer Darlene Superville contributed from Washington.","url":"https://www.ctvnews.ca/world/article/trump-warns-against-infiltration-by-a-bad-santa-defends-coal-in-jovial-christmas-calls-with-kids/","image":"https://www.ctvnews.ca/resizer/v2/Q2N4OJMPYRGPQ4SUBXWP2VI2ZU.jpg?auth=76c920380323f7cb8b396b043073482e76e42d390268ba4188fafd257209dada","video":null,"publish_date":"2025-12-25 00:30:13","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.175},{"id":388843930,"title":"U.S. to Retain or Sell Venezuelan Oil, Says Trump","text":"The U.S. government’s decision regarding Venezuelan oil, as announced by former President Donald Trump, has ignited significant debate across international arenas. This announcement, focusing on the retention or sale of oil seized from Venezuela, highlights the ongoing complexities and geopolitical tensions surrounding the resource-rich South American nation.\n\nBackground on U.S.-Venezuelan Relations\n\nFor years, relations between the United States and Venezuela have been fraught with tension. The U.S. has imposed numerous sanctions on Venezuela, criticizing its government for undemocratic practices and human rights violations. Venezuela, one of the world’s largest oil producers, has historically been a critical player in the global oil market, adding layers of complexity to any international relations.\n\nHistorically, the U.S. imported a significant amount of oil from Venezuela. However, as political and economic instability gripped the nation, these imports have dwindled. The situation grew more strained as the U.S. recognized opposition leader Juan Guaidó as Venezuela’s interim president, exacerbating tensions with Nicolás Maduro’s administration.\n\nThe Economic Implications\n\nThe decision to retain or sell Venezuelan oil seized during the tensions poses several economic implications. On one hand, keeping the oil could help stabilize U.S. domestic oil prices, offering a buffer in the volatile global oil market. On the other, selling it could initiate contentious political reactions, affecting U.S. relations with both allies and adversaries.\n\nDomestic Impact on Oil Prices\n\nThe potential retention of Venezuelan oil by the U.S. is likely to play a role in regulating domestic oil prices. By influencing the supply side, the U.S. could potentially dampen any price surges that might arise from international disruptions. This could be particularly beneficial as energy consumption continues to rise globally.\n\nInternational Reactions and Market Dynamics\n\nOn the global stage, such a move by the U.S. might not only affect bilateral relations with Venezuela but also with other oil-producing nations. Countries with vested interests in Venezuelan oil could view this act as an assertion of U.S. dominance over strategic resources. Such actions might lead to retaliatory economic measures or shifts in alliance dynamics, further complicating international trade and diplomacy.\n\nPolitical Ramifications\n\nIn addition to economic impacts, Trump’s announcement carries significant political weight. The action can be seen as a continuation of the U.S.’s hardline stance against Maduro’s government. It also reflects a pattern of using economic resources as tools for political pressure.\n\nDomestically, this decision might resonate with different factions. Supporters of a firmer stance against what is perceived as a dictatorship might applaud, seeing it as a necessary step to promote democracy. However, critics might argue that such moves further entrench hostility and hinder diplomatic efforts to resolve the crisis.\n\nResponses from the International Community\n\nGlobally, reactions have been varied. Some nations might back the U.S. decision, aligning with its stance on human rights and governance in Venezuela. Others might view it as an overreach or an unnecessary imperialist maneuver, potentially fragmenting international consensus on how to manage relations with Venezuela.\n\nWithin Venezuela, such actions could fuel nationalistic sentiments, with government officials using the incident as evidence of external meddling to rally domestic support. For the Venezuelan populace, already enduring economic hardships, the situation might further complicate efforts to secure better living conditions.\n\nThe Trump administration’s announcement regarding the Venezuelan oil has put a spotlight on the intertwined nature of geopolitics, economics, and domestic policy. As the world watches closely, the eventual outcomes of this decision will likely be felt not only in oil markets but also in the diplomatic corridors across the globe. As discussions unfold, this scenario will undoubtedly serve as a pivotal moment in the ongoing narrative of U.S.-Venezuelan relations.","summary":"The U.S. government's move—announced by former President Donald Trump—to either retain or sell seized Venezuelan oil has reignited global debate over the volatile relationship between the two nations. With implications for global oil markets, international diplomacy, and domestic politics, the decision places the U.S. at a critical crossroads. Will this assertive stance stabilize oil prices and bolster democracy abroad, or stir new tensions and deepen international divides? The far-reaching consequences of this choice are just beginning to unfold.","url":"https://www.czechjournal.cz/u-s-to-retain-or-sell-venezuelan-oil-says-trump/","image":"https://www.czechjournal.cz/wp-content/uploads/2025/12/U.S.-to-Retain-or-Sell-Venezuelan-Oil-Says-Trump.jpg","video":null,"publish_date":"2025-12-25 00:25:16","author":"Kristina Vankova","authors":["Kristina Vankova"],"language":"en","category":"politics","source_country":"cz","sentiment":0.128},{"id":388841076,"title":"Donald Trump Says &#039;Merry Christmas to All, Including Radical Left Scum&#039;","text":"President Donald Trump used a Christmas message on social media to praise what he described as strong economic and security gains under his administration, while sharply criticizing political opponents in a post that mixed holiday greetings with campaign-style rhetoric. The president posted on Truth Social Wednesday night, “Merry Christmas to all, including the Radical Left Scum that is doing everything possible to destroy our Country, but are failing badly. We no longer have Open Borders, Men in Women’s Sports, Transgender for Everyone, or Weak Law Enforcement. What we do have is a Record Stock Market and 401K’s, Lowest Crime numbers in decades, No Inflation, and yesterday, a 4.3 GDP, two points better than expected. Tariffs have given us Trillions of Dollars in Growth and Prosperity, and the strongest National Security we have ever had. We are respected again, perhaps like never before. God Bless America!!! President DJT“ This is a breaking news story. Updates to follow. President Donald Trump speaks during a NORAD, North American Aerospace Defense Command, Tracks Santa Operation call at his Mar-a-Lago club, Wednesday, Dec. 24, 2025, in Palm Beach, Fla. (AP Photo/Alex Brandon)","summary":"Trump mixes Christmas wishes with attacks, touting economic growth, tariffs and what he called strong national security.","url":"https://www.newsweek.com/trump-christmas-message-economic-critics-truth-social-11269238","image":"https://assets.newsweek.com/wp-content/uploads/2025/12/AP25358811649866.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-12-25 00:24:37","author":"Gabe Whisnant,Peter Aitken","authors":["Gabe Whisnant","Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":0.173},{"id":388839698,"title":"Palau to take up to 75 migrants from US","text":"US President Donald Trump's immigration policies have been broadly condemned by human rights advocates on concerns about due process. (EPA Images pic)\nWASHINGTON: Palau will take up to 75 migrants from the US as the Pacific Island nation signed a memorandum of understanding with Washington on transfer of third-country nationals in return for additional US aid.\nUS Deputy secretary of state Christopher Landau spoke to Palau President Surangel Whipps in a call on Tuesday about transferring third-country nationals to Palau, the two sides said in separate statements, even as Palau's lawmakers had rejected a previous request from Washington on the matter.\nPresident Donald Trump's immigration policies, including his administration's deportation drive, have been broadly condemned by human rights advocates on concerns about due process. The Trump administration has also sent hundreds of people to third countries to which they have no ties, a tactic that was rarely used in the past.\nTrump has said the measures are aimed at improving domestic security.\nPalau and the US signed an MOU \"allowing up to 75 third country nationals, who have never been charged with a crime, to live and work in Palau, helping address local labor shortages in needed occupations,\" the office of Palau's president said.\n\"In this regard, the United States granted US$7.5 million to address the needs of relevant Palau public services,\" the US statement said.\nThe US State Department and Palau also said Washington will give assistance of US$2 million to provide advisors to Palau who will help in security issues and an assistance of US$6 million for reforms related to Palau's civil service pension plan.\nIn late July, Palau's Congress said it \"cannot accept\" a US proposal for it to accept asylum seekers from other countries.\nPalau, with a population of 17,000, has a compact of free association with the US, which provides economic assistance in return for allowing American military access to its territory.\nPalau is not a signatory to the 1951 UN Refugee Convention.\nUS Catholic bishops have condemned Washington's immigration enforcement activities and in October, Pope Leo XIV lamented the mistreatment of immigrants.\nLast week, a federal judge signaled a willingness to again rule that the Trump administration cannot swiftly deport migrants to countries other than their own without providing meaningful notice and an opportunity for them to raise fears of persecution or torture if they are sent there.","summary":"The Pacific Island nation signed a memorandum of understanding with Washington on the transfer of third-country nationals in return for US aid.","url":"https://www.freemalaysiatoday.com/category/world/2025/12/25/palau-to-take-up-to-75-migrants-from-us","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/2731ed21-donald-trump-27112025.webp","video":null,"publish_date":"2025-12-25 00:24:23","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.105},{"id":388838598,"title":"CBS slips Trump's name into Kennedy Center Honors broadcast via voiceover amid rebranding controversy","text":"While the Kennedy Center Honors held its annual ceremony before the prestigious institution's board voted to add President Donald Trump's name to its title, CBS still found a way to honor the controversial name-change during its broadcast.\n\n When the ceremony, which took place in Washington D.C. on Dec. 7, aired Tuesday evening on CBS, the network added a voiceover declaring, \"And now, the Trump Kennedy Center Honors on CBS,\" while a title card flashed reading, \"The following is a Donald J. Trump and Kennedy Center Production.\"\n\n Trump then took the stage, becoming the first sitting president to host the ceremony. But according to The Washington Post, CBS significantly cut Trump's 12-minute opening monologue to a mere two minutes, removing a joke about the crowd being full of \"miserable, horrible people.\"\n\n The network's news division also reportedly implemented a policy to omit Trump's name from the Kennedy Center name in ongoing coverage, according to the Post. \n\n \"On Tuesday, CBS will broadcast the annual Kennedy Center Honors,\" wrote CBS News senior director of standards and practices Jack Renaud in an email to his colleagues, which the Post says it obtained ahead of the ceremony. \"Yesterday, the newly appointed board of the Kennedy Center voted to change the facility's name to the Trump-Kennedy Center... But it would take Congressional approval to officially change the name.\"\n\n Renaud then concluded, according to the outlet, \"Therefore, CBS News will continue to use the 'Kennedy Center,'\" adding that \"if the president or other administration officials use the new name in a soundbite, that is their prerogative.\"\n\n Entertainment Weekly has reached out to representatives for the White House and CBS.\n\n Trump has made much of the Kennedy Center name change after the institution's board \"voted unanimously\" to approve it, as White House Press Secretary Karoline Leavitt noted in a Dec. 18 social media post. But Ohio Congresswoman Joyce Beatty, who sits on the board, disputed that claim, saying she was prevented from casting her true vote.\n\n \"For the record. This was not unanimous,\" she explained in a response to Leavitt's post. \"I was muted on the call and not allowed to speak or voice my opposition to this move. Also, for the record, this was not on the agenda. This was not consensus. This is censorship.\"\n\n Still, Trump trumpeted the broadcast of the \"TRUMP KENNEDY CENTER HONORS\" in a post to his Truth Social platform on Tuesday, hours before the ceremony was to take place.\n\n Get your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.\n\n This is the latest development in the ongoing conflict between Trump and CBS. The network's parent company, Paramount Global, agreed in July to pay the president $16 million to settle his lawsuit over the editing of a 60 Minutes interview with his 2024 presidential opponent, Kamala Harris. That same month, the network made the unprecedented move of axing The Late Show With Stephen Colbert, following Trump's continuous criticism of its host.\n\n Some critics characterized the move as Paramount's attempt to silence one of the president's most prominent critics ahead of their bid to merge with Skydance Media, which was founded by Trump backer David Ellison.\n\n The effects of a new, Trump-friendly regime at Paramount can already be felt at CBS News, which landed in hot water this month after new boss Bari Weiss pulled a segment covering the Trump administration's new policy of deporting Venezuelan men to CECOT, a notorious, maximum-security prison in El Salvador.\n\n Longtime 60 Minutes correspondent Sharyn Alfonsi slammed the decision as \"political,\" warning that even the venerable investigative news program now faces the prospect of going \"from an investigative powerhouse to a stenographer for the state.\"","summary":"Trump became the first sitting president to preside over the annual ceremony, which has become embroiled in controversy over his push to add his name to the institution's title.","url":"https://ew.com/cbs-adds-trump-kennedy-center-honors-broadcast-voiceover-rebranding-controversy-11876030","image":"https://ew.com/thmb/zhk52k3ESI0kEo1qRBuopFR2bzo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Donald-Trump-48TH-ANNUAL-KENNEDY-CENTER-HONORS-2025-122425-11f2c34aa627475592e0e4e9d911a22d.jpg","video":null,"publish_date":"2025-12-25 00:21:42","author":"Ryan Coleman","authors":["Ryan Coleman"],"language":"en","source_country":"US","sentiment":-0.066},{"id":388839774,"title":"Kennedy Center Christmas Eve concert cancelled over Trump’s name","text":"NEW YORK — A planned Christmas Eve jazz concert at the Kennedy Center, a holiday tradition dating back more than 20 years, has been cancelled. The show’s host, musician Chuck Redd, says that he called off the performance in the wake of the White House announcing last week that U.S. President Donald Trump’s name would be added to the facility. \n\nAs of last Friday, the building’s facade reads The Donald J. Trump and The John F. Kennedy Memorial Center for the Performing Arts. According to the White House, the president’s handpicked board approved the decision, which scholars have said violates the law. Trump had been suggesting for months he was open to changing the center’s name.\n\n“When I saw the name change on the Kennedy Center website and then hours later on the building, I chose to cancel our concert,” Redd told The Associated Press in an email Wednesday. Redd, a drummer and vibraphone player who has toured with everyone from Dizzy Gillespie to Ray Brown, has been presiding over holiday “Jazz Jams” at the Kennedy Center since 2006, succeeding bassist William “Keter” Betts.\n\nThe Kennedy Center did not immediately respond to email seeking comment. The center’s website lists the show as canceled. \n\nPresident Kennedy was assassinated in 1963, and Congress passed a law the following year naming the center as a living memorial to him. Kennedy niece Kerry Kennedy has vowed to remove Trump’s name from the building once he leaves office and former House historian Ray Smock is among those who say any changes would have to be approved by Congress. \n\nThe law explicitly prohibits the board of trustees from making the center into a memorial to anyone else, and from putting another person’s name on the building’s exterior. \n\nTrump, a Republican, has been deeply involved with the center named for an iconic Democrat after mostly ignoring it during his first term. He has forced out its leadership, overhauled the board while arranging for himself to head it, and personally hosted this year’s Kennedy Center honors, breaking a long tradition of presidents mostly serving as spectators. The changes at the Kennedy Center are part of the president’s larger mission to fight “woke” culture at federal cultural institutions.\n\nNumerous artists have called off Kennedy Center performances since Trump returned to office, including Issa Rae and Peter Wolf. Lin-Manuel Miranda canceled a planned production of “Hamilton.”\n\nHillel Italie, The Associated Press","url":"https://www.ctvnews.ca/world/article/kennedy-center-christmas-eve-concert-cancelled-over-trumps-name/","image":"https://www.ctvnews.ca/resizer/v2/C5PDSVIAYFCMVHWIEYSEIADBIU.jpg?auth=690ade64be32a98b2cd8fd716b598c158bed186b70827e37f727613b556a1e54","video":null,"publish_date":"2025-12-25 00:21:21","author":"Robert Berks","authors":["Robert Berks"],"language":"en","source_country":"ca","sentiment":-0.111},{"id":388839216,"title":"Donald Trump Takes Call from Child for Christmas, Brags About Winning Pennsylvania 'Actually Three Times'","text":"President Donald Trump bragged about his election victories while taking calls from children on Christmas Eve.\n\n On Wednesday, Dec. 24, the president and first lady Melania Trump celebrated Christmas at Mar-a-Lago in Palm Beach, Fla. There, they participated in NORAD Santa Claus calls, accepting calls from children across the nation.\n\n When a child from Pennsylvania called, Trump, 79, told him his home state was \"great.\"\n\n “We won Pennsylvania — actually, three times,” the president continued. “We won it in a landslide. So I love Pennsylvania.”\n\n Trump did win Pennsylvania in the 2016 and 2024 elections, but not in 2020.\n\n In 2016, he earned 48.2% of the votes, while Hillary Clinton earned 47.5%, per The New York Times. Four years later, former President Joe Biden won the state by a 1.17% margin, the Pennsylvania Capital-Star reported.\n\n In 2024, Trump defeated former Vice President Kamala Harris, after earning 3,543,308 votes, while Harris received 3,423,042, per The New York Times.\n\n Trump also told a child from Oklahoma that their state was \"very good to me in the election,\" and that they should \"never leave Oklahoma.\" (Trump won Oklahoma in three consecutive presidential elections, and the state hasn't gone to a Democrat since 1964.)\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \n\n The president’s comments this holiday season follow his newsworthy Christmas conversation during his first term. In 2018, he spoke with Collman Lloyd, a 7-year-old girl from South Carolina, who talked about her plan to leave Santa Claus treats, according to a video obtained by Post and Courier and WISTV.\n\n But the president had an unusual response, saying, “Well, you just have a good time. Are you still a believer in Santa?” She confirmed she did, and he responded, “Because at 7, it’s marginal, right?” \n\n Trump's comments on Wednesday are similar to his remarks in November about West Virginia following the death of U.S. Army Specialist Sarah Beckstrom.\n\n The 20-year-old West Virginia National Guard member and Staff Sgt. Andrew Wolfe, 24, were shot and killed near the White House on Nov. 26. When Trump was asked if he would attend Beckstrom’s funeral, he commented on her home state. \n\n “I hadn’t thought about it yet, but it certainly is something I could conceive of,” Trump replied, then adding, “I love West Virginia. You know I won West Virginia by one of the biggest margins of any president anywhere.\" \n\n “These are great people. I love the people of West Virginia. I love the people of our country,\" he said. \"But I haven't given it any thought, but it sounds like something I could do.”\n\n Although Trump did not attend Beckstrom's funeral on Dec. 9, he did offer invitations to both soldiers’ parents to visit the White House, NBC News reported. Wolfe's family visited Trump on Dec. 4 and posed for a picture with him in the Oval Office.","summary":"While Trump won Pennsylvania in 2016 and 2024, former President Joe Biden won the state in 2020","url":"https://people.com/donald-trump-calls-child-christmas-brags-about-winning-pennsylvania-11876057","image":"https://people.com/thmb/VAHsNZLdlVbniHzoQ8WgAup1ZU0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(721x363:723x365)/Donald-Trump-NORAD-Santa-Calls-2025-122425-75da5b1c77784511b0dcb55b479de03d.jpg","video":null,"publish_date":"2025-12-25 00:18:30","author":"Charna Flam","authors":["Charna Flam"],"language":"en","source_country":"US","sentiment":-0.178},{"id":388842042,"title":"DOJ Says ‘Million More’ Epstein Files Coming—But With Delays","text":"The Department of Justice teased a fresh dump of “over a million” more Epstein files—but didn’t provide a release date.\n\nThe embattled agency led by Pam Bondi announced on Wednesday that it received “over a million more documents potentially related to the Jeffrey Epstein case” from the FBI and the U.S. Attorney for the Southern District of New York.\n\n“We will release the documents as soon as possible,” it said in an X post. “Due to the mass volume of material, this process may take a few more weeks.”\n\nThe vague announcement quickly drew backlash, with Democrats in the House Oversight Committee, who have been leading the charge to release the highly anticipated documents related to the convicted sex offender, crying cover-up.\n\n“The White House is openly engaged in a cover-up protecting Epstein’s co-conspirators and the powerful men who abused women and girls,” California Rep. Robert Garcia said. “It’s outrageous that the DOJ has illegally withheld over 1 million documents from the public.”\n\nGarcia also called on Bondi, 60, to testify to Congress “to explain herself” over the release, which was supposed to have been completed by the Dec. 19 deadline under the Epstein Files Transparency Act.\n\nThe White House and the Justice Department did not immediately return a request for comment on Wednesday.\n\nLawmakers on both sides of the aisle amped up the pressure on President Donald Trump to sign off on the release of the Epstein files last month.\n\nKentucky Republican Thomas Massie and California Democrat Ro Khanna—the leaders of the bipartisan push for the Epstein files release—earlier said they planned to pursue legal action against Bondi over the Justice Department’s failure to meet the Dec. 19 deadline.\n\nTodd Blanche, Bondi’s deputy attorney general, was unfazed by the threat during an interview on NBC’s Meet the Press.\n\n“Bring it on,” he said Sunday. “We are doing everything we’re supposed to be doing to comply with this statute.”\n\nAn official told Axios that about 750,000 records have so far been reviewed and released by a team of some 200 people.\n\nAnother 700,000 are in the pipeline, the official added, but cautioned that many of these records are duplicates.","summary":"Andrew Harnik / Andrew Harnik/Getty ImagesThe Department of Justice teased a fresh dump of “over a million” more Epstein files—but didn’t provide a release date.\n\nThe embattled agency led by Pam Bondi announced on Wednesday that it received “over a million more documents potentially related to the Jeffrey Epstein case” from the FBI and the U.S. Attorney for the Southern District of New York.\n\nThe Justice Department said it was working “around the clock” to review the new tranche of files and make redactions to protect victims.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/doj-says-million-more-epstein-files-comingbut-with-delays/","image":"https://www.thedailybeast.com/resizer/v2/3AK5BXXVYVCYFPTPWQTQ73GRAY.jpg?smart=true&auth=dc57513cf7d4a8a397a14dd889950b33edce0ebcead758d84e33b5ca28fa2ebd&width=1440&height=1080","video":null,"publish_date":"2025-12-25 00:15:00","author":"Julia Ornedo","authors":["Julia Ornedo"],"language":"en","source_country":"us","sentiment":-0.573},{"id":388838012,"title":"World News | Uncovered Million More Documents Potentially Related to Jeffrey Epstein: US Department of Justice","text":"Washington DC [US], December 25 (ANI): The United States Department of Justice on Wednesday (local time) stated that it uncovered over a million additional documents \"potentially related\" to the Jeffrey Epstein case.\nIn an X post, the DOJ said that these documents will be released in the coming weeks.\nAlso Read | South Carolina Shocker: Disabled Girl Dies in Heat After Mother Locks Her In Hot Car While Having S*x With Boyfriend.\n\"The US Attorney for the Southern District of New York and the FBI have informed the Department of Justice that they have uncovered over a million more documents potentially related to the Jeffrey Epstein case. The DOJ has received these documents from SDNY and the FBI to review them for release, in compliance with the Epstein Files Transparency Act, existing statutes, and judicial orders. We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible. Due to the mass volume of material, this process may take a few more weeks. The Department will continue to fully comply with federal law and President Trump's direction to release the files,\" DOJ said. https://x.com/TheJusticeDept/status/2003901580341334257\nAlso Read | Moscow Explosion: 3 Killed, Including 2 Police Officers, in Blast on Yeletskaya Street In Russia.\nEarlier on Tuesday (local time), the Department of Justice released 30,000 more pages of documents related to Jeffrey Epstein, while noting that some of these documents contain \"untrue\" claims made against President Donald Trump.\nIn an X post, the DOJ claimed that the documents against Donald Trump are \"false\" and would have been \"weaponised\" against him.\n\"The Department of Justice has officially released nearly 30,000 more pages of documents related to Jeffrey Epstein. Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponised against President Trump already. Nevertheless, out of our commitment to the law and transparency, the DOJ is releasing these documents with the legally required protections for Epstein's victims,\" the DOJ wrote on X.\nA 2021 subpoena to the Mar-a-Lago Club, founded by Trump in 1995, is also among the documents, as reported by CNN. The subpoena relates to a probe into Epstein's former girlfriend and convicted accomplice, Ghislaine Maxwell.\nThe documents also include a letter signed by \"J Epstein,\" which was sent to convicted sex offender Larry Nassar in the same month Epstein died by suicide in 2019. The letter, as reported by CNN, makes references to Trump without explicitly naming him. The letter contains the phrase \"our president.\"\nHowever, the DOJ said that the Federal Bureau of Investigation (FBI) has confirmed that the letter is fake. DOJ noted that writing in the letter does not appear to match that of Epstein's, and the letter was postmarked three days after his death.\nThe US had passed the Epstein Files Transparency Act last month, prompting the DOJ to release documents related to Epstein, who was charged as a sex offender. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  In an X post, the DOJ said that these documents will be released in the coming weeks.","url":"https://www.latestly.com/agency-news/world-news-uncovered-million-more-documents-potentially-related-to-jeffrey-epstein-us-department-of-justice-7251018.html","image":"https://st1.latestly.com/wp-content/uploads/2025/12/ANI-20251224211212.jpg","video":null,"publish_date":"2025-12-25 00:12:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.461},{"id":388842604,"title":"India-US ties: Envoy Vinay Kwatra meets US Ambassador-designate Sergio Gor at Mar-a-Lago; trade talks in focus","text":"NEW DELHI: India’s Ambassador to the United States, Vinay Mohan Kwatra, held talks with US Ambassador to India Sergio Gor at Mar-a-Lago in Florida, focusing on strengthening trade ties and the broader bilateral partnership between the two countries.In a post on X, Kwatra said he was “happy to connect” with Gor at Mar-a-Lago and that the two had extensive discussions on their shared goal of strengthening trade ties. He added that they also spoke about Gor’s plans and priorities for the India-US bilateral partnership as he prepares to assume his responsibility as the US Ambassador to India.Gor, in a separate post on X, said it was “always a pleasure” to meet India’s Ambassador to the US and noted that this was Kwatra’s first visit to Mar-a-Lago. Mar-a-Lago is US President Donald Trump’s residence.The interaction comes amid ongoing trade talks between India and the United States. India is close to finalising a trade deal with the US against the backdrop of tariffs imposed on the import of Indian goods.Trump is currently at Mar-a-Lago for the Christmas holidays, as per news agency PTI.According to PTI, he arrived at his Palm Beach residence over the weekend and is scheduled to participate in NORAD Santa Calls and interact with service members. Gor also shared a post earlier this week about hosting Bhutanese Prime Minister Tshering Tobgay during his visit to FloridaUS Embassy and Consulates in India will remain closed from December 24 to December 26, 2025, in line with a Presidential Executive Order. The embassy said routine consular services will not be available during this period.Kwatra recently also praised Isro for the successful launch of the LVM3-M6 mission, calling it a milestone for India-US cooperation in the space sector, underscoring the expanding scope of the bilateral partnership beyond trade.","url":"https://timesofindia.indiatimes.com/india/india-us-ties-envoy-vinay-kwatra-meets-us-ambassador-designate-sergio-gor-at-mar-a-lago-trade-talks-in-focus/articleshow/126168845.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-126168852/126168852.jpg","video":null,"publish_date":"2025-12-25 00:11:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.068},{"id":388839060,"title":"'He's a dead man walking': Donald Trump escalates attacks on late-night TV, targets Stephen Colbert","text":"US President Donald Trump renewed his attacks on late-night television, targeting The Late Show host Stephen Colbert in a series of posts while accusing network programming of being hostile towards him.\n\nWriting on his social media platform Truth Social, Donald Trump labelled Stephen Colbert “a pathetic trainwreck” and claimed the comedian’s ratings were “nonexistent”. He also described Colbert as a “dead man walking” and urged CBS executives to “put him to sleep”.\n\nDonald Trump later widened his criticism to late-night shows across major US networks, asking whether CBS, ABC or NBC had the “worst” host. He claimed, without providing evidence, that such programmes come with “high salaries” and “really low ratings”.\n\nThe US President then escalated his rhetoric by floating the idea of regulatory action. In another post, Donald Trump questioned whether broadcast licences should be revoked when network news bulletins and late-night shows are “almost 100% negative” towards him, the MAGA movement and the Republican Party.\n\nThe comments came after CBS aired a repeat of a December episode of The Late Show with Stephen Colbert just hours after broadcasting the Kennedy Center Honors, an event hosted by Donald Trump. Stephen Colbert, 61, is set to step down from the programme in May 2026, with CBS saying the decision to end the show was driven by financial considerations.\n\nDonald Trump has previously welcomed the programme’s planned conclusion. In July, he wrote that he “absolutely loved” the cancellation and issued warnings to other hosts, including Jimmy Kimmel. He also singled out Greg Gutfeld for praise, saying he was “better than all of them combined.”","url":"https://www.moneycontrol.com/world/he-s-a-dead-man-walking-donald-trump-escalates-attacks-on-late-night-tv-targets-stephen-colbert-article-13742111.html","image":"https://images.moneycontrol.com/static-mcnews/2025/12/20251225000908_trumpeu.png","video":null,"publish_date":"2025-12-25 00:09:48","author":"Moneycontrol World Desk","authors":["Moneycontrol World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.225},{"id":388838010,"title":"World News | Israel Accuses Hamas of Violating Trump's 20-point Ceasefire","text":"Tel Aviv [Israel], December 25 (ANI): Israeli Prime Minister Benjamin Netanyahu on Wednesday said that Hamas \"continued to violate the 20-point peace plan\" advocated by US President Donald Trump.\nNetanyahu further said that Israel will respond accordingly.\nAlso Read | South Carolina Shocker: Disabled Girl Dies in Heat After Mother Locks Her In Hot Car While Having S*x With Boyfriend.\nIn a post on X, he said, \"The Hamas terror organization continues to violate the ceasefire and President Trump's 20 point plan. Their ongoing and continuing public refusal to disarm is an ongoing flagrant violation and again today their violent intentions and violations were confirmed by their detonation of an IED that wounded an IDF officer. Hamas must be held to the agreement that they signed on which includes removal from governance, demilitarization and de-radicalization. Israel will respond accordingly.\"\nhttps://x.com/netanyahu/status/2003811005147533668?s=20\nAlso Read | Moscow Explosion: 3 Killed, Including 2 Police Officers, in Blast on Yeletskaya Street In Russia.\nIt is unclear whether the bomb was recently planted in the area by terror operatives or if it was an old explosive device. The English-language statement comes days before Netanyahu is set to fly to Florida to meet with US President Donald Trump to discuss the next steps in the fragile Gaza ceasefire, The Times of Israel reported. Israel vowed on Wednesday to respond to an incident in southern Gaza's Rafah in which a bomb exploded against an Israeli armored personnel carrier, lightly injuring an IDF officer.\nThe officer, who serves in the Golani Brigade, was taken to a hospital, and his family was notified, the army said, as per The Times of Israel.\nThe Israel Defense Forces said the Namer APC that was hit was involved in efforts to clear Rafah's Jenina neighborhood -- located on the Israeli side of the Yellow Line -- of Hamas infrastructure.\nDozens of Hamas operatives are believed to have been holed up in tunnels in Jenina, though the army has reported killing or capturing many of them, as per The Times of Israel.\nIsrael and Hamas have repeatedly accused each other of violating the US-brokered ceasefire plan that halted two years of war triggered by the Hamas-led invasion of southern Israel on October 7, 2023.\nThe first phase of the truce stopped the fighting, but occasional deadly clashes have continued, mostly along the so-called Yellow Line that divides Hamas and Israeli-held territory, The Times of Israel reported. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Netanyahu further said that Israel will respond accordingly.","url":"https://www.latestly.com/agency-news/world-news-israel-accuses-hamas-of-violating-trumps-20-point-ceasefire-7251014.html","image":"https://st1.latestly.com/wp-content/uploads/2025/12/ANI-20251224201553.jpg","video":null,"publish_date":"2025-12-25 00:08:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.393},{"id":388841336,"title":"Christmas Eve Bombshell: DOJ Discovers Million-File Epstein Cache, Delays Full Disclosure","text":"In a stunning eleventh-hour development, the United States Department of Justice (DOJ) announced on Wednesday that federal investigators have uncovered more than one million additional documents potentially linked to the late sex offender Jeffrey Epstein. The disclosure, made via a statement on social media site X, revealed that the US Attorney’s Office for the Southern District of New York and the FBI recently identified this massive trove of new material. This discovery has effectively halted the timeline for a full public disclosure, with the DOJ stating it may now take a “few more weeks” to process the files for release.\nThe announcement comes at a period of intense political friction. The Epstein Files Transparency Act, signed into law by President Donald Trump in November 2025, had mandated a hard deadline of December 19 for the release of all unclassified records. While the DOJ began a staggered rollout last Friday, it has faced bipartisan backlash for missing the total disclosure deadline and for the extensive redactions applied to the initial batches. The “Christmas Eve news dump” of a million further records has intensified these criticisms. Senate Minority Leader Chuck Schumer characterised the delay as a “blatant cover-up”, while Representative Ro Khanna and Representative Thomas Massie have threatened to initiate contempt hearings against Attorney General Pam Bondi.\nThe Justice Department has defended the delay by emphasising the legal and ethical necessity of protecting survivors. A team of approximately 200 analysts is reportedly working “around the clock” to review the new documents, which originate from decades of FBI surveillance and Manhattan-based federal prosecutions. Officials noted that the review process is exceptionally slow because many of the records contain the names of victims and sensitive grand jury testimony that require painstaking manual redaction.\nBefore this latest discovery, the DOJ had already released several thousand files, including never-before-seen grand jury transcripts and photographs from Epstein’s properties. However, many of those documents were heavily blacked out, particularly in sections referring to “politically exposed individuals”. With the volume of material now exceeding 4.6 million total records—many of which may be duplicates—the department remains under immense pressure to prove its commitment to transparency. For the survivors and the public, the question remains whether this new “million-document” trove will finally shed light on Epstein’s high-profile associates or if it serves as a final administrative barrier to full disclosure.","summary":"With the volume of material now exceeding 4.6 million records—many of which may be duplicates—the department remains under immense pressure to prove its commitment to transparency","url":"https://www.news18.com/world/christmas-eve-bombshell-doj-discovers-million-file-epstein-cache-delays-full-disclosure-9790996.html","image":"https://images.news18.com/ibnlive/uploads/2025/02/Jeffrey-Epstein-files-released-2025-02-06fb4dfcca8939d6794a1e51ed811836.jpg","video":null,"publish_date":"2025-12-25 00:06:34","author":"News18,Pathikrit Sen Gupta","authors":["News18","Pathikrit Sen Gupta"],"language":"en","source_country":"in","sentiment":-0.342},{"id":388838070,"title":"Hillary Clinton Ripped for Posting Family Christmas Photo Despite Fresh Epstein Disgrace Over Husband Bill's Shirtless Photos with Ghislaine Maxwell","text":"Hillary Clinton did her best to remind people that her embattled husband, Bill Clinton, was once a church-going family man, as the former president continues to appear in newly released materials involving the Jeffrey Epstein files, RadarOnline.com can reveal.\n\nThe former New York senator, 78, posted a throwback photo of the couple and their daughter, Chelsea, as a young girl, celebrating Christmas alongside a minister after a church service back in the day.Early 1990s Christmas ThrowbackThe photo appeared to have been taken in the early 1990s, before the former Arkansas governor, 79, was elected president in 1992.\n\nBill's hair had yet to get salt-and-pepper, while Hillary sported a longer-than-normal shoulder-length hairdo. Chelsea adorably still had braces on her teeth as she smiled in a festive sweater with red-and-green Christmas trees, bells, and candy cane patterns. \n\n\"Wishing everyone celebrating a cozy Christmas Eve!\" Hillary wrote in the caption.Hillary Clinton Mocked Over Throwback Family PhotoWhile there were plenty of fans wishing the former Secretary of State happy holidays in return, many people dragged Hillary for posting the happy family photo while the Department of Justice has been releasing the Epstein Files.\n\n\"Bill Clinton is in Epstein Files, and you are here wishing people Merry Christmas,\" one person jeered, while a second noted of the curious photos that have been released by the DOJ, \"I like your husband’s pictures in the Epstein files.\"\n\nA third person begged Hillary, \"Divorce your husband, who is associated with Epstein! You make me feel ashamed I’m a Democrat. So horrible!!\"\n\n\"Funny how Ghislaine was at your daughter’s wedding, and Bill was on the island every other month,\" a fourth sneered, referring to Epstein's ex-girlfriend and madam Ghislaine Maxwell.Nothing to HideEven though Bill appeared in photos kicking back in a pool with Maxwell and hanging out with Epstein at other events, the former president said he has nothing to hide.\n\nThe statesman went so far as to ask for the complete Epstein files to be released, even though the DOJ released only a partial batch on the December 19 deadline Congress set for the department. It has since released more documents. \n\nBill said through his spokesman on Monday, December 22, \"The Epstein Files Transparency Act imposes a clear legal duty on the U.S. Department of Justice to produce the full and complete record the public demands and deserves.\"\n\nThe statement defiantly continued, \"However, what the Department of Justice has released so far, and the manner in which it did so, makes one thing clear: someone or something is being protected. We do not know whom, what or why. But we do know this: We need no such protection.\"Bill Clinton's Relationships to Jeffrey Epstein and Ghislaine MaxwellBill put his masterful political skills to use, turning the tables on President Donald Trump and Attorney General Pam Bondi, both of whom previously balked at releasing the complete Epstein files. \n\n\"Accordingly, we call on President Trump to direct Attorney General Bondi to immediately release any remaining materials referring to, mentioning, or containing a photograph of Bill Clinton,\" he demanded.\n\n\"Refusal to do so will confirm the widespread suspicion the Department of Justice’s actions to date are not about transparency, but about insinuation,\" the statement concluded.\n\nBill has not been publicly accused of any wrongdoing regarding Epstein and his s-- crimes.\n\n\"President Clinton was my friend, not Epstein's friend,\" Maxwell, 63, revealed to Deputy Attorney General Todd Blanche. She added that he \"liked\" her, \"and we got along terribly well. But I never saw that warmth with Mr. Epstein.\"\n\nFlight logs showed Bill traveled abroad on Epstein's plane in the early aughts for trips related to the Clinton Foundation. \n\nShortly after the sick pedophile's arrest in July 2019, Bill's camp put out a statement that he knew \"nothing\" about Epstein's alleged s-- trafficking crimes and that the two hadn't spoken in \"well over a decade.\"","summary":"Hillary Clinton's holiday throwback photo post was dragged by people calling out her husband appearing in Epstein files phtoos.","url":"https://radaronline.com/p/hillary-clinton-family-christmas-shirtless-photo-bill-swimming-epstein-files/","image":"https://media.radaronline.com/brand-img/PDa6Bsyd_/0x0/hillary-clinton-dragged-bill-pool-ghislaine-maxwell-1766619444334.jpg","video":null,"publish_date":"2025-12-25 00:05:00","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":-0.162},{"id":388837996,"title":"World News | US Envoy Sergio Gor Holds Talks with Indian Counterpart Kwatra Amid Christmas Festivities","text":"Washington DC [US], December 25 (ANI): US Ambassador to India, Sergio Gor held talks with Ambassador of India to the US, Vinay Mohan Kwatra, at Mar-a-Lago.\nIn a post on X, Gor said, \"It's always a pleasure to meet with India's Ambassador to the U.S. Vinay Mohan Kwatra. This was his first visit to Mar a Lago!\" Also Read | South Carolina Shocker: Disabled Girl Dies in Heat After Mother Locks Her In Hot Car While Having S*x With Boyfriend.\nhttps://x.com/USAmbIndia/status/2003842184400023957?s=20\nGor later extended his greetings on the occasion of Christmas and the New Year. He met US President Donald Trump on the occasion. Also Read | Moscow Explosion: 3 Killed, Including 2 Police Officers, in Blast on Yeletskaya Street In Russia.\n\"Wishing everyone a very Merry Christmas and a Happy New Year!\" Gor said in a post on X.\nhttps://x.com/USAmbIndia/status/2003871790028743119?s=20 This came amid the ongoing trade talks between India and the US. India is close to finalising a trade deal with the US in the backdrop of tariffs levied on the import of Indian goods. Meanwhile, the Embassy of the United States of America here in the national capital on Tuesday said that routine consular services will not be available from December 14-26 in accordance with the Presidential Executive Order that provided for the closure of executive departments and agencies of the federal government on these dates. In a post on X on Tuesday, the Embassy said, \"The US Embassy and Consulates in India will be closed from Wednesday, December 24, 2025, to Friday, December 26, 2025, in accordance with the Presidential Executive Order providing for the closure of executive departments and agencies of the federal government on these dates. Routine consular services will not be available during these dates.\"\nhttps://x.com/USAndIndia/status/2003453849978503676?s=20\nEarlier on December 18, US President Donald Trump had signed an executive order which noted that all executive departments and agencies of the Federal Government would be closed and their employees excused from duty on Wednesday, December 24, 2025, and Friday, December 26, 2025, the day before and the day following Christmas Day, respectively.\nAhead of Christmas, during an address to the nation on December 18, Trump had also announced a special 'warrior dividend' for military service members.\nTrump announced that over 14,50,000 military service members will receive a special warrior dividend before Christmas.\nHe said, \"I am also proud to announce that more than 1,450,000 military service members will receive a special warrior dividend before Christmas. In honour of our nation's founding in 1776, we are sending every soldier 1,776 dollars.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  In a post on X, he said, &quot;It's always a pleasure to meet with India's Ambassador to the U.S. Vinay Mohan Kwatra. This was his first visit to Mar a Lago!&quot;","url":"https://www.latestly.com/agency-news/world-news-us-envoy-sergio-gor-holds-talks-with-indian-counterpart-kwatra-amid-christmas-festivities-7251011.html","image":"https://st1.latestly.com/wp-content/uploads/2025/12/ANI-20251224200525.jpg","video":null,"publish_date":"2025-12-25 00:04:20","author":null,"language":"en","source_country":"in","sentiment":0.078},{"id":388843698,"title":"Trump warns against infiltration by a ‘bad Santa’ during Christmas calls with kids (Video)","text":"President Donald Trump marked Christmas Eve by chatting with children about their holiday wishes. On phone calls, he promised kids to not let a bad Santa infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\n\nThis video may be available for archive licensing via https://newsroom.ap.org/home","summary":"President Donald Trump marked Christmas Eve by chatting with children about their holiday wishes. On phone calls, he promised kids to not let a bad Santa infiltrate the country and even suggesting that a stocking...\n\n\nThe post Trump warns against infiltration by a &#8216;bad Santa&#8217; during Christmas calls with kids (Video) appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/12/24/trump-warns-against-infiltration-by-a-bad-santa-during-christmas-calls-with-kids-video/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/12/25/maxresdefault.jpg?fit=1280%2C720&quality=80&zoom=1&ssl=1?v=1766622843","video":null,"publish_date":"2025-12-25 00:04:03","author":"Social News XYZ","authors":["Social News XYZ"],"language":"en","source_country":"in","sentiment":-0.307},{"id":388835916,"title":"Tina Peters Asks Colorado Appeals Court To Recognize Trump's Pardon","text":"DENVER (AP) — Former Colorado elections clerk Tina Peters is asking the state appeals court to recognize President Donald Trump’s pardon of her state convictions as valid.\n\nIn a motion Tuesday, Peters’ lawyers said the Colorado appeals court no longer has jurisdiction over her case because of a Dec. 5 pardon issued by Trump. They also asked the court to release her from prison because of the pardon.\n\nPeters, the former Mesa County, Colorado clerk, was convicted of state crimes there for orchestrating a data breach scheme driven by false claims about voting machine fraud in the 2020 presidential race. Trump’s pardon power does not extend to state crimes.\n\nIn the court filing, Peters’ lawyers argued that President George Washington issued pardons to people convicted of both state and federal crimes in the Whiskey Rebellion in 1795. They urged the state appeals court to issue a ruling quickly. The court is set to hear arguments from lawyers in Peters’ appeal of her conviction on Jan. 14.\n\nThe appeals court ruled Wednesday that lawyers from the state attorney general’s office, which is defending the conviction, could respond to Peters’ arguments by Jan. 8.\n\nThe office of Colorado Attorney General Phil Weiser declined to comment. Weiser previously dismissed it when Trump announced it Dec. 11.\n\n“The idea that a president could pardon someone tried and convicted in state court has no precedent in American law, would be an outrageous departure from what our constitution requires, and will not hold up,” he said in statement then.\n\nIf the appeals court rules the pardon isn’t valid, one of Peters’ attorneys, Peter Ticktin, said she could appeal that issue to the U.S. Supreme Court while the state court continues to consider Peters’ appeal of her conviction.\n\nAnother Peters attorney, John Case, has asked the state prison system to release Peters based on Trump’s pardon but the state refused, according to an email included in the appeals court filing.\n\nEarlier this month, Peters lost a bid in federal court to be released from prison while her state appeal is considered.\n\nPeters claims that the state judge who sentenced her to nine years behind bars violated her First Amendment rights by punishing her for making allegations about election fraud.\n\nDuring Peters’ October 2024 sentencing, Judge Matthew Barrett called Peters a “charlatan” and said she posed a danger to the community for spreading lies about voting and undermining the democratic process.\n\nPeters was unapologetic and insisted that everything she did was geared toward trying to uproot what she believed was fraud. She claimed her actions were done for the greater good.\n\nPeters was convicted of allowing a man to misuse a security card to access the election system and being deceptive about that person’s identity. The man was affiliated with MyPillow chief executive Mike Lindell, a prominent promoter of false claims that voting machines were manipulated to steal the election from Trump.","url":"https://www.huffpost.com/entry/tina-peters-asks-colorado-appeals-court-to-recognize-trumps-pardon_n_694c7dfbe4b00ac998b39ae7?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/694c7eb12b000079a8682d69.jpeg?ops=1778_1000","video":null,"publish_date":"2025-12-25 00:03:59","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.396},{"id":388835918,"title":"Tina Peters Asks Colorado Appeals Court To Recognize Trump's Pardon","text":"DENVER (AP) — Former Colorado elections clerk Tina Peters is asking the state appeals court to recognize President Donald Trump’s pardon of her state convictions as valid.\n\nIn a motion Tuesday, Peters’ lawyers said the Colorado appeals court no longer has jurisdiction over her case because of a Dec. 5 pardon issued by Trump. They also asked the court to release her from prison because of the pardon.\n\nPeters, the former Mesa County, Colorado clerk, was convicted of state crimes there for orchestrating a data breach scheme driven by false claims about voting machine fraud in the 2020 presidential race. Trump’s pardon power does not extend to state crimes.\n\nIn the court filing, Peters’ lawyers argued that President George Washington issued pardons to people convicted of both state and federal crimes in the Whiskey Rebellion in 1795. They urged the state appeals court to issue a ruling quickly. The court is set to hear arguments from lawyers in Peters’ appeal of her conviction on Jan. 14.\n\nThe appeals court ruled Wednesday that lawyers from the state attorney general’s office, which is defending the conviction, could respond to Peters’ arguments by Jan. 8.\n\nThe office of Colorado Attorney General Phil Weiser declined to comment. Weiser previously dismissed it when Trump announced it Dec. 11.\n\n“The idea that a president could pardon someone tried and convicted in state court has no precedent in American law, would be an outrageous departure from what our constitution requires, and will not hold up,” he said in statement then.\n\nIf the appeals court rules the pardon isn’t valid, one of Peters’ attorneys, Peter Ticktin, said she could appeal that issue to the U.S. Supreme Court while the state court continues to consider Peters’ appeal of her conviction.\n\nAnother Peters attorney, John Case, has asked the state prison system to release Peters based on Trump’s pardon but the state refused, according to an email included in the appeals court filing.\n\nEarlier this month, Peters lost a bid in federal court to be released from prison while her state appeal is considered.\n\nPeters claims that the state judge who sentenced her to nine years behind bars violated her First Amendment rights by punishing her for making allegations about election fraud.\n\nDuring Peters’ October 2024 sentencing, Judge Matthew Barrett called Peters a “charlatan” and said she posed a danger to the community for spreading lies about voting and undermining the democratic process.\n\nPeters was unapologetic and insisted that everything she did was geared toward trying to uproot what she believed was fraud. She claimed her actions were done for the greater good.\n\nPeters was convicted of allowing a man to misuse a security card to access the election system and being deceptive about that person’s identity. The man was affiliated with MyPillow chief executive Mike Lindell, a prominent promoter of false claims that voting machines were manipulated to steal the election from Trump.","url":"https://www.huffpost.com/entry/tina-peters-asks-colorado-appeals-court-to-recognize-trumps-pardon_n_694c7dfbe4b00ac998b39ae7?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/694c7eb12b000079a8682d69.jpeg?ops=1778_1000","video":null,"publish_date":"2025-12-25 00:03:59","author":null,"language":"en","category":"politics","source_country":"ca","sentiment":-0.396},{"id":388843066,"title":"All the best gifts for the worst people, courtesy of the Trump family","text":"There’s never been a president—or a presidential family—so hyped to slap their name on products. It’s just our luck that besides being the most monstrous president of our lifetime, President Donald Trump is also the tackiest, so all of this stuff is hot, wet garbage.\n\nThere is also so, so much of it at so, so many different places, that we’re going to have to break this down by store. \n\nPrepare to feel very un-merry.\n\nOfficial Trump Store\n\nThe official Trump store is supposed to be for the nonpresidential things in Trump’s “brand,” but you will be unsurprised to learn that there is still a ton of Dear Leader merch. Also, in case you were wondering, the tagline for the site is: “Infuse the elegance of Trump in your next event,” which actually makes it sound like Trump, the person, could somehow be distilled and pumped into your holiday party—a genuinely horrifying thought.\n\nHow about wrapping yourself up in this lovely 45th & 47th President Woven Blanket?\n\nOr perhaps imagine walking into your family holiday and seeing your little cousin snuggled under this? Such a bargain at $200!\n\nOr maybe a little something for the ladies? A lovely little handbag, clocking in at $550 a pop: It’s the Bling Clutch, studded with Swarovski crystals.\n\nHave you been thinking, “Hey, I wonder what it would look like if my sleep paralysis demon assumed physical form?” If so, we bring you the $65 DJT Driver Cover, which goes on your golf clubs, apparently? Keep your bag out in the garage so this thing can’t attack you in your sleep. \n\nThe Trumps have no qualms about cross-promotion, which is why you can get an Under Siege Hat, so you can sport the title of Eric Trump’s latest book on your cranium for a mere $50. One small problem: People will definitely start edging away from anyone wearing a hat like this at the holiday party. \n\nTrump Winery\n\nEric Trump must be in charge of the family’s terrible wines these days, because there really isn’t any other reason that his “Under Siege” book is available over in the merchandise section there. Nothing says “fine wines” like a book from one of Trump’s large adult sons whining about how hard he has it. \n\nBut perhaps if you want something actually wine-related, you’d pick up this Presidential Reserve + 2 Complimentary Flutes for $245.47. A small price to pay for whatever fake-ass seal got slapped on these glasses, right?\n\nIf that’s too rich for your blood, you can drop $30 on a T-shirt emblazoned with a U.S. flag made out of wine bottles. Honestly, this is pretty low-key for the Trump family. \n\nGod Bless The USA Bible\n\nGet excited about the “buy more, save more” deal on Trump Bibles that is happening right now! There are … nine different versions? You probably want to spring for the $99.99 version that commemorates both of Trump’s presidential terms, because that is definitely a thing that is appropriate for the family Bible.\n\nTrump Guitars\n\nIs Donald Trump known for his love of guitars somehow? Who, exactly, is the market for these? Sure, you might want to keep it relatively normal and get a plain old black guitar while still lining the pockets of the president, but why would you do that when you could get the American Eagle Electric Guitar? The version autographed by Trump will set you back a mere $11,500 and immediately become the ugliest thing in your house.\n\nTrump Sneakers\n\nThe Trump Sneakers site sells sneakers and slides, but it is also, inexplicably, where you can buy Trump fragrances. The showstopper here, sure to please the sneakerhead in your life, is the Trump 2028 Gold High Tops, which will run you $799, unless you want a pair for yourself as well, in which case you can get two pairs for $999. Bargain!\n\nIf you want something a little softer for the lady in your life and the lady in your life happens to love sneakers that look vaguely orthopedic, first lady Melania’s got her own sneaks as well, for a mere $299.\n\nMelania Trump\n\nMelania’s site is doing heavy promotion for her movie and book, as if she’s some sort of auteur, but it isn’t like she was going to skip out on selling some tacky shit just like the rest of the fam. $600 gets you this Vote Freedom pendant that looks like something you’d get out of a gum machine at a fourth-rate patriotic theme park. It’ll look great with the sneakers. \n\nOh no. Someone forgot to tell Don Jr. that his daddy loves Big Tech now, so he’s still awkwardly hawking this $29.99 tee-shirt over on his honestly kinda sad website where he’s still also trying to hawk his book about “turning the tables” on Joe Biden. Buddy, your dad is president. You’re incredibly rich. You and your ilk run everything and own everything. Let it go. Oh, but also you might want to get rid of this shirt before dad sees it. \n\nShare your worst gift ideas in the comments below, and Merry Christmas to all—except the Trumps.","summary":"There’s never been a president—or a presidential family—so hyped to slap their name on products. It’s just our luck that besides being the most monstrous president of our lifetime, President Donald Trump is also the tackiest, so all of this stuff is hot, wet garbage.\n\n\n\nThere is also so, so much of it at so, so many different places, that we’re going to have to break this down by store. \n\n\n\nPrepare to feel very un-merry.\n\n\n\nOfficial Trump Store\n\nThe official Trump store is supposed to be for the nonpresidential things in Trump’s “brand,” but you will be unsurprised to learn that there is still a ton of Dear Leader merch. Also, in case you were wondering, the tagline for the site is: “Infuse the elegance of Trump in your next event,” which actually makes it sound like Trump, the person, could somehow be distilled and pumped into your holiday party—a genuinely horrifying thought.\n\n\n\nHow about wrapping yourself up in this lovely 45th &amp; 47th President Woven Blanket?\n\n\n\nOr perhaps imagine walking into your fam","url":"https://www.dailykos.com/story/2025/12/24/2359795/-All-the-best-gifts-for-the-worst-people-courtesy-of-the-Trump-family?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1510643/story_image/AP24308691732093.jpg?1766532915","video":null,"publish_date":"2025-12-25 00:00:05","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","source_country":"US","sentiment":-0.131},{"id":388841342,"title":"Trump-backed Nasry Asfura wins presidential elections in Honduras","text":"Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country’s election council said, as reported by Al Jazeera. According to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.According to Al Jazeera, Asfura was backed by United States President Donald Trump. In a social media post, Asfura said, “Honduras: I am prepared to govern. I will not fail you.”Donald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.US Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.“The people of Honduras have spoken: Nasry Asfura is Honduras’ next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,” Rubio said on X.In a separate statement, Rubio urged “all parties to respect the confirmed results” of the elections.“The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras’ National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,” Rubio said.Deputy Secretary Christopher Landau also posted on X, “Congratulations to President-elect Nasry ‘Tito’ Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.”Earlier this month, Trump had also pardoned former Honduran President and a member of Asfura’s National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/trump-backed-nasry-asfura-wins-presidential-elections-in-honduras-9790997.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-12-25 00:00:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.306},{"id":388842518,"title":"Kyodo News Digest: Dec. 25, 2025","text":"TOKYO - The following is the latest list of selected news summaries by Kyodo News.\n\nTOKYO - Japan has sounded out the United States about the possibility of a visit by Prime Minister Sanae Takaichi in the latter half of March for a summit with President Donald Trump, a government source said Wednesday, as Tokyo looks to reaffirm its alliance with Washington amid tensions with Beijing.\n\nThe first U.S. trip as prime minister could allow Takaichi, whose recent remarks on a Taiwan contingency have caused friction with Beijing, to exchange views with Trump and align positions ahead of his expected April visit to China for talks with President Xi Jinping.\n\nJapan protests S. Korean military drills near disputed islets\n\nTOKYO - Japan's government said Wednesday it has lodged a strong protest with South Korea over military drills reportedly conducted in waters near disputed islands in the Sea of Japan.\n\nBased on Japan's stance on the islets called Takeshima, senior Japanese government officials protested Wednesday to South Korea's Foreign Ministry and its embassy in Tokyo, according to the Foreign Ministry.\n\nSHANGHAI - Japanese-themed manga and anime have been barred from one of China's largest comic conventions about a week before the show begins in late December, Hong Kong media reported, amid a continuing diplomatic row between Tokyo and Beijing.\n\nThe decision was notified to participants last Friday ahead of the two-day Comicup convention scheduled to be held next weekend in the eastern Chinese city of Hangzhou near Shanghai, according to the South China Morning Post.\n\nN. Korean leader Kim inspects nuclear-powered submarine project: media\n\nBEIJING - North Korean leader Kim Jong Un has inspected a project to build a nuclear-powered submarine, state-run media reported Thursday, underscoring Pyongyang's push to strengthen its naval capabilities.\n\nKim criticized U.S.-South Korean plans to build nuclear-powered submarines, saying they would heighten instability on the Korean Peninsula and require a response, according to the official Korean Central News Agency.\n\nTOKYO - Japan's economy is projected to grow a real 1.1 percent in the current fiscal year through March, revised up from an earlier estimate of 0.7 percent, driven by stronger private consumption and capital investment, the government said Wednesday.\n\nThe updated forecast for fiscal 2025 released by the Cabinet Office also reflected a smaller-than-expected negative impact from higher U.S. tariffs on the Japanese economy, it said.\n\nCentral Japan's Mie Prefecture considers ending foreign national hiring\n\nTSU, Japan - The central Japanese prefecture of Mie is considering reinstating a rule requiring its employees to hold Japanese nationality to prevent leakage of sensitive information, prefectural officials said Wednesday.\n\nThe prefectural government will make a final decision based on the results of a survey to be conducted on some 10,000 residents about the issue, among other factors.\n\nJapan beer maker Sapporo to sell real estate business to investment funds\n\nTOKYO - Sapporo Holdings Ltd. said Wednesday it will sell its real estate business to an entity of investment funds including U.S. firm KKR for 477 billion yen ($3 billion), with the proceeds to be reinvested to strengthen its core alcohol operations.\n\nThe entity, which also involves Asia-focused PAG Investment Management Ltd., will acquire 51 percent of shares in Sapporo Holdings' real estate subsidiary in June 2026, before purchasing all shares by June 2029.\n\nMOSCOW - A translated debut novel by Japanese author and film producer Genki Kawamura has become the No. 1 bestseller so far this year at Russia's largest bookstore chain, according to a Russian newspaper.\n\nThe book, whose English title is \"If Cats Disappeared from the World,\" sold 104,000 copies between January through Dec. 17 at Chitai Gorod bookstores, Vedomosti said.\n\nVideo: Saitama police introduces new patrol cars with red light patterns that are easier to differentiate for hearing-impaired","summary":"The following is the latest list of selected news summaries by Kyodo News.----------Japan PM Takaichi seeking 1st visit to U.S. in\n\nRead full story here","url":"https://english.kyodonews.net/articles/-/67454","image":"https://english-kyodo.ismcdn.jp/mwimgs/4/e/1200x/img_4e7208c534bd04326605e69f9373a9a8808875.jpg","video":null,"publish_date":"2025-12-25 00:00:00","author":null,"language":"en","source_country":"JP","sentiment":-0.055},{"id":388835882,"title":"Jaguars blistering, Colts frigid since AFC South rivals' last meeting","text":"Trump targeting of Venezuela making pariah of international law\n\n Photo by Miss Finland sparks accusations of racism across Asia\n\n Board renames Performing Arts Center as Trump Kennedy Center\n\n New trove of Epstein files released, with little evidence\n\n Jaguars blistering, Colts frigid since AFC South rivals' last meeting\n\n (Photo credit: Ron Chenoy-Imagn Images)\n Though it will have been just three weeks since the Jacksonville Jaguars faced the Indianapolis Colts when they rematch on Sunday, a lot has happened for both teams in the intervening period.\n In drastically different directions.\n The Jaguars (11-4) have won both of their games since their 36-19 home victory over the Colts on Dec. 7, including last Sunday's 34-20 statement win at Denver that ran their winning streak to five games and snapped the Broncos' 11-game winning streak.\n The host Colts (8-7) have lost both games since that Jaguars setback, extending their losing streak to five games.\n With Indianapolis' 48-27 home loss to San Francisco on Monday, Jacksonville clinched its first playoff berth since 2022 while the Colts fell to the brink of elimination. They need to win out, have the Houston Texans lose out and hope a number of other results go their way in order to win a strength-of-victory tiebreaker to claim the final AFC wild-card spot.\n 'We've got a chance to get in. We take it one day at a time. We've got a hell of a challenge this week,' Colts coach Shane Steichen said. 'Obviously, we need some help from some other pieces but, again, we've got a great opportunity against a division opponent.'\n Even a stout Denver defense couldn't slow down the Jaguars' offensive surge. Jacksonville's 34 points were the most the Broncos have allowed all season, marking the third straight game the Jaguars have scored 34-plus points.\n Jacksonville quarterback Trevor Lawrence ran his interception-free streak to four games. With three touchdowns in the win, he set a career high with 26 touchdown passes this season.\n While 2025 first-round pick Travis Hunter played just seven games before sustaining a season-ending knee injury and 2024 first-round pick Brian Thomas Jr. has battled injuries and not followed up his breakout rookie season, Jacksonville's receiver-by-committee approach has worked well.\n Parker Washington had 10 catches for a career-high 145 yards and a TD last week to take over the team lead with 645 yards and four touchdown receptions.\n Jakobi Meyers, acquired in a trade with Las Vegas on Nov. 4 and signed last week to a three-year extension, has 400 yards and three touchdowns in seven games with Jacksonville.\n They're among the five Jaguars who have led the team in receiving yards during this five-game winning streak.\n 'Fortunately, we have really good players at every position, especially (the ones) that touch the ball,' Lawrence said. 'There's really no telling whose day it's going to be. ... It's a credit to everybody being ready because you never know who's going to get more opportunities a certain day.'\n Philip Rivers, 44, who came out of retirement to play quarterback for Indianapolis after Daniel Jones sustained a torn Achilles against Jacksonville, was effective enough in Monday's loss to San Francisco to compile 277 passing yards, two touchdowns and a pick.\n The defense did not deliver on its part, forcing no punts and allowing 40-plus points at home for the first time since 2020. The Colts had the NFL's third-best rushing defense before allowing Christian McCaffrey to rack up 117 yards while Brock Purdy threw for 295 yards and a career-high five TDs.\n The good news is that the Colts could be getting a key piece of that defense back this week. Steichen said he's 'hopeful' that star cornerback Sauce Gardner can return after missing the last three games with a calf strain. He has played in just three games since the team sent two first-round picks to the New York Jets to acquire him Nov. 4.\n Gardner was listed as an estimated non-participant in Wednesday's walk-through. Defensive tackle DeForest Buckner (neck) was a non-participant after returning from injured reserve in Monday's loss to the 49ers. Reserve quarterback Anthony Richardson (eye) was limited.\n For Jacksonville, starting center Robert Hainsey (groin) and right guard Patrick Mekari (back) did not practice Wednesday. Starting cornerback Jourdan Lewis (foot) and backup corner Greg Newsome III (shoulder/personal) also were out.\n --Field Level Media\n\n Jaguars blistering, Colts frigid since AFC South rivals' last meeting\n Jaguars blistering, Colts frigid since AFC South rivals' last meeting\n Field Level Media \n 25th December 2025, 10:19 GMT+11\n\n (Photo credit: Ron Chenoy-Imagn Images)\n Though it will have been just three weeks since the Jacksonville Jaguars faced the Indianapolis Colts when they rematch on Sunday, a lot has happened for both teams in the intervening period.\n In drastically different directions.\n The Jaguars (11-4) have won both of their games since their 36-19 home victory over the Colts on Dec. 7, including last Sunday's 34-20 statement win at Denver that ran their winning streak to five games and snapped the Broncos' 11-game winning streak.\n The host Colts (8-7) have lost both games since that Jaguars setback, extending their losing streak to five games.\n With Indianapolis' 48-27 home loss to San Francisco on Monday, Jacksonville clinched its first playoff berth since 2022 while the Colts fell to the brink of elimination. They need to win out, have the Houston Texans lose out and hope a number of other results go their way in order to win a strength-of-victory tiebreaker to claim the final AFC wild-card spot.\n 'We've got a chance to get in. We take it one day at a time. We've got a hell of a challenge this week,' Colts coach Shane Steichen said. 'Obviously, we need some help from some other pieces but, again, we've got a great opportunity against a division opponent.'\n Even a stout Denver defense couldn't slow down the Jaguars' offensive surge. Jacksonville's 34 points were the most the Broncos have allowed all season, marking the third straight game the Jaguars have scored 34-plus points.\n Jacksonville quarterback Trevor Lawrence ran his interception-free streak to four games. With three touchdowns in the win, he set a career high with 26 touchdown passes this season.\n While 2025 first-round pick Travis Hunter played just seven games before sustaining a season-ending knee injury and 2024 first-round pick Brian Thomas Jr. has battled injuries and not followed up his breakout rookie season, Jacksonville's receiver-by-committee approach has worked well.\n Parker Washington had 10 catches for a career-high 145 yards and a TD last week to take over the team lead with 645 yards and four touchdown receptions.\n Jakobi Meyers, acquired in a trade with Las Vegas on Nov. 4 and signed last week to a three-year extension, has 400 yards and three touchdowns in seven games with Jacksonville.\n They're among the five Jaguars who have led the team in receiving yards during this five-game winning streak.\n 'Fortunately, we have really good players at every position, especially (the ones) that touch the ball,' Lawrence said. 'There's really no telling whose day it's going to be. ... It's a credit to everybody being ready because you never know who's going to get more opportunities a certain day.'\n Philip Rivers, 44, who came out of retirement to play quarterback for Indianapolis after Daniel Jones sustained a torn Achilles against Jacksonville, was effective enough in Monday's loss to San Francisco to compile 277 passing yards, two touchdowns and a pick.\n The defense did not deliver on its part, forcing no punts and allowing 40-plus points at home for the first time since 2020. The Colts had the NFL's third-best rushing defense before allowing Christian McCaffrey to rack up 117 yards while Brock Purdy threw for 295 yards and a career-high five TDs.\n The good news is that the Colts could be getting a key piece of that defense back this week. Steichen said he's 'hopeful' that star cornerback Sauce Gardner can return after missing the last three games with a calf strain. He has played in just three games since the team sent two first-round picks to the New York Jets to acquire him Nov. 4.\n Gardner was listed as an estimated non-participant in Wednesday's walk-through. Defensive tackle DeForest Buckner (neck) was a non-participant after returning from injured reserve in Monday's loss to the 49ers. Reserve quarterback Anthony Richardson (eye) was limited.\n For Jacksonville, starting center Robert Hainsey (groin) and right guard Patrick Mekari (back) did not practice Wednesday. Starting cornerback Jourdan Lewis (foot) and backup corner Greg Newsome III (shoulder/personal) also were out.\n --Field Level Media\n\n Full Highlights: Rams 20, Seahawks 10Watch the top plays from Seattle's Week 15 matchup withBig News NetworkUndoUK FMBig News NetworkUndoIndia rejectsBig News NetworkUndoEx US national security adviser accuses CIA of working against TrumpMichael Flynn has alleged collusion between the CIA and European intelligence services to undermine President Donald Trump Read Full Article at RT.comBig News NetworkUndoRecord-breaking frenzy continues on Wall StreetBig News NetworkUndocontentBig News NetworkUndo\n\n Read This Next\n\n Dow Jones gains 289 points in Christmas Eve rally\n\n Ireland constructed just 30% of social homes by September 2025\n\n UK growth holds steady as economy expands slightly in Q3\n\n Rome to introduce 2-euro fee for close access to Trevi Fountain\n\n U.S. stocks soak up more Christmas cheer\n\nBig News Network\n\nBig News Network News Agency\nMidwest Radio Network\nMainstream Media\n\nBIG NEWS NETWORK.COM\n\nContact & Support\nTerms & Conditions\n\nPRODUCTS & SERVICES\n\nNews Releases\n\nCopyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/278773419/jaguars-blistering-colts-frigid-since-afc-south-rivals-last-meeting","image":"https://image.chitra.live/api/v1/wps/2caeec9/3c47692d-27df-4861-92a5-a197f52f73ce/0/ZjQ1ZjM0ZGQtZjc-600x315.jpg","video":null,"publish_date":"2025-12-25 00:00:00","author":"Miss Finland","authors":["Miss Finland"],"language":"en","source_country":"us","sentiment":-0.2},{"id":388835402,"title":"Trump-backed Nasry Asfura wins presidential elections in Honduras","text":"Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country's election council said, as reported by Al Jazeera. \n\nAccording to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.\n\nAccording to Al Jazeera, Asfura was backed by United States President Donald Trump. \n\nIn a social media post, Asfura said, 'Honduras: I am prepared to govern. I will not fail you.'\n\nDonald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.\n\nUS Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.\n\n'The people of Honduras have spoken: Nasry Asfura is Honduras' next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,' Rubio said on X.\n\nIn a separate statement, Rubio urged 'all parties to respect the confirmed results' of the elections.\n\n'The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras' National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,' Rubio said.\n\nDeputy Secretary Christopher Landau also posted on X, 'Congratulations to President-elect Nasry 'Tito' Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.'\n\nEarlier this month, Trump had also pardoned former Honduran President and a member of Asfura's National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)","url":"https://www.canadastandard.com/news/278773469/trump-backed-nasry-asfura-wins-presidential-elections-in-honduras","image":"https://image.chitra.live/api/v1/wps/376cf85/41564a5a-cedd-43b8-bb03-dcb226620d6f/0/ANI-20251224233932-600x315.jpg","video":null,"publish_date":"2025-12-25 00:00:00","author":"Al Jazeera","authors":["Al Jazeera"],"language":"en","category":"politics","source_country":"ca","sentiment":0.289},{"id":388835870,"title":"Trump-backed Nasry Asfura wins presidential elections in Honduras","text":"Trump targeting of Venezuela making pariah of international law\n\n Photo by Miss Finland sparks accusations of racism across Asia\n\n Board renames Performing Arts Center as Trump Kennedy Center\n\n New trove of Epstein files released, with little evidence\n\n Trump-backed Nasry Asfura wins presidential elections in Honduras\n\n Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country's election council said, as reported by Al Jazeera. \n According to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.\n According to Al Jazeera, Asfura was backed by United States President Donald Trump. \n In a social media post, Asfura said, 'Honduras: I am prepared to govern. I will not fail you.'\n Donald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.\n US Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.\n 'The people of Honduras have spoken: Nasry Asfura is Honduras' next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,' Rubio said on X.\n In a separate statement, Rubio urged 'all parties to respect the confirmed results' of the elections.\n 'The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras' National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,' Rubio said.\n Deputy Secretary Christopher Landau also posted on X, 'Congratulations to President-elect Nasry 'Tito' Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.'\n Earlier this month, Trump had also pardoned former Honduran President and a member of Asfura's National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)\n\n Trump-backed Nasry Asfura wins presidential elections in Honduras\n Trump-backed Nasry Asfura wins presidential elections in Honduras\n\n 25th December 2025, 10:57 GMT+11\n\n Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country's election council said, as reported by Al Jazeera. \n According to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.Discover moreNewspapers\n According to Al Jazeera, Asfura was backed by United States President Donald Trump. \n In a social media post, Asfura said, 'Honduras: I am prepared to govern. I will not fail you.'\n Donald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.Discover moreInternational Affairs NewsletterInternational relations booksBusiness strategy consultingElectric vehicle modelsDigital Newspaper AccessDepression treatment devicesNews aggregator appAI and technology coursesInvestment portfolio managementGlobal Events Coverage\n US Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.\n 'The people of Honduras have spoken: Nasry Asfura is Honduras' next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,' Rubio said on X.\n In a separate statement, Rubio urged 'all parties to respect the confirmed results' of the elections.\n 'The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras' National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,' Rubio said.\n Deputy Secretary Christopher Landau also posted on X, 'Congratulations to President-elect Nasry 'Tito' Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.'\n Earlier this month, Trump had also pardoned former Honduran President and a member of Asfura's National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)\n\n Discover moreDigital Newspaper AccessInvestment portfolio managementBreaking News UpdatesGlobal News AggregatorPress Freedom IndexNews Subscription ServiceDepression treatment devicesMental health support servicesNews Headline AnalysisSports team merchandise\n\n Discover moreMental health support servicesBusiness strategy consultingReal-time News NotificationsInternational Affairs NewsletterWorld News DigestTravel insurance plansMedia Freedom ReportBreaking News UpdatesUrgent News AlertsPress Freedom Index\n\n Freed Israeli hostages reunite with familiesFour Israeli soldiers, freed from Hamas captivity were finally reunited with their families in the latest round of releases under the Israel-Hamas ceasefire agrBig News NetworkUndoUK FMBig News NetworkUndoDaily World Briefing, Aug. 29Big News NetworkUndoHow Technology Has Evolved in Online BettingThe application of advanced technology in various industries has become a significantly normal tradition and the online casino industry is not exempted from this...Big News NetworkUndoAid flight crashes in South SudanBig News NetworkUndoOpenAI sees 220 million paid ChatGPT users by 2030, report saysBig News NetworkUndo\n\n Read This Next\n\n Discover moreBusiness News Feed\n\n Dow Jones gains 289 points in Christmas Eve rally\n\n Ireland constructed just 30% of social homes by September 2025\n\n UK growth holds steady as economy expands slightly in Q3\n\n Rome to introduce 2-euro fee for close access to Trevi Fountain\n\n U.S. stocks soak up more Christmas cheer\n\nBig News Network\n\nBig News Network News Agency\nMidwest Radio Network\nMainstream Media\n\nBIG NEWS NETWORK.COM\n\nContact & Support\nTerms & Conditions\n\nPRODUCTS & SERVICES\n\nNews Releases\n\nCopyright © 1998-2025 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/278773469/trump-backed-nasry-asfura-wins-presidential-elections-in-honduras","image":"https://image.chitra.live/api/v1/wps/376cf85/41564a5a-cedd-43b8-bb03-dcb226620d6f/0/ANI-20251224233932-600x315.jpg","video":null,"publish_date":"2025-12-25 00:00:00","author":"Miss Finland","authors":["Miss Finland"],"language":"en","category":"politics","source_country":"us","sentiment":0.175},{"id":388816712,"title":"U.S. Deploys Special Forces, Military Aircraft Near Venezuela; Huge Buildup Right Before Big Action?","text":"1 views | Dec 25, 2025, 02:15:22 AM | TOI.in\n\nThe United States is quietly expanding its military footprint in the Caribbean as tensions with Venezuela intensify. According to the Wall Street Journal, U.S. special operations aircraft, troop carriers, and transport planes have been deployed near Venezuela, offering Washington expanded military options despite no operation being announced. The buildup includes CV-22 Osprey aircraft and C-17 cargo planes carrying troops and equipment to Puerto Rico. The move comes as President Donald Trump orders a blockade of Venezuelan oil tankers and refuses to rule out military strikes. Caracas has condemned tanker seizures as piracy, while Russia and China warn of serious regional consequences.","url":"https://timesofindia.indiatimes.com/videos/international/u-s-deploys-special-forces-military-aircraft-near-venezuela-huge-buildup-right-before-big-action/videoshow/126166473.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126166473/126166473.jpg?resizemode=4","video":null,"publish_date":"2025-12-25 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","category":"politics","source_country":"in","sentiment":0.193},{"id":388816710,"title":"‘CHILL, WON’T CONQUER’: Jeff Landry Backtracks On ‘Greenland Capture’ Remark After EU Backlash","text":"1 views | Dec 25, 2025, 01:55:42 AM | TOI.in\n\nU.S. special envoy to Greenland Jeff Landry has pushed back against claims that Washington is planning to “conquer” or seize the Arctic island, following sharp backlash from Denmark and the European Union. Speaking after President Donald Trump’s renewed comments about Greenland’s strategic value, Landry said the administration wants dialogue with Greenlanders, not annexation. His remarks come after earlier statements suggesting the U.S. would work to bring Greenland closer to Washington, fueling diplomatic tensions. Denmark and Greenland’s leaders have stressed sovereignty and international law, warning against any attempt to redraw borders under the guise of security concerns.","url":"https://timesofindia.indiatimes.com/videos/international/chill-wont-conquer-jeff-landry-backtracks-on-greenland-capture-remark-after-eu-backlash/videoshow/126166429.cms","image":"https://timesofindia.indiatimes.com/photo/msid-126166429/126166429.jpg?resizemode=4","video":null,"publish_date":"2025-12-25 00:00:00","author":"Timesofindia.com","authors":["Timesofindia.com"],"language":"en","source_country":"in","sentiment":-0.439},{"id":388840256,"title":"Joe Rogan and comedian Tom Segura mock Trump’s latest ‘crazy’ and ‘insane’ antics: ‘nothing nuttier than the plaques’","text":"Comedians Joe Rogan and Tom Segura this week mocked what they called President Donald Trump’s increasingly “crazy” and “insane” attempts to remake Washington landmarks. \n\nDuring a podcast, the pair mentioned the renaming of the Kennedy Center to add Trump’s name and the president’s decision to install highly partisan plaques that mocked his predecessors as part of a new “Presidential Walk of Fame” at the White House.\n\nDuring the Tuesday episode, after Segura brought up the newly renamed Trump-Kennedy Center, Rogan moved on to the new plaques, which insult past Democratic presidents and feature an automatic pen instead of a portrait of Joe Biden. \n\n“There’s nothing nuttier than the plaques underneath the presidents,” Rogan said. \n\nThe podcaster said the White House should be more like a museum and feature neutral factual information about the presidents, before accusing the Trump administration of failing to check the president’s more outlandish ideas.\n\n “You can’t just let someone f***ing fully swim in it like that,” Rogan said. “He needs like a right-hand man.”\n\nSegura said such antics were a sign that Trump, 79, was mentally “losing it.”\n\n“I think everybody does when you get to a certain age,” Rogan replied. \n\nThe Independent has contacted the White House for comment.\n\nPresident Trump has shown an unusual focus on redecorating the White House, adding scores of gold trim to the Oval Office and other well-known areas, while demolishing parts of the East Wing to build a new ballroom. \n\nThe Trump administration, meanwhile, has shown a zeal for renaming things according to the wishes of the president and his allies, even if they lack clear authority to do so.\n\nThe White House now insists on referring to the Pentagon as the Department of War, and has signed an executive order to that effect, even though an act of Congress is required to officially rename a federal department. \n\nThe president has also introduced a “Trump gold card” immigration program, granting permanent residency to individuals who pay the government $1 million, though critics say he lacks the authority to carry out what amounts to a unilateral change in immigration law.\n\nThe administration also renamed the State Department’s Institute of Peace the Donald J. Trump Institute of Peace, and Trump allies are reportedly pushing to feature Trump’s name on the new Washington Commanders NFL stadium, the Washington Dulles International Airport, and a $1 coin.","summary":"Trump’s new White House plaques call Obama ‘one of the most divisive political figures in American history’ and Biden the ‘worst’ ever president","url":"https://www.independent.co.uk/news/world/americas/us-politics/joe-rogan-tom-segura-trump-kennedy-center-plaques-b2890319.html","image":"https://static.independent.co.uk/2025/12/17/21/13/Trump-jlt0hrea.jpeg?crop=5412,3608,x0,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/JQfAfU6f-OhrQWqOm.mp4","publish_date":"2025-12-24 23:57:47","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.145},{"id":388839064,"title":"Kim Jong Un inspects nuclear submarine plant, oversees test of new anti-air missiles","text":"US President Donald Trump approved South Korea’s plan to develop nuclear-powered submarines during his visit to the country in October, a move that provoked strong condemnation from nuclear-armed North Korea.\n\nKey aspects of the project, including where the submarines would be constructed, remain unclear. Only a small number of nations operate nuclear-powered submarines, and the United States treats the technology as one of its most closely guarded military secrets.\n\nIn its first public reaction to the US–South Korea agreement last month, a KCNA commentary described the initiative as a “dangerous attempt at confrontation” and warned it could trigger a “nuclear domino phenomenon”.\n\nKCNA reported that Kim Jong Un said on Wednesday the current “negative security situation” made it an “urgent task and indispensable option” to accelerate the “nuclear weaponization of the naval force”.\n\nDuring the visit, Kim was briefed on research into “new underwater secret weapons” and “clarified a strategic plan for reorganizing the naval forces and establishing new units”, according to KCNA, without providing further details.\n\nSeparately, KCNA said Kim also supervised the test of “new-type high-altitude long-range anti-air missiles” over the East Sea, also known as the Sea of Japan.\n\n“The launched missiles accurately hit the mock targets at an altitude of 200 km,” KCNA said, a height that, if accurate, would place the test in space.\n\n“The respected Comrade Kim Jong Un extended congratulations on the successful test-fire,” KCNA added.","url":"https://www.moneycontrol.com/world/kim-jong-un-inspects-nuclear-submarine-plant-oversees-test-of-new-anti-air-missiles-article-13742107.html","image":"https://images.moneycontrol.com/static-mcnews/2025/12/20251224235629_kimjong.png","video":null,"publish_date":"2025-12-24 23:56:57","author":"Moneycontrol World Desk","authors":["Moneycontrol World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.314},{"id":388838704,"title":"Vì sao Tổng thống Donald Trump muốn Greenland?","text":"Tổng thống Donald Trump tuyên bố Mỹ cần Greenland vì an ninh quốc gia, bất chấp sự phản đối mạnh mẽ của Đan Mạch. \n\n Cờ của Greenland ở thủ phủ Nuuk , Greenland (Ảnh: Reuters). \n\n Tổng thống Donald Trump ngày 22/12 tái khẳng định Mỹ cần Greenland cho an ninh quốc gia, đồng thời cho biết một đặc phái viên mới được bổ nhiệm sẽ “dẫn đầu” nỗ lực giành quyền kiểm soát hòn đảo tự trị của Đan Mạch. Động thái này của Mỹ đã vấp phải sự chỉ trích gay gắt từ Đan Mạch và Greenland. \n\n Vì sao Tổng thống Trump muốn Greenland? \n\n Vị trí chiến lược và tài nguyên của Greenland có thể mang lại lợi ích cho Mỹ. Hòn đảo lớn nhất thế giới nằm dọc theo tuyến đường ngắn nhất từ ​​châu Âu đến Bắc Mỹ, đóng vai trò rất quan trọng đối với hệ thống cảnh báo tên lửa đạn đạo của Mỹ. \n\n Mỹ đã bày tỏ sự quan tâm đến việc mở rộng hiện diện quân sự trên hòn đảo Bắc Cực, bao gồm việc đặt radar tại đây để giám sát vùng biển giữa Greenland, Iceland và Anh, nơi các tàu hải quân và tàu ngầm hạt nhân của Nga thường hoạt động. \n\n “Chúng ta cần Greenland vì an ninh quốc gia, chứ không phải vì khoáng sản… Nếu nhìn vào Greenland, nhìn dọc theo bờ biển, các bạn sẽ thấy tàu Nga và Trung Quốc ở khắp mọi nơi”, Tổng thống Trump nói với các phóng viên. \n\n Dữ liệu vận tải cho thấy hầu hết hoạt động vận tải biển của Trung Quốc ở vùng biển Bắc Cực tập trung ở Thái Bình Dương và Tuyến đường biển phía Bắc gần Nga. Hầu hết hoạt động vận tải biển của Nga ở Bắc Cực diễn ra xung quanh bờ biển của chính Nga, mặc dù các nhà phân tích cho rằng tàu ngầm Nga thường xuyên di chuyển qua vùng biển giữa Greenland, Iceland và Anh. \n\n Nhìn rộng hơn, Bắc Cực được cho là ngày càng bị “quân sự hóa” với các quốc gia thành viên NATO, Trung Quốc và Nga đều đang mở rộng hoạt động tại đây. Đảo Greenland, với thủ phủ Nuuk nằm gần New York hơn thủ đô Copenhagen của Đan Mạch, sở hữu nguồn tài nguyên khoáng sản, dầu mỏ và khí đốt tự nhiên dồi dào, nhưng quá trình phát triển diễn ra chậm và ngành khai thác mỏ chỉ nhận được rất ít đầu tư từ Mỹ. \n\n Sự hiện diện của Mỹ \n\n Quân đội Mỹ duy trì sự hiện diện thường trực tại căn cứ không quân Pituffik ở phía tây bắc Greenland. \n\n Video đang HOT \n\n Một thỏa thuận vào năm 1951 giữa Mỹ và Đan Mạch cho phép Mỹ tự do di chuyển và xây dựng các căn cứ quân sự ở Greenland, miễn là Đan Mạch và Greenland được thông báo. \n\n Theo Kristian Soeby Kristensen, nhà nghiên cứu cấp cao tại Trung tâm Nghiên cứu Quân sự của Đại học Copenhagen, trong lịch sử, Đan Mạch từng nhượng bộ Mỹ vì Copenhagen không có khả năng phòng thủ Greenland, và vì những đảm bảo an ninh của Mỹ dành cho Đan Mạch thông qua NATO. \n\n Phó Tổng thống Mỹ JD Vance tham quan Căn cứ Không gian Pituffik của quân đội Mỹ tại Greenland vào tháng 3 (Ảnh: Reuters). \n\n Hiện trạng của Greenland \n\n Hòn đảo Greenland, một thuộc địa cũ của Đan Mạch, đã trở thành lãnh thổ chính thức của quốc gia Bắc Âu vào năm 1953 và chịu sự điều chỉnh của hiến pháp Đan Mạch. \n\n Năm 2009, hòn đảo được trao quyền tự trị rộng rãi, bao gồm cả quyền tuyên bố độc lập khỏi Đan Mạch thông qua một cuộc trưng cầu dân ý. \n\n Theo luật năm 2009, cơ quan lập pháp Greenland, Inatsisartut, có thể viện dẫn một điều khoản cho phép Đan Mạch và Greenland bắt đầu đàm phán về việc đạt được nền độc lập hoàn toàn. \n\n Người dân Greenland có thể quyết định nền độc lập trong một cuộc trưng cầu dân ý, và một thỏa thuận về tình trạng độc lập giữa Đan Mạch và Greenland, nếu xảy ra, cũng cần sự chấp thuận của quốc hội Đan Mạch. \n\n Nếu độc lập, Greenland có thể lựa chọn liên kết với Mỹ mà không cần trở thành lãnh thổ của Mỹ. \n\n Hòn đảo này có thể hình thành một “liên kết tự do” với Mỹ, trong đó các khoản trợ cấp của Đan Mạch sẽ được thay thế bằng sự hỗ trợ và bảo vệ của Mỹ để đổi lấy các quyền về quân sự, một mô hình tương tự như Quần đảo Marshall, Micronesia và Palau. \n\n Thăm dò dư luận Greenland \n\n Quan hệ giữa Greenland và Đan Mạch đã trở nên căng thẳng do những vấn đề trong lịch sử dưới thời thuộc địa. Tuy nhiên, sự quan tâm của Tổng thống Trump đối với hòn đảo này đã thúc đẩy Đan Mạch nỗ lực hơn nữa để cải thiện quan hệ với Greenland. \n\n Các cuộc thăm dò cho thấy phần lớn trong số 57.000 cư dân của Greenland ủng hộ độc lập, nhưng nhiều người Greenland cảnh báo không nên hành động vội vàng. Họ lo sợ Greenland có thể trở nên tồi tệ hơn và dễ bị Mỹ gây sức ép nếu quá nhanh chóng tìm kiếm độc lập khỏi Đan Mạch. \n\n Nền kinh tế của Greenland phụ thuộc vào ngành đánh bắt cá, chiếm hơn 95% xuất khẩu, và các khoản trợ cấp hàng năm từ Đan Mạch, chiếm khoảng một nửa ngân sách. \n\n Vị trí Greenland (Ảnh: Guardian). \n\n Động thái của Tổng thống Trump \n\n Tổng thống Trump đã bổ nhiệm Thống đốc bang Louisiana, ông Jeff Landry, làm đặc phái viên về Greenland. Điều này đã vấp phải sự chỉ trích từ Đan Mạch và Greenland. \n\n Ông Landry công khai ủng hộ ý tưởng Greenland trở thành một phần của Mỹ. \n\n Các thành viên của lực lượng vũ trang Đan Mạch tập trận chung với các nước ở Kangerlussuaq, Greenland vào tháng 9 (Ảnh: Reuters). \n\n Phản ứng của Đan Mạch và Greenland \n\n Khi ông Trump đề nghị mua đảo Greenland trong nhiệm kỳ tổng thống đầu tiên, Thủ tướng Đan Mạch Mette Frederiksen đã gọi đây là quyết định “vô lý”. \n\n Trong tuyên bố chung vào ngày 22/12, Thủ tướng Frederiksen và Thủ hiến Greenland Jens-Frederik Nielsen khẳng định Greenland thuộc về người dân Greenland. \n\n “Không thể sáp nhập một quốc gia khác, ngay cả khi viện dẫn lý do an ninh quốc tế”, hai nhà lãnh đạo nói, gửi thông điệp tới Tổng thống Mỹ. \n\n Ngoại trưởng Đan Mạch Lars Lokke Rasmussen đã triệu tập đại sứ Mỹ sau quyết định bổ nhiệm đặc phái viên về Greenland. Sau đó, ông Rasmussen cho biết đại diện của Đan Mạch và Greenland đã “vạch ra lằn ranh đỏ” với đại sứ Mỹ. \n\n Đan Mạch triệu Đại biện lâm thời Mỹ liên quan vấn đề Greenland Ngày 27/8, Đan Mạch đã triệu Đại biện lâm thời Mỹ sau thông tin cho rằng ít nhất 3 quan chức Mỹ trong chính quyền Tổng thống Donald Trump tiến hành các hoạt động nhằm gây ảnh hưởng tại Greenland - vùng lãnh thổ tự trị thuộc Đan Mạch. Quang cảnh thị trấn Kulusuk thuộc đảo Greenland, Đan Mạch. Ảnh tư liệu: Getty...","summary":"Tổng thống Donald Trump tuyên bố Mỹ cần Greenland vì an ninh quốc gia, bất chấp sự phản đối mạnh mẽ của Đan Mạch.","url":"https://vietgiaitri.com/vi-sao-tong-thong-donald-trump-muon-greenland-20251225i7604426/","image":"https://t.vietgiaitri.com/2025/12/9/no-lien-tiep-gan-hien-truong-vu-am-sat-tuong-nga-o-moscow-700x504-ae9-7604426.webp","video":null,"publish_date":"2025-12-24 23:56:46","author":"Thành Đạt","authors":["Thành Đạt"],"language":"en","category":"politics","source_country":"vn","sentiment":-0.985},{"id":388842680,"title":"Palau to take up to 75 migrants from US after call on transfer of third-country nationals","text":"WASHINGTON - Palau will take up to 75 migrants from the US as the Pacific Island nation signed a memorandum of understanding with Washington on transfer of third-country nationals in return for additional US aid.\n\nUS Deputy Secretary of State Christopher Landau spoke to Palau President Surangel Whipps in a call on Dec 24 about transferring third-country nationals to Palau, the two sides said in separate statements, even as Palau’s lawmakers had rejected a previous request from Washington on the matter. \n\nPresident Donald Trump’s immigration policies, including his administration’s deportation drive, have been broadly condemned by human rights advocates on concerns about due process. The Trump administration has also sent hundreds of people to third countries to which they have no ties, a tactic that was rarely used in the past. \n\nMr Trump has said the measures are aimed at improving domestic security. \n\nPalau and the US signed an MOU “allowing up to 75 third country nationals, who have never been charged with a crime, to live and work in Palau, helping address local labor shortages in needed occupations,” the office of Palau’s president said.\n\n“In this regard, the United States granted US$7.5 million (S$9.65 million) to address the needs of relevant Palau public services,” the US statement said.\n\nThe US State Department and Palau also said Washington will give assistance of US$2 million to provide advisors to Palau who will help in security issues and an assistance of US$6 million for reforms related to Palau’s civil service pension plan.\n\nIn late July, Palau’s Congress said it “cannot accept” a US proposal for it to accept asylum seekers from other countries.\n\nPalau, with a population of 17,000, has a compact of free association with the US, which provides economic assistance in return for allowing American military access to its territory.\n\nPalau is not a signatory to the 1951 UN Refugee Convention.\n\nUS Catholic bishops have condemned Washington's immigration enforcement activities and in October, Pope Leo XIV lamented the mistreatment of immigrants.\n\nLast week, a federal judge signaled a willingness to again rule that the Trump administration cannot swiftly deport migrants to countries other than their own without providing meaningful notice and an opportunity for them to raise fears of persecution or torture if they are sent there. REUTERS","url":"https://www.straitstimes.com/world/united-states/palau-to-take-up-to-75-migrants-from-us-after-call-on-transfer-of-third-country-nationals","image":"https://cassette.sphdigital.com.sg/image/straitstimes/715f09a086b56902f849b1663153e9f7226f84df78a6431363c39e3cd19ccc44","video":null,"publish_date":"2025-12-24 23:54:04","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","source_country":"sg","sentiment":-0.156},{"id":388837934,"title":"US Department of Justice gets more documents as part of Epstein case files","text":"WASHINGTON, December 25. /TASS/. The US Department of Justice said it had received more documents related to the case of financier Jeffrey Epstein, who was accused of sexually abusing minors, but it will take several weeks to review and publish them.\n\n\"The US Attorney for the Southern District of New York and the FBI have informed the Department of Justice that they have uncovered over a million more documents potentially related to the Jeffrey Epstein case,\" the Justice Department said.\n\n\"The DOJ has received these documents from SDNY and the FBI to review them for release, in compliance with the Epstein Files Transparency Act, existing statutes, and judicial orders. We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible. Due to the mass volume of material, this process may take a few more weeks,\" the statement reads.\n\nAxios reported on December 23 that US President Donald Trump’s administration plans to check and publish approximately 700,000 pages of documents related to the Epstein case within roughly a week. A US official told the portal that the Department of Justice had already published some 750,000 documents related to the case. About 200 DoJ staffers were charged with pre-publication checks.\n\nThe documents that have already been published indicate that Trump flew on Epstein’s jet eight times, although the US president had denied this. However, Axios emphasized that this fact does not indicate any wrongdoing on the part of Trump.\n\nEpstein was detained by New York State law enforcement on July 6, 2019. The prosecutor’s office said there was evidence that in 2002-2005 he brought dozens of underage girls to his Manhattan home, the youngest of whom was 14. Epstein’s friends and acquaintances included a large number of current and retired officials not only from the United States, but from many other countries, including former heads of state, major entrepreneurs, and show business stars. Criminal proceedings against the financier in the United States were terminated after he took his own life in a prison cell in August 2019.","summary":"Their release may take a few more weeks","url":"https://tass.com/world/2064385","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-12-24 23:53:08","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.355},{"id":388841266,"title":"Trump takes NORAD Santa calls with children, praises 'clean, beautiful coal' and 'high-IQ' person","text":"President Donald Trump and first lady Melania Trump spoke with several children on Christmas Eve as Santa Claus made his rounds across the globe, praising \"clean, beautiful coal\" and referring to one child as a \"high-IQ person.\" The pair joined the North American Aerospace Defense Command (NORAD) Santa Tracker hotline from Mar-a-Lago club in Palm Beach, Florida, where they fielded calls from kids about what they hoped St. Nick would bring them for Christmas. One child spoke to Trump about wanting a Kindle, the e-reader designed and marketed by Amazon. INSIDE THE WHITE HOUSE CHRISTMAS CARD TRADITION – FROM COOLIDGE TO TRUMP \"That's pretty good. You must be a high-IQ person. We need more high-IQ people in the country,\" he replied. One 8-year-old North Carolina girl asked if Santa would be upset if she didn't leave him cookies. \"I think he won't get mad, but I think he'll be very disappointed,\" said Trump. \"Santa tends to be a little on the cherubic side.\" Trump asked one child in Kansas for a Christmas wish. \"Um, not coal,\" the child replied. MELANIA TRUMP GIVES UPLIFTING MESSAGE ABOUT SANTA TO YOUNG KIDS AT HOSPITAL \"Not coal. No, you don’t want coal. You mean clean, beautiful coal. I had to do that, I’m sorry,\" Trump said. \"No, coal is clean and beautiful. Please remember that at all costs,\" he added. \"But you don’t want clean, beautiful coal, right? What would you like?\" Trump has frequently referred to coal as \"clean\" and \"beautiful\" in an effort to boost its use. During a call with a child in Oklahoma, he said he was fond of the state, which he won in the 2024 presidential election. \"Santa loves you. Santa loves Oklahoma like I do. You know, Oklahoma was very good to me in the election. So, I love Oklahoma. Don’t ever leave Oklahoma, OK?\" he said. During the same call, Trump talked about tracking Santa. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"We track Santa all over the world. ... We want to make sure that he's not infiltrated — that we're not infiltrating into our country a bad Santa,\" he said. \"We found that Santa is Good!\"","summary":"President Donald Trump told kids they&apos;re &quot;high IQ&quot; and praised &quot;clean, beautiful coal&quot; during Christmas Eve NORAD Santa tracker calls from Mar-a-Lago with Melania.","url":"https://www.foxnews.com/politics/trump-takes-norad-santa-calls-children-praises-clean-beautiful-coal-high-iq-person","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/trump-norad-charistmas-calls.jpg","video":null,"publish_date":"2025-12-24 23:51:54","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","source_country":"US","sentiment":-0.008},{"id":388843498,"title":"DOJ says a million more potential Epstein documents were found","text":"STORY: The U.S. Justice Department said on Wednesday that more than a million more documents potentially tied to convicted sex offender Jeffrey Epstein have been found. The new discovery is expected to delay the full release of the files for weeks. To comply with a law passed by Congress last month, President Donald Trump's administration began releasing files related to the criminal investigation of the late American financier, who was friends with Trump in the 1990s. So far, releases have contained extensive redactions, angering some Republicans and doing little to defuse a scandal threatening the party ahead of the 2026 midterm elections. In a message shared on social media, the DOJ said the additional documents had been uncovered by the FBI and the U.S. Attorney's office in Manhattan, without elaborating on when or how the documents were found.","url":"https://www.marketscreener.com/news/doj-says-a-million-more-potential-epstein-documents-were-found-ce7e59dadc8af220","image":"https://cdn.zonebourse.com/static/resize/1200/675//images/reuters/2025-07-04T140834Z_1_LYNXMPEL630MD_RTROPTP_3_USA-STOCKS.JPG","video":null,"publish_date":"2025-12-24 23:50:30","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.473},{"id":388839044,"title":"Trump takes NORAD Santa calls from kids. Here's what he said.","text":"It's Christmas Eve in Mar-a-Lago, and the first couple talked with children as part of NORAD's Santa calls.\n\nPresident Donald Trump and first lady Melania Trump participated in the longstanding holiday tradition for over 20 minutes, seated in gold-trimmed armchairs near a Christmas tree. The president spoke to families on speakerphone while the first lady chatted with children on a handset.\n\nTrump asked children what they wanted from Santa Claus, peppered praise for states that he won in the 2024 election, and touted the most recent GDP report in banter with reporters in the room. \"Great numbers, great financials. I don’t think the kids are too interested in that,\" Trump said.\n\nAmong the comments Trump made to children:\n\nWhen asked by a child from Oklahoma why Santa Claus is being tracked, he said: \"We want to make sure that he's not infiltrated, that we are not infiltrating into our country a bad Santa.\" He also told the child, \"Don’t ever leave Oklahoma.\"After being told that a child did not want coal as a gift, he responded: \"You mean clean, beautiful coal. I had to do that, I'm sorry.\" He added to \"please remember at all costs\" that coal is \"clean and beautiful.\"When answering the phone for a child in Pennsylvania, Trump claimed that he won the state \"actually, three times.\" Trump lost the state in the 2020 election.\n\nTrump took six calls and said he \"could do this all day long\" before adding that he had to return to working on international matters.\n\n70 years of tracking Santa, all thanks to an ad\n\nTrack Santa Claus for Christmas 2025\n\nUSA TODAY is tracking the whereabouts of Santa Claus on Christmas Eve. You can watch the stream here or on our YouTube channel.","url":"https://eu.usatoday.com/story/news/politics/2025/12/24/donald-trump-melania-norad-santa-christmas-eve-calls/87911347007/","image":"https://www.gannett-cdn.com/authoring/authoring-images/2025/12/24/USAT/87911523007-20251224-t-221033-z-1750386320-rc-2-aniap-4-e-25-rtrmadp-3-usatrump.JPG?auto=webp&crop=4638,2609,x0,y748&format=pjpg&width=1200","video":null,"publish_date":"2025-12-24 23:43:08","author":"Usa Today","authors":["Usa Today"],"language":"en","source_country":"us","sentiment":-0.46},{"id":388838934,"title":"Trump-backed candidate Asfura declared new president of Honduras","text":"Donald Trump-backed candidate Nasry “Tito” Asfura has been declared the winner of Honduras’s presidential election after a vote count that dragged on for almost a month and was marred by fraud allegations and criticism of interference by the US president.\n\nThe rightwing Asfura, 67, a construction magnate and former mayor of the capital, Tegucigalpa, secured 40.27% of the vote, against 39.53% for the centre-right Salvador Nasralla, a margin of just 28,000 votes.\n\nThe electoral council proclaimed a winner before completing the review of all tally sheets under a “special scrutiny” launched last week earlier to recount votes flagged as “inconsistent”. The decision was criticised by defeated candidates and lamented by the Organization of American States, which sent an observation mission to the election held on 30 November but whose vote count had remained unresolved since then.\n\nAsfura has already declared himself president-elect. “Honduras, we now have the official declaration from the CNE [electoral council]. I recognise the great work carried out by the councillors and the entire team that ran the election. Honduras: I am ready to govern. I will not let you down. God bless Honduras,” he wrote.\n\nNasralla refused to concede and posted a series of statements alleging fraud in the counting process, including “forgery of public documents”, claiming that “the data from the original tally sheets were altered”.\n\nThe electoral council is made up of three councillors: one aligned with Asfura’s party, one with Nasralla’s, and one with the party of the leftist president, Xiomara Castro, whose candidate finished third. Asfura’s victory was declared only by the first two councillors.\n\nThe representative linked to the president’s party refused to recognise the result, alleged that an “electoral coup” was under way and filed a complaint with the public prosecutor’s office, raising the prospect that the outcome will be challenged in court.\n\nIn its statement, the council said: “By the majority will of the Honduran people, expressed sovereignly at the ballot box, the full council of the CNE declares Nasry Juan Asfura Zablah constitutional president of the Republic of Honduras for the four-year term beginning on 27 January 2026 and ending on 27 January 2030.”\n\nThe declaration before the end of the recount was the latest in a string of controversies that marked the Central American country’s presidential race, starting with what many saw as open interference by the US president.\n\nDays before the vote, Trump publicly backed Asfura, said the US would support the next government only if he won, and attacked the other leading candidates, calling them communists or allies of Venezuela’s dictator, Nicolás Maduro.\n\nOn the eve of the election, the US president also announced a pardon for the former Honduran president and Asfura ally Juan Orlando Hernández, who had been sentenced to 45 years in prison for allegedly creating “a cocaine superhighway to the United States”.\n\nThe US secretary of state, Marco Rubio, congratulated Asfura on social media. “The people of Honduras have spoken: Nasry Asfura is Honduras’ next president,” said Rubio. “The United States congratulates president-elect Asfura and looks forward to working with his administration to advance prosperity and security in our hemisphere.”","url":"https://uk.news.yahoo.com/trump-backed-candidate-asfura-declared-234232177.html","image":"https://s.yimg.com/ny/api/res/1.2/SMxiy0p2u5oXtkyZCsgxmw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xOTE4O2NmPXdlYnA-/https://media.zenfs.com/en/theguardian_763/6fd33acd06d66d4a5e27271a82eb0213","video":null,"publish_date":"2025-12-24 23:42:32","author":"Tiago Rogero South America Correspondent","authors":["Tiago Rogero South America Correspondent"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.225},{"id":388834202,"title":"Trump-backed Nasry Asfura wins presidential elections in Honduras","text":"Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country's election council said, as reported by Al Jazeera. According to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.According to Al Jazeera, Asfura was backed by United States President Donald Trump. In a social media post, Asfura said, \"Honduras: I am prepared to govern. I will not fail you.\"Donald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.\n\nUS Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.\"The people of Honduras have spoken: Nasry Asfura is Honduras' next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,\" Rubio said on X.In a separate statement, Rubio urged \"all parties to respect the confirmed results\" of the elections.\"The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras' National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,\" Rubio said.Deputy Secretary Christopher Landau also posted on X, \"Congratulations to President-elect Nasry 'Tito' Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.\"Earlier this month, Trump had also pardoned former Honduran President and a member of Asfura's National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)","url":"https://www.aninews.in/news/world/others/trump-backed-nasry-asfura-wins-presidential-elections-in-honduras20251225051037","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251224233932.jpg","video":null,"publish_date":"2025-12-24 23:40:37","author":"Al Jazeera","authors":["Al Jazeera"],"language":"en","category":"politics","source_country":"in","sentiment":0.299},{"id":388832828,"title":"Trump-backed Nasry Asfura wins presidential elections in Honduras","text":"Tegucigalpa [Honduras], December 25 (ANI): Nasry Asfura, a conservative candidate, has won the presidential elections in Honduras, the country's election council said, as reported by Al Jazeera. According to the Consejo Nacional Electoral, the electoral authority in the North American country, Asfura won 40.3 per cent of the vote in the closely contested polls, defeating centre-right Liberal Party candidate Salvador Nasralla, who received 39.5 per cent of the votes.According to Al Jazeera, Asfura was backed by United States President Donald Trump. In a social media post, Asfura said, \"Honduras: I am prepared to govern. I will not fail you.\"Donald Trump had supported Asfura, attacking Nasralla and left-wing candidate Rixi Moncada, who ended up winning 20 per cent of the votes.\n\nUS Secretary of State Marco Rubio congratulated Nasry Asfura, saying that Washington DC is looking forward to working with him.\"The people of Honduras have spoken: Nasry Asfura is Honduras' next president. The United States congratulates President-Elect @titoasfura @papialaordenh and looks forward to working with his administration to advance prosperity and security in our hemisphere,\" Rubio said on X.In a separate statement, Rubio urged \"all parties to respect the confirmed results\" of the elections.\"The United States congratulates President-Elect Nasry Asfura of Honduras on his clear electoral victory, confirmed by Honduras' National Electoral Council. We look forward to working with his incoming administration to advance our bilateral and regional security cooperation, end illegal immigration to the United States, and strengthen the economic ties between our two countries. The United States urges all parties to respect the confirmed results so that Honduran authorities may swiftly ensure a peaceful transition of authority to President-Elect Nasry Asfura,\" Rubio said.Deputy Secretary Christopher Landau also posted on X, \"Congratulations to President-elect Nasry 'Tito' Asfura @titoasfura and the great people of Honduras on a successful and hard-fought election. The US looks forward to working closely with the new Asfura Administration.\"Earlier this month, Trump had also pardoned former Honduran President and a member of Asfura's National Party, Juan Orlando Hernandez, who was serving a sentence in the US in a drug trafficking case, Al Jazeera reported. (ANI)","url":"https://aninews.in/news/world/others/trump-backed-nasry-asfura-wins-presidential-elections-in-honduras20251225051037","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251224233932.jpg","video":null,"publish_date":"2025-12-24 23:40:37","author":"Al Jazeera","authors":["Al Jazeera"],"language":"en","category":"politics","source_country":"in","sentiment":0.299},{"id":388842632,"title":"US judge clears Trump&#039;s $100,000 H-1B visa fee, dealing a blow to tech firms","text":"The Trump administration can move ahead with a USD 100,000 fee on new H-1B visa applications, a federal judge ruled, handing a setback to US technology companies and other employers that rely heavily on skilled foreign workers.US District Judge Beryl Howell said President Donald Trump acted within his legal authority when he ordered the sharp increase in the cost of the popular visa programme. The decision bolsters the administration’s broader push to curb immigration and shift hiring toward US workers.The ruling allows the administration to proceed with the fee while legal challenges continue. The US Chamber of Commerce, which sued to block the measure, can appeal. Howell is an appointee of Democratic former President Barack Obama.Howell rejected the Chamber’s argument that Trump lacked the power to impose such a fee, finding that the proclamation was issued under “an express statutory grant of authority to the President.”.preferred-source-banner{ margin-top: 10px; margin-bottom:10px;}She said Congress has given the president broad discretion to act when addressing issues he views as tied to economic and national security concerns.“Congress has given the president broad authority that he used to address, in the manner he sees fit, a problem he perceives to be a matter of economic and national security,” Howell wrote.“The parties’ vigorous debate over the ultimate wisdom of this political judgment is not within the province of the courts,” Howell wrote. “So long as the actions dictated by the policy decision and articulated in the Proclamation fit within the confines of the law, the Proclamation must be upheld.”The Chamber warned that the fee would make H-1B visas prohibitively expensive for many employers, particularly smaller companies.“We are disappointed in the court’s decision and are considering further legal options to ensure that the H-1B visa program can operate as Congress intended,” said Daryl Joseffer, the Chamber’s executive vice president and chief counsel. He said the programme is meant to help US businesses access global talent needed to grow.The H-1B programme allows employers to hire foreign workers in specialised fields such as technology, engineering and health care. It currently offers 65,000 visas each year, plus an additional 20,000 for workers with advanced degrees. Until now, associated fees typically ranged from about USD 2,000 to USD 5,000.The ruling does not end the legal fight. Other lawsuits challenging the fee remain active, including cases brought by Democratic-led states, unions and a global nurse-staffing agency. Another judge could still block the policy in the coming months, and the dispute is widely expected to end up before the US Supreme Court.TRUMP REVAMPS H-1B VISAS, SCRAPS LOTTERY SYSTEMMeanwhile, the Trump administration has announced a sweeping change to the H-1B visa programme, replacing the long-used lottery system with a weighted model that favours higher-skilled and higher-paid foreign workers.The new rule, set to take effect on February 26, 2026, will apply to the fiscal year 2027 registration cycle and beyond. It will govern how tens of thousands of H-1B visas are awarded each year.Under the overhaul, visas will no longer be distributed randomly when applications exceed the annual cap. Instead, priority will be given to applicants with stronger qualifications and higher wages, a shift the administration says is aimed at attracting top global talent.Officials say the new approach is intended to better align the visa programme with labor market needs while reducing reliance on chance in the selection process.- EndsWith inputs from agenciesPublished By: Aashish VashisthaPublished On: Dec 25, 2025Tune InMust Watch","url":"https://www.indiatoday.in/world/us-news/story/us-judge-clears-trumps-100000-h-1b-visa-fee-dealing-a-blow-to-tech-firms-glbs-2841409-2025-12-25","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202512/us-scraps-h-1b-lottery-system-what-indian-students-and-workers-should-know-24030155-16x9_1.jpg?VersionId=0kZTnqnhDv.O2_nHO9X4mcQFC_mW3ID2?size=1280:720","video":null,"publish_date":"2025-12-24 23:40:04","author":"India Today World Desk","authors":["India Today World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.265},{"id":388841842,"title":"Trump warns against infiltration by a 'bad Santa' in calls with kids","text":"By WILL WEISSERT\n\nWEST PALM BEACH, Fla. (AP) — President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participa ...","url":"https://www.baltimoresun.com/2025/12/24/trump-santa/","image":"https://www.baltimoresun.com/wp-content/uploads/2025/12/Trump_78882-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-24 23:38:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.811},{"id":388840002,"title":"Trump warns against infiltration by a 'bad Santa' in calls with kids","text":"By WILL WEISSERT\n\nWEST PALM BEACH, Fla. (AP) — President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participa ...","url":"https://www.pilotonline.com/2025/12/24/trump-santa/","image":"https://www.pilotonline.com/wp-content/uploads/2025/12/Trump_78882-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-24 23:38:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.811},{"id":388844358,"title":"Trump warns against infiltration by a 'bad Santa' in calls with kids","text":"By WILL WEISSERT\n\nWEST PALM BEACH, Fla. (AP) — President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participa ...","url":"https://www.courant.com/2025/12/24/trump-santa/","image":"https://www.courant.com/wp-content/uploads/2025/12/Trump_78882-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-24 23:38:57","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.811},{"id":388838270,"title":"Trump warns against infiltration by a 'bad Santa' in calls with kids","text":"By WILL WEISSERT\n\nWEST PALM BEACH, Fla. (AP) — President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump p ...","url":"https://www.sun-sentinel.com/2025/12/24/trump-santa/","image":"https://www.sun-sentinel.com/wp-content/uploads/2025/12/Trump_78882-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-12-24 23:38:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.811},{"id":388837920,"title":"Trump warns against infiltration by a ‘bad Santa,’ defends coal in jovial Christmas calls with kids","text":"By WILL WEISSERT\n\nWEST PALM BEACH, Fla. (AP) — President Donald Trump marked Christmas Eve by quizzing children calling in about what presents they were excited about receiving, while promising to not let a “bad Santa” infiltrate the country and even suggesting that a stocking full of coal may not be so bad.\n\nVacationing at his Mar-a-Lago estate in Florida, the president and first lady Melania Trump participated in the tradition of talking to youngsters dialing into the North American Aerospace Defense Command, which playfully tracks Santa’s progress around the globe.\n\n“We want to make sure that Santa is being good. Santa’s a very good person,” Trump said while speaking to kids ages 4 and 10 in Oklahoma. “We want to make sure that he’s not infiltrated, that we’re not infiltrating into our country a bad Santa.”\n\nHe didn’t elaborate.\n\nTrump has often marked Christmases past with criticisms of his political enemies, including in 2024, when he posted, “Merry Christmas to the Radical Left Lunatics.” During his first term, Trump wrote online early on Dec. 24, 2017, targeting a top FBI official he believed was biased against him, as well as the news media.\n\nBut Trump was in a jovial mood this time. He even said, I “could do this all day long,” but likely would have to get back to more pressing matters like efforts to quell the fighting in Russia’s war with Ukraine.\n\nWhen an 8-year-old from North Carolina, asked if Santa would be mad if no one leaves cookies out for him, Trump said he didn’t think so, “But I think he’ll be very disappointed.”\n\n“You know, Santa’s — he tends to be a little bit on the cherubic side. You know what cherubic means? A little on the heavy side,” Trump joked. “I think Santa would like some cookies.”\n\nThe president and first lady Melania Trump sat side-by-side and took about a dozen calls between them. At one point, while his wife was on the phone and Trump was waiting to be connected to another call, he noted how little attention she was paying to him: “She’s able to focus totally, without listening.”\n\nAsked by an 8-year-old girl in Kansas what she’d like Santa to bring, the answer came back, “Uh, not coal.”\n\n“You mean clean, beautiful coal?,” Trump replied, evoking a favored campaign slogan he’s long used when promising to revive domestic coal production.\n\n“I had to do that, I’m sorry,” the president added, laughing and even causing the first lady, who was on a separate call, to turn toward him and grin.\n\n“Coal is clean and beautiful. Please remember that, at all costs,” Trump said. “But you don’t want clean, beautiful coal, right?”\n\n“No,” the caller responded, saying she’d prefer a Barbie doll, clothes and candy.\n\nAssociated Press writer Darlene Superville contributed from Washington.","summary":"Trump defended “clean, beautiful coal” as a Christmas gift.","url":"https://www.twincities.com/2025/12/24/trump-santa/","image":"https://www.twincities.com/wp-content/uploads/2025/12/Trump_78882-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-24 23:38:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.161}]}