{"offset":0,"number":50,"available":6008,"news":[{"id":255148356,"title":"Harris and Walz start Georgia bus tour as Democrats’ hopes rise","text":"HINESVILLE, Georgia >> Democratic presidential candidate Kamala Harris and her running mate Tim Walz campaigned together on Wednesday in Georgia, a state that Democrats narrowly won in 2020 and could play a decisive role in this year’s election, with an appeal to young voters. The duo arrived to cheers in the band room at Liberty County High School, where students were seated with their instruments and with members of the football team and cheerleaders also present. “Our country is counting on you, all of you,” Harris told them. “You are leaders.” “Your generation … is what is going to propel us into the next era,” she said. Harris and Walz are riding a bus through southern Georgia, home to some of its largest Black populations and where the campaign has added staff and opened field offices. Liberty County, with a population of around 65,000, is about 40% Black and voted overwhelmingly for Joe Biden in 2020. The 2024 race has changed dramatically since Harris became her party’s candidate, and she hopes to galvanize Black voters who make up about one-third of Georgia’s electorate and will be crucial in the effort to win the state. Before President Joe Biden dropped his reelection bid last month and endorsed Vice President Harris, opinion polls showed Republican candidate Donald Trump with a clear lead in Georgia, and that some Black voters were disillusioned with Democrats. Since then, however, Harris has steadily gained ground in national polls and has been boosted by well over $500 million in donations. The latest polls compiled by FiveThirtyEight show Harris just behind Trump, 46.0% to 46.6% in Georgia, compared with about a 5 percentage point lead for Trump before Harris entered the race on July 21. A new Reuters/Ipsos poll on Tuesday showed that Harris has eroded Trump’s advantage on the economy and crime. Before the 2020 race, Georgia last backed a Democrat for president in 1992. If elected, Harris will be the first female president in U.S. history. As a Black and South Asian woman, she is seeking to shore up support for Democrats among Black voters and motivate new groups of voters. In Boston earlier on Wednesday, Walz made a pitch to the 350,000-member International Association of Firefighters, which has not joined other large unions in endorsing Harris. She has pledged support for labor rights and cutting taxes for the middle class, he said, while Trump blocked overtime benefits and opposed efforts to raise the minimum wage. “We’re going to need you with us to win that fight,” Walz said. “Sisters and brothers in labor, it’s time for you to step up to the plate.” Harris was expected to focus on the economy and abortion rights during the Georgia trip, including a pledge to lower consumer costs, a campaign official said. The tour will culminate with a Harris rally in the Savannah area on Thursday. It is Harris’ second Georgia trip since she became the Democratic candidate. A rally in Atlanta earlier this month featured hip-hop star Megan Thee Stallion and drew more than 10,000 people. Harris, 59, pledged then that Democrats will win the state, which has 16 Electoral College votes and is one of several swing states that can lean either to Republicans or Democrats. Democrats won it by less than 12,000 votes in 2020. Republicans have dramatically ramped up spending in Georgia and the Republican-controlled state election board added a new rule that voting rights advocates say could delay certification of the vote in November. Trump, 78, said in a social media post last week that winning Georgia “is so important to the success of our Party, and most importantly, our Country.” He is expected to campaign in the state several more times before Election Day on Nov. 5.","summary":"HINESVILLE, Georgia >> Democratic presidential candidate Kamala Harris and her running mate Tim Walz campaigned together on Wednesday in Georgia, a state that Democrats narrowly won in 2020 and could play a decisive role in this year&#8217;s election, with an appeal to young voters.","url":"https://www.staradvertiser.com/2024/08/28/breaking-news/harris-and-walz-start-georgia-bus-tour-as-democrats-hopes-rise/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-29T000151Z_995265912_RC2BP9AGAZJN_RTRMADP_3_USA-ELECTION-HARRIS.JPG","video":null,"publish_date":"2024-08-29 00:20:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.133},{"id":255148142,"title":"The Trump administration diminishes significance of incident in Arlington to reduce political consequences","text":"WASHINGTON — Former President Donald Trump’s campaign is playing down reports of an altercation during his visit to Arlington National Cemetery on Monday, a move that signals its concern about potential political fallout from the incident. “A nameless bureaucrat at Arlington whose job it is to preserve the dignity of the cemetery is doing the complete opposite in trying to make what was a very solemn and respectful event into something it was not,” said Trump campaign senior adviser Chris LaCivita, a retired Marine who was with Trump at the cemetery Monday. Trump has long portrayed himself as a champion of service members and veterans — an image bolstered by participants in Monday’s ceremony. But he has also created a pattern of disparaging service members that has led even some former aides to question the authenticity of his support for the military. The latest episode threatens to blunt his attacks on President Joe Biden and Vice President Kamala Harris over a 2021 terrorist assault at the so-called Abbey Gate of the Kabul airport, which killed 13 American service members. It was the third anniversary of the bombings, which occurred during the harried U.S. exit from Afghanistan, that took Trump to the Arlington burial ground, in the Virginia suburbs of Washington, on Monday. He laid a wreath at the Tomb of the Unknown Soldier to honor those who died in the bombings and then moved to Section 60, an area reserved for participants in the Iraq and Afghanistan wars. Trump was joined at both sites by family members of the men and women killed at Abbey Gate. The family members invited him to participate in the commemoration, and they wanted the moment to be documented, according to two people who were present. “I gave my permission,” Kelly Barnett, the mother of Marine Staff Sgt. Darin “Taylor” Hoover, told NBC News. “I wanted the memories. I wanted to make sure that my family at home — I have a huge family — I wanted to make sure that they were involved with it, as well, and they could see it and feel it, have the experience that we had. And so I said, yeah, in no uncertain terms, I was OK with it.” Trump posed for a photograph beside Hoover’s grave, smiling and giving a thumbs-up gesture in a shot that included the headstones of other service members who were not part of Monday’s ceremony. A federal regulation admonishes that memorial services at Army cemeteries “will not include partisan political activities.” NPR first reported Tuesday that two Trump campaign staffers had a confrontation with a cemetery official who tried to prevent them from filming. “We can confirm there was an incident, and a report was filed,” the cemetery said in a statement. Whatever happened, Barnett and another participant — who asked to remain anonymous without authorization to speak for the families — said they noticed nothing amiss. “We didn’t even hear about it until the next day,” the second participant said, who did not believe Trump’s participation amounted to campaign activity. “It wasn’t politicized,” this person said. Trump posted video that included clips from Monday’s ceremony to his TikTok account. In the video, he blamed Biden and Harris for the deaths at the Kabul airport. Trump, like most Republican presidential candidates in recent decades, has won the majority of voters who have served in the military, according to exit polls. But his edge was smaller in his defeat in 2020 — 54% to 44% — than when he won that part of the electorate 61% to 34% in taking the presidency in 2016. His aides have publicly dismissed the report of a physical interaction at the cemetery and accused Democrats of ignoring the anniversary, which is the most poignant reminder of a withdrawal that was politically damaging to Biden. “They’re trying to muddle the fact that there was only one commander in chief in Arlington on Aug. 26,” LaCivita said. He noted that Biden was on vacation and that Harris did not visit Arlington on the anniversary. Both of them issued statements. Neither Trump nor Harris, the Democratic presidential nominee, served in uniform. Their running mates, Sen. JD Vance, R-Ohio, and Gov. Tim Walz, D-Minn., did. Harris’ campaign declined to comment on the report of an altercation at Arlington, but its communications director, Michael Tyler, addressed it in a CNN interview Wednesday. “Frankly, I think this episode is pretty sad when it’s all said and done,” Tyler said. “Listen, this is what we’ve come to expect from Donald Trump and his team. Donald Trump is a person who wants to make everything all about Donald Trump. He’s also somebody who has a history of demeaning and degrading military service members, those who have given the ultimate sacrifice.” A Trump adviser who spoke with NBC News pointed to a statement signed by five Gold Star family members and two Purple Heart recipients who were with Trump on Monday defending him amid the firestorm. They said in the statement that they gave approval for Trump’s videographer and photographer to capture those moments so they could “cherish these memories forever.” “Everything involved in the day was at their invitation,” this person said. “It wasn’t a campaign event. It was an event done by the families of these people, and they invited the commander-in-chief who has consistently demonstrated strong and unwavering support for them and all service members and their families.” This person said that Trump was “grateful” for the invitation and that he would show “how committed he is when he’s back in the White House to ensure that the people who manufactured that insane and disastrous withdrawal are held accountable for it.” The Trump campaign’s handling of the episode after details leaked to the media raised some eyebrows among Republicans, particularly a statement in which communications director Steven Cheung said “an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump’s team during a very solemn ceremony.” A Republican operative, speaking on condition of anonymity, called the statement “so unprofessional.” A Trump ally, meanwhile, said the “behavior” outlined at the cemetery was “really out of character” for the campaign. For years, Trump has faced accusations of showing disrespect to veterans and service members. Early this year, he mocked the late Sen. John McCain, R-Ariz., for being unable to raise his arms because of injuries he sustained as a prisoner of war. In 2015, he also said McCain was not a “war hero” because “he was captured.” “I like people that weren’t captured,” he said at the time. McCain, a veteran of the Vietnam War, gained national recognition for his time as a prisoner of war in the infamous “Hanoi Hilton,” where he was tortured. This cycle, Trump also questioned why Nikki Haley’s husband was not with her on the campaign trail during the Republican primaries. Maj. Michael Haley was serving overseas at the time. Just this month, Trump described the Presidential Medal of Freedom, which is a civilian honor, as “much better” than the Medal of Honor, a military honor, because recipients of the latter are often deceased or severely injured. Former White House chief of staff John Kelly said last year his former boss denigrated veterans and service members as “suckers” and “losers,” confirming remarks that were published in The Atlantic years earlier. Trump has vehemently and repeatedly denied making such comments. Maryland Gov. Wes Moore, a Democrat and Army veteran, pointed to Trump’s comments about the Medal of Honor and the Presidential Medal of Freedom, adding that the episode at Arlington National Cemetery appeared to be a “continuation of something that I just find really problematic.” “There is this attacking of those with military service and this increasing politicization and disrespect for those who have chosen to serve this country,” he said, adding that he still wanted to learn more details about what happened between Trump’s staff and the cemetery official. At their convention last week, Democrats took Trump to task over military issues, emphasizing a theme of patriotism. Former Defense Secretary Leon Panetta said that Trump “does not understand the service and sacrifice of our military” and that he was the only president since World War II who has not “honored our veterans and their sacrifices.” But for Republicans, the episode served to further shine a light on what they see as one of the Biden administration’s biggest failings in Afghanistan, a key piece of their message on global instability over the past four years. “The veterans that I talk to feel disrespected and disappointed, certainly at their commander in chief, in the direction of the United States militarily,” Pennsylvania state Rep. Rob Mercuri, a veteran and congressional candidate in the 17th District, which is a swing district with a large veteran population. “The only thing I would say about President Trump is that his plan is to project strength. My view is that the Reagan Doctrine of peace through strength is really important to come back to.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON — Former President Donald Trump&#8217;s campaign is playing down reports of&#8230;\n\n\nThis Post: The Trump administration diminishes significance of incident in Arlington to reduce political consequences first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/the-trump-administration-diminishes-significance-of-incident-in-arlington-to-reduce-political-consequences/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-08/240827-donald-trump-arlington-se-1012p-fb8203.jpg","video":null,"publish_date":"2024-08-29 00:18:12","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.139},{"id":255148258,"title":"Harris and Trump locked in tight races in four key Sun Belt swing states, new poll shows ","text":"Vice President Kamala Harris and former President Donald Trump are within two percentage points of each other in four swing states that could decide the 2024 race, a poll released Wednesday showed. The Fox News survey found Harris holding slim leads in Arizona, Georgia and Nevada; and Trump topping Harris by a razor-thin margin in North Carolina. In Arizona, Harris garnered 50% support to Trump’s 49% backing. In both Georgia and Nevada, the vice president held a 2-point edge (50% to 48%) over the Republican nominee. In North Carolina, Trump has a 1-point advantage (50%-49%) over the Democratic nominee. The survey’s findings were all within the poll’s margin of error, suggesting that the four pivotal Sun Belt battleground states remain tossups 10 weeks away from Election Day. President Biden carried Arizona and Georgia in the 2020 election by less than a percentage point, and he won Nevada by just over 2 points. Meanwhile, Trump defeated Biden in North Carolina by just over 1 point in 2020. There are 49 Electoral College votes in play in the four swing states: 16 apiece in North Carolina and Georgia, 11 in Arizona and six in Nevada. The Fox News survey was conducted between Aug. 23-26, after the Democratic National Convention in Chicago, which was expected to give Harris a bump in polling. The Trump campaign dismissed the poll’s findings. “It’s that time of year again. Fox is releasing atrocious polling,” the campaign said in a statement. The campaign noted that the network’s polling was “off in North Carolina, Arizona, and Nevada” during the same time period in 2020, and “overstated” Biden’s support in Georgia in their only 2020 survey of the state, released that June. “President Trump continues to outperform polling from past cycles,” the campaign added. “President Trump is 10 points ahead of where he was in Arizona at this point in 2020, according to Fox. Likewise, he is running 8 points ahead of his 2020 polling in Nevada and 5 points ahead of his 2020 polling in North Carolina.” “We see the same trend nationwide.”","summary":"The Fox News survey found Harris holding slim leads in Arizona, Georgia and Nevada; and Trump topping Harris by a razor-thin margin in North Carolina. ","url":"https://nypost.com/2024/08/28/us-news/harris-and-trump-locked-in-tight-races-in-four-key-sun-belt-swing-states-new-poll-shows/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/88449929.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/01anG99L-RyIcpnTz.mp4","publish_date":"2024-08-29 00:14:29","author":"Victor Nava","authors":["Victor Nava"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.645},{"id":255148158,"title":"Star Trek actor Robert Picardo roasts Elon Musk's 'Let's make Starfleet Academy real!' post","text":"Star Trek actor Robert Picardo shut down Elon Musk after the SpaceX and Tesla owner proclaimed \"Let's make Starfleet Academy real!\" in a post on his social media app X. \"First step: Support a leader that embodies Starfleet values like diversity, inclusion and ethical behavior,\" Picardo replied. Musk is allied with former president and current Republican presidential candidate Donald Trump, and Musk's ownership of the social media platform prompted numerous celebrities to leave X amid a rise in hate speech on the app. Starfleet Academy is where the likes of Captain Kirk and Spock trained in the Star Trek universe. Picardo has played holographic character \"The Doctor\" and his creator, Lewis Zimmerman, since January 1995, when TV's Star Trek: Voyager premiered. He has appeared in the sci-fi franchise many times, including in TV shows such as Star Trek: Deep Space Nine in 1997 and Star Trek: Renegades in 2015 and movies including 1996's Star Trek: First Contact. He also voiced his characters in video games tied to the brand. \"It's a wonderful feeling to have, you know, a signature role as an actor that makes you known around the world, but that is a source of interest for the fans everywhere, that they happen to love Star Trek,\" Picardo told the official Star Trek website in July. \"When you join the franchise and they particularly like your character, it's a nice feeling of being welcomed into something larger than yourself, with a history, obviously, that predates my involvement, but that will go on forever after I'm gone.\" Picardo is scheduled to pop up on a new series, Star Trek: Starfleet Academy, which went into production this week. He will again portray the Doctor, alongside Star Trek vets Tig Notaro, Oded Fehr, and Mary Wiseman. Holly Hunter is joining the series too, as the captain and chancellor of the academy. The show follows a new class of cadets, played by actors including Kerrice Brooks, Karim Diané, George Hawkins, Sandro Rosta, Bella Shepard, and Zoë Steiner. Paul Giamatti and Gina Yashere will be recurring guest stars. Sign up for Entertainment Weekly's free daily newsletter to get breaking TV news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more.","summary":"Picardo has played the &#34;The Doctor&#34; in the franchise since 1995.","url":"https://ew.com/star-trek-voyager-actor-robert-picardo-roasts-elon-musk-call-to-make-starfleet-academy-real-8703559","image":"https://ew.com/thmb/nmKFH--allr8njpcmrpCqMYpyXE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Robert-Picardo-elon-musk-082824-5c2fab8962cf471886f193f852541ef3.jpg","video":"https://content.jwplatform.com/videos/bcmGZ1vP-GQ0UtFMY.mp4","publish_date":"2024-08-29 00:10:16","author":"Raechal Shewfelt","authors":["Raechal Shewfelt"],"language":"en","source_country":"US","sentiment":0.683},{"id":255148154,"title":"Utah Gov. Cox faces scrutiny for using military cemetery photo with Trump in campaign email","text":"Utah Republican Gov. Spencer Cox came under criticism Wednesday for sending a campaign email that included a photo of him and Donald Trump at Arlington National Cemetery during a wreath-laying ceremony. Federal law prohibits campaign or election-related activities within Army National Military Cemeteries and that rule was widely shared before the Monday ceremony, Arlington National Cemetery said Wednesday. Cox’s campaign apologized for using the photo and politicizing the graveside ceremony, which honored Sgt. Darin Taylor Hoover of Utah who was one of 13 who died in Afghanistan three years ago. The email was soliciting donations for his reelection bid. “This was not a campaign event and was never intended to be used by the campaign,” the governor wrote in a post on X. “It did not go through the proper channels and should not have been sent.” Trump's campaign faced its own blowback after an altercation between his staff and cemetery works. Trump’s campaign was warned about not taking photographs before the altercation at Arlington National Cemetery during a wreath-laying ceremony earlier this week to honor service members killed in the Afghanistan War withdrawal, a defense official told The Associated Press on Wednesday. Cox is expected to comfortably win his reelection in November in the Republican-dominated state after breezing to victory in the primary over an ardent Trump supporter, Phil Lyman, who espoused false claims of election fraud following the 2020 presidential election. The Republican governor recently surprised voters when he pledged his support to Trump after the president's July assassination attempt, despite saying days earlier on CNN that he hadn’t voted for Trump in 2016 or 2020 and would not cast a ballot for him again this year. Cox’s sudden embrace of Trump, who has not endorsed him back, represents a puzzling departure from his carefully curated persona as a Mitt Romney-esque moderate. In addition to critiques in the comment thread of his social media accounts, Cox’s opponent in November, Democratic state Rep. Brian King, said it was disrespectful for Trump and Cox to use a veterans’ memorial event as a campaign photo-op, and he called on the Republican governor to rescind his Trump endorsement.","summary":"Utah Republican Gov. Spencer Cox has came under fire for sending a campaign email that included a photo of him and Donald Trump at Arlington National Cemetery during a wreath-laying ceremony","url":"https://www.independent.co.uk/news/ap-trump-arlington-national-cemetery-republican-utah-b2603552.html","image":"https://static.independent.co.uk/2024/08/29/01/Election_2024_Utah_Governor_CemeteryI_ncident_11244.jpg?width=1200","video":null,"publish_date":"2024-08-29 00:07:18","author":"Hannah Schoenbaum","authors":["Hannah Schoenbaum"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.511},{"id":255148002,"title":"FBI reveals new details, no motive in Trump assassination attempt","text":"Aug. 28 (UPI) -- The Federal Bureau of Investigation on Wednesday released new details about the suspected shooter in last month's attempted assassination of former President Donald Trump, but was still unable to provide any clear motive for the attack after conducting hundreds of interviews, combing through Internet searches and analyzing video. The shooting, which killed a man at the July 13 Trump campaign rally in Butler, Pa., has focused on Thomas Matthew Crooks. The FBI said the 20-year-old gunman was \"hyper-focused\" on a \"target of opportunity,\" rather than any political ideology. \"I would say that we see no definitive ideology associated with our subject, either left-leaning or right-leaning,\" Kevin Rojek, special agent in charge of the FBI Pittsburgh Field Office, told reporters during a media call Wednesday. Crooks is reported to have conducted \"more than 60 searches related to former President Trump and President Biden within the month leading up to the attack,\" according to the FBI. Other online searches included, \"How far was Lee Harvey Oswald from John F. Kennedy\" and \"Where will Trump speak from at Butler Farm Show?\" according to officials. \"We saw through our analysis of all of his -- particularly his online searches -- a sustained detailed effort to plan an attack on some events, meaning he looked at any number of events or targets,\" Rojek said. \"And then, when this event was announced, the Trump rally was announced, early in July, he became hyper-focused on that specific event and looked at it as a target of opportunity.\" The FBI also released a photo of the improvised explosive device found inside Crooks' vehicle, adding that all of the explosive's components were \"readily available online\" and were purchased legally. Another photo showed the suspect's \"rifle broken down as was likely done for transport along with the backpack recovered onsite.\" According to surveillance video, Crooks climbed onto the roof of the AGR building just six minutes before he allegedly fired eight rounds at 6:11 p.m. and was killed by a Secret Service sniper, FBI officials said. One of the shots grazed Trump's ear, a supporter in the crowd was killed and several others were injured. FBI officials also revealed a toxicology report on Crooks' body showed no traces alcohol or illicit drugs. While the FBI said investigators have a \"clearer idea of mindset\" of the shooter, \"the FBI has not identified a motive, nor any co-conspirators or associates of Crooks with advanced knowledge of the attack,\" Bobby Wells, executive assistant director of the FBI's National Security Branch, told reporters. Wells added that \"we have not seen any indication that Crooks was directed by a foreign entity.\" Rojek also pushed back during the briefing on conspiracy theories surrounding the Trump assassination attempt, saying \"I can confirm that there was no second shooter.\"","summary":"The FBI released new details about the suspected shooter in last month's attempted assassination of former President Donald Trump in Pennsylvania, but was still unable to provide any clear motive for the attack.","url":"https://www.upi.com/Top_News/US/2024/08/28/fbi-details-Donald-Trump-assassination-attempt/7411724887718/","image":"https://cdnph.upi.com/ph/st/th/7411724887718/2024/upi_com/58f50f37737d4dc9feb5b5c41a399d9c/v1.2/FBI-reveals-new-details-no-motive-in-Trump-assassination-attempt.jpg","video":null,"publish_date":"2024-08-29 00:05:08","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.29},{"id":255148112,"title":"How Michigan voters feel about Kamala Harris run, RFK Jr. endorsing Trump","text":"How Michigan voters feel about Kamala Harris run, RFK Jr. endorsing Trump Voters in Michigan, a key battleground state in the 2024 election, express their thoughts on the race after Vice President Kamala Harris' campaign began. Also, a voter who followed Robert F. Kennedy Jr.'s campaign says he may elect former President Donald Trump after RFK Jr. suspended his campaign. CBS News' Jake Rosen reports.","summary":"Voters in Michigan, a key battleground state in the 2024 election, express their thoughts on the race after Vice President Kamala Harris' campaign began. Also, a voter who followed Robert F. Kennedy Jr.'s campaign says he may elect former President Donald Trump after RFK Jr. suspended his campaign. CBS News' Jake Rosen reports.","url":"https://www.cbsnews.com/video/how-michigan-voters-feel-about-kamala-harris-run-rfk-jr-endorsing-trump/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/29/e02f2533-7288-43c5-99e0-d3dcd70b45cb/thumbnail/1200x630/dae43d8b70a0f4dc87e79179bf63083e/cbsn-fusion-how-michigan-voters-feel-about-kamala-harris-run-rfk-jr-endorsing-trump-thumbnail.jpg?v=25685eaa472b1","video":null,"publish_date":"2024-08-29 00:05:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.513},{"id":255147572,"title":"WWE Hall of Famer Almost Resigned Because of Donald Trump","text":"The WWE Hall of Fame has a variety of honorees, ranging from former world champions like Macho Man Randy Savage to iconic managers like Paul Heyman.Then there's the celebrity wing.Celebrities have always had a part in professional wrestling, especially in the WWE. People like Andy Kaufman and Muhammad Ali definitely deserve their entries since they contributed to massive stories and actually wrestled.Others, like Drew Carey and Kid Rock, are more frowned upon because they didn't actually contribute to any in-ring matches or stories.One of the most controversial figures in the WWE Hall of Fame is former president Donald Trump. In fact, he's so controversial that one Hall of Famer almost left the Hall of Fame completely because of his entry.In a recent interview with Chris Van Vliet, WWE Hall of Famer and former Minnesota Governor Jesse Ventura opened up about whether he ever thought about running for president and shared his disdain for Trump.\"If I had ballot access in all 50 states, and I were allowed in the debates, I'd be the next President of the United States,\" Ventura said, emphasizing that he means in the present day.\"You see, I have an objection to one of these candidates. And I object to him – and I can say 'him' so you know who it is now – I can object to him because he is in the wrestling Hall of Fame. And I've almost resigned from it on two or three occasions because of that.\"Despite his animosity towards Trump, Ventura did have a cordial moment in the past with the former president ringside at a WWE event. Still, Ventura says things have changed.\"He's not the same man,\" Ventura said. \"He ain't the same guy. And you learn more about people as time goes on.\"Originally known as Jesse \"The Body\" Ventura, Ventura began his wrestling career after he left the military in 1975. He would wrestle primarily as a heel, holding titles across multiple promotions.Eventually, he would find himself with the WWF, now WWE, where he would work as a wrestler, performer, and commentator. He was inducted into the WWE Hall of Fame in 2004.Ventura also served as the governor of Minnesota from 1999-2003 as a member of the Reform/Independence party. Most recently, he has put his support behind Kamala Harris and current Minnesota governor Tim Walz.More WWE: Former Fan-Favorite WWE Superstar Found the Perfect Home in AEW","summary":"A former WWE Superstar almost resigned from the Hall of Fame because of Donald Trump. Here's why.","url":"https://www.newsweek.com/sports/wwe-hall-famer-almost-resigned-because-donald-trump-1945851","image":"https://d.newsweek.com/en/full/2460076/wwe-donald-trump.jpg","video":null,"publish_date":"2024-08-29 00:00:34","author":"Jeremy Hanna","authors":["Jeremy Hanna"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.34},{"id":255147578,"title":"JD Vance says Kamala Harris \"can go to hell\" over Afghanistan withdrawal","text":"Washington — On Wednesday, Sen. JD Vance of Ohio said Vice President Kamala Harris \"can go to hell\" over the Biden administration's handling of the 2021 withdrawal from Afghanistan. The remark stemmed from an \"incident\" during former President Donald Trump's visit to Arlington National Cemetery on Monday to mark three years since a suicide bombing in Kabul killed 13 service members during the chaotic withdrawal from the country. Trump visited part of the cemetery known as Section 60, where veterans of the post-9/11 conflicts in Iraq and Afghanistan are laid to rest. While there, an interaction occurred between Trump campaign staff and a cemetery official, according to multiple sources. The dispute appears to be over whether the Trump campaign's photographer had permission to be there. \"Three years ago, 13 brave, innocent Americans died, and they died because Kamala Harris refused to do her job, and there hasn't been a single investigation or a single firing,\" Vance, Trump's running mate, said in response to a reporter's question about the interaction at Arlington National Cemetery while he campaigned in Erie, Pennsylvania. Vance called Harris \"disgraceful\" and said the narrative should be that \"Kamala Harris is so asleep at the wheel that she won't even do an investigation into what happened, and she wants to yell at Donald Trump because he showed up.\" \"She can go to hell,\" he said. Vance later said in Green Bay, Wisconsin, that his comments were justified. \"Sometimes I get frustrated and pissed off,\" he said, blaming the Harris campaign for \"trying to make a massive political issue\" out of the incident at Arlington National Cemetery. In a statement Monday marking the bombing, Harris said she \"will fulfill our sacred obligation to care for our troops and their families and I will always honor their service and sacrifice.\" \"As I have said, President Biden made the courageous and right decision to end America's longest war,\" she said. The U.S. withdrawal came nearly 20 years after the war began in response to the Sept. 11, 2001, terrorist attacks. The Biden administration and Congress have conducted several investigations into the chaotic withdrawal from Afghanistan. A report from the White House and another from the State Department both partly faulted the Trump administration for the circumstances that contributed to its challenges.","summary":"The Ohio senator's attack stemmed from an \"incident\" during former President Donald Trump's visit to Arlington National Cemetery.","url":"https://www.cbsnews.com/news/jd-vance-kamala-harris-can-go-to-hell-afghanistan-arlington-cemetery/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/28/d52714ea-fdfb-41dc-951b-df56d39f8adb/thumbnail/1200x630/57d4a81242cbe807628788cd8031e0bd/gettyimages-2168129520-1.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3154690_hls/master.m3u8","publish_date":"2024-08-28 23:52:45","author":"Caitlin Yilek","authors":["Caitlin Yilek"],"language":"en","source_country":"US","sentiment":-0.54},{"id":255147318,"title":"Defense officials: Trump campaign told not to take pics at Arlington","text":"By Tara Copp, Adriana Gomez and Hannah Schoenbaum | Associated Press WASHINGTON — Donald Trump’s campaign was warned about not taking photographs before an altercation at Arlington National Cemetery during a wreath-laying ceremony earlier this week to honor service members killed in the Afghanistan War withdrawal, a defense official told The Associated Press on Wednesday. The official spoke on condition of anonymity to discuss a sensitive matter concerning Monday’s events. It came a day after NPR reported, citing a source with knowledge of the incident, that two Trump campaign staff members “verbally abused and pushed” aside a cemetery official who tried to stop them from filming and photographing in Section 60, the burial site for military personnel killed while fighting in Afghanistan and Iraq. The defense official told the AP that the Trump campaign was warned about not taking photographs in Section 60 before their arrival and the altercation. Trump was at Arlington on Monday at the invitation of some of the families of the 13 service members who were killed in the Kabul airport bombing exactly three years prior. Arlington National Cemetery is the resting place for more than 400,000 service members, veterans and their families. Cemetery officials said in a statement that “an incident” had occurred and a report had been filed, but it did not address details of what had happened. They declined to share the report. “Federal law prohibits political campaign or election-related activities within Army National Military Cemeteries, to include photographers, content creators or any other persons attending for purposes, or in direct support of a partisan political candidate’s campaign,” the cemetery officials’ statement said. “Arlington National Cemetery reinforced and widely shared this law and its prohibitions with all participants. We can confirm there was an incident, and a report was filed.” Trump’s spokesperson Steven Cheung said the Republican presidential candidate’s team was granted access to have a photographer. He contested the allegation that a campaign staffer pushed a cemetery official. “The fact is that a private photographer was permitted on the premises and for whatever reason, an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump’s team during a very solemn ceremony,” he said. Chris LaCivita, a top Trump campaign adviser, noted that Trump was there at the invitation of the families of the service members who were killed in the airport bombing. The Trump campaign posted a message signed by relatives of two of the service members killed in the bombing that said “the president and his team conducted themselves with nothing but the utmost respect and dignity for all of our service members, especially our beloved children.” “For a despicable individual to physically prevent President Trump’s team from accompanying him to this solemn event is a disgrace and does not deserve to represent the hollowed grounds of Arlington National Cemetery,” he said in a written statement, misspelling the word hallowed. “Whoever this individual is, spreading these lies are dishonoring the men and women of our armed forces.” Michael Tyler, a spokesperson for Trump’s Democratic opponent, Vice President Kamala Harris, called the reports “pretty sad when it’s all said and done.” “This is what we’ve come to expect from Donald Trump and his team,” Tyler said on CNN. “Donald Trump is a person who wants to make everything all about Donald Trump. He’s also somebody who has a history of demeaning and degrading military service members, those who have given the ultimate sacrifice.” Utah Gov. Spencer Cox also came under fire Wednesday for including a photo of him and Trump at the ceremony in a campaign email soliciting donations for his reelection bid. The Republican governor recently surprised voters when he pledged his support to Trump just after the July assassination attempt, despite saying days earlier on CNN that he hadn’t voted for Trump in 2016 or 2020 and would not cast a ballot for him again this year. Cox’s sudden embrace of Trump, who has not endorsed him back, represents a puzzling departure from his carefully curated persona as a Mitt Romney-esque moderate. Cox’s campaign has apologized for using the photo and politicizing the graveside ceremony. “This was not a campaign event and was never intended to be used by the campaign,” the governor wrote in a post on X. “It did not go through the proper channels and should not have been sent.” Democratic U.S. Rep. Gerry Connolly of Virginia has called on cemetery officials to release more information about what happened Monday. “It’s sad but all too expected that Donald Trump would desecrate this hallowed ground and put campaign politics ahead of honoring our heroes,” he said. “His behavior and that of his campaign is abhorrent and shameful.” Trump’s running mate JD Vance was asked about the incident Wednesday at a campaign event in Erie, Pennsylvania, and said that “apparently somebody at Arlington Cemetery, some staff member, had a little disagreement with somebody” and “the media has turned this into a national news story.” He instead tried to focus on the U.S. withdrawal from Afghanistan, calling Harris “disgraceful” for not firing anyone for the deaths of service members in the terror attack. The Islamic State group claimed responsibility for the attack. A Pentagon investigation into the deadly attack concluded that the suicide bomber acted alone and that the deaths of more than 170 Afghans and 13 U.S. service members were not preventable. But critics have slammed the Biden administration for the catastrophic evacuation, saying it should have started earlier than it did. Gomez Licon reported from Fort Lauderdale, Fla., and Schoenbaum from Salt Lake City. Associated Press writers Michelle L. Price in New York and Farnoush Amiri in Washington contributed to this report.","summary":"The Trump campaign posted a message signed by relatives of two of the service members killed in the bombing that said \"the president and his team conducted themselves with nothing but the utmost respect and dignity for all of our service members, especially our beloved children.\"","url":"https://www.mercurynews.com/2024/08/28/defense-officials-trump-campaign-told-not-to-take-pics-at-arlington/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/sjm-03761478.jpg?w=1024","video":null,"publish_date":"2024-08-28 23:46:36","author":"The Associated Press","authors":["The Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.409},{"id":255147300,"title":"RFK Jr. Is Honoring His Family Legacy by Endorsing Trump | Opinion","text":"There is always a price to be paid for crossing party lines. But when the person doing it is a Kennedy, the cost is far higher. Robert F. Kennedy Jr.'s defection from the Democrats and his endorsement of former President Donald Trump last week is being treated by his family in joint statements as a betrayal of the legacy of his namesake father, Sen. Robert F. Kennedy, and his uncle, President John F. Kennedy. Family members like his sister Kerry and brother Max have denounced him in vituperative terms. Longtime pals like actor Billy Baldwin have said they were ending their friendship. Media coverage was equally hysterical. A New York Times columnist skewed him by pretending to speak as a brain worm inside his head, a reference to a dead parasite that had caused a since-resolved medical problem in the past, the kind of sleazy dehumanizing shtick that it is unlikely the editors of that paper would allow to be used against any Democrat.As a result, his withdrawal from the race has had the opposite effect that such a move usually has on a former candidate. Instead of being consigned to the dust heap of political history, RFK Jr. has been getting more rather than less attention in the week since he announced he was withdrawing from the race and then endorsed Trump. Even though the coming together of the two candidates produced nothing more for RFK Jr. than a spot on a potential Trump transition team, the agreement was considered not so much a typical case of politics making strange bedfellows as an act of heresy.His betrayal smarts all the more given that RFK Jr. remains in many ways a man of the Left, yet when it comes to the very issue that Democrats claim to be fighting for in 2024—democracy—he views himself as more closely aligned with the populist MAGA wing of the Trumpian GOP than he was with the party he grew up in.And that is something other Kennedys and the Democratic establishment will not tolerate.Part of the hysteria around Bobby Kennedy Jr. is the attempt of the Kennedy family to preserve their claim to the status of political royalty. Many of its members have behaved like European royals with a cacophony of scandals (Chappaquiddick, rape accusations, drug and alcohol addiction and general bad sexual behavior) that are worthy of the most dissolute scions of the noble houses that once ruled Europe. Making matters worse is the fact that the second and third generations of the family have generally flopped in their efforts to cash in on their famous name. But the memory of JFK and RFK and the notion that they represented an American \"Camelot\" lingers in American political culture.Having any member of the clan leave the reservation is dangerous to the attempt to preserve that myth of that administration as a \"brief shining moment\" in our history as part of the Democrats' inheritance. That's true even if the defector is someone with as checkered a past as RFK Jr, whose personal biography includes heroin use and troubled marriages.RFK Jr.'s extremist environmental views put him at odds with almost all Republicans. So, too, do his views on many other issues. But his critique of the Democratic Party's current embrace of authoritarian and anti-democratic ideas is entirely reasonable. To whit, Mark Zuckerberg recently admitted that Facebook cooperated with the Democrats to censor mentions of the Hunter Biden laptop in the waning weeks of the 2020 campaign. The Biden administration also pressured Facebook into censoring criticism of COVID-19 pandemic policies that were later proven to be failures. Both revealed that the Democrats have little interest in free speech.It's also understandable that RFK Jr. saws the Democrats' underhanded efforts to keep him out of their primaries and then off the ballot as little different from their lawfare campaign to bankrupt and imprison their chief political rival, Trump.Moreover, Democrats are also forgetting that the politics of JFK and his brother are in many respects at odds with the views of their party today. In addition to his devotion to civil rights, RFK particularly sought to stand for a pro-working-class agenda that has nothing to do with current liberal fashion, in which the interests of the credentialed elites and the very poor are elevated over those of blue-collar Americans as well as the middle class to which they aspire. In 2024, this agenda is now being promoted by \"common good\" national conservatives like Vance more than liberals.Kennedy is an outlier in many respects, but his vaccine skepticism rings true to many Americans on the Right and the Left after the collapse of public faith in the medical establishment, and his opposition to a blank check for an unwinnable endless war in Ukraine also aligns him with grassroots Republicans more than the Democrats.That might be shocking to anyone who just woke up after going into a coma in 2012, when Mitt Romney spoke for Republicans and working-class Democrats still bought into President Barack Obama's \"hope\" slogan. But it is a sign of the current realignment in American politics that has fueled Trump's rise; the Democrats now stand more for Wall Street than Main Street on immigration, trade, and so much else.RFK Jr. 's ideas can be challenged as they have by conservatives who are appropriately skeptical about including a loose cannon like him in any future GOP administration. But his decision to throw in with Trump is a logical development for anyone who understands the way American politics have changed in the last decade.If narrow partisan loyalty or the obsessive crusade to keep the \"bad orange man\" out of the White House is the sole standard by which we should judge a man, then RFK Jr. is a traitor to today's Democratic Party. But by endorsing Trump, he has not betrayed his family's legacy or basic democratic principles. He's made good on them.Jonathan S. Tobin is editor-in-chief of JNS.org and a senior contributor to The Federalist. Follow him: @jonathans_tobin.The views expressed in this article are the writer's own.","summary":"RFK Jr.'s decision to throw in with Trump is a logical development for anyone who understands the way American politics have changed in the last decade.","url":"https://www.newsweek.com/rfk-jr-honoring-his-family-legacy-endorsing-trump-opinion-1945880","image":"https://d.newsweek.com/en/full/2459275/donald-trump-rfk-jr-arizona.jpg","video":null,"publish_date":"2024-08-28 23:45:40","author":"Jonathan Tobin","authors":["Jonathan Tobin"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.325},{"id":255147146,"title":"Landmark AI bill passes in California Assembly","text":"The California State Assembly on Wednesday passed what could be the most comprehensive artificial intelligence regulation bill to date. Senate Bill 1047, authored by state Sen. Scott Wiener, a San Francisco progressive Democrat, would compel AI companies to take various safety measures to protect the public from cyberattacks on critical infrastructure, prevent AI from being used to develop chemical, nuclear, or biological weapons, or enable automated crime. The bill, which passed the Assembly by a 41-9 vote, has so far enjoyed bipartisan support from state lawmakers. It now returns to the state Senate before it goes to Gov. Gavin Newsom’s desk. It must pass the state Senate by Aug. 31 to reach the governor’s desk this year. “Innovation and safety can go hand in hand—and California is leading the way,” Wiener said in a statement Wednesday. “The Assembly has taken the truly historic step of working proactively to ensure an exciting new technology protects the public interest as it advances.” The advancement comes as the bill has polarized Silicon Valley and California political leaders. The latest — and most surprising — to come out in support of the bill was tech billionaire Elon Musk, the Donald Trump-supporting, often regulation-averse Tesla CEO and X owner. Meanwhile several prominent Democratic lawmakers, including San Francisco Congresswoman Nancy Pelosi, Mayor London Breed, and Silicon Valley Reps. Ro Khanna and Zoe Lofgren oppose the bill. Newsom has yet to signal whether he would sign it into law.","summary":"The bill has polarized Silicon Valley and California political leaders.","url":"https://www.mercurynews.com/2024/08/28/landmark-ai-bill-passes-in-california-assembly/","image":"https://www.mercurynews.com/wp-content/uploads/2021/02/California-Net_Neutrality_57617.jpg?w=1024","video":null,"publish_date":"2024-08-28 23:42:35","author":"Ryan Macasero","authors":["Ryan Macasero"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.03},{"id":255147702,"title":"Harris has ‘no path to victory’ in Georgia if she does worse than Biden: Tiana Lowe Doescher","text":"Then-presidential candidate Joe Biden won Georgia over former President Donald Trump by roughly 12,000 votes in 2020, with Doescher suggesting this was because Biden courted “rural, working-class voters” in one of the most diverse states in the nation. Doescher added that if Harris can win 75% of black voters and half of the state’s Hispanic voters, it would change “the generational strategy” for Republicans in the years to come. “So the hope would be that white college-educated voters, independent voters, and older voters aren’t just over-responding to these polls, and it is possible that they can save her, they can come close in the same way they help Joe Biden win in 2020,” Doescher said on Fox News’s Your World with Neil Cavuto. “But if she performs 10 points behind Biden’s margin with black voters and Hispanics, there’s no path to victory there.” Ahead of the election, Trump and Gov. Brian Kemp (R-GA) appear to have buried the hatchet after feuding with each other since late 2020, as the governor did not push Trump’s claims he did not legitimately lose the 2020 election. However, the former president has seemingly made amends with Kemp, calling their past feuds a “small distraction.” Doescher also addressed the debate between Harris and Trump next month, arguing that this debate will be “high risk, high reward” for the Democratic candidate, similar to the first debate Biden did with Trump before bowing out of his reelection bid less than a month later. Similar to Biden, Doescher noted, Harris will have done very few interviews ahead of this debate, with Harris’s first interview as a 2024 presidential candidate set for Thursday CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER “This debate for her is really make or break in the same way this interview is make or break,” Doescher said. “So her best option rather than having to defend her own record is to go Donald Trump.” The next presidential debate will be hosted by ABC News, and will air on Sept. 10. Early voting in a handful of states will begin a little more than a week later.","summary":"The Washington Examiner’s Tiana Lowe Doescher argued Vice President Kamala Harris needs to win a sizable portion of Georgia’s minority voter bloc if she plans to win the state, citing how close the vote total was in 2020. Then-presidential candidate Joe Biden won Georgia over former President Donald Trump by roughly 12,000 votes in 2020, [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3137190/harris-no-path-victory-georgia-biden-tiana-lowe-doescher/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Kamala-Harris-DNC-1-scaled.webp","video":null,"publish_date":"2024-08-28 23:42:02","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.258},{"id":255147132,"title":"All signs are that Kamala Harris’ big  ‘interview’ will just be an infomercial","text":"After weeks of dodging serious press questioning, Kamala Harris on Thursday will finally do a live, unedited interview, one-on-one with a fiercely critical journalist . . . not. Instead, it’ll be a two-on-one chat with veep-nominee Tim Walz as her wingman. And it’ll be pre-taped, to air at 9 p.m.: America will never know what Harris word salads (or worse) get left on the cutting-room floor. And it won’t be, say, Fox News’ Brett Baier asking the questions, but Kam-friendly Dana Bash from Kam-friendly CNN (no doubt because her campaign couldn’t find a “journalist” more in love with Harris and hostile to Donald Trump). Making it a tag-team “defense” understandably has sparked the most outrage, but all the arrangements show that Harris’ campaign wants the least possible transparency. This is the woman who wants to be the first female president? Unable to face an objective reporter, live, on her own? How will she handle adversaries like Vladimir Putin or Xi Jinping? No, this looks less like an interview and more of an infomercial — all spin, from start to finish. The big test for Bash is whether she pushes Harris to explain and defend her plans: Does she truly now favor fracking, as her campaign suggests? Or is she closer to her 2019 vow, “There’s no question I’m in favor of banning” it? And if she really is flipping, why was she wrong before? Does she plan on pushing government-only health care — Medicare for All — and the end of private insurance, as she suggested back then? If not, what changed? Is she still a backer of the Green New Deal? How does her sudden willingness to fund Trump’s border wall square with her earlier view that funding it “would be a gross misuse of taxpayer money”? Indeed, a new Harris ad paints her as eager to beef up security at the border; it even shows pictures of the wall. So why hasn’t Harris — President Biden’s border czar — seen that it’s already beefed up? Most important: This is one single interview; even if Bash gets tough, voters can only learn a bit. A normal nominee has been doing debates, town halls, press conferences and one-on-one interviews for a year at this point — and has detailed a host of policies and plans. To level with the public, Harris should be doing at least one interview a day, right up to Nov. 5.","summary":"Kamala Harris will sit for her first interview on Thursday, but it won't be live with an objective reporter but pre-taped, hosted by her adoring fan CNN's Dana Bash.","url":"https://nypost.com/2024/08/28/opinion/kamala-harris-first-interview-will-really-be-an-infomercial/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-hav4uzptk-1724886483081.jpg?quality=75&strip=all&1724872131&w=1200","video":null,"publish_date":"2024-08-28 23:40:01","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.27},{"id":255147136,"title":"RFK Jr. could persuade moms like me to choose Trump as ‘Kennedy Republicans’","text":"Robert F. Kennedy Jr.’s endorsement of former President Donald Trump is a classic example of Ronald Reagan’s famous explanation for the change in his political allegiance: “I didn’t leave the Democratic Party, the Democratic Party left me.” And it has the power to tip the election in Trump’s favor, especially in the swing states that will decide it. Endorsements, while highly coveted by politicians, don’t usually change election outcomes, but this one feels different. Kennedy, a blue-blood Democrat from the nation’s most famous political dynasty, is speaking to many fellow “former Democrats” — especially newly activated moms like me. In contrast to the hasty anointment and enforced “joy” of Kamala Harris — who until a month ago was a historically unpopular vice president — Kennedy raises big issues and treats voters like adults whose votes must be earned. He talks about topics that have traditionally galvanized liberal and progressive Democrats: free speech, protecting the vulnerable, championing the environment and fighting for the American family. School closures, migrant surges, steep inflation and radical gender policies have created disgruntled Democrats and irate independents who might vote for a Republican — think of how in past decades Rudy Giuliani, George Pataki and Michael Bloomberg fared in deep-blue New York. These voters have so far resisted Trump and the MAGA movement, but RFK has a shot at swaying them. Last week the independent presidential candidate went all-in on a stirring explanation of what “Make America Great Again” really means. “Troubled liberals,” he acknowledged, may think it signals a “return to an America before civil rights, gay rights and women’s rights.” But RFK said that for him, Trump’s signature phrase “recalls a nation brimming with vitality, with a can-do spirit, with hope and a belief in itself . . . a nation of broad prosperity, the world’s most vibrant middle class and an idealistic belief (though not consistently applied) in freedom, justice and democracy.” His words resonate with me, a former Bernie Sanders supporter who has voted Democrat in every presidential election for three decades. I even ran for office as a Democrat — for City Council in 2021 and Congress in 2022 — trying doggedly, and unsuccessfully, to pull my party out of the fringe left and back to the moderate middle. But elected Democrats in New York, many of whom I voted for, have now lurched so far left that they’re punishing public school parents for merely suggesting that we discuss — just discuss! — school gender guidelines that allow boys in girls’ sports. It’s hard to square the values that originally made me a Democrat with what I saw at the party’s national convention, top-heavy with rich, elite scolds who think they are better and know better. I saw self-satisfied censors comfortable with authoritarian edicts about our health care, hypocrites about public education, cavalier about our kids’ curriculum morphing into left-wing indoctrination sessions. People who still prefer dangerous Defund the Police policies over law and order, and have a weird fixation on promoting abortion, rather than the “safe, legal and rare” framework most Americans support. Ronald Reagan’s ability to speak to middle-class voters about their actual concerns created the “Reagan Democrat.” Kennedy’s earnest articulation on real issues like solving childhood obesity, stopping expensive foreign wars and decrying the censorship that leads to totalitarianism now has the power to create “Kennedy Republicans” — a voting bloc that could decide our next president. The shameful efforts to wage lawfare against both Trump and Kennedy to keep both men off the ballot were meant to silence their ideas instead of offering better ones. Moms who objected to school closures can relate: The Harris-Biden administration did the same thing to us, by pressuring media platforms. That’s why organizations like Moms for Liberty, which will host Trump this weekend at their national summit, have attracted so many former Democrats. Kennedy may have started a trend: On Monday, Tulsi Gabbard, another former Democratic presidential candidate, announced her endorsement of Trump, citing foreign-policy concerns chief among her motivations. Both of them have joined Trump’s transition team. Kennedy’s and Gabbard’s desire to talk about the big issues stands in sharp contrast to the “brat” veep who won’t articulate or defend her policies to the press. And Harris has a record — she was named the Senate’s “most liberal” member in 2019, and has floated Marxist ideas like price controls and “equality of outcomes.” For Democrats wary of radical left-wing policies, it’s time to reverse course. “Kennedy Republican” has a nice ring to it. Maud Maron is a city public-school parent and president of the consulting firm ThirdRail.","summary":"Disgruntled Democrats and irate independents angry about school closures, migrant surges, inflation and radical gender policies have resisted Trump, but RFK has a shot at swaying them.","url":"https://nypost.com/2024/08/28/opinion/rfk-jr-could-get-moms-to-become-kennedy-republicans/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-l09asn5jp-1724886815929.jpg?quality=75&strip=all&1724872499&w=1200","video":null,"publish_date":"2024-08-28 23:38:06","author":"Maud Maron","authors":["Maud Maron"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.006},{"id":255147324,"title":"Trump staffers involved in incident with Arlington National Cemetery employee","text":"Trump staffers involved in incident with Arlington National Cemetery employee Defense Department officials tell CBS News that some Trump staffers got aggressive both verbally and physically Monday in a confrontation with an Arlington National Cemetery official. The incident occurred when former President Donald Trump visited the cemetery to mark three years since the deadly suicide bombing in Afghanistan. Nancy Cordes has the latest.","summary":"Defense Department officials tell CBS News that some Trump staffers got aggressive both verbally and physically Monday in a confrontation with an Arlington National Cemetery official. The incident occurred when former President Donald Trump visited the cemetery to mark three years since the deadly suicide bombing in Afghanistan. Nancy Cordes has the latest.","url":"https://www.cbsnews.com/video/trump-staffers-involved-in-incident-with-arlington-national-cemetery-employee/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/28/35fe457a-8215-49a3-aab7-af886d3cfb98/thumbnail/1200x630/ad16fbf6c8ad992509fad93bcfd71c3e/0828-en-costa.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-08-28 23:38:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.122},{"id":255147328,"title":"New video of Jan. 6 Nancy Pelosi reaction to Capitol attack, Trump actions","text":"New video of Jan. 6 Nancy Pelosi reaction to Capitol attack, Trump actions New video given to Congress shows former House Speaker Nancy Pelosi's comments as the January 6, 2021, assault on the Capitol developed. In the video, Pelosi mentions former President Donald Trump and the National Guard. CBS News' Scott MacFarlane has more.","summary":"New video given to Congress shows former House Speaker Nancy Pelosi's comments as the January 6, 2021, assault on the Capitol developed. In the video, Pelosi mentions former President Donald Trump and the National Guard. CBS News' Scott MacFarlane has more.","url":"https://www.cbsnews.com/video/new-video-of-jan-6-nancy-pelosi-reaction-to-capitol-attack-trump-actions/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/28/01209934-6604-4f11-b800-72c65de8e4ef/thumbnail/1200x630/3fb80055b8fd6a9a956b05f61a62cb20/cbsn-fusion-new-video-of-jan-6-nancy-pelosi-reaction-to-capitol-attack-trump-actions-thumbnail.jpg?v=25685eaa472b","video":null,"publish_date":"2024-08-28 23:37:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.356},{"id":255147332,"title":"FBI releases new evidence in Trump rally shooting investigation","text":"FBI releases new evidence in Trump rally shooting investigation The FBI has released new details in its investigation into the assassination attempt on former President Donald Trump at a rally in Butler, Pennsylvania, last month. Among the findings were the FBI has found no evidence that the gunman conspired with anyone else. The FBI also released an image of two explosives the shooter had in his car nearby. Scott MacFarlane has details.","summary":"The FBI has released new details in its investigation into the assassination attempt on former President Donald Trump at a rally in Butler, Pennsylvania, last month. Among the findings were the FBI has found no evidence that the gunman conspired with anyone else. The FBI also released an image of two explosives the shooter had in his car nearby. Scott MacFarlane has details.","url":"https://www.cbsnews.com/video/fbi-releases-new-evidence-in-trump-rally-shooting-investigation/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/28/fa1bdf58-b42f-48d2-b788-1e9b74ba3801/thumbnail/1200x630/132946221d63fe8f6b855192b43100ec/0828-en-macfarlane.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-08-28 23:36:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.394},{"id":255146876,"title":"Lawsuit against TikTok for ‘Blackout Challenge’ can move forward","text":"A Pennsylvania girl, aged 10, tragically passed away after participating in a TikTok challenge, leading her mother to now move forward with her legal case against the social media platform. The young girl, Nylah Anderson, lost her life in December 2021 after trying out the trending “Blackout Challenge” and unfortunately suffocating herself. In the lawsuit filed against TikTok and its parent company ByteDance, it was noted that the “Blackout Challenge” involves children choking themselves until they lose consciousness. Upon discovering her daughter, Tawainna Anderson found Nylah hanging from a purse strap in a bedroom. Despite efforts in the pediatric intensive care unit, the girl tragically passed away after several days. Anderson’s lawsuit claims that TikTok’s platform and algorithms are purposely crafted to enhance user engagement and dependency, pushing children into a loop of seeking dopamine hits through watching, sharing, and attempting viral challenges and videos. “TikTok is programming children for the sake of corporate profits and promoting addiction,” the complaint said. In October 2022, the case was dismissed by a federal judge who concluded that Section 230 of the Communications Decency Act of 1996 — which protects content distributors’ liability for third-party communications — barred Anderson’s claims. “Defendants’ algorithm was a way to bring the Challenge to the attention of those likely to be most interested in it,” U.S. District Judge Paul S. Diamond, a George W. Bush appointee, wrote at the time. “In thus promoting the work of others, Defendants published that work — exactly the activity Section 230 shields from liability.” On Tuesday, a federal appeals court reversed that decision, finding that — in light of a recent Supreme Court decision acknowledging that social media networks have a First Amendment right to engage in “expressive activity” — TikTok may ultimately face liability for Nylah Anderson’s death. “Section 230 immunizes only information ‘provided by another[,]’ and here, because the information that forms the basis of Anderson’s lawsuit — i.e., TikTok’s recommendations via its FYP algorithm — is TikTok’s own expressive activity, § 230 does not bar Anderson’s claims,” U.S. Circuit Judge Judge Patty Shwartz, a Barack Obama appointee, wrote for the three-judge panel. The ruling relied heavily on the Supreme Court’s unanimous July decision in a pair of cases over efforts by Texas and Florida to prevent what state lawmakers called “censorship” of conservative perspectives on social media. All nine justices found that the statutes were facially unconstitutional. On Tuesday, the appeals court relied on this framework in concluding that Anderson’s case should continue. “In Moody v. NetChoice, LLC, the Court considered whether state laws that ‘restrict the ability of social media platforms to control whether and how third-party posts are presented to other users’ run afoul of the First Amendment,” Shwartz wrote (citations omitted). “The Court held that a platform’s algorithm that reflects ‘editorial judgments’ about ‘compiling the third-party speech it wants in the way it wants’ is the platform’s own ‘expressive product’ and is therefore protected by the First Amendment. Given the Supreme Court’s observations that platforms engage in protected first-party speech under the First Amendment when they curate compilations of others’ content via their expressive algorithms, it follows that doing so amounts to first-party speech under § 230, too.” The judges drew a distinction between the TikTok-generated algorithm and third-party users that Nylah Anderson might have sought out. “We reach this conclusion specifically because TikTok’s promotion of a Blackout Challenge video on Nylah’s FYP was not contingent upon any specific user input,” the decision says. “Had Nylah viewed a Blackout Challenge video through TikTok’s search function, rather than through her FYP, then TikTok may be viewed more like a repository of third-party content than an affirmative promoter of such content.” The court didn’t address the distinction between TikTok’s role as either a publisher or distributor for purposes of Section 230 because “in this case, the only distribution at issue is that which occurred via TikTok’s algorithm, which as explained herein, is not immunized by § 230 because the algorithm is TikTok’s own expressive activity.” U.S. Circuit Judge Paul Brian Matey, a Donald Trump appointee, wrote a partial concurrence and partial dissent, raging against what he said was TikTok’s “casual indifference” to Nylah Anderson’s death, and arguing that “Anderson’s estate may seek relief for TikTok’s knowing distribution and targeted recommendation of videos it knew could be harmful.” Matey said that Section 230 jurisprudence had become “nearly-limitless” in its protections of content distribution platforms. “It is a position that has become popular among a host of purveyors of pornography, self-mutilation, and exploitation, one that smuggles constitutional conceptions of a ‘free trade in ideas’ into a digital ‘cauldron of illicit loves’ that leap and boil with no oversight, no accountability, no remedy … But it is not found in the words Congress wrote in § 230,” he wrote. Section 230, he wrote, “rides in to rescue corporations from virtually any claim loosely related to content posted by a third party, no matter the cause of action and whatever the provider’s actions. The result is a § 230 that immunizes platforms from the consequences of their own conduct and permits platforms to ignore the ordinary obligation that most businesses have to take reasonable steps to prevent their services from causing devastating harm.” In Matey’s view, the time for accountability has come. “The marketplace of ideas, such as it now is, may reward TikTok’s pursuit of profit above all other values. The company may decide to curate the content it serves up to children to emphasize the lowest virtues, the basest tastes. It may decline to use a common good to advance the common good,” he wrote. “But it cannot claim immunity that Congress did not provide.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeft: Nylah Anderson (Anderson v. TikTok). Right: Tawainna Anderson (WPVI/YouTube). A Pennsylvania&#8230;\n\n\nThis Post: Lawsuit against TikTok for &#8216;Blackout Challenge&#8217; can move forward first appeared on Internewscast Journal","url":"https://internewscast.com/crime/lawsuit-against-tiktok-for-blackout-challenge-can-move-forward/","image":"https://am22.mediaite.com/lc/cnt/uploads/2024/08/Nylah-Anderson-Tawainna-Anderson.jpg","video":null,"publish_date":"2024-08-28 23:34:58","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.123},{"id":255146912,"title":"Letters: West Nile virus | Broken oath | Arlington photo-op | Respecting difference | Protecting women","text":"Do your part to stop West Nile virus spread Re: “Santa Clara County to spray pesticide following discovery of more West Nile-positive mosquitos” (Aug. 21). We have read about Dr. Fauci getting infected with West Nile virus after a mosquito bite in his backyard. West Nile virus is a dangerous mosquito-borne disease. Mosquitoes need standing water to complete their life cycle. We should eliminate sources of water where mosquitoes can breed in our backyards or public places like parks. Here are the guidelines from the Alameda County Mosquito Abatement District to reduce the risk of contracting mosquito-borne diseases: • Dump or drain standing water on your property to decrease the opportunity for mosquitoes to breed. • Dawn and dusk are when mosquito activity peaks; limit outdoor activities during this time. • Defend yourself from mosquito bites by wearing long pants and long-sleeved shirts and apply insect repellent containing EPA-registered active ingredients such as DEET, Picaridin, IR3535, or oil of lemon eucalyptus. • Doors and window screens should be in good condition with no tears or holes. Subru Bhat Trustee, Alameda Mosquito Control Abatement District Union City Oath broken, Trump is unfit to serve again I was raised a Republican. I voted for Ronald Reagan. On Jan. 20, 2017, Donald Trump swore an oath to “preserve, protect and defend the Constitution of the United States.” On Jan. 6, 2021, Trump betrayed and broke that oath by trying to stop the certification of the 2020 presidential election, an election that was not “stolen” and was clearly won by Joe Biden. Donald Trump is not fit to hold the office of the president, because he has already betrayed his oath to the U.S. Constitution and to all of the American people. Chris Pedretti Walnut Creek Trump’s Arlington visit no more than photo-op Donald Trump has a history of disrespect for our military. Trump’s former chief of staff, retired Marine General John Kelly, confirmed that Trump refused to visit an American cemetery in France because it was full of “losers.” Trump also referred to WWI Marine dead as “suckers,” according to reports confirmed by Kelly. So what does it mean when Trump lays a wreath in Arlington cemetery at the tombs of U.S. soldiers killed during the evacuation of Afghanistan? Not sincerity. Instead, he wants a photo-op to criticize Kamala Harris and Joe Biden. Remember that Trump negotiated a deal with the Taliban for a U.S. pullout from Afghanistan, and Biden felt obligated to honor the commitment of his predecessor. But in the perceptive words of one Taliban commander during our guerrilla war in Iraq and Afghanistan: “You have the watches. We have the time.” Afghanistan fell to the Taliban quickly thereafter. Bob Benson Lafayette Elect a president who respects difference Re: Cartoon by Jeff Koterba (Page A6, Aug. 27). Jeff Koterba’s cartoon about his Tourette’s syndrome and his painful examples of bullying brought tears to my eyes. It needs to be said that Donald Trump has not shown himself to be kind to people who are different. He mocks others repeatedly. He denigrates their appearances and refers to them by childish nicknames, acts that reflect an endorsement of cruelty as a legitimate tool for winning a campaign. The ugly remarks made about Tim Walz’s son after the Democratic convention suggest that some people might view Trump’s behavior as consent to be publicly rude. It is not enough to consider Trump’s policy issues when we vote. It’s also important to remember what kind of people we want to be as Americans, that we must strive to be more accepting of those who present different ways to be human. Our leaders should be role models who guide us in that direction. Teri Shikany Danville Trump isn’t the pick to protect women Donald Trump and Republicans are quick to criticize Kamala Harris for not interviewing with the press. But Trump isn’t any better. Democrats and independents have special reasons for distrust, because historically whenever he suggests he’s moderating any of his positions, he immediately goes the other way when his base reacts. Women beware — trust his actions, not his words. Jay Chafetz Walnut Creek","summary":"East Bay Times Letters to the Editor for Aug. 29, 2024","url":"https://www.mercurynews.com/2024/08/28/letters-1848/","image":"https://www.mercurynews.com/wp-content/uploads/2024/05/SJM-L-AEDESSJ-0525-3.jpg?w=1024","video":null,"publish_date":"2024-08-28 23:30:04","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.032},{"id":255147298,"title":"WATCH: JD Vance tells Kamala Harris to go to hell","text":"On Monday, former president Donald Trump travelled to Arlington National Ceremony to join Gold Star families (those that have lost family members in the military) to pay respect to the fallen. As Blaze Media reports, Trump was more specifically at Arlington to pay respect to the 13 service members killed three years ago during the Biden-Harris administration’s disastrous withdrawal from Afghanistan. Trump’s appearance drew the ire of Esquire magazine’s political blogger, Charles P. Pierce who asked, \"How the hell was this allowed to happen?\" As pointed out by Blaze, \"this is the same cemetery, where last year the Biden-Harris administration trampled graves and toppled the Jewish American-designed Reconciliation Memorial, which is open to members of the public, so it's unclear who exactly Pierce figured would prevent Trump's entry.” Last month, family members of several of the service members killed in the Afghanistan withdrawal took the stage at the Republican National Convention. Holding back tears, Christy Shamblin, the mother-in-law of Marine Sgt. Nicole Gee, said, \"Joe Biden has refused to recognize their sacrifice. Donald Trump sent six hours in Bedminster with us. He allowed us to grieve. He allowed us to remember our heroes,\" reports Blaze. Neither Kamala Harris — who has boasted about signing off on the Afghanistan exit strategy — nor President Joe Biden, now into the second week of another vacation, were present in Arlington on Monday, although they both issued commemorative statements from afar, reports Blaze. Speaking on CNN on Monday from Fort Liberty, NC, Paula Knauss Selph, the mother of Army Staff Sgt. Ryan Christian Knauss, who was killed in the attack, had strong words criticizing Biden. “This administration has tried to sweep it under the rug, and that’s absolutely not going to work for this nation,” she said, adding that Vice President Kamala Harris holds “the same accountability as President Biden.” Trump's visit also drew the ire of the Harris campaign, prompting Trump’s vice-presidential candidate JD Vance to suggest Harris should take a trip. \"To have those 13 Americans lose their lives and not fire a single person is disgraceful. Kamala Harris is disgraceful,\" said Vance. “Kamala Harris is so asleep at the wheel that she won't even do an investigation into what happened.\"","summary":"On Monday, former president Donald Trump travelled to Arlington National Ceremony to join Gold Star families (those that have lost family members in the military) to pay respect to the fallen.","url":"https://www.westernstandard.news/international/watch-jd-vance-tells-kamala-harris-to-go-to-hell/57379","image":"https://media.assettype.com/westernstandard/2024-08-06/7nuzc0sv/Screen Shot 2024-08-06 at 2.49.04 PM.png?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2024-08-28 23:29:06","author":"Myke Thomas","authors":["Myke Thomas"],"language":"en","source_country":"ca","sentiment":-0.391},{"id":255146848,"title":"Trump campaign was warned not to take photos at Arlington before altercation, defense official says","text":"Democratic U.S. Rep. Gerry Connolly of Virginia has called on cemetery officials to release more information about what happened Monday. “It’s sad but all too expected that Donald Trump would desecrate this hallowed ground and put campaign politics ahead of honoring our heroes,” he said. “His behavior and that of his campaign is abhorrent and shameful.” Trump’s running mate JD Vance was asked about the incident Wednesday at a campaign event in Erie, Pennsylvania, and said that “apparently somebody at Arlington Cemetery, some staff member, had a little disagreement with somebody” and “the media has turned this into a national news story.” He instead tried to focus on the U.S. withdrawal from Afghanistan, calling Harris “disgraceful” for not firing anyone for the deaths of service members in the terror attack. The Islamic State group claimed responsibility for the attack. A Pentagon investigation into the deadly attack concluded that the suicide bomber acted alone and that the deaths of more than 170 Afghans and 13 U.S. service members were not preventable. But critics have slammed the Biden administration for the catastrophic evacuation, saying it should have started earlier than it did.","summary":"WASHINGTON &#8212; Donald Trump&#8217;s campaign was warned about not taking photographs before an altercation at Arlington National Cemetery during a wreath-laying ceremony earlier this week to honor service members killed in the Afghanistan War withdrawal, a defense official told The Associated Press on Wednesday. The official spoke on condition of anonymity to discuss a sensitive [&#8230;]","url":"https://torontosun.com/news/world/trump-campaign-was-warned-not-to-take-photos-at-arlington-before-altercation-defense-official-says","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/election-2024-trump-14-e1724685762838.jpg","video":null,"publish_date":"2024-08-28 23:26:37","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.7},{"id":255146958,"title":"Trump team downplays Arlington 'incident' in an effort to minimize political fallout","text":"WASHINGTON — Former President Donald Trump's campaign is playing down reports of an altercation during his visit to Arlington National Cemetery on Monday, a move that signals its concern about potential political fallout from the incident. “A nameless bureaucrat at Arlington whose job it is to preserve the dignity of the cemetery is doing the complete opposite in trying to make what was a very solemn and respectful event into something it was not,” said Trump campaign senior adviser Chris LaCivita, a retired Marine who was with Trump at the cemetery Monday. Trump has long portrayed himself as a champion of service members and veterans — an image bolstered by participants in Monday's ceremony. But he has also created a pattern of disparaging service members that has led even some former aides to question the authenticity of his support for the military. The latest episode threatens to blunt his attacks on President Joe Biden and Vice President Kamala Harris over a 2021 terrorist assault at the so-called Abbey Gate of the Kabul airport, which killed 13 American service members. It was the third anniversary of the bombings, which occurred during the harried U.S. exit from Afghanistan, that took Trump to the Arlington burial ground, in the Virginia suburbs of Washington, on Monday. He laid a wreath at the Tomb of the Unknown Soldier to honor those who died in the bombings and then moved to Section 60, an area reserved for participants in the Iraq and Afghanistan wars. Trump was joined at both sites by family members of the men and women killed at Abbey Gate. The family members invited him to participate in the commemoration, and they wanted the moment to be documented, according to two people who were present. \"I gave my permission,\" Kelly Barnett, the mother of Marine Staff Sgt. Darin “Taylor” Hoover, told NBC News. \"I wanted the memories. I wanted to make sure that my family at home — I have a huge family — I wanted to make sure that they were involved with it, as well, and they could see it and feel it, have the experience that we had. And so I said, yeah, in no uncertain terms, I was OK with it.\" Trump posed for a photograph beside Hoover's grave, smiling and giving a thumbs-up gesture in a shot that included the headstones of other service members who were not part of Monday's ceremony. A federal regulation admonishes that memorial services at Army cemeteries \"will not include partisan political activities.\" NPR first reported Tuesday that two Trump campaign staffers had a confrontation with a cemetery official who tried to prevent them from filming. \"We can confirm there was an incident, and a report was filed,\" the cemetery said in a statement. Whatever happened, Barnett and another participant — who asked to remain anonymous without authorization to speak for the families — said they noticed nothing amiss. \"We didn't even hear about it until the next day,\" the second participant said, who did not believe Trump's participation amounted to campaign activity. \"It wasn't politicized,\" this person said. Trump posted video that included clips from Monday's ceremony to his TikTok account. In the video, he blamed Biden and Harris for the deaths at the Kabul airport. Trump, like most Republican presidential candidates in recent decades, has won the majority of voters who have served in the military, according to exit polls. But his edge was smaller in his defeat in 2020 — 54% to 44% — than when he won that part of the electorate 61% to 34% in taking the presidency in 2016. His aides have publicly dismissed the report of a physical interaction at the cemetery and accused Democrats of ignoring the anniversary, which is the most poignant reminder of a withdrawal that was politically damaging to Biden. “They’re trying to muddle the fact that there was only one commander in chief in Arlington on Aug. 26,\" LaCivita said. He noted that Biden was on vacation and that Harris did not visit Arlington on the anniversary. Both of them issued statements. Neither Trump nor Harris, the Democratic presidential nominee, served in uniform. Their running mates, Sen. JD Vance, R-Ohio, and Gov. Tim Walz, D-Minn., did. Harris' campaign declined to comment on the report of an altercation at Arlington, but its communications director, Michael Tyler, addressed it in a CNN interview Wednesday. \"Frankly, I think this episode is pretty sad when it’s all said and done,\" Tyler said. \"Listen, this is what we’ve come to expect from Donald Trump and his team. Donald Trump is a person who wants to make everything all about Donald Trump. He’s also somebody who has a history of demeaning and degrading military service members, those who have given the ultimate sacrifice.\" A Trump adviser who spoke with NBC News pointed to a statement signed by five Gold Star family members and two Purple Heart recipients who were with Trump on Monday defending him amid the firestorm. They said in the statement that they gave approval for Trump’s videographer and photographer to capture those moments so they could “cherish these memories forever.” “Everything involved in the day was at their invitation,” this person said. “It wasn’t a campaign event. It was an event done by the families of these people, and they invited the commander-in-chief who has consistently demonstrated strong and unwavering support for them and all service members and their families.” This person said that Trump was “grateful” for the invitation and that he would show “how committed he is when he’s back in the White House to ensure that the people who manufactured that insane and disastrous withdrawal are held accountable for it.” The Trump campaign's handling of the episode after details leaked to the media raised some eyebrows among Republicans, particularly a statement in which communications director Steven Cheung said \"an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump's team during a very solemn ceremony.\" A Republican operative, speaking on condition of anonymity, called the statement \"so unprofessional.\" A Trump ally, meanwhile, said the \"behavior\" outlined at the cemetery was \"really out of character\" for the campaign. For years, Trump has faced accusations of showing disrespect to veterans and service members. Early this year, he mocked the late Sen. John McCain, R-Ariz., for being unable to raise his arms because of injuries he sustained as a prisoner of war. In 2015, he also said McCain was not a \"war hero\" because \"he was captured.\" \"I like people that weren't captured,\" he said at the time. McCain, a veteran of the Vietnam War, gained national recognition for his time as a prisoner of war in the infamous \"Hanoi Hilton,\" where he was tortured. This cycle, Trump also questioned why Nikki Haley's husband was not with her on the campaign trail during the Republican primaries. Maj. Michael Haley was serving overseas at the time. Just this month, Trump described the Presidential Medal of Freedom, which is a civilian honor, as \"much better\" than the Medal of Honor, a military honor, because recipients of the latter are often deceased or severely injured. Former White House chief of staff John Kelly said last year his former boss denigrated veterans and service members as \"suckers\" and \"losers,\" confirming remarks that were published in The Atlantic years earlier. Trump has vehemently and repeatedly denied making such comments. Maryland Gov. Wes Moore, a Democrat and Army veteran, pointed to Trump's comments about the Medal of Honor and the Presidential Medal of Freedom, adding that the episode at Arlington National Cemetery appeared to be a \"continuation of something that I just find really problematic.\" \"There is this attacking of those with military service and this increasing politicization and disrespect for those who have chosen to serve this country,\" he said, adding that he still wanted to learn more details about what happened between Trump's staff and the cemetery official. At their convention last week, Democrats took Trump to task over military issues, emphasizing a theme of patriotism. Former Defense Secretary Leon Panetta said that Trump \"does not understand the service and sacrifice of our military\" and that he was the only president since World War II who has not \"honored our veterans and their sacrifices.\" But for Republicans, the episode served to further shine a light on what they see as one of the Biden administration's biggest failings in Afghanistan, a key piece of their message on global instability over the past four years. “The veterans that I talk to feel disrespected and disappointed, certainly at their commander in chief, in the direction of the United States militarily,” Pennsylvania state Rep. Rob Mercuri, a veteran and congressional candidate in the 17th District, which is a swing district with a large veteran population. “The only thing I would say about President Trump is that his plan is to project strength. My view is that the Reagan Doctrine of peace through strength is really important to come back to.”","summary":"Trump's campaign is playing down reports of an altercation during his visit to Arlington National Cemetery on Monday, a move that signals its concern about potential political fallout from the incident.","url":"https://www.nbcnews.com/politics/2024-election/trump-team-arlington-cemetery-incident-political-fallout-afghanistan-rcna168600","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/240827-donald-trump-arlington-se-1012p-fb8203.jpg","video":null,"publish_date":"2024-08-28 23:22:26","author":"Allan Smith,Garrett Haake,Jonathan Allen","authors":["Allan Smith","Garrett Haake","Jonathan Allen"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.139},{"id":255146938,"title":"Arlington National Cemetery incident report filed, Trump campaign staff involved","text":"Arlington National Cemetery incident report filed, Trump campaign staff involved A report has been filed on an incident that took place at Arlington National Cemetery Monday while former President Donald Trump paid a visit. The incident apparently involved Trump campaign staff and a cemetery official, according to multiple sources. CBS News' Eleanor Watson has the latest.","summary":"A report has been filed on an incident that took place at Arlington National Cemetery Monday while former President Donald Trump paid a visit. The incident apparently involved Trump campaign staff and a cemetery official, according to multiple sources. CBS News' Eleanor Watson has the latest.","url":"https://www.cbsnews.com/video/arlington-national-cemetery-incident-report-filed-trump-campaign-staff-involved/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/28/9a96fd2b-50d2-48f2-b699-c8e4c97cdd8a/thumbnail/1200x630/a0c3c570bfcabfa8c85aeee3f5adca92/cbsn-fusion-arlington-national-cemetery-incident-report-filed-trump-campaign-staff-involved-thumbnail.jpg?v=25685","video":null,"publish_date":"2024-08-28 23:21:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.312},{"id":255146560,"title":"Fox News Sports Huddle Newsletter: Former NCAA swimmers make plea to committee on protecting women's sports","text":"Welcome to the Fox News Sports Huddle Newsletter. If this newsletter is not already delivered to your email, please subscribe here. DECISIVE ACTION – Riley Gaines and other former NCAA female athletes addressed Georgia state lawmakers on the Special Committee on Protecting Women’s Sports. Continue reading… 'I AM A WOMAN' – Riley Gaines appeared at a political rally where she made her allegiance in the presidential election clear, \"I'm voting for Donald J. Trump because I am a woman.\" Continue reading… CLAPPING BACK – Brittany Mahomes, the wife of Patrick Mahomes, sent a scathing message to her \"haters\" who spoke out after she appeared to like a social media post from former President Trump. Continue reading… MISSING IN ACTION – The names of several A-listers were floated as potential surprise guests at the Democratic National Convention (DNC), including Kansas City Chiefs star Travis Kelce. Continue reading… GREAT EXPECTATIONS – In an interview with Fox News Digital, Texas quarterback Quinn Ewers discussed the Longhorns' mentality as they attempt to meet lofty goals in their inaugural season in the SEC. Continue reading… NEW ERA – Eight-time Grand Slam winner Andre Agassi spoke with Fox News Digital about his belief that American men's tennis is on the cusp of a renaissance. Continue reading… NOT PRIMETIME READY – Paul Finebaum ripped Colorado Buffaloes head coach Deion Sanders over his decision to ban a reporter from asking questions at his press conferences. Continue reading… WATCH NOW – CeeDee Lamb's contract drama has come to an end. He is now the second highest paid player at his position in the NFL, but how will his contract impact the Dallas Cowboys going forward? Continue reading… FROM FOX SPORTS – While the emergence of NIL has seemingly made college football more transactional, Fox Sports' RJ Young ranks the sport's Top 100 players. Continue reading… FROM OUTKICK – College football's spring transfer period is now in jeopardy as the NCAA has proposed closing the window in favor of a single offseason transfer opportunity. Continue reading… FOLLOW FOX NEWS ON SOCIAL MEDIA Facebook Instagram YouTube Twitter LinkedIn SIGN UP FOR OUR NEWSLETTERS Fox News FirstFox News Opinion Fox News Lifestyle Fox News Autos Fox News Health DOWNLOAD OUR APPS Fox News Fox Business Fox Weather Fox Sports Tubi WATCH FOX NEWS ONLINE Fox News Go OUTKICK COVERAGE OutKick Sign up for OutKick's daily newsletter STREAM FOX NATION Fox Nation","summary":"Receive your weekly recap of all the happenings around the world of sports.","url":"https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-former-ncaa-swimmers-make-plea-committee-protecting-womens-sports","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/524/GettyImages-1239310309.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-28 23:20:15","author":null,"language":"en","source_country":"us","sentiment":0.305},{"id":255146394,"title":"Trump delivered on Reagan’s promises — he’s the true heir conservatives seek","text":"As Donald Trump fights what now looks like an uphill battle against Kamala Harris, many Republicans find themselves thinking back to their high-school sweetheart. They fell in love with conservative politics thanks to Ronald Reagan, and they’re ambivalent about Trump. Over Labor Day weekend, they’ll have a chance to travel back to the golden age of the 1980s — but they can’t afford to stay there. “Reagan,” a biographical film many years in the making and starring Dennis Quaid as the man who becomes the 40th president, opens Aug. 30. It’s not going to challenge “Deadpool and Wolverine” for dominance at the box office. Nor is the movie — directed by Sean McNamara and based on Paul Kengor’s book “The Crusader: Ronald Reagan and the Fall of Communism” — going to sweep next year’s Academy Awards. It’s a modest production about a great man, but it comes at a time when old-guard conservatives are more uncertain than ever about how today’s GOP, the party of Trump, relates to Reagan’s principles. Stoking their doubts are bitter ex-Republicans who now make a living by sowing division on the right and plumping for Democrats. These are jilted consultants, defeated office-holders who blame Trump for their crashed careers, and a dozen or so pundits who once thought they could script the party’s direction — and would now rather be rewarded by the other side than swallow their pride and admit their mistakes. These bad-faith actors have made a habit of appropriating Reagan’s name, taking advantage of the fact he hasn’t been around to defend it for 20 years and was sidelined by Alzheimer’s a decade before that. The new movie offers no aid or comfort to phony conservatives for Kamala. Kengor, a professor at Grove City College in Pennsylvania who became the editor of The American Spectator two years ago, is a plumb-line conservative. His book and the biopic based on it showcase Reagan’s anti-Communism. But it’s true that Reagan’s gentility is nothing like Trump’s provocative personality. And some Reagan Republicans wonder if Trump hasn’t turned his back on the free-market policies that the Gipper championed, despite the historic tax cut Trump delivered in his first term. Does the Trump-Vance ticket’s support for tariffs and courting of trade unions show a disregard for what Reagan stood for? Republicans who ask themselves that may not vote for Harris, but if their enthusiasm for this year’s GOP nominee wanes, as they look longingly back to 1984, the potential for Trump to fall short in the swing states is grave. The undecided neighbor notices when the Republican next door isn’t eager to get out and vote — or go door-to-door volunteering — for his party’s candidate. In battleground states where outcomes are as close as they were in 2016 and 2020, morale is decisive: Just ask Hillary Clinton, who thought “blue wall” voters in Pennsylvania, Wisconsin and Michigan would turn out for her whether or not she showed up to ask for their votes. Yet Trump in fact has delivered for Reagan voters — just as, back in the day, Reagan delivered for the Americans who are now Trump voters. Trump’s get-tough attitude on trade was Reagan’s, too, and both were willing to use tariffs as necessary: Reagan saved Harley-Davidson by hiking tariffs on Japanese motorcycles more than tenfold, from 4.4% to a high of 49.4%. The real Reagan, not the Trump-shaming myth, courted union voters and unions themselves, yet didn’t let even those that endorsed him, like the air-traffic controllers’ PATCO, dictate policy or jeopardize the national interest. Trump returned America to the Reagan principle of peace through strength in foreign policy — while Joe Biden and Kamala Harris have unleashed chaos on a scale reminiscent of the Carter administration, when Iran seized American hostages and the Soviet Union invaded Afghanistan. Under Harris and Biden, there are American hostages in the Middle East once again, and Russia is brutalizing Ukraine. Trump doesn’t speak in the idealistic register of Reagan, but he’s like Reagan in his willingness to engage in daring diplomacy — as Reagan did with Mikhail Gorbachev — and also like him in boldly changing the way Americans think about our most dangerous rival. In Reagan’s time that was the USSR — today it’s China, and Trump has forced both parties to stop being complacent about Beijing. The Reagan movie ought to remind voters who cherish the Gipper’s record that history hinged on his election. The future of all Reagan secured for the country back then now hinges on what happens in this election, between a Republican who overall continues the Reagan legacy and a Democrat — Kamala Harris — who wants the memory of Reagan’s America to go the way of the Soviet Union. Daniel McCarthy is the editor of Modern Age: A Conservative Review and editor-at-large of The American Conservative.","summary":"Old-guard conservatives are more uncertain than ever about today's GOP, but they should take an honest look at Trump's first-term actions.","url":"https://nypost.com/2024/08/28/opinion/trump-is-reagans-true-heir-conservatives-must-back-him/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/2024-roseville-michigan-michigans-importance-88339096_8c1c91-e1724885737392.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-28 23:13:54","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.021},{"id":255146940,"title":"Harris, Walz tour Georgia, slam Trump, Project 2025","text":"Harris, Walz tour Georgia, slam Trump, Project 2025 The Harris-Walz ticket is taking a tour of Georgia, a battleground state in the 2024 election. The Democratic nominees are still slamming Project 2025 on the trail and trying to connect it to former President Donald Trump's campaign. CBS News chief White House correspondent Nancy Cordes has more.","summary":"The Harris-Walz ticket is taking a tour of Georgia, a battleground state in the 2024 election. The Democratic nominees are still slamming Project 2025 on the trail and trying to connect it to former President Donald Trump's campaign. CBS News chief White House correspondent Nancy Cordes has more.","url":"https://www.cbsnews.com/video/harris-walz-tour-georgia-slam-trump-project-2025/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/28/174b6a59-a14f-4ea2-b883-650e2eb0eb19/thumbnail/1200x630/3589ecb46340b853be5ac9432eed2de2/cbsn-fusion-harris-walz-tour-georgia-slam-trump-project-2025-thumbnail.jpg?v=25685eaa472b1a5dbb5bd46ae506d232","video":null,"publish_date":"2024-08-28 23:10:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.14},{"id":255146860,"title":"The Inside Story of Donald Trump and RFK Jr.’s Alliance","text":"As a result, sources say Carlson, Trump’s son Donald Trump Jr., and others helped engineer an alternative: Robert Kennedy Jr.’s decision to drop out and endorse Trump. Stone told people that Kennedy, whose third-party campaign served as a vehicle for his anti-vaccine views, was peeling off enough voters to tip the election to Kamala Harris. “You have maybe 3% of voters where opposition to vaccines is their one issue,” says a Republican who participated in the courtship of Kennedy. But getting Kennedy and Trump to forge an alliance almost didn’t happen. The two New York scions have famously big egos and a history of viciously attacking each other. Trump previously called Kennedy a “phony, radical-left fool,” a “Democratic ‘plant,’” and a “liberal lunatic.” Kennedy, meanwhile, wrote a 2018 Newsweek op-ed that said Trump’s “presidency has not just discredited our nation, but the entire American experiment in self government.” A breakthrough came following the July 13 assassination attempt on Trump’s life at a rally in Butler, Pennsylvania. A few hours after the shooting, Carlson put Trump and Kennedy on a text thread together, according to a person briefed on the communications. Kennedy texted Trump that he was ready to drop out and endorse him but wasn’t sure of the timing, the source says. On a phone call the following day, Trump courted Kennedy by endorsing Kennedy’s unproven view that vaccines hurt children. “When you feed a baby, Bobby, a vaccination that is like 38 different vaccines and it looks like it’s meant for a horse, not a, you know, 10-pound or 20-pound baby,” Trump said, “and then you see the baby all of a sudden starting to change radically. I’ve seen it too many times.” But the relationship hit a setback when Kennedy’s son, Robert Kennedy III, posted a video of the call with Trump to social media. The damage control fell to Florida financier Omeed Malik, a Trump donor and close friend of Don Jr. and Robert Kennedy III. (Malik’s anti-woke private equity firm, 1789 Capital, invested in Tucker Carlson’s digital video venture.) Malik arranged an in-person meeting between Trump and Kennedy on the opening day of the Republican convention to discuss an endorsement. According to people briefed on the meeting, Kennedy came in with unrealistic expectations that he could be FDA chairman or Health and Human Services Secretary in a Trump administration. “There were asks,” a source briefed on the talks tells me. (Kennedy denied this.) “The meeting concluded without a deal,” the source says. The Trump campaign declined to comment. Talks between Kennedy and Trump went dark. Over the next several weeks, Malik worked behind the scenes to bring Trump and Kennedy back together. According to the source, Kennedy and Trump agreed on four broad policy areas: treating chronic disease, opposing censorship, adopting an isolationist foreign policy, and exposing the deep state. The source said the deal-breaker was that Kennedy needed to be on Trump’s transition team. “That was nonnegotiable,” the source says. “There was no quid pro quo of any kind,” Kennedy tells Vanity Fair. On Tuesday, the Trump campaign announced Kennedy would serve as an honorary co-chair of the transition alongside former Democratic congresswoman Tulsi Gabbard. “This is going to give Bobby the ability to decide who gets into government,” the source says. Former Trump adviser Sam Nunberg says Kennedy’s presence on the transition is a signal to anti-vax voters that Trump will be an ally in office. “This is Trump’s way of winking to Kennedy’s supporters,” Nunberg says. One open question is what role Kennedy’s vice presidential pick, Nicole Shanahan, might play in Trumpworld. On Tuesday, Shanahan declined to say if she would campaign for Trump. And she disputed that Kennedy dropped out of the race. “We are technically still running and on the ballot! Just suspended,” she texted.","summary":"Tucker Carlson and Roger Stone are said to be among the Trump allies supporting a pact with Kennedy, who, sources say, was finally swayed with a transition role. “There was no quid pro quo of any kind,” Kennedy tells Vanity Fair.","url":"https://www.vanityfair.com/news/story/donald-trump-rfk-jr-alliance","image":"https://media.vanityfair.com/photos/66cf7b1ea50260ed0422d3e8/16:9/w_6912,h_3888,c_limit/vf0824-rkf-trump.jpg","video":null,"publish_date":"2024-08-28 23:07:42","author":"Gabriel Sherman","authors":["Gabriel Sherman"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.268},{"id":255146640,"title":"My Father Is Honored at Arlington. Trump Used the Site for a Political Stunt","text":"I don’t get to Washington D.C. as much as I did when I was younger. When I do, I stop in to see my father. Sometimes I bring a beer and sit down and catch him up on things. I tell him about his namesake grandson, my latest misadventures, and the current state of the republic. The next trip is going to be the toughest; I must let him know that my mom and his beloved wife died in January. It’s a one-way conversation because it takes place at Grave 99, Section 3, in Arlington National Cemetery. Cmdr. Peter Rodrick was lost in a plane crash off the USS Kitty Hawk in 1979. In my 20 or so visits, I’ve sat and talked with him and watched the business of burying the dead. Sometimes, there was a horse-drawn caisson carrying a flag-draped coffin of some teenage boy or girl killed in Iraq or Afghanistan. Then the crisp, staccato sounds of soldiers firing off a 21-gun salute as an officer hands a flag from a grateful nation to a mom, a dad, a wife, a son, a daughter who will never feel whole again. I know that was true of my mother. One thing I’ve always noticed at Arlington is the silence — even little kids dragged there on summer vacations seem to understand the solemnity of the grounds. The exception is Donald Trump. I was already pissed when I watched Trump on Monday turn a ceremony commemorating the third anniversary of the deaths of 13 soldiers at Abbey Gate during the harrowing evacuation of Afghanistan into a tawdry stunt. Trump was scoring cheap political points against the Biden-Harris administration for the chaotic withdrawal from Kabul, a withdrawal that had been set in motion by Trump himself, who wanted to take credit for ending the two-decade war without doing the hard work of extricating tens of thousands of soldiers and Afghan allies. I didn’t expect much better from Trump who has — deep breath — labeled John McCain a “loser” because he got captured when his plane was shot out of the Vietnam sky. He also dodged a 2020 visit to a French cemetery honoring American dead from World War I because his hair might get mussed up and, besides, “Why should I go to that cemetery? It’s filled with losers.” And we will never forget the time he mocked the mother of Humayun Khan, an army captain killed by a car bomb in Iraq, for standing alongside her husband Khizr at the 2016 Democratic National Convention while he criticized Trump for his anti-Muslim rhetoric, but not speaking herself. Khizr Khan said his wife, Ghazala, had not spoken because she was afraid she would break down. “Trump is devoid of feeling the pain of a mother who has sacrificed her son,” said Khizr Khan. So I wasn’t surprised Monday when Trump was shown giving his shit-eating grin and a thumbs-up at the grave of a fallen soldier. He looked like a fucking tourist visiting Jerry Lewis’ star on the Hollywood Walk of Fame. It was gruesomely inappropriate and totally true to his character. I did wonder if it violated Arlington’s policy of not politicizing America’s most sacred ground. Turns out I was right. The next day, NPR reported that Arlington officials and Trump campaign staff scuffled and argued over the Trump campaign filming grave sites, which is forbidden. That the fiasco happened did not surprise me, just the specific details. I laid in bed last night and thought how it was possible that a former American president could misunderstand the purpose of a place like Arlington. Let’s face facts, there are thousands buried there who were killed in wars that turned out neither to be just nor in the interests of the American people. (My father was killed in a training accident while his squadron prepared for a possible raid on Tehran after the hostages were taken in Iran, a direct result of the United States propping up the Shah, a cruel and kleptocratic monarch.) But that’s not the point. Soldiers and sailors don’t have a choice; all of them died for their country serving a cause that their leaders told them was crucial to the future of the United States. The fact that often turned out not to be true only makes their deaths more tragic. Donald Trump didn’t have to go to Arlington to film b-roll for attack ads. He could have just laid a wreath in memory of the 13 dead. He could have left his own camera crew in the parking lot. You see, Donald Trump had a choice. My father and the tens of thousands of dead buried here in their gardens of stone did not have that luxury. That Trump made the wrong choice should not surprise any American.","summary":"The former president's recent photo op at the hallowed military cemetery is just the latest offense in a history of disgraceful behavior when it comes to America's veterans and their families","url":"https://www.rollingstone.com/politics/politics-features/my-father-is-honored-at-arlington-trump-photo-political-stunt-1235090472/","image":"https://www.rollingstone.com/wp-content/uploads/2024/08/trump-arlington-essay.jpg","video":null,"publish_date":"2024-08-28 23:05:23","author":"Stephen Rodrick","authors":["Stephen Rodrick"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.228},{"id":255146612,"title":"Fake accounts on X use stolen images of influencers to appear authentic","text":"Fake accounts on X use stolen images of influencers to appear authentic | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Fake accounts on X use stolen images of influencers to appear authentic Jim WATSON, Odd ANDERSEN Tags Partners/afp As featured on Pro-Trump X accounts use stolen photos of European influencers: study Meet \"Eva,\" \"Sophia,\" and \"Samantha\" -- fake accounts which pose as chic American women who support Donald Trump on the platform X, disguising themselves by using stolen photographs of European fashion and beauty influencers, according to a study published Wednesday. Facebook Twitter WhatsApp SMS Email Print Save Atkins Kroll supports Make-A-Wish with vehicle donation Aug 22, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Hiker in 35-foot fall dies, GFD defends response time Hiker transported by helicopter to hospital after 35-foot fall in Sånta Rita-Sumai GPD: 2 men wanted in Dededo kidnapping GovGuam to settle for over $245K with former DOC officer fired in contraband case Inmate walks out of prison, found at bus stop a few minutes later Local Events","summary":"Fake accounts on X use stolen images of influencers to appear authentic","url":"https://www.guampdn.com/news/national/fake-accounts-on-x-use-stolen-images-of-influencers-to-appear-authentic/image_eaa41a9a-604c-5e20-ae0e-68c97b2d4caa.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/e/aa/eaa41a9a-604c-5e20-ae0e-68c97b2d4caa/66cfafa4e82e8.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-28 23:04:59","author":"Jim WATSON,Jim Watson, Odd Andersen,Odd ANDERSEN","authors":["Jim WATSON","Jim Watson, Odd Andersen","Odd ANDERSEN"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.031},{"id":255147352,"title":"Republican candidate and former president Donald Trump is also stepping up his campaign in the US swing states","text":"Republican candidate and former president Donald Trump is also stepping up his campaign in the US swing states | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Republican candidate and former president Donald Trump is also stepping up his campaign in the US swing states Ellen SCHMIDT Tags Partners/afp As featured on Harris barnstorms battleground Georgia as US campaign sprint starts US Vice President Kamala Harris embarked on a bus tour of Georgia on Wednesday as Democrats try to harness a surge of enthusiasm and put the swing state back in play in November's election against Donald Trump. Facebook Twitter WhatsApp SMS Email Print Save Atkins Kroll supports Make-A-Wish with vehicle donation Aug 22, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Hiker in 35-foot fall dies, GFD defends response time Hiker transported by helicopter to hospital after 35-foot fall in Sånta Rita-Sumai GPD: 2 men wanted in Dededo kidnapping GovGuam to settle for over $245K with former DOC officer fired in contraband case Inmate walks out of prison, found at bus stop a few minutes later Local Events","summary":"Republican candidate and former president Donald Trump is also stepping up his campaign in the US swing states","url":"https://www.guampdn.com/news/national/republican-candidate-and-former-president-donald-trump-is-also-stepping-up-his-campaign-in-the/image_5ec4a950-d3bb-5e35-b033-de62fb599959.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/5/ec/5ec4a950-d3bb-5e35-b033-de62fb599959/66cfa16fac152.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-28 23:04:52","author":"Ellen Schmidt","authors":["Ellen Schmidt"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.482},{"id":255147358,"title":"Democratic presidential candidate Kamala Harris took photos with supporters by her campaign bus","text":"Democratic presidential candidate Kamala Harris took photos with supporters by her campaign bus | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Democratic presidential candidate Kamala Harris took photos with supporters by her campaign bus SAUL LOEB Tags Partners/afp As featured on Harris barnstorms battleground Georgia as US campaign sprint starts US Vice President Kamala Harris embarked on a bus tour of Georgia on Wednesday as Democrats try to harness a surge of enthusiasm and put the swing state back in play in November's election against Donald Trump. Facebook Twitter WhatsApp SMS Email Print Save Atkins Kroll supports Make-A-Wish with vehicle donation Aug 22, 2024 Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Hiker in 35-foot fall dies, GFD defends response time Hiker transported by helicopter to hospital after 35-foot fall in Sånta Rita-Sumai GPD: 2 men wanted in Dededo kidnapping GovGuam to settle for over $245K with former DOC officer fired in contraband case Inmate walks out of prison, found at bus stop a few minutes later Local Events","summary":"Democratic presidential candidate Kamala Harris took photos with supporters by her campaign bus","url":"https://www.guampdn.com/news/national/democratic-presidential-candidate-kamala-harris-took-photos-with-supporters-by-her-campaign-bus/image_560d2bf3-5e16-5cb8-b56c-527d9f88e143.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/5/60/560d2bf3-5e16-5cb8-b56c-527d9f88e143/66cfa16f84eb8.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-28 23:04:52","author":"Saul Loeb","authors":["Saul Loeb"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.524},{"id":255146066,"title":"Megyn Kelly Calls CNN’s Kaitlan Collins a ‘Biased,’ ‘Cold-Hearted Bitch’ After Viral Bill Maher Interview | Video","text":"Megyn Kelly attacked CNN’s Kaitlan Collins following an appearance the anchor made on Bill Maher’s show, calling her a “cold-hearted b*tch,” and arguing against the notion that CNN provides fair and balanced coverage. “The media, of course, has been disgusting,” Kelly kicked off her segment on her SiriusXM show, adding that a recent clip of Collins, “who CNN is trying to make into a star,” went viral. “I’m sorry, but she’s only a star with leftists and the fact that she has some roots in Alabama does not make her a fair and balanced reporter,” Kelly said. “I will submit for the record: Her biggest sin is not that she is biased, though she is, it’s that she’s boring. She’s extremely boring with no personality.” Kelly continued the intensely personal attacks, saying “I have a pro tip for her: Smile, try smiling every once in a while.” “Try not to be, like in your delivery, such a cold-hearted b*tch all the time, because it gives people nothing to bond to,” Kelly carried on, unprompted. “You can be a tough interviewer and also have some warmth—unless there’s none inside of you, in which case it’s more difficult.” Kelly then admitted that she doesn’t even know Collins personally, after leveling attacks on her character. The viral clip was then shown of Collins asserting that Donald Trump’s threatening nature toward the press is more concerning than Kamala Harris’ lack of participation in an interview. “I don’t think you can say that CNN is anything but fair,” Collins said in the clip. Kelly scoffed at the assertion, saying “She was actually on there suggesting that CNN is fair in its coverage and that you can trust CNN.”","summary":"The conservative podcaster levels the personal attacks, then admits she doesn't know Collins \n\n\nThe post Megyn Kelly Calls CNN&#8217;s Kaitlan Collins a &#8216;Biased,&#8217; ‘Cold-Hearted Bitch’ After Viral Bill Maher Interview | Video appeared first on TheWrap.","url":"https://www.thewrap.com/megyn-kelly-kaitlan-collins-cnn-bill-maher/","image":"https://www.thewrap.com/wp-content/uploads/2024/08/Kaitlan-Collins-Megyn-Kelly.jpeg","video":null,"publish_date":"2024-08-28 23:03:57","author":"Natalie Korach","authors":["Natalie Korach"],"language":"en","source_country":"US","sentiment":-0.233},{"id":255146182,"title":"Letters: Library name | Easy choice | Heat-related deaths | Residents’ PR","text":"Consider Korean War vet for library name Re: “Milpitas considers library name change” (Page B1, Aug. 23). Denny Weisgerber must be considered for the Milpitas Library name change. He is a former mayor of Milpitas, a Korean War veteran, a Marine and a war hero. Every Memorial Day a line of people would be eagerly waiting to shake his hand. He passed in 2019 and is very much missed. I truly hope his name is considered alongside Jose Esteves. Francisco Quintana San Jose If character counts, election choice is easy Re: Nick Anderson cartoon (Page A8, Aug. 25). The political cartoon showing Donald Trump picking up the dead RFK Jr.’s campaign in the form of a dead bear was spot on. What are we looking for in the character of our next President? Our President, at a minimum, should swear to protect and defend our Constitution; agree to a peaceful transfer of power; and be ethical, do not lie about “stolen” elections and agree that our voting system is safe and secure (the real bedrock of a healthy democracy). I am usually referred to as a “liberal” when I criticize Trump. I am not a liberal. I am not a member of either the Democratic or Republican Party. If you believe character is important, you have an easy decision this November. John Swan Los Altos Hills Rise in deaths from heat calls for change Re: “Heat-related deaths spiked 117% in the US since 1999” (Aug. 26). A 117% rise in heat-related deaths in a short span of just over two decades is shocking. Dangerously though, this number may just be a scratch on the surface as these deaths are often difficult to account for. As residents of the Bay Area, we live in climate’s favorite pocket — with year-round moderate temperatures and clean air. But this geographical reality too is changing. As this summer showed, soaring mercury levels have made their way to our homes. Now, more than ever, we must minimize our negative environmental fallouts while bracing ourselves to deal with the unavoidable consequences of historic fossil fuel dependence. There is no better time than now for residents to drive electrification in our homes and demand a carbon dividend fee from big polluters. Elections can be fought over many disagreements, but the election where we agree to fight for climate is the “hottest.” Radhika Dutt Mountain View Carbon Removal Act needs residents’ PR Startups around Silicon Valley know being a “trailblazer” isn’t easy. I was in Sacramento recently volunteer-lobbying for support of SB 308, introduced by Sen. Josh Becker, to strengthen carbon dioxide removal (CDR). Unfortunately, it didn’t make it through the Assembly Appropriation Committee. As a grandmother-to-be, I’m all for CDR to safely take carbon out of the air and reach net-zero faster because environmental-related respiratory issues are on the rise in our family. Learn about CDR and help make it a household name. Have as many conversations as you can to demystify it and get folks comfortable with it, then write your representatives. Jenn Bulka Redwood City","summary":"Mercury News Letters to the Editor for Aug. 29, 2024","url":"https://www.mercurynews.com/2024/08/28/letters-1847/","image":"https://www.mercurynews.com/wp-content/uploads/2024/02/SJM-L-LIBRARY-03XX-10.jpg?w=1024","video":null,"publish_date":"2024-08-28 23:00:54","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.002},{"id":255145744,"title":"Trump Administration Welcomes RFK with Enthusiasm to Gain Support from Doubters","text":"As 21 columns of fire shot out of the stage, Donald Trump walked out in front of a booming crowd in Phoenix last week to introduce the exiled scion of Democratic royalty he hoped would, once again, reset the 2024 campaign. “Had he been allowed to enter the Democratic primary, he would have easily beaten Joe Biden,” Trump said to a huge crowd about Robert F. Kennedy Jr., who stood on stage prepared to endorse Trump over the objection of his own family. “But they would not let him.” Kennedy’s support for Trump comes after weeks of momentum by Vice President Kamala Harris. President Joe Biden’s exit from the race gave her a polling boost, which even Trump’s team expects to continue after last week’s widely watched Democratic National Convention. Kennedy was running for president as a Democrat before becoming an independent, but then last week dropped his bid completely and backed Trump. The rally in Phoenix, which opened with the sort of strobe lights and pyrotechnics expected at a concert or monster truck rally, was Kennedy’s splashy coming-out party in Republican politics. The Kennedy family has openly viewed Robert F. Kennedy Jr. as their black sheep because he both flirts with right-wing conspiracies — most notably as a vocal voice in the anti-vaccination movement — and has been well outside the Democratic Party’s political mainstream. But for Trump’s campaign, the endorsement from Kennedy has been framed as a huge win — even though it came from someone Trump himself called “liberal” when Kennedy was still running for president. The Trump campaign gave the Kennedy endorsement more oxygen than perhaps any other endorsement to date, hoping he can convince some disenchanted Democrats and skeptical conservatives to come aboard. Beyond the rock star greeting Kennedy received in Phoenix, Trump and his campaign-aligned social media accounts have spent a significant time hyping the endorsement. There has been such a rush of intensity that some social media accounts run by Trump allies with huge followings have joked that Trump-Kennedy is the real Republican ticket instead of the actual running mate: Sen. JD Vance of Ohio. “The strongest anti-establishment ticket in American History,” tweeted Benny Johnson, a right-wing social media influencer with 2.7 million followers. The infamous “Distracted Boyfriend” meme was also repurposed to show Trump longing after Kennedy while a hapless Vance looked on. Vance laughed off the meme when told about it in an interview on Tuesday. “The meme stuff just doesn’t bother me at all,” he told NBC News aboard his plane. “I’ve never worried about where I stand with him [Trump], and I’ve never worried about whether we’re going to win this race. I just have to play the role that I can. And if that means RFK gets more headlines in a given week, good for him.” Trump himself has repeatedly posted about the Kennedy endorsement on his social media pages, and he and his supporters have used the endorsement of both Kennedy and former Democratic Rep. Tulsi Gabbard of Hawaii as proof of a generational “realignment” of American politics. Like Kennedy, Gabbard — who has been helping Trump with debate prep — is seen as out-of-step with mainstream Democratic politics, but the Trump campaign has said that her and Kennedy’s support is proof he is able to attract Democrats upset by the state of their own party. Both were named to Trump’s transition team this week, but only Kennedy received the rock star-like welcome to Team Trump after his endorsement. Kennedy has long said his top policy priorities are stopping government censorship — especially on social media platforms — ending foreign wars and focusing on boosting the nation’s health, especially among children. Part of his welcome message to the Trump campaign was “Make America Healthy Again.” Vance told reporters Tuesday that those are perfect focuses for Kennedy on the campaign trail or for the Trump transition team. “I think RFK talks about a lot of stuff that, frankly, the media does not talk about, like why do we have one of the highest obesity rates in the world?” Vance said. “Why do we have such bad health problems with our kids, skyrocketing rates of mental abuse, skyrocketing rates of addiction?” Spokespeople for Vance and the Trump campaign would speculate on any role Kennedy would have in a potential Trump administration, but a Trump official said the former president is aligned with Kennedy on most of his top-tier policy priorities. The two do disagree on some issues, most prominently abortion, but have said their new alliance is about larger existential threats to the country. Longtime Republican operative and Trump supporter Roger Stone says that Kennedy’s addition to the campaign can help offset perceived Trump weaknesses, mainly the fact that during his time in the White House his administration created a Covid-19 vaccination program now wildly unpopular with Republican base voters and something Kennedy vocally opposes. Another area where Stone thought Kennedy could help is balancing the fact that Trump appointed people to key posts — like FBI Director Christopher Wray and former national security adviser H.R. McMaster — who are now deeply unpopular with Trump supporters. They are seen as part of a prior era of GOP politics that supported U.S. involvement in foreign wars over domestic interests. “I think he has several different values,” Stone said of Kennedy. “If you think one of the complaints of some about the Trump presidency is the handling of the [Covid vaccine rollout] and pandemic and the appointment of neo-cons, Kennedy is clearly critical of the vaccine and those people.” “I think he is able to reassure voters,” Stone added. On Kennedy’s well-known vaccine skepticism, Vance told NBC News that his three children have received “the standard vaccines,” but he likes Kennedy’s “general skepticism” to the public health bureaucracy. “That doesn’t mean that I agree with him on every issue, but I do think that we should be a little bit more willing to challenge public health authorities in the wake of Covid,” Vance said. Trump’s embrace of Kennedy prompted the sort of backlash to be expected from the Democratic National Committee, which worked to keep Kennedy off the ballot in several states and outlined its opposition to him in a memo last Friday, but also from Kennedy’s own family, who has long opposed his political viewpoints. “Our brother Bobby’s decision to endorse Trump today is a betrayal of the values that our father and our family hold most dear,” his sister Kerry Kennedy and four other family members said in a statement on X. The DNC memo referred to “disqualifying acts” — a nod to a series of bizarre stories that have come out in recent weeks about Kennedy, such as him being behind a well-known incident in which a dead bear cub was dumped in Central Park, and another in which Kennedy used a chainsaw to cut the head off a dead whale. A potential complication moving forward is the fact that while Kennedy has said he is dropping his bid for president, he will likely be on the ballot in up to two-dozen states. Kennedy said he would remove his name from the ballot in 10 states considered toss-ups, but has not yet specified those states. Judges in Nevada and Pennsylvania, key swing states, have approved removing Kennedy’s name from the ballot. Conversely, judges in the key “blue wall” states of Michigan, Wisconsin and Minnesota have ruled that Kennedy’s name will appear on the ballot in those states. A memo from Trump pollster Tony Fabrizio released shortly after Kennedy’s endorsement showed that his exit from the race helped Trump in seven key swing states: Arizona, Georgia, North Carolina, Nevada and Pennsylvania, as well as Wisconsin and Michigan. “The net vote gained in a state like Arizona based on just 2020 turnout model would be over 41,000 votes, nearly 4 times Biden’s winning margin,” Fabrizio wrote. “In Georgia the net gain would be over 19,000 votes nearly twice Biden’s margin.” “This is good news for President Trump and his campaign — plain and simple,” he added.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAs 21 columns of fire shot out of the stage, Donald Trump&#8230;\n\n\nThis Post: Trump Administration Welcomes RFK with Enthusiasm to Gain Support from Doubters first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-administration-welcomes-rfk-with-enthusiasm-to-gain-support-from-doubters/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Trump-world-rolls-out-the-red-carpet.jpg","video":null,"publish_date":"2024-08-28 23:00:29","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.273},{"id":255148318,"title":"Democrats hoped population growth would turn North Carolina blue, but here's how Trump is crushing those hopes","text":"Democrats believed that population growth in high-density areas of North Carolina would help them turn the red tide, but a separate trend might crush those hopes completely. The Cook Political Report changed North Carolina from a right-leaning to a toss-up state based on demographic trends, but an analysis by NBC poll analyst Steve Kornacki says former President Donald Trump is also gaining in Republican-leaning parts of the state. 'Republicans have made gains. They sort of almost canceled each other out there.' Kornacki points out that Democrats have been able to shave down Trump's advantage in the state from a gap of about 175k votes in the 2016 election down to only 75k votes in the 2020 election against Biden. This has led many Democrats to believe that Vice President Kamala Harris might be able to turn the state blue. \"One thing we see is Democratic support getting increasingly concentrated geographically into metropolitan areas, suburbs with high concentrations of college diplomas,\" he explained. However, despite the city and metro parts of the state becoming more Democratic, Kornacki says that Trump has been able to make up the difference by pushing the red parts of the state farther to the right. In one example cited in the analysis, Trump was able to win Hamilton County with a margin of 25 points in 2020 after former President Barack Obama lost the same county by only eight points in 2016. While the county is small in terms of population, it could be a stand-in for all the other Republican-leaning parts of the state, which are smaller in population but greater in total number, Kornacki says. \"Smaller counties, more diffuse geographically, Republicans have made gains. They sort of almost canceled each other out there,\" he said. Kornacki went on to say that if Democrats are able to turn out the blue vote in the more populous regions, they might have a chance to win the state and switch 11 electoral votes from the red column to the blue column. Here's the news video from MSNBC of Kornacki's analysis on YouTube. Like Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"Democrats believed that population growth in high-density areas of North Carolina would help them turn the red tide, but a separate trend might crush those hopes completely.\n\n\n\n\tThe Cook Political Report changed North Carolina from a right-leaning to a toss-up state based on demographic trends, but an analysis by NBC poll analyst Steve Kornacki says former President Donald Trump is also gaining in Republican-leaning parts of the state.\n\n\n\n\t'Republicans have made gains. They sort of almost canceled each other out there.'\n\n\n\n\tKornacki points out that Democrats have been able to shave down Trump's advantage in the state from a gap of about 175k votes in the 2016 election down to only 75k votes in the 2020 election against Biden. This has led many Democrats to believe that Vice President Kamala Harris might be able to turn the state blue.\n\n\n\"One thing we see is Democratic support getting increasingly concentrated geographically into metropolitan areas, suburbs with high concentrations of college diplomas,\" he exp","url":"https://www.theblaze.com/news/north-carolina-swing-trump-crushes","image":"https://www.theblaze.com/media-library/image.jpg?id=53566714&width=1200&height=600&coordinates=0%2C0%2C0%2C500","video":null,"publish_date":"2024-08-28 23:00:10","author":"Blaze News","authors":["Blaze News"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.367},{"id":255145942,"title":"Trump Posts TikTok From Controversial Visit to Arlington National Cemetery","text":"Donald Trump posted a TikTok of his visit to Arlington National Cemetery, stoking further controversy about whether he should have filmed on the hallowed grounds or not. Trump, 78, slyly criticized Joe Biden’s administration without mentioning the president or Kamala Harris by name. The 21-second video features a Trump voiceover as he stands by gravesites, visits with Gold Star families, and lays a wreath at a memorial. “We lost 13 great, great people,” Trump says in the clip. “What a horrible day it was. We didn’t lose one person in 18 months and then they took over that disaster, the leaving of Afghanistan.”","summary":"Anna Moneymaker/Getty ImagesDonald Trump posted a TikTok of his visit to Arlington National Cemetery, stoking further controversy about whether he should have filmed on the hallowed grounds or not.Trump, 78, slyly criticized Joe Biden’s administration without mentioning the president...","url":"https://nation.lk/online/trump-posts-tiktok-from-controversial-visit-to-arlington-national-cemetery-275170.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-28 23:00:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.353},{"id":255145620,"title":"Memo to media: Harris-Walz ticket isn't the first to do team interview","text":"Democratic presidential nominee Kamala Harris and her running mate, Minnesota Gov. Tim Walz, will be tag-teaming their first major interview, spurring criticism from conservatives as well as some members of the so-called liberal media. The primetime sit-down set to air on CNN Thursday will be the first for Harris since the vice president secured the delegate votes to replace President Joe Biden as the Democratic nominee. “Should CNN have insisted on a one-on-one interview with Harris and turned down a joint interview with Harris and Walz?” former CBS News White House Correspondent Mark Knoller tweeted. “Too tough to walk away from. But first question to Harris ought to be why should [sic] couldn’t appear solo.” Knoller is reinforcing the conservative talking point that Harris is unqualified and unprepared to be president. That talking point is loaded with racism and sexism, but it’s also free of historical context or the clear track record of political candidates doing dual interviews with their running mates—and journalists like Knoller should know better. Who could forget when Donald Trump and his running mate, Ohio Sen. JD Vance, sat down to talk with Fox News dirtbag Jesse Watters in July? That’s when Trump revealed his sorry reason for choosing the political kryptonite that is Vance. Spoiler alert: Vance was chosen because he liked Trump, “maybe more than anybody liked me.” Then there was the profoundly awkward interview Trump did with his previous running mate, Mike Pence, in 2016. This was less than four years before Trump-inspired MAGA insurgents set about trying to hang the evangelical politician at the Capitol for refusing to stop the certification of electoral votes. Trump’s opponent Hillary Clinton did an interview alongside her running mate, Virginia Sen. Tim Kaine, in 2016. Remember when Sen. Mitt Romney and his rising star Republican running mate, Rep. Paul Ryan, sat down with “60 Minutes” in 2012? And in 2008, then-Sen. Barack Obama sat down with “60 Minutes” alongside his running mate, then-Sen. Joe Biden. Keep in mind that Harris is in a unique situation because incumbent Biden announced his decision to drop out of the race a mere 38 days ago, setting the stage for her historic run. Unlike Trump, who literally never stopped campaigning (even when he became president) or any previous presidential candidate, Harris hasn’t had a year or more to campaign and grant numerous interviews. Instead, she has had little more than one month to vet and choose a running mate, build a coalition of supporters in record time, hold rallies across the country, and pull off a wildly successful Democratic National Convention. Considering Harris and Walz’s excellent chemistry, Thursday night’s interview should be a fun watch. Tune in to watch the joyful duo continue to trigger the hell out of right-wingers everywhere.","summary":"Democratic presidential nominee Kamala Harris and her running mate, Minnesota Gov. Tim Walz, will be tag-teaming&nbsp;their first major interview, spurring criticism from conservatives as well as some members of the so-called liberal media. The primetime sit-down set to air on CNN Thursday will be the first for Harris since the vice president secured the delegate votes to replace President Joe Biden as the Democratic nominee.\n\n\n\n“Should CNN have insisted on a one-on-one interview with Harris and turned down a joint interview with Harris and Walz?” former CBS News White House Correspondent Mark Knoller tweeted. “Too tough to walk away from. But first question to Harris ought to be why should [sic] couldn’t appear solo.”\n\n\n\nKnoller is reinforcing&nbsp;the conservative talking point that Harris is unqualified and unprepared to be president. That talking point is loaded with racism and sexism, but it’s also free of historical context or the clear track record of&nbsp;political candidates doing dual interviews wit","url":"https://www.dailykos.com/story/2024/8/28/2266347/-Memo-to-media-Harris-Walz-ticket-isn-t-the-first-to-do-team-interview?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1339486/story_image/Running-mates.jpg?1724871081","video":null,"publish_date":"2024-08-28 23:00:03","author":"Walter Einenkel","authors":["Walter Einenkel"],"language":"en","source_country":"US","sentiment":-0.344},{"id":255145962,"title":"Zelenskyy’s new plan to end the war, explained","text":"Ukraine’s President Volodymyr Zelenskyy announced Tuesday that he has a new plan to end Russia’s years-long war on his country. Zelenskyy has only outlined the plan in broad strokes, but Russian President Vladimir Putin reiterated Wednesday that he’s not interested in a diplomatic resolution. That rejection means Zelenskyy’s plan isn’t actually a realistic framework for ending the war any time soon. But it is nevertheless a useful document that outlines one scenario for how the war might end — and seems to be a tacit acknowledgement that Ukraine does not see a path to ending the conflict through force. Zelenskyy outlined the plan’s four components as: * Continuing Ukraine’s recent incursion into Russia’s Kursk region — troops entered the area in early August and now hold more than 500 square miles of territory in an effort to pull Russian troops away from the frontline in eastern Ukraine. * Ensuring “security architecture” — a vague element that likely refers to Ukraine’s potential membership in NATO and the European Union. * Receiving a “powerful package” — likely referring to weapons — which will push Russia to enter into negotiations. Ukraine has requested more arms from allies (Zelenskyy will also probably ask permission to use weapons in Russian territory, something that was until recently forbidden). * Advancing an economic component — there’s little clarity about this piece of the plan, but it likely refers to increased sanctions on Russia. The focus on weapons, security, and Kursk seems to suggest the overarching goal of the plan is to force Russia to the negotiation table through continued military action. Zelenskyy said he intends to present the plan to US President Joe Biden in September, when the Ukrainian president plans to attend the United Nations General Assembly, as well as to presidential candidates Vice President Kamala Harris and former President Donald Trump. “The success of this plan depends on [Biden],” Zelenskyy said Tuesday, in a seeming acknowledgement of the US’ and NATO allies’ role in keeping Ukraine stocked with weapons. “Will they give what we have in this plan or not? Will we be free to use what we have in this plan or not?” But even as Zelenskyy discussed his plan to end the war — which has decimated large swaths of Ukraine’s southeast and driven hundreds of thousands of Russians into exile — Russia launched multiple air attacks against targets in southeastern and central Ukraine. Those attacks killed at least two people at a hotel in Zelenskyy’s hometown of Kryvyi Rih, and targeted nearly half of Ukraine’s regions, including the capital Kyiv and the Zaporizhzhia region, the site of Europe’s largest nuclear power plant. The path to peace is still extremely fraught; Zelenskyy’s plan doesn’t change that There are still many barriers to peace. Chief among them is that Russia has flatly rejected the idea of a diplomatic end to the hostilities. “The topic of negotiations at the moment has pretty much lost its relevance,” Kremlin spokesperson Dmitry Peskov said on Tuesday, echoing a line that Kremlin officials have stuck to since Ukrainian forces began capturing parts of Kursk. It’s not clear what might get Russia to sit down and negotiate, though Jennifer Kavanagh, senior fellow and director of military analysis at Defense Priorities, a defense think tank, told Vox that there “could be an opportunity for one of these third parties” — such as India or Turkey, which have relationships with both Russia and Ukraine’s allies — “to play a big role” in the end of the war. Indian Prime Minister Narendra Modi, who has so far refused to condemn Russia’s invasion, reportedly offered Ukraine help with negotiating an end to the fighting. Modi also reportedly told Putin Tuesday that he supported efforts for a peaceful, diplomatic resolution to the war — soon. It’s difficult to say what a diplomatic end to the war might look like, and Zelenskyy’s plan doesn’t offer any suggestions. But according to William Courtney, an adjunct senior fellow at RAND and a diplomat who served in Russia and eastern Europe, an end may not look like “total surrender” or a political settlement, but rather something like a sustained ceasefire. The danger with that arrangement, however, is that “Russians are notorious for violating their international commitment,” Courtney told Vox — meaning there’s no guarantee a ceasefire would be sustained. For now, however, any path to peace seems to lie at the end of more fighting. And that means despite the impressive Kursk push and Zelenskyy’s plan, the prospect of an imminent peaceful resolution looks dim.","summary":"Ukraine’s President Volodymyr Zelenskyy announced Tuesday that he has a new plan to end Russia’s years-long war on his country. Zelenskyy has only outlined the plan in broad strokes, but Russian President Vladimir Putin reiterated Wednesday that he’s not interested in a diplomatic resolution. That rejection means Zelenskyy’s plan isn’t actually a realistic framework for [&#8230;]","url":"https://www.vox.com/world-politics/369339/ukraine-zelenskyy-russia-putin-war-biden-sanctions-weapons-negotiations","image":"https://platform.vox.com/wp-content/uploads/sites/2/2024/08/gettyimages-2168791654.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200","video":null,"publish_date":"2024-08-28 23:00:00","author":"Ellen Ioanes","authors":["Ellen Ioanes"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.172},{"id":255145746,"title":"Biden spends time at the beach with Jill during his two-week break, following questions about White House leadership.","text":"President Joe Biden appeared in public for the first time in three days, joining his wife Jill Biden on the beach near their vacation home in Rehoboth, Delaware. The first lady’s two sisters and her senior adviser Anthony Bernal joined them on the hot, sunny day. The group sat under two blue umbrellas. Some passers-by waved at them as they walked the beach. It’s day nine of the president’s two-week vacation. He often sits on the beach when he’s in Rehoboth. He had a blue bag with him and was seen removing a file folder stacked with papers. Biden arrived in Rehoboth Beach on Sunday after spending a week at an 8,000-acre ranch in Santa Ynez, California. He’ll be in Rehoboth until Monday, when he joins Kamala Harris in Pittsburgh for a campaign event. He’s preparing to get back into the swing of things. He’ll hit the road next week, heading to Wisconsin on Thursday to talk about his administration’s push to lower costs for Americans. Wisconsin in a critical battleground state for Democrats in the 2024 election. Biden is no longer on the ballot but can talk about what he and Kamala Harris have done to help the country. Democrats consider Wisconsin a must-win state. Meanwhile, the White House has defended Biden’s two-week break, saying he is in charge and running the country from his vacation locations. ‘The president is on vacation, but you can never unplug and from a job like that. Nor does he try to,’ National Security Council spokesperson John Kirby said Monday in a zoom briefing with reporters. ‘He’s very much in command,’ he noted of Biden. He pointed out Biden spoke with Indian Prime Minister Narendra Modi on Monday and talked to Ukrainian President Volodymyr Zelensky on Friday as proof the president is working. The White House has long argued Biden can perform the duties of president where ever he goes. When the president travels, a staff member on the National Security Council travels with him to keep him briefed on foreign affairs and a staffer in the chief of staff’s office is with him to keep him updated on domestic matters. Biden is on his 114th visit to Delaware spanning all or part of 328 days, according to journalist Mark Knoeller who tracks presidential travel. That is much more when compared to Donald Trump at a similar point in office: he spent 51 visits and 240 days at either of his estates in Mar-a-Lago, Fla., or Bedminster, N.J. It’s the second week in a row of downtime for the Bidens. They jetted off to Santa Ynez, California, on Monday night after Biden addressed the Democratic National Convention in Chicago. The couple – along with their children and grandchildren – stayed at a California ranch owned by Democratic donor billionaire Joe Kiani. The property sits about three hours north of Los Angeles in Santa Barbara wine country. Kiani has been a major donor to Biden’s campaigns and a friend to the family. Hunter Biden paid a visit to the $50 million vineyard property last year. Dubbed the ‘Kiani Preserve,’ the 8,000 acres has its own private vineyard, donkeys and a cattle herd. The vineyard on the property produces bottles of Shiraz and Cabernet Sauvignon, among other wines. The president doesn’t drink but the first lady is known to enjoy a glass or two of wine. Biden exited the presidential race on July 21 after his terrible debate performance against Donald Trump, which led to concerns about his mental abilities. ‘Over the next six months, I’ll be focused on doing my job as president,’ Biden said in his July 24 Oval Office address.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Joe Biden appeared in public for the first time in three&#8230;\n\n\nThis Post: Biden spends time at the beach with Jill during his two-week break, following questions about White House leadership. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/biden-spends-time-at-the-beach-with-jill-during-his-two-week-break-following-questions-about-white-house-leadership/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Biden-hits-the-beach-with-Jill-on.jpg","video":null,"publish_date":"2024-08-28 22:58:27","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.006},{"id":255146328,"title":"Pro-Trump X Accounts Use Stolen Photos Of European Influencers: Study","text":"Meet \"Eva,\" \"Sophia,\" and \"Samantha\" -- fake accounts which pose as chic American women who support Donald Trump on the platform X, disguising themselves by using stolen photographs of European fashion and beauty influencers, according to a study published Wednesday.The report by the nonprofit Center for Information Resilience (CIR) comes as researchers express alarm ahead of the US election in November that the site owned by Elon Musk -- who has endorsed Trump -- is plagued with fake accounts and political disinformation.CIR said it uncovered 16 accounts that used images of European influencers -- without their permission -- to pose as young women promoting Trump and encouraging thousands of followers to vote for the Republican nominee.These accounts, which use stolen images of real people to appear authentic, were among 56 profiles that appear to be part of a coordinated campaign to push pro-Trump content, it added. \"By using images of the influencers, the accounts recognize the value of creating a believable human persona, steering clear of the generic photos and bot-like usernames usually associated with fake accounts,\" CIR's report said.It was unclear who was behind the digital deception or whether the accounts were pushing pro-Trump content for ideological or monetary gain.The fake profiles use everyday images from the influencers' Instagram accounts -- including pictures of them at the beach or walking their dog -- which are captioned with MAGA-related hashtags or pledges to vote for Trump, CIR said.MAGA, or Make America Great Again, is a political slogan associated with Trump and his campaign.Many of the accounts have attempted to spread misinformation about hot-button political subjects such as a recent assassination attempt against Trump, his Democratic rival Kamala Harris's ethnicity and US military aid to Ukraine, the report said.Some accounts also promote anti-vaccine and Covid-19 conspiracies, with some posts viewed hundreds of thousands of times.\"They post about divisive issues in US politics in a bid to exploit pre-existing tensions,\" the report said.One of the impersonators is \"Luna,\" a self-described 32-year-old \"MAGA Trump supporter,\" who used images of a German fashion influencer named Debbie Nederlof, according to CNN, which jointly conducted the investigation with CIR.Nederlof, a single mother, voiced anger and frustration over the misuse of her images, saying she had \"nothing to do with the United States, with Trump, the political things over there.\"\"What the hell do I -- from a small place in Germany -- care about US politics?\" she said.X did not respond to a request for comment.Impersonation is a violation of the platform's rules, and accounts posing as another person, group or organization may be \"permanently suspended,\" according to X's website.Musk appears to exert an outsized influence on US voters through the platform and his own personal account, which is regularly flagged by fact-checkers for spreading political falsehoods to his nearly 196 million followers. Since Musk's 2022 acquisition of X, the platform has gutted trust and safety teams and scaled back content moderation efforts once used to tame misinformation, making it what researchers call a haven for disinformation.","summary":"Meet \"Eva,\" \"Sophia,\" and \"Samantha\" -- fake accounts which pose as chic American women who support Donald Trump on the platform X, disguising themselves by using stolen photographs of European fashion and beauty influencers, according to a study published Wednesday.","url":"https://www.ibtimes.com/pro-trump-x-accounts-use-stolen-photos-european-influencers-study-3741143","image":"https://d.ibtimes.com/en/full/4544228/fake-accounts-x-use-stolen-images-influencers-appear-authentic.jpg","video":null,"publish_date":"2024-08-28 22:57:23","author":"Anuj Chopra","authors":["Anuj Chopra"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.046},{"id":255145582,"title":"Vance rips Harris for using a teleprompter — then calls Afghanistan’s Abbey Gate ‘Abbey Road’ minutes later","text":"Senator JD Vance ripped into Vice President Kamala Harris for using a teleprompter in her speeches minutes before making his own gaffe during a campaign stop. At a campaign event in Erie, Pennsylvania on Wednesday, Vance slammed Harris for her use of teleprompters. “I don’t need a teleprompter, I’ve actually got thoughts in my head,” Vance told the crowd. “Unlike Kamala Harris.” Minutes later, Vance made a mistake while speaking, referring to Afghanistan’s Abbey Gate — where 13 American troops and 170 Afghan civilians died in a terrorist attack in August 2021 — as Abbey Road, the infamous Beatles album. Monday marked the third anniversary of the attack, which happened amid the Biden administration’s chaotic withdrawal from Afghanistan in August 2021. “The families of these poor people who had their loved ones die three years ago at Abbey Road, they had to — I mean, Abbey Gate,” Vance said. The gaffe came as Vance answered a reporter’s question about a recent NPR report that claimed a Donald Trump campaign staffer verbally abused and pushed a cemetery official who tried to stop them from filming and photographing in Section 60, where troops who have recently died are buried. “There is verifiable evidence that the campaign was allowed to have a photographer there,” Vance said, just before his Abbey Gate mistake. “There’s verifiable they were invited to have a photographer there.” At the same event, Vance said Harris is “disgraceful” and can “go to Hell.” “Kamala Harris is so asleep at the wheel that she won’t even do an investigation into what happened and she wants to yell at Donald Trump because he showed up, she can go to Hell,” he said. Arlington National Cemetery confirmed in a previous statement to The Independent that “there was an incident, and a report was filed.” When previously reached for comment by The Independent, Trump campaign spokesperson Steven Cheung denied that there was any physical altercation and vowed to release video to back up his claim. Meanwhile, an uptick in Trump-Vance campaign stops could come soon after CNN reported their team is taking on a new strategy. “Think Trump on steroids,” an unnamed campaign source told the network. “This is going to be an all-hands-on-deck approach.” The source also told the outlet Trump would visit two states per day, focusing on battleground areas.","summary":"Monday marked the third anniversary of the Abbey Gate terrorist attack that killed 13 Americans and 170 Afghans","url":"https://www.independent.co.uk/news/world/americas/us-politics/vance-rips-harris-for-using-a-teleprompter-then-calls-afghanistan-s-abbey-gate-abbey-road-minutes-later-b2603474.html","image":"https://static.independent.co.uk/2024/08/28/22/GettyImages-2168129806.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/MI04lo0N-4VHSaSK0.mp4","publish_date":"2024-08-28 22:55:47","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","source_country":"gb","sentiment":-0.424},{"id":255145480,"title":"Trump Blames Biden for Wars Abroad. Here’s a Look at Their Records.","text":"In former President Donald J. Trump’s explanation of global events from the campaign trail, the world would not be aflame had he remained in the Oval Office. Afghanistan? President Biden and Vice President Kamala Harris were responsible for setting off “the collapse of American credibility and respect all around the world.” Iran, he insists, would not be arming Hezbollah, the Houthis or Hamas had he remained in office, or moving inexorably toward the capability to build a nuclear weapon. “Israel would never have been invaded by Hamas,” he insisted in the debate that ultimately forced Mr. Biden out of the race. The war in Ukraine would never have happened, he added, “if we had a real president, a president who was respected by Putin.”","summary":"Former President Donald J. Trump blames President Biden for crises around the globe. But the reality is that presidents inherit a world already hurtling through history.","url":"https://www.nytimes.com/2024/08/28/us/politics/trump-biden-iran-gaza-afghanistan-ukraine.html","image":"https://static01.nyt.com/images/2024/08/28/multimedia/28dc-trump-global-gzqc/28dc-trump-global-gzqc-facebookJumbo.jpg","video":null,"publish_date":"2024-08-28 22:54:04","author":"David E. Sanger","authors":["David E. Sanger"],"language":"en","source_country":"us","sentiment":-0.426},{"id":255145772,"title":"Vance to address Boston firefighters convention day after Walz speech","text":"The dueling appearance at the International Association of Firefighters Convention, confirmed by a source familiar with Vance’s schedule, comes as both parties battle for working-class votes. Walz spent the bulk of his remarks Wednesday focused on Vice President Kamala Harris’s support for pro-labor legislation and his own career as a public school teacher. “I can promise you this: When Vice President Harris and I win this election, we’ll have your back just like you’ve had ours this entire time,” Walz told members. The union event was the second Walz has attended. Two weeks ago, he spoke at a conference of municipal workers in Los Angeles, his first solo speech as Harris’s running mate. Meanwhile, Vance spent Wednesday speaking to truckers in Eerie, a swing county in Pennsylvania. He grabbed headlines for telling Harris to “go to hell” over the Biden administration’s botched withdrawal from Afghanistan. Walz was chosen by Harris, in part, for his perceived ability to speak to blue-collar workers. He caught the eye of labor leaders for his pro-union record as governor of Minnesota. But former President Donald Trump is betting he, too, can use his running mate to appeal to the working-class vote. Vance frequently talks about his Rust Belt upbringing, captured in his best-selling memoir Hillbilly Elegy. Vance will be introduced by Rep. Carlos Gimenez (R-FL), a former firefighter, at Thursday’s union event.","summary":"Sen. J.D. Vance (R-OH) will speak at a firefighter convention in Boston on Thursday, one day after Gov. Tim Walz (D-MN), his vice presidential counterpart, delivered an address to the same union crowd. The dueling appearance at the International Association of Firefighters Convention, confirmed by a source familiar with Vance&#8217;s schedule, comes as both parties [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3137255/vance-boston-firefighters-convention-walz-speech/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/vance-firefighter-walz.webp","video":null,"publish_date":"2024-08-28 22:50:33","author":"David Sivak","authors":["David Sivak"],"language":"en","source_country":"US","sentiment":0.253},{"id":255145220,"title":"Judge Releases Jan. 6 Protester Citing Supreme Court Ruling","text":"A federal judge has ordered the release of a defendant convicted in the January 6 Capitol attack due to a Supreme Court ruling.The Supreme Court ruled in June that federal felony \"obstruction of an official proceeding\" charges are only valid if the government can prove that a defendant \"impaired the availability or integrity\" of documents or records rather than merely obstructing an official proceeding.Prosecutors had used the charge against hundreds of January 6 defendants under the assumption that it pertained to obstructing an official proceeding like the January 6, 2021, joint session of Congress, which was stormed by a mob of former President Donald Trump's supporters in an ill-fated effort to overturn his 2020 election loss.On Wednesday, U.S. District Judge Beryl Howell ordered the release of defendant Patrick Stedman, who was convicted of the felony obstruction charge and four additional misdemeanor counts last year. Howell cited the Supreme Court decision in her ruling, which granted Stedman's motion for release pending appeal.Stedman will not be released until October 27 because he is still serving a mandatory 12-month sentence from his misdemeanor convictions, on which the Supreme Court ruling had no impact. Stedman had demanded his \"immediate conditional release pending appeal.\"Newsweek reached out to Stedman's lawyer via online contact form for comment on Wednesday evening.Howell originally sentenced Stedman, a self-proclaimed \"dating and relationship coach for men\" and expert in \"female psychology,\" to a total of 48 months in prison based on the felony conviction. The defendant surrendered to federal prison officials on October 27, 2023.Stedman's misdemeanor convictions include entering and remaining in a restricted building or grounds, disorderly and disruptive conduct in a restricted building or grounds, disorderly conduct in a Capitol building and parading, demonstrating or picketing inside a Capitol building.While granting his release, Howell argued that Stedman's \"continued engagement with and propagation of disinformation while incarcerated certainly shows his continued lack of remorse for his egregious criminal conduct,\" pointing out that the defendant has continued to push false \"stolen\" election claims online.\"Defendant may spew this nonsense to retain, attract and grow his online following to make money and increase his popularity, or this may reflect his actual beliefs,\" Howell wrote.\"No matter whether defendant is a charlatan or gravely misguided, this commentary confirms a distorted view of reality that dangerously fueled his and others' offense conduct at the U.S. Capitol on January 6, 2021,\" she added.According to the Department of Justice, Stedman's actions on January 6 included entering the Capitol as part of a \"first wave\" of Trump supporters who \"broke down the doors.\" He allegedly shouted \"storming the Capitol\" as he entered the building before going on to enter the office of then-House Speaker Nancy Pelosi.In a video recorded for followers after the attack, Stedman boasted that \"patriots\" had stolen hard drives from the building and warned that \"the storm is here,\" a reference to the false QAnon conspiracy theory, which claims that Trump is secretly fighting a war against a cabal of blood-drinking Democrats running a child sex trafficking ring.","summary":"U.S. District Judge Beryl Howell ordered the release of a defendant serving time for storming the U.S. Capitol on January 6, 2021.","url":"https://www.newsweek.com/judge-releases-january-6-protester-patrick-stedman-1945822","image":"https://d.newsweek.com/en/full/2460053/capitol-attack-defendant-released-scotus-ruling.jpg","video":null,"publish_date":"2024-08-28 22:46:27","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.457},{"id":255146708,"title":"Harris campaign launches effort to get out the vote among Black Mainers","text":"State and local leaders gathered in Monument Square on Wednesday to launch an effort by the Harris-Walz campaign to get the vote out among Black Mainers. The event came a week after Democrats gathered in Chicago to nominate Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, and was the latest in a series of campaign events held in Maine since Harris took over the Democratic ticket from President Biden in late July. Maine House Speaker Rachel Talbot Ross, D-Portland, the first Black woman to serve as speaker of the Maine House, looked to capitalize on the energy from last week’s convention, which she described as life-changing. “It has reignited the fire in me – I’m sure like many others – to fight harder for the future we all believe in,” Talbot Ross said. Talbot Ross, who co-chairs Black Mainers for Harris-Walz, said the new group “creates a space for dialogue, organizing and action where Black Mainers can engage directly with a campaign that values us, that sees us and hears us and values diversity.” The Maine Department of the Secretary of State doesn’t have a breakdown of voter registrations by race, so it’s hard to say exactly how many Black voters there are in Maine. As of 2020, just under 3% of the state’s 1.3 million people identified as Black or African American, according to the U.S. Census Bureau. Talbot Ross said it’s important for Black Mainers to know there are elected leaders in Maine fighting for a ticket that is committed to diversity and justice. Republican Donald Trump and his allies “are planning a massive expansion of presidential power” through Project 2025, Talbot Ross said. She said Trump’s election would undermine Black communities by repealing the Affordable Care Act, encouraging white supremacy and supporting policies that widen the racial wealth gap. “These are not the policies we want here in Maine, and we need to ensure that if that’s not what we want, we cannot stay on the sidelines,” she said. Project 2025 is a set of conservative policy proposals for a new Republican administration published by the conservative Heritage Foundation. Trump has tried to distance himself from its agenda, though critics have pointed to the involvement of his allies as evidence that the plan shows what a second Trump administration could look like. Trump has also said in the past that he would look at replacing the Affordable Care Act, though a campaign spokesperson told the New York Times earlier this month that Trump is not running to terminate the law and wants to “make health care actually affordable.” Janiyah Thomas, Team Trump’s Black media director, in response to questions about the Portland rally Wednesday, did not say specifically if Trump is planning any similar outreach with Black voters in Maine, but that the campaign “is going into deep blue cities and standing up grassroots engagement on a national platform.” “Black voters, like all voters, know that President Trump is the strongest candidate on the issues that matter to voters like the economy, immigration and inflation,” Thomas said in a statement. Wednesday’s Harris launch in Portland drew about 60 people as well as others who stopped to listen as they walked through the square at lunchtime. Talbot Ross was joined by several state and local officials; Shay Stewart-Bouley, a Peaks Island resident and the leader of an anti-racism organization; Black Mainers for Harris-Walz co-Chair Darmita Wilson; and U.S. Rep. Joyce Beatty, D-OH, all of whom spoke to the crowd. Beatty said she came to Maine as a Harris surrogate because “every vote, every voice counts” and that this year’s election is “the most consequential of our lifetimes.” “What we’re going to do is get people registered to vote and we’re going to go out and vote,” she said. Angela Franklin Lord, who lives in Cushing, drove nearly two hours to the rally after hearing about it from her state representative at a lobster bake last weekend. “I’ve never not voted for a Dem,” said Lord, adding that she agrees with Harris’ positions on reproductive rights, foreign policy and gun violence. “I’m just really inspired by her public service,” Lord said. Marcia Minter of Portland, who also attended the rally and is on the committee of Black Mainers for Harris-Walz, said she likes that the candidates “stand for true justice for all Americans.” She said she appreciated Wednesday’s rally being held. “Maine has that reputation that no Black people live here and that this is the whitest state,” Minter said. “We are very much here. We have always been here and we are a very active and close-knit community, and we want to make sure that is seen and heard.”","summary":"Maine House Speaker Rachel Talbot Ross, U.S. Rep. Joyce Beatty, D-OH, and other officials from Maine launched Black Mainers for Harris-Walz at a Portland rally on Wednesday.","url":"https://www.centralmaine.com/2024/08/28/harris-campaign-launches-effort-to-get-out-the-vote-among-black-mainers/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/08/39496853_20240828_blackvoters_0005-1724886197.jpg?w=1024","video":null,"publish_date":"2024-08-28 22:45:44","author":"Rachel Ohm","authors":["Rachel Ohm"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.124},{"id":255145034,"title":"Donald Trump Criticized by Arlington Cemetery 'Old Guard' Veteran","text":"Charlotte Clymer, a veteran formerly stationed at Arlington National Cemetery, criticized Donald Trump after recent accusations that his staff had an altercation with a cemetery official earlier this week.In a Wednesday blog post, Clymer detailed her experience in the 3rd U.S. Infantry Regiment, known as \"the Old Guard,\" before heavily criticizing the former president and saying that \"he cannot extend proper respect to our military.\"The 639-acre military cemetery, one of the oldest national cemeteries, honors more than 14,000 service members. An altercation between Trump's campaign staff and an official allegedly occurred in Section 60, which is where service members killed in Iraq and Afghanistan are laid to rest.On Tuesday, two members of Trump's campaign staff \"had a verbal and physical altercation\" at the cemetery on Monday, according to NPR. Trump was participating in a wreath-laying ceremony commemorating the third anniversary of the deadly attack on American troops in Afghanistan following the U.S. withdrawal from the country.The altercation occurred after a cemetery official attempted to prevent Trump's staff from filming and photographing in the section, where only Arlington personnel are permitted to do so, according to NPR's report.Steven Cheung, Trump's campaign communication director, told Newsweek, \"There was no physical altercation as described, and we are prepared to release footage if such defamatory claims are made.\"He continued, \"The fact is that a private photographer was permitted on the premises and for whatever reason an unnamed individual, clearly suffering from a mental health episode, decided to physically block members of President Trump's team during a very solemn ceremony.\"In a post on X (formerly Twitter) Tuesday night, Cheung shared what appears to be a screenshot of an email related to the event, with the caption: \"We were granted access to have a photographer there.\"The screenshot reads, \"Only former President Trump may have an official photographer and/or videographer outside of the the main media pool.\" The details of the email, who sent it, when it was sent and where that photographer could enter are not available from the screenshot.Family members of five fallen service members wrote in a statement: \"The [former] president and his team conducted themselves with nothing but the utmost respect and dignity for all of our service members.\"The statement added, \"We had given our approval for [former] president Trump's official videographer and photographer to attend the event.\"In a statement obtained by Newsweek on Wednesday, Arlington National Cemetery said that it \"can confirm there was an incident, and a report was filed.\"The statement also noted, \"Federal law prohibits political campaign or election-related activities within Army National Military Cemeteries, to include photographers, content creators or any other persons attending for purposes, or in direct support of a partisan political candidate's campaign. Arlington National Cemetery reinforced and widely shared this law and its prohibitions with all participants.\"It concluded, \"To protect the identity of the individual involved, no further information about the incident is being released at this time.\"In her blog post, Clymer said cemetery officials, like the one in the alleged altercation, have the \"hardest job\" in the cemetery.Over several paragraphs, Clymer criticized and recited previously reported controversial comments by Trump regarding service members. For instance, he said the late Senator John McCain, who was a prisoner of war in North Vietnam for more than five years, was \"not a war hero. He's a war hero because he was captured. I like people who weren't captured.\"Clymer wrote, \"I fully admit to being a partisan, but for me, none of this is about politics because none of the Republicans or conservatives I have ever known would so much as consider showing anything but respect and admiration for our service members, our veterans, and their families.\"She went on, \"This is not about favor for any party or campaign because the moment you enter Arlington, politics are to be left at the gate.\"But Donald Trump is unwilling or unable to understand that because he cannot conceive of offering the highest degree of selfless service to our nation...and therefore, he cannot extend proper respect to our military,\" she said.Clymer shared parts of her blog post on her X account and has received 3 million views as of Wednesday.","summary":"Charlotte Clymer, a vet formerly stationed at the cemetery, said Trump did not show \"proper respect to our military.\"","url":"https://www.newsweek.com/donald-trump-criticized-arlington-cemetery-old-guard-veteran-1945816","image":"https://d.newsweek.com/en/full/2459995/trump-arlington-national-cemetery.jpg","video":null,"publish_date":"2024-08-28 22:40:45","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.137},{"id":255145774,"title":"Biden spotted lounging on the beach for a second straight week of vacation: ‘This is absurd’","text":"Biden has been criticized for his long stretches of vacations along with a minimal work schedule as president since mid-July. The president has held a low-key presidential schedule since he tested positive for COVID-19 in July, following his announcement of withdrawing from the 2024 presidential election and endorsement of Vice President Kamala Harris as front-runner for the Democratic Party ticket. Last week, he gave a speech Monday night at the Democratic National Convention that was delayed past prime-time hours of the convention. Immediately following his speech, the Biden family jetted off to California for a weeklong vacation at a billionaire donor’s 8,000-acre estate, dubbed the “Kiani Preserve,” in Santa Ynez, California. The president has been spending this week in Rehoboth Beach. “Who is running our country?” several social media users asked on Wednesday, reacting to video and photos of Biden on the beach. “Biden is now lounging on the beach during his SECOND STRAIGHT WEEK of vacations. This is ABSURD,” journalist Nick Sortor remarked. Newsmax White House correspondent James Rosen pressed White House national security spokesman John Kirby on Tuesday about the leadership of the country while Biden has been away from the White House. “The question I am hearing from the general public, which I put to you here, admiral, is ‘Who is running the country?'” Rosen asked. Kirby pushed back on the question: “President Joe Biden.” “Is he a ceremonial figure in some sense at this point?” Rosen inquired. “James, you know better than that. I mean, my goodness, he talked to Prime Minister Modi today and he had calls with leaders in the region and in Europe with President Zelensky last week. He monitored in real time what was going on over the weekend. I mean, come on,” the NSC spokesman said to Rosen, adding, “The president is on vacation, but you can never unplug from a job like that, nor does he try to. He’s very much in command of making sure we can continue to protect our national security interests here at home and certainly overseas.” Another person reacted on X to the Wednesday beach video of Biden, “We are paying Biden to do absolutely nothing.” “Joe is kicking back. It just goes to show that Biden has never been in control,” another commenter said on X. “Kamala told us at the DNC that he and [she] were working tirelessly to get those hostages home. Seems like he got tired and quit,” a social media user remarked on X. Tom Bevan, the publisher of RealClearPolitics, posted the president’s approval rating over the past few weeks in August. “Biden’s been on vacation for nearly a month since he dropped out. Here is his approval rating over the last 30 days,” Bevan said in a post with a picture of a graph showing that despite the criticisms of Biden’s empty work schedule, his approval numbers have stayed steady. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Biden and Harris were also criticized this week for being absent from memorial events at the Arlington National Cemetery involving gold star families honoring the victims of the deadly Kabul airport attack by an ISIS suicide bomber who killed 13 American service members at Abbey Gate. Former President Donald Trump was invited to attend the events and comforted the families on the anniversary while the president and vice president released statements and social media posts in remembrance of the loss of the service members.","summary":"President Joe Biden was seen lounging in a beach chair under an umbrella again on Wednesday while enjoying Rehoboth Beach in Delaware. Biden has been criticized for his long stretches of vacations along with a minimal work schedule as president since mid-July. The president has held a low-key presidential schedule since he tested positive for [&#8230;]","url":"https://www.washingtonexaminer.com/news/white-house/3137193/biden-spotted-lounging-beach-second-week-vacation-absurd/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Biden-in-Rehoboth-1.webp","video":null,"publish_date":"2024-08-28 22:39:13","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","source_country":"US","sentiment":-0.152},{"id":255145838,"title":"Harris’ Decision to Do Joint Interview for First Sit-Down Remains a Mystery","text":"The Harris campaign is declining to say why the Democratic presidential nominee has turned her long-awaited first media interview into a twofer with her running mate, Tim Walz, instead of doing a one-on-one. CNN, which scored the coveted interview, declined to comment on how the campaign presented a two-for-one situation to the network. CNN’s chief political correspondent and anchor Dana Bash will conduct the interview with Kamala Harris and Walz, which will be taped and is set to air at 9 p.m. ET on Thursday. The sit-down is Harris’ first opportunity since rising to the top of the Democratic ticket earlier this summer to show that she has the breadth of knowledge and confidence to be president—though given the build-up to this one interview and the lack of any others on the schedule, any single stumble will likely be amplified and replayed ad nauseum by the sophisticated Republican messaging machine. Both the Harris campaign and CNN declined to comment on questions about arrangements or contingencies that were set as part of the agreement to secure the first substantial interview that Harris has given since her rough performance in a sit-down with NBC’s Lester Holt in 2021. In announcing its selection by the Harris-Walz campaign, CNN touted its upcoming exclusive as just that: The First Interview: Harris & Walz A CNN Exclusive to air Thursday, Aug. 29, and stream live across the network’s platforms. It’s unclear how the campaign decided that Harris and Walz would do a joint interview in their first at-bat as official nominees. But one this is certain: the decision and the dynamics were set by the campaign, not by the network. “You’ll take whatever you can get right now from this campaign since there have been no interviews,” a former senior network television executive told the Daily Beast. Harris has come under scrutiny from her critics and the media for not giving unscripted media appearances, including news conferences and interviews. Republicans, from Donald Trump and JD Vance to conservative columnists and right-wing Twitter trolls, slammed Harris for choosing a network they’ve dubbed sympathetic and for taking her wingman, Walz, with her on the set. “Kamala is clearly scared to do an interview on her own and it's pre-taped so they can clean it up if things go badly,” the Trump-Vance campaign said in a statement, accusing the Democratic nominee of intentionally choosing the Thursday before Labor Day weekend when many may not be tuning in. Fox News’ Howie Kurtz says Harris is opening herself up to more attacks from the right, not fewer. He suggests she and Walz should have done separate interviews to mitigate the scrutiny. Harris and Walz on Wednesday afternoon began a bus tour through southern Georgia, which will conclude with a rally in Savannah on Thursday. The CNN interview is scheduled to be taped some time on Thursday in Savannah and clips of the interview may be released Thursday afternoon.","summary":"Elizabeth FrantzThe Harris campaign is declining to say why the Democratic presidential nominee has turned her long-awaited first media interview into a twofer with her running mate, Tim Walz, instead of doing a one-on-one.\n\nCNN, which scored the coveted interview, declined to comment on how the campaign presented a two-for-one situation to the network. CNN’s chief political correspondent and anchor Dana Bash will conduct the interview with Kamala Harris and Walz, which will be taped and is set to air at 9 p.m. ET on Thursday.\n\nThe sit-down is Harris’ first opportunity since rising to the top of the Democratic ticket earlier this summer to show that she has the breadth of knowledge and confidence to be president—though given the build-up to this one interview and the lack of any others on the schedule, any single stumble will likely be amplified and replayed ad nauseum by the sophisticated Republican messaging machine.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/harris-decision-to-do-joint-interview-for-first-sit-down-remains-a-mystery","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_3094,w_5500,x_0,y_221/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1724884249/2024-08-28T202759Z_1321834569_RC27P9ADGOWY_RTRMADP_3_USA-ELECTION-HARRIS_vo7v8q","video":null,"publish_date":"2024-08-28 22:37:09","author":"Mary Ann Akers","authors":["Mary Ann Akers"],"language":"en","source_country":"US","sentiment":0.134},{"id":255145058,"title":"NYC tears down its oldest sidewalk shed but some wonder what took so long: ‘Only in New York’","text":"The shed is finally hitting the fan. The city is dismantling the oldest sidewalk shed on public property – a rotting relic from 15-years ago when smartphones were cutting edge and Aaron Judge was in high school. But as the Adams administration continues a crack down on unsightly scaffolding across the five boroughs not everyone’s convinced the city should be taking a victory lap. “It’s been three mayors and three presidents since the scaffolding went up and finally came down. Only in New York City,” a City Council source told The Post Wednesday. “To put it into perspective, Kamala Harris was a District Attorney and Donald Trump was a reality star when this scaffolding first went up. A long, long time.” This infamous sidewalk shed has stifled 329 feet of sidewalk along First Avenue in front of the Office of the Chief Medical Examiner, where the city’s autopsies and forensic pathology is done. “The people who walk through the doors at OCME are frequently in profound need — or serve people who are,” Deputy Mayor for Operations Meera Joshi said at the site on Wednesday. “By maintaining this building we show respect to the work done inside, as we continue to fire on all cylinders to get sheds down.” The warped green, plywood and rusted metal poles darkening the Kips Bay neighborhood was removed by Department of Buildings workers this week, officials said. The soggy plywood was meant to protect pedestrians from unsafe building facade conditions contractors have now resolved, according to a DOB spokesperson. A dispute with the owner of a neighboring building delayed the needed repairs for years, a source told the Post. The effort is part of a city-wide initiative announced by Mayor Eric Adams last year called Get Sheds Down. It aims to make a dent in New York City’s 9,000 scaffolding sheds that have been up five years or longer. Councilwoman Gale Brewer, whose Upper West Side district is filled with sidewalk sheds, said it’s a “good sign” the city is removing the longest offenders on its own properties. “The city has to practice what it preaches by taking the sheds down,” Brewer told The Post. She said there’s a sidewalk at the Regent homeless shelter on the east side of 104th and Broadway “that’s been up forever.” “I get calls all the time. We send letters. Nothing happens.” Since the initiative started the city has removed 268 of the old plywood sheds across the five boroughs, 14 of them at city-owned properties, officials said. There are still 270 longstanding scaffolding sheds left in the city, according to DOB. The city is still assessing 43 other long standing scaffolding sheds on municipal properties that could be taken down once building repairs are complete while the DOB is working with building owners to remove sheds on private properties, according to DOB. The ubiquitous sheds linger because it’s often cheaper for a building owner to keep the scaffolding up than make repairs. Delays also come when there are disputes between owners and neighboring building tenants that delay facade repairs, the DOB said. A DOB spokesperson said the agency is working with building owners to provide technical assistance or to assess if a building owner can use façade containment netting instead, as was done at the Queens Supreme courthouse last summer. The mayor also directed the DOB to solicit six new scaffolding designs to make the necessary structures less of an eyesore. Those designs are expected to be completed and codified into law next year. Building owners who don’t take the example set by the city could find themselves in legal trouble. DOB is currently pursuing litigation against the owner of a building on Surf Avenue in Coney Island that had a scaffolding shed up for the last 18 years, according to a DOB official. Last December the city celebrated the teardown of a 21-year-old scaffolding shed in Inwood that came down only after the city filed criminal charges against the building’s owner for repeated failures to make repairs, according to a DOB source.","summary":"The Adams administration continues a crack down on unsightly scaffolding across the five boroughs not everyone's convinced the city should be taking a victory lap.","url":"https://nypost.com/2024/08/28/us-news/nyc-tears-down-its-oldest-sidewalk-shed-but-some-wonder-what-took-so-long-only-in-new-york/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/88425970.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/01anG99L-RyIcpnTz.mp4","publish_date":"2024-08-28 22:36:35","author":"Carl Campanile,Craig McCarthy,Haley Brown","authors":["Carl Campanile","Craig McCarthy","Haley Brown"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.252}]}