{"offset":0,"number":50,"available":11315,"news":[{"id":343571590,"title":"US Border Patrol Agent Shot During Robbery Attempt In New York, Trump Blames 'Illegal Alien'","text":"An off-duty US Border Patrol agent was shot in the face during a robbery attempt in a New York City park under the George Washington bridge, according to authorities. The suspect has been taken into custody, and the victim is expected to survive.\nThe officer was reportedly shot in the face during a robbery by a moped-riding suspect in New York City, and the officer returned fire, wounding the assailant, according to the New York Post.\nTaking to his Truth Social platform, US President Donald Trump said the Border Patrol agent was shot by an “illegal alien” who was apprehended in April 2023, but was released afterwards.\n“Last night, in New York City, an incredible CBP Officer was shot in the face by an Illegal Alien Monster freed into the Country under Joe Biden. He was apprehended at the Border in April 2023 but, instead of being deported, was RELEASED. The CBP Officer bravely fought off his attacker, despite his wounds, demonstrating enormous Skill and Courage,” he said.","summary":"An off-duty Border Patrol agent was shot in the face during a robbery by a moped-riding suspect in New York on Saturday, and the officer returned fire, wounding the suspect.","url":"https://www.news18.com/world/off-duty-us-border-patrol-agent-shot-during-robbery-attempt-in-new-york-trump-responds-ws-l-9452433.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/trump-nyc-2025-07-842f24f87eb78709e7f587fd27a6a16d.jpg","video":null,"publish_date":"2025-07-21 01:29:05","author":"Aveek Banerjee,News18","authors":["Aveek Banerjee","News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.178},{"id":343572836,"title":"Nearly 4K undocumented Filipinos under radar of US-ICE","text":"WASHINGTON D.C. -- Close to 4,000 undocumented Filipinos are under the “system” of the United States’ Immigration and Customs Enforcement (ICE), which is primarily responsible for deporting individuals in the US who have violated immigration laws. According to the document dated November 2024, there are a total of 3,772 Filipinos classified as “noncitizens” on ICE’s Enforcement and Removal Operations' “non-detained docket with final orders of removal.” Philippine Ambassador to the US Jose “Babe” Romualdez said the issue on immigration would “probably not” be discussed during the first bilateral meeting of US President Donald Trump and President Ferdinand Marcos Jr. slated on Monday. “I think we probably will not need to, because we’ve had discussions already. I’ve had meetings with the Department of Homeland Security on how we cooperate with the United States on handling illegal immigration,” Romualdez told reporters on Sunday during a press briefing at the Philippine Embassy in Washington. He reiterated that undocumented Filipinos in the US should take proactive steps by contacting immigration lawyers before it is too late. “As I have always said, those that have illegal paths should have already contacted the Immigration lawyers. We have volunteer Filipino-American Lawyers’ Association that have come forward to help our Filipino kababayans,” he said. “But I think at the end of the day, the laws of the United States must be respected, just like we expect citizens who come to the Philippines to also respect our laws,” he added. Romualdez said majority of the undocumented Filipinos who are under the radar of the ICEA are from the West Coast, particularly from California. “Well, a large number of course of Filipinos are concentrated in California. So, you can imagine that probably we may have quite a number of them in the West Coast,” he said. “We do have some of them of course here in the East Coast. Generally, the concentration of Filipinos are in California,” he added. In January, Marcos expressed his desire to meet with Trump, who at that time just returned to the White House after his victory in the November US elections. According to a Presidential Communications Office statement, Marcos is seeking to meet Trump to “influence” the latter about his policymaking, particularly on immigration. According to the Department of Foreign Affairs, there are an estimated 370,000 undocumented Filipino immigrants in the US.","summary":"","url":"https://tribune.net.ph/2025/07/21/nearly-4k-undocumented-filipinos-under-radar-of-us-ice","image":"https://media.assettype.com/tribune/2025-07-21/7nqbvkrm/0-02-06-facbe86ef2bf98a8ca474baeffe3738651e4ff9cc8bc4a0bfed2d8d9532296cb21d0f6f2d8b.png?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-07-21 01:23:24","author":"Jom Garner","authors":["Jom Garner"],"language":"en","category":"politics","source_country":"ph","sentiment":0.045},{"id":343570804,"title":"World News | Visit to Spain, UAE Set to Create over 14,000 Jobs in State: MP CM Mohan Yadav","text":"Bhopal (Madhya Pradesh) [India], July 21 (ANI): Madhya Pradesh Chief Minister Mohan Yadav on late Sunday night said that his official visit to the UAE and Spain is set to create over 14,000 jobs in the state.\nYadav stated that following the Madhya Pradesh Global Dialogue-2025, the state received investment proposals worth over Rs 11,119 crore.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn a post on X, CM Yadav stated, \"With the motto 'Make in India-Make in Madhya Pradesh,' investment proposals worth over Rs 11,119 crore have been received in all major sectors under the 'Madhya Pradesh Global Dialogue-2025' concluded in UAE and Spain. These will create more than 14,000 new employment opportunities in the state. After the visit to both nations, I reached Bhopal today and shared information with journalist friends.\"\nhttps://x.com/DrMohanYadav51/status/1946976440932577336\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\n\"In Madrid, Spain, the 'Invest in Madhya Pradesh - Business Forum' was held, where discussions took place with over 200 corporate and diplomatic representatives,\" he said.\nhttps://x.com/DrMohanYadav51/status/1946984291373817964\n\"Addressed over 500 expatriate entrepreneurs at the 'Friends of MP' conference held during the Dubai visit. Conducted one-to-one strategic meetings with heads of more than 30 international and national companies during the visit,\" he added.\nhttps://x.com/DrMohanYadav51/status/1946982998462894436\nCM Yadav stated that, under the Madhya Pradesh Global Dialogue-2025, he signed MoUs and held productive talks with investors to promote the state's potential growth.\nIn a post on X on Saturday, CM Yadav said, \"Under the Madhya Pradesh Global Dialogue-2025, during the Spain visit, I engaged in discussions with entrepreneurs, investors, and businesspersons, signed MoUs, observed global agri-models like Mercabarna, and also met with the Indian diaspora. This visit will strengthen the vision of a developed Madhya Pradesh on the global stage.\"\nhttps://x.com/DrMohanYadav51/status/1946601718055354780\nCM Yadav on Saturday said that his visit to Dubai and Spain is nearing its conclusion, highlighting the tour's focus on exploring opportunities for the state's progress and promoting employment, industries, and tourism.\nSpeaking from Barcelona, CM Yadav said, \"We have reached the last leg of our Dubai and Spain visit. As we had set the objective of our tour, we were to explore all the areas for the progress of our state with our Indians connected to Madhya Pradesh, especially everything that provides employment. We also went to the industries and restaurants to promote tourism. Wherever there are Indian restaurants, we visited them.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Yadav said that after the Madhya Pradesh Global Dialogue-2025, the state received investment proposals of over Rs 11,119 crore.","url":"https://www.latestly.com/agency-news/world-news-visit-to-spain-uae-set-to-create-over-14000-jobs-in-state-mp-cm-mohan-yadav-7009724.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721011052.jpg","video":null,"publish_date":"2025-07-21 01:18:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.064},{"id":343570800,"title":"World News | Indonesia: Passenger Ferry Fire in North Sulawesi Kills at Least 3","text":"North Sulawesi [Indonesia], July 21 (ANI): A passenger ferry fire in the Indonesian province of North Sulawesi has killed at least three people, with video showing people jumping from the burning ship into the ocean, Australian Broadcasting Corporation (ABC) reported. Footage taken on Sunday afternoon showed a pillar of smoke billowing from the ship, in waters north of Manado, as terrified people tried to escape the enormous blaze.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nDozens of people can be seen floating in the ocean, watching as the KM Barcelona 5 ferry burns. In a statement, Indonesia's national search and rescue agency, BASARNAS, said teams were still working at the scene.\n\"The SAR team is currently combing the waters around the fire site to ensure no passengers are left behind or adrift at sea,\" it said. Also Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nhttps://x.com/SAR_NASIONAL/status/1946863162407670037\n\"In addition to the Basarnas team, other potential SAR elements, including the Indonesian Navy, the Water Police (Polairud), the Regional Disaster Management Agency (BPBD), and local fishermen, are also assisting in the rescue process,\" as per ABC.\nIt is understood that local fishermen raced out by boat to help rescue those who evacuated the burning ferry. The agency says at least three people have been killed, while local officials say at least five are dead.\nMore than 280 people were on board when the fire broke out, with the cause not yet known, according to ABC.\nThe ferry was travelling to Manado, the capital of North Sulawesi. On social media, one man live-streamed the enormous ferry fire while he was carrying a small child in his other hand, ABC reported.\nAs an archipelagic country, thousands of passenger ferries move people around Indonesia from island to island daily, with disasters occurring regularly. On July 15 in West Sumatra, 11 people who were missing at sea following a boat capsize were found alive after they swam six hours to the nearest island.\nA ferry near Bali sank earlier this month, killing at least 18 people. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Footage taken on Sunday afternoon showed a pillar of smoke billowing from the ship, in waters north of Manado, as terrified people tried to escape the enormous blaze.","url":"https://www.latestly.com/agency-news/world-news-indonesia-passenger-ferry-fire-in-north-sulawesi-kills-at-least-3-7009721.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721005144.jpg","video":null,"publish_date":"2025-07-21 01:12:20","author":null,"language":"en","source_country":"in","sentiment":-0.53},{"id":343570806,"title":"World News | Pak: Newborn Dies of Lack of Incubator in Jacobabad","text":"Jacobabad [Pakistan], July 21 (ANI): A newborn girl died on Sunday due to the unavailability of an incubator in Jacobabad, Sindh, ARY News reported, citing the infant's father.\nAccording to the father, he initially took his newborn daughter to the Jacobabad Institute of Medical Sciences (JIMS), a government hospital. However, due to a lack of facilities, he transferred her to a private hospital, as per ARY News.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nHe stated that the private hospital staff turned him away because no incubator was available, and he was forced to bring the baby back to JIMS.\nThe doctors advised him to shift the child to a hospital in Sukkur. However, tragically, the newborn girl died on the way to Sukkur. Hospital authorities stated that an investigation into the tragic incident is underway.\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nEarlier on May 31, in a shocking case of medical negligence, doctors at a private hospital in Sadiqabad, Rahim Yar Khan district, performed unnecessary appendix surgeries on dozens of children in an alleged major misdiagnosis case.\nThe incident took place in Tallo Bangla Chak 212, where the medical staff of Toheed Medical Complex on Kacha Shahi Road carried out appendectomies on dozens of children who were complaining of abdominal pain, as per ARY News.\nAuthorities sealed the Toheed Medical Complex after an inquiry report revealed serious negligence, as well as unethical and inappropriate surgical interventions. The investigation followed a public outcry after the incident went viral on social media.\nAccording to the official inquiry, conducted by a three-member committee, no outbreak of an infectious disease was reported in the area, ARY News reported.\nThe report confirmed that appendectomies were performed on 22 out of the 28 examined children at Toheed Medical Complex.\n\"All 24 examined children were found to be medically stable and oriented to time and place,\" the report added.\nFour patients were also brought to THQ Hospital with the complaint of lower abdominal pain. However, after examination and ultrasound, no significant abnormalities were seen and the Consultant Surgeon of THQ Hospital Sadiqabad prescribed medicine, the report noted. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to the father, he initially took his newborn daughter to the Jacobabad Institute of Medical Sciences (JIMS), a government hospital. However, due to a lack of facilities, he shifted her to a private hospital, as per ARY News.","url":"https://www.latestly.com/agency-news/world-news-pak-newborn-dies-of-lack-of-incubator-in-jacobabad-7009719.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721004232.jpg","video":null,"publish_date":"2025-07-21 01:10:19","author":null,"language":"en","source_country":"in","sentiment":-0.577},{"id":343570802,"title":"World News | Trump Lashes out After Illegal Immigrant Shoots Off-duty Officer in New York","text":"Washington, DC [US], July 21 (ANI): US President Donald Trump on Sunday (local time) raged on Truth Social after an illegal immigrant shot an off-duty US Customs and Border Protection officer.\nTrump alleged that the shooter was apprehended earlier in April 2023 but was released instead of being deported.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\n\"Last night, in New York City, an incredible CBP Officer was shot in the face by an Illegal Alien Monster freed into the Country under Joe Biden. He was apprehended at the Border in April 2023 but, instead of being deported, was RELEASED. The CBP Officer bravely fought off his attacker, despite his wounds, demonstrating enormous Skill and Courage. The Democrats have flooded our Nation with Criminal Invaders, and now, they must all be thrown out or, in some cases, immediately prosecuted in that we cannot take a chance that they are able to come back. That's how evil and dangerous they are!\" Trump said.\nhttps://x.com/RapidResponse47/status/1947018535378501871\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nAccording to the New York Post, it reported that the officer shot the person and wounded him.\nThe suspect has been identified as Miguel Francisco Mora Nunez, a 21-year-old Dominican national with a lengthy rap sheet in New York, according to sources, but he was let go each time he was busted, despite having a deportation order. Nunez entered the US illegally via the southern border under US President Joe Biden's administration, the Department of Homeland Security said on Sunday, as per the New York Post.\nhttps://x.com/DHSgov/status/1946992590496100624\nThe 42-year-old federal agent and a female companion were sitting on a rock along the Hudson River in Fort Washington Park in Manhattan when they were ambushed by the two men on a moped around 11:50 pm, according to police sources.\nAfter a brief exchange and tussle, one of the moped-riding men fired a gun hit the victim in the face and left forearm, as per the New York Post.\nMayor Eric Adams addressed the mounting criticism during a visit to the wounded victim officer in Harlem Hospital on Sunday.\n\"Our goal is to get dangerous people off the streets. And we have done that with our federal partners. You know of the number of dangerous gang take downs we've participated in. Whatever we need to do in our federal laws to ensure that dangerous people are not on our streets, federal authorities need to do that,\" the Mayor said, as per The New York Post. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Trump alleged that the shooter was apprehended earlier in April 2023 but was released.","url":"https://www.latestly.com/agency-news/world-news-trump-lashes-out-after-illegal-immigrant-shoots-off-duty-officer-in-new-york-7009717.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721003628.jpg","video":null,"publish_date":"2025-07-21 01:08:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.49},{"id":343570814,"title":"India News | We Have Especially Identified 8 Issues: Congress MP Pramod Tiwari Ahead of Monsoon Session of Parliament","text":"New Delhi [India], July 21 (ANI): Congress MP Pramod Tiwari on Sunday gave an inside in the INDIA alliance meeting held on July 19, and said that the INDIA Alliance has finalised its strategy ahead of Monsoon Session of Parliament, which centres around the Pahalgam terror attack, Operation Sindoor, and statements made by US President Donald Trump.\nMP Tiwari, while talking to ANI, said, \"Yesterday, a detailed discussion on formulating strategy for the upcoming session regarding the crisis in which the nation has been pushed into by the BJP-NDA Government. It was a joint effort held in a conducive environment. I am happy to tell you that keeping national interest as supreme, it has been decided against the BJP's activities that are weakening the country, its democracy and economy.\"\nAlso Read | Kanwar Yatra 2025: 6 Kanwariyas Killed, 20 Injured in Road Accidents on Delhi-Dehradun Highway and Ganga Canal Road As Pilgrim Rush Surges in Yatra's Final Leg.\nMP Tiwari said that the US President Trump's statement about the five fighter jets being shot down is disturbing and added, \"It has been decided to raise issues, the most important being the Pahalgam attack. To date, the traces of terrorists have not been found. Regarding Operation Sindoor, US President Donald Trump stated for the 24th time that he secured the ceasefire. A shocking statement was made that five fighter jets were shot down. The defence attache also said the same. CDS too said the same. This disturbs us.\"\nHe also mentioned that the Special Intensive Revision (SIR) happening in Bihar is killing democracy and said, \"In Bihar, democracy is being murdered with SIR. The manner in which India has been isolated in its foreign policy is also an issue. Even now, heinous massacres are occurring - Israel is doing this in Gaza is also an issue. The issue is also about the oppression of SC, ST, women and minorities and crimes against them. We have especially identified 8 issues. We are confident that all 24 parties (in the INDIA Alliance) will support us; even the parties who are not a part of this will support us.\"\nAlso Read | Nuh Shocker: Refusing To Give INR 20 to Drug Addict Son in Haryana Costs 56-Year-Old Woman Her Life, Accused Taken Into Custody.\nThe Monsoon Session of the Indian Parliament is scheduled to begin on July 21 and conclude on August 21.\nDuring the monsoon session of Parliament, the government plans to push its legislative agenda, which includes some new bills.\nThe bills on the agenda of the government include Manipur Goods and Services Tax (Amendment) Bill of 2025, Taxation Laws (Amendment) Bill of 2025, Jan Vishwas (Amendment of Provisions) Bill 2025, the Indian Institutes of Management (Amendment) bill 2025, the Geoheritage Sites and Geo-relics (Preservation and Maintenance) bill 2025, the Mines and Mines (Development and Regulation) Amendment Bill 2025, the National Sports Governance Bill 2025 and the National Anti-Doping (Amendment) Bill 2025. The government's agenda also includes the Readjustment of Representation of Scheduled Tribes in Assembly Constituencies of the State of Goa Bill, 2024, the Merchant Shipping Bill, 2024, the Indian Ports Bill, 2025, and the Income Tax Bill, 2025. The monsoon session of Parliament will continue till August 21. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  Congress MP Pramod Tiwari on Sunday gave an inside in the INDIA alliance meeting held on July 19, and said that the INDIA Alliance has finalised its strategy for the upcoming Monsoon Session of Parliament, which centres around the recent terror attack in Pahalgam,  Operation Sindoor, and statements made by US President Donald Trump.","url":"https://www.latestly.com/agency-news/india-news-we-have-especially-identified-8-issues-congress-mp-pramod-tiwari-ahead-of-monsoon-session-of-parliament-7009713.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250721000701.jpg","video":null,"publish_date":"2025-07-21 01:04:25","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.194},{"id":343572366,"title":"‘Japanese First’ party emerges as election force with tough immigration talk","text":"Sanseito leader Sohei Kamiya explained the 'Japanese First' phrase was about rebuilding livelihoods by resisting globalist influence. (AP pic)\nTOKYO: The fringe far-right Sanseito party emerged as one of the biggest winners in Japan's upper house election on Sunday, gaining support with warnings of a \"silent invasion\" of immigrants, and pledges for tax cuts and welfare spending.\nBirthed on YouTube during the Covid-19 pandemic spreading conspiracy theories about vaccinations and a cabal of global elites, the party broke into mainstream politics with its \"Japanese First\" campaign.\nThe party won 14 seats adding to the single lawmaker it secured in the 248-seat chamber three years ago. It has only three seats in the more powerful lower house.\n\"The phrase Japanese First was meant to express rebuilding Japanese people's livelihoods by resisting globalism. I am not saying that we should completely ban foreigners or that every foreigner should get out of Japan,\" Sohei Kamiya, the party's 47-year-old leader, said in an interview with local broadcaster Nippon Television after the election.\nPrime Minister Shigeru Ishiba's Liberal Democratic Party and its coalition partner Komeito lost their majority in the upper house, leaving them further beholden to opposition support following a lower house defeat in October.\n\"Sanseito has become the talk of the town, and particularly here in America, because of the whole populist and anti-foreign sentiment. It's more of a weakness of the LDP and Ishiba than anything else,\" said Joshua Walker, head of the US non-profit Japan Society.\nIn polling ahead of Sunday's election, 29% of voters told NHK that social security and a declining birthrate were their biggest concern. A total of 28% said they worried about rising rice prices, which have doubled in the past year. Immigration was in joint fifth place with 7% of respondents pointing to it.\n\"We were criticised as being xenophobic and discriminatory. The public came to understand that the media was wrong and Sanseito was right,\" Kamiya said.\nKamiya's message grabbed voters frustrated with a weak economy and currency that has lured tourists in record numbers in recent years, further driving up prices that Japanese can ill afford, political analysts say.\nJapan's fast-ageing society has also seen foreign-born residents hit a record of about 3.8 million last year, though that is just 3% of the total population, a fraction of the corresponding proportion in the US and Europe.\nInspired by Trump\nKamiya, a former supermarket manager and English teacher, told Reuters before the election that he had drawn inspiration from US President Donald Trump's \"bold political style\".\nHe has also drawn comparisons with Germany's AfD and Reform UK although right-wing populist policies have yet to take root in Japan as they have in Europe and the US.\nPost-election, Kamiya said he plans to follow the example of Europe's emerging populist parties by building alliances with other small parties rather than work with an LDP administration, which has ruled for most of Japan's postwar history.\nSanseito’s focus on immigration has already shifted Japan's politics to the right. Just days before the vote, Ishiba’s administration announced a new government taskforce to fight \"crimes and disorderly conduct\" by foreign nationals and his party has promised a target of \"zero illegal foreigners\".\nKamiya, who won the party's first seat in 2022 after gaining notoriety for appearing to call for Japan's emperor to take concubines, has tried to tone down some controversial ideas formerly embraced by the party.\nDuring the campaign, Kamiya, however, faced a backlash for branding gender equality policies a mistake that encourage women to work and keep them from having children.\nTo soften what he said was his \"hot-blooded\" image and to broaden support beyond the men in their twenties and thirties that form the core of Sanseito's support, Kamiya fielded a raft of female candidates on Sunday.\nThose included the single-named singer Saya, who clinched a seat in Tokyo.\nLike other opposition parties, Sanseito called for tax cuts and an increase in child benefits, policies that led investors to fret about Japan's fiscal health and massive debt pile, but unlike them it has a far bigger online presence from where it can attack Japan's political establishment.\nIts YouTube channel has 400,000 followers, more than any other party on the platform and three times that of the LDP, according to socialcounts.org.\nSanseito's upper house breakthrough, Kamiya said, is just the beginning.\n\"We are gradually increasing our numbers and living up to people's expectations. By building a solid organization and securing 50 or 60 seats, I believe our policies will finally become reality,\" he said.","summary":"Inspired by Donald Trump, Sanseito wins support with anti-foreigner rhetoric and pledges for welfare boosts and tax cuts.","url":"https://www.freemalaysiatoday.com/category/world/2025/07/21/japanese-first-party-emerges-as-election-force-with-tough-immigration-talk","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/51a7a479-sanseito-japan.jpg","video":null,"publish_date":"2025-07-21 01:03:21","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.236},{"id":343570798,"title":"World News | Earthquake of Magnitude 4.6 Strikes Tajikistan","text":"Dushanbe [Tajikistan], July 21 (ANI): An earthquake of magnitude 4.6 struck Tajikistan on Monday, a statement by the National Center for Seismology (NCS) said.\nAs per the statement, the earthquake struck at a shallow depth of 23km, making it susceptible to aftershocks.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn a post on X, the NCS said, \"EQ of M: 4.6, On: 21/07/2025 04:43:29 IST, Lat: 37.39 N, Long: 72.58 E, Depth: 23 Km, Location: Tajikistan.\"\nhttps://x.com/NCS_Earthquake/status/1947076990877544857\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nShallow earthquakes are generally more dangerous than deep earthquakes. This is because the seismic waves from shallow earthquakes have a shorter distance to travel to the surface, resulting in stronger ground shaking and potentially more damage to structures and greater casualties.\nEarlier, an earthquake of magnitude 4.0 jolted Tajikistan on Sunday, a statement by the National Center for Seismology (NCS) said.\nAs per the statement, the earthquake occurred at 160km.\nIn a post on X, the NCS said, \"EQ of M: 4.0, On: 20/07/2025 01:01:55 IST, Lat: 36.87 N, Long: 72.10 E, Depth: 160 Km, Location: Tajikistan.\"\nhttps://x.com/NCS_Earthquake/status/1946656827598651619\nEarlier on July 18, an earthquake of magnitude 3.8 occurred at a shallow depth of 10km, making it susceptible to aftershocks.\nSharing the details on X, NCS said, \"EQ of M: 3.8, On: 18/07/2025 03:15:53 IST, Lat: 38.26 N, Long: 74.09 E, Depth: 10 Km, Location: Tajikistan.\"\nhttps://x.com/NCS_Earthquake/status/1945965847018967314\nOn July 12, two earthquakes jolted the region.\nIn a post on X, the NCS said, \"EQ of M: 4.8, On: 12/07/2025 20:46:58 IST, Lat: 38.86 N, Long: 70.60 E, Depth: 60 Km, Location: Tajikistan.\"\nhttps://x.com/NCS_Earthquake/status/1944058726589006056\n\"EQ of M: 4.2, On: 12/07/2025 18:57:26 IST, Lat: 38.18 N, Long: 74.30 E, Depth: 107 Km, Location: Tajikistan.\"\nhttps://x.com/NCS_Earthquake/status/1944029739817345468\nTajikistan is a mountainous country with diverse topography and is especially vulnerable to climate hazards. It is prone to earthquakes, floods, drought, avalanches, landslides and mudslides. The most vulnerable areas are the glacier-dependent river basins supplying hydropower and water resources for irrigation, fragile mountain ecosystems and isolated forests with mountainous and riverine terrain, which makes it prone to landslides and land degradation. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  As per the statement, the earthquake struck at a shallow depth of 23km, making it susceptible to aftershocks.","url":"https://www.latestly.com/agency-news/world-news-earthquake-of-magnitude-4-6-strikes-tajikistan-7009711.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720235743.jpg","video":null,"publish_date":"2025-07-21 01:02:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.168},{"id":343570808,"title":"World News | Japan Election: Ruling Coalition to Lose Voter Confidence, a Severe Blow to PM Ishiba","text":"Tokyo [Japan], July 21 (ANI): Japan's ruling coalition is certain to lose its majority in the House of Councillors after Sunday's election, an outcome that will pile pressure on embattled Japan's Prime Minister Shigeru Ishiba, who has vowed to stay on despite yet another heavy blow to his party, Kyodo News reported.\nThe cards are stacked against PM Ishiba, with all major opposition parties ruling out joining the Liberal Democratic Party and its partner Komeito in an expanded coalition.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nThe ruling coalition has now been deprived of majority control in both houses of parliament, the upper house and the more powerful House of Representatives -- a very rare situation for a government in post-war Japan. Opposition support will become even more crucial for passing bills and budgets, as per Kyodo News.\nThe Liberal Democratic Party and Komeito failed to meet their pre-election goal of winning at least 50 of the 125 contested seats, which would have allowed them to reach the majority threshold in the upper house.\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nThe LDP appears to have lost favour among some conservative voters, with the right-leaning populist party Sanseito emerging as an alternative.\nDespite its \"Japanese First\" mantra and nationalistic policy agenda targeting foreigners -- seen by critics as xenophobic -- its upper house strength surged above 10, a level that enables it to submit bills in the chamber.\nThe election served as a gauge of voter confidence in the months-old minority government amid mounting frustration over its handling of rising prices, insufficient wage growth and limited progress in negotiations on tariffs imposed by US President Donald Trump.\n\"We have to take the projected outcome humbly,\" PM Ishiba said on a TV program, adding that the LDP must fulfil its responsibility as the ruling party.\nHis comments followed those of LDP Secretary General Hiroshi Moriyama, the party's number two figure, who stated on a separate TV program that a political vacuum should be avoided. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The cards are stacked against Ishiba, with all major opposition parties ruling out joining the Liberal Democratic Party and its partner Komeito in an expanded coalition.","url":"https://www.latestly.com/agency-news/world-news-japan-election-ruling-coalition-to-lose-voter-confidence-a-severe-blow-to-pm-ishiba-7009709.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720235650.jpg","video":null,"publish_date":"2025-07-21 01:00:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.19},{"id":343570794,"title":"World News | Earthquake of Magnitude 6.2 Strikes Alaska","text":"Alaska [US], July 21 (ANI): An earthquake of magnitude 6.2 struck Alaska on Monday, a statement by the National Center for Seismology (NCS) said.\nAs per the statement, the earthquake struck at a shallow depth of 48km, making it susceptible to aftershocks.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn a post on X, the NCS said, \"EQ of M: 6.2, On: 21/07/2025 03:58:02 IST, Lat: 54.99 N, Long: 159.98 W, Depth: 48 Km, Location: Alaska Peninsula.\"\nhttps://x.com/NCS_Earthquake/status/1947065475059613892\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nEarlier on July 17, an earthquake of magnitude 7.3 on the Richter Scale rattled Alaska, a statement by the National Center for Seismology (NCS) said.\nAs per the NCS, the massive earthquake occurred at a shallow depth of 36km, making it susceptible to aftershocks.\nIn a post on X, the NCS said, \"EQ of M: 7.3, On: 17/07/2025 02:07:42 IST, Lat: 54.91 N, Long: 160.56 W, Depth: 36 Km, Location: Alaska Peninsula.\"\nhttps://x.com/NCS_Earthquake/status/1945588376717201723\nShallow earthquakes are generally more dangerous than deep earthquakes. This is because the seismic waves from shallow earthquakes have a shorter distance to travel to the surface, resulting in stronger ground shaking and potentially more damage to structures and greater casualties.\nA tsunami warning was issued for parts of coastal Alaska after an earthquake in the Gulf of Alaska, according to the US Tsunami Warning System, The New York Times reported.\nA tsunami warning is the most urgent alert issued by the National Weather Service in the United States, and it means that people should move to higher ground or go inland. A tsunami advisory means people should get out of coastal waters and stay away from beaches and waterways. A tsunami watch means experts are evaluating the threat, so stay tuned for further information.\nThe Alaska-Aleutian subduction system is one of the most seismically active globally, producing more >M8 earthquakes over the last century than any other. Many of these earthquakes, as well as coastal and submarine landslides, create tsunamis. The region contains over 130 volcanoes and volcanic fields, and contains well over three-quarters of US volcanoes that have erupted in the last two hundred years. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  As per the statement, the earthquake struck at a shallow depth of 48km, making it susceptible to aftershocks.","url":"https://www.latestly.com/agency-news/world-news-earthquake-of-magnitude-6-2-strikes-alaska-7009707.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720233922.jpg","video":null,"publish_date":"2025-07-21 00:58:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.344},{"id":343568526,"title":"Ellen DeGeneres finally confirms Trump was the reason for her sudden move to the UK: ‘We’re staying here’","text":"Ellen DeGeneres confirmed she and wife Portia de Rossi’s decision to move to the UK was due to President Donald Trump’s reelection.\n\nThe comedian said they couldn’t be happier with the the move during a conversation with British host Richard Bacon onstage in Cheltenham, Gloucestershire, Sunday, per the BBC.\n\nDeGeneres said that while she and the “Arrested Development” alum only planned to stay in the UK for a couple of months in 2024, the move became permanent last November after Trump won the presidential election against Democratic nominee Kamala Harris.\n\nThey now live in a house they purchased in the Cotswolds of England.\n\n“We got here the day before the election and woke up to lots of texts from our friends with crying emojis, and I was like, ‘He got in,'” she recalled. “And we’re like, ‘We’re staying here.'”\n\nDeGeneres said she and de Rossi are loving their rural life in the UK with their animals — including horses and her chickens.\n\n“It’s absolutely beautiful,” DeGeneres said. “We’re just not used to seeing this kind of beauty. The villages and the towns and the architecture — everything you see is charming and it’s just a simpler way of life.”\n\n“It’s clean,” she continued. “Everything here is just better — the way animals are treated, people are polite. I just love it here.”\n\nThe former daytime talk show host also shared she and de Rossi might get married again in the UK. The two tied the knot in August 2008 at their home in Los Angeles.\n\n“The Baptist Church in America is trying to reverse gay marriage,” she explained. “They’re trying to literally stop it from happening in the future and possibly reverse it. Portia and I are already looking into it, and if they do that, we’re going to get married here.”\n\n“I wish we were at a place where it was not scary for people to be who they are,” she added. “I wish that we lived in a society where everybody could accept other people and their differences.”\n\nDeGeneres later hinted at a possible return to show business, though said it would not be in the format of her former talk show, “The Ellen DeGeneres Show.”\n\n“I just don’t know what that is yet,” she said of what her potential next move. “I want to have fun, I want to do something. I do like my chickens but I’m a little bit bored.”\n\nDeGeneres, 67, and de Rossi, 52, sold their two-bedroom, two-bathroom beach bungalow in Montecito, Calif., for $5.2 million in March. \n\nShe has given glimpses of her new farmhouse life in England, also changing up her look by dying her hair brunette.\n\nDeGeneres recently showed her support for fellow comedian Rosie O’Donnell — despite their past beef — after Trump threatened to revoke O’Donnell’s citizenship, despite not having the power to do so.\n\nShe shared a screenshot of O’Donnell’s clapback, writing, “Good for you @rosie.”","summary":"\"I wish that we lived in a society where everybody could accept other people and their differences,\" the comedian said.","url":"https://pagesix.com/2025/07/20/celebrity-news/ellen-degeneres-finally-confirms-she-fled-the-us-over-trump/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/07/108484939.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-21 00:55:55","author":"Antoinette Bueno,mliss1578","authors":["Antoinette Bueno","mliss1578"],"language":"en","source_country":"zm","sentiment":0.292},{"id":343568524,"title":"NY awarded more than $600M to ‘sanctuary’ groups helping defy Trump, federal immigration law","text":"Legal and migrant advocacy groups fighting to block New York from helping the Trump administration enforce US immigration laws have been awarded more than $600 million in taxpayer dollars from the city and state governments, a Post review of contracts revealed.\n\nThe Bronx Defenders alone has received more than $500 million in city contracts since fiscal year 2018 to provide a host of legal services to poor criminal and civil defendants, including migrants, according to a review of contracts from 2009 to the present.\n\nAnd the legal aid group raked in another $32 million from the state over the years, records kept by the state comptroller’s office show.\n\nOther groups were also funneled big bucks as they worked to undermine federal immigration policy, including Make the Road NY — which received $56 million to provide legal, health and other services mostly to immigrants, state and city contract records.\n\nThe group helped organize a rally at the state Capitol last month urging passage of a sanctuary bill as rally goers chanted, “No hate, no fear. Immigrants are welcome here.”\n\nThe New York Immigration Coalition received $46 million.\n\n“New York City should not be in the business of carrying out Donald Trump’s mass disappearance agenda, which is in fact illegal under our local laws,” said Murad Awadeh, executive director of the NYICC, on his X handle @HeyItsMurad.\n\nAwadeh also reposted an interview he did with New York Public News Network on May 30.\n\n“Sanctuary policies are public safety measures,” he said. “They encourage people to participate within our society so that they’re able and comfortable enough to report things that are happening and without them, a lot of people won’t do that, because they are fearful, and rightfully fearful, especially in the world that we’re living in today, that they may end up entrapped in this ICE enforcement that’s happening.”\n\nAdditionally, New Yorker Lawyers for the Public Interest received $19 million, including about $5 million from 2022 to present, city and state records show.\n\nThe Bronx Defenders have been part of a wider push for a statewide sanctuary bill — the New York for All Act — that would bar state and local law enforcement from cooperating with US Immigrations and Customs Enforcement agents.\n\nThat would include assisting in providing information, turning over or deporting illegal immigrants.\n\nAnother bill with a push from activists called the Dignity not Detention Act would ban local jails from renting space to ICE to increase their detention capacity for suspected illegal migrants.\n\n“State leaders are not powerless against the federal administration’s mass deportation agenda,” the Bronx Defenders said in a June 11 statement on X. “We have a couple ideas: pass New York For All and Dignity Not Detention now, before it’s too late.”\n\nThe state Senate adjourned for the summer without passing either of the bills.\n\nPassage could become a political liability for Democrats who control the state government and US House of Representatives members who are running for office next year, including Gov. Kathy Hochul.\n\nMeanwhile, New York City is slated to spend $75 million on immigration legal services in its new budget, under a spending agreement approved by Mayor Eric Adams and the City Council. That spending plan includes $41.9 million in free legal assistance for migrants facing deportation\n\nBut politicians who back President Trump’s crackdown on illegal immigration fumed that groups helping break federal immigration law are receiving massive taxpayer funding.\n\n“Non-governmental organizations that help shield criminals from deportation should not receive a single penny,” said Rep. Nicole Malliotakis (R-Staten Island/Brooklyn).\n\n“While I don’t have much faith in Governor [Kathy] Hochul and New York Democrats to stop funding left wing groups who work against law enforcement and the interests of citizens, we’re taking decisive action on the federal level to end the Biden-Schumer gravy train of years past and put that money towards border security and enforcement to get foreign gangs and criminals out.”\n\nStaten Island Borough President Vito Fossella said, “Hundreds of millions of dollars are being spent to undermine public safety and our immigration laws. They are fighting to protect those who are dangerous criminals.\n\n“It’s a poke in the eye to hard working taxpayers. Is the money well spent?. The answer is no.”\n\nState Conservative Party chairman Gerard Kassar: “There is no excuse for New York authorities not to cooperate with federal authorities. New Yorkers should not be spending hundreds of millions of dollars on groups fighting to keep illegal aliens in the United States.”\n\nThe staggering tally comes after an off-duty US Customs and Border Protection agent was shot in the face in New York City during a robbery — with the shooter allegedly an illegal migrant.\n\nPresident Trump also ripped Democrats for flooding “our Nation with Criminal Invaders.”","summary":"Legal and migrant advocacy groups fighting to block New York from helping the Trump administration enforce US immigration laws have been awarded more than $600 million in taxpayer dollars from the city and state governments, a Post review of contracts reveals.","url":"https://nypost.com/2025/07/20/us-news/ny-awarded-more-than-600m-to-sanctuary-groups-helping-defy-trump-federal-immigration-law/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-mqt0fc3dz-1753057624418.jpg?quality=75&strip=all&1753043285&w=1200","video":"https://cdn.jwplayer.com/videos/vyQ86ji5-RyIcpnTz.mp4","publish_date":"2025-07-21 00:55:47","author":"Carl Campanile","authors":["Carl Campanile"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.094},{"id":343569662,"title":"Ellen DeGeneres reveals the real reason she left the US and why she's settled in the Cotswolds","text":"Ellen DeGeneres has found her new happy place. After decades of fame in front of the camera and years of making audiences laugh on daytime television, the comedian has traded Hollywood for the rolling hills of the English countryside.\n\nIn a candid conversation at the Everyman Theatre in Cheltenham this weekend, Ellen, 67, opened up about her surprising decision to leave the United States and settle in the Cotswolds with her wife Portia de Rossi, 52. \n\nSitting down with broadcaster Richard Bacon, Ellen shared rare insight into her peaceful new life and the political decision that ultimately led to their move.\n\n\"We got here the day before the election,\" Ellen revealed, referencing Donald Trump’s win.\"“We woke up to lots of texts from our friends with crying emojis, and I was like, 'He got in.' And we’re like, 'We’re staying here.'\"\n\nThat one moment, Ellen says, was a turning point. Having faced intense scrutiny following the controversy that surrounded her former talk show, and growing increasingly concerned about the direction of US politics, she and Portia made a life-changing decision. England, with its green pastures and quiet charm, quickly felt like home.\n\n\"It’s absolutely beautiful,\" she told the audience. \"We’re just not used to seeing this kind of beauty. The villages and the towns and the architecture, everything you see is charming and it’s just a simpler way of life. It’s clean. Everything here is just better, the way animals are treated, people are polite. I just love it here.\"\n\nThe couple moved to the UK in November, and while it may not have been the sunniest time to arrive, Ellen was captivated. \"I saw snow for the first time in my life,\" she added, laughing. \"We love it here. Portia flew her horses over, and I have chickens, and we had sheep for about two weeks.\"\n\nNow living in a picture-perfect corner of the Cotswolds, Ellen has been quietly embracing the rural lifestyle. Her social media followers have enjoyed glimpses of the couple’s tranquil life, including photos of rainbows over lush green fields, chickens pecking in the garden and peaceful moments with Portia looking out over the landscape.\n\nRecently, she posted a sweet image of her wife standing by a window, gazing at a double rainbow. \"Three things that make me happy: My Wife, A Rainbow, And my wife taking a photograph of a Rainbow,\" she captioned the moment.\n\nDespite the serenity of their new life, Ellen admits that there is a deeper reason behind their move. The couple are also concerned about the growing threats to LGBTQ+ rights in the US, including fears that same-sex marriage could come under fire.\n\n\"The Baptist Church in America is trying to reverse gay marriage,”\"Ellen said with concern. \"They’re trying to literally stop it from happening in the future and possibly reverse it. Portia and I are already looking into it, and if they do that, we’re going to get married here.\"\n\nThe couple originally wed in an intimate ceremony in California in 2008. Now, more than 15 years later, they’re considering a vow renewal – this time on British soil.\n\n\"I wish we were at a place where it was not scary for people to be who they are,\" Ellen shared. \"I wish that we lived in a society where everybody could accept other people and their differences. So until we’re there, I think there’s a hard place to say we have huge progress.\"\n\nEllen’s remarks come at a time when LGBTQ+ rights have become a lightning rod in American politics, and her decision to speak out reflects both her personal journey and her long-standing advocacy.\n\nIt also marks a new chapter for the television star, who in 2022 ended The Ellen DeGeneres Show after 19 seasons. At the height of the show’s popularity, Ellen was one of the most influential women in media, hosting everyone from Michelle Obama to Jennifer Aniston and launching the careers of numerous viral stars.\n\nBut behind the scenes, things were less than rosy. In 2020, the show came under scrutiny following allegations of a toxic workplace environment. Ellen later issued a public apology and stepped away from the spotlight.\n\nLooking back, she told The Hollywood Reporter: \"I have to just trust that whatever happened during that time, which was obviously very, very difficult, happened for a reason. I think that I learned a lot, and there were some things that came up that I was shocked and surprised by. It was eye-opening, but I just trust that that had to happen.\"","summary":"In a candid conversation, Ellen DeGeneres opened up about her surprising decision to leave the United States and settle in the Cotswolds.","url":"https://www.hellomagazine.com/homes/845427/ellen-degeneres-reveals-the-real-reason-she-left-the-us-and-why-shes-settled-in-the-cotswolds/","image":"https://images.hellomagazine.com/horizon/landscape/d8591f75c5bd-ellen-degeneres-show.jpg","video":null,"publish_date":"2025-07-21 00:55:19","author":"Faye James","authors":["Faye James"],"language":"en","source_country":"gb","sentiment":0.72},{"id":343570810,"title":"World News | IDF Kills Hamas Commander, Hits 75 Terror Targets in Latest Op","text":"Tel Aviv [Israel], July 21 (ANI): The Israel Defence Forces on Sunday stated that they had killed Bashar Thabet, a commander in Hamas' Development and Projects Department within its weapons production headquater. Thabet was reportedly responsible for research and development in Hamas' weapons manufacturing apparatus.\nThe IDF said that they located and dismantled terrorist infrastructure, terrorists and tunnel shafts. The Israeli Air Force (IAF) has also been involved, striking approximately 75 terror targets, including terrorists' military compounds and additional terrorists' infrastructure.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\n\"Operational Update: IDF Activity in Gaza- Eliminated: Bashar Thabet, a commander in Hamas' Development and Projects Department within its weapons production HQ. He was responsible for research & development within Hamas' weapons manufacturing apparatus, which operates to restore and increase their weapons stockpile,\" the IDF said in a post on X.\n\"IDF troops located & dismantled terrorist infrastructure, terrorists and tunnel shafts. The IAF targeted terrorist cells that were about to attack IDF troops and struck approx. 75 terror targets, including terrorists military compounds and additional terrorist infrastructure,\" it added.\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nhttps://x.com/IDF/status/1946894595771728146\nThe Israeli military killed at least 115 Palestinians, including 92 aid seekers and two civil defence aid workers, and wounded more than 200 people as famine reached its peak in Gaza, and children are dying of Israeli-imposed starvation, Al Jazeera reported.\nThe Gaza Health Ministry said that 18 people had died of hunger in its last 24-hour reporting period, as per Al Jazeera.\nThe Israeli army dropped leaflets over a residential area in Deir el-Balah, warning residents to leave the area as its military chief visited Shujayea in the north and touted plans to continue the war.\nProtesters across Tunisia, Iraq, Turkiye, Morocco, Lebanon and the occupied West Bank's Ramallah took to the streets to denounce the Israeli siege of Gaza.\nIsrael's Foreign Minister Gideon Saar confirmed blocking a visa extension for the head of the UN's Office for the Coordination of Humanitarian Affairs in Gaza and the occupied West Bank because he testified about \"weaponised hunger\" in Gaza.\nIn the occupied West Bank, Palestinians say Israeli settler attacks on water supplies are making it harder to stay in their villages, as per Al Jazeera. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The IDF said that they located and dismantled terrorist infrastructure, terrorists and tunnel shafts.","url":"https://www.latestly.com/agency-news/world-news-idf-kills-hamas-commander-hits-75-terror-targets-in-latest-op-7009703.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720232250.jpg","video":null,"publish_date":"2025-07-21 00:54:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.128},{"id":343568638,"title":"Ukrainian drones target Moscow and other Russian regions","text":"Russia’s air defenses destroyed dozens of incoming Ukrainian drones across multiple regions on Sunday night and early Monday morning. Kiev has intensified its UAV raids deep into Russian territory over the past week, even after calling for renewed peace talks.\n\nAt least nine drones headed toward the Russian capital were intercepted by 3:00am Monday, Moscow Mayor Sergey Sobyanin said on Telegram, adding that emergency services were working at the crash sites where debris fell.\n\nThe raids also affected Russia’s southern Rostov Region, where Governor Yury Slyusar reported multiple interceptions in the towns of Shakhty, Novoshakhtinsk, and Novocherkassk.\n\nThere were no casualties, according to the governor, but one UAV damaged the “old control room” of a railway station in a mining settlement near Shakhty. Debris from another drone struck a private house, a summer kitchen, and two cars in a nearby village, Slyusar said.\n\nKiev has significantly stepped up long-range UAV strikes over the past week, with the Russian Defense Ministry reporting multiple waves of drone interceptions each day. In its latest update, the ministry said a total of 43 drones were downed in less than four hours between 8:00pm and 11:30pm on Sunday across the Bryansk, Oryol, Kaluga, Belgorod, and Moscow regions.\n\nThe Russian government has previously denounced such raids as “terrorist attacks,” claiming they often target residential buildings and civilian infrastructure. In response, the Russian military carried out a series of strikes last week on Ukrainian defense industrial facilities involved in the production of drones and missile components.\n\nRussia and Ukraine held two rounds of direct peace talks in Istanbul in recent months, but the negotiations stalled in June after Kiev dismissed Moscow’s peace proposals. It later declared the process “exhausted” and indicated it had only taken part to avoid appearing dismissive of US President Donald Trump’s diplomatic initiative.\n\nUkraine’s Vladimir Zelensky claimed on Sunday that the “pace of negotiations must be increased,” offering to hold a new round of talks in Istanbul – after Moscow accused it of stalling and urged Trump to pressure Kiev.","summary":"Russia’s air defenses destroyed dozens of incoming Ukrainian drones across multiple regions on Sunday night and early Monday morning \nRead Full Article at RT.com","url":"https://www.rt.com/russia/621743-ukrainian-drones-moscow-rostov/","image":"https://mf.b37mrtl.ru/files/static.en/article/dev_story.jpg","video":null,"publish_date":"2025-07-21 00:49:50","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.111},{"id":343569668,"title":"Ellen DeGeneres Confirms Move To UK Over Trump’s Re-Election: 'We’re Staying Here'","text":"Ellen DeGeneres has revealed she and her wife, Portia de Rossi, have decided to permanently relocate to the UK following Donald Trump’s re-election as US president in November 2024. Speaking at Cheltenham’s Everyman Theatre during a conversation with broadcaster Richard Bacon, DeGeneres explained the decision was made shortly after they arrived in the UK, just before the election. “We got here the day before the election and woke up to lots of texts from our friends with crying emojis, and I was like, ‘He got in.’ And we’re like, ‘We’re staying here,’” she said, as reported by the BBC. Though the couple originally planned a part-time stay, DeGeneres said the shift became permanent due to concerns over LGBTQ+ rights and the political climate in the US. “It’s clean. Everything here is just better — the way animals are treated, people are polite. I just love it here,” she added. Also read: Tragedy Strikes Dog The Bounty Hunter’s Family: 13-Year-Old Step-Grandson Shot Dead By Father Gregory Zecca Ellen On Status Of LGBTQ Rights In US Under Trump Of particular concern to DeGeneres was the recent effort by Southern Baptist leaders to overturn the 2015 Supreme Court ruling that legalized same-sex marriage. Over 10,000 church representatives voted to push for its reversal during their national meeting in June. Lawmakers in nine states have also introduced legislation aimed at undermining Obergefell v. Hodges. “The Baptist Church in America is trying to reverse gay marriage,” DeGeneres said. “If they do that, we’re going to get married here.” She concluded, “I wish we lived in a society where everyone could accept others as they are. Until we get there, it’s hard to say we’ve made huge progress.”","summary":"Ellen DeGeneres confirmed she and wife Portia de Rossi have permanently moved to the UK after Donald Trump’s re-election, citing concerns over LGBTQ+ rights in the US. She criticized efforts to reverse same-sex marriage and praised the UK for its cleaner environment, politeness, and better treatment of animals and people.","url":"https://www.timesnownews.com/world/us/us-buzz/ellen-degeneres-confirms-move-to-uk-over-trumps-re-election-were-staying-here-article-152315499","image":"https://images.timesnownews.com/thumb/msid-152315501,thumbsize-1102525,width-1280,height-720,resizemode-75/152315501.jpg","video":null,"publish_date":"2025-07-21 00:48:59","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":0.175},{"id":343570816,"title":"World News | Pak: 7 Die, over 12 Injured in Chaman Armed Clash","text":"Chaman [Pakistan], July 21 (ANI): A deadly armed clash in Chaman exploded on Sunday between two opposing groups, which resulted in the deaths of at least seven persons and injuries to more than twelve others, ARY News reported.\nAccording to police sources, one of the critically injured victims succumbed to injuries later, raising the death toll to seven, as per ARY News.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nThe Chaman armed clash took place in the precarious border town of Chaman, located in Balochistan province, near the Afghan frontier.\nThe conflict demanded urgent intervention by Frontier Corps (FC) personnel, who somehow managed to stop the fighting.\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nHowever, high tensions have led to the blockage of the Quetta-Chaman highway by one of the groups at Qila Abdullah, resulting in a massive traffic jam with long queues of stranded vehicles.\nLocal officials, including the Deputy Commissioner of Qila Abdullah, tribal elders, and religious scholars, gathered at the Jungle Pir Alizai police station to evaluate the situation after the conflict and investigate options to restore peace.\nThe Chaman armed clash is the latest in a series of violent incidents in the area, which has seen frequent discontent due to tribal arguments and border tensions. The Quetta-Chaman highway blockage incident has upset trade and travel between Pakistan and Afghanistan, highlighting the crucial importance of this route.\nEfforts are continued to negotiate with the involved parties and reopen the highway. Security forces remain on high alert to stop expansion.\nMeanwhile, on Sunday, a viral video showing the killing of a man and woman in Balochistan has drawn public outrage and prompt action from provincial officials, as per ARY News.\nThe viral video from Balochistan has led the government to send the footage to NADRA for biometric analysis. Officials have successfully identified the individuals and tribal ties involved. However, the names remain secret for now.\nShahid Rind mentioned that such acts are not authorised by Pakistani law, and tribal councils (jirgas) have no legal standing in resolving criminal matters. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to police sources, one of the critically injured victims succumbed to injuries later, raising the death toll to seven, as per ARY News.","url":"https://www.latestly.com/agency-news/world-news-pak-7-die-over-12-injured-in-chaman-armed-clash-7009697.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720225316.jpg","video":null,"publish_date":"2025-07-21 00:46:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.359},{"id":343569624,"title":"Asia shares, yen weather Japan uncertainty as earnings loom","text":"SYDNEY :Asian shares and the yen held their ground on Monday as Japanese elections proved bad for the government but no worse than already priced in, while Wall Street futures braced for earnings from the first of the tech giants.\n\nInvestors were also hoping for some progress in trade talks ahead of President Donald Trump's August 1 tariff deadline, with U.S. Commerce Secretary Howard Lutnick still confident a deal could be reached with the European Union.\n\nThere were reports Trump and Chinese leader Xi Jinping were closer to arranging a meeting, though likely not until October at the earliest.\n\nIn Japan, the ruling coalition lost control of the upper house in an election on Sunday, further weakening Prime Minister Shigeru Ishiba's grip on power as a tariff deadline looms.\n\nIshiba expressed his intention to stay in the position, which along with a market holiday, limited the reaction and the yen was 0.4 per cent firmer at 148.29 to the dollar.\n\n\"Ishiba will try to govern with support from some within the opposition, but this likely means a looser fiscal policy and is not good news for bond yields,\" said Rodrigo Catril, a senior FX strategist at NAB.\n\n\"History also suggests that domestic political uncertainty tends to keep the BOJ on the side-lines, so the prospect of rate hikes is now set to be delayed for a little bit longer.\"\n\nThe Bank of Japan still has a bias to raise rates further but markets are pricing little chance of a move until the end of October.\n\nWhile the Nikkei was shut, futures traded up at 39,875 and just above the cash close of 39,819.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan was flat, while South Korean stocks added 0.4 per cent.\n\nMEGA CAPS KICK OFF\n\nS&P 500 futures and Nasdaq futures both edged up 0.1 per cent, and are already at record highs in anticipation of more solid earnings reports.\n\nA host of companies reporting this week include Alphabet and Tesla, along with IBM.\n\nInvestors also expect upbeat news for defence groups RTX, Lockheed Martin and General Dynamics. Ramped up government spending across the globe has seen the S&P 500 aerospace and defence sector rise 30 per cent this year.\n\nIn bond markets, U.S. Treasury futures held steady having dipped late last week after Federal Reserve Governor Christopher Waller repeated his call for a rate cut this month.\n\nMost of his colleagues, including Chair Jerome Powell, have argued a pause is warranted to judge the true inflationary impact of tariffs and markets imply almost no chance of a move in July. A September cut is put at 61 per cent, rising to 80 per cent for October.\n\nPowell's reticence on rates has drawn the ire of Trump who threatened to fire the Fed chief, before backing down. The spectre of a potential political appointee who would seek to ease policy sharply has investors on edge.\n\nThe European Central Bank meets this week and is expected to hold its rates steady at 2.0 per cent following a string of cuts.\n\n\"The press conference will likely keep highlighting uncertainty and need to wait for tariff negotiations to conclude before deciding the next step,\" said analysts at TD Securities in a note. \"Similarly, its 'meeting-by-meeting' language would be retained in the release.\"\n\nThe euro was unchanged at $1.1630 in early trading, having dipped 0.5 per cent last week and away from its recent near-four-year top of $1.1830. The dollar index was a fraction lower at 98.40.\n\nIn commodity markets, gold was little changed at $3,348 an ounce with all the recent action in platinum which last week hit its highest since August 2014. \n\nOil prices were caught between the prospect of increased supply from OPEC+ and the risk European Union sanctions against Russia for its war in Ukraine could curb its exports.\n\nBrent edged up 0.1 per cent to $69.36 a barrel, while U.S. crude added 0.1 per cent to $67.39 per barrel.\n\n (Editing by Sam Holmes)","summary":"","url":"https://www.channelnewsasia.com/business/asia-shares-yen-weather-japan-uncertainty-earnings-loom-5248756","image":"https://dam.mediacorp.sg/image/upload/s--z2H8Ga86--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-07-21t004419z_1_lynxmpel6k009_rtroptp_3_china-stocks-hshares.jpg?it","video":null,"publish_date":"2025-07-21 00:44:19","author":null,"language":"en","source_country":"sg","sentiment":-0.309},{"id":343569318,"title":"Japan's ruling coalition suffers second consecutive defeat in parliamentary elections","text":"TOKYO, July 21. /TASS/. The ruling coalition in Japan, consisting of the Liberal Democratic Party (LDP) and the Komeito Party, lost the majority of seats in the upper house of parliament after elections on Sunday, data of regional and regional election commissions show.\n\nThis is the second consecutive defeat for the ruling bloc led by Prime Minister Shigeru Ishiba. Last fall, he lost his majority in the key lower house of parliament, but thanks to disagreements in the opposition camp, he was able to form a minority government and remain in power. The LDP and Komeito, which needed 51 seats to maintain their majority in the House of Councilors, were able to secure only 47 of the mandates at stake - as a result of these elections, the ruling bloc immediately lost 28 seats in the upper house. Thus, the coalition led by the prime minister now has only 122 seats in the upper house of parliament, which has 248 seats.\n\nThe main opposition Constitutional Democratic Party, led by former Prime Minister Yoshihiko Noda, won 22 seats in the last election, bringing the total number of seats to 38. The most impressive result was demonstrated by nationalist Party of Participation in Politics, which immediately won 14 new seats in parliament (previously it had only one). The People's Democratic Party has also significantly improved its position, gaining 17 new seats and bringing the total number of its mandates to 22. In general, almost all parties, except the LDP and Komeito, have consolidated their positions in the upper house. Thus, the ruling coalition now has 122 seats in the upper house of parliament, while all opposition parties have 126. At the same time, some opposition parties have demonstrated their willingness to cooperate with the ruling bloc in promoting some legislative initiatives.\n\nIshiba acknowledged that the ruling bloc had learned a serious lesson in the elections, from which it was necessary to draw conclusions. The prime minister did not give a direct answer to the question of whether he was going to take responsibility for the failure and resign, vaguely stating that he and his party needed to fulfill their promises to the voters. On Monday, Ishiba is scheduled to give a press conference, where he is to give more detailed comments. Noda believes that if Ishiba decides to remain as prime minister, he should explain his decision. The voters said a firm \"no\" to the prime minister and his policies, Noda is convinced. One of the main arguments of the supporters of the ruling party in favor of the fact that Ishiba should not resign now is the ongoing negotiations with the administration of US President Donald Trump on tariffs and duties. Ishiba's supporters are confident that a change of prime minister at such a moment will hit Japan's position in these negotiations.\n\nThere are 248 seats in the upper house of the Japanese parliament. The term of office of a deputy is six years, but elections are held every three years, and only half of the members are elected. Now, the voters have decided the fate of 124 parliamentary seats and one vacant one. A total of 125 deputies were elected: 75 from single-mandate constituencies, 50 from party lists.","summary":"The most impressive result was demonstrated by nationalist Party of Participation in Politics, which immediately won 14 new seats in parliament (previously it had only one)","url":"https://tass.com/world/1991865","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-21 00:43:10","author":"Tass","authors":["Tass"],"language":"en","source_country":"ru","sentiment":-0.377},{"id":343566756,"title":"Masa depan Perdana Menteri Jepun menjadi tanda tanya selepas  kalah pilihan raya","text":"TOKYO: Masa depan Perdana Menteri Jepun, Shigeru Ishiba, menjadi tanda tanya susulan kekalahan besar gabungannya dalam pilihan raya Dewan Tinggi, menyaksikan peningkatan ketara sokongan kepada sebuah parti populis berhaluan kanan.\n\nParti Liberal Demokratik (LDP), yang memerintah sejak 1955, bersama rakan gabungannya, Komeito, perlu memenangi sekurang-kurangnya 50 kerusi dalam undian semalam, namun menurut unjuran media tempatan, mereka hanya memperoleh sekitar 41 kerusi.\n\nPengundi yang kecewa dengan kadar inflasi yang meningkat beralih sokongan kepada parti lain, terutamanya parti Sanseito yang membawa slogan 'Utamakan Jepun' serta memperjuangkan agenda antiglobalisasi yang dilihat menyerupai pendekatan Presiden Amerika Syarikat, Donald Trump, sebelum ini.\n\nKekalahan ini berlaku hanya beberapa bulan selepas gabungan Ishiba turut kehilangan majoriti dalam Dewan Rendah, sekali gus mencatatkan prestasi terburuk LDP dalam tempoh 15 tahun.\n\nIshiba, 68, yang menggelarkan dirinya sebagai 'geek' dasar dan dianggap tokoh stabil ketika memenangi kepimpinan LDP pada September - selepas mencuba sebanyak lima kali - enggan mengulas panjang mengenai masa depannya ketika ditemui semalam.\n\n\"Ia situasi yang sukar, dan kami harus menerimanya dengan rendah hati dan penuh kesedaran,\" katanya kepada penyiar NHK.\n\nApabila ditanya mengenai kedudukannya, beliau hanya menjawab 'tidak boleh bercakap mengenainya secara tergesa-gesa'. \n\n\"Kami tidak dapat membuat apa-apa sehingga keputusan muktamad diperoleh, namun kami harus benar-benar sedar akan tanggungjawab kami,\" tambahnya.\n\nSekiranya beliau meletakkan jawatan, masih belum jelas siapa yang akan menggantikannya sebagai Perdana Menteri ke-11 daripada LDP sejak 2000, terutamanya apabila kerajaan kini memerlukan sokongan pembangkang di kedua-dua dewan Parlimen.\n\n\"Ishiba mungkin akan digantikan, tetapi belum jelas siapa penggantinya,\" kata pakar sosiologi dan politik di Universiti Tsukuba, Profesor Hidehiro Yamamoto, kepada AFP.\n\nSelepas bertahun mengalami deflasi atau kenaikan harga yang perlahan, pengguna di negara ekonomi keempat terbesar dunia itu kini berdepan tekanan kos sara hidup yang meningkat susulan pencerobohan Russia ke atas Ukraine pada 2022.\n\nHarga beras, meningkat dua kali ganda, membebankan isi rumah walaupun kerajaan memberikan bantuan kewangan.","summary":"TOKYO: Masa depan Perdana Menteri Jepun, Shigeru Ishiba, menjadi tanda tanya susulan kekalahan besar gabungannya dalam pilihan raya Dewan Tinggi, menyaksikan peningkatan ketara sokongan kepada sebuah parti populis berhaluan kanan.","url":"https://www.bharian.com.my/dunia/asia/2025/07/1422489/masa-depan-perdana-menteri-jepun-menjadi-tanda-tanya-selepas-kalah","image":"https://assets.bharian.com.my/images/articles/BH21japan-o_BHfield_image_listing_featured.var_1753058526.jpg","video":null,"publish_date":"2025-07-21 00:42:12","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":0.926},{"id":343570826,"title":"India News | Centre to Discuss Courage, Valour of Armed Forces in Parliament: BJP Leader Mayank Nayak","text":"New Delhi [India], July 21 (ANI): The Bharatiya Janata Party (BJP)-led central government is expected to praise the courage and valour the Indian armed forces showed, which have given a befitting reply to Pakistan and held up the tri-colour, party leader and Rajya Sabha MP Mayank Nayak said on Sunday. The Parliament monsoon session is scheduled to commence on Monday, July 21, with discussions on the Pahalgam attack and Operation Sindoor expected to take place. The Opposition parties, mainly part of the Indian National Developmental Inclusive Alliance (INDIA), have also raised the issue, demanding accountability from the government. Also Read | Kanwar Yatra 2025: 6 Kanwariyas Killed, 20 Injured in Road Accidents on Delhi-Dehradun Highway and Ganga Canal Road As Pilgrim Rush Surges in Yatra's Final Leg.\n\"The monsoon session of the Parliament will start from tomorrow onwards. There will be discussions about the courage and valour of the Armed Forces in front of Pakistan, how they held the tri-colour high by doing the work successfully under the leadership of PM Modi,\" BJP's Mayank Nayak said. \"Also, the appreciation given to PM Modi from different countries following this, which has increased the respect for India too, we will talk about that,\" he added. Also Read | Nuh Shocker: Refusing To Give INR 20 to Drug Addict Son in Haryana Costs 56-Year-Old Woman Her Life, Accused Taken Into Custody.\nFollowing the heinous April 22 Pahalgam attack in Jammu and Kashmir, which killed 26 people, India launched Operation Sindoor, a decisive reply to Pakistan-sponsored terrorism. The Operation launched on May 7 struck nine terror sites in Pakistan and Pakistan-Occupied-Kashmir. On May 10, an understanding of cessation of hostilities between the two countries was announced.\nSince the attack, the Opposition has demanded answers from the Centre regarding the attack. Opposition parties have called the Pahalgam attack itself an intelligence failure, and have demanded to know when the perpetrators of the terror attack will be caught. The opposition has also demanded that the Centre clear the record amid US President Donald Trump's repeated claims that he helped mediate the cessation of hostilities between the two countries. Recently, too, President Trump claimed that at least five fighter jets were shot down during the hostilities; however, he did not clarify whether the losses were from the Indian or Pakistani side. India, in turn, has vehemently denied the claims, stating that the understanding was reached bilaterally rather than through a third party. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on India at LatestLY.  The Parliament monsoon session is going to commence from July 21, Monday, with discussions on Pahalgam attack and Operation Sindoor expected to happen. The Opposition parties, mainly part of the Indian National Developmental Inclusive Alliance (INDIA) have also raised the issue, demanding accountability from the government.","url":"https://www.latestly.com/agency-news/india-news-centre-to-discuss-courage-valour-of-armed-forces-in-parliament-bjp-leader-mayank-nayak-7009692.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720221353.jpg","video":null,"publish_date":"2025-07-21 00:40:26","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.384},{"id":343570558,"title":"Polls show falling US support for Trump’s deportations","text":"WASHINGTON: Polls released Sunday showed falling support among Americans for Donald Trump’s hardline measures against illegal immigration, as the Republican president celebrated six months back in power.\n\nTrump won last year’s election in part with promises to launch a historic deportation drive, riling up his base with exaggerated claims of mass violence committed by undocumented migrants, whom he referred to as “savages” and “animals.”\n\nPolls from both CNN and CBS show that Trump has lost majority support for his deportation approach.\n\nFifty five percent of respondents feel the raids — frequently seen online in viral videos of masked, unidentified agents seizing people off the street — have gone too far, CNN said.\n\nThis was up 10 percent from a similar poll in February, shortly after Trump took office.\n\nA majority — 57 percent — said they oppose plans for construction of mass detention facilities, with only 26 percent supporting the idea, CNN said.\n\nA CBS News poll found that 56 percent of Americans believe Trump’s administration is targeting migrants who do not represent a threat to public safety, up from 47 percent last month.\n\nAccording to the poll, only 49 percent of Americans approve of Trump’s immigration policies, down from 54 percent last month and 59 percent in February.\n\nSupport remains nearly universal among Republicans, however, with 91 percent in favor of the deportations.\n\nOpposition among independents is nonetheless at 59 percent and among Democrats at 86 percent.\n\nTrump marked the six-month mark of his second presidency by heading out to his golf club in Virginia, near Washington, and posting on social media that the period was “being hailed as one of the most consequential periods of any President.”\n\n“Six months is not a long time to have totally revived a major Country,” he wrote on Truth Social.\n\n“One year ago our Country was DEAD, with almost no hope of revival,” he said, adding that now the United States was the “most respected Country anywhere in the World.”","summary":"WASHINGTON: Polls released Sunday showed falling support among Americans for Donald Trump’s hardline measures against illegal immigration, as the Republican president celebrated six months back in power.\n\n\n\nTrump won last year’s election in part with promises to launch a historic deportation drive, riling up his base with exaggerated claims of mass violence committed by undocumented migrants, whom he referred to as “savages” and “animals.”\n\n\n\nPolls from both CNN and CBS show that Trump has lost majority support for his deportation approach.\n\n\n\nFifty five percent of respondents feel the raids — frequently seen online in viral videos of masked, unidentified agents seizing people off the street — have gone too far, CNN said.\n\n\n\nThis was up 10 percent from a similar poll in February, shortly after Trump took office.\n\n\n\nA majority — 57 percent — said they oppose plans for construction of mass detention facilities, with only 26 percent supporting the idea, CNN said.\n\n\n\nA CBS News poll found that 56 percent of Ameri","url":"https://www.brecorder.com/news/40373576/polls-show-falling-us-support-for-trumps-deportations","image":"https://i.brecorder.com/large/2025/07/687d7189d03bd.jpg","video":null,"publish_date":"2025-07-21 00:37:45","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.25},{"id":343570552,"title":"Trump says he will help Afghans stuck in UAE","text":"WASHINGTON: President Donald Trump said on Sunday he would help Afghans detained in the United Arab Emirates for years after fleeing their country when its Taliban leaders extended control over it. Trump, a Republican who has criticized high levels of immigration, suspended refugee resettlement after he took office in January. In April, the Trump administration terminated temporary deportation protections for thousands of Afghans in the US \n\n“I will try to save them, starting right now,” Trump said in a post on Truth Social that linked to an article on the Afghans held in limbo there. \n\nThe UAE, a close security partner of the United States, agreed in 2021 to temporarily house several thousand Afghans evacuated from Kabul as the Taliban ousted the US-backed government during the final stages of the US-led withdrawal. Canada agreed in 2022 to resettle about 1,000 of the Afghans still held in the UAE after a US request. It is unclear how many remain in the Gulf country. Nearly 200,000 Afghans have been brought to the US by former President Joe Biden’s administration since the chaotic US troop withdrawal from Kabul. \n\nRefugees include family members of Afghan-American US military personnel, children cleared to reunite with their parents, relatives of Afghans already admitted and tens of thousands of Afghans who worked for the US government during the 20-year war.","summary":"WASHINGTON: President Donald Trump said on Sunday he would help Afghans detained in the United Arab Emirates for years after fleeing their country when its Taliban leaders extended control over it. Trump, a Republican who has criticized high levels of immigration, suspended refugee resettlement after he took office in January. In April, the Trump administration terminated temporary deportation protections for thousands of Afghans in the US \n\n\n\n“I will try to save them, starting right now,” Trump said in a post on Truth Social that linked to an article on the Afghans held in limbo there. \n\n\n\nThe UAE, a close security partner of the United States, agreed in 2021 to temporarily house several thousand Afghans evacuated from Kabul as the Taliban ousted the US-backed government during the final stages of the US-led withdrawal. Canada agreed in 2022 to resettle about 1,000 of the Afghans still held in the UAE after a US request. It is unclear how many remain in the Gulf country. Nearly 200,000 Afghans have been brou","url":"https://www.brecorder.com/news/40373575/trump-says-he-will-help-afghans-stuck-in-uae","image":"https://i.brecorder.com/large/2025/07/687d715182006.jpg","video":null,"publish_date":"2025-07-21 00:37:45","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.029},{"id":343570832,"title":"World News | When We Say We Provided 4cr Houses , It Means We Covered Entire Population of Japan,\" Says EAM Jaishankar","text":"New Delhi [India], July 21 (ANI): At the Guru Samman and felicitation programme for new entrants in Civil Services by Samkalp Foundation, External Affairs Minister S Jaishankar explained that when the government says that they have provided four crore houses, they have covered an equivalent of the entire population of Japan.\nJaishankar said that the entrants must spread awareness on how they can take the development to the next level.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn his address, Jaishankar said, \"When we say that we have provided four crore houses under Aawas Yojana, it means that we have covered the entire population of Japan in the last decade. If you look at the statistics of Pradhan Mantri Garib Kalyan Anna Yojna, more people than the population of entire Europe and America get nutrition support every month... Today's India builds seven new airports every year. Today's India opens 1-2 new metro systems every year. Today's India lays 12 kilometres of railway track every day. Every day, it builds 28 kilometres of highways. So when you give these figures of change and we are living our lives amidst this change, then we should be excited about it, we should be proud of it, we should also be aware of how we can take it forward and your generation will take it to the next level.\"\nJaishankar reminisced about his Civil Services interview day, which coincided with a historic moment in India's history - the day the Emergency was revoked, March 21, 1977. He highlighted that the core of their profession lies in serving the nation.\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nRecalling his own Civil Services interview, Jaishankar said, \"My interview was on March 21, 1977. That was the day the Emergency was revoked. I go in for an interview at Shahjahan Road, the first person that morning.\"\n\"Looking ahead to India's growth, Jaishankar said, \"We say today that by 2030, India will be the third largest economy. By 2047, we will be closing the gap between 3 and 2...\" He encouraged the young civil servants to think about their contributions to India's development, saying, \"I want you to think 20 years ahead. I want you to think about what your contribution to Viksit Bharat will be when we move towards it.\"\nhttps://x.com/DrSJaishankar/status/1946842511453856045\nEmphasising the importance of service, Jaishankar added, \"There can be nothing greater than serving your nation. Whether you enter the Indian Foreign Service, the Indian Railway Service, Indian Police Service, or the Indian Revenue Service, the important word is Service...\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Jaishankar said that the entrants must spread awareness on how they can take the development to the next level.","url":"https://www.latestly.com/agency-news/world-news-when-we-say-we-provided-4cr-houses-it-means-we-covered-entire-population-of-japan-says-eam-jaishankar-7009686.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720212945.jpg","video":null,"publish_date":"2025-07-21 00:32:19","author":null,"language":"en","source_country":"in","sentiment":-0.092},{"id":343569904,"title":"When WILL this serpentine creature now given such power by Starmer be forced to answer for his actions?: STEPHEN GLOVER","text":"Who is one of the most influential figures in the Labour Government and yet almost unknown to the British public?\n\nWho secretly brokered the recent controversial deal whereby Britain agreed to hand over £101million annually to Mauritius for 99 years in return for a lease on a base in the Chagos Islands, which a previous administration had already secured with a payment of £3million in 1968?\n\nWho is fanatically anti-Brexit – and indeed began to campaign for a second referendum only a couple of weeks after the British people had voted to leave the European Union?\n\nWho was in Ukraine in March – a one-man diplomatic service flitting about the corridors of power in Kyiv – trying to thrash out a ceasefire with Volodymyr Zelensky that would be acceptable to Donald Trump?\n\nThe answer to all these questions is Jonathan Powell. He is Tony Blair's former chief of staff who last November was appointed Britain's National Security Adviser by Sir Keir Starmer. Powell is the principal official adviser to the Prime Minister and Cabinet on national security matters, which is a very important job.\n\nHis was an arresting appointment in several ways, not least because, unlike his six predecessors in the role, he hadn't been a very senior civil servant. Powell was a junior diplomat when he was plucked out for stardom by Blair 30 years ago.\n\nHe became an effective Labour Party apparatchik, serving Blair for the entire ten years of his prime ministership. That was four years longer than his more high profile, and much less subtle, colleague – spin doctor Alastair Campbell.\n\nPowell is in the news – doubtless much to his discomfort – because yesterday's Mail on Sunday reported accusations that he is running a secret diplomatic back channel to terrorists and other dodgy characters using his own taxpayer-funded team of nameless operatives.\n\nA few years after he left No 10, Jonathan Powell founded an outfit called Inter Mediate, whose website says its mission is 'to advance political solutions toward a more peaceful and secure world'. Much of its work is rather less highfaluting than this statement implies.\n\nInter Mediate continues to receive funding from the Foreign Office for making contact with non-state armed groups even though its founder is now the National Security Adviser. He has formally stood down as the charity's £200,000-a-year chief executive.\n\nOne of the group's reported successes was to help establish links with the new Syrian government, paving the way for a visit to Damascus by Foreign Secretary David Lammy to meet recently installed President Ahmed al-Sharaa.\n\nUnfortunately, not everything is going according to plan. Inter Mediate's work is being undermined by a bloody conflict between Islamist Bedouin tribes and the Druze in the south of Syria.\n\nThere is of course nothing illegal, or even necessarily undesirable, about a so-called charity associated with Britain's National Security Adviser playing a behind the scenes role in UK foreign policy. But it is certainly a very rum state of affairs.\n\nEven rummer is the fact that Jonathan Powell, despite his important job, is classified as a 'special adviser'. This means he doesn't have to answer to Parliament even though he deals directly with foreign governments – for instance, when popping up in Ukraine and negotiating with Mauritius over the Chagos Islands.\n\nSuch unaccountability of course suits him perfectly. Most of his working life he has operated in the shadows, seldom having to give an explanation for his actions, still less having to justify them.\n\nAs Tony Blair's chief of staff, this serpentine creature was (along with Alastair Campbell) given unprecedented powers to issue orders to civil servants, including senior ones, despite the objections of the then head of the civil service.\n\nBut being neither a civil servant himself, nor of course an elected politician, Powell was able to avoid giving evidence to parliamentary committees. During his ten years at Tony Blair's side, he largely flew below the radar, making or being party to important decisions without being properly examined.\n\nFor example, he supported the efforts of Alastair Campbell in 'sexing up' the September 2002 dossier, which tried to make a case for war against Iraq on the grounds that Saddam Hussein possessed weapons of mass destruction. (He didn't.)\n\nOn one occasion, Powell wrote to Campbell and Sir John Scarlett, head of the Joint Intelligence Committee, who was charged with drawing up the dossier: 'I agree with Alastair you should drop the conclusion ... Alastair – what will be the headline in the Evening Standard on the day of publication? What do we want it to be?'\n\nPowell later told the Hutton Inquiry that he hadn't played a 'major role' in drafting the dossier. Arguably true, but he certainly exercised some influence over it.\n\nDespite his virtual immunity to parliamentary scrutiny, Jonathan Powell was chief British negotiator in Northern Ireland from 1997 to 2007. In this role, he and Blair secretly agreed to amnesties for more than 200 suspected IRA terrorists, though this was not revealed for many years.\n\nPowell nursed a soft spot for Martin McGuinness, chief of staff of the Provisional IRA during the Troubles and undoubtedly responsible for many murders. After McGuinness's death in 2017, Powell remembered him as 'likeable'. (Campbell went even further, tweeting that McGuinness was 'a good guy'.)\n\nIncredible though it sounds, as well as being a major figure in what was called Blair's 'sofa government', Powell was also responsible for raising funds for the Labour Party.\n\nHe nearly landed his master in the soup after approaching Formula One tycoon Bernie Ecclestone for contributions after Labour's 1997 election victory. Blair narrowly escaped corruption charges after the Government said it would seek an exemption for Formula One (which Ecclestone had backed) from an EU ban on tobacco advertising.\n\nJonathan Powell was undeniably an important figure in Blair's court, loyally doing what he thought his master wanted, while receiving much less media attention than the more confrontational and brutish Campbell.\n\nAnd now he's back. So too, as British ambassador in Washington, is Peter Mandelson, another Blairite acolyte. The two men probably wield more power in foreign affairs than the slow-footed David Lammy. To this degree, at least, New Labour is back.\n\nSince Powell and Mandelson are far more experienced, intelligent and well-informed than Lammy – as well as than most of those on Labour's unimpressive front bench – one might be tempted to welcome their return.\n\nBut Powell's reinstatement in particular is hard to take. How typical of the man\n\nthat the company he founded should be playing a mysterious, unofficial role in British foreign policy, possibly connecting the Foreign Office with some very dubious people.\n\nNor do I have any doubt that this veteran anti-Brexiteer is using his influence over Sir Keir Starmer, persuasively dripping his pro-EU propaganda into the Prime Minister's receptive ear.\n\nMore than anyone in modern politics, Powell has succeeded in wielding power without accountability. The extraordinary thing is that he has been allowed to get away with it.\n\nWhere will this elusive man turn up next? Someone must collar him. A fundamental axiom of democracy is that public figures should answer for their actions – and it's high time Jonathan Powell was made to do so.","summary":"Who is one of the most influential figures in the Labour Government and yet almost unknown to the British public?","url":"https://www.dailymail.co.uk/debate/article-14923109/Serpentine-creature-power-Starmer-forced-answer-actions-STEPHEN-GLOVER.html","image":"https://i.dailymail.co.uk/1s/2025/07/20/19/100472625-0-image-m-16_1753035208197.jpg","video":null,"publish_date":"2025-07-21 00:30:58","author":"Editor,Stephen Glover","authors":["Editor","Stephen Glover"],"language":"en","source_country":"gb","sentiment":0.047},{"id":343567912,"title":"Fury as Trump appears as 'superhero' in bizarre 'Golden Age' Instagram post","text":"US President Donald Trump and the White House have once again sparked outrage and ridicule with their latest Instagram post celebrating six months of Trump's second term . Trump was inaugurated as president for the second time on January 20 after winning the 2024 presidential election, and since then the White House's social media has become particularly \"memeified\". The image posted yesterday is reminiscent of a film poster with the US President as the lead character , with American tropes, including dollar bills and eagles, exploding behind him. The caption of the post reads: \"ATTENTION: TRUMP DIDN’T COME TO PLAY. Six months in. All gas. No brakes. The winning will continue. The deportations will continue. The memes will continue. \"THE GOLDEN AGE WILL CONTINUE!\" However, the post has garnered a lot of fury and ridicule in the comments. One of the top comments is: \"ALL OF THIS HAS BEEN ONLY SIX MONTHS???!!! we are lost...\" One disgruntled user commented: \"Thank you for ruining our lives heart emoji\". Further down the page, the criticism continues, with users expressing their views such as: \"Our taxes and bills have never been higher. How the hell is that winning??\" The picture itself seems to have caught the attention of some users, one wrote, \"I remember when the white house had class\", while another added, \"This is so beneath what I grew up being told the presidency stood for.\" One person quipped: \"This looks like a Juvenile Album Cover.\" One commenter wrote: \"As a non American this looks so embarrassing for the USA.\" This sparked a bit of a backlash, with some users telling the \"Non American\" to jog on from the White House's Instagram page. However, there was some agreement, stating: \"As an American, IT IS EMBARRASSING.\" Trump's recent woes regarding the alleged Epstein client list have also not gone unnoticed, with many commenters asking \"where is the list?\" This comes as Donald Trump has told his attorney general to “produce” more of the eagerly-anticipated ‘Epstein files’ after weeks of saying they were nonsense - and before that, being interested in them enough to talk about their release in an election campaign. Some believe the files could contain important information known by dead paedophile Jeffrey Epstein and now, in the latest development, Trump has asked for them to be unsealed. In a now-infamous 2002 New York magazine profile, Trump was quoted as saying: “I’ve known Jeff [Epstein] for 15 years. Terrific guy. He’s a lot of fun to be with. It is even said that he liked beautiful women as much as I do, and many of them are on the younger side.” For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","summary":"People across social media are baffled as to who is running the official White House Instagram account as they post insane superhero style cartoon picture of Donald Trump","url":"https://www.dailystar.co.uk/news/us-news/fury-trump-appears-superhero-bizarre-35588047","image":"https://i2-prod.dailystar.co.uk/article35584354.ece/ALTERNATES/s1200b/1_President-Trump-Departs-The-White-House-For-Pittsburgh.jpg","video":null,"publish_date":"2025-07-21 00:30:10","author":"Alexandra Snow","authors":["Alexandra Snow"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.17},{"id":343567850,"title":"Economic resilience — the Chinese way","text":"Pakistan’s most significant ally China has sprung another surprise on those who thought that US President Donald Trump’s tariff wars, leading to global trade tensions between Beijing and Washington, could slow down its economic rise. The 5.3 per cent year-on-year expansion in China’s economy during the first half of 2025 defies expectations and reinforces Beijing’s recovery momentum amid a volatile global environment.\n\nData released by China’s National Bureau of Statistics (NBS) last week showed that its GDP has reached $9.24 trillion between January and June. The second quarter grew by 5.2pc year-on-year and 1.1pc quarter-on-quarter — exceeding expectations of 0.9pc and signalling continued resilience despite domestic weakness.\n\nThis performance challenges pessimistic forecasts, underlining the strength of China’s industrial and export sectors, as industrial production, external demand, domestic consumption and targeted public investment were the main growth drivers, even though real estate and private investment remained soft. Analysts expect the momentum to continue, supported by government policy tools, further recovery in domestic demand, and export strength.\n\nWhile Q2 growth marks a modest slowdown from Q1, it reflects persistent dynamism in high-tech manufacturing and exports, aided by a temporary reprieve in US trade tensions. It also surpasses the full-year growth target of 5pc, reaffirming China’s status as a key global growth driver. The growth not only defied expectations but also highlights the heft and flexibility of the country’s manufacturing and export sector, despite a decade of trade turbulence with the US.\n\n Beijing boosts international confidence with its capacity to advance high-quality development amid continued global uncertainty\n\nThe first-half growth was led by a 6.4pc increase in industrial output and 7.2pc export growth. While shipments to the US fell 10.7pc, China expanded trade with the Association of Southeast Asian Nations, the European Union, and Africa. Services expanded by 5.5pc. Retail sales rose 5pc, up from 4.6pc in Q1, suggesting steady — though cautious — domestic demand. \n\nAlthough foreign direct investment (FDI) inflows dropped 13.2pc year-on-year to $49.93 billion, NBS officials described them as “structurally resilient”, with a shift toward long-term positioning rather than short-term capital flows.\n\nThe government has ramped up infrastructure investment, offered consumer subsidies, and pursued targeted monetary easing to cushion the economy from external shocks. Some analysts suggest broader deficit spending may be considered if growth loses steam in the second half. \n\nNBS Deputy Head Sheng Laiyun des-cribed the performance as a “hard-won achievement” in the face of global uncertainty, noting that proactive macroeconomic policies had sustained progress in several key areas.\n\nDespite strong headline numbers, China’s recovery remains uneven. Much of the growth so far has come from industrial activity and external demand rather than the domestic revival policymakers have been seeking. While consumption is improving, big-ticket and discretionary spending remain subdued. \n\nReal estate continues to drag on sentiment. Property investment declined 11.2pc in the first half, and new commercial housing sales continued to shrink. The sector’s downturn remains a significant headwind.\n\nThe underlying challenge remains to broaden the recovery beyond exports and state-led investment and into more resilient domestic consumption and private sector dynamism. Restoring confidence across households, businesses, and foreign investors will be crucial.\n\nChina’s stronger-than-expected first-half performance prompted several major financial institutions — including Morgan Stanley, Goldman Sachs, UBS, and Nomura — to upgrade their full-year forecasts. Most now expect GDP growth close to or above the government’s 5pc target.\n\nPhilippe Monnier, former executive director of the Greater Geneva-Berne area, said China’s adaptive policies and deep manufacturing base have allowed it to withstand the pressure of US tariff actions and maintain macroeconomic stability.\n\nChina’s second-quarter GDP came in slightly above market consensus amid mixed June activity data, reflecting the resilience of its exports amid the US-China trade conflicts, Goldman Sachs said in a recent report. With China’s real GDP growth still solid, Goldman Sachs does not think policymakers see an immediate need to launch broad-based, significant stimulus in the near term. “Instead, we expect incremental, targeted easing to help stem the property downturn and mitigate labour market pressures in the second half,” the report states.\n\nBeijing’s current focus remains on stabilising internal demand through consumer support, small business credit, and selective fiscal expansion. Such measures have helped insulate the economy from external shocks and support real-sector growth.\n\nJapan’s Jiji Press reported that China’s moderately accommodative monetary policy has shown results in supporting consumption and services. International observers also point to Beijing’s strategic push toward sectors such as artificial intelligence (AI), semiconductors, electric vehicles, and clean energy — all aimed at a more sustainable, consumption-led growth model.\n\nKarim Adel, head of the Cairo-based Al Adl Centre for Economic and Strategic Studies, argued that China’s proactive steps in 2025 have not only helped domestic stabilisation but also contributed to global economic momentum.\n\nAmid continued global uncertainty, China’s capacity to advance high-quality development while deepening its opening-up strategy has been a key factor in international confidence. As capital searches for relative safety, China’s performance has made it a focal point for investors and policymakers.\n\nStill, Chinese economists caution that the second half could prove more challenging. Wang Yiming, vice-chairman of the China Centre for International Economic Exchanges, noted that the recovery continues to be hindered by insufficient domestic demand, a sluggish property market, and persistently low prices in key sectors. He has emphasised the need to integrate demand-boosting efforts with structural reforms, particularly on the consumption side.\n\nIn the face of a complex international landscape and mounting challenges, China achieved steady economic growth in the first half of 2025, boosting confidence in global growth potential. By steadfastly advancing high-quality development and steadily expanding high-level opening-up, the Chinese economy has demonstrated strong resilience, providing a reliable driving force for global economic growth. \n\nWith GDP growth projected to outpace most major economies in 2025, China is set to reinforce its position as both a driver of global growth and a source of stability amid international uncertainties.\n\nPublished in Dawn, The Business and Finance Weekly, July 21st, 2025","summary":"Pakistan’s most significant ally China has sprung another surprise on those who thought that US President Donald Trump’s tariff wars, leading to global trade tensions between Beijing and Washington, could slow down its economic rise. The 5.3 per cent year-on-year expansion in China’s economy during the first half of 2025 defies expectations and reinforces Beijing’s recovery momentum amid a volatile global environment.\n\n\n\nData released by China’s National Bureau of Statistics (NBS) last week showed that its GDP has reached $9.24 trillion between January and June. The second quarter grew by 5.2pc year-on-year and 1.1pc quarter-on-quarter — exceeding expectations of 0.9pc and signalling continued resilience despite domestic weakness.\n\n\n\nThis performance challenges pessimistic forecasts, underlining the strength of China’s industrial and export sectors, as industrial production, external demand, domestic consumption and targeted public investment were the main growth drivers, even though real estate and private i","url":"https://www.dawn.com/news/1925390/economic-resilience-the-chinese-way","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-07-21 00:27:46","author":"Nasir Jamal","authors":["Nasir Jamal"],"language":"en","source_country":"pk","sentiment":-0.098},{"id":343569858,"title":"Scott Turner, HUD secretary and ex-Redskins player, backs Trump's pressure on Commanders to bring back moniker","text":"President Donald Trump received support from Department of Housing and Urban Development (HUD) Secretary Scott Turner amid the push for the Washington Commanders to ditch its current nickname in favor of the Redskins. Turner was an NFL defensive back for eight years. He played for the Washington Redskins, San Diego Chargers and Denver Broncos from 1995 to 2003 before he called it a career. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM He wrote a message in reply to Trump on Sunday. \"I played in the NFL and was drafted by the Washington Redskins. Not the ‘Washington Football Team’ or the ‘Commanders,’\" he wrote on X. \"@POTUS is right. It’s time to bring the Redskins’ name back.\" The Redskns selected Turner in the seventh round of the 1995 draft. He played three seasons in Washington. He had 106 tackles and five interceptions in his career. Trump put the blitz on the Commanders, and the Cleveland Guardians of MLB, on Sunday with two Truth Social posts. \"The Washington ‘Whatever’s’ should IMMEDIATELY change their name back to the Washington Redskins Football Team. There is a big clamoring for this,\" Trump wrote first. \"Likewise, the Cleveland Indians, one of the six original baseball teams, with a storied past. \"Our great Indian people, in massive numbers, want this to happen. Their heritage and prestige is systematically being taken away from them. Times are different now than they were three or four years ago. We are a Country of passion and common sense. OWNERS, GET IT DONE!!!\" Then, he threatened to put the Commanders’ deal to take over the old RFK Stadium site in jeopardy if they didn’t revert to the name. SUPER BOWL CHAMP SAYS HE'D ASK TRUMP TO HELP GET REDSKINS NICKNAME BACK \"My statement on the Washington Redskins has totally blown up, but only in a very positive way,\" Trump wrote in a second Truth Social post. \"I may put a restriction on them that if they don’t change the name back to the original ‘Washington Redskins,’ and get rid of the ridiculous moniker, ‘Washington Commanders,’ I won’t make a deal for them to build a Stadium in Washington. The Team would be much more valuable, and the Deal would be more exciting for everyone.\" Daniel Snyder changed Washington’s team name from the Washington Redskins to the Washington Football Team before the start of the 2020 season amid a summer of racial tensions. The team eventually became the Washington Commanders, and Snyder sold the team to Josh Harris. Fox News Digital reached out to the Commanders for comment. Harris has made clear he has no intention of changing the nickname again. Harris said on Fox News Channel’s \"Special Report\" in April that the team would not bring back the Redskins name even with plans to build a new stadium in Washington, D.C. \"The Commanders’ name actually has taken on an amazing kind of element in our building,\" Harris responded to Bret Baier’s question about the Redskins name coming back as part of this new stadium deal. \"So, the people that certain types of players that are tough, that love football, are delegated Commanders and Jayden [Daniels], for example, is a Commander, and they're ranked. CLICK HERE TO GET THE FOX NEWS APP \"And, you know, the business staff has gotten into it, and obviously, we're in a military city here. There's more military personnel than anywhere else, so we're kind of moving forward with the Commanders name, excited about that, and not looking back.\" Fox News’ Scott Thompson contributed to this report. Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Scott Turner, the HUD secretary and former Washington Redskins defensive back, backed President Donald Trump&apos;s push to change the Commanders&apos; nickname.","url":"https://www.foxnews.com/sports/scott-turner-hud-secretary-ex-redskins-player-backs-trumps-pressure-commanders-bring-back-moniker","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/scott-turner-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-21 00:27:37","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.091},{"id":343564606,"title":"World News | MoS Margherita Lands in Lesotho, Aims to Strengthen Bilateral Ties","text":"Maseru [Lesotho], July 21 (ANI): Minister of State for External Affairs Pabitra Margherita landed in Lesotho with an aim to strengthen bilateral relations.\nMargherita was welcomed by Thabang Lekhela, Principal Secretary for Foreign Affairs and International Relations of Lesotho.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn a post on X, he said, \"Landed in Maseru city of the Mountain Kingdom of Lesotho. Warmly welcomed by Mr. Thabang Lekhela, Principal Secretary, Foreign Affairs & International Relations of Lesotho. Looking forward to engaging the leadership to further strengthen bilateral relations.\"\nhttps://x.com/PmargheritaBJP/status/1946964491947868414\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nEarlier onhis previous visit to Eswatini, Margherita addressed the Indian diaspora, noting their contributions in building bilateral ties between the two nations.\nMargherita said that the diaspora helps further deepen the bilateral ties between India and Eswatini.\nIn a post on X, he said, \"Glad to meet the vibrant Indian diaspora in the Kingdom of Eswatini. Their valuable contributions continue to strengthen people-to-people connections and further deepen the bilateral ties between India and Eswatini.\"\nhttps://x.com/PmargheritaBJP/status/1946811415098179666\nAs per Indian High Commission in Eswatini, there is about a 3000-strong Indian community in Eswatini consisting of Indian-origin and Indian nationals. About 90 per cent of Indians community in Eswatini are from the State of Gujarat, belonging to Muslim community.\nEarlier on Sunday, Margherita handed over ICCR scholarship letters to 30 selected students from Eswatini and wished them great success.\nIn a post on X, he said, \"Pleasure to hand over ICCR scholarship letters to 30 selected students from the Kingdom of Eswatini. They are true ambassadors of goodwill and a living bridge of friendship between India and Eswatini. Wished them great success as they begin their academic journey in India.\"\nhttps://x.com/PmargheritaBJP/status/1946628781097271376\nMargherita visited the Royal Science and Technology Park in Eswatini which was built with Indian assistance.\nIn a post on X, Margherita said, \"Another milestone in the India-Eswatini development partnership. Visited the Royal Science and Technology Park in the Kingdom of Eswatini, built with a Government of India Line of Credit worth US$20 million.\"\nhttps://x.com/PmargheritaBJP/status/1946585503870152903\nMargherita visited Eswatini, where he engaged in fruitful discussions with King Mswati III and several ministers on Friday, deepening existing ties and exploring new areas of cooperation between the two nations. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Margherita was welcomed by Thabang Lekhela, Principal Secretary Foreign Affairs and International Relations of Lesotho.","url":"https://www.latestly.com/agency-news/world-news-mos-margherita-lands-in-lesotho-aims-to-strengthen-bilateral-ties-7009676.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720204123.jpg","video":null,"publish_date":"2025-07-21 00:20:20","author":null,"language":"en","source_country":"in","sentiment":-0.04},{"id":343566742,"title":"Votes at 16? We can't even pick Keir Starmer out of a line-up! Teens are wary of voting at next General Election - but they do know who Nigel Farage is","text":"Youngsters set to be given the right to vote in the next General Election have showcased a shocking lack of knowledge about the UK's political leaders. \n\nSir Keir Starmer announced plans on Wednesday to lower the England's voting age from 18 to 16, which could see around 1.5million more teens able to cast their vote when the nation next heads to the polls. \n\nThe move, a manifesto pledge from the party, has been criticised as a cynical ploy since a large proportion of young voters support Labour.\n\nBut, opposition parties may be able to blow a sigh of relief after MailOnline went out and quizzed prospective teen voters on their knowledge of the UK political landscape - with some shocking results.\n\nWhile a majority of the teenagers interviewed were able to tell us the Prime Minister's name, some didn't know who he was when shown an image of him.\n\nEven worse for Labour, even fewer were able to name the deputy Prime Minister Angela Rayner or Chancellor Rachel Reeves when shown pictures of them.\n\nBut it's not necessarily good news for the Tories - just two were able to identify Conservative leader Kemi Badenoch. \n\nInstead, it was Reform UK leader Nigel Farage who came out on top - with an overwhelming number of youngsters able to identify who he was when shown a picture of him.\n\nMailOnline visited the streets of Newcastle and Cambridge earlier this week to find out how much prospective teen votes know about the figureheads of UK politics. \n\nThe youngsters were shown pictures of Keir Starmer, Nigel Farage, Kemi Badenoch, Ed Davey, Rachel Reeves and Angela Rayner.\n\nIn Newcastle, Nigel Farage was the most recognisable with four out five teens able to name him.\n\nDominic Carlyle, 13, from Jarrow, South Tyneside, knew both Keir Starmer and Nigel Farage from their pictures.\n\nHe said: 'Keir Starmer is the Prime Minister but I don't know who the leader of the opposition is.\n\n'I thought it was Rishi Sunak. I've seen Ed Davey before but I don't know who he is.\n\n'I would bring in laws to stop smoking. I want to completely get rid of cigarettes. I would tax them more to get rid of them.\n\n'There isn't anything else that I would want to change and I don't have an interest in any specific areas in politics. \n\n'I will be voting when I'm over 16. Some 16-year-olds don't know much about politics so won't be able to use their vote properly.\n\n'Schools should be teaching us more about politics. We never really get taught about it, it's only older children in sixth form who choose to study it.'\n\nOlive Irving, 14, from Gateshead, wasn't able to name any of the politicians pictured. She said: 'If I could introduce a policy, I would make school holidays longer.\n\n'I'm not really into politics, but I know that Keir Starmer is the Prime Minister.\n\n'I barely know any politicians. I know their names, but not their faces. I know Farage's name as well as Ed Davey's name.\n\n'I know who the chancellor is because my mam showed me a picture of her crying in the Commons.\n\n'People thought she was going to get fired and she started crying about it.\n\n'A lot of kids will vote for who their friends want to vote for or they won't actually look into politics and vote for who they like the look of. \n\n'I will use my vote but I will look at their policies and do my own research.\n\n'We are taught useless things in school that we won't need in ten years, like algebra, instead of proper things like politics.\n\n'I'm never going to use algebra so I don't know why we're taught that.'\n\nEloise Lincoln, 14, from Newcastle, correctly identified Keir Starmer, Nigel Farage and Ed Davey. She said: 'I would want the government to introduce more policies about the environment such as lowering emissions.\n\n'Lowering the voting age could be a good policy but there are a lot of younger people who are influenced by the internet.\n\n'They may not actually know much about politics but go off what they see online.\n\n'They should teach us more in schools if they are lowering the voting age. I would use my vote at 16 but I would do my research.'\n\nOlivia Connon, 15, from Newcastle, correctly identified Keir Starmer, Nigel Farage and Kemi Badenoch. She said: 'I know a bit about politics but not enough. \n\n'I would vote if I was 16 but you have to investigate first about what the policies are.\n\n'I met Rishi Sunak once, we talked about ice cream but he said his favourite flavour was vanilla, which is boring. He didn't get any syrups or flakes in it.\n\n'I know that Keir Starmer is the Prime Minister but I didn't know that Kemi Badenoch was the leader of the Conservatives.\n\n'I don't know much about current policies but if I could bring one law in it would be something to help people have more access to healthcare, as we need more funding in the NHS.\n\n'If the voting age was lowered now it wouldn't be very good because people wouldn't know what they were doing. We need more education on politics.'\n\nMegan Wilson, 15, from Gateshead, correctly named Nigel Farage in the picture quiz.\n\nShe said: 'The voting age should be 18, 16 is too low. People would make stupid decisions or waste their vote.\n\n'There isn't enough education about politics in schools. You only go over it once or twice so you don't learn it properly. \n\n'I turn 16 early into the school year, I'm one of the oldest in my class so I would be voting while doing GCSEs.\n\n'When you're 18, you know a lot more about the world and probably have a job or have been through college. You have more life experience. \n\n'All my friends think it's a stupid decision to lower it because there are already debates about people voting at the age of 18.\n\n'I don't know much about tax or policies. I know we pay tax but that's it. \n\n'My mam votes but I wouldn't, even if the age is being lowered to 16.\n\n'Keir Starmer is the Prime Minister but I don't know who the leader of the opposition is. I don't know much about current policies but if I could bring in legislation I would want to split the six weeks holidays up.\n\n'It's too long, I get bored half way through. I would want four weeks and then another two somewhere else in the year.' \n\nMeanwhile in Cambridge, MailOnline spoke to several 16 and 17 year olds, who despite being older than those interviewed in Newcastle, were only marginally more knowledgeable of the UK's political leaders. \n\nOnly one person was able to identify who the leader of the opposition was (Kemi Badenoch), with two people thinking it was the former Home Secretary Priti Patel.\n\nBut, much to the Prime Minister's relief, all of the people interviewed were able to identify Keir Starmer. \n\nCollege student Charlotte Templar, 17, is a Green Party campaigner and was for the voting age being lowered.\n\nShe said: 'The main argument against it is that 16-year-olds aren't informed enough to vote but that can be applied for people aged 18/20/22.\n\n'You are affected by all things at that age and it will make more people want to vote and it will help move away from older people having all the power to make decisions that will affect younger people for longer.\n\n'I feel like I'm old enough to vote and it has been proven in Scotland that it does work.\n\n'Everyone should know what the parties stand for - it should be the school and the parent's responsibility.\n\n'Some might say young people will do 'joke' votes [where they vote for a party unseriously because they think it is funny] but I don't think it would be a large enough amount of people to make a difference. No one says that about university students.' \n\nJack, 17, said he thought his generation was the 'most politically aware'.\n\nHe said: 'Realistically 16-year-olds are capable for making a choice like any other eighteen or nineteen year olds.\n\n'If a 50-year-old man votes for Nigel Farage because he thinks he's funny then there shouldn't be a discussion as to whether sixteen-year-olds are mature enough or not.'\n\nZosia, 17, said she was worried about 'joke' voting. She said: 'People will make 'joke' votes for parties like Reform. They could be under the influence of adults around them or their friends.\n\n'At 18, you're only just beginning to experience your life like you are at 16.'\n\nMikayla, 17, added: 'I think people are going to be influenced by social media and who their friends are voting for.'\n\nChloe, 17, said she agreed the voting age should be lowered.\n\nThe A-Level politics student said: 'You can pay tax and get married - the only difference really at 18 is that you can buy alcohol. \n\n'Politics isn't really taught in school in as much depth as it should be.\n\n'Hopefully it would make people more interested in politics and understand why it matters to them.'\n\nFriend Hannah, also 17, said: 'The general election affects everyone who is 16.\n\n'I'd like to see them focus more on the environment - it always come second to most things.'\n\nSophie McArthur, 17, said she didn't think lowering the voting age was a good thing.\n\nThe college student said she was worried about boys in particular being influenced online and how other people's views could affect them.\n\nShe said: 'Young people are influenced by the media and there are certain sides of TikTok which can not be a very good thing for people who are impressionable or not mature enough.\n\n'I know people who like Charlie Kirk - these are boys who are like \"red pill\". It makes you worry about the decisions they'll make if they could vote and who for.' \n\nCharlie Kirk is an American political activist who rose to prominence as the founder of Turning Point USA - a ring-wing student organisation aligned with Donald Trump - and spoke at the Cambridge Union in May.\n\nGabriella Giussali, also 17, agreed. She said: 'Some people are too young to form that opinion and be able to vote. There are a lot of people who understand politics and lots of people who don't.'\n\nLucia Browne, 17, said she wasn't 'confident' people at her age would make the 'right' decision.\n\nShe said: 'Social media means a lot of people are influenced and I think there's a different across the country as to how young people will vote.\n\n'You only pay national insurance at 16 so you don't really know a lot about how things work. We're not at the age where we should be dictating government policy.'\n\nJulia, 18, visiting from Sweden said: 'I don't think it's a good idea. In Sweden it is 18 and you get more into politics as you get older, meet more people. When you work, you begin to understand people.\n\n'It is too big of a power for a young age. I'd raise it to 20.'\n\nSylwester, 16, also from Sweden added: 'People aren't experienced enough. I'd say 18 is the best age.","summary":"Youngsters (pictured) set to be given the right to vote in the next General Election have showcased a shocking lack of knowledge about the UK's political leaders.","url":"https://www.dailymail.co.uk/news/article-14921087/Votes-16-pick-Keir-Starmer-line-Teens-voting-General-Election-know-Nigel-Farage.html","image":"https://i.dailymail.co.uk/1s/2025/07/19/15/100454249-0-image-m-13_1752935128162.jpg","video":null,"publish_date":"2025-07-21 00:18:54","author":"Dan Woodland,Editor","authors":["Dan Woodland","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.083},{"id":343567236,"title":"Off-duty border patrol agent shot in apparent random robbery in NYC park, police say","text":"An off-duty Customs and Border Patrol agent was shot in New York City's Riverside Park late Saturday in an alleged robbery that did not appear to target him because of his job, police said. Miguel Mora, 21, is being investigated as a person of interest in the attempted robbery and shooting, New York Police Commissioner Jessica Tisch said at a news conference Sunday. He was hospitalized with gunshot wounds investigators believe he sustained during the incident but was expected to be arrested later Sunday, Tisch said. Two law enforcement sources told NBC News that the encounter appeared to be random and that it was an attempted robbery. Tisch said the CBP agent was sitting on the rocks along the water in the Manhattan park when two men rode up to him on a scooter and one got off, approaching him from behind. One of the men took out a gun, at which point the agent realized he was being robbed and took out his own firearm in defense, Tisch said. The gunman fired at the agent, who returned fire, she said. The CBP agent was hit in the face and a forearm, Tisch said. Mayor Eric Adams said he had visited the agent in the hospital as he recovers with family. His condition was unknown. The gunman was also injured, Tisch said. He and his accomplice fled. The incident was caught on CCTV, allowing detectives to match Mora with the person shown firing at the CBP agent, Tisch said. Mora went to Bronx Care Hospital after midnight with gunshot wounds to the groin and a leg consistent with those sustained by the person who shot the agent, Tisch said, citing the security video. Trump highlights shooter's immigration status Adams said Mora is known by law enforcement and has had repeated and violent past encounters with officials. Tisch said Mora is also in the United States illegally, having entered through Arizona in 2023. He has two previous arrests for domestic violence in New York and an active warrant after he did not show up in court in one of those cases, Tisch said. Mora was also wanted by New York police in connection with an alleged robbery in December and an alleged stabbing in January, she said. Mora was in police custody at Lincoln Hospital, where he had surgery, Tisch said. Adams said of Mora at the news conference Sunday: \"In less than one year, he has inflicted violence in our city. And once he is charged for last night's crimes, we will be able to add attempted murder to his rap sheet.\" President Donald Trump called the person of interest an \"Illegal Alien Monster\" on Truth Social on Sunday and said Democrats \"have flooded our Nation with Criminal Invaders.\" Homeland Security Secretary Kristi Noem said on X that Mora is from the Dominican Republic. Trump has long highlighted crimes committed by undocumented migrants as reasons for harsh immigration crackdowns, despite evidence showing that the undocumented population commits fewer crimes than natural-born U.S. citizens. Expert analysis and available data from major-city police departments reviewed by NBC News last year showed that despite some high-profile incidents, there was no evidence of a migrant-driven crime wave in the United States. In December 2020, researchers studying Texas crime statistics found that “contrary to public perception, we observe considerably lower felony arrest rates among undocumented immigrants compared to legal immigrants and native-born U.S. citizens and find no evidence that undocumented criminality has increased in recent years.” In the first months of his second term, Trump and his administration have been cracking down on arrests of undocumented immigrants, with promises to deport violent criminals. Most of those in immigration custody, however, do not have criminal records, data shows. As of June, after six months of aggressive immigration enforcement, only a small fraction of undocumented immigrants known by Immigration and Customs Enforcement officers as having been convicted of sexual assault and homicide had been arrested, internal ICE data obtained by NBC News showed. From Oct. 1 through May 31, 185,042 people were arrested and booked into ICE facilities. Of that group, 65,041 had been convicted of crimes, the data showed. Other ICE data showed that nearly half of those in ICE custody had neither been convicted of nor been charged with any crime.","summary":"An off-duty Customs and Border Patrol agent was shot in New York City's Riverside Park late Saturday in an alleged robbery that did not appear to target him because of his job, police said","url":"https://www.nbcnews.com/news/us-news/off-duty-border-patrol-agent-shot-random-robbery-nyc-park-rcna219905","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-07/25720-cbp-agent-shooting-rc-804p-7f65cf.jpg","video":null,"publish_date":"2025-07-21 00:11:15","author":"Jonathan Dienst,Rebecca Cohen","authors":["Jonathan Dienst","Rebecca Cohen"],"language":"en","category":"politics","source_country":"na","sentiment":-0.412},{"id":343564602,"title":"World News | MoS Margherita Acknowledges Diaspora's Contributions in Eswatini","text":"Lobamba [Eswatini], July 21 (ANI): Minister of State for External Affairs Pabitra Margherita addressed the Indian diaspora in Eswatini, noting their contributions in building bilateral ties between both nations.\nMargherita said that the diaspora helps further deepen the bilateral ties between India and Eswatini.\nAlso Read | Donald Trump Tariffs: South Korea's National Security Adviser Wi Sung-Lac Departs for US Ahead of Tariff Deadline.\nIn a post on X, he said, \"Glad to meet the vibrant Indian diaspora in the Kingdom of Eswatini. Their valuable contributions continue to strengthen people-to-people connections and further deepen the bilateral ties between India and Eswatini.\"\nhttps://x.com/PmargheritaBJP/status/1946811415098179666\nAlso Read | Germany Car Accident: 2 Seriously Injured As Vehicle Veers Off Road, Hits 7-Year-Old Boy and Crashes Into Barn's Roof in Bohmte; Pics and Video Surface.\nAs per the Indian High Commission in Eswatini, there is about a 3000-strong Indian community in Eswatini consisting of Indian-origin and Indian nationals. About 90 per cent of the Indian community in Eswatini are from the State of Gujarat, belonging to the Muslim community.\nEarlier on Sunday, Margherita handed over ICCR scholarship letters to 30 selected students from Eswatini and wished them great success.\nIn a post on X, he said, \"Pleasure to hand over ICCR scholarship letters to 30 selected students from the Kingdom of Eswatini. They are true ambassadors of goodwill and a living bridge of friendship between India and Eswatini. Wished them great success as they begin their academic journey in India.\"\nhttps://x.com/PmargheritaBJP/status/1946628781097271376\nMargherita visited the Royal Science and Technology Park in Eswatini which was built with Indian assistance.\nMargherita said that it was a milestone in the India-Eswatini development partnership.\nIn a post on X, Margherita said, \"Another milestone in the India-Eswatini development partnership. Visited the Royal Science and Technology Park in the Kingdom of Eswatini, built with a Government of India Line of Credit worth US$20 million.\"\nhttps://x.com/PmargheritaBJP/status/1946585503870152903\nMargherita held talks with Prince Lonkhokhela, Minister of Natural Resources and Energy, Eswatini, on Saturday.\nThe two held talks on increasing cooperation in the energy sector.\nIn a post on X, Margherita said, \"Glad to meet HRH Prince Lonkhokhela, Hon'ble Minister of Natural Resources & Energy, Kingdom of Eswatini. Discussed ways to increase cooperation in the energy sector.\"\nhttps://x.com/PmargheritaBJP/status/1946532204621762935\nMargherita visited Eswatini, where he engaged in fruitful discussions with King Mswati III and several ministers on Friday, deepening existing ties and exploring new areas of cooperation between the two nations. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Margherita said that the diaspora helps further deepen the bilateral ties between India and Eswatini.","url":"https://www.latestly.com/agency-news/world-news-mos-margherita-acknowledges-diasporas-contributions-in-eswatini-7009668.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250720193546.jpg","video":null,"publish_date":"2025-07-21 00:10:20","author":null,"language":"en","source_country":"in","sentiment":-0.071},{"id":343572824,"title":"Marcos in US to boost economic, security ties","text":"President Ferdinand R. Marcos Jr. has arrived in Washington, D.C. for a three-day official visit aimed at deepening the strategic partnership between the Philippines and the United States, with a focus on economic cooperation and regional security, Malacañang said Monday. Touching down at Joint Base Andrews at 2:48 p.m. local time, Marcos was welcomed by Philippine Ambassador to the U.S. Jose Manuel Romualdez and U.S. Ambassador to the Philippines MaryKay Carlson. Marcos is the first Southeast Asian leader to meet with U.S. President Donald Trump since the start of the latter’s second term in January. Before departing Manila, Marcos emphasized the critical importance of the visit in reaffirming the long-standing alliance between the two nations. He underscored shared goals such as enhancing defense ties, promoting trade and investment, and ensuring lasting peace and stability in the Indo-Pacific region. “President Marcos' visit signals a shared intent to expand Philippine-U.S. partnership, which is built on decades of cooperation and anchored in mutual respect, prosperity, and regional stability,” Malacañag said.","summary":"","url":"https://tribune.net.ph/2025/07/21/marcos-arrives-in-washington-eyes-boosting-phl-us-economic-security-ties","image":"https://media.assettype.com/tribune/2025-07-21/fuhmysdd/5226385031159485299537528852920166324736252n.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-07-21 00:07:59","author":"Lade Jean Kabagani","authors":["Lade Jean Kabagani"],"language":"en","source_country":"ph","sentiment":0.249},{"id":343562294,"title":"Cleveland Guardians risk Donald Trump fury with response to his call to return to 'Indians' name","text":"The Cleveland Guardians have no intention of reverting to their former 'Indians' name, despite passionate calls from Donald Trump on Sunday to do just that.\n\nTrump fired out messages on truth social aimed at the Guardians and Washington Commanders, threatening to block to NFL team's stadium move if they didn't return to their old 'Redskins' name.\n\nBut despite the President's demands, the baseball side will apparently be staying with their new name.\n\n'I understand there are very different perspectives on the decision we made a few years ago,' Guardians president Chris Antonetti said in a statement.\n\n'But it’s a decision we’ve made and we’ve gotten the opportunity to build the brand as the Guardians over the last four years and we’re excited about the future that’s in front of us.'\n\nCleveland announced in December 2020 that the team would drop its 'Indians' nickname, announcing the switch to 'Guardians' the following year. \n\nThe comments from Antonetti risk upsetting the President, given the passion with which he outlined his case.\n\n'The Owner of the Cleveland Baseball Team, Matt Dolan, who is very political, has lost three Elections in a row because of that ridiculous name change,' Trump wrote on Truth Social.\n\n'What he doesn't understand is that if he changed the name back to the Cleveland Indians, he might actually win an Election. Indians are being treated very unfairly. MAKE INDIANS GREAT AGAIN (MIGA)!'\n\nMatt Dolan is actually no longer involved in the running of the Guardians franchise but was was twice a candidate in the Ohio Senate elections in 2022 and 2024, losing on both occasions. \n\nAfter venting about the NFL team in DC, Trump had earlier said of the baseball team: 'Likewise, the Cleveland Indians, one of the six original baseball teams, with a storied past. Our great Indian people, in massive numbers, want this to happen. \n\n'Their heritage and prestige is systematically being taken away from them. Times are different now than they were three or four years ago. We are a Country of passion and common sense. OWNERS, GET IT DONE!'\n\nBut while the Guardians are resisting the calls from Trump, he might have more leverage over the Washington Commanders.\n\nIn a later post Sunday, Trump said he may veto their stadium move back towards DC if the organization wants to continue with their present name.\n\n'My statement on the Washington Redskins has totally blown up, but only in a very positive way,' Trump wrote.\n\n'I may put a restriction on them that if they don’t change the name back to the original ‘Washington Redskins,’ and get rid of the ridiculous moniker, ‘Washington Commanders,’ I won’t make a deal for them to build a Stadium in Washington.","summary":"Trump fired out messages aimed at the Guardians and Washington Commanders, threatening to block to NFL team's stadium move if they didn't return to their old name.","url":"https://www.dailymail.co.uk/sport/mlb/article-14923827/Cleveland-Guardians-risk-Donald-Trump-fury-return-Indians-name.html","image":"https://i.dailymail.co.uk/1s/2025/07/21/00/100478153-0-image-m-32_1753054832695.jpg","video":null,"publish_date":"2025-07-21 00:00:12","author":"Editor,Jack Bezants","authors":["Editor","Jack Bezants"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.324},{"id":343567702,"title":"U.S. vs Hong Kong Stablecoin Regulation: A Battle For Global Dominance","text":"TOPSHOT - US President Donald Trump displays the GENIUS Act (Guiding and Establishing National ... More Innovation for US Stablecoins Act), which codifies the use of stablecoins — cryptocurrencies pegged to stable assets like the US dollar or US bonds — after signing it in the East Room of the White House in Washington, DC, on July 18, 2025. (Photo by Brendan SMIALOWSKI / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images)\nAFP via Getty Images\n\nThe global stablecoin market, surpassing $250 billion, is being reshaped by regulatory frameworks that will define competition and innovation. The U.S.’s Guiding and Establishing National Innovation for U.S. Stablecoins Act (GENIUS Act), passed by the House and signed into law by President Trump on July 18, 2025, and Hong Kong’s Stablecoins Ordinance, enacted on May 21, 2025, and effective August 1, 2025, present contrasting approaches to governing fiat-referenced stablecoins. As an industry practitioner immersed in global policy and market dynamics, I am closely observing how these regulations will influence issuers, investors, and geopolitical strategies. Let’s take an analytic look at their competitive impact, spotlighting Hong Kong’s role in advancing China’s Belt and Road Initiative (BRI) through stablecoin adoption in Global South economies.\n\nRegulatory Frameworks: Contrasting Visions\n\nThe U.S. GENIUS Act establishes a tiered regulatory structure. Issuers with over $10 billion in circulation face federal oversight by the Office of the Comptroller of the Currency (OCC) or banking regulators, while smaller issuers can opt for state-level regulation, subject to Treasury approval. Reserves must be 1:1 backed by high-quality liquid assets (e.g., U.S. Treasuries ≤ 93 days, cash), with bans on yield-bearing stablecoins and lending activities. AML/KYC compliance under the Bank Secrecy Act is stringent, with penalties up to $100,000 per day for violations.\n\nHong Kong’s Stablecoins Ordinance, part of the LEAP framework (Licensing, Education, Application, Protection), requires issuers to be locally incorporated with a minimum capital of HKD 25 million (USD 3.2 million), though banks are exempt. Reserves must be 1:1 backed by liquid assets, with the flexibility to issue stablecoins pegged to any official currency, such as HKD, USD, or offshore RMB, leveraging Hong Kong’s currency peg. The Ordinance focuses on fiat-referenced stablecoins (FRS), excluding algorithmic stablecoins due to their lack of effective stabilization mechanisms, aligning with Financial Stability Board recommendations. AML/CFT requirements meet FATF standards, with penalties up to HKD 5 million (USD 640,000) and seven years’ imprisonment.\n\nCompetitive Impact: Consolidation vs. Selective Innovation\n\nU.S.: Consolidation and Dollar Dominance\n\nThe GENIUS Act prioritizes financial stability and U.S. dollar dominance, creating a high-compliance environment that favours large issuers like Circle (USDC). Federal oversight for issuers exceeding $10 billion, coupled with costly AML/KYC and audit requirements (estimated at $5M–$10M annually), drives market consolidation. For a $100 million issuance, a 0.5% operational cost equals $500,000 in expenses, challenging smaller issuers’ profitability without significant scale.\n\nPhoto by Jakub Porzycki/NurPhoto via Getty Images\nNurPhoto via Getty Images\n\nMORE FOR YOU\n\nThe ban on algorithmic stablecoins and restrictions on high-risk activities, such as lending, limit DeFi innovation, pushing issuers toward a banking-like model. This constrains growth loops in retail adoption but attracts institutional players, leveraging the U.S.’s leading position in the stablecoin market, driven by USD-pegged tokens like USDC and USDT. Requiring U.S. Treasuries in reserves aligns with national interests, boosting government borrowing power. However, high costs and lack of international coordination risk regulatory arbitrage, with issuers eyeing more flexible jurisdictions like Hong Kong and the UAE.\n\nHong Kong: Selective Innovation and Regional Hub\n\nHong Kong’s Stablecoins Ordinance balances compliance with innovation but favours larger issuers. The HKMA’s plan to issue a “single-digit” number of licenses in 2025, as stated by Secretary Christopher Hui, signals a selective process prioritizing well-capitalized firms with robust compliance frameworks. While the HKD 25 million capital threshold is accessible, compliance costs (0.3%–0.5% of issuance, e.g., HKD 3M–5M for a $100M stablecoin) and stringent licensing criteria (e.g., monthly audits, AML/CFT) challenge smaller issuers, limiting their competitiveness. The exclusion of algorithmic stablecoins and lack of support for DeFi applications focus innovation on fiat-backed models, such as tokenized bonds and real-world asset (RWA) tokenization under LEAP’s application pillar.\n\nPhoto by Chen Yongnuo/China News Service/VCG via Getty Images\nChina News Service via Getty Images\n\nThe Ordinance’s flexibility to issue stablecoins pegged to any official currency, including HKD, USD, or offshore RMB, enhances Hong Kong’s competitiveness, attracting issuers targeting Asia-Pacific and global markets. This aligns with China’s BRI by facilitating cross-border transactions in multiple currencies. The Bill’s clarity and FATF-aligned standards position Hong Kong as a compliant hub, competing with Singapore and the UAE. However, the local incorporation requirement and selective licensing may deter smaller foreign firms, favouring established players with regional presence.\n\nGeopolitical Implications\n\nU.S. Dollar Dominance through Stablecoins\n\nThe GENIUS Act is a strategic tool to extend U.S. dollar dominance into the digital realm, reinforcing the dollar’s role as the world’s reserve currency. By mandating that stablecoin reserves be backed 1:1 by high-quality liquid assets, primarily U.S. Treasury bills and cash, the Act ensures that USD-pegged stablecoins, which dominate over 90% of the $250 billion market, directly bolster U.S. government debt. For example, a $100 billion stablecoin issuance backed by Treasuries increases demand for U.S. debt, effectively funding government borrowing. This creates a powerful feedback loop: as stablecoin adoption grows for cross-border payments and digital transactions, so does the global demand for USD and Treasuries, cementing U.S. financial hegemony.\n\nThis strategy, however, has triggered global pushback. The requirement for USD stablecoin holders - whether individuals, businesses, or institutions - to indirectly finance U.S. debt via Treasury-backed reserves is viewed unfavourably in jurisdictions seeking monetary sovereignty. Countries are countering with their own stablecoin regimes to promote local currency-pegged tokens:\n\nHong Kong’s Ordinance allows stablecoins pegged to any currency, including the offshore RMB\n\nSingapore’s Single-Currency Stablecoin (SCS) Framework licensing prioritizes SGD-pegged stablecoins\n\nBahrain’s framework (July 4, 2025) supports dinar-pegged tokens\n\nSouth Korea’s June 2025 proposal encourages won-pegged stablecoins\n\nJapan’s June 2023 Payment Services Act promotes yen-backed stable tokens\n\nThe UAE’s September 2024 framework fosters dirham-pegged payment tokens\n\nKazakhstan is piloting a tenge-pegged stablecoin, with regulations expected by late 2025\n\nThe UK is drafting rules (due Q4 2025) for GBP-pegged stablecoins.\n\nThese regimes aim to protect sovereign currencies and assert financial autonomy in a digital transaction world increasingly powered by US dollar backed stablecoins.\n\nHong Kong and the Belt and Road\n\nHong Kong’s stablecoin framework can be seen as an extension for China’s Belt and Road Initiative (BRI), a $1 trillion infrastructure and trade network spanning 150+ countries, particularly in the Global South. Stablecoins offer a transformative solution for cross-border payments, which often incur 5%–7% fees in BRI corridors. A $10 million trade settlement via HKD-, USD-, or RMB-pegged stablecoins could save $500,000, enhancing efficiency for projects like ports in Pakistan, railways in Kenya, or energy hubs in Indonesia. By enabling stablecoin issuance in multiple currencies, including the offshore RMB, Hong Kong strengthens China’s financial influence in regions with volatile local currencies, supporting BRI’s goal of fostering trade and investment.\n\nStablecoins also advance BRI’s digital transformation objectives. In Global South economies, where trust in local banking systems is low, regulated stablecoins provide a stable medium for trade, remittances, and project financing. For instance, African exporters or Southeast Asian SMEs could use RMB- or USD-pegged stablecoins for instant, low-cost transactions, reducing reliance on Western financial networks. The LEAP framework’s education pillar promotes blockchain literacy, while its application pillar encourages tokenized asset adoption, positioning Hong Kong as a financial bridge between China and BRI partners. Potential integration with China’s digital yuan could create hybrid payment systems, amplifying China’s role in global digital finance and challenging U.S. dominance.\n\nConclusion: Navigating a Fractured Digital Financial Future\n\nThe U.S. GENIUS Act, signed into law on July 18, 2025, and Hong Kong’s Stablecoins Ordinance, effective August 1, 2025, represent divergent paths in the global stablecoin race. The U.S. drives market consolidation and dollar dominance through leveraging USD-pegged stablecoins’ market leadership and tying stablecoin reserves to U.S. Treasuries strengthens its financial hegemony, though global pushback from different jurisdictions may signal a general shift toward sovereign stablecoin regimes.\n\nHong Kong’s selective licensing favours established issuers, with its flexibility to peg stablecoins to any currency, including the offshore RMB, enhancing its role as a BRI-driven hub. This multi-currency approach positions Hong Kong to capture Asia-Pacific markets and support China’s global financial ambitions.\n\nIssuers face a stark choice: navigate the U.S.’s rigid but dominant market or Hong Kong’s selective yet innovative ecosystem. As stablecoins reshape global finance, this regulatory rivalry underscores a broader battle for digital currency supremacy, with profound implications for economic sovereignty and cross-border trade.\n\nThe author is an advisor to the Crypto Council for Innovation, and advisor to the Stablecoin Standard.\n\nEditorial StandardsReprints & Permissions","summary":"The U.S. GENIUS Act, signed into law on July 18 2025, and Hong Kong’s Stablecoins Ordinance, effective August 1, represent divergent paths in the global stablecoin race.","url":"https://www.forbes.com/sites/digital-assets/2025/07/20/us-vs-hong-kong-stablecoin-regulation-a-battle-for-global-dominance/","image":"https://imageio.forbes.com/specials-images/imageserve/687c95ae46fff60a196adda8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-07-21 00:00:00","author":"Brendan Smialowski,Contributor,Sean Lee","authors":["Brendan Smialowski","Contributor","Sean Lee"],"language":"en","source_country":"US","sentiment":0.232},{"id":343561292,"title":"Ellen DeGeneres blames Trump for her US exodus","text":"Ellen DeGeneres left the United States last year following Donald Trump's successful bid to return to the White House during the 2024 presidential election. DeGeneres, 67, and wife Portia de Rossi sold their Montecito estate in August and purchased a farmhouse in the U.K. The move was initially slated as a part-time adventure where the couple could enjoy a few months of the year across the pond, but the comedian made things more permanent after Trump won the November elections. \"We got here the day before the election and woke up to lots of texts from our friends with crying emojis, and I was like, 'He got in',\" she told broadcaster Richard Bacon during her first U.K. appearance since moving, per the BBC. \"And we're like, 'We're staying here.'\" ELLEN DEGENERES BACKS ROSIE O'DONNELL AFTER TRUMP THREATENED TO REVOKE HER U.S. CITIZENSHIP She's remained relatively private about her new life in the English countryside, but keeps fans updated about farm living on social media. \"It's absolutely beautiful,\" she said. \"We're just not used to seeing this kind of beauty. The villages and the towns and the architecture – everything you see is charming and it's just a simpler way of life. It's clean. Everything here is just better – the way animals are treated, people are polite. I just love it here.\" The former talk show host added, \"We moved here in November, which was not the ideal time, but I saw snow for the first time in my life. We love it here. Portia flew her horses here, and I have chickens, and we had sheep for about two weeks.\" View this post on Instagram A post shared by Ellen DeGeneres (@ellendegeneres) APP USERS CLICK HERE TO VIEW POST View this post on Instagram A post shared by Ellen DeGeneres (@ellendegeneres) APP USERS CLICK HERE TO VIEW POST DeGeneres recently threw her support toward fellow comedian, Rosie O'Donnell, who also fled the United States following Trump's election. ELLEN DEGENERES SHOWS OFF ENGLISH COUNTRYSIDE HOME AS SHEEP INVADE THROUGH OPEN DOOR One day after the president threatened to revoke O'Donnell's U.S. citizenship following her move to Ireland earlier this year, DeGeneres gave Rosie a public shout out. \"Good for you,\" DeGeneres wrote atop a reposed image of Trump's threat and O'Donnell's lengthy response on Instagram. View this post on Instagram A post shared by Ellen DeGeneres (@ellendegeneres) APP USERS CLICK HERE TO VIEW POST Trump referred to O'Donnell as a \"threat to humanity,\" and wrote that Rosie's \"best interests\" were not for the United States. \"I am giving serious consideration to taking away her Citizenship,\" Trump wrote in a post to his social media platform Truth Social. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS \"She is a Threat to Humanity, and should remain in the wonderful Country of Ireland, if they want her. GOD BLESS AMERICA!\" he added. O'Donnell quickly responded to Trump's jab in several posts that she shared on her social media pages. The \"A League of Their Own\" star posted a collage of photos centered around a screenshot of Trump's post on Instagram and blasted the politician in the caption. \"The president of the USA has always hated the fact that i see him for who he is - a criminal con man sexual abusing liar out to harm our nation to serve himself,\" she wrote. \"This is why i moved to Ireland - he is a dangerous old soulless man with dementia who lacks empathy compassion and basic humanity.\" CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER Earlier this year, O'Donnell admitted she was \"shocked\" to hear why Ellen left the U.S. \"I’ve never really known Ellen to say anything political in her life, so I was surprised to read that she left because of President Trump. Like, that shocked me, actually,\" O’Donnell told Us Weekly earlier this year. \"I’ve been a political person my whole life, not better or worse, it’s just a different way to be in the world. \"I was very clear about the reason why I was leaving, and I don’t think it came as a surprise to anyone. We’re not really in each other’s worlds, and it’s been kind of awkward but you know what? I wish her the best. I wish that she has peace and love in her life and that she is OK.\" While their relationship isn't strong, O'Donnell insisted she harbors no ill will for the comedian. CLICK HERE TO GET THE FOX NEWS APP \"I don’t want to fight against another gay woman. It’s not like we’re tenaciously opposed to each other,\" O'Donnell said. \"We’re just very different people. We have had some stuff in the past that we never resolved. And not in any way as, as partners or lovers or anything like that, just as friends and comedians, but I wish her the best. I seriously do.\" Fox News Digital's Christina Dugan Ramirez contributed to this report.","summary":"Comedian Ellen DeGeneres made her UK move permanent after Trump&apos;s election win, selling her Montecito estate and embracing English farm life with chickens and sheep.","url":"https://www.foxnews.com/entertainment/ellen-degeneres-blames-trump-her-us-exodus","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/trump-ellen-degeneres.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-20 23:44:18","author":"Tracy Wright","authors":["Tracy Wright"],"language":"en","category":"politics","source_country":"us","sentiment":0.31},{"id":343558996,"title":"‘Knows everything’: Epstein’s lawyer speaks","text":"President Donald Trump is still seeking to shift Americans’ focus away from the Jeffrey Epstein case. To that end, the Department of Justice has now moved to release grand jury testimony from the prosecutions of both Epstein and his chief co-conspirator, Ghislaine Maxwell. Mr Trump hopes that will mollify his supporters.\n\nHowever, even if the courts decide that information can be released, it will only represent a small fraction of the so-called “Epstein files”, as high profile lawyer Alan Dershowitz pointed out today.\n\n“Grand jury information is narrowly tailored by prosecutors only to provide sufficient evidence to result in an indictment,” Mr Dershowitz, who represented Epstein in the past, told Fox News Sunday.\n\n“What’s much, much more important is discovery information, depositions and other things that came out of the Ghislaine Maxwell case, (and) that came out of other cases that were pending in front of federal judges.\n\n“All of that should be revealed as well.”\n\nHe cited the case of Britain’s Prince Andrew as an example.\n\nAnd Mr Dershowitz said Maxwell, who is currently serving a 20-year prison sentence for her part in Epstein’s sex trafficking crimes, was “the Rosetta Stone”.\n\n“She arranged every single trip with everybody. She knows everything,” he said, suggesting Maxwell could testify before Congress.\n\nMr Trump has been on something of a social media spree today.\n\nIn one post, he claimed the Epstein controversy had actually helped his approval ratings, particularly among Republican voters.\n\n“My Poll Numbers within the Republican Party, and MAGA, have gone up, significantly, since the Jeffrey Epstein Hoax was exposed by the Radical Left Democrats and, just plain ‘troublemakers’,” he said.\n\n“They have hit 90 per cent, 92 per cent, 93 per cent, and 95 per cent, in various polls, and are all Republican Party records. The General Election numbers are my highest, EVER!”\n\nThe President did not cite any specific poll.\n\nMr Trump has also been returning to a few of his past hits in the culture wars. For example, he’s called for NFL franchise the Washington Commanders and baseball team the Cleveland Guardians to change their names back to the Redskins and Indians, respectively.\n\nBoth franchises previously changed their names because of concerns they were insensitive towards Native Americans.\n\n“My statement on the Washington Redskins has totally blown up, but only in a very positive way,” said Mr Trump.\n\n“I may put a restriction on them if they don’t change the name back to the original ‘Washington Redskins’ and get rid of the ridiculous moniker ‘Washington Commanders’. I won’t make a deal for them to build a stadium in Washington.\n\n“Cleveland should do the same with the Cleveland Indians.”\n\nOn a more substantive matter, the White House is reportedly frustrated with Israeli Prime Minister Benjamin Netanyahu. One Trump official, who was not named, told Axios that Mr Netanyahu has been acting “like a madman” and “bombs everything all the time”.\n\n“Netanyahu is sometimes like a child who just won’t behave,” another official said. Slightly patronising, you might say.\n\nRead on for the latest updates.","summary":"Jeffrey Epstein’s former lawyer has spoken out about the unreleased files, and pointed out the “Rosetta Stone” of information in plain sight.","url":"https://www.news.com.au/world/north-america/us-politics/us-politics-live-jeffrey-epsteins-former-lawyer-says-coconspirator-ghislaine-maxwell-is-the-key-and-knows-everything/live-coverage/b5d8153f2a12e389683ce35601fb02ef?from=rss-basic","image":"https://content.api.news/v3/images/bin/13dfe13b0f9f35d0019b21105cb865fb","video":null,"publish_date":"2025-07-20 23:42:56","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.191},{"id":343564326,"title":"Trump threatens to hold up stadium deal if Washington Commanders don’t switch back to former name","text":"By JOE REEDY and ADRIANA GOMEZ LICON\nThe Associated Press\n\nCLEVELAND — President Donald Trump is threatening to hold up a new stadium deal for Washington’s NFL team if it does not restore its old name of the Redskins, which was considered offensive to Native Americans.\n\nTrump also said Sunday that he wants Cleveland’s baseball team to revert to its former name, the Indians, saying there was a “big clamoring for this” as well.\n\nThe Washington Commanders and Cleveland Guardians have had their current names since the 2022 seasons and both have said they have no plans to change them back.\n\nTrump said the Washington football team would be “much more valuable” if it restored its old name.\n\n“I may put a restriction on them that if they don’t change the name back to the original ‘Washington Redskins,’ and get rid of the ridiculous moniker, ‘Washington Commanders,’ I won’t make a deal for them to build a Stadium in Washington,” Trump said on his social media site.\n\nHis latest interest in changing the name reflects his broader effort to roll back changes that followed a national debate on cultural sensitivity and racial justice. The team announced it would drop the Redskins name and the Indian head logo in 2020 during a broader reckoning with systemic racism and police brutality.\n\nThe Commanders and the District of Columbia government announced a deal earlier this year to build a new home for the football team at the site the old RFK Stadium, the place the franchise called home for more than three decades.\n\nTrump’s ability to hold up the deal remains to be seen. President Joe Biden signed a bill in January that transferred the land from the federal government to the District of Columbia.\n\nThe provision was part of a short-term spending bill passed by Congress in December. While D.C. residents elect a mayor, a city council and commissioners to run day-to-day operations, Congress maintains control of the city’s budget.\n\nJosh Harris, whose group bought the Commanders from former owner Dan Snyder in 2023, said earlier this year the name was here to stay. Not long after taking over, Harris quieted speculation about going back to Redskins, saying that would not happen. The team did not immediately respond to a request for comment following Trump’s statement.\n\nThe Washington team started in Boston as the Redskins in 1933 before moving to the nation’s capital four years later.\n\nThe Cleveland Guardians’ president of baseball operations, Chris Antonetti, indicated before Sunday’s game against the Athletics that there weren’t any plans to revisit the name change.\n\n“We understand there are different perspectives on the decision we made a few years ago, but obviously it’s a decision we made. We’ve got the opportunity to build a brand as the Guardians over the last four years and are excited about the future that’s in front of us,” he said.\n\nCleveland announced in December 2020 it would drop Indians. It announced the switch to Guardians in July 2021. In 2018, the team phased out “Chief Wahoo” as its primary logo.\n\nThe name changes had their share of supporters and critics as part of the national discussions about logos and names considered racist.\n\nTrump posted Sunday afternoon that “The Owner of the Cleveland Baseball Team, Matt Dolan, who is very political, has lost three Elections in a row because of that ridiculous name change. What he doesn’t understand is that if he changed the name back to the Cleveland Indians, he might actually win an Election. Indians are being treated very unfairly. MAKE INDIANS GREAT AGAIN (MIGA)!”\n\nMatt Dolan, the son of the late Larry Dolan, no longer has a role with the Guardians. He ran the team’s charity endeavors until 2016.\n\nMatt Dolan was a candidate in the Ohio U.S. Senate elections in 2022 and ’24, but lost.\n\nWashington and Cleveland share another thing in common. David Blitzer is a member of Harris’ ownership group with the Commanders and holds a minority stake in the Guardians.\n\nAP sports: https://apnews.com/sports","summary":"President Trump also said he wants Cleveland's baseball team to revert to its old name.","url":"https://www.mercurynews.com/2025/07/20/trump-threatens-to-hold-up-stadium-deal-if-washington-commanders-dont-switch-back-to-redskins/","image":"https://www.mercurynews.com/wp-content/uploads/2025/07/Trump-Sports_Names_29744.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-07-20 23:40:34","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.086},{"id":343562892,"title":"President Trump Calls for Guardians and Commanders to Revert to Original Names","text":"CLEVELAND (WJW) — “OWNERS, GET IT DONE!!!”\n\nDonald Trump concluded a forceful social media comment on Sunday by urging the MLB’s Cleveland Guardians and the NFL’s Washington Commanders to return to their previous team names.\n\n“The Washington ‘Whatever’s’ should IMMEDIATELY revert to the Washington Redskins Football Team. There is a significant demand for this change. Similarly, the Cleveland Indians, one of the six founding baseball teams with a rich history,” Trump stated on Truth Social. “Our esteemed Native American community, in vast numbers, desires this. Their cultural heritage and honor are being progressively eroded. The present times are not like they were a few years ago. We are a nation driven by passion and common sense. OWNERS, MAKE IT HAPPEN!!!”\n\nAmid longstanding criticism about the use of Native American names and imagery at various educational and professional levels across the country, Cleveland’s owner Paul Dolan announced in July 2021 that the team would now be known as the Guardians. The team had already retired “Chief Wahoo” as its primary emblem in 2018.\n\n“In searching for a new brand, we sought a name that strongly reflects the pride, resiliency and loyalty of Clevelanders. Guardians embodies those defining attributes,” Dolan said at the time. “It brings to life the pride Clevelanders take in their city and for each other while defending our Cleveland baseball family.”\n\nGuardians president of baseball operations Chris Antonetti indicated before Sunday’s game against the Athletics that there weren’t any plans to revisit the name change.\n\n“We understand there are different perspectives on the decision we made a few years ago but obviously it’s a decision we made. We’ve got the opportunity to build a brand as the Guardians over the last four years and are excited about the future that’s in front of us,” he said.\n\nNexstar’s WJW reached out to the Guardians for reaction to the president’s words. A spokesperson for the organization said they had no comment at the time.\n\nBefore the start of the 2020 NFL season, Washington changed its name from the Redskins to the Washington Football Team before eventually becoming the Commanders.\n\nJosh Harris, whose group bought the Commanders from former owner Dan Snyder in 2023, said earlier this year the name was here to say. Not long after taking over, Harris quieted speculation about going back to Redskins, saying that would not happen.\n\nThe name changes had their share of supporters and critics as part of national discussions about institutions and teams to drop logos and names considered racist.\n\nThe Associated Press contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCLEVELAND (WJW) &#8212; &#8220;OWNERS, GET IT DONE!!!&#8221; Donald Trump concluded a forceful&#8230;\n\n\nThis Post: President Trump Calls for Guardians and Commanders to Revert to Original Names first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/president-trump-calls-for-guardians-and-commanders-to-revert-to-original-names/","image":"https://internewscast.com/wp-content/uploads/2025/07/President-Trump-urges-Guardians-Commanders-to-restore-former-names.jpg","video":null,"publish_date":"2025-07-20 23:36:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.273},{"id":343557482,"title":"Trump threatens to hold up stadium deal if Washington Commanders don’t switch back to Redskins","text":"By JOE REEDY and ADRIANA GOMEZ LICON\n\nCLEVELAND — President Donald Trump is threatening to hold up a new stadium deal for Washington’s NFL team if it does not restore its old name of the Redskins, which was considered offensive to Native Americans.\n\nTrump also said Sunday that he wants Cleveland’s baseball team to revert to its former name, the Indians, saying there was a “big clamoring for this” as well.\n\nThe Washington Commanders and Cleveland Guardians have had their current names since the 2022 seasons and both have said they have no plans to change them back.\n\nTrump said the Washington football team would be “much more valuable” if it restored its old name. \n\n“I may put a restriction on them that if they don’t change the name back to the original ‘Washington Redskins,’ and get rid of the ridiculous moniker, ‘Washington Commanders,’ I won’t make a deal for them to build a Stadium in Washington,” Trump said on his social media site. \n\nHis latest interest in changing the name reflects his broader effort to roll back changes that followed a national debate on cultural sensitivity and racial justice. The team announced it would drop the Redskins name and the Indian head logo in 2020 during a broader reckoning with systemic racism and police brutality.\n\nThe Commanders and the District of Columbia government announced a deal earlier this year to build a new home for the football team at the site the old RFK Stadium, the place the franchise called home for more than three decades.\n\nTrump’s ability to hold up the deal remains to be seen. President Joe Biden signed a bill in January that transferred the land from the federal government to the District of Columbia. \n\nThe provision was part of a short-term spending bill passed by Congress in December. While D.C. residents elect a mayor, a city council and commissioners to run day-to-day operations, Congress maintains control of the city’s budget.\n\nJosh Harris, whose group bought the Commanders from former owner Dan Snyder in 2023, said earlier this year the name was here to stay. Not long after taking over, Harris quieted speculation about going back to Redskins, saying that would not happen. The team did not immediately respond to a request for comment following Trump’s statement.\n\nThe Washington team started in Boston as the Redskins in 1933 before moving to the nation’s capital four years later.\n\nThe Cleveland Guardians’ president of baseball operations, Chris Antonetti, indicated before Sunday’s game against the Athletics that there weren’t any plans to revisit the name change.\n\n“We understand there are different perspectives on the decision we made a few years ago, but obviously it’s a decision we made. We’ve got the opportunity to build a brand as the Guardians over the last four years and are excited about the future that’s in front of us,” he said.\n\nCleveland announced in December 2020 it would drop Indians. It announced the switch to Guardians in July 2021. In 2018, the team phased out “Chief Wahoo” as its primary logo.\n\nThe name changes had their share of supporters and critics as part of the national discussions about logos and names considered racist.\n\nTrump posted Sunday afternoon that “The Owner of the Cleveland Baseball Team, Matt Dolan, who is very political, has lost three Elections in a row because of that ridiculous name change. What he doesn’t understand is that if he changed the name back to the Cleveland Indians, he might actually win an Election. Indians are being treated very unfairly. MAKE INDIANS GREAT AGAIN (MIGA)!”\n\nMatt Dolan, the son of the late Larry Dolan, no longer has a role with the Guardians. He ran the team’s charity endeavors until 2016.\n\nMatt Dolan was a candidate in the Ohio U.S. Senate elections in 2022 and ’24, but lost.\n\nWashington and Cleveland share another thing in common. David Blitzer is a member of Harris’ ownership group with the Commanders and holds a minority stake in the Guardians.\n\nGomez Licon reported from Fort Lauderdale, Fla.\n\nAP sports: https://apnews.com/sports\n\nWant more Broncos news? Sign up for the Broncos Insider to get all our NFL analysis.","summary":"President Donald Trump is threatening to hold up a new stadium deal for Washington's NFL team if it does not restore the Redskins name.","url":"https://www.denverpost.com/2025/07/20/trump-redskins-indians-washington-cleveland/","image":"https://www.denverpost.com/wp-content/uploads/2025/07/Trump-Sports_Names_29744.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-07-20 23:25:34","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.072},{"id":343556962,"title":"Tulsi Gabbard promises more details of ‘Obama coup plot’","text":"Director of National Intelligence Tulsi Gabbard has accused former President Barack Obama and senior members of his administration of orchestrating a “treasonous conspiracy” to delegitimize Donald Trump’s 2016 election victory, and has promised to release additional information about the alleged plot in a Fox News interview on Sunday.\n\nOn Friday, Gabbard declassified over 100 documents describing a coordinated effort by senior Obama-era officials to falsely accuse Trump of colluding with Russia. The documents suggest that Obama’s spies spies discarded all intelligence assessments that found no Russian involvement and replaced them with fabricated claims – laying the groundwork for the ‘Russiagate’ probe, which Gabbard described as a “years-long coup” against Trump.\n\n“The implications of this are frankly nothing short of historic,” Gabbard told Sunday Morning Futures on Fox News. “It’s worse than politicization of intelligence. These were manufactured intelligence documents that sought to achieve President Obama and his team’s objective, which was undermining President Trump’s presidency and subverting the will of the American people.”\n\nGabbard promised further disclosures, saying, “Next week we will be releasing more detailed information about how exactly this took place and the extent to which this information was sought to be hidden from the American people.”\n\nWe have whistleblowers actually coming forward now after we released these documents, because there are people who were around – who were working within the intelligence community at this time – who were so disgusted by what happened.\n\nThe documents implicate top intelligence officials under Obama – among them former DNI James Clapper, CIA Director John Brennan, FBI Director James Comey, and National Security Adviser Susan Rice – in the alleged plot. Gabbard confirmed plans to submit the findings to the Department of Justice and the FBI for criminal referral, vowing to do everything she can to ensure accountability.\n\n“Those responsible, no matter how powerful they are or were at that time, no matter who was involved in creating this treasonous conspiracy against the American people, they all must be held accountable,” she stated.","summary":"The US intel chief promises to hold those behind the “treasonous” Russiagate conspiracy accountable \nRead Full Article at RT.com","url":"https://www.rt.com/news/621742-gabbard-obama-coup-plot/","image":"https://mf.b37mrtl.ru/files/2025.07/article/687d7a2e2030276a8d729306.jpg","video":null,"publish_date":"2025-07-20 23:23:48","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.409},{"id":343572940,"title":"Number missing from devastating Texas floods drops sharply to 3, officials say","text":"The number of people missing in Texas Hill Country following the deadly flooding which struck the region over the Fourth of July holiday weekend has plummeted significantly, officials announced Saturday.The Kerr County Flood Disaster Joint Information Center determined that three people are still missing from the floods, the city of Kerrville said in a news release. That is a sharp drop from the approximately 100 people authorities had previously said were unaccounted for.\"Through extensive follow-up work among state and local agencies, many individuals who were initially reported as missing have been verified as safe and removed from the list,\" the city said in its news release. \"This has been an ongoing effort as investigators worked diligently to verify reports of missing persons and confirm their status.\"Kerrville is the county seat of Kerr County, which was hard-hit by the historic flooding. It is located about 60 miles northwest of San Antonio. \"We are profoundly grateful to the more than 1,000 local, state, and federal authorities who have worked tirelessly in the wake of the devastating flood that struck our community,\" Kerrville City Manager Dalton Rice said in a statement. \"Thanks to their extraordinary efforts, the number of individuals previously listed as missing has dropped from over 160 to three.\"Recovery efforts for those missing are continuing along the Guadalupe River watershed, officials added, with local, state, federal and international search and rescue teams involved. The flash floods killed at least 135 people in Texas, with most deaths along the Guadalupe River in Kerr County. The Hill Country is naturally prone to flash flooding because its dry, dirt-packed soil cannot soak up heavy rain. Earlier this week, state officials reduced the number of people unaccounted for from approximately 160 to about 100 in Kerr and other counties. State, federal and international resources were poured into rescue efforts, which were hindered by more rain in mid-July. Kerr County officials also said earlier this week the number of missing people decreased as victims were recovered, contact was made with people who were found safe, and some reports were found to be unsubstantiated or falsified. Also, they said, the missing list fluctuates as reports come into a hotline.The floods laid waste to the Hill Country. Vacation cabins, youth camps campgrounds fill the riverbanks and hills of Kerr County, and Camp Mystic, a century-old Christian summer camp for girls in a low-lying area along the Guadalupe. At least 27 of its campers and counselors died. Many of the campers who died were the camp's youngest attendees. The Texas Legislature is scheduled to convene Monday for a special session. Gov. Greg Abbott initially called lawmakers back to the Texas State Capitol in Austin hoping legislators would pass a measure to regulate a booming business in THC products after he vetoed a bill that would have banned them. Since the flooding, President Donald Trump has also told the Republicans who control state government to redraw congressional districts to help the GOP's chances of retaining a U.S. House majority in next year's midterm elections. Now, Abbott and other legislative leaders have added flooding-related issues to the agenda. Abbott said lawmakers would also review authorities' handling of the flooding and consider improving warning systems for Hill Country residents. Kerr County does not have a warning system because state and local agencies missed opportunities over the past decade to finance one.Trump and Abbott have pushed back aggressively against questions about how well local authorities responded to forecasts of heavy rain and the first reports of flash flooding. The president, who visited the area on July 11, called a reporter \"evil\" for raising such issues and said he thought \"everyone did an incredible job under the circumstances.\" Abbott dismissed a question about who was to blame for the deaths as \"the word choice of losers\" and used an analogy that began: \"Every football team makes mistakes.\"\"The way winners talk is not to point fingers,\" he concluded.Abbott has designated bills dealing with early warning systems and emergency communications as priorities for the Legislature's special session, scheduled to last 30 days. The House and Senate have formed special committees on flooding and disaster preparedness, and they're planning a July 31 visit to Kerrville, the seat of hardest-hit Kerr County, to hear comments from residents.The committees are scheduled to begin with a joint hearing Wednesday to consider the state's response to the fatal floods; planning for floods; infrastructure for managing floods; and communications among first responders. Washington senator Maria Cantwell said on \"Face the Nation with Margaret Brennan\" that there is a \"national responsibility\" for the federal government to improve forecasting systems. One bill already introduced by Republican Rep. Don McLaughlin would require the state's top public health official to set building standards for youth camps in 100-year floodplains — which FEMA defines as a high-risk area with a 1% chance of flooding in any given year. During a recent news conference, Republican state Rep. Drew Darby, a member of the House's committee, said lawmakers cannot bring back flood victims or undo the flooding.\"But what we can do is learn from it,\" he said.","summary":"Authorities determined that three people are still missing from the floods, a sharp drop from the approximately 100 people authorities had previously said were unaccounted for.","url":"https://www.cbsnews.com/news/texas-flood-victims-number-missing-drops-camp-mystic-guadalupe-river/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2025/07/13/82ebe89b-7765-48d8-82b5-f50134352dac/thumbnail/1200x630/c6e1005c524733cc24d97797fda60a12/flood.jpg","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3914566_hls/master.m3u8","publish_date":"2025-07-20 23:20:26","author":null,"language":"en","source_country":"US","sentiment":-0.329},{"id":343560988,"title":"Jeffrey Epstein files release: U.S. President Donald Trump named by accuser","text":"AgenciesIn a lengthy post, Trump claimed \"all these people want to talk about, with strong prodding by the Fake News and the success starved Dems, is the Jeffrey Epstein Hoax.\"\n\nIt was the summer of 1996 when Maria Farmer went to law enforcement to complain about Jeffrey Epstein. At the time, she said, she had been sexually assaulted by Epstein and his longtime partner, Ghislaine Maxwell. Farmer, then in her mid-20s, had also learned about a troubling encounter that her younger sister -- then a teenager -- had endured at Epstein's ranch in New Mexico. And she described facing threats from Epstein. Farmer said that when she discussed her concerns with the New York Police Department, then with the FBI, she also urged them to take a broader look at the people in Epstein's orbit, including Donald Trump, then still two decades from being elected president. She repeated that message, she said, when the FBI interviewed her again about Epstein in 2006. Her account is among the clearest indications yet of how Trump might have come to be named in the unreleased investigative files in the Epstein case, a matter that has generated another political uproar in recent weeks.Donald Trump, Bill ClintonIn interviews over the past week about what she told the authorities, she said she had no evidence of criminal wrongdoing by Epstein's associates. But she said she was alarmed by what she saw as Epstein's pattern of pursuing girls and young women while building friendships with prominent people, including Trump and President Bill Clinton.Investigations like the ones that targeted Epstein often explore a wide range of tips, evidence, recollections and relationships, little of which ends up being used in court records or as the basis for criminal prosecution. Epstein's voluminous investigative file contains many records that have not been made public, but that became the focus of claims, long stoked by Trump's allies, that authorities might have covered up the involvement of other rich and powerful men.Now, after his attorney general and FBI director abruptly abandoned their earlier promises to reveal everything about the Epstein files and said, in effect, that there was nothing to see, Trump's ties to Epstein are under renewed scrutiny, leading to questions about what so-far-undisclosed appearances he might have in the investigative record.Live EventsFarmer said she has long wondered how law enforcement agencies handled her complaints in 1996 and 2006.And she said she has been wondering in particular whether federal authorities did anything with her concerns about Trump. She said that she raised his name both times, not only because he seemed so close to Epstein but because of an encounter, which she has previously described publicly, that she said she had with Trump in Epstein's New York office.Clean Chit to Donald TrumpThe story of Farmer's efforts to call law enforcement attention to Epstein and his circle shows how the case files could contain material that is embarrassing or politically problematic to Trump, even if it is largely extraneous to Epstein's crimes and was never fully investigated or corroborated.And it underscores the complexities of opening up to scrutiny all the leads that investigators pursued, the evidence they gathered and the interviews they conducted, little of which ever went before a judge or jury.Law enforcement agencies have not accused Trump of any wrongdoing related to Epstein, and he has never been identified as a target of any associated investigation. Trump last week called for relevant grand jury testimony in the prosecution of Epstein to be publicly released, and has repeatedly dismissed any notion that he has something to hide. Even if that testimony is released, it is unlikely to shed much light on the relationship between the two men, which did not figure prominently in Epstein's criminal cases.FAQsQ1. What are Epstein files?A1. Jeffrey Epstein's crimes are listed in Epstein files.Q2. Who is President of USA?A2. President of USA is Donald Trump.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onEpstein filesEpstein files releaseJeffrey Epstein filesJeffrey Epstein files releaseDonald Trump\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onEpstein filesEpstein files releaseJeffrey Epstein filesJeffrey Epstein files releaseDonald Trump(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Law enforcement agencies have not accused Donald Trump of any wrongdoing related to Jeffrey Epstein, and he has never been identified as a target of any associated investigation.","url":"https://economictimes.indiatimes.com/news/international/us/jeffrey-epstein-files-release-u-s-president-donald-trump-named-by-accuser/articleshow/122802768.cms","image":"https://img.etimg.com/thumb/msid-122802784,width-1200,height-630,imgsize-32706,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-20 23:19:25","author":"Ionsjeffrey Epstein","authors":["Ionsjeffrey Epstein"],"language":"en","category":"politics","source_country":"in","sentiment":-0.083},{"id":343560144,"title":"Trump's duties boost Russian carbamide supplies to US — Washington Post","text":"WASHINGTON, July 21. /TASS/. Russian carbamide supplies to the United States have increased thanks to the import tariffs imposed by American President Donald Trump against some states, The Washington Post reported.\n\n\"The tariffs imposed to date also have had some presumably unintended effects. The U.S., for example, is now more dependent upon Russia for urea, a common fertilizer used to grow crops such as wheat, corn and rice,\" it said.\n\n\"In May, Russian shipments accounted for 64% of U.S. urea imports, roughly twice their share before the president hit most countries, including other fertilizer suppliers like Qatar and Algeria, with a new 10% tariff while leaving Russia untouched, according to data compiled by StoneX, a financial services firm in New York.\"\n\nThe US explained the decision not to impose new duties on Russian supplies by saying that numerous sanctions had already been levied on Moscow.\n\nRussia's May exports to the United States increased to $539.6 million, according to a monthly report on foreign trade turnover by the main American statistical agency, the U.S. Census Bureau, published in early July. In April, they stood at $492.1 million, and at $523.5 million in March. The May figure is the highest in the last few years. It is only exceeded by exports in March 2023 ($562 million).\n\nOn April 2, Trump promised to impose customs duties on 185 countries and territories. Universal tariffs of 10% came into force on April 5, individual tariffs on April 9. In addition, the US administration has imposed customs duties of 25% on all imported cars from April 3. On the same day, the US president suspended for 90 days part of the retaliatory duties, which, as the White House explained, is related to trade consultations. A universal tariff of 10% is valid for this period.\n\nOn June 27, Trump said that the United States would notify some countries within about a week and a half, with which it would not sign individual agreements, about further terms of bilateral trade, that is, about the duties. The US administration began sending out these alerts this month. As planned, Trump's decisions on the expiration of trade negotiations and the application of new import duties will take effect on August 1.","summary":"\"The tariffs imposed to date also have had some presumably unintended effects\", it said","url":"https://tass.com/economy/1991857","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-07-20 23:13:03","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.103},{"id":343565972,"title":"Japan PM’s future in doubt after election debacle","text":"Shigeru Ishiba's LDP party coalition, which has governed almost continuously since 1955, lost its upper house grip after failing to secure 50 seats. (AP pic)\nTOKYO: Japanese Prime Minister Shigeru Ishiba's future was unclear Monday after his coalition appeared to have disastrously lost its upper house majority in elections that saw strong gains by a right-wing populist party.\nThe Liberal Democratic Party (LDP), which has governed almost continuously since 1955, and its partner Komeito had to win 50 seats in Sunday's vote but they secured only around 41, according to local media projections.\nVoters angry at inflation turned to other parties, notably the \"Japanese first\" Sanseito, which made strong gains with its \"anti-globalist\" drive reminiscent of US President Donald Trump's agenda.\nThe debacle comes only months after Ishiba's coalition also lost its majority in the lower house, suffering the LDP's worst result in 15 years.\nIshiba, 68, a self-avowed policy \"geek\" seen as a safe pair of hands when he won the LDP leadership in September - on his fifth attempt - was tight-lipped late Sunday about his future.\n\"It's a difficult situation, and we have to take it very humbly and seriously,\" Ishiba told broadcaster NHK. Asked about his future, he said only that he \"cannot speak lightly of it\".\n\"We can't do anything until we see the final results, but we want to be very aware of our responsibility,\" Ishiba added.\nIf he goes, it was unclear who might step up as the LDP's 11th premier since 2000 now that the government needs opposition support in both chambers.\n\"Ishiba may be replaced by someone else, but it's not clear who will be the successor,\" Hidehiro Yamamoto, politics and sociology professor at the University of Tsukuba, told AFP.\n\nAfter years of stagnant or falling prices, consumers in the world's fourth-largest economy have been squeezed by inflation since Russia's 2022 invasion of Ukraine.\nIn particular, the price of rice has doubled, squeezing many household budgets despite government handouts.\nVoter Hisayo Kojima - one of legions of older people in Japan's falling and ageing population - said outside a voting station on Sunday that her pension \"is being cut shorter and shorter\".\n\"We have paid a lot to support the pension system. This is the most pressing issue for me,\" the 65-year-old told AFP in Tokyo.\nNot helping is lingering resentment about an LDP funding scandal, and US tariffs of 25 percent due to bite from August 1 if there is no trade deal with the United States.\nJapanese imports are already subject to a 10 percent tariff, while the auto industry, which accounts for eight percent of jobs, is reeling from a 25 percent levy.\nWeak export data last week, which showed plummeting US-bound auto deliveries, stoked fears that Japan could tip into a technical recession.\nDespite Ishiba securing an early meeting with Trump in February, and sending his trade envoy to Washington seven times, there has been no accord.\n'Japanese first'\nThe last time the LDP and Komeito failed to win a majority in the upper house was in 2010, having already fallen below the threshold in 2007.\nThat was followed by a rare change of government in 2009, when the now-defunct Democratic Party of Japan governed for a rocky three years.\nToday, the opposition is fragmented, and chances are slim that the parties can form an alternative government.\nPopulist opposition party Sanseito wants \"stricter rules and limits\" on immigration, opposes \"globalism\" and \"radical\" gender policies, and wants a rethink on decarbonisation and vaccines.\nLast week, it was forced to deny any links to Moscow - which has backed populist parties elsewhere - after a candidate was interviewed by Russian state media.\n\"They put into words what I had been thinking about but couldn't put into words for many years,\" one voter told AFP at a Sanseito rally.","summary":"Voter backlash over inflation lifted the 'Japanese first' Sanseito, whose anti-globalist pitch echoed Donald Trump’s populist playbook.","url":"https://www.freemalaysiatoday.com/category/world/2025/07/21/japan-pms-future-in-doubt-after-election-debacle","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/c0b00d79-shigeru-ishiba-2.jpg","video":null,"publish_date":"2025-07-20 23:11:13","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.391},{"id":343557492,"title":"I moved to the UK because of Trump, Ellen DeGeneres says","text":"Ellen DeGeneres has revealed she relocated to the UK because Donald Trump won the 2024 presidential election.The comedian and presenter, 67, relocated from California to the Cotswolds with her wife Portia de Rossi, 52, in November.\n\nWhile there had been speculation the move was in response to Mr Trump’s re-election, it is the first time the star has publicly confirmed the motivation behind the change.\n\nAsked whether reports that she moved because of Mr Trump were correct, DeGeneres said “yes”.\n\nSpeaking to Richard Bacon in Cheltenham on Sunday, DeGeneres said she and her wife had bought a “part-time house” and had intended to spend up to four months a year in the UK, but that changed following the election.\n\n“We got here the day before the election and woke up to lots of texts from our friends with crying emojis, and I was like, ‘He got in’,” she said, the BBC reported.\n\nShe added: “And we’re like, ‘We’re staying here’.”\n\nA string of left-wing stars have fled the US following Mr Trump’s re-election.\n\nCourtney Love, who has lived in the UK for several years, said she had applied to become a British citizen in light of Mr Trump’s presidency.\n\nActress Rosie O’Donnell left America for Ireland saying she will consider returning “when it is safe for all citizens to have equal rights there”.\n\nLast week Mr Trump threatened to strip the actress and comedian of her American citizenship, labelling her a “threat to humanity” after she criticised his response to the Texas floods.\n\nSpeaking on Sunday, DeGeneres said life “is just better” in the UK and she and her wife were considering getting remarried amid ongoing concerns gay marriage is under threat in the US.\n\n“It’s absolutely beautiful,” DeGeneres said of the UK. “We’re just not used to seeing this kind of beauty. The villages and the towns and the architecture - everything you see is charming and it’s just a simpler way of life.”It’s clean. Everything here is just better - the way animals are treated, people are polite. I just love it here.”We moved here in November, which was not the ideal time, but I saw snow for the first time in my life. We love it here. Portia flew her horses here, and I have chickens, and we had sheep for about two weeks.”\n\nDeGeneres, who came out as gay in 1997, said some stars have not come out about their sexuality because “it’s still a problem” and “people are still scared.”\n\nThe star also spoke of the Southern Baptist Convention endorsing the reversal of a Supreme Court case allowing same-sex marriage. “The Baptist Church in America is trying to reverse gay marriage,” she said. “They’re trying to literally stop it from happening in the future and possibly reverse it. Portia and I are already looking into it, and if they do that, we’re going to get married here.”She added: “I wish we were at a place where it was not scary for people to be who they are. I wish that we lived in a society where everybody could accept other people and their differences.”So until we’re there, I think there’s a hard place to say we have huge progress.”","url":"https://uk.news.yahoo.com/moved-uk-because-trump-ellen-231105405.html","image":"https://s.yimg.com/ny/api/res/1.2/MgfnlVnAQZ4EPpWtz_c6aw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA-/https://media.zenfs.com/en/the_telegraph_818/630d9d6a46f54c89ec05dffdfab3906f","video":null,"publish_date":"2025-07-20 23:11:05","author":"Susie Coen","authors":["Susie Coen"],"language":"en","category":"politics","source_country":"gb","sentiment":0.249},{"id":343561254,"title":"Temu's big Aussie ad spend since US tariffs prompts new safety fears","text":"Online shopping platforms based overseas are spending millions of extra dollars on advertising in Australia as they seek to expand their presence outside the US, following the introduction of President Donald Trump's heavy new import tariffs.\n\nThe change in marketing strategy has caused fears that a new deluge of unsafe products will flood into Australia.\n\nHannah Jacobs-Herd's nine-year-old daughter Daniella sustained severe burns in July last year, after a hoodie purchased on Temu, a Chinese e-commerce company that ships goods directly to buyers from third-party sellers, caught alight.\n\nDaniella received severe burns to 13 per cent of her body, including her face, after sparks from a fire pit hit the hoodie and it immediately went up in flames.\n\nMs Jacobs-Herd said after the trauma suffered by her daughter, it was distressing to see a deluge of Temu advertising pop up when she played free games on her tablet computer.\n\nMs Jacobs-Herd said she braced for more advertising from the platform when she heard about Mr Trump's \"Liberation Day\" tariffs targeting China.\n\n\"I lost it because I knew that we were going to get bombarded,\" she said.\n\nTrump call drives Temu to Australia\n\nIn April this year, Mr Trump signed an executive order restoring an import charge for Chinese goods valued at or under $US800 ($1,224).\n\nThe move doubled the cost of goods bought through Temu by American consumers, driving the company away from the US to more favourable markets, including Europe and Australia.\n\nGoods worth less than $1,000 can generally be imported into Australia free of duties, taxes or charges, meaning retailers do not need to absorb import fees or pass them on to Australian consumers.\n\nSharing data exclusively with the ABC, US market intelligence firm Sensor Tower said Temu had more than doubled its monthly Australian advertising spend from April to June 2025, compared with March.\n\nSince Temu's 110 per cent increase in advertising spend, the platform's monthly users have increased by 50 per cent for the June quarter.\n\nShein, another Chinese marketplace app, increased its monthly Australian advertising spend by 160 per cent, for a 15 per cent increase in monthly users.\n\nSensor Tower estimated Temu spent more than $4 million on Australian advertising in January alone, primarily through Facebook and Instagram.\n\nTaylor Brydges, a research principal at the University of Technology Sydney's Institute for Sustainable Futures, said the Sensor Tower data was representative of Temu's shift away from the US.\n\nTemu did not directly respond to questions from the ABC about its increased advertising spend in Australia.\n\nA spokesperson said the company opened the platform to Australian suppliers in March this year to better support them to cater for the local market.\n\nDaniella's mother said she was worried more Temu customers would be harmed because of Australia's weak consumer protection laws.\n\n\"There should be more enforcement around it,\" Ms Jacobs-Herd said.\n\nIt is a sentiment echoed by consumer protection advocates.\n\nGeneral safety provision\n\nThe Australian Competition and Consumer Commission (ACCC) recently released a report on its five-year inquiry into digital platforms.\n\nThe report found Temu had rapidly become Australia's most-used retail marketplace app since launching in the country in March 2023.\n\nIt noted that, unlike Australia, regions including the European Union, Canada and the US had responded to the growing popularity of online retail platforms like Temu by prohibiting the sale of unsafe goods.\n\nConsumer advocacy group Choice has been calling for a similar general safety provision since 2020.\n\nChoice deputy director of campaigns Andy Kelly said recent research by the group showed 74 per cent of consumers mistakenly believed businesses were legally required to ensure products were safe before selling them in Australia.\n\nIn a statement, Assistant Minister for Competition, Charities and Treasury Andrew Leigh said the government was considering the findings of the ACCC's report, including the recommendation for a proactive general safety provision.\n\n\"No business should gain a competitive advantage by compromising on safety. Australian consumers deserve to know that online marketplaces value their safety and have taken steps to ensure their products are safe to use,\" he said.\n\nIn the meantime, Ms Jacobs-Herd said she worried other families would suffer harm after seeking a bargain.\n\n\"We're just pretty much like any person who want to buy their child an Oodie but they can't afford it, so they find a knock-off — lots of people do that,\" she said.\n\nFour months after Daniella was burned, Temu issued a voluntary recall notice for the hoodie in consultation with the ACCC.\n\nMs Jacobs-Herd, who lives three hours north of Brisbane in Hervey Bay, is currently engaged in a lawsuit with Temu over the incident.\n\nA Temu spokesperson told the ABC the company had banned the merchant involved from selling \"children-related products\" on its platform globally.\n\nThe spokesperson said as a third-party marketplace, Temu required all merchants to fully comply with local laws and standards.\n\n\"We have in place a quality assurance system that includes vetting sellers and product listings, physical spot checks … monitoring using technology and human reviewers, and swift enforcement action,\" they said.\n\n\"We are also in discussions with the ACCC about becoming a signatory to the Online Product Safety Pledge.\"","summary":"Analysts say Temu has more than doubled its monthly Australian ad spend in response to heavy US import tariffs, prompting fears of a new deluge of unsafe products after a girl was burnt when a jumper bought on the site caught alight last year.","url":"https://www.abc.net.au/news/2025-07-21/temu-doubles-advertising-spend-in-australia/105547184","image":"https://live-production.wcms.abc-cdn.net.au/f094c79fa2095ed36d84c015966fed69?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485","video":null,"publish_date":"2025-07-20 23:10:19","author":"James Taylor","authors":["James Taylor"],"language":"en","source_country":"AU","sentiment":-0.483},{"id":343555202,"title":"How JD Vance is working to save his 2028 prospects as he navigates first REAL battle between angry MAGA and Trump over Epstein","text":"As the blow-up over President Donald Trump and prominent MAGA figures continues to simmer, Vice President JD Vance spent the week calculating his response and limiting his role in the scorched earth debate.\n\nAttorney General Pam Bondi shocked Trump's supporters after the Independence Day holiday, releasing a review from the Justice Department claiming that Epstein did not have a 'client list' and there were no more files related to his death in prison or the sex trafficking investigation against him.\n\nThe usually thoughtful and provocative vice president was silent on social media as the debate raged online, while Democrats cheered another MAGA 'civil war' at the president's expense.\n\nThe vice president traveled to West Pittston, Pennsylvania on Wednesday with a pool of reporters, but he did not engage the press who were eager to question him on the fued that threatened to blow up the MAGA coalition.\n\nThat was all by design, people familiar with Vance's thinking told the Daily Mail.\n\n“Vice President Vance is following President Trump’s lead and focusing on celebrating the administration’s policy victories like the historic passage of the One Big Beautiful Bill,' a source close to the vice president told the Daily Mail.\n\nTrump, the source noted, wanted to focus on their success ending taxes on tips and overtime, the S&P and NASDAQ hitting record highs, unemployment claims dropping, record low border crossings, wages rising more than inflation, and retail sales surging.\n\n'The White House is racking up wins on a daily basis, and there’s a lot the Vice President can be talking about and working on that actually affects Americans’ day-to-day lives,' the source noted.\n\nIn other words, ignore the noise that was threatening to rip their coalition apart. \n\nAfter delivering a rousing speech in defence of the administration's 'Big Beautiful Bill' the vice president and Second Lady Usha Vance traveled to the Majestic Lunch diner.\n\nAs he walked through the diner and spoke to patrons, no one spoke up about the Epstein files on camera. Instead, Vance chatted about food, football, and the military before leaving with a to-go order. \n\nEven as Trump angered many of his supporters by dismissing the importance of the Epstein files and even chiding them for being 'duped' by Democrats on the issue, Vance remained focused on his loyalty to the president. \n\nIt's a familiar struggle for vice presidents who privately harbor future political ambitions even as their boss threatens to undermine their political future. \n\nTrump no longer faces voters in a future election, earning him the ability to write off their concerns about the Epstein files. The president calculated that big policy and legislative victories would overcome any disgruntled supporters.\n\nFor now, Vance appears comfortable siding with the president, who values loyalty over all else.\n\nBut many perpetually online observers were busy resurfacing old Vance tweets and statements from weeks and years back, reminding him of this own questions about the Epstein files and his own calls to release them. \n\n'If you're a journalist and you're not asking questions about this case you should be ashamed of yourself,' Vance fumed back in 2021. 'What purpose do you even serve?'\n\nWhile Vance was publicly silent after the DOJ's Epstein announcement, he worked quietly behind the scenes to diffuse the civil war within the administration.\n\nAs FBI Deputy Director Dan Bongino and FBI Director Kash Patel were disappointed with Bondi's handling of the case, he spoke with them personally and urged them to remain in their positions rather than resign in protest, according to a White House insider.\n\nThen came the moment to pounce, using the perfect foil. \n\nOnce the Wall Street Journal published details of a 'letter' purportedly written by the president for Epstein's birthday that included a crude drawing of a naked woman, Vance eagerly leaped to the defense of his boss.\n\n'Forgive my language but this story is complete and utter bullshit. The WSJ should be ashamed for publishing it,' Vance blasted on social media.\n\nHe scolded the Journal for failing to show Trump a copy of the letter before publishing details about it in an article.\n\n'Doesn’t it violate some rule of journalistic ethics to publish a letter like this without showing it to the victim of this hit piece?' he asked.\n\nVance also applauded the president's announcement that he had asked his attorney general to produce 'any and all pertinent Grand Jury testimony' regarding the case, reposting a 'LFG' post hailing the decision by Donald Trump Jr.\n\nThat measured up to the loyal attack dog role expected by a vice president, but he was careful not to lash out at the president's supporters, even as some of them piled into his replies online.\n\nDespite his loyalty, Vance may face political consequences for remaining silent on the issue after cheering on the release of the Epstein files and further investigations into his clients for years.\n\n'Remember when we learned that our wealthiest and most powerful people were connected to a guy who ran a literal child sex trafficking ring? And then that guy died mysteriously in a jail? And now we just don't talk about it,' he wrote in September 2021, sharing an article published by The Week titled: 'The Jeffrey Epstein case is why people believe in Pizzagate.\n\n'Release the list!' comedian podcaster Theo Von said in an interview with Vance in October 2024, just weeks before the election.\n\nVance agreed at the time. \n\nThe clip was resurfaced this week by angry supporters, prompting Von himself to respond on social media.\n\n'Yeah what changed?' he asked his 1.6 million followers on X.\n\nVance did not respond, but the unspoken answer to the question is that his boss won the presidency, and for now, the vice president will follow his lead.\n\nThe question is if that price of loyalty will ultimately cost him. \n\n'I don't know how to do it without infuriating Trump beyond belief but if JD Vance has any hope in 2028 he's going to need to distance himself from the Epstein debacle,' said Clint Russell, a Miami-based conservative YouTuber. 'I mean you need to tell the truth, now, while it's needed.","summary":"As the blowup over President Donald Trump and prominent MAGA figures continued, Vice President JD Vance spent the week calculating his response and staying out of the debate.","url":"https://www.dailymail.co.uk/news/article-14919675/jd-vance-jeffrey-epstein-files-donald-trump.html","image":"https://i.dailymail.co.uk/1s/2025/07/18/20/100375467-0-image-m-22_1752868775602.jpg","video":null,"publish_date":"2025-07-20 23:10:07","author":"Charlie Spiering,Editor","authors":["Charlie Spiering","Editor"],"language":"en","source_country":"gb","sentiment":-0.134},{"id":343557150,"title":"Trump says he will help Afghans stuck in the UAE","text":"WASHINGTON >> President Donald Trump said on Sunday he would help Afghans detained in the United Arab Emirates for years after fleeing their country when the United States pulled out and the Taliban took power.\n\nTrump, a Republican who promised a far-reaching immigration crackdown, suspended refugee resettlement after he took office in January. In April, the Trump administration terminated temporary deportation protections for thousands of Afghans in the U.S.\n\n“I will try to save them, starting right now,” Trump said in a post on Truth Social that linked to an article on the Afghans held in limbo there.\n\nTrump cited news website “Just the News” as saying that UAE officials were preparing to hand over some Afghan refugees to the Taliban. Reuters has not confirmed the report.\n\nThe State Department did not immediately respond to a request for comment.\n\nThe UAE, a close security partner of the United States, agreed in 2021 to temporarily house several thousand Afghans evacuated from Kabul as the Taliban ousted the U.S.-backed government during the final stages of the U.S.-led withdrawal. Nearly 200,000 Afghans were brought to the U.S. by former President Joe Biden’s administration since the chaotic U.S. troop withdrawal from Kabul. Canada agreed in 2022 to resettle about 1,000 of the Afghans still held in the UAE after a U.S. request. It is unclear how many remain in the Gulf country.\n\nSome countries have forced Afghan refugees to return to Afghanistan. Nearly 2 million Afghans were returned from Iran and Pakistan in the past seven months, the United Nations said last week. Germany on Friday deported 81 Afghan men to Afghanistan amid a tightening of refugee admissions. Some other European countries are pushing to tighten asylum rules in the bloc. In the United States, Democrats have urged Trump to restore temporary protected status for Afghans, saying women and children could face particular harm under the Taliban-led government in place since 2021.\n\nRefugees include family members of Afghan-American U.S. military personnel, children cleared to reunite with their parents, relatives of Afghans already admitted and tens of thousands of Afghans who worked for the U.S. government during the 20-year war.\n\nShawn VanDiver, president of the #AfghanEvac advocacy group, urged Trump to follow up on his post with action.\n\n“President Trump has the authority to do the right thing. He should instruct DHS (Department of Homeland Security) and the Department of State to expedite processing, push for third-country partnerships, and ensure that we never again leave our wartime allies behind,” he said in a statement.","summary":"WASHINGTON >> President Donald Trump said on Sunday he would help Afghans detained in the United Arab Emirates for years after fleeing their country when the United States pulled out and the Taliban took power.","url":"https://www.staradvertiser.com/2025/07/20/breaking-news/trump-says-he-will-help-afghans-stuck-in-the-uae/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_2025-07-20T164605Z_682915541_RC2FQFAUSIAC_RTRMADP_3_USA-TRUMP-AFGHANS.JPG","video":null,"publish_date":"2025-07-20 23:07:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.21}]}