{"offset":0,"number":50,"available":12513,"news":[{"id":389025396,"title":"Jimmy Kimmel jokes about fascism in alternative Christmas message for Britain","text":"London, Dec 26 (AP) Talk show host Jimmy Kimmel took aim at US President Donald Trump as he warned Thursday about the rise of fascism in an address to UK viewers dubbed “The Alternative Christmas Message.\"The message, aired on Channel 4 on Christmas day, reflected on the impact from the second term in office for Trump, who Kimmel said acts like he's a king.“From a fascism perspective, this has been a really great year,\" he said. “Tyranny is booming over here.\"The channel began a tradition of airing an alternative Christmas message in 1993, as a counterpart to the British monarch's annual televised address to the nation. Channel 4 said the message is often a thought-provoking and personal reflection pertinent to the events of the year.The comedian has skewered Trump since returning to the air after ABC indefinitely suspended the “Jimmy Kimmel Live!” show in September following criticism of comments the host made over the killing of conservative activist Charlie Kirk.Kimmel made remarks in reference to the reaction to Kirk's shooting suggesting that many Trump supporters were trying to capitalise on the death.Trump celebrated the suspension of the veteran late-night comic and his frequent critic, calling it “great news for America.” He also called for other late night hosts to be fired.The incident, one of Trump's many disputes and legal battles waged with the media, drew widespread concerns about freedom of speech and freedom of the press.Hundreds of leading Hollywood stars and others in the entertainment industry urged Americans to “fight to defend and preserve our constitutionally protected rights.” The show returned to the air less than a week later.Kimmel told the UK audience that a Christmas miracle had happened in September when millions of people — some who hated his show — had spoken up for free speech.“We won, the president lost, and now I'm back on the air every night giving the most powerful politician on earth a right and richly deserved bollocking,” he said.Channel 4 previously invited whistle-blower Edward Snowden and Iranian President Mahmoud Ahmadinejad to deliver the alternative Christmas message.Kimmel, who said he didn't expect Brits to know who he was, warned that silencing critics is not just something that happens in Russia or North Korea.Despite the split that led to the American Revolution 250 years ago, he said the two nations still shared a special relationship and urged the UK not to give up on the US as it was “going through a bit of a wobble right now.”“Here in the United States right now, we are both figuratively and literally tearing down the structures of our democracy from the free press to science to medicine to judicial independence to the actual White House itself,” Kimmel said, in reference to demolition of the building's East Wing. “We are a right mess, and we know this is also affecting you, and I just wanted to say sorry.” (AP) GRS GRS","url":"https://www.livemint.com/focus/jimmy-kimmel-jokes-about-fascism-in-alternative-christmas-message-for-britain-11766689986330.html","image":"https://www.livemint.com/lm-img/img/2024/12/10/1600x900/logo/news_focus_2_1733817788528_1733817802330.jpg","video":null,"publish_date":"2025-12-26 19:13:05","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.041},{"id":389025398,"title":"Saudi Arabia urges Yemens separatists to leave 2 governorates as the anti-rebel coalition strains","text":"DUBAI, United Arab Emirates (AP) — Saudi Arabia on Thursday called on Emirati-backed separatists in southern Yemen to withdraw from two governorates they now control, a move that has threatened to spark a confrontation within a fragile coalition that has been battling the Iran-backed Houthi rebels in the country's north.The statement from Saudi Arabia's Foreign Ministry appeared aimed at putting public pressure on the Southern Transitional Council, a separatist Yemeni force long supported by the United Arab Emirates. Saudi Arabia backs the National Shield Forces of Yemen's internationally backed government in the war against the Houthis.The separatists' actions have “resulted in an unjustified escalation that harmed the interests of all segments of Yemeni people, as well as the southern cause and the coalition’s efforts,” the ministry said. “The kingdom stresses the importance of cooperation among all Yemeni factions and components to exercise restraint and avoid any measures that could destabilize security and stability.”Meanwhile, the Houthis buried four of their fighters, including the group's top missile and drone commander who was presumed killed in March, in the first round of U.S. airstrikes to hit the rebels in March.The Southern Transitional Council moved earlier this month into Yemen's governorates of Hadramout and Mahra. The Saudi statement said that meditation efforts were underway to have the council's forces return to “their previous positions outside of the two governorates and hand over the camps in those areas” to the National Shield Forces.“These efforts remain in progress,” the ministry said.The local Hadramout governorate's authority said that it supported the Saudi announcement and called for the Emirati-backed separatists to withdraw to positions outside the governorates.Those aligned with the council have increasingly flown the flag of the flag of South Yemen, which was a separate country from 1967-1990. Demonstrators rallied on Thursday in the southern port city of Aden to support political forces calling for South Yemen to again secede from Yemen.Following the capture of Yemen's capital, Sanaa, and much of the country's north by the Houthis in 2014, Aden has been the seat of power for the internationally recognized government and forces aligned against the Houthi rebels.The actions by the separatists have put pressure on the relationship between Saudi Arabia and the UAE, which maintain close relations and are members of the OPEC oil cartel, but also have competed for influence and international business in recent years.There has also been an escalation of violence in Sudan, another nation in the Red Sea where the kingdom and the Emirates support opposing forces in an ongoing war.The Houthis seized Sanaa in September 2014 and forced the internationally recognized government into exile. Iran denies arming the rebels, although Iranian-manufactured weaponry has been found on the battlefield and in sea shipments heading to Yemen despite a U.N. arms embargo.A Saudi-led coalition armed with U.S. weaponry and intelligence entered the war on the side of Yemen’s exiled government in March 2015. Years of inconclusive fighting have pushed the Arab world’s poorest nation to the brink of famine.The war has killed more than 150,000 people, including fighters and civilians, and created one of the globe’s worst humanitarian disasters, killing tens of thousands more.The Houthis have launched attacks on hundreds of ships in the Red Sea corridor over the Israel-Hamas war, greatly disrupting regional shipping.While traffic has inched up recently in the lull in attacks, many shippers continue to go around Africa through the Cape of Good Hope to avoid the Red Sea and the Gulf of Aden.Further chaos in Yemen could again draw in the United States.Washington launched an intense bombing campaign targeting the rebels earlier this year that U.S. President Donald Trump halted just before his trip to the Middle East in October. The Biden administration also conducted strikes against the Houthis, including using B-2 bombers to target what it described as underground bunkers used by the Houthis.In Sanaa, crowds gathered as uniformed men carried five coffins draped in Yemen’s flag and topped with flowers during the funerals for the four Houthi fighters.The dead fighters include Maj. Gen. Zakaria Abdullah Yahya Hajar, whom analysts identified as the group’s drone and missile chief. U.S. forces reportedly targeted Hajar, who allegedly received training from the expeditionary Quds Force of Iran’s paramilitary Revolutionary Guard, in a strike in March in Sanaa.The Houthis provided no information on how or when he died. However, a transcript of a discussion between top American officials on the messaging app Signal later published by The Atlantic magazine included then national security adviser Mike Waltz referencing the initial March 15 attack targeting a Houthi missile commander.“The first target — their top missile guy — we had positive ID of him walking into his girlfriend’s building and it’s now collapsed,” Waltz wrote at the time.The Houthis have increasingly threatened Saudi Arabia and taken dozens of workers at U.N. agencies and other aid groups as prisoners, alleging without evidence that they were spies — something fiercely denied by the United Nations and others.","url":"https://www.livemint.com/news/world/saudi-arabia-urges-yemens-separatists-to-leave-2-governorates-as-the-anti-rebel-coalition-strains-11766687495418.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/NEWS_1733464049847_1733464070835.jpg","video":null,"publish_date":"2025-12-26 18:31:35","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":0.125},{"id":389049488,"title":"WATCH: Kiwanis Division 23 East spreads Christmas joy to new mothers at Victoria Jubilee Hospital","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nDecember 25, 2025\n\n\n\n\n WATCH: Kiwanis Division 23 East spreads Christmas joy to new mothers at Victoria Jubilee Hospital \n\n\n\n\n\n\n\nKINGSTON, Jamaica—Some 61 new mothers who gave birth on Thursday, December 25, at Victoria Jubilee Maternity Hospital in downtown Kingston were presented with baskets by Kiwanis Division 23 East as part of their annual Baby Love Project.\n\n“This morning, we have 61 delivered mothers on the ward. Seven delivered since 12 midnight. The first baby was delivered at 12:11 am, and it was a boy. The second baby was delivered at 12:14 am, a girl. The third baby was delivered at 4:07 am, that’s another girl, and the fourth baby was delivered at 5:02 am, and that’s another girl,” said Matron Elise Fairweather-Blackwood, director of nursing services at Victoria Jubilee Hospital.\n\nFairweather-Blackwood said baskets were presented to all the mothers on the ward.\n\n“Baskets were presented to all the mothers who were on the ward, and for those who were delivered this morning, first to fourth got special baskets. So the first mother was done by cesarean section, so she was unable to come down, and the third mother was not well enough to come downstairs,” she said.\n\nMinister of Health and Wellness, Dr Christopher Tufton, who was present as the baskets were presented to the mothers, paid tribute to the Kiwanis Club for the initiative.\n\n“In paying tribute to young ones coming into the ward, mothers who have journeyed the distance to this point, hopefully with the support of the fathers and family members. But renewal because the future is really ahead, and that renewal involves a lot. It involves happiness because it represents something new, someone new. It represents the future in terms of the potential that the future brings, but it also represents challenges. I think in that regard, we have to pay tribute to the Kiwanis Club because what you’re actually doing is giving an energetic start to the renewal of this process of our youngsters coming into the world,” Tufton said.\n\nAudrey Brown, lieutenant governor of the Kiwanis Division 23 East, shared that the Baby Love Project, which is now in its 12th staging, is something that the clubs look forward to each year.\n\n“This is our 12th staging of the Baby Love Project, and this is something the clubs look forward to doing every year at this time on Christmas Day. It’s a big sacrifice, and especially now that we have the passage of Melissa, they just think that we should continue to do this and do this in a big way,” she said.\n\nShe added that each club was mandated to give three baskets per club; however, some went beyond and gave six baskets.\n\n“I must say the men of Division 23 chipped in real awesome there and shows that we do have committed fathers and Kiwanis Division 23 East, we do have examples of those fathers,” she added.\n\n(Video: Llewellyn Wynter)\n\n\n\n\n\n\n\n\nTags: Dr Christopher Tufton Kiwanis Club Division 23 East new mothers Victoria Jubilee Hospital \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Spice celebrates Jamaican-themed Christmas in the aftermath of Hurricane Melissa \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n KINGSTON, Jamaica—Dancehall artiste Spice is standing in solidarity with her fellow Jamaicans in the aftermath of Hurricane Melissa, dedicating her Ch... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n King Charles calls for ‘reconciliation’ in Christmas speech \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n LONDON, United Kingdom (AFP)—Britain's King Charles III called for \"compassion and reconciliation\" at a time of \"division\" across the world in his Chr... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Lucea mayor defends new Christmas tree as he blasts detractors \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n HANOVER, Jamaica — As the festive glow of the Christmas season settles over Hanover's parish capital, Mayor of Lucea, Sheridan Samuels is issuing a st... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n DJ Mac gives UK-based Drip Rick Vi the green light \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fast rising Uk-based dancehall artiste Drip Rick Vi is enjoying a great run in dancehall. The witty deejay has scored a place on one of the hottest be... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Complex Ricki wants to ‘Make a Change’ \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fusion reggae artiste Complex Ricki is generating a major buzz on the streets with her latest ambitious single, Make a Change , dedicated to the survi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Democrats demand probe into Caribbean boat strikes \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n WASHINGTON, United States (CMC) – As United States President Donald Trump expands the US military build-up in the Caribbean, Democratic legislators ar... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n WATCH: Wanted man killed in Manchester confrontation, police say \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n MANCHESTER, Jamaica — One of Manchester’s most wanted men was fatally shot during an alleged confrontation with the police in Mike Town in the parish ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/25/watch-kiwanis-division-23-east-spreads-christmas-joy-new-mothers-victoria-jubilee-hospital/","image":"https://img.youtube.com/vi/C7b0GFFHZZ4/sddefault.jpg","video":null,"publish_date":"2025-12-26 02:46:38","author":null,"language":"en","source_country":"jm","sentiment":0.207},{"id":389049490,"title":"Spice celebrates Jamaican-themed Christmas in the aftermath of Hurricane Melissa","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDancehall artiste Spice \n\n Latest News, News \n\nDecember 25, 2025\n\n\n\n\n Spice celebrates Jamaican-themed Christmas in the aftermath of Hurricane Melissa \n\n\n\n\n\n\n\nKINGSTON, Jamaica—Dancehall artiste Spice is standing in solidarity with her fellow Jamaicans in the aftermath of Hurricane Melissa, dedicating her Christmas decor this year to her home country.\n\n“This Christmas holiday, everybody knows what has been happening in Jamaica with Hurricane Melissa. I haven’t forgotten my people in Jamaica, so I decided to dedicate my Christmas this year to Jamaica,” Spice said in a captioned post on Instagram.\n\nOn her Christmas tree, the Go Down Deh singer displayed ornaments representing Jamaica’s 14 parishes, designed in the shape of the island’s map, along with praying hands and ribbons with popular Jamaican proverbs.\n\nDancehall artiste Spice Christmas tree\n\nIn keeping with her silver-and-white themed decor, the artiste also incorporated distinctly Jamaican elements, celebrating locations such as Kingston, Negril, Ocho Rios, Montego Bay and Port Antonio.\n\n“I’m celebrating my beautiful country, Jamaica, this year. I dedicated Christmas to Jamaica. I love you guys so much, and I hope you all have a merry Christmas,” Spice added.\n\nSpice last month donated building supplies to residents of Bethel Town in Westmoreland to help residents rebuild after Hurricane Melissa.\n\nREAD: Spice donates building supplies to Bethel Town\n\nCategory Five Hurricane Melissa made landfall in Jamaica on October 28, 2025, causing widespread flooding, landslides and extensive damage to homes and utility infrastructure, particularly across western Jamaica.\n\nParishes, including St Elizabeth, Westmoreland, Trelawny, St James and Hanover were among the hardest hit.\n\nTragically, an estimated 45 lives were lost as a result of the hurricane.\n\n\n\n\n\n\n\n\n\nTags: Dancehall artiste Spice Hurricane Melissa Jamaican themed Christmas \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n King Charles calls for ‘reconciliation’ in Christmas speech \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n LONDON, United Kingdom (AFP)—Britain's King Charles III called for \"compassion and reconciliation\" at a time of \"division\" across the world in his Chr... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Lucea mayor defends new Christmas tree as he blasts detractors \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n HANOVER, Jamaica — As the festive glow of the Christmas season settles over Hanover's parish capital, Mayor of Lucea, Sheridan Samuels is issuing a st... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n DJ Mac gives UK-based Drip Rick Vi the green light \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fast rising Uk-based dancehall artiste Drip Rick Vi is enjoying a great run in dancehall. The witty deejay has scored a place on one of the hottest be... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Complex Ricki wants to ‘Make a Change’ \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fusion reggae artiste Complex Ricki is generating a major buzz on the streets with her latest ambitious single, Make a Change , dedicated to the survi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Democrats demand probe into Caribbean boat strikes \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n WASHINGTON, United States (CMC) – As United States President Donald Trump expands the US military build-up in the Caribbean, Democratic legislators ar... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n WATCH: Wanted man killed in Manchester confrontation, police say \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n MANCHESTER, Jamaica — One of Manchester’s most wanted men was fatally shot during an alleged confrontation with the police in Mike Town in the parish ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Two American men denied bail on rape charges in The Bahamas \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n NASSAU, Bahamas (CMC) – Two American men were denied bail when they appeared in a magistrate’s court in The Bahamas charged with raping a 25-year-old ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/25/spice-celebrates-jamaican-themed-christmas-aftermath-hurricane-melissa/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/Screenshot-2025-12-25-155627.png","video":null,"publish_date":"2025-12-26 01:58:21","author":null,"language":"en","source_country":"jm","sentiment":0.441},{"id":389065426,"title":"Donald Trump Mentions Jeffrey Epstein in New Christmas Message","text":"President Donald Trump used a Christmas message posted online to attack Democrats, the news media and figures he claimed were connected to convicted sex offender Jeffrey Epstein, reviving familiar grievances and rejecting any association with Epstein himself. The president posted on Truth Social, “Merry Christmas to all, including the many Sleazebags who loved Jeffrey Epstein, gave him bundles of money, went to his Island, attended his parties, and thought he was the greatest guy on earth, only to 'drop him like a dog' when things got too HOT, falsely claimed they had nothing to do with him, didn’t know him, said he was a disgusting person, and then blame, of course, President Donald J. Trump, who was actually the only one who did drop Epstein, and long before it became fashionable to do so. His post continued, “When their names get brought out in the ongoing Radical Left Witch Hunt (plus one lowlife “Republican,” Massie!), and it is revealed that they are Democrats all, there will be a lot of explaining to do, much like there was when it was made public that the Russia, Russia, Russia Hoax was a fictitious story - a total Scam -and had nothing to do with 'TRUMP.' The Failing New York Times, among many others, was forced to apologize for their bad and faulty Election 'Reporting,' even to the point of losing many subscribers due to their highly inaccurate (FAKE!) coverage. Now the same losers are at it again, only this time so many of their friends, mostly innocent, will be badly hurt and reputationally tarnished. But sadly, that’s the way it is in the World of Corrupt Democrat Politics!!! Enjoy what may be your last Merry Christmas! President Donald J. Trump.“ This is a breaking news story. Updates to follow. President Donald Trump gestures at Christmas Eve dinner at his Mar-a-Lago club, Wednesday, Dec. 24, 2025, in Palm Beach, Fla. (AP Photo/Alex Brandon)","summary":"Trump used a Christmas message to attack Democrats and the media while invoking Jeffrey Epstein and denying any ties to him.","url":"https://www.newsweek.com/trump-christmas-message-jeffrey-epstein-democrats-media-11270809","image":"https://assets.newsweek.com/wp-content/uploads/2025/12/AP25359031515105.jpg?w=1600&h=900&q=88","video":null,"publish_date":"2025-12-26 01:03:02","author":"Gabe Whisnant","authors":["Gabe Whisnant"],"language":"en","category":"politics","source_country":"US","sentiment":-0.608},{"id":389063654,"title":"Crockett accuses Trump administration of dishonesty over border encounter numbers","text":"Rep. Jasmine Crockett, D-Texas, who is running for Senate, said she is doubtful that the border data coming out of President Donald Trump’s administration is accurate and accused it of not being \"the most honest\" at reporting numbers. During an interview Tuesday on \"Meet the Press NOW,\" NBC News’ Gabe Gutierrez asked Crockett about immigration. \"One of the key issues in Texas is, of course, immigration,\" he said. \"You, of course, have been an outspoken critic of the president’s mass deportation policies and of I.C.E.\" JASMINE CROCKETT LIKENS ICE TO 'SLAVE PATROLS,' DOWNPLAYS MIGRANT CRIME \"But a lot of voters — a lot of Americans who voted for President Trump — think that he has done a strong job at the border. In fact, border encounter numbers are down, and the president is touting that as a success. You obviously have issues with the way he’s going about it, but has the president been successful — can you acknowledge that — on bringing border encounters down?\" Gutierrez asked. Crockett responded that she is not convinced the border numbers are accurate. \"I will acknowledge that what is being reported is that border encounters are lower,\" Crockett said. \"I will also say that we know that this administration has not been the most honest when it comes to reporting numbers, as we know that there’s now reporting that they have not been honest about the jobs numbers.\" JASMINE CROCKETT CITES MAMDANI-TRUMP, AOC-TRUMP VOTERS WHEN CONFRONTED ON PATH TO VICTORY IN TEXAS Crockett described Trump’s immigration enforcement as \"inhumane.\" \"What I can tell you is that he has invoked a very inhumane way of carrying out immigration,\" Crockett said. \"What I also can tell you is that he has not worked through the Congress, and that's what we need, is comprehensive immigration reform. What I also can tell you is that we have a historic number of people that have died in I.C.E. custody since he’s been in. What I also can tell you is that we have a historic number of American citizens that have been rounded up, and what I can also tell you is that this Supreme Court, unfortunately, has basically given him carte blanche to go after people because of an accent or because of what they look like, and that is wrong.\" CLICK HERE TO DOWNLOAD THE FOX NEWS APP In October, the Trump administration announced it closed out fiscal year 2025 with the lowest U.S. Border Patrol apprehensions since 1970, with U.S. Customs and Border Protection (CBP) reporting 237,565 southwest border apprehensions in fiscal year 2025 compared to 201,780 in fiscal year 1970. In a statement to Fox News Digital, White House spokeswoman Abigail Jackson said, \"This is a bizarre conspiracy theory from a woman who couldn’t even properly read the FEC website before telling lies on the House floor. It’s a fact that the border is the most secure in history and dangerous criminal illegal aliens are being deported thanks to President Trump’s policies.\"","summary":"Rep. Jasmine Crockett, D-Texas, challenged the Trump administration&apos;s border success claims, calling its immigration enforcement inhumane on NBC News.","url":"https://www.foxnews.com/media/crockett-accuses-trump-administration-dishonesty-over-border-encounter-numbers","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/04/jasmine-crockett-shouting.jpg","video":null,"publish_date":"2025-12-26 01:00:44","author":"Rachel Del Guidice","authors":["Rachel Del Guidice"],"language":"en","category":"politics","source_country":"US","sentiment":-0.264},{"id":389065276,"title":"Are we entering a new age of nuclear proliferation?","text":"In 2025, we saw Vladimir Putin’s nuclear sabre rattling over Ukraine; Donald Trump’s threat to resume nuclear weapon tests, and China’s strategic nuclear missile build-up, the world’s largest since the 1960s. Most ominously, war nearly erupted between two nuclear-weapon states — India and Pakistan — in May.\n\n These trends are completely out of step with the 1968 Nuclear Non-Proliferation Treaty, the objective of which was to free the world from the constant threat of self-annihilation. The Npt requires all parties to renounce nuclear weapons and to subject their nuclear activities to International Atomic Energy Agency (IAEA) inspection. It also obliges five recognised nuclear-weapon states at the time of its signing — China, France, Russia, the United Kingdom, and the United States — to get rid of their weapons and achieve nuclear disarmament.\n\n With 191 states party to it, the Npt is almost universal. But four of the five exceptions — India, Pakistan, Israel, and North Korea — are nuclear-weapon states (the fifth is South Sudan). The first three refused to join before developing nuclear weapons; North Korea initially joined but later withdrew amid accusations that it had violated the treaty — and now openly proclaims its growing nuclear ambitions.\n\n The Npt was supposed to be fortified with other agreements, but things did not go as planned. \n\n Far from having disarmed, nuclear-weapon states possess more than 12,000 nuclear warheads. Some 4,000 are deployed on missiles and aircraft, with around 2,000 on high alert and ready to launch within a few minutes\n\nWorse, all nine nuclear-weapon states are doubling down by “modernising” their arsenals to take advantage of emerging technologies.\n\n In 2020, former US secretary of defence William J Perry and Tom Z Collina summed up the situation: “Mr Trump has the absolute authority to start a nuclear war. Within minutes, the president could unleash the equivalent of more than 10,000 Hiroshima bombs. He does not need a second opinion … Yet it would mean the end of civilization as we know it.” \n\nHaving grown frustrated with the lack of progress in moving toward nuclear disarmament under the Npt, the majority of non-nuclear states adopted a Treaty on the Prohibition of Nuclear Weapons, which entered into force in 2021. The Tpnw aims to prohibit nuclear weapons and require states to destroy any existing ones. While 74 countries have ratified it, none of the nine nuclear-weapon states has followed their lead.\n\n In fact, the US, Britain, and France responded to the Tpnw's adoption by arguing that nuclear deterrence “has been essential to keeping the peace in Europe and North Asia for over 70 years.” \n\nNonetheless, they have at least reiterated their commitment, under the Npt, to disarmament, stating that they “believe strongly that the further spread of [nuclear] weapons must be prevented.” In the not-too-distant past, the original five nuclear-weapon states did work together to prevent the spread of nuclear weapons in the cases of North Korea, Iraq, and Iran. But North Korea ended up withdrawing from the Npt, and Iraq was invaded by a US- and UK-led “coalition of the willing,” on the false pretext that Saddam Hussein had undeclared weapons of mass destruction.\n\n In the case of Iran, an agreement between that country and the five nuclear-weapon states aimed to build trust through cooperation and enhanced transparency, but it unraveled when the first Trump administration withdrew from the deal, known as the Joint Comprehensive Plan of Action, in 2018. Then, despite the IAEA reporting that there are “no credible indications of an ongoing, undeclared structured nuclear program” in Iran, Israel and the second Trump administration took it upon themselves to launch airstrikes against Iran’s nuclear-fuel-cycle infrastructure.\n\nChain reaction \n\nNotwithstanding statements and assurances by the five original nuclear-weapon states that their arsenals are only for defensive purposes, and that a “nuclear war cannot be won and must never be fought,” some have begun to emphasize the value of nuclear weapons and espouse the principle of might makes right. Former Russian president Dmitry Medvedev, for example, warns that a “defeat of a nuclear power in a conventional war may trigger a nuclear war,” adding that “nuclear powers have never lost major conflicts on which their fate depends.” \n\nSimilarly, US secretary of defence Pete Hegseth recently stated that, “We’re not building for peacetime; we are pivoting the Pentagon and industrial base to a wartime footing.” \n\nThe Trump administration has coupled such rhetoric with threats or the actual use of force (or US weapons) against a wide range of countries and territories, including Iran, the occupied Palestinian enclaves, Denmark, Canada, Venezuela, and Nigeria.\n\n In this fraught new environment, some US allies are starting to doubt the reliability of the US nuclear umbrella. Japan and South Korea are now examining their defence capabilities. And in Germany, Chancellor Friedrich Merz previously stated an openness to talks with France and the UK about “sharing” nuclear weapons in Europe to boost “the US shield”.\n\n Thus, geopolitical developments are leading to the steady crumbling, if not outright demolition, of the international architecture for maintaining peace and security. \n\n So, the message is that, if you want the ultimate security guarantee, you must have the bomb; and that if you do have it, you can get away with murder\n\n Ukraine, which agreed to give up its nuclear weapons in exchange for security guarantees, understands this all too well.\n\n Whatever they say, the nuclear-weapon states have clearly reneged on their commitment to nuclear disarmament and are now rushing in the opposite direction. Sophisticated technologies — including autonomous weapons — and global tensions have brought the world to an extraordinarily dangerous place. The current nuclear arms-control regime always had to treat some as being more equal than others. But it can no longer be sustained. Soon, others will shake off its yoke and develop their own “deterrence.” \n\nMore nuclear weapons will mean more vulnerabilities, owing to growing cyber capabilities, shaky command-and-control systems, and the age-old risk of sleepwalking into conflict. There has never been a greater or more urgent need for dialogue, trust-building among major powers, a rules-based system, and new efforts at disarmament.\n\n Mohamed ElBaradei, a former vice president of Egypt and director general of the International Atomic Energy Agency, is a Nobel Peace Prize laureate.\n www.project-syndicate.org","summary":"Not only are major nuclear-weapon states failing to pursue arms control and disarmament; they are openly doubling down on \"modernising\" and expanding their arsenals to match their increasingly bellicose rhetoric","url":"https://www.irishexaminer.com/opinion/commentanalysis/arid-41763164.html","image":"https://www.irishexaminer.com/cms_media/module_img/9811/4905908_2_seoimage1x1_81ef8e28a57e4bcdae7cac451e0cd7c0.jpg.jpg","video":null,"publish_date":"2025-12-26 01:00:00","author":"Irishexaminer.com,Mohamed Elbaradei","authors":["Irishexaminer.com","Mohamed Elbaradei"],"language":"en","source_country":"ie","sentiment":-0.123},{"id":389065278,"title":"Are we entering a new age of nuclear proliferation?","text":"In 2025, we saw Vladimir Putin’s nuclear sabre rattling over Ukraine; Donald Trump’s threat to resume nuclear weapon tests, and China’s strategic nuclear missile build-up, the world’s largest since the 1960s. Most ominously, war nearly erupted between two nuclear-weapon states — India and Pakistan — in May.\n\n These trends are completely out of step with the 1968 Nuclear Non-Proliferation Treaty, the objective of which was to free the world from the constant threat of self-annihilation. The Npt requires all parties to renounce nuclear weapons and to subject their nuclear activities to International Atomic Energy Agency (IAEA) inspection. \n\nIt also obliges five recognised nuclear-weapon states at the time of its signing — China, France, Russia, the United Kingdom, and the United States — to get rid of their weapons and achieve nuclear disarmament.\n\n With 191 states party to it, the Npt is almost universal. But four of the five exceptions — India, Pakistan, Israel, and North Korea — are nuclear-weapon states (the fifth is South Sudan). The first three refused to join before developing nuclear weapons; North Korea initially joined but later withdrew amid accusations that it had violated the treaty — and now openly proclaims its growing nuclear ambitions.\n\n The Npt was supposed to be fortified with other agreements, but things did not go as planned. \n\n Far from having disarmed, nuclear-weapon states possess more than 12,000 nuclear warheads. Some 4,000 are deployed on missiles and aircraft, with around 2,000 on high alert and ready to launch within a few minutes\n\nWorse, all nine nuclear-weapon states are doubling down by “modernising” their arsenals to take advantage of emerging technologies.\n\n In 2020, former US secretary of defence William J Perry and Tom Z Collina summed up the situation: “Mr Trump has the absolute authority to start a nuclear war. Within minutes, the president could unleash the equivalent of more than 10,000 Hiroshima bombs. He does not need a second opinion … Yet it would mean the end of civilization as we know it.” \n\nHaving grown frustrated with the lack of progress in moving toward nuclear disarmament under the Npt, the majority of non-nuclear states adopted a Treaty on the Prohibition of Nuclear Weapons, which entered into force in 2021. The Tpnw aims to prohibit nuclear weapons and require states to destroy any existing ones. While 74 countries have ratified it, none of the nine nuclear-weapon states has followed their lead.\n\n In fact, the US, Britain, and France responded to the Tpnw's adoption by arguing that nuclear deterrence “has been essential to keeping the peace in Europe and North Asia for over 70 years”. \n\nNonetheless, they have at least reiterated their commitment, under the Npt, to disarmament, stating that they “believe strongly that the further spread of [nuclear] weapons must be prevented.” In the not-too-distant past, the original five nuclear-weapon states did work together to prevent the spread of nuclear weapons in the cases of North Korea, Iraq, and Iran. But North Korea ended up withdrawing from the Npt, and Iraq was invaded by a US- and UK-led “coalition of the willing”, on the false pretext that Saddam Hussein had undeclared weapons of mass destruction.\n\n In the case of Iran, an agreement between that country and the five nuclear-weapon states aimed to build trust through cooperation and enhanced transparency, but it unravelled when the first Trump administration withdrew from the deal, known as the Joint Comprehensive Plan of Action, in 2018. Then, despite the IAEA reporting that there are “no credible indications of an ongoing, undeclared structured nuclear program” in Iran, Israel and the second Trump administration took it upon themselves to launch airstrikes against Iran’s nuclear-fuel-cycle infrastructure.\n\nChain reaction \n\nNotwithstanding statements and assurances by the five original nuclear-weapon states that their arsenals are only for defensive purposes, and that a “nuclear war cannot be won and must never be fought,” some have begun to emphasize the value of nuclear weapons and espouse the principle of might makes right. Former Russian president Dmitry Medvedev, for example, warns that a “defeat of a nuclear power in a conventional war may trigger a nuclear war”, adding that “nuclear powers have never lost major conflicts on which their fate depends”. \n\nSimilarly, US secretary of defence Pete Hegseth recently stated that, “We’re not building for peacetime; we are pivoting the Pentagon and industrial base to a wartime footing.” \n\nThe Trump administration has coupled such rhetoric with threats or the actual use of force (or US weapons) against a wide range of countries and territories, including Iran, the occupied Palestinian enclaves, Denmark, Canada, Venezuela, and Nigeria.\n\n In this fraught new environment, some US allies are starting to doubt the reliability of the US nuclear umbrella. Japan and South Korea are now examining their defence capabilities. And in Germany, Chancellor Friedrich Merz previously stated an openness to talks with France and the UK about “sharing” nuclear weapons in Europe to boost “the US shield”.\n\n Thus, geopolitical developments are leading to the steady crumbling, if not outright demolition, of the international architecture for maintaining peace and security. \n\n So, the message is that, if you want the ultimate security guarantee, you must have the bomb; and that if you do have it, you can get away with murder\n\n Ukraine, which agreed to give up its nuclear weapons in exchange for security guarantees, understands this all too well.\n\n Whatever they say, the nuclear-weapon states have clearly reneged on their commitment to nuclear disarmament and are now rushing in the opposite direction. Sophisticated technologies — including autonomous weapons — and global tensions have brought the world to an extraordinarily dangerous place. The current nuclear arms-control regime always had to treat some as being more equal than others. But it can no longer be sustained. Soon, others will shake off its yoke and develop their own “deterrence.” \n\nMore nuclear weapons will mean more vulnerabilities, owing to growing cyber capabilities, shaky command-and-control systems, and the age-old risk of sleepwalking into conflict. There has never been a greater or more urgent need for dialogue, trust-building among major powers, a rules-based system, and new efforts at disarmament.\n\n Mohamed ElBaradei, a former vice president of Egypt and director general of the International Atomic Energy Agency, is a Nobel Peace Prize laureate.\n www.project-syndicate.org","summary":"Not only are major nuclear-weapon states failing to pursue arms control and disarmament; they are openly doubling down on \"modernising\" and expanding their arsenals to match their increasingly bellicose rhetoric","url":"https://www.irishexaminer.com/opinion/commentanalysis/arid-41762768.html","image":"https://www.irishexaminer.com/cms_media/module_img/9816/4908008_9_seoimage1x1_81ef8e28a57e4bcdae7cac451e0cd7c0.jpg.jpg","video":null,"publish_date":"2025-12-26 01:00:00","author":"Irishexaminer.com,Mohamed Elbaradei","authors":["Irishexaminer.com","Mohamed Elbaradei"],"language":"en","source_country":"ie","sentiment":-0.123},{"id":389063952,"title":"Trump rants about Epstein in Christmas Day post claiming he dropped ties with sex offender ‘long before it became fashionable’","text":"President Donald Trump has shared a bizarre Christmas day social media post about Jeffrey Epstein, saying that he dropped ties with the late sex offender “long before it became fashionable,” and that the controversy surrounding the release of the so-called Epstein files is a “Radical Left Witch Hunt.”\n\nThe Trump administration has been facing ongoing scrutiny, mainly from Democrats but also some Republicans, for its handling of government files related to Epstein as the public pushes for more transparency about the disgraced financiers’ life and crimes. \n\n“Merry Christmas to all, including the many Sleazebags who loved Jeffrey Epstein...only to ‘drop him like a dog’ when things got too HOT, falsely claimed they had nothing to do with him, didn’t know him, said he was a disgusting person, and then blame, of course, President Donald J. Trump, who was actually the only one who did drop Epstein, and long before it became fashionable to do so,” Trump wrote on Truth Social Thursday evening.\n\nThe president was friends with Epstein decades ago, calling him a “terrific guy” in a 2002 New York magazine profile. In the midst of the Epstein controversy, The Wall Street Journal reported on a lewd birthday card Trump supposedly gave Epstein in 2003, but the president has denied that he authored such a letter. \n\nBut Trump has said their relationship ended before Epstein pleaded guilty in 2008 to soliciting a minor for prostitution. The White House has said Trump did “nothing wrong” and that the president kicked Epstein out of his Mar-a-Lago club in Palm Beach for being a “creep.”\n\nTrump suggested in Wednesday’s Truth Social post that these people who thought Epstein was “the greatest guy on earth” were all Democrats.\n\n“When their names get brought out in the ongoing Radical Left Witch Hunt...and it is revealed that they are Democrats all, there will be a lot of explaining to do...Enjoy what may be your last Merry Christmas!” Trump wrote. \n\nWhen the Justice Department started to release its trove of Epstein documents last Friday — thanks to Congress pushing through legislation to force the Trump administration to reveal all the information it had on the convicted sex offender — photos of former Democratic President Bill Clinton emerged. \n\nIn one photo, Clinton and Epstein were smiling as they stood next to each other wearing silky shirts. In another, Clinton was swimming in a pool with Epstein’s longtime associate and convicted sex trafficker Ghislaine Maxwell. \n\nThis is a developing story...","summary":"Trump suggested Democrats ‘loved Jeffrey Epstein’ and said they should ‘enjoy what may be your last Merry Christmas!’","url":"https://www.independent.co.uk/news/world/americas/us-politics/epstein-trump-christmas-hoax-post-b2890550.html","image":"https://static.independent.co.uk/2025/12/26/0/32/GettyImages-2252765920.jpg?crop=5388,3592,x2,y0&trim=0,2,0,2&width=1200","video":"https://cdn.jwplayer.com/videos/Ih2N0yFO-4VHSaSK0.mp4","publish_date":"2025-12-26 00:53:40","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","source_country":"gb","sentiment":-0.344},{"id":389063732,"title":"Trump says U.S. carried out strikes against Islamic State terrorists in Nigeria","text":"U.S. President Donald Trump announced late on Thursday that he ordered a \"powerful and deadly strike\" on Islamic State terrorists in Nigeria, who have been \"targeting and viciously killing, primarily, innocent Christians.\"\n\n\"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!,\" Trump wrote on his Truth Social platform.\n\nU.S. Africa Command confirmed the strikes, and saying they were carried out in Soboto State \"at the request of Nigerian authorities.\" \n\nWar Secretary Pete Hegseth followed up with a post on X where he thanked the Nigerian government for its \"support and cooperation,\" signing off with \"more to come.\" \n\nTrump said earlier this year he had ordered the Pentagon to begin planning for potential military action in Nigeria in connection with attacks against the country's Christian population.","url":"https://www.i24news.tv/en/news/international/africa/artc-trump-says-u-s-carried-out-strikes-against-islamic-state-terrorists-in-nigeria","image":"https://cdn.i24news.tv/uploads/86/e2/1f/bc/1f/c0/20/47/2b/13/92/94/3a/9a/88/15/86e21fbc1fc020472b1392943a9a8815.jpg","video":null,"publish_date":"2025-12-26 00:51:48","author":null,"language":"en","category":"politics","source_country":"il","sentiment":-0.142},{"id":389061660,"title":"FG committed to protecting religious freedom – Tuggar","text":"The Minister of Foreign Affairs, Ambassador Yusuf Maitama Tuggar, has reaffirmed the Federal Government’s commitment to protecting religious freedom and promoting peaceful coexistence among Nigerians.\n\nIn a Christmas message issued on Thursday, Tuggar extended greetings to Christians in Nigeria and in the diaspora, assuring that the government would continue efforts aimed at strengthening social cohesion and national unity.\n\nHe said Christmas offers an opportunity for reflection, dialogue and renewed commitment to mutual respect among Nigeria’s diverse religious communities.\n\nAccording to a statement signed by his media aide, Alkasim Abdulkadir, the minister said government institutions would continue to be strengthened to protect all religious adherents and promote harmony across the country.\n\n“The Nigerian state is founded on the principle of freedom of worship and mutual respect among its people,” Tuggar said.\n\n“We are resolute in reinforcing our institutions to uphold these values, deepen interfaith understanding, and ensure that no citizen is excluded or marginalised on account of belief.”\n\nThe minister added that the safety and rights of Nigerians of all faiths, both within the country and in the diaspora, remain a priority in government policy and diplomatic engagements.\n\nHe urged citizens to use the Christmas season to promote unity, patience and tolerance, noting that Nigeria’s strength lies in its diversity and shared sense of purpose.\n\nTuggar’s remarks come amid renewed international attention on religious freedom in Nigeria. In October, former United States President Donald Trump accused the Federal Government of failing to curb attacks on Christians and described Nigeria as a “Country of Particular Concern” in a post on his Truth Social account, warning that continued violence could attract sanctions, including restrictions on US aid.","summary":"The Nigerian government reaffirms its commitment to protecting religious freedom and promoting peaceful coexistence and national unity for all citizens.\n\nRead More: https://punchng.com/fg-committed-to-protecting-religious-freedom-tuggar/","url":"https://punchng.com/fg-committed-to-protecting-religious-freedom-tuggar/","image":"https://cdn.punchng.com/wp-content/uploads/2016/10/17155511/punchlogo.png","video":null,"publish_date":"2025-12-26 00:46:54","author":"Gift Habib,Punch Newspapers","authors":["Gift Habib","Punch Newspapers"],"language":"en","source_country":"ng","sentiment":0.029},{"id":389062570,"title":"US Launches Strikes on ISIS in Nigeria Following Attacks on Christian Communities, Says Trump","text":"WEST PALM BEACH, Fla. – On Thursday night, President Donald Trump announced a significant U.S. military action targeting Islamic State militants in Nigeria, after weeks of criticizing the West African nation for its alleged inability to protect Christians from persecution.\n\nThe president took to social media to declare, “Under my command as Commander in Chief, the United States executed a powerful and deadly strike against ISIS terrorists in Northwest Nigeria. These extremists have been aggressively targeting and killing innocent Christians at alarming rates not seen in years, even centuries!”\n\nDetails regarding the specifics of the strike and its impact were not disclosed by the president. However, the U.S. Africa Command confirmed on X that the operation was carried out at the request of Nigerian authorities in Soboto State, resulting in the deaths of several ISIS members.\n\n“Our decisive strikes against ISIS underscore the might of our military forces and our unwavering commitment to addressing terrorist threats against Americans both domestically and internationally,” stated the U.S. Africa Command in their post.\n\nThe Defense Department has yet to provide further comments on the operation.\n\nAmid Trump’s previous remarks, the Nigerian government has responded by highlighting that various religious communities, not only Christians, have been victims of attacks by extremist groups.\n\nStill, last month, Trump said he’d ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department has also announced it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country.\n\nAnd the U.S. recently designated Nigeria a “country of particular concern” under the International Religious Freedom Act.\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump wrote in his Christmas night post. \n\nHe said that U.S. defense officials had “executed numerous perfect strikes, as only the United States is capable of doing” and added that “our Country will not allow Radical Islamic Terrorism to prosper.”\n\nNigeria’s population of 220 million is split almost equally between Christians and Muslims. The country has long faced insecurity from various fronts including the Boko Haram extremist group, which seeks to establish its radical interpretation of Islamic law and has also targeted Muslims it deems not Muslim enough.\n\nBut attacks in Nigeria often have varying motives. There are religiously motivated ones targeting both Christians and Muslims, clashes between farmers and herders over dwindling resources, communal rivalries, secessionist groups and ethnic clashes.\n\nThe U.S. security footprint has diminished in Africa, where military partnerships have either been scaled down or canceled. U.S. forces likely would have to be drawn from other parts of the world for any military intervention in Nigeria.\n\nTrump has nonetheless kept up the pressure as Nigeria faced a series of attacks on schools and churches in violence that experts and residents say targets both Christians and Muslims.\n\nDefense Secretary Pete Hegseth posted Thursday night on X: “The President was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end.”\n\nHegseth said that U.S. military forces are “always ready, so ISIS found out tonight — on Christmas” and added, “More to come…Grateful for Nigerian government support & cooperation” before signing off, “Merry Christmas!”","summary":"Internewscast Journal\n\nInternewscast\n\n\nWEST PALM BEACH, Fla. – On Thursday night, President Donald Trump announced&#8230;\n\n\nThis Post: US Launches Strikes on ISIS in Nigeria Following Attacks on Christian Communities, Says Trump first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/us-launches-strikes-on-isis-in-nigeria-following-attacks-on-christian-communities-says-trump/","image":"https://internewscast.com/wp-content/uploads/2025/12/1766709887_Trump-says-US-struck-Islamic-State-targets-in-Nigeria-after.jpg","video":null,"publish_date":"2025-12-26 00:45:44","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.301},{"id":389061460,"title":"Which states tax Social Security benefits? See the map and tax rates.","text":"Americans on Social Security could see new federal tax breaks in 2026 — and some states will stop taxing benefit income.The largest social safety net in the US provides monthly payments that help 74 million people afford essentials. Americans pay into the program during their working careers&comma; which is also supplemented by the federal government.Beneficiaries&apos; final tax bill depends on their state&comma; annual income&comma; and eligibility for deductions.Social Security income is typically taxed at the national level. Americans may pay taxes on up to 85% of their Social Security payments&comma; depending on household income.But those who take home less than $25&comma;000 as an individual and $32&comma;000 as a couple do not have their benefits taxed. Need-based Supplemental Social Security also isn&apos;t subject to tax.And President Donald Trump&apos;s One Big Beautiful Bill Act will bring more tax relief to seniors. In the new year&comma; taxpayers 65 and older can claim up to $6&comma;000 in addition to their normal standard deduction. This builds on an existing tax deduction for older adults. The expanded breaks under Trump are set to last through 2028.This means that older Americans filing their 2025 tax returns can write off as much as $23&comma;750&comma; and joint filers over 65 could claim as much as $46&comma;700.States are able to set their own Social Security tax rules alongside national requirements. Eight states taxed Social Security income this year&comma; while 41 didn&apos;t. And&comma; in 2026&comma; West Virginia will stop taxing benefits.The amount beneficiaries will pay in state-level taxes varies widely depending on a local laws and household earnings. Connecticut&comma; Minnesota&comma; Montana&comma; New Mexico&comma; Rhode Island&comma; Utah&comma; and Vermont tax Social Security — though lower-income retirees are often exempt.Colorado also allows some seniors to deduct their federal Social Security taxes from their expected state contribution.See below if your state taxes benefit income.Do you have a story to share about Social Security? Reach out to this reporter at allisonkelly@businessinsider.com or via Signal at alliekelly.10","summary":"Some states tax Social Security benefits while others don't. See the map to find out if your benefits will be affected in 2026.","url":"https://www.businessinsider.com/social-security-benefits-tax-state-map-2026","image":"https://i.insider.com/694585c404eda4732f2de016?width=1200&format=jpeg","video":null,"publish_date":"2025-12-26 00:41:55","author":"Allie Kelly","authors":["Allie Kelly"],"language":"en","source_country":"us","sentiment":0.044},{"id":389064588,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - Guyana Inquirer – Daily Guyana News","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://guyanainquirer.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://guyanainquirer.com/app/uploads/2025/12/breaking-news@2x-1738224819-sGWHd3.png","video":null,"publish_date":"2025-12-26 00:38:59","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gy","sentiment":0.656},{"id":389063420,"title":"FG confirms US airstrikes on terrorists, cites intelligence cooperation","text":"The Federal Government has confirmed ongoing security and intelligence cooperation between Nigeria and the United States following airstrikes that hit terrorist targets in Nigeria’s North West.\n\nIn a statement issued on Friday, the Ministry of Foreign Affairs, signed by spokesperson Kimiebi Ebienfa, said Nigerian authorities remain engaged in “structured security cooperation with international partners, including the United States of America,” to address terrorism and violent extremism in the country.\n\nThe ministry said the collaboration, which led to precision airstrikes on terrorist targets, involves intelligence sharing, strategic coordination and other forms of support in line with international law, respect for Nigeria’s sovereignty and shared security commitments.\n\n“Nigeria reiterates that all counter-terrorism efforts are guided by the primacy of protecting civilian lives, safeguarding national unity, and upholding the rights and dignity of all citizens, irrespective of faith or ethnicity,” the statement said.\n\nIt added that terrorist violence, “whether directed at Christians, Muslims, or other communities, remains an affront to Nigeria’s values and to international peace and security.”\n\nThe statement followed comments by United States President Donald Trump, who said on Thursday that US forces had carried out deadly strikes against Islamic State terrorists in Northwestern Nigeria.\n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians,” Trump wrote on his Truth Social platform.\n\nHe added, “The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nTrump warned that further attacks would follow if the killing of Christians continued, saying, “If they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was.”\n\nIn a separate social media post, US Defence Secretary Pete Hegseth said Washington acted with Nigeria’s cooperation.\n\n“Grateful for Nigerian government support & cooperation,” Hegseth wrote, adding that the Department of War was “always ready.”\n\nThe Ministry of Foreign Affairs said Nigeria would continue to work with its partners through established diplomatic and security channels to weaken terrorist networks, disrupt their financing and logistics, and prevent cross-border threats.\n\nThe airstrikes came a day after a bomb attack on a mosque in Maiduguri, Borno State, killed five people and injured dozens in what authorities suspect was a suicide bombing.\n\nThe ministry said it would keep the public informed through appropriate official channels.","summary":"Nigeria&#8217;s government confirms cooperation with the US on airstrikes targeting terrorists in the North West, citing intelligence and security collaboration.\n\nRead More: https://punchng.com/fg-confirms-us-airstrikes-on-terrorists-cites-intelligence-cooperation/","url":"https://punchng.com/fg-confirms-us-airstrikes-on-terrorists-cites-intelligence-cooperation/","image":"https://cdn.punchng.com/wp-content/uploads/2016/10/17155511/punchlogo.png","video":null,"publish_date":"2025-12-26 00:34:29","author":"Punch Newspapers,United States President","authors":["Punch Newspapers","United States President"],"language":"en","category":"politics","source_country":"ng","sentiment":0.253},{"id":389035298,"title":"King Charles calls for &#8216;reconciliation&#8217; in Christmas speech","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBritain's King Charles III smiles during the recording of his Christmas message in the Henry VII Lady Chapel of Westminster Abbey in central London on December 11, 2025. This year marks the first time the Sovereign's Christmas message has been filmed outside a Royal residence since 2006, when it was filmed at Southwark Cathedral. (Photo by Aaron Chown / POOL / AFP) \n\n International News, Latest News \n\nDecember 25, 2025\n\n\n\n\n King Charles calls for ‘reconciliation’ in Christmas speech \n\n\n\n\n\n\n\nLONDON, United Kingdom (AFP)—Britain’s King Charles III called for “compassion and reconciliation” at a time of “division” across the world in his Christmas Day message Thursday.\n\nThe 77-year-old monarch said he found it “enormously encouraging” how people of different faiths had a “shared longing for peace”.\n\nCharles praised individuals who risked their lives to save others in situations of violence, including those caught up in the killings at a Jewish event at Bondi Beach in Australia this month.\n\n“Individuals and communities have displayed spontaneous bravery, instinctively placing themselves in harm’s way to defend others,” said the king whose words were accompanied by images of events at Bondi.\n\nEighty years after the end of World War II, the king said the courage of servicemen and women and the way communities came together after the conflict carried “a timeless message for us all”.\n\n“These are the values which have shaped our country,” he said.\n\n“As we hear of division both at home and abroad, they are the values of which we must never lose sight,” Charles said in a message recorded at Westminster Abbey and broadcast nationally.\n\n– No mention of royal tribulations –\n\n“With the great diversity of our communities, we can find the strength to ensure that right triumphs over wrong. It seems to me that we need to cherish the values of compassion and reconciliation the way our Lord lived and died.”\n\nIn October, Charles became the first head of the Church of England to pray publicly with a pope since a schism with Rome 500 years ago, in a service led by Leo XIV at the Vatican. He called it a “historic moment of spiritual unity”.\n\nA few days earlier Charles met survivors of a deadly attack on a synagogue and members of the Jewish community in the northern English city of Manchester.\n\nThis is the second year running that the king has made his festive address away from a royal residence.\n\nLast year he spoke from a former hospital chapel as he thanked medical staff for supporting the royal family in a year in which he announced his cancer diagnosis.\n\nThis year, Charles did not make any reference to his battle with the illness, nor did he mention his younger brother Andrew who in October was stripped of his royal titles over his links to convicted US sex offender Jeffrey Epstein.\n\nThe message did feature images of his son and heir Prince William, as well as his grandson George.\n\nThe Christmas song that ended the message was sung by a Ukrainian choir formed after Russia’s 2022 invasion of their country.\n\nThe king and other members of the royal family, including Andrew’s daughters, attended a Christmas service at St Mary Magdalene Church on Charles’s private Sandringham estate in Norfolk.\n\n\n\n\n\n\n\n\nTags: compassion King Charles III reconciliation \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Lucea mayor defends new Christmas tree as he blasts detractors \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n HANOVER, Jamaica — As the festive glow of the Christmas season settles over Hanover's parish capital, Mayor of Lucea, Sheridan Samuels is issuing a st... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n DJ Mac gives UK-based Drip Rick Vi the green light \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fast rising Uk-based dancehall artiste Drip Rick Vi is enjoying a great run in dancehall. The witty deejay has scored a place on one of the hottest be... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Complex Ricki wants to ‘Make a Change’ \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fusion reggae artiste Complex Ricki is generating a major buzz on the streets with her latest ambitious single, Make a Change , dedicated to the survi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Democrats demand probe into Caribbean boat strikes \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n WASHINGTON, United States (CMC) – As United States President Donald Trump expands the US military build-up in the Caribbean, Democratic legislators ar... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n WATCH: Wanted man killed in Manchester confrontation, police say \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n MANCHESTER, Jamaica — One of Manchester’s most wanted men was fatally shot during an alleged confrontation with the police in Mike Town in the parish ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Two American men denied bail on rape charges in The Bahamas \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n NASSAU, Bahamas (CMC) – Two American men were denied bail when they appeared in a magistrate’s court in The Bahamas charged with raping a 25-year-old ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n ‘Mi Rahtid’, Jamaican grandma turns social media star serving up recipes \n\n\n\n\n Vanassa McKenzie, Observer Online reporter, mckenziev@jamaicaobserver.com \n\n\n\nDecember 25, 2025 \n\n\n A Florida family’s efforts to preserve their Jamaican matriarch’s recipes, passed down through generations, have transformed the 96-year-old woman int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n US congresswoman condemns death of Haitian man in ICE custody \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n NEW YORK, United States (CMC) – United States Democratic Congresswoman, Yvette Clarke, has condemned the death of a Haitian man in the custody of the ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/25/king-charles-calls-reconciliation-christmas-speech/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/AFP__20251223__88XU83A__v1__MidRes__BritainRoyalsChristmas-1024x683.jpg","video":null,"publish_date":"2025-12-26 00:34:05","author":null,"language":"en","category":"entertainment","source_country":"jm","sentiment":0.352},{"id":389062582,"title":"US Executes Strategic Strike on ISIS in Nigeria Following Attacks on Christians, Announces President Trump","text":"On Thursday, President Donald Trump announced via his social media platform that he had ordered a “powerful and deadly strike” against ISIS terrorists in Nigeria. According to Trump, these terrorists have been predominantly targeting and brutally killing innocent Christians.\n\nThis announcement follows a video Trump shared in early November, where he threatened military intervention in Nigeria, declaring he would go in “guns-a-blazing.” Around the same time, Defense Secretary Pete Hegseth backed Trump’s stance, stating on X (formerly Twitter) that the Department of Defense was gearing up for action.\n\nIn his social media post, Trump emphasized, “I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nThe specifics regarding the strike’s outcome or its precise targets remain unclear. ABC News has reached out to the White House seeking further details.\n\nHegseth, in another post on X, hinted at additional actions to come and expressed gratitude to the Nigerian government for its support and cooperation.\n\nHe reiterated the President’s stance from the previous month, emphasizing that the killing of innocent Christians in Nigeria and elsewhere must come to an end.\n\n“The @DeptofWar is always ready, so ISIS found out tonight — on Christmas.”\n\nHegseth ended his post with, “Merry Christmas!”\n\nThis is a developing story. Please check back for updates.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn Thursday, President Donald Trump announced via his social media platform that&#8230;\n\n\nThis Post: US Executes Strategic Strike on ISIS in Nigeria Following Attacks on Christians, Announces President Trump first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/us-executes-strategic-strike-on-isis-in-nigeria-following-attacks-on-christians-announces-president-trump/","image":"https://internewscast.com/wp-content/uploads/2025/12/US-launches-deadly-strike-on-ISIS-targets-in-Nigeria-after.jpg","video":null,"publish_date":"2025-12-26 00:33:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.125},{"id":389063928,"title":"Trump says US military launched strikes on ISIS terrorists in Nigeria","text":"President Donald Trump announced that the U.S. military conducted \"powerful and deadly\" strikes against ISIS targets in Northwest Nigeria on Christmas Day evening. \n\nTrump stated the strikes were ordered in response to ISIS \"targeting and viciously killing, primarily, innocent Christians\" in the region. \n\nHe had previously warned that if the \"slaughtering of Christians\" did not cease, there would be \"hell to pay,\" and confirmed that the \"Department of War\" executed the strikes. \n\nPentagon chief Pete Hegseth and White House Press Secretary Karoline Leavitt also posted online about the strikes, with Hegseth thanking the Nigerian government for its support. \n\nWhile Trump and some church leaders claim Christians are persecuted, experts and residents suggest the violence in Nigeria is widespread, affecting all citizens regardless of faith.","summary":"","url":"https://www.independent.co.uk/bulletin/news/trump-isis-terrorists-nigeria-christians-b2890549.html","image":"https://static.independent.co.uk/2025/12/25/14/46/GettyImages-2252098055.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/6MvJTMqm-OhrQWqOm.mp4","publish_date":"2025-12-26 00:31:10","author":"Samantha Beech","authors":["Samantha Beech"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.06},{"id":389064248,"title":"Even Trump-Aligned Economists Warn President Is About to Upend U.S. Health Care","text":"President Donald Trump has spent months promising a straightforward solution for one of America’s biggest frustrations: prescription drug prices. Last week, he finally unveiled his plan, called TrumpRX, featuring large figures, bold language, and an eye-catching promise.\n\nA group of economists, some of whom usually support Trump, began warning that the plan could backfire and that patients might end up facing hidden costs.\n\nAccording to a recent Fox News report, TrumpRX is based on a government price cap for medications, along with a new direct-to-consumer initiative that would encourage patients to buy lower-priced drugs directly from manufacturers. Trump also highlighted $150 billion in new investments from nine drug companies as part of the announcement.\n\nOn the surface, this sounds like a win, however, the economists Fox consulted argued that the math isn’t so simple from a broader perspective. They explained that price caps do not eliminate the underlying cost of drugs; instead, they just change who pays and how much. This could lead to higher costs elsewhere in the supply chain, reduced coverage, fewer choices, or decreased motivation to develop new treatments.\n\nMichael Baker, director of healthcare policy at the American Action Forum, said the following: “At the most basic level, government price setting only limits what patients pay for a drug, which usually shows up in out-of-pocket or co-insurance payments,” Baker told Fox News, continuing: “This doesn’t address the overall cost of the drug, which someone still has to pay, nor does it reduce development costs.”\n\nHe then added that it will be less effective than the current healthcare system: “Patients will experience far less of the crown jewel of the U.S. healthcare system that they are currently used to receiving,” Baker said.\n\nThe economists fear that government-set pricing could slowly restrict that stream. If the rewards diminish enough, companies will adjust by developing fewer new drugs, taking fewer risks, and investing less in research that may not succeed.\n\nWhat made the Fox News report particularly noteworthy is that skepticism was not limited to economists from think tanks critical of Trump. Even experts at the Heritage Foundation, a conservative organization often aligned with Republican views, expressed caution.\n\nEd Haislmaier, a Heritage expert in healthcare policy and markets, told the outlet that the most harmful type of price control is the one that caps what a company can charge at launch, when a new product hits the market and the incentive to innovate is at its highest.\n\n“The kind of government price controls that are most damaging to innovation limit the initial price a company can charge for a new product. Some countries face this issue, but fortunately, it hasn’t happened yet in the United States,” Haislmaier said.\n\nTrump wants a populist win with lower drug prices, but economists warn that it will cause ripple effects, and voters may not notice the downsides until later, when fewer new treatments become available or when coverage tightens.\n\nTrump has portrayed TrumpRX as a common-sense move that makes the market work. But some detractors feel the government is meddling, disguised as consumer empowerment. If the policy faces issues or if costs shift unexpectedly for patients, the same promise that made it popular could turn into a liability.","summary":"Trump’s flashy TrumpRX pitch promises cheaper drugs, but even friendly economists say the real costs could show up later.","url":"https://www.inquisitr.com/even-trump-aligned-economists-warn-president-is-about-to-upend-u-s-health-care","image":"https://www.inquisitr.com/wp-content/uploads/2025/11/Donald-Trumps-Healthcare-Plan-Questions-If-He-Knows-the-System-At-All.jpg","video":null,"publish_date":"2025-12-26 00:30:05","author":"Frank Yemi","authors":["Frank Yemi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.059},{"id":389062586,"title":"Trump Orders Strategic Operation Against ISIS in Nigeria","text":"In a bold declaration, Donald Trump revealed a “powerful and deadly” Christmas Day operation targeting ISIS militants in Nigeria, whom he referred to as “terrorist scum.” The former president emphasized that this move was a response to the ongoing persecution of Christians by radical groups in the region.\n\nTrump, who had previously hinted at deploying the US military to Nigeria with full force, shared this announcement through a post on Truth Social on Thursday evening. He stated, “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria.” He further highlighted that these militants have been targeting and killing innocent Christians at unprecedented levels.\n\nConfirming the operation, a Pentagon spokesperson told The Daily Mail that the strikes were conducted with the Nigerian government’s approval and in collaboration with the US military. This cooperation underscores the continued partnership between the two nations in combating terrorism.\n\nIn his extended message, Trump expressed that the ISIS militants had long been overdue for such a counteraction. “I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” he asserted, underscoring his commitment to confronting extremist threats head-on.\n\nTrump said in his lengthy post that the ISIS militants have had it coming for some time.\n\n‘I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was.’\n\nIt is not yet clear how many have been killed or injured by the strike. \n\n‘The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper,’ Trump added. \n\nThe president signed off with a warning for the terrorists that they will continue to pay if the murder of innocent Christians goes on. \n\n‘May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues.’ \n\nThe president’s post did not include information about how the strike was carried out and what effects it had and the White House did not immediately provide further details. \n\nDefense Secretary Pete Hegseth affirmed the president’s message in a social media post of his own. \n\n‘The President was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. The @DeptofWar is always ready, so ISIS found out tonight — on Christmas. More to come… Grateful for Nigerian government support & cooperation. Merry Christmas!’\n\nNigeria has been roiled by internal violence in the wake of a jihadist insurgency spearheaded by extremist group Boko Haram in the northeast since 2009. \n\nIn November, Trump threatened to take on the terrorists with ‘guns-a-blazing.’\n\nTrump, 79, had already designated Nigeria a ‘country of particular concern,’ but he took his condemnation of the situation in the country even further after hearing about it on Fox News, threatening to cut aid and even send in US troops. \n\nSome Christian communities have welcomed the US president’s menace, believing that foreign armies are needed to restore peace in their homeland. \n\nAmid the various forms of bloodletting around the country – including ethnic rivalry and banditry – the Islamist militants have been slaughtering Christians as well as Muslims they regard as ‘apostates’ for failing to comply with their brand of Islam. \n\nThere has also been a separate onslaught by Fulani Muslim tribesmen against mainly Christian farming communities, a protracted crisis linked to a tangle of issues like religion, ethnicity and a scramble over the dwindling supply of arable land. \n\nWhile Christians are among those targeted, analysts say the majority of victims of armed groups are Muslims in Nigeria’s Muslim-majority north, where most attacks occur, according to the Associated Press. \n\nTrump’s threat, which came after he watched a Fox News segment about the conflict in Nigeria, triggered alarm bells across West Africa. \n\nAnonymous sources from the United States Africa Command (AFRICOM), which directs American military operations across the continent, told the Washington Post Trump’s announcement prompted concern. \n\nThey said a US military operation in an area where there is little US intelligence was unlikely to make a difference, and leaders called for their sovereignty to be respected.\n\n‘We welcome U.S. assistance as long as it recognizes our territorial integrity,’ Daniel Bwala, an adviser to President Tinubu, told Reuters.\n\nTrump’s explosive announcement also came via Truth Social. \n\n‘If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, ‘guns-a-blazing,’ to completely wipe out the Islamic Terrorists who are committing these horrible atrocities,’ he wrote. \n\n‘I am hereby instructing our Department of War to prepare for possible action. \n\n‘If we attack, it will be fast, vicious, and sweet, just like the terrorist thugs attack our CHERISHED Christians! WARNING: THE NIGERIAN GOVERNMENT BETTER MOVE FAST!’\n\nBwala sought to play down tensions between the two states, despite Trump calling Nigeria a ‘disgraced country.’\n\n‘We don’t take it literally, because we know Donald Trump thinks well of Nigeria,’ Bwala said.\n\n‘I am sure by the time these two leaders meet and sit, there would be better outcomes in our joint resolve to fight terrorism,’ he said.\n\nNigeria, a country of more than 200 million people and around 200 ethnic groups, is divided between the largely Muslim north and mostly Christian south.\n\nIslamist insurgents such as Boko Haram and Islamic State West Africa Province have wrought havoc in the country for more than 15 years, killing thousands of people, but their attacks have been largely confined to the northeast of the country, which is majority Muslim.\n\nWhile Christians have been killed, the vast majority of the victims have been Muslims, analysts say.\n\nIn central Nigeria there have been frequent clashes between mostly Muslim herders and mainly Christian farmers over access to water and pasture, while in the northwest of the country, gunmen routinely attack villages, kidnapping residents for ransom.\n\nNigeria ‘does not discriminate against any tribe or religion in the fight against insecurity,’ Bwala said. ‘There is no Christian genocide.’ \n\nIn mid-December, Trump placed the country on a list of 15 that faced partial travel bans to the US in a response to anti-Christian violence in Nigeria. \n\n‘The United States is taking decisive action in response to the mass killings and violence against Christians by radical Islamic terrorists, Fulani ethnic militias, and other violent actors in Nigeria and beyond,’ Secretary of State Marco Rubio said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn a bold declaration, Donald Trump revealed a &#8220;powerful and deadly&#8221; Christmas&#8230;\n\n\nThis Post: Trump Orders Strategic Operation Against ISIS in Nigeria first appeared on Internewscast Journal","url":"https://internewscast.com/news/trump-orders-strategic-operation-against-isis-in-nigeria/","image":"https://internewscast.com/wp-content/uploads/2025/12/Trump-launches-deadly-strike-on-ISIS-terrorists-in-Nigeria.jpg","video":null,"publish_date":"2025-12-26 00:27:41","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.007},{"id":389061306,"title":"Trump, 79, Fawns Over Little Girl, 8, While Epstein Drama Rages","text":"President Donald Trump complimented a “beautiful” and “cute”-sounding 8-year-old girl, whom he also called “honey,” during a Christmas Eve phone call.\n\nTrump, 79, was taking calls from children throughout the country who were asking about Santa Claus, as is tradition. While the president was in Mar-a-Lago over the holiday period, back in Washington, D.C., the Department of Justice was frantically trying to complete its delayed and widely criticized release of its files about dead sex offender Jeffrey Epstein, a former friend of Trump’s.\n\n“Hi, how are you doing? OK?” Trump asked. \n\n“Yes, how about you?” the youngster replied. \n\n“I’m fine,” he said. “You sound so beautiful and cute.”\n\nTrump then asked how old she was, even though the phone operator for the North American Aerospace Defense Command (NORAD) had given the president that information beforehand.\n\n“I’m 8,” she answered. \n\n“Wow. So smart. You sound so smart,” he responded. “So, do you have a question for Santa, or do you want to know anything about Santa?”\n\nWhen the girl asked if Santa would get mad if she didn’t leave out milk and cookies, Trump didn’t immediately answer, then asked her to repeat herself. He then replied that Santa would not be mad, but he would be disappointed.\n\n“Santa tends to be a little on the cherubic side,” he told Anna. “You know what ‘cherubic’ means? A little on the heavy side.”\n\nTrump later concluded the call by calling the little girl “honey” and complimenting North Carolina, a state he won in last year’s presidential election. He did the same during calls with children from Oklahoma and Pennsylvania.\n\nMany X users said Trump’s comments didn’t come across well, given that his Department of Justice is nearly a week late in delivering all of the files it was compelled to release relating to convicted pedophile Jeffrey Epstein. Some told the president to “read the room,” while others blacked out Trump’s face—a reference to the redactions of some influential figures in the Epstein files.\n\nThe White House did not immediately respond to a request for comment from the Daily Beast.\n\nThe legal deadline for the Justice Department to release its files on Epstein was last Friday, but more than “a million” documents have yet to be released, the DOJ said Thursday. Deputy Attorney General Todd Blanche said the process would take weeks, and the DOJ has asked lawyers to work through the holiday to help get them released as quickly as possible.\n\nAs for the files that have been released, the DOJ has been criticized by Epstein’s victims for being overly selective in its “abnormal and extreme redactions with no explanation.”\n\nRepublican Rep. Thomas Massie agreed. \n\n“DOJ did break the law by making illegal redactions and by missing the deadline,” Massie wrote on X. “By the way, who’s controlling the DOJ X account on Christmas Eve and using words like ‘dope’ to refer to reporters?”","summary":"ANDREW CABALLERO-REYNOLDS / AFP via Getty ImagesPresident Donald Trump complimented a “beautiful” and “cute”-sounding 8-year-old girl, whom he also called “honey,” during a Christmas Eve phone call.\n\nTrump, 79, was taking calls from children throughout the country who were asking about Santa Claus, as is tradition. While the president was in Mar-a-Lago over the holiday period, back in Washington, D.C., the Department of Justice was frantically trying to complete its delayed and widely criticized release of its files about dead sex offender Jeffrey Epstein, a former friend of Trump’s.\n\nSeated beside the first lady, Trump was put on the phone with Anna, an 8-year-old from North Carolina. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/trump-79-fawns-over-little-girl-8-while-epstein-drama-rages/","image":"https://www.thedailybeast.com/resizer/v2/DZA6ID75AFFJ7HIRP7IBOEYZ3Y.jpg?smart=true&auth=1c7ae644135fb36728f8e867607f75dad5b7c1516b144559e33b58f00c940982&width=1440&height=1080","video":null,"publish_date":"2025-12-26 00:26:32","author":"William Vaillancourt","authors":["William Vaillancourt"],"language":"en","source_country":"us","sentiment":-0.568},{"id":389060280,"title":"US launches strike against Islamic State militants in northwest Nigeria","text":"PALM BEACH, Florida, Dec 25 - The United States carried out an airstrike against Islamic State militants in northwest Nigeria at the request of Nigeria's government, U.S. President Donald Trump and the U.S. military said on Thursday, claiming the group had been targeting Christians in the region.\n\n\"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!,\" Trump said in a post on Truth Social.\n\nThe U.S. military’s Africa Command said the strike was carried out at the request of the Nigerian authorities in northwest Nigeria, and killed multiple ISIS militants. In a statement, it said the strike occurred in “Soboto state,” an apparent reference to Sokoto state.\n\nThe strike comes after Trump starting in late October began warning that Christianity faces an \"existential threat\" in Nigeria and threatened to militarily intervene in the West African country over what he says is its failure to stop violence targeting Christian communities.\n\nReuters reported on Monday the U.S. had been conducting intelligence-gathering flights over large parts of Nigeria since late November.\n\n'MORE TO COME'\n\nNigeria's government has said armed groups target both Muslims and Christians, and U.S. claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it has agreed to work with the U.S. to bolster its forces against militant groups.\n\nThe country's population is split between Muslims living primarily in the north and Christians in the south.\n\n\"(The Pentagon) worked with the government of Nigeria to carry out these strikes. These strikes were approved by the government of Nigeria,\" a Pentagon official said. U.S. Defense Secretary Pete Hegseth on X thanked the Nigerian government for its support and cooperation and added: “More to come...”\n\nThe Nigerian embassy in the U.S. did not immediately respond to a request for comment.\n\nPolice said earlier on Thursday a suspected suicide bomber killed at least five people and injured 35 others in Nigeria's northeast, another region troubled by Islamist insurgents.\n\nIn a Christmas message posted on X earlier, Nigerian President Bola Ahmed Tinubu called for peace in his country, \"especially between individuals of differing religious beliefs.\" He also said, \"I stand committed to doing everything within my power to enshrine religious freedom in Nigeria and to protect Christians, Muslims, and all Nigerians from violence.\" \n\nTrump issued his statement on the strike on Christmas Day while he was at his Palm Beach, Florida, Mar-a-Lago Club, where he has been spending the holiday. He had no public events during the day and was last seen by the reporters traveling with him on Wednesday night.\n\nThe U.S. military last week launched separate large-scale strikes against dozens of Islamic State targets in Syria, after Trump vowed to hit back in the wake of a suspected ISIS attack on U.S. personnel in the country. REUTERS","url":"https://www.straitstimes.com/world/us-launches-strike-against-islamic-state-militants-in-northwest-nigeria","image":"https://cassette.sphdigital.com.sg/image/straitstimes/a1c6c0831c7e2c0968e46225bbeb5ecad051159eb874fa6387ec34c1ae2705ee","video":null,"publish_date":"2025-12-26 00:24:07","author":"Sph Media Limited","authors":["Sph Media Limited"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.287},{"id":389064420,"title":"'Merry Christmas to all, including dead terrorists': Donald Trump announces Christmas Day ISIS strikes in Nigeria","text":"US President Donald Trump has declared a Christmas Day assault against 'ISIS Terrorist Scum' in Nigeria, offering seasonal wishes to 'all - including dead terrorists'. Trump posted on Truth Social on Thursday, 25 December, announcing that the United States had conducted multiple strikes, describing the mission as a success. The US has recently classified Nigeria as a \"country of particular concern\" under the International Religious Freedom Act, reports the Mirror .. He wrote: \"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\". \"I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,\" he went on. \"The Department of War executed numerous perfect strikes, as only the United States is capable of doing.\", according to the Express. \"Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper. May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues,\" he finished. Last month, Trump revealed he'd instructed the Pentagon to start preparing for possible military intervention in Nigeria amid allegations of Christian persecution. In recent weeks, the State Department declared that it would impose visa restrictions on Nigerians and their relatives implicated in mass murders and violence against Christians in the West African nation. More information is still to come - the post rapidly racked up nearly 8,000 likes within an hour. For the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters .","url":"https://www.dailystar.co.uk/news/us-news/merry-christmas-all-including-dead-36457275","image":"https://i2-prod.dailystar.co.uk/article36457273.ece/ALTERNATES/s1200b/0_US-POLITICS-TRUMP.jpg","video":null,"publish_date":"2025-12-26 00:21:59","author":"Peter Hennessy","authors":["Peter Hennessy"],"language":"en","source_country":"gb","sentiment":0.068},{"id":389062476,"title":"Trump says US struck Islamic State targets in Nigeria after group targeted Christians","text":"APPresident Donald Trump speaks at his Mar-a-Lago club in Palm Beach, Fla.\n\nWest Palm Beach (US): US President Donald Trump said on Thursday night that he had launched a \"powerful and deadly strike\" against Islamic State forces in Nigeria, after he spent weeks decrying the group for targeting Christians.The president's post did not include information about how the strike was carried out and what effects it had and the White House did not immediately provide further details.\"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\" the president posted on his social media site.Last month, Trump said he had ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department then announced in recent weeks that it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country.The US recently designated Nigeria a \"country of particular concern\" under the International Religious Freedom Act.Live Events\"I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,\" Trump wrote in his Christmas night post. He said that US defence officials had \"executed numerous perfect strikes, as only the United States is capable of doing\".The president added: \"Our Country will not allow Radical Islamic Terrorism to prosper.\"Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onUS strikes ISIS NigerianigeriaUS nigeria strikesnigeria newsislamic state\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onUS strikes ISIS NigerianigeriaUS nigeria strikesnigeria newsislamic state \n\nExplore More Stories123","summary":"Last month, Trump said he had ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department then announced in recent weeks that it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country.","url":"https://economictimes.indiatimes.com/news/international/world-news/trump-says-us-struck-islamic-state-targets-in-nigeria-after-group-targeted-christians/articleshow/126180895.cms","image":"https://img.etimg.com/thumb/msid-126180906,width-1200,height-630,imgsize-94830,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-12-26 00:21:57","author":"Islamic State","authors":["Islamic State"],"language":"en","category":"politics","source_country":"in","sentiment":-0.001},{"id":389063334,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - Dominica Gazette – Dominica &amp;","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://dominicagazette.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://dominicagazette.com/app/uploads/2025/12/breaking-news@2x-1738224819-WlFqqr.png","video":null,"publish_date":"2025-12-26 00:21:45","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"dn","sentiment":0.656},{"id":389061630,"title":"U.S. launches &apos;powerful and deadly&apos; airstrike in northwest Nigeria","text":"The United States carried out an airstrike against Islamic State militants in northwest Nigeria at the request of Nigeria's government, U.S. President Donald Trump and the U.S. military said on Thursday, claiming the group had been targeting Christians in the region.\n\n\"Tonight, at my direction as Commander in Chief, the United States launched powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\" Trump said in a post on Truth Social.\n\nThe U.S. military's Africa Command said on X that the strike was conducted at the request of Nigerian authorities and that it killed multiple ISIS militants.\n\nThe strike comes after Trump began warning in late October that Christianity faces an \"existential threat\" in Nigeria. He threatened military intervention in the West African country over what he said was its failure to stop violence targeting Christian communities.\n\nReuters reported on Monday that the U.S. had been conducting intelligence-gathering flights over large parts of Nigeria since late November.\n\nNigeria's government has said armed groups target both Muslims and Christians, and U.S. claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it has agreed to work with the U.S. to bolster its forces against militant groups.\n\nThe country's population is split between Muslims living primarily in the north and Christians in the south.\n\nTrump issued his statement on Christmas Day from his Palm Beach, Fla., Mar-a-Lago Club, where he's been spending the holiday. He had no public events during the day and was last seen by reporters travelling with him on Wednesday night.","url":"https://www.cbc.ca/news/world/us-nigeria-airstrike-christmas-day-9.7028229","image":"https://i.cbc.ca/ais/874d4517-4d5c-4c70-af2c-6195070146dc,1766706265566/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C430%2C6000%2C3375%29%3B","video":null,"publish_date":"2025-12-26 00:19:57","author":null,"language":"en","source_country":"ca","sentiment":-0.143},{"id":389061662,"title":"UPDATED: Trump says US launched ‘numerous’ deadly strikes on terrorists in Nigeria","text":"United States President Donald Trump said on Thursday that US forces conducted deadly strikes against Islamic State terrorists in Northwestern Nigeria, and vowed more attacks if the militants keep killing Christians.\n\nThe president stated this on his Truth Social platform, adding that the Department of War executed numerous perfect strikes.\n\nHe wrote, “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even centuries!\n\n“I have previously warned these terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was.\n\n“The Department of War executed numerous perfect strikes, as only the United States is capable of doing.\n\n“Under my leadership, our country will not allow radical Islamic terrorism to prosper.\n\n“May God bless our military, and MERRY CHRISTMAS to all, including the dead terrorists, of which there will be many more if their slaughter of Christians continues.”\n\nIn a separate post on X (formerly Twitter), Defence Secretary, Pete Hegseth, said he was “grateful for Nigerian government support and cooperation.”\n\nHe wrote, “The President was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. \n\n“The @DeptofWar is always ready, so ISIS found out tonight — on Christmas.\n\n“Grateful for Nigerian government support & cooperation. Merry Christmas!”\n\nThe airstrikes come one day after a bomb ripped through a mosque in Nigeria’s northeastern city of Maiduguri, killing five people and injuring dozens, in a suspected suicide attack.\n\nAccording to The New York Post, the African nation has been plagued by violence carried out by multiple armed militant groups, including Boko Haram and Islamic State of West Africa Province.\n\nLast month, Trump warned that he would cut off US aid to Nigeria and go into the country “guns-a-blazing” if the government didn’t do more to stop the Islamic extremists from killing Christians.\n\nThe president noted that he had instructed the War Department to “prepare for possible action” against “terrorist thugs” in Nigeria in his Nov. 1 Truth Social post.\n\nLast week, the Trump administration recalled more than two dozen ambassadors from posts around the world, including Nigeria and several other African countries, appointed by former President Joe Biden.\n\nSince taking office in January, Trump has conducted military strikes in Yemen, Somalia, Iraq, Iran, Syria, the Caribbean Sea and the Eastern Pacific Ocean.","summary":"President Trump says US forces conducted numerous deadly strikes on ISIS terrorists in Nigeria to stop the killing of Christians.\n\nRead More: https://punchng.com/breaking-trump-says-us-launched-numerous-deadly-strikes-on-terrorists-in-nigeria/","url":"https://punchng.com/breaking-trump-says-us-launched-numerous-deadly-strikes-on-terrorists-in-nigeria/","image":"https://cdn.punchng.com/wp-content/uploads/2025/11/28082956/AFP__20251128__86EZ9HM__v2__MidRes__DonaldTrumpParticipatesInACallWithServiceMembers-1200x630.jpg","video":null,"publish_date":"2025-12-26 00:16:26","author":"Jim Watson,Punch Newspapers","authors":["Jim Watson","Punch Newspapers"],"language":"en","source_country":"ng","sentiment":-0.049},{"id":389064562,"title":"US launches 'deadly' strike against ISIS in northwest Nigeria: President Trump","text":"Washington DC [US], December 26 (ANI): The United States on Thursday (local time) launched a “deadly” strike against the terror organisation Islamic State in northwest Nigeria, said President Donald Trump. Donald Trump, in a social media post on Truth Social, said that the strike targeted terrorists over the alleged killings of Christians. “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even centuries! I have previously warned these terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump said. “The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our country will not allow radical Islamic terrorism to prosper. May God bless our military, and MERRY CHRISTMAS to all, including the dead terrorists, of which there will be many more if their slaughter of Christians continues,” the US President added. According to the US National Counterterrorism Centre, “ISIS-West Africa (ISIS-WA) was formed in 2015 when Boko Haram pledged allegiance to ISIS. The branch, as per the United States, attacks regional military targets and civilian defence forces and frequently attacks government personnel and infrastructure, and Christians.” Earlier on December 19 (local time), US and Jordanian forces carried out large-scale air strikes against the Islamic State terror group in Syria, hitting more than 70 ISIS targets with over 100 precision-guided munitions, the US Central Command (CENTCOM) said. In a post on X, CENTCOM said the strikes were carried out overnight and described the operation as a demonstration of “peace through strength.” The command also released a video showing footage of the air strikes.The operation came days after a suspected Islamic State attacker targeted a convoy of US and Syrian forces in the central Syrian town of Palmyra. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/us-launches-deadly-strike-against-isis-in-northwest-nigeria-president-trump-9792280.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-12-26 00:15:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.012},{"id":389061480,"title":"Trump says US launches strike against Islamic State terrorists in northwest Nigeria","text":"The United States carried out an airstrike against Islamic State terrorists in northwest Nigeria at the request of Nigeria's government, U.S. President Donald Trump and the U.S. military said on Thursday, claiming the group had been targeting Christians in the region. \"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!,\" Trump said in a post on Truth Social. The U.S. military's Africa Command said on X the strike was conducted at the request of Nigerian authorities and killed multiple ISIS terrorists. The strike comes after Trump starting in late October began warning that Christianity faces an \"existential threat\" in Nigeria and threatened to militarily intervene in the West African country over what he says is its failure to stop violence targeting Christian communities. Reuters reported on Monday the U.S. had been conducting intelligence-gathering flights over large parts of Nigeria since late November. Nigeria's government has said armed groups target both Muslims and Christians, and U.S. claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it has agreed to work with the U.S. to bolster its forces against terrorist groups. The country's population is split between Muslims living primarily in the north and Christians in the south. The president issued his statement on Christmas Day while he was at his Palm Beach, Florida, Mar-a-Lago Club, where he has been spending the holiday. He had no public events during the day and was last seen by the reporters traveling with him on Wednesday night.","summary":"US forces struck Islamic State terrorists in northwest Nigeria at Abuja’s request claiming the terror group targeted Christians as Washington steps up military and intelligence involvement in the region","url":"https://www.ynetnews.com/article/sjja11uiqwg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/12/23/H1tGqfOmZl/H1tGqfOmZl_590_82_2348_1321_0_large.jpg","video":null,"publish_date":"2025-12-26 00:14:40","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":-0.223},{"id":389062080,"title":"White House to present plans for Trump's East Wing ballroom in January","text":"p>Palm Beach, Florida: The White House will unveil new ​details on President Donald Trump's planned East Wing ballroom during a hearing early next month, ‌according to a federal commission tasked with reviewing the project.The ⁠new ballroom, which Trump has said ‌would cost $400 million and would dwarf the adjacent White House building, has been challenged in court by preservationists, while Democratic lawmakers have called it an abuse of power and are investigating which donors are supporting it.The National Capital Planning Commission, chartered by Congress to manage planning for Washington-area federal lands, said ​on its website that the White House will provide an \"information presentation\" on plans to rebuild the East Wing during a commission meeting on January 8..US launches strike against Islamic State militants in northwest Nigeria.The White House did not immediately respond to a request for comment.The commission, chaired by ‌a White ‌House aide and onetime personal lawyer to Trump, Will Scharf, has declined to review the demolition of the former East Wing, preparation activities at ⁠the site, or potential effects to historic properties, in what would mark the biggest change to the historic property in decades.The National Trust for Historic Preservation, a nonprofit organization chartered by Congress, is suing to halt the construction, arguing ⁠that the proposed 90,000 square foot (8,360 square meter) ballroom would ⁠dwarf the rest of the White House, at 55,000 square feet.The judge ‌in the case earlier this month declined to issue a temporary restraining order ‌against work on the project, noting among other things that the size, scale and other specifications had not been finalized. Another hearing is scheduled for next month. The president, a one-time real estate developer, ‍has taken a hands-on role in what he has described as sprucing up the White House and the U.S. capital city ahead of celebrations next year marking the Declaration of Independence's 250th anniversary.He has also proposed a new grand arch near Washington, while decorating the Oval Office extensively in gold leaf and installing plaques there offering his personal take on his predecessors' legacies.The former East Wing was largely demolished in October, with comparatively little public notice or consultation.In a recent notice posted online, the planning ​commission said a formal review taking ‌place this coming spring will consider topics including lines of sight, public space and landscapes. Members of the public will be allowed to submit comments or testify during the review, it said.</p","url":"https://www.deccanherald.com/world/white-house-to-present-plans-for-trumps-east-wing-ballroom-in-january-3842995","image":"https://media.assettype.com/deccanherald/2025-11-05/z6vgiki1/file834a6nvm9bt1jdnywoln.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-26 00:12:53","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.266},{"id":389062728,"title":"'Enjoy what may be your last Christmas!' Trump attacks 'sleazebags' in dark holiday screed","text":"Late-night show host Jimmy Kimmel skewered President Donald Trump in his alternate Christmas address this year, a speech that read like a plea to U.S. allies. \n\nKimmel was invited to give a Christmas Day speech billed as an alternative to the Monarch's annual address in the United Kingdom. During the speech, he acknowledged the problems Trump has created in the U.S. and across the globe, and implored American allies not to give up on the U.S. The address aired on Channel 4 on Christmas Day. \n\n\"Look, I know (from the musical Hamilton) that our countries didn’t start off on the greatest note, but I also know (from seeing Love Actually) that we have a special relationship,\" Kimmel said in his address. \"So, if I might speak on behalf of my country – which I most certainly do not – our message to you, our friends across the pond this Christmas is: don’t give up on us.\" \n\n\"We’re going through a bit of a wobble right now, but we’ll come around,\" he continued. \"It may not seem like it, but we love you guys. We even love the things about you that you don’t like. Like Simon Cowell, for instance. We are not bright. We’re Americans. No one knows better than you we’re always just a little bit late to the game, but do we come through in the end? Maybe.\" \n\n\"Give us about three years. Please. Thank you for your patience, and thank you for Spider-Man. Merry Christmas, and happy holidays,\" he added.","summary":"President Donald Trump attacked people he described as \"losers\" and \"sleazebags\" in a dark screed on social media on Christmas night. \n\nIn the post, Trump attempted to distance himself from disgraced financier Jeffrey Epstein, someone he has previously referred to as a close friend. This comes at a time when new revelations from recently released Epstein files show Trump rode on Epstein's private plane, dubbed the \"Lolita Express,\" at least eight times. Other documents indicate Trump spent time at Epstein's home in New York City, and that the two men exchanged birthday pleasantries. \n\n\"Merry Christmas to all, including the many Sleazebags who loved Jeffrey Epstein, gave him bundles of money, went to his Island, attended his parties, and thought he was the greatest guy on earth, only to 'drop him like a dog' when things got too HOT, falsely claimed they had nothing to do with him, didn’t know him, said he was a disgusting person, and then blame, of course, President Donald J. Trump, who was actually the only o","url":"https://www.rawstory.com/trump-2674829511/","image":"https://www.rawstory.com/media-library/u-s-president-donald-trump-and-first-lady-melania-trump-participate-in-calls-to-u-s-service-members-on-christmas-eve-from-th.jpg?id=62631756&width=1200&height=600&coordinates=0%2C446%2C0%2C446","video":null,"publish_date":"2025-12-26 00:12:42","author":"Robert Davis","authors":["Robert Davis"],"language":"en","source_country":"US","sentiment":0.279},{"id":389059660,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - Puerto Rico Tribune – Daily Puerto Rico","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://puertoricotribune.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://puertoricotribune.com/app/uploads/2025/12/breaking-news@2x-1738224819-Mk77Xs.png","video":null,"publish_date":"2025-12-26 00:12:37","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"pr","sentiment":0.656},{"id":389063240,"title":"President Trump says US launched strike on ISIS terrorists in Nigeria","text":"President Donald Trump said in a post on his social media platform Thursday that he launched a \"powerful and deadly strike\" on ISIS terrorists in Nigeria, whom he claimed have been \"targeting and viciously killing, primarily, innocent Christians.\"\n\nThis comes after the president posted a video in early November threatening to go into Nigeria \"guns-a-blazing.\" Around that time, Defense Secretary Pete Hegseth echoed Trump's message and said in a post on X that the Department of Defense was \"preparing for action.\"\n\n\"I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing,\" Trump added in the post. \n\nIt is not yet clear the outcome of that strike or what the exact target was. ABC News has asked the White House for more information.\n\nIn a post on X, Hegseth further said there will be \"more to come\" and expressed his gratitude to the Nigerian government for its support and cooperation. \n\n\"The President was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. \n\n\"The @DeptofWar is always ready, so ISIS found out tonight -- on Christmas.\"\n\nHegseth ended his post with, \"Merry Christmas!\"\n\nThis is a developing story. Please check back for updates.","url":"https://abc13.com/post/us-launches-deadly-strike-isis-targets-nigeria-group-targeted-christians-president-trump-says/18316603/","image":"https://cdn.abcotvs.com/dip/images/18316613_122525-wabc-ap-trump-img.jpg?w=1600","video":null,"publish_date":"2025-12-26 00:12:28","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.171},{"id":389061000,"title":"Trump Announces 'Powerful And Deadly' Strikes On ISIS Targets In Nigeria","text":"WEST PALM BEACH, Fla. (AP) — President Donald Trump said Thursday night that he’d launched a “powerful and deadly strike” against Islamic State forces in Nigeria, after he spent weeks decrying the group for targeting Christians.\n\nThe president’s post did not include information about how the strike was carried out and what effects it had and the White House did not immediately provide further details.\n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” the president posted on his social media site.\n\nLast month, Trump said he’d ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department then announced in recent weeks that it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country.\n\nThe U.S. recently designated Nigera a “country of particular concern” under the International Religious Freedom Act.\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump wrote in his Christmas night post. He said that U.S. defense officials had “executed numerous perfect strikes, as only the United States is capable of doing.”\n\nThe president added: “our Country will not allow Radical Islamic Terrorism to prosper.”","url":"https://www.huffpost.com/entry/trump-nigeria-strike-isis_n_694dd139e4b06782d203df50?origin=home-latest-news-unit","image":"https://img.huffingtonpost.com/asset/694dd26f150000643f85d3f3.jpeg?cache=IopunrGn4s&ops=1778_1000","video":null,"publish_date":"2025-12-26 00:12:20","author":null,"language":"en","source_country":"in","sentiment":-0.1},{"id":389060996,"title":"Trump Announces 'Powerful And Deadly' Strike On ISIS Targets In Nigeria","text":"WEST PALM BEACH, Fla. (AP) — President Donald Trump said Thursday night that he’d launched a “powerful and deadly strike” against Islamic State forces in Nigeria, after he spent weeks decrying the group for targeting Christians.\n\nThe president’s post did not include information about how the strike was carried out and what effects it had and the White House did not immediately provide further details.\n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” the president posted on his social media site.\n\nLast month, Trump said he’d ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department then announced in recent weeks that it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country.\n\nThe U.S. recently designated Nigera a “country of particular concern” under the International Religious Freedom Act.\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump wrote in his Christmas night post. He said that U.S. defense officials had “executed numerous perfect strikes, as only the United States is capable of doing.”\n\nThe president added: “our Country will not allow Radical Islamic Terrorism to prosper.”","url":"https://www.huffpost.com/entry/trump-nigeria-strike-isis_n_694dd139e4b06782d203df50?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/694dd26f150000643f85d3f3.jpeg?cache=IopunrGn4s&ops=1778_1000","video":null,"publish_date":"2025-12-26 00:12:20","author":null,"language":"en","source_country":"in","sentiment":-0.1},{"id":389060406,"title":"Trump announces strikes against ISIS in Nigeria and wishes MERRY CHRISTMAS to ‘dead terrorists’ he claims are targeting Christians","text":"President Donald Trump has announced the U.S. military has conducted deadly strikes against ISIS targets in Nigeria after the group is accused of targeting Christians. \n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” the president wrote in a Truth Social post the evening of Christmas Day. \n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump continued. \n\n“The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper. May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues.”\n\nPentagon chief Pete Hegseth and White House Press Secretary Karoline Leavitt also posted online about the strikes. \n\nHegseth said in a post on X, “The President was clear last month: the killing of innocent Christians in Nigeria (and elsewhere) must end. The @DeptofWar is always ready, so ISIS found out tonight — on Christmas.”\n\nThe defense secretary added, “Grateful for Nigerian government support & cooperation. Merry Christmas!”\n\nThe Nigerian government is yet to comment publicly on the strikes. \n\nLast month, Trump said he was instructing the Defense Department to “prepare for possible action” in Nigeria, claiming the nation’s government “continues to allow the killing of Christians.”\n\nHe also declared that Nigeria is a “country of particular concern.” The U.S. government uses this designation for nations determined to have committed “particularly severe violations of religious freedom,” according to the State Department’s website.\n\nTrump said in November, “If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, ‘guns-a-blazing,’ to completely wipe out the Islamic Terrorists who are committing these horrible atrocities,”\n\nMuch of northern Nigeria has been struck by conflict in an ongoing security crisis and Trump has singled the country out for what he calls “the killing of Christians” by “radical Islamists.”\n\nVictims and church leaders have reiterated Trump’s claims that Christians are persecuted, saying they’ve long been attacked, kidnapped or killed over their faith.\n\nBut many insist the reality isn’t that simple, with experts and residents saying most attacks emphasize the widespread violence that has long plagued the West African nation, where everyone is a potential victim, regardless of background or belief.\n\nWith reporting from the Associated Press. \n\nThis is a breaking news story and will be updated.","summary":"The president declared on Truth Social: ‘MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues.’","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-isis-nigeria-christians-christmas-strikes-b2890541.html","image":"https://static.independent.co.uk/2025/12/25/23/50/SEI278908458.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/lLULxyks-4VHSaSK0.mp4","publish_date":"2025-12-26 00:07:11","author":"Samantha Beech","authors":["Samantha Beech"],"language":"en","source_country":"gb","sentiment":-0.178},{"id":389035294,"title":"Lucea mayor defends new Christmas tree as he blasts detractors","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA new Christmas tree placed in front of the Hanover Municipal Corporation building located in Bustamante Square in Lucea. \n\n Latest News, News \n\nDecember 25, 2025\n\n\n\n\n Lucea mayor defends new Christmas tree as he blasts detractors \n\n\n\n\n\n\n\nHANOVER, Jamaica — As the festive glow of the Christmas season settles over Hanover’s parish capital, Mayor of Lucea, Sheridan Samuels is issuing a stern call for unity as he urges detractors to halt the “belittling” of the Hanover Municipal Corporation’s efforts to bring holiday cheer to the parish following a devastating hurricane in October.\n\nThe centrepiece of this year’s controversy — and celebration — is the new Christmas tree situated directly in front of the Municipal Corporation building. During the ceremony, Mayor Samuels addressed rumours regarding the appearance of the tree, noting that the corporation opted for a fresh start this year.\n\n“You might have noticed that we are not using the tree over in the park, but we have bought a new one and placed it right in front of the municipal corporation building,” Samuels told those gathered for the annual Christmas tree lighting ceremony in Bustamante Square on Tuesday.\n\n“I know that you know when things look nice… I want you to look at that tree and don’t tell me that it doesn’t look nice. It is really looking good,” Samuels added.\n\nThe mayor, who also serves as chairman of the corporation, did not mince words for those who have criticised the scale or style of the decorations. He suggested that such detractors are lacking love for their parish.\n\nPeople gathered for the Christmas tree lighting. The tree is located in the centre in front of the Hanover Municipal Corporation building located in Bustamante Square in Lucea.\n\n“[It] is only people who don’t know when things look nice will go out there and criticise a very beautiful tree like that. If you can’t put on your clothes good, it means that you don’t know when things look good,” argued Samuels.\n\nSamuels further challenged critics to document the beauty of the town rather than tear it down, as he invited such individuals to “come and take the picture and put it up [on social media] again.”\n\nA few days ago, the corporation was contemplating how best to utilise and decorate the original tree that is currently damaged and is in need of pruning despite limited resources.\n\nThe tree was planted more than 35 years ago by the late James Lawrence who was the manager of the then Haughton Court Cocoa Fermentary in the parish.\n\nThe area where the tree was planted was named the James Lawrence Park in honour of Lawrence in 2022. At that time, Mayor Samuels noted that the tree had resulted in millions of dollars in savings to the corporation, as it was used as a Christmas tree.\n\nDespite a severe cash flow shortage triggered by the widespread destruction of Hurricane Melissa, the ckmorporation was successful in hosting this year’s annual Christmas treat for children and tree lighting ceremony, thanks to a surge of support from private donors.\n\nOne pivotal donor is Omar McFarlane of the Jamaica Football Federation who provided $500,000 for the purchase of a [man-made] tree.\n\n“While talking, we mentioned to Mr McFarlane that Hanover will not have a Christmas tree lighting this year. He then asked us why. I told him that because of the disaster that we have faced, we are facing some serious financial challenges and he said to us that he is going to make a contribution so that we can, at least, buy a tree because it is very expensive to prune the one in the park,” said Samuels.\n\nAmong the other donors were Sandals Foundation which provided gifts and toys for the children; the chief executive officer at LCH Developments, the developers of the Pinnacle in St James Yansen Lee, who donated toys and bags for the children; the Hanover Chamber of Commerce which provided snacks, the Grand Palladium Hotel and Milton Jarrett.\n\n“I want to thank those who came on board and made significant contributions to our Christmas treat and Christmas tree lighting,” expressed a grateful Samuels.\n\n— Anthony Lewis\n\n\n\n\n\n\n\n\n\nTags: Christmas tree Lucea Sheridan Samuels \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n DJ Mac gives UK-based Drip Rick Vi the green light \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fast rising Uk-based dancehall artiste Drip Rick Vi is enjoying a great run in dancehall. The witty deejay has scored a place on one of the hottest be... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment, Latest News \n\n\n\n\n\n\n\n\n\n Complex Ricki wants to ‘Make a Change’ \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n Fusion reggae artiste Complex Ricki is generating a major buzz on the streets with her latest ambitious single, Make a Change , dedicated to the survi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Democrats demand probe into Caribbean boat strikes \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n WASHINGTON, United States (CMC) – As United States President Donald Trump expands the US military build-up in the Caribbean, Democratic legislators ar... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n WATCH: Wanted man killed in Manchester confrontation, police say \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n MANCHESTER, Jamaica — One of Manchester’s most wanted men was fatally shot during an alleged confrontation with the police in Mike Town in the parish ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Two American men denied bail on rape charges in The Bahamas \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n NASSAU, Bahamas (CMC) – Two American men were denied bail when they appeared in a magistrate’s court in The Bahamas charged with raping a 25-year-old ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n ‘Mi Rahtid’, Jamaican grandma turns social media star serving up recipes \n\n\n\n\n Vanassa McKenzie, Observer Online reporter, mckenziev@jamaicaobserver.com \n\n\n\nDecember 25, 2025 \n\n\n A Florida family’s efforts to preserve their Jamaican matriarch’s recipes, passed down through generations, have transformed the 96-year-old woman int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n US congresswoman condemns death of Haitian man in ICE custody \n\n\n\n\n\n\n\nDecember 25, 2025 \n\n\n NEW YORK, United States (CMC) – United States Democratic Congresswoman, Yvette Clarke, has condemned the death of a Haitian man in the custody of the ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/12/25/lucea-mayor-defends-new-christmas-tree-blasts-detractors/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/12/Untitled-design-71.png","video":null,"publish_date":"2025-12-26 00:06:40","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.175},{"id":389064122,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - St. Kitts Gazette – Daily News from St","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://stkittsgazette.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://stkittsgazette.com/app/uploads/2025/12/breaking-news@2x-1738224819-eeGxC3.png","video":null,"publish_date":"2025-12-26 00:06:03","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"kn","sentiment":0.656},{"id":389061388,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - St. Lucia Chronicle – Daily St Lucia News","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://stluciachronicle.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://stluciachronicle.com/app/uploads/2025/12/breaking-news@2x-1738224819-YwULNB.png","video":null,"publish_date":"2025-12-26 00:06:03","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"lu","sentiment":0.656},{"id":389064334,"title":"Trump says US launched strikes against ISIL in northwest Nigeria  - Bahamas Spectator – Bahamas &amp;","text":"The United ‍States ‍has carried out air strikes against ISIL (ISIS) targets in northwest Nigeria, US ⁠President Donald Trump ​said.\n\n“Tonight, ⁠at my direction as Commander in Chief, the United States launched a powerful and ​deadly strike ‌against ISIS Terrorist Scum in Northwest Nigeria,” ‌Trump said in a post on his Truth Social platform.\n\nTrump said ISIL fighters had “‌targeted and viciously” killed “primarily, innocent Christians, at ⁠levels not seen for many years, and even Centuries!”\n\nThis is a breaking news story. More to follow soon.","url":"https://bahamasspectator.com/trump-says-us-launched-strikes-against-isil-in-northwest-nigeria/","image":"https://bahamasspectator.com/app/uploads/2025/12/breaking-news@2x-1738224819-zu540g.png","video":null,"publish_date":"2025-12-26 00:06:03","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":0.656},{"id":389061442,"title":"Trump says US military struck ISIS terrorists in Nigeria","text":"President Donald Trump of the United States of America said Thursday he’d ordered a deadly strike on Islamic State terrorists in Nigeria, who he has accused of persecuting Christians in the country.\n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” the president wrote on Truth Social.\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” he went on. “The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\n“Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper. May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues,” the president concluded.\n\nCNN said it has reached out to the White House for additional comment.\n\nTrump has focused for the last several months on the plight of Christians in Nigeria, including calling in November on his secretary of defence to “prepare for possible action” and warning the US would enter Nigeria “guns-a-blazing” to protect the Christian population of Africa’s most populous country.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"President Donald Trump of the United States of America said Thursday he’d ordered a deadly strike on Islamic State terrorists in Nigeria, who he has accused of persecuting Christians in the country. “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest [&#8230;]\n\n\nThe post Trump says US military struck ISIS terrorists in Nigeria appeared first on BrownGH.com.","url":"https://www.browngh.com/trump-says-us-military-struck-isis-terrorists-in-nigeria/","image":"https://www.browngh.com/wp-content/uploads/2025/11/image-1949.png","video":null,"publish_date":"2025-12-26 00:04:52","author":"Browngh.com","authors":["Browngh.com"],"language":"en","category":"politics","source_country":"gh","sentiment":0.162},{"id":389065034,"title":"In Venezuela, we have not been invaded","text":"Giuliano Salvatore\n\nI am writing these words from Caracas, the capital of Venezuela, on 12 December, one day after María Corina Machado, the newly appointed Nobel Peace Prize winner, said at a press conference in Oslo, Norway, in response to a journalist’s question about whether she would accept a military invasion of Venezuela:\n\nVenezuela has already been invaded. We have the Russian agents, we have the Iranian agents, we have terrorist groups such as Hezbollah, Hamas operating freely, in accordance with the regime. We have the Colombian guerrillas, the drug cartels that have taken control of 60 percent of our population, not only involving drug trafficking but in human trafficking, networks of prostitution. This has turned Venezuela into the criminal hub of the Americas.\n\n“Venezuela has already been invaded. We have the Russian agents, we have the Iranian agents, we have terrorist groups such as Hezbollah, Hamas operating freely, in accordance with the regime.\n\n“We have the Colombian guerrillas, the drug cartels that have taken control of 60 percent of our population, not only involving drug trafficking but in human trafficking, networks of prostitution.\n\n“This has turned Venezuela into the criminal hub of the Americas.”\n\nIn a week or two, my first daughter will be born, like thousands of other Venezuelan babies inside and outside the country who are about to be born or are newborns. It seems like a detail that would not matter to anyone other than the immediate circle of all our families and friends, but the words of Machado and the actions of the US government in recent months place all Venezuelans as targets of an apparently imminent military invasion. Given the narrative imposed on us – for Machado, we are “the criminal hub of the Americas” – and the current global context, in which genocide in Gaza occurs with total impunity, it is logical and even prudent to think that [such an invasion] will seek to destroy everything in its path, hijack our future, and make us pay for our ‘freedom’ with thousands and thousands of lives.\n\nVenezuelan social and political forces are – and have been all these years – diverse in their positions and in their magnitudes. The problems that Venezuelans face on a daily basis have been exacerbated by the unilateral sanctions imposed on the Venezuelan people.\n\nAccording to a 2014 report of the United Nations special rapporteur on the negative impact of unilateral coercive measures, these constitute a violation of international law seriously affecting the country’s population and preventing the enjoyment of human rights.\n\nOur problems are not few, nor are they without enormous complexity, difficult to grasp in their entirety even for ourselves. We have problems, like any other country – problems that have been part of our daily lives for years and have eroded in many ways the legitimacy of all political leadership in the country, whether in the government or the opposition.\n\nThis diversity of political and social forces in Venezuela even includes clear and well-founded criticism of the Venezuelan government in many respects – clear and well-founded criticism from the left, from popular movements, and from Venezuelan workers of many of the paths we have taken in recent years.\n\nLike any country, we are facing our own dilemma – a dilemma that includes, however, the fact that we are the world’s largest oil reserve and one of the largest reserves of gold, water and coltan. This is at a time when the geopolitical map is being redrawn and the US empire is cynically playing its cards, when Israel is seriously beginning to turn its attention to Latin America, and when the major industrial and commercial powers are dividing up the world.\n\nSo, while we are dealing with circumstances common to the entire planet – the US empire in its most psychotic phase – we insist on the principle of self-determination and on our right to life, and on our conviction that we will be the ones to find the necessary channels to sustain ourselves and move forward on our own path.\n\nDangerous characterisation\n\nNo, in Venezuela we are not living under invasion by China, Russia, Hamas, Hezbollah, Iran or any other foreign force. There is no direct evidence of this.\n\nIf we had been invaded, as Machado would have us believe, this would imply the direct intervention of specific forces from these countries in our daily lives, and that is not happening in any way.\n\nGovernment advisors, defence or trade agreements between nations – none of these things, which are regular for any country, imply any form of invasion.\n\nThere is no evidence that any foreign armed, police, parapolice or paramilitary force is operating in Venezuela with the authorisation or support of the national government.\n\nFurthermore, unlike in other countries in the region, there are no armed conflicts arising from territorial disputes between drug cartels, nor even, at this point, more local or smaller-scale conflicts involving micro-trafficking. So it would be impossible to claim that “drug cartels have taken control of 60% of our population”.\n\nThe idea that Trump and Machado are trying to construct – that Venezuela is the hub of operations for all the evils that populate the nightmares of the West – is nothing more than a global narrative that seeks to dehumanise Venezuela and the region enough. They are doing this, so that, once again – as is currently the case with Gaza and Sudan and so many other conflicts – international public opinion does not know exactly whether, given the seriousness of our situation, the end does not justify the means in this case, that is, among other possibilities, our extermination.\n\nLet us never forget what happened in Libya or Iraq, to mention two of a long list of countries ‘liberated’ from evil by the US.\n\nAnd if we believe in the idea that it is impossible to replicate experiences in the Middle East or Africa in Latin America, let us not lose sight of one fact. Since September, the US has killed at least 87 people in its attacks in the Caribbean under the same premise that Israel kills men, women and children with impunity in Palestine: they are terrorists, not human beings, and they are terrorists because they say they are.\n\nIn the context of what has happened in Gaza – more than 70.000 children have been killed with impunity – and taking into account that Machado is a close ally of the Israeli government and Benjamin Netanyahu, the words of the current Nobel Peace Prize winner are a direct attack on the lives of Venezuelans. They are a clear call for the genocide that the US and Israel are committing in Gaza to be repeated in Venezuela.\n\nVenezuelans both inside and outside the country deserve the opportunity to solve our problems according to our own criteria and our own capabilities. That is sovereignty. There is currently no invasion by any foreign force in our country, and there is no basis for thinking that we represent a threat to peace in the region.\n\nThe only and most likely possibility is that we will be invaded by the US government in pursuit of nothing more than the global maintenance of its hegemony – at the expense of our resources, our sweat and our blood, both ours and that of our children.\n\nFootnote on 17 December\n\nOn 16 December, US President Donald Trump declared on the social network Truth Social that:\n\nVenezuela is completely surrounded by the largest Armada ever assembled in the history of South America. It will only get bigger, and the impact on them will be like nothing they have ever seen before —Until such time as they return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us. The illegitimate Maduro Regime is using Oil from these stolen Oil Fields to finance themselves, Drug Terrorism, Human Trafficking, Murder, and Kidnapping. For the theft of our Assets, and many other reasons, including Terrorism, Drug Smuggling, and Human Trafficking, the Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION. Therefore, today, I am ordering a TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.\n\nIt doesn’t take much analysis. It seems that between the Fifa Peace Prize and the Nobel Peace Prize, Venezuela (and the region) are about to experience levels of harmony, tranquillity and concord unlike anything we have seen before. – Globetrotter\n\nGiuliano Salvatore is a Venezuelan documentary filmmaker, photographer, and teacher based in Caracas, Venezuela. He is a member of the Tricontinental Institute for Social Research.","url":"https://aliran.com/web-specials/in-venezuela-we-have-not-been-invaded","image":"https://aliran.com/wp-content/uploads/2025/10/Trump-vs-Venezuela-696x696.png","video":null,"publish_date":"2025-12-26 00:04:24","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.206},{"id":389061576,"title":"Trump launches Christmas Day ISIS strikes in Nigeria as he targets 'terrorist scum'","text":"US President Donald Trump has announced a Christmas Day offensive against ' ISIS Terrorist Scum' in Nigeria, extending festive greetings to 'all - including dead terrorists'. Trump took to Truth Social on Thursday, 25 December, to declare that the United States had carried out several strikes, hailing the operation as a triumph. The US recently designated Nigeria a “country of particular concern” under the International Religious Freedom Act. He posted: \"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\". \"I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,\" he continued. \"The Department of War executed numerous perfect strikes, as only the United States is capable of doing.\", reports the Express . \"Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper. May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues,\" he concluded. Last month, Trump said he’d ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. The State Department then announced in recent weeks that it would restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country. Further details are yet to emerge - the post quickly amassed nearly 8,000 likes within an hour.","summary":"Donald Trump has announced that the US has launched a series of strikes against ISIS in Nigeria, warning that there will be &quot;many more&quot; if they continue to target Christians","url":"https://www.mirror.co.uk/news/us-news/trump-launches-christmas-day-isis-36457270","image":"https://i2-prod.mirror.co.uk/article36457268.ece/ALTERNATES/s1200b/0_President-Trump-Calls-Service-Members-On-Christmas-Eve.jpg","video":null,"publish_date":"2025-12-26 00:03:38","author":"Peter Hennessy","authors":["Peter Hennessy"],"language":"en","source_country":"gb","sentiment":0.045},{"id":389061484,"title":"On Gaza’s strategic ridge, IDF northern brigade chief says ‘no significant threat, enemy is weak’","text":"From a strategic observation point in the Sheikh Zayed neighborhood of northern Gaza, the view stretches clearly to the buildings of Sderot, the chimneys of the Rotenberg power station in Ashkelon, the large Israeli flag erected in Netiv HaAsara after the October 7 massacre, and additional Israeli communities just a few kilometers away. Col. Omri Mashiach, commander of the IDF’s Northern Brigade in the Gaza Division, who led the tour, said: “At this stage, there is no significant threat and the enemy is weak.” The purpose of the tour in areas of the Gaza Strip under Israeli control east of the ‘yellow line’ was to explain how the IDF’s presence affects the security of border communities. In the background, Prime Minister Benjamin Netanyahu is expected to discuss next week, during his meeting with US President Donald Trump at Mar-a-Lago in Florida, the second phase of the ceasefire agreement. According to the American plan, it includes an Israeli withdrawal from the ‘yellow line.’ Earlier this month, IDF Chief of Staff Lt. Gen. Eyal Zamir said that “the ‘yellow line’ is a new border line, a forward defensive line for communities and an offensive line.” In the same spirit, soldiers on the ground told reporters: “We are here until further notice.” From the observation point on ‘Ridge 70,’ which became a central anchor in IDF holding plans during the war, extensive destruction across Gaza is visible, along with IDF outposts rapidly rising one after another. In practice, no buildings remain standing except those serving military purposes. Control of the kurkar ridge, named for its height of 70 meters above sea level, underscores its strategic importance, allowing dominance both west and east of the ‘yellow line.’ Engineering forces are working intensively to establish outposts along the ridge. Asphalt is being laid to provide access roads for vehicles and helicopter landing zones, while observation masts and additional systems are being installed to entrench the IDF in what the chief of staff has described as “the new border line.” Mashiach outlined the brigade’s defensive framework. “You can divide it into four main components,” he said. “The forward outpost line along the ‘yellow line,’ the outposts near the fence, the barrier that failed catastrophically on October 7, and the community defense units.” ‘Our duty is to prepare for the worst-case scenario’ Asked by ynet about possible changes, Mashiach said: “It is very possible that the barrier will move to the ‘yellow line.’ The chief of staff defined the ‘yellow line’ as the new border line, and that is how we treat it. Our duty is to prepare for the worst possible scenario, and we are still destroying terrorist infrastructure.” “We are entrenching ourselves here until the political echelon decides otherwise,” he added. “We are flexible. If we are told to withdraw within a month, we will know how to do it.” Statements by Defense Minister Israel Katz suggest there is no intention to withdraw. Earlier Tuesday, Katz said: “Israel will never leave Gaza.” He added that his vision includes a significant security zone inside Gaza to protect Israeli communities, and that in the northern sector, Nahal pioneer groups could eventually be established. Asked whether he was aware of any plans for future Israeli settlement in Gaza, Mashiach responded: “I have received no such instruction. As a military officer, I deal only with military operations and do not engage in matters belonging to the political echelon.” While projecting calm, Mashiach also warned against complacency. “The enemy is weak,” he said, “but it has not abandoned its ambitions.” He noted daily attempts to approach the ‘yellow line’ that the IDF believes are intended to gather intelligence and test troop readiness. “There are still attempts to create friction, such as sniper fire, explosive charges and anti-tank missiles,” he said. “But instead of this happening along the border with the communities, it happens at the ‘yellow line.’” One method used to clear the area, Mashiach explained, is pumping concrete into tunnel shafts that extend deep into Jabaliya, pouring from an opening on the Israeli side to the exit on the Gazan side. Addressing the loud explosions still heard in border communities and beyond, Mashiach said the IDF is conducting continuous operations near the ‘yellow line’ while maintaining force protection. “To protect our troops, we also use a great deal of firepower so that risks do not materialize.” “We are destroying extensive infrastructure, whether blowing up remaining underground routes or eliminating enemy infrastructure above ground,” he said. “That is ultimately the reason for the noise.” Mashiach stressed the importance of linking frontline security with the sense of security at home. “We work constantly with the communities and their leadership to improve how we explain and convey what is happening at the front, so unnecessary pressure does not develop.” Asked whether border residents can sleep soundly, Mashiach replied unequivocally: “Yes.” “We do not sleep soundly, because that is our mission,” he added. “If I were a resident of the border communities, I would understand that the situation has fundamentally changed. The efforts visible here can truly provide a strong sense of security. Our role is not to sleep, so residents can.” According to the IDF, since the ceasefire with Hamas in October and the withdrawal to the ‘yellow line,’ Northern Brigade forces have struck about 60 terrorist targets from the air and another 220 using artillery fire. The strikes targeted terrorist infrastructure, operatives approaching the ‘yellow line,’ weapons depots and sites used by the terrorist organization, including preventive strikes aimed at blocking renewed entrenchment. ‘There are still many terrorists’ As a result of the brigade’s activity and entrenchment in dominant areas such as ‘Ridge 70,’ several security-related changes have been implemented in the western Negev, including reopening Zikim Beach, resuming rail service between Sderot and Ashkelon, and removing the concrete barrier along the access road to Kibbutz Nahal Oz. Today, the IDF says the military effort is intended to give the political echelon freedom to decide on the future of operations in Gaza and the ‘day after.’ “Whatever framework is chosen, the IDF will adapt and act accordingly,” Mashiach said. “There are still many operatives, many terrorists. I cannot say how many exactly, but what I can say is that if in the past every Hamas terrorist had a personal weapon, that is no longer the case. We are here to protect residents of the western Negev.” The IDF said Northern Brigade forces under Division 252 have been operating for months along the ‘yellow line’ in northern Gaza, destroying terrorist infrastructure above and below ground in Jabaliya, Beit Hanoun and Beit Lahia, and eliminating any immediate threat to Israeli forces and the state of Israel. During operations, the IDF said, dozens of terrorists who crossed the ‘yellow line’ and posed an immediate threat were killed. In cooperation with Yahalom combat engineers, forces destroyed more than four kilometers of underground tunnel routes used by Hamas. In Beit Hanoun, about 10 mortar shells hidden inside a children’s blanket were discovered in a residential home. The ‘Future for the Border’ movement, which represents residents advocating for rehabilitation and rebuilding, responded sharply to Mashiach’s remarks. “The northern brigade commander and senior defense officials must understand that border residents are not sleeping soundly,” the group said. “Not when there is an enemy beyond the fence, an enemy that is rebuilding and planning the next attack. Not when false alarms wake children at night. Living in a prolonged combat zone is not normal.” The movement added: “We demand an end to normalizing a dangerous reality. You cannot speak of sleeping soundly when there is a living threat beyond the fence. We were already lulled once. On October 6 we slept soundly, and on October 7 we woke up to disaster. Security is not built on calming statements or temporary quiet. We support the IDF, but we also demand restored trust and a clear understanding: communities remain, commanders rotate. We are not asking for quiet. We demand the removal of the threat, the only real long-term solution.”","summary":"Heavy engineering works are reshaping northern Gaza as the IDF entrenches along the ‘yellow line’ ahead of Netanyahu’s meeting with Trump on a possible withdrawal, while border communities warn that calm words cannot replace real security","url":"https://www.ynetnews.com/article/rjnykzjmbg","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/12/25/r111cKgyiX11l/r111cKgyiX11l_0_329_2560_1441_0_large.jpg","video":null,"publish_date":"2025-12-26 00:03:34","author":"Roni Green Shaulov","authors":["Roni Green Shaulov"],"language":"en","category":"politics","source_country":"il","sentiment":-0.134},{"id":389062078,"title":"US launches strike against Islamic State militants in northwest Nigeria","text":"p>Palm Beach, Florida: The United States carried out an airstrike against Islamic State militants in northwest ​Nigeria at the request of Nigeria's government, US President Donald Trump ‌and the US military said on Thursday, claiming ⁠the group had been ‌targeting Christians in the region.\"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, ​at levels not seen for many years, and even Centuries!,\" Trump said in a post on Truth Social..The US military's Africa Command said on X the strike was conducted ‌at the ‌request of Nigerian authorities and killed multiple ISIS militants..Ukraine, US negotiators discussed how to bring peace closer, Zelenskyy says.The strike comes after Trump starting in late October began ⁠warning that Christianity faces an \"existential threat\" in Nigeria and threatened to militarily intervene in the West African country over what he says is its failure to stop violence targeting Christian communities.Reuters ⁠reported on Monday the US had been conducting intelligence-gathering ⁠flights over large parts of Nigeria since late November.Nigeria's ‌government has said armed groups target both Muslims and ‌Christians, and US claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it ‍has agreed to work with the US to bolster its forces against militant groups.The country's population is split between Muslims living primarily in the north and Christians in the south.The president issued his statement on Christmas Day while he was at his Palm Beach, Florida, Mar-a-Lago Club, where he has been spending the holiday. He had no public events during the day and ​was last seen by ‌the reporters traveling with him on Wednesday night.</p","url":"https://www.deccanherald.com/world/us-launches-strike-against-islamic-state-militants-in-northwest-nigeria-3842982","image":"https://media.assettype.com/deccanherald/2025-12-26/g1ues5au/file83u5zpwp3pyeakb727b.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-26 00:03:26","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.177},{"id":389061596,"title":"US launches 'deadly' strike against ISIS in northwest Nigeria: President Trump","text":"Washington DC [US], December 26 (ANI): The United States on Thursday (local time) launched a \"deadly\" strike against the terror organisation Islamic State in northwest Nigeria, said President Donald Trump. Donald Trump, in a social media post on Truth Social, said that the strike targeted terrorists over the alleged killings of Christians. \"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even centuries! I have previously warned these terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,\" Trump said. \"The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our country will not allow radical Islamic terrorism to prosper. May God bless our military, and MERRY CHRISTMAS to all, including the dead terrorists, of which there will be many more if their slaughter of Christians continues,\" the US President added. According to the US National Counterterrorism Centre, \"ISIS-West Africa (ISIS-WA) was formed in 2015 when Boko Haram pledged allegiance to ISIS. The branch, as per the United States, attacks regional military targets and civilian defence forces and frequently attacks government personnel and infrastructure, and Christians.\" Earlier on December 19 (local time), US and Jordanian forces carried out large-scale air strikes against the Islamic State terror group in Syria, hitting more than 70 ISIS targets with over 100 precision-guided munitions, the US Central Command (CENTCOM) said. In a post on X, CENTCOM said the strikes were carried out overnight and described the operation as a demonstration of \"peace through strength.\" The command also released a video showing footage of the air strikes.The operation came days after a suspected Islamic State attacker targeted a convoy of US and Syrian forces in the central Syrian town of Palmyra. (ANI)","url":"https://aninews.in/news/world/us/us-launches-deadly-strike-against-isis-in-northwest-nigeria-president-trump20251226053236","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251226000226.jpg","video":null,"publish_date":"2025-12-26 00:02:36","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.012},{"id":389062504,"title":"US launches 'deadly' strike against ISIS in northwest Nigeria: President Trump","text":"Washington DC [US], December 26 (ANI): The United States on Thursday (local time) launched a \"deadly\" strike against the terror organisation Islamic State in northwest Nigeria, said President Donald Trump. Donald Trump, in a social media post on Truth Social, said that the strike targeted terrorists over the alleged killings of Christians. \"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even centuries! I have previously warned these terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,\" Trump said. \"The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our country will not allow radical Islamic terrorism to prosper. May God bless our military, and MERRY CHRISTMAS to all, including the dead terrorists, of which there will be many more if their slaughter of Christians continues,\" the US President added. According to the US National Counterterrorism Centre, \"ISIS-West Africa (ISIS-WA) was formed in 2015 when Boko Haram pledged allegiance to ISIS. The branch, as per the United States, attacks regional military targets and civilian defence forces and frequently attacks government personnel and infrastructure, and Christians.\" Earlier on December 19 (local time), US and Jordanian forces carried out large-scale air strikes against the Islamic State terror group in Syria, hitting more than 70 ISIS targets with over 100 precision-guided munitions, the US Central Command (CENTCOM) said. In a post on X, CENTCOM said the strikes were carried out overnight and described the operation as a demonstration of \"peace through strength.\" The command also released a video showing footage of the air strikes.The operation came days after a suspected Islamic State attacker targeted a convoy of US and Syrian forces in the central Syrian town of Palmyra. (ANI)","url":"https://www.aninews.in/news/world/us/us-launches-deadly-strike-against-isis-in-northwest-nigeria-president-trump20251226053236","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251226000226.jpg","video":null,"publish_date":"2025-12-26 00:02:36","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.012},{"id":389060000,"title":"U.S. launches strike against Islamic State militants in northwest Nigeria","text":"The United States carried out an airstrike against ​Islamic State militants in northwest Nigeria at the ‌request of Nigeria's government, U.S. President Donald ​Trump and the U.S. military said on Thursday (December 25, 2025), claiming the group had been targeting Christians in the region.\n\n\"Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been ​targeting and viciously killing, primarily, innocent Christians, at levels ⁠not seen for many years, and even Centuries!,\" Mr. Trump said in a post on Truth Social.\n\nThe U.S. military's Africa Command said on ​X the strike was conducted ⁠at the request of Nigerian authorities and killed multiple ISIS militants.\n\nThe strike comes after Mr. Trump starting in late October began warning that Christianity faces an \"existential ‌threat\" in Nigeria and threatened to militarily intervene in the West ‌African country over what he says is its failure to stop violence targeting Christian communities.\n\nReuters reported ‍on Monday the U.S. had been conducting intelligence-gathering flights over large parts of Nigeria since late November.\n\nNigeria's government has ‍said armed groups target both Muslims and Christians, and U.S. claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it has agreed to work with the U.S. to bolster its forces against militant groups.\n\nThe country's population is split between Muslims living primarily in the north ⁠and Christians in the south.\n\nThe President issued his statement on Christmas Day while he was ​at his Palm Beach, Florida, Mar-a-Lago Club, where he has ⁠been spending the holiday. He had no public events during the day and was last seen by the reporters traveling with him on Wednesday (December 24, 2025) night.","summary":"The U.S. military's Africa Command said on ​X the strike was conducted ⁠at the request of Nigerian authorities and killed multiple ISIS militants","url":"https://www.thehindu.com/news/international/us-launches-strike-against-islamic-state-militants-in-northwest-nigeria/article70438705.ece","image":"https://th-i.thgim.com/public/incoming/6xodgf/article70438708.ece/alternates/LANDSCAPE_1200/AP12_25_2025_000005B.jpg","video":null,"publish_date":"2025-12-26 00:01:39","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.216},{"id":389059346,"title":"US carries out airstrikes against Islamic State ‘terrorist scum’ in Nigeria, Trump says","text":"Donald Trump said the US has carried out air strikes against Islamic State militants in northwest Nigeria on Thursday, claiming the militant group had been targeting Christians in the region.\n\nThe president said in a post on Truth Social: “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!\n\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing.”\n\nNo other details of the strikes were immediately available.\n\nTrump has previously said that he would launch a “guns-a-blazing” US military intervention in Nigeria, claiming that the country’s government has been inadequate in its efforts to prevent attacks on Christians by Islamist groups who have kidnapped and killed Christians there repeatedly.\n\nNigeria is officially a secular country but its population is almost evenly divided between Muslims (53 per cent) and Christians (45 per cent). Violence against Christians has drawn significant international attention, especially among the religious right in America, and it has been often framed as religious persecution.\n\nHowever, most analysts argue the situation is more complex and has long roots in the region’s history. In some parts of the country clashes between itinerant Muslim herders and predominantly Christian farming communities are rooted in competition over land and water.\n\nPriests and pastors have increasingly been kidnapped for ransom, but some analysts say this may be a trend driven by criminal incentives rather than religious discrimination. – Guardian","summary":"Donald Trump has previously claimed Nigerian government has not done enough to protest Christians","url":"https://www.irishtimes.com/world/africa/2025/12/26/us-carries-out-airstrikes-against-islamic-state-terrorist-scum-in-nigeria-trump-says/","image":"https://www.irishtimes.com/resizer/v2/P6Q4G45S423VGDATMHYPJZWASE.jpg?auth=81567f67259f1f945eeadd943d4671d3488c267dca54ef102bb98b7ea2076d06&smart=true&width=1600&height=900","video":null,"publish_date":"2025-12-26 00:01:36","author":"Fri Dec 26 2025 - 00:01","authors":["Fri Dec 26 2025 - 00:01"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.101},{"id":389059308,"title":"Trump launches strikes on Isis targets in Nigeria","text":"The US carried out an air strike against Isis militants in northwest Nigeria at the request of Nigeria’s government, Donald Trump and the US military said on Thursday, claiming the group had been targeting Christians in the region.\n\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!,” Mr Trump wrote on Truth Social.\n\nThe US military’s Africa Command said on X that the strike was conducted at the request of Nigerian authorities and killed multiple Isis militants.\n\nThe strike comes after Mr Trump warned that Christianity faces an “existential threat” in Nigeria and threatened to militarily intervene in the West African country over what he says is its failure to stop violence targeting Christian communities.\n\nReuters reported on Monday that the US had been conducting intelligence-gathering flights over large parts of Nigeria since late November.\n\nNigeria’s government has said armed groups target both Muslims and Christians, and that US claims that Christians face persecution do not represent a complex security situation and ignore efforts to safeguard religious freedom. But it has agreed to work with the US to bolster its forces against militant groups.\n\nThe country’s population is split between Muslims living primarily in the north and Christians in the south.\n\nThe US president issued his statement on Christmas Day while he was at Mar-a-Lago, where he has been spending the holiday.","url":"https://uk.news.yahoo.com/trump-launches-strikes-isis-targets-000113240.html","image":"https://s.yimg.com/ny/api/res/1.2/d1zenO6p5QZtVwLtv5zaSQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIzMDQ7aD0xNDQwO2NmPXdlYnA-/https://media.zenfs.com/en/the_telegraph_818/2212197f169525016448ed7774227d8e","video":null,"publish_date":"2025-12-26 00:01:13","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.132}]}