{"offset":0,"number":50,"available":16013,"news":[{"id":379096364,"title":"Trump Likely to Sell F-35 Fighters to Saudis, US Official Says","text":"President Donald Trump is expected to reach an agreement with Saudi Crown Prince Mohammed bin Salman that would allow the kingdom to purchase F-35 stealth planes, according to an administration official.The official, who spoke on condition of anonymity to discuss details not yet made public, said Trump and the crown prince — known as MBS — intend to sign economic and defense agreements during a visit to the White House scheduled for Tuesday. Those agreements will also include a deal on purchases of liquefied natural gas, the official added, without providing more details.The sale of F-35s, if completed, would be a major concession to Saudi Arabia as Washington and Riyadh look to deepen their ties and as Trump presses the country to join the Abraham Accords and normalize relations with Israel.The Saudis have been seeking to purchase F-35 planes, which are made by Lockheed Martin Corp. and are among the world’s most advanced jets, according to officials familiar with the negotiations. The jets cost about $100 million each.There have been signs that Trump is willing to sign off on a purchase, despite some major stumbling blocks. One sticking point is that Israel is the only state in the Middle East that has the fighter jets and is eager to protect that monopoly, which it says provides a crucial edge for its security.A Pentagon report raised concerns that China could acquire the plane’s advanced technology if a sale to Saudi Arabia was approved, citing Beijing’s defense ties with Riyadh, the New York Times reported. A potential F-35 sale is one of a number of issues that Trump and MBS are expected to address during the visit, with access to artificial intelligence chips and nuclear technology, the future of Gaza and the issue of Saudi relations with Israel also high on the agenda.The relationship between the US and Saudi Arabia was strained following the murder of newspaper columnist Jamal Khashoggi in 2018, but Trump has looked to cultivate a close relationship with the crown prince.The White House did not respond to a request for comment. ©2025 Bloomberg L.P.This article was generated from an automated news agency feed without modifications to text.","url":"https://www.livemint.com/politics/news/trump-likely-to-sell-f-35-fighters-to-saudis-us-official-says-11763148348816.html","image":"https://www.livemint.com/lm-img/img/2025/11/14/1600x900/logo/Politics_1545994646567_1763148351919.jpg","video":null,"publish_date":"2025-11-15 19:25:48","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":0.048},{"id":379096358,"title":"New Crypto Deals Put Retail at Risk After $17 Billion Wipeout","text":"(Bloomberg) -- Executives are turning to a novel structure to fund crypto accumulation vehicles as investor appetite thins.They’re called in-kind contributions, and they now account for a growing share of digital-asset treasury, or DAT, deals. Instead of raising cash to buy tokens in the open market, DAT sponsors contribute large slugs of their own crypto, often unlisted and hard to value.Digital-asset treasuries are a new breed of public company built to hold concentrated crypto positions. The structure surged in 2025 as small-cap firms, especially in biotech and mining, reinvented themselves as digital-asset proxies. Sponsors provide tokens or raise money to buy them, and the stock then trades as a kind of listed bet on crypto. For insiders, it’s a shortcut to liquidity. For investors, a wager on upside.But not all DATs carry the same level of risk. Earlier deals raised money to buy tokens through regular markets, which offered at least some independent price check. In-kind contributions skip that step — letting insiders decide what their tokens are worth, sometimes before the token even trades publicly. That shift means pricing and trading risks land more squarely on shareholders, many of them retail investors.Investor faith is already wobbling, with Bitcoin’s latest plunge well below $100,000 adding to the stress. Many DATs that once traded above the value of their holdings now trade below it. As insiders supply the tokens and set their price, it’s becoming harder for investors to tell what these deals are really worth, or when to get out.The in-kind structure was on full display in a recent $545 million private placement by Tharimmune Inc., a biotech firm-turned-crypto proxy, to set up a buyer of Canton Coins. About 80% of the raise came in the form of unlisted Canton tokens, priced at 20 cents each, according to an investor presentation seen by Bloomberg News. The token began trading on exchanges Nov. 10 and is now around 11 cents, CoinGecko data show. Tharimmune didn’t respond to a request for comment. More deals are following the same template. In these placements, insiders contribute tokens — sometimes illiquid or unlisted — to form a treasury, lock in valuations and seed the perception of market demand. But when tokens list below deal price, public shareholders absorb the difference.The rise of in-kind DATs highlight a broader shift in how crypto risk is being offloaded. With fresh capital harder to attract, sponsors are using public wrappers to crystallize token value and initiate price discovery. The vehicles can resemble circular trades, where the same actors supply the asset, set its value and benefit from the optics of a successful raise. What looks like market demand can instead be recycled inventory.A sharp market selloff of the kind that occurred in October can leave retail investors bearing the brunt of in-kind trades unwinding. “Ultimately, if market sentiment shifts, public investors in the fund, particularly retail, may be left exposed if the underlying illiquidity is finally tested, leaving them to absorb the very losses the sponsor’s contribution structure was designed to sidestep,” said Chris Holland, partner at Singaporean consulting firm HM. Especially for smaller tokens, an in-kind contribution “shifts much of the liquidity and market impact risk to the DAT,” he added. Singapore-based 10X Research said in an October report that retail traders had lost an estimated $17 billion buying stocks modeled on Michael Saylor’s archetypal Bitcoin buyer Strategy Inc. Canton isn’t alone in leaning heavily on untested tokens to get a treasury deal done. Alt5 Sigma Corp. raised $1.5 billion in August to invest in tokens issued by World Liberty Financial, a crypto venture with ties to US President Donald Trump. Half of the total sum came in the form of WLFI tokens priced at 20 cents each. At that time, WLFI tokens weren’t trading on exchanges. Then there’s Flora Growth Corp., a Nasdaq-listed company that announced a $401 million deal to start acquiring Zero Gravity tokens in September. On closer inspection, the firm had raised just $35 million in cash to pair with a $366 million in-kind contribution of then-unlisted 0G tokens. Those tokens were priced at around $3 a piece; they subsequently listed, and are now trading at about $1.20. Flora Growth remains confident in the potential of DATs “to give investors new on-ramps into crypto,” Chief Executive Officer Daniel Reis-Faria said. “I have a long-term conviction-driven approach and belief in both 0G and decentralized AI infrastructure.”Both companies’ shares have been under pressure from the moment they became crypto proxies. They are each down more than 65% since announcing plans to adopt a DAT strategy. Alt5 Sigma didn’t respond to a request for comment. “An 80% in-kind DAT is effectively a thin equity wrapper around one single volatile token,” said Akshat Vaidya, who has overseen investments in crypto treasuries as co-founder and managing partner of Arthur Hayes’ family office Maelstrom. “If the token drops 50%, the share price falls 80%-100% because the premium evaporates at the same time that forced sellers hit the bid.” Leon Foong, managing partner at Mythos Venture Partners, an active investor in DATs, said that in-kind contributions create “a reflexivity which can act both ways — on the upside but also a downward spiral.” The more illiquid the token, the riskier the deal, he added. To be sure, in-kind contributions have been part and parcel of the DAT trade since it took off in the first half of the year. In July, crypto veteran Adam Back’s Blockstream poured 25,000 Bitcoin — worth about $3 billion at the time — into a blank check company that partnered with an investment vehicle backed by Cantor Fitzgerald to form a treasury company. But that kind of structure hasn’t raised eyebrows, thanks in part to how liquid and widely distributed the original cryptocurrency has become. Contributions of less-liquid tokens, on the other hand, create “a very delicate balance,” according to Vaidya, “because the DAT sponsors are usually the same people who hold the most of the underlying token as well.”(Adds fresh market context in fifth paragraph, updates second chart)More stories like this are available on bloomberg.com©2025 Bloomberg L.P.","url":"https://www.livemint.com/market/cryptocurrency/new-crypto-deals-put-retail-at-risk-after-17-billion-wipeout-11763148349255.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/logo/market1_1733465997762_1733466008348.jpg","video":null,"publish_date":"2025-11-15 19:25:48","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.192},{"id":379121578,"title":"Temporary closure of Liguanea Avenue to continue next week","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n Temporary closure of Liguanea Avenue to continue next week \n\n\n\n\n\n\n\nKINGSTON, Jamaica — Another section of Liguanea Avenue in Kingston is set to be temporarily closed as rehabilitation works along the corridor continue under the National Works Agency’s (NWA) SPARK Programme.\n\nIn a release on Friday, the NWA shared that the latest closure, stretching between Paddington Terrace and Barbican Road, will take effect on Monday, November 17, and remain in place for 14 days.\n\nAccording to Manager of Communication and Customer Services at the NWA, Stephen Shaw, the project forms part of ongoing efforts to improve critical road infrastructure across the Corporate Area.\n\nShaw explained that the rehabilitation works include strengthening the road base, resurfacing and carrying out other supporting infrastructure improvements. He noted that temporary closures are necessary to ensure the safety of both workers and commuters and to reduce disruptions within the active work zone.\n\nDuring the two-week closure, access to the affected section of Liguanea Avenue will be restricted to residents. All other motorists are being urged to use alternative routes.\n\nMotorists travelling from the direction of Barbican Road are being advised to use Paddington Terrace to access Liguanea Avenue. Motorists travelling from the direction of Hope Road may also use Paddington Terrace to access their destinations.\n\nThe NWA is encouraging road users to obey posted signs and exercise caution while travelling through the area.\n\n\n\n\n\n\n\n\nTags: Liguanea Avenue road works SPARK Programme \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Forex: $161.62 to one US dollar \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n KINGSTON, Jamaica — The United States (US) dollar on Friday, November 14, ended trading at $161.62, up 23 cents, according to the Bank of Jamaica’s d... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n HerRelief to provide sustainable healthcare, supplies to Hurricane Melissa victims \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nNovember 14, 2025 \n\n\n HerRelief Jamaica will be providing urgent medical care to residents in parishes ravaged by Hurricane Melissa. The organisation was founded by Pharmac... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Cabbie wanted in killing of teacher and daughter found dead in suspected suicide \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n CLARENDON, Jamaica — Brandon Maine, the taxi operator who police on Thursday named as a person of interest in the murder of a St Catherine teacher and... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic pile-up on Kendal main road after crash \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Heavy traffic is now being experienced on the Kendal main road in Manchester following the collision of two heavy duty vehicles ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/temporary-closure-liguanea-avenue-continue-next-week/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/Road-Work-Ahead.png","video":null,"publish_date":"2025-11-15 03:16:10","author":null,"language":"en","source_country":"jm","sentiment":0.045},{"id":379121580,"title":"Forex: $161.62 to one US dollar","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News \n\nNovember 14, 2025\n\n\n\n\n Forex: $161.62 to one US dollar \n\n\n\n\n\n\n\nKINGSTON, Jamaica — The United States (US) dollar on Friday, November 14, ended trading at $161.62, up 23 cents, according to the Bank of Jamaica’s daily exchange trading summary.\n\nMeanwhile, the Canadian dollar ended trading at $118.05 up from $115.26 and the British pound ended at $213.16 up from $212.49.\n\n\n\n\n\n\n\n\nTags: Forex Money US \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n HerRelief to provide sustainable healthcare, supplies to Hurricane Melissa victims \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nNovember 14, 2025 \n\n\n HerRelief Jamaica will be providing urgent medical care to residents in parishes ravaged by Hurricane Melissa. The organisation was founded by Pharmac... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Cabbie wanted in killing of teacher and daughter found dead in suspected suicide \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n CLARENDON, Jamaica — Brandon Maine, the taxi operator who police on Thursday named as a person of interest in the murder of a St Catherine teacher and... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic pile-up on Kendal main road after crash \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Heavy traffic is now being experienced on the Kendal main road in Manchester following the collision of two heavy duty vehicles ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/forex-161-62-one-us-dollar-20251114-2207-067421/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2024/01/fcf2691526d181bd2df3311283cb5e6e.jpg","video":null,"publish_date":"2025-11-15 03:07:06","author":null,"language":"en","category":"business","source_country":"jm","sentiment":-0.07},{"id":379121582,"title":"HerRelief to provide sustainable healthcare, supplies to Hurricane Melissa victims","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTheresa White. \n\n Latest News, News \n\nBY KEDIESHA PERRY Observer writer \n November 14, 2025\n\n\n\n\n HerRelief to provide sustainable healthcare, supplies to Hurricane Melissa victims \n\n\n\n\n\n\n\nHerRelief Jamaica will be providing urgent medical care to residents in parishes ravaged by Hurricane Melissa.\n\nThe organisation was founded by Pharmaceutical Executive and Philanthropist, Theresa White along with Dr Kerone Thomas.\n\n“HerRelief Jamaica was formed in direct response to the unprecedented devastation caused by Hurricane Melissa. Our team of Jamaican-born female medical professionals recognised the urgent need for coordinated, compassionate and sustained medical support for the hardest-hit communities. This initiative reflects our commitment to using our skills, resources and network to help our country recover and rebuild,” White said.\n\nWith the members based across the United States, the team will arrive on November 21, with regular scheduled visits afterwards to ensure continuity. They will first be visiting Westmoreland to assess the severity of residents’ needs to plan accordingly. In addition to healthcare, HerRelief will also be providing essentials like water tanks, Starlink internet and generators to parishes such as Trelawny and St James.\n\nHerRelief Jamaica will be working in collaboration with other established organisations to coordinate the collection and shipment of critical relief supplies to those most in need.\n\nMeanwhile, White noted that HerRelief looks to bridge the gap between destitution in affected areas and access to quality healthcare.\n\n“Our goal is to provide immediate crisis-level medical care while also establishing a long-term support framework for underserved and displaced individuals. Through ongoing missions, we seek to restore access to essential healthcare services, strengthen community health and collaborate with partners to rebuild medical capacity in affected areas,” she added.\n\nHerRelief Jamaica will offer a comprehensive range of services, including primary and acute medical care, mental health support (psychiatric and psychological care), dental services, medication distribution and basic emergency interventions, and support for chronic illnesses and displaced patients.\n\nThe organisation’s board members include: Dr Nekeisha L. Walker, DHA, MBA, MHA, Dr Georgia Forrest, MD, MBA, CPE, Dr. Sharon Robinson Rowe, DDS (General Dentist), Dr Yeneisha Greene, MD,Sherie Nelson-Allen, Educator and Doctoral Candidate (Psychology), Dr Joan Thaxter Randall, D.Litt, Global Leadership Fellow, Principal & Founder, Victorious You Press.\n\nDr Kerone Thomas\n\n\n\n\n\n\n\n\nTags: healthcare Hurricane Melissa relief efforts \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News \n\n\n\n\n\n\n\n\n\n Forex: $161.62 to one US dollar \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n KINGSTON, Jamaica — The United States (US) dollar on Friday, November 14, ended trading at $161.62, up 23 cents, according to the Bank of Jamaica’s d... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Cabbie wanted in killing of teacher and daughter found dead in suspected suicide \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n CLARENDON, Jamaica — Brandon Maine, the taxi operator who police on Thursday named as a person of interest in the murder of a St Catherine teacher and... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic pile-up on Kendal main road after crash \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Heavy traffic is now being experienced on the Kendal main road in Manchester following the collision of two heavy duty vehicles ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/herrelief-prvide-sustainable-healthcare-supplies-hurricane-melissa-victims/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/Thresea..jpg","video":null,"publish_date":"2025-11-15 02:46:04","author":null,"language":"en","source_country":"jm","sentiment":0.633},{"id":379107992,"title":"Cabbie wanted in killing of teacher and daughter found dead in suspected suicide","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n Cabbie wanted in killing of teacher and daughter found dead in suspected suicide \n\n\n\n\n\n\n\nCLARENDON, Jamaica — Brandon Maine, the taxi operator who police on Thursday named as a person of interest in the murder of a St Catherine teacher and her teen daughter, is suspected to have committed suicide in Tweedside, Clarendon on Friday afternoon, sources say.\n\nPreliminary reports are that about 1:00 pm, Maine was found hanging from a mango tree in a yard in Tweedside. Sources say he reportedly fled to the area on Wednesday.\n\nA day later the bodies of 29-year-old Tara Pinnock, who worked at a St Catherine-based primary school, and 14-year-old Tally Wright were discovered at a premises in Mount View, near St Jago Heights in St Catherine.\n\nAccording to Senior Superintendent of Police (SSP), Hopton Nicholson, officers were alerted to suspicious activities on a Mount View premises sometime after 1:00 pm and upon entering, their bodies were discovered.\n\nNicholson said both victims were found with what appeared to be stab wounds all over the body.\n\nHe explained that early findings suggest the perpetrator(s) had access to the home.\n\n“Preliminary investigations have not revealed any forced entry,” he said, adding that detectives will be conducting a thorough investigation.\n\nREAD: Police investigating double murder of St Catherine teacher and student\n\n— Kasey Williams\n\n\n\n\n\n\n\n\nTags: Double Murder Suicide taxi operator \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Traffic pile-up on Kendal main road after crash \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Heavy traffic is now being experienced on the Kendal main road in Manchester following the collision of two heavy duty vehicles ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/taxi-driver-named-poi-double-murder-teacher-student-found-dead-suicide-suspected/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/tecnavia-social-meta-image?post_slug=taxi-driver-named-poi-double-murder-teacher-student-found-dead-suicide-suspected","video":null,"publish_date":"2025-11-15 01:49:36","author":null,"language":"en","source_country":"jm","sentiment":-0.37},{"id":379107988,"title":"Traffic pile-up on Kendal main road after crash","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrack and trailer crash n the Kendal main road on Friday, November 14 (Photo: Dana Malcolm) \n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n Traffic pile-up on Kendal main road after crash \n\n\n\n\n\n\n\nMANCHESTER, Jamaica — Heavy traffic is now being experienced on the Kendal main road in Manchester following the collision of two heavy duty vehicles on Friday.\n\nThe crash occurred around a sharp bend on the road and involved a truck and a trailer which was transporting a tractor at the time of the incident.\n\nThe winding Kendal Road is being used as an alternate route as the Content main road is currently impassable.\n\nThat road is submerged by groundwater that rose after the passage of Category Five Hurricane Melissa.\n\n\n\n\n\n\n\n\nTags: Crash Kendal main road Traffic \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Taxi driver named as POI in double murder of teacher and daughter found dead; suicide suspected \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n CLARENDON, Jamaica — Brandon Maine, the taxi operator who police on Thursday named as a person of interest in the murder of a St Catherine teacher and... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation int... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/traffic-pile-kendal-main-road-crash/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/WhatsApp-Image-2025-11-14-at-14.50.00_92ab10b5-1024x768.jpg","video":null,"publish_date":"2025-11-15 01:39:25","author":null,"language":"en","source_country":"jm","sentiment":0.113},{"id":379143920,"title":"Donald Trump ditches tariff plan in bid to slash the cost of Aussie steaks in the United States","text":"Australian beef will now be exempt from Donald Trump's sweeping tariffs after the US President placed a 10 per cent tax on the billion-dollar export. \n\nThe White House released a statement saying the President had signed off on the exemption in a wide-ranging executive order.\n\nThe order covers a range of food and agricultural products - coffee, tea, tropical fruits, cocoa, bananas, oranges, tomatoes and beef - alongside coal, petroleum, uranium and various chemicals. \n\nThe dramatic reversal comes as the Trump administration seeks to ease cost-of-living pressures in the US. \n\n'Today, President Donald J. Trump signed an Executive Order modifying the scope of the reciprocal tariffs that he first announced on April 2, 2025,' the statement read. \n\n'Specifically, certain qualifying agricultural products will no longer be subject to those tariffs.'\n\nThe order is retroactive, allowing importers to claim refunds on tariffs already paid \n\nAustralia exports more than $2billion worth of beef to the US every year. \n\nHowever, experts remain sceptical about the impact on Australia’s beef industry, which has actually benefitted from the tariffs. \n\nTrump first flagged Australian beef as a target on April 2. \n\n'Australia bans – and they're wonderful people, and wonderful everything – but they ban American beef,' he said, while announcing the tariff policy. \n\n'Yet we imported $3billion of Australian beef from them just last year alone.\n\n'They won't take any of our beef. They don't want it because they don't want it to affect their farmers. And you know, I don't blame them, but we're doing the same thing right now starting at midnight tonight.'\n\nJames Morgan, managing director of Mutooroo Pastoral Company, told Daily Mail the situation could have been worse. \n\n'If it was a ban this discussion would be a lot more serious and there would be a lot of disappointed and angry people,' he said. \n\nWhile the news of the tariff was still disappointing, industry figures said American consumers would feel the pinch more than Australian farmers.\n\nThe US needs Australia's lean, grass-fed beef to make hamburgers, because drought in America has resulted in the culling of herds and a shortage of product.\n\nGrass-fed beef made up 96 per cent of Australia's beef exports to the US in 2024.\n\nExports surged in 2025 amid falling US beef production and steeper tariffs on Chile, Argentina and Brazil.","summary":"The White House confirmed the exemption in a statement.","url":"https://www.dailymail.co.uk/news/article-15293109/Donald-Trump-tariff-beef-Australian-farmers.html","image":"https://i.dailymail.co.uk/1s/2025/11/15/00/103901413-0-image-a-19_1763166392232.jpg","video":null,"publish_date":"2025-11-15 01:16:55","author":"Editor,Matt Jones,Olivia Day","authors":["Editor","Matt Jones","Olivia Day"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.564},{"id":379142996,"title":"Judge bars Trump from immediately cutting funding to University of California","text":"Washington, Nov 15 (AP) The Trump administration cannot immediately cut federal funding to the University of California or issue fines against the school system over claims it allows antisemitism and other forms of discrimination, a federal judge ruled Friday.\nU.S. District Judge Rita Lin in San Francisco granted a preliminary injunction sought by labor unions and other groups representing UC faculty, students and employees.\nMessages sent to the White House and the U.S. Department of Justice were not immediately returned.\nThe unions argue in a lawsuit that the administration is using funding cuts, and the threat of cuts, to silence opposing viewpoints at UC in violation of the Constitution and federal law. President Donald Trump has decried elite colleges as overrun by liberalism and antisemitism.\nHis administration has launched investigations of dozens of universities, claiming they have failed to end the use of racial preferences in violation of civil rights law. The Republican administration says diversity, equity and inclusion efforts discriminate against white and Asian American students.\nOver the summer. it fined the University of California, Los Angeles $1.2 billion and froze research funding after accusing the school of allowing antisemitism on campus. UCLA was the first public university to be targeted by the administration over allegations of civil rights violations.\nIt has also frozen or paused federal funding over similar claims against private colleges, including Columbia University.\nUniversity of California President James B. Milliken has said the size of the UCLA fine would devastate the UC system, whose campuses are viewed as some of the top public colleges in the nation.\nUC is in settlement talks with the administration and is not a party to the lawsuit before Lin, who was nominated to the bench by President Joe Biden, a Democrat.\nThe administration has demanded UCLA comply with its views on gender identity and establish a process to make sure foreign students are not admitted if they are likely to engage in anti-American, anti-Western or antisemitic “disruptions or harassment,” among other requirements outlined in a settlement proposal made public in October.\nThe administration has previously struck deals with Brown University for $50 million and Columbia University for $221 million. (AP) NB NB","summary":"","url":"https://www.news18.com/agency-feeds/judge-bars-trump-from-immediately-cutting-funding-to-university-of-california-9708779.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_World_Section_Default_Image_1600x900-2025-07-4401653589b9d10b46b8abb07f758342.jpg","video":null,"publish_date":"2025-11-15 01:11:58","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":-0.017},{"id":379107990,"title":"Mandeville police name person of interest in Mile Gully murder","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n Mandeville police name person of interest in Mile Gully murder \n\n\n\n\n\n\n\nMANCHESTER, Jamaica — Mandeville police have listed one man as a person of interest who they believe can assist them with an ongoing investigation into a murder on the Sherhampton main road in Mile Gully, Manchester on Tuesday, October 14.\n\nHe has been identified as Raynard Boswell. Boswell is being asked to report to the Mandeville Police immediately.\n\nLikewise, anyone with information about his whereabouts is asked to contact the Mandeville Criminal Investigation Branch (CIB) at 876-962-2832, Crime Stop at 311, the 119 police emergency number, or the nearest police station.\n\n\n\n\n\n\n\n\nTags: Mandeville Mile Gully Police \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Residents urged to avoid direct contact with rising floodwaters in Content \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica —The Manchester Health Department (MHD) is advising members of the public to avoid direct contact with the rising floodwaters in C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man killed, woman injured in Bull Bay domestic dispute \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST ANDREW, Jamaica – A man was shot dead and a woman injured during a domestic dispute at Jackvale district in 11 Miles, Bull Bay, St Andrew, on Thurs... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/mandeville-police-name-person-interest-mile-gully-murder/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/07/bd2ddf31db5d508645db0d89eb9d1bb3-1.jpg","video":null,"publish_date":"2025-11-15 01:11:54","author":null,"language":"en","source_country":"jm","sentiment":-0.015},{"id":379143908,"title":"Donald Trump re-ignites feud with London Mayor Sir Sadiq Khan in unhinged TV rant","text":"Donald Trump has reignited his feud with London Mayor Sir Sadiq Khan in an unhinged TV rant. Trump gave an interview to GB News, during which he made a string of false claims - entirely unchallenged. Asked about Sir Sadiq, Trump said: \"He's a terrible, terrible mayor. As an example, I was a high ranking officer, sort of always, or President. Even as a civilian, I was a respected person. He treated me very badly. I said who is that guy? He's a terrible mayor, and look at the crime in London.\" Violent crime is falling in London. There was a 6% reduction in violence against the person recorded by the metropolitan police in the 12 months to March 2025. Londoners are statistically less likely to be a victim of violent crime than across the rest of England & Wales . Trump went on: \"My mother loved London, she loved that city...but it's a different London than you have today. Today you have people being stabbed in the ass. Or worse. But no it's crazy. Your mayor is a disaster. I don't even know him. If you put him there I wouldn't even know who he was. I can tell you he's a disaster. He's a nasty person. And he's letting crime go.\" He went on to repeat claims widely spread by far-right and white supremacist groups in the UK that there are \"no-go\" areas for the police in London, and areas where so-called Sharia Law has supplanted British law. Neither of these claims is true. Yet Trump said: \"You have areas in London and you have this in Paris too, where the police don't even want to go. You have sharia law where they don't even obey the laws of your country or France or other countries and you have much worse conditions than even that.\" Trump went on to claim his speech at the UN General Assembly in September had been deliberately sabotaged by the UN, \"purposely\" turning off his teleprompter and stopping his escalator. He also claimed, again, that the speakers in the main hall at the UN had been switched off for his speech so that nobody would hear it. The main hall at the UN does not routinely amplify speeches from the stage, because most people in the room - delegates from around the world who speak many languages - listen to translations on earpieces attached to every seat.","url":"https://www.mirror.co.uk/news/politics/donald-trump-re-ignites-feud-36250714","image":"https://i2-prod.mirror.co.uk/article35956991.ece/ALTERNATES/s1200b/0_JS381518464_Main.jpg","video":null,"publish_date":"2025-11-15 01:08:24","author":"Mikey Smith","authors":["Mikey Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.247},{"id":379144078,"title":"Judge bars Trump from immediately cutting funding to the University of California","text":"The Trump administration cannot immediately cut federal funding to the University of California or issue fines against the school system over claims it allows antisemitism and other forms of discrimination, a federal judge ruled Friday.\n\nU.S. District Judge Rita Lin in San Francisco granted a preliminary injunction sought by labor unions and other groups representing UC faculty, students and employees.\n\nMessages sent to the White House and the U.S. Department of Justice were not immediately returned.\n\nThe unions argue in a lawsuit that the administration is using funding cuts, and the threat of cuts, to silence opposing viewpoints at UC in violation of the Constitution and federal law. President Donald Trump has decried elite colleges as overrun by liberalism and antisemitism. \n\nHis administration has launched investigations of dozens of universities, claiming they have failed to end the use of racial preferences in violation of civil rights law. The Republican administration says diversity, equity and inclusion efforts discriminate against white and Asian American students. \n\nOver the summer. it fined the University of California, Los Angeles $1.2 billion and froze research funding after accusing the school of allowing antisemitism on campus. UCLA was the first public university to be targeted by the administration over allegations of civil rights violations.\n\nIt has also frozen or paused federal funding over similar claims against private colleges, including Columbia University. \n\nUniversity of California President James B. Milliken has said the size of the UCLA fine would devastate the UC system, whose campuses are viewed as some of the top public colleges in the nation.\n\nUC is in settlement talks with the administration and is not a party to the lawsuit before Lin, who was nominated to the bench by President Joe Biden, a Democrat.\n\nThe administration has demanded UCLA comply with its views on gender identity and establish a process to make sure foreign students are not admitted if they are likely to engage in anti-American, anti-Western or antisemitic “disruptions or harassment,” among other requirements outlined in a settlement proposal made public in October.\n\nThe administration has previously struck deals with Brown University for $50 million and Columbia University for $221 million.","summary":"A federal judge in San Francisco has blocked the Trump administration from immediately cutting funding to the University of California over claims the school system allows antisemitism and other forms of discrimination","url":"https://www.independent.co.uk/news/trump-joe-biden-san-francisco-white-house-columbia-university-b2865778.html","image":"https://static.independent.co.uk/2025/11/15/01/Trump_23086.jpg?width=1200","video":null,"publish_date":"2025-11-15 01:06:31","author":"Sudhin Thanawala","authors":["Sudhin Thanawala"],"language":"en","source_country":"gb","sentiment":0.01},{"id":379142170,"title":"Eduardo Bolsonaro, son of Brazil’s ex-president, to face obstruction charge  - Haiti Gazette – Daily Haiti","text":"The majority on a Supreme Court panel in Brazil has voted to bring Eduardo Bolsonaro, the third child of former far-right President Jair Bolsonaro, to trial on charges of obstruction of justice.\n\nOn Friday, three of the five justices on the panel accepted an indictment against the younger Bolsonaro, which accused him of using threats to interfere with a court case against his father.\n\nIn September, Brazil’s Supreme Court sentenced Jair Bolsonaro, who led Brazil from 2019 to 2023, to more than 27 years in prison for allegedly plotting to subvert his loss in the 2022 election by means of a coup.\n\nEduardo Bolsonaro has been among his father’s most prominent defenders throughout his myriad legal woes.\n\nAn elected official in the Chamber of Deputies, Eduardo travelled multiple times to the United States in the wake of Brazil’s 2022 election, meeting with President Donald Trump and his Republican officials.\n\nIn March, Eduardo announced he would move to the US to petition full-time on behalf of his father.\n\n“I will focus 100 percent of my time on this single cause: to seek justice,” he said in a social media video at the time.\n\nBut a majority of the justices on the Supreme Court panel determined that there was enough evidence to suggest Eduardo’s actions in the US may have amounted to an illegal pressure campaign, designed to sway his father’s court case.\n\n“There is significant evidence that Eduardo Nantes Bolsonaro’s actions aimed to create an environment of institutional and social instability, applying increasing sanctions to Brazilian authorities and causing economic harm to Brazil,” one justice, Alexandre de Moraes, wrote in his opinion.\n\nTwo other justices, Flavio Dino and Cristiano Zanin, joined de Moraes in voting to proceed to trial, granting a prosecutorial request. Voting on the Supreme Court panel remains open until November 25.\n\nTrump protests Bolsonaro case\n\nAt question is how Eduardo Bolsonaro may have lobbied the Trump administration to take action against Brazil, in order to drop the case against his father.\n\nJair Bolsonaro and Trump have been close allies, and Trump has shown a willingness to intervene in the politics of Latin American countries to support fellow right-wing leaders.\n\nIn Jair Bolsonaro’s case, Trump issued a letter in July accusing Brazil of censoring right-wing voices like the former president’s. He also threatened to impose steep tariffs if the case against Bolsonaro continued.\n\n“The way that Brazil has treated former President Bolsonaro, a Highly Respected Leader throughout the World during his Term, including by the United States, is an international disgrace,” Trump wrote in the letter, addressed to current President Luiz Inacio Lula da Silva.\n\n“This trial should not be taking place. It is a Witch Hunt that should end IMMEDIATELY!”\n\nAn executive order that same month declared Brazil’s actions a “national emergency” and an “unusual and extraordinary threat” against US interests.\n\nBy August, Trump had followed through with his economic threats, slapping Brazil with 50 percent tariffs on many of its exports to the US. It was the highest US tariff rate for any country in the world, matched only by India later that month.\n\nThe Trump administration also took specific action against Justice de Moraes, who spearheaded the investigation into former President Bolsonaro.\n\nOn July 18, the US Department of State announced it would strip visas from de Moraes, his family and “his allies on the court”, though no additional justice was named directly.\n\nThen, on July 30, the US sanctioned de Moraes for “engaging in a targeted and politically motivated effort designed to silence political critics”. The sanctions came under the Global Magnitsky Human Rights Accountability Act, ordinarily reserved for grave human rights abuses and corruption.\n\nBy September, the sanctions had been expanded to include de Moraes’s wife, Viviane Barci de Moraes.\n\nClose ties to Trump White House\n\nEduardo Bolsonaro has been vocal in his support of Trump’s efforts on behalf of his father. He has also become a frequent presence at the White House and events themed to Trump’s Make America Great Again (MAGA) movement.\n\nAt one event in March, Eduardo was seen conversing at the Trump Hotel with former White House adviser Steve Bannon, while sporting a green hat with a variation on Trump’s slogan: “Make Brazil Great Again.”\n\nIn August, he told BBC News in Washington, DC, that he supported Trump’s tariff campaign against Brazil.\n\n“I admire President Trump. We’ve met several times in his first and second term,” he told the British broadcaster. “We fought first to sanction Alexandre de Moraes. But if President Trump starts with tariffs, I do believe that he is right and I do support him because of that.”\n\nBut on Friday, in a statement posted to social media, Eduardo Bolsonaro denounced the Supreme Court panel’s decision to bring him to trial in absentia, calling it a “WITCH HUNT”. He added that he had no control over the sanctions Trump applied, nor the tariffs.\n\n“Tariffs and the application of the Magnitsky Act are neither at my disposal nor illegal,” Eduardo wrote. “It is clear that Moraes wants to convict me.”\n\nHe went on to argue that he believes de Moraes is attempting to use Brazil’s “clean record law” — a tool to prevent corruption in the government — to bar him from running for office in the future. “Can this be called democracy?” he asked.\n\nIf convicted on the obstruction charges, Eduardo Bolsonaro could face a fine and prison time of up to four years.\n\nJust last week, the Supreme Court panel also rejected his father’s attempt to reduce or toss his prison sentence. Jair Bolsonaro remains under house arrest while he appeals his conviction.","url":"https://haitigazette.com/eduardo-bolsonaro-son-of-brazils-ex-president-to-face-obstruction-charge/","image":"https://haitigazette.com/app/uploads/2025/11/AP25051636607600-1763160994-jJ33DJ.jpg","video":null,"publish_date":"2025-11-15 01:02:35","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":-0.048},{"id":379142812,"title":"Trump says he is considering F-35 fighter jet deal with Saudis","text":"WASHINGTON - U.S. President Donald Trump said on Friday that he is considering agreeing to a deal to supply Saudi Arabia with F-35 stealth fighter jets, which are made by Lockheed Martin.\n\n\"They wanna buy a lot of jets,\" Trump told reporters aboard Air Force One.\n\n\"I'm looking at that. They've asked me to look at it. They want to buy a lot of '35' - but they want to buy actually more than that, fighter jets.\"\n\nThe potential sale comes as Trump plans to host Saudi Crown Prince Mohammed bin Salman at the White House next week, when they are expected to sign economic and defense agreements.\n\nAsked about the talks, Trump told reporters it was \"more than meeting, we're honoring\" Saudi Arabia.\n\nHe repeated that he hoped Saudi would soon join the Abraham Accords, which have normalized relations between Israel and Muslim-majority nations. Riyadh has resisted such a step absent agreement on a roadmap to Palestinian statehood.\n\nA Pentagon intelligence report has raised concerns over the potential F-35 deal, warning that China could acquire the aircraft's technology if the sale proceeds, the New York Times reported on Thursday, citing people familiar with the assessment. REUTERS","url":"https://www.straitstimes.com/asia/trump-says-he-is-considering-f-35-fighter-jet-deal-with-saudis","image":"https://cassette.sphdigital.com.sg/image/straitstimes/bf582b184d18e2b1d8f3badaf3892b14916efe8636c716025c8dbd41a55dcdfc","video":null,"publish_date":"2025-11-15 01:02:07","author":"Lockheed Martin","authors":["Lockheed Martin"],"language":"en","category":"politics","source_country":"sg","sentiment":-0.358},{"id":379141924,"title":"Donald Trump WILL sue the BBC! US President announces '$1-5billion' legal case as he attacks 'egregious' edit of speech","text":"Donald Trump said he will sue the BBC as he blasted the broadcaster with a fiery rebuke to its apology.\n\nAfter the BBC refused the total capitulation demanded by the US President, Trump told journalists outside the White House on Friday: 'We'll sue them from anywhere between $1 billion and $5 billion, probably sometime next week'.\n\nWhen asked whether he would take legal action, the President said: 'I think I have to do it'. \n\nMr Trump had thrown down the gauntlet to the broadcaster with a deadline of 10pm on Thursday.\n\nHe had vowed to sue unless he got a full retraction, grovelling apology and offer of compensation for misleading Panorama viewers with an edit of his speech before the January 6 Capitol riot.\n\nThe BBC opted to defy the challenge and risk a high-stakes feud with the White House. It issued an apology on Thursday night but steadfastly refused to concede Mr Trump had a legal right to damages.\n\nCorporation chiefs then had a nervous 24 hours braced for a nuclear response from Mr Trump.\n\nThe broadcaster gave a calculated response to Mr Trump's vow by making an apology for giving Panorama viewers a misleading edit of Mr Trump's speech before the Capitol riot.\n\nTrump's remarks on Friday came as he gave a fiery interview with GB News, in which he called London Mayor Sadiq Khan a 'terrible, terrible mayor'.\n\nHe went on to say that Mr Khan 'is a disaster' and 'a nasty person', before making unsubstantiated claims that the British capital has areas where 'the police won't go' and where Sharia Law is being exercised. \n\nMr Trump's interview with GB News comes after the BBC defiantly refused to concede Mr Trump had a legal right to damages. Insiders said they were expecting a fierce rection from the President.\n\nIn a letter to BBC staff yesterday, seen by the Daily Mail, chairman Samir Shah acknowledged what 'I fully understand has been a difficult week', adding: 'I'm aware there is sadness, anger and frustration in relation to what has happened in recent days and it is hard when the BBC is the focus of so much attention and news headlines.'\n\nHe said he had written to President Trump 'personally to extend my apology' but that 'while the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim'. Mr Shah thanked staff for their resilience in what 'I fully appreciate have been challenging circumstances'.\n\nThe BBC had admitted 'that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action.'\n\nAmid catastrophic consequences for the corporation, Director General Tim Davie and Deborah Turness, the head of BBC News, both fell on their swords on Sunday.\n\nEarlier this week, Mr Trump remarked: 'I guess I have to [sue]. Why not? They defrauded the public and they've admitted it. This is within one of our great allies, supposedly our great ally. That's a pretty sad event. They actually changed my January 6 speech, which was a beautiful speech, which was a very calming speech, and they made it sound radical.'\n\nHe also told Fox News on Tuesday: 'I think I have an obligation to [sue] because you can't allow people to do that.'\n\nMr Trump said he would be 'left with no alternative but to enforce his legal and equitable rights... including by filing legal action for no less than 1,000,000,000 dollars [£760million] in damages,' if the BBC failed to act.\n\nWhen asked about Mr Trump's legal threats, White House press secretary Karoline Leavitt told reporters the corporation is a 'Leftist propaganda machine'.\n\nAs licence fee payers faced the prospect of a costly legal battle, the BBC's legal team sent Mr Trump a letter setting out five reasons why it does not think it has a case to answer.\n\nIt said the documentary was restricted to viewers in the UK, did not cause Mr Trump any harm - as he was re-elected shortly after – and 'was not designed to mislead, but just to shorten a long speech'.\n\nFourthly, it said the clip was 12 seconds within an hour-long programme, which also contained voices in support of Trump, and finally , an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.\n\nCulture Secretary Lisa Nandy told BBC Radio 4's Today programme the corporation's editorial standards and guidelines were 'in some cases not robust enough and in other cases not consistently applied'.","summary":"Donald Trump said he will sue the BBC as he blasted the broadcaster with a fiery rebuke to its apology last night. ","url":"https://www.dailymail.co.uk/news/article-15293089/Donald-Trump-sue-BBC-US-President-announces-1-5billion-legal-case-attacks-egregious-edit-speech.html","image":"https://i.dailymail.co.uk/1s/2025/11/15/00/103901923-0-image-a-7_1763167649887.jpg","video":null,"publish_date":"2025-11-15 01:00:16","author":"Editor,Sabrina Penty,Sam Greenhill","authors":["Editor","Sabrina Penty","Sam Greenhill"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.479},{"id":379143922,"title":"Tucker Carlson sparks panic as he exposes Trump shooter's ties to foreign terror group","text":"Tucker Carlson's latest exposé is sending shockwaves through MAGA circles after the former Fox News host suggested that Trump's failed assassin, Thomas Crooks, may be connected to a foreign terror group.\n\nCarlson's investigative team released a 34-minute video diving into the online history of Crooks, the 20-year-old would-be assassin who shot Donald Trump at a rally in Butler, Pennsylvania in July 2024. Crooks' bullet came within less than an inch of penetrating Trump's skull.\n\nMore than a year after the assassination attempt, the FBI has yet to release a clear motive for why Crooks tried to shoot Trump or whether he acted alone or in coordination with others.\n\nCarlson's uncovered YouTube comments allegedly posted by Crooks from 2019-2020, revealing the shooter's long digital history of making calls for assassinations and political violence. Crooks' YouTube comments indicate he radically shifted his ideology from pro-Trump towards the far left.\n\nDuring the final phase in 2020 of Crook's YouTube commenting, the shooter began interacting with a suspicious user 'Willy_Tepes' who appeared to encourage Crooks to commit political violence.\n\nHe wrote to Crooks on August 4, 2020, 'If a gun and a badge is all that is needed, then authority obviously comes from the barrel of a gun. We have more guns than they do ;)'\n\n'There is no way we can avoid a war at this point, so you just better get used to the idea,' he added.\n\nCarlson claims that Tepes's name is listed on a foreign Antifa website connecting him to the Nordic Resistance Movement - a neo-Nazi group based in Scandinavia which has been designated a terrorist organization by the State Department.\n\n'The FBI hasn't made any mention of him in public, although they certainly know he exists. Just days after the shooting, somebody screenshotted Tepes' YouTube account page despite the fact that he has very few followers,' Carlson said.\n\n'To the extent that he can be traced online now, you can find his username being used on a foreign Antifa website, those sites link him to the Nordic Resistance Movement ... that's all we know.' \n\nTepes wrote in another reply to Crooks about government efforts to seize guns from citizens.\n\n'The more guns that are out there, the less likely a gun confiscation will be possible. Nope, guns do not guarantee a victory anymore than jet fighters, tanks and drones do. It is the fighting spirit and brains that wins.'\n\n'We have nothing to lose and everything to win.....and the alternative, a global police state, is unacceptable. Nothing in life is simple but that is no argument against doing it :)'\n\nFollowing Tepes' online interactions with Crooks, the Trump shooter's YouTube commenting ends.\n\nMoreover, Crooks' political views seemingly shifted dramatically towards left-wing ideology around early 2020.\n\nIn January 2020, Crooks reportedly attacked Trump for his 'stupidity' in one of his YouTube comments and mocked Trump supporters for sounding like a 'cult.'\n\nCrooks then reportedly called for anti-Trump supporters to conduct 'terrorism-style attacks' against the US government.\n\nThe future assassin outlined ways to 'sneak a bomb' into a government building and 'set it off before anyone sees you,' according to Carlson.\n\n'[In my opinion] the only way to fight the [government] is with terrorism style attacks, sneak a bomb into an essential building [and] set it off before anyone sees you, track down and important people/politicians/military leaders etc and try to assassinate them. Any sort of head to head fight is suicide and ambush/surprise attacks likely aren't going to end well,' Crooks allegedly wrote on YouTube.\n\nMAGA influencers and lawmakers reacted with shock to Carlson' latest reporting and demanded more transparency from Kash Patel's FBI regarding Crooks.\n\nTennessee Republican Rep. Tim Burchett claimed that Crooks was groomed by the CIA via MKUltra-style mind control programs during an interview reacting to Carlson's latest report.\n\n'They programmed this kid. You got a kid who's got access to guns or has some simple knowledge of a firearm, he was programmed,' Burchett told conservative influencer Benny Johnson. 'The facts have been buried or burned or whoever knew is either sitting on a beach somewhere and, uh, enjoying a fruity drink or they're dead.'\n\n'When the CIA says, 'We don't have this thing,' and then their asses are brought into a court of law and they say, 'Well, we have it, but we don't use it anymore.' Apparently, somebody's using it.'\n\n'I've said that all along,' Burchett added. 'I've said that. Look at the history. Look at where we're at in this country, the Deep State. It's disgusting. Trump's right. They're not after, they're not after him. They're after us. He's just standing in the way.'\n\nKash Patel, meanwhile, issued a statement indirectly responding to Carlson's reporting by claiming the Bureau collected an extensive amount of data from Crooks.\n\nPatel does not provide any specific details into the data uncovered from the FBI investigation, nor his motive for trying to kill Trump. Furthermore, the FBI director continues to maintain that Crooks had limited online use.\n\n'The investigation, conducted by over 480 FBI employees, revealed Crooks had limited online and in person interactions, planned and conducted the attack alone, and did not leak or share his intent to engage in the attack with anyone,' Patel wrote.","summary":"The FBI has yet to release a clear motive for why Crooks tried to shoot Trump or whether he acted alone or in coordination with others.","url":"https://www.dailymail.co.uk/news/article-15292759/Tucker-Carlson-sparks-panic-exposes-Trump-shooters-ties-foreign-terror-group.html","image":"https://i.dailymail.co.uk/1s/2025/11/15/00/103894411-0-image-m-27_1763166756096.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/07/14/3604910370073036733/1024x576_MP4_3604910370073036733.mp4","publish_date":"2025-11-15 00:57:11","author":"Editor,Phillip Nieto","authors":["Editor","Phillip Nieto"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.402},{"id":379141426,"title":"UN Gaza resolution: US, Pakistan and several Arab states urge ‘swift adoption’","text":"UNITED NATIONS: The United States and several Arab and Muslim-majority nations including Egypt, Saudi Arabia and Turkey called Friday for the UN Security Council to quickly adopt a US resolution endorsing Donald Trump’s peace plan for Gaza.\n\n“The United States, Qatar, Egypt, the United Arab Emirates, the Kingdom of Saudi Arabia, Indonesia, Pakistan, Jordan, and Türkiye express our joint support for the Security Council Resolution currently under consideration,” the countries said in a joint statement, adding they were seeking the measure’s “swift adoption.”\n\nLast week the Americans officially launched negotiations within the 15-member Security Council on a text that would follow up on a ceasefire in the two-year war between Israel and Hamas and endorse Trump’s plan.\n\n“We emphasize that this is a sincere effort, and the Plan provides viable path towards peace and stability, not only between the Israelis and the Palestinians, but for the entire region.\n\nA draft of the resolution seen Thursday by AFP “welcomes the establishment of the Board of Peace,” a transitional governing body for Gaza — that Trump would theoretically chair — with a mandate running until the end of 2027.","summary":"UNITED NATIONS: The United States and several Arab and Muslim-majority nations including Egypt, Saudi Arabia and Turkey called Friday for the UN Security Council to quickly adopt a US resolution endorsing Donald Trump’s peace plan for Gaza.\n\n\n\n“The United States, Qatar, Egypt, the United Arab Emirates, the Kingdom of Saudi Arabia, Indonesia, Pakistan, Jordan, and Türkiye express our joint support for the Security Council Resolution currently under consideration,” the countries said in a joint statement, adding they were seeking the measure’s “swift adoption.”\n\n\n\nLast week the Americans officially launched negotiations within the 15-member Security Council on a text that would follow up on a ceasefire in the two-year war between Israel and Hamas and endorse Trump’s plan.\n\n\n\n“We emphasize that this is a sincere effort, and the Plan provides viable path towards peace and stability, not only between the Israelis and the Palestinians, but for the entire region.\n\n\n\nA draft of the resolution seen Thursday by AFP “we","url":"https://www.brecorder.com/news/40392558/un-gaza-resolution-us-pakistan-and-several-arab-states-urge-swift-adoption","image":"https://i.brecorder.com/large/2025/11/6917ce5a242cf.jpg","video":null,"publish_date":"2025-11-15 00:53:55","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.181},{"id":379141418,"title":"UN Gaza resolution: US, Pakistan and several Arab states urge ‘swift adoption’","text":"UNITED NATIONS: The United States and several Arab and Muslim-majority nations including Egypt, Saudi Arabia and Turkey called Friday for the UN Security Council to quickly adopt a US resolution endorsing Donald Trump’s peace plan for Gaza.\n\n“The United States, Qatar, Egypt, the United Arab Emirates, the Kingdom of Saudi Arabia, Indonesia, Pakistan, Jordan, and Türkiye express our joint support for the Security Council Resolution currently under consideration,” the countries said in a joint statement, adding they were seeking the measure’s “swift adoption.”\n\nLast week the Americans officially launched negotiations within the 15-member Security Council on a text that would follow up on a ceasefire in the two-year war between Israel and Hamas and endorse Trump’s plan.\n\n“We emphasize that this is a sincere effort, and the Plan provides viable path towards peace and stability, not only between the Israelis and the Palestinians, but for the entire region.\n\nA draft of the resolution seen Thursday by AFP “welcomes the establishment of the Board of Peace,” a transitional governing body for Gaza — that Trump would theoretically chair — with a mandate running until the end of 2027.","summary":"UNITED NATIONS: The United States and several Arab and Muslim-majority nations including Egypt, Saudi Arabia and Turkey called Friday for the UN Security Council to quickly adopt a US resolution endorsing Donald Trump’s peace plan for Gaza.\n\n\n\n“The United States, Qatar, Egypt, the United Arab Emirates, the Kingdom of Saudi Arabia, Indonesia, Pakistan, Jordan, and Türkiye express our joint support for the Security Council Resolution currently under consideration,” the countries said in a joint statement, adding they were seeking the measure’s “swift adoption.”\n\n\n\nLast week the Americans officially launched negotiations within the 15-member Security Council on a text that would follow up on a ceasefire in the two-year war between Israel and Hamas and endorse Trump’s plan.\n\n\n\n“We emphasize that this is a sincere effort, and the Plan provides viable path towards peace and stability, not only between the Israelis and the Palestinians, but for the entire region.\n\n\n\nA draft of the resolution seen Thursday by AFP “we","url":"https://www.brecorder.com/news/40392525/un-gaza-resolution-us-pakistan-and-several-arab-states-urge-swift-adoption","image":"https://i.brecorder.com/large/2025/11/6917b13a6984c.jpg","video":null,"publish_date":"2025-11-15 00:53:55","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.181},{"id":379142458,"title":"Donald Trump’s backflip on tariffs delivers major win for Aussie farmers","text":"Australian producers have had a huge win after Donald Trump announced the US will be lowering tariff’s on agricultural imports.\n\nBeef is Australia’s largest export to the United States and cattle farmers will be big beneficiaries of the reversal as the president faces pressure around cost of living from voters.\n\nThe order winding back tariff prices on beef, bananas, coffee and tomatoes was signed on Friday (local time), exempting the produce from reciprocal tariffs imposed by the president and is backdated to take effect on November 13.\n\n“Today, President Donald J. Trump signed an Executive Order modifying the scope of the reciprocal tariffs that he first announced on April 2, 2025. Specifically, certain qualifying agricultural products will no longer be subject to those tariffs,” the White House statement said.\n\nMr Trump created a storm earlier this year by imposing tariffs on all countries importing goods to the US varying in price but starting at 10 per cent.\n\nSoaring beef prices have been a particular concern, and Mr Trump said he is taking action to lower them.\n\n“That’s something that we’re going to fix, and we’re going to fix it right away,” Kevin Hassett, director of the White House National Economic Council, said this week.\n\nAustralia exported 394,716 tonnes of beef to the US in 2024, valued at $4.16 billion, according to Meat and Livestock Australia.\n\nThe executive order acknowledged that domestic demand for such products outstripped domestic capacity to produce them.\n\nThe tariff exemptions also cover many other produce types including pineapples and avocados.\n\nDespite the tariff, Australian beef exports to the US have jumped sharply in 2025.\n\nThe surge is being driven by a major drop in US beef production and significantly higher tariffs on rival suppliers such as Brazil.\n\nA range of other tariffs still in place will continue to apply.\n\nThe move marks a reversal for Trump, who has insisted tariffs are necessary to protect US businesses and workers. He has contended consumers will not ultimately pay for the higher duties.\n\n“Australia bans – and they’re wonderful people, and wonderful everything – but they ban American beef,” President Trump said in an April 2 speech.\n\n“Yet we imported $US3bn of Australian beef from them just last year alone.\n\n“They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers. And you know, I don’t blame them, but we’re doing the same thing right now starting at midnight tonight.”\n\nThe exemptions come just a day after Trump reached trade framework agreements with four Latin American countries – including 10 per cent tariffs on most goods from Argentina, Guatemala, and El Salvador, and 15 per cent from Ecuador. It also removes duties specifically on products not grown or produced in the US in sufficient quantities.\n\nThe tariff exemptions aim to help moderate these grocery price increases, although experts caution that other factors such as global supply shortages also influence prices.","summary":"Australian producers have been gifted a welcome shot in the arm after US President Donald Trump announced the US will be lowering tariff’s on agricultural imports including beef.","url":"https://thewest.com.au/politics/world-politics/donald-trumps-backflip-on-tariffs-delivers-major-win-for-aussie-farmers-c-20684768","image":"https://images.thewest.com.au/publication/C-20684768/4aa43db69a6f01a199bd16baed6de259b8f914dc-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-11-15 00:53:22","author":"Matt Shrivell","authors":["Matt Shrivell"],"language":"en","category":"politics","source_country":"au","sentiment":-0.147},{"id":379090856,"title":"MoBay christmas tree-lighting ceremony to be scaled down","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMayor of Montego Bay, Councillor Richard Vernon, addresses the monthly meeting of the St. James Municipal Corporation, in Montego Bay, on Thursday ( November 13). \n (Photo: Serena Grant) \n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, reflecting the parish’s ongoing recovery efforts following Hurricane Melissa.\n\nAddressing the monthly meeting of the St James Municipal Corporation on Thursday, Mayor Vernon said that while the festive tradition will continue, the celebrations will be modest.\n\n“Normally we would have much excitement as we approach the whole entire season… especially with your Christmas tree lighting. This year, your Christmas tree-lighting event will be scaled down,” he informed.\n\nThe mayor noted that there will be no accompanying concert this year, but a solemn lighting and prayer vigil will still be held in Sam Sharpe Square.\n\nHe said the ceremony will also serve as a time to honour those affected by the hurricane and reflect on community strength.\n\nMayor Vernon placed the scaled-back celebration in the broader context of the municipality’s recovery initiatives, highlighting that multi-agency efforts remain in place to assist vulnerable groups.\n\n“We have activated a multi-agency task force to coordinate and accelerate recovery. The task force is focusing on vulnerable groups, including senior citizens, persons with disabilities, the homeless… those in shelters. We’re ensuring that there is targeted support, outreach and aid distribution,” he said.\n\nThe mayor also outlined operational activities, including night clean-up operations with support from the Jamaica Defence Force and the St James Municipal Corporation.\n\nHe acknowledged the resilience of the community amid the challenges.\n\n“Hurricane Melissa has tested our resolve, but Montego Bay is not broken. Our municipality is battered, but still beautiful. We have been picking up the pieces, and our people remain resilient and strong,” he said.\n\n“Let this season of light begin with remembrance, power and action. Together, we will turn this devastation into determination and build a city that stands stronger, safer and more united than ever before,” the mayor said.\n\n\n\n\n\n\n\n\n\nTags: Christmas tree lighting Montego Bay \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Residents urged to avoid direct contact with rising floodwaters in Content \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica —The Manchester Health Department (MHD) is advising members of the public to avoid direct contact with the rising floodwaters in C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man killed, woman injured in Bull Bay domestic dispute \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST ANDREW, Jamaica – A man was shot dead and a woman injured during a domestic dispute at Jackvale district in 11 Miles, Bull Bay, St Andrew, on Thurs... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Reggae Boyz ratings vs T&T: High marks for Cephas, but 4 and 5s awarded after poor showing \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n The Reggae Boyz had to settle for a 1-1 draw away to regional rivals Trinidad & Tobago in their Concacaf World Cup qualifier on Thursday, a result tha... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/mobay-christmas-tree-lighting-ceremony-scaled/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/jvkguoih.png","video":null,"publish_date":"2025-11-15 00:52:10","author":null,"language":"en","source_country":"jm","sentiment":0.246},{"id":379090862,"title":"Trump demands probe into Epstein links to Bill Clinton","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWASHINGTON, DC - AUGUST 05: U.S. President Donald Trump speaks to reporters after signing an executive order during a ceremony in the South Court Auditorium in the Eisenhower Executive Office Building on August 5, 2025 in Washington, DC. The executive order creates a White House task force to help coordinate logistical issues related to the 2028 Summer Olympic Games in Los Angeles including security, visas for athletes and coaches and transportation.Win McNamee/Getty Images/AFP (Photo by WIN MCNAMEE / GETTY IMAGES NORTH AMERICA / Getty Images via AFP) \n\n International News, Latest News \n\nNovember 14, 2025\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nWASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late alleged sex trafficker Jeffrey Epstein and former Democratic president Bill Clinton.\n\nSeeking to turn the tables after a new trove of Epstein emails reignited questions over his own ties to the disgraced financier, Trump also demanded a probe into US bank JPMorgan Chase, ex-Harvard president Larry Summers and others.\n\nRepublican Trump accused rival Democrats of “using the Epstein Hoax” to distract from the party’s recent compromise to end a record US government shutdown, and said the scandal involved “Democrats, not Republicans.”\n\n“I will be asking A.G. Pam Bondi, and the Department of Justice, together with our great patriots at the FBI, to investigate Jeffrey Epstein’s involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase, and many other people and institutions,” Trump said on Truth Social.\n\n“Records show that these men, and many others, spent large portions of their life with Epstein, and on his ‘Island.'”\n\nClinton has long faced scrutiny over his ties to Epstein and flew on his private plane, although he has never been accused of wrongdoing in the scandal.\n\nEpstein said that Clinton had “never ever” been to his notorious private island in the Caribbean, according to several emails in the latest trove dating from 2011 and viewed by AFP.\n\nThere was no immediate comment from Clinton, Summers, LinkedIn founder Hoffman or JP Morgan Chase, which in 2023 agreed to pay $290 million to settle a class action lawsuit brought by victims of Epstein, its former client.\n\nTrump’s message broke two days of silence over the scandal, with the emails released on Wednesday renewing questions over the 79-year-old’s long, close relationship with Epstein.\n\nEpstein died in prison in 2019 — by suicide, authorities ruled — before he could face trial on federal sex charges. But questions over his alleged masterminding of a sex ring where powerful men were provided with underaged girls only grew.\n\n– ‘A country to run’ –\n\nTrump himself has not been accused of any wrongdoing yet the scandal has dogged Trump since his return to the White House in January, despite his attempts to put on a lid on the issue.\n\nTrump and some of his close allies — including his FBI chief Kash Patel — had in the past promised his right-wing base they would seek the release of all the evidence against Epstein, including details of his alleged clients.\n\nBut there was a furious MAGA backlash after Trump’s Justice Department in a July memo reaffirmed he died by suicide, and that a “client list” Attorney General Pam Bondi claimed to have been reviewing did not in fact exist.\n\nThe scandal peaked again on Wednesday with release of emails subpoenaed by Congress from Epstein’s estate.\n\nThe email traffic between Epstein and friends said Trump “knew about the girls” and had spent “hours” with Virginia Giuffre, one of Epstein’s victims and the main accuser.\n\nThe White House says Giuffre, who herself died by suicide in April, had declared that Trump “couldn’t have been friendlier.”\n\nNow the House of Representatives will vote as early as next week on demanding release by the Justice Department of its materials on Epstein, after a rebellion by a handful of MAGA lawmakers provided sufficient votes.\n\nThose materials could include far more damning evidence than has been previously seen on the links between Epstein and his circle, which over the years ranged from Trump to Britain’s ex-prince Andrew.\n\nTrump on Friday made clear he does not want the effort to proceed.\n\n“Don’t waste your time with Trump. I have a Country to run!” he said on social media.\n\n\n\n\n\n\n\n\nTags: Bill Clinton Jeffrey Epstein US President Donald Trump \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Residents urged to avoid direct contact with rising floodwaters in Content \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica —The Manchester Health Department (MHD) is advising members of the public to avoid direct contact with the rising floodwaters in C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man killed, woman injured in Bull Bay domestic dispute \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST ANDREW, Jamaica – A man was shot dead and a woman injured during a domestic dispute at Jackvale district in 11 Miles, Bull Bay, St Andrew, on Thurs... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Reggae Boyz ratings vs T&T: High marks for Cephas, but 4 and 5s awarded after poor showing \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n The Reggae Boyz had to settle for a 1-1 draw away to regional rivals Trinidad & Tobago in their Concacaf World Cup qualifier on Thursday, a result tha... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n GraceKennedy unveils four-pillar J$200m hurricane relief programme \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n KINGSTON, Jamaica—GraceKennedy Group (GK) has announced a comprehensive Hurricane Melissa relief programme valued at $200 million focusing on four key... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/trump-demands-probe-epstein-links-bill-clinton/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/08/063_2228695167-1024x682.jpg","video":null,"publish_date":"2025-11-15 00:50:45","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.283},{"id":379141388,"title":"Trump cuts tariffs on beef, tomatoes and other food products as grocery inflation climbs","text":"U.S. President Donald Trump on Friday rolled back tariffs on dozens of food products, including such staples as beef, tomatoes and bananas, in the face of growing angst among American consumers about the high cost of groceries. The new exemptions - which take effect retroactively at midnight on Thursday - mark a sharp reversal for Trump, who has long insisted that the sweeping import duties he imposed earlier this year are not fueling inflation. Democrats have won a string of victories in state and local elections in Virginia, New Jersey and New York City, where affordability was a key topic. The Trump administration announced framework trade deals on Thursday that, once finalized, will eliminate tariffs on certain foods and other imports from Argentina, Ecuador, Guatemala and El Salvador, with U.S. officials eyeing additional agreements before year's end. Everyday food items have seen sharp price hikes Friday's list includes products U.S. consumers routinely purchase to feed their families at home, many of which have seen double-digit year-over-year price increases. ALSO READUS plans to cut tariffs to ease food prices — here’s what could get cheaper Ground beef, as of the latest available data for September, was nearly 13% more expensive, according to Consumer Price Index data, and steaks cost almost 17% more than a year ago. Increases for both were the largest in more than three years, dating back to when inflation was nearing its peak under Trump's predecessor, Democrat Joe Biden. Banana prices were about 7% higher, while tomatoes were 1% higher. Overall costs for food consumed at home were up 2.7% in September. Imports face a uniform 10% base tariff under Trump Trump has upended the global trading system by imposing a 10% base tariff on imports from every country, plus additional specific duties that vary from state to state. ALSO READUS to scrap tariffs on select imports from Ecuador, Argentina, Guatemala and El Salvador Trump has focused squarely on the issue of affordability in recent weeks, while insisting that any higher costs were triggered by policies enacted by Biden, and not his own tariff policies. Consumers have remained frustrated over high grocery prices, which economists say have been fueled in part by import tariffs and could rise further next year as companies start passing on the full brunt of the import duties. The top Democrat on the House of Representatives Ways and Means Committee, Richard Neal, said the Trump administration was \"putting out a fire that they started and claiming it as progress.\" \"The Trump Administration is finally admitting publicly what we've all known from the start: Trump's Trade War is hiking costs on people,\" Neal said in a statement. \"Since implementing these tariffs, inflation has increased and manufacturing has contracted month after month.\"","url":"https://www.financialexpress.com/world-news/us-news/trump-cuts-tariffs-on-beef-tomatoes-and-other-food-products-as-grocery-inflation-climbs/4044976/","image":"https://images.financialexpressdigital.com/2025/11/Trump-cuts-tariff-on-food-products.jpg","video":null,"publish_date":"2025-11-15 00:50:20","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"in","sentiment":-0.162},{"id":379141040,"title":"Will US detonate a nuclear warhead as part of tests? Trump says…","text":"US President Donald Trump on Friday (local time) doubled down on his earlier announcement about resuming nuclear weapons tests, but stopped short of telling the media whether the plans included detonating a nuclear warhead.\"I don't want to tell you about that, but we will do nuclear testing like other countries,\" Trump told reporters aboard Air Force One as he left for Florida for the weekend.Earlier, Trump had announced the resumption of nuclear tests after 33 years while on his way to meet President Xi Jinping for trade talks in South Korea's Busan.(This is a developing story. Check back for updates)","url":"https://www.livemint.com/news/us-news/will-us-detonate-a-nuclear-warhead-as-part-of-tests-president-donald-trump-says-11763167353208.html","image":"https://www.livemint.com/lm-img/img/2025/11/15/1600x900/logo/USA-TRUMP-EPSTEIN-2_1763167607793_1763167615937.JPG","video":null,"publish_date":"2025-11-15 00:48:13","author":"Shiladitya Ray","authors":["Shiladitya Ray"],"language":"en","category":"politics","source_country":"in","sentiment":-0.823},{"id":379141728,"title":"Trump cuts some tariffs as US inflation concerns mount","text":"US President Donald Trump has rolled back tariffs on dozens of food products, including such staples as beef, tomatoes and bananas, in the face of growing angst among American consumers about the high cost of groceries. The new exemptions - which take effect retroactively at midnight on Thursday - mark a sharp reversal for Trump, who has long insisted that the sweeping import duties he imposed earlier this year are not fuelling inflation. Democrats have won a string of victories in state and local elections in Virginia, New Jersey and New York City, where affordability was a key topic. The Trump administration announced framework trade deals on Thursday that, once finalised, will eliminate tariffs on certain foods and other imports from Argentina, Ecuador, Guatemala and El Salvador, with US officials eyeing additional agreements before year&apos;s end. Friday&apos;s list includes products US consumers routinely purchase to feed their families at home, many of which have seen double-digit year-over-year price increases. Ground beef, as of the latest available data for September, was nearly 13 per cent more expensive, according to Consumer Price Index data, and steaks cost almost 17 per cent more than a year ago. Increases for both were the largest in more than three years, dating back to when inflation was nearing its peak under Trump&apos;s predecessor, Democrat Joe Biden. Banana prices were about seven per cent higher, while tomatoes were one per cent higher. Overall costs for food consumed at home were up 2.7 per cent in September. Trump has upended the global trading system by imposing a 10 per cent base tariff on imports from every country, plus additional specific duties that vary from state to state. Trump has focused squarely on the issue of affordability in recent weeks, while insisting that any higher costs were triggered by policies enacted by Biden, and not his own tariff policies. Consumers have remained frustrated over high grocery prices, which economists say have been fuelled in part by import tariffs and could rise further next year as companies start passing on the full brunt of the import duties. The top Democrat on the House of Representatives Ways and Means Committee, Richard Neal, said the Trump administration was \"putting out a fire that they started and claiming it as progress.\" \"The Trump Administration is finally admitting publicly what we&apos;ve all known from the start: Trump&apos;s Trade War is hiking costs on people,\" Neal said in a statement. \"Since implementing these tariffs, inflation has increased and manufacturing has contracted month after month.\" Australian Associated Press","url":"https://www.canberratimes.com.au/story/9112325/trump-cuts-some-tariffs-as-us-inflation-concerns-mount/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/b6e935a6-c45a-4e63-9458-334259846937.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-11-15 00:47:12","author":"Andrea Shalal","authors":["Andrea Shalal"],"language":"en","source_country":"au","sentiment":-0.24},{"id":379141548,"title":"Tucker Carlson Unveils Shocking Allegations Linking Trump Shooter to Terrorist Networks","text":"Tucker Carlson has once again stirred the political waters with his latest investigation, which has captured the attention of many within the MAGA community. In his recent exposé, Carlson posits that Thomas Crooks, who attempted to assassinate former President Donald Trump, may have ties to a foreign terrorist organization.\n\nThe former Fox News host and his team have released a detailed 34-minute video scrutinizing the digital footprint of Crooks, the 20-year-old who came perilously close to killing Trump at a rally in Butler, Pennsylvania, back in July 2024. Crooks’ bullet narrowly missed Trump’s skull, a mere inch away.\n\nDespite more than a year passing since this shocking attempt on Trump’s life, the FBI has yet to clearly establish Crooks’ motives or determine whether he acted alone or had accomplices. This lingering ambiguity has left many questions unanswered.\n\nCarlson’s investigation sheds light on Crooks’ online activity, particularly his YouTube interactions from 2019 to 2020. These digital breadcrumbs reveal a troubling transformation in Crooks’ beliefs, transitioning from a Trump supporter to someone embracing far-left ideologies. His comments online included alarming calls for assassinations and political violence.\n\nOne of the most concerning aspects of Carlson’s findings is Crooks’ engagement with a user named ‘Willy_Tepes.’ This user appeared to incite Crooks towards violence, exemplified by a chilling message sent on August 4, 2020: ‘If a gun and a badge is all that is needed, then authority obviously comes from the barrel of a gun. We have more guns than they do ;)’\n\nHe wrote to Crooks on August 4, 2020, ‘If a gun and a badge is all that is needed, then authority obviously comes from the barrel of a gun. We have more guns than they do ;)’\n\n‘There is no way we can avoid a war at this point, so you just better get used to the idea,’ he added.\n\nCarlson claims that Tepes’s name is listed on a foreign Antifa website connecting him to the Nordic Resistance Movement – a neo-Nazi group based in Scandinavia which has been designated a terrorist organization by the State Department.\n\n‘The FBI hasn’t made any mention of him in public, although they certainly know he exists. Just days after the shooting, somebody screenshotted Tepes’ YouTube account page despite the fact that he has very few followers,’ Carlson said.\n\n‘To the extent that he can be traced online now, you can find his username being used on a foreign Antifa website, those sites link him to the Nordic Resistance Movement … that’s all we know.’ \n\nTepes wrote in another reply to Crooks about government efforts to seize guns from citizens.\n\n‘The more guns that are out there, the less likely a gun confiscation will be possible. Nope, guns do not guarantee a victory anymore than jet fighters, tanks and drones do. It is the fighting spirit and brains that wins.’\n\n‘We have nothing to lose and everything to win…..and the alternative, a global police state, is unacceptable. Nothing in life is simple but that is no argument against doing it :)’\n\nFollowing Tepes’ online interactions with Crooks, the Trump shooter’s YouTube commenting ends.\n\nMoreover, Crooks’ political views seemingly shifted dramatically towards left-wing ideology around early 2020.\n\nIn January 2020, Crooks reportedly attacked Trump for his ‘stupidity’ in one of his YouTube comments and mocked Trump supporters for sounding like a ‘cult.’\n\nCrooks then reportedly called for anti-Trump supporters to conduct ‘terrorism-style attacks’ against the US government.\n\nThe future assassin outlined ways to ‘sneak a bomb’ into a government building and ‘set it off before anyone sees you,’ according to Carlson.\n\n‘[In my opinion] the only way to fight the [government] is with terrorism style attacks, sneak a bomb into an essential building [and] set it off before anyone sees you, track down and important people/politicians/military leaders etc and try to assassinate them. Any sort of head to head fight is suicide and ambush/surprise attacks likely aren’t going to end well,’ Crooks allegedly wrote on YouTube.\n\nMAGA influencers and lawmakers reacted with shock to Carlson’ latest reporting and demanded more transparency from Kash Patel’s FBI regarding Crooks.\n\nTennessee Republican Rep. Tim Burchett claimed that Crooks was groomed by the CIA via MKUltra-style mind control programs during an interview reacting to Carlson’s latest report.\n\n‘They programmed this kid. You got a kid who’s got access to guns or has some simple knowledge of a firearm, he was programmed,’ Burchett told conservative influencer Benny Johnson. ‘The facts have been buried or burned or whoever knew is either sitting on a beach somewhere and, uh, enjoying a fruity drink or they’re dead.’\n\n‘When the CIA says, ‘We don’t have this thing,’ and then their asses are brought into a court of law and they say, ‘Well, we have it, but we don’t use it anymore.’ Apparently, somebody’s using it.’\n\n‘I’ve said that all along,’ Burchett added. ‘I’ve said that. Look at the history. Look at where we’re at in this country, the Deep State. It’s disgusting. Trump’s right. They’re not after, they’re not after him. They’re after us. He’s just standing in the way.’\n\nKash Patel, meanwhile, issued a statement indirectly responding to Carlson’s reporting by claiming the Bureau collected an extensive amount of data from Crooks.\n\nPatel does not provide any specific details into the data uncovered from the FBI investigation, nor his motive for trying to kill Trump. Furthermore, the FBI director continues to maintain that Crooks had limited online use.\n\n‘The investigation, conducted by over 480 FBI employees, revealed Crooks had limited online and in person interactions, planned and conducted the attack alone, and did not leak or share his intent to engage in the attack with anyone,’ Patel wrote.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTucker Carlson has once again stirred the political waters with his latest&#8230;\n\n\nThis Post: Tucker Carlson Unveils Shocking Allegations Linking Trump Shooter to Terrorist Networks first appeared on Internewscast Journal","url":"https://internewscast.com/news/tucker-carlson-unveils-shocking-allegations-linking-trump-shooter-to-terrorist-networks/","image":"https://internewscast.com/wp-content/uploads/2025/11/Tucker-Carlson-sparks-panic-as-he-exposes-Trump-shooters-terror.jpg","video":null,"publish_date":"2025-11-15 00:45:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.228},{"id":379142736,"title":"Pakistan, Saudi militaries to strengthen defence pact","text":"Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon","summary":"RAWALPINDI: Chief of General Staff (CGS) Lt Gen Syed Aamer Raza called on Gen Fayyadh Bin Hameed Al-Rowaily, the chief of general staff of the Royal Saudi Armed Forces in Riyadh to discuss broadening strategic ties and strengthening the mutual defence agreement signed by the two nations, ISPR said on Friday.\n\n\n\n“During the meeting, matters of mutual strategic interest were discus­sed, with a special focus on strengthening bilateral defence cooperation, enh­ancing interoperability, and advancing collaboration under the Strategic Mutual Defence Agree­m­ent,” read a statement is­­sued by the ISPR here. It added that both sides reaffirmed their commitment to further deepening the long-standing fraternal ties between Pakistan and Saudi Arabia, contributing towards regional peace, stability, and self-reliance.\n\n\n\nA special meeting of the Pakistan-KSA Bilateral Defence Industrial Forum was also held in Riyadh.\n\n\n\nThe Pakistan tri-servic­­es delegation was led by CGS Lt Gen Raza, while the Saudi side was headed by Kh","url":"https://www.dawn.com/news/1955177/pakistan-saudi-militaries-to-strengthen-defence-pact","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-11-15 00:44:09","author":"APP","authors":["APP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.592},{"id":379142748,"title":"Tajikistan’s defence minister calls on COAS","text":"Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon","summary":"RAWALPINDI: Minister of Defence of Tajikistan Colonel General Sobirzoda Emomali Abdulrahim called on Chief of Army Staff (COAS) Field Marshal Syed Asim Munir, NI (M), HJ, here on Friday at General Headquarters (GHQ).\n\n\n\nDuring the meeting, matters of mutual interest, regional security, and bilateral defence cooperation were discussed, says a press release issued by Inter-Services Public Relations (ISPR).\n\n\n\nBoth sides expressed their resolve to enhance the existing military-to-military collaboration, particularly in the areas of training, counter-terrorism, and regional security. The visiting dignitary appreciated the professionalism of the Pakistan army and acknowledged its role in promoting regional stability and peace.\n\n\n\nThe COAS, while emphasising the importance of collective efforts for regional stability and prosperity, reaffirmed Pakistan’s commitment to strengthening defence and security ties with Tajikistan.\n\n\n\nPublished in Dawn, November 15th, 2025","url":"https://www.dawn.com/news/1955173/tajikistans-defence-minister-calls-on-coas","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-11-15 00:44:09","author":"APP","authors":["APP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.592},{"id":379142742,"title":"Some banks to stay open for Haj dues collection","text":"Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon \n\n ‎Venezuela on Edge: What’s Really Driving the New Crisis?\n\n Pakistan’s Judiciary in Upheaval: Resignations, Transfers & New Power Structure \n\n Tehran on the Brink: Iran Warns Millions May Need to Evacuate as Water Runs Out \n\n Has Donald Trump Really Stopped Eight Wars? \n\n Why Isn’t India Blaming Pakistan For New Delhi Attack?\n\n Pakistan President Zardari Signs 27th Amendment \n\n Does COP30 Matter?: The Climate Reckoning in the Amazon","summary":"KARACHI: The State Bank of Pakistan has decided to open designated branches on Saturday (today) for the collection of dues (second instalment) for next year’s Haj.\n\n\n\n“It has been decided on the request of Ministry of Religious Affairs and Interfaith Harmony that all branches designated for Haj operations shall remain open from 9am to 2:30pm on Saturday, Nov 15, to facilitate the deposit of Haj dues (second instalment) by [the] intending pilgrims,” read a press release issued by the SBP on Friday.\n\n\n\nPublished in Dawn, November 15th, 2025","url":"https://www.dawn.com/news/1955170/some-banks-to-stay-open-for-haj-dues-collection","image":"https://www.dawn.com/_img/social-default.jpg","video":null,"publish_date":"2025-11-15 00:44:09","author":"The Newspaper's Staff Reporter","authors":["The Newspaper's Staff Reporter"],"language":"en","source_country":"pk","sentiment":-0.592},{"id":379139658,"title":"Disney, YouTube TV Reach New Carriage Deal, End Programming Blackout","text":"Disney and YouTube TV have reached a new carriage deal, ending a 14-day programming blackout of ESPN, ABC and more on the Google-owned platform.\n\nMore to come…\n\nYouTube TV pulled the media giant’s networks from its platform on Oct. 30 after the two sides failed to reach a deal prior to their previous contract’s expiration. \n\nDisney has argued that it had offered YouTube TV a deal that would cost less overall than the terms of its previous contract, with “fair” terms that are “in-line with the more than 500 other distributors that have renewed their agreements since last summer, including the top distributors, who are far larger than YouTube TV.”\n\nAdditionally, Disney says it offered programming packages tailored to sports fans, entertainment fans, kids and families to offer more flexibility and value. It accused YouTube TV of continuing to “insist on receiving preferential terms that are below market”and making “few concessions.”\n\nMeanwhile, YouTube TV said that Disney was asking them for a rate above what Charter and DirecTV pay for the ABC networks and to pay more for their content than what they charge the Hulu and Fubo, which recently completed its merger with Hulu + Live TV. \n\nIt also said it was asking for size-based “most favored nations,” a contractual promise that a programmer will not offer better terms to any other distributor without offering the same terms to them, and disputed that the tailored programming packages were Disney’s proposal, noting that it’s a topic they’ve had conversations with all of their partners about.\n\nWith over 8 million subscribers, YouTube TV is one of the largest pay TV operators alongside Charter Communications, Comcast and DirecTV. It is the largest virtual multichannel video programming distributor (vMVPD).\n\nMorgan Stanley estimated that Disney was losing $30 million in revenue per week, or $4.3 million each day, during the blackout. Those figures were based on the bank’s estimate that it could lose $60 million in revenue from the programming blackout if the carriage dispute lasted for 14 days.\n\nIt’s unclear how much revenue and subscribers YouTube TV lost from the blackout, though the platform offered their subscribers a $20 credit to limit the amount of cancellations. The rebate was not applied automatically and was not available to individuals who canceled or paused their subscriptions.\n\nA recent survey of 1,107 consumer by Drive Research found that nearly 1 in 4 YouTube TV subscribers had already canceled or were considering canceling the service because it “no longer delivers the core content they signed up for.” A YouTube TV spokesperson previously told TheWrap that “while subscriber churn is always regrettable, it’s been manageable and does not align with the findings of this survey.”\n\nThe latest carriage dispute resolution comes after Disney resolved a 13-day programming blackout with DirecTV in September 2024, a 10-day dispute with Charter Communications in 2023 and a 48-hour dispute with Dish in 2022, while YouTube TV recently reached agreements with Fox and NBCUniversal.\n\nDespite the deal with Disney, YouTube TV has yet to reach a new carriage deal with TelevisaUnivision, whose programming has been dark on the platform since Sept. 30. President Donald Trump weighed in on the latter dispute, urging YouTube TV to restore the Spanish-language network’s programming.\n\nMore to come…","summary":"The media giant's networks have been dark on the Google-owned platform since Oct. 30\n\n\nThe post Disney, YouTube TV Reach New Carriage Deal, End Programming Blackout appeared first on TheWrap.","url":"https://www.thewrap.com/disney-youtube-tv-reach-new-carriage-deal-end-programming-blackout/","image":"https://www.thewrap.com/wp-content/uploads/2025/11/Dancing-with-the-Stars.jpg","video":null,"publish_date":"2025-11-15 00:42:32","author":"Drive Research,Lucas Manfredi","authors":["Drive Research","Lucas Manfredi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.411},{"id":379140950,"title":"As Fed hawks press their case, traders bet against December cut","text":"(Reuters) -As U.S. agencies on Friday began announcing plans for releasing economic data delayed by the government shutdown, a trio of U.S. central bankers reiterated their concerns about inflation while the Fed's most dovish policymaker said economic data in hand argued for another rate cut. In the meantime, financial markets placed their bets. Late Friday, short-term interest-rate futures, the best real-time indication of trader sentiment on Fed policy, reflected a 60% chance that the central bank will not follow its back-to-back rate cuts in September and October with another one in December. The market-based odds on that same outcome had been about even just 24 hours earlier, and before that had been heavily in favor of a rate cut for several weeks since the Fed's October 29 decision. The dueling policymaker views and shifting market bets underscore how hotly contested the decision at the Fed's December 9-10 meeting may be. And traders' views could just as easily reverse next week when government statistics agencies begin publishing economic data for the first time in a month and a half, and more Fed policymakers, including the influential and dovish Fed Governor Christopher Waller, weigh in with their perspectives. On Friday, Kansas City Fed President Jeffrey Schmid, Dallas Fed President Lorie Logan and Cleveland Fed President Beth Hammack largely repeated the hawkish views each had laid out soon after the Fed cut its policy rate last month. \"It's not obvious that monetary policy should be doing more right now,\" Hammack told the Pittsburgh Economic Club. Logan, speaking at an energy conference put on by the Dallas and Kansas City Fed banks, was similarly circumspect. \"As I look to the December meeting, I think it would be hard to support another rate cut unless we were to get convincing evidence that inflation is really coming down faster than my expectations or that we were seeing more than the gradual cooling that we've been seeing in the labor market.\" Schmid, speaking at the same conference, said the rationale behind his dissent on the Fed's October rate cut was also guiding him as he heads toward the December meeting. \"I do not think further cuts in interest rates will do much to patch over any cracks in the labor market - stresses that more likely than not arise from structural changes in technology and immigration policy,\" he said. \"Cuts could have longer-lasting effects on inflation as our commitment to our 2 percent objective increasingly comes into question.\" In contrast, Fed Governor Stephen Miran, in back-to-back television appearances, made a case for another rate cut. Miran joined Schmid in dissenting in October, but in Miran's case his vote was for a bigger rate cut than the quarter-of-a-percentage-point cut that was actually delivered. Miran, who plans to return to his job as White House economic adviser when his term is up in January, shares President Donald Trump's view that interest rates are far too high. After October's rate cut, Fed Chair Jerome Powell said the Fed's moves so far were meant to be insurance against a potential worsening in labor market conditions. But with the government shutdown delaying the publication of key economic metrics, he said, the central bank may need to slow down until the data \"fog\" clears. He also noted that there are strong, differing views on the rate-setting committee. A December rate cut, he said, was \"not to be seen as a foregone conclusion - in fact, far from it.\" It may have taken a few weeks but on Friday traders seemed inclined to agree - for now. (Reporting by Ann Saphir; Additional reporting by Michael S. Derby and Lucia Mutikani; Editing by Andrea Ricci and Edmund Klamann) By Ann Saphir","url":"https://www.marketscreener.com/news/as-fed-hawks-press-their-case-traders-bet-against-december-cut-ce7d5fd2d188f62c","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-09/2025-09-25T130140Z_1_LYNXNPEL8O0O0_RTROPTP_4_USA-FED-JACKSONHOLE.JPG","video":null,"publish_date":"2025-11-15 00:42:14","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"fr","sentiment":-0.049},{"id":379142814,"title":"Iconic N. Korea abductee’s mother laments passage of 48 years without reunion","text":"TOKYO - November 15 marked 48 years since the disappearance of Megumi Yokota, a symbolic victim of North Korea’s abduction of Japanese nationals decades ago, and her mother Sakie continues to lament the lengthy period without progress on the issue.\n\nMs Yokota, 89, told reporters ahead of the anniversary that the prolonged separation leaves her “in shock”, but she still clings to hope of a reunion after she and other family members of the abductees called on Japanese Prime Minister Sanae Takaichi and US President Donald Trump to bring back their loved ones.\n\nMegumi went missing at age 13 while on her way home from badminton practice at her junior high school in Niigata on the Sea of Japan coast on Nov 15, 1977.\n\n “It was as if I was thrown into complete darkness,” Ms Yokota said, recalling her desperate search for her daughter. “I was crying and screaming every day.”\n\nIt was 20 years later, in 1997, that Japanese police said Megumi was abducted by North Korea, and in the same year, Ms Yokota and her husband, Shigeru, founded the group for families of the abductees.\n\nThe couple had since spearheaded the campaign to bring back the victims. But Shigeru died in 2020.\n\nOver the years, Ms Yokota has repeatedly expressed anger over the lack of progress over the abductions, describing them as “such a terrible thing”.\n\nMs Yokota, who turns 90 in February, acknowledged that she feels exhausted, saying: “I have used up my energy and willpower. Sometimes I think I may never see her again.”\n\nYet, she said she has “very high expectations” that Ms Takaichi may move things forward. Ms Takaichi met the families of the abduction victims just two days after taking office on Oct 21. She has also said she has proposed a summit meeting with North Korean leader Kim Jong Un.\n\n“There is no time to lose when it comes to solving this problem. I would like to yield a tangible outcome” through a meeting with Mr Kim, Ms Takaichi told reporters on Nov 14.\n\nMr Trump, during his visit to Japan for talks with Ms Takaichi, also met the families, including Ms Yokota, and reiterated his commitment to the issue, saying: “We always have this in mind.”\n\nMr Trump met Mr Kim three times between 2018 and 2019 during his first term as US president and has shown enthusiasm to meet him again.\n\nMs Yokota told a recent separate gathering of her supporters: “I have come many, many years with a truly sad feeling. I know she is there (in North Korea), but I cannot see her or hear her voice. But I believe that she is doing well.”\n\nMegumi is among 17 Japanese nationals the Japanese government officially lists as having been \n\nFive abductees were returned in 2002 after then Japanese Prime Minister Junichiro Koizumi met North Korea’s Kim Jong Il in Pyongyang on Sept 17 of that year, the first-ever summit between the two countries that do not maintain diplomatic ties. KYODO NEWS","url":"https://www.straitstimes.com/asia/east-asia/iconic-n-korea-abductees-mother-laments-passage-of-48-years-without-reunion","image":"https://cassette.sphdigital.com.sg/image/straitstimes/315298564c0fa93b803b67164b53da9a6f35d2f5c7888cfa8424a3321879ffa8","video":null,"publish_date":"2025-11-15 00:40:00","author":"North Korea","authors":["North Korea"],"language":"en","source_country":"sg","sentiment":0.025},{"id":379141866,"title":"Consumers to pay less as Trump lowers tariffs on ag products","text":"Nov. 14 (UPI) -- President Donald Trump lowered but did not eliminate reciprocal tariffs and beef, fruits, coffee and other foods in an effort to lower food prices for consumers.\n\nThe president announced the reduced tariffs a day after securing trade agreements with Argentina, Ecuador, El Salvador and Guatemala, although a 15% tariff remains in effect for Ecuador, according to The Hill.\n\n\"Today's order follows the significant progress the president has made in securing more reciprocal terms for our bilateral trade relationships,\" the White House announced Friday in a news release.\n\n\"President Trump's deals have had and will continue to have broad impacts on domestic production and the economy as a whole, including enhanced market access for our agriculture exporters.\"\n\nThe other nations will continue to have a 10% tariff in effect, but they could be lowered or eliminated for certain products.\n\nCertain agricultural products won't be subject to reciprocal tariffs, including tropical fruits and fruit juices, beef, cocoa and spices, bananas, oranges, tomatoes and fertilizers, according to the White House.\n\nConsumers are paying more for coffee, beef and other foods since Trump initiated his reciprocal tariffs policy in April to offset tariffs being charged on U.S.-produced goods in respective nations, CNN reported.\n\nThe Consumer Price Index shows people are paying about 20% more for coffee than they did a year ago due to the president's 50% tariff on coffee imported from Brazil, which is the nation's largest supplier of the beloved caffeinated beverage.\n\nTomatoes also are costing more and will continue to have a17% tariff when imported from Mexico after a trade agreement between that nation and the United States expired in July.\n\nBananas and other food products that are not produced in the United States also are subject to tariff reductions.","summary":"President Donald Trump lowered but did not eliminate reciprocal tariffs and beef, fruits, coffee and other foods in an effort to lower food prices.","url":"https://www.upi.com/Top_News/US/2025/11/14/food-tariffs/9561763166546/","image":"https://cdnph.upi.com/sv/ph/og/upi/9561763166546/2025/1/b7092a6871fdaa6365ab04d0779f1c92/v1.5/Consumers-to-pay-less-as-Trump-lowers-tariffs-on-ag-products.jpg","video":null,"publish_date":"2025-11-15 00:39:58","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"us","sentiment":0.174},{"id":379141932,"title":"Ariana Grande's Wicked co-star breaks silence on star's shock ambush from deranged fan","text":"Home and Garden\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nPrivacy Policy\n\nSaturday, Nov 15th 2025\n\n5-Day Forecast\n\nAdvertisement\n\n'My son's in Gordon's clutches. The Ramsays are pulling him away from me. But I love him - there's nothing he's done I wouldn't forgive': Adam Peaty's weeping mother breaks silence on wedding rift - only to the Daily Mail - and tells full devastating story\n\nThe Chancellor's lost control: Rachel Reeves accused of presiding over most shambolic Budget in history after humiliating U-turn on income tax hikes\n\nDonald Trump WILL sue the BBC! US President announces '$1-5billion' legal case as he attacks 'egregious' edit of speech\n\nShock twist in Charlotte Chilton-Conor Maynard baby row as Traitors co-star Jonny Holloway reveals what REALLY happened\n\nBORIS JOHNSON: This is the one thing Reeves can do that'll cost British taxpayers nothing, save lives, and make the world better and happier\n\nHome Secretary set to make HUGE change to UK refugee policy next week which will mean all who claim asylum in the country can only do so 'temporarily'\n\nRobbie Williams, 51, fears weight loss jabs are 'making him blind' and admits his vision is deteriorating as he warns fans of the worrying side effects\n\nWhy you've stopped losing weight on Mounjaro - and how to fix it: These are the sleep, alcohol and diet issues standing in your way... and the harsh truth about 'microdosing'\n\nWhen my period suddenly stopped, I thought I was just tired - it turned out to be a little-known hormone condition that thousands of women could have without realising it - here are the signs\n\nWatch salesman who killed himself after being tied up in £1.1million heist had been working in shop that was a 'front for organised crime', court told\n\nDAILY MAIL COMMENT: This Budget shambles proves Chancellor is out of her depth\n\nThe hearing aid that's changed my life: I couldn't hear in crowded places, missed words and was humiliated by my old pair whistling, says LIZ JONES. Now experts told me about the new super-aids... I can hear EVERYTHING\n\nStick the kettle on! Average Briton drinks 62,046 cups of tea in their lifetime\n\n'We'd been at breaking point.' Geordie Shore's Charlotte Crosby breaks silence on her relationship with Jake Ankers, the strains they never saw coming - and the romantic gesture that backfired\n\nPolice charge 'fake admiral' Jonathan Carley days after appearance at a Remembrance Sunday event with a chest full of suspicious medals sparked fury\n\nWes Streeting still 'backs himself' as future PM after Starmer allies accuse Health Secretary of plotting leadership challenge\n\nMoment 'calculated' teenage nursery worker, 18, defiantly answers 'no comment' to police questions as he is jailed for raping and sexually abusing children as young as three \n\nSteer clear of Andrew if you want to get your reputation back, PR firm told Jeffrey Epstein when he was freed from jail\n\nI have new evidence Amy Bradley is alive: Bombshell by private investigator trying to solve Caribbean cruise disappearance. Now he reveals fatal flaws in Netflix documentary, what they DIDN'T show... and new twist\n\nBudget shambles and a global AI 'wobble' wipes £27billion off the value of the FTSE 100\n\nTinder Swindler boasted he is 'unstoppable' in first major interview hours before he was dramatically freed from Georgian cell - as he claims he could have been a spy and wants Zac Efron to play him in a film\n\nHow worried should we be about the curious clusters of Chinese restaurants surrounding our most sensitive military bases?\n\nMy verdict on the £2.25 a slice Marks & Spencer 'glass' bread everyone's talking about: SARAH RAINEY\n\nMen cried after I called their quarter-zips revolting - but women queued up to agree. So here's the 11 looks men LOVE but women think are emasculating, sexless and make you seem short. They're not what you think: FLORA GILL\n\nAriana Grande's Wicked co-star breaks silence on star's shock ambush from deranged fan\n\nHave YOU got a story? Email tips@dailymail.com \nBy ASHLEIGH GRAY \n Published:00:38 GMT, 15 November 2025 |Updated:00:38 GMT, 15 November 2025 \n\nMarissa Bode, who co-stars alongside Ariana Grande in Wicked, is speaking up about a fan who ambushed the singer this week.\nThe 32-year-old pop star was bombarded by an overzealous fan while walking the red carpet at the Singapore premiere of Wicked: For Good on Thursday.\nFollowing the ordeal, Marissa, 25, took to TikTok to condemn fans who don't respect public figures' personal space.\nThe actress, who plays Nessarose Thropp in the two-part Wicked films, began her video by quoting people who defend unruly fanatics.\n'\"But they're a fan!' Okay. Then they're a fan and a loser,' she stated.\nShe went on to point out that she has previously raised the subject of 'parasociality, especially at things like concerts or just when someone in the public eye is at an event, like people throwing s**t on stage mid-performance.'\n\nOne of Ariana Grande's Wicked co-stars is speaking up about a fan who ambushed the singer this week; pictured November 10\n\nMarissa Bode took to TikTok to condemn fans who don't respect public figures' personal space after Ariana was bombarded by an overzealous fan while walking the red carpet at the Singapore premiere of Wicked: For Good on Thursday\nMarissa captioned the minute-long TikTok clip, 'This is about the experiences of most women in Hollywood btw.' \nThe man who charged at Ariana has been identified as Johnson Wen, and goes by @PyjamaMann on Instagram.\n\n Cynthia Erivo fans praise 'hero' Wicked star for rescuing Ariana Grande from red carpet ambush as her lightning fast reaction earns a flood of memes and comparison to Kevin Costner in The Bodyguard \nPinned to his profile are videos of him crashing the stage performances of Katy Perry, The Weeknd, and The Chainsmokers.\nAccording to BBC, following Thursday's stunt, he has been charged with being a public nuisance by a Singapore court.\nMarissa stressed in her reaction video, 'This is what I mean when I say social media brings out the worst in people.\n'Oh, did you get your views? Did you get your likes? Guess what you also did — you made somebody feel incredibly unsafe, but just, no remorse. That goes over your head.'\nShe emphasized about Johnson, 'You're a bad person.'\nThe movie star also said in the recording that she she doesn't subscribe to the idea that 'women, or really anybody, should be expected to move with grace or respond with kindness when they've been violated in that way.'\nShe added, 'And to expect that makes you a weirdo also.'\n'The thing is, most of the time women within the public eye do respond with kindness because they know what the result is going to be if they don't,' Marissa highlighted.\n\nAriana pictured on Thursday in Singapore\n\nThe man who charged at Ariana has been identified as Johnson Wen, and goes by @PyjamaMann on Instagram\nAriana, for her part, has moved onward graciously, taking to Instagram on Friday morning to share photos from the Singapore red carpet.\nShe captioned the post, 'thank you, Singapore ♡ we love you,' and said nothing of the shock incident.\nMarissa's TikTok has so far collected over 213,000 likes — more than her 197,000 follower count.\nShe followed up the viral monologue with a second post, in which she named singer Chappell Roan and actress Rachel Zegler as women who are often met with backlash for speaking out against out of control fandom.\n'These are people, they are not products, they do not owe you their entire personhood. And to be frank, if you don't agree with that, you are not a fan,' she said. \n'[You are] someone who's entitled that desperately needs to be brought back down to Earth.'\nAriana GrandeInstagramTikTokThe Weeknd\n\nShare or comment on this article: \nAriana Grande's Wicked co-star breaks silence on star's shock ambush from deranged fan\n\nAdd comment\n\n Share what you think\n\nNo comments have so far been submitted. Why not be the first to send us your thoughts,\nor debate this issue live on our message boards.\n\nAdd your comment\n\nEnter your comment\n\nBy posting your comment you agree to our house rules.\n\nSubmit Comment\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual.\n\nDo you want to automatically post your MailOnline comments to your Facebook Timeline?\n\nYour comment will be posted to MailOnline as usual\n\nWe will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.\n\nYou can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.\n\nEXCLUSIVE'My son's in Gordon's clutches. The Ramsays are pulling him away from me. But I love him - there's nothing he's done I wouldn't forgive': Adam Peaty's weeping mother breaks silence on wedding rift\n\nRobbie Williams, 51, fears weight loss jabs are 'making him blind' and admits his vision is deteriorating as he warns fans of the worrying side effects\n\nChildren In Need 2025: Tom Fletcher's nepo baby son Buzz, 11, stuns viewers with emotional duet as annual telethon raises astronomical £45MILLION\n\nWho won Big Brother 2025? Richard is crowned the WINNER as he takes home £100,000 cash prize while ITV finally confirm future of reality show\n\nAriana Grande's Wicked co-star breaks silence on star's shock ambush from deranged fan\n\nPitch perfect: Gtech founder Nick Grey on why he's proud to support Brentford FC's Premier League journey\n\nDavid Harbour's ex Alison Sudol is supported by Lily Allen as she reveals her mental health suffered after splitting from Stranger Things star\n\nEXCLUSIVE'I was drunk. She wasn't... Something happened': Shock twist in Charlotte Chilton-Conor Maynard baby row as Traitors co-star Jonny Holloway reveals what REALLY happened on their night together\n\nChildren In Need's EastEnders sketch leaves viewers in hysterics as a mini Kat Slater takes over the Queen Vic with fans begging bosses to cast the doppelgänger in the soap full time\n\nDreading the winter fatigue? From simple food swaps to routine tweaks, this is how to support energy to live your life to the full\n\nJustin Baldoni's texts reveal alleged showdown with Blake Lively's 'angry husband' Ryan Reynolds\n\nEXCLUSIVEAs Tess Daly quits Strictly, TV insiders whisper of how Claudia's new move has left her co-star behind, the 'unfair' comparison\n\nNick Knowles, 63, steps out with wife Katie Dadzie, 34, at the Chain Of Hope Gala Ball - two months after her hospital scare\n\nEXCLUSIVEI'm A Celeb's Shona McGarty opens up about her 'horrible' five-year battle with anxiety and depression as she shares fears it will impact her Jungle stint\n\nFrom trending toys and tech to beauty must-haves: Unwrap the ultimate Christmas gift guide... with picks that will fill them with sparkle and joy!\n\nBaywatch actress Erika Eleniak, 56, who posed for Playboy is now covered in tattoos, see her look\n\nSir David Beckham and his wife Lady Beckham enjoy a glamorous dinner at in demand Dorian brasserie with billionaire friend Jamie Salter\n\nMadison Beer nearly suffers a wardrobe malfunction with her extreme slit as she steals the show from Hailey and Kendall at event\n\nEXCLUSIVEI'm A Celeb's Alex Scott admits she fears the 'test' of being apart from girlfriend Jess Glynne in the Jungle\n\nFrom a tree that'll make your neighbours jealous, elegant tablescapes, great gifts, and fabulous festive outfits: We have your showstopping Christmas covered\n\nAmy Childs issues an update on her weight gain journey as she reveals she's on a mission to be her 'best self' after sparking concerns with her worryingly thin frame\n\nKim Kardashian BLASTED by OJ Simpson's lawyer over failed bid to buy her late dad's Bible\n\nTori Spelling and Dean McDermott's divorce documents reveal they vow to deal with $1.7million tax debt together\n\nBREAKING NEWSJimmy Kimmel's late friend and bandleader Cleto Escobedo III's cause of death revealed after shock passing at 59\n\nFrom TikTok to RED HOT! Sarel reveals she's dyed her hair for the very first time - and it cost her less than £10\n\nTeresa Giudice debuts brightblonde hair as she faces foe Melissa Gorga at star-studded BravoCon\n\nHow Eamonn Holmes went from daytime TV's golden boy to sacked ITV star who has battled health woes, a failed marriage and a string of public feuds - including THAT row with HMRC\n\nMeghan Trainor fires back at trolls who 'attack' her after she got boob job and shed 60lbs with weight-loss drug\n\nMargot Robbie shows off her legs in tiny jacket dress on rare date with husband Tom Ackerley... as steamy Wuthering Heights trailer with Jacob Elordi drops\n\n'We weren't alone': One family share the unexpected comfort of saying goodbye the right way with the support of Marie Curie\n\nEXCLUSIVEInsider reveals Christine Quinn is considering a return to Selling Sunset after Chrishell Stause's shock exit\n\nTom Holland's Fred Astaire biopic faces widow's WRATH in legal clash\n\nVanderpump Rules fan favorites join The Valley after show's entire original cast was axed\n\nBrittany Cartwright flashes her new body in a VERY sheer dress at BravoCon after tummy tuck and breast reduction\n\nGive the gift of wow: The top 10 brands bringing sparkle, style and joy to Christmas 2025\n\nF1 star Charles Leclerc and his model fiancée Alexandra Saint Mleux look smitten at glitzy Bang & Olufsen event as glamorous Mel C takes to the decks\n\nEXCLUSIVE'We'd been at breaking point.' Geordie Shore's Charlotte Crosby breaks silence on her relationship with Jake Ankers, the strains they never saw coming - and the romantic gesture that backfired\n\nKelly Brook warns 'she's not herself when she's hungry' as she reveals her biggest fear ahead of I'm A Celeb\n\nEllie Goulding, 38, cavorts with new boyfriend Beau Minniear, 28, after casting hunky actor as her enigmatic lover in raunchy video for comeback single Destiny\n\nFrom garage workshop to global success: Meet the Brit who reinvented the vacuum cleaner\n\nStrictly's Neil Jones puts on a brave face during Children In Need appearance just a day after announcing the tragic death of his beloved father David\n\nMillie Bobby Brown fans slam star's husband Jake Bongiovi for failing to act during paparazzi run-in: 'Divorce him'\n\nJennifer Aniston is hilarious as an annoyed judge who doesn't mind telling people off for new ad\n\nMegan Barton-Hanson sets pulses racing as she slips into bondage-inspired lingerie for sizzling social media post\n\nHow to invest in the future of medicine: The biotech fund backing companies that could change how we live\n\nEXCLUSIVECountry star Megan Moroney reveals the person she trusts most in the music industry\n\nEXCLUSIVEWhy Amy Schumer and her husband are going through 'rough time' in their marriage following her Mounjaro slim-down\n\nEXCLUSIVECelebrity chef reveals 'starstruck' moment with Beyonce and Jay-Z... and whether stars get special treatment at his restaurants\n\nEXCLUSIVEI'm A Celeb bosses left 'angry' and 'confused' by Christine McGuiness for suggesting she'd landed a spot on this year's show despite not being in the lineup\n\nEXCLUSIVEAdam Peaty 'hunkers down' at Gordon Ramsay's home as his brother James is arrested over alleged threats to Olympian during stag weekend\n\nTaylor Swift's never-before-seen handwritten note to late Liam Payne UNVEILED... as it hits auction and sends fans into a frenzy\n\nMatthew McConaughey sparks wild rumors he's running for office with mysterious posters\n\nClint Eastwood's daughter Francesca reveals how she got back in shape so fast after welcoming second child last month\n\nDad has worked with Jennifer Aniston and mom is the daughter of '50s singer Paul Anka... who are these teens?\n\nBeauty lovers, take note - Elizabeth Arden is quietly offering double discounts on its most luxurious gift sets\n\nDesperate Housewives vet Teri Hatcher, 60, re-creates a 20-year-old photo with co-star James Denton, 62\n\nCarefree Molly-Mae Hague narrowly avoids getting another parking ticket as she exits her office after leaving £250,000 G-Wagon in loading bay\n\nEXCLUSIVEBrittany Cartwright breaks silence on fling with MARRIED man amid bitter divorce from Jax Taylor\n\nIrina Shayk joins FKA twigs as they pose NUDE alongside an ethereal Gwendoline Christie for Pirelli's star-studded 2026 calendar\n\nYou can now shop the men's fragrance brand rivalling designer brands for less - here's what we're buying\n\nJane Fonda, 87, thanks billionaire ex Ted Turner for his 'love and support'... 24 years after their divorce\n\nI'm A Celebrity 2025 salaries 'LEAKED' with one unexpected star banking more than the rest\n\nAll Saints' Melanie Blatt admits 'I will have beef with the Spice Girls until I die' after fans claimed she was 'bitter' about rival band's success\n\nKardashian medium Tyler Henry, 29, gets his second brain surgery this year to remove a recurring cyst\n\nDoctor Who spin-off The War Between the Land and the Sea release date confirmed - with special double bill debut\n\nCynthia Erivo fans praise 'hero' Wicked star for rescuing Ariana Grande from red carpet ambush as her lightning fast reaction earns a flood of memes\n\n'Nepo baby' transforms into Miley Cyrus' double at GQ Men of the Year gala... can you guess who?\n\nAlan Carr calls his Traitors co-stars 'thick' as he admits 'murdering' Paloma Faith was his 'worst betrayal'\n\nEXCLUSIVEMarried At First Sight UK couple Keye Luke and Davide Anica SPLIT after having 'huge hopes' of making their romance work outside the show\n\nBeatrice and Eugenie carry on as normal: Princesses make appearances at charity events amid claims Sarah Ferguson is set to 'flee the UK'\n\nEXCLUSIVEBizarre VERY different stories I'm told about the deleted Harry and Meghan photos. Read both... and judge who you believe: ALISON BOSHOFF\n\nZara Tindall holds onto her hat as she leads racegoers braving blustery and wet weather at Cheltenham amid Storm Claudia\n\nEXCLUSIVESlimmed-down James Argent enjoys a cosy reunion with ex Gemma Collins as they are seen together for the first time in five years \n\nI'm A Celebrity star Lisa Riley bursts into tears as she confronts her fear of rats ahead of entering the Jungle\n\nAnna Friel and ex-boyfriend David Thewlis are 'incredibly proud' as daughter Gracie, 20, makes major stage debut\n\nThis Morning's Alison Hammond screams as Dermot O'Leary gets lifted by World's Strongest Woman - before she bends pan\n\nCraig David delights fans as he performs intimate one-off gig at local café in London\n\nEXCLUSIVE How Adam Peaty's mother has found shock new ally in war with her son and his in-laws... Gordon's 'mistress' Sarah - as she reveals 'truths' they bonded over\n\nOne Day star Ambika Mod puts on an astonishing performance in Porn Play as reviewed by GEORGINA BROWN\n\nEXCLUSIVEAngryGinge reveals the advice Coleen Rooney gave himand his fears of 'imposter syndrome' ahead of jungle stint on I'm A Celebrity... Get Me Out Of Here!\n\nGirls Aloud send fans wild after releasing unseen video for their nostalgic Christmas hit Not Tonight Santa featuring Sarah Harding\n\nBookmakers reveal new favourite to win Big Brother - and they'll make history if they take the crown\n\nReal Housewives Of New Jersey star Melissa Gorga, 46, flashes her bikini body in St Barts as she is joined by husband Joe\n\nJennifer Garner reunites with 13 Going On 30 costar Judy Greer... 21 years after the film's release\n\nParis Jackson, Lizzo, and Becky G make a glamorous exit from the GQ Men Of The Year bash as they lead the starry departures\n\nVictoria Beckham's 'flawless' foundation wins over the beauty world despite costing a staggering £104 \n\nMichelle Pfeiffer, 67, raves she is 'lucky in love' with producer David E Kelley after 32 years of marriage\n\nChildren In Need's most iconic moments: From Joanna Lumley's striptease to Taylor Swift performing and Louie Spence's twerk - a look at the show's skits\n\nJustin Bieber admits 'everything hurts' as he reveals gruesome injury causes him intense pain every time he tries to sing\n\nUnseen footage of Blake Lively's unscripted kiss with Justin Baldoni sparks new legal twist amid her sexual harassment claims\n\nMystery surrounds David Harbour's absence at Stranger Things premiere in London following Millie Bobby-Brown bombshell bullying claims\n\nFKA twigs dances down the street in tiny hotpants and leather jacket while listening to music as she promotes her new album in New York City\n\nEXCLUSIVE Liz Hurley is 'distant' from son Damian and spending all her time with Billy Ray Cyrus, as insiders tell ALISON BOSHOFF how model has moved out \n\nPaul Burrell reveals I'm a Celeb saved his life as show's medical checks led to his early prostate cancer diagnosis\n\nGinnifer Goodwin and husband Josh Dallas bring sons to their FIRST red carpet after refusing to show their faces on social media\n\nEXCLUSIVEAmy Schumer's marriage on the BRINK as star sheds pounds and sells off homes amid 'difficult time'\n\nAdam Peaty's brother James is arrested over allegations he sent threats to the Olympian during his stag weekend as bitter family feud escalates\n\nJack Osbourne reveals he was a last-minute replacement on I'm A Celeb as he details the strict rule he's given show bosses following his father Ozzy's death\n\nKylie Minogue, 57, wears tight latex red gown before changing into bow-themed dress to turn on Battersea's Christmas lights \n\nAlessandra Ambrosio, 44, goes braless under plunging top as she flashes her underwear in sheer sequin skirt on night out in Los Angeles\n\nKatie Price lets her hair down with pal Chloe Khan at the Glamour Awards as she reignites feud with daughter Princess Andre \n\nKate's thoughtful tribute to the Duchess of Kent: Princess of Wales's Together At Christmas carol service will honour the late royal with poignant gesture\n\nHailey Bieber stuns in a black sequinned evening gown with racy thong detail as she joins husband Justin at the star-studded GQ after-party in Los Angeles\n\n'Unbelievable' historical war drama starring Chris Pine and Florence Pugh is added to Netflix\n\nMaura Higgins promises fireworks at the roundtable as she gives fans a first look at her appearance in The Celebrity Traitors USA\n\nEXCLUSIVESandra Bullock breaks cover for first time in 11 months... two years after longtime love's tragic death\n\nCardi B, 33, wears corseted jacket as she is seen for the first time on night out in New York just days welcoming baby boy with Stefon Diggs\n\nChris Martin's nepo baby daughter Apple puts on a very leggy display as she celebrates modelling gig and shares her love of Oasis\n\nSarah Ferguson is preparing to flee Britain for a £3.6m seafront villa in Portugal owned by her daughter Eugenie and husband Jack Brooksbank, friends say\n\nMarried At First Sight fans fume at bride for 'leading groom on' with string of dates despite quitting show\n\nI'm A Celebrity FIRST LOOK: Lisa Riley and Alex Scott join Jack Osbourne, Ruby Wax and AngryGinge as they film trial ahead of show's launch\n\nMeghan Markle's best friend Kelly McKee Zajfen, 44, reveals she's pregnant with a baby boy, three years after her 9-year-old son died from Covid\n\nRosie Huntington-Whiteley wraps up in a £435 Burberry scarf and a black trench coat as she enjoys a night out at Winter Wonderland\n\nHarry and Meghan pose with celebrity psychic and send her a quasi-royal letter with the Duchess' royal cypher - before hinting at an upcoming trip\n\nHow Sacha Baron Cohen and Isla Fisher's lives compare post-divorce from work projects to VERY different approaches to dating \n\nLisa Snowdon just wore M&S' viral cashmere jumper dress on This Morning - and it's still in stock\n\nBBC Breakfast host Naga Munchetty faces 'formal investigation after receiving MORE complaints following bullying allegations'\n\nStrictly's Neil Jones reveals his father David has died as he bids him a 'final goodbye' in emotional post\n\nMillie Bobby Brown stuns in a lingerie-inspired corset dress while Sadie Sink wears a satin cut-out gown at Stranger Things premiere in London\n\nHappy Birthday, Your Majesty! King Charles to celebrate his 77th birthday with trip to his beloved Wales\n\nLizzo shows off her slim curves in slip dress for starry GQ bash after dramatic weight loss\n\nKing Charles 'never understood' Meghan Markle but Queen Camilla saw through her 'performance' - as royal expert reveals what really happened at Castle of Mey in 2018\n\nShakira matches with her sons Milan, 12, and Sasha, 10, in purple for rare red carpet appearance at Zootopia 2 premiere\n\nAriana Grande is ambushed by fan at Wicked: For Good premiere as Cynthia Erivo leaps in to protect her co-star\n\nRock icon David Coverdale announces he's 'hanging up his platform shoes and skin tight jeans' after five decades\n\nQueen Letizia's changing face: Spanish royal, 53, unveils 'sculpted' new look\n\nNick Cannon's teen daughter with Mariah Carey makes rare comment about his NINE younger children\n\nEXCLUSIVEAdam Peaty's dad Mark snubbed his son's stag party while his future father-in-law Gordon Ramsay took centre stage \n\nWhy King Charles was left red-faced when the birth of his brother Andrew was announced during his school play\n\nSydney Sweeney commands attention in a low-cut goth gown as she makes red carpet comeback at GQ Men of the Year event in LA after Christy flop\n\nHailey Bieber puts on her raciest display yet in sheer backless gown for GQ party after eyebrow-raising remark about Justin marriage\n\nHolly Willoughby wraps up warm as she joins Tamara Ecclestone at Winter Wonderland while Vogue Williams enjoys event ahead of I'm A Celebrity\n\nALISON BOSHOFF: The extraordinary night Guns N' Roses frontman Axl Rose shunned the Dorchester and slept on an IKEA bed in Spurs' dressing room\n\nMargot Robbie and Jacob Elordi seen as star-crossed lovers Catherine and Heathcliff in intense new trailer for Emerald Fennell's Wuthering Heights\n\nSharon Osbourne reveals a woman claiming to be Ozzy's secret daughter sent her toenails, hair and blood begging for a DNA test\n\nCardi B gives birth to fourth child and first with boyfriend Stefon Diggs amid NFL star's paternity drama\n\nEastEnders legend Pam St Clement set to return to BBC soap as Pat Butcher for special episode in Nigel's dementia storyline\n\nCruz Beckham, 20, packs on the PDA with girlfriend Jackie Apostel, 30, during date at Winter Wonderland\n\nGemma Collins turns heads with her bold look as she rocks pink corset dress and huge hair while leaving her hotel\n\nLisa Kudrow, 62, doesn't look like this anymore as she reprises iconic role after more than a decade\n\nOlivia Attwood and her husband Bradley Dack look as loved up as ever at her Spotify launch party after a going through a 'difficult six months'\n\nBig Brother reveals its 2025 finalists as fans declare Teja was 'robbed' after she and Marcus were forced to leave in explosive double eviction\n\nSuki Waterhouse looks chic in a strapless dress as she is supported by her family to host a VIP dinner with Michael Kors at Claridge's\n\nJamie Redknapp sues small eco-surf shop over claim Sandbanks name is too similar to his posh recycled clothing brand\n\nSpice Girls' Mel C makes shock relationship admission about her Australian partner Chris Dingwall: 'Nobody knows this'\n\nMichael Jackson's daughter Paris looks downcast after losing legal battle with his estate amid ongoing fight\n\nEddie Murphy's daughter Bria, 35, is expecting first child with husband as she debuts baby bump at dad's big premiere\n\nBRIAN VINER reviews The Running Man: A deadly game of traitors and faithfuls (with a billion dollar prize)\n\nNow it gets REALLY ugly: Holly Ramsay and Adam Peaty's family feud escalates further with claims of violent threats and an armed police escort \n\nGrammy-winning Tequila hitmaker Dave Burgess dead at 90\n\nSydney Sweeney defended by Christy Martin after Ruby Rose 'cretin' attack over 'ruining' biopic\n\nMarried At First Sight UK couple reveal they've SPLIT minutes into the reunion - just a day after viewers saw them reaffirm their love in final vows\n\nBRYONY GORDON: This is the truth about Adam Peaty, his mother and Holly Ramsay. There is a terrible virus sweeping Britain - read this and you'll see where the blame REALLY lies\n\nEXCLUSIVEKim Kardashian and Kris Jenner hit back at shock Ray J lawsuit claiming momager leaked star's sex tape with him\n\nProject Runway star is shockingly arrested in West Virginia... three years after competing on hit show\n\nCelebrity Race Across The World thrown into chaos as two pairs are forced to HALT their journeys after protests and strikes sweepGuatemala\n\nVogue accused of face-tuning Amal Clooney: 'I thought it was someone else'\n\nBaywatch vet Carmen Electra, 53, is seen kissing a regular guy... after dating stars like Prince and Dave Navarro\n\nHome Improvement star blames childhood fame for latest domestic violence arrest\n\nLoud music, flirting, strip poker...old folks homes never looked so fun, CHRISTOPHER STEVENS reviews Play For Today: Never Too Late\n\nLatin Grammy Awards WORST dressed: All the stars suffering fashion flops on the red carpet\n\nAlex Rodriguez and ex-wife finally address Madonna affair claims 17 YEARS after they split amid scandal\n\nBaywatch star Nicole Eggert, 53, shares inspirational message after mastectomy and chemotherapy\n\nJack Osbourne says I'm A Celeb will be like 'trauma bonding' after the death of his father Ozzy as he gets ready to enter jungle\n\nThe Saturdays' Vanessa White cradles her baby bump as she shares sweet photos with fiance after announcing pregnancy and engagement\n\nLouis Tomlinson sends fans wild as he details Zara McDermott romance in new love song Palaces\n\nEamonn Holmes reveals his tax row with 'thieving HMRC' has cost him more than £1million and two houses - and he still owes £250,000\n\nAimee Lou Wood's lookalike sister Emily reveals the heartbreaking reason why they've parted ways as she admits it's the 'best thing they ever did'\n\nKelly Brook's colourful love life: I'm A Celeb star was engaged four times as she enjoyed romances with Hollywood actor Jason Statham and rugby bad boy Danny Cipriani \n\nCatherine Zeta-Jones' daughter Carys Douglas, 22, looks like mom in a strapless gown as she hits party without her famous parents\n\nI'm A Celebrity star Kelly Brook's pay 'REVEALED' as model is set to make mega-bucks for ITV stint after claiming she'd 'never do it'\n\nRuby Wax complains to ITV about 'trash' hotel room she's been put up in before moving into I'm A Celeb camp\n\nI'm A Celeb star Aitch reveals that he is going into the jungle to raise awareness of people with Down Syndrome like his little sister\n\nManifest actor announces shock engagement to new love... after quietly splitting from costar Melissa Roxburgh\n\nCate Blanchett stuns in a dramatic lilac feathered gown as she joins elegant Naomi Campbell and Heidi Klum for the Bambi Awards in Munich\n\nFitness influencer Alice Liveing admits she's struggling to leave the house and 'exercise hasn't even crossed her mind' in candid post - three weeks after welcoming her first child\n\nMORE DON'T MISS\n\nTilly Ramsay hits the red carpet in a black velvet minidress for the Stranger Things premiere amid sister Holly's and Adam Peaty's family feud drama\n\nKatie Price takes another swipe at ex Peter Andre in furious rant about 'parenting rights'\n\nBillie Eilish unleashes expletive-filled rant at 'pathetic' Elon Musk amid his impending trillionaire status\n\nFour Strictly Come Dancing past finalists set to return to the dance floor for a group dance as part of this year's Blackpool specials\n\nAdam Peaty revealed religion 'saved him' and he values his 'relationship with Jesus' over winning gold medals - as his family accuse him of 'not living by the rules of the church' amid feud\n\nThe year of Disney comebacks: As Hilary Duff becomes latest teen star to revive her career how the channel's actors overcame addiction, arrests, bitter divorce and family feuds\n\nEXCLUSIVEExposed: Beatrice and Eugenie in 'secret deal'. Andrew and Charles' negotiations over fate of the girls - plus the twist no one saw coming, revealed to RICHARD EDEN\n\nBlack Panther star Chadwick Boseman to receive posthumous star on Hollywood Walk of Fame five years after death at 43 from colon cancer\n\nLady Gaga reveals she had 'psychotic break' after A Star Is Born\n\nWill Smith is seen with both his current wife Jada and ex-wife Sheree in rare family photo\n\nThe Night Manager stars Tom Hiddleston and Camila Morrone pose for a new Vogue shoot to mark the drama's long-awaited return\n\nCruz Beckham gives his older brother and aspiring chef Brooklyn a run for his money as he shows off his own cooking skills\n\nCharli XCX reveals behind the scenes snaps of her new music video with rock legend John Cale with their new song set to feature in Wuthering Heights movie\n\nHilaria and Alec Baldwin react in horror as blogger rips apart their Hamptons home\n\nMoving the goalposts! The footballer nepo babies who are outshining their famous dads with big brand deals and TV stints \n\nKim Kardashian flippantly brands stepdad Caitlyn Jenner's transition as 'TV gold'\n\nSydney Sweeney looks demented with blood stains on her forehead in new trailer for The Housemaid\n\nAmy Robach shows off massive engagement ring as she and TJ Holmes are seen for first time since he popped the question\n\nEXCLUSIVEHolly Ramsay steps out with a 'bride' phone case and breaks cover for the first time since ugly family feud with Adam Peaty's relatives\n\nJames Haskell reveals he constantly 'cracks jokes' to Mike Tindall about his disgraced in-law Andrew Mountbatten Windsor - and says it's 'never the wrong moment'\n\nEXCLUSIVEHarry and Meghan's photo-gate leaves Kardashian clan 'upset': Sussexes demanded not to be pictured inside Kris Jenner's birthday party\n\nPierce Brosnan is joined by nepo baby son Dylan, 28, on the set of MobLand as he films scenes in London - days after reuniting with estranged eldest son Christopher\n\nLiam Payne's girlfriend Kate Cassidy shows off her amazing figure in a black sports bra and leggings as she enjoys a day out in Miami\n\n'I'm on my best behaviour!' Prince William declines a Cornish cider on visit to youth football club\n\nLove Is Blind UK to return to our screens as part of a new spin-off to catch-up with its contestants to see if love really is blind\n\nKourtney Kardashian throws Travis Barker massive 50th birthday party... after fans branded him 'controlling'\n\nDenise Richards' daughter Sami Sheen shows off her 18 tattoos as she says she is getting them 'all' removed\n\nLove Island's Montana Brown shows off her 10 months postpartum figure in skimpy underwear and says she's 'feeling good'\n\nAnya Taylor-Joy flashes her legs in a white minidress at Tiffany event... months before milestone birthday\n\nAnt McPartlin and Declan Donnelly send Sara Cox a good luck message from the I'm A Celeb jungle as she raises a staggering £2.6million for Children In Need Challenge\n\nTaylor Swift shares first look at her new documentary which includes Sabrina Carpenter and Travis Kelce\n\nEXCLUSIVEJessica Simpson and her estranged husband move closer to divorce in feud over teen daughter's future\n\nEXCLUSIVE'I saw five doctors before I was taken seriously. I thought I was insane': VICKY PATTISON opens up on terrifying incurable condition\n\nMom worked with Scarlett Johansson, dad is a rock star and there's a Godfather link, who are these nepo teens?\n\nPrincess and Junior Andre confess they would love to go on I'm A Celebrity... Get Me Out of Here and call it a 'full circle' dream\n\nAlicia Silverstone gets emotional as she unveils her late mother's secret Clueless cameo\n\nBrazilian influencer, 26, dies suddenly after falling ill just days after her birthday\n\nPrincess Eugenie appears at King's Foundation event to support 'inspirational artists' - as she tries to move past scandal surrounding her father\n\nLoose Women viewers praise 'brave' Emmerdale star Jaye Griffiths as she breaks down and visibly shakes while recounting her horrific domestic abuse\n\nGogglebox couple look unrecognisable in sweet throwback snap from the 80s - but can YOU guess who they are?\n\nTaylor Swift is seen in rare behind-the-scenes footage working hard at her Eras Tour dance routines in docu trailer\n\nGrand Designs viewers left in tears by couple's amazing act of generosity after converting a dilapidated barn into their forever home \n\nAll these women would look better fat! I never thought I'd say it... but someone had to admit the ugly truth about Hollywood's new obsession: CAROLINE BULLOCK\n\nAngus Cloud's mother files lawsuit over late Euphoria star's estate as she claims 'elder abuse'\n\nAtomic Kitten star Liz McClarnon, 44, shares first snap of her baby boy since giving birth after years-long struggle to conceive and eight rounds of IVF\n\nWill Ferrell, 58, forced to halt filming for Netflix after suffering injury\n\nJennifer Aniston, 56, shows off her incredible figure in underwear and a crop top as she poses for striking ELLE shoot\n\nABC News correspondent dead aged 69 as heartbroken colleagues make on-air announcement\n\nTaylor Swift's mom gushes over Travis Kelce as singer shares touching look into their romance in new documentary trailer\n\nKing Charles wrote a 'lovely' letter to Ozzy Osbourne's family after his death as his wife Sharon calls the monarch a 'caring man with a good heart'\n\nCoronation Street blasted by viewers as 'unwatchable' after debuting new experimental format\n\nKelly Brook injects a dose of glamour to the I'm A Celeb jungle camp as she parachutes onto the beach wearing a leopard-print cleavage-baring jumpsuit\n\nEXCLUSIVELord Sugar faces a grilling from teeny tycoons who quiz him on his grumpiness, football loyalties and who'll get his fortune for Children in Need\n\nAMANDA PLATELL: Photos of bleary-eyed Harry and Meghan at Kris Jenner's birthday bash have disappeared... and I think I know the highly embarrassing reason why\n\nCheryl and Jade Thirlwall send fans into meltdown as snap of them together in 2008 is unearthed after their glam reunion at Harper's Bazaar Women Of The Year\n\nThe Chase star Shaun Wallace, 65, shows off his impressive physique while stripping off for an outdoor workout - after he admitted his 'knees have gone'\n\nI'm A Celeb FIRST LOOK: Jubilant Kelly Brook, Shona McCarty, Eddie Kadi, Martin Kemp and Aitch parachute onto the beach ahead of their jungle debut\n\nOre Oduba unveils new 'serendipity' tattoo after revealing a devastating porn addiction has 'destroyed his life' since the age of nine\n\nTess Daly's lookalike daughter Phoebe Kay shares behind-the-scenes snaps from TV presenter's 'emotional' MBE ceremony\n\nThe Repair Shop star Dominic Chinea says his life is 'in chaos' as TV show is 'coming to an end'\n\nLouis Tomlinson's sister Phoebe reveals they have introduced his girlfriend Zara McDermott to her daughter\n\nMAFS UK reunion sees Julia-Ruth storm off set in tears during explosive row with Maeve - after insisting she has 'no regrets' about secretly sleeping with her husband\n\nAdam Peaty and Holly Ramsay accused of 'bodyshaming' his own mother as family say he is not living by the rules of Christianity\n\nEXCLUSIVE 'Horrible' threatsfrom one side and this shocking slur from the other... insiders tell KATIE HIND what's really behind Ramsays and Peatys feud\n\nKylie Jenner reveals she's finally moving into 'fortress' mansion complete with underground bunker five years after buying the land off Miley Cyrus for $15M\n\nEXCLUSIVEInside Joanne Beckham's 'glow up', how Victoria really feels about her and the footballer relationship that left David furious and led to a public row with KATIE HIND\n\nEXCLUSIVEEd Sheeran's plan to combine historic seaside cottages into mega coastal home upsets new neighbour and parish councillors\n\nCynthia Erivo recalls the heartbreaking moment her father told her he never wanted to see her again after childhood dispute in a tube station\n\nI'm A Celebrity's Lisa Riley is exempt from grueling jungle trial favourited by ITV fans\n\nPrincess Andre, 18, looks the spitting image of her famous mum Katie Price as she temporarily dyes her hair brunette\n\nSydney Sweeney faces fresh career blow after disastrous Christy movie flop - as furious critics threaten to boycott her next film The Housemaid\n\nBBC Breakfast host Charlie Stayt awkwardly tells viewers 'that's not gone down well' in awkward encounter alongside Naga Munchetty\n\nOzzy Osbourne's widow Sharon in tears after hearing voicemail from Trump\n\nSarah Michelle Gellar, 48, wears plunging waistcoat as she poses with Brendan Fraser at the premiere of Rental Family\n\nEddie Murphy, 64, is supported by his glamorous wife Paige Butcher, 46, at the premiere of his new Being Eddie documentary\n\nTom Daley displays his washboard abs in sizzling shirtless shoot for FAULT Magazine as he admits filming Celebrity Traitors was 'really tough'\n\nCynthia Erivo breaks her silence on THAT viral 'holding space' interview with Ariana Grande as she poses for stunning GQ shoot\n\nKim Kardashian's daughter North West, 12, shocks fans with 'high-risk' piercing 'not suitable' for kids\n\nEngland footballer is unrecognisable in Hulk Hogan costume while celebrating daughter's 18th birthday - but can you guess who the sporting legend is?\n\nJustin Baldoni files motion for judge to THROW OUT multimillion dollar legal battle against Blake Lively\n\nThe REAL reason why Prince Harry and Meghan Markle photos were removed from Kris Jenner's birthday posts \n\nBrooke Shields and her nepo baby daughter Rowan Henchy enjoy a night out at the Alice + Olivia x Grateful Dead capsule collaboration launch in NYC\n\nIsla Fisher admits re-building life 'from grassroots level' has been 'tough' and reveals she cried as she moved furniture into her new home after divorce \n\nEddie Redmayne enjoys a rare date night with wife Hannah as they lead the stars at Broadwick Soho's second birthday party\n\nOlivia Wilde dazzles in a strapless velvet gown as she joins chic Elle Fanning leading the A-list turnout at the Chanel MoMA Film benefit\n\nKelly Brook reveals reason for her split from ex-fiancé Jason Statham after seven years together as she confesses she's learned to be 'more selfish'\n\nCallum Turner cosies up to sizzling co-star Monica Barbaro as they shoot their new sex comedy One Night Only on location in New York\n\nQuentin Tarantino, 62, and glamorous wife Daniella Pick Tarantino, 41, pack on the PDA during rare red carpet appearance \n\nJohn Travolta's son Benjamin, 14, has grown into his spitting image as Grease star proudly shares new photo\n\nAdam Peaty escorted from plane by armed police after receiving sinister threats during stag do amid family feud\n\nLeonardo DiCaprio pays tribute to the 'absolutely unstoppable' Jane Goodall at the late conservationist's funeral\n\nShould Prince George attend more events? Have your say in the Palace Confidential Poll\n\nKevin Costner reveals his heartbreak at facing the festive season as a single father\n\nKim Kardashian reveals extreme measures she had to take after learning someone put 'a hit out' on her life\n\nLily Allen wows in a sheer dress at The Hunger Games: On Stage premiere night after her cosy date with writer Jonah Freud\n\nNow It-girl Alexa Chung fights off a phone snatcher in London: RICHARD EDEN'S DIARY\n\nWas this the start of Adam Peaty's family feud? Star made VERY telling comment about the Ramsays when he returned to swimming after his breakdown\n\nKim Kardashian vowed to pass the bar exam 'on the first try' just three months before failing: 'I don't have another few months I can give up'\n\nJennifer Aniston and Lena Dunham lead stars paving the way to break Hollywood's silent taboo by discussing their infertility\n\nLegendary rocker Neil Young shares his support for Jimmy Kimmel as he takes his vintage convertible for a spin on his 80th birthday\n\nEXCLUSIVEBlake Lively scores new legal victory amid lawsuit against Justin Baldoni\n\nKirsty Gallacher reveals her benign brain tumour is 'growing very fast' and she 'doesn't know if radiotherapy will work'\n\n'It was very uncomfortable': Kelly Brook reflects on being sexualised aged 16 after swimsuit photoshoot launched her glamour modelling career\n\nJamie Carragher's daughter Mia stuns in a silver dress alongside her 'proud' parents as she makes her debut as leading lady in The Hunger Games\n\nPATRICK MARMION reviews The Hunger Games: A £26m colosseum, a footballer's daughter ... but these Hunger Games lack bite of the blockbusters\n\nNew Celebrity MasterChef judge Grace Dent reveals she was reduced to tears by star during filming\n\nGeorge Clooney steps behind the camera as he snaps his co-star Eve Hewson at the premiere of their new film Jay Kelly\n\nJohn Cleese says he's 'glad he suffered a nervous breakdown' after third divorce from Alyce Faye Eichelberger as he opens up on battle with depression\n\nZayn Malik 'rejoins One Direction 10 years after quitting the group as he grows closer to his bandmates after Liam Payne's death'\n\nLove is Blind UK spin off series confirmed as Netflix capitalise on show's success by following the couples' marriages in the real world\n\nLook away now Kylie! Kim Kardashian's wealth soars as Skims now worth $5B\n\nJonathan Ross reveals why Ricky Gervais turned down Celebrity Traitors after BBC bosses asked comedian to join the show\n\nWill Smith poses with rarely seen son Trey in celebration of his 33rd birthday\n\nCallum Turner proudly poses next to a poster of his fiancée Dua Lipa as he films One Night Only in New York City\n\nBig Brother fans blast 'ridiculous' episode just days before the final and plead 'give us the eviction now' - as it's revealed two housemates have ALREADY been voted off\n\nKanye West could be charged with racism and morality offenses in Brazil if he plays Hitler song\n\nEXCLUSIVEGary Lineker's new 'extraordinarily lucrative' Netflix deal revealed following his exit from the BBC amid 'antisemitic insult'\n\nAmy Schumer hits back at claims she wiped her Instagram to get rid of her pre-weight loss photos after Mounjaro transformation\n\nEXCLUSIVEKelly Clarkson's staff 'feel like s***': TV insiders reveal star's huge backstage transformation after death of ex-husband\n\nHungover Cruz Beckham, 20, shows off his guitar skills as he prepares to battle girlfriend Jackie Apostel, 30, in the charts after she shared unreleased music\n\nDiddy has prison release date pushed BACK amid allegations of 'drinking moonshine'\n\nSharon Osbourne tearfully details secret fall late husband Ozzy suffered which led to a 'domino effect' in the decline of his health\n\nAkon locked up in Georgia over outstanding warrant in bizarre case\n\nAmber Gill admits she 'didn't want to leave the house' as she struggled with sudden fame and social anxiety after Love Island\n\nMAFS UK viewers are AGHAST as groom Reiss leaves his wife Leisha speechless with his decision at final vows - with fans declaring 'what have you done?'\n\nBritney Spears reconnects with her sons after they 'cut off contact' over 'shocking things' they saw at her home\n\nElizabeth Berkley, 53, marks Showgirls' 30th anniversary... after stripper film ruined her career\n\nSydney Sweeney's PDA tour with Scooter Braun continues as star brushes off another massive box office flop\n\nEscape to The Chateau's Dick and Angel Strawbridge reveal surprise reunion with crew member ahead of TV return - after quitting their show over bullying claims\n\nCHRISTOPHER STEVENS reviews: Richard Burton: Wild Genius: A deft tribute to Burton's career - but where were all the great anecdotes?\n\nKim Kardashian is bra-free as she almost busts out of a skimpy top in Rio while modeling FLIP FLOPS over toe socks\n\nAdele to make her acting debut alongside Hollywood stars Aaron Taylor-Johnson and Nicholas Hoult in Tom Ford's new film about castrated opera singers\n\nCourtney Stodden, 31, models a bikini in her new mansion... 15 years after she came to fame as a child bride\n\nHilaria Baldwin, 41, reveals she and husband Alec, 67, are in therapy to navigate their age-gap marriage\n\nRed Dwarf star Chris Barrie delights fans as he is spotted at meet and greet five years after last TV appearance amid health woes\n\nThe Devil Wears Prada fans LOSE IT as Anne Hathaway and Meryl Streep reunite on screen for the first time in 20 years\n\nGiovanni Pernice's dance partner bats his hand away from her waist in awkward moment on the Italian version of Strictly\n\nTess Daly is supported by husband Vernon Kay and lookalike daughter Phoebe, 21, as she receives MBE from King Charles at Windsor Castle\n\nLove Is Blind star looks unrecognizable after hunky makeover which included five-figure hair transplant\n\nEXCLUSIVEI'm A Celebrity... Get Me Out Of Here! bosses admit they are preparing for the 'toughest' year yet as huge pythons infest jungle camp - just days before show returns\n\nRobert De Niro turns on the Stella McCartney Christmas lights four years after he blamed the designer's clothes for his dwindling bank balance during bitter divorce battle\n\nDermot O'Leary breaks his silence on whether he is in talks to host Strictly Come Dancing - seven years after presenting rival show X Factor\n\nPixie Lott stuns in an elegant velvet gown as she leads the arrivals at the London premiere of Christmas Karma two weeks after birth of second child\n\nAdam Peaty's struggling family say he is ashamed of their lack of wealth amid Ramsay nuptials as he's accused of 'saying the most vile things to his mum'\n\nVernon Kay lands brand new BBC role after skipping his Radio 2 show to watch wife Tess Daly receive an MBE from King Charles\n\nDiane Kruger stuns in a white lace minidress as she attends the Merteuil premiere in Paris\n\nThe ultimate nepo clan: Adam Sandler poses with his family as it's revealed ALL of them get hired on his films\n\nEXCLUSIVEKate Spade's best friend of four decades lays bare her grief seven years after designer's suicide\n\nEXCLUSIVEKourtney Kardashian's Lemme brand embroiled in legal war against Hong Kong cigarette company\n\nCelebrity Traitors stars Stephen Fry and Celia Imrie reunite after THAT nail-biting finale as they join Hayley Atwell for glitzy Christmas lights switch-on\n\nBeloved TV chef dead at 43 after helicopter crashes into power lines\n\nZac Efron fans left in disbelief after his 'REAL singing voice' exposed in leaked High School Musical clip\n\nCoronation Street star rushed to hospital after bizarre monkey attack during family holiday\n\nTom Daley and his Channel 4 knitting show invited to Shetland after a row over 'cultural appropriation'\n\nVernon Kay misses his Radio 2 show to support wife Tess Daly as she receives an MBE - leaving colleagues scrambling\n\nCelebrity Traitors star Joe Marler reveals he was paid LESS than his co-stars despite reaching the final as he takes a savage swipe at Stephen Fry\n\nEXCLUSIVEMarried At First Sight UK bride breaks down in tears as she drops a bombshell on her husband... and makes a dramatic U-turn during final vows\n\nAriana Grande appears to dramatically snub Sydney Sweeney as slew of stars turn on the plagued actress\n\nLily Allen enjoys cosy date with writer Jonah Freud in Notting Hill after poking fun at her ex-husband David Harbour's infidelity\n\nJennifer Aniston stumps fans as she claims her family 'had no money growing up' even though dad was a soap opera star\n\nTimothée Chalamet risks angering his legion of female fans with snide comment about childless women\n\nEXCLUSIVEKirsty Gallacher blasts court for showing 'no empathy' as she's banned from driving for six months after being caught speeding at 35mph in a 30mph zone\n\nJennifer Aniston gushes about new hypnotherapist boyfriend Jim Curtis as she strips down for ELLE cover shoot\n\nLove Island's Demi Jones reveals boyfriend was 'cheating on her' as she thanks best friend Olivia Hawkins for discovering his infidelity\n\nHow Demi Moore would REALLY look if she never had any suspected cosmetic enhancements as she turns 63\n\nTroubled Home Improvement star Zachery Ty Bryan 'punched girlfriend and threatened to kill her' in latest brush with the law months after arrest\n\nDancing Queen! Camilla celebrates 75th anniversary of English National Ballet at Buckingham Palace\n\nAriana Grande and Cynthia Erivo's Judy Garland tribute gets stunning verdict from late singer's daughter\n\nBrooklyn Beckham teases 'something's coming soon' for his successful hot sauce brand Cloud23 -after he swerved his father's knighthood celebrations\n\nEXCLUSIVE'Uncancelable' Sydney Sweeney is employing 'bomb-proof' techniques to cling onto fame despite backlash\n\nLauren Sanchez, 55, oddly looks the same age as Kendall, 30, and Kylie, 28, as she leaves Bezos at home to party\n\nEmily Blunt reveals the secrets to working with her husband John Krasinski as she sizzles for ELLE's 2025 Women In Hollywood Celebration issue\n\nEXCLUSIVEJaw-dropping reason Holly Ramsay and Adam Peaty have banned his mum from wedding and hen do. BOTH sides spill poisonous details to KATIE HIND\n\nMadonna, 67, goes braless in sheer dress as she channels her inner disco to promote 20th anniversary album release\n\nStrictly's Katya Jones reveals who she thinks should replace Claudia Winkleman on the popular BBC show after shock exit announcement\n\nAllison Mack reveals sad truth behind first marriage to ex-wife and fellow NXVIM member amid rebound with former neo-Nazi\n\nToday's headlines\n\n'My son's in Gordon's clutches. The Ramsays are pulling him away from me. But I love him - there's nothing...\n\nThe Chancellor's lost control: Rachel Reeves accused of presiding over most shambolic Budget in history...\n\nDonald Trump WILL sue the BBC! US President announces '$1-5billion' legal case as he attacks 'egregious'...\n\nShock twist in Charlotte Chilton-Conor Maynard baby row as Traitors co-star Jonny Holloway reveals what...\n\nBORIS JOHNSON: This is the one thing Reeves can do that'll cost British taxpayers nothing, save lives, and...\n\nHome Secretary set to make HUGE change to UK refugee policy next week which will mean all who claim asylum...\n\nRobbie Williams, 51, fears weight loss jabs are 'making him blind' and admits his vision is deteriorating as...\n\nWhy you've stopped losing weight on Mounjaro - and how to fix it: These are the sleep, alcohol and diet...\n\nWhen my period suddenly stopped, I thought I was just tired - it turned out to be a little-known hormone...\n\nWatch salesman who killed himself after being tied up in £1.1million heist had been working in shop that was...\n\nDAILY MAIL COMMENT: This Budget shambles proves Chancellor is out of her depth\n\nThe hearing aid that's changed my life: I couldn't hear in crowded places, missed words and was humiliated...\n\nStick the kettle on! Average Briton drinks 62,046 cups of tea in their lifetime\n\n'We'd been at breaking point.' Geordie Shore's Charlotte Crosby breaks silence on her relationship with Jake...\n\nPolice charge 'fake admiral' Jonathan Carley days after appearance at a Remembrance Sunday event with a...\n\nWes Streeting still 'backs himself' as future PM after Starmer allies accuse Health Secretary of plotting...\n\nMoment 'calculated' teenage nursery worker, 18, defiantly answers 'no comment' to police questions as he is...\n\nSteer clear of Andrew if you want to get your reputation back, PR firm told Jeffrey Epstein when he was...\n\nI have new evidence Amy Bradley is alive: Bombshell by private investigator trying to solve Caribbean cruise...\n\nBudget shambles and a global AI 'wobble' wipes £27billion off the value of the FTSE 100\n\nTinder Swindler boasted he is 'unstoppable' in first major interview hours before he was dramatically freed...\n\nHow worried should we be about the curious clusters of Chinese restaurants surrounding our most sensitive...\n\nMy verdict on the £2.25 a slice Marks & Spencer 'glass' bread everyone's talking about: SARAH RAINEY\n\nMen cried after I called their quarter-zips revolting - but women queued up to agree. So here's the 11 looks...\n\nKing Charles 'never understood' Meghan Markle but Queen Camilla saw through her 'performance' - as royal...\n\nLouder than war! The pet shop tycoon who moved into his £4million South Downs mansion... then hosted an...\n\nMoment suspected people smuggler 'fakes' falling off small boat to evade suspicion from police\n\nWhy the truth about Hitler's genitals helps explain his 'terrifying urge for domination'\n\nReeves' climbdown on income tax proves Labour is now the puppet of Left-wing backbenchers... leaving money...\n\nJeremy Corbyn's Your Party descends further into chaos as one of its six MPs hits out at 'persistent...\n\nJAN MOIR: The hangover from the Kardashian party may not be fatal, but Harry and Meghan have made utter...\n\nMassacre of the ostriches: How a stand-off between officials and a motley crew of animal lovers,...\n\nThe best Christmas markets you should visit - and the ones to avoid\n\n'Reeves is looking terrible. I'm worried for her': Damning verdict of Labour insiders who tell full story of...\n\nHow Eamonn Holmes went from daytime TV's golden boy to sacked ITV star who has battled health woes, a failed...\n\nSummer camp monster admits giving children sweets laced with sedatives and sexually assaulting two boys at...\n\nAwkward moment Queen Camilla tells Ruth Jones 'you've lost masses of weight' after failing to recognise her...\n\n'Antisemitic' children's doctor who hailed Hamas terrorists as 'resistance fighters' and claimed ribbons...\n\nAutopsy reveals the truth about newlywed couple found dead in their car after wife's haunting final post\n\nThe car feature you SHOULDN'T use when driving in storm conditions\n\nAriana Grande's Wicked co-star breaks silence on star's shock ambush from deranged fan\n\nHow Trump-loving MAGA influencer wanted by British police became the most hated woman on the internet\n\nJustin Baldoni's texts detail alleged showdown with Blake Lively's 'angry husband' Ryan Reynolds\n\nMan, 22, fights for life after swallowing a whole burger without chewing it 'for a joke'\n\nNutritionist influencer Diana Areas, 39, dies after 'falling from top of building'\n\nCould Fergie flee Britain? Sarah Ferguson 'is preparing to move to a £3.6m seafront villa in Portugal owned...\n\nSir David Beckham and his wife Lady Beckham enjoy a glamorous dinner at in demand Dorian brasserie with...\n\nChildren In Need 2025: Tom Fletcher's nepo baby son Buzz, 11, stuns viewers with emotional duet as annual...\n\nReal psychopath reveals the disturbing hidden clues that make him different from normal people\n\nMoment man who knifed driver, 19, to death at the wheel of his Porsche is arrested by police in corner shop\n\nMORE HEADLINES\n\nAnarchy in government as PM's 'nemesis' Wes Streeting celebrates Reeves' humiliating income tax U-turn as 'most chaotic Budget ever' unravels\n\nKing Charles 'never understood' Meghan Markle but Queen Camilla saw through her 'performance' - as royal expert reveals what really happened at Castle of Mey in 2018\n\n'Fake' admiral who 'took centre stage at Remembrance Sunday event while wearing phoney medals' is arrested\n\nHeartbroken family pay tribute to 'brave and beautiful' schoolgirl, 17, stabbed to death while 'fighting off intruder who broke into her home'\n\nReeves' 'sums of anarchy' in 'most chaotic Budget ever': How you could still pay £750 more on £50,000 salary even without an income tax hike\n\nSummer camp monster admits giving children sweets laced with sedatives and sexually assaulting two boys at Christian group he ran\n\nEmotional Sara Cox reaches the finish line of her gruelling 135-mile Children in Need marathon challenge as fundraising tops £9.5million\n\nCould Fergie flee Britain? Sarah Ferguson 'is preparing to move to a £3.6m seafront villa in Portugal owned by her daughter Eugenie and husband Jack Brooksbank'\n\nMan, 22, fights for life after swallowing a whole burger without chewing it 'for a joke'\n\nAwkward moment Queen Camilla tells Ruth Jones 'you've lost masses of weight' after failing to recognise her during King's trip to South Wales for his birthday\n\nReeves faces 'credibility crisis' as markets batter UK after Labour MPs force U-turn on income tax hike... with fears 'stealth raids' will now fill £40bn Budget black hole\n\nWhy the truth about Hitler's genitals helps explain his 'terrifying urge for domination'\n\nStorm Claudia sparks travel chaos as heavy rain and 70mph winds batter Britain and heads for London\n\nWatch salesman who killed himself after being tied up in £1.1million heist had been working in shop that was a 'front for organised crime', court told\n\nUK weather map reveals where rain is set to drench Brits in a matter of HOURS: Met Office issues five amber and yellow weather warnings as Storm Claudia rolls in\n\nHero husband sacrificed himself to save his wife when lorry veered in front of them on motorway, inquest hears\n\n'Why was he here?' Mother of schoolgirl raped by a small-boat migrant demands to know why he was allowed into Britain despite 11 previous convictions\n\nNursery worker, 18, who raped and sexually abused children as young as three is locked up for 10 years\n\nRevealed: Kirsty Gallacher's £1.5m home is a 15-minute walk from bus stop...after she tried to escape driving ban by claiming she didn't live near 'reliable' public transport and couldn't afford taxis\n\nSeveral people killed when bus crashes into bus shelter in Sweden - as driver is arrested\n\nBritain's 'biggest ever' fly tip is massive 500ft-long mountain of rubbish - as activists condemn 'environmental catastrophe'\n\nI have new evidence Amy Bradley is alive: Bombshell by private investigator trying to solve Caribbean cruise disappearance. Now he reveals fatal flaws in Netflix documentary, what they DIDN'T show... and new twist\n\nThe prison officer who just couldn't keep her hands off the inmates... she had two affairs - but were there even more?\n\nFriends' haunting text messages to fashion designer moments before she was found dead on Hamptons yacht as owner explains why he was naked\n\nThe Chancellor's lost control: Rachel Reeves accused of presiding over most shambolic Budget in history after humiliating U-turn on income tax hikes\n\nStorm Claudia dumps a month's worth of rain bringing flooding fears while travel chaos hits Britain with cars stranded and trains battered - as search under way for dog swept away in raging river\n\nPolice charge 'fake admiral' Jonathan Carley days after appearance at a Remembrance Sunday event with a chest full of suspicious medals sparked fury\n\nAutopsy reveals the truth about newlywed couple found dead in their car after wife's haunting final post\n\nChildren's book portrays some Picts as black and claims ancient Scotland was 'multi-cultural and diverse'\n\nMoD launch probe into 'fake' admiral at Remembrance Sunday event wearing suspicious rare medal\n\nNotorious influencer HSTikkyTokky, 24, is spared prison after crashing £230,000 McLaren supercar and fleeing the country\n\nThe glaring red flags that gave away 'fake' admiral as top ex-Army colonel reveals the mindset behind Britain's highest ranking Walter Mittys\n\nCouncil loses bid to stop 'excessive' number of asylum seekers being housed in city\n\nJamie Redknapp sues small eco-surf shop over claim Sandbanks name is too similar to his posh recycled clothing brand\n\nCops shoot and wound knifeman who threatened to kill his wife and children in Paris train station - but accidentally also shoot passer-by in the foot\n\nFailed asylum seeker from Egypt is remanded in custody accused of raping woman aged in her 30s in a Bournemouth woodland\n\nQueen Letizia's changing face: Spanish royal, 53, unveils 'sculpted' new look\n\nPrince Harry and Meghan Markle pose with celebrity psychic and send her a quasi-royal letter with the Duchess' royal cypher - before hinting at an upcoming trip\n\n'Tent village' with 30 rough sleepers pops up on famous London street lined with West End theatres and £800-a-night Savoy hotel\n\nMOST READ IN DETAIL\n\nADVERTORIAL FEATURES\n\nHurtigruten is one of the world's great journeys, sailing and caring for the Norwegian coast since 1893.\n\nLEARN MORE >\n\nNEW ARTICLESHomeTop\n\nFollow us on: \n\nBack to top\n\nLeadership Team\nThis is Money\n\nMail Travel\nAbout Daily Mail\n\nTerms of Use\n\nWebsite Terms\nPrivacy Settings\nPrivacy Policy\nSubscription Terms & Conditions\nDo not sell or share my personal information\nContributors\nAdditional Cookie Information\n\nGet in Touch\n\nHow to complain\nWork with us\nAdvertise with us\nDaily Mail Subscriptions Help & FAQs\n\nVideo Archive\n\nTopics Index\nText-Based Site\n© 2025 Associated Newspapers Limited\n\nAdvertisement\n\nAdvertisement","summary":"The 32-year-old pop star was bombarded by an overzealous fan while walking the red carpet at the Singapore premiere of Wicked: For Good on Thursday.","url":"https://www.dailymail.co.uk/tvshowbiz/article-15292833/ariana-grande-wicked-ambush-fan.html","image":"https://i.dailymail.co.uk/1s/2025/11/14/22/103899027-0-image-m-32_1763158687585.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/11/14/7891053121034170583/1024x576_MP4_7891053121034170583.mp4","publish_date":"2025-11-15 00:38:58","author":"Ashleigh Gray,Editor","authors":["Ashleigh Gray","Editor"],"language":"en","category":"entertainment","source_country":"gb","sentiment":0.141},{"id":379142612,"title":"China used its trade juggernaut to withstand US tariffs. Can it keep its edge?","text":"As US duties on Chinese imports spun higher and higher earlier this year, Derek Wang braced for major disruption. With US orders ground to a halt, Wang, 36, who sells intelligent cookware out of southern China’s Guangdong province, looked elsewhere to fill the gap. After finding new buyers in Brazil, Japan, Malaysia and Cambodia, he learned what he describes as a key lesson: “Nothing is more important than the markets close to us.” Stories like Wang’s have played out across China’s vast economy where businesses, large and small, scrambled to fill the void after temporary triple-digit duties – and the threat of their return – upended Chinese exports to the world’s wealthiest market. The result has been a coup for China’s trade juggernaut. Instead of seeing exports falter on lost US business, the world’s largest manufacturer has driven them deeper into other markets around the world – building on the country’s global economic footprint and hedges companies made during Trump’s first trade war. The resilience gave Beijing confidence in its months-long negotiations with the US, which came to a head in October when leaders Donald Trump and Xi Jinping met and agreed to a truce that whittles new tariffs on Chinese goods down to 20%. But the push also puts China on track to eclipse last year’s gaping nearly $1 trillion global trade surplus – a balance that’s irritated governments around the world and sparked Trump’s trade war in the first place. There were already questions about the sustainability of China’s export blitz before data released last week showed exports unexpectedly contracted by just over 1% year on year in October – the first downturn since February. Whether China can maintain its level of exports to the rest of the world – and expand back into the US market after the recent truce, is a consequential question for the world’s second-largest economy as it continues to struggle with lackluster demand from its own consumers, but doubles down on manufacturing as its economic cornerstone. China’s trade resilience So far this year, the shift in China’s export flows has been stark – and sent a clear message that, for China, the US is not irreplaceable. While exports to the US dropped nearly 18% in the first 10 months of this year versus that period in 2024, they were up more than 7% to the European Union, 14% to countries in the Association of Southeast Asian Nations, and 26% to Africa, according to Chinese customs data released last week. Overall, exports rose 5.3%. In Southeast Asia, that trade was buoyed by leaps in the export of machine tools, automobile parts and computer components. In Africa, construction machinery and green technologies have been key exports, analysts say, while parts of Latin America have seen significant growth in electric vehicles, chemical fertilizers and electronics, among other areas. This trade engine was humming before the start of the trade war. Already the world’s manufacturing superpower, China’s rapid climb to dominate green technologies like EVs, lithium-ion batteries, and solar panels, had driven up demand from countries looking to convert to renewable energy cheaply – and concern from those accusing China of unfair competition with subsidized products. Some of those goods – like EVs and solar panels – were already effectively barred from the US market by high tariffs put in place in recent years, and China’s exporters have been building out trade across developing markets. “(China) has prepared quite well for this,” said Jacob Gunter, who heads the economy and industry program at the MERICS think tank in Berlin. “It wasn’t some miracle of foresight thinking to predict that the United States would escalate over time its trade and technology conflict with China, but China was (expanding markets) before the trade and tech war began, and ever since it’s started, that trend has really accelerated,” he said. Even as many companies had to scramble to divert business from the US market in recent months, experts say the groundwork for the pivot was laid by Beijing’s decades-long push to build out its global economic footprint – expanding trade while also bankrolling ports, terminals and highways under Xi’s Belt and Road Initiative. It’s also relied on an earlier push from Chinese firms to move supply chains and production centers out of China to areas from Southeast Asia to Mexico – where goods are shipped from China to be fabricated or finished. “That’s the key for the so-called resilience of Chinese exports,” said Yao Yang, dean of the Di-shui-hu Advanced Finance Institute at the Shanghai University of Finance and Economics, who noted these investments began during Trump’s first term. “Without those outbound investments, I don’t think that China can cope with the shock.” A two-way street? But Beijing’s trade resilience has also raised fears that a deluge of Chinese goods into other markets will wipe out domestic industries. Countries have been hitting back with probes on Chinese goods, with the US and India, as well as Mexico and Brazil, together raising 79 anti-dumping and countervailing probes against Chinese goods in the first half of this year – a significant uptick from recent years before 2024, according to World Trade Organization data. There’s also calls for exports or factory relocations to come alongside greater levels of local investment, knowledge transfer and more balanced trade. For some Latin American countries, “deindustrialization is a big problem when Chinese companies start to invest … because they bring just the assembly, they don’t do technology and knowledge transfer,” said Diego Rodriguez, logistics and industrial practice leader at Americas Market Intelligence, a research firm in Miami, noting countries like Brazil are pushing back against this. In Southeast Asia, the stronger flow of goods is a concern, according to Rebecca Sta Maria, former executive director of the Asia-Pacific Economic Cooperation secretariat. “We feel as if we are being swamped. I remember one economy saying a ‘tsunami of Chinese goods coming into ASEAN.’ Of course that’s a concern to us,” said Sta Maria, now the director of the Institute for Democracy and Economic Affairs in Kuala Lumpur. But it wasn’t all negative, she added, because small and medium-sized businesses were using high-end components from China, making their products more competitive. “I know that the Chinese government has acknowledged (the concern) to some extent, so now it’s how do we manage this?” Beijing denies accusations that its goods are flooding markets. Its officials have instead taken Trump’s global trade shake-up as an opportunity to tout China as the reliable trade partner, while pledging to open its vast market wider to exporters and investors from around the world. Observers say some countries may also be unwilling to throw up barriers to China at a time when they are facing higher tariffs on their own goods into the US – that’s especially when there is true demand in many countries. In Africa, “it’s a two-way street,” said Capital Economics emerging market analyst David Omojomolo. “These countries (in Africa) want to industrialize… there’s a massive electricity gap across the continent – solar panels are cheap and China’s got overcapacity … they need to send them somewhere, so of course, Africa is going to benefit.” ‘Getting squeezed’ Even still, manufacturers across China have struggled to fill the hole left by the drop in US exports. Factory employees in recent months have described to CNN canceled shifts, mandatory furloughs and lost jobs as employers deciding to relocate out of China. Garment maker Zhang Peipei in Jiangxi province told CNN she has been able to keep her 20-year-old business afloat through smaller revenue streams coming from outside the US. But she says the unpredictable US tariff policies have already caused “serious and irreversible long-term impact” without clear alternatives. With her business now hanging on whether she can cut a deal with buyers in Mexico, Zhang said she didn’t feel “very confident,” even despite a potential return of some US business now, “since the US has been shaking up the foreign trade scene, the whole world is chaotic right now.” And there are questions about whether China’s robust trade data this year showed true demand or a short-term push to get goods out of the country to stockpile them or ship them to the US via a third country with lower tariffs. An analysis of US and Chinese trade data from April to July – including the height of the trade uncertainty – suggests that just less than a quarter of China’s trade diverted from the US was likely still ultimately ending up in the US, while the rest of the goods were finding alternative markets, according to Gerard DiPippo, a senior researcher at the RAND China Research Center. “Still, l’m not all that confident that the final demand for all those (other) exports going to the Global South is actually going to be remaining in those countries,” he said, noting that exporters could also be building up offshore inventories as they waited to see how countries’ trade talks with the US played out. “The big caveat,” he added, is that “the margins of Chinese exporters are almost certainly getting squeezed … they’re maintaining high volumes in real terms, but they’re doing it by cutting prices.” The recent truce between Xi and Trump leaves tariffs on Chinese goods at around 47% on average, but could see the return of more US business. But as uncertainty remains across the global economy, a driving focus for those in China, both in the factories and the government, will be on expanding how much the country’s own consumers buy domestic-made goods. That’s the case for Wang, the cookware maker in Guangdong. Despite finding new clients outside the US, he is also making another pivot, directing more of his business to China’s domestic market, and less of it outside, he said.","url":"https://edition.cnn.com/2025/11/14/china/china-us-trade-war-global-exports-intl-hnk-dst","image":"https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2240481465-20251113064908184.jpg?c=16x9&q=w_800,c_fill","video":null,"publish_date":"2025-11-15 00:37:51","author":"Joyce Jiang,Simone McCarthy","authors":["Joyce Jiang","Simone McCarthy"],"language":"en","source_country":"us","sentiment":0.165},{"id":379144026,"title":"What will the federal government&apos;s Major Projects Office do — and will it succeed?","text":"Prime Minister Mark Carney announced this week a second round of projects he's recommending get fast-tracked by his government's Major Projects Office (MPO) as part of his promise to reduce Canada’s economic reliance on the United States.\n\nThursday’s announcement saw multibillion-dollar energy and natural resources proposals brought to the top of the pile, but there are still questions about what a referral to the MPO actually means.\n\nPart of the confusion lies in the government’s choice of language. So far, Carney has referred projects to the MPO that he’s deemed of “national importance” or “national significance.\"\n\nNone of the projects — at least not yet — have been slapped with the “national interest” label, a new (and controversial) designation that would essentially allow the federal cabinet to sidestep certain laws to ram a project forward in the name of spurring economic growth on home soil.\n\nMany of the projects heading to the MPO for approval are also well into development, raising the question: So what’s the point, and what happens now? \n\nWith the agency still in its infancy, there’s still a big question mark hanging over whether the Major Project Office process — one of Carney's signature policy proposals — will work.\n\nEven Carney himself cautioned that referring a project to the MPO “does not mean the project is approved.\"\n\n“It means that all the efforts are being put in place from the federal government in order to create the conditions, so it could move forward,” he said Thursday. “But those decisions are taken by many parties, including very much First Nations.”\n\nWith U.S. President Donald Trump’s tariffs causing trading uncertainty, the MPO has been pitched as a clearing house to get projects built faster in Canada.\n\nAccording to the Major Project Office, once it receives a proposal, it works with proponents, provinces and territories, and Indigenous people to find the “right way forward.\"\n\nThat could include focusing on streamlining permitting processes, addressing regulatory challenges, structuring financing and trying to reduce risks for projects.\n\nProjects completed 'on time and on budget' \n\nAsked for clarity on Thursday, Dawn Farrell, the MPO's president and CEO, said her office will shepherd the projects across the finish line “on time and on budget.\"\n\n“There's a lot of work as you get to the end of the line and you need to pull things over,” she said.\n\nFarrell pointed to the recently announced Crawford nickel project in Timmins, Ont., as an example. Canada Nickel Company proposes to build a mine capable of producing 240,000 tonnes of ore per day.\n\nShe said her office will work with the company to get its permitting down “in parallel” and not “sequentially.\"\n\n“So something that might have taken five or six more years can now take two years,” Farrell, the former head of Trans Mountain Corp., said. \n\nThe MPO is also working with proponents and the Canada Infrastructure Bank and the Canada Growth Fund, two of the federal government’s project-financing vectors, to create certainty in financing.\n\nFor example, it was announced on Thursday that the Canada Infrastructure Bank will loan B.C. Hydro’s North Coast Transmission Line proposal some $139 million to help get the project built.\n\n“And then the tough stuff is to ensure that when they get into the construction component of it, that we work with our labour group to make sure there's availability of labour,” Farrell said.\n\n“That the way that the permitting happens during construction works in a very slick and efficient way so that we can do the construction and build the projects in the time frame that they should be built in without cutting corners.\n\nChosen projects can sidestep usual legal rules \n\nFarrell's office could also review a proposal and determine whether it would benefit from the “national interest” designation under Bill C-5’s fast-tracking provisions.\n\nThe Building Canada Act essentially gives cabinet the power to allow chosen projects to sidestep the normal legal requirements — including the Fisheries Act, the Species At Risk Act and the Impact Assessment Act — in the name of the national interest.\n\nCanada Nickel CEO Mark Selby said on Thursday that referring his mine to the MPO \"puts us in the fast lane” even without the special national interest label.\n\n\"We probably won’t be designated, we’ll be just referred, and work through the permitting process, but it should put us at the front of the line to work through specific permits and issues that may come up,\" he said.\n\nThe bill flew through Parliament in the spring before receiving royal assent in June, garnering backlash from the opposition parties and Indigenous communities about giving government decision-making power when it comes to natural resource projects.\n\nSome environmental critics suggested the powers granted to cabinet were undemocratic and “undermine constitutional principles.” \n\nCarney adding bureaucracy: Poilievre \n\nNot everyone is convinced the MPO will work.\n\nConservative Leader Pierre Poilievre said Canada's permitting process remains \"uncompetitive\" and argued Carney's stated commitment to fast-track development won't untangle the red tape.\n\n\"Mark Carney's solution? Add another bureaucracy. He's created yet another bureaucracy, a new bureaucratic hurdle for miners and oil and gas enterprises and other resource companies to jump through in order to get anything approved,\" Poilievre told reporters in Kelowna, B.C., on Thursday.\n\n\"And yet again, today, instead of getting things done, Mark Carney was standing up doing photo ops announcing that he's going to approve a bunch of projects that were already going to happen.\"\n\nHere are the six latest projects and one concept being referred to the MPO:\n\nThe Sisson Mine, for critical minerals, in New Brunswick.The Crawford nickel project in Ontario.The Ksi Lisims liquefied natural gas project in British Columbia.An Iqaluit hydro project.The Nouveau Monde Graphite Phase 2 project in Quebec.The Northwest Critical Conservation Corridor in northwest B.C. and Yukon., which could include critical minerals and clean power transmission developments in the area.The North Coast Transmission Line in northwest B.C.\n\nThey follow the first five projects Carney recommended in September. They include:\n\nPhase 2 of LNG Canada in Kitimat, B.C., doubling its production of liquefied natural gas.The Darlington New Nuclear Project in Clarington, Ont., which will make small modular reactors.The Contrecoeur Terminal container project to expand the Port of Montreal.The McIlvenna Bay Foran copper mine project in Saskatchewan. The expansion of the Red Chris Mine in northwestern B.C.\n\nThere's also another category of proposals, deemed “transformative” projects, that require further development before approval. So far that list includes an upgrade to the Port of Churchill and high-speed rail between Toronto and Quebec City.\n\nThe seven initiatives announced Thursday, combined with the five Carney recommended for approval in September, are worth a combined $116 billion to the economy, according to government figures.","url":"https://www.cbc.ca/news/politics/major-projects-office-carney-9.6979717","image":"https://i.cbc.ca/ais/c75b0e2f-7e05-4ef6-9665-f0f0ab1eeff9,1763156194466/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C390%2C7486%2C4210%29%3B","video":null,"publish_date":"2025-11-15 00:36:28","author":"Catharine Tunney","authors":["Catharine Tunney"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.171},{"id":379141008,"title":"Trump says US will test nuclear weapons like other countries","text":"Trump says US will test nuclear weapons like other countriesThe United States will test nuclear weapons like other countries do, President Donald Trump said on Friday, but declined to say if the plans included exploding a nuclear warhead.\n\nI don't want to tell...","url":"https://www.marketscreener.com/news/trump-says-us-will-test-nuclear-weapons-like-other-countries-ce7d5fd2d189f124","image":"https://cdn.zonebourse.com/static/resize/1200/675//images/reuters/2025-03-13T172638Z_1_LYNXMPEL2C0VY_RTROPTP_3_BUSINESS-FRANCE.JPG","video":null,"publish_date":"2025-11-15 00:35:14","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.456},{"id":379141556,"title":"Senator Cory Booker Addresses Questions on Chuck Schumer’s Future with Confidence","text":"Senator Cory Booker of New Jersey has recently brought to light a topic that many Democrats have been quietly contemplating: the future of Senate Minority Leader Chuck Schumer from New York. In the aftermath of what has been termed the “Schumer Shutdown,” Booker candidly addressed the need for change within the Democratic Party, something others have been hesitant to discuss openly.\n\nIn an interview with Fox News, Booker was questioned about his remarks following the House’s approval of an amended continuing resolution, which facilitated the end of the government shutdown. In his comments, Booker emphasized that the Democratic Party is in need of transformation and should look to a new generation of leaders to challenge then-President Donald Trump.\n\nWhen pressed by the reporter on whether his statements were specifically aimed at Schumer, and if he believed the veteran senator was still capable of fulfilling his role, Booker responded thoughtfully.\n\n“Chuck Schumer’s generation, along with those of Nancy Pelosi and John Lewis, have achieved much to be proud of,” Booker acknowledged. “However, it is time for fresh leadership to emerge.”\n\nThis sentiment reflects a growing call within the party for rejuvenation, as many Democrats consider how to best position themselves against Republican leadership and policies.\n\n“Chuck Schumer’s generation, Nancy Pelosi’s generation, John Lewis’s generation. They have so much to be proud of,” Booker said. “It is time, though, for new leadership.”\n\nBoom, there it is. We will at least give credit to the New Jersey senator who showed more courage when asked about Schumer’s future, more so than the likes of New York Representative Alexandria Ocasio-Cortez (D-14), who refused to call him out when asked if Schumer should stay as minority leader, my RedState colleague Nick Arama reported.\n\n🚨They asked AOC if she still wants to get rid of Chuck Schumer.\n“Should Chuck Schumer stay as minority leader?”\nHer answer suggests she wants to take down MORE than just Chuck Schumer.\n“This problem is bigger than one person…” pic.twitter.com/VcSZPeNxza\n— Townhall.com (@townhallcom) November 12, 2025\n\n“Should Schumer stay as minority leader?” the reporter asked.\n\n“I think what is so important for folks to understand is that this problem is bigger than one person,” AOC replied. “And it actually is bigger than the minority leader in the Senate…A leader is a reflection of the party and Senate Democrats have selected their leadership to represent them.”\n\nOn Friday, Massachusetts Representative Seth Moulton (D-6) said Schumer has proven to be ineffective.\n\nOne, Schumer has proven to all of us that he can’t keep the team together,” Moulton said. “But two, Schumer has also proven to Trump that his strong-arm tactics work. And so until Trump sees a different opponent, he’s going to just assume this playbook for the next time a negotiation like this comes up.”\n\nChuck Schumer needs to be replaced as the party’s Senate leader, @RepMoulton tells our @DashaBurns on #theconversation.\nHear more of Moulton’s views on the party’s future and its strategy on health care in this week’s episode — out now: pic.twitter.com/M944EgYGNi\n— POLITICO (@politico) November 14, 2025\n\nSEE: Watch: Trump Signs House-Passed, Short-Term CR, Ending the Schumer Shutdown\n\nALSO: Holy Smokes: Trump Makes Good on Promise to Those Who Worked During Schumer Shutdown\n\nA new CNN poll from the network’s data guru, Harry Enten, also proved Schumer’s days with the party are likely numbered.\n\nWATCH: CNN’s poll shows Chuck Schumer’s popularity is at a RECORD LOW for Democrat Senate leaders since 1985, and he’s trailing AOC by DOUBLE DIGITS in a potential primary. pic.twitter.com/NdxFyveTxy\n— Mercedes Schlapp (@mercedesschlapp) November 13, 2025\n\nEnten said the poll showed that Democrats are feeling “terrible” about Schumer’s leadership.\n\nCNN’s poll shows Chuck Schumer’s popularity is at a RECORD LOW for Democrat Senate leaders since 1985, and he’s trailing AOC by DOUBLE DIGITS in a potential primary.\n\nOne by one, Dems are starting to say it rather than obfuscating. Schumer’s days are done. \n\nMy RedState colleague Sister Toldjah reported that the writing was on the wall for Chuck, and things were only going to get worse now that the shutdown is over. \n\nAs RedState readers will recall, there were calls in early 2025 for a 2028 primary challenge to Schumer, with Rep. Alexandria Ocasio-Cortez (NY-14) being floated as a formidable contender.\nThose calls got louder when Schumer caved on the continuing resolution in March, with things getting so bad for Schumer that he had to postpone book tour dates due to alleged security threats.\nWhile AOC has dodged questions about a Schumer challenge, she hasn’t expressly stated that she’s ruled one out, either. And after eight Democrats on the Senate side broke ranks to begin the process of ending the Schumer Shutdown, one has to think AOC is giving the idea even more consideration.\n\nOh, you hate to see it happen, right? Nah.\n\nEditor’s Note: Do you enjoy RedState’s conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\n\nJoin RedState VIP and use the promo code FIGHT to get 60% off your VIP membership!","summary":"Internewscast Journal\n\nInternewscast\n\n\nSenator Cory Booker of New Jersey has recently brought to light a&#8230;\n\n\nThis Post: Senator Cory Booker Addresses Questions on Chuck Schumer&#8217;s Future with Confidence first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/senator-cory-booker-addresses-questions-on-chuck-schumers-future-with-confidence/","image":"https://internewscast.com/wp-content/uploads/2025/11/Dem-Sen-Cory-Booker-Does-Not-Shy-Away-From-Answering.png","video":null,"publish_date":"2025-11-15 00:35:11","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.081},{"id":379141280,"title":"Georgia judge drops 3 charges in Trump election interference case","text":"A judge in Georgia has dropped three charges in the 2020 election interference case against President Donald Trump and others.\n\nTrump was charged with two of the counts that were dropped by Fulton County Superior Court Judge Scott McAfee on Friday. The charges related to filing false documents. \n\n'We remain confident that a fair and impartial review will lead to a dismissal of the case against President Trump.' \n\nMcAfee had previously dropped six counts in the same indictment in March 2024, including three charges against Trump.\n\n\"This politically charged prosecution has to come to an end. We remain confident that a fair and impartial review will lead to a dismissal of the case against President Trump,\" said Trump's attorney Steve Sadow on Friday.\n\nThe case also received a new top prosecutor Friday after Fulton County District Attorney Fani Willis was disqualified from the case after it was discovered that she had an affair with special prosecutor Nathan Wade. He has also stepped down from the case.\n\nPeter Skandalakis, the director of the Prosecuting Attorneys Council of Georgia, appointed himself in the position to replace Willis. Had he not done so, the case would have had to be dropped by the Friday deadline set by McAfee.\n\n\"I am keenly aware that this matter has been of significant public interest since January 2021, when District Attorney Fani Willis announced the initiation of the investigation,\" said Skandalakis. \"My only objective is to ensure that this case is handled properly, fairly, and with full transparency discharging my duties without fear, favor, or affection.\" \n\nRELATED: Former Trump lawyer Jenna Ellis agrees to plea deal in Georgia election interference case\n\nOn Monday the administration announced full pardons for some of those indicted in the Georgia case, but Skandalakis said the presidential pardons apply only to federal charges and do not affect the state case.\n\nThirty-two counts remain in the election interference case. The president has pleaded not guilty.\n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/georgia-judge-drops-trump-interference","image":"https://www.theblaze.com/media-library/georgia-judge-drops-3-charges-in-trump-election-interference-case.jpg?id=62186539&width=1200&height=600&coordinates=0%2C78%2C0%2C79","video":null,"publish_date":"2025-11-15 00:35:00","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":-0.42},{"id":379142024,"title":"Trump scraps tariffs on beef, coffee, tropical fruit in a push to lower grocery store prices","text":"WASHINGTON -- President Donald Trump announced Friday that he was scrapping U.S. tariffs on beef, coffee, tropical fruits and a broad swath of other commodities - a dramatic move that comes amid mounting pressure on his administration to better combat high consumer prices.\n\nTrump has built his second term around imposing steep levies on goods imported into the U.S. in hopes of encouraging domestic production and lifting the U.S. economy. His abrupt retreat from his signature tariff policy on so many staples key to the American diet is significant, and it comes after voters in off-year elections this month cited economic concerns as their top issue, resulting in big wins for Democrats in Virginia, New Jersey and other key races around the country.\n\nInflation, despite Trump's pronouncements that it has vanished since he took office in January, remains elevated, further increasing pressure on U.S. consumers.\n\nThe Trump administration has insisted that its tariffs had helped fill government coffers and weren't a major factor in higher prices at grocery stores around the country. But Democrats were quick to paint Friday's move as an acknowledgement that Trump's policies were hurting American pocketbooks.\n\n\"President Trump is finally admitting what we always knew: his tariffs are raising prices for the American people,\" Virginia Democratic Rep. Don Beyer said in a statement. \"After getting drubbed in recent elections because of voters' fury that Trump has broken his promises to fix inflation, the White House is trying to cast this tariff retreat as a 'pivot to affordability.'\"\n\nTrump slapped tariffs on most countries around the globe in April. He and his administration still say that tariffs don't increase consumer prices, despite economic evidence to the contrary.\n\nRecord-high beef prices have been a particular concern, and Trump had said he intended to take action to try and lower them. Trump's tariffs on Brazil, a major beef exporter, had been a factor.\n\nTrump signed an executive order that also removes tariffs on tea, fruit juice, cocoa, spices, bananas, oranges, tomatoes and certain fertilizers. Some of the products covered aren't produced in the United States, meaning that tariffs meant to spur domestic production had little effect. But reducing the tariffs will still likely mean lower prices for U.S. consumers.\n\nThe Food Industry Association, which represents retailers, producers and a variety of related industry firms and services, applauded Trump's move to provide \"swift tariff relief,\" noting that import U.S. taxes \"are an important factor\" in a \"complex mix\" of supply chain issues.\n\n\"President Trump's proclamation to reduce tariffs on a substantial volume of food imports is a critical step ensuring continued adequate supply at prices consumers can afford,\" the association said in a statement.\n\nIn explaining the tariff reductions, the White House said Friday that some of the original levies Trump relished imposing on nearly every country on earth months ago were actually no longer necessary given the trade agreements he'd since hammered out with key U.S. trading partners.\n\nIndeed, Friday's announcement follows the Trump administration having reached framework agreements with Ecuador, Guatemala, El Salvador and Argentina meant to increase the ability of U.S. firms to sell industrial and agricultural products in these countries, while also potentially easing tariffs on agricultural products produced there.\n\nDuring an interview that aired earlier in the week with Laura Ingraham of Fox News Channel, Trump hinted that lower tariffs might be coming.\n\n\"Coffee, we're going to lower some tariffs,\" the president said then. \"We're going to have some coffee come in.\"","url":"https://abc13.com/post/trump-scraps-tariffs-beef-coffee-tropical-fruit-push-lower-grocery-store-prices/18156416/","image":"https://cdn.abcotvs.com/dip/images/18156425_AP25318844750951.jpg?w=1600","video":null,"publish_date":"2025-11-15 00:34:24","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.009},{"id":379090858,"title":"Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n State Ministers Abka Fitz-Henley, Rhoda Crawford and Marisa Dalrymple-Philibert on Friday delivered thousands of care-packages and housing relief supplies to sections of the parish. \n\n Latest News, News \n\nNovember 14, 2025\n\n\n\n\n Fitz-Henley, Crawford, Dalrymple-Philibert deliver thousands of relief supplies to Trelawny \n\n\n\n\n\n\n\nTRELAWNY, Jamaica —Moved by scenes of devastation across sections of Trelawny which have been impacted by Hurricane Melissa, state ministers Abka Fitz-Henley, Rhoda Crawford and Marisa Dalrymple-Philibert on Friday delivered thousands of care-packages and housing relief supplies to sections of the parish.\n\nCrawford and Fitz-Henley spoke to the Observer Online while working in the community of Woodgrove in Trelawny South which is represented in Parliament by Dalrymple-Philibert who received both her colleagues on Friday.\n\n“I think Westmoreland, St Elizabeth and St James have dominated the national conversation in terms of places worst affected by Melissa but I can tell you Trelawny is also in great need. We have heard the calls for help and are doing our part. Our prime minister has been particular about directing members of the executive to identify areas which have not received assistance and to do what we can to fill the gap,” Fitz-Henley shared.\n\nCrawford said the scenes of devastation left her feeling pensive but determined to do all she can to assist in efforts to rebuild.\n\n“A collective effort is what is required to assist our people to navigate daily challenges and we all have to do our part. Of course, the national conversation is shifting to efforts to assist our people to rebuild in a sustainable manner and that too requires all hands on board. What the people can be assured of is that our Government will do its part.\n\nBoth ministers commended Cabinet Minister Dr Andrew Wheatley who added scores of large care-packages to the supplies they handed out on Friday.\n\n“Dr Wheatley’s move to assist from his own personal resources is what it is all about. Those of us who can help must help. I know the state agencies are working hard and doing their part in a major way but on a personal and individual level I am a strong believer that there are some of us who can do our part to bring comfort to our fellow Jamaicans who have been significantly inconvenienced by Melissa and we must do it,” Fitz-Henley reiterated.\n\n\n\n\n\n\n\n\nTags: Abka Fitz-Henley Marisa Dalrymple-Philibert Rhoda Crawford Trelawny \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n MoBay christmas tree-lighting ceremony to be scaled down \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST JAMES, Jamaica — Mayor of Montego Bay, Councillor Richard Vernon, says this year’s Christmas tree-lighting event in the city will be scaled down, r... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump demands probe into Epstein links to Bill Clinton \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump said Friday he wants the Justice Department and FBI to investigate links between the late al... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n ‘Tinder Swindler’ Simon Leviev freed in Georgia \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n TBILISI, Georgia (AFP) — Israeli fraudster Simon Leviev, made famous by the Netflix documentary The Tinder Swindler, has been released in Georgia afte... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Epstein’s emails reveal network of powerful contacts \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n WASHINGTON, United States (AFP)—The latest batch from convicted sex offender Jeffrey Epstein's emails illustrates the extraordinary scope of his conta... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Residents urged to avoid direct contact with rising floodwaters in Content \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n MANCHESTER, Jamaica —The Manchester Health Department (MHD) is advising members of the public to avoid direct contact with the rising floodwaters in C... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Man killed, woman injured in Bull Bay domestic dispute \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n ST ANDREW, Jamaica – A man was shot dead and a woman injured during a domestic dispute at Jackvale district in 11 Miles, Bull Bay, St Andrew, on Thurs... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Sports \n\n\n\n\n\n\n\n\n\n Reggae Boyz ratings vs T&T: High marks for Cephas, but 4 and 5s awarded after poor showing \n\n\n\n\n\n\n\nNovember 14, 2025 \n\n\n The Reggae Boyz had to settle for a 1-1 draw away to regional rivals Trinidad & Tobago in their Concacaf World Cup qualifier on Thursday, a result tha... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/14/fitz-henley-crawford-dalrymple-philibert-deliver-thousands-relief-supplies-trelawny/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/WhatsApp-Image-2025-11-14-at-13.54.32_3360342c-1024x768.jpg","video":null,"publish_date":"2025-11-15 00:34:15","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":0.302},{"id":379141844,"title":"Australian exports now exempt from Trump tariff in beefy backflip","text":"Billions of dollars worth of Australian exports, including beef, have been exempted from Donald Trump&apos;s sweeping \"liberation day\" tariff regime and will no longer be subject to a global baseline duty. The shock move was confirmed in an executive order issued by the White House on Saturday morning (AEDT) that revealed a range of agricultural imports, including red meat, coffee, tea, bananas, oranges, tomatoes and fertilisers, would now be carved from the program. The order also said that the overturning of the tariffs would be retroactive, meaning importers will receive a refund on the duties they have been paying for several months. The Trump administration made the decision, which marks a significant pivot in US trade policy, following growing domestic criticism that the duties were pushing up grocery prices in the US and placing an increasing number of Americans under cost-of-living pressures. While the rollback could provide some breathing room for US consumers, it is not immediately clear what the impacts will be for Australian exporters as the global food trade architecture continues to shift. However, data supplied by the Department of Foreign Affairs and Trade shows Australian companies sold a record $6.9 billion of goods to the US in the three months to September, and after the tariffs began, an increase on the $5.8 billion at the corresponding time last year when the tariffs were not in effect. The statistics revealed beef exports hit $1.6 billion in the same period, a 26 per cent increase. President Trump&apos;s snap decision will take effect at midnight on Thursday US time and follows the US Supreme Court hearing arguments this week that the duties had overstepped federal law. It also comes after the framework trade deals were signed on Thursday that effectively eliminated US tariffs on a range of products from four South American countries, including Argentina. In a factsheet accompanying the decision released on Saturday morning, the tariff rollback was explained as a strategic realignment that sought to strengthen the U.S. economy and national security, \"by modifying the scope of the reciprocal tariffs ... given the substantial progress in reciprocal trade negotiations\". However, the pressure on the White House to make the move was dialling up following a string of recent Democratic victories in state and local elections that ran with anti-inflation, cost-of-living campaigns. In a statement released on Saturday, Democrat and House of Representatives Ways and Means Committee member Richard Neal said the President was \"finally admitting publicly\" that his trade war was \"hiking costs on people\". President Trump has repeatedly insisted that the imposts were not responsible for fuelling inflation, instead laying blame on the policies of the previous Democratic US President Joe Biden. On April 1, President Trump announced that his baseline \"universal\" tariff for goods entering the United States would sit at 10 per cent for most countries, while \"selected partners\" were hit with a battery of higher rates that \"further address our exploding, annual U.S. goods trade deficits\". He has since used the duties to both underpin his administration&apos;s domestic economic agenda and as a sledgehammer to be wielded during foreign policy discussions. In the process, he turned the finger of blame on Canberra in suggesting US farmers were effectively banned from selling beef into Australia due to rule changes made following a mad cow disease outbreak in 2023 that he said equated to unfair trading practices. While any restrictions were technically lifted in 2019, American beef was caught up in the integration of the US, Mexico, and Canadian supply chains and traceability concerns in the situation where beef was being sourced from the latter two nations but slaughtered in the US.","url":"https://www.farmonline.com.au/story/9112349/australian-exports-now-exempt-from-trump-tariff-in-beefy-backflip/","image":"/images/transform/v1/crop/frm/230597393/6fb42d3e-309e-405b-b493-c5bbadf6a8bb.jpg/r307_204_3694_2462_w4000_h2667_fmax.jpg","video":null,"publish_date":"2025-11-15 00:32:00","author":"Jason Gregory","authors":["Jason Gregory"],"language":"en","source_country":"au","sentiment":-0.167},{"id":379139194,"title":"Trump reverses tariffs on dozens of food products as 'affordability crisis' engulfs US economy","text":"In a major turn of events, US President Donald Trump signed an executive order allowing a range of food products, including coffee, bananas and beef, to escape the sweeping tariffs he introduced earlier this year. The move came as his administration faces mounting pressure over rising prices.\nWhile Trump previously downplayed what many have been calling an “ affordability crisis”, he started to focus on the issue ever since his Republican Party lost polls in several states in last week’s elections. On Friday, White House shared a list of dozens of products exempted from tariffs, which included avocados, tomatoes, coconuts and mangoes.\nSTORY CONTINUES BELOW THIS AD In the announcement, the Trump administration argued that these goods are exempted because they cannot be produced in sufficient quantities domestically. Trump has long argued that his tariffs would not lead to a major increase in prices for US consumers. He also argued the affordability crisis was a “new word” and a “con job” by Democrats.\nMore from United States Of America Trump calls affordability crisis a ‘con job by the Democrats’ but it’s making his camp nervous Have Republicans had enough? Is Trump facing his biggest rebellion yet over Epstein Files? Why the reversal matters The latest exemption signalled that the Trump administration seeks to lower prices by walking back levies on some food staples. Ever since Trump introduced the tariffs, economists have warned that companies would pass the cost of tariffs onto their customers in the form of higher prices.\nWhile inflation in the United States remained milder than many analysts had expected in September, most items tracked in the Department of Labour inflation report showed price increases, with groceries up 2.7 per cent from last year.\nAccording to the White House statement, the Trump administration’s new tariff exemptions for food products would take effect retroactively at midnight on Thursday, 13 November. In another move to address concerns among consumers about grocery prices, the Trump administration said import taxes on coffee and bananas will be lowered as part of trade deals with four Latin American countries.\nThe announcement came just days after both Trump and Treasury Secretary Scott Bessent vowed to lower coffee prices, which have jumped about 20 per cent in the US this year.\nQuick Reads View All As Trump weaponises tariff, Fed sees a bigger worry: Not jobs, but rising prices in America Despite a backdown deal, Trump deploys hundreds more National Guard troops in Washington DC","url":"https://www.firstpost.com/world/united-states/trump-reverses-tariffs-on-food-products-coffee-avacados-banana-us-affordability-crisis-inflation-economy-13950844.html","image":"https://images.firstpost.com/uploads/2025/11/tariffs1-2025-11-4c1930f36a70fea33a6e28a20aee7cf3.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2025-11-15 00:31:52","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.023},{"id":379143740,"title":"Trump scraps tariffs on beef, coffee, tropical fruit in a push to lower grocery store prices","text":"WASHINGTON (AP) — President Donald Trump announced Friday that he was scrapping U.S. tariffs on beef, coffee, tropical fruits and a broad swath of other commodities — a dramatic move that comes amid mounting pressure on his administration to better combat high consumer prices.\n\nTrump has built his second term around imposing steep levies on goods imported into the U.S. in hopes of encouraging domestic production and lifting the U.S. economy. His abrupt retreat from his signature tariff policy on so many staples key to the American diet is significant, and it comes after voters in off-year elections this month cited economic concerns as their top issue, resulting in big wins for Democrats in Virginia, New Jersey and other key races around the country.\n\nInflation, despite Trump’s pronouncements that it has vanished since he took office in January, remains elevated, further increasing pressure on U.S. consumers.\n\nThe Trump administration has insisted that its tariffs had helped fill government coffers and weren’t a major factor in higher prices at grocery stores around the country. But Democrats were quick to paint Friday’s move as an acknowledgement that Trump’s policies were hurting American pocketbooks.\n\n“President Trump is finally admitting what we always knew: his tariffs are raising prices for the American people,” Virginia Democratic Rep. Don Beyer said in a statement. “After getting drubbed in recent elections because of voters’ fury that Trump has broken his promises to fix inflation, the White House is trying to cast this tariff retreat as a ‘pivot to affordability.'”\n\nTrump slapped tariffs on most countries around the globe in April. He and his administration still say that tariffs don’t increase consumer prices, despite economic evidence to the contrary.\n\nRecord-high beef prices have been a particular concern, and Trump had said he intended to take action to try and lower them. Trump’s tariffs on Brazil, a major beef exporter, had been a factor.\n\nTrump signed an executive order that also removes tariffs on tea, fruit juice, cocoa, spices, bananas, oranges, tomatoes and certain fertilizers. Some of the products covered aren’t produced in the United States, meaning that tariffs meant to spur domestic production had little effect. But reducing the tariffs will still likely mean lower prices for U.S. consumers.\n\nThe Food Industry Association, which represents retailers, producers and a variety of related industry firms and services, applauded Trump’s move to provide “swift tariff relief,” noting that import U.S. taxes “are an important factor” in a “complex mix” of supply chain issues.\n\n“President Trump’s proclamation to reduce tariffs on a substantial volume of food imports is a critical step ensuring continued adequate supply at prices consumers can afford,” the association said in a statement.\n\nIn explaining the tariff reductions, the White House said Friday that some of the original levies Trump relished imposing on nearly every country on earth months ago were actually no longer necessary given the trade agreements he’d since hammered out with key U.S. trading partners.\n\nIndeed, Friday’s announcement follows the Trump administration having reached framework agreements with Ecuador, Guatemala, El Salvador and Argentina meant to increase the ability of U.S. firms to sell industrial and agricultural products in these countries, while also potentially easing tariffs on agricultural products produced there.\n\nDuring an interview that aired earlier in the week with Laura Ingraham of Fox News Channel, Trump hinted that lower tariffs might be coming.\n\n“Coffee, we’re going to lower some tariffs,” the president said then. “We’re going to have some coffee come in.”\n\n(Copyright (c) 2025 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — President&#160;Donald Trump&#160;announced Friday that he was scrapping&#160;U.S. tariffs&#160;on beef, coffee, tropical fruits and a broad swath of other commodities — a dramatic...","url":"https://whdh.com/news/trump-scraps-tariffs-on-beef-coffee-tropical-fruit-in-a-push-to-lower-grocery-store-prices/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/04/trump_055929.jpg?quality=60&strip=color","video":null,"publish_date":"2025-11-15 00:31:19","author":"Associated Press,Maria D'Agostino","authors":["Associated Press","Maria D'Agostino"],"language":"en","source_country":"us","sentiment":-0.009},{"id":379139824,"title":"Talking Point This Week: Better Than Feared — India Inc's Earnings Trough Looks Over","text":"The week was characterised by victories and defeats. Bihar marked a remarkable result for the BJP and the NDA, and the Day 1 of the India versus South Africa Test is looking good for India. But India Inc has been a winner too, with results looking better than feared. Here are the key talking points of this week:US Markets Have JittersWall Street tumbled and Treasury yields rose on Thursday as expectations of a Federal Reserve interest rate cut next month faded rapidly, while the dollar also fell in a bleak session for most US assets. Bad news for Bitcoin continued as the digital asset continued to sink, diving further below the $100,000 mark thanks to a fresh wave of risk aversion and a selloff in tech stocks. The crypto fell as much as 3.9% to $97,956, intensifying a slump that’s wiped out more than $450 billion in value since early October. One reason could be how a Fed rate cut in December, which was a 90% certainty only a couple of weeks ago according to rates futures markets, is now a coin flip. The rapid shift in market expectations is such that the next fully-priced rate cut isn't until March. Very broadly speaking, a split appears to be forming between Fed governors and regional bank presidents: governors, nominated by the President, are leaning dovish; regional bank presidents, less so.But - One bear has just turned constructive on US exceptionalism:\"The shutdown of the US government could be nearing an end but its effects will delay the market response to bad news about US inflation and employment, which I had been expecting to be this winter’s dominant story. At the same time, the flow of corporate results which ended last week limits the risk of decisively negative business news until the next quarterly reporting season. As a result, the ban on any bad economic news which President Donald Trump tried to impose by firing the head of the Bureau of Labor Statistics has been achieved by other means—and it is hard to imagine what could disturb the markets’ current confidence about the US economy, at least until early next year\"Source - Anatole Kaletsky.Record US Government Shutdown Ends As Trump Signs Spending Bill.India's Earnings Season Ends WellEarnings momentum is firming up, with BSE500 PAT growth at 15.5% YoY versus 11.1% in the previous quarter. We think the earnings trough is behind us, with H2FY26 likely to see further acceleration as GST-driven demand cascades through. One can argue that the possibility of the global backdrop turning constructive is high. FPI flows could return here, on earnings traction and Nifty premium compression (more on that below). In this week, Asian Paints led the paints sector with a robust 47% year-on-year surge in consolidated net profit, bolstered by volume recovery and easing input costs. Tata Steel's consolidated net profit quadrupled, fuelled by higher sales volumes and realisations, though shares dipped marginally on UK operational concerns. Eicher Motors reported a solid 25% profit jump. Voltas faced headwinds, with net profit plummeting 76% on a 10% revenue drop, reflecting seasonal pressures in air conditioning. Retailer Vishal Mega Mart shone brightly, boosting net profit 46% amid improved margins and sales growth. Other notables included Tata Motors swinging to a Rs 867 crore loss in its commercial vehicles unit despite 6% revenue growth, and a broader rally in auto peers like Hero MotoCorp, which posted 15% profit gains. Overall, the earnings painted a mixed canvas of resilience in consumer and metals against pockets of weakness in industrials..Nifty Likely To See Christmas Rally Amid Double-Digit Q3 Growth And Trade Talks, Says Saurabh Mukherjea.Why Indian Markets Look Interestingly PoisedIndian markets have undergone a long period of underperformance. The MSCI India index has underperformed MSCI EM index by approximately 25% on a rolling one-year basis, which is the steepest gap of underperformance in nearly three decades, as per a note put out by Ikigai. Interestingly, while the indices have been well behaved in some cases, the median drawdown for individual stocks is at over 20% vs BSE 500 index drawdown at less than 5%. Post all of this, there are multiple potential triggers:Q2 sets the base for earnings revival in Q3GST cut impact, lower interest rates may lead to consumption-spurt based earnings upsidesPotential trade truce will only aid sentimentPotential AI valuation deflation to augur well for markets like India Population Issues Of Another KindIts not the lone ranger, but China's population decline is a standout story, having declined for three straight years. There are others like Italy, and others which are also in the same boat. In China's case, this has prompted the government to conduct state-sponsored events like collective weddings to promote 'family values'. The government has introduced policies such as cash rewards for families with multiple children to encourage people to have more kids, but the cost of raising a child in China is high, estimated to be over 538,000 yuan to age 18, as per Bloomberg. Incidentally, Elon Musk made a post on his social media platform 'X' drawing attention to Italy's ongoing aging demographic crisis on Thursday. He quote reposted saying \"Italy is disappearing\" to a post from another user who highlighted how \"Italy’s birth rate has dropped to a record low of 1.13 children per woman with only 370,000 babies born last year, the lowest since 1861\".As we wrap, for 'The Big Short' fans, there was a short goodbye from the Big Short. Michael Burry, the 'Big Short' investor who made his fame and fortune betting against the US housing market in the mid-2000s, is closing his hedge fund. In a letter to investors dated Oct. 27, Burry said he would liquidate the funds and return capital, \"but for a small audit/tax holdback\" by the end of the year. Burry has stepped up criticism of technology heavyweights, including Nvidia and Palantir Technologies, in recent weeks, questioning the cloud infrastructure boom and accusing major providers of using aggressive accounting to inflate profits from their massive hardware investments. Lets see if this turns out to be prophetic..Big Short Redux: After Michael Burry, Deutsche Bank Is Shorting The ‘AI Bubble’","summary":"Earnings momentum is firming up, with BSE500 PAT growth at 15.5% YoY versus 11.1% in the previous quarter.","url":"https://www.ndtvprofit.com/opinion/talking-point-this-week-better-than-feared-india-incs-earnings-trough-looks-over","image":"https://media.assettype.com/bloombergquint/2025-04-15/lf7n515d/stock-market-screens.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-11-15 00:30:00","author":"Niraj Shah","authors":["Niraj Shah"],"language":"en","source_country":"in","sentiment":-0.35},{"id":379138538,"title":"Linn Grant, Grace Kim lead Annika as Nelly Korda makes charge","text":"BELLEAIR, Fla. — Linn Grant shot a 7-under 63 on Friday for a share of the lead with Grace Kim in The Annika. Defending champion Nelly Korda made a big move with a 63 of her own, while Kai Trump improved by eight strokes and still finished a distant last.\n\n“Very, very solid. I hit some really good shots,” said Grant, the Swede who won the 2023 Dana Open for her lone LPGA Tour title. “Tee to green today was very good. I felt like I played similar yesterday but I just couldn’t get the putts to go in, and today a lot of them went in.”\n\nKim had a 66 to join Grant at 9-under 131 at Pelican Golf Club. Kim won the Evian Championship in France in July for her first major title and helped Australia win the recent International Crown.\n\n“I just kind of kept my mojo going,” Kim said.” Just hit lots of fairways and tried to make a lot of putts. It helped probably I hit a few more close today, making more easier birdies. I guess, just stayed in my lane really.”\n\nTrump is the granddaughter of President Donald Trump. Playing on a sponsor exemption, the high school senior followed an opening 83 with a 75. At 18 over, she was last in the 108-player field by six strokes.\n\n“For the first day I was definitely really nervous,” she said. “I think the nerves just got to me. When I went out there today I felt very calm and peaceful to be honest with you. That’s why I played better.”\n\nFirst-round leader Haeran Ryu followed her opening 64 with a 68 to drop into a tie for third with Jennifer Kupcho (66) at 8 under. Gaby Lopez was 7 under after a 64.\n\nKorda birdied the last three holes to get to 6 under.\n\n“I just capitalized on my good shots.” Korda said. “I actually didn’t play bad yesterday at all. I just went to the range after and then to the putting green and just kind of told myself that, `It’s a fresh day and you never know what’s going to happen.’ I came out and I started capitalizing a little bit more on the better shots.”\n\nKorda won the tournament last year to become the first player in 13 years to win seven times in a season. She has yet to win this year.\n\nAuston Kim (65) also was 6 under with Carlota Ciganda (65) and Lauren Coughlin (66).\n\nThe top 60 in the Race to CME Globe qualify for the season-ending CME Group Tour Championship next week, where all 60 can win the $4 million prize.","url":"https://www.nbcsports.com/golf/news/linn-grant-grace-kim-lead-annika-as-nelly-korda-makes-charge","image":"https://nbcsports.brightspotcdn.com/dims4/default/a84370f/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fhdliveextra-a.akamaihd.net%2FHD%2Fimage_sports%2FNBCU_Sports_Group_-_nbcsports%2F62%2F31%2Fnbc_golf_annikard2","video":null,"publish_date":"2025-11-15 00:29:56","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.156},{"id":379141276,"title":"Explosive new documentary probes '80-year global coverup' of UFO secrets","text":"For decades, military pilots, radar operators, and ordinary citizens alike have reported strange objects darting through the skies, often dismissed by officials or buried under classification. Despite congressional hearings and government task forces, little clarity has emerged about what Americans are actually seeing. Now, the director of a new explosive documentary is pulling back the curtain on that mystery. Director and producer Dan Farah sat down with Fox News’ Bret Baier on Friday to discuss his new documentary, \"The Age of Disclosure.\" UFO TRACKER MAPS EERIE CLUSTERS OF UNIDENTIFIED OBJECTS LURKING BENEATH US SHORELINES: 'WE'RE BEING LIED TO' \"For a very long time, the public, Congress, and even the President have been kept out of the loop on this subject,\" Farah said. \"In the last few years, senior members of Congress, senior members of the administration, thanks to whistleblowers, have found out what's been going on, and they are now in pursuit of the truth for themselves and for the American people.\" The film explores an alleged \"80-year global cover-up\" of non-human intelligent life and a secret race among world powers to reverse-engineer advanced technology of non-human origin. It features interviews with 34 senior members of the U.S. government, military, and intelligence community — including Secretary of State Marco Rubio. \"Every single person I interviewed made it very clear that it was no longer a question of whether this was a real situation,\" he said. \"It's a very real situation.\" Farah, who worked on the film for more than three years, said each person he spoke to had \"direct knowledge of this issue\" and \"extreme credibility.\" \"We've had repeated instances of something operating in the airspace over restricted nuclear facilities, and it's not ours,\" Rubio said in the trailer. He said the film reveals how the U.S. government is engaged in a \"high-stakes, secret Cold War race with adversarial nations like China and Russia to reverse engineer technology of non-human origin.\" HOUSE WITNESS TESTIFIES UFOS NEARLY ACTIVATED RUSSIAN NUCLEAR MISSILES DURING 1982 INCIDENT \"The first country that cracks the code on this technology will be the leader for years to come,\" said Jay Stratton, a former Defense Intelligence Agency official and director of the government’s UAP Task Force, in the film’s trailer. Farah said some are calling it \"the Manhattan Project on steroids.\" \"The fear here is that if another nation wins this race it could really change the lay of the land in terms of power,\" he said. But skepticism surrounding UAPs remains. Farah said the question now isn’t whether UAPs exist, but where they come from, who controls them and what their purpose is. He said joking about this topic is \"the equivalent of laughing at a terrorist threat.\" \"Who would do that?\" he said. \"It makes no sense when you think about it. You know, if someone said, ‘Hey, there’s this constant terrorist threat. Terrorists are penetrating the airspace over our nuclear weapons sites.' Who would laugh at that? It makes no sense.\" JD VANCE SAYS UFOS, ALIENS COULD BE ‘SPIRITUAL FORCES’ AS VP VOWS TO ‘GET TO THE BOTTOM’ OF MYSTERY IN SKIES High-level officials in the film claim the issue was moved away from presidential oversight, with defense contractors \"gatekeeping information.\" However, Farah said members of Congress and the Trump administration are now working to uncover answers. \"Now we have leaders in Congress and in the administration that are trying to get to the bottom of it, and there are people in this film who are respected in their fields, who say they have seen these craft and have seen the recovered non-human bodies,\" he said. He said on-the-record interviews are even more important in this digital age, with many people dismissing everything they see as fake or artificial intelligence. He hopes the film will serve as the evidence many believe doesn’t exist. \"Some officials go on record claiming to have seen craft and non-human beings with their own eyes, and these are people who are putting their reputation and their names on the line,\" he said. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Farah said he thinks President Donald Trump could be the first president to speak openly about this unexplained phenomenon. \"I think it's only a matter of time at this point before we have a sitting president step to the microphone and have the biggest moment a leader can possibly have, which is telling all of humanity that we're not alone in the universe and that the United States intends to lead the way,\" Farah said. The film will be released on Nov. 21 and will play in select theaters in New York, Washington D.C., and Los Angeles, and will also be available worldwide to purchase or rent on Amazon Prime Video.","summary":"New UAP documentary features 34 government officials revealing decades of secrecy around unidentified aerial phenomena and non-human intelligence disclosure.","url":"https://www.foxnews.com/politics/the-age-disclosure-new-documentary-explores-claims-80-year-cover-up-non-human-life","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/ufo-alien-space-mystery_01.jpg","video":null,"publish_date":"2025-11-15 00:28:38","author":"Kiera McDonald,Morgan Phillips","authors":["Kiera McDonald","Morgan Phillips"],"language":"en","source_country":"US","sentiment":-0.051},{"id":379142446,"title":"NDP members upset at ferries from China, but wrath won't touch Eby","text":"But it should reduce the anticipated grumbling from convention delegates about the NDP not looking after its supporters in the public-sector unions.\n\nHeading into the convention, the New Democrats got a helping hand from the continued disarray on the Opposition side.\n\nThese days, Conservatives, current and former, are being asked if they support John Rustad continuing as leader. The same question about Premier David Eby might draw a more enthusiastic “you betcha” from delegates to the NDP convention.\n\nEby was asked what he expects in the scheduled leadership vote at the weekend convention. Two years ago he scored 93 per cent. But that was before he came within 22 votes and one seat of losing the election.\n\n“I don’t have a number in mind,” he told reporters before joking, “Obviously I want 100 per cent.”\n\nThat degree of unanimity being beyond reach this side of Donald Trump’s inner circle, Eby says he’ll be content with “a healthy majority.”\n\nNot much cause for concern in other words and, given the state of the Opposition, no wonder.","url":"https://theprovince.com/opinion/columnists/bc-ndp-ferries-china-david-eby","image":"https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/11/ferries_296146888.jpg","video":null,"publish_date":"2025-11-15 00:27:15","author":"Vaughn Palmer","authors":["Vaughn Palmer"],"language":"en","source_country":"ca","sentiment":-0.772},{"id":379138602,"title":"Sage Steele gives brutal verdict on Pat McAfee's ESPN interview with Donald Trump amid backlash","text":"Sage Steele gives brutal verdict on Pat McAfee's ESPN interview with Donald Trump amid backlash\n\nMORE: Data shows Donald Trump is RIGHT about his hated NFL kickoff rule \n\nBy DANIEL MATTHEWS, US SENIOR SPORTS WRITER\n\nPublished: 00:25 GMT, 15 November 2025 | Updated: 00:25 GMT, 15 November 2025\n\nFormer ESPN host Sage Steele has claimed Pat McAfee is in 'full control' at the network and that 'no rules' apply to the controversial anchor.\n\nThe retired punter has been at the center of a number of controversies since bringing his daily talk show - The Pat McAfee Show - to ESPN back in 2023.\n\nMcAfee caused another storm this week when he interviewed president Donald Trump on Veteran's Day. That prompted some fans to call for a boycott of his show.\n\nBut Steele - who left ESPN in August 2023 - was not surprised that McAfee got away with conducting the phone-in with the Commander-in-Chief.\n\nShe pointed out that the ex-NFL star last year went to war with senior ESPN executive Norby Williamson, calling him out live on air and suggesting a 'rat' within the network was trying to 'sabotage' his show.\n\n'This is Pat McAfee,' Steele told the 'Fearless' podcast. '[He] dropped the name Norby Williamson and called him a rat, and then doubled down and did it again on his show on ESPN and was not punished.'\n\nFormer ESPN anchor Sage Steele has claimed Pat McAfee is in 'full control' at the network \n\nMcAfee caused a storm this week when he interviewed Donald Trump on Veteran's Day \n\nWilliamson left the network a few months later. \n\n'[McAfee] actually had Burke Magnus, Norby’s replacement, come and do a selfie with him on the field… there were no repercussions,' Steele said.\n\n'For that to happen - whether everybody agrees or not - when you rip an executive, name-drop and call him names and nothing happens, you know that you have full control.'\n\nSteele continued: 'Can you imagine them telling him no? That’s not happening. It’s impossible and Pat knows that... that man has no rules. \n\n'And I think it’s hysterical because I’m picturing being a fly on the wall watching the executives meltdown as this interview happened... but they could not tell him no.'\n\nSteele joined ESPN in 2007 but was removed from the air in 2021 after making controversial statements about vaccine mandates, female sports reporters, and the racial identity of former President Barack Obama.\n\nShe filed a lawsuit against the network, claiming her right to free speech had been violated and alleging that ESPN had retaliated against her over the comments. Steele left in 2023 after the lawsuit was settled.\n\n🚨 BREAKING: Pat McAfee just FIRED BACK at liberals who are outraged he interviewed President Trump today 🫳🎤\n\n\"For the immediate people that are mad - it's the president of the United States. It's Veterans Day. He's the Commander-in-Chief. Obviously, if we have the opportunity… pic.twitter.com/LQwCMY8LkJ\n— Eric Daugherty (@EricLDaugh) November 11, 2025\n\nMcAfee, meanwhile, defended his decision to interview Trump, telling his critics: 'It's the President of the United States.'\n\nMcAfee continued: 'It's Veterans Day. He's the Commander-in-Chief. Obviously if we have the opportunity to talk to him, we're going to. And he's hilarious!'\n\nThe host also claimed that he and his team reached out to Barack Obama after Trump agreed to go on the show, only for the former President's schedule conflicts to prevent an interview from happening.\n\nDuring their discussion, McAfee spoke with Trump about America's veterans, the current government shutdown, college football and the controversial NFL kickoff rule that he wants changed.\n\nShare or comment on this article:\nSage Steele gives brutal verdict on Pat McAfee's ESPN interview with Donald Trump amid backlash\n\nAdd comment","summary":"McAfee caused another storm this week when he interviewed president Donald Trump on Veteran's Day . That prompted some fans to call for a boycott of his show.","url":"https://www.dailymail.co.uk/sport/nfl/article-15292609/sage-steele-pat-mcafee-espn-trump-interview.html","image":"https://i.dailymail.co.uk/1s/2025/11/14/21/102165075-0-image-m-25_1763154093824.jpg","video":null,"publish_date":"2025-11-15 00:25:36","author":"Daniel Matthews,Editor","authors":["Daniel Matthews","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.471},{"id":379139594,"title":"Donald Trump makes new threat to BBC over Panorama row - and says he'll call PM","text":"Donald Trump says he will sue the BBC for between one and five billion dollars. It comes after the BBC apologised over accusations that they edited his speech shortly before the January 6th attempted coup at the US Capitol in a way that was misleading. But the broadcaster indicated it would not pay him damages over the programme, which did not air in the US. \"We'll sue them for anywhere between a billion and five billion dollars, probably sometime next week,\" Trump told a reporter on Air Force One on his way to Florida tonight. \"I think I have to do it, they even admit that they cheated. Not that they wouldn't not have done that. They changed the words coming out of my mouth. That's worse than what CBS did with Kamala.\" This is untrue. None of the speech elements the BBC broadcast were fabricated. All of them were complete sentences spoken by the President during his January 6th 2021 speech. Countless courts, plus the US House of Representative agreed that Trump's speech played a role in inciting violence on what became a bloody insurrection at the US capitol shortly after the speech. CBS settled a much derided and meritless lawsuit without including a statement of apology or regret, after being accused by Trump of \"maliciously\" editing an interview with his opponent to her benefit on the 60 Minutes programme. \"They changed her answer but at least they didn't show it coming out of her mouth,\" Trump said today. He went on: \"The people of the UK are very angry about what happened, as you can imagine, because it shows the BBC is fake news.\" Asked if he'd raised the issue with Keir Starmer , he said: \"I haven't but I'll call him. He actually put a call in to me, because he's very embarrassed.\"","summary":"The US President threatened to drag Keir Starmer into the row over accusations the BBC edited a speech of his in a way that was misleading","url":"https://www.mirror.co.uk/news/politics/donald-trump-makes-new-threat-36250704","image":"https://i2-prod.mirror.co.uk/article36250703.ece/ALTERNATES/s1200b/1_APTOPIX-Trump-25313794103039.jpg","video":null,"publish_date":"2025-11-15 00:22:01","author":"Mikey Smith","authors":["Mikey Smith"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.81},{"id":379138278,"title":"Trump administration appeals judge’s ruling barring troop deployment in Portland","text":"By CLAIRE RUSH\n\nPORTLAND, Ore. (AP) — President Donald Trump’s administration on Friday appealed a ruling from a federal judge in Oregon that barred it from deploying the National Guard to Portland.\n\nThe ruling last week from U.S. District Court Judge Karin Immergut, a Trump appointee, followed a three-day trial in which both sides argued over whether protests at the city’s U.S. Immigration and Customs Enforcement building met the conditions for using the military domestically under federal law. The city and state filed the lawsuit in September to block the deployment.\n\nIn a 106-page opinion, Immergut found that even though the president is entitled to “great deference” in his decision on whether to call up the Guard, he did not have a legal basis for doing so because he did not establish that there was a rebellion or danger of rebellion, or that he was unable to enforce the law with regular forces.\n\nThe administration criticized the decision and said the troops were needed to protect federal personnel and property in a city that Trump has described as “war ravaged.”\n\n“The district court’s ruling made it clear that this administration must be accountable to the truth and to the rule of law,” Oregon Attorney General Dan Rayfield said in an emailed statement Friday in response to the administration’s appeal. “We will keep defending Oregon values and standing up for our state’s authority to make decisions grounded in evidence and common sense.”\n\nImmergut issued two temporary restraining orders in early October that had blocked the deployment of the troops leading up to the trial. The first order blocked Trump from deploying 200 members of the Oregon National Guard; the second, issued a day later, blocked him from deploying members of any state’s National Guard to Oregon, after he tried to evade the first order by sending California troops instead.\n\nThe 9th U.S. Circuit Court of Appeals has already ordered that troops not be deployed pending further action by the appeals court.\n\nDemocratic cities targeted by Trump for military involvement — including Chicago, which filed a separate lawsuit on the issue that is now before the U.S. Supreme Court — have been pushing back. They argue the president has not satisfied the legal threshold for deploying troops and that doing so would violate states’ sovereignty.","url":"https://www.orlandosentinel.com/2025/11/14/portland-troop-deployment-ban-appeal/","image":"https://www.orlandosentinel.com/wp-content/uploads/2025/11/Federal_Enforcement_Trial_Oregon_24497.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-15 00:21:55","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.507}]}