{"offset":0,"number":50,"available":5610,"news":[{"id":260864406,"title":"Suspect in shootings of Democratic office in Arizona had over 200 guns in his home, officials find","text":"An Arizona prosecutor said Wednesday the man arrested in the three-time shooting of a Democratic National Committee office in suburban Phoenix had more than 200 guns and over 250,000 rounds of ammunition in his home, leading law enforcement to believe he may have been planning a mass casualty event. \n\nMaricopa County prosecutor Neha Bhatia said at Jeffrey Michael Kelly’s initial court appearance on Wednesday that federal agents told her about the large seizure made after Kelly’s arrest. Scopes, body armor and silencers were also found, she said. A machine gun was discovered in the car he was driving.\n\nThe sheer size of the cache led authorities to believe “this person was preparing to commit an act of mass casualty,” Bhatia said.\n\nTempe police said Kelly, 60, also is accused of hanging several political signs lined with razor blades on Tuesday in Ahwatukee, an affluent suburb of Phoenix where most voters have chosen Democrats in recent elections.\n\nAuthorities said the hand-painted signs were attached to palm trees and appeared to criticize Democrats and their presidential nominee, Vice President Kamala Harris. \n\nKelly was being held on three felony counts of acts of terrorism and four other counts related to the shootings, according to police.\n\nThe Phoenix resident had an initial court appearance scheduled for Wednesday afternoon, around the same time Tempe police planned to release more information about Kelly’s arrest.\n\nPolice said Kelly allegedly fired BB pellets and then gunshots at the glass front door and a window of the Arizona Democrats' field office in the early morning hours of Sept. 16, Sept. 23 and Oct. 6. Nobody was inside during the shootings.\n\nThe Tempe location was one of 18 Harris field offices in Arizona where Democrats gathered to organize Harris campaign efforts. It was shut down after the last shooting, police said. \n\nArizona is one of the battleground states where the competition between Harris and former President Donald Trump has been particularly intense.\n\nPolitical violence has already marred the campaign season, with the Republican presidential nominee being targeted by assassination attempts at a campaign rally and at one of Trump's Florida golf courses.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"An Arizona prosecutor said Wednesday the man arrested in the three-time shooting of a Democratic National Committee office in suburban Phoenix had more than 200 guns and over…","url":"https://japantoday.com/category/world/suspect-in-shootings-of-democratic-office-in-arizona-had-over-200-guns-in-his-home-officials-find","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/4c/d4/2899e0b4bc1d375b51af4216aaa1c99b8138/download/_w1700.jpg","video":null,"publish_date":"2024-10-24 01:08:44","author":"Anita Snow,Japan Today Editor","authors":["Anita Snow","Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.314},{"id":260864392,"title":"Gold’s record run is being fuelled by wars, debt and Donald Trump","text":"Something odd has happened to the gold price this year. It has risen inexorably to record levels, decoupling from its traditional anchors.\n\nHistorically, the trend of the gold price has been influenced by macroeconomic factors like inflation, interest rates and the US dollar. It has been broadly correlated with them, rising when inflation is rising and falling when the dollar strengthens and interest rates rise.\n\nThose historical relationships make sense. Gold is regarded as a hedge against inflation. As it is priced in US dollars, investors get less for their money when the greenback rises. Gold generates no income return, so interest-generating assets such as bonds become more attractive when rates are rising.\n\nThis year, however – indeed, over the past 12 months or so – the gold price has kept climbing even as inflation rates have tumbled around the world and the US dollar, while volatile, has strengthened. Interest rates have only just started to fall, but have been relatively high for much of the year.","summary":"Something odd has happened to the gold price this year. It has been unstoppable, rising to record levels as it decoupled from its traditional anchors.","url":"https://www.theage.com.au/business/markets/gold-s-record-run-is-being-fuelled-by-wars-debt-and-donald-trump-20241024-p5kky6.html","image":"https://static.ffx.io/images/$zoom_0.35489276139410186%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_63/t_crop_custom/q_86%2Cf_auto/780a1739d11b62a758bdb0554076cc722665b005","video":null,"publish_date":"2024-10-24 01:07:13","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":0.205},{"id":260864220,"title":"Gold’s record run is being fuelled by wars, debt and Donald Trump","text":"Something odd has happened to the gold price this year. It has risen inexorably to record levels, decoupling from its traditional anchors.\n\nHistorically, the trend of the gold price has been influenced by macroeconomic factors like inflation, interest rates and the US dollar. It has been broadly correlated with them, rising when inflation is rising and falling when the dollar strengthens and interest rates rise.\n\nThose historical relationships make sense. Gold is regarded as a hedge against inflation. As it is priced in US dollars, investors get less for their money when the greenback rises. Gold generates no income return, so interest-generating assets such as bonds become more attractive when rates are rising.\n\nThis year, however – indeed, over the past 12 months or so – the gold price has kept climbing even as inflation rates have tumbled around the world and the US dollar, while volatile, has strengthened. Interest rates have only just started to fall, but have been relatively high for much of the year.","summary":"Something odd has happened to the gold price this year. It has been unstoppable, rising to record levels as it decoupled from its traditional anchors.","url":"https://www.brisbanetimes.com.au/business/markets/gold-s-record-run-is-being-fuelled-by-wars-debt-and-donald-trump-20241024-p5kky6.html","image":"https://static.ffx.io/images/$zoom_0.35489276139410186%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_63/t_crop_custom/q_86%2Cf_auto/780a1739d11b62a758bdb0554076cc722665b005","video":null,"publish_date":"2024-10-24 01:07:13","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":0.205},{"id":260864072,"title":"Donald Trump Reacts to John Kelly's 'Hitler Generals' Remarks","text":"Former President Donald Trump has denounced his former chief of staff John Kelly for making despairing remarks about him, including a claim that the ex-president praised Nazi leader Adolf Hitler's generals during his time in the White House.Kelly, a retired U.S. Marine Corps general, claimed in remarks published by The Atlantic on Tuesday that he witnessed Trump express an admiration for \"Hitler's generals\" while serving as president. Trump was also quoted as saying that wanted \"the kind of generals that Hitler had\" during a White House meeting.In an interview published by The New York Times on the same day, Kelly said that he believed the former president is a \"fascist\" and a \"dictatorial leader,\" claiming that he saw Trump praise \"the good things\" Hitler did and confirming his past account of Trump calling U.S. soldiers killed or injured in action \"losers and suckers.\"Trump weighed in on Kelly's remarks in a post to Truth Social on Wednesday, claiming that his longest-serving White House chief of staff was a \"lowlife\" who simply \"made up\" his recollections while diagnosing him with \"Trump Derangement Syndrome.\"\"Thank you for your support against a total degenerate named John Kelly, who made up a story out of pure Trump Derangement Syndrome Hatred!\" Trump wrote. \"This guy had two qualities, which don't work well together. He was tough and dumb. The problem is his toughness morphed into weakness, because he became JELLO with time! The story about the Soldiers was A LIE, as are numerous other stories he told.\"\"Even though I shouldn't be wasting my time with him, I always feel it's necessary to hit back in pursuit of THE TRUTH,\" he added. \"John Kelly is a LOWLIFE, and a bad General, whose advice in the White House I no longer sought, and told him to MOVE ON! His wife once told me, at Camp David, John admires you tremendously, and when he leaves the Military, he will only speak well of you.\"This is a developing news story and will be updated with more information.","summary":"Trump called his longest-serving White House chief of staff a \"lowlife\" for claiming that he praised Hitler.","url":"https://www.newsweek.com/donald-trump-reacts-john-kelly-hitler-remarks-1973897","image":"https://d.newsweek.com/en/full/2502628/trump-kelly-talk.jpg","video":null,"publish_date":"2024-10-24 01:02:10","author":"Aila Slisco,Gabe Whisnant","authors":["Aila Slisco","Gabe Whisnant"],"language":"en","category":"politics","source_country":"us","sentiment":0.154},{"id":260864452,"title":"EPHRAIM HARDCASTLE: Jacinda Ardern was so determined to receive her Damehood from Prince William","text":"Former New Zealand PM Jacinda Ardern was so determined to receive her Dame of the NZ Order of Merit from Prince William that she postponed the event for a year, avoiding investitures with other royals and her Governor General. \n\nJacinda, a trustee of William’s Earthshot Prize even turned down the opportunity to fly to Australia to have King Charles invest her. \n\nShe finally got her gong from the heir at Windsor Castle last week. But she very nearly didn’t have favourite William pin the honour on her sash. \n\nPrincess Anne was also doing investitures and an admin muddle had Arden originally on her list.\n\nOfficials are hoping that the King doesn’t fall ill at the Commonwealth summit in Samoa. \n\nThe island nation is heavily indebted to China, which has supplied most of its major infrastructure – including its hospital. \n\nThe risk that the royal medical records might end up in the hands of Doctor Xi Jinping in Beijing has been giving some sleepless nights.\n\nBBC North America editor Sarah Smith dismisses Donald Trump’s allegations of Labour’s illegal interference in support of his election opponent Kamala Harris saying no money has changed hands. \n\nBut free accommodation (provided by fellow volunteers) is surely a ‘benefit in kind’? It is a freebie, in common parlance, as Keir Starmer should know given his Lord Alli penthouse problems.\n\nCringing about his romcom heyday, grumpy film star Hugh Grant, pictured, reflects: ‘My mistake was that I suddenly got this massive success with Four Weddings and I thought, “Ah, well, if that’s what people love so much, I’ll be that person in real life, too”. \n\nI used to do interviews where I was Mr Stuttery Blinky, and people were, quite rightly, repelled by it in the end.’ \n\nDidn’t Stuttery Blinky make his last appearance after Hugh’s infamous encounter with LA hooker Divine Brown in 1995?\n\nAfter frequent attempts to deface Eric Gill’s Prospero and Ariel statue at Broadcasting House, the BBC is taking radical action to protect them. \n\nAfter last year’s hammer attack on the work of Gill, who abused his daughters, the decision was taken to surround the sculptures from The Tempest with bullet-proof glass. With the protective screen soon to be unveiled, will the BBC incur the wrath of the anti-woke mob?\n\nPromoting his new country album, Sir Ringo Starr admits his attempts at songwriting during Beatles days regularly met with mockery from bandmates. \n\n‘I had this habit of making the boys laugh when I wanted to present my songs,’ he recalls. ‘Because I didn’t know I’d rewritten well-known songs. I thought, “Wow, this is good”.","summary":"EPHRAIM HARDCASTLE: Former New Zealand PM Jacinda Ardern was so determined to receive her Dame of the NZ Order of Merit from Prince William that she postponed the event for a year.","url":"https://www.dailymail.co.uk/debate/article-13994621/EPHRAIM-HARDCASTLE-Jacinda-Ardern-determined-receive-Damehood-Prince-William.html","image":"https://i.dailymail.co.uk/1s/2024/10/24/00/91213845-0-image-m-16_1729726116716.jpg","video":null,"publish_date":"2024-10-24 01:01:55","author":"Editor,Ephraim Hardcastle","authors":["Editor","Ephraim Hardcastle"],"language":"en","source_country":"gb","sentiment":0.014},{"id":260864086,"title":"Nicole Shanahan offered to pay a reporter $500,000 to expose their sources: report","text":"Robert F. Kennedy Jr.'s former running mate, Nicole Shanahan, offered to pay a reporter $500,000 to \"expose people Shanahan claimed were spreading false information about her,\" according to The Washington Post.On Wednesday, the newspaper published a profile on Shanahan, a 39-year-old California-based attorney, founder of patent technology company ClearAccessIP and the Bia-Echo Foundation, and the ex-wife of Google cofounder Sergey Brin. During the reporting process, the Post reported Shanahan found out that the outlet had contacted one of her associates for its story. In June, Shanahan asked via text if the associate would relay an offer back to the Post reporter: \"half a million dollars to be a whistleblower\" about the sources she believed had wronged her, according to the outlet.It's not clear specifically which reporter Shanahan made the alleged offer to, but Ashley Parker, the Post's Senior National Political Correspondent posted about the offer on X on Wednesday.\"When we began reporting on Nicole Shanahan, she offered us $500,000 to be 'whistleblowers' and share our sources,\" Parker wrote on X with a link to the piece. \"We declined — but kept reporting our profile.\"Shanahan did not respond to Business Insider's requests for comment on The Washington Post's reporting. At the time the reporters were reaching out, Shanahan was still campaigning for the vice presidency alongside Kennedy Jr. before the pair dropped out in August and endorsed Donald Trump.Shanahan's associate told the Post reporter about her offer, which the reporter did not respond to, the outlet reported.When the Post finally got a response from Shanahan after months of reaching out to her for comment on the story, Shanahan rejected some of the outlet's reporting without providing further details, the outlet says.\"I'm so sorry you feel it is appropriate to do this for political motivations,\" Shanahan told the Post in her response. \"It's a very sad state our country is in.\"","summary":"RFK Jr.'s former running mate Nicole Shanahan  was profiled by The Washington Post. Shanahan rejected some of the outlet's reporting.","url":"https://www.businessinsider.com/nicole-shanahan-offered-reporter-half-million-dollars-reveal-sources-rfkjr-2024-10","image":"https://i.insider.com/6719650a01ea6d83dee3a1b1?width=1200&format=jpeg","video":null,"publish_date":"2024-10-24 01:01:01","author":"Grace Eliza Goodwin","authors":["Grace Eliza Goodwin"],"language":"en","source_country":"US","sentiment":-0.656},{"id":260863946,"title":"Rep. Mike Lawler says he deserves second term over taxes, border and public safety record","text":"Freshman US Rep. Mike Lawler said lower Hudson Valley voters should send him back to DC for another term because of his stances on taxes, border security and public safety.\n\nThe Republican told The Post’s editorial board Wednesday that there’s a stark choice between him and Democrat Mondaire Jones as they battle it out in New York’s 17th congressional district in one of the most closely watched contests in the state.\n\n“On affordability, he wants to increase taxes,” Lawler said of Jones, a former one-term congressman looking to make a comeback in the swing district.\n\nLawler said he would fight to lower taxes and at the very least preserve tax cuts approved by former President Donald Trump and the GOP-run Congress in 2017.\n\nThose tax reductions expire at the end of 2025.\n\nLawler said although corporate tax was slashed from 28% to 21% under Trump, a Democratic White House under nominee and current Vice President Kamala Harris could bring them back up to 28%.\n\nDemocrats are also looking to raise income taxes on higher-end earners, Lawler said.\n\nHe said Jones — along with Vice President and Democratic White House nominee Kamala Harris — want to raise the corporate taxes back to 28% from 21% and raise income taxes on higher end earners.\n\n“It would be the largest tax increase in American history,” Lawler said. \n\n“He wants the Trump tax cuts to expire.”\n\nThe 17th District, which includes Putnam and Rockland counties as well as parts of Westchester and Dutchess, is one of a few races in deeply blue New York that pundits think can go either way — and help decide which party controls the House of Representatives next year.\n\nThe closeness of the race has pushed the debate to the center, with Jones campaigning as a policy moderate after coming into office in 2021 on a decidedly progressive platform.\n\nLawler said Jones’ record includes “defunding police” — and he’s now shying away from past statements and associations — including being cozy with the hard left “Squad” and democratic socialist Rep. Alexandria Ocasio-Cortez.\n\nThe Republican has backing of virtually every union representing law enforcement and emergency responders, including the NYC PBA. Many Big Apple cops and firefighters reside in the district.\n\nLawler said he has a strong record in Congress backing Israel, including introducing and passing laws protecting the Jewish state.\n\nFor his part, Jones and the Democrats have tried to link Lawler to Trump — an effective approach in some suburban races north of the city years ago that the congressman said no longer has teeth according to polling.\n\n“This is not 2020,” Lawler said.\n\nHe said voters, with the exception of the Trump haters, rarely bring up the ex-president.\n\nLawler even joked that many constituents who saw the TV ad of Trump praising him as “spectacular’ liked it.\n\nMeanwhile, Lawler said one-party Democratic rule of the statehouse in Albany has been a disaster for New York — and those policies are also on the ballot.\n\nHe called ex-Gov. Andrew Cuomo’s decision to force the closure of the Indian Point nuclear power plant in Westchester “idiotic,” cutting off a major power supply for New York City and the region’s growing power needs.\n\nLawler also predicted that Gov. Kathy Hochul will flip again — after the Nov. 5 election — and revive the plan to impose a planned congestion toll to enter Manhattan Midtown. \n\nHochul in June suspended the proposal “indefinitely.” \n\nHe said Hochul postponed it as a political ruse at the behest of House Democratic leader Hakeem Jeffries, who feared at a backlash against House Democrats at the polls. \n\nLawler said it’s no contest on who supports stricter border enforcement.\n\n“[Jones] supported open borders, he wanted to defund ICE [US Immigration and Customs Enforcement] he called ICE agents terrorists,” the congressman said.","summary":"Freshman US Rep. Mike Lawler said lower Hudson Valley voters should send him back to DC for another term because of his stances on taxes, border security and public safety. The Republican told The Post’s editorial board Wednesday that there’s a stark choice between him and Democrat Mondaire Jones as they battle it out in &#8230;\n\n\nThe post Rep. Mike Lawler says he deserves second term over taxes, border and public safety record appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/rep-mike-lawler-says-he-deserves-second-term-over-taxes-border-and-public-safety-record/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/rep-mike-lawler-r-n-92244110.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-24 01:00:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.305},{"id":260864458,"title":"Idris Elba reveals he wants to settle in Africa within a decade amid plans to help bolster their film industry by opening studios in Zanzibar and Ghana","text":"Kim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nThursday, Oct 24th 2024\n\n5-Day Forecast\n\nAdvertisement\n\nKing Charles' longtime friend Ian Farquhar, 78, who served as equerry to the Queen Mother, died when he got trapped between a wall and his bed while drunk, inquest hears\n\nFed-up farmer, 52, hogties 'trespassers he found in his fields' to his quad bike 'like rabbits' then drives them to the police station... but officers arrest HIM\n\nMan, 40, who drove the wrong way down the M6 killing two children, their father and his partner 'was a former Top Gun who trained RAF pilots'\n\nEDEN CONFIDENTIAL: Frederick Forsyth's 'glamorous, beautiful' wife Sandy dies aged 76 after years-long battle with opioids that left him in despair\n\nJENNI MURRAY: My godsons both made a terrifying discovery in their new homes. And this killer may be lurking in yours too\n\nSeven-day plan to beat the Budget tax raid: JEFF PRESTRIDGE's essential guide can save you thousands\n\nSimple one-legged balancing test determines your biological age - so how old are YOU really?\n\nKylie Jenner shares how she got 'confident' again after gaining 60lbs from her second child\n\nCharles is all white! King and Queen Camilla beam in matching summery outfits as they are welcomed into Samoa with colourful ceremony reserved only for monarchs\n\nDEAR JANE: My husband is upset after I revealed my body count... but I don't even think my number is that high!\n\nNEIL BARNETT: We're already at war with Russia... we just haven't woken up to it yet\n\nCadbury's brings back 'extinct' chocolate bar as shoppers rush to high street supermarket to get them before they sell out\n\nYes, you CAN have too many orgasms! TRACEY COX reveals the dangers of excessive climaxing after Nicole Kidman said she had 'burnout' from sex scenes\n\nI got his mistress sacked and told him his best man made a move on me. The delicious and ingenious ways we took revenge on the Other Woman... but did they really deserve it?\n\nHow to beat arthritis: The definitive doctors' guide to the treatments that work, what to do if it's early days, the truth about supplements and steps to avoid surgery\n\nChris Kaba jury wanted to make public statement but were gagged by judge who ruled their note must not be made public\n\nTyson Fury reveals his wife suffered a miscarriage the day before his heavyweight title defeat by Oleksandr Usyk in May\n\nWoman, 60, arrested on suspicion of manslaughter after three people found dead at Dorset care home amid suspected carbon monoxide leak\n\nSNP’s minimum pricing law for alcohol just left Scottish drinkers poorer - and had 'no significant effects' on cutting consumption\n\nLiam Payne's girlfriend Kate Cassidy reveals he gave her a note before he died revealing his plans to marry her and adds 'my heart is shattered in ways I can't put into words'\n\nPrivate jets, the Four Seasons royal suite and even a $26k Birkin bag for the wife: How Hamas's corrupt billionaire leaders cruelly lined their own pockets with cash meant for poverty-stricken Gazans - and you might have paid for it...\n\nEvil killer who lured army veteran into horrific sex trap murder using gay dating app is jailed for 37 years - as CCTV shows moment 20-year-old is arrested\n\nKeir Starmer's attempts to defuse transatlantic fall-out between US and UK after Donald Trump files legal complaint claiming 'foreign interference' in presidential election\n\nModel claims Trump 'groped' her in 1993 in a 'twisted game' after meeting him through Jeffrey Epstein\n\nIdris Elba reveals he wants to settle in Africa within a decade amid plans to help bolster their film industry by opening studios in Zanzibar and Ghana\n\nHave YOU got a story? Email tips@dailymail.com \nBy Amelia Wynne For Mailonline \n Published:01:45 BST, 24 October 2024 |Updated:01:53 BST, 24 October 2024 \n\nIdris Elba has revealed that he wants to settle in Africa within a decade.\nThe actor, 52, wishes to help bolster their film industry and is opening film studios in Zanzibar and Ghana's capital Accra.\nIdris - whose mother is from Ghana and father is from Sierra Leone - was born in Hackney in east London.\nOn Wednesday he told the BBC: 'I would certainly consider settling down here — not even consider; it's going to happen.\n'I think I'll move in the next five, ten years, God willing. I'm here to bolster the film industry. That is a ten-year process. I won't be able to do that from overseas. I need to be in-country, on the continent.'\n\nIdris Elba has revealed that he wants to settle in Africa within a decade\n\nIdris - whose mother is from Ghana and father is from Sierra Leone - was born in Hackney in east London (seen with his father Winston)\n'I'm going to live in Accra, I'm going to live in Freetown [the capital of Sierra Leone], I'm going to live in Zanzibar. I'm going to try and go where they're telling stories - that's really important.'\nHe added that he thinks it is vital for Africans to play a key part in all areas of the film-making process including in financing, distribution and marketing. \nHe said that in the current sector if you watch films that have anything to do with Africa all you will see is 'trauma, war, how we were slaves' but that in reality if you travel there you see that that is not true. \nIn March Idris revealed plans to transform a remote island off the coast of Sierra Leone, the West African nation where his father was born, into an eco-friendly 'smart city'.\nThe British star said he wants to make Sherbro Island an 'afro-dynamic eco-city' - an urban hub for the whole of Africa combining sustainability, community and economic growth.\nSherbro Alliance Partners (SAP) say the development will be done while protecting its 'delicate ecosystem', with the 230 sq mile island covered with mangrove forests and an important nesting site for sea turtles.\nHome to just 40,000 people, most of whom work in fishing and rice farming, the actor hopes to cultivate economic growth and bring prosperity to the former British colony.\nThe development scheme has not got a specified budget but is likely to run into the billions of dollars, with SAP seeking out investment and Mr Elba admitting that it is a 'big dream'.\n'Never in my lifetime would I have thought I could build the foundation for a new smart-city… I'm not qualified for that,' he told the BBC. 'But I am qualified to dream big.'\n\nThe actor, 52, wishes to help bolster their film industry and is opening film studios in Zanzibar and Ghana's capital Accra\n\nOn Wednesday he told the BBC : 'I would certainly consider settling down here — not even consider; it's going to happen' (seen with wife Sabrina)\nThe Hackney-born star has been vocal about his desire to rejuvenate and 'rebrand' his father's homeland after making his fortune as a DJ, singer and actor.\nWhat began as a mission to bring tourism to the island, which boasts stunning white beaches and palm trees, soon grew into an innovative plan to develop the area in a more sustainable way.\n'It's about being self-reliant, it's about bringing an economy that feeds itself and has growth potential,' Mr Elba said.\n'I'm very keen to reframe the way Africa is viewed… as an aid model. This opportunity is completely different.'\n\n Idris Elba shares 'big dreams' to build futuristic eco-city in Sierra Leone and reveals reason behind innovative plans on the island off coast of Africa \nThe Luther actor was brought into the project by childhood friend Siaka Stevens, the grandson of Sierra Leone's former president of the same name, who he grew up with in London.\nMr Stevens had been looking for development opportunities in his birth country, but after bringing Elba on board the pair soon realised a boutique hotel was not the best avenue to go down.\nThey decided instead to set up SAP and work towards building Sherbro Island City, striking a deal with the Sierra Leonean government to develop the island. \nPresident Julius Maada Bio, who is from Sherbro's district, said his government believes the development will make the island 'an economic engine for our country and neighbours'.\nThe actor said the island, which was 'once under British reign, is now my canvas for change.'\n'As a British man deeply rooted in Africa, I'm steering a transformative project on Sherbro Island,' he wrote on X last week.\n\nHe added that he thinks it is vital for Africans to play a key part in all areas of the film-making process including in financing, distribution and marketing\n'Envision green energy, pioneering innovations, and a melting pot for global talents to flourish. We're preserving our heritage whilst fostering our future.'\nMocked-up plans of what the city could look like show glassy buildings, pristine lawns and business and entertainment complexes.\nBut the current reality of life on the island is far removed from these artist's impressions, with many of its inhabitants living in run-down shanty towns and with limited infrastructure.\nA proud Sierra Leonean, the actor and musician's late father Winston was born in the country before he migrated to the UK. \nDuring his first visit to his fatherland, when he was awarded citizenship in 2019, he declared: 'The son of the soil is coming back to fertilise the soil.'\nIdris ElbaBBCLondon\n\nShare or comment on this article: \nIdris Elba reveals he wants to settle in Africa within a decade amid plans to help bolster their film industry by opening studios in Zanzibar and Ghana\n\nAdd comment\n\nEnter search term:\n\nGladiators star Falcon leaves staggering sum in her will after dying aged 59 last year following cancer battle\n\nKylie Jenner shares how she got 'confident' again after gaining 60lbs from her 2nd child\n\nX Factor winner looks very different 15 years after winning the ITV show as he announces new career move away from singing\n\nTim Burton makes rare red carpet appearance with his and Helena Bonham Carter's children Billy Ray and Nell at the opening of his exhibition\n\nKim Kardashian rocks sexy silver bikini to celebrate 44th birthday in Malibu with family\n\nFancy bagging a bargain holiday from just 1p? You can bid for next year's break for a fraction of the cost - here's how!\n\nEXCLUSIVEJames Haskell has hair transplant now he is back on the dating scene following his split from Chloe Madeley\n\nZayn Malik gives update on his tour after postponing upcoming US dates following the tragic death of his One Direction bandmate Liam Payne\n\nBig Brother's Nadia Almada stuns in a skimpy blue bikini amid six stone weight loss as she soaks up the sun during a trip to Gran Canaria\n\n'Talking about our finances made us feel more in control': How opening up about money helped one couple plan for the future\n\nTaron Egerton 'finds love with stunning Marvel film star Chloe Bennet' - two years after his split from Emily Thomas\n\nMAFS UK couple quit show following row over shoelaces as bride Sionainn claims husband Ryan revealed he'd been FAKING his feelings for her\n\nChristina Aguilera shows off dramatic weight loss to channel 'boss lady' in fitted look\n\nGeoff Capes dead at75: Two-time world's strongest man and Britain's most famous shot-putter passes away\n\nHannah Waddingham and Juno Temple wow in racy black gowns as they join leading man Tom Hardy at the Venom: The Last Dance UK premiere\n\nKris Jenner, 68, is called out by fans over 'absurd' appearance in 'filtered' photos\n\nIdris Elba reveals he wants to settle in Africa within a decade amid plans to help bolster their film industry by opening studios in Zanzibar and Ghana\n\nLaura Dern enjoys ANOTHER age-gap screen romance as star gets cozy with actor Jaycob Maya in Palm Royale\n\nLeonardo DiCaprio, 49, shows rare PDA with girlfriend Vittoria Ceretti, 26, on loved-up NYC stroll\n\nHow understanding your glucose levels can help you feel less tired after meals\n\nHelen Mirren, 79, says it's 'sad Kurt Cobain died before GPS was invented' in bizarre interview as she gives her opinion on Harry Styles\n\nDua Lipa's An Evening With special to air on ITV and feature Sir Elton John following epic Royal Albert Hall performance\n\nEDEN CONFIDENTIAL: Frederick Forsyth's 'glamorous, beautiful' wife Sandy dies aged 76 after years-long battle with opioids\n\nSuper soft hair in three easy steps: Simple routine provides up to 7x* more moisture for up to 72 hours**\n\nTed Danson apologizes to Kelsey Grammer for missing 30 years of friendship after Cheers\n\nMike Tindall reveals what the royals are really like in private and why it's 'nothing like Downton Abbey'\n\nCharles is all white! King and Queen Camilla beam in matching summery outfits as they are welcomed into Samoa with colourful ceremony \n\nLily Allen flashes her midriff in a black crop top and stylish leather jacket as she steps out in NYC with her husband David Harbour\n\nStaying flexible in older age: How we think about people over 60 'should be challenged', says TV star Angela Rippon\n\nBig Brother pulls episode amid anti-Semitism row after housemate wears T-shirt 'portraying genocidal views' - then re-uploads it\n\nLiam Payne's girlfriend Kate Cassidy reveals he gave her a note before he died revealing his plans to marry her and adds 'my heart is shattered\n\nHollywood actor reveals serial killer John Wayne Gacy kidnapped and raped him at age 19\n\n Wayne Gacy in 1978.\n\nFrightfully delicious! Put the treat into trick-or-treating during dinner time this Halloween\n\nBig Brother fans left in HYSTERICS as Lily says adding coriander to food is 'NOT ethical' after housemates win luxury shopping budget\n\nTyson Fury reveals his wife suffered a miscarriage the day before his heavyweight title defeat by Oleksandr Usyk in May\n\nAmanda Abbington looks in good spirits at My Week with Maisy film screening - after hitting back at Giovanni Pernice\n\nAndrew Garfield and Amelia Dimoldenberg's flirty Chicken Shop Date has major corporations chiming in\n\nCalling all DIY newbies! THIS is the easiest and most effective way to update your interiors - and it won't blow the budget\n\nKhloe Kardashian totes around $300k Hermes bag as she steps out in casual athleisure look in LA\n\nChris Hemsworth nears deal to play one of Disney's most beloved princes\n\nFrom fashion to fragrance and the coolest new tech! Make Christmas sparkle with our ultimate gift guide\n\nInside Tarzan star Ron Ely's tragic final years after son stabbed his wife to death\n\nEXCLUSIVECountry icon Loretta Lynn's grandson is selling $7M Dallas manor with lavish 'puppy condo'\n\nAlex Scott stuns in a glitzy gold gown as she joins racy Yasmin Finney, Marisa Abela and Nathalie Emmanuel at the star-studded ELLE Style Awards\n\nHeidi Klum puts on a leggy display in a hot pink mini dress as she attends the Blauer Panther TV & Streaming Awards in Germany\n\nDo you enjoy looking smart but can't find the time: 7 easy hacks to have you looking fresh and put together no matter how little time you have\n\nLiam Neeson, 72, says he's retiring from action movies\n\nThe 72-year-old Irish actor has confirmed plans to step away from action films.\n\nEkin-Su Culculoglu wows in a busty black dress and debuts new red hair as she joins fellow Love Islanders at Venom: The Last Dance UK premiere\n\nHailey Bieber flashes her midriff in black hoodie and leggings after Pilates two months post-giving birth\n\nKen Jeong tears up during star-studded Hollywood Walk of Fame ceremony\n\nLaundry legend or sock-shrinking disaster? Share this quiz with your loved ones so they can identify their bad household habits - and change them for good!\n\nMadonna's mini-me Lourdes Leon lands a big fashion campaign after saying 'financially modeling is a smart decision'\n\nTarzan star Ron Ely dead at 86: Actor's daughter confirms his passing with emotional tribute\n\n65,000 sign petition for 'Liam's Law' to protect artists' mental health after Liam Payne's death\n\nCardi B cancels ONE MusicFest appearance due to medical emergency after angry rant against Offset\n\nLooking to refresh your space before winter? Transform your home and interiors with these 10 top must-know brands\n\nDaisy May Cooper breaks down on Loose Women as she reveals she got message from beyond the grave from This Country co-star Michael Sleggs\n\nSabrina Carpenter 'arrests' Millie Bobby Brown for 'being too hot' at Atlanta concert\n\nArabella Chi dazzles in glittery silver dress as she makes red carpet debut with new boyfriend Billy Henty at UK premiere of Venom: The Last Dance\n\nCynthia Nixon reveals what would surprise fans most about former Sex and the City costar Sarah Jessica Parker\n\nDreaming of looking naturally radiant all the time? Here's how you can do it\n\nEXCLUSIVEMarried At First Sight UK bride Hannah bags her THIRD husband of the series and shocks co-stars by arriving to reunion show hand in hand\n\nOlivia Munn shows off her mastectomy scars posing topless in powerful SKIMS ad amid breast cancer journey\n\nEXCLUSIVEKatie Price assures fans her weight-loss is a result of a new gym regime after sparking concern with 'worrying' video\n\nKylie Jenner wows in skimpy lingerie set as she admits it was 'more shocking' to have a baby young while detailing her battle with body image \n\nHave YOU suffered hair loss? Here's the science-backed solution experts are raving about\n\nShark Tank star Mark Cuban reveals lucrative side hustle he'd tell his teenage self to start\n\nJennifer Lopez's ex-husband blames Sean 'Diddy' Combs for their divorce\n\nOne Tree Hill star Bethany Joy Lenz details losing her virginity at 26 to ex-husband during 'abysmal honeymoon'\n\nSarah Jessica Parker makes 'childless cat lady' remark as she reveals who she's voting for in US election\n\nKanye West unveils terrifying Bully album cover inspired by his $850K titanium teeth\n\nLooking to manage your weight more effectively and feel fuller for longer? Celebrity nutritionist Gabriela Peacock's Fibre supplements can help\n\nMaya Jama shows ex Stormzy what he's missing as she flaunts her curves in a skimpy leopard print bikini - after clarifying split rumours\n\nRachel Zegler gives foul-mouthed response to Taylor Swift's internet trolls\n\nEXCLUSIVEStrictly 'love hexagon' involving Pete Wicks, Maura Higgins and Jowita Przysta proves show is 'never-ending conveyor belt' of hook ups\n\nLiam Neeson reflects on family 'pulling together' after wife Natasha Richardson's tragic death aged 45\n\nWant to be paid more? This is the best way to ask for a salary bump\nAdvertising\nBut in order to get a pay increase, you'll most likely need to nudge your employer to do so.\n\nBlake Lively can't stop smiling as she fangirls over HGTV stars Joanna and Chip Gaines while out in NYC\n\nEmily Atack reveals she's embracing her post-partum 'rolly bits' and feels 'sexier than ever' after stripping off for 'liberating' naked scene in Rivals\n\nCarol Vorderman opens up on 'holding people to account' and 'creating mischief' during the weekends after stepping down from her radio show\n\nKim Kardashian shows off her jaw-dropping figure in a VERY racy nude latex dress as she shares sexy selfies from her 44th birthday\n\nKieran Chapman takes a swipe at one Married At First Sight co-star as he and Kristina Goodsell reveal how intense filming the show was\n\nAngelina Jolie, 49, looks blonder than ever in Los Angeles after 'romance' with Akala, 40, is explained\n\nNetflix fans are all saying the same thing about Mean Girls 'reunion'\n\nCardi B trashes 'narcissistic' ex Offset in explicit rant amid nasty divorce\n\nShirley Ballas becomes a millionaire after raking in whopping £1,000 every day in role as head judge on Strictly\n\nKylie Jenner is a busty beauty as she almost slips out of her strapless leather dress\n\nJason Manford reveals he 'wasn't present' during his eldest kid's childhood as he was 'too focused on work' prior to his split from ex wife\n\nNoah Kahan fans go wild over sold out L.L.Bean collaboration including $249 duck boots\n\nIrina Shayk passes dog Peanut over to ex Bradley Cooper during custody handoff in NYC\n\nEXCLUSIVEWhy Zach Bryan 'blindsided' girlfriend Brianna Chickenfry with shock split\n\nQueen Máxima of the Netherlands wows in a matching scarlet coat and dress as she packs her day with engagements\n\n90s rocker Matthew Sweet, 60, suffers huge 'debilitating' stroke while on tour\n\nAlt-rocker Matthew was on tour in Toronto.\n\nKatie Price shares baby update after revealing she is documenting her IVF journey in a new TV programme\n\n'It's now dramatic and fun - we love it': Watch as one family's outdated and unloved little downstairs loo becomes a stylish 'maximalist' cloakroom\n\nEmily Atack gives rare insight into her relationship with partner Alistair as she heaps praise on him for being her 'rock' after she gave birth to their baby\n\nSex and The City fans go wild over theory about which political party the four characters would vote for\n\nIs this the raunchiest Oscar nominee yet? Mikey Madison stars as sex worker in racy rom-com Anora after winning prestigious Cannes Award\n\nWhy Chappell Roan was dropped by her 'unimpressed' record label - right before shooting to fame\n\nLiam Payne's 'fairy godmother' Dame Denise Lewis pens heartbreaking tribute to the 1D star after his tragic death aged 31\n\nVirginia Madsen, 63, who was Oscar nominated for Sideways and wed to a Yellowstone star, is still hot - see her now\n\nEXCLUSIVEKylie Jenner reveals how she is raising children Stormi and Aire differently to sister Kim Kardashian with one very strict parenting rule\n\nEXCLUSIVEDavid Beckham beams as he strolls around his new $77m Miami mega-mansion as he and Victoria move into waterfront enclave\n\nEmma Roberts' dad Eric reveals sadness over pair's 'loss of relationship' in candid interview\n\nSouthern Charm's Michael Kelcourse passes away at age 71 as cause of death is revealed\n\nYes, you CAN have too many orgasms! TRACEY COX reveals the dangers of excessive climaxing after Nicole Kidman said she had 'burnout' \n\nBella Hadid puts on a chic display as she steps out in LA days after walking the Victoria's Secret Fashion Show\n\nThis Country star Daisy May Cooper, 38, reveals she doesn't want any more children after a 'terrible and scary' labour with third son\n\nBritish film icon Dick Pope dies aged 77 as Tom Hardy pays tribute to 'lovely friend and all round legend'\n\nEXCLUSIVETom Parker's widow Kelsey reveals the couple's children 'love' her new boyfriend and says she believes The Wanted star helped bring them together \n\nAshley Banjo recalls the surreal moment he received a surprise phonecall from Prince Harry and jokes he 'should have poached his number'\n\nGwyneth Paltrow reveals why she is experiencing 'waves of grief and sadness' this year\n\nOre Oduba's wife Portia says that 'better days are ahead' after their shock split as she finds a poignant letter at train station\n\nZach Bryan slammed after teasing new song 'Rockaway' amid Brianna Chickenfry break-up drama\n\nAnna Kendrick recalls 'abusive, awful' ex and the one thing she needs in future partners\n\nStanley Tucci admits he 'couldn't get a job' after his iconic role in The Devil Wears Prada and had to take jobs 'he didn't really want to' \n\nAmanda Holden dons her best business chic in a grey tailored suit while Ashley Roberts sports a figure-hugging midi-dress as they leave Heart Breakfast show\n\nGeorgia Harrison reveals new romance after horrific revenge porn ordeal as she credits Celebrity: SAS win with helping her to 'overcome her trauma'\n\nJustin Bieber plans to sue business managers claiming years of mismanaging his finances that meant he lost thousands\n\nBalmoral knees-up! King Charles to host 'parties and weddings' near late Queen's beloved home \n\nEXCLUSIVEInside story of Strictly love triangle: Truth behind photo of Maura Higgins and Kai and why Pete Wicks is 'playing with fire', insiders reveal\n\nVictoria's Secret model Ashley Graham becomes the latest star to back a non-alcoholic drink\n\nSARAH VINE: This is the real harm that Amanda Abbington has done in her Kafkaesque pursuit of Strictly's Giovanni... and it betrays us all\n\nLady Victoria Hervey shows off her svelte physique in a champagne halterneck dress as she attends LURA's debut launch\n\nLisa Faulkner looks upbeat as she gets stuck into food campaign after her husband John Torode and Gregg Wallace were criticised for rude jokes\n\nInside Kim Kardashian's lavish Wicked pajama party with Ariana Grande and Cynthia Erivo\n\nGreat British Bake Off's new Prince Charming! Aspiring chef Dylan, 20, leaves fans swooning as he's likened to a Disney heartthrob \n\nAlex Jones, 47, takes son Teddy, 7, to work with her at The One Show after battling mum guilt\n\nClarkson's Farm star Kaleb Cooper reveals he accidentally snubbed David Beckham as he shares hilarious story\n\nGabby Logan reveals major bedroom move has been the secret to her 23-year marriage to husband Kenny after he shared the impact his cancer battle had on their sex life\n\nSelena Gomez makes the rare move of showing off her pimples as she is 'stressed' from Emilia Perez's Oscar buzz\n\nMarcus Rashford's £2.5m Cheshire mansion is STILL not finished four years after he bought the site... and there's one huge catch \n\nFilm fans divided over whether Demi Moore's The Substance is a comedy or horror after Golden Globes submission\n\nEXCLUSIVELove Island's Ovie Soko claims reality shows should have an age restriction as he calls for better 'young fame aftercare' following Liam Payne's death\n\nPete Wicks issues major warning to his girlfriend and reveals he's the reasonwhy his relationships don't work out as Maura Higgins confirms their romance\n\nStrictly's Wynne Evans and Katya Jones are all smiles while out shopping on London's Oxford Street after controversy surrounding 'wandering hand' incident\n\nKylie Jenner puts on a VERY busty display in a plunging vest before flaunting her incredible abs in a skin-tight red co-ord\n\nMyleene Klass, 46, reveals the truth behind THAT braless look after fans thought she was 'defying the laws of gravity and age' \n\nCat Deeley fights back tears after an emotional birthday surprise live on This Morning - as gushing fans flood her with support\n\nMichelle Keegan reveals the secret to her incredible figure as she shares sizzling workout snap\n\nAnt Middleton admits he became 'an emotional and physical wreck' after climbing the second-highest mountain on Earth just days after paying tribute to 'little brother' Liam Payne\n\nElizabeth Hurley, 59, cuts a chic figure in a sparkly blazer as she and her son Damian support longtime friend Joan Collins, 91, at her One Night Only show in London\n\nHolly Hagan shows off her incredible three stone weight loss and admits cruel trolls led her to 'stop showing up and creating content' \n\nClarkson's Farm star Kaleb Cooper shares health update on Jeremy Clarkson after the presenter revealed he underwent an urgent heart operation\n\nTom Holland confirms he WILL return as Spider-Man for a long-awaited fourth film - but fails to reveal whether girlfriend Zendaya will reprise her role\n\nZoe Saldana cuts a glamorous figure in a blue backless satin gown as she attends the Annual Celebration of Latino Cinema and Television\n\nLegendary 70s band are forced to cancel their gig in Texas just HOURS before taking to the stage\n\nRichard Madeley pays tribute to John Stapleton on first TV interview since Parkinson's diagnosis on Good Morning Britain\n\nThe Chase fans concerned for contestant as he sports bruised face and split lip on ITV quiz show - before Paul Sinha takes a brutal swipe\n\nNicole Kidman, 57, reveals why she was forced to pause filming on her erotic drama Babygirl\n\nThe Great British Bake Off fans all have the same complaint just minutes into latest Channel 4 episode\n\nBig Brother fans left in HYSTERICS over 'chickengate' as the house descends into chaos over cooking\n\nShakira wows in silicon bra as she confesses she found it difficult to 'recognise her vulnerability' while grieving her split from Gerard Piqué\n\nEXCLUSIVEBeckingham Palace... Miami! Grinning David Beckham inspects his new £60m waterfront mega-mansion\n\nKatie Price poses in black sports bra as she continues to endorse brands after bragging she is making 'millions' despite bankruptcy\n\nMoment Diddy lets out creepy laugh as he invites a 13-year-old Daveigh Chase to a party in resurfaced video amid latest sex abuse allegations\n\nEmma King, the actress wife of Rivals star Alex Hassell, met him at drama school - and has already warned him to stop getting his kit off\n\nCoronation Street in schedule shake-up as soap pulled from screens this week - and bags rare weekend slot instead\n\nJuliette Lewis, 51, cuts a glamorous figure in black off-the-shoulder dress as she attends a special screening of her new film The Thicket\n\nEmily Atack poses with her Rivals co-star David Tennant as she shares glamorous BTS snaps - after wowing critics with THOSE nude scenes\n\nDominic West cosies up to lookalike daughters Martha, 26, and Dora, 18, as he celebrates his 55th birthday\n\nColeen Nolan shares heart-wrenching update on her sister Linda's cancer battle live on Loose Women\n\nThe Hairy Bikers' Si King pays tear-jerking tribute to late co-star Dave Myers in first TV interview since his death\n\nNewlyweds Ed Westwick and Amy Jackson look happier than ever as they walk arm-in-arm after romantic dinner in Paris\n\nLiam Payne's father given heartbreaking news 'he could be waiting 10 days' before 31-year-old's body can be flown home\n\nDebbie Harry, 79, looks youthful as she dons a sheer blouse to celebrate her new Gucci campaign with an intimate dinner in NYC\n\nEXCLUSIVEMrs Brown's Boys star Brendan O'Carroll mounts extraordinary defence of N-word jokes\n\nStrictly's Paul Merson, 56, admits his body was telling him 'it was the right time to go' after struggling with 'knee and ankle problems' \n\nGlowing Jennifer Lopez shakes off $68M real estate nightmare as she enjoys luxury outing in Beverly Hills\n\nDame Arlene Phillips, 81, hints at Strictly return after she was axed from judging panel 15 years ago\n\nJames Blunt SLAMS 'two-faced' Noel Gallagher after he moved HOUSE to get away from him as he calls out two other icons\n\nLarsa Pippen models sexy slip dress as she leads Housewives stars at Guerdy Abraira's party\n\nMargaret Qualley dresses down for a romantic late night stroll with her husband Jack Antonoff after revealing how he helped her land her dream role\n\nKing Charles and Queen Camilla touch down in Samoa: Monarch to be handed high chief title in touching gesture ahead of Commonwealth summit\n\nShawn Mendes appears to address gay rumors in new song: 'You can say I like girls or boys...'\n\nSelena Gomez is friendly to fans as she signs autographs and takes selfies while arriving at LA hotel\n\nTrinny Woodall reveals the VERY shocking x-rated comment chat show king Michael Parkinson made to her about Meg Ryan after interview\n\nVictoria, the comeback queen of fashion: Royals from around world pay homage to Britain's brand Beckham\n\nBruce Springsteen talks 'questions of mortality' amid wife Patti Scialfa's battle with rare blood cancer\n\nBoy band singer shows off dramatically different look after impressive weight loss - as he heads to an early morning gym session \n\nPaul Mescal and Gracie Abrams enjoy date night after star supported her at Taylor Swift's Miami Eras Tour show\n\nAndy becomes the next contestant to be eliminated from the Great British Bake Off after his Paris-Brest tower dramatically COLLAPSES\n\nAussie actress once married to Sean Penn goes topless in shockingly raunchy scenes for new Apple TV show starring Sacha Baron Cohen\n\nAmanda Abbington hits back at Giovanni Pernice as she insists he is 'gaslighting' her following after revealing HIS side of the story in Mail+ interview\n\nSam Smith puts on a leggy display in black shorts teamed with a pink shirt as they head for a leisurely lunch with pals in New York\n\nRihanna parties with A$AP Rocky at Zouk nightclub in her native Barbados after his shooting trial was postponed\n\nAdvertisement\n\nMORE DON'T MISS\n\nDiddy's son slammed for 'tone-deaf' home video featuring disgraced hip-hop mogul amid sex trafficking case\n\nQuincy Brown brags about his lavish lifestyle\n\nElon Musk's ex Grimes, 36, sparks debate by claiming she became 'way less gay' after getting pregnant\n\nTaylor Swift fans slam Shakira for 'copycat' Eras tour: 'So obvious'\n\nCamila Cabello flashes her abs and derriere in a sheer dress as she arrives at Doja Cat's 29th birthday party in Hollywood\n\nBizarre meaning behind North West's $20,000 'Skibidi Toilet' birthday gift for Kim Kardashian revealed\n\nUma Thurman, 54, looks glamorous in a black gown at the 25th Annual Room to Grow Gala in New York City\n\nLisa Snowdon, 52, looks incredible in a skimpy pink leopard print bikini as she poses for sizzling snap on holiday\n\nSarah Jessica Parker models glamorous pink gown on NYC set of And Just Like That\n\nTopless Madonna, 66, puts on a very raunchy display in nearly nude snaps while eating\n\nA glass of red please! The VERY telling sign that Queen Camilla was ready for an evening on the couch after a hectic day in Sydney\n\nLove Island's Amber Gill shows off some serious leg in a sexy grey trench coat as she joins ab-flashing Joanna Chimonides at the Captain Morgan event\n\nNicky Hilton puts on a leggy display in red sequin minidress as she celebrates launch of her new clothing collection with star-studded cocktail party\n\nPregnant Charlotte Dawson makes light of fiancé Matthew Sarsfield's sexting scandal with hilarious couples Halloween costume\n\nMaura Higgins FINALLY confirms romance with Pete Wicks as the pair kiss at Pride of Britain party after she got cosy with Kai Widdrington\n\nBaywatch star David Hasselhoff breaks silence over Michael Newman's tragic death with moving tribute\n\nNara Smith has epic four-word response to Ariana Grande's impression of her 'tradwife' TikToks\n\nChaos at Travis Scott's sold out Melbourne show Down Under as fans rush security to force way into the mosh pit\n\nKathy Bates fans delight over Matlock season 2 decision despite veteran star's vow to retire from acting\n\nHayden Panettiere reveals new nose ring on rare outing after sparking fan fears with 'slurred words' interview\n\nTrinny Woodall reveals what shocks her most now about What Not To Wear after daughter Lyla admitted she thinks her mother would be 'cancelled' \n\nMichelle Keegan wows in a black bardot top as she flashes a smile in a slew of stunning social media snaps\n\nAmanda Abbington cuts a stylish figure in all black atJamie Allan's Amaze press night after hitting back at Giovanni Pernice\n\nScott Mills reveals the kind words Liam Payne's father Geoff shared following the One Direction star's tragic death\n\nOnly Connect viewers 'forced to mute' show after just seconds as they brand host Victoria Coren Mitchell's 'awful' intro the 'worst 30 seconds of their week'\n\n'Mortified' Yoko Ono overheard John Lennon's 'loud, raucous sex' with another woman while they were married\n\nOliver Hudson talks childhood 'anger' over mom Goldie Hawn's fame: 'I hated when people asked for autographs'\n\nTragic Liam Payne 'never stopped loving Cheryl': Simon Cowell's brother says singer's death will be 'so difficult' for his ex partner \n\nEddie Redmayne looks dapper in a grey suit as he joins glamorous wife Hannah Bagshawe at The Day Of The Jackal premiere in London\n\nLady Gaga looks to heal career with new single Disease after Joker: Folie à Deux flops\n\nRachael Ray says she has 'huge screaming matches' with husband - and reveals how they make up after\n\nZoe Kravitz reunites with Big Little Lies costar Shailene Woodley in NYC as they await season three script\n\nDavid and Victoria Beckham 'paid for their nine-bedroom £56million dream Miami mansion in CASH'\n\nRoyal fan surprises onlookers with her message for King Charles during Sydney visit with Queen Camilla\n\nNewly-engaged Holly Ramsay cuts a stylish figure in a little black dress as she attends cocktail party hosted by Nicky Hilton\n\nChristina Aguilera, 43, flaunts weight loss in eye-popping Halloween gown amid Ozempic rumors\n\nRochelle Humes admits she was 'in a bad way' after appearing on Strictly Come Dancing as she insists she 'could never' do the show again\n\nHailey Bieber flashes toned frame post-Pilates two months after welcoming son Jack with Justin Bieber\n\nBlake Lively is far from a diva as she waits for a table and poses with fans at NYC hot spot months after interview backlash\n\nPregnant Princess Beatrice steps out at her second party of the night as she joins Princess Diana's nieces at Estée Lauder dinner\n\nBig Brother fans shocked as Segun's savage comments about Ali are revealed to housemates amid THREE new rule breaks\n\nEDEN CONFIDENTIAL: Daughter of renowned artist Lucian Freud recalls her battle with booze\n\nBBC legend's son follows in his famous father's footsteps with new radio job as he jokes he's 'the world's oldest nepo baby'\n\nLashana Lynch looks radiant as she shows off her baby bump in midnight blue gown at The Day Of The Jackal premiere after revealing she is pregnant \n\nTop Gun: Maverick flight instructor is killed in air show horror crash\n\nManchester City player Phil Foden issued a yellow card in the face of a £60 parking fine on his £200,000 Mercedes G Wagon\n\nStoryville: Dogs Of War review: Take him with a pinch of salt, but this old mercenary is highly entertaining, writes CHRISTOPHER STEVENS\n\nGladiator II fans go wild over the sequel's popcorn bucket with augmented reality: 'Where do I buy it?!'\n\nKylie Minogue wows fans with response after a producer spills wine on her on The Kelly Clarkson Show\n\nBruce Springsteen, 75, reveals how he keeps his youthful looks\n\nPamela Anderson, 57, reveals whether she is dating again after 5th marriage crumbled\n\n90 Day Fiance fans stunned after Loren makes shock X-rated confession to transgender girlfriend Faith\n\nBaywatch star Michael Newman dead at age 68 after 18 year battle with Parkinson's Disease\n\nLove Island's Sophie Piper flaunts her jaw-dropping figure in a skimpy black bikini as she poses for sizzling snaps in Miami\n\nKatie Price takes aim at ex Peter Andre as she claims it was his 'lucky day' when he met her and reveals why they only communicate through lawyers\n\nEighties pop icon looks unrecognisable as she shops in London with her husband - but can YOU guess who she is?\n\nAlan Carr's ex husband Paul Drayton shares heartbreaking reason they are reuniting - three years after their split\n\nMakeup-free Lila Moss shows off her toned frame in skimpy brown gym gear as she steps out in NYC with an iced matcha latte\n\nMichelle Visage admits having sex with other men makes her open marriage with author David Case 'stronger'\n\nCardi B slams prank caller who 'sent CPS to her house' in explosive video: 'Don't mess with my f***ing kids!'\n\nThe shock moment MAFS UK's Sacha orders husband Ross OUT of their apartment following explosive row as their marriage crumbles\n\nNick Cannon admits he never saw freak offs at Diddy parties and claims 'so much is sensationalized'\n\nRihanna gets invitation from Los Angeles judge overseeing A$AP Rocky's case as he stands accused of shooting his friend\n\nJustin Bieber parties with wife Hailey at Doja Cat's A-list birthday bash after Liam Payne tribute and Diddy drama\n\nLana Del Rey married to Jeremy Dufrene by pastor with surprise link to Justin Bieber\n\nMarvel Studios angers fans by ditching Blade reboot starring Mahershala Ali from release calendar\n\nKanye and Bianca remain in Tokyo as drama around his lawsuit builds in the US\n\nKelly Clarkson shows off 60lb weight loss and cinched waist in ruched dress\n\nMadison Beer and Nick Austin spark BREAKUP rumors as 'couple unfollow each other' on social media\n\nRenee Zellweger's boyfriend Ant Anstead has friendly exchange with ex Christina Hall amid her divorce\n\nZach Bryan SLAMMED by fans over Brianna Chickenfry split amid claims he's on celeb dating app Raya\n\nAngelina Jolie and British rapper Akala's 'close' relationship explained amid romance rumors\n\nRafferty Law celebrates his two-year anniversary with girlfriend Rosa Ramirez during romantic meal and declares: 'I love you with all my heart'\n\nEXCLUSIVETerrified Lizzie Cundy reveals she's back behind the wheel for the first time after horrific car accident left her 'lucky to be alive' \n\nKatie Price SLAMS her 'toxic exes and accuses them of gaslighting' and being narcissistic' - whilst bragging about finances\n\nZach Bryan's ex Brianna Chickenfry breaks silence over shock split as she cries in emotional video\n\nPregnant Georgia Kousoulou rushes to hospital as unborn baby girl suffers 'reduced movement' - one year after suffering miscarriage\n\nEXCLUSIVEBritney Spears is finally working on new music after she was 'saved' by biopic and reconciliation with sons\n\nVivienne Westwood's granddaughter resigns from late designer's label and accuses boss of 'bullying' and 'betraying' Dame's legac\n\nImagine Dragons' Dan Reynolds enjoys shirtless stroll with girlfriend Minka Kelly in LA\n\nSerena Williams shares rare photo of daughters Olympia and Adira as they hit Taylor Swift's concert\n\nChateau DIY is renewed for two more years following the spin-off's rebrand after Channel 4 cut ties with Dick and Angel Strawbridge \n\nDaniel Radcliffe's former Harry Potter stunt double set to flog very treasured piece of memorabilia for £40k to pay for mobility equipment \n\nEXCLUSIVEColeen Rooney's secret new project revealed as she shows off her toned figure in fitted work out gear in behind-the-scenes images\n\nDavid Bowie centre dedicated to the music legend confirmed to open at London's V&A museum showcasing more than 90,000 iconic items\n\nRumer Willis shows off her bikini body in Fiji following split from baby daddy Derek Richard Thomas\n\nChristina Aguilera, 43, reveals she ruined her knees and feet with 'all this high heel nonsense'\n\nTracy Beaker cast haven't aged a day as they reunite nearly two decades after hit CBBC show was axed\n\nThis Is Us star Chrissy Metz, 44, details the horrible 'mental, physical, emotional abuse' she suffered as a child\n\nMAFS star Adam shows off his dramatic 2.5st weight loss as he hits the gym after upsetting his new bride by admitting he likes 'small brunettes'\n\nMolly-Mae Hague poses in a tiny triangle bikini whilst soaking up the Dubai winter sun on first solo trip with daughter Bambi after split from Tommy Fury\n\nRivals fans make desperate plea to Disney+ after binge-watching whole series in matter of days - and finale 'rocks their mental state'\n\nEXCLUSIVEJohn Torode heads out for a cycle as he moves on from 'sexual' comment to Cat Deeley amid backlash \n\nAnna Nicole Smith's daughter Dannielynn, 18, poses in Terrifier 2 Halloween costume with dad Larry Birkhead\n\nGiovanni Pernice insists he holds no ill will towards Amanda Abbington after bullying allegations as he hints at potential Strictly return\n\nNorth West buys mom Kim Kardashian bizarre necklace for her 44th birthday\n\nAntiques Roadshow guest 'overwhelmed' as he learns truth behind late father's £15 guitar hailed as an 'absolute beauty' and 'more than an instrument'\n\nPersonal trainer says Diddy 'passed him around like a party favor' for other celebs to sexually abuse\n\nKelly Rizzo gushes about how 'kind' new boyfriend Breckin Meyer has been as she mourns loss of Bob Saget\n\nDrew Barrymore makes X-rated confession as she reveals she had a 'good time' in her younger years\n\nEXCLUSIVEAlan Carr braces for tell-all book about his failed marriage as ex-husband Paul Drayton prepares to reveal all in explosive memoir \n\nThis Morning's Deidre Sanders admits 'I feel like a phoney' as she shares breast cancer update after undergoing surgery\n\nEminem has called Trump a 'brainwasher' and a 'racist'. Can he and Obama convince Michigan to back Harris?\n\nLoose Women viewers 'switch off' as they blast Ed Balls' ITV return after his disappearance from Good Morning Britain amid explosive bias row\n\nEXCLUSIVEZoe Saldana puts her arm around pal Blanca Blanco as they discuss 'excitement' over Emilia Perez\n\nRuth Langsford, 64, brandishes her wedding ring after ex-husband Eamonn Holmes, 64, took HUGE next step with girlfriend Katie Alexander, 42\n\nMillie Bobby Brown fans convinced Stranger Things star has had lip fillers after she shared makeup-free video\n\nEXCLUSIVELiam Payne shows off his moves as he messes around with his band members in resurfaced snaps from early One Direction video shoot\n\nColeen Rooney cuts a sporty figure in activewear as she heads to the gym laden with bags after being 'offered megabucks TV deal'\n\nThis Is Us star Milo Ventimiglia looks loved-up with his wife Jarah Mariano as she shows off her baby bump after pregnancy announcement\n\nQueen of clashing colours! Mary of Denmark stuns in power outfit as she meets fans in Germany\n\nSelena Gomez proves she is still going strong with Benny Blanco as they hold hands at Emilia Perez premiere\n\nKristin Cavallari breaks silence on ex-husband Jay Cutler's DUI arrest\n\nStrictly complicated: Maura Higgins gets close to dancer Kai Widdrington after she was linked to both Pete Wicks and ex Giovanni Pernice\n\nBoy Meets World star Danielle Fishel reveals heartbreaking reason why she didn't tell her kids she had cancer\n\nHelen Flanagan looks worse for wear as she stumbles into her taxi alongside Ekin-Su while Christine McGuinness blows kisses after Pride Of Britain Awards\n\nJonathan Ross shares 'special memory' of Liam Payne on his chat show in the wake of the One Direction star's tragic death\n\nEXCLUSIVEGiovanni tells his story in first interview: He reveals experience with Amanda Abbington, his torment, what happened in the training room\n\nEXCLUSIVEHow Justin Bieber's father runs an Instagram account that posts bikini pictures of the star's 6-YEAR-OLD sister \n\nTaylor Swift's fans go wild as they spot jewellery that is a loving nod to boyfriend Travis Kelce\n\nAlix Earle shares heartbreaking message on social media after boyfriend Braxton Berrios' season-ending injury\n\nLisa Faulkner looks downcast amid fury over husband John Torode's 'disgustingly sexual' comment to Cat Deeley \n\nHer mother has won several Oscars and worked with Tom Cruise and Selena Gomez. Who is she?\n\nThe Voice fans troll Gwen Stefani over her 'unrecognisable' appearance\n\nReal Housewives star Dawn Ward reveals shocking results of facelift on the 'worst day' of recovery after selling her multi-million pound mansion \n\nRita Ora flashes her taut midriff in a shaggy red sweater as she strikes a pose on a train platform during Japanese tour\n\n'It's ALL me!': Rivals actor Alex Hassell reveals he DID dare to bare his real penis in saucy tennis scene\n\nCarrie fans moan the TV industry is stuck in a 'remake pandemic' as Amazon announces new eight-part adaptation of Stephen King's novel\n\nMartha Stewart makes another bombshell confession about the ex-husband she cheated on\n\nPeaky Blinders FIRST LOOK: Stephen Graham returns as Hayden Stagg - hours after Cillian Murphy was spotted filming scenes in Birmingham\n\nEx-NBA star says Liam Payne could have been 'hearing voices' from drugs before death\n\nPaul Gascoigne's daughter 'is Mohamed Al-Fayed victim': British model reveals 'horrific' moment Harrods Tycoon sexually assaulted her\n\nSam Smith cuts a vibrant figure in an electric blue silk suit as they take to stage at God's Love We Deliver Golden Heart Awards in NYC\n\nEXCLUSIVEHow Hailey Bieber pushed husband Justin to perform with Don Toliver - and fuelled fears for his health\n\nStrictly Come Dancing star Paul Merson reveals his 'secret link' to one judge following after getting his marching orders from BBC show\n\nRoxy Jacenko, 44, puts on a cheeky display as she flashes her pert derrière on holiday\n\nRihanna puts on a low-key display as she and her partner A$AP Rocky battle the rain in Shanghai\n\nJunior Andre, 19, sweetly helps younger sister Princess, 17, with her outfit as siblings make a red carpet appearance at Pride of Britain Awards\n\nTragic Liam Payne and his girlfriend Kate Cassidy adopted dog called Nala from animal rescue shelter in Miami a month before he fell to his death \n\nEXCLUSIVE'It will never be fully behind them': Ex judge Arlene Phillips weighs in on the Strictly bullying scandal as she urges show to 'turn down the pressure'\n\nTrinny and Susannah 2.0! What Not To Wear stars' daughters Lyla Elichaoff and Esme Bertelsen say their mums 'would be cancelled now' \n\nDI Ray fans blast bosses for 'ruining the show' with 'ridiculous' cliffhanger - branding ITV crime thriller 'absolute garbage'\n\nTasha Ghouri dazzles in a glamorous white gown while bleary-eyed Helen Skelton hops in a taxi with giggling Dr Punam Krishan after Pride Of Britain Awards\n\nKing Charles' sweet three words to survivor of Australia's 'stolen generation' revealed - after he was heckled by Senator Lidia Thorpe\n\nPaddington Bear is given an official UK passport by the British Home Office as loveable character travels to Peru for his upcoming third film\n\nRichard E. Grant claims 'well-known household names' treated his daughter 'appallingly' when she worked as a production runner\n\nEXCLUSIVELiam Payne was 'preyed on' by dealers: Singer had been clean 'for weeks' and was winning battle against his demons\n\nRemind you of anyone? How Cruz Beckham's girlfriend Jackie Apostel, 29, is a dead ringer for his mother Victoria \n\nThe tell tale signs that have sparked fears for King Charles' health - as he's praised for bravely making the tour Down Under despite his gruelling cancer battle\n\nJoanna Lumley leads thousands of royal fans to welcome King Charles and Queen Camilla to Sydney Opera House\n\nGerard Pique accuses Shakira of being MISLEADING about their break-up - and says he's 'very happy' with his new girlfriend, 12 years his junior\n\nEXCLUSIVEVanessa Williams hints at a Desperate Housewives reunion but admits it will be 'hard to recreate the magic' \n\nCoronation Street fans devastated as soap icon quits the cobbles after a decade on screens\n\nMyleene Klass puts on a daring display as she goes braless in a plunging bright pink Barbie dress at Classic FM event\n\nNathalie Emmanuel catches the eye in a stylish tasselled maxi dress as she attends the Paris premiere of new film The Killer\n\nVictoria's Secret model Joy Corrigan displays her toned abs and flawless physique as she poses for fashion brand RTA in Beverly Hills\n\nKatie Piper is in high spirits as she leaves the Pride Of Britain Awards hand-in-hand with her husband Richard James Sutton - after hitting out at cruel troll\n\nCarrie Bradshaw's dark taste in literature revealed! Sarah Jessica Parker clutches copy of hit 1977 novel while filming And Just Like That in New York \n\nMarried At First Sight's Ellie Dix reveals shock details about wedding gown worn on the show\n\nBleary-eyed Helen Flanagan puts on an animated display with boyfriend Robbie Talbot as they hop into a taxi after the Pride Of Britain Awards\n\nDuncan Bannatyne's glamorous wife Nigora Whitehorn, 44, flashes her lingerie in a sheer dress as she joins her husband, 75, at the Pride Of Britain Awards\n\nVicky Pattison and husband Ercan Ramadan make their red carpet debut as a married couple at the Pride Of Britain Awards \n\nToday's headlines\n\nKing Charles' longtime friend Ian Farquhar, 78, who served as equerry to the Queen Mother died when he got...\n\nFarmer, 52, hogties 'trespassers' to his quad bike 'like rabbits' then drives them to the police station -...\n\nMan, 40, who drove the wrong way down the M6 killing two children, their father and his partner 'was a...\n\nEDEN CONFIDENTIAL: Frederick Forsyth's 'glamorous, beautiful' wife Sandy dies aged 76 after years-long...\n\nJENNI MURRAY: My godsons both made a terrifying discovery in their new homes. And this killer may be lurking...\n\nSeven-day plan to beat the Budget tax raid: JEFF PRESTRIDGE's essential guide can save you thousands\n\nSimple one-legged balancing test determines your biological age - so how old are YOU really?\n\nKylie Jenner shares how she got 'confident' again after gaining 60lbs from her 2nd child\n\nCharles is all white! King and Queen Camilla beam in matching summery outfits as they are welcomed into...\n\nDEAR JANE: My husband is upset after I revealed my body count... but I don't even think my number is that...\n\nNEIL BARNETT: We're already at war with Russia... we just haven't woken up to it yet\n\nCadbury's brings back 'extinct' chocolate bar as shoppers rush to high street supermarket to get them before...\n\nYes, you CAN have too many orgasms! TRACEY COX reveals the dangers of excessive climaxing after Nicole...\n\nI got his mistress sacked and told him his best man made a move on me. The delicious and ingenious ways we...\n\nHow to beat arthritis: The definitive doctors' guide to the treatments that work, what to do if it's early...\n\nChris Kaba jury wanted to make public statement but were gagged by judge who ruled their note must not be...\n\nTyson Fury reveals his wife Paris tragically suffered a miscarriage the day before his heavyweight title...\n\nWoman, 60, arrested on suspicion of manslaughter after three people found dead at Dorset care home amid...\n\nSNP's minimum pricing law for alcohol just left Scottish drinkers poorer - and had 'no significant effects'...\n\nLiam Payne's girlfriend Kate Cassidy reveals he gave her a note before he died revealing his plans to marry...\n\nHow Hamas's corrupt billionaire leaders cruelly lined their own pockets with cash meant for poverty-stricken...\n\nEvil killer who lured army veteran into horrific sex trap murder using gay dating app is jailed for 37...\n\nRow over Labour 'interfering' in US election deepens despite Starmer's battles to defuse it - as party...\n\nDonald Trump allegedly 'groped' a model after she met him through Jeffrey Epstein\n\nBig Brother pulls episode amid anti-Semitism row after housemate wears T-shirt 'portraying genocidal views'...\n\nLabour is urged to fix Britain's 'obesity public health emergency' by BANNING all junk food advertising and...\n\nDAILY MAIL COMMENT: The perils of yet another Labour pension raid\n\nKamala Harris compares Trump to Hitler and calls him a 'fascist' in three-minute plea to America\n\n90s rocker Matthew Sweet, 60, suffers huge 'debilitating' stroke while on tour\n\nThe miracle newborn who survived after mother fell 90ft to her death from tenth floor window: Grieving...\n\nGeoff Capes dead at 75: Two-time world's strongest man and Britain's most famous shot-putter passes away\n\nThe 28 best used cars experts say you should consider in 2024 with a Volvo picked at number one\n\nArmy veteran left Tory MP fearing for her safety when he told her he was 'trained to be the best' and she...\n\nWomen are making a mistake in the gym that could leave them with an agonising infection, doctor warns\n\nGladiators star Falcon leaves staggering sum in her will after dying aged 59 last year following cancer...\n\nHeartless teen boy films himself tossing puppies into flaming furnace\n\nThe ultra-processed foods you don't realise are damaging your health. A top nutritionist reveals the...\n\nAbercrombie CEO Mike Jeffries took male models into room to be sexually assaulted after fake job interviews,...\n\nPassengers on Royal Caribbean's Taylor Swift-themed cruise describe chaotic scene after woman jumped from...\n\nTurkey strikes Kurdish militant targets in Iraq and Syria following deadly terrorist attack on defence...\n\nNow FRANCE follows Germany and reinstates border controls due to 'serious threats posed by terrorists and...\n\nThe Gulf Stream is on the verge of COLLAPSING, leading climate change scientists warn - plunging the UK into...\n\nSingle-use vapes 'WILL be banned in the UK by next summer' amid crackdown on children smoking e-cigarettes\n\nHow an oligarch known as 'The Python' who lives in a Bond-villain lair will determine the future of a vital...\n\nTrump: The Criminal Conspiracy Case review: How Donald threatened and bullied like Tony Soprano to cling to...\n\nRachel Reeves says her Budget next week will deliver an economic 'reset' for the UK - but warns of 'pain'...\n\nOBITUARY: Ace shot-putter, television star, Olympian... and budgie breeder! To suggest Geoff Capes crammed a...\n\nWorld hit by internet blackouts after ANOTHER Boeing failure\n\nSchool pays tribute to 'loved and cherished' 12-year-old girl who died in 'a game gone wrong' at her home\n\nSara Sharif's father leaves dock in tears as neighbour tells court how stepmother would regularly shout...\n\nMORE HEADLINES\n\nLiam Payne's girlfriend Kate Cassidy reveals he gave her a note before he died revealing his plans to marry her\n\nThe miracle newborn who survived after mother fell 90ft to her death from tenth floor window: Grieving daughter shares photo of baby 'Posie' in hospital - as tragic mum's last post is revealed\n\nTragedy as three people die and four rushed to hospital after 'suspected carbon monoxide leak' at Dorset care home - as Hazmat responders scramble to scene\n\nCadbury's brings back 'extinct' chocolate bar as shoppers rush to high street supermarket to get them before they sell out\n\nPublic sector workers' golden pension pots 'will be spared' Chancellor's £15BILLION national insurance raid in Budget - leaving private sector firms and staff to bear the whole burden\n\nKing Charles' longtime friend Ian Farquhar, 78, who served as equerry to the Queen Mother died when he got trapped between wall and his bed while drunk, inquest hears\n\nTwo people are rushed to hospital as emergency services respond to 'major incident' at Dorset care home - while staff are 'seen hugging and crying' outside\n\nBitter inheritance row after elderly stamp collector sells his £200k collection to his cleaner for just £1 - before leaving his step-children out of his will and giving her most of his £250k estate\n\nPregnant mother-of-five falls to her death from tower block but her newborn baby survives the tragic plunge and fights for life in hospital\n\nFarmer, 52, hogties 'trespassers' to his quad bike 'like rabbits' then drives them to the police station - before HE is arrested\n\nMoment male and female terrorists storm Turkish defence company after 'suicide bomb' rocks building as attack leaves four dead and 14 injured\n\nBirmingham Airport suspends flights as police deal with 'suspicious vehicle': Passengers left stuck on planes and getaways in chaos as holidaymakers warned NOT to come to terminal\n\nChris Kaba jury wanted to make public statement but were gagged by judge who ruled their note must not be made public\n\n'How could you have betrayed me?' Wife dramatically confronts Monster of Avignon for 'letting strangers into our bedroom' to 'rape me 100 times' as she tells trial she is 'a completely destroyed woman'\n\nSchool pays tribute to 'loved and cherished' 12-year-old girl who died in 'a game gone wrong' at her home\n\nBoy, 14, killed himself after AI chatbot he was in love with sent him eerie message\n\nSkoda driver, 40, killed in horror M6 crash that also claimed the lives of four members of same family is named\n\nNow FRANCE follows Germany and reinstates border controls due to 'serious threats posed by terrorists and migratory flows' in latest blow to EU Schengen scheme\n\nRalph Blunsom dead aged 66: ITV News anchor dies as co-stars share heartbreaking tributes\n\nElon Musk wades in as Donald Trump sues Britain's Labour Party for interfering in election\n\nWoman, 60, arrested on suspicion of manslaughter after three people found dead at Dorset care home amid suspected carbon monoxide leak\n\nOnlyFans model, 29, who blackmailed married man by threatening to tell his wife after he subscribed to her channel avoids prison\n\nRevealed: Judge's chilling prediction about Chris Kaba three years before he was shot by Met Police marksman\n\nSarah Beeny's furious neighbours back council demand to demolish parts of her £3m 'mini Downton Abbey' built without permission\n\nDavid Beckham beams as he strolls around his new $77m Miami mega-mansion as he and Victoria move into exclusive waterfront enclave\n\nThe face of dignity: Gisele Pelicot is cheered outside mass rape trial after confronting her husband to ask 'How could you betray me?' and revealing she feared he had made men abuse her as REVENGE for her affair\n\nNewly married PC romped with female junior in police station and patrol car - but was reported to bosses when his mistress's partner found steamy messages between the pair\n\nMrs Brown's Boys star Brendan O'Carroll mounts extraordinary defence of N-word jokes\n\nNewborn baby fighting for its life after heavily pregnant woman, in her 30s, plunges to her death from 17-storey tower block\n\nRevealed: Victoria Taylor's tragic final footsteps as body of mother, 34, is found three weeks after she went missing\n\nMcDonald's shares plummet after E Coli outbreak kills one and leaves dozens sick across ten states\n\nDog walker in her 80s is trampled to death by a cow in New Forest - days after man, 63, was charged at by an animal in same spot\n\nMOST READ IN DETAIL\n\nNEW ARTICLESHomeTop\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Idris Elba has revealed that he wants to settle in Africa within a decade.","url":"https://www.dailymail.co.uk/tvshowbiz/article-13994725/Idris-Elba-reveals-wants-settle-Africa-decade-amid-plans-help-bolster-film-industry-opening-studios-Zanzibar-Ghana.html","image":"https://i.dailymail.co.uk/1s/2024/10/24/01/91215437-0-image-m-199_1729730028708.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/04/18/2471292026215513228/1024x576_MP4_2471292026215513228.mp4","publish_date":"2024-10-24 00:53:57","author":"Amelia Wynne,Editor","authors":["Amelia Wynne","Editor"],"language":"en","source_country":"gb","sentiment":0.157},{"id":260863480,"title":"Rudy Giuliani To Hand Over Au78m Glitzy Apartment","text":"A judge in New York City has ordered its former mayor, Rudy Giuliani, to hand over control of his apartment on Manhattan’s rich Upper East Side, along with his highly valuable baseball memorabilia, to a pair of election workers he defamed in 2020.\n\nMr Giuliani, a prosecutor before he turned to politics, will be forced to fork over his three-bedroom apartment on East 66th Street, a prime location.\n\nHe will also lose a Mercedes-Benz SL500 and other valuables, including cash, to Ruby Freeman and her daughter, Wandrea Moss, per the ruling in their $US148 million ($A223 million) defamation case against him, The New York Postreports.\n\nMr Giuliani, 80, has seven days to turn over his apartment – whose price he recently slashed by a million US dollars in a last-ditch bid to offload it – into a receivership controlled by Ms Freeman and Ms Moss.\n\nThe three-bedroom, three-bathroom condo, priced at $US5.18 million ($A7.8 million) as of earlier this month, boasts a wood-panelled library, a wood-burning fireplace and views of Central Park.\n\nMr Giuliani has also been ordered, by Judge Lewis Liman, to turn over a picture signed by legendary New York Yankees player Reggie Jackson, a replica of Joe DiMaggio’s jersey, also signed, more than 20 luxury watches, a diamond, cash and furniture.\n\n“The Court also does not doubt that certain of the items may have sentimental value to defendant,” Judge Liman wrote in his 24-page ruling.\n\n“But that does not entitle the defendant to continued enjoyment of the assets to the detriment of the plaintiffs, to whom he owes approximately $US150 million ($A226 million).”\n\nA federal jury awarded the two Georgia election workers the whopping judgment last year.\n\nJudge Liman has yet to rule on whether the former New York City mayor will also need to hand over his valuable Yankees World Series rings, which his son Andrew claims were given to him as a gift.\n\nThe judge also reserved judgment for now on whether or not to force Mr Giuliani to turn over his multimillion-dollar condo in Palm Beach, Florida.\n\nThe Fulton County workers filed the lawsuit against the man once lionised as “America’s mayor”, given his role in the wake of the 9/11 terror attacks, in 2021, claiming his lies that they processed fraudulent ballots during the 2020 presidential election led to them facing threats and racist verbal attacks.\n\nMr Giuliani was found liable for defaming Ms Moss and Ms Freeman in August of 2023, having failed to divulge electronic messages and financial records that the women’s’ lawyers were entitled to during the litigation.\n\nThe former mayor led Donald Trump’s legal team after the 2020 election. Mr Trump’s team launched more than 60 lawsuits challenging the results, citing his allegations of widespread voter fraud. Those lawsuits went nowhere due to a lack of evidence.\n\nThis story first appeared on The New York Post and has been republished with permission.","url":"https://www.ntnews.com.au/real-estate/national/celebrity/rudy-giuliani-to-hand-over-au78m-glitzy-apartment/news-story/b82e87cffbef1a9c03c01b0f4cbffc58","image":"https://www.realestate.com.au/news/wp-content/uploads/2024/10/capi_b82e87cffbef1a9c03c01b0f4cbffc58_60d00c67bd757e70a57aeddec8be8ce2.jpeg","video":null,"publish_date":"2024-10-24 00:53:28","author":null,"language":"en","source_country":"au","sentiment":0.017},{"id":260863378,"title":"Tesla CEO Elon Musk's $1 million giveaway might violate federal law according to Justice Department","text":"Tesla CEO Elon Musk has recently stated that his super PAC would be giving away $1 million to a random person who signs a petition. This petition requires signatories to be registered voters. This situation has led the Justice Department to state that this giveaway might violate federal law.\n\n\r\nKristine was today’s recipient of the $1 MILLION for signing our petition to support the ConstitutionEvery day until Election Day, a registered swing state voter who signs the petition will be selected to earn $1M as a spokesperson for America PACSIGN: https://t.co/TMeyWUhbrH pic.twitter.com/1mqkJ2rmvS\r\n— America (@america) October 21, 2024\n\n\r\n\r\n\nOn October 23, 2024, CNN reported that the Justice Department has warned Tesla CEO Elon Musk that his $1 million daily giveaway for signing a petition may violate federal law. This giveaway announcement was made during a Trump campaign event in Harrisburg, Pennsylvania.\n\n“We want to try to get over a million, maybe 2 million voters in the battleground states to sign the petition in support of the First and Second Amendment,” Elon stated at the event. “We are going to be awarding $1 million randomly to people who have signed the petition, every day, from now until the election.” The catch here is that only registered voters are allowed to sign the petition.\n\nElon Musk’s PAC has taken to social media to share videos of the various winners of the $1 million giveaway. However, as CNN points out, the recipients of the giveaway are stated to have earned the money. “Every day until Election Day, a person who signs will be selected to earn $1M as a spokesperson for America PAC.” Eligibility is also limited to registered voters of Arizona, Michigan, Georgia, Nevada, North Carolina, Pennsylvania, or Wisconsin.\n\nThe giveaway, or earnings, will end up amounting to roughly $17 million dollars, assuming the last eligible day is November 4. Elon Musk’s net worth is currently $243.4 billion.\n\nElon Musk is seemingly no stranger to receiving warnings from various government bodies and regulatory boards. Previously, the multibillionaire was warned by the EU with legal action over disinformation on his social media platform. The United Auto Workers recently filed a labor lawsuit against both Elon Musk and Donald Trump regarding comments about firing workers that go on strike.\n\nWith the United States of America election coming up on November 5, 2024, all eyes will likely be on the Justice Department as it decides whether or not this giveaway/earnings violate federal law.","summary":"Elon Musk previously promised to give away $1 million a day to anyone who signed a petition to support the First and Second Amendment freedoms.","url":"https://www.shacknews.com/article/141938/tesla-ceo-elon-musk-1-million-dollar-petition-federal-law","image":"https://d1lss44hh2trtw.cloudfront.net/assets/article/2024/10/23/tesla-ceo-elon-musk-1-million-dollar-petition-federal-law_feature.jpg","video":null,"publish_date":"2024-10-24 00:51:29","author":"Sam Chandler","authors":["Sam Chandler"],"language":"en","category":"politics","source_country":"us","sentiment":-0.214},{"id":260863406,"title":"Kyodo News Digest: Oct. 24, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nTOKYO - Japan's ruling Liberal Democratic Party on Wednesday came under fresh scrutiny ahead of a weekend general election after revelations that it had provided funds to local chapters headed by members running without official endorsements due to their involvement in a money scandal.\n\nAccording to a party source, the LDP allocated 20 million yen ($130,000) to each chapter, regardless of who heads it. However, the practice drew immediate criticism from opposition party leaders, who viewed it as a way to covertly support scandal-hit members running without the LDP's official backing.\n\nWASHINGTON - The U.S. government said Wednesday at least 3,000 troops from North Korea were sent to Russia earlier this month and they are now undergoing training at military bases.\n\nWhite House national security spokesman John Kirby confirmed the troop dispatch during a press briefing, saying they were transported by ship between early and mid-October to eastern Russia from North Korea's Wonsan area.\n\nBOJ chief warns of risks of raising interest rates too slowly\n\nWASHINGTON - Bank of Japan Governor Kazuo Ueda on Wednesday warned of the risks of moving too slowly in raising interest rates, saying striking the right balance is crucial for the Japanese economy to grow in a sustainable way.\n\n\"Uncertainties are everywhere, any time...when there's huge uncertainty, you usually want to proceed cautiously and gradually,\" Ueda said at an event in Washington, held on the sidelines of the International Monetary Fund and the World Bank's autumn meetings.\n\nKANAZAWA, Japan - A Japanese court decided Wednesday to order a retrial for a man who served a seven-year prison sentence over the 1986 murder of a junior high school girl in central Japan, questioning the credibility of the testimonies that led to his conviction.\n\nIn ordering a retrial for Shoshi Maekawa, 59, the Kanazawa branch of the Nagoya High Court cited the possibility that one of the statements was false and motivated by self-interest. Maekawa has maintained his innocence since he was arrested in 1987.\n\nTop Biden aide stresses U.S. trade approach toward China \"targeted\"\n\nWASHINGTON - U.S. President Joe Biden's approach toward China on trade issues is \"targeted\" and in lockstep with allies, his top national security aide said Wednesday, drawing a contrast with that of Donald Trump, the Republican nominee seeking to return to the White House.\n\nWhile stopping short of any comments on next month's U.S. presidential election, Jake Sullivan made the case at a think tank event in Washington that the Biden administration has chosen to move away from some long-standing policies deemed ineffective rather than walking away from international trade and investment.\n\nXi highlights nuke-capable missile role in Taiwan strategy: reports\n\nBEIJING - Chinese President Xi Jinping is believed to have visited last week a Rocket Force brigade tasked to operate in areas including the Taiwan Strait and inspected nuclear-capable ballistic missiles that can reach the U.S. territory of Guam, according to Hong Kong and Singaporean media reports.\n\nXi's inspection of the brigade in the southeastern province of Anhui highlights the role of the intermediate-range missiles in China's strategy toward the self-ruled island, which it views as part of its territory, the reports said.\n\nSEOUL - North Korea has sent around 3,000 troops to Russia to support its efforts in the war against Ukraine, with the total expected to reach 10,000 by December, South Korean lawmakers said Wednesday after being briefed by the country's spy agency.\n\nThe United States, meanwhile, acknowledged that there is \"evidence\" North Korean troops are in Russia, with Defense Secretary Lloyd Austin saying it would be \"very, very serious\" if they would participate in the war in Europe.\n\nIsrael's domestic, overseas woes could lead to downfall: historian+\n\nLONDON - An Israeli historian based in Britain has said his homeland may be entering an irremediable decline as a result of its continued offensives against its neighbors following the terror attack by the Palestinian militant group Hamas a year ago.\n\nIlan Pappe, professor at the University of Exeter, told Kyodo News in a recent interview that he sees Israelis becoming less confident in their future, while more people in the world, including even some Jews, are having second thoughts about their involvement in the Middle Eastern country amid its military campaigns.\n\nVideo: Shohei Ohtani's 50th home run ball sold for record $4.39 mil.","summary":"TOKYO - \n About 2,200 lights are lit in Nagaoka, Niigata Prefecture, northwest of Tokyo, on Oct. 23, 2024, t...","url":"https://english.kyodonews.net/news/2024/10/f17fdb764dde-kyodo-news-digest-oct-24-2024--1-.html","image":"https://img.kyodonews.net/english/public/images/posts/8364f459750779f5f24ed8a01f1f0db5/photo_l.jpg","video":null,"publish_date":"2024-10-24 00:51:29","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.147},{"id":260864262,"title":"Trump Accused Of Groping Model He Met Through Jeffrey Epstein","text":"A former model has accused Donald Trump of groping her after the two were introduced by sexual abuser Jeffrey Epstein in the 1990s, The Guardian newspaper reported on Wednesday.Stacey Williams said she met the Republican White House candidate at a party in 1992 after being introduced by the disgraced financier, whom she had dated.\"It became very clear then that he and Donald were really, really good friends and spent a lot of time together,\" Williams was quoted as saying.Williams discussed the alleged assault on a call on Monday organized by Survivors for Kamala, a lobby group supporting Trump's Democratic presidential rival Kamala Harris.Epstein, who was convicted on sex offenses and killed himself in prison in 2019, paid Trump an impromptu visit with Williams in 1992 at his New York office block, where he pulled her toward him and began groping her, she alleged.Williams, now 56, says Trump put his hands \"all over\" her breasts, waist and buttocks, causing her to freeze on the spot, and she noticed that the two men appeared to be smiling at each other.The Trump campaign did not immediately respond to AFP's request for comment, but The Guardian quoted a campaign spokeswoman dismissing the allegations as a \"fake\" story.She said it was invented by the Harris campaign and described Williams \"a former activist\" for Democratic ex-president Barack Obama.Williams shared a postcard depicting Trump's south Florida mansion she said he had sent her agent after the episode, with the message, in his handwriting: \"Stacey - Your home away from home. Love Donald.\"Trump has been accused of sexual assault or harassment by more than 20 women but denies all wrongdoing.He was ordered by a New York court in January to pay $83.3 million to compensate the writer E. Jean Carroll, whom he was found liable for sexually assaulting and defaming.","summary":"A former model has accused Donald Trump of groping her after the two were introduced by sexual abuser Jeffrey Epstein in the 1990s, The Guardian newspaper reported on Wednesday.","url":"https://www.ibtimes.com/trump-accused-groping-model-he-met-through-jeffrey-epstein-3747938","image":"https://d.ibtimes.com/en/full/4556336/donald-trump-has-history-sexual-assault-harrassment-allegations-denies-wrongdoing.jpg","video":null,"publish_date":"2024-10-24 00:48:59","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.297},{"id":260863170,"title":"Rep. Mike Lawler says he deserves second term over taxes, border and public safety record","text":"Freshman US Rep. Mike Lawler said lower Hudson Valley voters should send him back to DC for another term because of his stances on taxes, border security and public safety.\n\nThe Republican told The Post’s editorial board Wednesday that there’s a stark choice between him and Democrat Mondaire Jones as they battle it out in New York’s 17th congressional district in one of the most closely watched contests in the state.\n\n“On affordability, he wants to increase taxes,” Lawler said of Jones, a former one-term congressman looking to make a comeback in the swing district.\n\nLawler said he would fight to lower taxes and at the very least preserve tax cuts approved by former President Donald Trump and the GOP-run Congress in 2017.\n\nThose tax reductions expire at the end of 2025.\n\nLawler said although corporate tax was slashed from 28% to 21% under Trump, a Democratic White House under nominee and current Vice President Kamala Harris could bring them back up to 28%.\n\nDemocrats are also looking to raise income taxes on higher-end earners, Lawler said.\n\nHe said Jones — along with Vice President and Democratic White House nominee Kamala Harris — want to raise the corporate taxes back to 28% from 21% and raise income taxes on higher end earners.\n\n“It would be the largest tax increase in American history,” Lawler said. \n\n“He wants the Trump tax cuts to expire.”\n\nThe 17th District, which includes Putnam and Rockland counties as well as parts of Westchester and Dutchess, is one of a few races in deeply blue New York that pundits think can go either way — and help decide which party controls the House of Representatives next year.\n\nThe closeness of the race has pushed the debate to the center, with Jones campaigning as a policy moderate after coming into office in 2021 on a decidedly progressive platform.\n\nLawler said Jones’ record includes “defunding police” — and he’s now shying away from past statements and associations — including being cozy with the hard left “Squad” and democratic socialist Rep. Alexandria Ocasio-Cortez.\n\nThe Republican has backing of virtually every union representing law enforcement and emergency responders, including the NYC PBA. Many Big Apple cops and firefighters reside in the district.\n\nLawler said he has a strong record in Congress backing Israel, including introducing and passing laws protecting the Jewish state.\n\nFor his part, Jones and the Democrats have tried to link Lawler to Trump — an effective approach in some suburban races north of the city years ago that the congressman said no longer has teeth according to polling.\n\n“This is not 2020,” Lawler said.\n\nHe said voters, with the exception of the Trump haters, rarely bring up the ex-president.\n\nLawler even joked that many constituents who saw the TV ad of Trump praising him as “spectacular’ liked it.\n\nMeanwhile, Lawler said one-party Democratic rule of the statehouse in Albany has been a disaster for New York — and those policies are also on the ballot.\n\nHe called ex-Gov. Andrew Cuomo’s decision to force the closure of the Indian Point nuclear power plant in Westchester “idiotic,” cutting off a major power supply for New York City and the region’s growing power needs.\n\nLawler also predicted that Gov. Kathy Hochul will flip again — after the Nov. 5 election — and revive the plan to impose a planned congestion toll to enter Manhattan Midtown. \n\nHochul in June suspended the proposal “indefinitely.” \n\nHe said Hochul postponed it as a political ruse at the behest of House Democratic leader Hakeem Jeffries, who feared at a backlash against House Democrats at the polls. \n\nLawler said it’s no contest on who supports stricter border enforcement.\n\n“[Jones] supported open borders, he wanted to defund ICE [US Immigration and Customs Enforcement] he called ICE agents terrorists,” the congressman said.","summary":"Freshman Republican Rep. Mike Lawler said voters have a stark choice in deciding whether to back his re-election or support ex-Democratic Congressman Mondaire Jones in the 17th House District.","url":"https://nypost.com/2024/10/23/us-news/rep-mike-lawler-says-he-deserves-second-term-over-taxes-border-and-public-safety-record/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/rep-mike-lawler-r-n-92244110.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/BWxXXU5S-RyIcpnTz.mp4","publish_date":"2024-10-24 00:44:50","author":"Carl Campanile","authors":["Carl Campanile"],"language":"en","source_country":"us","sentiment":-0.305},{"id":260863630,"title":"Watch Kamala Harris Slams Donald Trump Over Alleged Praise of Adolf Hitler - Bloomberg","text":"Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not\n blocking them from loading.\n For more information you can review our Terms of\n Service and Cookie Policy.","summary":"Watch Kamala Harris Slams Donald Trump Over Alleged Praise of Adolf Hitler  Bloomberg","url":"https://www.bloomberg.com/tosv2.html?vid=&uuid=a56ed1e7-91a2-11ef-80ab-7843bd35a9b2&url=L25ld3MvdmlkZW9zLzIwMjQtMTAtMjQva2FtYWxhLWhhcnJpcy1zbGFtcy1kb25hbGQtdHJ1bXAtb3Zlci1hbGxlZ2VkLXByYWlzZS1vZi1hZG9sZi1oaXRsZXI=","image":null,"video":null,"publish_date":"2024-10-24 00:44:00","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.124},{"id":260863404,"title":"With dueling rallies this week, Georgia is on the mind for Trump and Harris","text":"DULUTH, Ga. — If the road to the White House runs through seven swing states, then Georgia is a flashing neon sign at the end of the road for both campaigns.\n\nIt’s a state that President Biden won by just 12,000 votes in 2020, a state that was ground zero for both false claims of election fraud and the political fallout afterwards, and a state home to the key demographic groups that will help decide the next president.\n\nOn Wednesday, it was also the site of two events featuring former President Donald Trump. The Republican nominee spoke at a middle Georgia church for a “Ballots and Believers” town hall aimed at the evangelical base of the GOP, before heading to a rally in suburban Gwinnett County on the north side of Atlanta.\n\nThursday, Vice President Harris will hold a rally with former President Barack Obama in DeKalb County just east of Atlanta, as re-energized Democrats seek to mobilize their base of Black voters and keep intact the fractious coalition that narrowly elected Biden.\n\nGeorgia is a fast-growing state that has a large nonwhite voter population, a sizable share of college-educated suburban voters and plenty of young voters, all key constituencies that could influence the outcome in Georgia and other battlegrounds.\n\nNearly one in three Georgia voters have already cast their ballot in the presidential race, as elections officials tout record in-person early voting turnout.\n\nTrump painted a dire picture of the nation\n\nAt Christ Chapel church in Zebulon, Ga., Trump ticked through his usual campaign talking points around everything from immigration and hurricane recovery to oil production and his poll numbers.\n\nMuch like the rest of his campaign events, Trump painted a dire picture of the state of the country and what it would look like if he lost.\n\n“I think we really energized a lot of people this time, because they’ve seen how bad it is,” he said. “This last four years, it’s been a horror show. Absolute horror show.”\n\nHe also said there’s “persecution” going on against Catholics, school boards and “people of religion.”\n\nIn Gwinnett County, Trump was scheduled to appear at a rally put on by the conservative group Turning Point USA. Thousands were in attendance to see Trump, and to hear from more than a dozen local and national figures that have taken up the former president’s mantle, including Tucker Carlson, Robert F. Kennedy, Jr. and former Democratic congresswoman Tulsi Gabbard.\n\n“This is a very important distinction: Election Day is the last day of voting,” Turning Point founder Charlie Kirk said. “We have 12 days of voting left in this state ... So for those of you that already voted, you need to go find a low propensity voter. Someone that is a little shaky about voting, and get them out to the polls.”\n\nEarly voting statistics from Georgia show strong turnout from smaller Republican-heavy counties and those who reliably vote in Republican primaries. An analysis of those voters by NPR also found a large percentage of those are Republicans who are opting to vote earlier than they have in past elections.\n\nHarris to speak from the same spot Trump gave his Jan. 6 address\n\nHarris was last in Georgia over the weekend, speaking to an enthusiastic crowd of about 11,000 people at Lakewood Amphitheater and attending two church services, all the while attacking Trump’s energy level and scattershot speeches.\n\nHarris’ closing message is leaning heavily into warnings that Trump is not fit to be president again and is a threat to democracy. Her campaign said she will make that case on Tuesday, from the same spot on the National Mall that Trump spoke on Jan. 6, 2021, before a mob of his supporters headed to the Capitol in a failed insurrection attempt.\n\nHarris on Wednesday seized on remarks made by Trump’s former chief of staff, Retired Marine Gen. John Kelly, who called Trump a “fascist” with a “dictatorial” leadership style. Trump’s campaign has said Kelly fabricated his stories about the former president.\n\nHarris was set to appear at a CNN town hall in Pennsylvania on Wednesday night after Trump declined a second debate.\n\nHer campaign has also dispatched two of the party’s most beloved figures – former President Obama and his wife Michelle – to multiple swing states this week to boost turnout.","summary":"Vice President Harris and former President Donald Trump are both in Georgia this week, competing for votes in a crucial swing state where polls show a razor thin margin separating the two candidates.","url":"https://www.npr.org/2024/10/23/nx-s1-5162524/2024-election-kamala-harris-donald-trump-georgia","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5388x3031+0+343/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F19%2F9d%2F3e6abab245ac93e1a86ba7920898%2Fgettyimages-2180582778.jpg","video":null,"publish_date":"2024-10-24 00:35:07","author":"Stephen Fowler","authors":["Stephen Fowler"],"language":"en","source_country":"us","sentiment":0.059},{"id":260862996,"title":"Sister of slain Army private Trump reportedly disparaged says The Atlantic misled her about story's focus","text":"The sister and family lawyer of 20-year-old Vanessa Guillén, the slain Army private who The Atlantic claimed former President Trump disparaged while in office, appeared exclusively on \"The Ingraham Angle\" to rebuke the report. Mayra Guillén called out The Atlantic's \"vile\" editor-in-chief Jeffrey Goldberg who authored the report alleging Trump referred to his sister, the daughter of Mexican immigrants who was murdered by a fellow soldier at Fort Hood in 2020, as a \"f---ing Mexican\" and refused to pay the money he promised to provide for her funeral. \"It was just hurtful in all kinds of ways,\" Guillén told Fox News' Laura Ingraham on Wednesday. \"It brought back so many bad memories that we had given already after four long years, and it was just a slap in the face to my family, myself, being the main spokesperson for them and for my sister, who unfortunately passed away. It was just a lie from the very beginning, and it was very upsetting.\" THE ATLANTIC REPORT ALLEGING TRUMP DISPARAGED SLAIN ARMY PRIVATE BLASTED BY FAMILY, OTHERS: ‘ABSOLUTELY FALSE’ Natalie Khawam, the family attorney, said she was first confronted by Goldberg for the story back in January, but was told the story was about the four-year anniversary of Vanessa Guillén's murder. \"He first reached out to me, and he said he was interested in doing [a story of] the four-year anniversary of Vanessa's murder,\" Khawam said. \"I texted Mayra. I said, 'Hey, can you take it from here? You wanna speak to him about Vanessa's case? They're gonna discuss more issues about the case, things he found.' And she spoke to him in January. He reached out again to me just recently and this is where the story popped up and obviously bamboozled with. It wasn't really, you know, talking about Vanessa here. It was just a gotcha with Trump.\" ATLANTIC ARTICLE COMPARING TRUMP TO ‘HITLER, STALIN’ SPARKS CRITICISM ONLINE FROM JOURNALISTS, PUNDITS When asked whether she felt she was misled by Goldberg, Mayra Guillén replied \"most definitely.\" \"Initially, when we first spoke, he did mention that this was going to be, again, a wrap-up of the four-year anniversary and how we passed legislation and all the achievements that were done in Vanessa's honor,\" Guillén said, adding that Goldberg did not tell her about the disparaging comments he planned to report about Trump and that he told her he expected to story to be published around April. \"I released a statement to him, letting him know that I was not happy about what he was going to release, and I did not wish to be a part of it anymore, or have my sister's name be a part of that article. And he still proceeded to not only publish it, but basically stain my sister's image with this, and it's very upsetting,\" she later said. \"This piece… was full of lies,\" Khawam said. \"I myself spoke to him and I told him certain things. For a matter of fact, I said I could not speak about the issue about these things and not these things. And then he says, 'Natalie Khawam said this,' and that was not true. I mean, that's what really bothers me. I've worked with both sides of the aisle, with producers and reporters and the media for years, both sides of the aisle. I've never had to deal with somebody that just went that low below the belt just to get a story out. It was, quite honestly, it was wrong. It was unethical. And I had to take on that position of I'm gonna call him out.\" In response to \"The Ingraham Angle,\" The Atlantic issued a statement saying \"Everyone should read this essential reporting in The Atlantic.\" Goldberg also appeared to dismiss the criticism from Guillén, Khawam and others of his report, telling CNN \"I don't make much of them at all.\" \"The sister wasn't in the meeting. The lawyer for the family wasn't in the meeting. Mark Meadows was in the meeting. Kash Patel was in the meeting. A whole bunch of senior officials were in the meeting. I have sources who were sitting in that meeting. I have contemporaneous notes taken by participants in that meeting that describe exactly what I described in the story,\" Goldberg said Tuesday night. Goldberg began his report on Trump's interaction with the Guillén family in July 2020 when they visited the White House. While consoling the family, Trump offered offered to provide financial assistance to cover the funeral costs. But Goldberg reported Trump became enraged when he got the bill, refusing to pay it, saying, \"It doesn’t cost 60,000 bucks to bury a f---ing Mexican!\" According to the report, Khawam told Goldberg the family did not receive money from Trump and that the costs were ultimately covered in part by the Army and donations. CLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS Both Mayra Guillén and Khawam took to social media to blast the report. \"Wow. I don’t appreciate how you are exploiting my sister’s death for politics- hurtful & disrespectful to the important changes she made for service members,\" Guillén wrote on X. \"President Donald Trump did nothing but show respect to my family & Vanessa. In fact, I voted for President Trump today.\" The report included on-the-record denials from Trump's then-chief of staff Mark Meadows and Kash Patel, the former chief of staff of then-Acting Defense Secretary Christopher Miller, who allegedly were at the meeting. Meadows spoke out against The Atlantic. \"I was in the discussions featured in the Atlantic’s latest hit piece against President Trump. Let me say this. Any suggestion that President Trump disparaged Ms. Guillen or refused to pay for her funeral expenses is absolutely false,\" Meadows wrote on X. \"He was nothing but kind, gracious, and wanted to make sure that the military and the U.S. government did right by Vanessa Guillen and her family.\" CLICK HERE TO GET THE FOX NEWS APP Ben Williamson, Meadow's spokesman, shared a screenshot of the statement he provided to Goldberg saying, \"President Donald Trump absolutely did not say that,\" and called out how Goldberg \"translated\" that comment in the report, which said that Meadows \"denied having heard Trump make the statement.\" \"Treat this dishonest piece accordingly,\" Williamson warned.","summary":"Fox News&apos; Laura Ingraham spoke with the sister and family lawyer of Vanessa Guillén, the slain Army private who The Atlantic claimed former President Trump disparaged while in office","url":"https://www.foxnews.com/media/sister-slain-army-private-trump-reportedly-disparaged-says-atlantic-misled-her-storys-focus","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/guilleningrahm.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-24 00:31:09","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.307},{"id":260863364,"title":"The top election official in a politically crucial Nevada county says she was forced out - The Associated Press","text":"The top election official in one of the nation’s most politically important counties said Wednesday she was forced out of her role just weeks before the November presidential election, disputing an official statement that she asked for a leave after experiencing “stress issues.”\n\nThe abrupt departure of Cari-Ann Burgess as the interim registrar of voters in northern Nevada’s Washoe County one month ago is the latest sign of turmoil in a county that has been roiled for four years by people pushing election conspiracy theories. Washoe, which includes Reno, is a swing county in a state where this year’s presidential contest is expected to be narrowly decided.\n\nBurgess told The Associated Press in an interview that she had refused personnel changes sought by the county manager’s office and had offered to step down and return to her prior position as deputy. She said she was told that was not possible.\n\nIn a meeting with county staff, including representatives of the district attorney’s office, Burgess said she was forced to put a request for leave in writing despite her desire to stay.\n\n“I feel like I was absolutely forced out, but I have no idea how we got to this point,” Burgess said in her first public remarks since her departure. “Because the previous Friday and Monday, before I was put on leave, I was having high praises. They were like, ‘You’re doing a great job, you’ve got this, you’re the best person for this job because you brought this team together.’\n\n“And then all of a sudden, I was out on leave.”\n\nBurgess said she has hired a lawyer and was considering her legal options.\n\nIn a Sept. 27 statement, Washoe County spokeswoman Bethany Drysdale said Burgess had “experienced stress issues and requested medical leave.” Washoe County Manager Eric Brown told commissioners during an Oct. 8 meeting that Burgess was on leave and that she had not been fired and had not quit.\n\nGeorge Guthrie, a spokesman for the county election office, on Wednesday reiterated the county’s previous statement that Burgess had requested a leave and that the county was committed to “running a smooth and fair election.”\n\nNevada is one of seven presidential battleground states that Vice President Kamala Harris and former President Donald Trump are hotly contesting ahead of the Nov. 5 presidential election.\n\nWashoe is the state’s second most populous county and is considered a bellwether because its elections are often narrowly decided and its vote can tip statewide elections. Clark County, which includes Las Vegas, has voted solidly Democratic in the past two presidential elections.\n\nA deputy filling in for Burgess is now the fifth person in four years to oversee elections in the politically mixed county. The staff has turned over entirely since the 2020 presidential election, Burgess said.\n\nA spokeswoman for the Nevada Secretary of State’s Office declined to comment about the situation in Washoe County.\n\nAcross the country, conspiracy theories and lies about the 2020 presidential election have created a difficult working environment for local election officials, who have faced harassment and even death threats. That has prompted election officials nationwide to prepare for what could be a tumultuous election, providing panic buttons for polling place supervisors and installing bulletproof glass at their offices.\n\nIn Reno, county government meetings are often prolonged by members of the public who opposed Burgess’ hiring as the interim registrar in January and who want the county to hand-count votes because they don’t trust voting equipment. They also want election staff to do more to combat voter fraud, even though there is no evidence of any widespread fraud or manipulated voting equipment in 2020 or afterward.\n\nAfter the state primary earlier this year, the county commission’s Republican majority voted 3-2 against certifying the results. They later reversed course, but Burgess said the initial vote hurt morale among her team at the election office.\n\nCommissioner Jeanne Herman, a Republican who has consistently voted against certifying election results since 2020, said news of Burgess’ departure came as a surprise. Herman told the AP Wednesday that state GOP officials had met with Burgess for two hours to talk about their concerns shortly before Burgess went on leave.\n\n“They came away thinking, ‘Great, our election might just turn out OK,’” she said. “Then all of a sudden she was gone.”\n\nBurgess said the changes requested of her by county administrators involved assigning some election office staffers to a different department while keeping them working inside the office.\n\n“I wouldn’t have any say in what they were doing. And I said no to that,” she said.\n\nShe tried to return after being placed on leave, obtaining a doctor’s note indicating she was fine to work, but county officials refused and told her the situation would be taken up after the presidential election. She said she has been forced to use her sick pay and vacation time, and was told not to contact her staff or speak with reporters.\n\n“I wanted to stay and help this team,” Burgess said. “They have done so much and have done such amazing things in the last year that — yeah, I wanted to be part of it. And I wanted to help them, and they told me no.”\n\nAssociated Press writer Rio Yamat in Las Vegas contributed to this report.","summary":"The top election official in a politically crucial Nevada county says she was forced out  The Associated Press","url":"https://apnews.com/article/nevada-election-2024-washoe-county-registrar-039a3bb745e7461ffd5bdce0682ac860","image":"https://dims.apnews.com/dims4/default/f7036b0/2147483647/strip/true/crop/8003x4502+0+417/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd4%2F8f%2F04f021ad028a6acda4f0742bdc62%2Fb19f392a1cb547ea9fff68e9d3fa5246","video":null,"publish_date":"2024-10-24 00:29:00","author":"Christina A. Cassidy","authors":["Christina A. Cassidy"],"language":"en","category":"politics","source_country":"us","sentiment":-0.478},{"id":260862430,"title":"Los Angeles Times editorial boss resigns after billionaire owner Patrick Soon-Shiong scraps Harris endorsement","text":"The editorials editor for the Los Angeles Times stepped down Wednesday after the newspaper’s billionaire owner stopped the publication’s expected endorsement of Vice President Kamala Harris.\n\nMariel Garza is leaving her post at the Times because she wants “to make it clear that I am not OK with us being silent” after biotech entrepreneur Patrick Soon-Shiong scrapped the paper’s endorsement for president.\n\n“In dangerous times, honest people need to stand up,” Garza told the Columbia Journalism Review she said. \n\n“This is how I’m standing up.”\n\nLast week, Soon-Shiong told the newspaper’s editorial board through the outlet’s editor that the LA Times would not endorse Harris or former President Donald Trump, which was first reported by Semafor.\n\nA draft of a proposed editorial giving Harris the nod was even written by Garza before it was called off, the Columbia Journalism Review reported.\n\nShe told the journalistic-centric outlet she didn’t think the endorsement would change voters’ minds because the LA Times is a “very liberal paper” and most of its readers are Harris supporters. \n\n“But two things concern me: This is a point in time where you speak your conscience no matter what,” she said.\n\n“And an endorsement was the logical next step after a series of editorials we’ve been writing about how dangerous Trump is to democracy, about his unfitness to be president, about his threats to jail his enemies.\n\n“We have made the case in editorial after editorial that he shouldn’t be reelected.”\n\nAfter news broke that the LA Times would forgo a presidential endorsement, the move was cheered by the Trump campaign.\n\n“Even her fellow Californians know she’s not up for the job,” the campaign said.\n\nWhile the paper has chosen a Democrat for president since 2008, it didn’t endorse Harris for California attorney general in 2010, instead opting for Republican Steve Cooley, CJR reported. \n\nThe LA Times union said in an email to union members on Wednesday it sent a letter to Soon-Shiong, who has owned the paper since 2018, and editor Terry Tang asking for a reason why the endorsement was called off, but hadn’t received a reply, Semafor reported.\n\n“We believe the company owes the staff an explanation about why this decision was made after years of endorsements in general elections,” the union reportedly wrote.","summary":"“In dangerous times, honest people need to stand up,” Garza reportedly said. “This is how I’m standing up.”","url":"https://nypost.com/2024/10/23/media/la-times-editorial-editor-resigns-after-patrick-soon-shiong-scraps-harris-endorsement/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/leader-la-times-editorial-board-92245001_3660c4.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/s3npyIJ0-RyIcpnTz.mp4","publish_date":"2024-10-24 00:25:54","author":"David Propper","authors":["David Propper"],"language":"en","source_country":"us","sentiment":-0.314},{"id":260863120,"title":"Los Angeles Times editor resigns after newspaper owner blocked plans to endorse Harris","text":"New York (CNN) — The leader of the Los Angeles Times’ editorial board said Wednesday she has resigned from her post in protest after the newspaper’s owner blocked a decision to endorse Kamala Harris in the presidential election.\n\n“I am resigning because I want to make it clear that I am not okay with us being silent,” Mariel Garza told the Columbia Journalism Review in an interview. “In dangerous times, honest people need to stand up. This is how I’m standing up.”\n\nGarza’s resignation comes after Patrick Soon-Shiong, the billionaire doctor who purchased the publication in 2018 for $500 million, told the Times’ editorial board not to endorse in the presidential race, she said. The newspaper has endorsed a candidate in every presidential election since it backed Barack Obama in 2008.\n\nAs California’s most widely-circulated newspaper, as well as one of the country’s largest, the Times’ decision not to endorse a presidential candidate raised questions about potential political interference. Garza told CJR the editorial board had intended to endorse Harris, who previously served as a US Senator from California and the state’s attorney general.\n\n“I didn’t think we were going to change our readers’ minds—our readers, for the most part, are Harris supporters,” Garza told CJR. “We’re a very liberal paper. I didn’t think we were going to change the outcome of the election in California.”\n\nA Los Angeles Times spokesperson did not respond to a CNN request for comment, but in a social media post Soon-Shiong wrote, “The Editorial Board was provided the opportunity to draft a factual analysis of all the POSITIVE AND NEGATIVE policies by EACH candidate during their tenures at the White House, and how these policies affected the nation.”\n\n“With this clear and non-partisan information side-by-side, our readers could decide who would be worthy of being President for the next four years,” he wrote. “Instead of adopting this path as suggested, the Editorial Board chose to remain silent and I accepted their decision.”\n\nGarza’s resignation comes a month after the Times published its electoral endorsements for the November election, which notably did not include the presidential race.\n\n“This is a point in time where you speak your conscience no matter what,” Garza told CJR. “And an endorsement was the logical next step after a series of editorials we’ve been writing about how dangerous Trump is to democracy, about his unfitness to be president, about his threats to jail his enemies.”\n\n“It’s perplexing to readers, and possibly suspicious, that we didn’t endorse her this time,” Garza told CJR.\n\nThe Times’ decision not to endorse was first reported Tuesday by Semafor. The Trump campaign quickly seized on the news, calling it a “humiliating blow” for Harris, indicating that “even her fellow Californians know she’s not up for the job.”\n\nIn a resignation letter to the Times’ executive editor Terry Tang and published by CJR, Garza wrote that she struggled with her “feelings about the implications of our silence.”\n\n“I told myself that presidential endorsements don’t really matter; that California was not ever going to vote for Trump,” she wrote. “But the reality hit me like cold water Tuesday when the news rippled out about the decision not to endorse without so much as a comment from the LAT management, and Donald Trump turned it into an anti-Harris rip.”\n\n“In these dangerous times, staying silent isn’t just indifference, it is complicity,” Garza added. “I’m standing up by stepping down from the editorial board. Please accept this as my formal resignation, effective immediately.”\n\n(Copyright (c) 2024 CNN. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"New York (CNN) —&#160;The leader of the Los Angeles Times’ editorial board said Wednesday she has resigned from her post in protest after the newspaper’s...","url":"https://whdh.com/news/los-angeles-times-editor-resigns-after-newspaper-owner-blocked-plans-to-endorse-harris/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/10/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbTJtZmkzM2wwMDBpM2Q1dnZwOWVxa2Vu-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtMm1ldHRuaTAwYzEyZHAwNzJlZzFhM2o.jpg?quality=60&strip=color","video":null,"publish_date":"2024-10-24 00:24:43","author":"Bailey Allen","authors":["Bailey Allen"],"language":"en","source_country":"us","sentiment":0.03},{"id":260862292,"title":"Kamala Harris Delivers Pitch Perfect Response To Trump’s Fascism","text":"Vice President Harris addressed the national media and responded to John Kelly’s account that Trump is a fascist by posing the perfect question to the American people.\n\nHarris said:\n\nÂ Yesterday we learned that Donald Trump’s former chief of staff, John Kelly, a retired four-star general, confirmed that wild Donald Trump was president he said he wanted generals like Adolf Hitler had Donald Trump said that because he does not want a military that is loyal to the United States constitution. He wants a military that is loyal to him he wants a military who will be loyal to him personally. One that we’ll obey his orders even when he tells them to break the law or abandon their oath to the constitution of the United States. In just the past week, Donald Trump\r\r\r\r\r\r has repeatedly called his fellow Americans, the enemy from within even said that he would use the United States military to go after American citizen and let’s be clear about who he considers to be the enemy from within anyone who refuses to bend a knee or dares to criticize him would qualify in his mind as the enemy within like judges, like journalist like nonpartisan election officials.\n\nIt is deeply troubling and incredibly dangerous that Donald Trump would invoke Adolf Hitler the man who is responsible for the deaths of 6 million Jews and hundreds of thousands of Americans all of this is further evidence for the American people of who Donald Trump really is. This is a window into who Donald Trump really is from the people who know him best, from the people who worked with him side-by-side in the Oval Office in the situation room.\n\nDonald Trump is increasingly unhinged and unstable. And in a second term, people like John Kelly would not be there to be the guardrails against his propensities and his actions. Those who once tried to stop him from pursuing his worst impulses would no longer be there and no longer be there to rein him in. So, the bottom line is this. We know what Donald Trump wants. He wants unchecked power. The question in 13 days will be, what do the American people want?\n\nVideos of Harris:\n\n VP Harris, “it is deeply troubling and incredibly dangerous that Trump would invoke Hitler the man who is responsible for the deaths of 6 million Jews and hundreds of thousands of Americans all of this is further evidence for the American people of who Donald Trump really is.” pic.twitter.com/NQMRJzHGs2 â Sarah Reese Jones (@PoliticusSarah) October 23, 2024 \n\n Harris,”We know what Donald Trump wants. He wants unchecked power. The question in 13 days will be, what do the American people want?” pic.twitter.com/sJWhPVfKcw â Sarah Reese Jones (@PoliticusSarah) October 23, 2024 \n\nThe American people have a choice. Do they want democracy, or will they choose to be ruled by a cognitively impaired fascist who wants to take a away your rights and freedoms so that he can rule as a dictator?\n\nIt seems far fetched by given what John Kelly and others who have worked in the Trump administration have confirmed, this is the choice. The future of the country in a deeper and more fundamental way is at stake in this election.\n\nKamala Harris was right. She can’t save democracy on her own. This is a choice that has to be made by the American people.\n\nThe American people have to choose. Do we want to be free, or ruled by Donald Trump?\n\nTo comment on this story, join us on Reddit.","summary":"Vice President Harris addressed the national media and responded to John Kelly’s account that Trump is a fascist by posing the perfect question to the American people. Harris said: Â Yesterday we learned that Donald Trump’s former chief of staff, John Kelly, a retired four-star general, confirmed that wild Donald Trump was president he said he &#8230;\n\n\nThe post Kamala Harris Delivers Pitch Perfect Response To Trump&#8217;s Fascism appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/kamala-harris-delivers-pitch-perfect-response-to-trumps-fascism/","image":"https://www.politicususa.com/wp-content/uploads/2024/10/Harris-Trump-fascist-scaled.jpg","video":null,"publish_date":"2024-10-24 00:22:04","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.22},{"id":260862398,"title":"Michael Keaton Warns ‘Bros’ for Trump and Musk: ‘They Don’t Respect You’","text":"Michael Keaton has a frank message for men backing Donald Trump and his MAGA cheerleader, Elon Musk.\n\n In a recent video shared to Instagram, Keaton addressed Trump and Musk supporters — “guys mostly” — who “are thinking of attending a rally with Musk and Trump.” \n\n “They don’t really respect you, they laugh at you behind your back, they think you’re stupid,” Keaton said in the clip. “They don’t want to hang out with you. They have nothing in common with you. They’re not your bros.” \n\n He continued, “When Trump years ago said ‘I could shoot somebody on Fifth Avenue and they’d still vote for me,’ basically what he is saying is that these people are so dumb and so stupid they’d still vote for him. They have no respect for you, trust me.”\n\n Musk has garnered intense backlash following his takeover of Twitter, using his platform to engage with antisemitic conspiracy theorists and promote their content. The billionaire publicly endorsed Trump after the July assassination attempt, and gleefully joined Trump onstage earlier this month, jumping around and falsely claiming that “the other side wants to take away your freedom of speech.”\n\n On Wednesday, The Lever reported that due to a provision buried in the tax code, Musk could reap massive benefits from his alliance with Trump and gain one of the largest personalized tax breaks in American history if the former president wins the 2024 election and follows through with his promise to appoint Musk to a top government post.\n\n Meanwhile, Trump has left his 2024 campaign’s get-out-the-vote operation to a Super PAC bankrolled and directed by Musk. Republican operatives and those close to Trump have informed him that Musk’s organization is failing to galvanize voters in key states.\n\n Musk’s recent sentiments toward Trump are a drastic change from previous years. Before the 2016 presidential election, Musk told CNBC that Trump was “not the right guy” and didn’t “seem to have the sort of character that reflects well on the United States.”\n\n Trump, similarly, has shot bitter words at the Tesla CEO in the past, calling him in July 2022 a “bullshit artist” for supporting the former president’s opponents in 2016 and 2020. Although Trump has continued to trash Musk behind his back, he desperately needs the billionaire’s support as Vice President Kamala Harris’ campaign fundraising continues to surpass Trump’s numbers in the 2024 presidential race.","summary":"The Batman and Beetlejuice star reminded men that the Republican candidate and billionaire \"laugh at you behind your back, they think you’re stupid\"","url":"https://www.rollingstone.com/tv-movies/tv-movie-news/michael-keaton-warns-trump-musk-bros-they-dont-respect-you-1235141403/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/michael-keaton-trump-eleciton.jpg","video":null,"publish_date":"2024-10-24 00:20:51","author":"Charisma Madarang","authors":["Charisma Madarang"],"language":"en","source_country":"us","sentiment":-0.027},{"id":260862174,"title":"Don’t rush to end Gaza war, Dems’ blue-collar blues and other commentary","text":"Foreign Desk: Don’t Rush To End Gaza War\n\n“The killing of Hamas leader Yahya Sinwar,” argues Eric R. Mandel at The Hill, brings “an understandable impulse to end the war immediately, presumably in exchange for release of the hostages.”\n\nBut a big opportunity “will be squandered if we lack the strategic patience to act wisely.”\n\n“If the US doesn’t let Israel use its newfound leverage to get the best ceasefire agreement, it will set the stage for a resurgence of Hamas.”\n\nPresident Biden “would like to ensure his legacy” now “by ending the war on any terms.” But “we need to help Israel” by “maximizing the leverage it has gained through its costly military achievements.”\n\nPlus: “Being patient with Israel signals to our allies around the world that we stand with our friends.”\n\nFrom the right: Why Blacks Are Ditching Harris\n\nRobert Woodson Sr., who “has been coordinating development programs in poor black neighborhoods since the 1960s,” thinks Kamala Harris’ challenge with black voters “is part of a broader problem the Democratic Party faces with working-class voters generally,” explains The Wall Street Journal’s Jason L. Riley\n\nBlack men “are upset at the migrants in places like Chicago and Boston and California getting free cellphones and housing,” says Woodson, and “remember the unemployment and low inflation” of the Trump years.\n\nAdds Riley: “Before Covid, black workers were making absolute gains and gaining on their white counterparts.”\n\nWhile “there’s no guarantee that Mr. Trump will repeat that performance in a second term,” it’s still “hard to quibble with the growing number of black voters who want to see him try.”\n\nLibertarian: Blatant Border Bungling\n\nThat “nearly one-third” of expensive border-surveillance towers don’t work “is big political news at a time when voters consistently rank immigration among their main concerns,” marvels Reason’s J.D. Tuccille.\n\nYes, “almost a third of the Remote Video Surveillance System towers are completely offline.”\n\nVarious parts of the “Integrated Surveillance Towers network” cost a total around $6 billion,” yet the “incompatible parts” in practice “work much like everything else that government does: inefficiently, expensively, and unaccountably.”\n\nIndeed, “We shouldn’t be surprised when the implementation of an actual immigration and border policy, once one has been decided, looks a lot like expensive towers standing in the desert, doing nothing.”\n\nCollege beat: Fear Rules the Campus\n\nYale poli-sci professor Gregory Collins was this year’s recipient of the Lux et Veritas award from the Buckley Institute, recognizing a teacher who fosters “open and civil discussion in the classroom even on contentious issues,” notes Daniel McCarthy at The Spectator.\n\nOf course, William F. Buckley “advanced intellectual freedom by challenging it” and would blanch at today’s academia, which “has become a panopticon” where “students are the jailers and prisoners alike” and anyone can “turn informant at any time.”\n\nEven profs “fear the watchful, censorious student eye,” which most often manifests as a “cellphone camera.”\n\nStudents “are terrified of being recorded saying anything out of step with progressive orthodoxy,” so they self-censor.\n\n“Classrooms today threaten to make the malady” of intellectual cowardice into a full blown epidemic — “at least without the efforts of teachers” like Collins.\n\nElection watch: Dems’ Blue-Collar Blues\n\nDonald Trump’s visit to McDonald’s to “sling fries” highlighted his “cultural and economic outreach to working-class voters,” observes Fred Bauer at City Journal.\n\nAnd, indeed, working-class voters have been “migrating from their old base in the Democratic Party to join the Republican coalition.”\n\nThe “priorities and cultural values of progressive elites have become increasingly estranged” from working-class voters; Kamala Harris’ “central issues” — abortion and anti-Trumpism — “seem more designed to turn out college-educated voters.”\n\nMeanwhile, many voters “who feel left behind like [Donald Trump’s] style.”\n\nAnd “today’s GOP is certainly more attuned to working-class voters.”\n\nThese people were the “pillar of the New Deal coalition that dominated American politics for decades. Now Republicans hope that offering some grand new bargain for workers could help them forge their own governing majority.” \n\n— Compiled by The Post Editorial Board","summary":"“The killing of Hamas leader Yahya Sinwar,” argues Eric R. Mandel at The Hill, brings “an understandable impulse to end the war immediately, presumably in exchange for release of the hostages.”","url":"https://nypost.com/2024/10/23/opinion/dont-rush-to-end-gaza-war-dems-blue-collar-blues-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-4voz7o9dt-1729722987032.jpg?quality=75&strip=all&1729708671&w=1200","video":null,"publish_date":"2024-10-24 00:20:31","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013},{"id":260861896,"title":"Harris Decries Trump after John Kelly Says he Wanted Generals like Hitler’s","text":"WASHINGTON (AP) — Kamala Harris said Wednesday that comments praising Adolf Hitler reportedly made by Donald Trump to his longest-serving chief of staff offer a window into who the former president “really is” and the kind of commander in chief he would be.\n\nIn interviews with The New York Times and The Atlantic published Tuesday, John Kelly warned that the Republican nominee meets the definition of a fascist and that while in office he suggested that the Nazi leader “did some good things.”\n\nHarris, the vice president and Democratic nominee, repeated her increasingly dire warnings about Trump’s mental fitness and his intentions for the presidency.\n\n“This is a window into who Donald Trump really is, from the people who know him best, from the people who have worked with him side by side in the Oval Office and in the Situation Room,” Harris told reporters outside the vice president’s residence in Washington.\n\nThe comments from Kelly, the retired Marine general who worked for Trump in the White House from 2017 to 2019, built on past warnings from former top Trump officials as the election enters its final two weeks.\n\nKelly has long been critical of Trump and previously accused him of calling veterans killed in combat “suckers” and “losers.” His new warnings emerged as Trump seeks a second term vowing to dramatically expand his use of the military at home and suggesting he would use force to go after Americans he considers “enemies from within.”\n\n“He commented more than once that, ‘You know, Hitler did some good things, too,’” Kelly recalled to the Times. Kelly said he would usually quash the conversation by saying “nothing (Hitler) did, you could argue, was good,” but Trump would occasionally bring up the topic again.\n\nIn his interview with The Atlantic, Kelly recalled that when Trump raised the idea of needing “German generals,” Kelly would ask if he meant “Bismarck’s generals,” referring to Otto von Bismarck, the chancellor who oversaw the unification of Germany. “Surely you can’t mean Hitler’s generals,” Kelly recalled asking Trump. To which the former president responded, “Yeah, yeah, Hitler’s generals.”\n\nTrump said on his Truth Social media platform that Kelly had “made up a story” and went on to heap insults on his former chief of staff, including that Kelly’s “toughness morphed into weakness.”\n\nTrump’s campaign also denied the accounts. Campaign spokesman Steven Cheung said Kelly had “beclowned himself with these debunked stories he has fabricated” and, after Harris’ statement, accused the Democratic candidate of sharing “outright lies and falsehoods.”\n\nChris Sununu, New Hampshire’s Republican governor and onetime Trump critic, said Kelly’s comments did not change his plans to vote for the former president.\n\n“Look, we’ve heard a lot of extreme things about Donald Trump, from Donald Trump. It’s really par for the course,” the governor told CNN. “Unfortunately, with a guy like that, it’s kind of baked into the vote at this point.”\n\nSome of the former president’s supporters in swing states responded to Kelly’s comments with a shrug.\n\n“Trump did his four years, and we were in great shape. Kelly didn’t have anything good to say about Trump. He ought to have his butt kicked,” said Jim Lytner, a longtime advocate for veterans in Nevada who served in the Army in Vietnam and co-founded the nonprofit Veterans Transition Resource Center.\n\nHarris said Wednesday that Trump admired Hitler’s generals because he “does not want a military that is loyal to the United States Constitution, he wants a military that is loyal to him. He wants a military who will be loyal to him personally.”\n\nPolls show the race is tight in swing states, and both Trump and Harris are crisscrossing the country making their final pitches to the sliver of undecided voters. Harris’ campaign has spent considerable time reaching out to independent voters, using the support of longtime Republicans such as former Rep. Liz Cheney and comments like Kelly’s to urge past Trump voters to reject his candidacy in November.\n\nHarris’ campaign held a call with reporters Tuesday to elevate the voices of retired military officials who highlighted how many of the officials who worked with Trump now oppose his campaign.\n\n“People that know him best are most opposed to him, his presidency,” said retired Army Brig. Gen. Steve Anderson.\n\nAnderson said he wished Kelly would fully back Harris over Trump, something he has yet to do. But retired Army Reserve Col. Kevin Carroll, a former senior counselor to Kelly, said Wednesday that the former top Trump official would “rather chew broken glass than vote for Donald Trump.”\n\nBefore serving as Trump’s chief of staff, Kelly worked as the former president’s secretary of homeland security, where he oversaw Trump’s attempts to build a wall along the U.S.-Mexico border. Kelly was also at the forefront of the administration’s crackdown in immigration policy that led to the separation of thousands of immigrant parents and their children along the southern border. Those actions made him a villain to many on the left, including Harris.\n\nAfter Kelly left the Trump administration and joined the board of a company operating the nation’s largest detention center for unaccompanied migrant children, Harris wrote during her 2019 run for president that he was “the architect” of the administration’s “cruel child separation policy. Now he will profit off the separation of families. It’s unethical. We are better than this.”\n\nWhen she was in Miami for a primary debate in June 2019, Harris was also one of a dozen Democratic presidential candidates who visited the detention center south of the city and protested against the administration’s harsh treatment of young migrants.\n\nIn his interview with the Times, Kelly also said Trump met the definition of a fascist. After reading the definition aloud, including that fascism was “a far-right authoritarian, ultranationalist political ideology and movement characterized by a dictatorial leader,” Kelly concluded Trump “certainly falls into the general definition of fascist, for sure.”\n\nKelly added that Trump often fumed at any attempt to constrain his power, and that “he would love to be” a dictator.\n\n“He certainly prefers the dictator approach to government,” Kelly told the Times, adding later, “I think he’d love to be just like he was in business — he could tell people to do things and they would do it, and not really bother too much about whether what the legalities were and whatnot.”\n\nKelly is not the first former top Trump administration official to cast the former president as a threat.\n\nRetired Army Gen. Mark A. Milley, who served as Trump’s chairman of the Joint Chiefs of Staff, told Bob Woodward in his recent book “War” that Trump was “fascist to the core” and “the most dangerous person to this country.” And retired Gen. Jim Mattis, who worked as secretary of defense under Trump, reportedly later told Woodward that he agreed with Milley’s assessment.\n\nThroughout Trump’s political rise, the businessman-turned-politician benefited from the support of military veterans.\n\nAP VoteCast found that about 6 in 10 military veterans said they voted for Trump in 2020, as did just over half of those with a veteran in the household. Among voters in this year’s South Carolina Republican primary, AP VoteCast found that close to two-thirds of military veterans and people in veteran households voted for Trump over former South Carolina Gov. Nikki Haley, Trump’s toughest opponent in the 2024 Republican primary.","summary":"WASHINGTON (AP) — Kamala Harris said Wednesday that comments praising Adolf Hitler reportedly made by Donald Trump to his longest-serving&#8230; Continue reading Harris Decries Trump after John Kelly Says he Wanted Generals like Hitler&#8217;s\n\n\nThe post Harris Decries Trump after John Kelly Says he Wanted Generals like Hitler&#8217;s appeared first on The National Herald.","url":"https://www.thenationalherald.com/harris-decries-trump-after-john-kelly-says-he-wanted-generals-like-hitlers/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/10/harris13.jpg","video":null,"publish_date":"2024-10-24 00:14:08","author":"Antonis","authors":["Antonis"],"language":"en","source_country":"us","sentiment":-0.038},{"id":260861656,"title":"Provide Republican control in the House to combat antisemitism on campuses","text":"Those who are working to combat antisemitism in America have reason to be thankful to the US House of Representatives and its narrow Republican majority.\n\nThe profound moral decay within higher education was brought to light in December in an unexpected setting: a special hearing held by the relatively unknown House Committee on Education and the Workforce, convened by chair Virginia Foxx (R-NC).\n\nDuring this event, Rep. Elise Stefanik (R-NY) directed a seemingly straightforward question to the presidents of Harvard, the University of Pennsylvania, and MIT — “Can it be as simple as a ‘yes’ or ‘no’: Is advocating for the genocide of Jews not considered to be a form of bullying and harassment?”\n\nNone of the three could provide a clear and direct answer — and the outrageous exchange went viral, drawing widespread condemnation.\n\nTwo of the college presidents soon resigned, and Speaker Mike Johnson launched further investigations as part of a House-wide effort to combat antisemitism in the United States. \n\nThis important work proceeded for one reason, and one reason only: Because House Republicans decided to make it a priority.\n\nThe opposite is true in the Democrat-led Senate, where Majority Leader Chuck Schumer, his committee chairs and his colleagues have steadfastly refused to hold any hearings exclusively focused on antisemitism. \n\nLast month, in fact, a halfhearted effort chaired by Sen. Dick Durbin (D-Ill.) ended up “all lives mattering” the issue — and devolved into a shouting match as audience members hurled vile insults and curses at Jews in the hearing room. \n\nFor me and many others, this is personal.\n\nMy Jewish family lives in the Philadelphia suburbs, in a deep blue township within a blue county in Pennsylvania, arguably the most critical swing state of this election season. \n\nOur township is home to tens of thousands of high-earning, left-leaning, self-described progressives who have largely voted Democrat over the past 25 years. \n\nAnd many of them are both concerned and frightened by the Democratic Party’s passive response to the rampant antisemitism we’ve seen this past year.\n\nI’ve been volunteering 20 to 30 hours a week in my community door-knocking and campaigning for former President Donald Trump and his running mate J.D. Vance — and my neighbors are listening.\n\nI tell them I believe President Trump was the most effective and consequential president in history for the relationship between the United States and Israel, and remind them that his record of combating antisemitism, including his 2019 executive order expanding Title VI, is second to none. \n\nI also explain that while the presidential race garners most of our attention, much of the work of highlighting and addressing major issues starts in Congress, in House and Senate committees — and the party in power selects the committee chairs who almost single-handedly determine that agenda. \n\nPut another way: If you have an issue that you want the federal government to deal with, you need a committee chair who is interested in it, will hold hearings on it, and then do the hard work of drafting, negotiating, marking-up and approving legislation to send to the floor. \n\nPennsylvania this year has three of the dozen-plus House contests that will determine whether the GOP keeps its majority, as well as a hotly contested US Senate seat. \n\nSo as I work to persuade my fellow Pennsylvanians to vote Republican, I usually start by asking if they recall watching Rep. Stefanik question the three college presidents. Almost everyone answers that yes, they do.\n\nAnd I then challenge them with a proposition: The only reason the world had the chance to bear witness to the moral decay of our “elite” institutions is because Republicans held the majority in the House, and Republican committee chairs made the effort to shine a light on college antisemitism and propose solutions. \n\nVoting Republican in those Pennsylvania races will ensure this work can continue beyond January 2025.\n\nI also remind my neighbors that incumbent Sen. Bob Casey and his Democratic colleagues have held zero hearings focused exclusively on exposing antisemitism — and that they’ve stalled the Antisemitism Awareness Act, which the House passed with broad bipartisan support. \n\nEnding this logjam requires a GOP Senate majority, starting with Dave McCormick in Pennsylvania. \n\nMy message really is this simple: If you care about exposing and repairing the scourge of antisemitism on our campuses and in our communities, Republicans must have your vote on Nov. 5.\n\nJeff Bartos is a Republican strategist from Pennsylvania. X: @Jeff_Bartos","summary":"Those who are working to combat antisemitism in America have reason to&#8230;","url":"https://internewscast.com/news/us/provide-republican-control-in-the-house-to-combat-antisemitism-on-campuses/","image":"https://internewscast.com/wp-content/uploads/2024/10/To-fight-campus-antisemitism-give-GOP-House-majority-800x430.jpg","video":null,"publish_date":"2024-10-24 00:13:07","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.281},{"id":260862894,"title":"The Kardashians May Be Over, But… NOT? Donald Trump Will Not Be Pleased About This! Remember Frankie Muniz? Liam Payne And… | The Perez Hilton Show","text":"We value your privacy\n\n We and our \npartners store and/or access information on a device, such as cookies and process personal data, such as unique identifiers and standard information sent by a device for personalised advertising and content, advertising and content measurement, audience research and services development.With your permission we and our partners may use precise geolocation data and identification through device scanning. You may click to consent to our and our 1449 partners’ processing as described above. Alternatively you may access more detailed information and change your preferences before consenting or to refuse consenting.Please note that some processing of your personal data may not require your consent, but you have a right to object to such processing. Your preferences will apply to this website only. You can change your preferences or withdraw your consent at any time by returning to this site and clicking the \"Privacy\" button at the bottom of the webpage. \n\nMORE OPTIONS\n\n Star Seeker \n\nSkip to content\n\nMain Navigation \n\nRelationships\n\nControversy\n\nDaily Recap!\n\nThe Kardashians May Be Over, But… NOT? Donald Trump Will Not Be Pleased About This! Remember Frankie Muniz? Liam Payne And… | The Perez Hilton Show\n\nFeeling good and so happy to be here with you!\n\nWatch above!\n\nRelated Posts\n\n Gypsy Rose Blanchard - New And Improved! Diddy Delusions! MAGA! Menendez Brothers! Dua Lipa! And More! | The Perez Hilton Show \n\n Liam Payne's Struggles. Taylor Swift is Back. Ariana Grande Deserves Grace. Diddy Disgustingness! And MORE! | The Perez Hilton Show \n\n Donald Trump Abandons His Supporters! What’s Wrong With Nick Jonas? Taylor Swift Is Doing Too Much! And More! | The Perez Hilton Show \n\n Diddy! Disgusting Men! Taylor Swift Injured! Hayden Panettiere Unwell! Shawn Mendes In Crisis! And... \n\nFrom The Web\n\nHeidi Klum's Daughter Looks Like Her Iconic Dad\nlearnitwise\n\nAdd Site For Free\nEthereal Search Engine\n\nWalmart Center for Racial Equity Update: Advancing Equity in Criminal Justice\n\nNine Kinds of Ancestors You Could Find on Your Family Tree\n\nThe New Normal of Selling a Home Today\n\nGet Mortgage Advice Close to Home\n\nThe Close Relationship Between Stress and Sleep\n\nGot Plant Milk? Add These 16 Plant Milks to Your Mug for Health, Flavor, and Fro\n\nHeartwarming Reaction From a Couple Meeting Their Rescue Dog for the First Time\n\nFeatured Local Savings\n\n CLICK HERE TO COMMENT \n\nOct 23, 2024 17:13pm PDT\n\nDaily Recap! \n\nCardi B Hospitalized For Medical Emergency! Unfortunately, She:\n\nRachael Ray Makes Health Confession Amidst Fan Concern For Her Well-Being. The Iconic TV Chef Says:\n\nTaylor Swift Made Much Ado About Something “Casual”, Says Ex-Boyfriend Matty Healy! Throwing Lots Of Shade, He:\n\n Click To Watch\n\nFollow Perez\n\nTop Celebrities\n\nView All Celebrities\n\nLatest Video\n\nCardi B Hospitalized For Medical Emergency! Unfortunately, She:\n\nAdvertising\n\nCopyright © 2024 PerezHilton.com | All Rights Reserved\n\nDo Not Sell My Personal Information","summary":"Feeling good and so happy to be here with you! Watch above! Enjoy! SHARE! [...]\n\n\nRead More...\n\n\nThe post The Kardashians May Be Over, But… NOT? Donald Trump Will Not Be Pleased About This! Remember Frankie Muniz? Liam Payne And… | The Perez Hilton Show appeared first on Perez Hilton.","url":"https://perezhilton.com/the-kardashians-may-be-over-but-not-donald-trump-will-not-be-pleased-about-this-remember-frankie-muniz-liam-payne-and-the-perez-hilton-show/","image":"https://i3.ytimg.com/vi/-_YRgT_RgI4/hqdefault.jpg","video":null,"publish_date":"2024-10-24 00:13:02","author":"Perez Hilton","authors":["Perez Hilton"],"language":"en","source_country":"us","sentiment":0.215},{"id":260862114,"title":"'Really disturbing': Blitzer clashes with GOP gov who downplayed Trump’s praise of Hitler","text":"CNN primetime host Wolf Blitzer recently had a testy exchange with New Hampshire Republican Governor Chris Sununu over former President Donald Trump's praise of Nazi dictator Adolf Hitler.\n\nOn Wednesday night, Blitzer invited Sununu onto his show to ask him directly what he thought of the 45th president of the United States saying complimentary things about Hitler to Marine General John Kelly when he served as Trump's White House chief of staff. The Atlantic's Jeffrey Goldberg wrote an article Tuesday describing conversations with Kelly, in which he confided that Trump longed to have the same kind of \"totally loyal\" generals \"that Hitler had.\" He also said that Hitler \"did some good things\" with Germany's economy with Kelly reminding him that he can't \"ever\" say anything complimentary about the architect of the Holocaust.\n\nThroughout their exchange, Sununu downplayed and equivocated and attempted to pivot to criticism of Vice President Kamala Harris and the Democratic Party. Blitzer, however, directly confronted Sununu on multiple occasions over whether he thought it was anti-Semitic for Trump to both compliment Hitler and to dine with white supremacist Nick Fuentes at Mar-a-Lago in 2022. \n\nREAD MORE: CNN host laughs out loud at guest who said Trump had permission from Biden to call Putin\n\n\"Why do you want to vote for someone who thinks, quote, 'Hitler did some good things?'\" Blitzer asked Sununu, after introducing him to viewers as someone who is supporting Trump in November.\n\n\"So let's be clear, those comments are not helpful, especially with these last couple of weeks. They're extreme,\" Sununu said. \"I mean, this is a time when folks are going to say extreme things. I have all the respect in the world for John Kelly. Half the country doesn't think they're voting for a fascist. That's not where the American voter is.\"\n\nAfter Sununu wrote off Kelly's comments as \"white noise\" and opined that they wouldn't move the needle in swaying undecided voters, Blitzer pushed back.\n\n\"Governor, do you actually think that having positive things to say about Hitler, or dining with Holocaust deniers, is anti-semitic?\" Blitzer asked.\n\nREAD MORE: Trump told top aides he wanted the same kind of 'totally loyal' generals 'that Hitler had'\n\nAt first, Sununu misinterpreted the question as Blitzer equating Trump with a dictator \"who murdered six million Jews.\" But the CNN anchor clarified his question.\n\n\"I didn't compare Trump to Hitler,\" Blitzer said. \"I asked you if you think having positive things to say about Hitler, like Trump reportedly has said, according to several retired four-star generals who worked closely with him, or dining with Holocaust deniers at Mar-a-Lago, for that matter, is anti-Semitic.\"\n\nSununu again admitted that Trump's praise of Adolf Hitler was \"not helpful,\" but then switched gears to ask the CNN host what he thought about the nationwide college campus protests of Israel's bombing of Gaza, which he characterized as \"constant anti-Semitism\" (many participants in those protests were Jewish). But Blitzer then countered that it wasn't just Kelly speaking out about Trump, but multiple senior members of the Trump administration, including former Vice President Mike Pence, former Defense Secretary Mark Esper and former National Security Advisor John. Bolton, among others.\n\n\"What's really disturbing, governor, is that virtually all of Trump's hand-picked to national security officials who worked closely with him for years are now warning about the threat he poses,\" Blitzer said. \"How disturbing is that to you? Are they all wrong?\"\n\nREAD MORE: This Trump trait makes him 'even more dangerous' than Hitler and Mussolini: ex-Dem senator\n\nWatch the full segment below, or by clicking this link.","summary":"CNN primetime host Wolf Blitzer recently had a testy exchange with New Hampshire Republican Governor Chris Sununu over former President Donald Trump's praise of Nazi dictator Adolf Hitler.\n\nOn Wednesday night, Blitzer invited Sununu onto his show to ask him directly what he thought of the 45th president of the United States saying complimentary things about Hitler to Marine General John Kelly when he served as Trump's White House chief of staff. The Atlantic's Jeffrey Goldberg wrote an article Tuesday describing conversations with Kelly, in which he confided that Trump longed to have the same kind of \"totally loyal\" generals \"that Hitler had.\" He also said that Hitler \"did some good things\" with Germany's economy with Kelly reminding him that he can't \"ever\" say anything complimentary about the architect of the Holocaust.\n\nThroughout their exchange, Sununu downplayed and equivocated and attempted to pivot to criticism of Vice President Kamala Harris and the Democratic Party. Blitzer, however, directly confron","url":"https://www.alternet.org/blitzer-gov-trump/","image":"https://www.alternet.org/media-library/image.jpg?id=53853114&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2024-10-24 00:08:34","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":-0.103},{"id":260862190,"title":"Trump's economic plan could speed up Social Security insolvency, analysis suggests","text":"Trump's economic plan could speed up Social Security insolvency, analysis suggests\n A new analysis suggests former President Donald Trump's economic proposals, should he win the election, could speed up when the Social Security trust fund runs out of money. This is according to a report by the nonpartisan group Committee for a Responsible Federal Budget. Marc Goldwein, senior vice president and senior policy director for the group, joins CBS News to unpack the findings.","summary":"A new analysis suggests former President Donald Trump's economic proposals, should he win the election, could speed up when the Social Security trust fund runs out of money. This is according to a report by the nonpartisan group Committee for a Responsible Federal Budget. Marc Goldwein, senior vice president and senior policy director for the group, joins CBS News to unpack the findings.","url":"https://www.cbsnews.com/video/trump-economic-plan-could-speed-up-social-security-insolvency-analysis/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/24/8d2314de-51b9-4ba9-81dc-eabd5256bc96/thumbnail/1200x630/9505526bfb0740a39a9aa5248ebbcc7f/cbsn-fusion-trump-economic-plan-could-speed-up-social-security-insolvency-analysis-thumbnail.jpg?v=c72f52c71e431f","video":null,"publish_date":"2024-10-24 00:06:47","author":null,"language":"en","source_country":"US","sentiment":-0.517},{"id":260863442,"title":"Musk shares fake image of The Atlantic, bringing fact-checking and condemnation from the magazine","text":"The Atlantic magazine has found itself in Elon Musk’s crosshairs after it fact-checked a fake image he shared that depicted an article with a headline that never actually ran in the publication. On Tuesday evening, Musk reshared a fake image on X that showed an article from the magazine reading “Trump Is Literally Hitler.” The article was never written for or published by The Atlantic, but Musk appeared to take the image as truth, commenting, “They are literally foaming at the mouth 😂.” The day after Musk posted the message, which had amassed over 20 million views, The Atlantic said in a statement that it did not publish an article with that headline. The statement did not mention Musk by name. In a statement to NBC News, a spokesperson for The Atlantic condemned sharing fake images like the one Musk reposted, saying, “The images are harmful and irresponsible, they misinform and manipulate people who encounter them, often using our own writers’ actual bylines.” It is the latest in a string of recent incidents in which Musk has shared false information leading up to the election and inspired public pushback and fact-checking. According to The Atlantic, it is one of several notable instances in the last several years in which faked images of articles from the magazine have gone viral. The original post was made by the user @Indian_Bronson, who wrote, “Completely insane story in The Atlantic today.” It included an altered headline, subheadline and first paragraph. Forbes reported that the photo in the post was from an opinion article published in The Washington Post titled “Yes, it’s okay to compare Trump to Hitler. Don’t let me stop you.” The user’s post appeared to be a commentary on a real article in The Atlantic that ran Tuesday titled “Trump: ‘I Need the Kind of Generals That Hitler Had,” written by its editor-in-chief, Jeffrey Goldberg. The real article reported, citing two unnamed sources, that former President Donald Trump said he wanted “the kind of generals that Hitler had,” which Trump campaign spokesperson Alex Pfeiffer called “absolutely false” in a statement to the publication. Goldberg’s article attracted additional scrutiny online after Mayra Guillén, the sister of Vanessa Guillén — a 20-year-old Army private at Fort Hood, Texas, who was killed by another soldier in 2020 and was heavily mentioned in Goldberg’s piece — criticized the article on X and announced that she would be voting for Trump. NBC News has not confirmed The Atlantic’s reporting. Both Musk’s and the user’s posts with the fake article were later marked with “Community Note” that clarified that the image was “not a real article.” The Community Note also attributed the edited image to the user and said it was “a satirical edit/photoshop of another article.” Musk did not respond to a request for comment. After The Atlantic published its fact-check, Musk, X’s owner, lashed out at it, quoting Guillén’s post in a post on Wednesday and writing, “The Atlantic is an evil publication.” A spokesperson for The Atlantic said that fake headlines mimicking the magazine began to become a significant issue for it in 2022 but that it has noticed a “recent uptick in recent weeks.” The spokesperson added that employees at The Atlantic, as well as the publication’s official account, flag the posts for X to add “Community Notes” to but said that “the ability to have resolution has been completely nullified” because of “Musk’s ownership of X and subsequent dismantling of the brand and safety teams we worked with to rectify these issues.” They also report posts on various platforms “as fake and as trademark infringements,” as users are using the publication’s trademark to “confuse and misinform readers.” Last week, another article by The Atlantic including a manipulated headline was shared on social media. The false headline read, “To Save Democracy Harris May Need To Steal An Election.” Rep. Chip Roy, R-Texas, shared a post on X including the fabricated headline, writing, “That doesn’t sound very ‘Democratic’ #ConstitutionalRepublic.” The post was marked with a “Community Note” and later deleted. The Atlantic also released a statement about the fabricated headline for the Oct. 6 article, whose original headline was “Kamala Harris Might Have to Stop the Steal.” In the news release, The Atlantic wrote that “images of fabricated Atlantic headlines have been circulating on social media with increasing frequency.” Earlier this year, an article that mimicked The Atlantic was shared online with the false headline “Why Migrants Eating Cats Might Be a Good Thing.” Another article with the false headline “The Heroism of Biden’s Bike Fall” also circulated online in June 2022. Forbes reported that in August, Musk reshared a post including a manipulated headline that resembled the British newspaper The Telegraph. The post, which Musk later deleted, included a headline that claimed that British Prime Minister Keir Starmer was considering creating “emergency detainment camps.” The publication later clarified that “no such article has ever been published.”","summary":"The Atlantic magazine has found itself in the crosshairs of Elon Musk after it fact-checked a fake image shared by the tech billionaire.","url":"https://www.nbcnews.com/tech/misinformation/elon-musk-atlantic-trump-hitler-john-kelly-rcna176945","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241017-elon-musk-ew-657p-f6f80d.jpg","video":null,"publish_date":"2024-10-24 00:05:49","author":"Bruna Horvath","authors":["Bruna Horvath"],"language":"en","category":"politics","source_country":"us","sentiment":0.104},{"id":260863548,"title":"US Vice President and Democratic presidential candidate Kamala Harris and former US President and Republican presidential candidate Donald Trump are into the final stretch of campaigning ahead of the US elections on November 5","text":"US Vice President and Democratic presidential candidate Kamala Harris and former US President and Republican presidential candidate Donald Trump are into the final stretch of campaigning ahead of the US elections on November 5 | National News | guampdn.com\n\nSkip to main content\n\nYou have permission to edit this image.\n\nUS Vice President and Democratic presidential candidate Kamala Harris and former US President and Republican presidential candidate Donald Trump are into the final stretch of campaigning ahead of the US elections on November 5\n\nDUSTIN FRANZ, Elijah Nouvelage\n\nPartners/afp\n\nAs featured on\n\nHarris says US ready for woman president\n\nKamala Harris said Tuesday that America is \"absolutely\" ready to elect its first woman president but downplayed her historic bid, saying she simply wants to turn the page for a nation \"exhausted\" by Donald Trump.\n\nChina should use fiscal policy to boost growth: IMF\n\nThe Chinese government should use its tax-and-spend policies to help boost flagging economic growth, a senior IMF official told AFP ahead of key meetings this week in Washington. \n\n2 more bets join PDN’s Convos with Candidates\n\nOnline Poll\n\nWho among the 2 Sånta Rita-Sumai mayoral candidates would you vote for? JanaLu Lizama Salvador or Dale Christopher Dale Alvarez Jr.?\n\nLatest E-Edition\n\nPacific Daily News\n\nPacific Daily News\n\nTrending Now\n\nPacific Star owner files bankruptcy after defaulting on $32M loan, Bank of Guam seeks to sell hotel\n\nMan found guilty of aggravated assault after attacking teens in park\n\nNWS: After 3-10 inches of rain on Sunday, brace for possible 1 or 2 more circulation near Marianas\n\n‘Don’t want anyone getting hurt': Arcade hit with $150K suit over rock climbing fall\n\nFamily seeks motorist who hit cyclist on NCS road Monday morning\n\nLocal Events","summary":"US Vice President and Democratic presidential candidate Kamala Harris and former US President and Republican presidential candidate Donald Trump are into the final stretch of campaigning ahead of the US elections on November 5","url":"https://www.guampdn.com/news/national/us-vice-president-and-democratic-presidential-candidate-kamala-harris-and-former-us-president-and-republican/image_aa369c7c-535e-5598-8046-7b8ec9a5699f.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/a/a3/aa369c7c-535e-5598-8046-7b8ec9a5699f/67185c887df57.image.jpg?crop=384%2C384%2C64%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-10-24 00:04:52","author":"Elijah Nouvelage","authors":["Elijah Nouvelage"],"language":"en","category":"politics","source_country":"GU","sentiment":-0.03},{"id":260861748,"title":"Zoe Saldaña Is ‘Scared and Worried’ About the Election, but ‘I Also Have a Lot of Faith’","text":"Zoe Saldaña admits she’s “worried” about what will happen on Election Day. But she refuses to lose any hope. “I am worried,” Saldaña told me Tuesday at the Los Angeles premiere of “Emilia Pérez.” “But then again, I was also worried in 2016…Of course, I’m scared and worried, but, I have faith that we’re going […]","summary":"Zoe Saldaña admits she’s “worried” about what will happen on Election Day. But she refuses to lose any hope. “I am worried,” Saldaña told me Tuesday at the Los Angeles premiere of “Emilia Pérez.” “But then again, I was also worried in 2016…Of course, I&#8217;m scared and worried, but, I have faith that we&#8217;re going [&#8230;]","url":"https://variety.com/2024/politics/columns/zoe-saldana-scared-worried-election-kamala-harris-donald-trump-1236189076/","image":"https://variety.com/wp-content/uploads/2024/10/GF2_1347.jpg","video":null,"publish_date":"2024-10-24 00:03:06","author":"Marc Malkin,Marcmalkin","authors":["Marc Malkin","Marcmalkin"],"language":"en","source_country":"US","sentiment":0.148},{"id":260862698,"title":"Trump: The Criminal Conspiracy Case review: How Donald threatened and bullied like Tony Soprano to cling to power, writes CHRISTOPHER STEVENS","text":"Trump: The Criminal Conspiracy Case (BBC2)\n\nBada-bing, bada-boom! There's one wise guy who can take the U.S. presidential election by the scruff and shake some sense into it — and it's not Donald Trump.\n\nNew Jersey mafia boss Tony Soprano is the man America needs. He'll keep the country safe, because protection is the basis of his business. He's not afraid to get his hands dirty, especially if that means dismembering a body in a bathtub.\n\nAnd he understands economics, never afraid to increase interest rates — or burn down the homes of people who neglect to pay.\n\nYou might argue that Big Tony faces a fatal disadvantage, since The Sopranos ended in 2007and the actor who played him, James Gandolfini, died six years later. But coming back from the dead is standard practice for U.S. politicians. No one can persuade me that Trump isn't Tony S reborn.\n\nIt beggared belief, as Trump: The Criminal Conspiracy Case unfolded, that the permatanned property mogul from New York could be days away from a return to the White House. His actions in the wake of the 2020 election, which he lost to Joe Biden, mirrored those of a banana republic dictator clinging to power during a coup.\n\n We heard tapes of his call to Brad Raffensperger, the Secretary of State for Georgia, in which he threatened, cajoled, bullied and even hinted at rewards if the vote count could be revised.\n\n'Instead of keep saying that the numbers are right,' Trump urged, 'why do you keep fighting this thing? You would be respected, really respected, if this thing could be straightened out.'\n\nThat's dialogue right out of The Sopranos — Tony's arm across a rival's shoulders, his voice heavy with manipulation and menace.\n\nOthers caught up in the disputed vote count, on which the outcome of the entire election hinged, are so fearful of a Trump win that they are getting ready to flee the country. 'I haven't opened my blinds in years,' said Eric Coomer, an executive for the IT company, Dominion, that built the ballot-checking software.\n\nHe played some of the threatening messages that have driven him into hiding. 'I hope you picked out your cell in Guantanamo Bay,' snarled one of the more moderate ones.\n\nAll accusations that Dominion tampered with voting machines have been proven false, and broadcaster Fox News has had to pay it more than $700 million to settle defamation claims.\n\nBut that doesn't stop Trump supporters believing the election was rigged. In fact, it reinforces their certainty that the conspiracy theories are true, and that's what this documentary failed to grasp. Trump's stroke of genius has been to cast professional media sources, including the BBC, as implacable enemies of his freedom, just as Tony regards the FBI. Anyone connected to them is treacherous, by definition.\n\nIn less than two weeks, America goes back to the polls. The predicted result is on a knife-edge. If it goes against Trump, the wrath of his supporters will make Soprano gangsters look like the Salvation Army.","summary":"It beggared belief, as Trump: The Criminal Conspiracy Case unfolded, that the permatanned property mogul from New York could be days away from a return to the White House","url":"https://www.dailymail.co.uk/news/article-13994713/Trump-Criminal-Conspiracy-Case-review-Donald-threatened-bullied-like-Tony-Soprano-cling-power-writes-CHRISTOPHER-STEVENS.html","image":"https://i.dailymail.co.uk/1s/2024/10/24/00/91214669-0-image-m-98_1729727184916.jpg","video":null,"publish_date":"2024-10-24 00:02:13","author":"Christopher Stevens,Editor","authors":["Christopher Stevens","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.315},{"id":260863154,"title":"The Papers: Justice cuts would be 'disaster' and 'special needs crisis'","text":"Aides to Sir Keir have been drawn into a row with Donald Trump over claims that Labour activists volunteering on the Kamala Harris campaign broke US electoral law, according to the Daily Telegraph. The paper says some of the party's most senior figures attended the Democratic National Convention in August. It quotes a US election lawyer saying discussions between Labour and Democrat officials could have been in breach of rules banning foreigners making any \"contribution\" to election campaigns. Labour has denied that any official meetings took place with Ms Harris’s team, the paper adds.","summary":"The Budget to be set out next week and the soaring costs of special needs education lead the papers.","url":"https://www.bbc.com/news/articles/c0k84ne78gno","image":"https://ichef.bbci.co.uk/news/1024/branded_news/282c/live/a2119d40-9196-11ef-8e6d-e3e64e16c628.png","video":null,"publish_date":"2024-10-24 00:01:37","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.071},{"id":260860930,"title":"House Republicans sparked the fight against campus antisemitism— let’s expand their majority","text":"Those who are fighting the rise of antisemitism in America owe a debt of gratitude to the US House of Representatives and its slim Republican majority.\n\nThe moral rot in higher education was exposed to the world in December in an unlikely venue: a special hearing of the little-known House Committee on Education and the Workforce, called by committee chair Virginia Foxx (R-NC).\n\nThat’s when Rep. Elise Stefanik (R-NY) posed what should have been a simple question to the presidents of Harvard, the University of Pennsylvania and MIT — “Yes or no: Calling for the genocide of Jews does not constitute bullying and harassment?”\n\nNone of the three could provide a clear and direct answer — and the outrageous exchange went viral, drawing widespread condemnation.\n\nTwo of the college presidents soon resigned, and Speaker Mike Johnson launched further investigations as part of a House-wide effort to combat antisemitism in the United States. \n\nThis important work proceeded for one reason, and one reason only: Because House Republicans decided to make it a priority.\n\nThe opposite is true in the Democrat-led Senate, where Majority Leader Chuck Schumer, his committee chairs and his colleagues have steadfastly refused to hold any hearings exclusively focused on antisemitism. \n\nLast month, in fact, a halfhearted effort chaired by Sen. Dick Durbin (D-Ill.) ended up “all lives mattering” the issue — and devolved into a shouting match as audience members hurled vile insults and curses at Jews in the hearing room. \n\nFor me and many others, this is personal.\n\nMy Jewish family lives in the Philadelphia suburbs, in a deep blue township within a blue county in Pennsylvania, arguably the most critical swing state of this election season. \n\nOur township is home to tens of thousands of high-earning, left-leaning, self-described progressives who have largely voted Democrat over the past 25 years. \n\nAnd many of them are both concerned and frightened by the Democratic Party’s passive response to the rampant antisemitism we’ve seen this past year.\n\nI’ve been volunteering 20 to 30 hours a week in my community door-knocking and campaigning for former President Donald Trump and his running mate J.D. Vance — and my neighbors are listening.\n\nI tell them I believe President Trump was the most effective and consequential president in history for the relationship between the United States and Israel, and remind them that his record of combating antisemitism, including his 2019 executive order expanding Title VI, is second to none. \n\nI also explain that while the presidential race garners most of our attention, much of the work of highlighting and addressing major issues starts in Congress, in House and Senate committees — and the party in power selects the committee chairs who almost single-handedly determine that agenda. \n\nPut another way: If you have an issue that you want the federal government to deal with, you need a committee chair who is interested in it, will hold hearings on it, and then do the hard work of drafting, negotiating, marking-up and approving legislation to send to the floor. \n\nPennsylvania this year has three of the dozen-plus House contests that will determine whether the GOP keeps its majority, as well as a hotly contested US Senate seat. \n\nSo as I work to persuade my fellow Pennsylvanians to vote Republican, I usually start by asking if they recall watching Rep. Stefanik question the three college presidents. Almost everyone answers that yes, they do.\n\nAnd I then challenge them with a proposition: The only reason the world had the chance to bear witness to the moral decay of our “elite” institutions is because Republicans held the majority in the House, and Republican committee chairs made the effort to shine a light on college antisemitism and propose solutions. \n\nVoting Republican in those Pennsylvania races will ensure this work can continue beyond January 2025.\n\nI also remind my neighbors that incumbent Sen. Bob Casey and his Democratic colleagues have held zero hearings focused exclusively on exposing antisemitism — and that they’ve stalled the Antisemitism Awareness Act, which the House passed with broad bipartisan support. \n\nEnding this logjam requires a GOP Senate majority, starting with Dave McCormick in Pennsylvania. \n\nMy message really is this simple: If you care about exposing and repairing the scourge of antisemitism on our campuses and in our communities, Republicans must have your vote on Nov. 5.\n\nJeff Bartos is a Republican strategist from Pennsylvania. X: @Jeff_Bartos","summary":"The world bore witness to the evil of antisemitism in our “elite” institutions because Republicans held the majority in the House — and exposed the presidents of Harvard, Penn and MIT.","url":"https://nypost.com/2024/10/23/opinion/to-fight-campus-antisemitism-give-gop-house-majority/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/CFMEN1.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-24 00:01:19","author":"Jeff Bartos","authors":["Jeff Bartos"],"language":"en","category":"politics","source_country":"us","sentiment":0.139},{"id":260861512,"title":"Harris to give her campaign’s closing argument at the Ellipse, where Trump helped spark Capitol riot","text":"PHILADELPHIA (AP) — Vice President Kamala Harris plans to lay out her campaign’s closing argument by returning to the site near the White House where Donald Trump helped incite a mob that attacked the U.S. Capitol in January 2021 — hoping it will crystalize for voters the fight between defending democracy and sowing political chaos.\n\nHer campaign says Harris will give a speech at the Ellipse on Tuesday — one week before Election Day — and will urge the nation to “turn the page” toward a new era and away from Trump.\n\nThe site is symbolic, since it’s where Trump delivered a speech on Jan. 6, 2021, as Congress was convening to certify Joe Biden’s victory in the election that past November. In it, Trump lied repeatedly about widespread voter fraud that had not occurred and urged supporters to fight. Hundreds then stormed the Capitol in a deadly riot.\n\nWord of the speech came from a senior Harris campaign official who insisted on anonymity to discuss an address that is still in development. The Harris campaign is betting that her speaking at the Ellipse can provide an opportunity for the vice president to stress that the country no longer wants to be defined by a political combativeness that Trump seems to relish.\n\nTrump has promised to pardon those jailed for their role in the Capitol attack should he reclaim the presidency during the election Nov. 5.\n\nAbout 4 in 10 likely voters in a CNN poll from September said the economy was their most important issue when deciding how to vote, and about 2 in 10 said protecting democracy was. That compared to about 1 in 10 who named either immigration or abortion and reproductive rights.\n\nProtecting democracy also seems to be more important to Democrats and Harris supporters. Roughly 4 in 10 voters who back Harris call it their top issue, compared to about 2 in 10 who say that about the economy. For Republicans and Trump supporters, about 6 in 10 name the economy as their top voting issue, followed by immigration. Only 5% of Trump supporters said protecting democracy was their top issue.\n\nClosing arguments are important opportunities for candidates to sum up their campaigns and make a concise case for why voters should back them.\n\nTrump’s campaign suggested he’d begin framing his closing argument while addressing a rally last weekend in Latrobe, Pennsylvania. Instead, the former president spent more than 10 minutes talking about the genitals of the late, legendary golfer Arnold Palmer, who was born in Latrobe.\n\nWord about Harris’ plans for next week came after she spent part of Wednesday visiting Philadelphia’s Famous 4th Street Deli — a longtime haven for elected officials where the politics is probably more famous than the pastrami and other lunchtime staples.\n\nShe’s in town to film a CNN town hall at 9 p.m. EDT. The vice president will take questions before an audience of undecided voters as part of what was once envisioned as a debate with Trump. Harris had said she would participate in a CNN debate but the two sides never worked out a formal agreement.\n\nBefore the town hall, Harris first hit the homey, Jewish-style deli known for its extra-large sandwiches. Famous 4th Street opened in 1923, and boasts of smoking its own pastrami, pickling its corned beef and brining its pickles.\n\nThe place was packed with what Harris called “super volunteers,” and Philadelphia Mayor Cherelle Parker was also in attendance. The vice president paused for selfies with some volunteers and Parker. When one man cried, “We’re gonna win,” Harris responded, “We are.”\n\nLater she was more superstitious while addressing the larger crowd, declaring, “Knock wood, God willing, we are going to win.”\n\nThe vice president promised to help the nation “turn the page” on an era of division, adding, “Because of all you are doing, we are building community, we are building coalitions.”\n\nIt has been a political tradition since the 1970s for politicians to gather at the deli on Election Day to talk shop with supporters and the media while having lunch, a black-and-white cookie or both.\n\nHarris eventually signed an order sheet, then grabbed a preordered to-go bag with a pastrami sandwich on rye and a slice of German chocolate cake.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"PHILADELPHIA (AP) — Vice President Kamala Harris plans to lay out her campaign&#8217;s closing argument by returning to the site near the White House where...","url":"https://wsvn.com/news/politics/harris-to-give-her-campaigns-closing-argument-at-the-ellipse-where-trump-helped-spark-capitol-riot/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/10/241013_Kamala_Harris_North_Carolina_rally.png","video":null,"publish_date":"2024-10-23 23:57:02","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.204},{"id":260860946,"title":"Brazil Reluctant to Pick Between US and China in Polarized World","text":"Billionaire philanthropist Bill Gates said that one of the keys to ensure that the green transition is successful is to find less expensive ways to generate energy, and that nuclear power will play a significant role in the future of renewables. Gates, who invests in climate tech, said one of his companies is building a plant to produce steel more sustainably with partners in Brazil. \n\nOf course, whatever happens in the US’s upcoming presidential election could reset the trajectory for Latin America’s business community — particularly as there is a potential for the entrenchment of protectionism. \n\nFormer President Donald Trump, who is running against Vice President Kamala Harris, told Bloomberg News last week that tariff “is the most beautiful word in the dictionary.” He said he would dramatically increase duties in a bid to get companies to return manufacturing to the US. \n\n“If you start to brave net markets because of either tariffs or regulatory barriers to that trade, it absolutely takes away the lower prices and high-speed innovation,” Gates said. \n\nPlus, global welfare will improve less under new tariffs, he said. And if the US moves forward with tariffs, other countries will too. \n\nDISCLAIMER: New Economy at B20 is being organized by Bloomberg Media Group, a division of Bloomberg LP, the parent company of Bloomberg News.\n\n—With assistance from Giovanna Bellotti Azevedo, Daniel Carvalho and Barbara Nascimento.","summary":"Brazilian leaders are walking a fine diplomatic line to appeal to both the US and China and shield their nation from any potential blowback in an increasingly polarized world.","url":"https://financialpost.com/pmn/business-pmn/brazil-reluctant-to-pick-between-us-and-china-in-polarized-world","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/776227919-1.jpg","video":null,"publish_date":"2024-10-23 23:56:25","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":0.113},{"id":260861820,"title":"CBS News Refuses Trump’s Demand to See Unedited ’60 Minutes’ Transcript With Kamala Harris","text":"Lawyers from CBS News sent a letter to Donald Trump’s legal team that plainly stated the former president has zero grounds to demand access to the network’s full “60 Minutes” interview with Vice President Kamala Harris.\n\nAs CNN reported Wednesday, CBS News senior vice president for legal affairs Gayle C. Sproul declined giving his team access, writing, “Nor is there any legal basis for your demand that we provide you with the unedited transcript of the interview.”\n\nAt the heart of the issue is the allegation that CBS News aired two different answers from Harris after she was asked about Israeli Prime Minister Benjamin Netanyahu. In her answer shown in the interview preview, the U.S. vice president defended American advocacy; in the interview that aired Oct. 7, she answered, in part, that “we are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.”\n\nSproul wrote that Harris’ answer was aired in its entirety — the first part that Sunday, and the second part that Monday. Since the interview, Trump and his supporters have said the network is covering up for Harris and that it edited her response.\n\nThis past Monday, Trump’s attorney Edward Andrew Paltzik sent a letter to the network in which he said CBS “intentionally misled the public by broadcasting a skillfully edited interview.” He also demanded “that you immediately provide and publicly release the full, unedited transcript” and “preserve all communications and documents.”\n\nIn her latest response, Sproul added, “Editing is a necessity for all broadcasters to enable them to present the news in the time available, and that is what ’60 Minutes’ did here, as it does with its other reports.” She further noted that providing an unedited transcript to Trump’s team could allow others to similarly push or threaten news organizations in the future.\n\n“A FAKE NEWS SCAM, which is totally illegal. TAKE AWAY THE CBS LICENSE,” Trump wrote on Truth Social on Oct. 10. “Election Interference. She is a Moron, and the Fake News Media wants to hide that fact. An UNPRECEDENTED SCANDAL!!! The Dems got them to do this and should be forced to concede the Election? WOW!”\n\nCBS News previously denied Trump’s allegations. In a statement shared Sunday, the newsroom explained, “Same question. Same answer. But a different portion of the response. When we edit any interview, whether a politician, an athlete or movie star, we strive to be clear, accurate and on point. The portion of her answer on ’60 Minutes’ was more succinct, which allows time for other subjects in a wide-ranging, 21-minute-long segment.”\n\n“Our long-standing invitation to former President Trump remains open. If he would like to discuss the issues facing the nation and the Harris interview, we would be happy to have him on ’60 Minutes,’” the network added. Trump infamously canceled his own planned “60 Minutes” sit-down at the start of the month.\n\n“60 Minutes” airs Sunday nights at 7 p.m. EST on CBS.","summary":"\"Editing is a necessity for all broadcasters to enable them to present the news in the time available,\" the network's VP for legal affairs explains\n\n\nThe post CBS News Refuses Trump&#8217;s Demand to See Unedited &#8217;60 Minutes&#8217; Transcript With Kamala Harris appeared first on TheWrap.","url":"https://www.thewrap.com/cbs-news-refuses-trump-unedited-60-minutes-harris-interview/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/donald-trump-cbs.jpg","video":null,"publish_date":"2024-10-23 23:56:22","author":"Stephanie Kaloi","authors":["Stephanie Kaloi"],"language":"en","category":"politics","source_country":"US","sentiment":-0.316},{"id":260861092,"title":"Harris to give her campaign’s closing argument at the Ellipse, where Trump helped spark Capitol riot","text":"By ZEKE MILLER and WILL WEISSERT\n\nPHILADELPHIA — Vice President Kamala Harris plans to lay out her campaign’s closing argument by returning to the site near the White House where Donald Trump helped incite a mob that attacked the U.S. Capitol in January 2021 — hoping it will crystalize for voters the fight between defending democracy and sowing political chaos.\n\nHer campaign says Harris will give a speech at the Ellipse on Tuesday — one week before Election Day — and will urge the nation to “turn the page” toward a new era and away from Trump.\n\nThe site is symbolic, since it’s where Trump delivered a speech on Jan. 6, 2021, as Congress was convening to certify Joe Biden’s victory in the election that past November. In it, Trump lied repeatedly about widespread voter fraud that had not occurred and urged supporters to fight. Hundreds then stormed the Capitol in a deadly riot. \n\nWord of the speech came from a senior Harris campaign official who insisted on anonymity to discuss an address that is still in development. The Harris campaign is betting that her speaking at the Ellipse can provide an opportunity for the vice president to stress that the country no longer wants to be defined by a political combativeness that Trump seems to relish.\n\nTrump has promised to pardon those jailed for their role in the Capitol attack should he reclaim the presidency during the election Nov. 5.\n\nAbout 4 in 10 likely voters in a CNN poll from September said the economy was their most important issue when deciding how to vote, and about 2 in 10 said protecting democracy was. That compared to about 1 in 10 who named either immigration or abortion and reproductive rights.\n\nProtecting democracy also seems to be more important to Democrats and Harris supporters. Roughly 4 in 10 voters who back Harris call it their top issue, compared to about 2 in 10 who say that about the economy. For Republicans and Trump supporters, about 6 in 10 name the economy as their top voting issue, followed by immigration. Only 5% of Trump supporters said protecting democracy was their top issue.\n\nClosing arguments are important opportunities for candidates to sum up their campaigns and make a concise case for why voters should back them.\n\nTrump’s campaign suggested he’d begin framing his closing argument while addressing a rally last weekend in Latrobe, Pennsylvania. Instead, the former president spent more than 10 minutes talking about the genitals of the late, legendary golfer Arnold Palmer, who was born in Latrobe.\n\nWord about Harris’ plans for next week came after she spent part of Wednesday visiting Philadelphia’s Famous 4th Street Deli — a longtime haven for elected officials where the politics is probably more famous than the pastrami and other lunchtime staples.\n\nShe’s in town to film a CNN town hall at 9 p.m. EDT. The vice president will take questions before an audience of undecided voters as part of what was once envisioned as a debate with Trump. Harris had said she would participate in a CNN debate but the two sides never worked out a formal agreement.\n\nBefore the town hall, Harris first hit the homey, Jewish-style deli known for its extra-large sandwiches. Famous 4th Street opened in 1923, and boasts of smoking its own pastrami, pickling its corned beef and brining its pickles.\n\nThe place was packed with what Harris called “super volunteers,” and Philadelphia Mayor Cherelle Parker was also in attendance. The vice president paused for selfies with some volunteers and Parker. When one man cried, “We’re gonna win,” Harris responded, “We are.”\n\nLater she was more superstitious while addressing the larger crowd, declaring, “Knock wood, God willing, we are going to win.”\n\nThe vice president promised to help the nation “turn the page” on an era of division, adding, “Because of all you are doing, we are building community, we are building coalitions.”\n\nIt has been a political tradition since the 1970s for politicians to gather at the deli on Election Day to talk shop with supporters and the media while having lunch, a black-and-white cookie or both.\n\nHarris eventually signed an order sheet, then grabbed a preordered to-go bag with a pastrami sandwich on rye and a slice of German chocolate cake.\n\nWeissert reported from Washington. Associated Press writer Linley Sanders contributed to this report from Washington.","summary":"Kamala Harris' campaign says she will urge the nation to “turn the page” toward a new era and away from Donald Trump.","url":"https://www.ocregister.com/2024/10/23/harris-to-give-her-campaigns-closing-argument-at-the-ellipse-where-trump-helped-spark-capitol-riot-2/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/Election_2024_Harris_61947-1.jpg?w=1024","video":null,"publish_date":"2024-10-23 23:55:46","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.245},{"id":260860942,"title":"Schumer, Dems pre-election report urges voters to be wary of 'misinformation' about results","text":"Senate Majority Leader Chuck Schumer, D-N.Y., and other Democrats in the upper chamber warned Americans in a new report that \"counting ballots may take longer\" in some places and they \"should be prepared to reject misinformation\" about the upcoming election. Schumer, alongside Senate Rules Committee Chair Amy Klobuchar, D-Minn., Sen. Bernie Sanders, I-Vt., Sen. Chris Murphy, D-Conn., Sen. Martin Heinrich, D-N.M., and Sen. Tammy Duckworth, D-Ill., released the report on Tuesday, which was geared at setting voter expectations for Election Day in less than two weeks and urging people to vote. TIM WALZ SLAMS ELON MUSK AS A 'DIPS---' DURING RALLY WITH OBAMA IN WISCONSIN \"Just like 2020, Donald Trump and his allies continue to refuse to commit to accepting the results of the election if he loses while pushing dangerous and divisive rhetoric to sow discord and undermine confidence in our election process. Americans losing faith in the results of our elections doesn’t just risk another January 6th but puts our very democracy at risk,\" Schumer said in a statement. \"Senate Democrats remain committed to ensuring all Americans can vote without fear or intimidation.\" Former President Trump will face off against Vice President Harris in November to determine who will succeed historically unpopular President Biden. In response to the Democrats' release of the report, Trump campaign spokesperson Karoline Leavitt told Fox News Digital in a statement, \"President Trump has always been clear: we must have free and fair elections. The Democrats are the real threat to democracy, weaponizing the justice system against President Trump for the past year to interfere in the election and unconstitutionally remove him from the ballot.\" \"Just last night, Joe Biden admitted the Democrat's strategy has always been to ‘lock him up,’\" she added. MCCONNELL, GOP DESCEND ON NEBRASKA TO SAVE DEB FISCHER'S ENDANGERED SENATE SEAT During a political event in New Hampshire on Tuesday, Biden said, \"I know this sounds bizarre. It sounds like if I said this five years ago, you'd lock me up. We got to lock him up,\" in reference to Trump, who has been indicted in four court cases. Biden quickly backtracked, explaining, \"Politically lock him up, lock him out. That's what we have to do.\" TOP REPUBLICANS ACCUSE FTC CHAIR OF HATCH ACT VIOLATIONS OVER 'CAMPAIGN-STYLE EVENTS' WITH DEMS In a section of the Democrats' report titled, \"In some states, we may not know the winner on Election Night. That’s OK,\" the Democrats explained that processing mail and absentee ballots, as well as the different rules governing the process in different states, could delay final results of the election. The senators additionally outlined, \"Background on Election Procedures,\" in certain crucial states that are either presidential or congressional battlegrounds, including Arizona, Florida, Georgia, Maine, Michigan, Montana, Nebraska, Nevada, North Carolina, Ohio, Pennsylvania, Texas and Wisconsin. PENNSYLVANIA SENATE RACE LABELED 'TOSS UP' IN LAST-MINUTE SHIFT BY TOP HANDICAPPER \"The right to vote is fundamental to our democracy, and we must do everything we can to protect it and uphold the integrity of the election process,\" Klobuchar said in a statement. \"That means pushing back on efforts to sow chaos during election season.\" \"As this report explains, it also means making sure that Americans know that it is possible that the outcome in some states will not be known on November 5th. While some states have expedited their counting requirements since 2020, we should be prepared to be patient about results in places where counting ballots may take longer. Americans should keep making their voices heard at the ballot box.\" CLICK HERE TO GET THE FOX NEWS APP The report comes as politicians brace for a presidential race and Senate and House races that will determine majorities that are considered too close for comfort. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Senate Democrats are seeking to preemptively debunk &quot;misinformation&quot; about the election results with two weeks before the contest.","url":"https://www.foxnews.com/politics/schumer-dems-pre-election-report-urges-voters-wary-misinformation-about-results","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/DNC-Kamala-Harris-Chicago-Day-2_25.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-23 23:53:14","author":"Julia Johnson","authors":["Julia Johnson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.044},{"id":260861206,"title":"Could John Kelly's Trump warning sway voters?","text":"Could John Kelly's Trump warning sway voters?\n Between campaign events, Vice President Kamala Harris and former President Donald Trump are reacting to recent comments from Trump's longest-serving chief of staff, John Kelly. In an interview with The New York Times, Kelly said the former president \"certainly falls into the general definition of fascist.\" CBS News chief election and campaign correspondent Robert Costa joins with analysis.","summary":"Between campaign events, Vice President Kamala Harris and former President Donald Trump are reacting to recent comments from Trump's longest-serving chief of staff, John Kelly. In an interview with The New York Times, Kelly said the former president \"certainly falls into the general definition of fascist.\" CBS News chief election and campaign correspondent Robert Costa joins with analysis.","url":"https://www.cbsnews.com/video/could-john-kelly-trump-warning-sway-voters/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/23/0110de52-0729-4ad3-9c67-cb7a2f4484dc/thumbnail/1200x630/7fe7cc60f5e788713be95656a25d4828/cbsn-fusion-could-john-kelly-trump-warning-sway-voters-thumbnail.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280","video":null,"publish_date":"2024-10-23 23:51:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.367},{"id":260860356,"title":"Elon Musk Confirms There’s No $25,000 Tesla EV On The Way","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nTesla CEO Elon Musk speaks at a town hall with Republican candidate for U.S. Senate Dave McCormick on Oct. 20, 2024 in Pittsburgh.\nGetty Images\n\nTesla CEO Elon Musk confirmed that the electric vehicle maker is not planning to release a $25,000 model, appearing to reverse comments he made six months ago when he denied a news report saying exactly that.\n\nThe billionaire entrepreneur and top donor to Donald Trump’s presidential campaign commented on the status of the so-called Model 2 EV on Wednesday after the Austin-based company reported a stronger-than-expected third-quarter profit. He was asked specifically about the status of the low-cost, non-robotaxi car while taking questions from Tesla retail investors during an earnings call.\n\n“We’re not making a non-robotaxi model,” he said. “I think we’ve made very clear that the future is autonomous.”\n\nEarlier this month, Musk unveiled his vision for Tesla’s future with its Cybercab robotaxi model at a show for fans of the brand at Warner Brothers Studios in Burbank, California, claiming the two-seat autonomous electric vehicle would sell for about $30,000 when it goes into production in 2026. Whether such a product will actually arrive on time and at the promised price remains to be seen. Overall, the company’s goal is to lower the price of all its products and Musk said it’s on track to sell vehicles that cost less than $30,000, once government subsidies are factored in.\n\nTesla claims it's Cybercab robotaxi model will sell for about $30,000 when it arrives in 2026.\n\nIn April, Reuters reported that Tesla had canceled the Model 2 program, a vehicle that might have been produced in a new plant the company was hoping to build in Mexico. Musk denied the Reuters report at the time, writing on X, the social media platform he owns, that the news agency was “lying.” Nevertheless, over the past six months, he offered no details on whether such a vehicle was in the works. The company also set aside plans to build the Mexican factory.\n\nMusk has repeatedly tied Tesla’s future to autonomous driving and humanoid robots, rather than simply selling electric vehicles and batteries. Nevertheless, in the quarter that ended on Sept. 30, 89% of Tesla’s $25.2 billion of revenue came from selling vehicles and batteries. The company’s financial statements don’t specify any revenue specifically related to AI-enabled services.\n\nTesla shares jumped 12% in after-hours trading, following the company’s quarterly earnings release. It reported 72 cents in adjusted earnings per share on $2.51 billion of net income. That topped consensus analyst estimates that called for EPS of 59 cents and $2.01 billion onf net income, according to FactSet.\n\nMore From Forbes\nForbesTesla Delivers Robust Q3 Earnings As Musk’s Firm Returns To Profit Growth—Stock Rockets 12%By Derek SaulForbesElon Musk Shows Off Tesla Cybercabs At Much-Hyped EventBy Richard NievaForbesElon Musk Sees Tesla’s Future In Self-Driving Robotaxis But He’s Far Behind WaymoBy Alan Ohnsman\n\nFollow me on LinkedIn. Check out my website. Send me a secure tip. \n\nAlan Ohnsman\n\nEditorial Standards\n\nForbes Accolades","summary":"In April, the volatile billionaire claimed Reuters was \"lying\" after it reported that the so-called Model 2 program was canceled, but now he appears to have validated ...","url":"https://www.forbes.com/sites/alanohnsman/2024/10/23/elon-musk-confirms-theres-no-25000-tesla-ev-on-the-way/","image":"https://imageio.forbes.com/specials-images/imageserve/6719853022a84bbdbbe10d67/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-23 23:48:32","author":"Alan Ohnsman,Forbes Staff","authors":["Alan Ohnsman","Forbes Staff"],"language":"en","source_country":"US","sentiment":-0.287},{"id":260860724,"title":"How Harris, Trump messaging is playing to voters","text":"How Harris, Trump messaging is playing to voters\n Vice President Kamala Harris has made former President Donald Trump's recent rhetoric, in which he has painted his political rivals as threats to the U.S., a focus of her campaign message. Major Garrett looks at whether that is resonating with voters.","summary":"Vice President Kamala Harris has made former President Donald Trump's recent rhetoric, in which he has painted his political rivals as threats to the U.S., a focus of her campaign message. Major Garrett looks at whether that is resonating with voters.","url":"https://www.cbsnews.com/video/how-harris-trump-messaging-is-playing-to-voters/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/14/5091f826-3c03-4320-a0f8-602c1e1cc896/thumbnail/1200x630/2d8afa99f55939c6d8ed2111ae50374d/cbsn-fusion-trump-harris-both-campaigning-in-pennsylvania-thumbnail.jpg?v=c72f52c71e431fd7dde1ba5ae2f69280","video":null,"publish_date":"2024-10-23 23:46:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.032},{"id":260860120,"title":"Cooper Hefner’s $100M Playboy Bid: Can He Reinvent The Brand?","text":"Carmen Electra, Jaime Pressly and Pamela Anderson during The Official Launch Party For Spike TV At ... [+] The Playboy Mansion - Inside at The Playboy Mansion in Bel Air, California, United States. (Photo by Jeff Kravitz/FilmMagic, Inc)\nFilmMagic, Inc\n\nCooper Hefner, son of the late Hugh Hefner and founder of Hefner Capital, has made a bold $100 million cash bid to reclaim the iconic Playboy brand. If ever there were an example of the power of a brand’s emotional connection, I’d say this is it.\n\nAt 32, Cooper Hefner is a clear brand believer, wagering on the intangibles of Playboy, namely the brand's famous rabbit-ear logo and its deeply ingrained cultural legacy. His vision will inevitably seek to revive what was once a global phenomenon. Playboy Enterprises, founded in 1953, quickly grew from a magazine into a lifestyle brand, encompassing everything from the legendary Playboy Clubs to the opulent Playboy Mansion. The first Playboy Club, which opened in Chicago, boasted 50,000 members in its first year, eventually expanding to 23 clubs worldwide.\n\nHowever, the brand's influence began to wane by the 1980s, facing stiff competition and criticism for its objectification of women. Moreover, in recent years, Playboy’s image has been further marred by scandals and serious allegations involving Hugh Hefner, tarnishing the reputation of both the Playboy Mansion and the brand as a whole. These are not easy associations to overcome. Regardless, Cooper Hefner’s attempt to reclaim the brand highlights the enduring emotional power it still holds for many, as he seeks to revive the company while navigating its controversial past.\n\nThere is no doubt in my mind that Playboy needs a total rebrand if it has any chance of reemerging victorious in today’s world—no Victoria’s Secret out of touch comeback efforts please.\n\nBut until then, what can today’s leaders learn from Hefner’s audacious move?\n\nLegacy Isn’t Just About Nostalgia—It’s About Emotional Connection\n\nCooper Hefner’s motivations aren’t rooted in nostalgia alone—they’re most likely highly emotional. “This effort is about safeguarding a legacy built over decades,” he told The Hollywood Reporter. He’s speaking to more than just shareholders; he’s tapping into the universal truth—namely that successful brands are born from deep emotional connections. The Playboy brand represents much more than an American company that once published racy magazines. Hugh M. Hefner’s legacy includes cultural icons like the Playboy Club and the famous Playboy Mansion, which played a significant role in shaping discussions around the sexual revolution.\n\nMoncler At Shanghai Fashion Week: Leading Luxury Co-Creation In 2024\n\nAs I emphasize in my book The Kim Kardashian Principle: successful brands build emotional connections with their audiences and thrive on personal connection. The more personal, the better. Research shows that emotionally connected audiences have a 306% higher lifetime value than satisfied customers. Successful brands aren’t just products; they’re experiences, memories, and values wrapped up in a name. In today’s competitive marketplace, the strength of those emotional ties can be the difference between a thriving brand and one that’s forgotten.\n\nWhen you lead a brand, ask yourself: What does my brand really mean to people?\n\nHOLMBY HILLS, CA - AUGUST 16: Hugh Hefner (L) and Cooper Hefner attend the Annual Midsummer Night's ... [+] Dream Party at the Playboy Mansion hosted by Hugh Hefner on August 16, 2014 in Holmby Hills, California. (Photo by Christopher Polk/Getty Images for Playboy)\nGetty Images for Playboy\n\nAdapt or Die—The Playboy Story\n\nPlayboy was once a cultural juggernaut, with its print magazine at the heart of its success. Over the years, some of the world’s biggest celebrities posed nude for its pages, including Kim Kardashian, Cindy Crawford, and Kate Moss, capturing more than just the public's attention.\n\nAt its peak, Playboy’s best-selling issue moved over 7 million copies. However, the brand struggled to adapt to the times. As the cultural landscape shifted, Playboy faced growing criticism for objectifying women, increasingly painting the brand as demeaning and out of touch with modern values. Additionally, the rise of digital competitors offering more explicit content—driven by audience demand—and the decline of advertising revenues created financial hurdles that Playboy Enterprises struggled to overcome.\n\nBy the time Hugh Hefner passed away in 2017, the company had largely shifted its business model, relying on licensing deals for the Playboy bunny logo and other intellectual property. While these deals helped keep the brand alive, they were not enough to offset the steep decline in revenues from the iconic print magazine.\n\nChristie Hefner, Hugh Hefner’s daughter and former CEO of Playboy Enterprises, tried to guide the company through these turbulent times, but the brand’s failure to meaningfully address its problematic history and radically reinvent itself for a rapidly changing world contributed to its downfall as a publishing empire. The once-iconic print magazine ceased publication in 2020, marking the end of an era for the Playboy Group.\n\nWhile Calvin Klein was not a direct competitor of Playboy, I think it’s worth comparing both brand’s significant cultural impact, especially in the realms of sexuality and lifestyle.\n\nCalvin Klein, known for its provocative fashion campaigns featuring stars like Mark Wahlberg and Kate Moss, leaned into sexuality to sell clothing, underwear, and fragrances. However, I’d say, where Calvin Klein succeeded in adapting to the digital age, Playboy Enterprises faltered. As digital competition intensified, Playboy struggled to evolve, with its print magazine seeing declining relevance. In contrast, Calvin Klein embraced digital transformation and cultural shifts, sustaining its relevance in the fashion industry. According to McKinsey, top-performing companies are 2.5 times more likely to capture value through digital transformation—something Calvin Klein achieved while Playboy's reliance on its legacy left it behind in a changing world.\n\nLeaders should never assume that past success guarantees future relevance. Instead, ask: Am I making a big enough change to stay ahead of cultural and technological trends?\n\nSinger Mark Wahlberg walks the runway at the Seventh Annual California Fashion Industry Friends of ... [+] AIDS Project Los Angeles (APLA) Benefit Dinner and Fashion Show to Honor Calvin Klein on June 3, 1993 at the Hollywood Bowl in Hollywood, California. (Photo by Ron Galella, Ltd./Ron Galella Collection via Getty Images)\nRon Galella Collection via Getty Images\n\nIntellectual Property Can Be Your Lifeline\n\nWhen print revenues began to fade, Playboy Enterprises Inc. turned to its most valuable asset: intellectual property, notably the enduring Playboy bunny logo. Beyond the Playboy Mansion—also known as Playboy Mansion West—which became an icon in pop culture, the company leaned on licensing deals to stay afloat. This included ventures into various markets, from jewelry sold in Saudi Arabia to a no-nudity edition of the magazine launched in South Korea, which helped generate revenue.\n\nPlayboy found initial success in South Korea when it introduced its local edition in 1991, appealing to a rapidly modernizing market. The global recognition of the Playboy brand resonated in a country that was becoming more open to Western pop culture. However, despite this strong start, Playboy Korea struggled with conservative cultural norms and strict censorship regulations. South Korea’s obscenity laws severely restricted explicit content, making the magazine less distinctive compared to other fashion and lifestyle publications. This challenge, combined with increasing competition from digital platforms, led to the decline of Playboy Korea, which ceased publication in 2006.\n\nSimilarly, when Playboy ventured into Saudi Arabia in 2010, licensing its iconic bunny logo for a line of high-end jewelry, it faced significant backlash. While the Playboy jewelry collection was marketed without reference to the magazine’s adult themes, focusing solely on the logo as a fashion symbol, the association with adult content clashed with the deeply conservative values in Saudi Arabia. The controversy led to many retailers pulling the jewelry line from shelves under public pressure, signaling that Playboy’s brand, even without its explicit content, remained problematic in certain markets.\n\nI believe these challenges highlight the importance of leveraging intellectual property strategically. Ocean Tomo reports that intangible assets, such as trademarks and IP, now account for 90% of the market value of S&P 500 companies.\n\nLeaders need to understand the power of IP. It’s not just about trademarks and logos—it’s about creating experiences that people identify with on a deeper level. Strong IP can generate revenue far beyond your core products, protecting your brand when market trends shift.\n\nHOLMBY HILLS, CA - MAY 6: (L to R) Playboy bunny Sheila Levell, Playboy founder Hugh Hefner and ... [+] Playboy bunny Holly Madison perform a scene during the filming of a commercial for \"X Games IX\" at the Playboy Mansion May 6, 2003 in Holmby Hills, California. This year's X Games will take place at STAPLES Center in Los Angeles from August 14th through 18th. (Photo by Robert Mora/Getty Images)\nGetty Images\n\nLeadership Matters, Strategy is Everything\n\nCooper Hefner doesn’t seem shy about the role leadership plays in his plans to revive the brand. \"With the right leadership and strategy, we aim to unlock new avenues of value,\" Hefner told The Hollywood Reporter.\n\nI hope those are radically new avenues of value.\n\nStrong leadership was critical in Playboy’s earlier success, with Hugh M. Hefner steering the magazine’s influence on American culture through interviews with figures like Malcolm X and Donald Trump, and sparking debates about personal life and the sexual revolution. However, without a clear and innovative strategy, even iconic brands risk losing relevance.\n\nInterestingly research by Deloitte shows that effective leadership is rare, with only 60% of leaders demonstrating commercial acumen and 48% being seen as driving change and innovation. Leaders need to understand changing conditions and respond effectively to maintain their brand's relevance. The report also reveals that companies with strong leadership outperform others by 35% in terms of revenue growth.\n\nCooper’s playbook—a blend of nostalgia and modernization—aims to revitalize the Playboy Group for a new generation. But I don’t believe it’s just about reconnecting with past successes. The most mature leaders connect with others to learn and grow, enabling them to innovate and build talent for competitive advantage. By focusing on leadership development and adapting to modern challenges, Cooper Hefner could look to recreate Playboy's success in a way that resonates with today’s consumers.\n\nAsk yourself: Do I have the right leadership in place to truly adapt, innovate, and lead? Without a clear strategy, even the most iconic brands can never find their way.\n\nJAKARTA, INDONESIA: A protester shouts slogans during a demonstration in Jakarta, 30 January 2006, ... [+] against the planned debut of local edition of men's magazine \"Playboy.\" Angry protests has been triggered after a local publisher are preparing to launch the raunchy Playboy magazine in world's largest Islamic nation as Islamic leaders voiced that magazine will corrupt a culture already being inundated by western influences. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP via Getty Images)\nAFP via Getty Images\n\nNostalgia Meets Innovation—The Sweet Spot for Growth\n\nWhile nostalgia is a powerful tool, I do believe it must be paired with strategic innovation to resonate with today’s consumers. Cooper Hefner could use the legacy of Hugh Hefner as a spring board but adapt it to fit a rapidly evolving cultural landscape.\n\nResearch suggests that nostalgia marketing is highly effective, with 67% of consumers more likely to purchase from brands that evoke memories. However, studies also show that leadership plays a crucial role in a company’s ability to innovate and stay relevant. Deloitte reports that strong leadership is critical for navigating change, yet only 48% of business leaders are seen as driving innovation. For example, just as Donald Trump’s image helped create appeal around the Trump Tower brand, Cooper could tap into the legacy of the Playboy Mansion while updating it for a new audience.\n\nBrand leaders need to ask: How can I use the legacy of my brand while rethinking its role in today’s world?\n\nA Bunny Girl croupier spins the roulette wheel in the casino at London's Playboy Club, 20th December ... [+] 1967. (Photo by David Cairns/Express/Hulton Archive/Getty Images)\nGetty Images\n\nThere is no doubt in my mind that Cooper Hefner’s bold move for Playboy is about more than business for him—it’s emotional. This is about legacy, yes, but it’s also about the future and creating something entirely new. What Playboy needs now is a radical rebirth, not just a reboot. Look at Victoria’s Secret: their recent attempts at change were tepid, and they’re still struggling to stay relevant. Playboy must be reimagined from the ground up, blending radical innovation with its iconic heritage to reconnect with audiences. Will Cooper Hefner succeed? I sure hope so. Playboy could emerge stronger than ever, proving that reinvention is not just possible but powerful and empowering.\n\nNamed Esquire’s Influencer Of The Year, Jeetendr Sehdev is a media personality, international speaker and the author of the New York Times bestselling sensation, The Kim Kardashian Principle: Why Shameless Sells (and How to Do It Right.)","summary":"Cooper Hefner's $100M bid to reclaim Playboy aims to revive the brand’s legacy. With challenges tied to the brand’s cultural past, can he do it?","url":"https://www.forbes.com/sites/jeetendrsehdev/2024/10/23/cooper-hefners-100m-playboy-bid-can-he-reinvent-the-brand/","image":"https://imageio.forbes.com/specials-images/imageserve/671973bb46323be1b3c0a6ba/0x0.jpg?format=jpg&crop=3000,1686,x0,y51,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-23 23:41:15","author":"Contributor,Jeetendr Sehdev,Jeff Kravitz","authors":["Contributor","Jeetendr Sehdev","Jeff Kravitz"],"language":"en","source_country":"US","sentiment":0.259},{"id":260860050,"title":"More than $26M has poured into this toss-up NY Congressional race — making it the costliest in the state","text":"More than $26 million has so far been poured in the battleground 19th Congressional District race between Republican Rep. Marc Molinaro against Democrat Josh Riley – making it the costliest in New York and the seventh priciest in the country.\n\nMolinaro, a first-term congressman who narrowly beat Riley in 2022 to rep the upstate district, noted the massive amount of cash being spent on both sides during a recent event, calling it nearly “obscene.”\n\n“I have become a little bit more angry than I used to be,” Molinaro told a crowd at the Ulster County Chamber of Commerce’s candidates forum last week, seemingly deviating from his usual stump speeches.\n\n“Please cut through the TV ads and the digital ads and the mail cards, and by the way on both sides, everybody spends far too much money in order to promote their particular side of the aisle and their candidate,” Molinaro begged the gathering of business big wigs.\n\n“It’s almost to the extent, obscene,” he said.\n\nAccording to disclosure reports compiled by OpenSecrets, Molinaro’s campaign as well as outside spending groups like Super PAC’s and non-profit organizations have spent around $12 million.\n\nOn the flip side, Riley’s campaign and outside spending groups on his side have spent around $14 million so far this cycle.\n\nIn 2022, the candidates and outside groups only spent just shy of $20 million on the race total, almost split evenly between the two sides.\n\nRecent polling is showing the district is a true toss up. The race was determined by a margin of around 4,500 votes last cycle.\n\nInsiders have noted that the fierce nature of the rematch has prompted the candidates to change the way they approach the campaign, with Molinaro – who long presented himself as a moderate – changing his tune to appeal to the Republican base.\n\nVoters tell The Post they’ve seen Molinaro morph since he ran as the 2018 GOP gubernatorial candidate, too.\n\n“I think when he ran against [former Gov. Andrew] Cuomo, I had issues with him. I thought he was a bit wishy washy. I thought just afraid to come out and speak his mind,” Paul Bombard, of North Greenbush, told The Post at a recent rally in Rensselaer County.\n\n“Then he went up against Josh, and I saw a different guy. I said to my wife, I’m going, ‘that’s the guy I was looking for a few years ago when he was going against Cuomo.’ He’s not afraid to just come out and say, ‘hey, you know, you’ve been lying about this,’” Bombard said.\n\nBombard, who used to own an electrical business, said he previously voted Democrat, but former President Donald Trump won him over in his first bid for the White House in 2016.\n\nMolinaro introduced the rally’s headliner, North Country Rep. Elise Stefanik (R-NY), the number three Republican in the House.\n\nSpeaking to reporters ahead of the event, Stefanik defended Molinaro’s commitment to the GOP and the party’s 2024 presidential candidate.\n\n“Marc supports President Trump and President Trump supports Marc,” Stefanik said.\n\nMolinaro, who didn’t vote for Trump in 2016, doesn’t regularly sing the former president’s praises in his stump speeches — but he’s also quick to dispel the notion that he isn’t on the “Trump Train.”\n\n“I support the former president. I think Donald Trump and a Trump administration will, without question, provide, not only border security, but obviously commit to keeping American America safe,” Molinaro said, flanked by Stefanik and surrounded by a crowd of curious onlookers ahead of the rally.\n\n“And on any given day, I could not support four more years of a, surrender of the southern border, a massive increase in cost of living for the people I represent and a weakening of America,” Molinaro continued.\n\nThe remarks stand in stark contrast to Molinaro’s messaging in the previous cycle. After declaring victory on election night in 2022, he touted the importance of House leadership giving deference to reps in “purple” districts like his and of promoting an air of cooperation between the two parties.\n\n“I am not going to Washington, DC, to blame people for why things have gone wrong. I am not going to Washington, DC to waste time attacking others or belittling people with whom I might disagree,” Molinaro said at the time.\n\nMolinaro told reporters in Albany this week that he doesn’t foresee him and Riley being friends in any capacity after this year’s race is over.\n\nBoth his and Riley’s campaign declined to comment.","summary":"More than $26 million has so far been poured in the battleground 19th Congressional District race between Republican Rep. Marc Molinaro against Democrat Josh Riley – making it the costliest in New York and the seventh priciest in the country. Molinaro, a first-term congressman who narrowly beat Riley in 2022 to rep the upstate district, &#8230;\n\n\nThe post More than $26M has poured into this toss-up NY Congressional race — making it the costliest in the state appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/more-than-26m-has-poured-into-this-toss-up-ny-congressional-race-making-it-the-costliest-in-the-state/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/92236582.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-23 23:41:07","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.131},{"id":260860164,"title":"Bret Baier from Fox News talks about the tough questions he couldn’t ask Kamala Harris during their heated interview.","text":"Fox News chief political anchor Bret Baier believes that physical abuse allegations swirling around Second Gentleman Doug Emhoff deserve further investigation.\n\nAnd, if Baier had the time last week, he may even asked Vice President Kamala Harris about the claims himself in his blockbuster primetime interview with her.\n\nThe sit-down down attracted nearly 8 million viewers on Fox News Channel, a polarized response from the media and outright mockery from Saturday Night Live.\n\nThe interview was labeled ‘combative’ by critics and refreshing by others, as Baier attempted to pin Harris down on issues central to the campaign — illegal immigration, the state of the economy and her support for controversial taxpayer-funded gender-transition surgeries, among other issues.\n\nSpeaking exclusively to DailyMail.com, Baier now says that, going into the interview, he knew Harris would try to evade his pointed questions: ‘I watched her previous interviews… I tried to do it in a way that took her off her talking points.’\n\nIt was the same ‘style’ of interview that Baier said he used against President Donald Trump in their last one-on-one in 2023.\n\nBut it was the question that Baier didn’t ask that caught the attention of Mail columnist Maureen Callahan.\n\n‘What about Doug?’ Callahan demanded in an article published last week.\n\nEarlier this month, the Mail reported that in May 2012 Emhoff allegedly hit his then-girlfriend in the face so hard that she spun around – while they waited in a valet line outside a Cannes Film Festival party.\n\nAn Emhoff spokesperson has denied the claim, saying ‘any suggestion that he would or ever hit a woman is false.’\n\nThe abuse allegation followed the Mail’s previous reporting that Emhoff had cheated on his first wife with this family’s nanny, Najen Naylor, allegedly impregnating her.\n\nEmhoff has since admitted to the extra-marital affair that led to his divorce before he married Harris in 2014. He has not commented on whether or not he and Naylor conceived.\n\nBaier now says he considered asking Harris about this reporting.\n\n‘It was in the list of questions – and I’ve followed the Daily Mail’s reporting on it,’ he said. ‘It was in the list. It was down past some of the other hot issues.’\n\nThe other concerns that Baier had hoped to question Harris on included her proposal to impose new taxes on wealthy Americans, her policies toward China, and how she’d unite a fiercely divided country in the event that she won the election.\n\nThese and other issues rank high among voter concerns.\n\n‘I think immigration was the thing that I led with because it does come up again and again when we ask people: What’s most important [to your vote in 2024],’ he explained.\n\nThat said, the Fox News anchor thinks that some in the mainstream media may have partisan motivations for overlooking the Emhoff allegations.\n\n‘I think it’s a fair story to ask those questions, especially with solid backup, and obviously ask for a response,’ he said.\n\nBaier concluded that it’s ‘pretty clear’ that the spouse of a Republican political figure ‘probably wouldn’t’ receive the same treatment as Emhoff has received from a sympathetic mainstream media.\n\nBut that all may change if Emhoff’s alleged victim were to come forward and publicly speak out about her allegations, he said: ‘I think if that story evolves to someone speaking out, not anonymously, maybe that changes the dynamic.’\n\nGoing forward, Baier is seeking another opportunity to interview the vice president – and he’s not ruling out asking the question: What about Doug?\n\n‘I’m not going to commit to anything… You’d have to see how the interview goes,’ Baier said, noting that Harris’ team hasn’t committed to a follow-up interview either.","summary":"Fox News chief political anchor Bret Baier believes that physical abuse allegations&#8230;","url":"https://internewscast.com/news/us/bret-baier-from-fox-news-talks-about-the-tough-questions-he-couldnt-ask-kamala-harris-during-their-heated-interview/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Fox-News-Bret-Baier-reveals-the-controversial-800x430.jpg","video":null,"publish_date":"2024-10-23 23:41:00","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.019},{"id":260860282,"title":"Harris decries Trump after John Kelly says he wanted generals like Hitler’s","text":"By DAN MERICA\n\nWASHINGTON — Kamala Harris said Wednesday that comments praising Adolf Hitler reportedly made by Donald Trump to his longest-serving chief of staff offer a window into who the former president “really is” and the kind of commander in chief he would be.\n\nIn interviews with The New York Times and The Atlantic published Tuesday, John Kelly warned that the Republican nominee meets the definition of a fascist and that while in office he suggested that the Nazi leader “did some good things.”\n\nHarris, the vice president and Democratic nominee, repeated her increasingly dire warnings about Trump’s mental fitness and his intentions for the presidency.\n\n“This is a window into who Donald Trump really is, from the people who know him best, from the people who have worked with him side by side in the Oval Office and in the Situation Room,” Harris told reporters outside the vice president’s residence in Washington.\n\nThe comments from Kelly, the retired Marine general who worked for Trump in the White House from 2017 to 2019, built on past warnings from former top Trump officials as the election enters its final two weeks.\n\nKelly has long been critical of Trump and previously accused him of calling veterans killed in combat “suckers” and “losers.” His new warnings emerged as Trump seeks a second term vowing to dramatically expand his use of the military at home and suggesting he would use force to go after Americans he considers “enemies from within.”\n\n“He commented more than once that, ‘You know, Hitler did some good things, too,’” Kelly recalled to the Times. Kelly said he would usually quash the conversation by saying “nothing (Hitler) did, you could argue, was good,” but Trump would occasionally bring up the topic again.\n\nIn his interview with The Atlantic, Kelly recalled that when Trump raised the idea of needing “German generals,” Kelly would ask if he meant “Bismarck’s generals,” referring to Otto von Bismarck, the chancellor who oversaw the unification of Germany. “Surely you can’t mean Hitler’s generals,” Kelly recalled asking Trump. To which the former president responded, “Yeah, yeah, Hitler’s generals.”\n\nTrump said on his Truth Social media platform that Kelly had “made up a story” and went on to heap insults on his former chief of staff, including that Kelly’s “toughness morphed into weakness.”\n\nTrump’s campaign also denied the accounts. Campaign spokesman Steven Cheung said Kelly had “beclowned himself with these debunked stories he has fabricated” and, after Harris’ statement, accused the Democratic candidate of sharing “outright lies and falsehoods.”\n\nChris Sununu, New Hampshire’s Republican governor and onetime Trump critic, said Kelly’s comments did not change his plans to vote for the former president.\n\n“Look, we’ve heard a lot of extreme things about Donald Trump, from Donald Trump. It’s really par for the course,” the governor told CNN. “Unfortunately, with a guy like that, it’s kind of baked into the vote at this point.”\n\nSome of the former president’s supporters in swing states responded to Kelly’s comments with a shrug.\n\n“Trump did his four years, and we were in great shape. Kelly didn’t have anything good to say about Trump. He ought to have his butt kicked,” said Jim Lytner, a longtime advocate for veterans in Nevada who served in the Army in Vietnam and co-founded the nonprofit Veterans Transition Resource Center.\n\nHarris said Wednesday that Trump admired Hitler’s generals because he “does not want a military that is loyal to the United States Constitution, he wants a military that is loyal to him. He wants a military who will be loyal to him personally.”\n\nPolls show the race is tight in swing states, and both Trump and Harris are crisscrossing the country making their final pitches to the sliver of undecided voters. Harris’ campaign has spent considerable time reaching out to independent voters, using the support of longtime Republicans such as former Rep. Liz Cheney and comments like Kelly’s to urge past Trump voters to reject his candidacy in November.\n\nHarris’ campaign held a call with reporters Tuesday to elevate the voices of retired military officials who highlighted how many of the officials who worked with Trump now oppose his campaign.\n\n“People that know him best are most opposed to him, his presidency,” said retired Army Brig. Gen. Steve Anderson.\n\nAnderson said he wished Kelly would fully back Harris over Trump, something he has yet to do. But retired Army Reserve Col. Kevin Carroll, a former senior counselor to Kelly, said Wednesday that the former top Trump official would “rather chew broken glass than vote for Donald Trump.”\n\nBefore serving as Trump’s chief of staff, Kelly worked as the former president’s secretary of homeland security, where he oversaw Trump’s attempts to build a wall along the U.S.-Mexico border. Kelly was also at the forefront of the administration’s crackdown in immigration policy that led to the separation of thousands of immigrant parents and their children along the southern border. Those actions made him a villain to many on the left, including Harris.\n\nAfter Kelly left the Trump administration and joined the board of a company operating the nation’s largest detention center for unaccompanied migrant children, Harris wrote during her 2019 run for president that he was “the architect” of the administration’s “cruel child separation policy. Now he will profit off the separation of families. It’s unethical. We are better than this.”\n\nWhen she was in Miami for a primary debate in June 2019, Harris was also one of a dozen Democratic presidential candidates who visited the detention center south of the city and protested against the administration’s harsh treatment of young migrants.\n\nIn his interview with the Times, Kelly also said Trump met the definition of a fascist. After reading the definition aloud, including that fascism was “a far-right authoritarian, ultranationalist political ideology and movement characterized by a dictatorial leader,” Kelly concluded Trump “certainly falls into the general definition of fascist, for sure.”\n\nKelly added that Trump often fumed at any attempt to constrain his power, and that “he would love to be” a dictator.\n\n“He certainly prefers the dictator approach to government,” Kelly told the Times, adding later, “I think he’d love to be just like he was in business — he could tell people to do things and they would do it, and not really bother too much about whether what the legalities were and whatnot.”\n\nKelly is not the first former top Trump administration official to cast the former president as a threat.\n\nRetired Army Gen. Mark A. Milley, who served as Trump’s chairman of the Joint Chiefs of Staff, told Bob Woodward in his recent book “War” that Trump was “fascist to the core” and “the most dangerous person to this country.” And retired Gen. Jim Mattis, who worked as secretary of defense under Trump, reportedly later told Woodward that he agreed with Milley’s assessment.\n\nThroughout Trump’s political rise, the businessman-turned-politician benefited from the support of military veterans.\n\nAP VoteCast found that about 6 in 10 military veterans said they voted for Trump in 2020, as did just over half of those with a veteran in the household. Among voters in this year’s South Carolina Republican primary, AP VoteCast found that close to two-thirds of military veterans and people in veteran households voted for Trump over former South Carolina Gov. Nikki Haley, Trump’s toughest opponent in the 2024 Republican primary.\n\nAssociated Press writers Linley Sanders in Washington, Ken Ritter in Las Vegas and Adriana Gomez Licon in Miami contributed to this report.","summary":"Kamala Harris said Wednesday that comments praising Adolf Hitler reportedly made by Donald Trump to his longest-serving chief of staff offer a window into who the former president &#8220;really is&#8221; and the kind of commander in chief he would be. In interviews with The New York Times and The [&#8230;]","url":"https://www.ocregister.com/2024/10/23/harris-decries-trump-after-john-kelly-says-he-wanted-generals-like-hitlers/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/AP24297615218380.jpg?w=1024","video":null,"publish_date":"2024-10-23 23:39:53","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.015},{"id":260859960,"title":"Davante Adams refuses to stay silent after seeing glaring Jets issues: ‘Don’t have time’","text":"It took Davante Adams six days of being a Jet to see problems with the team’s culture and feel the need to speak up about it.\n\nAdams gave a speech to the Jets in the locker room following Sunday night’s 37-15 loss to the Steelers in Pittsburgh. \n\nDespite only joining the team less than a week before the game, Adams felt the need to speak up about what he perceived as a lack of energy from the team.\n\n“Obviously, there was a lack of energy and urgency out there. It was apparent,” Adams said Wednesday. “I’ve played on teams that have that winning culture. Basically, I took a moment to let them know. I had reservations about speaking up too early and being too vocal too early, but in my mind I said, ‘F that’ because we don’t have time. I’ve got to do whatever I’ve got to do to help this team move forward.\n\n“I wouldn’t have been able to sleep if I didn’t speak up on it.”\n\nJets quarterback Aaron Rodgers said the speech from Adams was well received by the team.\n\n“I thought it was the realest speech I’ve ever heard in a locker room in 20 years,” Rodgers said.\n\nIt would be interesting to know what Jets players who have been on the team for a while thought about a player who just arrived telling them about the team’s culture. \n\nBut Adams said he was surprised at what he saw in the game against the Steelers. \n\nHe cited how the sideline looked dead after Breece Hall’s 57-yard reception.\n\n“A lot of these guys in here haven’t been anywhere else where they’ve won and have had that urgency that it takes in order to be a good team,” Adams said. “This team being so talented roster-wise, it’s just a waste to have everybody out there and to have a dead sideline like that.”\n\nAdams only had three catches for 30 yards in the loss, a disappointing start to his Jets career. \n\nBut Adams said he does not see his role as only producing on the field for the Jets but also changing the organization.\n\n“I’m not here to be the savior,” Adams said. “The whole world … [Donald] Trump was at the game. I’m not sure if that was because of me or not. Everybody is sitting here expecting it to be me go out there and put up 200 yards and three [touchdowns]. That’s a storybook ending. Obviously, that would have been amazing if that happened. I’m here to help shift this culture more than anything.”\n\nAdams said he received positive feedback from everyone in the locker room, including the “owner,” presumably that was Woody Johnson, although Christopher Johnson was also in the room.\n\nThe fact that Adams had to be the one to speak up could point to a leadership void on the team prior to his arrival.\n\n“I could see it in everybody’s eyes that it was something that they had never heard or been exposed to,” Adams said. “That’s part of the problem.”\n\nAdams has played for the Packers and the Raiders, two franchises with proud histories. \n\nBut the Raiders have not had much success in recent years either. \n\nStill, Adams said the Raiders players supported each other even at the end of losses, something he did not see from the Jets.\n\nA reporter asked Adams who is to blame for the Jets culture.\n\n“It’s on everybody,” Adams said. “Anytime an organization is on a losing streak or a losing organization for the ones that are … I’m not going to call any organization that I’m a part of a losing organization but obviously there’s been some of that in the past in recent years around here and it’s a little bit of everything, obviously personnel.\n\n“But I’d say with this team it’s more just learning how to win and what it takes, the small things that necessarily don’t have to come from the owner or the general manager. This is something you can solve within the team if you have the right people in here, guys that know how to win. It’s not just about having good players because we have that. You’ve got to have guys that understand and have won sometimes and that’s a big reason why I’m here.”","summary":"Davante Adams couldn't stay silent after seeing glaring Jets culture issues: 'Don’t have time'","url":"https://nypost.com/2024/10/23/sports/davante-adams-gives-speak-after-seeing-jets-culture-issues/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-srmqjll1k-1729725862573.jpg?quality=75&strip=all&1729711560&w=1200","video":null,"publish_date":"2024-10-23 23:36:27","author":"Brian Costello","authors":["Brian Costello"],"language":"en","category":"politics","source_country":"us","sentiment":-0.265},{"id":260860036,"title":"Elon Musk said he'd push to regulate autonomous driving on the federal level 'if there's a department of government efficiency'","text":"Elon Musk said Wednesday that he thinks autonomous vehicles should be approved at the federal level, rather than state by state, and that if he ends up with a role in the White House, he'd make it happen.The Tesla CEO made the comment on the company's earnings call Wednesday. Tesla's third-quarter earnings beat expectations, and its stock was up 12% in after-hours trading following the earnings release.Musk said during the call that he expects Tesla to have unsupervised fully autonomous vehicles on the road in Texas and California next year, pending state approval. He said he would be \"shocked\" if the company did not get approval, but that he thinks in general it would be better if autonomous vehicles were approved on the federal level.\"There should be a federal approval process for autonomous vehicles,\" Musk said on the call, adding, \"If there's a department of government efficiency, I'll try to help make that happen. For everyone, not just Tesla.\"Musk did not mention Trump by name, but he previously said he would be enthusiastic to take on a White House role centered on enforcing government efficiency should Donald Trump take office.\"I can't wait,\" Musk said on X, in response to a Washington Post report about Trump floating the idea of a cabinet role for the billionaire. \"There is a lot of waste and needless regulation in government that needs to go.\"The US regulates autonomous vehicles on a state and federal level, according to the National Conference of State Legislatures. At least 29 states have enacted laws related to autonomous vehicles, the association said.Since his endorsement of Trump in July, Musk has been aiding the Trump campaign's ground game, flying to swing states, hosting town halls, and setting up sweepstakes that encourages people to vote, which some legal experts say could breach election law.At a Pennsylvania town hall on October 18, Musk proposed firing an unspecified number of federal workers while providing them a two-year severance.Musk did not respond to a request for comment.","summary":"Musk previously said he would be enthusiastic to take on a White House role centered on enforcing government efficiency should Donald Trump win.","url":"https://www.businessinsider.com/elon-musk-tesla-autonomous-vehicle-federal-regulation-trump-white-house-2024-10","image":"https://i.insider.com/67198248a0a0cc14f2237c88?width=1200&format=jpeg","video":null,"publish_date":"2024-10-23 23:35:21","author":"Kelsey Vlamis,Lloyd Lee","authors":["Kelsey Vlamis","Lloyd Lee"],"language":"en","category":"politics","source_country":"US","sentiment":-0.305},{"id":260860340,"title":"Dave Bautista Blasts Donald Trump's 'Tough Guy' Act, Says Ex-Prez is Actually A 'Whiny Little B-tch'","text":"Dave Bautista, of Guardians of the Galaxy fame, recently took political jabs at former president Donald Trump. During his more than two-minute monologue, Bautista called out the ex-president in a spoof advertisement for Jimmy Kimmel Live! Kimmel did a fantastic job of introducing Bautista before his segment. \"Young, straight white men love Donald Trump,\" Kimmel said. \"They see him as a macho, macho man if you will. He eats red meat, he pretends to follow UFC, he's into crypto and sneakers and NFTs. He's a dude, a bro, and a boss all rolled into one.\" The veteran comedian added, \"But is he truly the 'strong alpha man these men believe him to be?' Not according to \"one of the toughest guys I know.\" \n\n \"Fellas, we gotta talk,\" the retired professional wrestler said as he came straight to the point vis-a-vis the Republican leader. \"A lot of men seem to think that Donald Trump is some kind of tough guy. He's not. I mean, look at him, he wears more makeup than Dolly Parton. He whines like a baby. The guy is afraid of birds.\" \n\nAccording to EW, Bautista continued to slam Trump in the short clip by calling him a 'garbage bag full of buttermilk.' He chastised the Republican leader for presenting a phony medical certificate to avoid military service. The Avengers star also added that Trump 'cheats in golf,' is 'creepy and moody,' and 'throws a tantrum like a five-year-old.' \"This November, let's stop kidding ourselves,\" Bautista continued while urging the audience to not vote for the GOP nominee. He concluded by referring to Trump as a 'weak, tubby toddler' as well as a 'whiny little b-tch.'\n\nBautista had previously openly endorsed Vice President Kamala Harris and her running mate Tim Walz by flaunting their campaign t-shirt. \"Made my freedom heard,\" he captioned the Instagram post, and also urged voters, \"Your voice matters, and this election’s too important to sit out.\" \n\nAs per Deadline, Bautista shared another video on X and mocked Trump's notions that his election and legal defeats were 'rigged.' Pointing out that in September 2018, Trump inflated his accomplishments in front of international leaders, the former WWE champ said, “The dude got laughed out of the United Nations.” Bautista also chuckled at the Republican leader's online assault on Taylor Swift, who immediately after the presidential debate on ABC, endorsed Harris. “What’s more American than Taylor Swift?” the Spy actor questioned. \n\nBautista's tirade included many relevant pictures and videos from Trump's campaign and presidency. However, Trump campaign spokeswoman Steven Cheung retaliated, denouncing the WWE professional in a comment to Fox News Digital. \"President Trump is a WWE Hall of Famer. Dave Bautista is not, because he is a stone-cold loser who was unprofessional and took his ball home when he refused to put over younger talent. He then returned to the company that made him, and he found out quickly that he couldn't wrestle and has no mic skills whatsoever,\" Cheung said.","summary":"Bautista urged the audience to not vote for the GOP nominee during his more than two-minute monologue.","url":"https://www.inquisitr.com/dave-bautista-blasts-donald-trumps-tough-guy-act-says-ex-prez-is-actually-a-whiny-little-b-tch","image":"https://dab57h0r8ahff.cloudfront.net/721010/uploads/03059410-8f69-11ef-a264-5d46c112b4ab_1200_630.jpeg","video":null,"publish_date":"2024-10-23 23:30:08","author":"INQUISITR,Mary Anthony","authors":["INQUISITR","Mary Anthony"],"language":"en","category":"politics","source_country":"US","sentiment":-0.047},{"id":260860342,"title":"The Exact Moment Trump Faced His 'Biggest Fear' — As Per 'Daily Show' Correspondent Desi Lydic","text":"Desi Lydic spotlighted a key moment when former President Donald Trump couldn't dodge his fear during her recent episode of the Daily Show. While talking about the Univision town hall event earlier last week, Trump 'faced down his biggest fear: Hispanic people,' according to the Daily Show correspondent. As reported by HuffPost, Lydic called out the ex-POTUS for dubbing the Capitol riots a 'day of love' to defend his die-hard supporters. \n\nFor some context, Trump is known for charging with his infamously bizarre statements against Hispanics in the southern states of America. A former Republican voter, Ramiro Gonzalez, also confronted him about the January 6, 2021, attack during the event. \"I am a Republican. I want to give you the opportunity to try and win back my vote. Your action, and maybe inaction, during your presidency and the last few years sort of … was a little disturbing to me. What happened on January 6 and the fact that you waited so long to take action while your supporters were attacking the Capitol,\" he told Trump. \n\nAccording to HuffPost's previous report, Trump responded, \"You had hundreds of thousands of people come to Washington. They didn’t come because of me, they came because of the election. Some of those people went down to the Capitol — I said, ‘peacefully and patriotically.’ Nothing done wrong. At all. Nothing done wrong.\" Commenting on this, Lydic said that Trump's facial expression to the question was a stark reminder of \"the look that your dad gives you when you’ve obviously been lying to him.\"\n\nCircling back to Lydic's take, the television personality and political commentator then quipped that Jan. 6 was the day when the Republican nominee's supporters met their 'soulmates.' But she quickly corrected herself, \"Wait, I read that wrong. Cellmates. They got cellmates,\" in a hard-hitting jibe on Trump's campaign and his justification of the riot. Adding on, Lydic shared why she believed that Trump faced his ultimate fear during the event. She said, \"The whole audience was one big reaction GIF.\" \n\nDuring the event, another supporter asked the real estate mogul about his stance on the Haitian immigrants eating the pets of the residents. Trump responded, \"This was just reported. I was just saying what was reported. And [they are] eating other things, too, that they’re not supposed to be.\" He also shared his views on the indictments he faced last year, which also included the widely covered hush-money trial. The prosecutors had charged him with trying to influence the electoral results of the 2020 elections. Furthermore, Trump became the first president of the United States to ever get convicted in a criminal case. Despite this, he criticized the Democrats and said that they 'couldn't get' to him as he’d done nothing wrong.","summary":"The crowd at the Univision town hall event left the former President Donald Trump with a crowd full of Hispanics.","url":"https://www.inquisitr.com/the-exact-moment-trump-faced-his-biggest-fear-as-per-daily-show-correspondent-desi-lydic","image":"https://dab57h0r8ahff.cloudfront.net/721005/uploads/90fc8af0-9147-11ef-be58-b98373fd00ed_1200_630.jpeg","video":null,"publish_date":"2024-10-23 23:30:00","author":"INQUISITR,Tavishi","authors":["INQUISITR","Tavishi"],"language":"en","source_country":"US","sentiment":-0.074},{"id":260859696,"title":"NY Times avoids mentioning its source corroborating Harris' McDonalds claim is a campaign surrogate","text":"The New York Times was called out for discounting its source's ties to Vice President Kamala Harris while reporting on the controversy over whether she had worked at McDonald's. Harris' claim that she worked at the iconic fast food chain for a summer while she was in college has faced tense scrutiny in recent weeks, especially since no records proving her employment have surfaced and none of her co-workers have been found. On Sunday, after former President Trump spent his day working at a McDonald's in Pennsylvania to troll the vice president, The Times published a report writing \"Donald Trump has claimed without evidence that Ms. Harris never worked at the fast-food chain. Her campaign and a friend say she did.\" AOC, MEDIA WANTS AMERICANS TO KNOW TRUMP DOESN'T REALLY WORK AT MCDONALDS That friend was Wanda Kagan, who The Times described as someone \"who had known Ms. Harris as a teenager and remained in touch with the family for years afterward.\" \"Answering questions by email, Ms. Kagan said that Ms. Harris’s mother, who died in 2009, had told Ms. Kagan about the summer job years ago. Ms. Kagan said she herself had also worked at one of the fast-food chain’s many franchises in those years,\" The Times reported. \"'That’s what us regular folks did,' Ms. Kagan wrote. Still, she indicated that it had not been a frequent topic of conversation for Ms. Harris. ‘We didn’t talk much about our McDonald’s days back then,’ she said.\" TRUMP MAKES FRIES AT PENNSYLVANIA MCDONALD'S: 'I'VE NOW WORKED FOR 15 MINUTES MORE THAN KAMALA' However, The Washington Free Beacon took a swipe at The Times for not acknowledging that Kagan is a surrogate for the Harris campaign. As the Free Beacon noted, Kagan sang her friend's praises during an MSNBC appearance at the DNC convention in Chicago. She also co-hosted the \"Survivors for Kamala Harris\" online campaign event and recently visited the White House to celebrate Harris' birthday. A spokesperson for The Times told Fox News Digital \"This was a thoroughly reported and edited piece of independent journalism. The Times stands behind it completely.\" Harris has repeatedly touted her work at McDonald's and how she \"did fries\" as part of her sales pitch to voters about a middle class upbringing. WALZ TAUNTS TRUMP OVER MCDONALD'S APPEARANCE, SAY HARRIS ‘ACTUALLY WORKED’ AT ONE Reporting from The Free Beacon has cast doubt in Harris' claim, which she first made in 2019, and drew attention to the \"shifting narratives\" from her campaign and a pro-Harris super PAC about her alleged gig. \"First, they claimed she held the job to pay her way through college at Howard University by working at McDonald’s. Then, they said Harris worked there in the summer of 1983, after her freshman year of college, for extra spending money,\" the Free Beacon wrote, noting that The Times report did not acknowledge the change. CLICK HERE TO GET THE FOX NEWS APP Trump has repeatedly accused Harris of lying about her working at McDonald's and took a swipe at his Democratic rival while working the drive-thru. \"I've now worked for 15 minutes more than Kamala,\" Trump told reporters standing outside the drive-thru window. Several news outlets, including The Times, dinged Trump for accusing Harris of lying \"without evidence\" despite the fact that Harris has yet to provide evidence she actually worked at McDonald's.","summary":"The New York Times was called out for not disclosing that a source in its report about verifying Vice President Kamala Harris&apos; claim she worked at McDonald&apos;s is a campaign surrogate.","url":"https://www.foxnews.com/media/ny-times-avoids-mentioning-its-source-corroborating-harris-mcdonalds-claim-campaign-surrogate","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/NYTHarris.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-23 23:27:23","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":-0.265}]}