{"offset":0,"number":50,"available":11494,"news":[{"id":364666524,"title":"Why the Albanese government has heaped praise on Donald Trump: 'Come on board with this plan'","text":"A US-brokered peace plan headed by Donald Trump offers promise for a ceasefire in Gaza and the return of Israeli hostages, the Australian government says.\n\nActing Prime Minister Richard Marles said Australia's concerns are addressed by the 20-point peace plan offered by the White House, which includes an immediate ceasefire, the release of hostages and prisoners on both sides and an end to Israel's military campaign in Gaza.\n\n'I do think the plan represents hope,' he told ABC Radio on Tuesday.\n\n'We have been calling for a long time for a ceasefire, for the return of hostages, for a flow of humanitarian assistance into Gaza because of the humanitarian catastrophe which is unfolding there.\n\n'This plan certainly embraces all of that. In that sense, we would very much hope that all parties ultimately do come on board with this plan, because I think the world wants to see an end to these hostilities.'\n\nMr Marles said the healing and repair process needed to begin.\n\n'We obviously have been extremely critical of Hamas and their conduct throughout, we have been critical of Israel, but at the end day what we need to see here is an end to the hostilities and this human tragedy being brought to an end,' he said.\n\nThe peace plan also includes conditions previously rejected by both sides, and is dependent on Hamas' agreement - a point that concerns Liberal senator Dave Sharma, who is a former Australian ambassador to Israel.\n\nHe says getting Hamas to agree to a peace deal is plausible, but will be a challenge.\n\n'Hamas is being asked to sign its own extinction warrant here,' Senator Sharma told Nine's Today show on Tuesday.\n\n'But the leaders are being offered amnesty and a safe passage out of it - exile if you like.\n\n'They've lost a lot of their senior military leadership, so it might be an attractive offer to some of them to take.'\n\nSenator Sharma also said there could be other sticking points for Hamas, which Australia has listed as a terrorist organisation.\n\nHamas has previously demanded Israel withdraw entirely from Gaza before it released hostages.\n\nIf enacted, the US-led peace plan would establish a temporary Palestinian governing body supervised by a 'board of peace' headed by President Donald Trump.\n\n'This is a big, big day, a beautiful day,' Trump told reporters in Washington alongside Israeli Prime Minister Benjamin Netanyahu.\n\nNetanyahu said the US plan achieved his country's war aims.\n\n'I support your plan to end the war in Gaza,' he told Trump, describing him as the 'greatest friend that Israel' has ever had in the White House.\n\nIf Hamas doesn't agree, Trump said Israel would have his full backing 'to finish the job of destroying the threat of Hamas'.\n\nThe plan also includes measures to encourage Palestinians to stay in the area and a surge in aid deliveries to Gaza.\n\nThe plan's announcement comes days after Australia joined a clutch of nations to recognise a Palestinian state, amid growing international pressure on Israel to end what a UN inquiry commission has ruled as genocide in Gaza.\n\nAlmost 160 members of the 193-strong UN recognise Palestinian statehood, but Trump was vocal against the recognition.\n\nMore than 65,000 people have been killed in Israel's nearly two-year assault on Gaza, according to the local health ministry, after Hamas attacked Israel and killed 1200 people and took a further 250 hostage, according to Israeli tallies.\n\nA majority of the dead in Gaza are civilians, including an estimated 18,000 children.\n\nIsrael rejects any accusations of genocide and denies starvation in the strip as deaths attributed to malnutrition and hunger-related deaths number in the hundreds, according to the Gaza health ministry and the UN.","summary":"The Albanese government has some words of praise for Donald Trump.","url":"https://www.dailymail.co.uk/news/article-15146843/Why-Albanese-government-heaped-praise-Donald-Trump-Come-board-plan.html","image":"https://i.dailymail.co.uk/1s/2025/09/30/01/102430913-0-image-a-14_1759192964438.jpg","video":null,"publish_date":"2025-09-30 00:54:42","author":"Dominic Giannini,Editor","authors":["Dominic Giannini","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":0.087},{"id":364666508,"title":"Trump announces 100 per cent tariffs on foreign-made films in fresh blow for British industry","text":"Donald Trump has vowed to hit foreign-made films with a massive 100 per cent tariff – in a move that could devastate Britain's booming movie sector.\n\nThe former president announced the crackdown on Monday, claiming Hollywood had been 'stolen' by rival nations.\n\n'Our moviemaking business has been stolen from the United States of America by other countries, just like stealing 'candy from a baby',' he raged on Truth Social.\n\nTrump has long promised to restore Hollywood to its 'golden age', blaming generous tax breaks offered abroad for luring big productions away from Los Angeles.\n\nThe impact on Britain could be severe with some figures from the British Film Institute showing overseas investment made up 87 per cent of UK film spending last year – a 78 per cent jump on the year before.\n\nTrump first floated the idea in May, calling foreign incentives 'a concerted effort by other nations and, therefore, a national security threat'.\n\nOn Monday he doubled down – taking aim at California's Democratic governor, Gavin Newsom, who he branded 'weak and incompetent'.\n\n'Therefore, in order to solve this longtime, never-ending problem, I will be imposing a 100 per cent tariff on any and all movies that are made outside of the United States,' he wrote.\n\nWhether the UK will be caught in the crossfire remains unclear, but when the UK-US trade deal was signed in May, Trump told The Times that James Bond had 'nothing to worry about'.\n\n'We're going to have a discussion on that separately,' he added. 'As you know we're putting tariffs on that particular film set, the moviemakers, and we're going to be doing some tariffs to get that because a lot of them have left this country.\n\n'They all live here, the money comes from here, everything comes from here, but they make them in other countries so we're going to do something to bring them back, but James Bond has nothing to worry about.'\n\nDowning Street is said to be waiting for clarification on how the tariffs would work – and whether they would even apply to the UK.\n\nA government spokesperson insisted: 'Our film industry employs millions of people, generates billions for our economy and showcases British culture globally. \n\n'We are absolutely committed to ensuring it continues to thrive and create good jobs right across the country through our modern industrial strategy.'\n\nIndustry figures also poured scorn on Trump's plan, pointing out that films are not traded like normal goods and questioning how tariffs would even be calculated – whether by box office or production costs.\n\nPhilippa Childs, head of Bectu, the union for creative workers, warned the threat 'completely misunderstands' how the industry works.\n\n'Tariffs would be completely unworkable as most productions rely on global connectivity,' she said. \n\n'Moreover, the imposition of tariffs would be a hammer blow the global sector can ill afford, as it would jeopardise the UK's highly skilled workforce. The government must be alive to this risk and work actively to protect the UK's world leading film sector.","summary":"The former president announced the crackdown on Monday, claiming Hollywood had been 'stolen' by rival nations.","url":"https://www.dailymail.co.uk/news/article-15146791/Trump-announces-tariffs-foreign-films-British-industry.html","image":"https://i.dailymail.co.uk/1s/2025/09/30/01/102558309-0-image-m-23_1759192568342.jpg","video":null,"publish_date":"2025-09-30 00:53:34","author":"Editor,Lettice Bromovsky","authors":["Editor","Lettice Bromovsky"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.04},{"id":364666246,"title":"'Save your tears': White House's response to Ariana Grande’s anti-Trump voter message; credits Trump for ending Biden’s inflation crisis","text":"The White House went full pop-culture clapback mode, issued a fiery response to singer Ariana Grande after she reposted an anti-President Donald Trump message that targeted over 77 million voters who supported him. Grande, 32, reshared “A Bit Fruity” podcast host Matt Bernstein’s Instagram post on Sunday, which criticised voters who cast their ballots for Trump instead of former Vice President Kamala Harris in the 2024 presidential election. “Save your tears, Ariana. Because President Trump’s actions ended Joe Biden’s inflation crisis and are bringing in trillions in new investments,” White House spokesperson Kush Desai said in a statement, quoting the title of the ‘Wicked’ star’s remix with The Weeknd, according to the New York Post. Desai continued, “He even signed an executive order just like magic that paved the way for the FTC to crack down on Ticketmaster for ripping off Ariana Grande’s concert-going fans. Get well soon, Ariana!”Grande's repost questioned the impact of Trump's presidency on various aspects of life. The original post read: “I want to check in with Trump voters. I have one very genuine question: it’s been 250 days. Now that immigrants have been violently torn from their families and communities have been destroyed, now that trans people have been blamed for virtually everything and live in fear, now that free speech is on the brink of collapse for us all — has your life gotten better?” “Have your groceries gotten cheaper? Has your health insurance premium gone down? Has your work/life balance improved? Can you take a vacation yet? Are you happier? Has the widespread suffering of others paid off for you in the way he promised it would, or are you still waiting?” Grande publicly supported Harris, 60, over Trump in the election last year.","summary":"The White House issued a fiery clapback to singer Ariana Grande after she reposted an anti-Trump message criticizing his 2024 voters. White House spokesperson Kush Desai used Grande's song titles to claim President Trump ended inflation and addressed Ticketmaster issues. Grande's original repost questioned if Trump supporters' lives improved amidst societal challenges.","url":"https://timesofindia.indiatimes.com/world/us/save-your-tears-white-houses-response-to-ariana-grandes-anti-trump-voter-message-credits-trump-for-ending-bidens-inflation-crisis/articleshow/124223143.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-124223224/124223224.jpg","video":null,"publish_date":"2025-09-30 00:50:23","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.469},{"id":364665584,"title":"Trump has doubled down on his non-US movie tariff threat. That’s a bad thing for cinema","text":"As I wrote in May, Hollywood’s biggest unions played a key role in President Donald Trump’s shock announcement of a 100 per cent tariff on all foreign-made movies.\n\nIn a March 11 letter, the heads of the major directors’ guild and crew union in Hollywood, which together represent almost 200,000 filmmakers, urged the administration to act against “a myriad of unfair trade practices” in foreign jurisdictions that they claim had been “impacting the United States’ film industry for decades”.\n\nIt is true that Hollywood studios have moved much of their production offshore, attracted by tax incentives that make filming cheaper than it would be in California.\n\nAustralia offers a 30 per cent incentive to foreign productions shooting here through the federal government’s location incentive, with state governments typically offering between 10 and 15 per cent on top of that. Post-production and digital effects work is supported by a 30 per cent federal rebate, with some states also offering an additional 10 per cent.\n\nOther countries offer incentives, though Australia’s are among the most generous. Numerous US states offer them as well.","summary":"In May, Donald Trump announced his intention to impose a 100 per cent tariff on movies made outside the US. After months of silence he’s suddenly restated a plan that Hollywood fears.","url":"https://www.theage.com.au/culture/movies/trump-has-doubled-down-on-his-non-us-movie-tariff-threat-that-s-a-bad-thing-for-cinema-20250930-p5mywe.html","image":"https://static.ffx.io/images/$zoom_0.9806%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_70/t_crop_custom/q_86%2Cf_auto/49f99945db9aa3d54c8e1f85a5ffcb20f522b597374360eb339ab12e4db6990f","video":null,"publish_date":"2025-09-30 00:50:14","author":"Karl Quinn","authors":["Karl Quinn"],"language":"en","source_country":"au","sentiment":-0.07},{"id":364666008,"title":"YouTube agrees to pay $24.5M to settle Trump lawsuit filed after his January 6 insurrection suspension","text":"YouTube has agreed to pay $24.5 million to settle a lawsuit from President Donald Trump, over his suspension from the platform after the January 6 riot, becoming the final Big Tech company to bend the knee.\n\nIn court papers filed Monday, the Google-owned online video giant said it would give $22 million to Trump's White House ballroom fund and $2.5m to his other co-plaintiffs in exchange for dropping all claims.\n\nThat made Google the latest in a long line of corporations controversially settling lawsuits with the president instead of trying to fight, with payouts so far reportedly totaling more than $80m.\n\nMeta, the parent company of Facebook and Instagram, and X, the social network formerly known as Twitter, had already settled similar lawsuits earlier this year, even though both companies and YouTube had already restored Trump's accounts years earlier.\n\nCBS News owner Paramount also agreed to pay Trump $16m to settle a libel lawsuit in July, leading Democrats to accuse the company of \"bribery in plain sight\", while ABC News settled a similar case in December.\n\n\"If he had not been re-elected, we would have been in court for 1,000 years. It was his re-election that made the difference,\" John P. Coale, one of the lawyers handling the suit against YouTube, told The Wall Street Journal.\n\nYouTube was among numerous tech platforms to ban Donald Trump in the aftermath of January 6, when far-right militia groups and crowds of rioters attempted to overthrow his election defeat by storming the U.S. Capitol. \n\nTrump soon filed lawsuits against YouTube, Meta, and (then) Twitter, alleging their suspensions had violated his free speech rights. Other de-platformed people and groups climbed on board, including the American Conservative Union and feminist writer turned anti-vaxxer Naomi Wolf.\n\nThe first judge rejected Trump's claims and appeals judges also seemed skeptical. Many legal experts thought the cases were doomed, arguing that tech companies also had First Amendment rights and were entitled to regulate their own platforms as they saw fit.\n\nBut in January, with Meta boss Mark Zuckerberg striving to get back into Trump's good books — and tech bosses in general cozying up to the new administration — the social media giant agreed to settle its lawsuit for roughly $25m. \n\nInside sources told The Wall Street Journal that Trump had made this a condition of Zuckerberg being \"brought into the tent\".\n\nIn February, Twitter's new owner Elon Musk — a vehement Trump supporter who donated more than $290m to Republicans last year — followed suit, paying out $10m. \n\nFinally, in early May, Google's CEO Sundar Pichai and its co-founder Sergey Brin reportedly traveled to Trump's Mar-a-Lago resort in Florida to play golf and hash out a deal, later telling the court they had been \"engaged in productive discussions\".","summary":"The deal makes YouTube the final Big Tech company to bend the knee — following Elon Musk’s X and Facebook’s parent company Meta","url":"https://www.independent.co.uk/news/world/americas/us-politics/youtube-trump-january-6-lawsuit-settlement-b2836181.html","image":"https://static.independent.co.uk/2025/09/29/23/28/GettyImages-1230679602.jpg?crop=4117.5,2745,x22.8,y0&trim=0,23,0,22&width=1200","video":"https://cdn.jwplayer.com/videos/LjUQVK9c-4VHSaSK0.mp4","publish_date":"2025-09-30 00:49:34","author":"Io Dodds","authors":["Io Dodds"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.074},{"id":364666242,"title":"Vance predicts shutdown as White House talks fail; slams Democrats","text":"The prospect of a federal government shutdown grew stronger on Monday after US President Donald Trump’s White House talks with top congressional leaders ended without a deal. Funding is set to expire at 12:01 am (local time) on Wednesday if no agreement is reached.As per CNBC, Vice President JD Vance predicted the worst outcome, telling reporters, “I think we’re headed to a shutdown because the Democrats won’t do the right thing”. Standing alongside House speaker Mike Johnson and Senate majority leader John Thune, Vance accused Democrats of blocking a “clean” continuing resolution to extend funding until late November.Democrats pushed back, insisting they will not accept a stopgap bill that ignores healthcare protections. Senate minority leader Chuck Schumer said the parties have “very large differences” but added that Trump “for the first time … heard our objections and heard why we need a bipartisan bill”, as per NBC News. House minority leader Hakeem Jeffries argued Republicans are trying to “gut the health care of everyday Americans.”The stalemate centres on whether temporary funding legislation should also extend enhanced Affordable Care Act tax credits, set to expire at year’s end. Democrats argue that without action, millions could face higher premiums when open enrolment begins on 1 November. Jeffries said, “We believe that simply accepting the Republican plan to continue to assault and gut healthcare is unacceptable”, according to news agency Reuters. Republicans counter that Democrats are holding the government “hostage.” Thune said, “What the Democrats have done here is take the federal government as a hostage — and by extension, the American people — to try and get a whole laundry list of things”, as quoted by NBC News.If no resolution is passed, federal agencies will begin furloughing staff, disrupting services from Nasa to national parks. Military personnel would also go unpaid during the closure, though all workers would be compensated once it ends, according to plans already shared by some agencies.Budget standoffs have become a recurring feature in Washington, but Trump’s threat to use the shutdown to permanently slash parts of the federal workforce has added new uncertainty. Only a few agencies have detailed their contingency plans, and Democrats say Trump’s willingness to override spending laws makes this fight riskier than previous standoffs.With the Senate scheduled to vote again on the GOP’s short-term measure on Tuesday — a bill that has already failed once — the chances of a last-minute breakthrough remain slim. Schumer said after Monday’s meeting that the gulf between the two sides remains wide, “There’s still large differences between us.”","summary":"A federal government shutdown looms after White House talks failed, with funding set to expire Wednesday. Democrats demand extending Affordable Care Act tax credits, while Republicans accuse them of holding the government hostage by blocking a \"clean\" resolution. This stalemate over healthcare protections makes a last-minute breakthrough unlikely, threatening widespread service disruptions.","url":"https://timesofindia.indiatimes.com/world/us/stalemate-deepens-jd-vance-predicts-shutdown-as-white-house-talks-fail-slams-democrats/articleshow/124223159.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-124223167/124223167.jpg","video":null,"publish_date":"2025-09-30 00:37:02","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.408},{"id":364662200,"title":"World News | Two New Cases of Polio Takes Nationwide Tally to 29 in Pakistan","text":"Badin [Pakistan], September 30 (ANI): Two new cases of poliovirus have been confirmed in the Badin and Thatta districts of Pakistan's Sindh province, according to a report by DAWN on Monday. According to the National Institutes of Health (NIH), the nationwide tally of poliovirus cases in Pakistan has risen to 29. The development has come days after poliovirus case was confirmed in Sindh's Hyderabad.\nAlso Read | Donald Trump Hosts Phone Call Between Israel and Qatar; PM Benjamin Netanyahu Expresses 'Deep Regret' for Missile Strike.\n\"With these two cases, both girls, the total number of polio cases in Pakistan in 2025 has reached 29, including 18 from Khyber Pakhtunkhwa, nine from Sindh, and one each from Punjab and Gilgit-Baltistan,\" NIH said in a statement, as per the Dawn.\nIn its statement, the NIH mentioned that a sub-national polio vaccination campaign was conducted across 88 districts of Pakistan. Meanwhile, the next polio vaccination campaign is scheduled to take place between October 13 and 19. Also Read | PoJK Protest: 3 Killed, Over Dozen Injured As Police Open Fire on Protesters in Pakistan-Occupied Jammu and Kashmir (Watch Videos).\n\"The campaign successfully reached nearly 21 million children under the age of five. During the campaign, Vitamin A will also be administered alongside the oral polio vaccine (OPV) to boost children's immunity levels. More than 400,000 dedicated frontline workers will go door-to-door to ensure that every eligible child receives this essential protection,\" the statement from NIH said.\nThe National Institutes of Health mentioned that the campaigns were aimed towards rapidly boosting children's immunity to strengthen their protection as part of ongoing efforts to eradicate polio from Pakistan.\n\"Rapidly boosting children's immunity and strengthening protection as part of Pakistan's ongoing efforts to eradicate polio. Polio eradication is a shared responsibility. While dedicated frontline polio workers deliver vaccines, parents and caregivers must ensure their children receive all recommended doses, including routine immunisations,\" the statement said.\nIn 2024, the country reported at least 71 polio cases, with the virus detected in around 90 districts, as per Dawn.\nPolio is a highly infectious and incurable disease that can cause lifelong paralysis. The only effective protection is through repeated doses of the oral polio vaccine for every child under five during each campaign, along with the timely completion of all essential immunisations, Dawn reported. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to the National Institutes of Health (NIH), the nationwide tally of poliovirus cases in Pakistan has risen to 29. The development has come days after poliovirus case was confirmed in Sindh's Hyderabad.","url":"https://www.latestly.com/agency-news/world-news-two-new-cases-of-polio-takes-nationwide-tally-to-29-in-pakistan-7136419.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250929212232.jpg","video":null,"publish_date":"2025-09-30 00:28:20","author":null,"language":"en","source_country":"in","sentiment":0.07},{"id":364662210,"title":"World News | Netanyahu Expresses Deep Regret over Doha Attack in Three-way Call Hosted by Trump with Al Thani","text":"Washington, DC [US], September 30 (ANI): Israeli Prime Minister Benjamin Netanyahu on Monday (local time) expressed regret for a missile strike against Hamas targets in Qatar, in a three-way call with US President Donald Trump, the White House said.\nUS President Donald Trump on Monday local time held a trilateral phone call with Israeli Prime Minister Benjamin Netanyahu and Qatari Prime Minister Mohammed bin Abdulrahman bin Jassim Al Thani, White House said in a release. Also Read | Donald Trump Hosts Phone Call Between Israel and Qatar; PM Benjamin Netanyahu Expresses 'Deep Regret' for Missile Strike.\nPrime Minister Netanyahu expressed his \"deep regret\" that Israel's missile strike against Hamas targets in Qatar \"unintentionally killed\" a Qatari serviceman, the release said.\nThe President expressed his desire to put Israeli-Qatar relations on a \"positive track after years of mutual grievances and miscommunications.\nAlso Read | PoJK Protest: 3 Killed, Over Dozen Injured As Police Open Fire on Protesters in Pakistan-Occupied Jammu and Kashmir (Watch Videos).\n\"The leaders accepted the president's proposal to establish a trilateral mechanism to enhance coordination, improve communication, resolve mutual grievances, and strengthen collective efforts to prevent threats\". They underscored their shared commitment to \"working together constructively\" and \"clearing away misperceptions\", while building on the longstanding ties both have with the United States, the press release read. He further expressed regret that, in targeting Hamas leadership during hostage negotiations, \"Israel violated Qatari sovereignty\" and affirmed that \"Israel will not conduct such an attack again in the future\"\nPrime Minister Al Thani welcomed these assurances, emphasising Qatar's readiness to continue contributing meaningfully to regional security and stability. Prime Minister Netanyahu expressed commitment to the same. The leaders discussed a proposal for ending the war in Gaza, prospects for a more secure Middle East, and the need for \"greater understanding\" between their countries.\nPresident Trump praised both leaders for their willingness to take steps toward greater cooperation in the interest of peace and security for all.\nEarlier, White House on Monday (local time) released a peace plan to end the two-year-old Gaza conflict following a meeting between US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu. The peace plan included that Gaza will be a deradicalised, terror-free zone that does not pose a threat to its neighbours and will be redeveloped for the benefit of the people of Gaza, who have suffered more than enough.\nThe peace plan stated that If both sides agree to this proposal, the war will immediately end. Israeli forces will withdraw to the agreed-upon line to prepare for a hostage release. During this time, all military operations, including aerial and artillery bombardment, will be suspended, and battle lines will remain frozen until conditions are met for the complete staged withdrawal.\nThe peace plans further stated that within 72 hours of Israel publicly accepting this agreement, all hostages, alive and deceased, will be returned.\nOnce all hostages are released, Israel will release 250 life sentence prisoners plus 1700 Gazans who were detained after October 7th 2023, including all women and children detained in that context. For every Israeli hostage whose remains are released, Israel will release the remains of 15 deceased Gazans. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Israeli Prime Minister Benjamin Netanyahu on Monday (local time) expressed regret for a missile strike against Hamas targets in Qatar, in a three-way call with US President Donald Trump, the White House said.","url":"https://www.latestly.com/agency-news/world-news-netanyahu-expresses-deep-regret-over-doha-attack-in-three-way-call-hosted-by-trump-with-al-thani-7136417.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250929213136.jpg","video":null,"publish_date":"2025-09-30 00:26:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.057},{"id":364666190,"title":"Judge Halts Trump Administration’s Proposal to Cut Numerous Voice of America Positions","text":"WASHINGTON – On Monday, a federal judge decided to temporarily halt the Trump administration’s initiative to cut numerous positions at the agency responsible for overseeing Voice of America, a broadcaster funded by the government and established during World War II to challenge Nazi propaganda.\n\nThe ruling, delivered by U.S. District Judge Royce Lamberth in Washington, D.C., prevents the U.S. Agency for Global Media from moving forward with a plan to reduce its workforce by eliminating 532 positions for full-time government employees starting Tuesday. This action affects most of the agency’s existing workforce.\n\nKari Lake, acting CEO of the agency, announced at the end of August that the job reductions would begin on Tuesday. However, the judge’s decision temporarily maintains the current state of the agency while he considers a request from plaintiffs to block the planned workforce reduction.\n\nEarlier, Lamberth had determined that President Donald Trump’s Republican administration needed to restore VOA’s programming levels in line with its legal obligation to “serve as a consistently reliable and authoritative source of news.” He also prevented Lake from dismissing Michael Abramowitz as the director of VOA.\n\nJudge cites ‘concerning disrespect’ toward court from administration\n\nLamberth noted the administration’s “concerning disrespect” towards the court following his previous instructions to provide details about its intentions for Voice of America.\n\nThe employees who filed the lawsuit to stop the deconstruction of Voice of America argued that the intended cuts would hinder the judge’s ability to enforce an injunction he ordered in April. Their legal representatives stated that “this Court should therefore preserve the status quo while the parties litigate compliance.”\n\nGovernment lawyers accused the plaintiffs of impermissibly trying to micromanage the agency’s operations. “Enjoining the reductions in force would be a wholly overbroad and improper remedy,” they wrote. \n\nLamberth, a senior judge, was nominated to the bench by Republican President Ronald Reagan in 1987.\n\nCan media agency continue to fulfill its ‘statutory mission’?\n\nThe U.S. Agency for Global Media also houses Radio Free Europe/Radio Liberty, Radio Free Asia, Middle East Broadcasting Networks and Radio Marti, which beams Spanish-language news into Cuba. The networks, which together reach an estimated 427 million people, date to the Cold War and are part of a network of government-funded organizations trying to extend U.S. influence and combat authoritarianism.\n\nCongress appropriated $875 million to the agency for fiscal year 2025 and required that $260 million of the funds must be spent by VOA.\n\nIn March, Trump signed an executive order called for the agency to reduce its “statutory functions and associated personnel to the minimum presence and function required by law.” A day later, VOA stopped broadcasting for the first time in 83 years. The agency placed almost all of its full-time employees on administrative leave.\n\nIn announcing the job cuts on social media last month, Lake said the agency “will continue to fulfill its statutory mission … and will likely improve its ability to function.”\n\n“I look forward to taking additional steps in the coming months to improve the functioning of a very broken agency and make sure America’s voice is heard abroad where it matters most,” she wrote.\n\nPlaintiffs’ attorney Georgina Yeomans argued Monday that the cuts would cement the agency’s programming at deficient levels that don’t comply with the judge’s orders. Yeomans said it’s unclear who at the agency is making key decisions, such as which jobs to eliminate.\n\n“We simply do not know,” she said.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – On Monday, a federal judge decided to temporarily halt the&#8230;\n\n\nThis Post: Judge Halts Trump Administration&#8217;s Proposal to Cut Numerous Voice of America Positions first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/judge-halts-trump-administrations-proposal-to-cut-numerous-voice-of-america-positions/","image":"https://internewscast.com/wp-content/uploads/2025/09/Judge-suspends-Trump-administration039s-plan-to-eliminate-hundreds-of-Voice.jpg","video":null,"publish_date":"2025-09-30 00:23:38","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.218},{"id":364664646,"title":"Killer Assata Shakur’s twisted legacy brought us today’s lefty terrorists","text":"As President Donald Trump and his administration take on the latest wave of left-wing violence, an obituary reminds us what happens when political killers get away with their crimes. \n\nThe law never caught up with Joanne Chesimard, aka Assata Shakur. \n\nShe died Thursday, age 78, an honored guest of Cuba’s Communist regime — and honored, disgracefully, by tenured radicals in America’s universities, too.\n\nProfessors have placed this convicted murderer on lists of “African-American heroes” and present her as a model for activism. \n\nStanford University’s dean of students, Mona Hicks, quoted a “loving refrain from Assata Shakur” in a campus email at the time of the George Floyd riots: \n\n“It is our duty to fight for our freedom. It is our duty to win. We must love and support each other. We have nothing to lose but our chains.”\n\nThat language wasn’t metaphorical — when Shakur said fight, it was a call to violence. \n\nShe wasn’t just an activist; she was a terrorist, a self-styled “revolutionary” of the Black Liberation Army, a Marxist-Leninist radical group in the 1970s. \n\nRevolution for them meant robbing banks, planting bombs and killing cops. \n\nShakur was already on the run from the law when she and two other BLA members were pulled over by New Jersey state troopers in 1973.\n\nShe and her associates shot at the officers — killing one, Werner Foerster, and wounding another; she took a few bullets herself, and one of her fellow radicals died. \n\nPolice took Shakur into custody, but she became a cause celebre with progressives — who called her a political prisoner — and in 1979 a BLA offshoot called “The Family” sprang her from prison.\n\nFidel Castro’s dictatorship granted her asylum, then refused decades of US entreaties to extradite her so she could face justice.\n\nAll that’s in the past, though, and now so is Shakur; yet her evil example is still very much with us.\n\nIt’s not only gray-haired professors and college bureaucrats lauding her violent politics. \n\nA teacher’s union in Chicago affiliated with the American Federation of Teachers signaled its approval with a post on the social media site X that noted her death and dubbed her “a revolutionary fighter, a fierce writer, a revered elder of Black liberation, and a leader of freedom whose spirit continues to live in our struggle.”\n\nThis was a woman who, without remorse, defended the armed robberies her group committed as class-war “expropriation.” \n\nIn interviews she gave from her Cuban exile, she called cop-killing “armed struggle.”\n\nShakur was hardly the only radical of the 1960s and ‘70s who became a hero to the academic left. \n\nOthers left bombs and bullets behind and settled for poisoning the minds of future generations. \n\nAngela Davis, a black extremist and longtime Communist Party stalwart who bought the shotgun used in the murder of a judge, is today “Distinguished Professor Emerita in the History of Consciousness and Feminist Studies” at the University of California, Santa Cruz.\n\nBill Ayers, the founder of the Weather Underground domestic terrorist group, eventually retired as “Distinguished Professor of Education and Senior University Scholar” at the University of Illinois, Chicago. \n\nIn the 1990s, Ayers worked with a promising young “community organizer” who’d go on to bigger things, a fellow by the name of Barack Obama. \n\nThe left-wing extremists of the 1960s and ’70s didn’t pay a very high reputational price — nor, in many cases, much of a legal price — for their violent politics. \n\nInstead they were welcomed into the institutions that shape the outlook of rising generations. \n\nAmerica is now reaping the harvest of those seeds, with a new crop of student radicals who cheer for violence — and all too often commit it. \n\nThis time the country, including government and the universities themselves, will have to react differently: There must be no tolerance for such political violence.\n\nThose who perpetrate it, including by beating up or harassing speakers on campus, must be prosecuted to the full extent of the law. \n\nAnd those who applaud thuggery or more extreme violence must face professional consequences.\n\nThey shouldn’t be teaching anyone’s children, for one thing. \n\nYes, the First Amendment enshrines their right to tell the world they idolize Assata Shakur’s bloody legacy. \n\nBut Americans also have the right to choose their associations, their employees, and where their tax dollars go. \n\nThey should make the choice not to promote or subsidize the likes of Shakur, Davis or Ayers — and not to entrust their children to anyone who worships them.\n\nDaniel McCarthy is the editor of Modern Age: A Conservative Review and editor-at-large of The American Conservative.","summary":"Assata Shakur and her partners in crime were welcomed by the institutions that shape the next generation — and America is now reaping the bitter harvest.","url":"https://nypost.com/2025/09/29/opinion/killer-assata-shakurs-twisted-legacy-formed-todays-lefty-terrorists/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/Joanne-Chesimard-1.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/p8OqTK4A-RyIcpnTz.mp4","publish_date":"2025-09-30 00:22:06","author":"Daniel McCarthy","authors":["Daniel McCarthy"],"language":"en","category":"politics","source_country":"us","sentiment":0.146},{"id":364666518,"title":"Anthony Albanese invites Middle Eastern supermarket giant to challenge Coles and Woolworths' domination of the Australian grocery sector","text":"Anthony Albanese hopes he has found a way to bolster competition in Australia's supermarket sector and get better prices for consumers.\n\nThe prime minister finished his 10-day overseas mission with a stopover in United Arab Emirates, visiting a local Lulu 'hypermarket' and inviting them to expand to Australia.\n\n'I want to see more competition,' he said, 'and this is a significant company'.\n\n'They are the largest throughout the Middle East. Egypt, here ... the second-largest in Saudi Arabia.\n\n'We know that Aldi, of course, have come to Australia, but this is a significant player that has an engagement with Australia and I want to see that competition.'\n\nAlbanese said he 'had a little discussion' with Lulu chairman Yusuff Ali 'as we were walking around' the Abu Dhabi store, which had a display specially arranged with Australian products, including meats, cheese and biscuits.\n\nA free trade deal between the Australia and the UAE will come into force on Wednesday, removing tariffs between the two countries.\n\nThe UAE is one of the wealthiest countries in the region, with two-way goods and services trade worth $9.9 billion in 2023, and two-way investment just over double that.\n\nThe visit was also timed for the 50-year anniversary of formal diplomatic relations between the two countries.\n\nThe quick stopover in the Middle East came after more lengthy engagements in the United States - for leaders week at the United Nations - and the United Kingdom.\n\nAlbanese will be back overseas again soon, expected to take in a number of international gatherings during 'summit season', and then for a much-anticipated formal meeting with Donald Trump.\n\nThe US president could not squeeze the prime minister into his diary on his recent New York visit but has confirmed a bilateral meeting on October 20 at the White House.","summary":"Anthony Albanese hopes he has found an answer to Australia's supermarket competition challenge.","url":"https://www.dailymail.co.uk/news/article-15146703/Anthony-Albanese-invites-Middle-Eastern-supermarket-giant-challenge-Coles-Woolworths-domination-Australian-grocery-sector.html","image":"https://i.dailymail.co.uk/1s/2025/09/30/01/102557411-0-image-a-2_1759191536704.jpg","video":null,"publish_date":"2025-09-30 00:19:02","author":"Editor","authors":["Editor"],"language":"en","source_country":"gb","sentiment":0.097},{"id":364662906,"title":"Kirk assassination suspect back  in court","text":"PROVO, Utah — An attorney for the 22-year-old man charged with killing Charlie Kirk asked a judge Monday for more time to review the large amount of evidence in the case before deciding if the defense will seek a preliminary hearing.\n\nA preliminary hearing would determine if there is enough evidence against Tyler Robinson to go forward with a trial. Defendants can waive that step, but Robinson’s newly appointed attorney Kathryn Nester said her team did not intend to do so.\n\nUtah prosecutors have charged Robinson with aggravated murder and plan to seek the death penalty.\n\nBoth the defense and prosecution acknowledged at a brief hearing Monday that the amount of evidence prosecutors have is “voluminous.” Robinson was not present for the hearing and appeared via audio from jail at his defense team’s request.\n\nJudge Tony Graf set the next hearing for Oct. 30.\n\nDefense attorneys for Robinson and prosecutors with the Utah County Attorney’s Office declined to comment after Monday’s hearing. It took place in Provo, just a few miles from the Utah Valley University campus in Orem where many students are still processing trauma from the Sept. 10 shooting and the day-and-a-half search for the suspect.\n\nAuthorities arrested Robinson when he showed up with his parents at his hometown sheriff’s office in southwest Utah, more than a three-hour drive from the site of the shooting, to turn himself in. Prosecutors have since revealed incriminating text messages and DNA evidence that they say connect Robinson to the killing.\n\nA note that Robinson left for his romantic partner before the shooting said he had the opportunity to kill one of the nation’s leading conservative voices, “and I’m going to take it,” Utah County Attorney Jeff Gray told reporters before the first hearing. Gray also said Robinson wrote in a text about Kirk to his partner: “I had enough of his hatred.”\n\nThe assassination of Kirk, a close ally of President Donald Trump who worked to steer young voters toward conservatism, has galvanized Republicans who have vowed to carry on Kirk’s mission of moving American politics further right.\n\nTrump has declared Kirk a “martyr” for freedom and threatened to crack down on what he called the “radical left.”\n\nWorkers across the U.S. have been punished or fired for speaking out about Kirk after his death, including teachers, public and private employees and media personalities — most notably Jimmy Kimmel, whose late-night show was suspended then reinstated by ABC.\n\nKirk’s political organization, Arizona-based Turning Point USA, brought young, evangelical Christians into politics through his podcast, social media and campus events. Many prominent Republicans are filling in at the upcoming campus events Kirk planned to attend, including Utah Gov. Spencer Cox and Sen. Mike Lee at Utah State University on Tuesday.","summary":"An attorney for the 22-year-old man charged with killing Charlie Kirk asked a judge Monday for more time to review the large amount of evidence in the case before deciding if the defense will seek a preliminary hearing.","url":"https://www.bostonherald.com/2025/09/29/kirk-assassination-suspect-back-in-court/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Charlie_Kirk_Shot_07386_c16df0.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-30 00:18:25","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.168},{"id":364662326,"title":"'They Back It 100%': Trump Praises Pakistan's Shehbaz Sharif, Asim Munir Over Gaza Peace Deal","text":"US President Donald Trump praised Pakistan's Prime Minister Shehbaz Sharif and the country's army chief, General Asim Munir, for supporting Washington's proposed Gaza peace plan. Speaking at a White House press briefing on Monday, Trump thanked several Muslim and Arab leaders for what he described as their \"tremendous support\" in developing a 20-point proposal aimed at ending the war between Israel and Hamas. \"I want to thank the leaders of many Arab and Muslim nations for their tremendous support in developing the proposal,\" Trump said. \"My meetings and dialogue with Saudi Arabia, the Emir of Qatar, the UAE, the King of Jordan, President Erdogan of Turkey, the President of Indonesia — we were together,\" he added. Referring to Pakistan, the President said: \"The Prime Minister and the Field Marshal of Pakistan, they were with us right from the beginning. They just put out a statement that they fully believe in this pact.\" Also Read: Trump's Gaza Peace Plan - How Does Ex-British PM Tony Blair Fit into the Picture? \"It just came out as I was walking around,\" he continued. \"They [officials] said, ‘Sir, you have a big notice from the prime minister of Pakistan and from the field marshal' that they back this 100%.\" Sharif confirmed his government's endorsement of the proposal in a post on X, describing it as a step towards regional stability. \"A durable peace between Palestinians and Israelis is essential for political stability and economic growth in the region,\" he wrote. The Gaza peace plan, unveiled by the White House earlier on Monday, outlines an immediate ceasefire if both Israel and Hamas agree to its terms. Under the proposal, hostages and prisoners would be released by both sides, Hamas would disarm, and Israeli forces would withdraw following a demilitarisation process. According to the plan, Hamas would release all Israeli hostages, \"dead or alive,\" within 72 hours of Israel's acceptance of the proposal. In return, Israel would free 250 Palestinian prisoners serving life sentences and 1,700 Gazans detained after the outbreak of the conflict on 7 October 2023. The White House says the plan also envisions a framework for redeveloping what it calls \"New Gaza,\" under international supervision, with the aim of turning the enclave into a \"deradicalised, terror-free zone.\" Trump's comments come days after a meeting last week with Sharif and Munir in Washington. The President had earlier praised both leaders ahead of their visit, calling them \"great guys.\" \"We have a great leader coming — the Prime Minister of Pakistan and the Field Marshal,\" Trump had told reporters. \"Field Marshal is a very great guy, and so is the Prime Minister. They may be in this room right now,\" he added. The meeting, held on the sidelines of the United Nations General Assembly in New York, marked the latest in a series of high-level engagements between the United States and Pakistan since Trump's return to office. Sharif and General Munir made a brief trip to Washington, DC, from New York to meet with the US President and his senior advisers. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Trump's comments come days after a meeting last week with Sharif and Munir in Washington","url":"https://www.timesnownews.com/world/us/us-news/us-president-donald-trump-praises-shehbaz-sharif-asim-munir-gaza-peace-plan-article-152917261","image":"https://images.timesnownews.com/thumb/msid-152917259,thumbsize-71652,width-1280,height-720,resizemode-75/152917259.jpg","video":null,"publish_date":"2025-09-30 00:14:45","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":0.013},{"id":364662220,"title":"World News | White House Releases Pleace Plan to End the Gaza Conflict","text":"Washington DC [US], September 30 (ANI): White House on Monday (local time) released a peace plan to end the two year old Gaza conflict following a meeting between US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu. The peace plan included that Gaza will be a deradicalized terror-free zone that does not pose a threat to its neighbors and will be redeveloped for the benefit of the people of Gaza, who have suffered more than enough.\nAlso Read | Donald Trump Hosts Phone Call Between Israel and Qatar; PM Benjamin Netanyahu Expresses 'Deep Regret' for Missile Strike.\nThe peace plan stated that If both sides agree to this proposal, the war will immediately end. Israeli forces will withdraw to the agreed upon line to prepare for a hostage release. During this time, all military operations, including aerial and artillery bombardment, will be suspended, and battle lines will remain frozen until conditions are met for the complete staged withdrawal.\nThe peace plans further stated that within 72 hours of Israel publicly accepting this agreement, all hostages, alive and deceased, will be returned.\nAlso Read | PoJK Protest: 3 Killed, Over Dozen Injured As Police Open Fire on Protesters in Pakistan-Occupied Jammu and Kashmir (Watch Videos).\nOnce all hostages are released, Israel will release 250 life sentence prisoners plus 1700 Gazans who were detained after October 7th 2023, including all women and children detained in that context. For every Israeli hostage whose remains are released, Israel will release the remains of 15 deceased Gazans.\nThe point plan states that once all hostages are returned, Hamas members who commit to peaceful co-existence and to decommission their weapons will be given amnesty. Members of Hamas who wish to leave Gaza will be provided safe passage to receiving countries.\nUpon acceptance of this agreement, full aid will be immediately sent into the Gaza Strip. At a minimum, aid quantities will be consistent with what was included in the January 19, 2025, agreement regarding humanitarian aid, including rehabilitation of infrastructure (water, electricity, sewage), rehabilitation of hospitals and bakeries, and entry of necessary equipment to remove rubble and open roads.\nThe peace plan mentioned that entry of distribution and aid in the Gaza Strip will proceed without interference from the two parties through the United Nations and its agencies, and the Red Crescent, in addition to other international institutions not associated in any manner with either party. Opening the Rafah crossing in both directions will be subject to the same mechanism implemented under the January 19, 2025 agreement.\nGaza will be governed under the temporary transitional governance of a technocratic, apolitical Palestinian committee, responsible for delivering the day-to-day running of public services and municipalities for the people in Gaza.\nThis committee will be made up of qualified Palestinians and international experts, with oversight and supervision by a new international transitional body, the \"Board of Peace,\" which will be headed and chaired by President Donald J. Trump, with other members and heads of State to be announced, including Former Prime Minister Tony Blair. This body will set the framework and handle the funding for the redevelopment of Gaza until such time as the Palestinian Authority has completed its reform program, as outlined in various proposals, including President Trump's peace plan in 2020 and the Saudi-French proposal, and can securely and effectively take back control of Gaza. This body will call on best international standards to create modern and efficient governance that serves the people of Gaza and is conducive to attracting investment.\nAs per the peace plan, a Trump economic development plan to rebuild and energize Gaza will be created by convening a panel of experts who have helped birth some of the thriving modern miracle cities in the Middle East. Many thoughtful investment proposals and exciting development ideas have been crafted by well-meaning international groups, and will be considered to synthesize the security and governance frameworks to attract and facilitate these investments that will create jobs, opportunity, and hope for future Gaza.\nIt further stated that a special economic zone will be established with preferred tariff and access rates to be negotiated with participating countries.\nNo one will be forced to leave Gaza, and those who wish to leave will be free to do so and free to return. We will encourage people to stay and offer them the opportunity to build a better Gaza, as per the peace plan.\nAs per the peace plan, Hamas and other factions agree to not have any role in the governance of Gaza, directly, indirectly, or in any form. All military, terror, and offensive infrastructure, including tunnels and weapon production facilities, will be destroyed and not rebuilt. There will be a process of demilitarization of Gaza under the supervision of independent monitors, which will include placing weapons permanently beyond use through an agreed process of decommissioning, and supported by an internationally funded buy back and reintegration program all verified by the independent monitors. New Gaza will be fully committed to building a prosperous economy and to peaceful coexistence with their neighbors.\nA guarantee will be provided by regional partners to ensure that Hamas, and the factions, comply with their obligations and that New Gaza poses no threat to its neighbors or its people.\nThe United States will work with Arab and international partners to develop a temporary International Stabilization Force (ISF) to immediately deploy in Gaza. The ISF will train and provide support to vetted Palestinian police forces in Gaza, and will consult with Jordan and Egypt who have extensive experience in this field. This force will be the long-term internal security solution. The ISF will work with Israel and Egypt to help secure border areas, along with newly trained Palestinian police forces. It is critical to prevent munitions from entering Gaza and to facilitate the rapid and secure flow of goods to rebuild and revitalize Gaza. A deconfliction mechanism will be agreed upon by the parties.\nThe White House peace plan stated that Israel will not occupy or annex Gaza. As the ISF establishes control and stability, the Israel Defense Forces (IDF) will withdraw based on standards, milestones, and timeframes linked to demilitarization that will be agreed upon between the IDF, ISF, the guarantors, and the Unites States, with the objective of a secure Gaza that no longer poses a threat to Israel, Egypt, or its citizens. Practically, the IDF will progressively hand over the Gaza territory it occupies to the ISF according to an agreement they will make with the transitional authority until they are withdrawn completely from Gaza, save for a security perimeter presence that will remain until Gaza is properly secure from any resurgent terror threat.\nIn the event Hamas delays or rejects this proposal, the above, including the scaled-up aid operation, will proceed in the terror-free areas handed over from the IDF to the ISF.\nAn interfaith dialogue process will be established based on the values of tolerance and peaceful co-existence to try and change mindsets and narratives of Palestinians and Israelis by emphasizing the benefits that can be derived from peace.While Gaza re-development advances and when the PA reform program is faithfully carried out, the conditions may finally be in place for a credible pathway to Palestinian self-determination and statehood, which we recognize as the aspiration of the Palestinian people.\nThe peace plan emphasised that the United States will establish a dialogue between Israel and the Palestinians to agree on a political horizon for peaceful and prosperous co-existence. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to the Gaza will be redeveloped for the benefit of its people, and it will also be a &quot;deradicalised terror-free zone&quot; which will not pose any threat to its neighbouring countries.","url":"https://www.latestly.com/agency-news/world-news-white-house-releases-pleace-plan-to-end-the-gaza-conflict-7136408.html","image":"https://st1.latestly.com/wp-content/uploads/2025/09/ANI-20250929194745.jpg","video":null,"publish_date":"2025-09-30 00:14:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.148},{"id":364661158,"title":"EXCLUSIVE: Angelina Jolie and Jon Voight's Rift Explodes All Over Again — 'He Feels Like She's Launched All-Out War on His MAGA Values'","text":"Angelina Jolie has reignited her long-running feud with her father Jon Voight, with insiders telling RadarOnline.com the 50-year-old actress' outspoken defense of free speech and her criticism of Donald Trump's administration amount to \"all-out war\" on his MAGA values.\n\nThe Oscar winner, known for her left-wing political leanings and humanitarian activism, spoke at the San Sebastian film festival in Spain while promoting her latest movie.Jolie's Free Speech Stand Sparks FuryAsked about her fears as an artist and as an American, Jolie said: \"It's a very difficult question... I love my country, but I don't at this time recognise my country.\"\n\nShe added: \"Anything, anywhere, that divides or, of course, limits personal expressions and freedoms and, from anyone, I think is very dangerous.\"\n\nHer remarks came after ABC temporarily pulled Jimmy Kimmel Live! from air following comments in which the comedian mocked Trump's response to the assassination of right-wing activist Charlie Kirk, 31. Jolie warned limits on speech were \"dangerous,\" a comment that drew fury from Trump allies.\n\nA White House spokesman dismissed Kimmel as a \"low ratings loser,\" while pro-Trump website Breitbart accused Jolie of \"trashing America.\"Jon Voight Sees BetrayalSources say her comments have particularly inflamed tensions with Voight, 86, a staunch Trump supporter who was appointed earlier this year as one of three \"special ambassadors\" to Hollywood.\n\nOne Hollywood insider said: \"Jon feels Angelina has launched all-out war on everything he stands for politically. He thinks her comments weren’t just about Trump – they were a direct challenge to him and his role in MAGA Hollywood.\"\n\nAnother source close to the family said: \"Angelina has always leaned left, speaking out for refugees and against wars, and Jon sees that as undermining his values. He told friends she is embarrassing him on the global stage by siding with what he calls 'radical liberals.' Their fragile relationship has been blown apart again.\"Old Wounds ReopenedJolie, who has served as a UN special envoy, has long identified with progressive causes, from women's rights to international justice. \n\nInsiders suggest her latest remarks were meant as a broader warning, not just about the Kimmel row but about the state of democracy under Trump.\n\nOne said: \"She believes personal freedoms are under attack in America. To her, this is about more than Hollywood – it's about protecting civil liberties. But Jon sees it as a betrayal.\"\n\nPrickly family dynamics have only sharpened the political clash. Jolie and Voight were estranged for many years after their relationship broke down in the early 2000s. \n\nThough they later reconciled publicly, the renewed tensions suggest old wounds remain raw.Hollywood Joins the FightMore than 400 prominent figures – including Robert De Niro, Jamie Lee Curtis, Mark Ruffalo and Meryl Streep – have signed an open letter denouncing the removal of Kimmel’s show as \"unconstitutional and unAmerican.\" \n\nThe letter, organized by the American Civil Liberties Union, said: \"The government is threatening private companies and individuals that the president disagrees with. We can't let this threat to our freedom of speech go unanswered.\"\n\nDespite Disney's decision to restore Jimmy Kimmel Live! after what it called \"thoughtful conversations\" with the host, Trump has continued to threaten broadcast licenses of networks that criticize him. \n\nEven Republican Senator Ted Cruz warned that the moves were \"unbelievably dangerous,\" saying the tactics were \"right out of Goodfellas.\"","summary":"Angelina Jolie’s feud with father Jon Voight reignited as he felt she attacked his MAGA values and views.","url":"https://radaronline.com/p/angelina-jolie-father-jon-voight-rift-explodes-maga-war-views/","image":"https://media.radaronline.com/brand-img/wvIGHObT4/0x0/angelina-jolie-and-jon-voights-rift-explodes-all-over-again-he-feels-like-shes-launched-all-out-war-on-his-maga-values-split2-1759160966047.jpg","video":null,"publish_date":"2025-09-30 00:03:27","author":"Matthew Acton","authors":["Matthew Acton"],"language":"en","source_country":"us","sentiment":-0.07},{"id":364662814,"title":"Drug task force seizes record-breaking 1 million pounds of cocaine, denying cartels and narco-terrorists $11B","text":"EXCLUSIVE – A Florida-based multi-agency task force has seized a record one million pounds of cocaine during fiscal year 2025 — a haul officials say represents 378 million lethal doses, enough to kill every American. The seizure was announced by Joint Inter-Agency Task Force – South (JIATF-S), led by U.S. Southern Command (SOUTHCOM). The unit, which includes the U.S. Coast Guard, works with partner nations to disrupt the flow of illicit drugs through the \"transit zone\" between South America, Central America and the Caribbean and to weaken transnational criminal organizations. According to the task force, the amount of drugs seized over the past 12 months is enough to fill 42 dump trucks. The 2025 fiscal year ends Tuesday. JIATF-S confirmed to Fox News Digital that the effort has denied cartels and narco-terrorists $11.34 billion in revenue and removed 377.9 million lethal doses from the streets. TRUMP UNLEASHES US MILITARY POWER ON CARTELS. IS A WIDER WAR LOOMING? JIATF-S operates across 42 million square miles, from the Eastern Pacific to the Western Atlantic, stretching from international waters north of the Caribbean Antilles to the southern tip of South America at Cape Horn. The region has long been a major trafficking corridor for drugs, arms, cash and people. Well-financed and sophisticated criminal networks continue to exploit the area, officials said. \"By disrupting the flow of these deadly drugs, JIATF-S is saving lives and protecting our homeland,\" the agency added. A seizure of this magnitude has never been accomplished before. Officials said the one million pounds of cocaine does not include the strikes on Venezuelan narco-terrorists. The Trump administration has vowed to intensify military action in the Caribbean as part of its counter-narcotics strategy. TRUMP SAVES AMERICAN LIVES WITH ‘OVERWHELMING FORCE’ AGAINST DRUG SMUGGLERS ENCROACHING ON US BEACHES: EXPERT In recent months, U.S. forces have conducted multiple operations targeting smuggling vessels as President Donald Trump pushed to crack down on cartels and stem the flow of cocaine and other illicit drugs into the United States. In February, Trump designated groups, including Tren de Aragua and the Sinaloa Cartel as foreign terrorist organizations. The Justice Department has also offered a $50 million reward for information leading to the arrest and conviction of Venezuelan President Nicolás Maduro. Maduro is accused by U.S. authorities of helping lead the Cartel of the Suns, a Venezuelan drug-trafficking network allegedly comprised of senior government and military officials. \"As he gained power in Venezuela, Maduro participated in a corrupt and violent narco-terrorism conspiracy with the Revolutionary Armed Forces of Colombia (FARC), a designated Foreign Terrorist Organization,\" a State Department bulletin states. CLICK HERE TO GET THE FOX NEWS APP Prosecutors allege Maduro helped arrange multi-ton shipments of FARC-produced cocaine and directed the Cartel of the Suns to provide the group with military-grade weapons. In August, Trump approved the deployment of several U.S. Navy guided-missile destroyers to strengthen counter-narcotics operations in the Caribbean. Maduro responded by declaring that Venezuela was ready to resist any attacks, calling the move \"an extravagant, unjustifiable, immoral and absolutely criminal and bloody threat.\" He has accused Trump of orchestrating a broader campaign to overthrow his government. Fox News Digital's Diana Stancy contributed to this report.","summary":"A Florida-based multi-agency task force seized record cocaine hauls equivalent to 378 million lethal doses as Trump administration intensifies Caribbean operations.","url":"https://www.foxnews.com/us/drug-task-force-seizes-record-breaking-1-million-pounds-cocaine-denying-cartels-narco-terrorists-11b","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/09/drug-task-force-1m-pound-cocaine-002.jpg","video":"https://www.foxnews.com/video/6378550365112","publish_date":"2025-09-30 00:02:30","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","source_country":"us","sentiment":0.32},{"id":364666010,"title":"Trump, Vance and Republicans point fingers and blame Democrats for potential government shutdown","text":"President Donald Trump, Vice President JD Vance and Republican leaders in the House and Senate had a simple message as Washington barrels toward a government shutdown: It’s all the Democrats’ fault. \n\nThe government runs out of money at midnight on Tuesday. As it stands, the House of Representatives has not been in session since two Fridays ago when Republicans passed a continuing resolution. \n\n“We have disagreements about tax policy, but you don’t shut the government down,” Vice President JD Vance told reporters after a meeting with Senate Majority Leader John Thune, House Speaker Mike Johnson, Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries. \n\nThe meeting came after Trump had initially canceled a meeting with Schumer and Jeffries, whom he called “Minority Radical Left Democrats.” After Monday’s meeting, Vance proceeded to attack the minority party.\n\n“We have disagreements about health care policies, but you don’t shut the government down,” he said. “You don’t use your policy disagreements as leverage to not pay our troops, to not have essential services of government actually function. You don’t say the fact that you disagree about a particular tax provision is an excuse for shutting down the people’s government and all the essential services that come along with it.” \n\nDemocrats do not have many options for leverage considering Republicans control the White House, the House and the Senate. But given that a stopgap spending bill known as a continuing resolution requires 60 votes to avoid a filibuster, Democrats hope to use health care as leverage.\n\nDuring the Covid-19 pandemic, the Biden administration expanded subsidies for the health care marketplace under the Affordable Care Act. The Inflation Reduction Act extended those subsidies for two additional years. Those expanded subsidies expire at the end of the year.\n\nBut Republicans say that Democrats are being unreasonable and are just trying to appease their left-wing base. \n\n“Senator Schumer is afraid will no longer be the Democratic leader,” Sen. John Cornyn (R-Texas) told The Independent on Monday. \n\nSchumer faced harsh criticism in March after he joined Republicans to prevent a government shutdown and voted for a continuing resolution. His approval numbers plummeted precipitously in his home state of New York and the vote triggered discussions of a possible primary challenge by Rep. Alexandria Ocasio-Cortez in 2028. \n\nMany Democrats now think they have a chance of winning concessions by focusing solely on health care, a policy where they historically have an advantage over Republicans. \n\n“The only reason we're in this situation is that Schumer is trying to protect his hide, and he's scared of the left wing,” Senate Majority Whip John Barrasso told reporters on Monday.\n\nFlirting with a government shutdown is a constant tightrope. It almost never wins the concessions that the party threatening a shutdown demands. \n\nIn 2018, Democrats briefly triggered a government shutdown to get relief for DREAMers, the group of undocumented immigrants who arrived as children. Later that same year, Trump triggered a government shutdown to secure funding for his desired Mexico border wall. \n\nBut Rep. Rosa DeLauro, the top Democrat on the House Appropriations Committee, had a simple response for people who said the Democrats would own a government shutdown this time around. \n\n“Get over it,” she told The Independent. “We have been trying to sit down. And I sat in a meeting with my three counterparts, where we said very clearly the consensus was bipartisan continuing resolution, which took into consideration Democratic priorities and also dealt with the issue of not being able to steal funds that had already been appropriated.” \n\nDemocrats are also confident they have public opinion on their side, citing a poll from Morning Consult showing that 45 percent of voters saying they’d blame Republicans for a shutdown and only 32 percent saying they’d blame the Democrats.\n\nDemocrats also have to deal with the fact many federal workers in states such as Virginia and Maryland, which mostly vote Democratic, would be without a paycheck if the government is shut down. \n\n“We all want to keep the federal government open, which is why I'm supporting the Democratic proposal that does that, but also puts up safeguards against the president's lawless activities,” Sen. Chris Van Hollen (D-Md.) told The Independent. \n\nAnd so we all want to keep the federal government open, but we don't want to give Donald Trump a blank check to continue his lawless activities and leave the time bomb ticking on health care in America, because as you know, when that bomb goes off, millions of Americans will see their premiums spike.” \n\nBut so far, no Democrat wants to specifically say they are okay with a government shutdown, but they show no interest in getting to “yes” on the Republican proposal.","summary":"Democrats have a simple response: ‘Get over it’","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-vance-republicans-government-shutdown-b2836159.html","image":"https://static.independent.co.uk/2025/09/29/22/39/GettyImages-2238162026.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/sicN5tDl-OhrQWqOm.mp4","publish_date":"2025-09-29 23:58:05","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.299},{"id":364664278,"title":"Trump’s shutdown blame game: Democrats pressured to yield, while administration makes plans for mass layoffs","text":"WASHINGTON — President Donald Trump has had one refrain in recent days when asked about the looming government shutdown.\n\nWill there be a shutdown? Yes, Trump says, “because the Democrats are crazed.” Why is the White House pursuing mass firings, not just furloughs, of federal workers? Trump responds, “Well, this is all caused by the Democrats.”\n\nIs he concerned about the impact of a shutdown? “The radical left Democrats want to shut it down,” he retorts.\n\n“If it has to shut down, it’ll have to shut down,” Trump said Friday. “But they’re the ones that are shutting down government.”\n\nIn his public rhetoric, the Republican president has been singularly focused on laying pressure on Democrats in hopes they will yield before Wednesday, when the shutdown could begin, or shoulder the political blame if they don’t. That has aligned Trump with House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., who have refused to accede to Democrats’ calls to include health care provisions on a bill that will keep the government operating for seven more weeks.\n\nThose dynamics could change Monday, when the president has agreed to host Senate Minority Leader Chuck Schumer, D-N.Y., House Minority Leader Hakeem Jeffries, D-N.Y., Johnson and Thune. Democrats believe the high-stakes meeting means the GOP is feeling pressure to compromise with them.\n\nStill, Republicans say they are confident Democrats would be faulted if the closure comes. For Trump, the impact would go far beyond politics. His administration is sketching plans to implement mass layoffs of federal workers rather than simply furloughing them, furthering their goal of building a far smaller government that lines up with Trump’s vision and policy priorities.\n\nThis time, it’s the Democrats making policy demands\n\nThe GOP’s stance — a short-term extension of funding, with no strings attached — is unusual for a political party that has often tried to extract policy demands using the threat of a government shutdown as leverage.\n\nIn 2013, Republicans refused to keep the government running unless the Affordable Care Act was defunded, a stand that led to a 16-day shutdown for which the GOP was widely blamed. During his first term, Trump insisted on adding funding for a border wall that Congress would not approve, prompting a shutdown that the president, in an extraordinary Oval Office meeting that played out before cameras, said he would “take the mantle” for.\n\n“I will be the one to shut it down,” Trump declared at the time.\n\nThis time, it’s the Democrats making the policy demands.\n\nThey want an extension of subsidies that help low- and middle-income earners who buy insurance coverage through the Obama-era health care law. They also want to reverse cuts to Medicaid enacted in the GOP’s tax and border spending bill this year. Republican leaders say what Democrats are pushing for is too costly and too complicated to negotiate with the threat of a government shutdown hanging over lawmakers.\n\nWatching all this is Trump. He has not ruled out a potential deal on continuing the expiring subsidies, which some Republicans also want to extend.\n\n“My assumption is, he’s going to be willing to sit down and talk about at least one of these issues that they’re interested in and pursuing a solution for after the government stays open,” Thune said in an Associated Press interview last week. “Frankly, I just don’t know what you negotiate at this point.”\n\nBack and forth on a White House sit-down\n\nAt this point, Trump has shown no public indication he plans to compromise with Democrats on a shutdown, even as he acknowledges he needs help from at least a handful of them to keep the government open and is willing to meet with them at the White House.\n\nLast week, Trump appeared to agree to sit down with Schumer and Jeffries and a meeting went on the books for Thursday. Once word got out about that, Johnson and Thune intervened, privately making the case to Trump that it was not the time during the funding fight to negotiate with Democrats over health care, according to a person familiar with the conversation who was not authorized to discuss it publicly and spoke on condition of anonymity.\n\nNot long after hearing from the GOP leaders, Trump took to social media and said he would no longer meet with the two Democrats “after reviewing the details of the unserious and ridiculous demands being made by the Minority Radical Left Democrats.” Republicans privately acknowledge Trump’s decision to agree to a meeting was a misstep because it gave Democrats fodder to paint Trump as the one refusing to negotiate.\n\n“Trump is literally boycotting meeting with Democrats to find a solution,” Sen. Chris Murphy, D-Conn., wrote on the social media site X before Trump reversed course again and agreed to meet with the leadership. “There is no one to blame but him. He wants a shut down.”\n\nIt was not immediately clear what led Trump over the weekend to take a meeting he had once refused. Schumer spoke privately with Thune on Friday, pushing the majority leader to get a meeting with the president scheduled because of the approaching funding deadline, according to a Schumer aide. A Thune spokesman said in response that Schumer was “clearly getting nervous.”\n\nAnother reason why Democrats suspect Trump would be fine with a shutdown is how his budget office would approach a closure should one happen.\n\nThe administration’s strategy was laid out in an Office of Management and Budget memo last week that said agencies should consider a reduction in force for federal programs whose funding would lapse, are not otherwise funded and are “not consistent” with the president’s priorities. A reduction in force would not only lay off employees but also eliminate their positions, triggering yet another massive upheaval in the federal workforce.\n\nJeffries argued that Trump and his top aides were using the “smoke screen of a government shutdown caused by them to do more damage.”\n\nAP Congressional Correspondent Lisa Mascaro and Associated Press writer Mary Clare Jalonick contributed to this report.","summary":"The Republican president has indicated he's not willing to compromise with Democrats.","url":"https://www.twincities.com/2025/09/29/trump-shutdown-blame-game/","image":"https://www.twincities.com/wp-content/uploads/2025/09/Trump_69664-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-29 23:52:09","author":"Seung Min Kim","authors":["Seung Min Kim"],"language":"en","category":"politics","source_country":"us","sentiment":-0.125},{"id":364662092,"title":"Trump’s shutdown blame game: Democrats pressured to yield, while administration makes plans for mass layoffs","text":"By SEUNG MIN KIM\n\nWASHINGTON (AP) — President Donald Trump has had one refrain in recent days when asked about the looming government shutdown.\n\nWill there be a shutdown? Yes, Trump says, “because the Democrats are crazed.” Why is the White House pursuing mass firings, not just furloughs, of federal workers? Trump responds, “Well, this is all caused by the Democrats.”\n\nIs he concerned about the impact of a shutdown? “The radical left Democrats want to shut it down,” he retorts.\n\n“If it has to shut down, it’ll have to shut down,” Trump said Friday. “But they’re the ones that are shutting down government.”\n\nIn his public rhetoric, the Republican president has been singularly focused on laying pressure on Democrats in hopes they will yield before Wednesday, when the shutdown could begin, or shoulder the political blame if they don’t. That has aligned Trump with House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., who have refused to accede to Democrats’ calls to include health care provisions on a bill that will keep the government operating for seven more weeks.\n\nThose dynamics could change Monday, when the president has agreed to host Senate Minority Leader Chuck Schumer, D-N.Y., House Minority Leader Hakeem Jeffries, D-N.Y., Johnson and Thune. Democrats believe the high-stakes meeting means the GOP is feeling pressure to compromise with them.\n\nStill, Republicans say they are confident Democrats would be faulted if the closure comes. For Trump, the impact would go far beyond politics. His administration is sketching plans to implement mass layoffs of federal workers rather than simply furloughing them, furthering their goal of building a far smaller government that lines up with Trump’s vision and policy priorities.\n\nThis time, it’s the Democrats making policy demands\n\nThe GOP’s stance — a short-term extension of funding, with no strings attached — is unusual for a political party that has often tried to extract policy demands using the threat of a government shutdown as leverage.\n\nIn 2013, Republicans refused to keep the government running unless the Affordable Care Act was defunded, a stand that led to a 16-day shutdown for which the GOP was widely blamed. During his first term, Trump insisted on adding funding for a border wall that Congress would not approve, prompting a shutdown that the president, in an extraordinary Oval Office meeting that played out before cameras, said he would “take the mantle” for.\n\n“I will be the one to shut it down,” Trump declared at the time.\n\nThis time, it’s the Democrats making the policy demands.\n\nThey want an extension of subsidies that help low- and middle-income earners who buy insurance coverage through the Obama-era health care law. They also want to reverse cuts to Medicaid enacted in the GOP’s tax and border spending bill this year. Republican leaders say what Democrats are pushing for is too costly and too complicated to negotiate with the threat of a government shutdown hanging over lawmakers.\n\nWatching all this is Trump. He has not ruled out a potential deal on continuing the expiring subsidies, which some Republicans also want to extend.\n\n“My assumption is, he’s going to be willing to sit down and talk about at least one of these issues that they’re interested in and pursuing a solution for after the government stays open,” Thune said in an Associated Press interview last week. “Frankly, I just don’t know what you negotiate at this point.”\n\nBack and forth on a White House sit-down\n\nAt this point, Trump has shown no public indication he plans to compromise with Democrats on a shutdown, even as he acknowledges he needs help from at least a handful of them to keep the government open and is willing to meet with them at the White House.\n\nLast week, Trump appeared to agree to sit down with Schumer and Jeffries and a meeting went on the books for Thursday. Once word got out about that, Johnson and Thune intervened, privately making the case to Trump that it was not the time during the funding fight to negotiate with Democrats over health care, according to a person familiar with the conversation who was not authorized to discuss it publicly and spoke on condition of anonymity.\n\nNot long after hearing from the GOP leaders, Trump took to social media and said he would no longer meet with the two Democrats “after reviewing the details of the unserious and ridiculous demands being made by the Minority Radical Left Democrats.” Republicans privately acknowledge Trump’s decision to agree to a meeting was a misstep because it gave Democrats fodder to paint Trump as the one refusing to negotiate.\n\n“Trump is literally boycotting meeting with Democrats to find a solution,” Sen. Chris Murphy, D-Conn., wrote on the social media site X before Trump reversed course again and agreed to meet with the leadership. “There is no one to blame but him. He wants a shut down.”\n\nIt was not immediately clear what led Trump over the weekend to take a meeting he had once refused. Schumer spoke privately with Thune on Friday, pushing the majority leader to get a meeting with the president scheduled because of the approaching funding deadline, according to a Schumer aide. A Thune spokesman said in response that Schumer was “clearly getting nervous.”\n\nAnother reason why Democrats suspect Trump would be fine with a shutdown is how his budget office would approach a closure should one happen.\n\nThe administration’s strategy was laid out in an Office of Management and Budget memo last week that said agencies should consider a reduction in force for federal programs whose funding would lapse, are not otherwise funded and are “not consistent” with the president’s priorities. A reduction in force would not only lay off employees but also eliminate their positions, triggering yet another massive upheaval in the federal workforce.\n\nJeffries argued that Trump and his top aides were using the “smoke screen of a government shutdown caused by them to do more damage.”\n\nAP Congressional Correspondent Lisa Mascaro and Associated Press writer Mary Clare Jalonick contributed to this report.","summary":"The Republican president has indicated he's not willing to compromise with Democrats.","url":"https://www.ocregister.com/2025/09/29/trump-shutdown-blame-game/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/Trump_69664-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-29 23:52:09","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":-0.101},{"id":364662924,"title":"Trump’s shutdown blame game: Democrats pressured to yield, while administration makes plans for mass layoffs","text":"By SEUNG MIN KIM\n\nWASHINGTON (AP) — President Donald Trump has had one refrain in recent days when asked about the looming government shutdown.\n\nWill there be a shutdown? Yes, Trump says, “because the Democrats are crazed.” Why is the White House pursuing mass firings, not just furloughs, of federal workers? Trump responds, “Well, this is all caused by the Democrats.”\n\nIs he concerned about the impact of a shutdown? “The radical left Democrats want to shut it down,” he retorts.\n\n“If it has to shut down, it’ll have to shut down,” Trump said Friday. “But they’re the ones that are shutting down government.”\n\nIn his public rhetoric, the Republican president has been singularly focused on laying pressure on Democrats in hopes they will yield before Wednesday, when the shutdown could begin, or shoulder the political blame if they don’t. That has aligned Trump with House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., who have refused to accede to Democrats’ calls to include health care provisions on a bill that will keep the government operating for seven more weeks.\n\nThose dynamics could change Monday, when the president has agreed to host Senate Minority Leader Chuck Schumer, D-N.Y., House Minority Leader Hakeem Jeffries, D-N.Y., Johnson and Thune. Democrats believe the high-stakes meeting means the GOP is feeling pressure to compromise with them.\n\nStill, Republicans say they are confident Democrats would be faulted if the closure comes. For Trump, the impact would go far beyond politics. His administration is sketching plans to implement mass layoffs of federal workers rather than simply furloughing them, furthering their goal of building a far smaller government that lines up with Trump’s vision and policy priorities.\n\nThis time, it’s the Democrats making policy demands\n\nThe GOP’s stance — a short-term extension of funding, with no strings attached — is unusual for a political party that has often tried to extract policy demands using the threat of a government shutdown as leverage.\n\nIn 2013, Republicans refused to keep the government running unless the Affordable Care Act was defunded, a stand that led to a 16-day shutdown for which the GOP was widely blamed. During his first term, Trump insisted on adding funding for a border wall that Congress would not approve, prompting a shutdown that the president, in an extraordinary Oval Office meeting that played out before cameras, said he would “take the mantle” for.\n\n“I will be the one to shut it down,” Trump declared at the time.\n\nThis time, it’s the Democrats making the policy demands.\n\nThey want an extension of subsidies that help low- and middle-income earners who buy insurance coverage through the Obama-era health care law. They also want to reverse cuts to Medicaid enacted in the GOP’s tax and border spending bill this year. Republican leaders say what Democrats are pushing for is too costly and too complicated to negotiate with the threat of a government shutdown hanging over lawmakers.\n\nWatching all this is Trump. He has not ruled out a potential deal on continuing the expiring subsidies, which some Republicans also want to extend.\n\n“My assumption is, he’s going to be willing to sit down and talk about at least one of these issues that they’re interested in and pursuing a solution for after the government stays open,” Thune said in an Associated Press interview last week. “Frankly, I just don’t know what you negotiate at this point.”\n\nBack and forth on a White House sit-down\n\nAt this point, Trump has shown no public indication he plans to compromise with Democrats on a shutdown, even as he acknowledges he needs help from at least a handful of them to keep the government open and is willing to meet with them at the White House.\n\nLast week, Trump appeared to agree to sit down with Schumer and Jeffries and a meeting went on the books for Thursday. Once word got out about that, Johnson and Thune intervened, privately making the case to Trump that it was not the time during the funding fight to negotiate with Democrats over health care, according to a person familiar with the conversation who was not authorized to discuss it publicly and spoke on condition of anonymity.\n\nNot long after hearing from the GOP leaders, Trump took to social media and said he would no longer meet with the two Democrats “after reviewing the details of the unserious and ridiculous demands being made by the Minority Radical Left Democrats.” Republicans privately acknowledge Trump’s decision to agree to a meeting was a misstep because it gave Democrats fodder to paint Trump as the one refusing to negotiate.\n\n“Trump is literally boycotting meeting with Democrats to find a solution,” Sen. Chris Murphy, D-Conn., wrote on the social media site X before Trump reversed course again and agreed to meet with the leadership. “There is no one to blame but him. He wants a shut down.”\n\nIt was not immediately clear what led Trump over the weekend to take a meeting he had once refused. Schumer spoke privately with Thune on Friday, pushing the majority leader to get a meeting with the president scheduled because of the approaching funding deadline, according to a Schumer aide. A Thune spokesman said in response that Schumer was “clearly getting nervous.”\n\nAnother reason why Democrats suspect Trump would be fine with a shutdown is how his budget office would approach a closure should one happen.\n\nThe administration’s strategy was laid out in an Office of Management and Budget memo last week that said agencies should consider a reduction in force for federal programs whose funding would lapse, are not otherwise funded and are “not consistent” with the president’s priorities. A reduction in force would not only lay off employees but also eliminate their positions, triggering yet another massive upheaval in the federal workforce.\n\nJeffries argued that Trump and his top aides were using the “smoke screen of a government shutdown caused by them to do more damage.”\n\nAP Congressional Correspondent Lisa Mascaro and Associated Press writer Mary Clare Jalonick contributed to this report.","summary":"The Republican president has indicated he's not willing to compromise with Democrats.","url":"https://www.bostonherald.com/2025/09/29/trump-shutdown-blame-game/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Trump_69664-1.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-29 23:52:09","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.101},{"id":364659278,"title":"Will a Shutdown Finally Shrink Government?","text":"This week, editors Peter Suderman, Katherine Mangu-Ward, Nick Gillespie, and Matt Welch discuss whether the impending government shutdown will actually rein in the federal bureaucracy. They consider whether there is anything to gain from a shutdown, how past shutdowns have played out, and whether the risk of growing executive power outweighs the risk of uncontrolled spending.\n\nThey also examine the indictment of former FBI Director James Comey and whether it's about retribution or substance, President Donald Trump's deployment of federal troops to Portland, and New York Mayor Eric Adams' decision to exit the mayoral race. A listener question prompts a conversation about cyclical theories of history and whether frameworks like The Fourth Turning help explain our current moment or merely provide the illusion of clarity.\n\n0:00—Shutdown showdown and shrinking the government\n\n9:24—Russell Vought and the growth of executive power\n\n25:34—James Comey faces an indictment\n\n31:38—Eric Adams drops out of NYC mayoral race\n\n40:42—Listener question on cyclical frameworks in history\n\n48:06—Trump sends federal police to Portland\n\n56:30—Weekly cultural recommendations\n\nMentioned in This Podcast\n\n\"Government Set To Shut Down Tomorrow,\" by Liz Wolfe\n\n\"The American New Right Looks Like the European Old Right,\" by Jack Nicastro and Phillip W. Magness\n\n\"How GOP Fiscal Sanity Died, in 7 Easy Steps,\" by Matt Welch\n\n\"Shutdown Highlights Basic Fact: Most of Government is 'Non-Essential',\" by Nick Gillespie\n\n\"The Libertarian Case for Postmodernism,\" by Nick Gillespie\n\n\"In Trump's Tussle With James Comey, You Should Hope Everybody Loses,\" by J.D. Tuccille\n\n\"Trump's Public Comments Could Further Complicate the Shaky Case Against James Comey,\" by Jacob Sullum\n\n\"Kash Patel Tellingly Ties James Comey's Indictment to the Legally Unrelated 'Russiagate Hoax,'\" by Jacob Sullum\n\n\"The Deep-State Liars of the #Resistance,\" by Matt Welch\n\n\"What Does It Mean for Trump To Designate Antifa a 'Terrorist Organization'?\" by Matthew Petti\n\n\"The Tom Cotton Do-Over,\" by Matt Welch\n\n\"The Dream of the '90s Died in Portland,\" by Nancy Rommelmann\n\n\"Assata Shakur Stood With the Oppressors,\" by Billy Binion\n\nr/NYC on Reddit: \"Eric Adams wore this custom made robe to a Rosh Hashanah service in Brooklyn yesterday.\"\n\nUpcoming Reason Events\n\n\"Is mass immigration good for America?\" Join us for a Reason Versus live debate on October 2 in Washington, D.C.\n\nToday's Sponsor:\n\nYou believe in limited government and support organizations that champion the ideals of a free society. But have you ensured that your charitable giving will leave a lasting legacy of liberty? Without a plan in place, your charitable legacy could fade—or worse, be redirected to causes that don't align with your values. At DonorsTrust, they help you secure your philanthropic vision for the long term. With a donor-advised fund, you can ensure that the groups you care about continue to receive support, even beyond your lifetime. And unlike other donor-advised funds, DonorsTrust respects your libertarian principles and ensures your charitable capital remains committed to advancing individual liberty. Your giving should reflect your values—not just today, but for years to come. Your Vision. Your Values. Your Impact. Go to http://DonorsTrust.org/Reason to ensure your philanthropy continues to champion liberty for generations to come.\n\nProducer: Paul AlexanderVideo Editor: Ian Keyser","summary":"Plus: the Comey indictment, Trump deploys the National Guard to Portland, Eric Adams exits New York City's mayoral race, and a listener asks about cyclical theories of history","url":"https://reason.com/podcast/2025/09/29/will-a-shutdown-finally-shrink-government/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/09/9-29-25-v3-b.png","video":null,"publish_date":"2025-09-29 23:51:38","author":"Katherine Mangu-Ward,Matt Welch,Nick Gillespie,Peter Suderman","authors":["Katherine Mangu-Ward","Matt Welch","Nick Gillespie","Peter Suderman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.076},{"id":364660700,"title":"Paul Finebaum: ESPN ‘killed’ my 2019 interview with President Trump","text":"SEC Network host Paul Finebaum revealed in a new interview that ESPN “killed” a planned interview with President Donald Trump in 2019. \n\nFinebaum told Outkick’s Clay Travis, in an interview set to be released in full on Tuesday, and it was supposed to happen the week of the 2019 college football game between LSU and Alabama.\n\nThe college football talk show host explained that because of the magnitude of the game and the fact that “College GameDay” would be on site compelled his show’s producer to tell Finebaum that they needed to “do something big.” \n\nThat led Finebaum to reach out to a friend in Washington D.C. and that person helped get the ball rolling on a potential interview with the president, who was in the middle of his first term. \n\nFinebaum said the interview had been expected to take place at the White House that Thursday morning, but when he told his bosses the plan, they shut him down. \n\n“I called my boss, and they killed it,” Finebaum solemnly told Travis. “I was devastated. They told me that we’re not allowed to mix politics with football.” \n\nTrump was planning on attending the LSU-Alabama game that year, which he did, and Finebaum said that the motivation for the interview had nothing to do with politics. \n\n“It was just about the idea of going to the White House to interview the President of the United States,” he said. “And it wasn’t about politics, it was about, you’re coming to a football game. The biggest game of the year in college football, and I never exactly knew where the kill button came from, but it didn’t happen. \n\nThe interview was already making headlines on Monday when a clip was released of Finebaum saying that he is “considering” leaving ESPN, which owns SEC Network, to run for Senate in Alabama on the Republican ticket. \n\nFinebaum revealed that he is a registered Republican and that he voted for Trump previously, while also saying that “one or two” people down in Washington had “reached out” to determine his interest in politics. \n\nThe SEC Network host also said that the assassination of Charlie Kirk had fueled his desire to get involved.","summary":"SEC Network host Paul Finebaum revealed in a new interview that ESPN “killed” a planned interview with President Donald Trump in 2019. ","url":"https://nypost.com/2025/09/29/sports/paul-finebaum-espn-killed-2019-interview-with-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-hh93lp6su-1759188660861.jpg?quality=75&strip=all&1759174302&w=1200","video":null,"publish_date":"2025-09-29 23:49:58","author":"Christian Arnold","authors":["Christian Arnold"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.203},{"id":364656564,"title":"Trump and Democrats end meeting without a deal as government shutdown looms","text":"Why the US government might shut down and what to know\n\nThose are the negotiating positions of both sides, but government shutdown fights are about more than policy – they're about politics.\n\nRepublicans think they have the political high ground. \n\nThe party that makes demands in exchange for keeping the government open – in this case the Democrats – typically gets the lion's share of the blame when a shutdown happens.\n\nTrump and Republican congressional leaders are already claiming that they are the reasonable ones. \n\nThey're the ones, they say, who simply want to buy more time to negotiate without the adverse consequences of a shutdown.\n\n\"You don't put a gun to the American people's head and say, 'Unless you do exactly what Senate and House Democrats want you to do, we're going to shut down your government',\" Vice-President JD Vance told reporters outside the White House.\n\nOf course, Democrats don't see it that way. \n\nThey believe healthcare is a winning issue for them, so they want the debate to be on whether millions of Americans will lose the ability to afford medical insurance. \n\nTemporarily funding the government for seven weeks, in their view, just moves that subsidy deadline closer without any appreciable progress.\n\nComplicating all this for Democrats is the reality that many Republicans seem at peace with an extended government closure.\n\nWhite House budget chief Russ Vought recently circulated a memorandum explaining how the Trump administration would use a shutdown to make new, long-term reductions in federal spending and employment rolls.\n\nPositions and government programmes deemed \"nonessential\" during the closure will be permanently shuttered – an expansion of the Department of Government Efficiency (Doge) cuts from earlier this year.\n\nBut Democratic leaders seem to believe the threats are a bluff or a negotiating tactic. \n\nSenate Minority Leader Chuck Schumer called it \"an attempt at intimidation\".\n\n\"Donald Trump has been firing federal workers since day one - not to govern, but to scare,\" Schumer said. \"This is nothing new and has nothing to do with funding the government.\"\n\nSchumer and his fellow Democratic congressional leaders are also under intense pressure from their political base to hold fast in the face of Republican attacks. \n\nIn March, Senate Democrats faced withering criticism from within their own party for reaching a six-month spending agreement with Republicans even as Trump was in the midst of his Doge budget-slashing campaign.\n\nThis time around, Democrats may feel compelled to trigger a shutdown to demonstrate their resolve.\n\nIn the end, however, a shutdown fight is a test of wills. It's a test of which side is best able to tolerate political pain.\n\nDemocrats may see a benefit to fighting Republicans, but will they be willing to stand aside as cherished federal programmes and government services – including those for low-income Americans – are shuttered?\n\nRepublicans may talk tough about slashing government, but as the incumbent party they could have the most to lose if the public mood dramatically sours.\n\nThe most recent government shutdown, during Trump's first term, lasted 35 days, setting a record as the longest in American history. \n\nAlthough the fight was over spending on the president's proposed US-Mexico border wall, it ended because federal air traffic controllers – who were working without pay – began staying home, threatening massive disruption to US air travel.\n\nShutdowns can be unpredictable. And while both sides seem to be itching for a fight, there's no telling when, or how, this fight will end.","url":"https://www.bbc.com/news/articles/c2kn3n315lko","image":"https://ichef.bbci.co.uk/news/1024/branded_news/4382/live/47d00c30-9d8a-11f0-92db-77261a15b9d2.jpg","video":null,"publish_date":"2025-09-29 23:49:10","author":"Anthony Zurcher","authors":["Anthony Zurcher"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.096},{"id":364658364,"title":"Alphabet will pay $22 million to settle President Trump’s YouTube lawsuit","text":"Alphabet will pay President Donald Trump $22 million as part of a settlement in a class action lawsuit brought against the company over the suspension of various YouTube accounts following the January 6 riot at the US capital, as first reported by the Wall Street Journal. The suit includes other plaintiffs whose YouTube channels were banned that will split an additional $2.5 million in settlement payouts.\n\nTrump filed the suit in 2021, alongside lawsuits against Twitter and Facebook over similar suspensions, claiming they infringed on his first amendment rights. Twitter, now known as X since its acquisition and rebrand by Elon Musk, paid President Trump roughly $10 million to settle that suit. Meta also settled its suit with the president over his suspension from the platform for $25 million earlier this year.\n\nThis settlement comes shortly after Alphabet wrote a letter to the House Judiciary Committee lambasting government pressure to moderate content on its platforms. The company also shared that YouTube would be offering a path to reinstatement for accounts previously banned for COVID-19 or election integrity related misinformation.\n\nThe settlement from Alphabet will be paid to the Trust for the National Mall, a nonprofit partner of the National Park Service, and will be earmarked for construction of the ballroom that President Trump is building at The White House. The monies from the Meta settlement were similarly earmarked.\n\nThis summer Paramount, parent company of CBS, settled a lawsuit brought by the president over claims that the network intended to \"confuse, deceive and mislead the public\" by editing an interview with Kamala Harris. The media company paid $16 million to settle the president’s suit. Three weeks later the FCC approved the $8 billion acquisition of Paramount by Skydance.","summary":"Alphabet will pay President Donald Trump $22 million as part of a settlement in a class action lawsuit brought against the company over the suspension of various YouTube accounts following the January 6 riot at the US capital, as first reported by the Wall Street Journal. The suit includes other plaintiffs whose YouTube channels were banned that will split an additional $2.5 million in settlement payouts.\n\n\nTrump filed the suit in 2021, alongside lawsuits against Twitter and Facebook over similar suspensions, claiming they infringed on his first amendment rights. Twitter, now known as X since its acquisition and rebrand by Elon Musk, paid President Trump roughly $10 million to settle that suit. Meta also settled its suit with the president over his suspension from the platform for $25 million earlier this year.\n\n\nThis settlement comes shortly after Alphabet wrote a letter to the House Judiciary Committee lambasting government pressure to moderate content on its platforms. The company also shared that YouTube ","url":"https://www.engadget.com/big-tech/alphabet-will-pay-22-million-to-settle-president-trumps-youtube-lawsuit-234611643.html?src=rss","image":"https://s.yimg.com/ny/api/res/1.2/b2pVP9MkaXdhLnOMDWlfgw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAw/https://s.yimg.com/os/creatr-uploaded-images/2025-01/f18fc9e0-d8b4-11ef-b739-c54806be6b24","video":null,"publish_date":"2025-09-29 23:46:11","author":"Andre Revilla","authors":["Andre Revilla"],"language":"en","category":"politics","source_country":"US","sentiment":-0.281},{"id":364656828,"title":"Snap verdict: Connolly will be pleased, Gavin had his Weetabix and Humphreys seemed nervous","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nConnolly, Humphreys and Gavin pictured tonight.Sasko Lazarov/RollingNews.ie\n\ndebate stage\n\nSnap verdict: Connolly will be pleased, Gavin had his Weetabix and Humphreys seemed nervous\n\nWhat did we learn in the first presidential debate? \n\n12.45am, 30 Sep 2025\n\nShare options\n\nFIRST CONTACT AMONG the candidates in the presidential election of 2025 is in the books. \n\nAfter a month of debate about who’d get on the ballot, the official candidates first get to Ballymount as Virgin Media gathered them together in the same room. \n\nIn order of where they sat left to right, Catherine Connolly, Heather Humphreys and Jim Gavin all set out their stall and debated all manner of topics. Some of which even related to the presidency. \n\nSo, what did we learn about the candidates? \n\nMuch of the talk ahead of tonight was that Fianna Fáil’s big gamble of picking a political novice in the form of Gavin needed to be justified on the debate stage. \n\nOn the trail so far, Gavin has seemed rather more meek than one would expect from a former Defence Forces officer and Dublin GAA manager. \n\nThe pressure was on to dial up the energy and he seemed to have got the message when he challenged Connolly early on about her comments on European militarism. \n\nGavin has been trying to talk up that, at 54, he sees himself as a young man and the Weetabix certainly seemed to have lasted into the evening as he presented a confident figure. \n\nThe energy also seemed to extend to his hands, which were moving like a conductor’s baton for much of the evening.\n\nCriticisms of Gavin have also honed in on accusations that he’s sounded a bit PR-driven. It’s a trap he fell into again when asked about the use of Irish flags by anti-immigrant groups.\n\nAdvertisement\n\nDodging the question, he said that when people raise the flag they’re “speaking to inclusion and equality”. \n\nOn the same question, Connolly at least called it for what it is, saying there are people who use the flag to sow division and claim “the country is full”. Something which she said was “abhorrent”. \n\nOverall, Connolly probably had the strongest night of the three candidates. Whether one agrees with her politics, she probably did the best job at articulating her principles and was largely unfazed by the glare of the studio. \n\nIf she fell down, it was probably in not being nuanced enough at some points. Being against growing military spending is one thing, but using the phrase “military industrial complex” on five occasions is probably too many. \n\nHowever, Connolly gave a two-minute answer on the housing crisis that any opposition leader would gladly repeat in a general election debate. Setting out her stall, as if it was needed, as the only non-government candidate in the race. \n\nOn the other hand, decade-long former Fine Gael minister Humphreys has the difficulty of being the most government candidate in the race and therefore must defend a record the others do not. \n\nOne of her low points in this regard was saying that successive housing ministers “really, really tried, they did their best”. \n\nHumphreys skills are more interpersonal than televisual and it’s long been said that debates would not be her strongest suit. This did appear to be the case for periods as she appeared to be the most nervous of the three candidates. \n\nHer best moment was probably one-minute pitch up top, in which she was strong at selling the importance of motherhood. A pitch that we’ve heard a lot in from one would-be candidate that didn’t make the race. \n\nCalling herself “a daughter, a mother and a grandmother”, Humphreys emphasised the “quiet strength of women” and asked the public to put their trust in her. \n\nWe shall see. There are just over three weeks to go.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nRónán Duffy\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Snap verdict: Connolly will be pleased, Gavin had his Weetabix and Humphreys seemed nervous”.\n\nRecipient's Email\n\nFeedback on “Snap verdict: Connolly will be pleased, Gavin had his Weetabix and Humphreys seemed nervous”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\ndebate stage\nRace for the Áras\n\nNews in 60 seconds\n\nScam agencies are tricking migrant nurses and Government departments in visa fraud schemes\n\nEimer McAuley\n\n47 mins ago\n\nThree Áras hopefuls talk defence, Gaza and immigration in first TV debate\n\n52 mins ago\n\nÁras hopefuls\nPlayer Ratings: How did the presidential candidates perform in the first TV debate? \n\nCreeslough investigation file forwarded to Director of Public Prosecutions\n\nLawyer for suspect in Charlie Kirk killing wants more time to review evidence\n\nKildare County Council\nShay Given's plans for €4m padel centre in Kildare halted by council\n\nDonald Trump unveils plan for peace in Gaza - with a job for Tony Blair\n\nMan in his 30s arrested after three adults found dead at a home in Louth this morning\n\nTallanstown\nThree family members killed in Louth home named locally\n\nThree Áras hopefuls talk defence, Gaza and immigration in first TV debate\n\n52 mins ago\n\nRory McIlroy criticises fan behaviour as video shows his wife Erica being hit by beer cup\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"What did we learn in the first presidential debate?","url":"https://www.thejournal.ie/virgin-media-presidential-debate-6830771-Sep2025/","image":"https://img2.thejournal.ie/article/6830771/river/?height=400&version=6830853","video":null,"publish_date":"2025-09-29 23:45:07","author":null,"language":"en","source_country":"ie","sentiment":0.277},{"id":364661184,"title":"Eight nations back Trump's Gaza peace plan","text":"Washington DC [US], September 30 (ANI): Eight Arab and Muslim nations on Tuesday issued a joint statement welcoming US President Donald Trump’s proposals to end the Gaza conflict and prevent the displacement of Palestinians.The foreign ministers of Qatar, Jordan, the United Arab Emirates, Indonesia, Pakistan, Turkey, Saudi Arabia, and Egypt expressed confidence in US President Trump’s “leadership and sincere efforts” to find a path to peace in the region.The ministers welcomed the US president’s announcement of a comprehensive plan to end the conflict, rebuild Gaza, and advance peace in the Middle East. They also praised his commitment to block any Israeli annexation of the West Bank.In their statement, the ministers affirmed their “readiness to engage positively and constructively” with the United States and other parties to finalise and implement the agreement.They emphasised the importance of their partnership with Washington in securing regional peace and stability. The eight nations outlined their vision for a comprehensive deal, which includes: Unrestricted delivery of humanitarian aid to Gaza, Prevention of Palestinian displacement, Release of hostages, Security guarantees for all parties, Full Israeli withdrawal from Gaza, Reconstruction of the Gaza Strip and Integration of Gaza with the West BankThe ministers stressed that any lasting solution must be based on a two-state framework, in which Gaza is “fully integrated with the West Bank in a Palestinian state in accordance with international law.”They described this approach as essential to achieving long-term regional stability and security. Earlier, White House on Monday (local time) released a peace plan to end the two-year-old Gaza conflict following a meeting between US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu. The peace plan included that Gaza will be a deradicalised, terror-free zone that does not pose a threat to its neighbours and will be redeveloped for the benefit of the people of Gaza, who have suffered more than enough.The peace plan stated that If both sides agree to this proposal, the war will immediately end. Israeli forces will withdraw to the agreed upon line to prepare for a hostage release. During this time, all military operations, including aerial and artillery bombardment, will be suspended, and battle lines will remain frozen until conditions are met for the complete staged withdrawal.The peace plans further stated that within 72 hours of Israel publicly accepting this agreement, all hostages, alive and deceased, will be returned.Once all hostages are released, Israel will release 250 life sentence prisoners plus 1700 Gazans who were detained after October 7th 2023, including all women and children detained in that context. For every Israeli hostage whose remains are released, Israel will release the remains of 15 deceased Gazans.The point plan states that once all hostages are returned, Hamas members who commit to peaceful co-existence and to decommission their weapons will be given amnesty. Members of Hamas who wish to leave Gaza will be provided safe passage to receiving countries.Upon acceptance of this agreement, full aid will be immediately sent into the Gaza Strip. At a minimum, aid quantities will be consistent with what was included in the January 19, 2025, agreement regarding humanitarian aid, including rehabilitation of infrastructure (water, electricity, sewage), rehabilitation of hospitals and bakeries, and entry of necessary equipment to remove rubble and open roads. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/eight-nations-back-trumps-gaza-peace-plan-9604789.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-09-29 23:45:01","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.172},{"id":364664318,"title":"YouTube agrees to pay $24.5 million to settle Trump lawsuit: Court filing","text":"YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump and other plaintiffs after he was suspended from the platform in 2021, according to a court filing.\n\nAccording to the filing, $22 million will be used to support Trump’s construction of a White House State Ballroom and will be held in a tax-exempt entity called the Trust for the National Mall.\n\nAnother $2.5 million will go to the other plaintiffs in the lawsuit -- including the American Conservative Union, Andrew Baggiani, Austen Fletcher, Maryse Veronica Jean-Louis, Frank Valentine, Kelly Victory and Naomi Wolf -- according to the filing.\n\n\"This Notice of Settlement and Stipulation of Dismissal shall not constitute an admission of liability or fault on the part of the Defendants or their agents, servants, or employees, and is entered into by all Parties for the sole purpose of compromising disputed claims and avoiding the expenses and risks of further litigation,\" the filing stated.\n\nA spokesperson for Google, which owns YouTube, referred ABC News to the notice of settlement when contacted for comment on Monday.\n\nYouTube suspended Trump's account following the Jan. 6, 2021, attack on the U.S. Capitol, saying at the time that an uploaded video violated its policy for inciting violence. It restored Trump's channel more than two years later, citing that voters could \"hear equally from major national candidates in the run-up to an election.\"\n\nTrump's lawsuit alleged that YouTube prevented him from \"exercising his constitutional right of free speech\" by banning him indefinitely from the platform.\n\nYouTube is the latest social media company to agree to settle with Trump this year over the suspension of his accounts following the Jan. 6 attack on the Capitol.\n\nIn January, Meta agreed to settle with Trump by making a donation of $22 million to his presidential library and paying $3 million in legal fees, according to a letter from Meta's attorneys.\n\nIn February, X agreed to pay about $10 million to settle a lawsuit brought by Trump, the Wall Street Journal reported.\n\nThis is a developing story. Please check back for updates.","summary":"YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump after he was suspended from the platform in 2021, a court filing shows.","url":"https://abcnews.go.com/Politics/youtube-agrees-pay-245-million-settle-trump-lawsuit/story?id=126057907","image":"https://i.abcnewsfe.com/a/bba745af-9191-40a1-806b-3898a463d566/youtube-gty-er-250929_1759184045168_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-29 23:45:00","author":"Meredith Deliso,Peter Charalambous","authors":["Meredith Deliso","Peter Charalambous"],"language":"en","category":"politics","source_country":"us","sentiment":-0.382},{"id":364665896,"title":"'Shazam' Star Zachary Levi: '25% Of A-Listers Voted For Trump'","text":"Hollywood star and noted Donald Trump supporter, Zachari Levi, joined Sage Steele on her weekly podcast to chat with the former ESPN anchor about life as a conservative in Hollywood. I would implore you to listen to the whole show, but there was a point in the middle of this week's episode that really stood out to me. In it, Steele and Levi were discussing why there is a stigma to voting Republican as a celebrity when the podcast host pressed him to give her a percentage of A-list actors who ended up privately supporting Trump in the 2024 election. The answer made my jaw drop, so take a look at what he had to say. Wow! 25% is an insane number when you think about it. That means for every movie you see in theaters where the actors go on press tours and make ludicrously woke statements, one in four of them is secretly pulling the lever for Trump. Do I believe Levi? Well, yes, and not just because he played the titular character in Chuck, which was a phenomenal show, and you should totally go binge as soon as you are done reading this. I believe him because I just find it so hard to believe that ALL the actors in Hollywood are so brainwashed that they can't free themselves from the leftist cult that is the entertainment industry. I'm sure some of you reading this work for a company where you are surrounded by liberals, and you wouldn't dare let them in on the dirty little secret that is your political affiliation. Personally, I was a social media manager for a major university in Texas for two years, and I went out of my way to avoid any and all political discourse, knowing the sea of blue I was surrounded by. But my silence must have perked the ears of other closeted conservatives, because on more than one occasion, I had a coworker whom I thought was a liberal approach me about how far to the left many of our colleagues were. My point is that if it happens at liberal arts universities, there's a good chance Levi was approached by some of his \"coworkers\" as well. As for his comments about RFK Jr., or \"Bobby,\" as Levi calls him, I find that very interesting. I know there are some people on the right who have grown tired of Kennedy's antics, but we should also laud the strategic move by Trump to align himself with the likes of RFK, Elon, and Tulsi Gabbard. It very well could have been the difference in securing enough votes from the \"politically homeless\" to swing the election his way. Those are just my thoughts, but what do you think? Is Hollywood crawling with a bunch of secretly red-pilled actors? Or is Levi blowing hot air? And do you hide your true political beliefs at work? Email me at austin.perry@outkick.com and let me know.","summary":"Zachary Levi and Sage Steele discussed what it&apos;s like being a Hollywood conservative and how many A-listers secretly voted for Donald Trump.","url":"https://www.outkick.com/culture/shazam-star-zachary-levi-25-a-listers-voted-trump","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/10/gettyimages-2162333805.jpg","video":null,"publish_date":"2025-09-29 23:41:11","author":"Austin Perry","authors":["Austin Perry"],"language":"en","category":"politics","source_country":"us","sentiment":0.069},{"id":364662618,"title":"YouTube to pay $24.5M to settle Trump account suspension suit","text":"Alphabet-owned YouTube has agreed to pay $24.5 million to settle a lawsuit that President Donald Trump brought against the company over the suspension of his account following the January 2021 U.S. Capitol riots, a court filing showed today.\n\nThe deal makes Google the last of the three big tech companies to resolve lawsuits Trump brought in July 2021, accusing them of unlawfully silencing conservative viewpoints.\n\nTrump had also sued Twitter, now known as X, and Facebook owner Meta, as well as Alphabet’s Google, and their chief executives in July 2021.\n\nMeta and X agreed earlier this year to pay to settle the lawsuits.\n\nUnder the YouTube settlement, $22 million will be paid on Trump’s behalf to the Trust for the National Mall, a nonprofit that the filing says is dedicated to the construction of a $200 million ballroom that Trump is building at the White House.\n\nWork on the 90,000-square-foot (8361.27 square meters) facility is expected to be completed “long before” Trump’s four-year term ends in January 2029.\n\nThe remaining amount will go to other plaintiffs in the case, including the American Conservative Union, which sponsors the Conservative Political Action Conference, and U.S. author Naomi Wolf.\n\nYouTube did not admit wrongdoing and will not make product or policy changes under the settlement.\n\nTrump did not lose his YouTube account in 2021 but was suspended from uploading new videos; it was restored in 2023.\n\nIn January, Meta agreed to pay about $25 million and X paid about $10 million in February to settle similar lawsuits by Trump.\n\nMeta’s settlement designated $22 million for a fund for Trump’s upcoming presidential library in Miami, Florida.","summary":"Alphabet-owned YouTube has agreed to pay $24.5 million to settle a lawsuit that President Donald Trump brought against the company over the suspension of his account following the January 2021 U.S. Capitol riots, a court filing showed today.","url":"https://www.staradvertiser.com/2025/09/29/breaking-news/youtube-to-pay-24-5m-to-settle-trump-account-suspension-suit/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/09/web1_2025-09-29T212934Z_1963493722_RC2WPGAUKSF3_RTRMADP_3_USA-TRUMP-YOUTUBE.JPG","video":null,"publish_date":"2025-09-29 23:40:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.358},{"id":364666006,"title":"‘All about his family’: Stunned ice fishing buddies of Michigan church shooter left in disbelief","text":"After Thomas Jacob Sanford rammed his pickup into the front doors of the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, he allegedly aimed an assault-style rifle at the worshippers inside, killing four people and wounding eight others.\n\nA Marine Corps veteran who served in Iraq, Sanford, 40, then set fire to the structure, according to authorities. As terrified parishioners tried to escape the blaze, Sanford was killed at the scene by police.\n\nRetiree Lori Farmer, who lives nearby with husband Ron, told The Independent that she was “shocked” when she heard Sanford identified as the shooter. Farmer and her husband, who worked with Sanford, are “still reeling,” she said.\n\n“He was a good guy,” Farmer said. “All about his family.”\n\nSanford, who met her husband while driving a truck for Coca-Cola, had gone ice fishing with the couple, and once helped them remove a big spruce tree from their property, according to Farmer. Sanford and his wife, who was part of the LDS church, had a son with special needs; Sanford reportedly had gotten his tattoos removed so he could participate in LDS ceremonies.\n\nFarmer told The Independent that Ron’s “mind is blown” over the whole thing. She said he talked with Sanford every morning when they worked together, and described Sanford as a hard worker who held down a couple of other jobs at the same time. \n\nRon, who declined to be interviewed, “really liked [Sanford] and counted him as one of his good buddies,” Farmer said. “Never saw this coming. But, he mentioned he heard he suffered from PTSD. Maybe [it] hit him more as of late?”\n\nReached by phone Monday, Sanford’s relatives said they were also at a loss as to what might have led to the seemingly random bloodshed. \n\n“At this point, I don’t know nothing,” Jeffrey Sanford, 57, told The Independent. “I guess I’ll leave it at that. It’s very tragic for everybody, all the families. Including ours.”\n\nJim Sanford Jr. said simply: “Our thoughts are with the victims and their families. We’re going to let the police do their due diligence and we’re just asking for privacy right now.”\n\nPolice have not yet established a motive but Burton, Michigan city council candidate Kris Johns told journalist Dave Bondy that he crossed paths with Sanford last week while canvassing. Sanford at first seemed pleasant enough, according to Johns, who said things soon took a disturbing turn.\n\n“We just started to talk, and after a short while the conversation went to the Church of Latter-day Saints,” Johns said. “He made the position multiple times that Mormons are the anti-Christ.”\n\nYet, Johns emphasized: “It wasn’t anything I thought I needed to call police about. You hear all kinds of views these days. Nothing about it suggested he was going to hurt anyone.”\n\nHospital officials said they treated eight victims, ages six to 78. Five of them suffered gunshot wounds, and three were treated for smoke inhalation. Police also reportedly discovered IEDs, or improvised explosive devices, on the scene.\n\nIn response to Sunday’s massacre, certified firearms instructor Ryan Swartz, a former deputy sheriff in Huron County, is offering free training to church leaders and ushers who wish to be armed at the pulpit.\n\n“I usually charge $80, you have to take an 8-hour safety class and go through a background check [to get licensed in Michigan],” Swartz told The Independent. “I said, ‘You know what, it’s sad that we live in a society like this right now, where shootings are all too common. If I can help out, and it’ll deter someone from entering a church and trying to cause harm, I just thought it was the right thing to do.”\n\nUnder Michigan law, churches are considered “gun-free zones” unless church leadership grants permission.\n\nOn Monday, Sanford’s father, Thomas told the Detroit Free Press that he felt “terrible about all the families that have been hurt and they’re under the same crap that I’m going under, that my wife and I are going under. I apologize for that.”\n\nHe said he was glad that his son “came back in one piece” from his military service, which spanned from 2004 to 2008.\n\n“He was in logistics,” Thomas Sanford said. “He drove a wrecker and went out and picked up vehicles. One time, he was under fire but most of the time he was fine.”\n\nSanford “loved the United States; he loved his family,” according to his dad. “He was a good man. He was a family man… The only thing I can say is that it was my son that did it. As far as why? Irrelevant. It happened. We’re dealing with it. It’s been a nightmare.”\n\nPresident Donald Trump has blamed a recent rise in political violence solely on the “radical left.” However, photos on social media accounts show Sanford clad in MAGA merchandise, including a T-shirt reading: “Trump 2020: Make liberals cry again.” In Google Maps images from this June of Sanford’s home in the town of Burton, a Trump-Vance sign can be seen on the fence. \n\nSanford is not registered with any political party, according to public records.\n\nSunday’s shooting was the 324th mass shooting of 2025, according to the Gun Violence Archive.","summary":"Exclusive: One former acquaintance called Thomas Jacob Sanford a ‘good guy,’ saying she and her husband, who worked with the late suspect, were ‘shocked’ to hear his name on the news","url":"https://www.independent.co.uk/news/world/americas/michigan-lds-church-shooting-coworker-fishing-buddy-b2836177.html","image":"https://static.independent.co.uk/2025/09/29/9/45/70236643_2552937181429958_7301638316678447104_n.jpeg?crop=2047.5,1365,x0.3,y0&trim=0,0,0,0&width=1200","video":"https://cdn.jwplayer.com/videos/QkCHLNzR-4VHSaSK0.mp4","publish_date":"2025-09-29 23:38:54","author":"Justin Rohrlich","authors":["Justin Rohrlich"],"language":"en","source_country":"gb","sentiment":-0.243},{"id":364660372,"title":"Urban Warfare Expert: Trump’s 20-Point Gaza Plan Is ‘Most Comprehensive’ Path to Peace, Security","text":"Retired United States Army Major John Spencer, one of the world’s leading experts on urban and subterranean warfare, declared Monday that President Donald Trump’s newly unveiled 20-point peace plan for Gaza represents “the most comprehensive proposal put forward to date for both ending the war and setting durable conditions for peace.”\n\nAt the White House, President Trump and Israeli Prime Minister Benjamin Netanyahu unveiled the framework, with Trump calling it “a big, big day” and saying it reaches beyond Gaza toward “peace in the Middle East.” Netanyahu praised Trump as “the greatest friend that Israel has ever had in the White House — and it’s not even close.”\n\nSpencer — chair of urban warfare studies at West Point’s Modern War Institute (MWI) — wrote on X later Monday, “In my view, the 20-point plan is the most comprehensive proposal put forward to date for both ending the war and setting durable conditions for peace.” He said the blueprint directly meets Israel’s war aims, writing, “It directly achieves Israel’s objectives in the campaign against Hamas: the immediate release of all hostages, the demilitarization and deradicalization of Gaza, the establishment of a Hamas-free governing structure, and long-term security assurances for Israel.”\n\nHe drew a line between process and outcome. “What sets this plan apart is that it also offers a genuine path to peace, grounded in conditions that reflect realities on the ground,” Spencer wrote, adding that it “directly addresses the real concerns of the Palestinian people, including assurances against forced displacement, a clear path forward for governance, and international support for rebuilding.”\n\nThe urban warfare expert said implementation is built around concrete guardrails: “The plan envisions coexistence tied to tangible steps, an external panel to oversee reconstruction, and the exclusion of the Palestinian Authority until it completes a meaningful reform program.”\n\nOn security, Spencer called the architecture decisive. “Crucially, the plan secures at least some level of buy-in from Arab, Muslim, and international partners for the deployment of an international stabilization force in Gaza,” he wrote. “This provision removes the burden from the IDF to act as a long-term stabilizing presence and, more importantly, prevents Hamas from employing its central survival strategy of embedding itself within Gaza’s civilian population.”\n\nHe stressed the proposal is built for realities, not wish-casting. “Finally, unlike other proposals, the 20-point plan includes an explicit clause addressing the possibility of Hamas refusing all terms,” Spencer wrote. “This recognition of reality strengthens the plan’s credibility and makes it more resilient to the group’s well-known pattern of obstruction and rejectionism.”\n\nSpencer acknowledged there are still moving parts — but said the unknowns don’t undercut the core. “Yes, many questions remain. Who will sit on the proposed ‘Board of Peace’? What nations will contribute to the International Stabilization Force? Which regional partners will be tasked with ensuring that Hamas and its factions comply with their obligations? Who will validate that the Palestinian Authority has genuinely carried out reforms?” he wrote. “These uncertainties are real, but they do not diminish the plan’s significance. For all the questions it leaves open, the 20-point plan answers far more than any other proposal to date.”\n\nUnder the plan, acceptance would trigger the release of all remaining hostages within 72 hours, the disarmament of Hamas, and the group’s exit from governance. Members who renounce violence could receive amnesty to remain in Gaza or safe passage to third countries. If Hamas rejects the proposal, Israel would establish “terror-free” areas that would transfer from Israeli control to a temporary International Stabilization Force composed of Arab and other international partners. The framework also creates a Board of Peace, chaired by Trump, to oversee reconstruction and interim administration; Trump said Hamas would have “no role” in governance — “directly or indirectly.”\n\nAt the lecterns following their Oval Office meeting, both leaders made the enforcement stakes explicit if Hamas balks. Trump said, “Israel would have my full backing to finish the job of destroying the threat of Hamas, but I hope that we’re going to have a deal for peace. And if Hamas rejects the deal, which is always possible … as you know, Bibi, you’d have our full backing to do what you would have to do.”\n\nNetanyahu matched the tone. “If Hamas rejects your plan, Mr. President, or if they supposedly accept it and then basically do everything to counter it, then Israel will finish the job by itself. This can be done the easy way, or it can be done the hard way. But it will be done,” he said. “We’d prefer the easy way, but it has to be done. All these goals must be achieved because we didn’t fight this horrible fight, sacrifice the finest of our young men to have Hamas stay in Gaza and threaten us again and again and again with these horrific massacres.”\n\nNetanyahu added that if the international body succeeds in disarming Hamas, “we will have permanently ended the war.” Israel would tie withdrawals to the degree of disarmament and “remain in the security perimeter for the foreseeable future.”\n\nAs of Monday evening, Hamas had not publicly responded to the 20-point plan.\n\nJoshua Klein is a reporter for Breitbart News. Email him at jklein@breitbart.com. Follow him on Twitter @JoshuaKlein.","summary":"Retired United States Army Major John Spencer, one of the world’s leading experts on urban and subterranean warfare, declared Monday that President Donald Trump’s newly unveiled 20-point peace plan for Gaza represents “the most comprehensive proposal put forward to date for both ending the war and setting durable conditions for peace.”\n\n\nThe post Urban Warfare Expert: Trump’s 20-Point Gaza Plan Is ‘Most Comprehensive’ Path to Peace, Security appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/29/urban-warfare-expert-trumps-20-point-gaza-plan-is-most-comprehensive-path-to-peace-security/","image":"https://media.breitbart.com/media/2025/09/AP25272692040081-640x335.jpg","video":null,"publish_date":"2025-09-29 23:38:31","author":"Joshua Klein","authors":["Joshua Klein"],"language":"en","category":"politics","source_country":"US","sentiment":0.22},{"id":364666514,"title":"Picturesque suburb home to Trump golf resort sees housing market crash as unintended consequence of mass deportations","text":"A ritzy Florida suburb home to one of Donald Trump's golf resorts is facing a housing market crash as its large immigrant population flees the president's immigration crackdowns. \n\nDoral, a city of 80,000 residents about 25 miles northwest of Miami, has been experiencing an exodus of its Venezuelan immigrants which make up around 40 percent of its population. \n\nVenezuelans are abandoning Doral so quickly that locals say they are leaving behind furniture and skipping out on rent, with some said to be driving out at night to avoid encounters with federal agents. \n\nThe city is home to Trump National Doral Golf Club, a golf resort owned by the president where memberships cost up to $150,000. \n\nVacancy rates for Doral apartments have risen significantly as Trump's immigration crackdown has intensified, up from 5.6 percent late last year to 6.5 percent. \n\nThat's about 50 percent higher than the city's surrounding municipalities, which sit at 4.3 percent. Some buildings in the city are even seeing vacanies above 10 percent. \n\nLeasing agents have pointed the finger at the fleeing Venezuelan population. \n\n'They’re all telling me, \"No, I can’t stay, my [temporary status] is expiring,\"' Maria Eugenia Nucete, a Venezuelan-American real-estate agent who has worked in Doral for decades, told the Wall Street Journal. \n\nEven Venezuelans with temporary legal status are leaving, fearful of getting snatched by ICE agents as they carry out Trump's sweeping immigration crackdowns. \n\nSince retaking the White House in January, the administration has tried to strip Venezuelans of Temporary Protected Status and canceled Bidern-era humanitarian immigration programs that allowed hundreds of thousands to live and work in the US. \n\nThe whirlwind of policy changes regarding immigration since President Trump took office have taken away the legal status of many Doral residents, and left those who are still allowed to live and work there scared that they could be next. \n\nAs a result, those migrants are leaving in droves, with many opting to move back to Venezuela. \n\nThe republican mayor of Doral, Christi Fraga, said the city's rising vacancy has been caused by a mix of factors, but he admitted that fear of deportation is driving many. \n\nFraga said he personally knew of some families who 'self-deported,' because their legal status was vulnerable and 'they didn't want to be here illegally.' \n\n'I’m sure it will affect the housing market to a certain extent,' he added. \n\nApartment building owners in Doral have said they want to know a family's immigration status before they rent apartments to them, because if those families are under temporary permission to live in the US, they are just one court ruling from abrupt deportation. \n\nThe 1968 Fair Housing Act makes it illegal to discriminate against renters based on nationality or race, adding a layer of legal complexity to the decision of apartment owners to turn Venezuelans away from renting if they have temporary legal status. \n\nJuan Arias, director of market analytics at the data company CoStar Group, told the Wall Street Journal that 70 percent of immigrants who have come to the US since 2010 are renters. Their exodus therefore has a particularly powerful negative impact on the rental market. \n\n'All of this immigration crackdown is a net negative to the entire multifamily world,' Arias said. \n\nDoral's Venezuelan exodus comes as the Trump administration increases tensions with Venezeluan President Nicolás Maduro's regime. \n\nThe majority of voters in Doral are registered Republicans, and many Venezuelans living in the city supported Trump because they believed he would remove Maduro from power. \n\nVenezuelans who have been politically active against Maduro's regime while living in the US face serious risk of persecution if they are deported. \n\nThe risk for those people only increases as the Trump administration places itself on a war footing against Maduro, deploying destroyers off the coast of Venezuela and bombing drug smuggling ships, all while claiming the country is safe to return to. \n\n'They’re not seeing us as a community affected by political problems, but as a number of migrants who could be deported to fulfill an electoral promise,' José Antonio Colina, president of Venezuelans Persecuted in Political Exile, told El Pais. \n\n'The Venezuelan community that voted for Trump voted to remove Maduro from power, not to remove Venezuelans from the United States.","summary":"Venezuelans are abandoning Doral so quickly that locals say they are leaving behind furniture and skipping out on rent, with some said to be driving out at night to avoid ICE encounters.","url":"https://www.dailymail.co.uk/news/article-15146131/Florida-Doral-Trump-golf-resort-housing-crash.html","image":"https://i.dailymail.co.uk/1s/2025/09/30/00/102556555-0-image-a-12_1759187450474.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/16/1383025848093657427/1024x576_MP4_1383025848093657427.mp4","publish_date":"2025-09-29 23:38:18","author":"Editor,Eliot Force","authors":["Editor","Eliot Force"],"language":"en","source_country":"gb","sentiment":-0.101},{"id":364661752,"title":"The Simpsons 2 movie confirmed for 2027 theatrical release, iconic sitcom's sequel replaces marvel project — here’s what we know","text":"Disney has announced that a new The Simpsons movie will be released in theaters on July 23, 2027. This will be the second Simpsons movie, coming 20 years after the first one hit theaters in 2007. The news was confirmed by 20th Century Studios on Instagram with an image of Homer Simpson grabbing a pink donut shaped like the number “2.” The caption said, “Homer’s coming back for seconds.” On September 29, 20th Century Studios also posted the update on X and Instagram, writing: “Woohoo! The Simpsons are coming to theaters with an all-new movie on July 23, 2027!” The animated post showed Homer’s hand grabbing a donut decorated with the number “2” and the words: “Homer’s coming back for seconds”, as per the Parade report. Woohoo! The Simpsons are coming to theaters with an all-new movie on July 23, 2027! pic.twitter.com/wVqxwn8rLc— 20th Century Studios (@20thcentury) September 29, 2025 The Simpsons movie release date 2027The new release date actually takes the place of an untitled Marvel movie that Disney had originally scheduled. That Marvel project has now been removed. On the same day, Warner Bros. announced that its animated musical Bad Fairies will also release on July 23, 2027, making it a box-office clash, as stated by The Hollywood Reporter.The Simpsons movie sequel successPlot details for the new Simpsons movie have not been revealed yet, other than the playful tagline. The first Simpsons Movie in 2007 was a huge success, making $74 million in its opening weekend, $183 million in the U.S., and more than $536 million worldwide. The story of that movie followed the EPA trapping Springfield inside a dome after Homer polluted the town’s water supply. Kirk Honeycutt, a critic for The Hollywood Reporter, praised the 2007 film, saying the team “labored long and hard to make a movie that hearkens back to the vintage years of the series.” He also described it as “caustic, irreverent, constantly amusing and a tiny bit rude,” adding, “It’s almost — dare I say it — charming”, as per the report by The Hollywood Reporter. The Simpsons TV show first aired in December 1989 on Fox and has now launched its 37th season. The show was created by Matt Groening and developed with James L. Brooks and Sam Simon. The voice cast includes Dan Castellaneta as Homer, Julie Kavner as Marge, Nancy Cartwright as Bart, and Yeardley Smith as Lisa.Live EventsAs mentioned in the report by Parade, the series is the longest-running American primetime scripted show ever, with over 36 seasons and 790 episodes. Over the years, The Simpsons has become famous for predicting real-life events, including:Donald Trump becoming presidentThe correct Super Bowl winnersA tiger attacking Siegfried and RoyA submersible malfunctioning underwaterFAQsQ1. When is The Simpsons 2 movie coming out?The Simpsons 2 movie will be released in theaters on July 23, 2027, as announced by Disney and 20th Century Studios.Q2. What was the story of the first Simpsons movie?Add as a Reliable and Trusted News Source Add Now!\n The first Simpsons movie in 2007 showed Springfield trapped in a dome after Homer polluted the town’s water supply.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onthe simpsons movie sequelThe Simpsons 2 moviesimpsons movieThe Simpsons movie 2027 release dateSimpsons sequel 2027The Simpsons movie part 2Simpsons new movie July 2027Simpsons vs Marvel release dateThe Simpsons movie sequel newsSimpsons movie cast and release\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onthe simpsons movie sequelThe Simpsons 2 moviesimpsons movieThe Simpsons movie 2027 release dateSimpsons sequel 2027The Simpsons movie part 2Simpsons new movie July 2027Simpsons vs Marvel release dateThe Simpsons movie sequel newsSimpsons movie cast and release(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"A new The Simpsons movie is coming to theaters in 2027. Fans will see Homer, Marge, Bart, Lisa, and Maggie back on the big screen after many years. The film is set for July 23, 2027, and people are excited. The first Simpsons movie was a big success, and now a sequel is finally happening.","url":"https://economictimes.indiatimes.com/news/international/us/the-simpsons-2-movie-confirmed-for-2027-theatrical-release-iconic-sitcoms-sequel-replaces-marvel-project-heres-what-we-know/articleshow/124222915.cms","image":"https://img.etimg.com/thumb/msid-124222915,width-1200,height-630,imgsize-51974,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-09-29 23:35:25","author":"The Hollywood Reporter","authors":["The Hollywood Reporter"],"language":"en","category":"entertainment","source_country":"in","sentiment":0.145},{"id":364655710,"title":"Trump puts an ‘I’ in ‘peace plan’ as he touts ‘one of the greatest days in civilization’ and makes it all about him","text":"The president of the United States barely stopped to consider the possibility of failure on Monday as he touted his 20-point plan for peace in Gaza alongside Benjamin Netanyahu and centered himself in the spotlight he’d been chasing for months.\n\nSince the 2024 election the Republican twice-president has been publicly pining for his shot at ending a conflict between Israel and Hamas. \n\nTrump has spent almost the entire first eight months of his presidency coming up with different conflicts to “solve” in lieu of actually delivering on the two promises he made during the campaign: to end wars in Ukraine and Gaza. In Europe, the respective parties seem no closer to peace as the White House’s rhetoric around Vladimir Putin, Russia’s president, seems to be souring.\n\nOn Monday, Trump stood beside Israeli Prime Minister Benjamin Netanyahu and declared that peace was on the horizon, if only Hamas were to accept the terms engineered without their representatives’ consultation. A potential peace deal would create a security buffer zone separating Israeli and Palestinian territory while halting the war “immediately” and beginning a multi-stage withdrawal of Israeli forces from the Gaza Strip.\n\nThere are many questions left unanswered: whether the deal can proceed without any movement from Israel on the issue of eventual recognition of a Palestinian state, and who will be the other members of a so-called “Board of Peace” chaired by Trump himself — Tony Blair is the only other named member.\n\nBut what was very clear was the U.S. president’s real aim here: to position himself as a Clinton-esque broker of peace in the region and to be seen as having brought both Israel and Hamas into line, even if the reality of the situation doesn’t match up.\n\nThe president’s ambition was most obvious as he described his role on the “Board of Peace” governing Gaza in the short- to medium-term: “Everybody involved asked me to do this.”\n\n“It will be headed by a gentleman known as President Donald J. Trump of the United States...that’s just what I want, is some more work to do. But it’s so important that I’m willing to do it.”\n\nHe also repeatedly stressed the supposed historic nature of the deal, at one point claiming that European leaders were falling over themselves to praise him: “I was called by many European leaders, most of them say, ‘Is this true? Are you really doing peace in the Middle East? This is the most incredible thing we've heard.’ Some think it's the biggest thing they've ever heard. They call just to find out; is it just a rumor, or is it actually done?”\n\nThe president’s tongue-in-cheek declaration of self sacrifice followed the other shiny object he offered to the media and observers of his dealmaking efforts on Monday: the surprise announcement that Israel’s prime minister, at Trump’s behest, had spoken with Qatar’s leaders on the phone and apologized for violating Qatari sovereignty with a strike aimed at Hamas political leadership.\n\nThat moment, notable on its own, was coupled with the president’s admission that Netanyahu had seemingly not budged on opposition to Palestinian statehood, either in the immediate or long term. The Israeli leader’s refusal to budge on that position was one of several factors blamed for a peace agreement not being reached under the previous U.S. administration.\n\nWith no signs Netanyahu had been moved towards embracing the idea of eventual statehood for a Palestinian territory, and no signs of Hamas even having been consulted on the terms, it seemed that little progress was truly made towards a permanent peace agreement being signed. \n\nA Hamas spokesperson told news outlets that the militant group hadn’t received a written copy of the proposal as of Trump’s White House event with Netanyahu on Monday. A statement from the Palestinian Authority welcomed the deal’s proposed terms.\n\nThe White House and many in the media quickly pushed the notion that the ball is in Hamas’s court on Monday. But Trump, too, is under growing pressure to show that his peacemaking efforts aren’t just a bunch of smoke and mirrors as his party rushes towards the 2026 midterms and the president bets his credibility on a bid to solve one of the most bitter conflicts on Earth.","summary":"President Donald Trump is on his own increasingly frenetic campaign to paint himself the peacemaker, as the unfinished nature of Monday’s Gaza peace deal announcement proves, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-netanyahu-gaza-peace-plan-b2836166.html","image":"https://static.independent.co.uk/2025/09/29/22/14/TOPSHOT-CORRECTION-US-ISRAEL-PALESTINIANS-TRUMP-NETANYAHU-CONFLICT-DIPLOMACY-nn1v983r.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/7WjynLyl-4VHSaSK0.mp4","publish_date":"2025-09-29 23:30:51","author":"John Bowden","authors":["John Bowden"],"language":"en","source_country":"gb","sentiment":-0.251},{"id":364658878,"title":"In Trump's America, your tax dollars will help wreck the planet","text":"The Trump administration has announced a plan to redirect millions of taxpayer dollars from your pockets to coal barons. \n\nOf course, they’re not calling it that. No, they’re calling it something much less accurate, and much more Trumpy: “Interior Unleashes American Coal Power in Bold Move to Advance Trump Administration Priorities.” Apparently “unleashing” the power of coal is going to be expensive for everyone—except the coal companies. \n\nThe plan outlines giving $625 million to coal plant owners to upgrade their existing, aging coal plants instead of shuttering them, and opening 13.1 million acres of public lands for coal mining. Additionally, it reduces the royalty payments that coal companies usually have to make to the government for extracting coal on federal land. \n\nSo we’re looking at the private use of public land for private profits. Cool! Man, old-timey coal barons probably never had it this good. \n\nRelated | We're getting coal, whether we want it or not\n\nWhat do the rest of us get, besides greater opportunities for jobs that feature the decidedly old-school possibility of getting black lung disease? Well, how about skyrocketing energy costs?\n\nIf West Virginia is any guide, that’s indeed what the American people will be rewarded with. In the Mountain State, aka the heart of coal country, electricity rates have gone up about twice as fast as the national average over the past 15 years, with some residents now paying over $750 per month to their electric company. That’s just the price of unleashing freedom, baby. West Virginia votes deep red, but that isn’t going to stop the administration from screwing over the people who live there. \n\nThe Trump-loving state isn’t an outlier or an isolated data point. More coal plants do not equal cheaper energy. Generating electricity from coal is more expensive than other wussy woke ways, like solar. Maintaining coal plants is expensive, so the government is going to pick up the tab. \n\nThe Department of Energy has already forced one aging coal-fired plant to stay open for an additional three months for some unspecified energy emergency, even as the plant’s owners were winding it down. This move could cost as much as $100 million—which gets passed on to the customers, of course. \n\nMeanwhile, the Trump administration is trying to kill every cost-efficient non-fossil fuel source it can find. Sure, that’s partly because President Donald Trump is irrationally terrified of windmills, but also because it’s way more fun to send all that taxpayer money to your pals who own coal and oil companies.\n\nAt least the administration dropped its embarrassing effort to encourage people to explore careers in coal mining. Well, we’re presuming it dropped whatever minuscule effort that tweeting about it might have represented, as they’ve since deleted the post. \n\nDespite the administration’s best efforts to Make Mesothelioma Great Again, there’s just no untapped market of coal mining jobs to be unleashed. Those jobs have been falling steadily for decades, with a whopping 40,000 people or so currently in the industry. \n\nOr, as people like to point out, fewer than the number who work at Arby’s. Why aren’t we seeing a whole-of-government effort to prop up failing Arby’s in rural communities? The people cry out for easy access to Horsey Sauce.\n\nRelated | West Virginians love Trump—and he's screwing them anyway\n\nAll of this is a perfect ouroboros of corruption. Taxpayer dollars will be used to pay private companies to keep aging coal plants open despite their inefficiencies and massive pollution risks. Taxpayer dollars will go to drilling on public lands, but we’ll make it real cheap and easy for private companies to profit from that. \n\nAnd somehow, if West Virginia is any guide, all of this will result only in higher energy costs for all of us. \n\nIt may be a “Bold Move to Advance Trump Administration Priorities” for the coal companies, but for the rest of us, it just sucks.","summary":"The Trump administration has announced a plan to redirect millions of taxpayer dollars from your pockets to coal barons. \n\n\n\nOf course, they’re not calling it that. No, they’re calling it something much less accurate, and much more Trumpy: “Interior Unleashes American Coal Power in Bold Move to Advance Trump Administration Priorities.” Apparently “unleashing” the power of coal is going to be expensive for everyone—except the coal companies. \n\n\n\nThe plan outlines giving $625 million to coal plant owners to upgrade their existing, aging coal plants instead of shuttering them, and opening 13.1 million acres of public lands for coal mining. Additionally, it reduces the royalty payments that coal companies usually have to make to the government for extracting coal on federal land. \n\n\n\nSo we’re looking at the private use of public land for private profits. Cool! Man, old-timey coal barons probably never had it this good. \n\n\n\n\nRelated | We're getting coal, whether we want it or not\n\n\n\n\nWhat do the rest of us get, be","url":"https://www.dailykos.com/story/2025/9/29/2346095/-In-Trump-s-America-your-tax-dollars-will-help-wreck-the-planet?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1393035/story_image/AP16127034761977.jpg?1738284044","video":null,"publish_date":"2025-09-29 23:30:11","author":"Lisa Needham","authors":["Lisa Needham"],"language":"en","category":"politics","source_country":"US","sentiment":-0.418},{"id":364664282,"title":"California Gov. Gavin Newsom signs landmark bill creating AI safety measures","text":"By TRÂN NGUYỄN\n\nSACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom on Monday signed a law that aims to prevent people from using powerful artificial intelligence models for potentially catastrophic activities like building a bioweapon or shutting down a bank system.\n\nThe move comes as Newsom touted California as a leader in AI regulation and criticized the inaction at the federal level in a recent conversation with former President Bill Clinton. The new law will establish some of the first-in-the-nation regulations on large-scale AI models without hurting the state’s homegrown industry, Newsom said. Many of the world’s top AI companies are located in California and will have to follow the requirements.\n\n“California has proven that we can establish regulations to protect our communities while also ensuring that the growing AI industry continues to thrive. This legislation strikes that balance,” Newsom said in a statement.\n\nThe legislation requires AI companies to implement and disclose publicly safety protocols to prevent their most advanced models from being used to cause major harm. The rules are designed to cover AI systems if they meet a “frontier” threshold that signals they run on a huge amount of computing power.\n\nSuch thresholds are based on how many calculations the computers are performing. Those who crafted the regulations have acknowledged the numerical thresholds are an imperfect starting point to distinguish today’s highest-performing generative AI systems from the next generation that could be even more powerful. The existing systems are largely made by California-based companies like Anthropic, Google, Meta Platforms and OpenAI.\n\nThe legislation defines a catastrophic risk as something that would cause at least $1 billion in damage or more than 50 injuries or deaths. It’s designed to guard against AI being used for activities that could cause mass disruption, such as hacking into a power grid.\n\nCompanies also have to report to the state any critical safety incidents within 15 days. The law creates whistleblower protections for AI workers and establishes a public cloud for researchers. It includes a fine of $1 million per violation.\n\nIt drew opposition from some tech companies, which argued that AI legislation should be done at the federal level. But Anthropic said the regulations are “practical safeguards” that make official the safety practices many companies are already doing voluntarily.\n\n“While federal standards remain essential to avoid a patchwork of state regulations, California has created a strong framework that balances public safety with continued innovation,” Jack Clark, co-founder and head of policy at Anthropic, said in a statement.\n\nThe signing comes after Newsom last year vetoed a broader version of the legislation, siding with tech companies that said the requirements were too rigid and would have hampered innovation. Newsom instead asked a group of several industry experts, including AI pioneer Fei-Fei Li, to develop recommendations on guardrails around powerful AI models.\n\nThe new law incorporates recommendations and feedback from Newsom’s group of AI experts and the industry, supporters said. The legislation also doesn’t put the same level of reporting requirements on startups to avoid hurting innovation, said state Sen. Scott Wiener of San Francisco, the bill’s author.\n\n“With this law, California is stepping up, once again, as a global leader on both technology innovation and safety,” Wiener said in a statement.\n\nNewsom’s decision comes as President Donald Trump in July announced a plan to eliminate what his administration sees as “onerous” regulations to speed up AI innovation and cement the U.S.’ position as the global AI leader. Republicans in Congress earlier this year unsuccessfully tried to ban states and localities from regulating AI for a decade.\n\nWithout stronger federal regulations, states across the country have spent the last few years trying to rein in the technology, tackling everything from deepfakes in elections to AI “therapy.” In California, the Legislature this year passed a number of bills to address safety concerns around AI chatbots for children and the use of AI in the workplace.\n\nCalifornia has also been an early adopter of AI technologies. The state has deployed generative AI tools to spot wildfires and address highway congestion and road safety, among other things.\n\nAssociated Press reporter Matt O’Brien contributed to the report.","summary":"Newsom said the law establishes regulations without hurting the state's homegrown industry.","url":"https://www.twincities.com/2025/09/29/california-ai-regulations/","image":"https://www.twincities.com/wp-content/uploads/2025/09/Philanthropy_Clinton_Global_Initiative_96265.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-29 23:27:08","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.234},{"id":364662100,"title":"California Gov. Gavin Newsom signs landmark bill creating AI safety measures","text":"By TRÂN NGUYỄN\n\nSACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom on Monday signed a law that aims to prevent people from using powerful artificial intelligence models for potentially catastrophic activities like building a bioweapon or shutting down a bank system.\n\nThe move comes as Newsom touted California as a leader in AI regulation and criticized the inaction at the federal level in a recent conversation with former President Bill Clinton. The new law will establish some of the first-in-the-nation regulations on large-scale AI models without hurting the state’s homegrown industry, Newsom said. Many of the world’s top AI companies are located in California and will have to follow the requirements.\n\n“California has proven that we can establish regulations to protect our communities while also ensuring that the growing AI industry continues to thrive. This legislation strikes that balance,” Newsom said in a statement.\n\nThe legislation requires AI companies to implement and disclose publicly safety protocols to prevent their most advanced models from being used to cause major harm. The rules are designed to cover AI systems if they meet a “frontier” threshold that signals they run on a huge amount of computing power.\n\nSuch thresholds are based on how many calculations the computers are performing. Those who crafted the regulations have acknowledged the numerical thresholds are an imperfect starting point to distinguish today’s highest-performing generative AI systems from the next generation that could be even more powerful. The existing systems are largely made by California-based companies like Anthropic, Google, Meta Platforms and OpenAI.\n\nThe legislation defines a catastrophic risk as something that would cause at least $1 billion in damage or more than 50 injuries or deaths. It’s designed to guard against AI being used for activities that could cause mass disruption, such as hacking into a power grid.\n\nCompanies also have to report to the state any critical safety incidents within 15 days. The law creates whistleblower protections for AI workers and establishes a public cloud for researchers. It includes a fine of $1 million per violation.\n\nIt drew opposition from some tech companies, which argued that AI legislation should be done at the federal level. But Anthropic said the regulations are “practical safeguards” that make official the safety practices many companies are already doing voluntarily.\n\n“While federal standards remain essential to avoid a patchwork of state regulations, California has created a strong framework that balances public safety with continued innovation,” Jack Clark, co-founder and head of policy at Anthropic, said in a statement.\n\nThe signing comes after Newsom last year vetoed a broader version of the legislation, siding with tech companies that said the requirements were too rigid and would have hampered innovation. Newsom instead asked a group of several industry experts, including AI pioneer Fei-Fei Li, to develop recommendations on guardrails around powerful AI models.\n\nThe new law incorporates recommendations and feedback from Newsom’s group of AI experts and the industry, supporters said. The legislation also doesn’t put the same level of reporting requirements on startups to avoid hurting innovation, said state Sen. Scott Wiener of San Francisco, the bill’s author.\n\n“With this law, California is stepping up, once again, as a global leader on both technology innovation and safety,” Wiener said in a statement.\n\nNewsom’s decision comes as President Donald Trump in July announced a plan to eliminate what his administration sees as “onerous” regulations to speed up AI innovation and cement the U.S.’ position as the global AI leader. Republicans in Congress earlier this year unsuccessfully tried to ban states and localities from regulating AI for a decade.\n\nWithout stronger federal regulations, states across the country have spent the last few years trying to rein in the technology, tackling everything from deepfakes in elections to AI “therapy.” In California, the Legislature this year passed a number of bills to address safety concerns around AI chatbots for children and the use of AI in the workplace.\n\nCalifornia has also been an early adopter of AI technologies. The state has deployed generative AI tools to spot wildfires and address highway congestion and road safety, among other things.\n\nAssociated Press reporter Matt O’Brien contributed to the report.","summary":"Newsom said the law establishes regulations without hurting the state's homegrown industry.","url":"https://www.ocregister.com/2025/09/29/california-ai-regulations/","image":"https://www.ocregister.com/wp-content/uploads/2025/09/Philanthropy_Clinton_Global_Initiative_96265.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-29 23:27:08","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":0.234},{"id":364662928,"title":"California Gov. Gavin Newsom signs landmark bill creating AI safety measures","text":"By TRÂN NGUYỄN\n\nSACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom on Monday signed a law that aims to prevent people from using powerful artificial intelligence models for potentially catastrophic activities like building a bioweapon or shutting down a bank system.\n\nThe move comes as Newsom touted California as a leader in AI regulation and criticized the inaction at the federal level in a recent conversation with former President Bill Clinton. The new law will establish some of the first-in-the-nation regulations on large-scale AI models without hurting the state’s homegrown industry, Newsom said. Many of the world’s top AI companies are located in California and will have to follow the requirements.\n\n“California has proven that we can establish regulations to protect our communities while also ensuring that the growing AI industry continues to thrive. This legislation strikes that balance,” Newsom said in a statement.\n\nThe legislation requires AI companies to implement and disclose publicly safety protocols to prevent their most advanced models from being used to cause major harm. The rules are designed to cover AI systems if they meet a “frontier” threshold that signals they run on a huge amount of computing power.\n\nSuch thresholds are based on how many calculations the computers are performing. Those who crafted the regulations have acknowledged the numerical thresholds are an imperfect starting point to distinguish today’s highest-performing generative AI systems from the next generation that could be even more powerful. The existing systems are largely made by California-based companies like Anthropic, Google, Meta Platforms and OpenAI.\n\nThe legislation defines a catastrophic risk as something that would cause at least $1 billion in damage or more than 50 injuries or deaths. It’s designed to guard against AI being used for activities that could cause mass disruption, such as hacking into a power grid.\n\nCompanies also have to report to the state any critical safety incidents within 15 days. The law creates whistleblower protections for AI workers and establishes a public cloud for researchers. It includes a fine of $1 million per violation.\n\nIt drew opposition from some tech companies, which argued that AI legislation should be done at the federal level. But Anthropic said the regulations are “practical safeguards” that make official the safety practices many companies are already doing voluntarily.\n\n“While federal standards remain essential to avoid a patchwork of state regulations, California has created a strong framework that balances public safety with continued innovation,” Jack Clark, co-founder and head of policy at Anthropic, said in a statement.\n\nThe signing comes after Newsom last year vetoed a broader version of the legislation, siding with tech companies that said the requirements were too rigid and would have hampered innovation. Newsom instead asked a group of several industry experts, including AI pioneer Fei-Fei Li, to develop recommendations on guardrails around powerful AI models.\n\nThe new law incorporates recommendations and feedback from Newsom’s group of AI experts and the industry, supporters said. The legislation also doesn’t put the same level of reporting requirements on startups to avoid hurting innovation, said state Sen. Scott Wiener of San Francisco, the bill’s author.\n\n“With this law, California is stepping up, once again, as a global leader on both technology innovation and safety,” Wiener said in a statement.\n\nNewsom’s decision comes as President Donald Trump in July announced a plan to eliminate what his administration sees as “onerous” regulations to speed up AI innovation and cement the U.S.’ position as the global AI leader. Republicans in Congress earlier this year unsuccessfully tried to ban states and localities from regulating AI for a decade.\n\nWithout stronger federal regulations, states across the country have spent the last few years trying to rein in the technology, tackling everything from deepfakes in elections to AI “therapy.” In California, the Legislature this year passed a number of bills to address safety concerns around AI chatbots for children and the use of AI in the workplace.\n\nCalifornia has also been an early adopter of AI technologies. The state has deployed generative AI tools to spot wildfires and address highway congestion and road safety, among other things.\n\nAssociated Press reporter Matt O’Brien contributed to the report.","summary":"Newsom said the law establishes regulations without hurting the state's homegrown industry.","url":"https://www.bostonherald.com/2025/09/29/california-ai-regulations/","image":"https://www.bostonherald.com/wp-content/uploads/2025/09/Philanthropy_Clinton_Global_Initiative_96265.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-29 23:27:08","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":0.234},{"id":364660692,"title":"YouTube to pay $24.5 million to settle lawsuit over Trump's account suspension after Jan. 6 attack","text":"Google’s YouTube has agreed to pay $24.5 million to settle a lawsuit by President Donald Trump over his 2021 account suspension following the Jan. 6, 2021 attack on the U.S. Capitol.According to documents filed in federal court in California, $22 million of the settlement will be contributed to the Trust for the National Mall to help pay for the construction of the White House State Ballroom. The rest will go to other plaintiffs, including the American Conservative Union.Google is the latest big tech company to settle lawsuits brought by Trump. In January, Meta Platforms agreed to pay $25 million to settle a lawsuit over his 2021 suspension from Facebook. Elon Musk's X agreed to settle a similar lawsuit brought against the company then known as Twitter for $10 million.RELATED STORY | Federal judge tosses Trump's $15B defamation lawsuit against New York TimesThe settlement does not constitute an admission of liability, the filing says. Google confirmed the settlement but declined to comment beyond it.The disclosure of the settlement came a week before a scheduled Oct. 6 court hearing to discuss the case with U.S. District Judge Yvonne Gonzalez-Rogers in Oakland, California.","summary":"Google’s YouTube has agreed to pay $24.5 million to settle a lawsuit by President Donald Trump over his 2021 account suspension following the Jan. 6, 2021 attack on the U.S. Capitol.","url":"https://www.scrippsnews.com/politics/the-president/youtube-to-pay-24-5-million-to-settle-lawsuit-over-trumps-account-suspension-after-jan-6-attack","image":"https://ewscripps.brightspotcdn.com/dims4/default/98c9e53/2147483647/strip/true/crop/5000x2625+0+354/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F60%2F4d%2F7ab75a324fa2a4dce5413144cee3%2Fap25211251387542.jpg","video":null,"publish_date":"2025-09-29 23:23:13","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.163},{"id":364660192,"title":"Government shutdown looms after congressional leaders, Trump meet","text":"Sept. 29 (UPI) -- The chances of a government shutdown increased on Monday after congressional leaders from both parties, during a meeting with President Donald Trump in the Oval Office, weren't able to agree on a stopgap funding bill less than 48 hours before the deadline.\n\nWithout the funding bill signed by Trump, the government will run out of money, starting after midnight Wednesday.\n\nDemocrats, led by Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries, both serving New York, have said they won't support any stopgap bill unless it protects healthcare programs. House Speaker Mike Johnson of Louisiana and Senate Majority Leader John Thune of South Dajota, both Republicans, don't want to restore recent Medicaid cuts, and it omits an extension of the currently enhanced Affordable Care Act tax credits scheduled to expire.\n\nThe congressional leaders spoke separately with reporters outside the White House. Trump didn't comment, including on Truth Social.\n\nSchumer told reporters outside the White House's West Wing that \"there are still large differences between us.\"\n\nHe added: \"Their bill has not one iota of Democratic input.\"\n\nOn Sept. 19, the House passed a seven-week stopgap funding bill that Senate Democrats rejected earlier this month.\n\n\"That is never how we've done this before,\" Schumer said.\n\nSenate Majority Leader John Thune accused Democrats of \"hostage taking\" in their demands\n\n\"Republicans are united,\" Thune said. House Republicans, Senate Republicans, President Trump. The House has passed a clean funding resolution to fund the government until November the 21st. It's clean, it's bipartisan, and it is short-term, but it gives us enough time to finish the appropriations process, which is the way we should be funding the government.\"\n\nHe held up a copy of the bill, saying: \"This is sitting right now at the Senate desk. We could pick it up and pass it tonight, pick it up and pass it tomorrow before the government shuts down, and then we don't have the government shut down. It is totally up to the Democrats, because right now, they are the only thing standing between the American people and the government shutting down.\"\n\nThume said the Senate will vote on the House's continuing resolution before negotiating a full-year appropriations bill. They have a 53-47 majority, but 60 votes are needed for passage.\n\nLast week, a memo from the White House Office of Management and Budget sent to federal agencies said there will be mass firings without stopgap funding. The OMB asked the federal agencies to identify programs that would lose funding and have no other sources of funding.\n\nEssential services, including Social Security and Medicare payments, and mail delivery, will continue, though new applications, loans and some regulatory functions can face delays. Air travel and law enforcement also remain in place.\n\nEssential workers and those sent home won't get paid initially, but they all will get the money when the government reopens.\n\nVice President JD Vance said the nation is headed into a shutdown \"because the Democrats won't do the right thing.\"\n\n\"Look the principle at stake here is very simple,\" Vance said. \"We have disagreements about tax policy, you don't shut that government down. We have disagreements about healthcare policy, but you don't shut the government down. You don't use your policy disagreements as leverage to not pay our troops and not have essentials for services.\"\n\nVance took a more conciliatory tone than the Republicans, saying he favors further discussing the Democrats' demand. \"They had some ideas that I actually thought were reasonable, and they had some ideas that the President thought was reasonable,\" he told reporters. \"What's not reasonable is to hold those ideas as leverage and to shut down the government unless we give you everything you want.\"\n\nDemocrats are concerned about increased healthcare premiums and closure of rural hospitals. On July 4, Trump signed the legislation that is called \"the Big Beautiful Spending Bill\" of tax and spending policies.\n\n\"By his face and by the way he looked, I think he heard about them for the first time,\" Schumer said, noting he told Trump some families could see monthly premiums for the Affordable Care Act, known as Obamacare, will rise $400 if enhanced subsidies are allowed to expire at the end of the year.\n\nThe Democrats warn that many rural hospitals would close in the next year because of nearly $1 trillion in Medicaid cuts.\n\nRepublicans also rejected a stopgap bill to last seven to 10 days.\n\nRepublicans have differed on how to handle subsidies to help healthcare, including rural hospitals.\n\nTrump continues to criticize Democrats, including a joint news conference with Israeli President Benjamin Netanyahu before the meeting with congressional leaders.\n\n\"They're going to have to do some things because their ideas are not very good ones,\" he said. \"They're very bad for our country, so we'll see how that works out.\"\n\nThe meeting was Trump's first with top Democrats since he became president again on Jan. 20. Trump canceled a meeting scheduled for last week at the request of Johnson and Thune.\n\nThe meeting was announced late Saturday.\n\n\"I want to thank President Trump for the strong, solid leadership,\" Johnson said. \"He listened to the arguments and they just wouldn't acknowledge the simple facts. If the Democrats make the decisions to shut the government down, the consequences are on them.\"\n\nJeffries said, though \"significant and meaningful differences remain,\" they had a \"frank and direct discussion\" in the Oval Office.\n\nThe last U.S. government shutdown was 35 days, starting on Dec. 22, 2018, and ending on Jan. 25, 2019, when Trump was first president. Trump demanded $5.7 billion in federal funding for a wall on the U.S.-Mexico border at that time.","summary":"The chances of a government shutdown rose after both parties' congressional leaders, meeting with President Donald Trump, didn't agree on a stopgap funding.","url":"https://www.upi.com/Top_News/US/2025/09/29/Government-shutdown-looms-congressional-leaaders-Trump-meet/7031759182559/","image":"https://cdnph.upi.com/sv/ph/og/upi/7031759182559/2025/1/5446b48a7962055c888f132afa0e851a/v1.5/Government-shutdown-looms-after-congressional-leaders-Trump-meet.jpg","video":null,"publish_date":"2025-09-29 23:22:29","author":"Allen Cone","authors":["Allen Cone"],"language":"en","category":"politics","source_country":"us","sentiment":-0.441},{"id":364664424,"title":"EA CEO tells employees $55 billion buyout marks \"a new era of opportunity\" and the company's values \"remain unchanged\"","text":"Skip to main content\n\nGamesRadar+\nThe Games, Movies, TV & Comics You Love\n\nView Profile\n\nSearch GamesRadar+\n\nGame Insights\n\nGames Features\n\nGames Reviews\n\nGames Guides\n\nThe Big Preview\n\nOn The Radar\n\nFuture Games Show\n\nAction Games\n\nAction RPGs\n\nAdventure Games\n\nThird Person Shooters\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nGrand Theft Auto\n\nAssassin's Creed\n\nMonster Hunter\n\nThe Elder Scrolls\n\nEntertainment\n\nAnime Shows\n\nSci-Fi Shows\n\nSuperhero Shows\n\nAnimated Shows\n\nMarvel TV Shows\n\nStar Wars TV Shows\n\nDC TV Shows\n\nMovie Reviews\n\nSuperhero Movies\n\nAction Movies\n\nSci-Fi Movies\n\nAnime Movies\n\nHorror Movies\n\nMarvel Movies\n\nApple TV Plus\n\nDisney Plus\n\nAmazon Prime Video\n\nMarvel Comics\n\nToys & Merch\n\nToys & Collectibles\n\nDungeons and Dragons\n\nHardware News\n\nHardware Reviews\n\nHardware Features\n\nDesktop PCs\n\nPeripherals\n\nHeadsets & Headphones\n\nTVs & Monitors\n\nGaming Mice\n\nGaming Keyboards\n\nGaming Chairs\n\nSpeakers & Audio\n\nAccessories & Tech\n\nGaming Controllers\n\nSSDs & Hard Drives\n\nAccessories\n\nBuying Guides\n\nNewsletters\n\nRetro Gamer\n\nGame Insights \n\nGames Features\n\nGames Reviews\n\nGames Guides\n\nThe Big Preview\n\nOn The Radar\n\nFuture Games Show\n\nAction Games\n\nAction RPGs\n\nAdventure Games\n\nThird Person Shooters\n\nView Platforms\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nFranchises \n\nGrand Theft Auto\n\nAssassin's Creed\n\nMonster Hunter\n\nThe Elder Scrolls\n\nEntertainment\n\nView Entertainment\n\nView TV Shows\n\nAnime Shows\n\nSci-Fi Shows\n\nSuperhero Shows\n\nAnimated Shows\n\nMarvel TV Shows\n\nStar Wars TV Shows\n\nDC TV Shows\n\nView Movies\n\nMovie Reviews\n\nSuperhero Movies\n\nAction Movies\n\nSci-Fi Movies\n\nAnime Movies\n\nHorror Movies\n\nMarvel Movies\n\nView Streaming\n\nApple TV Plus\n\nDisney Plus\n\nAmazon Prime Video\n\nView Comics\n\nMarvel Comics\n\nToys & Merch\n\nToys & Collectibles\n\nDungeons and Dragons\n\nView Hardware\n\nHardware News\n\nHardware Reviews\n\nHardware Features\n\nDesktop PCs\n\nPeripherals \n\nView Peripherals\n\nHeadsets & Headphones\n\nTVs & Monitors\n\nGaming Mice\n\nGaming Keyboards\n\nGaming Chairs\n\nSpeakers & Audio\n\nAccessories & Tech \n\nGaming Controllers\n\nSSDs & Hard Drives\n\nAccessories\n\nBuying Guides\n\nNewsletters\n\nRetro Gamer\n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nPS5 State of Play\nGhost of Yotei\nBattlefield 6\nNew Games for 2025\n\nDon't miss these\n\nMass Effect\nEA goes $20 billion in debt as part of its $55 billion buyout, and the BioWare fans who've already waited 8 years for Mass Effect 5 are terrified of how the company might cut costs\n\nEA reportedly nearing $50 billion deal to go private with money from Saudi Arabia's Public Investment fund and a private equity firm, which would \"likely be the largest leveraged buyout of all time\"\n\nBattlefield 6 and Dragon Age owner EA goes private in $55 billion deal, smashing past its market value\n\nAssassin's Creed\nUbisoft says it has creative control over the Assassin's Creed Mirage DLC, which is set in Saudi Arabia, was announced in Saudi Arabia, and which even employees fear might be funded by Saudi Arabia\n\nDespite a Battlefield 6 leak suggesting the FPS could be $80, EA is \"not looking to make any changes on pricing\" yet\n\nThird Person Shooters\nMass Effect veteran says open-world bot flop Anthem gained momentum within EA because the pitch was \"what if BioWare game but it could do FIFA numbers?\"\n\nUbisoft claims microtransactions help players \"experience more fun\"\n\nFighting Games\nPremier fighting game tournament Evo has a new co-owner, but Sony's continuing to invest alongside Saudi Arabia's tourism project and WWE's parent company\n\nEA Sports FC\nEA boss doesn't seem worried about Rematch stealing EA Sports FC 26's thunder as he insists \"we love competition,\" but are \"always watching\" competitors: \"We never sit back with arrogance\"\n\n\"A giant black hole sucking everything in, and spitting out bones\": Devs react with anger and concern as yet more Microsoft layoffs see huge cuts and cancellations at game studios \n\nBattlefield\nBattlefield 6 has reportedly cost over $400 million to make and led to developers taking up to 9 months off due to burnout\n\nGrand Theft Auto\nClair Obscur: Expedition 33 is \"a strong signal\" that players don't just want live-service games, BioWare veteran says, but GTA 6's success will be a real indicator of the industry\n\nBioWare apparently wanted to make a Mass Effect-style remaster collection for Dragon Age, but EA's not too keen: \"It's strange for a publicly traded company to basically be against free money\"\n\n\"Stop Killing Games has actually changed the timeline\": As EU petition comes to successful close, founder says \"unending overtime\" has him ready to \"take a break for the next 10 years,\" but he's sticking around until it's done\n\nUbisoft says players \"are very sensitive to the quality\" of games nowadays, so there's a \"high\" risk of \"bashing\" causing \"damage to its reputation\"\n\nEA CEO tells employees $55 billion buyout marks \"a new era of opportunity\" and the company's values \"remain unchanged\"\n\nJordan Gerblick \n\n29 September 2025\n\n\"This moment is a recognition of your creativity, your innovation, and your passion\"\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: BioWare)\n\nEA's newly confirmed $55 billion dollar buyout by Saudi Arabia's Public Investment Fund, private equity firm Silver Lake, and Jared Kushner's investment firm Affinity Partners marks \"a new era of opportunity\" and won't impact the company's commitment to players nor its values, EA CEO Andrew Wilson says.\n\nNow, it's very hard to imagine anything positive coming out of this for players and employees of EA, but naturally, Wilson doesn't see it that way, at least not publicly.\n\"This moment is a recognition of your creativity, your innovation, and your passion,\" he says in a memo sent to employees on Monday.\n\nYou may like\n\nEA goes $20 billion in debt as part of its $55 billion buyout, and the BioWare fans who've already waited 8 years for Mass Effect 5 are terrified of how the company might cut costs\n\nEA reportedly nearing $50 billion deal to go private with money from Saudi Arabia's Public Investment fund and a private equity firm, which would \"likely be the largest leveraged buyout of all time\"\n\nBattlefield 6 and Dragon Age owner EA goes private in $55 billion deal, smashing past its market value\n\n\"You have built some of the world's most iconic IP, created stories that have inspired global communities, and helped shape culture through interactive experiences. Everything we have achieved – and everything that lies ahead – is because of you.\"\n\nI'm not an expert on leveraged buyouts by private equity firms, much less ones funded in part by Saudi Arabia and Donald Trump's son-in-law, but they typically don't result in better working conditions for employees or better games for players. Still, Wilson, who will continue overseeing EA as CEO, insists the company's core values aren't going anywhere.\n\"We are entering a new era of opportunity,\" he says. \"This is one of the largest and most significant investments ever made in the entertainment industry. Our new partners bring deep experience across sports, gaming, and entertainment. They are committed with conviction to EA – they believe in our people, our leadership, and the long-term vision we are now building together.\n\"Our mission at EA to — Inspire The World To Play — continues to guide everything we do. Our values and our commitment to players and fans around the world remain unchanged,\" adds Wilson.\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\"With continued rigor and operational excellence, we can amplify the creativity of our teams, accelerate innovation, and pursue transformative opportunities that position EA to lead the future of entertainment. Together, we'll create experiences that are bold, expressive, and deeply connected to inspire generations of players around the world.\"\nThe full impact of EA's historical sale won't be known for a long time, but there's deep concern from within the overall gaming community, including BioWare fans who've already waited eight years for a new Mass Effect game and could now be waiting much, much longer.\nIn the meantime, take a load off and play some of the best games of 2025 so far.\n\nSee more Games News\n\nJordan Gerblick\n\nSocial Links Navigation\n\nAfter earning an English degree from ASU, I worked as a corporate copy editor while freelancing for places like SFX Magazine, Screen Rant, Game Revolution, and MMORPG on the side. I got my big break here in 2019 with a freelance news gig, and I was hired on as GamesRadar's west coast Staff Writer in 2021. That means I'm responsible for managing the site's western regional executive branch, AKA my home office, and writing about whatever horror game I'm too afraid to finish.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nEA goes $20 billion in debt as part of its $55 billion buyout, and the BioWare fans who've already waited 8 years for Mass Effect 5 are terrified of how the company might cut costs\n\nEA reportedly nearing $50 billion deal to go private with money from Saudi Arabia's Public Investment fund and a private equity firm, which would \"likely be the largest leveraged buyout of all time\"\n\nBattlefield 6 and Dragon Age owner EA goes private in $55 billion deal, smashing past its market value\n\nUbisoft says it has creative control over the Assassin's Creed Mirage DLC, which is set in Saudi Arabia, was announced in Saudi Arabia, and which even employees fear might be funded by Saudi Arabia\n\nDespite a Battlefield 6 leak suggesting the FPS could be $80, EA is \"not looking to make any changes on pricing\" yet\n\nMass Effect veteran says open-world bot flop Anthem gained momentum within EA because the pitch was \"what if BioWare game but it could do FIFA numbers?\"\n\nLatest in Games\n\nCall of Duty: Black Ops 7 beta will have the same Secure Boot requirements that derailed some FPS fans from Battlefield 6 on PC\n\nAs Silent Hill f combat discourse swirls, many most-downloaded mods increase weapon durability and damage, make dodging easier, and expand item stacks: \"Survival horror? More like survival hoarder\"\n\nTeam Cherry publishing boss advises concerned Silksong players to report scam ad spoiling the final boss and promising a magical world where you can download games without internet\n\nTodd Howard was trying to pitch Indiana Jones and the Great Circle for years, but even the devs don't know if he ever wanted to direct it himself at Bethesda: \"I don't know if he had actually thought about it\"\n\nBorderlands 4 mercifully ditches most of Borderlands 3 potty humor, but Gearbox gives itself a treat and references Dark Souls meme from Twitter in hidden sidequest \n\nSolo dev spends 6 weeks making a short free game, accidentally wins the Steam algorithm and makes $4,200 in 5 days, then rushes to prepare a big update: \"Seems the people liked my honesty and that I don't have any hidden costs\"\n\nLatest in News\n\nEA CEO tells employees $55 billion buyout marks \"a new era of opportunity\" and the company's values \"remain unchanged\"\n\nJames Gunn's Superman is HBO Max's biggest streaming hit since Barbie, soaring to 13 million views in just 10 days\n\nWorld's most popular horny RPG with over 50 million downloads gives up on decorum in \"divine\" update that's probably illegal somewhere: \"WAITT WHATT??? FROM BEHINDD?\"\n\nFormer WWE superstar claims \"there may be some talks\" about playing Jason Voorhees in the Friday the 13th reboot\n\nD'oh! 20 years later, The Simpsons movie is getting a sequel\n\nThe first AI actor is here, and Hollywood isn't too happy about it: \"Read the room\"\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nGhost of Yotei review: \"One of the first PS5 games to feel truly boundary-pushing, this hyper violent samurai revenge quest truly hooked me\"\n\nHades 2 review: \"Impeccable combat and flawless characterization across a huge roster make for a follow-up that surpasses even its excellent roguelike predecessor\"\n\nEA FC 26 review: \"Ultimate Team's huge, divisive changes have me torn – FIFA's successor has moved away from serving football purists\"\n\nFinal Fantasy Tactics: The Ivalice Chronicles review: \"Fantastic tweaks elevate a classic while leaving its spirit intact – this seminal tactical RPG has never been better\"\n\nBaby Steps review: \"If you craved a tougher hiking challenge than Death Stranding, this is for you – though prepare to get dropped from many great heights\"\n\nOne Battle After Another review: \"One of the best studio movies in years and an instant classic\"\n\nThe Conjuring: Last Rites review: \"Not bold or memorable enough for the Warrens' final chapter\"\n\nDemon Slayer: Infinity Castle review: \"Roars past Mugen Train as Demon Slayer's best adventure yet\"\n\nThe Long Walk review: \"One of the best Stephen King adaptations ever made\" \n\nFrankenstein review: \"A classy, if somewhat safe, adaptation\"\n\nMarvel Zombies review: \"A fun expansion of the What If episode with delightful MCU Easter eggs and truly gross R-rated kills\"\n\nGen V season 2 review: \"As strong as the first season, if not stronger\"\n\nWednesday season 2 part 2 review: \"Ortega shines, but it's a zombie who steals the entire show\"\n\nPeacemaker season 2 review: \"Darker and sadder than the first year, but there's still a lot of fun to be had with the 11th Street Kids.\"\n\nWednesday season 2 part 1 review: \"Complex and exciting but weighed down by too many subplots\"\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...","summary":"\"This moment is a recognition of your creativity, your innovation, and your passion\"","url":"https://www.gamesradar.com/games/ea-ceo-tells-employees-usd55-billion-buyout-marks-a-new-era-of-opportunity-and-the-companys-values-remain-unchanged/","image":"https://cdn.mos.cms.futurecdn.net/wUAo85wWFy5R6TmjmciXb3-1920-80.jpg","video":null,"publish_date":"2025-09-29 23:19:19","author":"Jordan Gerblick","authors":["Jordan Gerblick"],"language":"en","source_country":"us","sentiment":0.297},{"id":364662314,"title":"White House Scare: Man Held After Trying to Jump Fence While Trump Was Inside","text":"A man was apprehended by Secret Service officials on Monday while trying to jump over into the White House. US President Donald Trump was inside the White House when the incident happened. The man was taken into custody and investigation is on to ascertain the motive. A similar incident had happened in December last year when a person was arrested after attempting to climb a temporary fence near the White House. The Secret Service had said that the person was \"quickly taken into custody and arrested for Unlawful Entry.\" This is a Breaking story Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The Secret Service has taken the man into custody and investigation is on to ascertain the motive.","url":"https://www.timesnownews.com/world/us/us-news/white-house-security-scare-man-arrested-breach-grounds-donald-trump-article-152917142","image":"https://images.timesnownews.com/thumb/msid-152917178,thumbsize-45794,width-1280,height-720,resizemode-75/152917178.jpg","video":null,"publish_date":"2025-09-29 23:15:25","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":0.248},{"id":364657938,"title":"Inside the Surprising Classroom Rehabilitating Some of America's Most Dangerous Prisoners: 'Weird, but a Good Weird'","text":"Mark Taylor was eight years into his life sentence for a gang-related murder when, one afternoon in 2005, he says something like a miracle took place in his cell.\n\n Together with the other inmates at California’s Ironwood State Prison, he’d been ordered back to his cell during a lockdown. Then he spotted a counselor from a local community college — which was offering classes to inmates — walk through his housing unit. \n\n Taylor already knew about the program that enabled inmates to acquire associate degrees and had even mentioned it to his mother, Patricia Scarfone, during their phone conversations.\n\n “Every time I would call her, she’d ask, ‘Are you in college yet?’ ” recalls Taylor, who'd convinced himself that he wasn’t “smart enough” to go to college. But on that afternoon as he stood in his cell, he thought about his mom and shouted out at the counselor: “Hey man, can I take a class?”\n\n That moment wasn’t just a turning point in Taylor’s life — he ended up earning six associate degrees while maintaining a 4.0 GPA — it is now also helping to transform the lives of inmates at California’s notorious Pelican Bay State Prison, often described as housing “the worst of the worst.”\n\n Once Taylor got paroled in 2018, after 21 years behind bars, he quickly went to work helping to create a novel higher education program through Cal Poly Humboldt that is allowing violent, hardened prisoners at Pelican Bay to earn four-year bachelor’s degrees and turn their lives around.\n\n “Without education, I'd still be an alcoholic, drug-addicted, angry, violent street gang member — and in prison,” says Taylor, 54. He calls his work at Pelican Bay a way of “making amends” for the pain he caused so many people.\n\n “I want to see people come home healthy and whole and not hurt people. And I think college is one way to do that,\" Taylor says.\n\n If nothing else, Pelican Bay’s venture into higher education is sound economics, he says, noting that statistics show less than 3% of former inmates with bachelor’s degrees return to prison within three years of their release.\n\n For those who haven’t earned a college degree, the national recidivism rate for that same three-year period is between 66 and 68%, according to the Council for Criminal Justice.\n\n “Fiscally speaking,” adds Taylor, who now works with the Anti-Recidivism Coalition, “it just makes sense, especially when you consider that it costs approximately $132,000 to keep one person in prison for a year in California.”\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n The educational program at Pelican Bay is the first of its kind ever implemented at a maximum-security prison in California and is helping to reduce recidivism rates while increasing employment opportunities for parolees, officials say.\n\n Even more importantly, it provides inmates with the type of critical thinking skills that helps them better take accountability for their actions — and ultimately makes the prison safer.\n\n “It’s just better for the prison, for the incarcerated and for the staff,” says Pelican Bay's warden, Stephen Smith.\n\n “So many incarcerated people feel like they’re lost and they have nothing to lose. But when they see that they can achieve something and they can be successful, their mindset starts changing bit by bit,” Smith says.\n\n For Antonio Barajas — who dropped out of school in ninth grade and was convicted of murder in 2022 — the work in the classroom among inmates who once couldn’t be on the same basketball court but are now studying together is awe inspiring.\n\n “I’ve seen a change in the whole institution here,” says Barajas, 40, who earned his GED and associate degree at the prison and has “fallen in love” with learning as an alternative where his life had been headed for years before.\n\n “People are going to college now. They’re hitting the right path. It’s been nothing but positive,” he says.\n\n The very idea that Pelican Bay — located in the remote northwest corner of California and opened in 1989 as one of the nation’s first so-called supermax prisons — would one day host a groundbreaking college program may seem far fetched.\n\n Over the years, several of the state’s most notorious serial killers and gang leaders have been housed at the facility. Conditions there have also stirred controversy: A 2013 hunger strike staged by four alleged leaders of rival prison gangs protested the incarceration of inmates in solitary confinement for lengthy, often indefinite periods of time.\n\n Two years later, the prison began offering two-year community college degrees through the College of the Redwoods.\n\n Taylor's new program, launched in April 2024, allows graduates of the earlier program to go on and earn a bachelor’s degree in communication. Much of the money for tuition comes from the Second Chance Pell Grant program. (Those funds are tentatively set to expire in the summer of 2026 due to an executive order signed by President Donald Trump earlier this year.)\n\n For inmates like Salvador Jacobo, who is serving a life sentence for a gang-related killing, the program, held in 900-square-foot classroom lined with computers, is helping him forge a fresh start of sorts after a life marred by trouble.\n\n He often wakes up a four each morning to prepare for class and spends six hours a day on his schoolwork.\n\n “I always want to go to class prepared and be able to discuss things,” Jacobo says, crediting the program for giving him “meaning.”\n\n After graduating with bachelor’s degree, the former high school dropout is determined to one day find a way to earn another degree in psychology.\n\n “It’s selfish,” Jacobo, 39, says, “but I want to understand why the hell I ended up the way I did, to understand why I was so susceptible to criminal thinking and all the things that ruined my life, my family’s life and the life of my victim.”\n\n Taylor's program, which currently includes 28 students, has proven so popular that some inmates have declined to be transferred to less remote, lower security level prisons just so they can continue working toward their degrees.\n\n “For many of these guys, Pelican Bay is so far away from their family that they go years without visits,” says Taylor. “But when they get the chance to go to a lower-level prison, they’re like, ‘No. Leave me here. This is where the education’s at.’ ”\n\n For inmate Barajas — who hopes earn his bachelor degree before his parole hearing in late 2026 — the program makes sense in ways that go far beyond economics. It’s opening up a new world that, according to the Pelican Bay warden, is “spreading like a virus” throughout the prison.\n\n Says Barajas: “The whole mood of this place has changed. You walk the yard now and guys are talking about their class assignments, what they learned and trying to encourage others to study. That never happened before. It’s weird, but it’s a good weird.”","summary":"Mark Taylor says that his work at Pelican Bay in California is his way of “making amends”","url":"https://people.com/inside-surprising-classroom-rehabilitating-some-of-america-most-dangerous-prisoners-11797409","image":"https://people.com/thmb/2RyEii_ctYfX3nY2MN37glSOFIg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/prison-education-program-092825-57244d20f66e490287b85a8a3245de95.jpg","video":null,"publish_date":"2025-09-29 23:15:00","author":"Johnny Dodd","authors":["Johnny Dodd"],"language":"en","source_country":"US","sentiment":0.112},{"id":364664320,"title":"4 charged after anti-ICE protest outside Chicago facility erupts in violence","text":"Federal charges have been filed against four individuals involved in the anti-ICE protests in Chicago over the weekend, according to court documents obtained by ABC News.\n\nThe four defendants are being charged with assaulting and resisting officers outside the Broadview ICE facility during the multi-day protest on Saturday.\n\nPaul Ivery, one of the individuals charged, allegedly showed his middle finger to federal agents at the protest before saying, “I’ll f------ kill you right now” and jumping on a car, causing damage to the vehicle, and fighting with a Homeland Security agent, according to the court filings.\n\nHubert Mazur, Ray Collins and Jocelyne Robledo were also detained at the protests after engaging in physical altercations with federal officers, according to the court documents. Collins and Robledo were in possession of semiautomatic pistols at the protest but had lawful permits to carry the firearms, according to court documents.\n\nICE posted on X about Collins and Robledo's arrests Monday afternoon, sharing photos of the couple and their firearms, writing \"they will be prosecuted and held accountable.\"\n\nAt a news conference Monday afternoon, Illinois Gov. J.B. Pritzker said federal officers used tear gas, pepper spray, rubber bullets and flash-bang devices on protesters, journalists and bystanders in Broadview. The Trump administration is attempting to destabilize Chicago, he said.\n\n\"This is not about fighting crime or about public safety. This is about sowing fear and intimidation and division among Americans. It was about creating a pretext to send armed military troops into our communities. This is about consolidating power in Donald Trump's hands,\" Pritzker said.\n\nABC News has reached out to the Trump administration for a comment.\n\nA group of Chicago community groups held another news conference Sunday, lambasting ICE's activities and increased presence in the city.\n\nRep. Jesus \"Chuy\" Garcia, who represents part of Chicago in Congress, criticized ICE's efforts to detain immigrants in the city.\n\n\"Today we witness the further militarization of ICE tactics in Chicago as they showed up downtown to indiscriminately continue to profile against people just because of what they look like,\" Garcia said.\n\nChicago Mayor Brandon Johnson posted on X Sunday afternoon, saying, \"This is another brazen provocation from the Trump administration that does nothing to make our city safer.\"","summary":"Four anti-ICE protestors have been criminally charged for assaulting and resisting federal officials outside a Chicago ICE facility Saturday as part of ongoing protests.","url":"https://abcnews.go.com/US/4-charged-after-anti-ice-protest-chicago-facility/story?id=126047334","image":"https://i.abcnewsfe.com/a/32a5256b-fd1b-4687-bdc3-bfd94b39040b/ice-protest-chicago-01-gty-jef-250929_1759170449600_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2025-09-29 23:14:00","author":"Mason Leath","authors":["Mason Leath"],"language":"en","category":"politics","source_country":"us","sentiment":-0.494},{"id":364660674,"title":"YouTube to pay $24.5 million to settle lawsuit over Trump’s account suspension after Jan. 6 attack","text":"Google’s YouTube has agreed to pay $24.5 million to settle a lawsuit by President Donald Trump over his 2021 account suspension following the Jan. 6, 2021 attack on the U.S. Capitol.\n\nAccording to documents filed in federal court in California, $22 million of the settlement will be contributed to the Trust for the National Mall to help pay for the construction of the White House State Ballroom. The rest will go to other plaintiffs, including the American Conservative Union.\n\nGoogle is the latest big tech company to settle lawsuits brought by Trump. In January, Meta Platforms agreed to pay $25 million to settle a lawsuit over his 2021 suspension from Facebook. Elon Musk’s X agreed to settle a similar lawsuit brought against the company then known as Twitter for $10 million.\n\nThe settlement does not constitute an admission of liability, the filing says. Google confirmed the settlement but declined to comment beyond it.\n\nThe disclosure of the settlement came a week before a scheduled Oct. 6 court hearing to discuss the case with U.S. District Judge Yvonne Gonzalez-Rogers in Oakland, California.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"Google’s YouTube has agreed to pay $24.5 million to settle a lawsuit by President Donald Trump over his 2021 account suspension following the Jan. 6,...","url":"https://wsvn.com/entertainment/youtube-to-pay-24-5-million-to-settle-lawsuit-over-trumps-account-suspension-after-jan-6-attack/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/01/240111-Youtube-logo-on-building.png","video":null,"publish_date":"2025-09-29 23:11:03","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.339},{"id":364653040,"title":"Newsom signs landmark bill creating AI safety measures","text":"By TRÂN NGUYỄN | Associated Press\n\nSACRAMENTO — California Gov. Gavin Newsom on Monday signed a law that aims to prevent people from using powerful artificial intelligence models for potentially catastrophic activities like building a bioweapon or shutting down a bank system.\n\nThe move comes as Newsom touted California as a leader in AI regulation and criticized the inaction at the federal level in a recent conversation with former President Bill Clinton. The new law will establish some of the first-in-the-nation regulations on large-scale AI models without hurting the state’s homegrown industry, Newsom said. Many of the world’s top AI companies are located in California and will have to follow the requirements.\n\n“California has proven that we can establish regulations to protect our communities while also ensuring that the growing AI industry continues to thrive. This legislation strikes that balance,” Newsom said in a statement.\n\nThe legislation requires AI companies to implement and disclose publicly safety protocols to prevent their most advanced models from being used to cause major harm. The rules are designed to cover AI systems if they meet a “frontier” threshold that signals they run on a huge amount of computing power.\n\nSuch thresholds are based on how many calculations the computers are performing. Those who crafted the regulations have acknowledged the numerical thresholds are an imperfect starting point to distinguish today’s highest-performing generative AI systems from the next generation that could be even more powerful. The existing systems are largely made by California-based companies like Anthropic, Google, Meta Platforms and OpenAI.\n\nThe legislation defines a catastrophic risk as something that would cause at least $1 billion in damage or more than 50 injuries or deaths. It’s designed to guard against AI being used for activities that could cause mass disruption, such as hacking into a power grid.\n\nCompanies also have to report to the state any critical safety incidents within 15 days. The law creates whistleblower protections for AI workers and establishes a public cloud for researchers. It includes a fine of $1 million per violation.\n\nIt drew opposition from some tech companies, which argued that AI legislation should be done at the federal level. But Anthropic said the regulations are “practical safeguards” that make official the safety practices many companies are already doing voluntarily.\n\n“While federal standards remain essential to avoid a patchwork of state regulations, California has created a strong framework that balances public safety with continued innovation,” Jack Clark, co-founder and head of policy at Anthropic, said in a statement.\n\nThe signing comes after Newsom last year vetoed a broader version of the legislation, siding with tech companies that said the requirements were too rigid and would have hampered innovation. Newsom instead asked a group of several industry experts, including AI pioneer Fei-Fei Li, to develop recommendations on guardrails around powerful AI models.\n\nThe new law incorporates recommendations and feedback from Newsom’s group of AI experts and the industry, supporters said. The legislation also doesn’t put the same level of reporting requirements on startups to avoid hurting innovation, said state Sen. Scott Wiener of San Francisco, the bill’s author.\n\n“With this law, California is stepping up, once again, as a global leader on both technology innovation and safety,” Wiener said in a statement.\n\nNewsom’s decision comes as President Donald Trump in July announced a plan to eliminate what his administration sees as “onerous” regulations to speed up AI innovation and cement the U.S.’ position as the global AI leader. Republicans in Congress earlier this year unsuccessfully tried to ban states and localities from regulating AI for a decade.\n\nWithout stronger federal regulations, states across the country have spent the last few years trying to rein in the technology, tackling everything from deepfakes in elections to AI “therapy.” In California, the Legislature this year passed a number of bills to address safety concerns around AI chatbots for children and the use of AI in the workplace.\n\nCalifornia has also been an early adopter of AI technologies. The state has deployed generative AI tools to spot wildfires and address highway congestion and road safety, among other things.\n\nAssociated Press reporter Matt O’Brien contributed to the report.","summary":"The governor touts California's new law as one that will establish some of the first-in-the-nation regulations on large-scale AI models without hurting a homegrown industry.","url":"https://www.mercurynews.com/2025/09/29/california-law-ai-safety-measures-newsom/","image":"https://www.mercurynews.com/wp-content/uploads/2025/09/Philanthropy_Clinton_Global_Initiative_96265.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-09-29 23:09:38","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.203},{"id":364657046,"title":"Jobs minister Kahlon says B.C. won't pan away from Trump threat to tariff films","text":"British Columbia’s Jobs Minister Ravi Kahlon says the government is taking threats by U.S. President Donald Trump to tariff B.C.-made films by 100 per cent \"very seriously,” but it’s unclear how such a levy would impact the industry, or if it really would be enacted.\n\nOn Monday, Trump revived a threat first made in May to impose a tariff of 100 per cent \"on any and all movies\" made outside the United States.\n\nKahlon says he won't speculate about any future assistance for the B.C. film sector, because it is not clear whether this latest threat is \"real,\" or if Trump is \"trying to have a war\" with California Gov. Gavin Newsom, who has been challenging the president.\n\nThe minister says he is prepared to talk about financial support \"when the time comes,\" adding that the federal government has collected a significant amount of revenue that it has committed to channel to communities and businesses harmed by tariffs.\n\nKahlon says B.C. has already provided support for the industry that matches what other jurisdictions are offering to attract productions and that remains available.\n\nThe B.C. government has said it's difficult to tariff the film and T.V. industry because it may be written in one location, filmed in another and edited in a third place.\n\nU.S. productions do not cross the border because they want B.C. \"favours,\" but because of the available crews and their professionalism, Kahlon says.","summary":"British Columbia's Jobs Minister Ravi Kahlon says the government is taking threats by U.S. President Donald Trump to tariff B.C.-made films by 100 per cent &quot;very seriously,&rdquo; but it's unclear how such a levy would impact the industry, or if it really would be enacted.\n\nOn Monday, Trump r...","url":"https://www.castanet.net/news/BC/575200/Jobs-minister-Kahlon-says-B-C-won-t-pan-away-from-Trump-threat-to-tariff-films","image":"https://www.castanet.net/content/2025/9/4fc587eb2b59e4e9bcbb76bf68b087fc21122cdead10e1bea20c2bba35e179f0.jpg","video":null,"publish_date":"2025-09-29 23:09:00","author":"The Canadian Press,Wolfgang Depner","authors":["The Canadian Press","Wolfgang Depner"],"language":"en","category":"politics","source_country":"ca","sentiment":0.249},{"id":364659972,"title":"In some ways, we've actually been in a 40-year bull market, says David Kelly","text":"to top close Video This video is playing in picture-in-picture.\n\nMaking Money With Charles Payne September 29, 2025 05:46 \n\n In some ways, we've actually been in a 40-year bull market, says David Kelly \n JPMorgan chief global strategist David Kelly discusses stock market gains, economic growth and the impact of President Donald Trump's tariffs on 'Making Money.'\n\nTags WHAT TO WATCHSHOWSMAKING MONEY WITH CHARLES PAYNE | LATEST EPISODESMAKING MONEY WITH CHARLES PAYNEV-VIDEOSMARKETS","summary":"JPMorgan chief global strategist David Kelly discusses stock market gains, economic growth and the impact of President Donald Trump&apos;s tariffs on &apos;Making Money.&apos;","url":"https://www.foxbusiness.com/video/6380308230112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/0410638a-98dd-46e9-8259-25275cdc44eb/5f1d5781-6caa-47c5-9520-c05642d15039/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-09-29 23:08:37","author":null,"language":"en","source_country":"us","sentiment":-0.093},{"id":364654754,"title":"Internet Outrage Over Trump's AI Conspiracy Video","text":"Donald Trump stirred online outrage Monday after posting an AI-generated video of himself promising every American access to all-healing \"MedBed\" hospitals, reviving a widely debunked conspiracy theory.The deepfake video -- posted Saturday on the US president's Truth Social account --- was styled as a Fox News segment and featured his daughter-in-law Lara Trump promoting the White House's launch of a \"historic new healthcare system.\"The phony clip then purported to show Trump announcing from the Oval Office that \"every American will soon receive their own MedBed card,\" guaranteeing access to \"new hospitals led by the top doctors\" and \"equipped with the most advanced technology.\"The only problem? Such hospitals do not exist.MedBed, tied to the QAnon conspiracy movement, is an imaginary medical device equipped with futuristic technology that adherents say can cure any ailment, from asthma to cancer.Some QAnon adherents believe that \"MedBed\" technology was used to keep late president John F. Kennedy alive for years after his assassination and was purposely being denied to ordinary citizens.Trump later deleted the contentious post, without offering any explanation. There was no immediate comment from the White House.But an archived version of his post and video, which offered no disclosure that it was AI-generated, widely circulated across social media platforms.\"If 'MedBed' technology were real, it would be the greatest medical advance in generations,\" Matthew Gertz, a senior fellow at the watchdog Media Matters, wrote on X.\"Trump should have to explain why he suggested it was using the channel he makes major policy announcements, and why he deleted it after the fact.\"Fox News told US media outlet The Verge that the phony segment \"never aired on Fox News Channel or any other Fox News Media platforms.\"\"How do you bring people back to a shared reality when those in power keep stringing them along?\" asked Noelle Cook, a researcher and author of \"The Conspiracists: Women, Extremism, and the Lure of Belonging.\"Trump is no stranger to conspiracy theories and contentious health claims.Last week, the president vehemently insisted that pregnant women should \"tough it out\" and avoid the painkiller Tylenol due to an unproven link to autism and urged major changes to the standard vaccines administered to babies.The claim was dismissed by the World Health Organization, which asserted that neither Tylenol nor vaccines have been shown to cause autism.","summary":"Donald Trump stirred online outrage Monday after posting an AI-generated video of himself promising every American access to all-healing \"MedBed\" hospitals, reviving a widely debunked conspiracy theory.","url":"https://www.ibtimes.com/internet-outrage-over-trumps-ai-conspiracy-video-3784788","image":"https://d.ibtimes.com/en/full/4624443/president-donald-trump-no-stranger-conspiracy-theories-contentious-health-claims.jpg?w=1600&h=900&q=88&f=d0b351d28f793f42beb917fd5e277084","video":null,"publish_date":"2025-09-29 23:06:21","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.25},{"id":364655318,"title":"Scam agencies are tricking migrant nurses and Government departments in visa fraud schemes","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nTG4 Entertainment Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nMigrant nurses are being charged thousands of euros to come to Ireland to work jobs that never existed.Alamy Stock Photo\n\nScam agencies are tricking migrant nurses and Government departments in visa fraud schemes\n\nMigrant nurses are being left jobless and distraught in Ireland when they realise that the job they travelled here to do never existed.\n\n12.06am, 30 Sep 2025\n\nShare options\n\nA LEADING ADVOCACY group for migrant nurses working in Ireland has spoken out about “widespread” instances of recruitment agencies promising jobs that do not actually exist, leaving unsuspecting nurses unemployed once they arrive in Ireland. \n\nMigrant Nurses Ireland (MNI) is calling on nursing homes that hire nurses from abroad to ensure that they are working with legitimate agencies that are properly registered. \n\nVarghese Joy, a senior Dublin-based nurse and the convener of MNI, told The Journal that multiple agencies committing suspected visa fraud are often operating on an unlicensed basis in at least one country, when they should be licensed in both Ireland and the other country. \n\nAdditionally, these companies are also charging nurses thousands of euros in unlawful agency fees on top of the standard expenses a nurse has to pay when they come to work in Ireland in order to get a work permit, and a registration pin from the Nursing and Midwifery Board of Ireland (NMBI).\n\nVarghese Joy is a senior HSE nurse and a leading voice in promoting the rights of migrant healthcare staff.\n\nIn these instances of suspected visa fraud, the agencies are charging nurses up to €4,000 (and in some cases more) to come to Ireland for jobs that do not exist. \n\nThe Journal has spoken to one nurse who was in this situation, and did not know the job she paid to move to Ireland for was not real until after she had received a work permit through the Government’s Atypical Working Scheme. She had also completed the RCSI’s adaptation examination for overseas nurses, which essentially converts nursing qualifications and ensures they meet Irish standards. \n\nJoy told The Journal how these agencies are tricking the Department of Justice and the Department of Enterprise into issuing work permits for fake job offers. \n\nAdvertisement\n\n“These agencies secured genuine work offers for nurses in the past from nursing homes. They take the letterheads and the text body of those contracts, and they edit them and put other nurses names on them, then they submit the edited document to the Departments,” he explained. \n\nIn many cases these nurses do not know that they have paid up to €4,000 in an unlawful agency fee, on top of nearly €3,000 in legitimate fees, to come to Ireland for a fake job until they are already in the country and have passed their exams. \n\nOften, when they reach out to the agencies they are met with silence. If they manage to get in touch with the nursing homes, they realise that there was no job offer in place in the first place. \n\n“In the last year we have been hearing from nurses who are in this situation on an increasing basis. They are devastated and distraught when they realise what they have been the victim of. Many of them have young families back in India that they have come here to try and support. \n\n“We will point these nurses in the direction of legitimate agents to try and help them to secure new jobs before their work permit runs out and they have to leave the country, but we have also seen cases where they have had to leave as they couldn’t secure any employment,” Joy said. \n\nMNI is calling on the Government departments that run the Atypical Working Scheme to check with employers that job offers are real before they issue work permits. \n\nThe organisation is also urging nursing homes to make sure they work with ethical and registered companies that will not take genuine job contracts and later use them to this end. \n\nThe Department of Justice told The Journal that it is “aware” of these “matters”, but that the Department of Enterprise is chiefly overseeing the scheme.\n\n“This Department works diligently to detect instances where false or misleading information is submitted as part of an immigration application. Atypical Working Scheme applications and Visa applications undergo checks at all stages of the application process to establish if the applicant meets the criteria for the permission type applied for and to verify all information supplied,” a spokesperson said. \n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nEimer McAuley\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Scam agencies are tricking migrant nurses and Government departments in visa fraud schemes”.\n\nRecipient's Email\n\nFeedback on “Scam agencies are tricking migrant nurses and Government departments in visa fraud schemes”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nmigrant nurses ireland\n\nrecruitment agencies\nvarghese joy\n\nNews in 60 seconds\n\nThree Áras hopefuls talk defence, Gaza and immigration in first TV debate\n\n25 mins ago\n\nÁras hopefuls\nPlayer Ratings: How did the presidential candidates perform in the first TV debate? \n\n43 mins ago\n\nCreeslough investigation file forwarded to Director of Public Prosecutions\n\nLawyer for suspect in Charlie Kirk killing wants more time to review evidence\n\nKildare County Council\nShay Given's plans for €4m padel centre in Kildare halted by council\n\nDonald Trump unveils plan for peace in Gaza - with a job for Tony Blair\n\nGardaí investigate possible murder-suicide as father and daughter found dead in Dublin\n\nMan in his 30s arrested after three adults found dead at a home in Louth this morning\n\nTallanstown\nThree family members killed in Louth home named locally\n\nThree Áras hopefuls talk defence, Gaza and immigration in first TV debate\n\n25 mins ago\n\nRory McIlroy criticises fan behaviour as video shows his wife Erica being hit by beer cup\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nTG4 Entertainment Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Migrant nurses are being left jobless and distraught in Ireland when they realise that the job they travelled here to do never existed.","url":"https://www.thejournal.ie/visa-fraud-ireland-6827207-Sep2025/","image":"https://img2.thejournal.ie/article/6827207/river/?height=400&version=6827213","video":null,"publish_date":"2025-09-29 23:05:36","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":-0.158}]}