{"offset":0,"number":50,"available":31894,"news":[{"id":282515332,"title":"TikTok Remains Unavailable on US App Stores After Trump’s Executive Action","text":"TikTok remained unavailable on Tuesday for U.S. users of Google Play and Apple’s app store after President Donald Trump signed an executive order to delay a ban on the video app.\n\nA law banning TikTok in the United States over national security concerns took effect on Sunday because California-based TikTok Inc. had not been separated from its China-based parent company ByteDance.\n\nAfter going dark for hours, TikTok resumed service on Sunday evening, saying then-President-elect Trump’s promise to sign an executive order had provided “the necessary clarity and assurance” that the company could continue to operate.\n\nHowever, as of Tuesday evening, TikTok has not been restored on Google and Apple’s respective app stores, which removed TikTok on Sunday.\n\nGoogle, Apple, and TikTok didn’t immediately respond to The Epoch Times for comment.\n\nAt a Senate hearing when the bill was still being considered on the Hill, FBI Director Christopher Wray warned that ByteDance’s algorithm, coupled with the American user data that TikTok collects, would enable influence operations that are “extraordinarily difficult to detect, which is part of what makes the national security concerns represented by TikTok so significant.”\n\nTikTok successfully challenged Trump’s previous order, aimed at banning transactions with ByteDance and its subsidiaries, in federal courts.\n\nThe company’s challenge against another order requiring ByteDance to divest its U.S. assets in 90 days was held in abeyance in February 2021 so the Biden administration could review the matter and work with TikTok to reach a deal that doesn’t require divestment. A deal was never reached.\n\nTikTok has also tried to challenge the current ban and lost the case in the Supreme Court on Jan. 17.\n\nThe company dismissed the U.S. concerns about its potential threat to U.S. national security, saying that the lack of evidence of past data sharing between ByteDance and the Chinese communist regime is enough to clear it from concerns about future actions.\n\nIn its opinion, the Supreme Court said Congress singled out TikTok because its “scale and susceptibility to foreign adversary control, together with the vast swaths of sensitive data the platform collects, justify differential treatment to address the Government’s national security concerns.”\n\n“There is no doubt that, for more than 170 million Americans, TikTok offers a distinctive and expansive outlet for expression, means of engagement, and source of community,” the court said. “But Congress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikTok’s data collection practices and relationship with a foreign adversary.”\n\nSigning the executive order on Monday, Trump repeated his previous remark that he now has a “warm spot” for Tiktok, which he credited for helping him increase support among young voters.\n\nThe president has suggested that the United States can acquire half of TikTok.\n\nAfter Trump tried to separate TikTok from ByteDance in 2020, the Chinese regime updated its export restrictions to include technologies used by ByteDance, including artificial intelligence interactive interface technology and personalized information-push services based on data analysis.\n\nIn March 2023, China’s commerce department spokesperson Shu Jueting said that Beijing would “firmly oppose” any forced sale of TikTok and that any forced sale of or divestitures from TikTok “involve technology export issues” and must abide by China’s laws and regulations.\n\nOn Monday, Chinese foreign ministry spokeswoman Mao Ning told reporters that companies should be allowed to make their own decisions on their operations and acquisitions, but “if it involves Chinese companies, China’s laws and regulations should be observed.”\n\n“The idea would be to transfer all technology so it no longer engages with ByteDance going forward,” Mnuchin said of the U.S. efforts.\n\nMnuchin described TikTok as a “terrific business,” and said he and his partners have plans to rebuild its technology.\n\nHe said that currently, 60 percent of ByteDance shareholders are non-Chinese shareholders. They are mostly institutional investors such as BlackRock and General Atlantic, while the company’s founders and employees own 20 percent each.\n\nThe dynamics of private business in China is complex, as ByteDance, as long as it is operating in China under the legal and political framework of the ruling CCP, ultimately remains subject to the U.S. adversary’s laws, and could be compelled to cooperate with state directives regardless of company ownership or shareholder composition.\n\nByteDance didn’t respond to The Epoch Times’ request for comment by publication time.","summary":"The video app remains missing from Apple and Google's app stores on Tuesday evening amid TikTok's legal limbo.","url":"https://www.theepochtimes.com/us/tiktok-remains-unavailable-on-us-app-stores-after-trumps-executive-action-5796349","image":"https://img.theepochtimes.com/assets/uploads/2025/01/19/id5794943-TikTok-US-ban-GettyImages-2194468612-300x180.jpg","video":null,"publish_date":"2025-01-22 01:01:38","author":"Lily Zhou","authors":["Lily Zhou"],"language":"en","category":"politics","source_country":"us","sentiment":-0.054},{"id":282515518,"title":"Dave Portnoy reacts to TikTok debate, says he's 'very concerned' about small business owners","text":"Barstool Sports founder and president Dave Portnoy said it’s hard to underestimate the importance of TikTok for small businesses and content creators as lawmakers mull the next steps for the social media platform. \"I'm very concerned about how many people earn a living. It's huge. You can't underestimate that. And just to cut it out – and you got people who are investing in Meta writing the bills, it's all pretty confusing,\" he said Tuesday on \"The Will Cain Show.\" TikTok went dark in the United States late Saturday night after the app’s China-based parent company ByteDance failed to sell the platform to a U.S. buyer. President Donald Trump, who supported banning TikTok in 2020, signed an executive order on his first day in office Monday, giving it a 75-day extension to continue operating in the United States. Chairman of the House Select Committee on the Chinese Communist Party John Moolenaar, R-Mich., penned an op-ed explaining the next steps for TikTok. SENATOR CALLS TIKTOK ‘A WEAPON,’ SAYS THE AMERICAN PEOPLE ‘NEED TO KNOW THE CHILLING TRUTH’ ABOUT IT \"TikTok’s attempts to blame the government are deceiving. The law is not a ban, and Congress gave TikTok a straightforward path to continue operating: Sever ties with the Chinese government, and the restrictions will be immediately lifted,\" Moolenaar wrote. \"When the law was enacted last April, Congress gave ByteDance, TikTok’s Chinese parent company, 270 days to sell off its stake and relinquish control of the platform.\" \"But even as American buyers have lined up to make an offer, ByteDance has refused to discuss the possibility of a sale. In a move that is raising eyebrows, the company appears willing to watch its reportedly $50 billion U.S. operation go up in flames rather than comply with the law’s simple requirement to divest,\" he continued. In a video posted to YouTube, Portnoy said the TikTok debate reminds him of the early days of the COVID-19 pandemic when the government told businesses not to open their doors because it has to \"protect you.\" \"There are so many creators, small businesses who have worked for years, for years to build their livelihoods, their careers on TikTok. You finally become successful and the government is like, boop! Sorry, cut your legs out. You're done,\" he said in the video. Portnoy told Fox News host Will Cain he doesn’t trust any social media network and admitted he didn’t know much about how the CCP uses the app to collect user information. \"I don't have the Secret Service telling me everything they're worried about. I get the disinformation to a degree. The spying? I don't know. I'm just a common dude sitting here looking on TikTok and asking, what are they talking about?\" he explained. Trump wrote on Truth Social over the weekend that he would like to see the United States have a \"joint venture between the current owners and/or new owners whereby the U.S. gets a 50% ownership in a joint venture set up between the U.S. and whichever purchase we so choose.\" CLICK HERE TO GET THE FOX NEWS APP He added that without U.S. approval \"there is no TikTok.\" \"With our approval, it is worth hundreds of billions of dollars - maybe trillions.\"","summary":"Barstool Sports founder and president Dave Portnoy shares his thoughts on the TikTok debate on &apos;The Will Cain Show.&apos;","url":"https://www.foxnews.com/media/dave-portnoy-reacts-tiktok-debate-says-hes-very-concerned-small-business-owners","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/portnoy.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-22 00:52:06","author":"Ashley Carnahan","authors":["Ashley Carnahan"],"language":"en","source_country":"us","sentiment":0.224},{"id":282513362,"title":"The climate rules Trump has ripped-up already","text":"Moments after taking office, the new president Donald Trump issued a flurry of orders ripping up rules to protect the climate and natural world.\n\nThe broad roll back of climate policy, much of it advanced under Joe Biden’s previous administration, aims to maximise oil and gas production and lower household energy bills.\n\nMr Trump vowed to “end Biden’s policies of climate extremism”.\n\nEnvironmental groups have said they intend to challenge the orders, and it’s uncertain how effectively they will boost US fossil fuels, given levels are already at a record high.\n\nMr Trump has long called climate change a “hoax”, including in November, despite scientific consensus that it is man-made.\n\nBut his plan to “unleash American energy” included a commitment to “guarantee that all executive departments and agencies provide opportunity for public comment and rigorous, peer-reviewed scientific analysis”.\n\nWithdrawing from landmark Paris Agreement on climate\n\nLong promised, now reality: Donald Trump is pulling the US, the second-biggest climate polluter in the world, out of the most important global treaty for tackling climate change.\n\n“I’m immediately withdrawing from the unfair, one-sided Paris climate accord rip-off,” he said.\n\nStruck in 2015, the Paris Agreement was the first time countries agreed to collectively tackle global warming.\n\nTrump’s move does away with any obligations on the US government to cut planet-heating greenhouse gas emissions, and will take a year to come into effect.\n\nDitching it is more symbolic than anything, as the treaty can’t force countries to act. Meanwhile, some state governors have vowed to continue with regional climate action.\n\nBut the move will make it even harder to reach the Paris Agreement’s core goal of limiting warming to 1.5C to 2C above levels before mass fossil fuels even harder to reach.\n\nScientists were already warning the chances were “virtually zero”.\n\nCutting off cash incentives for green industries / undoing Biden’s green funding law, the IRA \n\nAnother headline-grabbing order was his immediate pause on funding for green industries, that was disbursed via Biden’s signature green legislation, the Inflation Reduction Act.\n\nTrump refers to this as the “Green New Deal” or “Green New Scam”.\n\nAll agencies must “immediately pause the disbursement of funds appropriated through the Inflation Reduction Act of 2022” the document said.\n\nThe act sought to encourage clean energy technologies like wind and solar through tax credits, which have attracted billions of dollars in new manufacturing and project investments.\n\nBiden attempted to protect the majority of that funding last week by signing off contracts to commit the money.\n\nDeclaring a national energy emergency\n\nPaving the war for a barrage of pro-fossil fuel actions to “unleash” already booming US energy production, the president also declared a national energy emergency, which gives him extra executive powers.\n\nHis administration is anxious about meeting the energy demands of AI, a booming industry.\n\nThe declaration seeks to roll back environmental restrictions on power plants, speed up construction of new plants, and ease permitting for transmission and pipeline projects.\n\n“It allows you to do whatever you’ve got to do to get ahead of that problem,” Trump told reporters while signing the order. “And we do have that kind of an emergency.”\n\nHe also promised to fill up strategic oil reserves and export US energy all over the world.\n\nLifting a freeze on LNG export permitting\n\nThe “national energy emergency” also included undoing a pause on gas exports issued by Biden last year.\n\nA report commissioned by the previous administration concluded in December that “unfettered exports of LNG” could soon outpace global demand, and would also increase domestic wholesale and household costs.\n\nPromoting oil and gas drilling in the Arctic and Alaska\n\nBiden’s efforts to protect vast Arctic lands and waters from fossil fuel extraction were also on the chopping block.\n\nHe rescinded a 2023 memo that stopped drilling across millions of acres.\n\n“We will be a rich nation again, and it is that liquid gold under our feet that will help to do it,” the new president said.\n\nWith another order to “UNLEASH ALASKA’S EXTRAORDINARY RESOURCE POTENTIAL”, Trump hopes to “maximise the development and production of the natural resources” on state and federal lands in Alaska.\n\nThe order will accelerate permitting and “prioritise the development of Alaska’s liquified natural gas (LNG) potential”.\n\nIt’s unclear if the moves will be enough to attract oil majors, who have previously shied away from the region due to high costs.\n\nPutting people over fish\n\nAnother memo vows to “Putting People over Fish: Stopping Radical Environmentalism to Provide Water to SouthernCalifornia“.\n\nHe hopes to solve California’s complex water problems by undoing protections on a species of fish called the delta smelt, protections he says divert precious water from human use.\n\nStopping wind farm leases\n\nOn the campaign trail, Trump railed against offshore wind – and recently told the UK to ditch its “windmills”.\n\nYesterday, he wasted no time in enforcing an indefinite pause on new leases for offshore wind projects in federal waters.\n\nBut he went one step further, also pausing approvals, permits and loans for both onshore and offshore wind projects, subject to a review by his new interior secretary Doug Burgum.\n\nThe memorandum cited costs and impact on the environment and fishing industry.\n\nTrump wants to free up space for oil and gas production, which comes with its own environmental impacts.\n\nScrapping electric vehicle targets\n\nTrump has also ditched a 2021 Biden order that aimed for half of all new vehicles sold in the US by 2030 to be electric.\n\n“The United States will not sabotage our own industries while China pollutes with impunity,” Trump said on Monday afternoon.\n\nBiden’s administration sought to encourage electric vehicle use by offering a consumer subsidy for new EV purchases, and by imposing tougher tailpipe emissions standards on carmakers.\n\nTrump’s bromance with Tesla billionaire Elon Musk did not persuade him to maintain the mandate, which has in fact given Tesla’s competitors a leg-up.","summary":"Moments after taking office, the new president Donald Trump issued a flurry of orders ripping up rules to protect the climate and natural world. The broad roll back of climate policy, much of it advanced under Joe Biden&#8217;s previous administration, aims to maximise oil and gas production and lower household energy bills. Mr Trump vowed &#8230;\n\n\nThe post The climate rules Trump has ripped-up already appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/the-climate-rules-trump-has-ripped-up-already/","image":"https://e3.365dm.com/25/01/1600x900/skynews-denali-mount-mckinley_6806536.jpg?20250121161927","video":null,"publish_date":"2025-01-22 00:45:20","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.197},{"id":282513690,"title":"Trump sets stage for a wild four years with social media dismissals and clashes with press on his first full day","text":"Trump sets stage for a wild four years with social media dismissals and clashes with press on his first full day\n\nPresident Donald Trump kept up a hectic pace of appearance on his first full day \n\nLISTEN: Welcome to MAGAland, our podcast on the latest inside the White House\n\nBy ROB CRILLY, CHIEF U.S. POLITICAL CORRESPONDENT FOR DAILYMAIL.COM AT THE WHITE HOUSE\n\nPublished: 00:31 GMT, 22 January 2025 | Updated: 00:43 GMT, 22 January 2025\n\n'Here I am,' said Donald Trump as season two of his presidency began Monday. \n\n'The American people have spoken.'\n\nSince then he has been a man in a hurry. In his first half day he delivered two more speeches, attended three inaugural balls and, in yet another Trumpian break with tradition, answering journalists' question while signing a slate of executive orders in the Oval Office.\n\nHe faces a race against the deadline facing all presidents: The moment he becomes a lame duck.\n\nTrump showed how he plans to tackle it during his first full day in office on Tuesday (episode two), simply swamping the media with an avalanche of events and headlines.\n\nHe went to church, met his congressional leadership team and unveiled plans for a huge AI venture, all before discussing everything from TikTok to Jan. 6 pardons in a question and answer session with reporters.\n\nBut Tuesday's news began in the most Trumpian way possible, with an early morning firing by social media post.\n\n00:28: 'You're fired'\n\nPresident Donald Trump used his Truth Social platform to start the day with action\n\nChef Jose Andres from the President's Council on Sports, Fitness and Nutrition (left) and Gen. Mark Milley from the National Infrastructure Advisory Council (right) were publicly fired on Truth Social by Trump\n\nReporters who got used to the leisurely pace of the Biden White House get their first reminder that Trump operates on a different clock.\n\nPhones buzz at 28 minutes past midnight. Inauguration day is technically over but the president is dropping messages on his Truth Social platform.\n\nThis one announces that the White House personnel office is combing through lists of Biden appointees and names the first four to be fired, including some high-profile critics. \n\n'Jose Andres from the President’s Council on Sports, Fitness and Nutrition, Mark Milley from the National Infrastructure Advisory Council, Brian Hook from the Wilson Center for Scholars, and Keisha Lance Bottoms from the President’s Export Council—YOU’RE FIRED!'\n\nMilley, for example, was quoted in a recent book saying Trump was 'fascist to the core.' \n\n9:00 am The White House wakes up\n\nThere is no Marine guard outside the West Wing's front door, a sign that Trump has not yet made it down from the residence to his office.\n\nIt is perhaps not surprising after a late night on inauguration day. After the ceremonial occasion of being sworn in, an impromptu press conference in the Oval Office, he attended three inaugural balls, arriving home to the White House at 12:51 am.\n\nThe rest of the White House is coming to life. A handful of staff are in the press areas, learning how to log on to their new computers.\n\n11:18 am National prayer service\n\nTrump and First Lady Melania arrived for the national prayer service at Washington National Cathedral on Tuesday morning, a day after the inauguration\n\nThey took their place in the pew beside Vice President J.D. Vance and his wife Usha\n\nTrump takes a seat in Washington National Cathedral, beside First Lady Melania, and Vice President J.D. Vance and his wife Usha.\n\nThe president has sometimes displayed a little unfamiliarity with the Bible (famously holding it upside down in a photo op) and matters of church practice (once digging in his pocket for dollars to put on a communion plate, which he mistook for collection plate in Iowa.)\n\nBut the day after the inauguration means heading to the cathedral for an interfaith prayer service.\n\nTrump looked every inch the bored schoolboy dressed up in his Sunday best as he slouched in a pew. \n\n'Bless all who dedicate themselves to governing in our land,' went one of the prayers. \n\n'Fill them with the love of truth and strength to uphold our democracy and the rule of law enable us to people at peace among ourselves and a blessing to other nations of the World.'\n\n12:20 pm A lecture on mercy \n\nRev. Mariann Budde leads the national prayer service\n\nTrump no doubt expects to get criticism from all corners of America as he embarks on a crackdown on illegal immigration and a rejection of 'diversity, equity, and inclusion' policies.\n\nBut he might not expected to be on the receiving end of a lecture on compassion and mercy at a service held in his honor.\n\nRev. Mariann Budde seized her moment to urge the president directly to show mercy to gay, lesbian and transgender children who 'fear for their lives.\n\n'And the people, the people who pick our crops and clean our office buildings, who labor in poultry farms and meat packing plants, who wash the dishes after we eat in restaurants and work the night shifts in hospitals,' she continued.\n\n'They may not be citizens or have the proper documentation. But the vast majority of immigrants are not criminals.'\n\nTrump appeared to look down at his feet while beside him Vice President J.D. Vance raised his eyebrows. \n\nAfterwards, Trump was asked what he thought of the sermon.\n\n'Not too exciting, was it? I didn't think it was a good service,' was his scathing response. 'No...They can do much better.'\n\n3:20 pm Meeting with Republican leaders\n\nAfter lunch it was on to congressional matters and a meeting with Republican leaders in the Cabinet Room.\n\nHouse Speaker Mike Johnson, Senate Majority Leader John Thune went first. Then other other top party figures were expected to fill out a bigger meeting in their first formal sit-down with the new president to plot how they want to use Republican power in Washington.\n\nThey control the White House, House of Representatives and the Senate, offering a plum opportunity to drive through legislation, at least for the next two years.\n\nBut Johnson and Thune will need to broach the prickly issue of the approaching debt ceiling and try to get Trump onside to avoid the threat of a government shutdown.\n\nWhite House officials said the Republican leaders would appear outside the West Wing to answer questions about the meeting.\n\nBut when they failed to appear a reporter asked whether that meant it had gone badly. \n\n'It went great,' said a senior administration official.\n\n5:20 pm Stargate has liftoff\n\nTrump announces launch of Stargate with Oracle co-founder Larry Ellison (second from right), SoftBank CEO Masayoshi Son and OpenAI CEO Sam Altman (far right) in the Roosevelt room\n\nTrump arrived in the Roosevelt Room for his final public event of the day with the chief executives of Oracle, OpenAI, and Softbank.\n\nThey announced a joint artificial intelligence venture called Stargate. (The name is a classic Trump move, coopting the title of a 1980s sci-fi movie.) \n\n'So put that name down in your books, because I think you're going to hear a lot about it in the future,' he said.\n\n'A new American company that will invest $500 billion at least, in AI infrastructure in the United States, and move and very, very quickly, moving very rapidly, creating over 100,000 American jobs almost immediately.'\n\n5:37 pm Question time with Trump\n\nStargate is quickly forgotten as Trump signals he is ready to answer journalists' questions.\n\nWith three tech titans now standing awkwardly beside him, the president is asked to defend his pardons for Jan. 6 convicts who assaulted police officers. \n\n'These people have already served years in prison, and they have served them viciously,' he said, relishing the chance to spar with reporters.\n\n'It's a disgusting prison. It's been horrible, it's inhumane.'\n\nTrump took questions for 30 minutes at the end of a major AI announcement\n\nAnd then he was off to the races, enjoying the back and forth. \n\nHe discussed his meeting with members of Congress, outlined his plans to travel to North Carolina, California and Nevada on Friday, his thoughts on finding an American buyer for TikTok, his plans to talk to Russian President Vladimir Putin 'very soon,' how Chinese President Xi could help end the war in Ukraine, the letter left for him in the Resolute Desk by Joe Biden, removing Secret Service protection from his former National Security Adviser John Bolton ('I thought he was a very dumb person'), the death toll in Ukraine, and so on.\n\nHalf an hour after he started taking questions he said he was done. \n\n'I'm going to have to go now' he said. \n\nBut he could not resist answering one last question about whether he had TikTok on his phone.\n\nNo. 'I think I'll get it right now,' he said with a smile, no doubt sending a shiver down the spines of his national security officials who believe the app scours American phones for the Chinese Communist Party.\n\n7:12 pm A pardon by social media post\n\nTwelve minutes after the White House called a 'lid' (meaning no more public events), Trump turned to social media once again, this time to pardon Ross Ulbricht.\n\nHe was founder of the notorious dark web site Silk Road. It allowed users to buy and sell goods and services anonymously, and came to be used for drug deals and even allegedly by people looking for hitmen.\n\nUlbricht was eventually convicted of engaging in a continuing criminal enterprise, narcotics trafficking, money laundering, and computer hacking\n\n'I just called the mother of Ross William Ulbricht to let her know that in honor of her and the Libertarian Movement, which supported me so strongly, it was my pleasure to have just signed a full and unconditional pardon of her son, Ross,' Trump wrote on his Truth Social site.\n\nWhite HouseDonald TrumpPoliticsWashington DC\n\nShare or comment on this article:\nTrump sets stage for a wild four years with social media dismissals and clashes with press on his first full day\n\nAdd comment","summary":"'Here I am,' said Donald Trump in his inaugural address Monday. 'The American people have spoken.'","url":"https://www.dailymail.co.uk/news/article-14309403/donald-trump-day-white-house.html","image":"https://i.dailymail.co.uk/1s/2025/01/22/00/94371917-0-image-m-21_1737505872803.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/21/1874605968561423933/1024x576_MP4_1874605968561423933.mp4","publish_date":"2025-01-22 00:43:51","author":"Editor,Rob Crilly","authors":["Editor","Rob Crilly"],"language":"en","source_country":"gb","sentiment":0.272},{"id":282515512,"title":"Trump signs 'full and unconditional' pardon of Silk Road creator Ross Ulbricht","text":"President Donald Trump on Tuesday signed a full and unconditional pardon of Ross Ulbricht, the founder of the anonymous marketplace website Silk Road, which the president promised to do on the campaign trail \"on day one.\" \"I just called the mother of Ross William Ulbri[c]ht to let her know that in honor of her and the Libertarian Movement, which supported me so strongly, it was my pleasure to have just signed a full and unconditional pardon of her son, Ross,\" Trump wrote in a social media post on Tuesday. \"The scum that worked to convict him were some of the same lunatics who were involved in the modern day weaponization of government against me. He was given two life sentences, plus 40 years. Ridiculous!\" Ulbricht was convicted because his website, which was founded in 2011 and used cryptocurrency for payments, was used to sell illegal drugs, even though he did not sell any of the illicit substances himself. In May, Trump delivered a speech at the Libertarian National Convention to a hostile crowd of boos in an attempt to win over Libertarian voters. Libertarians believe government investigators overreached in their case against Silk Road and generally oppose the War on Drugs. TRUMP FAILED TO DELIVER ‘DAY 1’ PROMISE TO GRANT CLEMENCY TO ROSS ULBRICHT, FOUNDER OF SILK ROAD While the attendees were not favorable to Trump for most of the event, they did give a big cheer when he said he would commute Ulbricht's sentence to time served, as the crowd chanted \"Free Ross\" in the hopes that the then-presidential candidate would take action if elected to allow the Silk Road founder to return home to his family after more than a decade behind bars. \"If you vote for me, on day one I will commute the sentence of Ross Ulbricht, to a sentence of time served. He’s already served 11 years. We’re going to get him home,\" Trump told the crowd of Libertarians, many of whom were holding signs that read \"Free Ross.\" Ulbricht reacted to Trump's comments the following day on the social media platform X. TRUMP PARDONS NEARLY ALL 1/6 DEFENDANTS \"Last night, Donald Trump pledged to commute my sentence on day 1, if reelected,\" he wrote. \"Thank you. Thank you. Thank you. After 11 years in prison, it is hard to express how I feel at this moment. It is thanks to your undying support that I may get a second chance.\" Last month, Ulbricht wrote: \"For my last monthly resolution of 2024, I intend to study every day and to get up to speed as much as I can as I prepare for freedom.\" Trump later reiterated his promise to commute Ulbricht's life sentence at a bitcoin conference, which he received loud cheers for. CLICK HERE TO GET THE FOX NEWS APP While Trump failed to deliver his promise to free Ulbricht on his first day back in office, he followed through on day two. Ulbricht, now 40, operated the website from 2011 until his arrest in 2013. He was sentenced two years later to life in prison. Fox News Digital's Landon Mion contributed to this report.","summary":"President Donald Trump on Tuesday pardoned Ross Ulbricht, the founder of the anonymous marketplace website Silk Road, which the president promised to do on day one.","url":"https://www.foxnews.com/politics/trump-signs-full-unconditional-pardon-silk-road-creator-ross-ulbricht","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/2024-05-26t041132z_1253750819_rc21y7ay0wjr_rtrmadp_3_usa-election-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-22 00:40:11","author":"Greg Wehner","authors":["Greg Wehner"],"language":"en","source_country":"us","sentiment":-0.178},{"id":282512814,"title":"Trump's pardons will embolden far-right groups,  experts say","text":"A day after U.S. President Donald Trump’s sweeping grant of clemency to all of the nearly 1,600 people charged in connection with the 2021 attack on the U.S. Capitol, America’s far-right celebrated. Some called for the death of judges who oversaw the trials. Others partied and expressed relief. Some even wept with joy.Several experts who study extremism said the extraordinary reversal for rioters who committed both violent and nonviolent crimes on Jan. 6, including assaulting police officers and seditious conspiracy, will embolden the Proud Boys and other extremist groups such as white supremacists who have openly called for political violence.In a few pen strokes, Trump reversed the largest U.S. Justice Department investigation and prosecution in history, as he attempted to rewrite what happened during the violent riot on Jan. 6, 2021. As he took office for a second term on Monday, Trump continued to claim, falsely, that the 2020 election was rigged and that he was the rightful winner. He has described the riots as a peaceful 'day of love” rather than a melee aimed at overturning the results of the 2020 U.S. presidential election.","summary":"In a few pen strokes, Donald Trump reversed the largest U.S. Justice Department investigation and prosecution in history.","url":"https://www.japantimes.co.jp/news/2025/01/22/world/politics/trump-pardons-proud-boys-far-right/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/01/22/447327.JPG?v=3.1","video":null,"publish_date":"2025-01-22 00:38:00","author":"Joseph Tanfani,Nathan Layne,Ned Parker,Peter Eisler,Web Master","authors":["Joseph Tanfani","Nathan Layne","Ned Parker","Peter Eisler","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.436},{"id":282514944,"title":"New Hegseth allegations emerge","text":"New Hegseth allegations emerge\n Peter Hegseth, President Donald Trump's Defense secretary pick, is facing new allegations, this time from his former sister-in-law, who claims the former Fox News host made his second wife fear for her safety. Hegseth's lawyer has denied the allegations. Nikole Killion has the details.","summary":"Peter Hegseth, President Donald Trump's Defense secretary pick, is facing new allegations, this time from his former sister-in-law, who claims the former Fox News host made his second wife fear for her safety. Hegseth's lawyer has denied the allegations. Nikole Killion has the details.","url":"https://www.cbsnews.com/video/new-hegseth-allegations-emerge/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2025/01/22/60397cf0-eaa3-4b06-9b39-308b04411469/thumbnail/1200x630/3a487f7d6c11ade83e4166cb344d94fd/0121-en-killion.jpg?v=b37f0cace52a6645c18f53563f47da2c","video":null,"publish_date":"2025-01-22 00:37:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.086},{"id":282511164,"title":"Project Stargate: Trump Plots With Larry Ellison, Sam Altman On $500B AI Initiative","text":"On Donald Trump‘s first full day in office for his second presidential term, he gathered Oracle founder Larry Ellison, OpenAI CEO Sam Altman and Softbank chief Masayoshi Son at the Roosevelt Room in the White House to unveil a $500 billion artificial intelligence named after a 1994 Roland Emmerich sci-fi film about intergalactic portals.\n\n The plan for the project, titled Stargate, is to build campuses that can provide energy for increasingly powerful artificial intelligence tools, which sap much more energy than, say, a typical Google search. The first data center campus was announced to be located in Abilene, Texas, with SoftBank, OpenAI, Oracle and MGX as initial equity funders and Arm, Microsoft, NVIDIA, Oracle and OpenAI as tech partners.\n\n “We have to get this stuff built,” Trump said in his prepared remarks that the President riffed off of, promising 100,000 jobs in the U.S. “So they have to produce a lot of electricity and we’ll make it possible for them to get that production done very easily at their own plants if they want, where they’ll build at the plant, the AI plant they’ll build energy generation and that will be incredible.”\n\n Trump put it in terms that he was most familiar with: “I was in the real estate business. These buildings, these are big, beautiful buildings. They’re going to employ a lot of people.”\n\n When Ellison — whom Trump called the “CEO of everything” — took the podium, he added more detail, “The data centers are actually under construction. The first of them are under construction in Texas. Each building is a half a million square feet. There are 10 buildings currently, currently being built, but that will expand to 20 and other locations beyond the Abilene location, which is our first location.”\n\n While artificial intelligence tools have flooded the market since OpenAI revealed ChatGPT to the public in November 2022, tech giants are now contending with Wall Street’s increasing focus on how AI will be used by everyday consumers and ultimately become profitable for the companies.\n\n The race to build infrastructure domestically is one key component for the industry, and Silicon Valley executives have lobbied Donald Trump to help speed the way to build data centers in the country. “We’re going to make it as easy as it can be,” said the President. “This is money that normally would have gone to China.”\n\n Trump observed, “AI seems to be very hot. It seems to be the thing that a lot of smart people are looking at very strongly.”","summary":"Yes, that's the name of a 1994 Roland Emmerich movie. It's now a big infrastructure project to help power tech giants' foray into AI.","url":"https://www.hollywoodreporter.com/business/business-news/stargate-trump-openai-ellison-1236114430/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/01/GettyImages-2194585249.jpg","video":null,"publish_date":"2025-01-22 00:36:34","author":"Erik Hayden","authors":["Erik Hayden"],"language":"en","source_country":"US","sentiment":0.035},{"id":282511440,"title":"Exclusive Behind-the-Scenes Footage Showcases the Strong Bond Between Trump Siblings","text":"Behind the scenes footage from Donald Trump’s inauguration day has revealed how close his children – and grandchildren – really are.\n\nFrom the president’s youngest son Barron photobombing his half-sisters, to his eldest Donald Jr tearing up as he was sworn in, the 2025 inauguration was a family affair.\n\nAll five of the president’s children – Donald Jr, 47, Ivanka, 43, Eric, 41, Tiffany, 31, and Barron, 18 – along with his granddaughter Kai, 17, were present for the ceremony and the celebratory events that followed.\n\nDon Jr., Ivanka and Eric are Trump’s eldest kids from his marriage with Ivana Trump, a Czechoslovakian fashion model and businesswoman who became a US citizen in 1988. She died in 2022.\n\nTiffany is the daughter of the president and his second wife, actress and model Marla Maples, while Barron is Trump’s youngest son, shared with his current wife and First Lady Melania. \n\nBarron photobombs his half-sisters \n\nNYU student Barron hilariously photobombed his half-sisters – Ivanka and Tiffany Trump – and their sister-in-law Lara Trump as they posed for photographs in the US Capitol building ahead of the inauguration on Monday. \n\nThe 6-foot-9 tall teen snuck behind the group, in a moment caught by a Washington Post reporter. \n\nThe sneaky move prompted a laugh from Ivanka, 43, who swiveled around and playfully patted Barron on the back while saying: ‘That’s the best!’\n\nTiffany and Lara also turned around in shock and smiled at the surprise interjection. \n\nEric and Barron snap a selfie \n\nIn a post shared to Instagram, Donald’s sons Eric Trump and Barron Trump posed for a selfie inside the U.S. Capitol Building – where the inauguration ceremony was moved to due to frigid outdoor temperatures.\n\nEric appeared to snap the photo with his front-facing phone camera while six-foot-nine Barron towered behind his older brother. \n\nThe second eldest Trump brother then posted the selfie to his 2.8 million Instagram followers.\n\nKai Trump shows off her dazzling look \n\nThe President’s 17-year-old granddaughter, Kai Trump, took to Instagram to share her dazzling look for the inaugural ball on Monday evening. \n\nIn photos and videos posted to her account, Trump’s eldest grandchild sparkled in an off-white beaded gown with a corset bodice and thigh-high slit designed by Sherri Hill.\n\n‘Inaugural ball dance ready @sherrihill,’ she captioned a video of herself showing off the dress.\n\nEarlier in the day, the teen vlogger gave her YouTube subscribers an exciting behind-the-scenes glimpse of events leading up to Trump’s inauguration.\n\nIn the vlog, Kai revealed that she had been given a number of Sherri Hill dresses for the busy weekend. \n\n‘This is Sherri Hill,’ she said, showing off the gowns, which came in red, navy, and gold.\n\n‘She sent me some dresses and they’re amazing. All my ball gowns are Sherri Hill.’\n\nLara Trump stops Eric making hand gesture \n\nEric Trump caught the attention of conspiracy theorists after they spotted him making a specific hand gesture during his father’s inauguration. \n\nHe placed his hands in an upside-down triangle-like formation which eagle-eyed viewers claim looks similar to the symbol for the Freemasons or the mysterious ‘Illuminati’.\n\nThey also highlighted how Eric’s wife Lara Trump appeared to mutter something to him before he abruptly changed his stance. \n\nThe incident in question occurred as the couple were lining up alongside President Donald Trump’s other children inside the Capitol Rotunda where the ceremony was held on Monday.\n\nEric was taking his place on the right hand side of the podium where his father was sworn in when he made the gesture.\n\nHis wife then tapped him on the arm to get him to shuffle over and said something inaudible which caused him to drop his hands.\n\nDonald Trump Jr tears up as his father is sworn in \n\nDon Jr ran through the widest possible range of emotions on Monday as his father was sworn in as the 47th president of the United States. \n\nHe first grinned as Donald Trump completed the oath of office.\n\nThen as ‘Hail to the Chief’ rang around the Capitol’s Rotunda and Joe Biden stepped forward to shake his father’s hand, his eyes misted over and shone bright with tears.\n\nHis smile appeared to stiffen as if he was fighting back a wave of emotion as the proud son of a new president.\n\n‘Have you ever been more excited about a Monday? American strength is back,’ he posted on X ahead of the ceremony.\n\nBarron is praised as ‘a true gentleman’\n\nThe president’s teenage son gave the outgoing president and vice present firm handshakes after the swearing-in ceremony.\n\nThe gesture of peace led fans to praise the New York University freshman as ‘a gentleman’ and ‘raised well.’\n\n‘[Melania] brought up a true gentleman wow I’ve never seen a classier 18 year old,’ one person said. \n\n‘Smart young man. Knows his way around the room,’ a second person said. ‘He is very impressive & clearly, raised well,’ a third said.\n\nLater in the evening, the teenager’s suave demeanor and apparent enjoyment of the limelight prompted people to speculate that he could one day follow in his father’s footsteps and become president himself. \n\nBarron was close to his father as he was sworn in, and alongside the tech titans that Trump has welcomed into his vision for his second term.\n\nThe freshman at NYU took on a more mature role at the events this time around, as he was just 10 years old when Trump entered the White House the first time in 2017. \n\n‘There has been some talk that Barron might be next in line to the Trump political dynasty,’ said Executive Politics Editor Kelly Laco in the latest episode of Welcome to Magaland: Inside Trump’s second 100 Days. \n\n‘He was right behind his father… we might be able to see a little more of Barron and a more mature and more of a political role down the line.’\n\nExes were also on display – including Don Jr.’s Kimberly Guilfoyle \n\nKimberly Guilfoyle was a guest at the presidential inauguration – and so was his new partner Bettina Anderson – but it was the Palm Beach socialite who ended up floating in the arms of Donald Trump Jr. last night.\n\nDespite her recent split with his son, President Trump’s pick for ambassador to Greece Guilfoyle squeezed into the indoor swearing-in ceremony on Monday morning, seated towards the back of the audience.\n\nMeanwhile, Bettina, 38, wearing a hounds-tooth Dolce and Gabbana suit, was in the crowd as well, a little more front and center.\n\nSecuring a place in the Capitol Rotunda in Washington DC was no small feat given the need to make room for the likes of tech movers and shakers Amazon’s Jeff Bezos, Google’s Sundar Pichai and Meta’s Mark Zuckerberg.\n\nOne source told DailyMail.com that even some eight-figure donors had to be left out of the event.\n\nHowever, Bettina was notably absent from the Presidential Inauguration Ball. \n\nInstead, Donald Trump Jr, 47, walked onto the stage at the black-tie event with his 17-year-old daughter Kai – who is one of the five children he shares with ex-wife Vanessa. \n\nDon Jr. dances with his kids \n\nAs President Trump’s other children were joined by their other halves, Donald Jr happily danced with his youngest daughter Chloe. \n\nChloe, who he shares with his ex-wife Vanessa, was seen happily twirling as she held her father’s hand. \n\nMeanwhile, Kai and her brother Donald III swayed on stage too. \n\nIvanka dresses like Audrey Hepburn \n\nThough Ivanka has said she doesn’t plan to move back to Washington DC with her husband Jared Kushner, she stole the show on inauguration day in her white ballgown. \n\nIvanka stunned in a custom recreation of Audrey Hepburn’s iconic 1954 couture gown. \n\nThe First Daughter took to the stage with her husband Kushner, 44, to share in a romantic dance during the Liberty Ball in Washington, D.C., on Monday evening.\n\nThe mother-of-three opted for the elegant, strapless white gown that contained a long flowing skirt and intricate black floral detailing.\n\nThe dress was a recreation of a Hubert de Givenchy’s 1954 Haute Couture black-and-white gown that was originally designed for Audrey in the film Sabrina.\n\nIvanka’s rep said that she was ‘honored’ to wear the gown and ‘incredibly grateful for Arnault family and the Givenchy atelier for creating this masterpiece, capturing the original artistry and elegance with remarkable precision and craftsmanship.’\n\n‘Audrey Hepburn has long been a personal inspiration to Ivanka,’ they added. \n\n‘She views it as a great privilege to honor her legacy in this way, and is incredibly grateful to the team at Givenchy for bringing this moment to life.’ \n\nTiffany shows up despite being pregnant \n\nTiffany is expecting her first child with her husband Michael Boulos, she announced last year. \n\nAlthough she has been a constant support for her father, Tiffany largely stays out of politics. \n\nDuring the 2024 Republican National Convention, she didn’t appear on stage but went skiing instead.","summary":"Internewscast Journal\n\nInternewscast\n\n\nBehind the scenes footage from Donald Trump&#8217;s inauguration day has revealed how&#8230;\n\n\nThis Post: Exclusive Behind-the-Scenes Footage Showcases the Strong Bond Between Trump Siblings first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/exclusive-behind-the-scenes-footage-showcases-the-strong-bond-between-trump-siblings/","image":"https://i.dailymail.co.uk/1s/2025/01/22/00/94364307-14310121-Barron_Trump_was_seen_hilariously_photobombing_a_picture_with_hi-m-43_1737504945055.jpg","video":null,"publish_date":"2025-01-22 00:34:25","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.467},{"id":282512812,"title":"Bishop pleads with Trump to 'find compassion' for LGBTQ, immigrants","text":"During President Donald Trump's inaugural prayer service on Tuesday, Bishop Mariann Edgar Budde, leader of the Episcopal diocese of Washington, made a direct plea to the president to \"have mercy\" on gay, lesbian, transgender children, as well as immigrants in the country. This appeal came just a day after Trump issued several executive orders focused on transgender rights and immigration.\"I ask you to have mercy upon the people in our country who are scared now,\" Budde said. \"There are gay, lesbian and transgender children in Democratic, Republican and independent families, some who fear for their lives.\" 117438796Budde also addressed Trump's promise to enact mass deportations and turn away refugees and asylum-seekers, saying, \"I ask you to have mercy, Mr. President, on those in our communities whose children fear that their parents will be taken away and that you help those who are fleeing war zones and persecution in their own lands to find compassion and welcome here.\"Trump, seated in the front pew, occasionally looked down, while Vice President JD Vance glanced at his wife before seemingly raising his eyebrows in surprise.Meanwhile, when asked by a reporter later what he thought of the service, Trump responded, \"Did you like it? Did you find it exciting? Not too exciting was it? I didn't think it was a good service, no. They could do much better.\" https://www.youtube.com/watch?v=hJ5OXf2kqdwThe direct appeal to Trump at the start of his first full day as president was a remarkable moment at an event that has not historically been political, according to many. They saw Budde's candid sermon as a sign of the alarm in Washington and beyond over his immigration agenda and blitz of executive actions focused on gender identity. Budde was flooded with messages of support from people hailing her \"courage\". \"Wow. A bishop just called out Trump and Vance to their faces at church,\" said a podcast cast host on X. A man with Democrat in his also praised the bishop and said, \"HAHAHA! Trump is FURIOUS after being called out by Bishop Mariann Edgar Budde,\" adding, \" Trump’s fragile ego has been badly damaged!\"— NoLieWithBTC (@NoLieWithBTC) — harryjsisson (@harryjsisson) Meanwhile, Rep Mike Collins was irked by the sermon and said, \"The person giving this sermon should be added to the deportation list.\" Other people also jumped on social media to oppose the bishop's action. \"They can leave America now while there is still time or cry me a River,\" said an entrepreneur according to his X profile. — RepMikeCollins (@RepMikeCollins) — Newsweek (@Newsweek) In an interview, Budde explained that she decided to speak to him directly because \"of the fear that I have seen and experienced among our people -- people that I know and love, both within the immigrant community and within the LGBTQ community, and how terrified so many are.\"Bishop Budde, aged 65, holds the distinction of being the first female spiritual leader of the Episcopal Diocese of Washington, a position she has maintained since 2011.Prior to her Washington appointment, she served as rector at St. John's Episcopal Church in Minneapolis for close to twenty years. She completed her education at the University of Rochester in upstate New York, and spent her formative years between New Jersey and Colorado. The diocese under her leadership, encompassing the National Cathedral, had arranged for a prayer service to be held the day following the inauguration, irrespective of the election results. She confirmed her commitment to deliver the sermon, regardless of who emerged victorious.","summary":"In her plea to President Trump during his inaugural prayer service, Bishop Mariann Edgar Budde urged him to show compassion towards gay, lesbian, transgender children, and immigrants. Trump reacted dismissively to the service, which highlighted the fears faced by LGBTQ and immigrant communities under his administration's policies. Budde's bold address garnered both praise and criticism.","url":"https://timesofindia.indiatimes.com/world/us/have-mercy-bishop-pleads-with-donald-trump-to-find-compassion-for-lgbtq-immigrants-video/articleshow/117440725.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117440808/117440808.jpg","video":null,"publish_date":"2025-01-22 00:33:12","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":0.169},{"id":282511276,"title":"Fact Check: Did Trump Raise Prescription Drug Prices?","text":"President Donald Trump has been accused of raising prescription drug prices for seniors by immediately rescinding former President Joe Biden's executive order to lower costs after beginning his second term on Monday.Amid an avalanche of executive orders from Trump on Inauguration Day, Biden's executive order 14087, \"Lowering Prescription Drug Costs for Americans,\" was among several dozen that Trump reversed in an order targeting the \"recession of harmful executive orders and actions.\"Biden's order directed the Department of Health and Human Services to explore strategies to reduce costs. The U.S. Centers for Medicare & Medicaid Services (CMS) responded to the order with programs to cap the price of certain generic drugs at $2 for Medicare beneficiaries, improve Medicaid access to high-cost cell and gene therapies and to streamline the evidence-gathering process for new drugs.The Claim\"Donald Trump rescinded Biden's action to lower prescription drug costs for Americans on Medicare and Medicaid,\" Democratic Senator Adam Schiff of California wrote on Monday in a post X, formerly Twitter. \"There's no other way to spin it. That means more money out-of-pocket for seniors and families. Big Pharma first. Ordinary people last.\"In a post to X shortly after Trump signed the order on Monday night, Representative Jimmy Gomez, also a California Democrat, wrote that \"President Trump just took a step to increase prescription drug costs for millions of Americans.\"Lawyer Tristan Snell, who successfully prosecuted a New York state civil suit against Trump University, also accused the president of raising drug prices on Tuesday, writing on X that Trump had raised \"drug costs by as much as 4200%.\"\"He just reversed all the cost caps Biden negotiated for anyone on Medicare or Medicaid, over 120 MILLION Americans,\" Snell wrote. \"He's pro Big Pharma -- and pro Big Insurance. He doesn't care about you. It was all LIES.\"The FactsWhile Trump's reversal of Biden's order did not immediately change any existing laws and regulations on prescription drug pricing for Medicare and Medicaid, it did create uncertainty about the federal government's approach to addressing prescription drug costs.Dr. Mark McClellan, director of the Margolis Institute for Health Policy at Duke University and CMS administrator during the George W. Bush administration, told Newsweek that \"just because [Biden's executive order] was withdrawn does not necessarily mean that the payment reform pilots that are in process (on $2 generic drugs or [Sickle Cell Disease] gene therapy access) will be.\"\"They could be withdrawn, but the new administration could also choose to continue or to build on these specific programs,\" McClellan added. \"I havent seen any statements on that yet.\"Geoffrey Joyce, the director of Health Policy at the University of Southern California's Schaeffer Center for Health Policy & Economics, told Newsweek that the $2 Medicare drug list model that emerged due to Biden's order might have had a \"modest impact\" on costs, while it was \"hard to assess the magnitude\" of impacts for the other two CMS proposals.However, Joyce suggested that Trump's decision to quickly reverse Biden's order and potentially block any associated lowering of prescription drug costs was at odds with the president promising to lower drug prices while campaigning for a second term.\"The irony of this is that Trump campaigned on lowering drug prices yet does this on day 1 or 2?\" Joyce said in an email. \"I'm afraid it's only the beginning of seemingly inconsistent and/or incoherent health policies.\"Political analyst Craig Agranoff told Newsweek via text message on Tuesday that Trump's decision \"could have significant implications for the average American.\"\"While the immediate impact depends on how pharmaceutical companies respond, this move potentially opens the door for drug prices to rise,\" Agranoff said. \"Biden's order aimed to rein in costs by promoting price transparency and competition, which are critical for making life-saving medications affordable.\"\"Without those measures, companies could have more flexibility to set higher prices,\" he added. \"For many Americans, particularly those on fixed incomes or without comprehensive insurance, this change may lead to increased financial strain and limit access to essential medications.\"The RulingNeeds Context.Trump's rescission of Biden's order is unlikely to immediately increase the cost of prescription drugs for Medicare and Medicaid recipients. However, it could potentially make it easier for drug companies to raise prices in the future, although the extent and the timing of any impact is unclear.FACT CHECK BY NEWSWEEK","summary":"Trump reversed former President Joe Biden's order on \"Lowering Prescription Drug Costs for Americans\" on Monday.","url":"https://www.newsweek.com/fact-check-did-trump-raise-prescription-drug-prices-2018607","image":"https://d.newsweek.com/en/full/2570266/donald-trump-prescription-drug-prices-fact-check.jpg","video":null,"publish_date":"2025-01-22 00:31:06","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.201},{"id":282513462,"title":"Hongkongers to keep forfeiting flat deposits at high rate, agents forecast","text":"More homebuyers in Hong Kong surrendered their deposits on new flat purchases last year, and property agents expect such defaults to continue at a high level amid elevated interest rates and uncertainty about the direction of the city’s property market.\nA report from property agency Centaline showed that 449 buyers of first-hand property forfeited their deposits last year, a 75 per cent increase from a year earlier. The final quarter saw 104 such cases, just short of triple the 40 cases in the third quarter. The agency did not report the value of the forfeited deposits, but the typical initial deposit is HK$100,000 (US$12,844), according to market sources.\nThe number of default cases will stay high in the short-term, agents said.\n“As the market will be busy after Lunar New Year, and developers will be offering discounts, we expect the number of defaults on new property units to remain high,” said Yeung Ming-yee, a senior associate director at Centaline. “There will be around 100 such cases in the first quarter of 2025.”\nThe number may decline over the longer term after the government reduced mortgage requirements for buyers of unfinished flats late last year, agents said.\nForfeits indicate either that buyers are not able to move forward with their purchases, or that they expect to find significantly better deals.\nFlats that originally sold while prices were peaking between December 2019 and December 2021 resold at discounts of 25 per cent or more from their initial purchase prices, Centaline’s report said.\nOne such case was an 865 sq ft flat in Kai Tak that sold at HK$29,558 per square foot in December 2019, but resold for 30 per cent less at HK$20,809 per square foot after the initial buyer cancelled the transaction in December.\n\nIn lockstep with the US Federal Reserve, the Hong Kong Monetary Authority raised interest rates on 11 occasions between March 2022 and July 2023, pushing them to a 23-year high. A policy-easing cycle began in September.\nWith a further reduction in borrowing costs in October and December, most of the units that were abandoned by buyers found new owners, albeit often at lower prices, the report on Tuesday said.\nGiven an uncertain economic outlook, defaults could go either way this year, said Derek Chan, head of research at Ricacorp Properties.\n“We hope the overall economy will show a stable and positive trend, along with the possibility of continued interest-rate cuts,” he said. “Additionally, banks are also relatively easing their mortgage arrangements, which may help improve the situation regarding defaults.”\nDefault cases could fall below 400 in this scenario, Chan said.\nOn the other hand, with sales of new homes estimated to rise by about 7 per cent this year to 18,000 units, a potentially protracted pause on interest-rate easing and a sluggish economy could combine to “lead to a proportionally higher number of potential defaults”, he added.\nMeanwhile, with US President Donald Trump threatening more tariffs on Chinese exports, another bruising trade war could erupt between the world’s two largest economies.\n“There is currently no clear direction,” Chan said. “We hope that the US-China relations will not be too poor, as this would impact Hong Kong property.”\nThe Quinn Square Mile in Tai Kok Tsui, a project by Henderson Land, logged 15 transaction cancellations in 2024, topping all developments, followed by Grand Jete Phase Two in Tuen Mun by Sun Hung Kai Properties (SHKP) and CK Asset, at 11 cases, according to Centaline.\nAll buyers in these transactions defaulted on their further deposits, which are usually 5 to 7 per cent of the total property price.\nSeparately, SHKP said on Tuesday that it planned to offer nearly 2,000 units in the first quarter of 2025.\nThe offerings include Yoho West in Tin Shui Wai, the second phase of Cullinan Sky in Kai Tak, and a development in Sai Sha in Sha Tin.\n“The government has attracted abundant new residents through various talent schemes, in addition to incoming non-local students, which will amplify the demand for housing and drive up rents,” said Victor Lui Ting, a deputy managing director with the developer. “We expect rents and property prices to go up together.”","summary":"Deposit defaults on new homes shot up by 75 per cent to 449 last year, and property agents see the trend continuing into 2025.","url":"https://www.scmp.com/business/article/3295691/hongkongers-keep-forfeiting-flat-deposits-high-rate-agents-forecast","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/21/0136ea67-4077-4e05-ab1f-232ce847f431_ebdaa9fc.jpg","video":null,"publish_date":"2025-01-22 00:30:08","author":"Cheryl Arcibal,Leopold Chen","authors":["Cheryl Arcibal","Leopold Chen"],"language":"en","source_country":"cn","sentiment":-0.53},{"id":282515516,"title":"AI executives praise Trump's Stargate project: 'This is a very large investment that affects all of humanity'","text":"The three tech CEOs who have joined forces in President Donald Trump's multi-billion dollar artificial intelligence infrastructure project defended the venture as an investment that \"impacts all of humanity.\" \"This is a very large investment that affects all of humanity,\" Oracle founder Larry Ellison told Fox News chief political anchor Bret Baier on \"Special Report\" on Tuesday. President Trump unveiled a massive AI infrastructure project from the private sector on the first full day of his second term in office on Tuesday. TRUMP ANNOUNCES LARGEST AI INFRASTRUCTURE PROJECT ‘IN HISTORY' INVOLVING SOFTBANK, OPENAI AND ORACLE During a speech at the White House, Trump announced that Softbank, OpenAI and Oracle have joined forces for a project called Stargate to build data centers in the U.S. for powering AI. Ellison emphasized the Stargate investment could bring a \"revolution\" in healthcare and other industries. \"It's really a revolution in medicine. But it's a revolution in many other industries as well. Medicine just touches us all,\" he said. \"Yes, it takes a huge investment, but the result of the investment will be vaccines that prevent cancers, personalized medicine where we never again run into a problem like COVID-19 before because we get an early warning. We know when COVID starts, when there are a handful of patients, rather than having to wait until it's become an epidemic and very difficult to control.\" The initial investment for the project will be $100 billion, with plans to expand to $500 billion over the next four years. The first data center built under the initiative will be in Texas, and it will eventually expand to other states. A LOOK AT PRESIDENT TRUMP'S FIRST FULL DAY IN THE WHITE HOUSE \"This means we can create A.I. and A.G.I. in the United States of America. {it] wouldn't have been obvious that this was possible,\" OpenAI CEO Sam Altman said. \"I think with a different president it might not have been possible. But we are thrilled to get to do this, and I think it'll be great for Americans, great for the whole world.\" Altman conceded A.I. pioneers need to be \"responsible\" and develop the technology \"carefully.\" \"I think people are really good, and people will do, on balance, incredible things with this technology. The scale of this investment obviously is huge. And what I think that says about the likely progress of the technology, at least what all of us believe, is correspondingly huge. But I have enormous faith will figure it out,\" he said. Trump was working to drum up private business investments in the U.S. prior to his second term. Last month, Son joined Trump in announcing Softbank's plans for a $100 billion investment in America aimed at generating 100,000 new jobs. \"For the better humanity of our future, we need big capital to invest into the project. We cannot do it with a small money. We have to do the big investment for the good of humanity,\" SoftBank CEO Masayoshi Son said, touting Trump's vow to usher in a golden age in America. A White House official told FOX Business that post-election, Trump has now secured $1 trillion in private investment for the U.S. in various projects. CLICK HERE TO GET THE FOX NEWS APP FOX Business' Breck Dumas contributed to this report.","summary":"OpenAI CEO Sam Altman, Oracle founder Larry Ellison and SoftBank CEO Masayoshi Son defend President Donald Trump&apos;s Stargate project on &apos;Special Report.&apos;","url":"https://www.foxnews.com/media/ai-executives-praise-trumps-stargate-project-this-very-large-investment-affects-all-humanity","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/1200/675/video-2025-01-21t182912.872.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-22 00:29:13","author":"Madeline Coggins","authors":["Madeline Coggins"],"language":"en","category":"politics","source_country":"us","sentiment":0.137},{"id":282513494,"title":"Trump says he could sanction Russia over Ukraine","text":"US President Donald Trump says he will likely impose sanctions on Russia if Vladimir Putin, refuses to negotiate about ending the war in Ukraine.\n\nTrump gave no details on possible additional sanctions. The United States has already sanctioned Russia heavily for its invasion of Ukraine in February 2022.\n\nTrump said his administration was also looking at the issue of sending weapons to Ukraine, adding his view that the European Union should be doing more to support Ukraine.\n\n\"We're talking to (Ukrainian President Volodymyr) Zelenskiy, we're going to be talking with President Putin very soon,\" Trump told reporters on Tuesday.\n\n\"We're going to look at it.\"\n\nTrump said he had pressed Chinese President Xi Jinping in a call to intervene to stop the Ukraine war.\n\n\"He's not done very much on that. He's got a lot of ... power, like we have a lot of power. I said, 'You ought to get it settled.' We did discuss it.\"\n\nEarlier on Tuesday Zelenskiy said that at least 200,000 European peacekeepers would be needed to prevent a new Russian attack after any ceasefire deal.\n\nThe Ukrainian leader, speaking at the World Economic Forum in Davos, Switzerland a day after Trump returned to power following months of promises to end the war in Ukraine quickly, also urged European leaders to do more to defend the continent.\n\nThe prospect of a rapid settlement has focused minds in Kyiv and Europe on the urgent need for security guarantees to prevent any future Russian attack, with the idea of peacekeeping force circulating.\n\n\"From all the Europeans? 200,000, it's a minimum. It's a minimum, otherwise it's nothing,\" Zelenskiy said when asked about the idea of a peacekeeping contingent on an interview panel after delivering his speech.\n\nThat number is around the size of the entire French armed forces, estimated at just over 200,000 by France's defence ministry in 2020.\n\nZelenskiy said at least that number would be needed as a security guarantee if Russia's armed forces totalled 1.5 million personnel and Ukraine had only half that number.\n\nZelenskiy said such a force would only be part of the security guarantees that Ukraine needed.\n\nThe Ukrainian leader said Kyiv was working to set up a meeting between himself and Trump.\n\n\"The teams have been working on a meeting, they are currently in the process,\" Zelenskiy said.\n\nTrump has said he would stop the war in Ukraine swiftly, without saying how.\n\nZelenskiy said Ukraine would not agree to Russian demands that it drastically reduce the size of its military, predicting that Putin would demand Ukraine cut its armed forces to a fifth of their size.\n\n\"This is what he wants. We will not allow this to happen,\" Zelenskiy said.","summary":"Ukrainian President Volodymyr Zelenskiy has urged European leaders to do more to defend his nation as Donald Trump says he might impose sanctions on Russia.","url":"https://thewest.com.au/news/conflict/trump-says-he-could-sanction-russia-over-ukraine-c-17466028","image":"https://images.thewest.com.au/publication/C-17466028/1e13c7c83daff460f4f0b05d83be3c82409f72e1-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-22 00:28:40","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.338},{"id":282510310,"title":"Furious Trump supporters slam bishop urging Christian tolerance for migrants, LGBTQ community","text":"Allies of President Donald Trump furiously criticized the bishop who pleaded with the Republican to show “mercy” towards migrants and the LGBT+ community.\n\nTrump and his family attended a National Prayer Service at the National Cathedral in Washington, D.C. Tuesday. Hours prior, he signed a slew of executive orders, many of which included hard-line immigration policies — such as ending birthright citizenship — while another denied the existence of transgender, nonbinary and intersex people throughout the government.\n\nAt the service, Episocal Bishop Mariann Edgar Budde called on Trump to “have mercy” for the “scared” LGBT+ children and immigrant families across the country.\n\n“There are gay, lesbian, and transgender children in Democratic, Republican, and independent families — some who fear for their lives,” Budde pointedly said directly to Trump.\n\n“I ask you to have mercy, Mr. President, on those in our communities whose children fear their parents will be taken away, and that you help those who are fleeing war zones and persecution in their own lands to find compassion and welcome here,” she added.\n\nNow, Trump’s MAGA allies aren’t happy.\n\nSenator Tommy Tuberville, a Republican from Alabama, condemned Butte’s speech in a Newsmax interview Tuesday.\n\n“For this bishop to do this to President Trump after a weekend of, as you said, talking about God more than ever,” Tuberville said, “talking about how he was spared to give an opportunity maybe to change this country back to something that it should be, it just absolutely amazes me how far these people go.”\n\nRepresentative Mike Collins, a Georgia Republican, inexplicably called for Budde to be deported: “The person giving this sermon should be added to the deportation list.”\n\nBudde was born in New Jersey in 1959 and is a U.S. citizen — therefore, she cannot be deported.\n\nTrump’s friend and informal faith adviser Robert Jeffress, who attended the service, also criticized Budde and claimed the audience was filled with “palpable disgust” by her words.\n\n“Attended national prayer service today at the Washington National Cathedral during which Bishop Mariann Edgar Budde insulted rather than encouraged our great president @realDonaldTrump,” he wrote on X.\n\nTrump was asked about the service as he left the event.\n\n“Did you like it?” Trump asked, speaking to reporters. “Did you find it exciting? Not too exciting, was it?”\n\n“I didn’t think it was a good service, no,” he continued. “They can do much better.”\n\nThe Independent has contacted Budde for comment.","summary":"Bishop Mariann Budde implored Trump to ‘have mercy’ on ‘scared’ migrants and LGBTQ+ community","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-national-prayer-service-speech-reaction-b2683911.html","image":"https://static.independent.co.uk/2025/01/21/20/2195123436.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/GBbhzeNY-4VHSaSK0.mp4","publish_date":"2025-01-22 00:28:11","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.005},{"id":282513240,"title":"Meta ex-COO Sandberg sanctioned in investor lawsuit for deleting emails","text":"WILMINGTON, Delaware : Meta Platforms' former chief operating officer, Sheryl Sandberg, was sanctioned by a judge on Tuesday for deleting emails related to litigation over Facebook's Cambridge Analytica privacy scandal, despite being told to preserve the messages.\n\nThe judge, Vice Chancellor Travis Laster, of Delaware Chancery Court, said evidence showed Sandberg used a personal account under a pseudonym and erased messages that were likely relevant to the shareholder lawsuit.\n\nThe sanction will make it harder for Sandberg to tell her side of the story and avoid liability at the eight-day, non-jury trial scheduled for April. The judge also ordered her to pay the expenses related to the sanctions motion incurred by the shareholders, which include California's huge teachers' retirement system known as CalSTRS.\n\n\"Because Sandberg selectively deleted items from her Gmail account, it is likely that the most sensitive and probative exchanges are gone,\" Laster wrote in his opinion published on Tuesday.\n\nMeta and an attorney for Sandberg did not immediately respond to a request for comment.\n\nSandberg had argued she was forthcoming about the personal account and rarely used it for business and when she did, others were copied on the messages so the information was preserved.\n\nLaster imposed a higher standard of \"clear and convincing evidence,\" rather than \"preponderance\" of evidence, for Sandberg's affirmative defenses, which are her arguments and evidence for why she should not be held liable.\n\nThe case was brought in 2018, when it emerged that Facebook allowed data from millions of users to be accessed by Cambridge Analytica, a political consulting firm that worked for Donald Trump's successful campaign for U.S. president in 2016.\n\nShareholders sued the company's directors and officers for allegedly harming investors by continually violating a 2012 consent order with the Federal Trade Commission to protect users' data. \n\nShareholders also allege the company's board bargained to pay a larger fine of $5 billion to the FTC in 2019 so that founder Mark Zuckerberg would not have personal accountability. Zuckerberg is expected to be deposed for a second time before the start of the trial, according to court records.\n\nIn 2023, Laster refused to dismiss the lawsuit, which he said was a \"case involving alleged wrongdoing on a truly colossal scale.\"\n\nShareholders also asked Laster to sanction Jeffrey Zients, who was former President Joe Biden's chief of staff and who also used and deleted personal emails when he was on Meta's board. The judge said that Zients' messages were less pertinent because he joined the Meta board in 2018, after the Cambridge Analytica scandal, and was not a company officer.","summary":"","url":"https://www.channelnewsasia.com/business/meta-ex-coo-sandberg-sanctioned-investor-lawsuit-deleting-emails-4888256","image":"https://dam.mediacorp.sg/image/upload/s--m8wzaw_d--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-22t003117z_2_lynxnpel0l00r_rtroptp_3_meta-platforms-lawsuit-sand","video":null,"publish_date":"2025-01-22 00:28:00","author":null,"language":"en","source_country":"sg","sentiment":-0.319},{"id":282512148,"title":"Trump rescinds guidance protecting ‘sensitive areas’ from immigration raids","text":"The administration of newly inaugurated United States President Donald Trump has revoked longstanding protections barring immigration raids on schools, hospitals, churches and other “sensitive areas”.\n\nThe announcement on Tuesday arrives as part of Trump’s attempts to fulfil a campaign-trail pledge to launch a campaign of “mass deportation”.\n\nAccording to government estimates, as many as 11 million undocumented people live in the United States, many of them cornerstones in their families and communities.\n\nFor more than a decade, federal agencies have issued guidance against carrying out immigration enforcement efforts in places like schools and medical centres, on the basis that such raids might discourage people from seeking necessary services.\n\nImmigration and Customs Enforcement (ICE) implemented its policy in 2011. Customs and Border Protection (CBP) followed suit in 2013.\n\nBut in Tuesday’s statement, the Trump administration accused that guidance of serving to “thwart law enforcement” efforts.\n\nIt framed the new directive, repealing the protections, as a form of empowerment for immigration agencies.\n\n“Criminals will no longer be able to hide in America’s schools and churches to avoid arrest,” the statement said. “The Trump Administration will not tie the hands of our brave law enforcement, and instead trusts them to use common sense.”\n\nTrump has long conflated irregular migration with criminality. On the campaign trail last year, he repeatedly raised examples like that of Laken Riley, a 22-year-old student who was allegedly murdered by an undocumented person.\n\nHe has also used dehumanising language to refer to migrants and asylum seekers.\n\n“The Democrats say, ‘Please don’t call them animals. They’re humans.’ I said, ‘No, they’re not humans. They’re not humans. They’re animals,’” he said in April, while referring to the Riley case.\n\nStudies, however, have repeatedly shown that undocumented immigrants commit far fewer crimes than native-born US citizens.\n\nHuman rights groups have warned that Tuesday’s decision could force undocumented people, including children, into precarious situations, cut off from vital services.\n\n“This action could have devastating consequences for immigrant families and their children, including U.S. citizen children, deterring them from receiving medical attention, seeking out disaster relief, attending school, and carrying out everyday activities,” the Center for Law and Social Policy said in a statement.","summary":"For more than a decade, agencies like ICE and CBP avoided raids on places that provide vital services, like hospitals.","url":"https://www.aljazeera.com/news/2025/1/22/trump-rescinds-guidance-protecting-sensitive-areas-from-immigration-raids?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/01/2025-01-21T225517Z_1524837936_RC2MECAG7S83_RTRMADP_3_USA-TRUMP-1737504498.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-01-22 00:26:21","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.412},{"id":282513464,"title":"Trump says he is mulling 10 per cent tariff on imports from China, starting February 1","text":"US President Donald Trump said he is considering 10 per cent tariffs on imports from China, starting on February 1, as a penalty for the flow of fentanyl, which is responsible for thousands of deaths in the US annually.\n“We’re talking about a tariff of 10 per cent on China, based on the fact that they’re sending fentanyl to Mexico and Canada,” Trump said in his first press conference after his inauguration on Tuesday.\nTrump said after his swearing-in on Monday that he is considering 25 per cent tariffs on the US’ two North American neighbours, also to start on February 1, to push them to stop shipments of the opioid from coming into the US, but did not mention China.\nThe new US leader did not announce any tariffs on China on his inauguration day, despite earlier vows to do so on his first day in office. Instead, he directed federal agencies to investigate China’s “unfair trade practices” as one of his priorities under his goal to “overhaul the US trade system to protect American workers and families”.\n\nTrump added in the press conference that he and Chinese President Xi Jinping, whom he invited to his inauguration, “didn’t talk much” about the tariffs during their call on Friday, adding that Xi knows “where I stand”.\nOn Friday, Xi and Trump spoke by phone, marking their first call since 2020. They discussed contentious issues from trade to fentanyl, with both indicating a willingness to address strains in bilateral ties.\nThe US has long criticised China of being responsible for the fentanyl crisis in the US, accusing Chinese chemical companies of producing fentanyl precursors that trade globally.\nThe US Drug Enforcement Administration estimated in a report last month that nearly 70 per cent of drug overdoses in the country were caused by opioids such as fentanyl in 2023.\nTrump’s order on Monday to investigate China’s trade practices requires an assessment of whether Beijing had acted “in accordance” with its trade agreement with the US, referring to a phase-one trade deal reached between the two countries in Trump’s first term.\nIn 2018, Trump began imposing tariffs on more than US$300 billion worth of imported Chinese goods and pushed Beijing to sign the agreement, which required the country to buy an additional US$200 billion of American goods and services in a two-year period.\nTrump often bragged that the deal was “the best” he had ever made. But after it was signed in January 2020, Beijing fell well short of the target, in part because the Covid-19 pandemic-related supply chain disruptions hampered trade.\nTrump’s pick to lead the Treasury, Scott Bessent, suggested in his confirmation hearing last week that Trump could use tariffs as a negotiation tactic to revive a talk on the phase-one deal with China.\nTrump has threatened during his presidential campaign that the tariff on China could rise to 60 per cent or more on specific products like electric vehicles. He did not indicate whether higher tariffs would apply on China since he took office.\nAlthough Xi did not attend Trump’s inauguration in-person, he sent Chinese Vice-Presiden Han Zheng, who met US Vice-President J.D. Vance on Sunday.\nHan told Vance in their meeting that China is willing to strengthen dialogue with the US on trade, citing the “huge common interesting and room for cooperation” between the two nations in this field.\nAdditional reporting by Robert Delaney in Washington","summary":"The US president is framing the possible tariff as a penalty for the flow of fentanyl from Canada and Mexico.","url":"https://www.scmp.com/news/china/diplomacy/article/3295721/trump-says-he-mulling-10-cent-tariff-imports-china-starting-february-1","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/22/da30da80-166b-46e6-90fe-4f6f7571c987_fbcca368.jpg","video":null,"publish_date":"2025-01-22 00:26:06","author":"Kawala Xie","authors":["Kawala Xie"],"language":"en","source_country":"cn","sentiment":-0.286},{"id":282511168,"title":"Trump says he's considering a 10% tariff on China beginning as soon as Feb. 1","text":"President Donald Trump said that his team was discussing a 10% tariff on China and that the duty could take effect as early as Feb. 1.\n\n\"We're talking about a tariff of 10% on China based on the fact that they're sending fentanyl to Mexico and Canada,\" the president said, speaking to reporters at the White House on Tuesday evening.\n\n\"Probably Feb. 1 is the date we're looking at,\" he added.\n\nTrump also noted on Tuesday that his team is talking about a tariff of \"approximately 25%\" on Mexico and Canada. \n\nHe made similar comments a day earlier, noting that levies on Mexico and Canada could take place as early as February.\n\n\"We're thinking in terms of 25% (levies) on Mexico and Canada, because they're allowing a vast number of people\" over the border, he said on Monday.\n\nWhile campaigning in 2024, Trump had threatened imposing tariffs upward of 60% on Chinese goods. As recently as November, he called for \"an additional 10% Tariff\" on China, according to a post on his social media platform Truth Social.\n\nCorrection: An earlier version of this story misstated which countries would be subject to a 25% levy. Those nations are Mexico and Canada.","summary":"On Tuesday, President Donald Trump floated a 10% duty on China, with an expected start date of Feb. 1.","url":"https://www.cnbc.com/2025/01/21/trump-says-hes-considering-10percent-tariff-on-china-beginning-as-soon-as-feb-1.html","image":"https://image.cnbcfm.com/api/v1/image/108090119-17375005662025-01-21t225517z_1524837936_rc2mecag7s83_rtrmadp_0_usa-trump.jpeg?v=1737500598","video":null,"publish_date":"2025-01-22 00:24:46","author":"Darla Mercado","authors":["Darla Mercado"],"language":"en","source_country":"us","sentiment":0.116},{"id":282511662,"title":"Hundreds Of January 6 Capitol Rioters Freed From Jail After Trump Order","text":"Hundreds of Donald Trump supporters who had been serving prison sentences for participating in the Jan. 6, 2021, attack on the U.S. Capitol were freed on Tuesday, after the new president pardoned more than 1,500 people, including some who assaulted police officers.The Federal Bureau of Prisons said 211 people had been released from federal facilities following Trump's order.Trump's sweeping pardon — which went further than his allies had signaled they expected — drew condemnation from police who battled the mob, their families and lawmakers, including some of the president's fellow Republicans.A majority of Americans disapproved of Trump's decision, a Reuters/Ipsos poll completed on Tuesday found.Among those released was Stewart Rhodes, the former leader of the far-right Oath Keepers group, who had been serving an 18-year sentence after being found guilty of plotting to use force to prevent Congress from certifying Trump's 2020 defeat to Joe Biden.\"It's redemption, but also vindication,\" Rhodes told reporters outside the Washington D.C. jail, where a crowd of Trump supporters waited for more prisoners to be released.Rhodes, who did not enter the Capitol on Jan. 6, said he did not have any regrets and still believed Trump's false claims that he lost that election due to fraud. Rhodes had been released earlier in the day from a separate facility in Cumberland, Maryland, after Trump commuted his sentence.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Trump ordered clemency for everyone charged in the assault, when a mob of his supporters stormed the Capitol in an unsuccessful effort to overturn his election defeat. Some 140 police officers were injured in the rampage, which sent lawmakers running for their lives.'THE MAN WHO KILLED MY BROTHER'Craig Sicknick, whose brother, Capitol Police Officer Brian Sicknick, was assaulted during the riot and died of multiple strokes the next day, called Trump \"pure evil\" on Tuesday.\"The man who killed my brother is now president,\" he told Reuters.\"My brother died in vain. Everything he did to try to protect the country, to protect the Capitol - why did he bother?\" Sicknick said. \"What Trump did is despicable, and it proves that the United States no longer has anything that resembles a justice system.\"Trump's order extended from the people who committed only misdemeanors such as trespassing all the way to those who served as ringleaders for the assault.Nearly 60% of respondents in the two-day Reuters/Ipsos poll, which was conducted starting immediately after Trump took office on Monday, said he should not pardon all of the Capitol defendants.One of Trump's fellow Republicans, Senator Thom Tillis, said sparing rioters who assaulted police sent a wrong message.\"I saw an image today in my news clippings of the people who were crushing that police officer. None of them should get a pardon,\" Tillis told Reuters in a hallway interview. \"You make this place less safe if you send the signal that police officers could potentially be assaulted and there is no consequence.\"Others welcomed Trump's decision. Republican Representative Lauren Boebert said she would offer tours of the Capitol to defendants after they are released.Among those released earlier in the day was Enrique Tarrio, the former leader of the far-right Proud Boys group.Tarrio was not present at the Capitol on Jan. 6, but was sentenced to 22 years, longer than for any other defendant, after he was convicted of seditious conspiracy for his role in planning the attack.CAMPAIGN PROMISETrump's pardons went further than many of his allies had signaled. Both Vice President JD Vance and Trump's attorney general choice Pam Bondi had previously said they believed people who committed violence would not be pardoned.White House spokesperson Karoline Leavitt defended the pardons, claiming without evidence that many of the convictions were politically motivated.\"President Trump campaigned on this promise,\" she said on Fox News. \"It should come as no surprise that he delivered on it on Day One.\"More than 1,000 defendants pleaded guilty rather than go to trial, including 327 who pleaded guilty to felonies, according to Justice Department statistics.One protester, Ashli Babbitt, was shot dead by police during the Jan. 6 riot as she tried to force her way into the House of Representatives chamber. Four officers who responded that day later died by suicide.Trump's were not the only pardons on Monday: Outgoing President Joe Biden in his final hours in office pre-emptively pardoned five members of his own family, a move that followed his pardon last year of son Hunter Biden, who had been charged with tax fraud and an illegal firearms purchase.Republican Senator Susan Collins said both presidents had acted wrongly, calling it a \"terrible day for our Justice Department.\" Tillis also criticized Biden's pardons.Trump's action shutters the largest investigation in Justice Department history, including more than 300 cases that had still been pending. Prosecutors filed dozens of motions to dismiss cases on Tuesday morning, federal court records showed.TRIAL COMES TO ABRUPT ENDIn Washington, the trial of Kenneth Fuller and his son Caleb, who faced felony charges of obstructing police during a civil disorder, came to an abrupt end on Tuesday.Federal judges in Washington - including some Trump appointees - have handled Capitol riot cases for years and expressed alarm at the events of the day. At a November hearing, Trump-nominated U.S. District Judge Carl Nichols said a blanket Jan. 6 pardon would be \"beyond frustrating or disappointing,\" according to a court transcript.The judge presiding over the Fullers' trial, Colleen Kollar-Kotelly, ordered it dismissed without discussion, noting that her ruling satisfied what she called Trump's edict.Speaking to reporters afterward, Caleb Fuller, 22, said that he and his parents popped a bottle of champagne in their hotel room after hearing Trump's decision on Monday night.Fuller said he didn't witness any violence during the riot.\"I didn't see anyone get hurt,\" he said. \"So I feel like everyone that was around me is deserving of a pardon.\" (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Hundreds of Donald Trump supporters who had been serving prison sentences for participating in the Jan. 6, 2021, attack on the U.S. Capitol were freed on Tuesday, after the new president pardoned more than 1,500 people.","url":"https://www.ndtv.com/world-news/hundreds-of-january-6-capitol-rioters-freed-from-jail-after-trump-order-7529245","image":"https://c.ndtvimg.com/2025-01/dr1pnlts_capitol-rioters-freed-from-jail_625x300_22_January_25.jpeg","video":null,"publish_date":"2025-01-22 00:24:08","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"in","sentiment":-0.667},{"id":282511442,"title":"Pardons granted by Trump on January 6 cause division within the GOP: From the Politics Department.","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail.\n\nSign up to receive this newsletter in your inbox every weekday here.\n\nIn today’s edition, we break down how members of his party are reacting to his sweeping pardons of Jan. 6 defendants. Plus, Steve Kornacki takes a historical look at the position JD Vance now finds himself in: the vice president to a president who can’t seek another term.\n\n— Adam Wollner\n\nTrump’s Jan. 6 pardons split the GOP\n\nOf all the executive orders President Donald Trump signed on his first day in office, the one that reverberated the most across Washington was his move to pardon Jan. 6 rioters. \n\nWith the stroke of a pen, Trump issued pardons to roughly 1,500 criminal defendants and commuted the sentences of 14 others in connection with the Jan. 6, 2021, attack on the U.S. Capitol. He also ordered the dismissals of hundreds of cases that were still being prosecuted.\n\nAs Scott Wong, Frank Thorp V, Kate Santaliz and Katie Taylor report, the Jan. 6 pardons drew pushback from a handful of Republican senators. They quickly found themselves back in the spot they were often in a few years ago: responding to Trump’s latest action or comment. \n\nThe reactions generally fell into four camps. \n\nThere those who were outwardly critical of the Jan. 6 pardons, particularly for people who were convicted of committing violence against police officers. Sen. Lisa Murkowski, R-Alaska, said she was “disappointed” by Trump’s move and worried about the message it sent to the officers who defended the Capitol that day. \n\nSen. Thom Tillis, R-N.C., said “I just can’t agree” with Trump’s pardons. \n\nThere were those who did not vocally criticize Trump but declined to support the decision. “The president made that decision. You’ll have to ask him. I will not defend it,” said Sen. Mike Rounds, R-S.D.\n\nSen. Josh Hawley, R-Mo., said that if he were president he would not have offered pardons to people who committed violence on Jan. 6, but he added that Trump followed through on his campaign promise.\n\nThere were those who brushed aside the questions and tried to turn the focus to Joe Biden’s decision to pardon his family in his last minutes as president. \n\nSenate Majority Leader John Thune, R-S.D., said he is “looking forward to the next four years, not the last four,” when he was pressed about Trump’s decision.\n\n“Would you guys ask the same questions of Biden?” Thune said when he was asked what message it sends to officers who were attacked that day. \n\nAnd then there were those who celebrated the pardons. Some members of the far-right House Freedom Caucus, such as Reps. Andy Biggs, R-Ariz., and Chip Roy, R-Texas, went to a Washington jail where Jan. 6 inmates were being released. \n\nWhat Trump is saying: He defended the Jan. 6 pardons during a news conference Tuesday, Katherine Doyle reports. \n\n“They’ve served years in jail,” Trump said in response to questions from reporters at the White House on why he pardoned violent offenders. “They should not have served, and they’ve served years in jail. And murderers don’t even go to jail in this country.”\n\nWhat current and former prosecutors are saying: People in the Justice Department and legal scholars are calling the move an unprecedented and dangerous use of the pardon power that dealt a crushing blow not just to federal law enforcement, but to the U.S. justice system, as Ken Dilanian and Ryan J. Reilly report. \n\n“I don’t think that’s OK,” Jason Manning, who spent years as a line prosecutor working on Jan. 6 cases in Washington, told NBC News in an exclusive interview. “I find the pardons appalling.”\n\nWhat to know from Day 2 of the Trump presidency\n\nBeyond the fallout from the Jan. 6 pardons, Day 2 of Trump’s tenure again brought a flurry of news. Here are the top lines:\n\nTrump announced a joint venture with OpenAI, Oracle and SoftBank to invest billions of dollars in artificial intelligence infrastructure in the United States.Trump met with congressional Republicans at the White House, where they discussed their legislative strategy and the possibility of using recess appointments to confirm Cabinet nominees. Democratic attorneys general filed lawsuits seeking to block Trump’s attempt to revoke the right to automatic birthright citizenship. It’s one of several executive actions that are likely to face pushback from the courts. The Department of Homeland Security announced it is rescinding the restrictions that kept Immigration and Customs Enforcement agents from conducting arrests in “sensitive locations,” such as schools, churches or day care centers, even during weddings or funerals, as NBC News reported the new administration had planned.The Trump administration fired four top officials at the Justice Department’s Executive Office of Immigration Review, which oversees U.S. immigration courts. The bishop leading the inaugural prayer service Tuesday urged Trump to “have mercy” on his constituents, specifically naming LGBTQ people and immigrants.\n\nVance takes on a unique role as a second-term VP\n\nWhen he was sworn in Monday, JD Vance instantly assumed a unique perch on the political stage: as the vice president to a term-limited president.\n\nRather than waiting eight years (and spending the next four promoting his boss’ re-election efforts), Vance enters office with the 2028 Republican presidential nomination wide open. It’s a position that six previous vice presidents have enjoyed since the enactment of the 22nd Amendment, which capped presidential service at two terms.\n\nAll but one of those six nursed presidential ambitions of their own, though only three actually managed to secure their party’s next nomination — with just one, George H.W. Bush in 1988, winning the presidency.\n\nThe two most recent VPs in Vance’s position both declined to run. In Dick Cheney’s case, there was no drama; he forswore any presidential ambitions in exchange for an enormously influential role in George W. Bush’s administration. In 2016, Joe Biden made his desire to run clear but relented in the face of some unsubtle discouragement from Barack Obama and other Democratic leaders.\n\nAnd way back in 1952, Alben Barkley, who’d been picked as Harry Truman’s running mate in 1948 (three years after Truman had assumed office), angled for the Democratic nomination at a time when convention deal-making — and not the primary process — was decisive. But concerns about his age, 74, led delegates to look elsewhere. \n\nThe three vice presidents other on the list came to office with obvious ambitions. Both Richard Nixon in 1960 and Al Gore in 2000 had served in popular administrations and enjoyed strong relationships with party leaders, who helped to clear the way for them. George H.W. Bush in 1988 was also part of a popular administration, but while he was ultimately successful, his path to the GOP nomination was trickier. He had run against Ronald Reagan in the 1980 primaries and spent his vice presidency trying to persuade skeptical conservatives that he was no longer the moderate he’d positioned himself as in that campaign.\n\nThere’s no reason to believe Vance isn’t also interested in becoming his party’s next standard-bearer. And he starts off in a seemingly solid position. He is a skillful communicator, and his performance during the campaign was well-received within the GOP. More important, he’s a Trump loyalist with personal ties to the president’s sons. And Trump himself seems to have a fondness for Vance that he never expressed toward Mike Pence, his previous VP. \n\nGiven the unparalleled sway Trump holds with Republicans, a seamless, Trump-blessed elevation of Vance to the top of the 2028 GOP ticket is conceivable. Also conceivable: that at some point in the next four years, Vance will look up and find his path irrevocably blocked by a shift in Trump’s view of him.\n\nThat’s all From the Politics Desk for now. Today’s newsletter was compiled by Adam Wollner and Faith Wardwell.\n\nIf you have feedback — likes or dislikes — email us at [email protected]","summary":"Internewscast Journal\n\nInternewscast\n\n\nWelcome to the online version of From the Politics Desk, an evening newsletter&#8230;\n\n\nThis Post: Pardons granted by Trump on January 6 cause division within the GOP: From the Politics Department. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/pardons-granted-by-trump-on-january-6-cause-division-within-the-gop-from-the-politics-department/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Trumps-Jan-6-pardons-split-the-GOP.jpg","video":null,"publish_date":"2025-01-22 00:22:56","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.273},{"id":282512656,"title":"Your Morning Smile","text":"Skip to content\n\nSend ‘funnies’ to PanamaNewsroom@gmail.com\n\nPost Views: 40\n\nTags: funnies\n\nYou may have missed\n\nENTERTAINMENT\n\nYour Morning Smile\n\nJanuary 21, 2025\n\nPanama Mining Chamber Insists on Prompt Decision\n\nJanuary 21, 2025\n\nPanama and Vietnam Strengthen Economic and Technological Relationship\n\nJanuary 21, 2025\n\nMore Rhetoric from Donald Trump During the Inauguration, Regarding the Panama Canal\n\nJanuary 21, 2025\n\nThe District of San Miguelito in Panama will Celebrate Carnival\n\nJanuary 21, 2025","summary":"Send ‘funnies’ to PanamaNewsroom@gmail.com","url":"https://newsroompanama.com/2025/01/21/your-morning-smile-154/","image":"https://newsroompanama.com/wp-content/uploads/2024/09/Your-Morning-Smile-New-1.jpg","video":null,"publish_date":"2025-01-22 00:21:33","author":"Newsroom Panama","authors":["Newsroom Panama"],"language":"en","source_country":"pa","sentiment":-0.159},{"id":282509088,"title":"Trump says he's open to Elon Musk buying TikTok and negotiates a deal with billionaire Larry Ellison in front of the press","text":"Trump says he's open to Elon Musk buying TikTok and negotiates a deal with billionaire Larry Ellison in front of the press\n\nTrump took questions from reporters at the end of his first full day in office \n\nLISTEN: Welcome to MAGAland, our podcast on the latest inside the White House\n\nBy ROB CRILLY, CHIEF U.S. POLITICAL CORRESPONDENT FOR DAILYMAIL.COM AT THE WHITE HOUSE\n\nPublished: 00:14 GMT, 22 January 2025 | Updated: 00:28 GMT, 22 January 2025\n\nPresident Donald Trump, on his first full day in office, said he was interested in the idea that the world's richest man Elon Musk could buy TikTok to stop it going dark in the United States. \n\nTrump is opposed to allowing a law to go into effect banning the popular video sharing app because it is owned by a Chinese company.\n\nOn Tuesday, he was asked whether he was open to his close ally Musk purchasing the app.\n\n'I would be,' he said at the end of an event launching a AI partnership between three companies, including Larry Ellison's Oracle.\n\n'If you wanted to buy it, I'd like Larry to buy it too.'\n\nTrump has already signed an executive order in an effort to delay TikTok being shut down.\n\nAnd he offered more ideas on how a rescue deal might work, explaining that it was a billion-dollar business if it could continue operating in the U.S., but worthless if not.\n\n'So what I'm thinking about saying to somebody is buy it and give half to the United States of America, half, and we'll give you the permit,' he said.\n\nPresident Donald Trump took questions from reporters for 30 minutes at the end of his first full day in office. He set out his vision for a deal to keep TikTok working in the U.S.\n\nHe said he was open to the idea that close ally Elon Musk could buy the app\n\nCongress passed a law last year banning the app unless its Chinese owners sold it\n\n'And they'll have a great partner, the United States. And they'll have something that's actually more valuable because they have the ultimate partner.'\n\nTrump was among those calling for a ban during his first term amid fears that the app's Chinese owners had access to US data, which could be shared with the government in Beijing, or that they could manipulate its algorithm to spread misinformation.\n\nCongress passed a law last year banning the app unless it was sold. \n\nBut in recent weeks Trump has changed tack, breaking with many of his Republican colleagues, describing how the popular app helped him win the election. \n\nA reporter asked him if he had the app on his phone. \n\n'I think I'll get it right now,' he said with a smile, a joke that would send shivers through his national security advisers.\n\n'By the way, again we won the young vote I think I won it through TikTok. So I have a warm spot in my heart for TikTok.\n\nDonald TrumpPoliticsElon MuskTikTok\n\nShare or comment on this article:\nTrump says he's open to Elon Musk buying TikTok and negotiates a deal with billionaire Larry Ellison in front of the press\n\nAdd comment","summary":"President Donald Trump , on his first full day in office, said he was interested in the idea that the world's richest man Elon Musk could buy TikTok to stop it going dark in the United States.","url":"https://www.dailymail.co.uk/news/article-14310993/trump-tiktok-elon-musk.html","image":"https://i.dailymail.co.uk/1s/2025/01/21/23/94369551-0-image-a-5_1737503571932.jpg","video":null,"publish_date":"2025-01-22 00:18:04","author":"Editor,Rob Crilly","authors":["Editor","Rob Crilly"],"language":"en","category":"politics","source_country":"gb","sentiment":0.208},{"id":282513236,"title":"Trump pardons Silk Road founder Ulbricht for online drug scheme","text":"U.S. President Donald Trump on Tuesday pardoned Silk Road founder Ross Ulbricht, who was serving a life sentence after being convicted of running an underground online marketplace that was used by thousands of drug dealers and others to conduct over $200 million worth of illicit sales using bitcoin.\n\nThe Republican president made good on a campaign pledge to end the imprisonment of Ulbricht, 40, that began with his arrest in 2013 in what became a landmark U.S. prosecution launched only a few years after the emergence of the popular cryptocurrency.\n\n\"The scum that worked to convict him were some of the same lunatics who were involved in the modern day weaponization of government against me,\" Trump said in a post on his social media platform Truth Social.\n\nTrump's administration is expected to significantly reverse course on what had been a crackdown by regulators on the cryptocurrency sector during Democratic former President Joe Biden's tenure.\n\nTrump had announced plans to commute Ulbricht's sentence in May during a speech at the Libertarian National Convention. The Libertarian Party, which has advocated for drug legalization, had pushed for Ulbricht's release, calling the case an example of government overreach.\n\nHis arrest brought to an end what prosecutors described as a global, black market bazaar that for two years starting in 2011 had been used by more than 100,000 people to buy and sell $214 million worth of illegal drugs and other illicit services.\n\nThe website relied on the Tor network to communicate anonymously and accepted bitcoin as payment, which prosecutors said allowed users to conceal their identities and locations.\n\nProsecutors said Ulbricht ran Silk Road under the alias Dread Pirate Roberts, a reference to a character in the 1987 movie \"The Princess Bride,\" and took extreme steps to protect the marketplace's operation.\n\nThose steps, they said, included soliciting the murders of several people who posed a threat, though they also said no evidence exists that any murders were actually carried out.\n\nUlbricht acknowledged he created Silk Road, which a defense lawyer at his trial said was intended as a \"freewheeling, free market site.\" But his lawyers contended Ulbricht had later handed off the website to others and was lured back toward its end to become the \"fall guy\" for its true operators.\n\n\"I wanted to empower people to make choices in their lives and have privacy and anonymity,\" Ulbricht said at his sentencing hearing in May 2015.\n\nA federal jury in Manhattan in February 2015 found Ulbricht guilty of charges including distributing drugs through the Internet and conspiring to commit computer hacking and money laundering.\n\n\"What you did was unprecedented,\" now-former U.S. District Judge Katherine Forrest said in sentencing Ulbricht. \"And in breaking that ground as the first person, you sit here as the defendant having to pay the consequences for that.\"","summary":"","url":"https://www.channelnewsasia.com/business/trump-pardons-silk-road-founder-ulbricht-online-drug-scheme-4888236","image":"https://dam.mediacorp.sg/image/upload/s--5aNG2T4d--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-22t002206z_2_lynxnpel0l00i_rtroptp_3_usa-trump-ulbricht.jpg?itok","video":null,"publish_date":"2025-01-22 00:17:42","author":null,"language":"en","source_country":"sg","sentiment":-0.158},{"id":282511436,"title":"Suspect from Germany named in fatal shooting of American Border Patrol agent in Vermont","text":"A German man on a legal visa is accused of killing a United States Border Agent during a traffic stop in Vermont near the Northern border, according to Fox News Digital.\n\nAccording to FBI Albany, the deceased suspect is confirmed to be a German national with a valid visa in the U.S.\n\nThe incident took place on Monday, Jan. 20, when 44-year-old U.S. Border Patrol Agent David “Chris” Maland was shot during a traffic stop on Interstate 91 between Newport and Orleans, Vermont.\n\nIn a statement, FBI Albany said that Maland was a U.S. Air Force veteran, saying: “We are heartbroken for our partners and share in their grief as they mourn the loss of their colleague.”\n\n“FBI Albany has numerous resources in the area, to include our Evidence Response Team (ERT), Victim Services, Digital Forensics, and dozens of Special Agents,” they said.\n\nOn Monday night, authorities were seen using a robotic device to inspect a backpack near what appeared to be a body on the ground at the scene.\n\nThe Border Patrol Union shared its condolences, saying on X, “Our hearts and prayers go out to the family, friends, and coworkers of our fallen brother in green in Vermont.” \n\nSen. Bernie Sanders (I-Vt.), Sen. Peter Welch (D-Vt.), and Rep. Becca Balint (Vt.-AL) shared their condolences with the family.\n\n“Border Patrol agents do important work protecting our borders. They deserve our full support in terms of staffing, pay and working conditions,” the elected officials shared in a statement Tuesday. “We look forward to working with the agency to make sure that they have all the resources they need to do the enormously important work that is their responsibility. Together, we must do everything possible to prevent future tragedies like what happened today.”\n\nThe shooting came just hours after President Donald Trump was inaugurated to a second term. He campaigned heavily on securing the border and defending law enforcement.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA German man on a legal visa is accused of killing a&#8230;\n\n\nThis Post: Suspect from Germany named in fatal shooting of American Border Patrol agent in Vermont first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/suspect-from-germany-named-in-fatal-shooting-of-american-border-patrol-agent-in-vermont/","image":"https://internewscast.com/wp-content/uploads/2025/01/German-national-suspect-identified-in-deadly-shooting-of-US-Border.jpg","video":null,"publish_date":"2025-01-22 00:17:05","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":282508994,"title":"Oil & gas stocks rise as Trump launches energy agenda","text":"Oil and gas stocks rallied on Tuesday as the United States President Donald Trump unveiled an energy agenda at the start of his second term.\n\nThe plan, which prioritises maximising US oil and gas production, includes declaring a national energy emergency, rolling back regulatory restrictions and withdrawing the U.S. from an international climate change agreement, Reuters reports.\n\nMajor oil firms and oilfield services companies benefitted from the announcement, with Schlumberger rising 1.7 per cent and Kinder Morgan gaining 2.2 per cent. Nuclear energy stocks also saw gains after Trump appointed Chris Wright as energy secretary. Wright pledged to boost nuclear power and liquefied natural gas production as key components of the administration’s energy strategy.\n\nAccording to Reuters, nuclear energy companies recorded increases, with Vistra rising 4 per cent, NuScale Power jumping 10 per cent, and Oklo Inc., a nuclear startup backed by Sam Altman, adding 12.4 per cent.\n\nTrump’s energy agenda, outlined during his inaugural address, aims to position the U.S. as a global leader in energy production while reducing dependency on foreign energy sources.\n\n“We will drill, baby, drill,” Trump declared, emphasising the administration’s commitment to expanding oil and gas exploration”. Reuters added","summary":"Oil and gas stocks rallied on Tuesday as the United States President Donald Trump unveiled an energy agenda at the start of his second term. The plan, which prioritises maximising US oil and gas production, includes declaring a national energy emergency, rolling back regulatory restrictions and withdrawing the U.S. from an international climate change agreement, \n\n\n \n Read More","url":"https://punchng.com/oil-gas-stocks-rise-as-trump-launches-energy-agenda/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/20181800/trump-3-1080x630.jpg","video":null,"publish_date":"2025-01-22 00:16:59","author":"Our Reporters","authors":["Our Reporters"],"language":"en","source_country":"ng","sentiment":0.29},{"id":282508698,"title":"ASX records sluggish gains amid dips from mining, energy sectors","text":"Mining and energy were the only sectors in red, with mining heavyweights BHP, Fortescue and Rio Tinto dropping by 1.3 per cent, 1.3 per cent and 0.6 per cent respectively, while Perth-based Lynas Rare Earths lost 2.1 per cent.\n\nMeanwhile, Woodside Energy recorded sharp drops of 2.5 per cent after news that the Australian oil and gas producer delayed investment decisions on two clean energy projects – one in low-carbon hydrogen and one in concentrated solar in the US. Australian oil and gas producer Santos also dropped by 1 per cent.\n\nThe four big banks had a strong morning with CBA, Westpac, ANZ, and NAB all recording gains.\n\nIn the US, stocks rose after more companies said they made bigger profits at the end of last year than analysts expected and as Treasury yields eased.\n\nThe S&P 500 climbed 0.9 per cent, while many markets around the world took only tentative steps following Donald Trump’s return to the White House. The Dow Jones rose 538 points, or 1.2 per cent, and the Nasdaq composite added 0.6 per cent.","summary":"Gains on the ASX were dragged by mining and energy stock on Wednesday morning, after US stocks rose after more companies said they made bigger profits at the end of last year.","url":"https://www.smh.com.au/business/markets/asx-records-sluggish-gains-amid-dips-from-mining-energy-sectors-20250122-p5l6a5.html","image":"https://static.ffx.io/images/$zoom_0.2324%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_125%2C$y_68/t_crop_custom/q_86%2Cf_auto/a3537f5345d981127c6b49f3a1ef91ba9f31a551","video":null,"publish_date":"2025-01-22 00:15:41","author":"Cindy Yin","authors":["Cindy Yin"],"language":"en","source_country":"au","sentiment":-0.185},{"id":282508646,"title":"Family of Capitol police officer who died after Jan. 6 insurrection speak out after pardons","text":"SOUTH RIVER, New Jersey -- The family members of fallen Capitol Police officer Brian Sicknick are describing the sweeping pardons of the demonstrators that stormed Washington D.C. on January 6th, 2021, as a \"betrayal of decency.\"\n\nOfficer Sicknick died a day after he was called to defend the Capitol after he was pepper sprayed during the attack.\n\nNow the same men and women involved in the battle are getting a fresh start following President Donald Trump's sweeping pardon of those convicted in connection with the Jan. 6 Capitol riot.\n\nSicknick's family is still dealing with the grief and agony of loss.\n\nThey're now processing one of the first moves by the new President to pardon all involved in the insurrection at the Capitol building.\n\nSome 1,500 who stormed the Capitol building on January 6, 2021, are receiving clemency and those in jail are getting a new lease on life.\n\nThis includes Julian Khater who was convicted of assaulting police officers including New Jersey native Brian Sicknick.\n\nSicknick suffered two strokes and died one day after the attack.\n\nThe move by President Trump is adding to the family's pain.\n\nOfficer Sicknick's brother Craig, called the move a \"betrayal of decency\" and adds the new President is a \"poor excuse of a man.\"\n\nThe Governor of New Jersey is also upset by Khater's pardon.\n\n\"To say that that's upsetting is an understatement,\" Governor Murphy said.\n\nSenator Cory Booker, who attended the inauguration, was also disappointed.\n\n\"Their family would be alive today. The person who was literally seen on camera beating Brian Sicknick has just been pardoned by this President, that's unacceptable to me,\" Booker said.\n\nThe Sicknick family issued a statement saying, \"It is our hope that the truth of what happened that tragic day will survive, irrespective of partisan political objectives.\"","summary":"The family members of fallen Capitol Police officer Brian Sicknick are describing the sweeping pardons of the demonstrators that stormed Washington D.C. on January 6th, 2021, as a \"betrayal of decency.\"","url":"https://6abc.com/post/brian-sicknick-family-capitol-police-officer-died-january-6th-insurrection-speak-pardons/15823602/","image":"https://cdn.abcotvs.com/dip/images/15823411_012125-wabc-officer-sicknick-img.jpg?w=1600","video":"https://vcl.abcotv.net/video/wabc/012125-wabc-johnson-jan-6-pardon-fallout-5pm-vid.mp4","publish_date":"2025-01-22 00:14:36","author":"Anthony Johnson,WABC","authors":["Anthony Johnson","WABC"],"language":"en","category":"politics","source_country":"US","sentiment":-0.537},{"id":282514638,"title":"President Donald Trump Pardons Silk Road Founder Ross Ulbricht","text":"President Donald Trump, fulfilling a promise made at the Libertarian Party's National Convention in May, pardoned Ross Ulbricht today. Ulbricht had been serving a life sentence for his role in founding and operating the dark web marketplace Silk Road.\n\nAs Trump put it in a Truth Social post: \"in honor of [his mother Lyn Ulbricht], and the Libertarian Movement, which supported me so strongly, it was my pleasure to have just signed a full and unconditional pardon of her son, Ross.\" He said \"the scum that worked to convict him were some of the same lunatics who were involved in the modern-day weaponization of government against me.\"\n\nAs I reported on his sentencing in May 2015 (he has been in prison since his October 2013 arrest):\n\nRoss Ulbricht was sentenced to life in prison with no parole…by Judge Katherine Forrest in U.S. District Court for the southern district of New York. Ulbricht was convicted back in February on seven charges, all related to the operation of the darkwebsite called Silk Road, which used Tor-enabled anonymity and the cryptocurrency bitcoin to allow people to buy and sell often illegal items in safety and security, with the site providing an escrow service between buyer and seller to ensure both were satisfied. Ulbricht was a clever entrepreneur, enthralled by libertarian ideas derived from the likes of Murray Rothbard and Samuel Konkin about the richness and justice of truly free markets not hobbled by government threats. The charges were: \"narcotics trafficking; distribution of narcotics by means of the Internet; narcotics trafficking conspiracy; continuing criminal enterprise; conspiracy to aid and abet computer hacking; conspiracy to traffic in fraudulent identity documents; and money laundering conspiracy.\" None of the charges were related to either personally selling an illegal substance to anyone—Ulbricht merely ran a website that facilitated it—and none were related to causing direct harm to anyone's life or property. Given the amazing water-muddying the prosecution achieved by talking about, but never trying Ulbricht for or proving in court beyond a reasonable doubt, allegedly planned, but never executed, murders for hire, one wonders whether the judge allowed any thoughts of those rumors, even subconsciously, to shape her sentencing decision.\n\nSilk Road's innovative mail order using bitcoin, combined with user reviews of sellers, imposed some real market discipline on dealers, kept buyers from the occasional dangers of physically obtaining drugs, and allowed people not violating others' lives and property to buy and sell drugs with less (but not zero) legal risk.\n\nBecause of all that, and the site's role in publicizing and popularizing the use of bitcoin as currency, Ulbricht was considered a martyr of sorts to many in the libertarian and bitcoin communities.\n\nTrump's promise, out of character for a man who otherwise advocates the death penalty for drug dealing, was widely seen as an attempt to appeal to those parts of the larger anti-establishment coalition he put together on his way to his return to the White House.\n\nUlbricht has expressed regret and his intention to be a law-abiding citizen, and there is certainly little reason to think he'd ever represent any danger to others on release. Reason's Nick Gillespie and Jacob Sullum have, in the past week, provided detailed discussions about why letting Ulbricht out after serving 11 years is proper and just.\n\nAs I wrote upon his sentencing, Ulbricht need not \"worry about redemption per se. Ulbricht and Silk Road….sent out a more powerful message than the one the government wanted Judge [Katherine] Forrest to send: that ingenuity and technology and effort can create wonderfully helpful realms of freedom in markets and behavior.\"\n\nThe Libertarian Party Connection\n\nDespite facing criticism for her support of Trump—and for the L.P.'s falling fortunes in membership, money, and candidates—Angela McArdle, chair of the Libertarian National Committee, argued for Libertarian support for Trump in large part based on his promise of Ulbricht's release, or at least because he was the type of major party candidate who would release him. While she has at different times intimated that her cooperation with Trump induced him to make the promise, and also that, as she told Tom Woods on his podcast in June 2024, Trump in fact already signed a pardon for Ulbricht in 2020 but was somehow foiled by underlings, the pardon does indicate that Trump considers a libertarian constituency one he is behooved to do favors for, which is an encouraging sign that he can feel pressured to sometimes do the right thing in libertarian terms.\n\nWhile many doubted Trump would come through, Ulbricht himself seemed confident it would happen, as he expressed in a November post-election X post. McArdle also insisted in a November interview with Reason's Robby Soave on The Hill's Rising program that she'd arranged meetings between Trump's people and Ulbricht's family about the matter. McArdle repeated her confidence that Trump would make good on his vow last week.\n\nOne just favor for libertarians does not a libertarian administration make, especially not one so dedicated to hobbling free trade, punishing the press, rounding up peaceful immigrants, and pursuing autarkist nationalist industrial policy. But Trump's coming through on this promise makes a huge difference for one man who did not deserve to spend the rest of his life in prison, and deserves justified applause.","summary":"Fulfilling a campaign promise to libertarians and the bitcoin community, the Silk Road founder's life sentence without parole is now over.","url":"https://reason.com/2025/01/21/president-donald-trump-pardons-silk-road-founder-ross-ulbricht/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2025/01/ross-ulbricht-1.jpg","video":null,"publish_date":"2025-01-22 00:11:28","author":"Brian Doherty","authors":["Brian Doherty"],"language":"en","category":"politics","source_country":"us","sentiment":-0.274},{"id":282506210,"title":"VA secretary nominee Collins says he wants to update and improve services for vets","text":"Jan. 21 (UPI) -- Former Rep. Doug Collins of Georgia is a veteran of the U.S. Navy, a former Air Force Reserve chaplain, a veteran of the Iraq War and says he wants to improve veterans' services.\n\nAs President Donald Trump's nominee for secretary of the Department of Veterans Affairs, Collins underwent a confirmation hearing before the Senate Veterans' Affairs Committee on Tuesday.\n\nSen. Kevin Cramer, R-N.D., introduced Collins to the Senate committee.\n\n\"If we were to write up qualifications for VA secretary, Doug Collins' picture would be right up next to the description,\" Cramer told committee members.\n\nCollins affirmed he will uphold veterans' ability to obtain health care and mental health services outside of the VA system as needed.\n\n\"America is the greatest nation on Earth because of the men and women who serve and are willing to step up to protect the freedoms that we hold so dear,\" Collins said in his opening remarks. \"I've witnessed this firsthand.\"\n\nCollins said he slept next to burn pits for several months while deployed in Iraq and brought his dog tags and a bracelet gifted to him by another service member to the confirmation hearing.\n\nBoth remind him and other veterans and active duty members of the U.S. military that they are part of something bigger, Collins told the committee members during the nearly three-hour hearing.\n\nCollins was deployed to Iraq while he was a member of the Air Force Reserves and visited and comforted injured military personnel while at the Balad Air Base, the New York Times reported.\n\nHe said the VA can't rely on old practices for the modern military and wants to expand access to medical services outside of the VA for veterans, the Military Times reported.\n\n\"We don't do the same things 40 years ago that we do today,\" Collins said. \"Our newer veterans deserve every access to finding care where they can.\"\n\nCollins generally is well-regarded by Republicans and Democrats alike.\n\nSome members of the Senate Veterans' Affairs Committee aired concerns that Trump might overturn a rule established during President Joe Biden's administration in 2022 and allowing the Veterans Administration to provide abortions for service members whose pregnancies resulted from rape, incest or when their lives might be at risk.\n\nSen. Richard Blumenthal, D-Conn., said he needs assurances Collins won't interfere with benefits veterans have earned, especially regarding abortion care and mental health care.\n\n\"Rolling back this policy would unnecessarily risk the lives and health of pregnant veterans in states with abortion bans and care restrictions,\" Blumenthal said.\n\nBlumenthal described the Veterans Administration as the largest civilian agency in the federal government with more than 450,000 employees comprising 20% of the entire federal workforce.\n\nSen. Patty Murray, D-Wash., asked Collins if a veteran living in Texas is raped and becomes pregnant should be able to get an abortion through the VA.\n\nCollins said a 1992 law prohibits the VA from performing abortions and said the Trump administration likely will examine if the Biden administration's 2022 rule in such matters is legal.\n\n\"We will be looking at that issue when I get in there to confirm that the VA is actually following the law,\" Collins said.\n\nHe also will look into the VA processing health care claims for undocumented migrants, which became a controversial matter during President Biden's last year in office.\n\n\"I do not believe any money that's taken outside the mission of the VA to help the veteran is a worthy cause,\" Collins said. \"We will not be doing that.\"\n\nCollins said his service brings a different perspective than prior Veterans Affairs secretaries, and he is focused on providing timely access and care for veterans.\n\n\"The veterans and VA won't have a stronger fighter for the employees and workforce,\" Collins said.\n\nHe said he favors enabling veterans to obtain taxpayer-funded medical and mental health services outside of the VA system to ensure they benefit from the best possible care.\n\n\"Veterans will always be able to use the health care system,\" Collins said. \"The issue is how we make it better.\"","summary":"Former Rep. Doug Collins of Georgia is a veteran of the U.S. Navy, a former Air Force Reserve chaplain, a veteran of the Iraq War and says he wants to improve veterans' services.","url":"https://www.upi.com/Top_News/US/2025/01/21/doug-collins-VA-secretary-confirmation-hearing/8471737501398/","image":"https://cdnph.upi.com/ph/st/th/8471737501398/2025/upi/ba71751b7f063aabd45530156f59434f/v1.2/VA-secretary-nominee-Collins-says-he-wants-to-update-improve-services-for-vets.jpg","video":null,"publish_date":"2025-01-22 00:11:08","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"us","sentiment":-0.134},{"id":282508544,"title":"Trump would be fine with Elon Musk acquiring TikTok","text":"WASHINGTON, January 22. /TASS/. US President Donald Trump stated that he would, in theory, be open to the idea of Elon Musk or another major American entrepreneur acquiring the TikTok social network.\n\n\"I would be [open],\" he told reporters at the White House in response to a related question.","summary":"Trump also stated that he would be open to dialogue regarding the acquisition of TikTok by another major American entrepreneur","url":"https://tass.com/world/1902543","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-22 00:09:53","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.84},{"id":282507898,"title":"「米国にとって不可欠な存在に」トランプ政権発足でゼレンスキー氏が欧州の団結訴え(2025年1月22日)","text":"Skip navigation\n\nSearch with your voice\n\n「米国にとって不可欠な存在に」トランプ政権発足でゼレンスキー氏が欧州の団結訴え(2025年1月22日)\n\nWatch later\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nCancelPlay Now\n\nYou're signed out\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nShareInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n0:06 / 1:10•Watch full video\n\nScroll for details\n\n「米国にとって不可欠な存在に」トランプ政権発足でゼレンスキー氏が欧州の団結訴え(2025年1月22日)\n\n4.37M subscribers\n\n227 views12 minutes ago\n\n227 views • Jan 21, 2025\n\n　ウクライナのゼレンスキー大統領がアメリカのトランプ政権の発足を受けて、真の安全保障の実現にはヨーロッパの同盟国が連携を強化する必要があると呼び掛けました。\n\nFollow along using the transcript.\n\nShow transcript\n\n4.37M subscribers\n\n「米国にとって不可欠な存在に」トランプ政権発足でゼレンスキー氏が欧州の団結訴え(2025年1月22日)\n\nJan 21, 2025\n\nSort comments\n\nTop comments\n\nNewest first\n\nAdd a comment...\n\nTop comments\n\nNewest first\n\nDescription\n\n「米国にとって不可欠な存在に」トランプ政権発足でゼレンスキー氏が欧州の団結訴え(2025年1月22日)\n\n　ウクライナのゼレンスキー大統領がアメリカのトランプ政権の発足を受けて、真の安全保障の実現にはヨーロッパの同盟国が連携を強化する必要があると呼び掛けました。\n\nウクライナ　ゼレンスキー大統領\n「トランプ大統領はヨーロッパに目を向けるでしょうか？NATOを必要と考えているでしょうか？そしてEUの機関を尊重するでしょうか？」\n\n　ゼレンスキー大統領は21日、世界のリーダーらが集うダボス会議で演説し、「アメリカが我々ヨーロッパを必要不可欠な存在とみなすようにしなければならない」と述べました。\n\n　トランプ氏が大統領に就任したことを受けて、ヨーロッパの同盟国がさらに団結して軍事力などを強化する必要があると訴えました。\n\n　また、ロシアのウクライナ侵攻について「北朝鮮兵士が関与する戦闘が、平壌よりもダボスに近い場所で発生している」と指摘し、危機感を示しました。\n[テレ朝ｎｅｗｓ] https://news.tv-asahi.co.jp\n\n　ウクライナのゼレンスキー大統領がアメリカのトランプ政権の発足を受けて、真の安全保障の実現にはヨーロッパの同盟国が連携を強化する必要があると呼び掛けました。\n\nウクライナ　ゼレンスキー大統領\n「トランプ大統領はヨーロッパに目を向けるでしょうか？NATOを必要と考えているでしょうか？そしてEUの機関を尊重するでしょうか？」\n\n　ゼレンスキー大統領は21日、世界のリーダーらが集うダボス会議で演説し、「アメリカが我々ヨーロッパを必要不可欠な存在とみなすようにしなければならない」と述べました。\n\n　トランプ氏が大統領に就任したことを受けて、ヨーロッパの同盟国がさらに団結して軍事力などを強化する必要があると訴えました。\n\n　また、ロシアのウクライナ侵攻について「北朝鮮兵士が関与する戦闘が、平壌よりもダボスに近い場所で発生している」と指摘し、危機感を示しました。\n[テレ朝ｎｅｗｓ] https://news.tv-asahi.co.jp …...more\n\nFollow along using the transcript.\n\nShow transcript\n\n4.37M subscribers\n\nNow playing\n\n【ライブ】1/22 朝ニュースまとめ 最新情報を厳選してお届け\n\n2.1K watching\n\nNow playing\n\n「悪い前例が後世に」揺らぐリベラル民主主義…“世界的思想家”語るトランプ2期目【報道ステーション】(2025年1月21日)\n\nNow playing\n\nBREAKING NEWS: Trump Takes Question After Question From The Press On First Full Day Back In Office\n\nForbes Breaking News\n\nForbes Breaking News\n\n52 minutes ago\n\nNow playing\n\n「誰と戦うか知らなかった」ロシアに派遣され捕虜になった北朝鮮兵士の新しい映像公開(2025年1月21日)\n\nNow playing\n\nSee moment reverend pleads with Trump to have mercy on immigrants\n\n4 hours ago\n\nNow playing\n\nTrump admin. removes first female leader of a US military branch\n\n6 hours ago\n\nNow playing\n\n\"Border czar\" Tom Homan tells reporter that ICE officers were told to begin raids\n\n3 hours ago\n\nNow playing\n\nBorder changes seen ‘immediately’: Texas DPS spokesman | NewsNation\n\n11 hours ago\n\nNow playing\n\nHow Trump Plans to Deport 4% of the U.S. Population | WSJ\n\nThe Wall Street Journal\n\nThe Wall Street Journal\n\n3 weeks ago\n\nNow playing\n\nTurn 2 Eggs Into Fluffy Japanese Soufflé Pancakes!\n\nCookingAtHome\n\nCookingAtHome\n\n4 months ago\n\nNow playing\n\nDonald Trump and Melania Trump's first dance after 2025 inauguration at Commander in Chief ball\n\nPalmBeachPost\n\nPalmBeachPost\n\n20 hours ago\n\nNow playing\n\nMan Insults Keanu Reeves on a First Class Flight – Instantly Regrets It When the Truth Is Reveal!\n\nHeroic Acts\n\nHeroic Acts\n\nNow playing\n\nBREAKING NEWS: Newly Sworn-In Secretary Of State Marco Rubio Speaks To Employees At The State Dept\n\nForbes Breaking News\n\nForbes Breaking News\n\n5 hours ago\n\nNow playing\n\nBREAKING NEWS: Trump Speaks To Reporters As He Signs Multiple Executive Orders For Nearly An Hour\n\nForbes Breaking News\n\nForbes Breaking News\n\n22 hours ago\n\nNow playing\n\n住宅の花壇から“キツネの頭部”か　岐阜・関市(2025年1月22日)\n\n2 hours ago\n\nNow playing\n\nPutin doomed by ‘colossal loss’ of 10,000 battle tanks\n\nTimes Radio\n\nTimes Radio\n\n2 weeks ago\n\nNow playing\n\nHow will the UK work with Donald Trump? | BBC News\n\n52 minutes ago\n\nNow playing\n\nSenators receive affidavit containing new allegations against Pete Hegseth\n\n3 hours ago\n\nNow playing\n\nSenators receive affidavit containing new allegations against Pete Hegseth\n\n4 hours ago\n\nNow playing\n\nFULL SPEECH: President Donald Trump's inauguration speech","url":"https://www.youtube.com/watch?v=_j0hl-GvH9w","image":"https://i.ytimg.com/vi/_j0hl-GvH9w/hqdefault.jpg","video":null,"publish_date":"2025-01-22 00:09:25","author":"ANNnewsCH","authors":["ANNnewsCH"],"language":"en","category":"entertainment","source_country":"jp","sentiment":0.087},{"id":282511666,"title":"22 US States Sue Over Trump Bid To End Birthright Citizenship","text":"A coalition of Democratic-leaning states launched legal actions Tuesday seeking to block Donald Trump's plan to end birthright citizenship in the United States.The two separate lawsuits involving a total of 22 states, including California and New York, come the day after Trump took office and quickly unveiled a phalanx of executive orders he hopes will reshape American immigration.Chief among them was an order eliminating the automatic granting of citizenship to anyone born on US soil, a right guaranteed by the 14th Amendment of the country's constitution.If implemented, the order would prevent the federal government from issuing passports, citizenship certificates or other documents to children whose mothers are in the country illegally or temporarily, and whose father is not a US citizen or permanent resident.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");\"The President's executive order attempting to rescind birthright citizenship is blatantly unconstitutional and quite frankly, un-American,\" California Attorney General Rob Bonta said as he announced the suit.\"We are asking a court to immediately block this order from taking effect and ensure that the rights of American-born children impacted by this order remain in effect while litigation proceeds.\"The President has overstepped his authority by a mile with this order, and we will hold him accountable.\"The California-led suit, which was filed in federal court in Massachusetts, was joined later Tuesday by one filed in Washington state, and comes alongside a similar suit filed by the American Civil Liberties Union (ACLU) and other advocacy groups in New Hampshire.The 14th Amendment was adopted in the aftermath of the US Civil War, as part of an effort to ensure the rights of former slaves and their children.It says, in part: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\"Trump's order, if it stands, will come into effect 30 days from when he signed it.The president acknowledged as he put pen to paper that it was likely to face legal challenges.\"I think we have good grounds, but you could be right. I mean, we'll find out,\" he said, when asked about the likelihood of a legal effort to halt it.Trump also claimed -- wrongly -- that the United States is the only country in the world that grants birthright citizenship.In reality, dozens of others do, among them the neighboring countries of Canada and Mexico.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"A coalition of Democratic-leaning states launched legal actions Tuesday seeking to block Donald Trump's plan to end birthright citizenship in the United States.","url":"https://www.ndtv.com/world-news/22-us-states-sue-over-donald-trump-bid-to-end-birthright-citizenship-7529190","image":"https://c.ndtvimg.com/2025-01/scrici9o_us-flag_625x300_22_January_25.jpeg","video":null,"publish_date":"2025-01-22 00:09:18","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.135},{"id":282513894,"title":"Trump’s 2nd Inaugural Averages 24.6 Million Viewers, Below 2017 & 2021","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nWASHINGTON, DC - JANUARY 20: U.S. President Donald Trump speaks during inauguration ceremonies in ... [+] the Rotunda of the U.S. Capitol on January 20, 2025 in Washington, DC. Donald Trump takes office for his second term as the 47th president of the United States. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nAccording to audience data supplied by Nielsen, Donald Trump’s second Presidential inauguration averaged 24.6 million viewers across 15 networks (network list is below). The live coverage varied by network; the inauguration events ran from 10:30 a.m. to 7:00 p.m. (ET) on Monday. Viewership peaked at 34.4 million viewers during the 12:15 PM quarter-hour. As usual, with news events, the audience was dominated by older viewers. According to Nielsen, adults 55+ averaged 17.4 million viewers, more than 70% of the total audience. Trump’s first inauguration in 2017 had an average audience of 30.6 million viewers.\n\nIn 2021 the inauguration of Joe Biden, after a riotous political season and the pandemic with stay-at -home mandates averaged 33.8 million. Because of the pandemic the festivities were scaled back. Additionally, 2021 marked the first inauguration Nielsen included CTV and out-of-home viewing to the audience figure.\n\nSimilar to previous inaugurals, Nielsen’s audience numbers do not include streaming which continues to grow as a video source. According to Nielsen’s monthly Gauge report, in December 2024, streaming accounted for a record 43,3% share of all video usage. YouTube also recorded a record high share of 11.1%. The inclusion of streaming would, in all probability, increase the audience of the inauguration.\n\nOften times, the swearing-in of the President for a second term generates a lower audience than the initial inaugural. For example, the audience for the second inauguration of Ronald Reagan, Bill Clinton, George W. Bush and Barack Obama all delivered a lower audience than the first. Only Richard Nixon’s second inaugural, in 1973, produced more viewers than the first inauguration. (see list below)\n\nDonald Trump is only the second President to have two nonconsecutive inaugurations, joining Grover Cleveland (1885 and 1893). Also, because of the bitterly cold weather, Trump’s inauguration was only the second time the event was held indoors. In 1985 Ronald Reagan’s second inaugural had been held indoors. Also, Trump’s inauguration coincided with Martin Luther King Day, a federal holiday which, since 1983, lands on the third Monday in January. The next year the two events will coincide will be in 2053.\n\nMORE FOR YOU\n\nTrump Signs Order Ending Remote Work; Mandates Federal Workers Return To Office\n\nTikTok Ban Live Updates: Trump Halts Ban For 75 Days—After CEO Attends Inauguration\n\nNew Password Hack Warning—Act Now If Yours Is On This List\n\nTrump’s inaugural marks the fourth time the inauguration was held on MLK Day. Coincidentally, all four inaugurations were for a second term. In 1985 Ronald Reagan’s second inauguration on January 20 fell on a Sunday. There was a private swearing on that day, with a full day of events on the following day (held indoors). Bill Clinton’s second inauguration fell on MLK Day in 1997 with a swearing in and day full of events. (Trump’s second inauguration marked the second time.) Similar to Reagan, Barack Obama’s second inaugural fell on a Sunday with a private swearing in ceremony on the day followed by a day of public events.\n\nNielsen has been tracking the audience for Presidential inauguration since 1969. The most watched Inaugural was in 1981 when Ronald Reagan was first sworn in. The audience on that day averaged 41.8 million viewers. In addition, January 20 was a newsworthy day with the release of 52 U.S. diplomats held hostage for 444 days in captivity by Iran. On the other hand, the second inauguration of George W. Bush in 2005 was the least watched averaging only 15.5 million viewers.\n\nAVERAGE AUDIENCE PRESIDENTIAL INAUGURATIONS\n\nDay Year President (in millions)\n\nMon 2025 Trump 24.6\n\nWed 2021 Biden 33.8\n\nFri 2017 Trump 30.6\n\nMon* 2013 Obama 20.6\n\nTue 2009 Obama 37.8\n\nThu 2005 G.W. Bush 15.5\n\nSat 2001 G.W. Bush 29.0\n\nMon 1997 Clinton 21.6\n\nWed 1993 Clinton 29.7\n\nFri 1989 G.H.W. Bush 23.3\n\nMon* 1985 Reagan 25.1\n\nTue 1981 Reagan 41.8\n\nThu 1977 Carter 34.1\n\nSat 1973 Nixon 33.0\n\nMon 1969 Nixon 27.0\n\nJanuary 20 each year except when noted\n\n*Moved to January 21\n\nThe 15 reported networks in 2025 are: ABC, CBS, NBC, Merit Street Media, Telemundo, Univision, CNBC, CNN, CNNe, Fox News Channel, Fox Business Network, MSNBC, Newsmax, NewsNation, PBS.\n\nFollow me on LinkedIn. \n\nBrad Adgate\n\nEditorial Standards\n\nForbes Accolades","summary":"The second Presential inauguration of Donald Trump averaged 24.3 million viewers, a audience lower than Biden in 2021 (33.8 million) and Trump in 2017 (30.6 million).","url":"https://www.forbes.com/sites/bradadgate/2025/01/21/trumps-2nd-inaugural-averages-246-million-viewers-below-2017--2021/","image":"https://imageio.forbes.com/specials-images/imageserve/6790354127e8f606e6f004c5/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-22 00:08:17","author":"Brad Adgate,Contributor","authors":["Brad Adgate","Contributor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":282513490,"title":"Penny Wong talks up ‘warm and constructive’ meeting with new Trump administration","text":"Penny Wong has talked up a “great day” full of productive meetings with the Trump Administration as evidence the President sees Australia as a priority.\n\nOn the first full day of Donald Trump’s presidency, Australia’s Foreign Minister and ambassador Kevin Rudd met with the new Secretary of State Marco Rubio in a “very warm and constructive” first bilateral meeting, before a meeting with other Quad foreign ministers.\n\nSenator Wong and Mr Rudd also met with the US’ new national security advisor Mike Waltz.\n\n“I think across the span of the alliance, there’s a great deal of optimism and confidence about the opportunities ahead, and I am really privileged to have had this level of engagement so early in the new administration,” she said from Washington.\n\nThe high-level talks on Mr Trump’s first day dispelled fears that previous comments made by Mr Rudd would put Australia in the diplomatic freezer, with Senator Wong revealing the ambassador’s tenure “did not come up” during their meeting with Mr Rubio.\n\nSenator Wong acknowledged Mr Trump would “do things differently”, but declined to get involved in commentary about what his agenda would mean for Australia.\n\nBut, she said Australia was in a strong position to stand on its own two feet and engage with the US when it can.\n\n“We should not be surprised if he implements that agenda,” she said.\n\n“We should also have some confidence in our capacity as a nation to navigate those challenges, to engage with the administration, and to talk through — at very many different levels of the new administration — talk about the issues that are relevant to Australia’s interests.”\n\nThe Government is continuing to put the case to Mr Trump that Australia should be exempt from his broad-based foreign tariff agenda.\n\nSenator Wong said she had focused on why the economic relationship was as much a benefit to the US as it was Australia.\n\n“That is recognised,” she said, before pointing to how the former Turnbull Government had navigated Mr Trump’s last tariff agenda.\n\n“What I can say to Australians is that we will work consistently, confidently, with a very clear focus on Australia’s interests to navigate any trade issues.”\n\nOn the future of AUKUS, Senator Wong said the takeaway from her meetings was that the Trump administration “understands the strategic imperative around” the trilateral security pact.\n\nEarlier, Coalition home affairs spokesman James Paterson said Australia was in the best position of any US ally to continue a strong relationship with Washington under Mr Trump.\n\n“We know that President Trump has an affection for Australia and admires Australia. We know that many people in his administration, in senior posts, including the Secretary of State, Marco Rubio, is a fan and a supporter and a friend of Australia. So we should have a good starting point,” he told ABC Radio.\n\n“And we proved in the first Trump presidency that we can navigate his politics and his approach to foreign affairs successfully in a way that strengthens our relationship.”","summary":"Penny Wong has talked up a ‘great day’ full of productive meetings with the Trump administration as evidence the President sees Australia as a priority.","url":"https://thewest.com.au/politics/federal-politics/penny-wong-talks-up-warm-and-constructive-meeting-with-new-trump-administration-c-17465353","image":"https://images.thewest.com.au/publication/C-17465353/b8edc722b3a974fd60565b24669c95fe4aaa8682-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-22 00:07:10","author":"Ellen Ransley,Mr Rudd","authors":["Ellen Ransley","Mr Rudd"],"language":"en","source_country":"au","sentiment":0.176},{"id":282513140,"title":"Today we get a new Taoiseach - here's a rundown of how the day is going to go","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSports meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nAlamy Stock Photo\n\nThe Morning Lead\n\nToday we get a new Taoiseach - here's a rundown of how the day is going to go\n\nFianna Fáil leader Micheál Martin will become the next Taoiseach of Ireland. \n\n12.06am, 22 Jan 2025\n\nShare options\n\nTHIS AFTERNOON, Micheál Martin will become the next Taoiseach of Ireland. \n\nThe Fianna Fáil leader has been Tánaiste since December 2022 and previously to that, he served as Taoiseach for two years.\n\nA new Cabinet will also be formed today, with speculation rife about who might be getting moved up the political ladder. \n\nIt will be a busy day in Leinster House, but The Journal will be bringing you all the latest as it happens throughout the day. \n\nHere’s how things will go: \n\nThe day will officially kick off at 11am in Leinster House, with the business of the day the first thing on the agenda.\n\nExpect some fireworks from the get-go, with members of the Opposition due to raise serious concerns about some members of the Regional Independent group getting Oppositing speaking time, despite them being in the room for government formation talks.\n\nExplainer: What is this Dáil row about the Regional Independents and speaking time?\n\nSinn Féin will nominate Mary Lou McDonald, but she won’t have the numbers. \n\nFianna Fáil will nominate Martin as the next Taoiseach, and TDs will then cast their vote on whether or not they want to see him become Taoiseach.\n\nFianna Fáil won the most seats in the Dáil following the general election, winning 48 seats while Sinn Féin – the main opposition party in the last Dáil – won 39.\n\nAdvertisement\n\nFine Gael was third with 38 seats, so with the addition of support from the Independents, Martin will have a majority in the House to get him over the line and into the top job.\n\nAfter the Dáil voting process is complete, probably around 1.30pm, Martin will make his way to Áras an Uachtaráin where he will be formally appointed Taoiseach by President Micheal D. Higgins. \n\nAfter this, Martin will then return to Government Buildings, and begin summoning his new Cabinet members to his office to tell them what ministry they will be getting. \n\nThe Dáil begins again at 5.30pm, where it is expected that the new Cabinet members will be voted for and approved by the Dáil. A debate on their appointment will follow.\n\nThe new ministers will then travel to the State Reception Room in Áras an Uachtaráin where the president will then present each minister with their Seal of Office.\n\nWho’s expected to be in the Cabinet? \n\nThe incoming Tánaiste is expected to take on a beefed-up foreign affairs brief, with a focus on trade and diplomatic relations as the political world faces a difficult few years.\n\nFianna Fáil are minded to hold on to the Housing department brief, with speculation that Darragh O’Brien will stay on as minister.\n\nEducation Minister Norma Foley is also tipped to stay at the Cabinet table, though there is uncertainty as to whether she will stay in her current position with talk that she could be the new Social Protection and Rural Affairs Minister or possibly take on the Higher Education brief.\n\nNames in the mix and being talked about for promotion are Fianna Fáil’s James Browne, Mary Butler, James Lawless, Niall Collins and Dara Calleary and Thomas Byrne, with some mentioning Catherine Ardagh as a possible newcomer. In terms of Fine Gael options, Jennifer Carroll MacNeill, Martin Heydon, Hildegarde Naughton and Alan Dillon are also being mentioned. \n\nOne ministry that is under the spotlight is Agriculture, with some within both parties stating that Heydon might be elevated to the role, however, some state the moving of Fianna Fáil’s Charlie McConalogue would be deemed unfair. \n\nIt is believed that Fianna Fáil and Fine Gael will exchange a number of Cabinet departments, such as the Justice brief and possibly the Health portfolio.\n\nRelated Reads\n\nFianna Fáil members vote overwhelmingly in support of draft Programme for Government\n\nAnalysis: Vague plans and no setting out of 'first 100 days' priorities in new Programme for Government\n\nWhite smoke: Regional Independents secure four government roles as deal emerges\n\nDublin Bay South TD Jim O’Callaghan has been mentioned as a possible Justice Minister, but there are mixed views around Leinster House as to whether he could get the nod as the next Attorney General. Most are saying that it would be an unusual move by the party leader, but it would result in the party having another Cabinet position. \n\nThe current Justice Minister, Fine Gael’s Helen McEntee, is speculated to be the next Enterprise Minister, though there’s some mutterings she might move to Education.\n\nMeanwhile, Carroll MacNeill is being tipped for Health, although some within her party state that it is not a portfolio she would be pushing for. \n\nAs reported by The Journal previously, the current Department of Children, Equality, Disability, Integration and Youth will be split, with Integration set to move to the Department of Justice. \n\nDuring the government formation talks, there were split views among the negotiating teams on whether to put the energy brief into Department of Enterprise, but it’s believed it might not be tacked on now.\n\nDisability and Children will form one department, but it remains to be seen who what party might take on the department, which will cover an area which was one of the central debates in the general election.\n\nIn terms of the Department of Finance, it is expected that Paschal Donohoe will take back his old job, with Fianna Fáil’s Jack Chambers heading up the beefed up Department of Public Expenditure, Infrastructure and National Development Plan Delivery.\n\nA separate Department of infrastructure, which Simon Harris wanted to establish, is not on the cards. \n\nDonohoe and Chambers’ roles are expected to rotate alongside the Taoiseach rotation, with the draft programme for government stating that Micheál Martin will leave the Taoiseach’s job on 16 November 2027.\n\nYou can keep up with all the latest as it happens by following our liveblog throughout the day. \n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nChristina Finn\n\nView 7 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Today we get a new Taoiseach - here's a rundown of how the day is going to go”.\n\nRecipient's Email\n\nFeedback on “Today we get a new Taoiseach - here's a rundown of how the day is going to go”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nFianna Fáil\nMichael D Higgins\nMicheál Martin\nmorning lead\n\nthe morning lead\n\nNews in 60 seconds\n\nRNLI crews rescue fishing boat off north Dublin coast after it ran aground on rocks\n\nPublic urged to 'keep clear' of beached 20-metre fin whale washed ashore on Waterford beach\n\nLimerick City\nBody of man found after two female sex workers falsely imprisoned and assaulted in Limerick\n\nInvestigatesSoil Invaders\nA love-hate relationship: Ireland’s rhododendron problem \n\nHere's What Happened Today: Tuesday\n\nExtradition\nMan extradited from Northern Ireland to Republic over Donegal crash which killed two teenagers\n\nWashington DC\nWashington Bishop urges Trump to have 'mercy' on LGBTQ+ communities and immigrants\n\nWashington DC\nIn pictures: The second inauguration of US President Donald Trump \n\nMet Éireann\nStorm Éowyn: Strong winds across the country and heavy rain forecast from Thursday night into Friday\n\nexecutive orders\nTrump grants pardons to 1,500 US Capitol rioters and withdraws from Paris climate accord \n\nWoman accused of murder at cliffs said she 'battered' deceased man's face with a rock, court told\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Fianna Fáil leader Micheál Martin will become the next Taoiseach of Ireland.","url":"https://www.thejournal.ie/micheal-martin-to-become-taoiseach-6599056-Jan2025/","image":"https://img2.thejournal.ie/article/6599056/river/?height=400&version=6600583","video":null,"publish_date":"2025-01-22 00:05:14","author":null,"language":"en","source_country":"ie","sentiment":0.25},{"id":282510936,"title":"Trump welcomes idea of Elon Musk buying TikTok — if billionaire wants it","text":"President Donald Trump said on Tuesday he was open to billionaire Elon Musk buying social media app TikTok — if the Tesla CEO wanted to do so.\n\n“I would be, if he wanted to buy it,” Trump told reporters.\n\nTrump signed an executive order on Monday that gives the Chinese-owned app a 75-day reprieve from the sell-or-ban law that went into effect Sunday.\n\n“I met with the owners of Tiktok, the big owners, it’s worthless if it doesn’t get a permit,” Trump said. “It’s worth like a trillion dollars. So what I’m thinking about saying to somebody is, ‘buy it and give half to the United States of America, and we’ll give you the permit, and they’ll have a great partner.”\n\nMusk’s name has previously been floated by officials as a possible buyer because of the mogul’s close ties to China.\n\nTrump made the comments while announcing a $500 billion AI infrastructure project involving Oracle, Softbank and OpenAI, led by Musk nemesis Sam Altman.\n\nThe president also said he would be open to the app being bought by Larry Ellison, Oracle’s billionaire co-founder.","summary":"“I met with the owners of Tiktok, the big owners, it’s worthless if it doesn’t get a permit,” Trump said. “It’s worth like a trillion dollars.\"","url":"https://nypost.com/2025/01/21/business/trump-welcomes-idea-of-elon-musk-buying-tiktok-if-billionaire-wants-it/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/trump-musk-tiktok.jpg?quality=75&strip=all&1737484461&w=1200","video":null,"publish_date":"2025-01-22 00:04:49","author":"Diana Glebova","authors":["Diana Glebova"],"language":"en","source_country":"us","sentiment":-0.202},{"id":282514718,"title":"SAN DIEGO: 18 programas de atención a personas sin hogar están en riesgo de ser recortados y no es lo más problemático","text":"Un nuevo informe del condado ha señalado 18 programas locales para personas sin hogar que dependen, al menos en parte, de fondos que corren el riesgo de desaparecer.\n\nPero ese problema está arraigado en un lío más grande.\n\nLas organizaciones de servicios han tenido que depender durante mucho tiempo de fondos provenientes de diversas fuentes, desde subvenciones federales hasta donaciones puntuales, lo que hace que su trabajo dependa de un mosaico de benefactores con reglas y plazos diferentes. Esto puede complicar todo, desde la planificación a largo plazo hasta mantener personal confiable.\n\n“Comenzamos cada año y cada ciclo presupuestario desde cero en cuanto a la financiación para personas sin hogar,” dijo Alex Visotzky, becario de políticas de California en la Alianza Nacional para Acabar con la Desesperación. “Esta es una crisis que lleva décadas en desarrollo, y necesitaremos un compromiso continuo para salir de ella.”\n\nJuntos, los fondos que están por caducar o en riesgo representan una parte significativa, alrededor de 94 millones de dólares, de lo que se ha presupuestado para esas iniciativas.\n\nLos líderes locales están pidiendo una fuente de dinero más estable. El jefe de la Fuerza de Tarea Regional sobre Personas Sin Hogar ha dicho que realizar ese cambio es clave para continuar con el progreso reciente del condado en la reducción de la crisis, mientras que el analista presupuestario independiente de San Diego ha advertido sobre una dependencia excesiva de las subvenciones externas, y los residentes han expresado su apoyo por una opción.\n\nSin embargo, está bloqueada en los tribunales.\n\nEn 2020, una gran mayoría de los votantes de la ciudad de San Diego aprobó un aumento de impuestos a los hoteles, conocido como la Medida C, que podría eventualmente generar millones de dólares para servicios para personas sin hogar. Sin embargo, los críticos han cuestionado si el dinero se gastaría de manera efectiva y argumentaron que se requería una votación de dos tercios, lo que dejó la medida estancada. Incluso si la propuesta sigue prevaleciendo ante los jueces, el impuesto probablemente no comenzará al menos por un año.\n\nMientras tanto, los líderes electos están enfrentando déficits presupuestarios a nivel local y estatal, y el presidente electo Donald Trump podría reformar qué programas reciben fondos federales.\n\nMarc Dones, director de políticas de la Iniciativa de Vivienda y Personas Sin Hogar Benioff de la Universidad de California en San Francisco, recomendó que las organizaciones de servicios exploren el uso de más fondos por derecho, ayudas gubernamentales que generalmente vienen con presupuestos más grandes (y a largo plazo). Un ejemplo de ello es CalAIM, una expansión del sistema de atención médica de California para residentes de bajos ingresos que ahora puede ayudar a las personas a obtener vivienda.\n\nSí, el papeleo es complicado, dijo Dones. Pero CalAIM podría hacer una gran diferencia en cuántas personas duermen al aire libre. “Tenemos que usarlo.”\n\nEl reciente “Informe de Evaluación Integral de Personas Sin Hogar” del Condado de San Diego, que destacó las brechas de financiación, concluyó de manera similar que CalAIM debe ser parte de la solución.\n\nLos 18 programas que enfrentan posibles recortes incluyen iniciativas que hospedan a residentes sin hogar en hoteles (a través del Programa Regional de Asistencia para Personas Sin Hogar), proporcionan espacio para dormir de manera segura en autos (Programa de Estacionamiento Seguro Magnolia), limpian campamentos (Limpieza) y ayudan a adultos mayores en riesgo de quedarse sin hogar a mantener su vivienda (Programa Piloto de Subsidios de Alquiler Superficiales).\n\nLos líderes deben abogar “por opciones de financiación más flexibles a nivel estatal y federal para cubrir más servicios de apoyo esenciales,” dijo el informe, “incluyendo atención de salud mental, tratamiento para el abuso de sustancias, refugio de emergencia y esfuerzos de reubicación rápida.\n\nUno de los fondos que se está agotando es el Acta de Plan de Rescate Americano, el paquete de ayuda federal aprobado después de la pandemia. Ese dinero debe gastarse antes de finales de 2026.\n\nOtra fuente que podría agotarse es el Programa de Subvenciones para Vivienda, Asistencia y Prevención de Personas Sin Hogar de California, o HHAP. La Legislatura estatal consideró recortar esas subvenciones del presupuesto anterior, y los legisladores solo las reincorporaron después de una campaña de presión de varios alcaldes, incluido Todd Gloria. Sin embargo, el futuro del programa está lejos de estar garantizado.\n\nLa Supervisora del Condado Terra Lawson-Remer cree que es posible encontrar varias soluciones alternativas. Por un lado, está optimista de que HHAP no desaparecerá por completo, incluso si se reduce. En segundo lugar, cree que la demanda de vales de hotel, especialmente, disminuirá a medida que el condado invierta en más opciones de refugio, incluidas las docenas de pequeñas cabañas que se construirán en Lemon Grove.\n\nEso aún deja en el aire iniciativas como la ayuda para alquiler de adultos de al menos 55 años. Más de 380 participantes reciben actualmente $500 al mes para alquiler. Sin embargo, el condado invitó previamente a investigadores del Instituto de Tecnología de Massachusetts a estudiar si ese esfuerzo está realmente previniendo la falta de vivienda, y los resultados positivos podrían simplificar la recaudación de fondos, dijo Lawson-Remer. “Es mucho más fácil conseguir financiación para programas que funcionan.”\n\nNo está claro si el resto de la junta está de acuerdo con sus conclusiones. Joel Anderson declinó hacer comentarios, mientras que los representantes de Monica Montgomery Steppe y Jim Desmond no respondieron a las solicitudes de comentarios. Además, los planes de gasto revisados pueden tener que esperar hasta al menos esta primavera, cuando los votantes del condado del sur elijan un nuevo representante tras la sorpresiva decisión de Nora Vargas de no postularse para otro mandato.\n\nLos otros programas que dependen de financiación inestable son el Programa de Defensa de Vivienda y Discapacidad, el Programa Local de Subsidios de Alquiler, el Equipo Comunitario de Reducción de Daños, Housing Our Youth, Servicios de Navegación y Gestión de Casos de Vivienda, Bringing Families Home, el Programa de Incentivos a Propietarios, Coordinación Comunitaria Directa a Casa, el Fondo Flexible de Vivienda, Vivienda Innovadora y Servicios para la Comunidad LGBTQ+, Financiamiento Especializado para Necesidades Inminentes, Home Safe, Servicios Afirmativos Mejorados para la Comunidad LGBTQ+ y No Hay Lugar Como el Hogar.\n\nOriginal Story","summary":"Los líderes tienen ideas para abordar un problema de años relacionado con la financiación de los servicios.","url":"https://www.sandiegouniontribune.com/2025/01/21/san-diego-18-programas-de-atencion-a-personas-sin-hogar-estan-en-riesgo-de-ser-recortados-y-no-es-lo-mas-problematico/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/01/sut-l-parking-settlement_760c36.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-22 00:01:45","author":"Blake Nelson","authors":["Blake Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":282510302,"title":"A lawsuit alleging excessive force against 2020 protesters in Oregon has been settled, ACLU says","text":"A lawsuit alleging that law enforcement agents sent by President Donald Trump to protect a federal courthouse in 2020 used excessive force against racial justice protesters has been settled, the American Civil Liberties Union of Oregon said Tuesday.\n\nThe settlement requires the federal government to compensate the individuals who filed the lawsuit for the injuries that federal law enforcement caused them, in exchange for the individuals’ agreement to dismiss the lawsuit, according to a news release from the ACLU. No information was released about specific compensation amounts. \n\nThe plaintiffs included three military veterans, a college professor, several Black Lives Matter activists and a man who alleges that unidentified agents snatched him off a street for no reason blocks from the federal courthouse.\n\n“We are proud to have represented our courageous clients,\" ACLU of Oregon's legal director, Kelly Simon, said in the news release. “They suffered serious injuries because of federal law enforcement’s unlawful, aggressive actions, and it is just and fair that they are being compensated.” \n\nThousands of protesters in Portland took to the streets for months in 2020 following the murder of George Floyd by a police officer in Minneapolis, part of a wave of nationwide protests. They at times clashed with police, and militarized federal agents were sent to the city to quell the demonstrations.\n\nThe lawsuit alleged that federal agents in Portland exceeded the limits of their authority, making illegal arrests and using tear gas, rubber bullets, pepper spray and other tactics to squelch the protests. Almost all of the plaintiffs alleged physical injuries and some were treated at hospitals, the lawsuit said.\n\nA video of plaintiff and Navy veteran Christopher David’s encounter with U.S. agents outside the Portland courthouse circulated widely on social media. It showed one agent hitting David with a baton and another dousing him in the face with pepper spray. David suffered two broken bones in his hand.\n\nThe lawsuit also alleged that the then-acting director of the U.S. Department of Homeland Security, Chad Wolf, did not have the authority to send more than 100 agents to Portland because he was improperly appointed. Wolf abruptly resigned from the post in 2021, saying he was compelled to leave by “recent events,” including court rulings that found he could not legally hold the position.\n\nA spokesperson for the Department of Homeland Security directed a request for comment about the settlement on Tuesday to the Department of Justice, which didn't respond.\n\nA federal investigative report later found that the militarized federal agents didn't have the proper training or equipment and there was no plan for operating without the help of local police.\n\nLocal police arrested hundreds of people over the three months of protest and federal agents arrested nearly 100 people at the height of the demonstrations.","summary":"The American Civil Liberties Union of Oregon has announced the settlement of a lawsuit alleging that agents sent by President Donald Trump in 2020 to protect a federal courthouse used excessive force against racial justice protesters","url":"https://www.independent.co.uk/news/aclu-ap-donald-trump-portland-oregon-b2683933.html","image":"https://static.independent.co.uk/2025/01/22/00/Portland_Protests_Lawsuit_Settlement_68706.jpg?width=1200","video":null,"publish_date":"2025-01-22 00:00:46","author":"Via AP news wire","authors":["Via AP news wire"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.285},{"id":282513466,"title":"In Trump 2.0, Japan faces a familiar uncertainty","text":"Donald Trump’s return to the White House has sparked a wave of anxiety and cautious hope across Japan, a nation deeply intertwined with America’s economic and security policies.\nWhile the Japanese government offered measured congratulations, the public response has been far more conflicted: a mix of concern over tariffs, rising regional tensions and Trump’s “America First” isolationism.\n“Everything just seemed more unstable the last time he was president,” said Kanako Hosomura, a housewife from Yokohama. “I worry that is going to happen again.”\nOfficial congratulations swiftly followed Trump’s inauguration on Monday, with Emperor Naruhito sending a formal message and Prime Minister Shigeru Ishiba posting about his hopes for strengthening the Japan-US alliance on social media.\n\n“I look forward to collaborating with you to reinforce the enduring Japan-US partnership,” Ishiba wrote. Yet his optimism contrasted sharply with the mood among the wider public.\nA recent poll by the Mainichi Shimbun newspaper revealed that 57.8 per cent of respondents felt “anxious” or “worried” about Trump’s second term, while fewer than 35 per cent said they had high expectations for his presidency.\n“It seems to me that no leader is really thinking about what is best for ordinary people,” said Hosomura, citing fears that fresh barriers to trade would cause the price of daily necessities to rise and weaken the yen even further.\nOthers, like Tokyo businessman Ken Kato, see Trump’s policies as a mixed bag. “I am quite positive about Trump’s return, although I of course do not agree with all of his ideas,” he said.\n\nKato praised Trump’s hardline stance on illegal immigration and his push for fostering national pride through education – policies he believes Japan should emulate. But he was quick to criticise Trump’s climate change denial and decision to withdraw from the Paris Agreement. “It’s not a hoax,” Kato said firmly. “We feel it every year as temperatures continue to rise, and you don’t have to be a scientist to see that.”\nThe businessman also expressed alarm over Trump’s trade policies, which many experts predict will disrupt global markets and exacerbate inflation.\nPerhaps the most pressing concern in Japan, however, is the impact of Trump’s foreign policy on regional stability. With China growing increasingly assertive and the threat posed by North Korea, many worry that Trump’s willingness to disengage from international commitments – such as supporting Ukraine in its war with Russia – could embolden adversaries closer to home.\n“Failing to defend Ukraine will effectively be a surrender to Russia, and that would send completely the wrong message,” Kato said. He fears that a US retreat in Europe could signal to Beijing that Washington might not defend Taiwan if it were invaded. “That would have very serious consequences for Japan and the whole of the Pacific region,” he added.\n\nBeijing sees Taiwan as part of China to be reunited by force if necessary. Most countries, including the US, do not recognise Taiwan as an independent state, but Washington is opposed to any attempt to take the self-governed island by force and is committed to supplying it with weapons.\n“It is worrying,” said Tomoko Oono, a retired bank worker from Saitama prefecture, north of Tokyo. “I just wonder how Trump plans to deal with all these different challenges at the same time.”\nMeanwhile, Japan is bracing for renewed economic tensions. Hiromi Murakami, a political-science professor at Temple University’s Tokyo campus, said Japan’s leaders were concerned about Trump’s potential demands for increased defence spending and higher costs for maintaining US troops stationed in Japan.\n“There is a lot of concern around the possibility of tariffs and how that will affect all the Japanese companies that export to the US, including those that have invested heavily in facilities in Canada and Mexico,” she said.\nThey know what kind of person he is … I don’t think anyone is going to be surprised by anything he does this time\nHiromi Murakami, political scientist\nMurakami also noted that Ishiba’s position was weaker than that of Japan’s former prime minister Shinzo Abe, who famously cultivated a close personal relationship with Trump during his first term. Ishiba has no such relationship, and his failure to secure a meeting with Trump before the inauguration underscores that reality, according to Murakami.\nFor now, Japan is left to wait and watch as Trump’s second term unfolds. “Ishiba has little choice but to wait to hear Trump’s demands and then the government will respond,” Murakami said.\n“They know what kind of person he is,” she added. “While we expected more of him the first time around, I don’t think anyone is going to be surprised by anything he does this time. We can only hope that he learned from his first four years in power.”","summary":"Beneath the polite diplomacy lies a current of apprehension about what Donald Trump’s return means for Japan’s place in an upended world.","url":"https://www.scmp.com/week-asia/people/article/3295683/trump-20-japan-faces-familiar-uncertainty","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/22/114da23e-07f7-471a-840b-534a5e2f1d8a_369cb8d5.jpg","video":null,"publish_date":"2025-01-22 00:00:15","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":-0.019},{"id":282508218,"title":"Donald Trump open to Elon Musk buying TikTok","text":"(NewsNation) — Donald Trump said he would be open to ally and Department of Government Efficiency (DOGE) leader Elon Musk buying the social media platform TikTok.\n\n“I’d like Larry (Ellison) to buy it too,” Trump said Tuesday, referencing the Oracle executive chairman investing in Stargate.\n\nTrump said he wants TikTok to be at least half-owned by U.S. investors.\n\n\"It's worthless if you don't get a permit. ... Let the United States give the permit, and the United States should get half. Sounds reasonable,\" he said.\n\nWhen asked if he has the social media app on his phone, Trump responded, \"I think I might put it there. I think I'll get it right now. … I have a warm spot in my heart for TikTok.\"\n\nAt the same address Tuesday, Trump also took questions from journalists regarding Russian sanctions, tariffs, immigration and more.\n\nTikTok restored service to U.S. users Sunday afternoon and credited Trump for pushing to keep the app operational.\n\n“In agreement with our service providers, TikTok is in the process of restoring service,” TikTok said in a statement posted to the social platform X. \n\n“We thank President Trump for providing the necessary clarity and assurance to our service providers that they will face no penalties providing TikTok to over 170 million Americans and allowing over 7 million small businesses to thrive,” it continued. \n\nThe app briefly went dark in America before being given a reprieve by a presidential executive order on Monday.\n\nElon Musk, who has become close with Trump, posted last week to his own social media app X: “I have been against a TikTok ban for a long time, because it goes against freedom of speech. That said, the current situation where TikTok is allowed to operate in America, but 𝕏 is not allowed to operate in China is unbalanced. Something needs to change.”\n\nIn 2020, Trump tried to ban TikTok with an executive order, but two courts later shut his efforts down.\n\nNewsNation's Patrick Djordjevic contributed to this report.","summary":"TikTok restored service to U.S. users Sunday afternoon and credited Trump for pushing to keep the app operational.","url":"https://nation.lk/online/donald-trump-open-to-elon-musk-buying-tiktok-292788.html","image":"https://www.newsnationnow.com/wp-content/uploads/sites/108/2024/12/676f1192341dc7.85636080.jpeg?w=900","video":null,"publish_date":"2025-01-22 00:00:05","author":"Patrick Djordjevic","authors":["Patrick Djordjevic"],"language":"en","category":"politics","source_country":"lk","sentiment":-0.041},{"id":282514574,"title":"In Trump 2.0, it's America first, world last","text":"Donald Trump's inaugural speech is bad news for the world and India. In effect, he said America First and to hell with the rest. He promised to make the rest pay to Make America Great Again (MAGA).Abandoning the historical claim of the US to be leader of the free world, he said this had meant America paid for the security of others. He would now make others pay America for their security. This puts NATO partners on notice.He announced the creation of a Department of External Revenue. This would collect high tariffs from imports to help build America. No longer, he said, would America cut tariffs to help others prosper, he would force others to pay to make America prosper. This portends an era of high tariffs, retaliation from others, and trade wars. That will hit world trade and growth everywhere, including in India. He promised to Make in America and Hire in America . That will hit Indian H-1B visa seekers and disrupt dollar remittances from the US to India.Not for a century has an American president made such a frankly imperialist speech. He wanted to follow in the footsteps of President William Mckinley (1897-01), who started the Spanish American War of 1898 on a bogus excuse, grabbed Puerto Rico, Guam and the Philippines from Spain, and annexed Hawaii as well. Mckinley also levied high protectionist tariffs to promote American manufacturing.Recalling how America had won the West, Trump talked of American Manifest Destiny in colonising Mars. Manifest Destiny was the 19th century racist theory justifying white conquest and mass slaughter of native Americans-this was simply destiny, you see. The phrase justifies conquest to Make America Great Again.So Trump declared he would take over the Panama Canal, which had been built by the US. He said Panama had given control of the canal to China, creating a security threat. This was a brazen falsehood. The canal is controlled entirely by Panama, though the ports at the two ends are leased to a Chinese company. He also renamed the Gulf of Mexico as the Gulf of America.To stop the invasion of America by immigrants, he declared a national emergency on the southern border with Mexico. He will reinstate the stay in Mexico policy for asylum seekers. He aims to deport 11 million illegal migrants, including thousands of Indians. This will be challenged in court and it is unclear how he can identify or detain so many. But his intent touches a strong American chord. He will end the right of anybody born in the US to citizenship, aiming to keep America white.He declared a National Energy Emergency. Drill, baby, drill is his motto. He will lift all curbs on oil and gas exploration, fill US strategic reserves, and open new port terminals to make his country the biggest exporter of oil and gas. This should help reduce prices, something that will be beneficial for India. But strict sanctions will make it tougher for India to buy cheap oil from Russia and Iran.He will end diversity programs. Sneering at woke norms, he said the US will now have only two genders, male and female. Transgenders will cease to exist on paper.Even as he withdraws from the US role of leader of the free world, he says he will be a global peacemaker. His tough stance certainly helped clinch the ceasefire in Gaza. He will aim for a deal in Ukraine which allows Russia to most of its conquests.What about the impact on India? We will be hit by high tariffs. Trump has called India a tariff king and will demand India slash its own tariffs. Higher US tariffs will provoke retaliation by others and a general trade war. Slowing world trade and growth will slow India's too. H-1B visas will become very difficult to obtain. Trump will be happy to sell India more arms, oil and gas, and agricultural products. But he will seek to curb Indian exports to the US. He wants to do deals with other countries, meaning he will use his economic might to bully others into trade pacts favourable to the US. This is not a happy prospect for India.","summary":"Donald Trump's speech indicates an era of prioritising America at the expense of global partners, including India. He plans to impose high tariffs and restrict immigration, impacting the H-1B visa process. While he aims to boost oil and gas exploration, his policies could trigger trade wars, potentially affecting India's economy and export capabilities.","url":"https://economictimes.indiatimes.com/news/india/in-trump-2-0-its-america-first-world-last/articleshow/117437166.cms","image":"https://img.etimg.com/thumb/msid-117437252,resizemode-4,width-1200,height-900,imgsize-150294,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-01-22 00:00:00","author":"Swaminathan S Anklesaria Aiyar","authors":["Swaminathan S Anklesaria Aiyar"],"language":"en","category":"politics","source_country":"in","sentiment":0.053},{"id":282514150,"title":"In Trump 2.0, it's America first, world last","text":"Donald Trump's inaugural speech is bad news for the world and India. In effect, he said America First and to hell with the rest. He promised to make the rest pay to Make America Great Again (MAGA).Abandoning the historical claim of the US to be leader of the free world, he said this had meant America paid for the security of others. He would now make others pay America for their security. This puts NATO partners on notice.He announced the creation of a Department of External Revenue. This would collect high tariffs from imports to help build America. No longer, he said, would America cut tariffs to help others prosper, he would force others to pay to make America prosper. This portends an era of high tariffs, retaliation from others, and trade wars. That will hit world trade and growth everywhere, including in India. He promised to Make in America and Hire in America . That will hit Indian H-1B visa seekers and disrupt dollar remittances from the US to India.Not for a century has an American president made such a frankly imperialist speech. He wanted to follow in the footsteps of President William Mckinley (1897-01), who started the Spanish American War of 1898 on a bogus excuse, grabbed Puerto Rico, Guam and the Philippines from Spain, and annexed Hawaii as well. Mckinley also levied high protectionist tariffs to promote American manufacturing.Recalling how America had won the West, Trump talked of American Manifest Destiny in colonising Mars. Manifest Destiny was the 19th century racist theory justifying white conquest and mass slaughter of native Americans-this was simply destiny, you see. The phrase justifies conquest to Make America Great Again.So Trump declared he would take over the Panama Canal, which had been built by the US. He said Panama had given control of the canal to China, creating a security threat. This was a brazen falsehood. The canal is controlled entirely by Panama, though the ports at the two ends are leased to a Chinese company. He also renamed the Gulf of Mexico as the Gulf of America.To stop the invasion of America by immigrants, he declared a national emergency on the southern border with Mexico. He will reinstate the stay in Mexico policy for asylum seekers. He aims to deport 11 million illegal migrants, including thousands of Indians. This will be challenged in court and it is unclear how he can identify or detain so many. But his intent touches a strong American chord. He will end the right of anybody born in the US to citizenship, aiming to keep America white.He declared a National Energy Emergency. Drill, baby, drill is his motto. He will lift all curbs on oil and gas exploration, fill US strategic reserves, and open new port terminals to make his country the biggest exporter of oil and gas. This should help reduce prices, something that will be beneficial for India. But strict sanctions will make it tougher for India to buy cheap oil from Russia and Iran.He will end diversity programs. Sneering at woke norms, he said the US will now have only two genders, male and female. Transgenders will cease to exist on paper.Even as he withdraws from the US role of leader of the free world, he says he will be a global peacemaker. His tough stance certainly helped clinch the ceasefire in Gaza. He will aim for a deal in Ukraine which allows Russia to most of its conquests.What about the impact on India? We will be hit by high tariffs. Trump has called India a tariff king and will demand India slash its own tariffs. Higher US tariffs will provoke retaliation by others and a general trade war. Slowing world trade and growth will slow India's too. H-1B visas will become very difficult to obtain. Trump will be happy to sell India more arms, oil and gas, and agricultural products. But he will seek to curb Indian exports to the US. He wants to do deals with other countries, meaning he will use his economic might to bully others into trade pacts favourable to the US. This is not a happy prospect for India.","summary":"Donald Trump's speech indicates an era of prioritizing America at the expense of global partners, including India. He plans to impose high tariffs and restrict immigration, impacting the H-1B visa process. While he aims to boost oil and gas exploration, his policies could trigger trade wars, potentially affecting India's economy and export capabilities.","url":"https://economictimes.indiatimes.com/news/international/world-news/in-trump-2-0-its-america-first-world-last/articleshow/117437305.cms","image":"https://img.etimg.com/thumb/msid-117437252,resizemode-4,width-1200,height-900,imgsize-150294,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-01-22 00:00:00","author":"Swaminathan S Anklesaria Aiyar","authors":["Swaminathan S Anklesaria Aiyar"],"language":"en","category":"politics","source_country":"in","sentiment":0.053},{"id":282512896,"title":"In Davos, Malaysia's Khazanah looks to developed market investments, tame Trump risks - Reuters.com","text":"SummaryCompaniesKhazanah continues rebalancing portfolio amid Trump risksKhazanah sees opportunities in developed marketsMalaysia attracts FDI with stable economy, digital investments boost growth\n\nDAVOS, Switzerland, Jan 21 (Reuters) - Malaysia's sovereign wealth fund Khazanah Nasional Bhd is rebalancing its portfolio to invest more in developed markets, with an eye on managing expected risks from the new Donald Trump presidency in the U.S., its top official said.\n\nKhazanah [RIC:RIC:KHAZA.UL] invests heavily in Malaysia, with domestic investments amounting to 59.1% of its portfolio, followed by North America at 15.5%. The fund invests in sectors ranging from energy and healthcare to information technology and real estate, according to its website.\n\nAdvertisement · Scroll to continue\n\nIn an interview at the World Economic Forum's annual gathering in Davos, Khazanah Managing Director Amirul Feisal Wan Zahir said the potential for less regulation, lower taxes, cheap energy, inflationary pressures and a strong dollar, due to the Trump administration's expected policies, provided opportunities to invest in developed markets.\n\n\"We do need to move still into developed markets ... we look at U.S., Europe and Japan. U.S. still is an attractive market,\" Amirul Feisal told the Reuters Global Markets Forum, opens new tab on Monday.\n\nAdvertisement · Scroll to continue\n\nAmirul Feisal, however, said Khazanah could face challenges in China. Trump, who was sworn in on Monday, has threatened to slap tariffs of 10% to 60% on Chinese goods.\n\nKhazanah will hold its investments in China and manage its risks, as the country's growing middle-income demographic and vibrant technology sector continue to make it appealing, Amirul Feisal said. Investments in China amount to 8% of Khazanah's portfolio.\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 480pAuto (480p) \n\nAbout ConnatixV554559 \nAbout ConnatixV554559 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nHe also said Khazanah was bullish about its investments in India due to good returns in public and private markets.\n\nCAPITAL RETURNING TO MALAYSIA\n\nAmirul Feisal was positive on Malaysia's growth prospects due to increasing foreign direct investments, a solid domestic economy, and higher household spending.\n\n\"Malaysia is a bit unique because it's a market people have forgotten for a while, and what we saw in 2024 was a lot more capital flowing back into Malaysia,\" he said.\n\nAmirul Feisal said while market volatility is expected, the Malaysian government's policies will continue to attract FDI and drive domestic direct investments through Khazanah and the Employees Provident Fund.\n\nMalaysia is fast becoming a haven in Southeast Asia, with foreign investors returning, as improving growth and a stable currency set it apart from peers grappling with political flux and economic uncertainty.\n\nThe country received a slew of digital investments from tech firms last year, including Alphabet's Google, Microsoft and Oracle , helping propel its economy above market expectations in the second and third quarters, and making the ringgit one of Asia's top performing currencies in 2024.\n\n(Join GMF, a chat room hosted on LSEG Messenger, for live interviews: https://lseg.group/4ajdDTy, opens new tab)\n\nReporting by Divya Chowdhury in Davos and Danial Azhar in Kuala Lumpur; Editing by Rod Nickel\n\nXFacebookLinkedinEmailLinkPurchase Licensing Rights\n\nDivya ChowdhuryThomson ReutersA financial journalist for nearly two and a half decades, Divya currently covers the length and breadth of global markets while managing journalist-led communities of cross-asset financial market participants on LSEG Messenger. She has a strong grasp on markets, macroeconomics and company news, regularly hosts panel discussions and interviews, both on- and off-camera, and is a Davos regular since 2019. Her strategic mindset helps her team engage LSEG's buy- and sell-side clients, providing them with actionable intelligence and getting them access to the biggest voices in business and finance across the world. Email","summary":"In Davos, Malaysia's Khazanah looks to developed market investments, tame Trump risks  Reuters.com","url":"https://www.reuters.com/business/finance/davos-malaysias-khazanah-looks-developed-market-investments-tame-trump-risks-2025-01-21/","image":"https://www.reuters.com/resizer/v2/ONR2UT6S2RJ5FDD6S36INXTHEI.jpg?auth=df47f1d5ec454fc3023235a502f6d46aed4310f39dcf03bd1f561077a1d24804&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-01-21 23:59:54","author":"Danial Azhar,Divya Chowdhury","authors":["Danial Azhar","Divya Chowdhury"],"language":"en","source_country":"gb","sentiment":0.052},{"id":282505936,"title":"German national suspect identified in deadly shooting of US Border Patrol agent in Vermont","text":"A German national suspect on a legal visa allegedly killed a United States Border Agent during a traffic stop in Vermont near the Northern border, Fox News Digital has confirmed. \"Our partners at the Department of Homeland Security confirmed the deceased subject is a German national in the U.S. on a current Visa,\" a spokesperson with FBI Albany said. Officials said on Monday, Jan. 20, 44-year-old U.S. Border Patrol Agent David \"Chris\" Maland was struck by gunfire during a traffic stop on Interstate 91 between Newport and Orleans, Vermont. In a statement, FBI Albany said that Maland was a U.S. Air Force veteran, saying: \"We are heartbroken for our partners and share in their grief as they mourn the loss of their colleague.\" US BORDER PATROL AGENT KILLED IN VERMONT TRAFFIC STOP: DHS Officials said that two suspects were in the car. Officials confirmed that one of the suspects was dead and the other was injured and is currently being treated at an area hospital. The FBI field office said it iscontinuing to work closely with federal, state and local officials to further investigate the incident. BORDER PATROL AGENT KILLED IN VERMONT IDENTIFIED \"FBI Albany has numerous resources in the area, to include our Evidence Response Team (ERT), Victim Services, Digital Forensics, and dozens of Special Agents,\" they said. On Monday night, authorities were seen using a robotic device to inspect a backpack near what appeared to be a body on the ground at the scene. The Border Patrol Union shared its condolences, saying on X, \"Our hearts and prayers go out to the family, friends, and coworkers of our fallen brother in green in Vermont.\" CLICK HERE TO GET THE FOX NEWS APP Sen. Bernie Sanders (I-Vt.), Sen. Peter Welch (D-Vt.), and Rep. Becca Balint (Vt.-AL) shared their condolences with the family. \"Border Patrol agents do important work protecting our borders. They deserve our full support in terms of staffing, pay and working conditions,\" the elected officials shared in a statement Tuesday. \"We look forward to working with the agency to make sure that they have all the resources they need to do the enormously important work that is their responsibility. Together, we must do everything possible to prevent future tragedies like what happened today.\" The shooting came just hours after President Donald Trump was inaugurated to a second term. He campaigned heavily on securing the border and defending law enforcement.","summary":"A German national suspect on a legal visa allegedly killed a United States Border Agent during a traffic stop in Vermont near the Northern border on Monday.","url":"https://www.foxnews.com/us/german-national-suspect-identified-deadly-shooting-us-border-patrol-agent-vermont","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/border-agent-shooting-vermont_001.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-21 23:57:22","author":"Sarah Rumpf-Whitten","authors":["Sarah Rumpf-Whitten"],"language":"en","category":"politics","source_country":"us","sentiment":-0.103},{"id":282510934,"title":"Hochul reveals massive number of undocumented workers as she fears Trump crackdown can crush NY economy","text":"New York is home to a staggering 470,100 undocumented workers, Gov. Kathy Hochul’s administration said Tuesday — as the governor worried a coming crackdown on illegal immigrants could send the local economy into a tailspin.\n\nThe revelation came as Hochul unveiled a massive $252 billion budget proposal and would mean about 15% of the state’s entire workforce is undocumented, or nearly one out of every 6 employees as newly returned President Donald Trump has pledged a crackdown on illegal immigration.\n\n“The potential deportation of undocumented immigrants could further exacerbate the state’s population loss and labor shortages,” an economic outlook analysis released as part of the budget plan said.\n\nThe Center for Migration Services estimated that 470,100 workers in the Empire State are undocumented — a figure cited in Hochul’s report.\n\n“Most of them work as construction workers, maids/housekeepers, cooks, home and personal care aides, janitors, and delivery drivers, among other occupations,” Hochul said.\n\n“If workers are forced to leave their jobs, employment in these industries will be significantly disrupted.”\n\nThe analysis noted that 70% of workers in the construction industry are foreign-born.\n\n“A slowdown in the flow of new immigrants may cause labor shortages and delays in the completion of ongoing construction and negatively impact the available inventory,” Hochul’s analysis said.\n\nTrump’s team is first planning on mass deportation of criminal migrants, and the expected raids by US Immigration and Customs Enforcement has migrants fleeing the city’s migrant shelters.\n\nHochul’s report also noted that remote work has contributed to an exodus of New York residents to lower cost states.\n\n“The New York City metro area’s high cost of living has contributed to a population decline in the region,” Hochul’s analysis said.\n\n“The potential deportation of undocumented immigrants could further exacerbate the State’s population loss and labor shortages. A long-term decline in population remains a significant downside risk to both wages and employment.”\n\nConversely, New York City and the state could benefit if New York City’s population loss is less than anticipated and the immigration crackdown isn’t as restrictive as expected, the analysis concluded.","summary":"New York is home to a staggering 470,100 undocumented workers, Gov. Kathy Hochul's administration said Tuesday -- as the governor worried a coming crackdown on illegal immigrants could send the local economy into a tailspin.","url":"https://nypost.com/2025/01/21/us-news/hochul-worries-trump-crackdown-on-illegal-immigrants-can-crush-ny-economy-as-massive-number-of-undocumented-migrant-workers-revealed/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/hochul-worries-trump-crackdown-illegal-97102445.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Xv3qFqFk-RyIcpnTz.mp4","publish_date":"2025-01-21 23:56:20","author":"Carl Campanile","authors":["Carl Campanile"],"language":"en","category":"politics","source_country":"us","sentiment":-0.178},{"id":282505932,"title":"Rep. Andy Biggs eyes run for Arizona governor, says he understands 'what the state needs to thrive'","text":"Republican Arizona Congressman Andy Biggs announced his interest Tuesday in running for governor in 2026 as the GOP looks to defeat incumbent Democratic Gov. Katie Hobbs. Biggs, an ally of President Donald Trump and former chair of the conservative Freedom Caucus, filed a statement of interest, which is required before he can start collecting signatures to qualify for the ballot. However, filing a statement doesn't mean a candidate will follow through. In a statement posted on X, Biggs said he \"will bring my experience home to my native state to help it fulfill its tremendous capacity. I have a firm understanding of what the state needs to thrive.\" INFLUENCERS PRAISE TRUMP FOR DECLARING 'ONLY TWO GENDERS' WILL BE RECOGNIZED BY US: 'TRUTH IS WINNING!' Biggs chaired the Freedom Caucus from 2019 to 2021 and was one of eight Republicans who helped oust former House Speaker Kevin McCarthy, R-Calif., in 2023. If Biggs does run, it could result in a fight between him and Karrin Taylor Robson, also a Trump ally. JOE ROGAN SAYS HARRIS SITDOWN WAS SCRAPPED AFTER CAMPAIGN TOLD HIM SHE 'ONLY WANTED TO DO AN HOUR' \"Are you running for governor? I think so Karrin, because, if you do, you’re going to have my support, OK?\" Trump told a crowd last month at Turning Point USA’s Americafest event in Phoenix. Robson ran for governor in 2022 but lost to Kari Lake, who Trump endorsed. Lake lost that year's election to Hobbs and recently lost a bid for the U.S. Senate. In his statement, Biggs said he looks \"forward to conversing with my fellow Arizonans as I consider this weighty decision.\" State Sen. Jake Hoffman, a Republican and founding chair of the Arizona Freedom Caucus, endorsed Biggs on X. CLICK HERE TO GET THE FOX NEWS APP \"Andy will make an INCREDIBLE Governor and ensure Arizona is safe & prosperous for everyone,\" he wrote.","summary":"U.S. Rep. Andy Biggs, R-Ariz., said Tuesday he is considering a 2026 bid to become the next governor a Arizona, according to a post on X.","url":"https://www.foxnews.com/politics/rep-andy-biggs-eyes-run-arizona-governor-says-he-understands-what-state-needs-thrive","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/biggs.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-21 23:55:42","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"us","sentiment":0.188},{"id":282504928,"title":"Billy Ray Cyrus reveals he would never have missed the ‘honour’ of playing at Donald Trump’s inauguration","text":"Camera IconBilly Ray Cyrus plays Trump?s inauguration ball Credit: BANG - Entertainment News\n\nBilly Ray Cyrus reveals he would never have missed the ‘honour’ of playing at Donald Trump’s inauguration\n\nBANG - Entertainment NewsBang ShowbizJanuary 22, 2025 7:55AM","summary":"Despite a disastrous performance at the event, Billy Ray Cyrus has insisted he would not have missed the “honour” of playing at Donald Trump’s inauguration even if his equipment had totally failed.","url":"https://www.perthnow.com.au/entertainment/celebrity/billy-ray-cyrus-reveals-he-would-never-have-missed-the-honour-of-playing-at-donald-trumps-inauguration-c-17465780","image":"https://images.perthnow.com.au/publication/C-17465780/3cd305a2472bcd3ffc98515592ca78a7b00799c3-16x9-x0y192w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2025-01-21 23:55:17","author":"BANG - Entertainment News","authors":["BANG - Entertainment News"],"language":"en","category":"politics","source_country":"AU","sentiment":-1},{"id":282503970,"title":"24.6 Million People Watched Trump’s Inauguration","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nAbout 24.6 million people tuned in across the major networks Monday to watch President Donald Trump be inaugurated for the second, nonconsecutive time, according to Nielsen.\n\nDonald Trump is sworn in as the 47th US President in the US Capitol Rotunda in Washington, DC, on ... [+] January 20, 2025.\nAFP via Getty Images\n\nViewers watched the inauguration across 15 networks Monday, as viewership of the presidential event peaked with 34.4 million viewers during the 12:15 PM quarter-hour, according to Nielsen.\n\nOf those who watched Trump’s inauguration on Monday, more than 10 million did so on Fox News, according to the network, which reported data from 11:30 a.m. to 1 p.m. EST, and early Nielsen figures reported by The New York Times—though Nielsen reportedly noted figures may rise in revision.\n\nABC had the second-highest viewership with an average of 4.7 million viewers in that time period, followed by NBC with 4.4 million and CBS with 4.1 million—CNN had just 1.7 million viewers, according to data published in The Hollywood Reporter.\n\nFox News said the coverage was its second highest-rated inauguration day coverage in history, while MSNBC had just 848,000 people tune in, down from about 6.5 million in 2021, The New York Times reported.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nHow Did Viewership Compare To Past Inaugurations?\n\nViewership was down from the past two inaugurations. In 2021, about 33.8 million people watched President Joe Biden’s inauguration, according to Nielsen figures, and in 2017 about 31 million people watched Trump’s first inauguration.\n\nKey Background\n\nTrump was inaugurated as president of the United States around noon on Monday, which was also Martin Luther King Jr. day. The ceremony and all other inaugural events were moved inside the Capitol Rotunda for the first time since 1985 due to frigid temperatures. The inauguration was attended by a number of billionaires and tech executives—including the three wealthiest people in the world, Elon Musk, Jeff Bezos and Mark Zuckerberg—in addition to lawmakers and all living former presidents. After taking the oath of office, Trump gave a speech to the Rotunda crowd before moving to a different venue and giving a longer, more free-styled speech about his hopes for his time in office.\n\nFar more people tuned in to watch Trump’s only debate with then-Vice President Kamala Harris. More than 67 million people watched the debate in September, according to Nielsen, which marked an 18% increase from the 51.3 million people who watched Trump debate Biden months earlier.\n\nFurther Reading\n\nMore Than 67 Million People Watched ABC’s Harris-Trump Debate On TV (Forbes)\n\nTrump Inauguration Photos: High-Profile Guests Move To Capital One Arena For Parade (Forbes)\n\nTrump Inauguration Live Updates: Trump Pardons Almost All Jan. 6 Riot Defendants—And Targets Birthright Citizenship (Forbes)\n\nFollow me on Twitter. Send me a secure tip. \n\nMolly Bohannon\n\nEditorial Standards\n\nForbes Accolades","summary":"Viewership for the inauguration was down from President Joe Biden’s 2021 ceremony, according to Nielsen figures.","url":"https://www.forbes.com/sites/mollybohannon/2025/01/21/246-million-people-watched-trumps-inauguration/","image":"https://imageio.forbes.com/specials-images/imageserve/67902da329fc8a278f652a1e/0x0.jpg?format=jpg&crop=1459,820,x0,y75,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-21 23:55:15","author":"Forbes Staff,Molly Bohannon","authors":["Forbes Staff","Molly Bohannon"],"language":"en","category":"politics","source_country":"US","sentiment":0.16},{"id":282505374,"title":"Breaking down the executive actions Trump is using to govern","text":"Breaking down the executive actions Trump is using to govern : Consider This from NPR President Donald J. Trump began taking decisive steps to implement his agenda hours after being sworn in. In the day since he's once again become President, Trump has signed more than 200 executive actions aimed at delivering on campaign promises such as lower energy prices, mass deportations and an end to birthright citizenship. There's been a deluge of actions, orders and pronouncements during the President's first day. From tariffs to immigration to the January 6th pardons – we breakdown everything down. For sponsor-free episodes of Consider This, sign up for Consider This+ via Apple Podcasts or at plus.npr.orgEmail us at considerthis@npr.org\n\n Consider This from NPR\n\n Consider This from NPR\n\n Apple Podcasts\n\n Amazon Music\n\n Breaking down the executive actions Trump is using to govern\n\n January 21, 20256:54 PM ET\n\n Breaking down the executive actions Trump is using to govern\n\n Enlarge this image\n\n US President Donald Trump signs executive orders during the inaugural parade inside Capital One Arena, in Washington, DC.\n\n ANGELA WEISS/AFP via Getty Images\n\n hide caption\n\n toggle caption\n\n ANGELA WEISS/AFP via Getty Images\n\n US President Donald Trump signs executive orders during the inaugural parade inside Capital One Arena, in Washington, DC.\n\n ANGELA WEISS/AFP via Getty Images\n\n President Donald J. Trump began taking decisive steps to implement his agenda hours after being sworn in. In the day since he's once again become President, Trump has signed more than 200 executive actions aimed at delivering on campaign promises such as lower energy prices, mass deportations and an end to birthright citizenship. There's been a deluge of actions, orders and pronouncements during the President's first day. From tariffs to immigration to the January 6th pardons – we breakdown everything down. For sponsor-free episodes of Consider This, sign up for Consider This+ via Apple Podcasts or at plus.npr.orgEmail us at considerthis@npr.org \n\n This episode was a huge team effort. It was produced by Brianna Scott, Gabriel Sanchez and Michelle Aslam. It was edited by Courtney Dorning, Robert Little, Nadia Lancy, Justine Kenin, Roberta Rampton, Tara Neill and John Ketchum. Our executive producer is Sami Yenigun.","summary":"President Donald J. Trump began taking decisive steps to implement his agenda hours after being sworn in.  \n\nIn the day since he's once again become President, Trump has signed more than 200 executive actions aimed at delivering on campaign promises such as lower energy prices, mass deportations and an end to birthright citizenship. \n\nThere's been a deluge of actions, orders and pronouncements during the President's first day. From tariffs to immigration to the January 6th pardons – we breakdown everything down. \n\nFor sponsor-free episodes of Consider This, sign up for Consider This+ via Apple Podcasts or at plus.npr.org\n\nEmail us at considerthis@npr.org","url":"https://www.npr.org/2025/01/21/1225890669/breaking-down-the-executive-actions-trump-is-using-to-govern","image":"https://media.npr.org/assets/img/2025/01/21/gettyimages-2194440818-b2aa9cafaeaba7134aee21a099df9e7155d3f1dd.jpg","video":null,"publish_date":"2025-01-21 23:54:25","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.287}]}