{"offset":0,"number":50,"available":20341,"news":[{"id":283285234,"title":"Mayor Johnson ‘not intimidated’ after Trump threatens to investigate local leaders in sanctuary cities","text":"Chicago Mayor Brandon Johnson Thursday dismissed President Donald Trump’s threats of potential federal investigations and prosecutions over immigration enforcement, vowing the city will maintain its sanctuary status.\n\n“There are a host of threats that this president has put forward, and we’re not intimidated or overwhelmed by any of them,” Johnson said in a phone interview with WBEZ. “I don’t sit around thinking about the hypotheticals.”\n\nThe Department of Justice Tuesday threatened state and local officials who impede immigration enforcement could be investigated and face federal prosecution. A three-page memo warned “federal law prohibits state and local actors from resisting, obstructing, and otherwise failing to comply with lawful immigration-related commands or requests,” according to NPR. Local leaders and legal experts called the threat “performative,” “dangerous” and a “tortured interpretation” of the law while defending Illinois and Chicago’s sanctuary statuses.\n\nJohnson said Thursday he was not aware of any subpoenas received by the city’s law department on this issue, and tried to ease fears of prosecution police or elected officials may be feeling.\n\n“Whether you’re a local elected official or you’re a local police officer, the message is: follow the law,” Johnson said.\n\nCurrently, Illinois and Chicago law prohibits police officers from cooperating with federal immigration enforcement. Police officers are not allowed to, for instance, ask about a person’s immigration status, or detain a person longer than their release date, per the federal government’s request, to give an immigration agent time to show up.\n\nAlex Gough, a spokesperson for Democratic Illinois Gov. JB Pritzker, said “threats to prosecute and jail elected officials who defend the law are not acceptable political discourse in the United States.” He vowed law enforcement will follow Illinois law.\n\n“If the intention is to intimidate officials from defending the Constitution — it will not work,” Gough said in a statement.\n\nCourts have made clear that state and local officials have the authority to direct law enforcement resources as they see fit, said Ed Yohnka, the ACLU of Illinois’ Director of Communications and Public Policy.\n\n“It is not the job of the White House to decide that for the city of Chicago, for the state of Illinois, or for any other municipality across the country,” Yohnka said. “The only thing that they seem to be doing that the White House objects to, is disagreeing with Trump administration policy, and for the moment at least, that is not against the law. It is not a crime to disagree with Donald Trump.”\n\nTrump’s ‘performative threats’\n\nBut Yohnka said despite the “largely performative” threats, he worries it may give sheriffs or elected officials who don’t agree with state law an excuse to violate Illinois laws that largely prohibit enforcing federal immigration law.\n\n“We think it’s really important for that reason that state officials stand up to these bullying efforts and make clear that the responsibility of elected officials in Illinois is to follow Illinois law,” Yohnka said.\n\nMark Fleming, the associate director of litigation for the Chicago-based National Immigrant Justice Center, called the memo a “fundamental misstatement of decades of constitutional law from the Supreme Court” and said the 10th Amendment of the Constitution makes “very clear that the federal government cannot command state and local officials to enforce federal regulatory programs.”\n\nFleming added that the federal statute cited in the Trump administration memo is meant to prohibit individual people from smuggling immigrants into the U.S., helping them evade immigration enforcement, such as “hiding them in a house or providing false information.”\n\nSanctuary laws in Chicago and Illinois do not direct police officers to “harbor” undocumented immigrants or help them evade enforcement. Officers in the vast majority of cases are prohibited from even inquiring about a person’s immigration status.\n\nBut Fleming said while he is “very doubtful” that the Trump administration could actually prosecute and convict local officials, the memo represents “an incredibly dangerous weaponization of the powers of the Department of Justice.”\n\n“The old adage goes … ‘you can indict a ham sandwich,’” Fleming said. “My biggest fear is that they’re able to get somebody indicted and that has a real chilling effect, even if it never leads to a trial or even if it never leads to a conviction.”\n\nRaids yet to materialize\n\nChicago has been bracing for the promise of mass immigration raids that have yet to materialize. On Thursday afternoon at an unrelated press conference, Pritzker said Illinois still hasn’t received word from the Trump administration.\n\n“That is an indication to all of you that it’s all about chaos and confusion. It is not about accomplishing something,” Pritzker said.\n\nOn Thursday, a federal judge sided with Illinois and other states by temporarily blocking Trump’s executive order that aimed to end birthright citizenship for the U.S.-born children of immigrants without legal status. Johnson announced Thursday the Chicago Transit Authority would display ads connecting riders with the city’s guides on what to do when encountering federal immigration authorities.\n\nChicago City Council members have been working with volunteers and advocates to provide “Know Your Rights” trainings, vet rumors of immigration raids and start to lay the groundwork for legislation to shore up more protections.\n\nAld. Rossana Rodriguez Sanchez, (33rd), said local officials are consulting legal experts themselves to protect themselves against threats of prosecution by the Trump administration.\n\n“We all need to know what our rights are and we are going to learn them very well and we’re going to learn how to exercise them,” she said. “It’s always concerning to hear [these threats] but it is not something that deters me or the rest of the electeds that I organize with from doing the work that we need to do.”\n\nThe last few days navigating the slew of executive orders signed and trying to stay vigilant amid reports of possible raids have been “overwhelming,” Ald. Nicole Lee said. She worries federal immigration authorities now being authorized to conduct arrests in “sensitive areas,” like houses of worship and schools, will only lead to more trepidation.\n\n“We don’t want mass panic. We want people to feel comfortable interacting with the city and getting services and going to school and going to church and going about their lives that people are trying to build here,” Lee said.\n\nAld. Andre Vasquez, (40th), chair of the City Council’s Committee on Immigrant and Refugee Rights, said the committee is looking to address where gaps exist in city government and what legislation to pursue.\n\nSanctuary city exceptions rejected\n\nA majority of the City Council earlier this month rejected an attempt to carve out exceptions to Chicago’s Welcoming City Ordinance. Ald. Byron Sigcho Lopez, (25th), pointed to Evanston’s Welcoming City Ordinance as one Chicago should emulate to add stronger protections to protect against Trump’s suggestions of using the military to aid in immigration enforcement.\n\n“I think strengthening that ordinance is within reach to make sure that we got zero collaboration with any federal authorities,” Sigcho Lopez said.\n\nOn Wednesday, the City Council’s Committee on Health and Human Relations advanced an ordinance to establish a working group to better protect the transgender community. The working group, which Johnson initiated last year via executive order, will recommend updates to city policy, with a focus on hate crimes, transfemicide and barriers trans people of color face.\n\nIt heads to the full City Council for approval, and its formation is taking on a new urgency in the wake of Trump’s executive orders that target the transgender community. Rodriguez Sanchez vowed the City Council will continue “going in the opposite direction” of the Trump administration.\n\n“The current presidential administration has proclaimed only two genders, male and female. But the reality of the human experience demonstrates that gender expansive people have, do and will always exist,” Albie Gutierrez, a therapist with the Chicago Therapy Collective, told alderpersons.\n\nTessa Weinberg and Mariah Woelfel cover government and politics at WBEZ.","url":"https://chicago.suntimes.com/politics/donald-trump/2025/01/23/mayor-brandon-johnson-trump-threats-local-leaders-sanctuary-cities","image":"https://cst.brightspotcdn.com/dims4/default/206cc35/2147483647/strip/true/crop/6122x3495+0+294/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Feb%2F25%2F7b2ae68c46028bf6ebf313bc13d0%2Fprit","video":null,"publish_date":"2025-01-24 01:06:17","author":"Mariah Woelfel | Wbez,Tessa Weinberg | WBEZ","authors":["Mariah Woelfel | Wbez","Tessa Weinberg | WBEZ"],"language":"en","category":"politics","source_country":"us","sentiment":-0.07},{"id":283284808,"title":"Lumbee Tribe designation among a flurry of Trump's executive orders","text":"Jan. 23 (UPI) -- The largest Indigenous tribe east of the Mississippi River is on its way to federal recognition and full tribal benefits after President Donald Trump's order Thursday.\n\nThe federal order means members of the Lumbee Tribe of North Carolina will now receive full federal benefits, something that was lacking in previous government recognitions.\n\n\"The State of North Carolina recognized the Lumbee Tribe in 1885, and in 1956, President Dwight D. Eisenhower signed the 1956 Lumbee Act, which recognized the Lumbee but denied them some federal benefits,\" a fact sheet released by the White House said.\n\nIt takes an act of Congress, the Department of the Interior's Office of Federal Acknowledgement process, or a federal court decision to gain status as a fully recognized tribe.\n\nThe secretary of the Interior will decide the best route to make that happen, according to the release. Federal recognition makes health care accessible from the Indian Health Services, grants tribes governmental autonomy, land protections, and access to other federal programs.\n\nTrump has nominated former N.D. Gov. Doug Burgum for the post. He cleared the last hurdle before facing a confirmation when his nomination was advanced 18-2 by the Senate Energy and Natural Resources Committee Thursday.\n\nTrump said during the campaign that he planned to direct the Lumbee Tribe to receive full federal recognition and the White House release said he was making good on that promise.\n\n\"Today, I'm officially announcing that, if I am elected in November, I will sign legislation granting the great Lumbee Tribe federal recognition that it deserves,\" Trump said in September, fewer than two weeks before the election.\n\nThe Lumbee Tribe designation was one of several executive orders the new president signed on Thursday, which also included actions designed to bolster AI and the cryptocurrency business in the country.\n\n\"We're going to make a lot of money for the country,\" Trump said, supporting the efforts of his new so-called \"crypto czar\" David Sacks, according to PBS\n\nTrump also pardoned anti-abortion activists who were arrested for blocking the entrances to an abortion clinic in Washington, D.C., in 2020.\n\n\"They should not have been prosecuted,\" Trump said while signing the pardons for what he called \"peaceful pro-life protesters.\"\n\nHe also signed orders seeking to declassify federal records regarding the assassinations of President John F. Kennedy, Sen. Robert F. Kennedy, and Martin Luther King Jr. The order for Kennedy directs the classified records to be released in fewer than two weeks.","summary":"The largest Indigenous tribe east of the Mississippi River is on its way to federal recognition and full tribal benefits after President Donald Trump's order Thursday.","url":"https://www.upi.com/Top_News/US/2025/01/23/Lumbee-tribe-designation-ordered-by-trump/8381737678041/","image":"https://cdnph.upi.com/ph/st/th/8381737678041/2025/upi/097d06e13138b91c31b651687f9f0a45/v1.2/Trump-order-grants-federal-recognition-for-North-Carolinas-Lumbee-Tribe.jpg","video":null,"publish_date":"2025-01-24 01:04:42","author":"Mark Moran","authors":["Mark Moran"],"language":"en","category":"politics","source_country":"us","sentiment":-0.04},{"id":283284016,"title":"Trump’s threat as monster fire burns","text":"Four thousand firefighters have been deployed to battle the monster Hughes fire which broke out about 11am on Wednesday, local time, near Castaic Lake. \n\nAs of Thursday morning (local time), the fire had grown to 10,176 acres, with only 14 per cent contained.\n\nMeanwhile, a new, smaller blaze, the Laguna fire, has broken out in Ventura County, promoting the brief evacuation of a nearby university. \n\nAt least 28 people have died as a result of the wildfires, which first broke out in Los Angeles two weeks ago on January 7. \n\nRead on for the latest updates from the Los Angeles fires. \n\nMORE:Celeb homes destroyed in LA fires revealed\n\nTrump threatens to withhold federal aid\n\nPresident Donald Trump has threatened to withhold federal disaster aid unless California changes its water policies. \n\nIn an interview with Fox News on Wednesday, Mr Trump slammed California’s water management, repeating false claims that California’s fish conservation efforts in the northern part of the state were responsible for fire hydrants drying up. He called for more water to be sent down to the southern part of the state. \n\n“I don’t think we should give California anything until they let the water run down,” Mr Trump said. \n\nIt comes after the President earlier blasted California Governor Gavin Newscum for refusing “to sign the water restoration declaration put before him that would have allowed millions of gallons of water” into parts of California, which are currently burning.\n\n“He wanted to protect an essentially worthless fish called a smelt, by giving it less water (it didn’t work!),” he wrote on Truth Social. \n\nLocal officials have denied claims hydrants had dried up because of conservation efforts for the delta smelt, instead blaming demand on the municipal system.\n\n“The claim that Delta smelt protections in the Bay-Delta estuary are limiting the amount of water exported to southern California, which, in turn, would affect the amount of water available for emergency response, has no merit whatsoever,” Ashley Overhouse, a California water policy advisor for Defenders of Wildlife, toldABC News.\n\nElsewhere during the Fox News interview, Mr Trump called for reform of the Federal Emergency Management Agency.\n\n“I’d rather see the states take care of their own problems,” he said, adding there would be “a whole big discussion very shortly”. \n\nMr Trump will visit areas devastated by the fires wildfires in his first presidential trip of his second term on Friday. \n\nFire breaks out near California freeway A small fire has broken out along a freeway in Seal Beach, California, causing closures and traffic chaos. \n\nThe blaze was reported at about 1.30 pm on Thursday, local time, near the interchange from the northbound 405 Freeway to the northbound 605 Freeway.\n\nFootage shared by Fox 11 Los Angeles shows bright orange flames and billowing black smoke coming from a patch of vegetation next to the freeway as cars and trucks drive past. \n\nMultiple freeway lanes were closed as firefighters worked to battle the flames. \n\nFirefighters managed to stop the fire’s forward progress and have held the blaze to about 1 acre.\n\nOrange County Fire Authority said no structures were threatened in the fire and there were no reported injuries.\n\nOfficials are investigating the cause of the fire.\n\nNew blaze breaks near university \n\nFirefighters are battling a new blaze which broke in Ventura County, briefly forcing the evacuation of a nearby university. \n\nThe Laguna Fire started at about 8.51am on Thursday, local time, in the hills west of the California State University Channel Island campus.\n\nAbout 200 firefighters were deployed to battle the blaze which prompted Ventura County Sheriff’s Department to issue an evacuation for California State University Channel Island. \n\n“VCSO has issued evacuation orders for the Cal State Channel Islands Campus and fire resources are in place evaluating any potential structure threats,” Ventura County Fire Department wrote on X. \n\nThe Ventura County Sheriff’s Department has since downgraded its evacuation order to a warning, prompting the university campus to reopen. \n\nThe fire burned about 50 acres, fire officials said.","summary":"Donald Trump has threatened to withhold federal aid as wildfires continue to ravage Los Angeles, forcing thousands from their homes.","url":"https://www.news.com.au/technology/environment/donald-trump-threatens-to-withhold-federal-aid-as-monster-fire-continues-to-burns-in-la/news-story/fd2737f37670a6854b0004a779ff63c8?from=rss-basic","image":"https://content.api.news/v3/images/bin/37e1fea23f12f1a9b47addf77d201001","video":null,"publish_date":"2025-01-24 01:04:18","author":"Brielle Burns","authors":["Brielle Burns"],"language":"en","category":"politics","source_country":"au","sentiment":-0.722},{"id":283284540,"title":"4 Things to Know About JD Vance’s Pro-Life Journey","text":"Vice President JD Vance is scheduled to address the March for Life rally in Washington D.C. on Friday.\n\nVance identifies as pro-life, though some pro-lifers have expressed disappointment by his compromises on the issue after President Donald Trump identified him as a potential running mate last year.\n\nBut Vance maintains he is pro-life, and he has repeatedly suggested that pro-lifers need to become more politically savvy if they are to save the lives of unborn babies, given that most voters in the country support allowing abortion in the majority of cases.\n\nIn July 2024 the Register described Vance’s Catholic journey. Today, the Register profiles Vance with respect to abortion, and with some background as to how he got there.\n\n1. Who Is JD Vance?\n\nJames David Vance, 40, was born in 1984 in Middletown, Ohio into a dysfunctional extended family whose loves, loyalties and problems later became the stuff of his 2016 mega-selling memoir Hillbilly Elegy.\n\nHe spent much of his childhood living with his grandmother because his drug-addicted mother rarely provided a stable home. Violence, drunkenness, drug abuse and other self-destructive behavior ran through his extended family from rural Kentucky.\n\nVance exhibited some of those behavioral trends as a teenager. But a stint in the U.S. Marine Corps helped turn his life around. He came out of the service highly motivated, earned a bachelor’s degree from Ohio State in just one year and 11 months while working to support himself, and went on to become one of the few students from a state university to attend Yale Law School.\n\nAt Yale, he met his future wife, Usha, a Hindu whose parents are originally from India. They married in 2014. They have three small children and have a permanent home in Cincinnati.\n\nThe publication of Hillbilly Elegy: A Memoir of a Family and Culture in Crisis in June 2016 led to frequent television appearances and established him as a go-to source for reporters seeking to explain the social and political behavior of poor white people in Middle America. According to its publisher, the book has sold more than 3 million copies.\n\nVance worked for a law firm after graduating from Yale Law School. He later went into venture capital before deciding to run for the U.S. Senate from Ohio as a Republican in November 2022. He won, taking office in January 2023.\n\nIn July 2024, now-President Donald Trump selected Vance as his running mate in the November 2024 presidential election, and on Monday he was sworn in as the 50th vice president of the United States, shortly before Trump took the oath of office for his second (nonconsecutive) term.\n\n2. What Religion Is Vance?\n\nVance is Catholic. He was baptized in August 2019 by a Dominican priest. He wrote a 7,000-word essay about his conversion for The Lamp in May 2021.\n\nVance grew up with little organized religion, though his grandmother was a believing Christian.\n\nHe wasn’t baptized and rarely went to church. When he did, it was mostly with his father, with whom he occasionally stayed as an adolescent. His father at that point attended a Pentecostal church, which Vance for a time identified with.\n\nAs a young man, Vance drifted into atheism. He became interested in Christianity again during a philosophy course in college. His long trek to Catholicism began in law school, through the influence of Catholic friends. Dominican priests guided his studies in the faith before he joined the Church.\n\nShortly after he became a Catholic in August 2019, Vance told an interviewer that the Church’s outlook on public affairs helped draw him in.\n\n“My views on public policy and what the optimal state should look like are pretty aligned with Catholic social teaching,” Vance told Rod Dreher of The American Conservative.\n\n3. What Is Vance’s History on Abortion?\n\nIt’s complicated.\n\nAbortion never comes up in his book Hillbilly Elegy. He mentions teenage pregnancy several times — his mother, his grandmother and a cousin he’s close to (“one of my all-time favorite people”) all got pregnant as unmarried teens. But he never mentions the word “abortion” or refers to it.\n\nAs a first-time candidate for political office in the 2022 U.S. Senate campaign, Vance initially staked out an unusually expansive pro-life position.\n\nIn September 2021, he told an interviewer in Ohio that he supported a state law in Texas that bans abortion. “I think in Texas they’re trying to make it easier for unborn babies to be born,” he said.\n\nThe interviewer asked him about so-called hard cases — rape and incest. Vance said the real question in such cases is “whether a child should be allowed to live.”\n\n“Look, I think two wrongs don’t make a right. At the end of the day, we’re talking about an unborn baby,” Vance said. “What kind of society do we want to have? A society that looks at unborn babies as inconveniences to be discarded?”\n\nAfter a year of campaigning, Vance shifted his rhetoric. During two debates with his Democratic opponent in October 2022, Vance took more conventionally Republican positions.\n\nDuring the first debate, under fire from his opponent for what he called Vance’s “extremism” on abortion, Vance said he had “always believed in reasonable exceptions,” including allowing a pregnant 10-year-old girl to have an abortion.\n\n“I have said, repeatedly on the record, that I think that girl should be able to get an abortion if she and her family so choose to do so,” Vance said.\n\nDuring the second debate that month, he said he supported a proposal in Congress at the time that would have banned abortion nationwide after 15 weeks, while allowing states to decide for themselves on whether to restrict it further or ban it.\n\nIn January 2023, Vance was one of 24 Republican U.S. senators who signed a letter asking the Biden administration’s attorney general, Merrick Garland, to enforce the federal Comstock Act of 1873, which bans sending items that cause abortion through the mail. The letter called on the administration to stop allowing abortion pills to be sent “by mail or common carrier.”\n\nWhen the Trump campaign let it be known that Vance was on the shortlist to be Trump’s running mate in the summer of 2024, Vance aligned his public statements on abortion with Trump’s — including support for abortion pills.\n\nKristen Welker, host of NBC’s Meet the Press, asked Vance about the abortion pills misoprostol and mifepristone during an interview on July 7.\n\nVance replied:\n\nOn the question of the abortion pill, what so many of us have said is that: Look, the Supreme Court made a decision that the American people should have access to that medication. Donald Trump has supported that opinion. I support that opinion. I think it’s important to say that we actually have to have an important conversation in this country about what our abortion policy should be.\n\nWelker later asked Vance about mifepristone, one of the two abortion pills. Here’s the exchange:\n\nWelker: But just to be clear: You support mifepristone being accessible?\n\nVance: Yes, Kristen, I do.\n\n4. The Pro-Abortion Vote In Ohio Altered Vance’s Outlook\n\nAn election result about a year after Vance won his race for the U.S. Senate affected Vance’s approach to abortion.\n\nOhio was considered a pro-life state after the U.S. Supreme Court overturned Roe v. Wade in June 2022, triggering a six-week abortion ban the state had enacted into law in April 2019.\n\nBut in November 2023, voters in Ohio by 57% to 43% approved an amendment to the state constitution, making abortion a right.\n\nIn the aftermath, Vance called the Ohio vote “a gut punch,” and said pro-lifers need to understand why so many people don’t want to ban abortion even if most don’t like abortion.\n\n“Having an unplanned pregnancy is scary. Best case, you’re looking at social scorn and thousands of dollars of unexpected medical bills. We need people to see us as the pro-life party, not just the anti-abortion party,” Vance wrote on social media.\n\nChanging people’s minds, he wrote on Twitter, will require “sustained, years-long efforts to show the heart of the pro-life movement.”\n\nHe said pro-lifers need to become more politically savvy and accept compromises.\n\n“I am as pro-life as anyone, and I want to save as many babies as possible. This is not about moral legitimacy but political reality,” Vance said.\n\nHe ended on a pro-life note.\n\n“There is something sociopathic about a political movement that tells young women (and men) that it is liberating to murder their own children,” Vance said. “So let’s keep fighting for our country’s children, and let’s find a way to win.”","summary":"news","url":"https://www.ncregister.com/news/mcdonald-jd-vance-four-things","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/20250123180148_100079f1335326444190a3a961ebbbaa673e8858ddd44ebb847b761b8df826cf.jpg","video":null,"publish_date":"2025-01-24 00:55:25","author":"Matthew McDonald","authors":["Matthew McDonald"],"language":"en","source_country":"US","sentiment":0.367},{"id":283285236,"title":"Trump can't 'rewrite Constitution' when it comes to immigration enforcement, attorney generals say","text":"Illinois Attorney General Kwame Raoul and 10 other attorneys general pushed back Thursday on a memo from the Department of Justice calling for the investigation of state and local officials who “threaten to impede” enforcement of the Trump administration’s immigration initiatives.\n\nIn a memo first obtained by The Associated Press, acting Deputy Attorney General Emil Bove directed federal prosecutors to investigate any state or local officials who stand in the way of enforcement of immigration laws under President Donald Trump’s administration. \n\n“While the federal government may use its own resources for federal immigration enforcement, the court ruled in Printz v. United States that the federal government cannot ‘impress into its service — and at no cost to itself — the police officers of the 50 States,’” the attorneys general said in a statement Thursday. “This balance of power between the federal government and state governments is a touchstone of our American system of federalism.”\n\nBove, appointed by Trump, also instructed the Justice Department’s civil division to help identify state and local laws and policies that “threaten to impede” the Trump administration’s immigration initiatives and potentially challenge them in court.\n\nProsecutors shall “take all steps necessary to protect the public and secure the American border by removing illegal aliens from the country and prosecuting illegal aliens for crimes” committed in U.S. jurisdiction, the memo said. It directs prosecutors to investigate for potential criminal charges cases in which state and local officials obstruct or impede federal functions.\n\n“Federal law prohibits state and local actors from resisting, obstructing and otherwise failing to comply with lawful immigration-related commands and requests,” the memo said. “The U.S. Attorney’s Offices and litigating components of the Department of Justice shall investigate incidents involving any such misconduct for potential prosecution.”\n\nHowever, Raoul and other attorneys general — from California, New York, Colorado, Connecticut, Hawaii, Illinois, Maryland, Massachusetts, New Mexico and Vermont — argued that Trump could not “unilaterally re-write the Constitution.”\n\n“The president has made troubling threats to weaponize the U.S. Department of Justice’s prosecutorial authority and resources to attack public servants acting in compliance with their state laws, interfering with their ability to build trust with the communities they serve and protect,” they said. \n\nThe memo “is legally baseless and harmful to our communities,” the American Civil Liberties Union wrote in a memo and public letter to Acting Attorney General James McHenry released Thursday.\n\n“The Constitution and our laws are clear: The federal government cannot bully state officials into carrying out deportations, nor can they punish them for declining,” said Deirdre Schifeling, ACLU chief political and advocacy officer. “State and local governments cannot be compelled to carry out the Trump administration’s political agenda of sowing fear and division in our communities.”\n\nThe attorneys general called Bove’s memo “empty words on paper,” but they would not hesitate to to respond if the orders became “illegal actions.” \n\n“As state attorneys general, we have a responsibility to enforce state laws, and we will continue to investigate and prosecute crimes, regardless of immigration status. We will not be distracted by the president’s mass deportation agenda.”","url":"https://chicago.suntimes.com/news/2025/01/23/kwame-raoul-trump-administration-immigration-law-enforcement","image":"https://cst.brightspotcdn.com/dims4/default/e08bb5f/2147483647/strip/true/crop/2050x1170+67+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F01%2F01%2Fb1267f56bd515423e619b0b6e2ff%2Fscree","video":null,"publish_date":"2025-01-24 00:54:39","author":"Cindy Hernandez","authors":["Cindy Hernandez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.254},{"id":283285082,"title":"Trump pardons DC officers convicted in death, cover up","text":"By Gabe Cohen, CNN\n\n(CNN) — President Donald Trump has issued a “full and unconditional pardon” to Washington, DC, police lieutenant Andrew Zabavsky and officer Terence Sutton for their roles in the death of 20-year-old Karon Hylton-Brown, a case that drew protests on the heels of the murder of George Floyd.\n\nProsecutors argued that in October 2020, Sutton and Zabavsky of the Metropolitan Police Department spotted Hylton-Brown driving a moped helmetless and pursued him at “unreasonable speeds” until he was eventually struck and killed by an uninvolved motorist.\n\nAs Hylton-Brown lay dying in the street, the officers covered up the incident, according to investigators, turning off their body cameras, tampering with the scene and misleading their commanding officers about the nature of the incident.\n\nDefense lawyers have disputed details about the encounter and argued that the court threw out key evidence that gave the officers reasonable suspicion that Hylton-Brown was going to commit a crime. Kellen Dwyer, an attorney for Sutton, told CNN they expected to overturn the conviction on appeal.\n\nSutton was found guilty of second-degree murder, conspiracy to obstruct, and obstruction of justice and sentenced to 66 months in prison. The same jury found Zabavsky guilty of conspiracy to obstruct and obstruction of justice and he faced 48 months behind bars.\n\nThe DC Police Union had sought a pardon from the Trump White House for the two officers, who had been out on bail pending appeal of their case, and lawyers for the officers had been actively pursuing clemency from the administration, as well.\n\nZabavsky’s attorney, Christopher Zampogna, thanked Trump following the pardon, saying, “We’re very grateful to [President Trump] for doing it.” Zampogna said he and his client are working out the final details with the Department of Justice.\n\nSutton, for his part, told CNN that he was “just overwhelmed” and expressed his thanks to the president. “I want to go back to the police department and finish my career,” he added, admitting that he “has no clue” if it will be possible.\n\nDwyer added in a statement, “We are thrilled that President Trump ended this prosecution once and for all.”\n\nTrump had referenced the potential pardons several times in recent days, including Tuesday at an unrelated press event at the White House when he was asked whether his decision to pardon the January 6, 2021, US Capitol rioters sent the message that it’s OK to assault police.\n\nWhile he didn’t specifically reference Sutton or Zabavsky – and Hylton-Brown is a US citizen, police say, and not in the country illegally as the president claims – the comments mirrored prior remarks from Trump about the case. Trump had also posted a link on his Truth Social platform to an op-ed calling for the officers to be pardoned.\n\nHylton-Brown’s death and the subsequent coverup by the officers, which came just months after Floyd’s murder, sparked days of unrest and violent protest in the nation’s capital in October 2020.\n\nHylton-Brown’s mother, Karen Hylton, who was outspoken after her son’s death, told CNN before the pardon announcement that she was shocked and started crying when she learned of the potential pardons.\n\n“Do not pardon these murderers,” Hylton had said, adding that she sent a letter to Trump on Tuesday. “I’m asking him, do not pardon them.”\n\nPolice officials and rank-and-file members of the department have argued that the officers faced excessive charges – noting especially the murder charge against Sutton – in a case where no contact was made between the officers’ vehicle and Hylton-Brown.\n\nBut prosecutors on the case have stood by the charges and convictions.\n\n“Public safety requires public trust,” US Attorney Matthew Graves said in a statement after the officers were sentenced in September. “Crimes like this erode that trust and are a disservice to the community and the thousands of officers who work incredibly hard, within the bounds of the Constitution, to keep us safe.”\n\n“The community and fellow law enforcement officers deserve trusted officers that do not abuse their positions of trust and power or put the public at risk,” FBI Acting Special Agent in Charge David Geist added, saying the sentences “show the weight of the crimes and the significance of the criminal justice system and processes at work.”\n\nCNN’s Alejandra Jaramillo and Donald Judd contributed to this report.\n\nThe-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\n\nAbout The Author","summary":"January 23, 2025","url":"https://www.cbc.bb/news/international-news/trump-pardons-dc-officers-convicted-in-death-cover-up/","image":"https://www.cbc.bb/wp-content/uploads/2025/01/Donald-Trump-United-States-Aaron-Schwartz-Sipa-Bloomberg-Getty-Images-via-CNN-Newsource--scaled.jpg","video":null,"publish_date":"2025-01-24 00:50:16","author":"admin,Gabe Cohen","authors":["admin","Gabe Cohen"],"language":"en","category":"politics","source_country":"bb","sentiment":-0.394},{"id":283284430,"title":"Seth Moulton gets fundraising haul after slamming trans athlete inclusion, prompting second pro-trans rally","text":"Rep. Seth Moulton, D-Mass., seems to have been financially rewarded for taking a stand against transgender athletes in women's sports, but his critics aren't backing down. Moulton raised $547,153 from Election Day in November to the end of 2024, according to The Boston Globe. That figure is 10 times higher than what he raised in the same period in 2022, and 80% of the donations were $100 or less. \"I think most Democrats want to put this issue to bed, so that we don’t keep losing on it,\" Moulton told the outlet. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM The congressman was one of the most vocal Democrats to speak out against transgender inclusion in women's and girls sports after his party's sweeping election loss for the White House, House of Representatives and Senate. Moulton initially made his comments blaming his party's stance on transgender inclusion in a New York Times article Nov. 7, just two days after the election, then repeatedly doubled down on that stance amid backlash from those within his own party. HOW TRANSGENDERISM IN SPORTS SHIFTED THE 2024 ELECTION AND IGNITED A NATIONAL COUNTERCULTURE Moulton's comments prompted a pro-transgender rally outside his office Nov. 17, and now a second rally is planned for outside his office Tuesday, Jan. 28. Salem city Councilman Kyle Davis, who organized the rallies, previously told Fox News Digital there is a sizable Democratic contingent in Massachusetts that plans to primary Moulton in 2026. Even though Moulton has publicly disavowed supporting transgender inclusion in women's and girls sports, he still voted against a bill that would help combat it last week. Moulton joined 206 Democratic representatives who voted against the Protection of Women and Girls in Sports Act Jan. 14. Moulton previously cosponsored the Equality Act and Transgender Bill of Rights, both of which would allow transgender athletes to compete in women's sports. On Tuesday, two Democrats joined the Republican majority in voting in favor of the bill — representatives Henry Cuellar, D-Texas, and Vicente Gonzalez, D-Texas. But Moulton, despite now opposing transgender inclusion, voted against the bill Tuesday, saying he does not want children to be \"subjected to the invasive violations of personal privacy this bill allows.\" CLICK HERE TO GET THE FOX NEWS APP That argument was similar to one many other Democrats, including House Minority Leader Hakeem Jeffries, D-N.Y., and Rep. Alexandria Ocasio-Cortez, D-N.Y., have made, insisting it would empower child predators to give genital examinations to young girls. The bill passed in the House with bipartisan support and is moving to the Senate, and some Democratic voters have chosen to leave the party in response to their representatives' child predator argument. A recent New York Times/Ipsos survey found the vast majority of Americans, including a majority of Democrats, don't think transgender athletes should be permitted to compete in women's sports. Of the 2,128 people polled, 79% said biological males who identify as women should not be allowed to participate in women's sports. Of the 1,025 people who identified as Democrats or leaning Democrat, 67% said transgender athletes should not be allowed to compete with women. Shortly after November's election, a national exit poll conducted by the Concerned Women for America legislative action committee found that 70% of moderate voters saw the issue of \"Donald Trump’s opposition to transgender boys and men playing girls' and women’s sports and of transgender boys and men using girls' and women’s bathrooms\" as important to them. And 6% said it was the most important issue of all, while 44% said it was \"very important.\" Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Seth Moulton reportedly saw a fundraising surge after speaking out against transgender inclusion in women&apos;s sports, but he also faced a second protest by his office.","url":"https://www.foxnews.com/sports/seth-moulton-gets-fundraising-haul-after-slamming-trans-athlete-inclusion-prompting-second-pro-trans-rally","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/dem-rep-trans-protests.png?ve=1&tl=1","video":null,"publish_date":"2025-01-24 00:46:36","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":-0.113},{"id":283281636,"title":"‘Dutton’s Jew’: Anti-racism seminar at Queensland uni","text":"Sarah Schwartz, executive officer of the pro-Palestinian Jewish Council of Australia, slammed Peter Dutton during a speech at QUT’s National Symposium on Unifying Anti-Racist Research and Action on Wednesday, accusing the opposition leader of hiding behind the Jewish community to promote a right-wing agenda.\n\n“For Dutton and his ilk, us Jews are the perfect avatars for peddling racism, Islamophobia [and] anti-immigrant sentiment,” Ms Schwartz told the audience.\n\n“I present you with Dutton’s Jew. Dutton’s Jew has really helpfully provided a human shield for him to talk about some of his favourite topics — hating on migrants by arguing that Palestinian refugees are a threat to Jews, just generally hating on Muslims, protecting everyday Aussies from left-wing anti-war protesters, and of course bolstering support for Israel as it commits a genocide. His party no longer needs to defend the right to be bigots because Dutton’s Jew can do this for him.”\n\nAnti-CCP activist Drew Pavlou posted images and footage from the panel on X, calling it “an absolute farce”.\n\n“This is legitimately insane,” he wrote.\n\nHe shared a slide from another speaker showing a collage of images of pro-Israel right-wing political figures including Mr Dutton, One Nation leader Pauline Hanson, US President Donald Trump, billionaire Elon Musk and Dutch politician Geert Wilders.\n\n“They are now complaining that Elon Musk and Trump are too friendly with the Jews,” Mr Pavlou said.\n\n“I like how this is indistinguishable from a Nick Fuentes groyper conference — complaining that right wing politicians are all controlled by ‘ZOG’. Seriously if you didn’t know that it was a leftie ‘anti-racism’ conference you could be forgiven for thinking Nick Fuentes made this slide.”\n\nIn a statement, Ms Schwartz said the clip from the “comedy debate” had been taken out of context and that she was pillorying “Peter Dutton’s racist, ignorant and monolithic conception of Jewish people”.\n\n“In my presentation, I referred to Dutton’s racist conception of Jewish people as ‘Dutton’s Jew’ — Dutton’s racist conception of Jews, not actual Jewish people,” she said.\n\n“Against this conception, I spoke about how Jewish people are diverse and about how the Jewish community is not a monolith. Only opportunists could wilfully misrepresent my point, which is that Peter Dutton is exploiting the rise in anti-Semitism for political gain.”\n\nMs Schwartz said Mr Dutton “has a long history of racism, including against the African community, against First Nations peoples — including walking out of Parliament’s formal apology to the Stolen Generations — and against immigrants and refugees”. \n\n“Now, for political gain, he is claiming to be an anti-racism warrior in support of the Jewish community,” she said.\n\n“To that end, he has falsely painted all Jews as having particular attitudes and characteristics. Dutton and the LNP vilify any Jew who does not fit into their racist mould, as evidenced by their disgraceful and disrespectful treatment of a Jewish colleague and myself during a Parliamentary inquiry into anti-Semitism last year.”\n\nShe continued, “Dutton’s reduction of the Jewish community into a single stereotype, and silencing Jews who don’t fit that typology, only serves to make Jews less safe. This is particularly grotesque amidst a very real rise in antisemitism.”\n\nMs Schwartz accused “far-right social media accounts” of sharing the slide from her speech “without any of the context”.\n\n“These groups promote dangerous disinformation, which no one should take at face value,” she said. “My speech was part of a comedy event making fun of racists. If we didn’t laugh we’d cry.”\n\nThe Executive Council of Australian Jewry (ECAJ) slammed the QUT event.\n\n“The image is clearly intended to stigmatise as evil and racist any Jewish person who might support the Coalition,” ECAJ president Daniel Aghion KC told news.com.au in a statement.\n\n“It is ironic that such an obvious and disgraceful racist trope has been used at an event that billed itself as an anti-racism symposium.”\n\nMr Aghion said QUT’s leadership “have much to answer for”.\n\n“We warned QUT in advance that this symposium was likely to be abused to promote a hateful and extremist agenda that would include anti-Semitic discourse,” he said.\n\n“We also put them on notice that such behaviour would give further impetus to the spate of violent anti-Semitic incidents that have recently shocked and disgusted our country. QUT leaders responded with a combination of astonishing ignorance, reckless indifference to consequence, and the usual vacuous platitudes about freedom of expression.”\n\nThe EJAC has referred the incident to the Parliamentary Joint Committee on Human Rights, which is conducting an inquiry into anti-Semitism at Australian universities. \n\n“We expect the inquiry to require those responsible at QUT for allowing the event to proceed, to attend before the committee and account for their actions,” Mr Aghion said.\n\n“A steady drip feed of events like these are slowly turning swathes of our universities into propaganda factories instead of places of learning. Freedom of expression does not permit freedom to hate others. That is a simple and basic proposition which the QUT leadership has failed to grasp. People will be forgiven for wondering how much intellectual depth and maturity they can expect from future QUT graduates and how much a QUT degree will be worth.”\n\nThe right-leaning Australian Jewish Association (AJA) branded it a “revolting anti-Semitic display”.\n\n“The Albanese government has refused the pleas from the Jewish community to hold an independent judicial inquiry into antisemitism on university campuses,” AJA wrote on X. “It is clear that the universities cannot govern themselves … Anthony Albanese, enough with the talking. Start doing something.”\n\nQUT has been contacted for comment.\n\nJillian Segal, Australia’s special envoy to combat anti-Semitism, told a Senate inquiry last year there was “systemic anti-Semitism” which was “embedded” on university campuses and that there was a “degree of self-denial” as to how bad the situation was.\n\n“Cultural change is therefore incredibly important, and needed,” she said.\n\n“It is a special form of racism, it is different. A generalised approach doesn’t work. You need to have a focused approach to anti-Semitism.”\n\nJewish students and staff at Australian universities have alleged months of harassment and abuse from pro-Palestine campus protesters in the wake of the October 7, 2023 attacks.\n\nPalestinian terror group Hamas, which runs Gaza, killed at least 1200 people in the attacks, inflicting the worst loss of Jewish life since the Holocaust. The ensuing Israeli assault on Gaza killed at least 47,000 people.\n\nIn October, Attorney-General Mark Dreyfus announced the surge in anti-Semitism at universities would be the subject of an inquiry and report from the Parliamentary Joint Committee on Human Rights, after a recommendation by the earlier Senate inquiry which received hundreds of submissions from Jewish students and staff.\n\nLiberal Senator and shadow Education Minister Sarah Henderson said the move was “shockingly inadequate”, and the opposition wanted to see a Commission of Inquiry with Royal Commission-like powers as recommended by Ms Segal.\n\nThe committee has been asked report to parliament by March 31, 2025.","summary":"A Queensland university has been blasted for a “revolting” presentation at an “anti-racism symposium” on Wednesday.","url":"https://www.news.com.au/finance/work/leaders/duttons-jew-antiracism-seminar-at-queensland-uni/news-story/47f99c7a607c60126521efbd6d7ed666?from=rss-basic","image":"https://content.api.news/v3/images/bin/f579f536210c063df37a127f4f7b2bb9","video":null,"publish_date":"2025-01-24 00:46:21","author":"Frank Chung","authors":["Frank Chung"],"language":"en","category":"politics","source_country":"au","sentiment":-0.394},{"id":283282466,"title":"Trump says he wants to meet with Putin immediately","text":"WASHINGTON, January 24. /TASS/. US President Donald Trump said he wants to meet with Russian leader Vladimir Putin immediately.\n\nAccording to the American leader, Russia \"should want to make a deal\" to resolve the Ukrainian crisis. \"Maybe they want to make a deal. I think, from what I hear, Putin would like to see me and we’ll meet as soon as we can. I’d meet him immediately,\" Trump said during a conversation with journalists at the White House on Thursday.\n\nThe American leader was also asked whether he thinks sanctions against Russia will push the country's leadership to negotiate. \"I don't know, but I think he [the Russian president] should make a deal,\" Trump said.\n\nOn January 21, Trump did not rule out the possibility of a complete halt to the supply of American weapons to Kiev, and also stated his readiness to meet with the Russian president \"at any time\" when it is convenient for him. However, the new US leader allowed for the tightening of sanctions against Russia if it does not agree to a deal on Ukraine. As Putin noted earlier, Moscow is open to dialogue with the new US administration on the Ukrainian conflict, the most important thing is to eliminate the root causes of the crisis. He confirmed that Russia takes into account the statements of Trump and his team about the desire to restore contacts, as well as the need to do everything to prevent a third world war.","summary":"According to the American leader, Russia \"should want to make a deal\" to resolve the Ukrainian crisis","url":"https://tass.com/world/1903481","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-24 00:45:45","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.293},{"id":283284814,"title":"Trump pardons anti-abortion activists who blockaded clinics","text":"President Donald Trump announced on Thursday that he would pardon anti-abortion activists convicted of blockading abortion clinic entrances.\n\nTrump called it \"a great honour to sign this\".\n\n\"They should not have been prosecuted,\" he said as he signed pardons for \"peaceful pro-life protesters\".\n\nThe people pardoned were involved in the October 2020 invasion and blockade of a Washington clinic.\n\nREAD MORE: Trump's blunt message for billionaire elite\n\nLauren Handy was sentenced to nearly five years in prison for leading the blockade by directing blockaders to link themselves together with locks and chains to block the clinic's doors.\n\nA nurse sprained her ankle when one person pushed her while entering the clinic, and a woman was accosted by another blockader while having labor pains, prosecutors said.\n\nPolice found five fetuses in Handy's home after she was indicted.\n\nTrump pardoned Handy and her nine co-defendants: Jonathan Darnel of Virginia; Jay Smith, John Hinshaw and William Goodman, all of New York; Joan Bell of New Jersey; Paulette Harlow and Jean Marshall, both of Massachusetts; Heather Idoni of Michigan; and Herb Geraghty of Pennsylvania.\n\nREAD MORE: US judge blocks major Trump order\n\nIn the first week of Trump's presidency, anti-abortion advocates have ramped up calls for Trump to pardon protesters charged with violating the Freedom of Access to Clinic Entrances Act, which is designed to protect abortion clinics from obstruction and threats.\n\nThe 1994 law was passed during a time where clinic protests and blockades were on the rise, as was violence against abortion providers, such as the murder of Dr. David Gunn in 1993.\n\nTrump specifically mentioned Harlow in a June speech criticizing former President Joe Biden's Department of Justice for pursuing charges against protesters involved in blockades.\n\nREAD MORE: Taylor Swift-themed dance class murderer jailed for 50 years\n\nIn Pictures: Everything Trump did on his first full day in the White HouseView Gallery\n\n\"Many people are in jail over this,\" he said in June, adding, \"We're going to get that taken care of immediately.\"\n\nAbortion rights advocates slammed Trump's pardons as evidence of his opposition to abortion access, despite his vague, contradictory statements on the issue as he attempted to find a middle ground on the campaign trail between anti-abortion allies and the majority of Americans who support abortion rights.\n\n\"Donald Trump on the campaign trail tried to have it both ways — bragging about his role in overturning Roe v. Wade while saying he wasn't going to take action on abortion,\" said Ryan Stitzlein, vice president of political and government relations for the national abortion rights organization Reproductive Freedom for All.\n\n\"We never believed that that was true, and this shows us that we were right,\" he said.\n\nSBA Pro-Life America President Marjorie Dannenfelser thanked Trump for \"immediately delivering on his promise\" to pardon the protesters, arguing their prosecutions were political.\n\nThe legal group Thomas More Society argued the FACE Act defendants they represent had been \"unjustly imprisoned\" in a January letter to Trump.\n\nThe group had assured the defendants that Trump would review their cases and pardon them when he took office, according to the letter.\n\nREAD MORE: Travellers warned of airport disruptions as ground workers strike\n\n\"Today, freedom rings in our great nation,\" Steve Crampton, senior counsel for the Thomas More Society, said on Thursday.\n\n\"What happened to them can never be erased, but today's pardons are a huge step towards restoring justice,\" he added.\n\nRepublican Senator Josh Hawley, among Trump's most loyal supporters, called the prosecution of anti-abortion protesters \"a grotesque assault on the principles of this country\" and urged Trump to pardon them while reading the stories of such anti-abortion protesters on the Senate floor Thursday.\n\nREAD MORE: Statues of ex-PMs decapitated in vandalism attack﻿\n\nHe highlighted Eva Edl, who was involved in a 2021 Tennessee clinic blockade and whose story has garnered attention from the largest national anti-abortion groups.\n\nHawley said he \"had a great conversation\" on Thursday morning with Trump about the protesters.\n\nThe news of the pardons comes ahead of Friday's annual anti-abortion protest March for Life in Washington, where the president is expected to address the crowd in a video.","summary":"The people pardoned were involved in the October 2020 invasion and blockade of a Washington clinic.","url":"https://www.9news.com.au/world/trump-pardons-antiabortion-activists-who-blockaded-clinic-entrances/33b3369d-4c15-4e5a-b6e0-0535bca9ac04","image":"https://imageresizer.static9.net.au/w0lutvf3DC-MWSlH5VpOIhbFk_s=/0x71:1024x647/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fbf855ff8-00ee-414f-95c9-de2e7996368a","video":null,"publish_date":"2025-01-24 00:42:23","author":"9News,Associated Press","authors":["9News","Associated Press"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.116},{"id":283283274,"title":"Did Donald Trump Cancel Black History Month? Fact-Checking Claim","text":"Amid a host of executive orders signed by President Donald Trump over the first four days in office, claims that he has canceled Black History Month started doing rounds on social media. Several posts were made, including some websites publishing the claim in the garb of news. With the month-long observance of Black History Month in the US starting in February, the claim gained further traction. However, Times Now Digital can confirm that President Trump has issued no orders directing that the observance of Black History Month be canceled. Here is a post with the false claim: Black History Month is an annual observance in February in the United States and Canada (and in October in the UK) dedicated to celebrating the achievements, history, and contributions of African Americans and the broader African diaspora. In his first term, Trump celebrated Black History Month each year in February with the issue of proclamations. For instance, in 2018, his proclamation spoke about the \"resolve and courage\" of the Black people throughout American history.\" In 2020, he highlighted their \"perseverance and faith in the face of adversity\". Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News, World and around the world.","summary":"Claims that President Trump canceled Black History Month circulated widely on social media. These allegations gained traction as February, the month when Black History Month is observed in US, approached. However, Times Now Digital confirmed that Trump issued no orders canceling the observance of Black History Month.","url":"https://www.timesnownews.com/world/us/us-news/did-donald-trump-cancel-black-history-month-fact-checking-claim-article-117502189","image":"https://static.tnn.in/thumb/msid-117502259,thumbsize-1079969,width-1280,height-720,resizemode-75/117502259.jpg","video":null,"publish_date":"2025-01-24 00:41:08","author":"Shamik Banerjee","authors":["Shamik Banerjee"],"language":"en","category":"politics","source_country":"in","sentiment":-0.058},{"id":283281724,"title":"The inconvenient truth","text":"Perhaps some people pay such little attention to the Opposition United National Congress (UNC) and its leader, Kamla Persad-Bissessar, that they missed her statement last November when Donald Trump won the US presidential election by historic numbers. Mrs Persad-Bissessar said then much the same thing she said this week on the occasion of Mr Trump’s inauguration.\n\nLast November, she said Mr Trump’s victory spoke to “his inspiring resilience and commitment to the American people” and that he won having “survived assassination attempts, political persecution through the weaponisation of the justice and financial systems and years of personal attacks, but he never wavered in his love for the United States of America”. The Opposition Leader further said that what truly stood out about Mr Trump’s win was the coalition of interests that came together, “united by his vision to restore conservative American values and ideals which have been under attack by promoters of extreme far-left ideology”.\n\nHer two statements during his inauguration this week simply added details to her November thoughts, including that the last administration was a disaster for Americans and the world, a critique of the woke agenda and the related matter of an expanded gender continuum and gender reassignment for minors.\n\nWhen democracy becomes inconvenient, it is not a lesser democracy but even more deserving of acknowledgement and affirmation. The inconvenient truth is that on the issues itemised by Mrs Persad-Bissessar, she is on the side of the majority. Mr Trump, for better or for worse, is America’s unambiguous presidential choice with 77,284,118 votes, or 49.8% of votes cast. Those votes in his favour were, instructively, the second highest total in US history. Also instructive is that the person for whom the most votes were cast in the history of US presidential elections is former president Joe Biden in 2020.\n\nTherein lies another inconvenient truth. What did Mr Biden and his administration do in four years to so estrange the American population that a historic mandate for Mr Biden was squandered, paving the way for Mr Trump’s second coming in his third run for the White House? Mrs Persad-Bissessar thinks she has some answers, one of them being that he pursued an extreme left-wing agenda that forced radical changes on a population not ready for them. It is a plausible explanation.\n\nOver the years, this newspaper has stood firm in its support for human rights, the dignity of the vulnerable and the inclusion of all peoples under the sun, even when holding that line was unpopular and drew much criticism. We have only deepened our commitment over time. But we also understand that sustainable change requires the hard work of delicate management and consensus building. It is a view we share with former US president Barack Obama who, on the eve of Mr Trump’s 2016 run for office, compared cultural change to changing the course of an ocean liner. A lot of what governing consists of, he said then, is changing the course of the ship just two degrees, and over time the ship goes in a completely different direction. You cannot make a 50-degree turn or else the ship will tip over, he said presciently.","summary":"Perhaps some people pay such little attention to the Opposition United National Congress (UNC) and its leader, Kamla Persad-Bissessar, that they missed her statement last November when Donald Trump won the US presidential election by historic numbers. Mrs Persad-Bissessar said…","url":"https://trinidadexpress.com/opinion/editorials/the-inconvenient-truth/article_d993c476-d9eb-11ef-85cf-03e1fc1be5e7.html","image":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/4/10/410f1484-2337-11e8-bb31-277e215e09e6/5aa1e025dfd39.image.jpg?crop=730%2C383%2C0%2C88&resize=730%2C383&order=crop%2Cresize","video":null,"publish_date":"2025-01-24 00:40:00","author":null,"language":"en","source_country":"tt","sentiment":-0.114},{"id":283284560,"title":"'Elon hates one of the people in the deal': Donald Trump downplays Musk’s skepticism towards Stargate AI project","text":"President Donald Trump downplayed the public dispute between tech CEOs Elon Musk and Sam Altman over a $500 billion AI project announced by the White House on Tuesday. Musk had expressed doubt about the participating companies' ability to fund the project, but Trump attributed the criticism to personal animosity between Musk and Altman.\"No, he hates one of the people,\" Trump said, referring to Musk's apparent dislike of Altman, without actually naming anyone. \"I've spoken to Elon, but—spoken to all of them, actually. The people in the deal are very, very smart people– but Elon, one of the people in the deal he happens to hate. But I have certain hatreds of people too,\" he added.— AutismCapital (@AutismCapital) Shortly after the announcement of the new AI infrastructure investment involving Altman's OpenAI, Oracle, and Softbank, Musk questioned the financial capacity of the companies on his social media platform X, claiming that SoftBank had \"well under $10B secured.\"When questioned about the reality of Musk's under-funding claims, Trump shrugged them off too saying, \" \"I don't know. They're putting up the money, the government isn't. They're very rich people. I hope they do. Elon doesn't like one of those people.\"— AutismCapital (@AutismCapital) White House press secretary Karoline Leavitt also defended the project, stating that \"the American people should take President Trump and those CEOs' words for it.\"The new company, Stargate, aims to grow artificial intelligence infrastructure in the United States, with an initial investment of $100 billion and plans to invest up to $500 billion in the coming years.Musk and Altman have since engaged in a public feud on X, with Musk sharing Altman's past critical posts about Trump.https://www.youtube.com/watch?v=NqSdh6ADEBE&pp=ygVdVHJ1bXAgc2hydWdzIG9mZiBFbG9uIE11c2vigJlzIGNyaXRpY2lzbSBvZiBBSSBhbm5vdW5jZW1lbnQ6IOKAmEhlIGhhdGVzIG9uZSBvZiB0aGUgcGVvcGxl4oCZThe ongoing lawsuit between Musk and OpenAI, in which Musk claims that ChatGPT has abandoned its nonprofit mission by reserving advanced AI technology for private customers is also said to be a contributing factor towards Musk's skepticism towards the Stargate initiative.Elon Musk has been a prominent presence for the Trump administration. He supported Trump during the elections campaigns by showing up at rallies and also monetary donations. He has also been chosen by Trump to head the new department of government efficiency (DOGE).","summary":"President Trump downplayed the dispute between Elon Musk and Sam Altman over a $500 billion AI project, attributing Musk's criticism to personal animosity. Despite Musk's skepticism about the project's funding, Trump expressed confidence in the involved companies and their financial capacity.","url":"https://timesofindia.indiatimes.com/world/us/elon-hates-one-of-the-people-in-the-deal-donald-trump-downplays-musks-skepticism-towards-ai-project-stargate/articleshow/117502054.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117502315/117502315.jpg","video":null,"publish_date":"2025-01-24 00:38:33","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.19},{"id":283281778,"title":"Trump can’t hurt climate much","text":"“Drill, baby, drill,” exulted the new President of the World (American branch), but he will find that the oil and gas industry isn’t listening. As Darren Woods, CEO of ExxonMobil, tactfully put it in November: “I’m not sure how ‘drill, baby, drill’ translates into policy.”\n\nFor those who prefer plainer speaking, here’s Peter McNally, analyst at oil industry research firm Third Bridge, on the same topic. “Nobody’s got crazy plans to be drilling at accelerated rates. The futures curve doesn’t actually inspire your typical oil producer in west Texas or Oklahoma to do it.”\n\nIt’s been all Trump all the time for more than a week already, as the great showman hijacks the world’s media with the shocking news that he’s still going to do exactly what he has been saying he will do as soon as he is inaugurated for months or, in many cases, years. Much ado about almost nothing new, but the media are lazy, it’s cheap and easy, why not?\n\nWe could spend the next few hundred words going through how many of the things Trump explicitly or implicitly promises will not actually come true, because a) the United States is a federal country where the states control many matters, and b) the constitution also limits his power over the Congress and the courts, and c) he is easily distracted.\n\nHowever, most of his actions will directly affect only Americans. Let’s focus instead on the Trump policy that is most likely to hurt the interests of the rest of the human race: climate change.\n\nHe is pathologically hostile to any attempt to stop or slow global warming, regarding it as a scam and a “Chinese plot”’. He particularly hates “windmills” (the aesthete in him feels that they spoil the view). He is pulling the United States out of the Paris climate treaty (again), and ending federal government subsidies for electric vehicle sales.\n\nAbove all, he has declared a “national energy emergency”. Exactly what that means is unclear, but the remedy will theoretically involve a lot more drilling for oil and gas in the United States and growth rather than decline in its use of fossil fuels. This causes alarm elsewhere, because the United States still accounts for 27% of the global economy.\n\nMost people in other countries (and a clear majority of Americans) see the effort to contain global warming as a high priority requiring a concerted international response, and a second US defection from the task feels like a betrayal. But while it is certainly regrettable, it is not all that big a deal in practice.\n\nThe US government does not decide which kinds of energy to develop (fossil or non-fossil) and how much to deploy. Government subsidies often play a role in these choices, but the final decisions are usually based on financial considerations—and they do not favour fossil fuels.\n\nFor almost any purpose except transportation, non-fossil energy (solar, wind, geothermal, hydro, nuclear) is cheaper than oil or gas. Almost two-thirds of all oil goes into vehicles of various sorts (mostly cars and trucks, but also aircraft and ships)—but that is a sector where overall demand for oil is not growing.\n\nIt’s still huge in the United States, where fewer than one-tenth of new cars are electric, but in China, now a bigger market in terms of sales, ownership and production, market share for electric vehicles is already half and rising fast. Unsurprisingly, Chinese demand for oil suddenly stalled last year. Most of the rest of Asia will follow, as will Europe.\n\nSo regardless of Trump’s rhetoric, US oil companies have no motivation to drill for more oil. On the contrary, they are restricting production and shutting down higher-cost wells in order to keep oil prices and their own profits up. “Excess capacity” is just a kinder way of saying “stranded assets”.\n\nIndeed, there’s a good chance that by the end of Donald Trump’s second term in 2029 the United States will be the only major producer still making millions of fossil-fuel cars, and Americans the only people buying them in the millions. The only threat here is commercial suicide for the US car industry, not the sabotage of the global trend away from fossil fuels.\n\nMost of the damage Trump does will be domestic, but he may trigger trade wars with China, Mexico and Canada. He might even invade Greenland, which would probably wreck both NATO and the United Nations.\n\nHowever, he didn’t manage to sabotage the global response to climate change (feeble though it was) in his first term, and he won’t do it this time either. He simply doesn’t have the leverage.\n\nOf course, the rest of the world could still screw up on the climate front even without his help.\n\n—Author Gwynne Dyer is an international journalist based in London.","summary":"“Drill, baby, drill,” exulted the new President of the World (American branch), but he will find that the oil and gas industry isn’t listening. As Darren Woods, CEO of ExxonMobil, tactfully put it in November: “I’m not sure how ‘drill,…","url":"https://trinidadexpress.com/opinion/columnists/trump-can-t-hurt-climate-much/article_8d3a09b4-d9eb-11ef-a765-fb797c5dd606.html","image":"https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/8/75/875eba2e-2653-11e8-bfd3-6732d476ec07/5aa718029bace.image.jpg?crop=768%2C403%2C0%2C54&resize=768%2C403&order=crop%2Cresize","video":null,"publish_date":"2025-01-24 00:38:00","author":"Gwynne Dyer","authors":["Gwynne Dyer"],"language":"en","category":"politics","source_country":"tt","sentiment":-0.199},{"id":283283194,"title":"When Will TikTok Be Available In App Stores Again?","text":"TikTok in the U.S. has faced a turbulent period due to a law requiring its separation from its Chinese owner, ByteDance. The app was temporarily shut down, but the services were later restored. However, the app remains unavailable on app stores, preventing downloads and updates. Service Restoration and Ongoing Issues TikTok was temporarily suspended on January 19 after the U.S. Supreme Court upheld the law. The app was restored after President Donald Trump offered assurances to service providers, pledging to suspend the ban. Trump signed an executive order on January 20, delaying enforcement of the law by 75 days. Despite this, U.S. app stores still block TikTok. This prevents users from downloading the app or receiving updates. App Store Block and Legal Concerns Apple and Google's app stores have not reinstated TikTok or other ByteDance apps, such as CapCut and Lemon8. This is due to concerns about potential legal liability. The law stipulates fines of $5,000 per user for providing access to the app. These fines could reach $850 billion given TikTok’s 170 million U.S. users. University of Minnesota law professor Alan Rozenshtein stated that Trump’s assurances offer minimal security. Apple has recently published a webpage that it is obligated to follow the laws in the jurisdictions where it operates. Apps like TikTok, CapCut, and Lemon8 are no longer available for download or updates. Senator Tom Cotton tweeted that companies that facilitate access to TikTok could face substantial liability. Apple and Google have not commented on plans to restore access to TikTok. App's Future and User Impact The future availability of TikTok on U.S. app stores is uncertain. Users may need to wait until the tech giants receive legal protections, or until ByteDance sells its U.S. assets. This process could occur before April 5, 2025. Existing users can currently use the app, but without updates, the app will eventually \"degrade\". Users will not receive new features, bug fixes, or performance improvements. Some users have reported that their TikTok algorithms have been negatively affected by the ban. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News, World and around the world.","summary":"TikTok was temporarily shut down in the US, but the services were later restored. However, Apple and Google's app stores have not reinstated TikTok or other ByteDance apps, such as CapCut and Lemon8. This is due to concerns about potential legal liability.","url":"https://www.timesnownews.com/world/us/us-news/when-can-tiktok-be-downloaded-from-app-stores-again-article-117471700","image":"https://static.tnn.in/thumb/msid-117502277,thumbsize-1412597,width-1280,height-720,resizemode-75/117502277.jpg","video":null,"publish_date":"2025-01-24 00:35:13","author":"Suhani Khanna","authors":["Suhani Khanna"],"language":"en","source_country":"in","sentiment":-0.654},{"id":283282726,"title":"Local meteorologist fired after criticizing Elon Musk's salute on social media","text":"A news station in Milwaukee, Wisconsin, is facing some online backlash for firing a meteorologist who criticized Elon Musk's salute on social media. \n\nOn Monday, Musk made a gesture saluting supporters of President Donald Trump that many compared to a Nazi salute, though the Anti-Defamation League has defended him and asked people to give each other the benefit of the doubt. \n\n'NEVER again is this household watching your station unless you apologize.' \n\nOn Tuesday, WDJT-TV meteorologist Sam Kuffel posted on Instagram her anger over the salute. \n\n“Dude Nazi saluted twice. Twice. During the inauguration,” Kuffel wrote. \"You f*** with this and this man, I don't f*** with you. Full stop.\"\n\nShe added a meme with the caption, “Screw that old b****. He’s a Nazi.”\n\nScreenshots of the story were posted to social media, where she and the station were heavily criticized. On Wednesday, the station said in an email that Kuffel was no longer employed at the station. The email did not say the Instagram posts were the cause of her termination. \n\nSome on social media condemned the station and accused it of bowing to fascism. \n\nF*** you, @CBS58. F***ing nazis should be called f***ing nazis, and anyone who doesn't call them that is complicit. NEVER again is this household watching your station unless you apologize and reinstate Sam Kuffel,\" read one popular post. \n\n\"You've lost a household of viewers, @CBS58 & I hope your other employees leave of their own accord- THIS IS F***ING STATE MEDIA BULLS***. Bending the channel's knee to goddamn ACTUAL NAZI PROPAGANDA is beyond the pale. Get so f***ed,\" read another popular response. \n\n\"Calling out objective reality gets you fired now. Dark times we’re in right now,\" said another critic. \n\nMusk has mocked the accusation against him. \n\nKuffel is 31 years old and had worked at WDJT for five years. \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","summary":"A news station in Milwaukee, Wisconsin, is facing some online backlash for firing a meteorologist who criticized Elon Musk's salute on social media. \n\nOn Monday, Musk made a gesture saluting supporters of President Donald Trump that many compared to a Nazi salute, though the Anti-Defamation League has defended him and asked people to give each other the benefit of the doubt. \n\n'NEVER again is this household watching your station unless you apologize.' \n\nOn Tuesday, WDJT-TV meteorologist Sam Kuffel posted on Instagram her anger over the salute. \n\n“Dude Nazi saluted twice. Twice. During the inauguration,” Kuffel wrote. \"You f*** with this and this man, I don't f*** with you. Full stop.\"\n\nShe added a meme with the caption, “Screw that old b****. He’s a Nazi.”\n\nScreenshots of the story were posted to social media, where she and the station were heavily criticized. On Wednesday, the station said in an email that Kuffel was no longer employed at the station. The email did not say the Instagram posts were the cause ","url":"https://www.theblaze.com/news/meteorologist-fired-elon-musk-salute","image":"https://www.theblaze.com/media-library/image.jpg?id=55832641&width=1200&height=600&coordinates=0%2C167%2C0%2C167","video":null,"publish_date":"2025-01-24 00:33:25","author":"Blaze News","authors":["Blaze News"],"language":"en","category":"politics","source_country":"US","sentiment":-0.345},{"id":283279076,"title":"Letters: Donald Trump’s new agenda is just what the nation ordered","text":"Trump’s new agenda\njust what nation ordered\n\nRe: “Short memories have our nation in peril” (Page A6, Jan. 22).\n\nIn James Miller’s letter, his closing statement was, “I pray you can stomach the meal you are about to be served.”\n\nI am so looking forward to the new menu. The corruption of the last four years has caused unceasing indigestion, so deleterious that pardons were required not just for his son, but for his entire family, as well as another disgraceful first — needing to pardon an entire congressional committee. That menu made us look like a banana republic. His policies resulted in the highest inflation our country has experienced in over 40 years. And while the rate of inflation has declined, the resultant prices have not, making it difficult for American families to make ends meet.\n\nIndeed, most Americans believed our country was on the wrong track. The new guy’s menu is exactly what he said it would be. Enjoy it.\n\nJohn Griggs\n\nLee’s age alone makes\nher bad pick for mayor\n\nRe: “Lee jumps into Oakland mayoral race” (Page A1, Jan. 9).\n\nNews that the elderly Barbara Lee is running for mayor is depressing.\n\nShe has absolutely no experience in running an organization of even 50 individuals, much less the 50-plus organizations and departments and thousands of people in Oakland government.\n\nI would have hoped the Democrats learned from Joe Biden that even if a person did have the necessary qualifications, advanced age alone is a disqualifier.\n\nMichael Thaler\n\nOil companies should\npay for disastrous fires\n\nRe: “Dems eye $1.5B for L.A.-area fire battle” (Page A1, Jan. 15).\n\nGov. Newsom shouldn’t have to tap into the new climate bond to pay for fighting and recovering from the L.A. fires. Those responsible for the scale and severity — Big Oil companies — should be paying for it, not the very Californians currently suffering in this disaster.\n\nA recent report by the Climate Center found that California’s oil and gas companies have been avoiding paying billions in taxes that could address climate and wildfire mitigation and could have prevented or shortened this disaster. Why are we stuck footing the bill when the companies fueling the fire for decades are getting off scot-free with their record profits?\n\nWe need to pass legislation to hold polluters accountable — a climate superfund bill that makes Big Oil pay to clean up the crises they’ve caused. Gov. Newsom and California legislators, step up and take action to make polluters pay before it’s too late.\n\nIncarcerated firefighters\nrepaying debt to society\n\nThe incarcerated firefighters of the California Department of Correction and Rehabilitation working with Cal Fire are doing a civic duty for the Los Angeles area.\n\nSo many people are speaking on the fact that they are incarcerated, yet many overlook the fact that they are giving back to society by risking their lives. They are willingly accepting their past mistakes while striving to better their lives by helping others.\n\nAll of our first responders deserve our support and respect. Keep up the good work Cal Fire, Los Angeles Fire Department and our CDCR inmate firefighters. You make us proud.\n\nJohn Crosthwaite\n\nDemand state restore\nfunding for libraries\n\nLibraries have been doing more than just lending books. The activities include feeding hungry kids, youth activities and providing seed kits. Mobile and outreach services are provided through the Mobile Library, the Education and Literacy Program, and library services at the local jails.\n\nSB 321 was passed by the state Legislature in 2023 but without accompanying financial support. Funding is badly needed to ensure library card access to school-aged children, and also to restore statewide access to BrainFuse online services. Funding under the California Library Services Act was reduced by 50% in the previous budget cycle. Restoration of Lunch at the Library funding to earlier levels is necessary to provide 300,000-plus free and nutritious summer lunches, accompanied by literacy-enhanced wraparound programming, at hundreds of libraries each year.\n\nWe request state Legislature representatives to stand firmly on this and support the restoration of funding for California’s libraries in the upcoming budget cycle.\n\nGOP watches as Trump\nassaults Constitution\n\nOn the first day of his term, President Trump signed an executive order seeking to end birthright citizenship. The order is cruel, reckless and a blatant violation of the 14th Amendment of the U.S. Constitution, which guarantees that everyone born on American soil is a U.S. citizen.\n\nMany Republican members of Congress are choosing to remain silent on this lawless order, hoping they can avoid being tied to this attack on our Constitution and the endangering of newborn babies by the leader of their party.\n\nLet’s raise the volume on their silence by publicly highlighting their refusal to defend their own constituents and the Constitution they swore an oath to uphold.\n\nSteve Lassoff","summary":"Also: Lee unqualified &#124; Paying for fires &#124; Repaying debt &#124; Restore funding &#124; GOP watches. East Bay Times reader letters to the editor for Jan. 24, 2025.","url":"https://www.mercurynews.com/2025/01/23/letters-trumps-agenda-what-nation-ordered-1977/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/GettyImages-2194393611-2.jpg?w=1024&h=683","video":null,"publish_date":"2025-01-24 00:30:39","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.389},{"id":283279096,"title":"'Political prop': JFK’s grandson decries Trump's assassination doc declassification","text":"Jack Schlossberg, the grandson of John F. Kennedy, went after President Donald Trump’s executive order declassifying files on the 1963 assassination of the former president.\n\n“JFK conspiracy theories,” Schlossberg wrote in a social post to his X account hours after Trump signed the order in the Oval Office Thursday.\n\n“The truth is alot sadder than the myth — a tragedy that didn’t need to happen. Not part of an inevitable grand scheme. Declassification is using JFK as a political prop, when he’s not here to punch back.”\n\nTrump, the subject of two of his own assassination attempts last year, had vowed on the campaign trail to release all documents on the Dallas incident that has long been the subject of fascination – both for historians and conspiracy theorists.\n\nHe told reporters as he signed the order Thursday: \"A lot of people have been waiting for this for years, for decades,” before adding \"Everything will be revealed.\"\n\nTrump’s order also includes declassifying all remaining files related to Robert F. Kennedy, the former president's brother, and Martin Luther King Jr.\n\nSchlossberg, a Democrat, threw his support to President Joe Biden in the 2024 election after criticizing his cousin, Robert F. Kennedy Jr., a well-known conspiracy theorist himself who is now Trump's nomineeto lead the Department of Health and Human Services.","summary":"Jack Schlossberg, the grandson of John F. Kennedy, went after President Donald Trump’s executive order declassifying files on the 1963 assassination of the former president.\n\n“JFK conspiracy theories,” Schlossberg wrote in a social post to his X account hours after Trump signed the order in the Oval Office Thursday.\n\n“The truth is alot sadder than the myth — a tragedy that didn’t need to happen. Not part of an inevitable grand scheme. Declassification is using JFK as a political prop, when he’s not here to punch back.”\n\nTrump, the subject of two of his own assassination attempts last year, had vowed on the campaign trail to release all documents on the Dallas incident that has long been the subject of fascination – both for historians and conspiracy theorists.\n\nHe told reporters as he signed the order Thursday: \"A lot of people have been waiting for this for years, for decades,” before adding \"Everything will be revealed.\"\n\nTrump’s order also includes declassifying all remaining files related to Robert F. Ken","url":"https://www.alternet.org/jfk-assassination-document-declassification/","image":"https://www.alternet.org/media-library/image.jpg?id=55832630&width=1200&height=600&coordinates=0%2C100%2C0%2C101","video":null,"publish_date":"2025-01-24 00:30:02","author":"Erik De La Garza,Raw Story","authors":["Erik De La Garza","Raw Story"],"language":"en","category":"politics","source_country":"us","sentiment":-0.338},{"id":283281572,"title":"China has invested billions in ports around the world. This is why the West is so concerned","text":"On his way to the G20 summit in Rio de Janeiro in November, Chinese President Xi Jinping met with Peruvian President Dina Boluarte to officially open a new US$3.6 billion (A$5.8 billion) deepwater mega-port in Peru called Chancay. \n\nChina’s state-owned Cosco shipping giant had purchased a 60% stake in the port for US$1.6 billion (A$2.6 billion), which gave the company exclusive use of the port for 60 years. \n\nDays later, the first ship departed for Shanghai loaded with blueberries, avocados and minerals.\n\nChancay is part of China’s vision of a 21st century maritime Silk Road that will better connect China’s manufacturing hubs with its trading partners around the world. This has involved a heavy investment in ports in many countries, which has the West concerned about China’s expanding influence over global shipping routes. \n\nNewly re-elected US President Donald Trump made clear these concerns when he claimed China was “operating” the Panama Canal and the US intended to take it back. \n\nChina does not operate the canal, though. Rather, a Hong Kong company operates two ports on either side of it. \n\nA booming port expansion\n\nThe scale and scope of the maritime Silk Road is impressive. China has invested in 129 ports in dozens of countries through its state-owned enterprises, mostly in the Global South. Seventeen of these ports have majority-Chinese ownership. \n\nAccording to one estimate, Chinese companies invested US$11 billion (A$17.7 billion) in overseas port development from 2010–19. More than 27% of global container trade now passes through terminals where leading Chinese firms hold direct stakes. \n\nChina has entered Latin America aggressively, becoming the region’s top trading partner. Its port strategy has clearly signalled a long-term goal to access the exports essential to its food and energy security: soybeans, corn, beef, iron ore, copper and battery-grade lithium.\n\nLast year, for example, Portos do Paraná, the Brazilian state-owned enterprise that acts as the port authority in the state of Paraná, signed a letter of intent with China Merchants Port Holdings to expand Paranaguá Container Terminal, the second-largest terminal in South America. China may invest in even more Brazilian ports, as 22 terminals are scheduled to be auctioned before the end of 2025.\n\nIn Africa, Chinese investment grew from two ports in 2000 to 61 facilities in 30 countries by 2022. \n\nAnd in Europe, Chinese enterprises have complete or majority ownership of two key ports in Belgium and Greece – the so-called “dragon’s head” of the Belt and Road Initiative in Europe.\n\nWhat’s driving this port strategy?\n\nChina’s emergence as a maritime and shipping power is central to Xi’s ambition for global economic dominance. \n\nFor one, China requires stable access to key trading routes to continue meeting the demand for Chinese exports globally, as well as the imports Beijing needs to keep its economy humming. \n\nControlling ports also enables China to create economic zones in other countries that give port owners and operators privileged access to commodities and products. Some fear this could allow China to disrupt supplies of certain goods or even exert influence over other countries’ politics or economies. \n\nAnother key driver of this strategy is the metals and minerals needed to fuel China’s rise as a tech superpower. Beijing has concentrated its port investment in regions where these critical resources are located. \n\nFor example, China is the world’s largest importer of copper ore, mainly from Chile, Peru and Mexico. It is also one of the world’s major lithium carbonate importers.), mainly from Chile and Argentina. And its port deals in Africa give it access to rare earths and other minerals. \n\nIn addition, tapping into Latin America counteracts the trade tensions China has experienced recently with Europe. It also preempts concerns about possible US tariffs imposed on Chinese goods by Trump.\n\nMilitary concerns\n\nThese moves have prompted concern in Washington that China is challenging US influence in its own backyard. \n\nChina maintains that its seaport diplomacy is market oriented. However, it has established one naval base in the strategically located African nation of Djibouti. And it is believed to be building another naval base in Equatorial Guinea. \n\nAccording to a recent report by the Asia Society Policy Institute, strategy analysts believe China is seeking to “weaponise” the Belt and Road Initiative. \n\nOne way it is doing this is by requiring the commercial ports it invests in to be equally capable of acting as naval bases. So far, 14 of the 17 ports in which it has a majority stake have the potential to be used for naval purposes. These ports can then serve a dual function and support the Chinese military’s logistics network and allow Chinese naval vessels to operate further away from home.\n\nUS officials are also concerned China could leverage its influence over private companies to disrupt trade during a time of war. \n\nHow is the West responding?\n\nWhile China’s investments are raising suspicions, the West’s willingness to invest in ports at this scale is limited. The US International Development Finance Corporation, for instance, has a much slower, rigorous process for its investments, which generally leads to fairer outcomes for both investors and host nations. \n\nHowever, some Western companies are acquiring stakes in established and newly built ports in other countries, albeit not to the extent of Chinese enterprises. \n\nThe French shipping and logistics company CMA CGM’s global port development strategy, for example, includes investments in 60 terminals worldwide. In 2024, it acquired control over South America’s largest container terminal in the Port of Santos, Brazil. \n\nTrump has threatened tariffs as one way of countering China’s global sea power. An advisor on his transition team has proposed a 60% tariff on any product transiting through the Chancay port in Peru or any other Chinese-owned or controlled port in South America. \n\nRather than making nations reluctant to sign port deals with Beijing, however, this kind of action just erodes Washington’s regional influence. And China is likely to take retaliatory measures, like banning the export of critical minerals to the US.\n\nHost nations like Peru and Brazil, meanwhile, are using the competition for port investment to their advantage. Attracting interest from both the West and China, they are increasingly asserting their autonomy and adopting a strategy of using ports to “play everywhere” on the global stage.","summary":"Donald Trump claims China ‘operates’ the Panama Canal. This isn’t quite right, but China’s investment in shipping infrastructure globally has made many countries jittery.","url":"https://theconversation.com/china-has-invested-billions-in-ports-around-the-world-this-is-why-the-west-is-so-concerned-244733","image":"https://images.theconversation.com/files/643969/original/file-20250122-15-u14ehn.jpg?ixlib=rb-4.1.0&rect=78%2C1209%2C8688%2C4344&q=45&auto=format&w=1356&h=668&fit=crop","video":null,"publish_date":"2025-01-24 00:26:42","author":"Claudio Bozzi,Deakin University,Lecturer in Law","authors":["Claudio Bozzi","Deakin University","Lecturer in Law"],"language":"en","source_country":"AU","sentiment":-0.018},{"id":283284428,"title":"Florida man arrested after allegedly climbing over wall at Trump's Mar-a-Lago estate","text":"A man has been charged with jumping over a wall at President Donald Trump's Mar-a-Lago estate in Florida this week. Bijan Arceo, 32, was charged with trespassing with the intent to commit an offense. Palm Beach police officers responded to the club just after 6 p.m. Tuesday to assist Secret Service agents who detained someone on the property. ‘PROMPT REMOVAL’: TRUMP DHS EXPANDS EXPEDITED DEPORTATION POWERS AS OPERATIONS RAMP UP Police said Arceo got inside the resort from South Ocean Boulevard by the north service gate, Fox 29 reported, citing a police affidavit. Arceo had not entered the sweep area or had been granted permission to enter the protected site, the Secret Service said. Around the property were numerous signs that state \"No Trespassing,\" with tall gates that remain closed when not in use. Fox News Digital reached out to the Palm Beach Police Department and Secret Service. Arceo is being held in the Palm Beach County jail on a $20,000 bond, according to jail records. CLICK HERE TO GET THE FOX NEWS APP In July, Zijie Li was arrested for trespassing at Mar-a-Lago. Li, a California resident, tried to gain access to the club multiple times over several months, authorities said.","summary":"A man allegedly climbed over the wall that surrounds President Donald Trump&apos;s Mar-a-Lago estate in Palm Beach, Florida, according to reports.","url":"https://www.foxnews.com/us/florida-man-arrested-allegedly-climbing-wall-trumps-mar-a-lago-estate","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/bijan.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-24 00:25:24","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","category":"politics","source_country":"us","sentiment":-0.46},{"id":283278750,"title":"ADL Rebukes Elon Musk for Nazi Jokes Just Days After Downplaying His Nazi Salute Controversy","text":"Just two days after it defended Elon Musk by downplaying a gesture he made that observers said was identical to the Nazi salute, the Anti-Defamation League was put in the awkward position of having to rebuke the billionaire for making jokes about the Holocaust.\n\nIn response to a series of tired puns Musk made referencing infamous Third Reich figures, ADL CEO Jonathan Greenblatt said, “We’ve said it hundreds of times before and we will say it again: the Holocaust was a singularly evil event, and it is inappropriate and offensive to make light of it. Elon Musk, the Holocaust is not a joke.”\n\nMusk shocked many viewers Monday when he capped off a televised speech during Donald Trump’s inaugural event by putting his right hand to his chest, and then forcefully — to the point of grunting with exertion — extended his arm straight out, palm down, fingers straight. He then repeated the gesture, which immediately drew widespread condemnation for its resemblance to the Nazi salute.\n\nWhile Musk subsequently complained that the criticism, which he dismissed as “everyone is Hitler,” is “sooo tired” and “dirty tricks,” he has not as of this writing specifically denied the accusations that the gesture was a Nazi salute. \n\nOthers have taken the liberty of denying this for him however, including the ADL. In a statement issued shortly after the incident, the group decried the influence of social media and insisted Musk “made an awkward gesture in a moment of enthusiasm, not a Nazi salute. “In this moment,” ADL added, “all sides should give one another a bit of grace, perhaps even the benefit of the doubt, and take a breath. This is a new beginning. Let’s hope for healing and work toward unity in the months and years ahead.”\n\nSkip ahead to Thursday, when Musk, referencing the accusations, posted, “Don’t say Hess to Nazi accusations! Some people will Goebbels anything down! Stop Gőring your enemies! His pronouns would’ve been He/Himmler! Bet you did nazi that coming.”\n\nThe late night hosts have had plenty of fodder to work with since the gesture Monday afternoon. On Wednesday night, Seth Meyers not only went after Musk for the questionable gesture but also cracked off a joke at the ADL for initially giving the billionaire the benefit of the doubt.\n\n“It does help answer the question, ‘What do you get for the man who has everything?’ The benefit of the doubt!” Meyers said. “So I’m going to take that advice. I mean, who among us hasn’t sieged when we were trying to zag?”","summary":"On Thursday the tech billionaire made puns referencing infamous Third Reich Figures\n\n\nThe post ADL Rebukes Elon Musk for Nazi Jokes Just Days After Downplaying His Nazi Salute Controversy appeared first on TheWrap.","url":"https://www.thewrap.com/elon-musk-adl-nazi-puns-joke/","image":"https://www.thewrap.com/wp-content/uploads/2025/01/trump-inauguration-elon-musk-nazi-salute.jpg","video":null,"publish_date":"2025-01-24 00:24:39","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","source_country":"US","sentiment":-0.229},{"id":283282130,"title":"Trump Says Will \"Obviously\" Appeal Birthright Citizenship Ruling","text":"US President Donald Trump said Thursday his administration would appeal a federal judge's ruling that temporarily blocks his attempt to restrict birthright citizenship.\"Obviously we will appeal it,\" Trump told reporters in the Oval Office when asked about the ruling by Washington state District Judge John Coughenour, who said the president's order was \"blatantly unconstitutional.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"US President Donald Trump said Thursday his administration would appeal a federal judge's ruling that temporarily blocks his attempt to restrict birthright citizenship.","url":"https://www.ndtv.com/world-news/donald-trump-says-will-obviously-appeal-birthright-citizenship-ruling-7545269","image":"https://c.ndtvimg.com/2024-11/oenjoo3_donald-trump-afp-_625x300_06_November_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-01-24 00:21:49","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.777},{"id":283278676,"title":"Jim Ferguson praises Trump speech at World Economic Forum: ‘He is putting America first’","text":"to top close Video This video is playing in picture-in-picture.\n\nOn Air January 23, 2025 04:43 \n\n Jim Ferguson praises Trump speech at World Economic Forum: ‘He is putting America first’ \n Former British Parliament candidate Jim Ferguson dissects what President Donald Trump’s speech at the World Economic Forum means for global politics on ‘The Bottom Line.’\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags WHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODESPOLITICSCLIMATE CHANGE","summary":"Former British Parliament candidate Jim Ferguson dissects what President Donald Trump’s speech at the World Economic Forum means for global politics on ‘The Bottom Line.’","url":"https://www.foxbusiness.com/video/6367592769112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/2610601d-ccf5-4994-8132-15d8f0b0f796/ce88bc4b-ea51-43af-a2fb-3391af89ec6e/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-24 00:20:11","author":null,"language":"en","source_country":"us","sentiment":-0.193},{"id":283282460,"title":"Trump signs executive order on declassifying files on JFK, RFK and King assassinations","text":"President Donald Trump on Thursday ordered the declassification of records related to the assassinations of President John F. Kennedy, former U.S. senator Robert F. Kennedy and civil rights leader Martin Luther King Jr.\n\n“That’s a big one, huh?” he said while signing the order in the Oval Office.","summary":"In the executive order regarding the three assassinations, Trump wrote: “Their families and the American people deserve transparency and truth.”","url":"https://www.washingtonpost.com/politics/2025/01/23/trump-jfk-rfk-mlk-classified-documents-executive-order/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GYNDEMRTUMR5F7Q6FR3ZDALHCM_size-normalized.jpg&w=1440","video":null,"publish_date":"2025-01-24 00:18:24","author":"Praveena Somasundaram","authors":["Praveena Somasundaram"],"language":"en","category":"politics","source_country":"us","sentiment":-0.428},{"id":283277982,"title":"One A$AP Rocky Juror Is 'Very Risky' for Rapper's Case","text":"The jury is set in A$AP Rocky's felony assault case, but lawyers tell Newsweek that one female juror, a firearms instructor, is \"very risky\" in the rapper's alleged shooting case.Newsweek has contacted A$AP Rocky's lawyer, Joe Tacopina, by phone for comment. A$AP Rocky's lawyers expressed concerns about the lack of Black people in the Los Angeles jury pool earlier this week. Details about the races, ethnicities, and genders of the final 12 jurors and four alternates are not available at the time of publication.What is A$AP Rock Charged With?A$AP Rocky, whose real name is Rakim Mayers, has pleaded not guilty to two felony counts of assault with a semiautomatic firearm. The charges stem from a 2021 incident where he allegedly fired shots at his former friend A$AP Relli.A$AP Rocky declined a plea deal Tuesday, including 180 days in jail, a suspended sentence, and probation.What To KnowOne woman a firearms instructor, told the court Thursday that she had a family history of legal experts.Legal affairs journalist Meghann Cuniff reported that the woman said her father was a criminal defense attorney, her uncle was a judge, and four of her cousins are lawyers, including a District Attorney.Another selected female alternate juror is an entertainment lawyer, Cuniff said.Prosecutors excused a woman who would have been an alternate after she said she was a digital creator who creates \"viral moments\" and was \"very much so\" aware of A$AP Rocky's celebrity status.They also dismissed a man who stated his distrust in law enforcement after his father beat his mother during his childhood and police in Nebraska didn't do anything to help.Cuniff also reported that A$AP Rocky's legal team dismissed a man who said his cousin was a Los Angeles Police officer on the witness list, although prosecutors said he won't be called to testify.Michael McAuliffe RespondsAttorney Michael McAuliffe told Newsweek on Thursday that the female juror who is a firearms instructor could have a great impact on the jury.\"The advantage is she can easily understand the information about guns and bullets, but the potential downside is that she'll become in effect an expert witness for the other jurors,\" he said.McAuliffe added that it appears A$AP Rocky's defense team used only seven of 10 peremptory challenges during the final jury selection.\"If that's accurate, it's mystifying why the defense would keep a firearms instructor on the jury given the firearm charges,\" he said. \"The defense must believe something else about the juror outweighs her expertise about firearms. It's a very risky maneuver.\"Neama Rahmani RespondsFormer federal prosecutor Neama Rahmani also called the female firearms instructor \"very risky\" for both the defense and prosecution.The legal analyst told Newsweek on Thursday that a juror with this kind of experience \"can sway the entire jury.\"\"What you want if you're the prosecution — this isn't the strongest case in the world — so maybe prosecutors firmly believe that this person is in their camp and on their side. But if she's not, she can easily hang the panel. She can even result in an acquittal,\" Rahmani said.Who is A$AP Rocky's Lawyer?Joe Tacopina is representing A$AP Rocky in his assault trial. No stranger to high-profile cases, the New York-based attorney has also represented rapper Meek Mill, baseball player Alex Rodriguez, and President Donald Trump.Another famous client, Fox News host Sean Hannity, called Tacopina one of the \"greatest defense attorneys of all time.\"Tacopina and another attorney for A$AP Rocky, Chad Seigel, raised issues with the jury pool this week.Seigel argued that the pool should be stricken because of the 106 potential jurors, only five were Black, hence not representing the 9 percent of Black people who make up Los Angeles' population.Judge Mark Arnold rejected this argument, saying, \"There's no authority that requires any particular percentage of any ethnicity on a jury,\" Cuniff reported.What Happens NextWith the jury set, opening statements in A$AP Rocky's trial begin Friday at 10:30 a.m. local time. The judge has allowed a camera in the courtroom for the trial, so the public will be able to watch.Do you have a story Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com","summary":"Legal experts tell Newsweek about the \"very risky\" impact a female firearms instructor from Los Angeles on the jury in A$AP Rocky's assault trial could have.","url":"https://www.newsweek.com/aap-rocky-gun-charges-criminal-trial-juror-2020039","image":"https://d.newsweek.com/en/full/2571275/ap-rocky-trial-mom.png","video":null,"publish_date":"2025-01-24 00:13:50","author":"Erin Keller","authors":["Erin Keller"],"language":"en","source_country":"us","sentiment":-0.129},{"id":283277820,"title":"Senate votes to advance Pete Hegseth as Trump’s defense secretary despite some Republican opposition – live","text":"A federal judge in Seattle blocked Donald Trump’s executive order curtailing the right to automatic birthright citizenship in the US. US district judge John Coughenour issued a temporary restraining order preventing the administration from enforcing the order, calling it “blatantly unconstitutional”.\n\nThe Senate voted to advance the nomination of Pete Hegseth to become the next US secretary of defense, despite some Republican opposition. Senators Susan Collins of Maine and Lisa Murkowski of Alaska announced they would oppose Hegseth’s nomination, making them the first two Republican lawmakers to publicly reject one of Trump’s cabinet picks.\n\nThe Senate voted to confirm John Ratcliffe as CIA director, giving Trump the second member of his new cabinet. The Senate voted to confirm Ratcliffe, a former Texas representative and director of national intelligence during Trump’s first term, by 74-25, with 20 Democrats and one independent joining Republicans in backing the nomination.\n\nTrump made a combative return to the world stage in an address to the World Economic Forum in Davos, accusing oil producers of prolonging the Ukraine war by failing to cut prices and threatening tariffs on all US imports. He repeated his call for Nato countries to dramatically increase defence spending and complained about what he called an “unfair” trading relationship with China.\n\nThe state department has frozen all applications for passports with “X” sex markers and changes to gender identity on existing passports, following a new executive order signed by Trump on his first day of office. “The policy of the United States is that an individual’s sex is not changeable,” according to an internal email from the secretary of state, Marco Rubio, that was shared with the Guardian.\n\nTrump has ended security detail for three of his former administration officials so far since returning to the White House: his former secretary of state Mike Pompeo, former top aide Brian Hook and former national security adviser John Bolton.\n\nTrump held his first official call with a foreign leader since returning to the White House, speaking with the Saudi crown prince, Mohammed bin Salman, on Wednesday. In its readout of the call, the Saudi state-run Saudi Press Agency said the crown prince told Trump that he wanted to invest $600bn in the US over the next four years.","summary":"Senators Lisa Murkowski and Susan Collins have come out in opposition to the former Fox host running the Pentagon\n\n\nKey Republican senators to vote against Hegseth for US defense secretaryArgentina’s president, Javier Milei, defended on Thursday what he described as an “innocent” hand salute made by US billionaire Elon Musk this week, as he criticised “woke ideology” in a fiery speech to the World Economic Forum.\n\nMusk ignited controversy with two fascist-style salutes during Donald Trump’s presidential inauguration, with critics accusing him of giving the Nazi salute.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/live/2025/jan/23/donald-trump-pardons-january-6-us-president-joe-biden-jd-vance-republicans-live-news","image":"https://i.guim.co.uk/img/media/b9c712dc06b3c03ed95d70ee3bf87371aa499dbf/0_239_7952_4774/master/7952.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl","video":null,"publish_date":"2025-01-24 00:11:41","author":"Amy Sedghi,Chris Stein,Léonie Chao-Fong,Robert Mackey","authors":["Amy Sedghi","Chris Stein","Léonie Chao-Fong","Robert Mackey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.1},{"id":283283246,"title":"Lauren Handy To Paulette Harlow: Who Are The Anti-Abortion Protesters Trump Pardoned","text":"President Donald Trump announced with \"great honour\" on Thursday he would pardon anti-abortion activists convicted of blockading abortion clinic entrances. Calling them “peaceful pro-life protesters,” Trump said they were wrongfully prosecuted. The pardoned protestors were involved in the October 2020 invasion and blockade of a Washington clinic. The primary accused in the blockade was Lauren Handy, who was sentenced to nearly five years in prison for leading the blockade. She, along with her co-defendants were among the 23 anti-abortion activists Trump pardoned Thursday. Who Are The Anti-Abortion Activists Trump Pardoned? Here's list of the all the anti-abortion activists President Trump pardoned. 1. Lauren Handy: A prominent anti-abortion activist and organizer associated with the Progressive Anti-Abortion Uprising (PAAU). 2. Jonathan Darnel (Virginia): A Virginia-based anti-abortion activist known for his involvement in protests and advocacy campaigns. 3. Jay Smith (New York): An anti-abortion activist from New York with a history of participating in high-profile demonstrations. 4. John Hinshaw (New York): A New York-based activist with ties to anti-abortion advocacy and protest movements. 5. William Goodman (New York): A New York resident and anti-abortion advocate engaged in various grassroots efforts. Also read: Trump vs. Bank Of America: The Controversy Explained 6. Joan Bell (New Jersey): A veteran anti-abortion activist from New Jersey, involved in several protest campaigns. 7. Paulette Harlow (Massachusetts): An anti-abortion advocate from Massachusetts who actively participates in pro-life demonstrations. 8. Jean Marshal (Massachusetts): A Massachusetts-based activist known for her involvement in anti-abortion advocacy. 9. Heather Idoni (Michigan): A Michigan anti-abortion activist with a history of public campaigns supporting pro-life causes. 10. Herb Geraghty (Pennsylvania): A Pennsylvania-based advocate and organizer in the anti-abortion movement, affiliated with PAAU. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News, World and around the world.","summary":"President Donald Trump pardoned 23 anti-abortion activists, including Lauren Handy, convicted for blockading a Washington clinic in October 2020. Calling them “peaceful pro-life protesters,” Trump stated they were wrongfully prosecuted. Handy had been sentenced to nearly five years.","url":"https://www.timesnownews.com/world/us/us-news/lauren-handy-to-paulette-harlow-who-are-the-anti-abortion-protesters-trump-pardoned-article-117502060","image":"https://static.tnn.in/thumb/msid-117502084,thumbsize-1010711,width-1280,height-720,resizemode-75/117502084.jpg","video":null,"publish_date":"2025-01-24 00:09:36","author":"Shamik Banerjee","authors":["Shamik Banerjee"],"language":"en","category":"politics","source_country":"in","sentiment":0.39},{"id":283275906,"title":"BBC Question Time audience member 'hijacks' show in feisty showdown with panellist","text":"A member of the Question Time audience blasted a panellist for his comments on \"genocide in Palestine\" amid a fiery showdown last night.\n\nThe guest directed his furious tirade at Dale Vince, a green energy industrialist, during the exchange, which pesenter Fiona Bruce later said threatened to \"slightly hijack\" the original topic.\n\nSpeaking on the programme, this week held in Stockport, Greater Manchester, the man said: \"Can I take issue with you over you saying that genocide has been caused in Palestine? How dare you say that? Genocide happened to six million Jews in the Second World War, where is the equivalence? \n\n\"Did you mention the atrocity that happened on October 7 when Hamas and the Palestinians invaded Israel and killed innocent women and children, they bayoneted children. Do you understand that? How dare you say that? You're ill-informed, my friend.\"\n\nHis lecture was greeted by applause in the studio as Mr Vince, who founded the Renewable Energy Company in 1995 and was given an OBE in 2004, squirmed and hesitated.\n\nThe business tycoon, 63, acknowledged the October 7, 2023 atrocity but stressed the severity of the \"brutalisation of Palestine,\" which he says has killed more than 150,000 lives. \n\nAs tempers heated, Fiona Bruce had to interject to allow Mr Vince to give his response. The industrialist added: \"Ninety per cent of the Palestinian population have been displaced, there's been famine and all kinds of problems. Before the war, Palestinians were a captive population with no control, no access to the outside world.... They are captive in their country... You're wrong to say that is not a genocide.\"\n\nThe furious audience member attempted to retort but eventually Ms Bruce had to call a halt on the exchange. She flagged the original question concerned Donald Trump, and so she redirected the narrative back to the newly elected US President.\n\n\"I understand why you feel so strongly about it, but it is slightly hijacking the question that so many people want to talk about, so if you'll forgive me, I will move on and get back to the original question about Donald Trump,\" the experienced presenter said.\n\nShe then led the discourse back to Mr Trump, who has already hinted he might prosecute Joe Biden and said pursuing Mr Biden was more important than the economy.","summary":"Question Time saw Dale Vince, a green energy industrialist, come under scathing criticism from an audience member who took issue with the business tycoon's comments on Palestine","url":"https://www.mirror.co.uk/news/politics/bbc-question-time-audience-member-34542971","image":"https://i2-prod.mirror.co.uk/incoming/article34542974.ece/ALTERNATES/s1200/0_qtmain.jpg","video":null,"publish_date":"2025-01-24 00:09:00","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","source_country":"gb","sentiment":-0.102},{"id":283279036,"title":"Trump shakes up globalists at Davos summit — instilling fear and relief while showing Sleepy Joe’s no longer at the wheel","text":"DAVOS, SWITZERLAND — For the unacquainted, Davos is the home of the World Economic Forum, and hosts a yearly confab of the global elite. The stars are the chiefs of globalist institutions like the IMF; the UN; progressive prime ministers; and all the big banks.\n\nThis year was different. The headliner was a real-estate developer from Queens.\n\nWho also happens to be president of the United States.\n\nHe wasn’t here in person, but The Donald dominated every conversation — and not always in a bad way, even given his America First agenda, and his penchant not to care what the IMF, the UN or the people at the WEF think.\n\nIn some ways, the globalist crowd is scared to death of The Donald, and for good reasons. Joe Biden was sleepy but predictably globalist. They recall Trump’s first unconventional term as president. In the early days of Trump II, he already issued an executive order halting foreign aid for the next 90 days; he is ending all the globalists shibboleths of environmental social governance — the corporate embrace of zero carbon future and wokeism.\n\nHe wants to drill baby drill — and what lefty globalist wants that?\n\nIn other ways, however, they’re also relieved. Unlike Biden, an actual, sentient human being is now the leader of the free world. They owe their protection to a man who doesn’t sleep all day; no one here really wants a future of speaking Chinese or Russian.\n\nTrump was beamed in Thursday to address the crowd and he gave a very Trumpy speech reminding big banks like JPMorgan there will be penalties for going woke — in his words, “debanking conservatives.” He said diversity equity and inclusion mandates — a form of racial and gender equalization that used to be big with the Davos crowd — is the way of the past.\n\nThe reaction was pretty positive, or at least not hostile. Ditto for Trump’s social media tweet warning Vladimir Putin he better get to the table and negotiate a real peace in its years-long conflict with Ukraine.The globalists used to believe Trump had a man crush on the Russian strongman, and thought he was about to sell out Ukraine to appease old Vlad.\n\nThat’s not the tenor of conversations as the forum draws to a close. What they’re learning is that Trump is friends with someone until he’s not. And that goes for Vladimir Putin.\n\nTrump sees WWIII as not being in US interests (for obvious reasons) and if Putin doesn’t play ball Trump will make whatever sanctions imposed by Sleepy Joe Biden look small, possibly using frozen Russian assets in the West to fund Ukraine’s military.\n\nThe globalists are always worried about something. But I also saw a bit of hope, because a new sheriff is in town and he’s not falling asleep at the wheel.","summary":"He wasn’t here in person, but The Donald dominated every conversation — and not always in a bad way, even given his America First agenda.","url":"https://nypost.com/2025/01/23/business/trump-shakes-up-globalists-at-davos-summit-instilling-fear-and-relief-while-showing-sleepy-joes-no-longer-at-the-wheel/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/trump-davos.jpg?quality=75&strip=all&1737656574&w=1200","video":null,"publish_date":"2025-01-24 00:08:09","author":"Charles Gasparino","authors":["Charles Gasparino"],"language":"en","category":"politics","source_country":"us","sentiment":0.108},{"id":283276012,"title":"The Traitors fans are left 'shaking' and 'coming out in hives' as show ends on a HUGE cliffhanger after Frankie's shocking move","text":"Black Friday\n\nThe Traitors\n\nThe Masked Singer\n\nLove Island All Stars\n\nDancing On Ice\n\nPrivacy Policy\n\nFriday, Jan 24th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nThe Traitors fans are left 'shaking' and 'coming out in hives' as show ends on a HUGE cliffhanger after Frankie's shocking move\n\nHave YOU got a story? Email tips@dailymail.com\nBy LAURA FOX FOR MAILONLINE \n Published:00:06 GMT, 24 January 2025 |Updated:00:07 GMT, 24 January 2025 \n\nThe penultimate episode of The Traitors ended with the show's most dramatic cliffhanger yet, as Francesca Rowan-Plowden was given the biggest power in the series' history.\nAwarded the title of Seer following the day's mission, Frankie was given the chance to choose one player, and discover once and for all whether they were a Traitor or a Faithful.\nFrankie then chose Charlotte, with her reason being that she wanted to confirm her status as a Faithful, but of course viewers are well aware she is a Traitor.\nCharlotte is the sole remaining Traitor in the five still taking part in the game, meaning that if she avoids being banished, she'll take all of the prize money.\n'This could be the difference between winning and losing the game' Claudia told Frankie as she decided who to invite to the face to face meeting.\n'Charlotte I could bring in as an affirmation of a faithful,' Frankie said. 'Alexander, I have wound myself in knots. Do I pick someone I am confident in like Charlotte and form an alliance or do I invite Alexander, why did he give me the coins?'\n\nThe penultimate episode of The Traitors ended with the show's most dramatic cliffhanger yet, as Francesca Rowan-Plowden was given the biggest power in the series' history\n\nAwarded the title of Seer following the day's mission, Frankie was given the chance to choose one player, and discover once and for all whether they were a Traitor or a Faithful\n'My gut is that I need to clear up the people close to me.'\nIn the end, Frankie chose Charlotte, convinced she was a faithful. The remaining faithfuls were suspect of her choice, speculating that because Freddie had voted for Charlotte at the round table, Frankie was suspicious of her. \n'In my heart I hope she is a faithful then I can take a sigh of relief that one person is one hundred percent faithful and it was the person I always thought it was,' Frankie said.\nBut a stressed Charlotte confessed: 'My mind is just whirring. Where do I go from here? I feel very pinned in the corner. I am the last traitor standing, it is literally her word against mine.' \nViewers were gripped as they eagerly waited for the moment Charlotte was forced to tell Frankie she was a Traitor, but the episode came to an abrupt end before it was revealed.\nIt was a cliffhanger that sparked a sea of reaction from fans on social media, with one even admitting they were 'coming out in hives' following the tense episode.\nPosts on X included: 'THIS IS REAL TV I AM SAT SHAKING OH MY GOD CHARLOTTE HAS TO REVEAL HERSELF TO FRANKIE;'\n'I've come out in hives;'\n\nFrankie then chose Charlotte, with her reason being that she wanted to confirm her status as a Faithful, but of course viewers are well aware she is a Traitor\n\nViewers were gripped as they eagerly waited for the moment Charlotte was forced to tell Frankie she was a Traitor, but the episode came to an abrupt end before it was revealed\n\nIt was a cliffhanger that sparked a sea of reaction from fans on social media, with one even admitting they were 'coming out in hives' following the tense episode\n\nHis exit confirmed that this year's final five were (L-R) Leanne, Jake, Alexander, Charlotte and Frankie, with a total of nearly £75,000 on offer in the prize fund\n'The GASP @MrAlexRamzan and I just GASPED. This is SO game wide open;'\n'Noooo. Why do you stop right now! Cliffhanger at its best;'\nThursday's episode also saw Freddie Fraser banished from the castle, bringing an end to his brief stint as a Traitor.\nJust 24 hours after he was recruited by long-time traitor Charlotte, Freddie was banished after his feeble lies failed to convice the final five of his faithfulness. \n\n The Traitors fans claim the hit BBC show is rigged as Leanne has unbelievable luck \nSpeaking after his banishment Freddie admitted he had zero strategy in the game, confessing: 'I think my strategy all along was just to be myself, I can't put on a facade or portray a different character than who I really am.'\n'My strategy was to get along more with the ladies and do a bit of flirting here and a bit of charming there. I think I'm like that in my everyday life anyway, so fit perfectly.'\nHe added though that he was gutted to leave the competition as a traitor, explaining: 'The worst part is that I had to stand up there and say that I was a Traitor, even though it had only been a day!'\n'I could have done so many things differently, but everyone will think that looking back. If you haven't won, you're obviously going to look back and think you could have done stuff differently.\n'I’m happy with how I played it.'\nHis exit confirmed that this year's final five were Frankie, Charlotte, Alexander Dragonetti, Jake Brown and Leanne Quigley, with a total of nearly £75,000 on offer in the prize fund.\nThe Traitors Final airs on Friday at 8:30pm on BBC One and iPlayer. \n\nShare or comment on this article: \nThe Traitors fans are left 'shaking' and 'coming out in hives' as show ends on a HUGE cliffhanger after Frankie's shocking move\n\nAdd comment\n\nEnter search term:\n\nKatie Price looks happy and healthy after sparking concern over dramatic weight loss as she jets off to Turkey with boyfriend JJ Slater \n\nTasha Ghouri's mum drops a HUGE hint about the reason behind the Strictly star's split from boyfriend Andrew Le Page\n\nThe Traitors: Short-lived villain Freddie is banished after making a HUGE slip-up - but fans spot his 'parting gift' as he exposes Charlotte with final vote\n\nEXCLUSIVERICHARD EDEN: My Palace sources reveal what Meghan did BEFORE marriage that they describe as 'punch to the solar plexus'\n\nThe Traitors fans brand Charlotte a 'backstabber' as she throws her ally Freddie 'under the bus' in a VERY tense breakfast\n\nTV host Alex Jones shares the highlights of her family holiday on the Algarve\n\nHollywood intimacy coordinator speaks out on THAT Blake Lively and Justin Baldoni video from It Ends With Us set\n\nSpencer Pratt admits if he were 'rich' he would NOT put his family on social media but he needs the money\n\nALISON BOSHOFF: Laurence Llewelyn-Bowen is set to get his own fly-on-the-wall show at family mansion\n\nMum's the word! Here are the top 10 brands for both mother and baby this month\n\nMy Emmerdale star mum is envious of my successful £100k a month OnlyFans career\n\nBREAKING NEWSJamie Foxx SPLITS from girlfriend Alyce Huckstepp after making THAT offensive song about dating white women\n\nThe Traitors reveals shock twist as one player is giving the most valuable power ever seen in the game just one day before the finale\n\nAwkward photo of Camila Cabello performing in near-empty arena goes viral\n\nGive your brood a boost! Discover how to enhance your homelife with these top 10 brands for families\n\nPrince William shares rare insight into family days out as he reveals the trick George, Charlotte and Louis play on bike rides\n\nUnreleased Tina Turner track makes its radio debut two years after singer's death... but critics says it's simply not The Best\n\nThe Traitors fans claim the hit BBC show is rigged as Leanne has unbelievable luck just one day before the finale\n\nKaren Gillan looks ready to celebrate motherhood on her first night out since the birth of her baby daughter Clementine\n\nLet Europe's beauty unfold before you: Expertly curated coach tours are taking the stress out of travel - just LOOK at these incredible holidays\n\nLove Island: All Stars fans CRINGE for Elma as she accidentally says 'I love you' to Ronnie in bed just hours before his ex Harriett's bombshell arrival\n\nReese Witherspoon looks effortlessly chic in a black dress and blazer as she poses with dapper Will Ferrell at the You're Cordially Invited UK screening\n\nEmmerdale star Sammy Winward's daughter Mia Dunn claims her footballer dad called her a 'w**re' in OnlyFans feud\n\nThe Traitors fans share hilarious memes as they mourn the loss of 'the worst traitor in history' Freddie after his 'epic fail'\n\nI'm a Traitors addict. Here are the hidden clues you've missed that have convinced me THIS surprise player is going to win: CLAUDIA CONNELL\n\nA$AP Rocky's potential jurors quizzed over Rihanna and her lingerie line amid gun-firing case\n\nCHRISTOPHER STEVENS reviews High Potential on Disney +: Crime-fighting Mrs Mop who makes Sherlock look like the class dunce...\n\nWhy Hollywood star Matt Damon would be popping some champagne corks after watching racing from Tamworth\n\nLabyrinth sequel slammed by fans who are raging at Robert Eggers' follow-up to the David Bowie cult classic\n\nDragons' Den judges left speechless after 'heart-wrenching' pitch from Ukrainian refugee who fled her home country with just her laptop and £5k \n\nLove Island: All Stars' fans slam Gabby for 'silly' comment as she implies that Catherine and Nas should have been dumped from the Villa\n\nBradley Walsh set to 'front new TV series with a surprising twist' and its very different from his other shows\n\nA-List stars already 'crying' over their Oscar nominations while one calls it 'bittersweet'\n\nThe BRIT Awards 2025: Charli XCX leads female dominated nominations with FIVE nods including Album Of The Year\n\nLove Island winner Molly Smith launches new Move With Molly fitness plans - and you could see results in just six WEEKS (get 45% off now)\n\nInside Molly-Mae Hague's second birthday party for daughter Bambi with adorable tiger theme and homemade cake as she shares sweet post: 'You changed my world forever'\n\nJohn Barrowman forced to 'give away' tickets to his tour as he attempts to relaunch his career after failed Celebrity SAS stint\n\nBen Affleck pulls strained faces as he arrives at his LA office amid claim ex Jennifer Garner wants him to 'grow up'\n\nMichelle Yeoh, 62, looks decades younger in a tight dress at the premiere of her show Star Trek: Section 31\n\nREVEALED: The best contour wands for defined and lifted cheekbones - and an unmissable beauty deal with 15% off\n\nTallia Storm sparks romance rumours with Love Island hunk with cosy TikTok as his ex is linked with dramatic All Stars return\n\nGK Barry cuts a casual figure while protecting her adorable pet pooch from the rain as she steps out following a radio appearance\n\nLegendary singer dies aged 85 after being diagnosed with incurable lung cancer\n\nJeff Bezos' surprising reaction to men ogling fiancée Lauren Sanchez\n\nHUGE mobile phone offer: Save up to £932 on the new Google Pixel 9 Pro XL with Vodafone - but there's a catch\n\nMatty Healy's younger brother Louis, 23, shows off uncanny resemblance to The 1975 star as he displays his tattoos in edgy black and white photo shoot\n\nBarry Goldberg dead at 83: Bob Dylan's keyboardist and Newport band member passes away in hospice\n\nHBO fans are sent into a meltdown as popular show is set to end with upcoming season four\n\nKatie Price's IVF documentary branded 'attention seeking dribble' by ex Alex Reid's partner amid their own seven-year battle to conceive\n\nKendrick Lamar announces Grammy-award winner is joining his star-studded Super Bowl halftime show\n\nDancing on Ice judge Oti Mabuse says it's 'tougher' for stars with previous experience to compete on the skating show amid fix claims\n\nMaya Jama sizzles in figure-hugging red gown and Davina McCall flashes her legs in chic white minidress in first look at The Masked Singer\n\nZendaya fans outraged after Challengers star was snubbed for an Oscar nod... as movie misses major nomination\n\nCarrie Underwoodbreaks silence after Donald Trump inauguration performance with telling message\n\nBeauty lovers say this sculpting gel makes them look 'TEN years younger' - and we have an exclusive 20% off discount code\n\nFormer child star claims she was told to lose 15lbs and 'strap down' her chest at age 12\n\nEXCLUSIVEDiane Warren 'proud' to land 16th Oscar nod as fans say 'she better win this time!' after Malibu home burned\n\nMolly-Mae Hague steps out in her pyjamas as she waves off ex-fiancé Tommy Fury outside her £4m Cheshire home - before reuniting for daughter Bambi's birthday\n\nCAROLINE BULLOCK: Demi 'Gimme' Moore is having a pre-Oscar's pity party... but this 'popcorn' actress doesn't get a kernel of my sympathy\n\nA bottle of this lavender pillow spray is sold every 79 SECONDS with users swearing they 'fall asleep in minutes' (and it's on sale)\n\nDavid Beckham enjoys a pint at the pub as he learns about his 'long lost twin brother' in Stella Artois Super Bowl 2025 advert\n\nKylie Jenner holds a red rose as boyfriend Timothée Chalamet gets 2nd Oscar nomination\n\nEXCLUSIVECarrie Underwood's inauguration performance sparks major issue with American Idol\n\nThe Beatles land first BRIT Award nomination in 42 years for their last ever song Now and Then - featuring John Lennon's vocals thanks to AI\n\nAndie MacDowell, 66, reveals shock health diagnosis as she discusses aging in Hollywood\n\nPauline Quirke's son Charlie breaks his silence in emotional update after the Birds Of A Feather star's dementia diagnosis\n\nAmandaland fans rave 'I'm obsessed!' as BBC drops trailer for Motherland spin-off full to the brim with chaos and cringe\n\nFull list of Oscar nominations 2025: Cynthia Erivo and Ariana Grande land nods while Emilia Perez leads Academy Awards list\n\nCate Blanchett offers rare insight into her relationship with motherhood and admits it's 'not all that she is' in stunning shoot with Harper's Bazaar Spain\n\nSebastian Stan yearbook entry predicting he would win an Oscar goes viral as he gets nod for playing Donald Trump\n\nToxic feud that tore Eternal apart: Louise Redknapp's bandmates re-form group with a new singer after row over performing at gay and trans Pride events\n\nCruz Beckham shows off new longer voluminous locks as he enjoys a jam session with pals in Instagram video\n\nRare Rolling Stones snaps give behind-the-scenes glimpse into Mick Jagger and the band's glory days as rumours swirl over a huge European tour \n\nBrianna Chickenfry theorizes that she's 'fully a lesbian' after messy Zach Bryan split\n\nRob Lowe shares sad news brother Chad is 'heartbroken' after losing home in LA fires as he helps out\n\nHorror moment TV host has nail driven into her hand by magician in botched trick - and is rushed to hospital for treatment\n\nLegendary 90s guitarist QUITS band after 30 years due to 'medical developments' with heartbreaking statement\n\nEXCLUSIVESavage X Fenty collection is 50% off using this shopping hack - including bras, sets and loungewear pieces\n\nRihanna sets pulses racing in sexy black lingerie to promote Savage X Fenty\n\nEXCLUSIVEInside Billy Ray Cyrus' tragic downfall, from 'intense bouts of drinking' to 'bitterness' over Miley's success\n\nMaya Jama sets pulses racing in a busty black dress as she shows off latest Love Island All Stars look\n\nAriana Grande 'cannot stop crying' after receiving her 1st Oscar nomination for Wicked\n\nFKA twigs turns heads with bizarre face markings and new mohawk as she wears brown 'rhino' shoes at Rick Owens' Paris Fashion Week show\n\nTV presenter is rushed to hospital after shock collapse as they issue important health update\n\nRapper Project Pat's son Patrick Houston Jr. dead at 21 after shooting in Tennessee park\n\nOscars nominations 2025: Cynthia Erivo leads the British and Irish stars receiving nods - but fan-favourite gets SNUBBED\n\nAlec Baldwin gets his mouth taped shut on cover of wife Hilaria's new book Manual Not Included\n\nWicked stars Ariana Grande and Cynthia Erivo look glamorous as they attend a lunch reception in London following their Oscars nominations\n\nKelly Ripa, 54, reveals how much weight she GAINED when she stopped drinking alcohol\n\nKendall and Kylie Jenner's half-brother reveals if they still hang out after family meltdown\n\nLove Island: All Star Harriett makes a bombshell entrance as she KISSES Ronnie and he tells her his 'heart went' when she walked in \n\nRachel Riley left red-faced as she's forced to spell out VERY cheeky seven-letter word by Countdown co-star Susie Dent\n\nLily-Rose Depp's terrifying audition tape for horror film Nosferatu leaves fans with one common question\n\nOprah Winfrey reveals Ozempic made her realise the truth about 'thin people'\n\nAnais Gallagher enjoys 'magical' getaway to Disneyland Paris with her with rarely-seen boyfriend Callum Scott Howells\n\nHollywood delivers brutal response to Donald Trump's 'two sexes' edict and DEI crackdown as Emilia Perez trans star makes Oscar history with nomination\n\nAriana Grande's boyfriend Ethan Slater shares candid photo of Wicked star as she lands first Oscar nomination\n\nQueen Camilla warns against 'being complacent' to prejudice as she echoes Holocaust survivor's warning in moving speech \n\nPregnant Michelle Keegan hides her baby bump under oversized coat as she arrives on Brassic set - after insisting show not been axed' \n\nDisney+ fans rave over 'absolute masterpiece' detective series with whopping 94% Rotten Tomatoes score\n\n'Catwoman' Jocelyn Wildenstein is laid to rest: Socialitie's fiancé Lloyd Klein is consoled by tearful mourners in Paris as they bid an emotional final farewell to billionaire\n\nThis Morning viewers gasp 'what am I watching?!' as woman spreads her legs for invasive 'vaginal anti-ageing' procedure live on show\n\nOscar 2025 SNUBS sees Selena Gomez, Angelina Jolie and Nicole Kidman shockingly left off the list\n\nTV fans rejoice as all seasons of 'the best show since The Sopranos' are made available to stream - with racy BBC period drama hailed as 'glorious and gorgeous'\n\nEXCLUSIVEI'm glad I don't have to be on Love Island wearing a bikini: Pregnant Arabella Chi, 33, shares hopes of becoming a 'relatable mum'\n\nDragons' Den star Steven Bartlett signs with Meghan Markle's agent as he moves to Los Angeles and sets sights on 'cracking Hollywood'\n\nCoronation Street's Brooke Vincent shows off jaw-dropping figure in a leopard-print bikini as she soaks up the sun during Dubai getaway\n\nTV star looks worlds away from his criminal character as he swaps his vintage gangster looks for an edgy Yeezy outfit\n\nDanny Dyer roars 'f*** off!' at A League Of Their Own studio audience after gift from panelist takes sour turn\n\nPamela Anderson fans outraged the 'amazing' actress was NOT nominated for an Oscar for The Last Showgirl\n\nI was a producer on The Jerry Springer Show and worked as the married presenter's backstage pimp - here's why doc about him doesn't tell full story\n\nDemi Moore is nominated for her FIRST Oscar at age 62 as she becomes Hollywood's ultimate comeback story\n\nScarlett Johansson addresses future on Today show after fans called for her to become a permanent co-host\n\n'If you're asking to be respected - don't come on in a G-string': Sabrina Carpenter's sexy image is branded 'offensive' by Pop Idol mogul\n\nDavid Beckham caught in the crossfire between Ryan Reynolds and Tom Brady as Deadpool star reveals WhatsApp messages\n\nEXCLUSIVEThe Traitors star Alan Cumming joins exodus of anti-MAGA stars fleeing US for Britain as Donald Trump's second Presidential term kicks off\n\nDuchess of Edinburgh strikes an elegant chord as she meets the Band of the Coldstream Guards at the Royal Military Academy Sandhurst\n\nEmilia Perez star Karla Sofia Gascon makes Oscar history as first openly trans actress to earn nomination\n\nThe tragic and triumphant legacies of the Birds of a Feather cast: From becoming Jamie Dornan AND Colin Farrell's father-in-law to starring in a film with Madonna\n\nThe Repair Shop fans left 'crying and traumatised' as guest chokes up revealing heart-wrenching truth behind his teddy bear\n\nNeighbours hit out at Katie Price's new 'Mucky Mansion': Disgusted locals say she is turning £750,000 home into eyesore as huge mound of rubbish piles up outside\n\nMaya Jama opens up about solo dining abroad as she makes hilarious quip about her lavish tasting menu\n\nBit hypocritical, Pete! As Waterman slams Sabrina Carpenter for her 'lazy' sexy stage outfits - a look at the raunchy looks his 80s acts were sporting\n\nKylie Minogue turns up the heat in a ripped pink mini dress as she poses ahead of her Tension tour kicking off - after her iHeart Radio nomination\n\nInside Oprah Winfrey's feud with Jerry Springer as her behaviour is branded 'inappropriate' by late talk show host's staff in explosive documentary\n\nBrooklyn Beckham indulges in alternative form of detox therapy - after revealing he's eaten cod sperm\n\nJenny Powell, 56,gives major health update after undergoing a hysterectomy\n\nThe Chase fans beg 'please stop' as contestant's habit dubbed 'one of the most annoying things ever seen on the show'\n\nJessy Potts takes savage swipe at ex Joey Essex after Love Island's Grace Jackson revealed she met up with the TOWIE star shortly after their split\n\nBeloved Lorraine star returns to show after surgery and gives grisly health update after being left 'unable to do anything'\n\nJorgie Porter looks in good spirits as she cradles daughter Peony during outing in Manchester\n\nWinterwatch host Iolo Williams swipes at BBC co-stars for 'abandoning' him - before Michaela Strachan delivers scathing takedown\n\nTommy Fury returns to ex Molly-Mae Hague's home for their daughter Bambi's second birthday party - as he marks milestone with sweet newborn snap\n\nEXCLUSIVEHow Birds Of A Feather stars ended their feud. After Pauline Quirke's shock diagnosis, KATIE HIND discloses for the first time the full details of their reconciliation\n\nFormer Neighbors star Guy Pearce and his Game Of Thrones star girlfriend Carice van Houten confirm split after nine years together\n\nRadio 2 star DJ Spoony reveals his scars are 'healing amazingly' after being hospitalised for emergency brain surgery over Christmas\n\nRita Ora shows off her incredibly toned figure in a tiny neon green bikini during her trip to Australia's Gold Coast\n\nEXCLUSIVEOlly Murs leaves fan swearing in outrage with hilarious family tree prank in first look at Michael McIntyre's Big Show\n\nTravis Scott joins fellow rapper French Montana in leading the stars at Paris Saint-Germain versus Man City game\n\nBlockbuster thriller launches with one of the lowest Rotten Tomatoes scores in streaming history as viewers rip into 'instantly forgettable' plot and 'letdown' ending\n\nAdele's 'haunted' mansion: How £6million home that owner says is 'unsellable' after the singer claimed it was 'quite scary' used to be a convent \n\nSusanna Reid steps in as Good Morning Britain co-star 'chokes up' over 'issues at home' - before immediately backtracking\n\nLouis Theroux bashes Sharon Osbourne for 'not reading her own books' as he recalls X Factor star's dumbfounded response when he asked her about them\n\nKatherine Ryan fans say she's 'absolutely spot on' after she voiced disgust at the 1,057 'desperate' men who queued hours to sleep with Bonnie Blue\n\nCoronation Street blasted by charity for 'ignoring' its advice on 'unrealistic and distressing' kidney transplant storyline\n\nPregnant Amy Jackson showcases her growing baby bump in topless snap as she goes 'skinny dipping' during luxury holiday\n\nPregnant Michelle Keegan shows a glimpse of her baby bump in a grey tracksuit as she promotes her Very collection \n\nThe striking hidden messages in the nine best 'revenge dresses' worn by celebrities for their most difficult, high profile moments and what they REALLY mean\n\nKit Harington chases Mark Wahlberg around the streets of London on the set of new Apple film Family Plan 2\n\nIconic 1970s movie star, 80, is gearing up for West End return over 50 years after she debuted on Broadway - but can YOU guess who it is?\n\nMillie Bobby Brown flaunts her toned figure in tiny string bikini and displays her trendy style in Matrix-inspired black leather look in sizzling snaps\n\nChristine McGuinness shocks with X-rated joke about Celebrity Hunted stars - leaving partner Duncan James blushing\n\nDon't reign on her parade! Queen Letizia dazzles in red power suit amid gloomy weather on school visit to Madrid\n\nLucien Laviscount reveals he's taken up French lessons for Emily In Paris ahead of anticipated fifth season\n\nWould you wear this to the beach? Aussie model risks major wardrobe malfunction in a white bikini\n\nCrown Prince and Princess of Norway enjoy ski trip with Prince Sverre Magnus - as Mette-Marit's eldest son returns to Norway following 'rehab stint'\n\nNoel Fielding slowly regains social media presence with new post after revealing his future on Bake Off amid health concerns\n\nColdplay release 45 minute film to celebrate the release of tenth album Moon Music - as Chris Martin calls it 'the best thing we have ever been a part of'\n\nBBC confirms spin-off series for two of its most popular shows - and they're just weeks away from hitting screens\n\n'I cannot tell my kids I'm leaving them, it's too soon': Footballer's wife makes 'final push' to raise money to pay for cancer treatment after fourth diagnosis\n\nLove Island: All Stars' Olivia Hawkins blames her shock dumping on flirty exchanges with Luca Bish\n\nHailey Bieber's two-word message to fans about state of her marriage as she puts on a leggy show amid breakup rumors\n\nThe Traitors star Minah breaks her silence on brutal banishment and reveals what she really thinks of her rival Charlotte\n\n2025 Grammy winners 'leaked' ahead of awards show - and one major artist is set for a shock snub\n\nBruce Willis, 69, makes a rare public appearance in LA as he battles frontotemporal dementia\n\nMichelle Keegan insists 'Brassic has not been axed' despite bosses confirming it won't be returning after season seven\n\nBilly Ray Cyrus' son makes dramatic plea after 'trainwreck' performance at Trump inauguration: 'You're not healthy Dad and everyone is noticing'\n\nJulia Haart dances in her kitchen as she celebrates keeping $58million home and nearly $10million in cash in huge divorce win\n\nBlake Lively and Ryan Reynolds make shock request after Justin Baldoni's lawyer released bombshell video\n\nFKA twigs puts on a daring display in TINY black shorts as she departs Hotel Costes with a mystery man in Paris\n\nJudi Dench, 90, reveals she can no longer go out alone due to the severity of her sight loss as she shares fears she could 'fall over'\n\nSting's wife Trudie Styler puts on a brave face after the singer cancelled awards appearance due to ill health\n\nWhoopi Goldberg unveils makeover in Paris after weight loss drugs helped her slim down from 300lbs\n\nDick Van Dyke, 99, shares his secret to staying fit as he details his exercise routine in a new interview\n\nLeonardo DiCaprio to reunite with Martin Scorsese on years-in-the-making thriller Devil In The White City\n\nLorraine Kelly, 65, admits she still struggles with 'working class cringe' despite 40 years of TV success as she reveals the big name that's left her the most star-struck\n\nRihanna emotionally leads heartfelt tributes to Lynn Ban after death at 52: 'Can't believe I'm writing this'\n\nKhloe Kardashian makes rare comment on Tristan Thompson's co-parenting as she reveals if she's single\n\nBenedict Cumberbatch reveals he was KIDNAPPED while on location in South Africa: 'It made me patient to live a life less ordinary'\n\nThe Tudors star Jonathan Rhys Meyers reveals he lost his Malibu home in devastating LA fire\n\nJustin Baldoni's lawyer previously sued him for allegedly stealing a movie script from a man with cystic fibrosis\n\nGiddy Justin Baldoni seen with wife hours before releasing bombshell Blake Lively video amid their lawsuits\n\nThe Traitors fans rejoice as 'the worst player in show history' is murdered leading Frankie to break down in tears\n\nLove Island: All Stars' Grace Jackson reveals the REAL reason she ended romance with Marcus Rashford \n\nHolly Willoughby is happier than ever as she 'jokes around and chats' on Dancing On Ice set following Phillip Schofield's departure\n\nEXCLUSIVEMy boyfriend won The Traitors and this is how I feel about his lies\n\nSir Rod Stewart, 80, and his son Alastair, 19, are in high spirits as they sing and snap selfies at Celtic vs Young Boys in Glasgow\n\nChris Brown lawsuit: Warner Bros. Discovery stands behind docuseries as singer's lawyer rips corporation\n\nKardashians hairstylist Jen Atkin moving out of California after losing her $8M Malibu home in LA fires\n\nGuardians of the Galaxy star Chris Pratt reveals his home is 'miraculously still standing' after his ex Anna Faris lost her house in LA fires\n\nAmy Schumer reveals how comments about her 'moon face' led to shock health diagnosis\n\nThe Traitors Charlotte TURNS on teammate Minah in most dramatic roundtable yet as fans declare they are 'rooting for a faithfuls win'\n\nA-List singer performed for Robert F. Kennedy Jr. during surprise appearance at inauguration ball\n\nSharon Horgan admits she regrets not ending her marriage earlier as 'it was so clear that it wasn't right' and reveals she is the only one parenting her daughters\n\nMolly-Mae Hague breaks down in tears whilst watching old videos of herself with her daughter Bambi as she admits she 'wishes she knew the best times were round the corner'\n\nEXCLUSIVEAnna Maynard insists she has 'thick skin' as she speaks candidly about online trolling and how fitness has 'completely changed' her mental health\n\nSelena Gomez fans react to rumors fiance Benny Blanco will play live-action Tangled heartthrob\n\nLynn Ban dead at 52: Bling Empire star and celebrity New York jewelry designer passes away weeks after ski accident\n\nNicola Coughlan shows support to fellow Derry Girls star Dylan Llewellyn as she joins Mel C at Channel 4's Big Boys screening ahead of series three\n\nArnold Schwarzenegger is donating $1M to LA fire relief as new blaze breaks out forcing tens of thousands from their homes\n\nTina Turner song set to be released for the first time after lying undiscovered for 40 YEARS - 19 months after the iconic hitmaker's death\n\nJoni Mitchell, 81, looks radiant on very rare public outing with a male pal in Beverly Hills\n\nMel B calls for action over words in impassioned speech on domestic abuse at the World Economic Forum in Davos\n\nA new Traitor is recruited with just TWO days to go before finale as fans fear he'll be the next victim in Charlotte's 'evil' web\n\nSelena Gomez, 32, teases new music despite previously saying she's 'too old for the pop star life'\n\nSelling Sunset star Nicole Young on break from show amid her feud with Chrishell Stause\n\nLove Island: All Stars is hit by a shock dumping as TWO fan favourites are axed from the villa after being branded the 'least compatible' by viewers\n\nBilly Ray Cyrus says 'you just had to be there' after trainwreck outing at Trump inaugural ball\n\nJessica Simpson flaunts her revenge body in a low-cut swimsuit after splitting from Eric Johnson\n\nThe Traitors fans brand Leanne's final week decision 'idiotic' as she attempts strategic move after traitor Minah was banished\n\nOscars bosses make huge announcement over 2025 Academy Awards despite backlash amid horrific LA fires\n\nLove Island's Harriett Blackmore set to cause chaos by confronting Ronnie Vint as she and Montel McKenzie are latest bombshells to shake up the villa\n\nAlly Lewber confirms James Kennedy split after it's revealed he won't face charges following his domestic violencearrest\n\nBachelor star Brad Womack says Ellen DeGeneres eventually apologized after calling him a 'jerk' on her show\n\nBarry Michael Cooper dead at 66: Writer of New Jack City, Sugar Hill and Above The Rim passes away\n\nMikey Madison puts on leggy display in powder blue coord during NYC outing amid Anora Oscar buzz\n\nRingo Starr's son Zak Starkey cancels London performance after shock health diagnosis\n\nLove It or List It viewers slam 'miserable' and 'impossible to please' mother-of-five for refusing to move house\n\nJoJo Siwa goes Instagram official with her Aussie girlfriend in PDA-packed post\n\nUB40's Robin Campbell and Jimmy Brown insist that 'all the money in the world' would not get them to reunite with former bandmate Ali Campbell\n\nJames Kennedy will NOT face charges after domestic violence arrest... amid split claims with Ally Lewber\n\nEXCLUSIVEBling Empire's Leah Qin pays tribute to 'genuinely sweet' Lynn Ban after co-star dies following skiing accident\n\nLove Island star rushed to hospital with nasty injury amid rumours he is set to make a return to All Stars\n\nFuture of Noel Fielding's Apple TV+ series The Completely Made-Up Adventures of Dick Turpin is 'revealed' after the star pulled out of series \n\nFriends of Aubrey Plaza's late husband Jeff Baena speak out after his shock death\n\nPretty in pink! Queen Letizia of Spain looks chic in a rose-coloured blazer from high-street brand as she joins her husband King Felipe at a tourism fair in Madrid\n\nBlake Lively and Justin Baldoni's costar Jenny Slate bombarded by cruel trolls amid their bitter legal battle\n\nBella Hadid is still in her Yellowstone era as she rocks oversized bomber jacket with shearling trim in NYC\n\nMeg Ryan teases 'iconic' reunion with When Harry Met Sally co-star Billy Crystal... see them now\n\nCHRISTOPHER STEVENS reviews Grantchester on ITV1: One look at Grantchester's new vicar and Geordie's knees turned to jelly\n\nAdele's 'haunted house' claim scares off buyers of her old £6m mansion making the luxury home 'unsellable', property's owner says\n\nHarry Potter star Miriam Margolyes takes a swipe at Australia and reveals the one thing she doesn't like about the country\n\nThe Traitors fans send their 'prayers for Minah' as viewers fear the villain's time could be up as accusations start flying\n\nEternal reveal plans to release their first new album in 30 years with a new member - after a trans rights row with ex-bandmate Louise Redknapp \n\nThe six-figure sum Sir Michael Parkinson left to his beloved wife Lady Mary as his will is signed off - two years after his death aged 88\n\nITV confirms Jonathan Ross will return to present Oscars LIVE while Conan O'Brien hosts star-studded ceremony in LA\n\nLottie Tomlinson and fiancé Lewis Burton are seen for the first time with their newborn daughter as they enjoy winter walk after revealing sweet name\n\nMob Wives star Natalie DiDonato found safe in Nevada after sparking missing person report\n\nTaylor Swift is praised by a burlesque legend for her unique approach to a sexy routine\n\nJodie Marsh confronts two 'intimidating and aggressive' strangers on her Chelmsford farm after they 'travelled 125 miles to film through her windows'\n\nNaomi Watts clutches onto her driver for support as she tries not to slip on the icy New York streets while heading to The Drew Barrymore Show\n\nMajor US star to join new series of Channel 4's Taskmaster - and fans can't wait to witness the 'chaos'\n\nBenedict Cumberbatch shares his bewilderment at being branded a sex symbol as he admits to 'worrying about ageing' in candid confession\n\nStephanie Davis reveals the sweet meaning behind her newborn son's name after giving birth to her baby boy following a 'traumatic' pregnancy\n\nKatie Price 'alarms neighbours' over mounting rubbish outside her new £5,000 a month rental - just six months after moving in\n\nEastEnders star Lacey Turner reveals her baby daughter's unusual name after welcoming her third child with husband \n\nBobby Norris reveals he faced vile homophobic abuse from a man at Stratford station\n\nIt Ends With Us author Colleen Hoover DEACTIVATES her Instagram as Blake Lively and Justin Baldoni legal saga continues\n\nRicky Gervais pays tribute to his canine co-star Anti as After Life dog dies age 13\n\nEXCLUSIVEInside Tyra Banks' secret Aussie life: Supermodel reveals plans for TV comeback Down Under\n\nZoe Saldana reveals why she initially turned down the offer to work with Nicole Kidman on Lioness\n\nLove Island: All Stars SPOILER: Grace Jackson is quizzed on her fledgling romance with footballer Marcus Rashford\n\nHostess with the mostess! Queen Camilla appears in bright spirits as she meets Team GB equestrian stars at Clarence House\n\nVogue Williams reveals the huge secret she has kept from Spencer Matthews as they take on solo business projects\n\nScarlett Johansson makes rare mention of twin brother Hunter in candid interview\n\nKatherine Ryan blasts 'sad lineup' of 1,057 'f***ing losers' who queued up for hours to sleep with Bonnie Blue and demands: 'What's wrong with men?'\n\nKylie Jenner puts on a busty display while sipping wine in Aspen with pal Hailey Bieber\n\nAisleyne Horgan-Wallace proudly shows off her curves as she bares all in a naked photoshoot - after recalling her terrifying experience of 'almost dying' after Ozempic\n\nRHONY slammed over 'sick' rape storyline as Brynn Whitfield speaks out after fans demand she be fired\n\nZoe Saldana details overcoming personal struggles including the death of her father, bullying and living with ADHD and dyslexia\n\nHollyoaks star reveals she's QUIT the show after three years amid soaps' mass cast exodus - and her final scenes have already aired\n\nLove Island SPOILER: Ekin-Su and Curtis announce they've made things 'official' after just a week in the villa\n\nEXCLUSIVEFears for Hailey Bieber over 'loose cannon' Justin as it's claimed he can go days without speaking to her\n\nAmy Schumer reveals 'hookup' with MLB star: 'You know who you are'\n\nFans call out Blake Lively for 'mean girl' comments to Justin Baldoni while filming It Ends With Us\n\nJenny McCarthy and Donnie Wahlberg reveal secret to keeping 10-year marriage 'hot'\n\nJessica Alba looks single and ready to mingle amid divorce from Cash Warren on 'girls trip' in NYC\n\nInside Jessica Simpson's 'trust issues' after reports of Eric Johnson 'flirting with other women' surfaced\n\nReal Housewives Of Beverly Hills asks a famous lesbian to join the show after Kyle Richards clams up over female 'lover'\n\nJulia Garner reveals all she knows about the status of the Madonna movie she is supposed to star in\n\nBorrow that from Kylie? Timothee Chalamet carries another Chanel purse out in NYC\n\nEmmerdale fans call out glaring continuity error 'ruining' poignant graveyard scene - but can you spot it?\n\nAmy Schumer makes 'scary to say' sex confession on Call Her Daddy podcast: 'Nobody talks about it'\n\nBrooklyn Beckham follows in his father David's adventurous footsteps as he reveals he's eaten COD SPERM - and he's keen to tuck into raw chicken next\n\nStacey Solomon's nepo baby sons bag roles in Hollyoaks - following in the footsteps of their soap star stepdad Joe Swash\n\nCameron Diaz reveals the message of support that sparked her career U-turn after believing she 'would never act again' - as Vogue Mexico celebrate her return to cinema\n\nLouis Walsh admits he faked a plane crash to get Boyzone press and left the group 'scarred' by constantly leaking made up stories\n\nLuann de Lesseps, 59, of RHONY proves she can still rock a bikini after naming 'magic' diet\n\nKourtney Kardashian's husband Travis Barker seems influenced by her younger sister Kim in latest post\n\nMichelle Keegan's Brassic AXED after seven seasons on screens despite glowing reviews in crushing blow to fans\n\nLateysha Grace gives birth! Big Brother star welcomes a baby girl via C-section with her mystery fiancé - a year after she 'nearly died from ectopic pregnancy'\n\nLove Island's Montana Brown shares adorable first photo of her newborn and reveals little one's sweet name\n\nITV game show inspired by Squid Game branded 'dangerous' by contestant after three people sent to hospital during gruelling challenge\n\nThis Morning model reduced to tears live on catwalk by Ten Years Younger host Nikky Hambleton-Jones' dramatic transformation\n\nAngelina Jolie and Brad Pitt's daughter Shiloh, 18, attends dance class after parents finalized divorce\n\nPatsy Palmer tries to take her mind off of LA wildfires by playing dress-up with her EastEnders co-stars Bobby Brazier and Jessie Wallace\n\nAmanda Holden shares 'Beverly Hills Hotel' house update as she unveils place she keeps controversial BGT dresses - a year after moving into £7m abode\n\nControversial Good Morning Britain star announces return to show\n\nEXCLUSIVEHow Scarlett Johansson could earn eye-watering pay check to replace Hoda Kotb after impressing NBC bosses\n\nKyle Richards storms off RHOBH set after breaking fourth wall in tearful outburst\n\nThe new crime drama on Prime Video that's rocketing up the charts - and boasts a perfect 100% score on Rotten Tomatoes\n\nNetflix viewers rave over 'triumphant and special' crime series that's flying under the radar - and beg bosses for more episodes\n\nKate Lawler flashes her washboard abs in a khaki green bikini - after hitting back at cruel anorexia rumours\n\nThe deadline for The Traitors series four applications is just days away - here's how to audition for the BBC's next run\n\nEXCLUSIVELaurence Llewelyn-Bowen nearly DIED while filming Netflix show Bear Hunt after he was dragged underwater during freak river accident\n\nAddison Rae sizzles in a floral bikini as she makes rare comments about 'cheating' ex Bryce Hall\n\n'You could be free with your sexuality and no one batted an eyelid': Spandau Ballet's Martin Kemp recalls 1980s nightclub as he says 'that was one of the loveliest things'\n\nOzark's Jason Bateman, 56, shares a joke with his daughter Francesca Nora, 18, as the pair lead the stars at LA Lakers game\n\nEXCLUSIVELove Island: All Star Luca Bish's breakdown was 'upsetting' for his family who defend his 'You've not put enough girls in here for me' remark\n\nI starred in ITV's Benidorm - here's how much I actually got paid after filming for months on end abroad\n\nCheryl Burke reveals how abuse at age 9 made her 'hate myself' which led to train-wreck romances\n\nParis and Tyson Fury look happier than ever as they pose in front of the Eiffel Tower during a family holiday to the French capital with their seven children\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"The penultimate episode of The Traitors ended with the show's most dramatic cliffhanger yet, as Francesca Rowan-Plowden was given the biggest power in the series' history.","url":"https://www.dailymail.co.uk/tv/article-14319661/The-Traitors-fans-left-shaking-huge-cliffhanger.html","image":"https://i.dailymail.co.uk/1s/2025/01/24/00/94458831-0-image-m-22_1737677097560.jpg","video":null,"publish_date":"2025-01-24 00:07:10","author":"Editor,Laura Fox","authors":["Editor","Laura Fox"],"language":"en","source_country":"gb","sentiment":-0.159},{"id":283278656,"title":"Trump waves off Musk critique of AI data centre project","text":"Camera IconPresident Donald Trump says Elon Musk hates one of the people involved in the announced AI project. (AP PHOTO) Credit: AAP\n\nTrump waves off Musk critique of AI data centre project\n\nStaff WritersReutersJanuary 24, 2025 8:06AM","summary":"Criticism of a newly announced AI project by Trump ally Elon Musk doesn't bother the US president, who says the billionaire hates one of the people involved.","url":"https://www.perthnow.com.au/politics/trump-waves-off-musk-critique-of-ai-data-centre-project-c-17490549","image":"https://images.perthnow.com.au/publication/C-17490549/e1653a8479362ea93c2682bcc613633e277f0526-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-24 00:06:21","author":"Staff Writers","authors":["Staff Writers"],"language":"en","source_country":"AU","sentiment":-0.507},{"id":283285064,"title":"Trump waves off Musk critique of AI data centre project","text":"US President Donald Trump has dismissed criticism from close ally Elon Musk about a $US500 billion ($A800 billion) artificial intelligence project that Trump announced with great fanfare at the White House earlier this week.\n\nTrump announced on Tuesday that ChatGPT's creator OpenAI, SoftBank, and Oracle are planning a joint venture called Stargate, which he said will build data centres and create more than 100,000 jobs in the United States.\n\nSoftBank CEO Masayoshi Son, OpenAI CEO Sam Altman and Oracle Chairman Larry Ellison joined Trump at the White House for the launch.\n\nMusk, the Tesla CEO and the world's richest man who has become a close adviser to Trump, is a rival of Altman and is in an ongoing lawsuit with OpenAI.\n\nIn a post on X on Wednesday, Musk doubted the group can put together the funding for the project.\n\n\"They don't actually have the money,\" Musk said. \"SoftBank has well under $10B secured. I have that on good authority.\"\n\nTrump, taking questions from reporters at the White House on Thursday, was asked if Musk's criticism of the AI deal bothered him.\n\n\"It doesn't. He hates one of the people in the deal,\" Trump said of Musk. \"People in the deal are very, very smart people. But, Elon, one of the people he happens to hate. I have certain hatreds of people, too.\"\n\nAs for Musk's claims about insufficient funding, Trump said: \"I don't know if they do, but you know, they're putting up the money. The government's not putting up anything, they're putting up money. They're very rich people, so I hope they do.\"\n\nA Trump adviser wondered whether the incident would lead to a split between Trump and Musk, who is leading Trump's government efficiency project.\n\n\"The end may be in sight,\" the adviser said.","summary":"Criticism of a newly announced AI project by Trump ally Elon Musk doesn't bother the US president, who says the billionaire hates one of the people involved.","url":"https://thewest.com.au/politics/trump-waves-off-musk-critique-of-ai-data-centre-project-c-17490548","image":"https://images.thewest.com.au/publication/C-17490548/e1653a8479362ea93c2682bcc613633e277f0526-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-24 00:06:20","author":"Staff Writers","authors":["Staff Writers"],"language":"en","source_country":"au","sentiment":-0.206},{"id":283283550,"title":"Warnings of 'tornado-like' winds in some areas as Storm Éowyn set to make landfall","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSports meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nFILE IMAGE: Stormy weather in Tramore, Waterford in November 2022.Alamy Stock Photo\n\nThe Morning Lead\n\nWarnings of 'tornado-like' winds in some areas as Storm Éowyn set to make landfall \n\nSchools, creches are set to close and people have been urged to work from home. \n\n12.06am, 24 Jan 2025\n\nShare options\n\nSTATUS RED WIND warnings are due to come into effect for all of Ireland this morning, as Storm Éowyn makes landfall. \n\nSchools, creches are set to close and people have been urged to work from home. \n\nMet Éireann has advised that people need to ‘shelter in place’ for the extent of the Status Red wind warning.\n\nAdvertisement\n\nThe national forecaster had warned of a “danger to life” due to the high winds, which gale to storm force winds expected to bring severe, damaging and extremely destructive gusts. \n\nAuthorities have also warned of fallen electricity lines, damaged infrastructure and widespread power outages.\n\n‘In the firing line’\n\nMet Éireann head forecaster Eoin Sherlock has said that some counties, such as those in the Midlands, will not have seen these kinds of wind speeds before.\n\nThe storm is like a “spinning top,” he said. Having initially formed off the coast of the US, it moved across the Atlantic at speed by a jet stream.\n\n“It’s got incredible intensity and we’re in the firing line,” Sherlock said.\n\nRelated Reads\n\nStay safe: Here's how to prepare yourself and your home for Storm Éowyn\n\nSherlock explained that there is also a risk of “some tornado-like activity”, adding that it was something the weather service and other authorities would be “keeping an eye on”.\n\nNote: We’ll be liveblogging from this article from 6am on Friday and throughout the day. You can find Thursday’s live updates here.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nAndrew Walsh\n\nView 6 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Warnings of 'tornado-like' winds in some areas as Storm Éowyn set to make landfall ”.\n\nRecipient's Email\n\nFeedback on “Warnings of 'tornado-like' winds in some areas as Storm Éowyn set to make landfall ”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nStorm Éowyn\nthe morning lead\n\nNews in 60 seconds\n\nExecutive Order\nDonald Trump orders JFK and Martin Luther King Jr assassination documents declassified\n\nWitness heard 'loud thud' in Kildare assault as man's head was 'kicked like a football', jury told\n\nSackler family, owners of Purdue Pharma, reach $7.4 billion settlement over US opioid crisis\n\nWorld Economic Forum\nTrump criticises EU regulations and tells businesses to build in the US or 'pay tariffs'\n\nHere's what happened today: Thursday\n\nAs it happened\nPresident appoints new Government and delivers seals of office to new senior ministers\n\nbread alert\nShoppers urged not to 'panic buy' as bread aisles clear out ahead of Status Red storm\n\nAs it happened\nPresident appoints new Government and delivers seals of office to new senior ministers\n\nAs it happened\nPublic advised to shelter in place during 'damaging, destructive and dangerous' storm\n\nStorm Éowyn: UK Met Office issues rare Status Red warning for six counties in north of Ireland\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"Schools, creches are set to close and people have been urged to work from home.","url":"https://www.thejournal.ie/storm-eowyn-batters-ireland-tornado-winds-status-red-warning-6602962-Jan2025/","image":"https://img2.thejournal.ie/article/6602962/river/?height=400&version=6603266","video":null,"publish_date":"2025-01-24 00:05:28","author":null,"language":"en","source_country":"ie","sentiment":-0.017},{"id":283282190,"title":"'Bravery' of Southport girls and calls for justice reform","text":"US President Donald Trump has called on oil producers' group Opec to bring down global prices in order to put pressure on Russia to end the war in Ukraine, the Financial Times reports. It quotes from an address Trump delivered by video to the World Economic Forum in Davos on Thursday in which he said: \"Right now the price is high enough that that war will continue. You gotta bring down the oil price. That will end that war. You could end that war.\" The paper says he also called on central banks around the world to follow the US in lowering their interest rates.","summary":"Reactions to the 52-year jail sentence handed to Southport killer Axel Rudakubana lead the papers.","url":"https://www.bbc.com/news/articles/ceq97lyw023o","image":"https://ichef.bbci.co.uk/news/1024/branded_news/d706/live/954574f0-d9e5-11ef-902e-cf9b84dc1357.png","video":null,"publish_date":"2025-01-24 00:04:42","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.313},{"id":283278352,"title":"What ideology means to Trump and his team in the US’ competition with China","text":"From race to gender to religion, the second administration of US President Donald Trump is certain to reverse the ideological direction on a wide range of issues set by his predecessor, Joe Biden. But there is one thing the two teams share – a deepening disregard for China’s political ideology.\nTrump is not known to have strong ideological positions, but experts say his team is expected to use ideology as a tool in its strategies with China – priorities could lead to new sources of friction with Beijing.\nWhile Biden’s cabinet focused attention on the LGBTQ community, women’s rights and the political values it shared with allies, Trump’s administration is expected to use a more unilateral approach to refocus on religious freedoms in China, and the legitimacy the country’s ruling Communist Party, they say.\nFei-Ling Wang, a professor at the Sam Nunn School of International Affairs at the Georgia Institute of Technology, said he expected the ideological conflict between the United States and China to “persist” during Trump 2.0. But it would also shift.\n“Compared to the Biden administration and Trump’s first administration, we may see more inflammatory rhetoric and highly symbolic gestures, but less talk about human rights in places such as Xinjiang and Hong Kong,” he said.\n“The new Trump administration may be more focused on policies targeting the Communist Party’s power and legitimacy at home and abroad, in a Cold War-like, anti-communism fashion.”\n\nAs he reflected on his presidency in his farewell address on January 15, Biden said the United States had “pulled ahead in our competition with China”, and that “as the land of liberty, America – not China – must lead the world in the development of AI”.\nThe assessment echoed the rhetoric of the previous four years in which the Democratic Party repeatedly framed the competition with the world’s second-largest economy as “democracy versus authoritarianism”, and doubled down on its “small yard, high fence” policy to contain Beijing’s hi-tech development.\nDuring that term, the administration held three democracy summits to combat authoritarianism, all of which excluded China. For Beijing, the message was clear support for regime change. After the 2021 summit, Beijing said the US had a history of imposing its political values and instigating “colour revolutions”.\nBut Trump is not driven by ideology, according to Yun Sun, a senior fellow and co-director of the East Asia Programme and director of the China Programme at the Stimson Centre, an American think tank in Washington.\n“His team might be. But for him, ideology is an instrument rather than the policy goal. He might allow his team to use ideology to press China, but he personally does not have that aspiration.”\nInstead, Trump’s main focus would be on economic benefits, said Wu Xinbo, dean of the Institute of International Studies at Fudan University in Shanghai.\n“However, if the economic dealings don’t go smoothly, and relations with China worsen, he might allow national security and ideological hawks to take the lead in shaping his China policy,” said Wu, who is also director at the Centre for American Studies at Fudan University.\nA precedent was set in Trump’s first term. As US-China relations worsened during the Covid-19 pandemic years, Trump’s officials repeatedly targeted China’s Communist Party in official statements, a move seen by Beijing as advocating regime change.\nAccording to experts, the hawkish senior officials in Trump’s second administration are likely to recycle these critical narratives of Beijing in service of Trump’s strategic goals.\n“Trump wants to create pain for Beijing as a negotiating tactic to achieve a better deal for the American economy,” said Neil Thomas, a fellow for Chinese politics at the Asia Society Policy Institute’s Centre for China Analysis.\n“But [US Secretary of State] Marco Rubio’s anti-communist credentials mean the day-to-day diplomacy of the State Department towards China could become more adversarial and less attentive to consultation and dialogue.”\n\nSuch views could be heard loud and clear during the confirmation hearings of Trump’s cabinet picks.\nRubio, a long-time China hawk, has consistently opposed Beijing’s policies and co-sponsored several US acts targeting alleged human rights abuses, earning him a spot on China’s sanctions list since 2020.\nDuring his confirmation hearing on January 15, Rubio sharply criticised China’s global ambitions, accused Beijing of violating Hong Kong’s autonomy, and laid out his concerns about China’s “aggressive” naval activities in the South China Sea as well as its human rights record in Xinjiang. He stressed the need to reduce US dependence on China and support Taiwan’s participation in international organisations.\nIn a similar vein, John Ratcliffe, Trump’s nominee for CIA director, pledged in his hearing on January 14 to intensify the agency’s focus on China and cybersecurity threats, calling Beijing a “key threat” in a “once-in-a-generation challenge”.\nThe same day, Pete Hegseth, nominated for secretary of defence, informed the US Congress that he would make certain the Pentagon prioritised the Communist Party as “front and centre” among foreign threats to the US.\nIn Rubio’s case, he was “obligated to serve Trump’s strategic goals”, which could mean compromising “his principles and [becoming] a pawn for Trump to maximise Trump’s interests while competing with China”, according to Jinghao Zhou, an associate professor of Asian studies at Hobart and William Smith Colleges.\nPeter T.C. Chang, a visiting senior fellow with the ISEAS–Yusof Ishak Institute in Singapore, said the dynamic between Trump and his hawkish subordinates could lead to “an administration marked by conflicting stances”.\n\nFor decades, Beijing has been wary of Washington as a catalyst for protests and potential regime change in developing nations. The deep-seated suspicions have driven decision makers in China to strictly contain the spread of Western political ideas such as “woke” culture and the #MeToo movement, believing they have been used as channels to infiltrate and subvert Chinese society. The authorities have cracked down on human rights lawyers, labour activists, feminists and LGBTQ groups for having connections with “foreign forces”.\nRemarks by Biden officials may have heightened Beijing’s fears.\nWhen Chinese internet regulators shut down more than a dozen LGBT WeChat accounts in 2021, the move immediately drew criticism from the US State Department, which argued that the groups had been “exercising their right to freedom of expression and freedom of speech”.\nTwo years later, the Biden administration unnerved Chinese nationalists when then US treasury secretary Janet Yellen hosted a lunch with women economists during her visit to Beijing. The diverse cabinet showcase and display of empowered women did not go over well with many in China, who labelled the attendees as “radical feminists” and “traitors”.\nThomas, from the Asia Society, said Trump was not expected to take the same tack.\n“Trump sees human rights as a much lower priority for US foreign policy than many of his cabinet nominees, a situation that is likely to create policy tensions and personal frustrations within the new administration,” Thomas said.\nChina observer Andrew Nathan, a Columbia University professor of political science, agreed, saying that he did not think that labour rights, freedom of speech or political repression, “will figure in Trump’s China policy”.\nWang, from Georgia Tech, suggested that the new administration would continue to target rights issues – but not the same ones as the Biden White House.\n“While the Trump administration may tune down criticisms against Beijing on issues related to human rights for LGBTQ, women and ethnic minorities, it is expected to continue, even enhance, US criticisms of China on the rights and freedom of religious groups such as ‘underground’ churches, and religious sects such as the Falun Gong,” Wang said.\nNathan added that for US foreign policy, upholding religious freedom also meant “opposition to the attacks on Tibetan Buddhism and on Muslim communities in China”.\nChina officially recognises five religions: Buddhism, Taoism, Islam, Protestantism and Catholicism. Falun Gong has been deemed a cult by Beijing. According to the 2020 World Religion Database, around 7.4 per cent of Chinese identify as Christians.\nUnder President Xi Jinping, China has intensified its control over religions, particularly Islam and Christianity, through the “Sinicisation of religion” policy, which aims to strengthen national security and curb “foreign influence”.\nWu, from Fudan University, said “religious right-wing figures” within the Republican Party would bring up the religious freedom issue, creating ideological tension points, but they were not likely to hold democracy summits like the Biden administration.\nUnder Trump’s first term, many of his senior officials, including former vice-president Mike Pence and former secretary of state Mike Pompeo went on at length about what they said was Chinese religious oppression, especially in the far-west region of Xinjiang, ultimately imposing sanctions on individual Chinese officials, including then Politburo member and Xinjiang party chief Chen Quanguo – the most senior Chinese official ever to land on a US sanctions list.\nChina hit back with its own sanctions against a wide range of US politicians, including multiple members of the US Senate and the House of Representatives. But Sam Brownback, ambassador-at-large for international religious freedom in Trump’s first term, who repeatedly accused the Chinese government of being “at war with faith”, was the only Trump administration official to be sanctioned.\nBrownback was also vocal on Tibet and in 2019 asked the United Nations to take up the succession issue of the 14th Dalai Lama, Tibetan Buddhism’s spiritual leader, to stop China from trying to hand-pick his successor.\n\nTrump’s new administration and Beijing are likely to differ sharply in terms of governance philosophies as well as international collaborations – a gulf that could shape the ideological landscape between the two superpowers in a way that creates two spheres of influence, according to analysts.\nSuch a shift has been reflected in the approach of Argentina’s two most recent presidents.\nAlberto Fernandez, who was president from 2019 to 2023, was a left-leaning leader who engaged deeply with Brics countries and even paid tribute at the Chairman Mao Memorial Hall during his visit to China in 2022.\nThe current president, Javier Milei, has embraced cryptocurrency, deregulation and a free-market approach that has resonated with Trump’s own pro-market sentiments.\nGeorgia Tech’s Wang said Trump and tech billionaire Elon Musk “certainly will strengthen the right-turn trend of privatisation and decentralisation worldwide”.\nMilei attended Trump’s inauguration on Monday – a break from the tradition of foreign heads of state not attending such events.\nThe invitation to attend was “a symbolic gesture of Trump’s personality-driven diplomacy, aimed at promoting his domestic agenda in support of deregulation and free-market policies among his base”, Zhou said. “This could potentially challenge China’s state-controlled model and reshape international alliances.”\nStill, Zhou said, Trump’s main focus remained protecting US interests in competition with China, against the backdrop of an age-old rivalry between command and market economies, a dynamic that could lead to “hybrid approaches” in some countries.\nWu argued that the US’ small government and China’s state-controlled governance models should be interpreted as a reflection of different “values”, instead of “confrontational ideologies”.\nWhile both countries could decide what was in its own best interest, the decision would not directly influence bilateral relations, he said.\nBut Wu, at Fudan, said the Trump administration’s values on global governance – and especially Washington’s promotion of deglobalisation, unilateralism and “America first” – were contradictory to China’s public positions on global governance, multilateralism and international cooperation.\nAnother area of potential ideological conflict lies within environmental policies. Experts have warned that the US may lose its global leadership in the arena due to Trump’s dismissal of the climate change consensus. And a Trump withdrawal of the US from the Paris Agreement could create a “vacuum” in which China could assume a larger role in the global battle against climate change.","summary":"Less talk about human rights and a continuing divergence of political ideologies could create two global spheres of influence, analysts say.","url":"https://www.scmp.com/news/china/politics/article/3296008/what-ideology-means-trump-and-his-team-us-competition-china","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/23/0be4deda-d412-460d-8f02-a30fae79df65_d7d773ed.jpg","video":null,"publish_date":"2025-01-24 00:00:18","author":"Xinlu Liang","authors":["Xinlu Liang"],"language":"en","source_country":"cn","sentiment":0.033},{"id":283282554,"title":"Belgian broadcaster sparks debate by delaying Trump’s speech","text":"RTBF delays broadcast over concerns about Trump’s past remarks\nBelgium’s French-speaking broadcaster, RTBF, has found itself at the centre of a heated discussion after deciding to delay the live airing of Donald Trump’s inaugural speech. The decision, according to RTBF’s deputy editorial director Aurélie Didier, was made to give their team time to review and analyse the speech for potential content they deemed racist, xenophobic, or hateful.\n\n“We’ve observed instances in the past where Donald Trump made comments that could incite hatred or spread misinformation,” Didier explained during an interview with Ciné-Télé-Revue. “Delaying the speech gave us time to contextualise and ensure that such rhetoric isn’t normalised. This isn’t about censorship; it’s about responsibility.”\n\nRTBF said it relied on expert analysis to assess Trump’s comments, including claims he made about migrants and his ongoing denial of the 2020 US election results.\n\nBacklash Over ‘Censorship’ allegations\n\nNot everyone supported RTBF’s decision. Georges-Louis Bouchez, leader of Belgium’s Liberal MR Party, accused the broadcaster of acting as a ‘censorship board.’ Taking to X, he wrote: “It’s not the job of a public broadcaster to decide what people can and cannot hear. RTBF is overstepping its role.”\n\nBouchez also called for a review of the public broadcaster’s state subsidies, arguing that its actions raised questions about impartiality. “The time for unchecked funding is over,” he stated.\n\nThe criticism didn’t stop there. Investigative journalist Alessandra d’Angelo labelled RTBF’s approach as a symptom of what she called “woke overreach,” while former politician Drieu Godefridi likened their methods to state-controlled media, saying, “Are Belgians really so incapable of forming their own opinions?”\n\nRTBF stands its ground\n\nDespite the backlash, RTBF defended its decision, emphasising the need for editorial discretion when dealing with contentious figures. Didier stated, “We’re not pro or anti-Trump. Our role is to present the facts responsibly. Highlighting his strengths doesn’t mean we should ignore his more divisive remarks.”\n\nThe move has sparked a broader debate about freedom of speech, media responsibility, and the boundaries of journalistic discretion. While some view RTBF’s actions as a thoughtful approach to prevent misinformation, others see it as a troubling precedent for how public broadcasters handle democratically elected leaders.\n\nFind more news about Belgium","summary":"RTBF delays broadcast over concerns about Trump’s past remarks Belgium’s French-speaking broadcaster, RTBF, has found itself at the centre of [&#8230;]","url":"https://euroweeklynews.com/2025/01/24/belgian-broadcaster-sparks-debate-by-delaying-trumps-speech/","image":"https://cdn.euroweeklynews.com/wp-content/uploads/2025/01/donald-trump-2.jpg","video":null,"publish_date":"2025-01-24 00:00:11","author":"Farah Mokrani","authors":["Farah Mokrani"],"language":"en","category":"politics","source_country":"es","sentiment":-0.049},{"id":283279078,"title":"Letters: Donald Trump’s presidency is a sign of a nation in decline","text":"Trump presidency a sign\nof a nation in decline\n\nRe: “Trump is sworn in, vows to end ‘America’s decline’” (Page A1, Jan. 21).\n\nThe Mercury News headline the day after the Inauguration quoting President Trump’s promise to “end America’s decline” is the irony of all ironies.\n\nHe’s a convicted felon, bringing an inner circle with absurdly obvious conflicts of interest and lack of experience to his administration, which perfectly illustrates our decline. Within hours he pardoned the Jan. 6 violent participants, repeated his threats of retribution against his perceived enemies, and openly admitted his plan to take back the Panama Canal by force.\n\nHis election is the perfect mascot for the decline of America.\n\nDavid Wilkins\n\nInvestors have created\nstate’s housing crisis\n\nI am sick of reading lies about the housing crisis here in California due to inadequate supply. The only “crisis” we have is one of avarice and selfishness due to the glut of ravenous investors who devour all available property before anyone else has a chance to buy.\n\nAfter the housing market tanked in 2008 banks refused to negotiate with struggling homeowners to adjust their mortgages because they knew there were hoards of investors ready to scoop up all the forfeited properties. Rampant, uncontrolled investing has decimated our housing market, with 35% of all single-family homes in this state investor-owned. Someone with a spine needs to put a stop to this carnage by mandating owner-occupied housing purchases only. And no foreign investors period.\n\nI can imagine the throngs of vultures currently salivating over the smoking ruins of L.A. The playing field needs to be leveled once and for all.\n\nT.A. Barbella\n\nTrump’s inaugural\nspeech is rambling mess\n\nI made the mistake of reading the text of Donald Trump’s inauguration address.\n\nIts disconnected rambling, ranting and whining is occasionally interrupted by a few words of optimism and aspiration. However, on balance, that address provided strong evidence that its authors and the speaker have extreme difficulty defining a direction and even greater difficulty sticking to a direction.\n\nThe speech also includes a number of truly bizarre positions that will have psychiatrists all over the world stroking their beards.\n\nIt is sad that a plurality of Americans hired this man when no sensible and responsible employer would have done so after reading this person’s application essay.\n\nBut the most inane paragraph has to be: “But first, we must be honest about the challenges we face. While they are plentiful, they will be annihilated by this great momentum that the world is now witnessing in the United States of America.”\n\nGeorge Licina\n\nStart of Trump’s term is\nMAGA thumb in the eye\n\nRe: “Trump issues sweeping pardon of Jan. 6 rioters” (Page A4, Jan. 21 ).\n\nDonald Trump’s pardoning of Jan. 6 “hostages” created a ready-made, and expanding loyal militia. Hitler had his SS, Mussolini his black shirts, the Ottoman ruler his Janissary, Putin has his Wagner Group, all military groups sworn to protect the ruler.\n\nI question why the Drill Baby Drill hyperbole when we outproduce every country in the world. Trump will try to kill Joe Biden’s climate warming programs by ending electric car support and leaving the Paris Accord. I anticipate moves against Social Security and Medicare in an effort to save enough money to fund an extension of the tax cuts for the super-wealthy.\n\nSeeing Google, Tesla, Meta and the Washington Post all bow to the emperor, and ABC’s court capitulation and payment of $15 million to finance Trump’s campaigns, has shaken many. I was hoping for some opposition, but it won’t come from the Republican rank and file. MAGA is riding high.\n\nDavid Eisbach\n\nTrump as peacemaker\nis wishful thinking\n\nRe: “Gaza truce reflects on ‘shining city on a hill’” (Page A6, Jan. 22).\n\nThe perspective taken by Mr. Mostamandy that Donald Trump was responsible for the Gaza peace agreement sounds straight out of social media fantasyland, the notion that world leaders fear the most gullible president they’ve known. Remember the United Nations laughed at Trump 45 when his boasting balloon didn’t fly.\n\nIt was President Biden who made an astute choice to include the new administration on the negotiating team to present a united U.S. front. That’s Joe Biden at his best. Months of hard negotiating and battlefield results led to a temporary agreement.\n\nAllen Price","summary":"Also: Created crisis &#124; Trump's rant &#124; Thumb in eye &#124; Wishful thinking. Mercury News reader letters to the editor for Jan. 24, 2025.","url":"https://www.mercurynews.com/2025/01/23/letters-trumps-presidency-sign-nation-decline-1976/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/Trump_Inauguration_05898.jpg?w=1024&h=682","video":null,"publish_date":"2025-01-24 00:00:10","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":283276346,"title":"MAGA Rep Wants to Rewrite Constitution to Give Donald Trump a Third Term","text":"Skip to Main Content\n\nNewsletters\n\nCSCHEAT SHEET\nNEWSLETTERS\n\nCheat Sheet\n\nManage Newsletters\nSubscription Offers\n\nMAGA Rep Wants to Rewrite Constitution to Give Donald Trump a Third Term\n\nThe proposed change to the 22nd Amendment would allow a president to serve three terms.\n\nJulia Ornedo \n\nPublished Jan. 23 2025 7:00PM EST \n\nReuters/Getty Images \n\nJulia Ornedo\n\nGot a tip? Send it to The Daily Beast here.\nTrending Now\n\nPoliticsMeteorologist Who Called Out Musk’s ‘Nazi’ Salute Gets Shown the Door\n\nWilliam Vaillancourt\n\nPoliticsTrump Calls for MSNBC to Be Shut Down in Nighttime Rant\n\nJanna Brancolini\n\nPoliticsADL Changes Its Tune on Elon Musk Amid Salute Backlash\n\nEmell Derra Adolphus\n\nPoliticsMeghan McCain Fuels Obama Divorce Rumors\n\nGrace Harrington\n\nTrumplandElon Musk’s Daughter Vivian Weighs in on His Evocative Hand Gesture\n\nJosh Fiallo\n\nTrending Now\n\nPoliticsMeteorologist Who Called Out Musk’s ‘Nazi’ Salute Gets Shown the Door\n\nWilliam Vaillancourt\n\nPoliticsTrump Calls for MSNBC to Be Shut Down in Nighttime Rant\n\nJanna Brancolini\n\nPoliticsADL Changes Its Tune on Elon Musk Amid Salute Backlash\n\nEmell Derra Adolphus\n\nPoliticsMeghan McCain Fuels Obama Divorce Rumors\n\nGrace Harrington\n\nTrumplandElon Musk’s Daughter Vivian Weighs in on His Evocative Hand Gesture\n\nJosh Fiallo\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nBACK TO TOP ↑\n\nCheat Sheet\n\nSUBSCRIPTIONCROSSWORDNEWSLETTERSPODCASTS\n\nGET THE APP\n\nCode of Ethics & Standards\n\nTerms & conditions\nCopyright & Trademark\n\nCookie Settings\n© 2024 The Daily Beast Company LLC","summary":"Reuters/Getty ImagesMerely days into Trump 2.0, a Republican congressman already wants to set the stage for a third Trump presidency.\n\nTennessee Congressman Andy Ogles introduced Thursday a House Joint Resolution to amend the U.S. Constitution to allow a president to serve “for up to but no more than three terms.”\n\nThe proposed amendment reads: “No person shall be elected to the office of the President more than three times, nor be elected to any additional term after being elected to two consecutive terms, and no person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than twice.”\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/maga-rep-wants-to-rewrite-constitution-to-give-donald-trump-a-third-term/","image":"https://www.thedailybeast.com/resizer/v2/62TXIHFOVVAFLOLAHHTH3HKDMU.jpg?smart=true&auth=bd60d293b517b627b4a2b1806f9c61bf4eb709aeae2b16b1f9ede4ddfdd74363&width=1440&height=1080","video":null,"publish_date":"2025-01-24 00:00:01","author":"Julia Ornedo","authors":["Julia Ornedo"],"language":"en","category":"politics","source_country":"us","sentiment":-0.508},{"id":283274918,"title":"Can reforming BC Timber Sales fix timber shortage?","text":"An NDP government has had no small part in breaking B.C.’s forest industry, if you believe a number of industry observers and analysts. But can an NDP government now fix it?\n\nThe pledge to do so came from back-to-back resource conferences last week—the BC Resources Forum in Prince George and BC Truck Loggers Association Convention in Vancouver.\n\nDuring the recent provincial election, Premier David Eby pledged to work towards an assured harvest of 45 million cubic metres annually, which would be an improvement of the current harvest levels, and last week, his new Forests Minister Ravi Parmar announced the vehicle for trying to hit that target: A new task force tasked with reforming BC Timber Sales, which manages 20 per cent of the province’s allowable annual cut for Crown or public timber.\n\n“This is the most comprehensive review that the Ministry of Forests has been done,” Parmar said.\n\nAt last week’s Trucks Loggers Association Convention, Eby gave assurances the review would not be “just another study,” and hinted that B.C.’s stumpage system could be reformed.\n\nThe stumpage rates B.C. charges logging companies to harvest trees on Crown land is viewed by Americans as a subsidy, and B.C. governments have been loath to reform it, lest it give the Americans more ammunition to lobby for duties.\n\n“The elaborate process that we go through with BC Timber Sales to appease Americans on softwood lumber duties has absolutely not done that,” Eby said.\n\n“The process is not working for anybody,” he added. “The point of this is we’re going to replace it with something else.”\n\nB.C.’s forest sector faces a plethora of challenges, including current softwood lumber duties, a threat of additional 25-per-cent tariffs on lumber exports and metastasizing government rules and regulations that have increasingly restricted access to timber, the supply of which had already been reduced by past pine beetle infestations and wildfires.\n\nMore than a dozen sawmill and pulp mills have permanently shuttered in B.C. in the past four years, and in 2024, two forestry companies—Teal Jones and the San Group—were forced to file for creditor protection.\n\nAt the international level, B.C. lumber producers face the prospect of softwood lumber duties doubling next year, and there’s now the added fear of 25-per-cent tariffs being imposed by the Donald Trump administration.\n\n“The tariff risk is real,” said Derek Nighbor, president of the Forest Products Association of Canada (FPAC). “This could be recession-serious type stuff. We need every government to be looking at every option.”\n\nDomestically, the threat to B.C.’s struggling forest sector comes from federal and provincial policies that increasingly restrict access to the working forests.\n\n“On the federal side, I don’t want to hear anything more about strategies,” Nighbor said. “I want an action plan. We’ve studied this stuff to death. We know what needs to be done. Can we please just get on with it?”\n\nSince coming to power in 2017, the BC NDP has implemented a rash of new policies and regulations crimping the timber supply, including old growth harvesting moratoria, new forest landscape plans, ecosystem-based land management, increasing parks and protected areas, shared land-use decision-making with First Nations and caribou habitat protection plans.\n\nOn paper, the allowable annual cut (AAC) for B.C. is 60 million cubic metres, Domenico Iannindinardo, CEO of Strategic Natural Resources, said last week at a session on forestry at the BC Resources Forum—enough timber to load 1.3 million logging trucks. But of late, only 36 million cubic metres of that AAC has been harvested.\n\n“So, 42 per cent of what we thought was going to be harvested wasn’t,” Iannindinardo said.\n\nThe shrinkage in the timber supply has not only put sawmills out of business, but has also affected secondary manufacturing, such as pulp and paper mills.\n\n“Pulp and paper facilities rely heavily on the residuals from the sawmills,” said Bruce Eby, vice-president of pulp operations for Domtar, now a division of Paper Excellence. “It is totally impractical for pulp mills to whole-log chip a large percentage as wood and it’s cost prohibitive as well. So the pulp and paper business relies on a very health sawmill business.”\n\nSawmill and pulp mill closures are particularly devastating for smaller communities.\n\n“We’ve seen a lot of devastation in some of the communities in B.C., particularly up north here, and we have a lot of other communities that are sitting on pins and needles wondering if the facility that operates in their town might be next,” Nighbor said.\n\nIn an attempt to address some of concerns with access to fibre, Parmar last week announced a six-month review of BC Timber Sales. One of the goals of the review is to provide “predictable and reliable market access to fibre.”\n\nThe value-added sector will get particular attention. Parmar said his government aims to double the volume of timber sales dedicated to value-added manufacturing, from the current 10 per cent to 20 per cent—1.1 million cubic metres in 2025. The task force will also aim to strengthen partnerships with First Nations and communities.\n\nFirst Nations have become increasingly important partners in B.C.’s forest industry, as they gain more ownership of tenure.\n\nDallas Smith, acting chief of the Tlowitisis First Nation, noted that, in 2003, his people negotiated the first revenue sharing agreement on forestry, and since then more and more First Nations have acquired tenure.\n\n“On Vancouver Island, the nations I represent are now the biggest tenure holders on Vancouver Island,” Smith said, adding that this did not result in any job losses for loggers.\n\nUnderscoring the role First Nations are playing in the fibre supply, last week, the Lake Babine Nation signed an agreement with West Fraser Timber to supply its sawmill in Smithers with logs from a new First Nations woodland licence.\n\nZara Rabinovitch, vice-president of sustainability for the B.C. Council of Forest Industries (COFI), welcomed the NDP government’s pledge to establish a “minimum harvest—an actual harvest.” She said the challenge will be “sorting out what’s the right tenure in the right area of the province.”\n\nShe added fire risk mitigation, which includes pro-active measures like thinning and selective harvesting in and near inhabited areas—something that is now gaining some support at the community level—also may provide opportunities for increasing the fibre supply, if only for pulp and pellet mills.\n\n“I think there’s a real opportunity for us to check a lot of different boxes of things that need to be done for communities by trying to apply these different types of forest management,” she said.","summary":"Provincial government unveils plan to address access to timber as sector continues to struggle","url":"https://www.biv.com/news/resources-agriculture/can-reforming-bc-timber-sales-fix-timber-shortage-10122528","image":"https://www.vmcdn.ca/f/files/biv/forestry-forest-logs-xuwumomentgettyimages22.jpg","video":null,"publish_date":"2025-01-24 00:00:00","author":"Nelson Bennett","authors":["Nelson Bennett"],"language":"en","source_country":"ca","sentiment":-0.417},{"id":283278384,"title":"Japan Inflation Jumps to 3%, Giving Support to Rate-Hike Case","text":"The acceleration was consistent with earlier inflation data for Tokyo, where higher energy prices were the primary driver following the phasing out of gas and electricity subsidies. Nationally, energy prices climbed 10.1% in December.\n\nAn index excluding energy costs and fresh food prices advanced 2.4%, unchanged from the pace in November. \n\nThe solid inflation data support the case for the Bank of Japan to raise interest rates later on Friday, a move widely anticipated by markets and economists. Speculation of a January rate hike has intensified especially after the BOJ top brass pointed to positive developments regarding wage hikes, and markets kept relatively calm in the first days of US President Donald Trump’s second term. \n\nThe latest Bloomberg poll showed that around three quarters of economists forecast a rate increase later Friday, while overnight-indexed swaps have suggested a January rate hike is almost fully priced in.\n\nThe BOJ is also scheduled to release its quarterly economic outlook report at the end of Friday’s meeting, where officials are said to upgrade their underlying inflation forecast for this fiscal year and next. In October, the bank projected that inflation excluding fresh food and energy would rise 2% in the current fiscal year ending in March, and 1.9% in the following year.\n\nWhat Bloomberg Economics Says…\n\n“A solid pickup in the national CPI inflation due Friday – a few hours before the BOJ’s rate decision – would push the central bank to proceed with another rate hike in January.”\n\n— Taro Kimura, economist\n\nFor the full report, click here\n\n(Updates with more details from report.)","summary":"Japan’s key inflation gauge hit 3% for the first time in 16 months, underscoring the nation’s sustained price momentum just hours before the central bank is expected to hike rates for a third time under Governor Kazuo Ueda.","url":"https://financialpost.com/pmn/business-pmn/japan-inflation-jumps-to-3-giving-support-to-rate-hike-case","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/01/sustained-growth-japans-core-inflation-hit-3-for-the-first.jpg","video":null,"publish_date":"2025-01-23 23:58:32","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":0.026},{"id":283278336,"title":"JFK’s grandson sends strong message to Trump following choice to publish secret files on Kennedy assassination","text":"Jack Schlossberg issued a harsh rebuke to Donald Trump after his order to declassify all remaining documents about the 1963 murder of Schlossberg’s grandfather, former President John F. Kennedy. \n\nThe last secret files about the assassination of Kennedy can now be published after President Trump on Thursday ordered the declassification of all remaining documents about the 1963 murder.\n\nSchlossberg, JFK’s only grandson and a social media darling, took to X to furiously criticize the files’ release and the hype over the information finally coming out. \n\n‘The truth is a lot sadder than the myth — a tragedy that didn’t need to happen,’ Schlossberg wrote Thursday. \n\nThe liberal journalist and lawyer then criticized President Trump for using his grandfather’s death to score political points. \n\n‘Not part of an inevitable grand scheme. Declassification is using JFK as a political prop, when he’s not here to punch back. There’s nothing heroic about it.’\n\nConspiracy theories – which is how Schlossberg labeled what those interested in the files wanted to find out about – continue to swirl 60 years after the killing. \n\nAny new information will excite the amateur sleuths who continue to wonder whether there is more to the story than just a lone gunman in the shape of Lee Harvey Oswald.\n\nTrump signed an executive order that directs his Director of National Intelligence to put together a plan within 15 days for the full release of documents about the JFK assassination.\n\n‘That’s a big one, huh?’ he said as he scrawled his signature on the order, before asking that the pen be given to RFK Jr. ‘A lot of people are waiting for this for a long … for years, for decades.\n\n‘Everything will be revealed.’ \n\nThe executive order, obtained by DailyMail.com, said: ‘More than 50 years after the assassinations of President John F. Kennedy, Senator Robert F. Kennedy, and the Reverend Dr. Martin Luther King, Jr., the Federal Government has not released to the public all of its records related to those events.\n\n‘Their families and the American people deserve transparency and truth. It is in the national interest to finally release all records related to these assassinations without delay.’\n\nHis intelligence chiefs will have 45 days to put together a plan to release the RFK and King archives. \n\nMillions of pages of JFK documents have already been released leaving only a few thousand kept in the archives. \n\nThe most recent releases included CIA cables and memos recording visits by Oswald to the Cuban and Soviet embassies in Mexico City weeks before the assassination.\n\nAnd experts doubt there are any major revelations lurking in the archives that would change the accepted version of events.\n\nTrump promised during his reelection campaign that he would declassify remaining government records surrounding the assassination. \n\nHe made a similar promise in his first term but gave way to the CIA and FBI who argued that some documents should be kept from the public for fear they would reveal national security secrets.\n\nTrump teased his plan during his Fox News interview with Sean Hannity on Wednesday evening. \n\n‘I’m going to release them immediately,’ he said. \n\n‘We’re going to see the information. We are looking at it right now.’ \n\nTrump said he was persuaded by Mike Pompeo, his former CIA director, not to release them during his first term.\n\n‘I was actually asked by Mike Pompeo, secretary of State, not to, and I felt he knew something that maybe, you know , when he asked you not to, you sort of say “why?” and he felt that it was not a good time to release them,’ Trump said. \n\nThe hidden records allowed conspiracy theorists the freedom to speculate on what might be hidden. \n\nWas Oswald in the pay of the Cubans or Soviets? Was he a patsy? Why did nightclub owner Jack Ruby shoot him dead live on TV.\n\nThe new executive order, signed by Trump in the Oval Office, says: ‘I have now determined that the continued redaction and withholding of information from records pertaining to the assassination of President John F. Kennedy is not consistent with the public interest and the release of these records is long overdue.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nJack Schlossberg issued a harsh rebuke to Donald Trump after his order&#8230;\n\n\nThis Post: JFK&#8217;s grandson sends strong message to Trump following choice to publish secret files on Kennedy assassination first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/jfks-grandson-sends-strong-message-to-trump-following-choice-to-publish-secret-files-on-kennedy-assassination/","image":"https://i.dailymail.co.uk/1s/2025/01/23/23/94456999-14319473-Jack_Schlossberg_tried_to_pour_cold_water_on_Donald_Trump_s_orde-a-1_1737675099968.jpg","video":null,"publish_date":"2025-01-23 23:56:36","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.209},{"id":283285226,"title":"Questions loom as Trump's sweeping DEI cuts hit federal agencies in Chicago","text":"Federal employees were left wondering what would be affected by President Donald Trump’s sweeping cuts to federal DEI programs Thursday, including workers at the Environmental Protection Agency and the Chicago-based Railroad Retirement Board.\n\nIt comes after Trump signed an executive order ending federal diversity, equity and inclusion programs, which he and conservatives have said are discriminatory and “undermine national unity.”\n\nLetters sent to federal agencies by the Office of Personnel Management outlined plans to layoff all DEI employees by Wednesday, and said reports on what staff and programs were affected, along with plans to enact the rest of the order, were to be sent to the Office of Personnel Management by Thursday. A source told the Sun-Times an unknown number of employees had been asked to leave the Railroad Retirement Board office at 844 N. Rush St. Wednesday afternoon.\n\nThe employees would be paid through their administrative leave until management moved to terminate them at an undetermined date. It also set out a system for employees to report anyone trying to hide connections to DEI programs in contracts or other official writing.\n\n“We are aware of efforts by some in government to disguise these programs by using coded or imprecise language,” states a letter to the Chicago-based Railroad Retirement Board obtained by the Sun-Times. “If you are aware of a change … to obscure the connection between the contract and DEIA or similar ideologies, please report all facts and circumstances to DEIAtruth@opm.gov within 10 days.”\n\nThe letter goes on to say failure to report the activity in a “timely” manner may result in “adverse consequences,” though the extent or details on those consequences were unknown.\n\nNicole Cantello — president of AFGE Local 704, a union representing 1,000 EPA workers in the Midwest — said there were many unknowns Thursday. She didn’t know still how many in her union would be affected, though she did say the process was heavily regimented, and could allow employees with seniority to remain in other positions depending on the circumstances. \n\nHowever, the Trump administration wants to put merit above all other measures, so the fate of those employees is still up in the air.\n\n“It’s very difficult right now to see exactly how it’s going to play out,” Cantello told the Sun-Times Thursday. “There will be lots of questions on what constitutes DEIA and what doesn’t.”\n\nAmong the remaining questions were how the EPA’s environmental justice programs, which bring federal resources to areas heavier hit by pollution, would be affected by the order. Federal employees in those programs were ordered to stop work Wednesday, but not given the same dismissals as other employees.\n\nLittle Village and Pilsen are both neighborhoods in which the EPA programs have focused on soil cleanups and air monitoring, among other measures. Cantello worried that important EPA online postings, such as those warning Chicagoans about lead in their drinking water, would be scrubbed off the internet in the same manner that the DEI sites were. As of Thursday afternoon, they remained.\n\n“We are deeply concerned about this,” Cantello said. “It’s going to severely affect how we approach communities.”\n\nBut what was certain to her was the Trump team’s planning, as guidance for federal agencies to carry out orders, arrived just a day after the order was signed, when Cantello said it sometimes took previous administrations months to do the same.\n\nShe also said measures requiring government workers to report attempts to disguise DEI activity were unnecessary because employees self-censor. When Trump took similar measures during his first term, federal employees “self-censored” presentations that could be perceived as DEI-related, rather than attempting to mask them. \n\n“It’s just unprecedented and shows a level of sophistication, planning and commitment that we haven’t seen before,” Cantello said. “This happened in the last Trump administration and it was shut down as soon as Trump said so. The federal workforce, in my view, will go overboard.”","url":"https://chicago.suntimes.com/politics/donald-trump/2025/01/23/donald-trump-dei-cuts-federal-agencies-chicago","image":"https://cst.brightspotcdn.com/dims4/default/ffbf94b/2147483647/strip/true/crop/5114x2919+0+247/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F03%2F6f%2F8ffef9154ce7937fb405013942c2%2Fap25","video":null,"publish_date":"2025-01-23 23:56:20","author":"Lynn Sweet,Violet Miller","authors":["Lynn Sweet","Violet Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.355},{"id":283275566,"title":"Trump tariff threat adds urgency for B.C. electricity, minister says","text":"British Columbia Energy Minister Adrian Dix says the looming threat of American tariffs raises the stakes for boosting the province’s energy independence.\n\nDix says there was urgency before the U.S. election last November, but “there’s more now” as American President Donald Trump threatens to impose 25 per cent tariffs on Canadian goods.\n\nThe minister was speaking at a news conference in Vancouver, where he announced the signing of an agreement between the Saulteau First Nations and BC Hydro to supply electricity from a 200-megawatt wind project in northeastern B.C.\n\nSaulteau First Nations holds a 51 per cent economic interest in the Taylor Wind project, which is expected to produce enough electricity to power about 60,000 homes.\n\nTaylor Wind is one of 10 clean-energy projects selected to advance from BC Hydro’s call for power last year, and Dix says it’s a “good step” on B.C.’s quest to become a world leader in renewables, while strengthening the province’s energy security.\n\nBut former B.C. environment minister Barry Penner, who’s now the chair for the Energy Futures Institute, says the province faces a significant gap between its current capacity and the electricity that will be needed to meet clean energy targets and demand from population growth.\n\n“I didn’t anticipate Donald Trump threatening tariffs, but I’ve been saying for more than a year now, it’s a risky proposition to be dependent on your neighbour to bail you out when you have an electricity crunch,” says Penner, adding utilities south of the border are facing their own challenges.\n\nB.C. has been a net importer of electricity over the last two years, he notes, with the purchase of about 20 per cent of its power from Alberta in 2023 and 2024.\n\n“That works out to about two Site C dams worth of electricity … in both of those years,” says Penner, referring to the mega-dam under construction in northeastern B.C.\n\nA prolonged drought in the province has added to the challenge, he says, forcing BC Hydro to hold water back in its dams to ensure there’s enough electricity during times of peak demand.\n\nSite C is expected to add about eight per cent more supply to B.C.’s electricity grid, though just as it’s coming online, Penner says older dams are being taken out of service for maintenance and repair work.\n\nThe 10 wind projects first announced last December are also expected to boost the province’s power supply by eight per cent, generating about 5,000 gigawatt hours of electricity each year.\n\nA statement from the Energy Ministry says electricity demand in B.C. is expected to increase by at least 15 per cent by 2030 due to population growth, housing construction, transportation and the shift away from fossil fuels.\n\nDix says he expects to see BC Hydro issue more calls for power, and the province is working to speed up the permitting process for renewable energy projects.\n\n“We have a growing and dynamic economy. We need this energy,” he says.","summary":"British Columbia Energy Minister Adrian Dix says the looming threat of American tariffs raises the stakes for boosting the province's energy independence.","url":"https://globalnews.ca/news/10975096/tariff-threat-bc-electricity/","image":"https://globalnews.ca/wp-content/uploads/2024/08/20240801170812-e3e73b52bfa009cb1a0640c350ffd4985ecba93717453590af9e17192b89e251.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-01-23 23:55:30","author":"Globalnews Digital,The Canadian Press","authors":["Globalnews Digital","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.208},{"id":283280896,"title":"Trump waves off criticism from Elon Musk on AI announcement","text":"WASHINGTON : U.S. President Donald Trump on Thursday dismissed criticism from close ally Elon Musk about a $500 billion artificial intelligence project that Trump announced with great fanfare at the White House earlier this week.\n\nTrump announced on Tuesday that ChatGPT's creator OpenAI, SoftBank, and Oracle are planning a joint venture called Stargate, which he said will build data centers and create more than 100,000 jobs in the United States.\n\nSoftBank CEO Masayoshi Son, OpenAI CEO Sam Altman and Oracle Chairman Larry Ellison joined Trump at the White House for the launch.\n\nMusk, the Tesla CEO and the world's richest man who has become a close adviser to Trump, is a rival of Altman and is in an ongoing lawsuit with OpenAI.\n\nIn a post on X on Wednesday, Musk doubted the group can put together the funding for the project.\n\n“They don’t actually have the money,” Musk said. \"SoftBank has well under $10B secured. I have that on good authority.”\n\nTrump, taking questions from reporters at the White House on Thursday, was asked if Musk's criticism of the AI deal bothered him.\n\n\"It doesn't. He hates one of the people in the deal,\" Trump said of Musk. \"People in the deal are very, very smart people. But, Elon, one of the people he happens to hate. I have certain hatreds of people, too.\"\n\nAs for Musk's claims about insufficient funding, Trump said: \"I don't know if they do, but you know, they’re putting up the money. The government’s not putting up anything, they’re putting up money. They’re very rich people, so I hope they do.”\n\nA Trump adviser wondered whether the incident would lead to a split between Trump and Musk, who is leading Trump's government efficiency project.\n\n\"The end may be in sight,\" the adviser said.\n\n (Reporting By Steve Holland, Trevor Hunnicutt and Nandita Bose; Editing by Stephen Coates)","summary":"","url":"https://www.channelnewsasia.com/business/trump-waves-criticism-elon-musk-ai-announcement-4893496","image":"https://dam.mediacorp.sg/image/upload/s--_uYuLCBS--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-23t235339z_1_lynxnpel0m0yb_rtroptp_3_usa-trump.jpg?itok=9Iz69T1N","video":null,"publish_date":"2025-01-23 23:53:39","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.172},{"id":283278500,"title":"Trump Orders Declassification of JFK, RFK, MLK Assassination Files | Capitol Report","text":"Jan-23-2025\n\nPresident Donald Trump is declassifying assassination files for the Kennedys and Martin Luther King Jr. Why is he making the move, and what else is in his new batch of executive orders?\n\nTrump also vows to appeal over his order about citizenship by birth. A judge blocks the plan as Republicans introduce a bill in support.","summary":"President Donald Trump is declassifying assassination files for the Kennedys and Martin Luther King Jr. Why is he making the move, and what else is in his new batch of executive orders? Trump also vows to appeal over his order about citizenship by birth. A judge blocks the plan as Republicans introduce a bill in [&#8230;]","url":"https://www.theepochtimes.com/epochtv/title-capitol-report-5797984","image":"https://img.theepochtimes.com/assets/uploads/2025/01/24/id5798031-Captiol_0123_v1.jpg","video":null,"publish_date":"2025-01-23 23:53:30","author":"Steve Lance","authors":["Steve Lance"],"language":"en","category":"politics","source_country":"us","sentiment":-0.016},{"id":283280890,"title":"COP30 chief praises China's 'extraordinary' climate progress","text":"Correa do Lago accused rich countries of trying to reduce their financial contributions to the global fight against climate warming, which he said was \"deeply wrong\" in view of their commitments under the 2015 Paris Agreement.\n\nAt the COP30 meeting in the Amazon city of Belem in November, Brazil will push developed countries to step up their support for the developing countries' energy transition.\n\n\"We have to work so that countries with historical responsibilities play a greater role in the financial aspect,\" he said.\n\nCorrea do Lago has represented Brazil at every international climate summit since President Luiz Inacio Lula da Silva returned to power in January 2023.\n\nHe was appointed COP30 president on Tuesday, a day after United States President Donald Trump pulled his country out of the Paris Agreement for a second time and doubled down on the use of fossil fuels.\n\nCorrea do Lago admitted that, without US support, financing the global transition to clean energy would be \"more difficult\".","summary":"","url":"https://www.channelnewsasia.com/world/cop30-chief-praises-china-climate-change-progress-us-paris-agreement-4893486","image":"https://dam.mediacorp.sg/image/upload/s--V30kqd-8--/c_crop,h_450,w_800,x_0,y_52/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-09t071347z_3_lynxmpel0805m_rtroptp_3","video":null,"publish_date":"2025-01-23 23:53:27","author":null,"language":"en","source_country":"sg","sentiment":-0.081},{"id":283282132,"title":"US Senate Confirms Trump Nominee John Ratcliffe As CIA Director","text":"The US Senate on Thursday confirmed John Ratcliffe with overwhelming bipartisan support as director of the CIA, filling a key post in President Donald Trump's national security team.The upper house of the US legislature voted 74-25 to approve Ratcliffe, who served as the director of national intelligence from 2020-2021 during Trump's first term in office.Ratcliffe said during his confirmation hearing last week that under his leadership, the agency would \"produce insightful, objective, all-source analysis, never allowing political or personal biases to cloud our judgment or infect our products.\"He also zeroed in on Beijing, saying the CIA needs to \"continue and increase in intensity the focus on the threats posed by China and its ruling Chinese Communist Party.\"(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");And he emphasized the importance of having the agency focus on technology as a target, saying that understanding adversaries' capabilities on that front \"is more important than ever.\"Ratcliffe, a former federal prosecutor, was a US representative for Texas from 2015-2020 -- a period in which he helped defend Trump during the first impeachment proceedings against him.Trump then appointed Ratcliffe to serve as the director of national intelligence, leading the US intelligence community and serving as the president's main advisor on that topic.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The US Senate on Thursday confirmed John Ratcliffe with overwhelming bipartisan support as director of the CIA, filling a key post in President Donald Trump's national security team.","url":"https://www.ndtv.com/world-news/us-senate-confirms-donald-trump-nominee-john-ratcliffe-as-cia-director-7545185","image":"https://c.ndtvimg.com/2024-11/hp6osaq_john-ratcliffe-reuters_625x300_15_November_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-01-23 23:52:36","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"in","sentiment":0.22},{"id":283280892,"title":"Meta seeks urgent fix to AI chatbot's confusion on name of US president","text":"NEW YORK : The inability of Meta's AI chatbot to identify the current president of the United States was elevated to urgent status by the Facebook owner this week, requiring a fast fix, a person familiar with the issue said.\n\nRepublican Donald Trump was inaugurated as president on Monday, succeeding Democrat Joe Biden. Yet on Thursday, the Meta AI chatbot was still saying that Biden was president, according to the source and to a Reuters test of the service.\n\nAsked by Reuters on Thursday to name the president, Meta AI replied:\n\n\"The current president of the United States is Joe Biden. However, according to the most recent information available, Donald Trump was sworn in as the president on January 20, 2025.\"\n\nThe issue prompted Meta to initiate an emergency procedure it uses to troubleshoot urgent problems with its services, known within the company as a SEV, or \"site event,\" according to the person familiar with the work.\n\nAsked to comment, Meta spokesperson Daniel Roberts said: \"Everyone knows the President of the United States is Donald Trump. All generative AI systems sometimes return outdated results, and we will continue to improve our features.”\n\nHe did not comment on what emergency procedures, if any, Meta had implemented.\n\nIt was at least the third emergency procedure Meta has experienced this week related to the U.S. presidential transition, the source told Reuters. \n\nThe incidents drew widespread complaints from social media watchers scrutinizing Meta's platforms for signs of politicized shifts after CEO Mark Zuckerberg appeared at Trump's inauguration on Monday and instituted a series of changes in recent weeks aimed at mending relations with the incoming administration.\n\nThose changes included scrapping its U.S. fact-checking program, elevating Republican Joel Kaplan as its new chief global affairs officer, electing a close friend of Trump's to its board and ending its diversity programs.\n\nIn one incident this week, Meta appeared to be forcing some users to re-follow the profiles of Trump, Vice President JD Vance and first lady Melania Trump on Facebook and Instagram, even after the users had unfollowed those accounts.\n\nThat issue cropped up during the company's normal practice of transferring official White House social media accounts to new control when a presidential administration changes, the company said on Wednesday.\n\nIn this case, an error occurred because the transfer process was prolonged and the system failed to log \"unfollow\" requests from users while it was under way, prompting a top priority SEV1, the person said.\n\nAnother emergency procedure involved an issue in which Meta's Instagram service blocked searches for the hashtags #Democrat and #Democrats for some users, while turning up results without issue for #Republican.\n\nA Meta spokesperson acknowledged the problem on Tuesday but said it affected \"people's ability to search for a number of different hashtags on Instagram - not just those on the left.\"","summary":"","url":"https://www.channelnewsasia.com/business/meta-seeks-urgent-fix-ai-chatbots-confusion-name-us-president-4893501","image":"https://dam.mediacorp.sg/image/upload/s---1bkKb6d--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-01-23t235113z_1_lynxnpel0m0ya_rtroptp_3_meta-openai.jpg?itok=C0LVgl","video":null,"publish_date":"2025-01-23 23:51:13","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.424},{"id":283279046,"title":"‘A Different Man’ Ending Explained: What Happens to Sebastian Stan at the Restaurant?","text":"One of Sebastian Stan’s 2024 awards-season movies has a familiar ending, even without it playing out on screen: At the end of The Apprentice, Donald J. Trump has grown into his chintzy but undeniable real-estate power, and eventually parlays that huckster energy into the presidency, as various pieces from the back half of the film (including reference to “Make America Great Again”) fall into place. In retrospect, it makes sense that this was the film that ultimately scored Stan an Oscar nomination; his other prestige picture, A Different Man, takes a far less straightforward path to its eventual ending, though perhaps just as fixated on self-image. \n\nA Different Man plot summary:\n\nA Different Man has the makings of both an ironic comedy and a devastating tragedy: Stan plays Edward, a man living with neurofibromatosis, a condition that obscures his face with large but non-cancerous tumors, and hoping to make a living as an actor. When a miracle procedure cures him of the condition, Edward – now boasting a traditionally handsome face, which is to say he looks like Sebastian Stan – reinvents himself as a man named Guy, and experiences the nominal successes that often come more easily to the conventionally attractive. But he finds himself repeatedly vexed by the presence of Oswald (Adam Pearson, who also has neurofibromatosis in real life and appeared in Under the Skin), who lacks Edward/Guy’s hang-ups and seemingly lives his life without self-consciousness or self-loathing.\n\nThough Pearson is terrifically charismatic and funny in the role – he needs to be just insufferably cheerful enough to make us understand Edward’s frustration but genuinely charming enough to make us understand Edward’s pettiness – he lacks, by design, much interiority. It’s entirely possible that Oswald has struggled to reach a place of acceptance for his body of difference, but Edward – imprisoned, in a sense, by pretending to be Guy, rather than admitting he once had the same physical condition – can’t allow himself to relate to him, and so they never have share any sort of deeper feelings; Oswald has no idea they have the condition in common.\n\nAgain, this could be tragic: the man who gets what he wants, only to realize with growing horror that it’s his authentic self he loathes, not the superficial conditions of his body. Or it could be funny, in the Charlie Kaufman/Spike Jonze hall-of-mirrors realm. A Different Man opts more for the latter, with “Guy” cast in a play about Edward, written by Edward/Guy’s former neighbor and crush Ingrid (Renate Reinsve), who doesn’t realize that her inspiration is standing right in front of her (and is amusingly circumspect in admitting that her original work is based fully and directly on one guy she didn’t really make the effort to understand). Guy and Ingrid begin a relationship, but both their romantic and artistic collaboration are undone by Guy’s insecurities, and, he would claim, by the presence of Oswald, who takes a cheerful interest in the play, and who winds up replacing Edward in his own role (as well as in Ingrid’s bed).\n\nThat’s around the time that A Different Man takes a harder turn toward Kaufman-like territory, also akin to the recent A24 picture Dream Scenario, which similarly rides a line between offering comeuppance for a character’s hubris and offering cruel punishment for their human frailty. Edward/Guy begins to imitate Oswald, even wearing the mask he had used for the play, only further alienating people at his real-estate job. He then accosts and attacks Oswald during a performance of the play, screaming at him to “take his off,” referring to a nonexistent mask, and Edward’s inability to believe that Oswald can be happy and well-adjusted. Then a piece of the set falls on Edward, seriously injuring him.\n\nIf this were a Simpsons episode (specifically, the one where Moe gets handsome), this would somehow restore some semblance of the “original” Edward. Instead of a reset, Edward/Guy descends further into a personal hell, confined to a body cast (handsome face preserved) and left in the care of Ingrid and Oswald. Some time later, while Edward is receiving physical therapy at Oswald and Ingrid’s apartment, his therapist makes a disparaging remark about Oswald. Edward silently flies into a rage and brutally attacks the man with a knife. One cut later, he’s in a jail cell. Two cuts later, Edward is a much older man; it’s obviously many years later, and he’s out of prison, but it’s difficult to tell how long it’s been. He runs into Oswald outside the theater where Ingrid’s latest play is up, and the movie makes another quick cut to him having a pleasant dinner with the still-devoted couple.\n\nA Different Man ending explained:\n\nIt’s a jarringly non-confrontational scene; just moments after we’ve seen Edward nearly murder his physical therapist, he’s having a quiet catch-up with the very people we’ve seen him angrily fixate on. As they chat, Ingrid and Oswald casually inform their friend that they’re a few months away from moving to a commune (which sounds suspiciously like a cult) in Canada, which will involve some bizarre combination of eco-forward leaving, nudism, LSD, and free love. They ask Edward what he’s been up to, which vaguely indicates his prison release may be years in the past at this point.\n\nWe never hear Edward’s answer, because a waitress approaches and asks if they’re ready to order. “What are you thinking, Edward?” Oswald asks – referring to him by his real name, rather than “Guy,” which is how he knows him (and refers to him as such earlier in the scene). As Oswald places his order, Edward is distracted by the sight of another patron in the restaurant, seemingly an aged version of the girlfriend of his former neighbor he looked enviously upon; the neighbor committed suicide offscreen earlier in the film. When the camera cuts back to Edward from this quick shot of her, it stays on as Oswald finishes his order. The waitress then asks Edward if he needs a minute, which Edward haltingly affirms. Offscreen, Oswald laughs and says, “oh, my old friend, you haven’t changed a bit.” Edward looks up, his eyes meeting the camera, laughing and smiling back – for what seems to us the first time in ages, because he hasn’t smiled much in the final 30-40 minutes of the film. The movie cuts to black.\n\nAmbiguities abound in this scene: How long has Edward been out of prison? Was Edward’s reinvention as Guy revealed during his legal trouble, or has Oswald just made a slip of the tongue (as he does earlier in the film), conflating Guy with the “character” Edward, from the play? Does Edward actually recognize the woman in the restaurant, and does she somehow recognize him?\n\nConcrete answers to these questions aren’t especially important, and can easily be roughed out. (At least a few years; Oswald has probably just made a symbolic name mistake; Edward and the woman probably vaguely recognize each other but not specifically.) The bigger question is whether Edward has truly reached some sort of self-acceptance in his older years, after a harrowing series of experiences, mostly self-inflicted. Stan’s smile in this scene seems too genuine, especially compared with the looks of glowering or consternation that he holds for much of the rest of the film, to discount the possibility that Edward has finally found some peace. What the movie thinks about that (dark, too-late irony, or modest symbol of hope?) is a little murkier; shipping Oswald and Ingrid off to a more-or-less cult over the apparent objections of their children maintains a kind of detached, satirical approach to the characters that makes A Different Man harder to read.\n\nThat’s the distance I felt when I first saw the movie, even though I quite liked it: a sense that writer-director Aaron Schimberg might see his characters more as vehicles for pitiless social satire than fully empathetic people. (Oswald is the only major character in the movie who doesn’t come across as somewhat dim.) But looking at the ending again, there’s a certain power in ending it on Stan’s smile, especially seeing it emerge from an aged version of his still-handsome face. Is it possible that Edward has gained insight into his own immutable self, flaws and all, and can even feel genuinely amused by life’s bizarre ironies and misfortunes? Yes, it is possible, and appropriately, the movie doesn’t say for sure. It’s more important that you know yourself.\n\nJesse Hassenger (@rockmarooned) is a writer living in Brooklyn. He’s a regular contributor to The A.V. Club, Polygon, and The Week, among others. He podcasts at www.sportsalcohol.com, too.","summary":"The movie ends on a series of ambiguous notes, so what does it all mean?","url":"https://decider.com/2025/01/23/a-different-man-ending-explained/","image":"https://decider.com/wp-content/uploads/2025/01/A-DIFFERENT-MAN-ENDING-EXPLAINED.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/WHJHeaLx-QVS3bn7S.mp4","publish_date":"2025-01-23 23:50:00","author":"Jesse Hassenger,mliss1578","authors":["Jesse Hassenger","mliss1578"],"language":"en","source_country":"us","sentiment":0.35},{"id":283275044,"title":"Ivanka Trump twins with teen daughter as they follow in Duchess Sophie's footsteps","text":"Ivanka Trump, the daughter of President Donald Trump, is known for taking fashion inspiration from the royals and now she's looking towards Duchess Sophie.\n\nIvanka wore a custom coat in vermillion red by British designer Suzannah London, who has designed for the Duchess of Edinburgh for many occasions, from public events to garden parties and state dinners.\n\nSuzannah shared a snap from before the National Prayer Service at the National Cathedral in Washington, DC, on January 21, 2025 which saw Ivanka posing in a matching coat with daughter Arabella, 13.\n\n\"A special mother and daughter moment, full of elegance and style. Classic red bows and beautiful traditional cloths cut to perfection and worn with grace,\" the caption read, sharing the details of Ivanka and Arabella's coat.\n\nThe matching red coats featured a classic oversized bow at the neckline, while they both also wore black leather knee-high boots. The picture also featured husband Jared Kushner, and Jared and Ivanka's two sons, Joseph, 10, and eight-year-old Theodore.\n\nThe carousel also included a picture of Arabella wearing her mother's Check Hunter Coat Dress at an earlier event at the Tomb of the Unknown Soldier, on the eve of the inauguration.\n\nDuchess Sophie has worn Suzannah for many years; in 2024 alone she wore the designer on day three of Royal Ascot, rocking a gorgeous dress with a full-length skirt and all-over wildflower motifs, and at The Sovereign's Garden Party at Buckingham Palace, taking center stage alongside her siblings-in-law King Charles and Princess Anne.\n\nSophie looked stunning in a 1940s-inspired style with soft tailoring and a gentle figure-skimming A-line skirt.\n\nThe British royals have long been fashion muses, and Ivanka is no stranger to taking a style cue from others. \n\nIn particular it has been noted that Ivanka has been leaning into design trends that Princess Kate is also a fan of such as chic tartan, impeccable tailoring, and glittering ball gowns.\n\nFor her father's inauguration, Ivanka wore a forest-green Dior skirt suit that recalled Kate's LK Bennett green ensemble from March 2012, and for the evening party, Ivanka wore a Givenchy Haute Couture gown that echoed Kate's gorgeous one-shoulder Alexander McQueen gown from the 2023 BAFTAs.","summary":"Ivanka Trump, the daughter of President Donald Trump, is known for taking fashion inspiration from the royals and now she's looking towards Duchess Sophie. Find out more...","url":"https://www.hellomagazine.com/fashion/809390/ivanka-trump-twins-teen-daughter-follow-duchess-sophies-footsteps/","image":"https://images.hellomagazine.com/horizon/landscape/e8e14ed6055d-sophie-ivanka.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-01-23 23:49:33","author":"Rebecca Lewis","authors":["Rebecca Lewis"],"language":"en","source_country":"gb","sentiment":0.868}]}