{"offset":0,"number":50,"available":9913,"news":[{"id":371388582,"title":"PM Modi Agreed Not To Buy Too Much Oil From Russia, Claims Trump","text":"US President Donald Trump on Tuesday once again claimed that Prime Minister Narendra Modi has agreed not to “buy much oil from Russia”.\n“I love the people of India. We’re working on some great deals between our countries. I spoke to Prime Minister Modi today and we just have a very good relationship. He’s not going to buy much oil from Russia. He wants to see that war end as much as I do. He wants to see the war between Russia and Ukraine to end. They’re not going to be buying too much oil. So they’ve cut it way back, and they’re continuing to cut it way back…,” Trump told reporters during Diwali celebrations at the White House.\nRecently, Trump said he will “substantially” raise US tariffs on New Delhi, accusing it of buying massive amounts of Russian oil and selling it for big profits.\n“India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it on the Open Market for big profits,” Trump wrote in a social media post.\n“They don’t care how many people in Ukraine are being killed by the Russian War Machine. Because of this, I will be substantially raising the Tariff paid by India to the USA,” he added.\nDuring the interaction on Tuesday, the US President said: “Let me extend our warmest wishes to the people of India. I just spoke to your Prime Minister today. Had a great conversation. We talked about trade… He’s very interested in that. Although we did talk a little while ago about let’s have no wars with Pakistan. The fact that trade was involved, I was able to talk about that. And we have no war with Pakistan and India. That was a very, very good thing. He’s a great person, and he’s become a great friend of mine over the years.”\nOn Monday, Trump extended his greetings to Americans observing Diwali, describing the festival of lights as a time for unity, hope, and celebration.","summary":"Donald Trump claims PM Narendra Modi agreed to cut oil imports from Russia, praised India US ties, referenced Operation Sindoor, and celebrated Diwali at the White House.","url":"https://www.news18.com/world/pm-modi-agreed-not-to-buy-too-much-oil-from-russia-claims-trump-ws-l-9650678.html","image":"https://images.news18.com/ibnlive/uploads/2025/10/Untitled-design-2025-10-22T025108.541-2025-10-083ee6905ada8236669130ffa711b5e3.jpg","video":null,"publish_date":"2025-10-22 01:08:16","author":"News18,Ranu Joardar","authors":["News18","Ranu Joardar"],"language":"en","category":"politics","source_country":"in","sentiment":0.075},{"id":371386044,"title":"The Untold Journey of Jim Carrey: Personal Struggles, Tragic Loss, and Controversial Views on Autism","text":"France is known for charting its own course, particularly in the realm of popular culture. This independent spirit was on full display with the recent announcement that Jim Carrey is set to receive one of the country’s most prestigious artistic accolades.\n\nCarrey, celebrated for his roles in films like “Ace Ventura: Pet Detective,” “The Mask,” and “Dumb and Dumber,” will be honored with an Honorary César. This distinction, akin to the Oscars, will be awarded at the 51st César Awards ceremony in Paris next February.\n\nThe French Academy praised Carrey, a former master of slapstick comedy, as “one of the most original voices in modern cinema.” They lauded his body of work, both on-screen and off, for demonstrating that cinema has the potential to transcend mere entertainment.\n\n“His journey represents a relentless audacity, consistently challenging the boundaries of performance and art,” the Academy enthused.\n\nAwards organizations are seldom conservative in their praise for those they honor.\n\nYet, even Carrey’s most dedicated admirers might hesitate to characterize his cinematic career, marked by his exuberant and expansive comedic expressions, as an embodiment of “relentless audacity.”\n\nThe French appear to have a strong affection for the Canadian-American star. Carrey, who has claimed he’s descended from a French pirate, was made a Chevalier of the Order of Arts and Letters in 2010. But he’s never had so much as a sniff of an Oscar, failing ever to earn a nomination.\n\nAnd as for ‘constantly pushing the boundaries of performance and art’, apart from appearing in the Sonic The Hedgehog animated family movie franchise, based on a popular video game character, he hasn’t made a film for nearly a decade.\n\nIn the Sonic movies, Carrey – wearing a huge handlebar moustache – has to ply his acting skills with co-stars who are largely computer generated.\n\nCarrey, 63, will help churn out the fourth instalment of the Sonic franchise in 2027, which will no doubt help his bank balance (two of his Sonic films have been the highest-grossing movies in his career) but do little for his artistic legacy.\n\nThe most recent non-Sonic film he made, a bleak 2016 detective drama called Dark Crimes, was so terrible it earned nought per cent on the review site Rotten Tomatoes and international box office takings of just $27,000 (which in industry terms is so small it is listed as zero).\n\nHis other film from 2016 (in which Carrey only had a cameo role) was a dystopian thriller, The Bad Batch, which was also a humiliating flop that barely made it onto cinema screens.\n\nFor an actor who had commanded $20million a film in the 1990s and was at one point Hollywood’s highest earner, it provided further confirmation of how far Carrey’s star has fallen.\n\nUntil Sonic zoomed to the rescue, he hadn’t, in fact, had a hit movie (one grossing more than $100million) since Disney’s animated version A Christmas Carol in 2009, in which he voiced Scrooge. That was also the last year when a Carrey film – the black comedy I Love You Phillip Morris, co-starring Ewan McGregor – was well-reviewed by critics.\n\nSo, apart from prompting some head-scratching over their judging criteria, the most likely consequence of the French academy’s announcement is to prompt the obvious question: what happened to Jim Carrey?\n\nIndeed the disappearing act has been so complete that the only time he’s made headlines in the past few years has been in his fruitless attempts to sell his home in the smart Brentwood neighbourhood of Los Angeles.\n\nFor some online, the house had become something of a metaphor for his diminishing career.\n\nAfter buying the 12,700 square-foot five-bedroom property for $3.8million at the height of his fame in 1994, he listed it for sale in 2023 for $28.9million, calling it ‘a place of enchantment and inspiration’ for more than ‘30 very creative and prosperous years’. \n\nHe continued: ‘Every night the owls sang me lullabies and every morning I sipped my cup of joe with the hawks and hummingbirds, under a giant grandfather pine.’\n\nThere might have been a time when such an A-list endorsement would have been guaranteed to work wonders on a property’s retail prospects. But not for Carrey. \n\nHe had to slash the price repeatedly – including after a buyer backed out of an agreement to buy it for nearly $10million less than the original price – before he finally managed to offload it in August for $17million.\n\nCarrey, once estimated to be worth $300million, had fuelled suspicions he was short of money when he announced at the London premiere of Sonic The Hedgehog 3 last December that he decided to make a third instalment because, ‘I bought a lot of stuff and I need the money, frankly’.\n\nA source close to him told the Daily Mail the actor, whose public pronouncements have to be taken with a heavy pinch of salt, had been ‘joking’ about financial trouble. He sold the property ‘because he just wanted a change – he’s been there almost 30 years’, said the source.\n\nThat change has involved relocating to a waterfront property he now owns on the Hawaiian island of Maui, where Carrey confirmed he was a resident in 2017. He spends much of his time on the island – 2,600 miles and a six-hour flight from Hollywood – and displays his artwork (currently Carrey’s chief creative outlet) at a gallery in the resort of Wailea.\n\nIn 2018, Carrey revealed: ‘You could describe my home life as an isolated life. I spend a lot of time by myself but I like being by myself, so it’s OK. That might be strange to some people, but I enjoy it.’ \n\nThe source said he is working on a number of film projects that are still being finalised so they can’t yet be revealed. Although currently at a sensitive stage in discussions, these projects will hopefully be confirmed next year, said the insider, and – roll of drums – have nothing to do with Sonic The Hedgehog.\n\nIt has now been revealed that one of them is a live-action feature version of The Jetsons, the 1960s cartoon series about a futuristic family – George and Jane Jetson, and their children Judy and Elroy – revived in the 1980s. Carrey is reportedly in talks over taking a starring role in the Warner Bros project.\n\nThe return of Carrey in a film anyone over the age of 12 might want to see would certainly be a notable development for the actor, who in early 2022 announced he was ‘fairly serious’ about retiring from Hollywood.\n\nHe said at the time: ‘I really like my quiet life. And I really love putting paint on canvas, and I really love my spiritual life, and I feel like – and this is something you might never hear another celebrity say as long as time exists – I have enough. I’ve done enough. I am enough.’\n\nHe didn’t box himself in entirely about his retirement, though, adding: ‘It depends – if the angels bring some sort of script that’s written in gold ink, that says to me that it’s going to be really important for people to see, I might. I might continue down the road, but I’m taking a break.’\n\nThe producers of Sonic The Hedgehog 3 reportedly did indeed send him a script written in gold ink.\n\nAnd, while it’s hard to imagine he considered it ‘really important for people to see’, Carrey agreed to make it. Leaving aside the Sonic films, his disappearance from the big screen is all the more surprising given how it once seemed impossible to avoid him. In 1994 alone, for instance, he starred in three of the year’s most successful films.\n\nIt must have been an extraordinary moment for a performer whose family struggled so badly financially when his musician father lost his job that they had to move into a trailer home.\n\nCarrey was 15 at the time and it forced him to drop out of school and work as a cleaner at a tyre factory to support his parents.\n\nCarrey has indicated that memories of those straitened circumstances had an effect on his career, steering him towards crowd-pleasing money-spinners, despite critically-acclaimed roles as, for example, the unwitting reality TV star in the 1998 satire The Truman Show, and in the 2004 black comedy Eternal Sunshine Of The Spotless Mind.\n\nBut if Carrey really does plan a comeback beyond CGI video game spin off films, he might find enthusiasm in short supply.\n\nWhen Dark Crimes – his last starring role – bombed dismally, some Hollywood commentators criticised his formulaic performances and polarising manic on-screen personality, which has always been a Marmite thing. A little of Carrey goes a long way, complained detractors.\n\nCritics also noted that he stopped being the endearing funnyman of family entertainment and started being an endless source of political pronouncements which antagonised both Left-wing audiences – with his anti-vaccine views – and Right-wing ones, with Carrey’s hatred of Donald Trump.\n\nHe married twice, first to former actress Melissa Womer in 1987, and then to his Dumb And Dumber co-star Lauren Holly in 1996.\n\nLater, from 2005 to 2010, he had a relationship with actress and Playboy model Jenny McCarthy, who claims a quack remedy cured her son of autism. Carrey joined McCarthy in making public – and entirely discredited claims – that vaccines cause autism.\n\nOne critic dismissed his anti-vaccine statements as ‘angry, dense and immune to reason’.\n\nFellow actors, meanwhile, complained about his extreme approach to ‘method acting’, which involved inhabiting the role even off-camera.\n\nBritish actor Martin Freeman worked with Carrey in the film Man On The Moon, in which the latter played late comic actor Andy Kaufman. Freeman later described Carrey as ‘self-aggrandising, selfish and narcissistic’, and his off-screen behaviour as ‘deranged’ and ‘pretentious nonsense’. \n\nCarrey insisted on being called ‘Andy’ on and off the set and, disturbingly, pretended to be him even when the real Andy Kaufman’s family visited the studio, said Freeman. Carrey revealed he’d also stayed in character during a two-hour phone conversation with director Ron Howard to discuss another film, How The Grinch Stole Christmas.\n\nFor his part, Carrey says he’s had a long and uncomfortable relationship with fame, which has been further complicated by depression.\n\nIn 1995, his former wife, Melissa Womer, described how he regularly stayed up crying into the early hours of the morning and said: ‘I’ve learned that the smile he wears is the biggest mask of all.’\n\nIn his surreal 2020 book Memoirs And Misinformation, which was part novel and part memoir, he said his career never recovered from I Love You Phillip Morris, which suffered distribution problems in large part because it contained a scene in which he is depicted having sex with Ewan McGregor.\n\nCarry claimed that both Disney and Paramount subsequently put their projects with him on hold and his agents forced him, instead, to do the awful 2011 family comedy, Mr Popper’s Penguins.\n\nHowever, he couldn’t blame the film industry for his rocky private life. Carrey had romantic relationships with actress Renee Zellweger, Mad Men star January Jones and singer Linda Ronstadt – the latter when he was 21 and she was 36.\n\nMany of them later described him as extremely selfish and terrified of commitment. Then, in 2012, Carrey became involved with Cathriona White, an Irish make-up artist, who was married. \n\nThree years later she was found dead of a prescription drug overdose just four days after she’d broken up with Carrey for a second time. She left a suicide note saying that she’d been heartbroken by his decision to split up with her.\n\nHer husband, Mark Burton, filed an explosive wrongful death lawsuit against Carrey, who’d been a pallbearer at his lover’s funeral in County Tipperary.\n\nBurton said the star had used his ‘immense wealth and celebrity status’ to illegally obtain and distribute ‘highly addictive’ prescription drugs to Ms White despite knowing she was prone to depression and had already attempted suicide.\n\nFor good measure, he also accused Carrey of giving his wife a trio of venereal diseases.\n\nCarrey denied he’d been responsible (while admitting the fatal drugs were his) but the following year, 2016, Cathriona’s mother, Brigid Sweetman, filed her own wrongful death suit against him, damning him as ‘a dishonest Hollywood celebrity who thinks he can say anything and fool people just because he is famous’.\n\nBoth lawsuits were dismissed in 2018 but not before Carrey’s public image had taken a battering.\n\nIn a rare interview last December, Carrey said that stepping away from Hollywood had given him a ‘new appreciation for it’.\n\nHe went on: ‘I also value getting out of people’s faces. I mean, some people just want to be in people’s faces all the time, and I don’t, so I like to give them a rest.’\n\nBut will his critics agree that a decade away is long enough?","summary":"Internewscast Journal\n\nInternewscast\n\n\nFrance is known for charting its own course, particularly in the realm&#8230;\n\n\nThis Post: The Untold Journey of Jim Carrey: Personal Struggles, Tragic Loss, and Controversial Views on Autism first appeared on Internewscast Journal","url":"https://internewscast.com/news/the-untold-journey-of-jim-carrey-personal-struggles-tragic-loss-and-controversial-views-on-autism/","image":"https://internewscast.com/wp-content/uploads/2025/10/Real-story-of-Jim-Carreys-downfall-lovers-suicide-and-autism.jpg","video":null,"publish_date":"2025-10-22 00:53:51","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.231},{"id":371386468,"title":"Trump Says He Discussed Trade With Modi","text":"WASHINGTON: U.S. President Donald Trump said he spoke with Indian Prime Minister Narendra Modi on Tuesday, with their conversation focused largely on trade.\"We talked about a lot of things, but mostly the world of trade,\" Trump told reporters in the Oval Office.Trump added that energy was also part of the discussion, saying Modi assured him that India would be limiting its oil purchases from Russia.\"He's not going to buy much oil from Russia. He wants to see that war end as much as I do,\" Trump said.India and China are the two top buyers of Russian seaborne crude exports.Trump has recently targeted India for its Russian oil purchases, imposing tariffs on Indian exports to the U.S. to discourage the country's crude buying as he seeks to pressure Moscow to negotiate a peace deal in Ukraine.","summary":"We talked about a lot of things, but mostly the world of trade, Trump told reporters in the Oval Office","url":"https://www.deccanchronicle.com/world/americas/trump-says-he-discussed-trade-with-modi-1911681","image":"https://www.deccanchronicle.com/h-upload/2025/10/22/1969890-1738950325-3652.webp","video":null,"publish_date":"2025-10-22 00:52:42","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.023},{"id":371386194,"title":"Trump celebrates Diwali at White House with 'Diya' Lighting, calls PM Modi 'Great Friend'","text":"Trump lauds Diwali as a resplendent celebration of Hindu cultural heritage at the White HouseTrump Celebrates Diwali At White House With Traditional Diya LightingPresident Donald Trump celebrated the Hindu festival of Diwali at the White House on October 21, marking the occasion with a traditional diya (oil lamp) lighting ceremony in the Oval Office. He was joined by Indian-American members of his administration and business leaders from the Indian-American community.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/trump-celebrates-diwali-at-white-house-with-diya-lighting-calls-pm-modi-great-friend/videoshow/124731505.cms","image":"https://img.etimg.com/thumb/msid-124731505,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-124731505,imgsize-64376.cms","publish_date":"2025-10-22 00:43:19","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":0.97},{"id":371388176,"title":"‘I was damaged greatly’: Donald Trump seeks $230 million from Justice Department — Will the president decide his own payout?","text":"US President Donald Trump on Tuesday said that his Justice Department might owe $230 million — and he’d be the one to decide whether to cut himself a check.Trump is seeking $230 million as compensation for past investigations into him, though he professed to have little knowledge of the specifics and said he would give the money to charity.What Trump said?“It could be,” Trump responded when asked by CNN’s Kaitlan Collins about a New York Times report that he was seeking the money in connection with complaints he had filed about past DOJ investigations. “I don’t know about the numbers. I don’t even talk to them about it. All I know is that they would owe me a lot of money. But I’m not looking for money. I’d give it to charity or something,” Trump said in the Oval Office.Will the president decide his own payout? Though many of the details remain unclear, Trump acknowledged the unprecedented nature of the situation in which he would be potentially “paying myself” damages to resolve claims that the DOJ under his predecessor had wronged him.\"That decision would have to go across my desk. And it's awfully strange to make a decision where I'm paying myself. In other words, did you ever have one of those cases where you have to decide how much you’re paying yourself in damages?\" Trump told reporters in the Oval Office when asked about the report.\"But I was damaged very greatly.\"As a private citizen, President claimed he was entitled to money from the government. As president, he could now, in effect, order that government to pay him. If the payment came in the form of a settlement, the White House might be under no legal obligation to disclose it to the public, the Washington Post reported.The New York Times reported Tuesday on that Trump was seeking $230 million in compensation and that any settlement might be approved by Justice Department officials who defended Trump, or those around him, during the investigations.Trump filed multimillion-dollar claims against DOJ before reelectionTrump first lodged the complaints in 2023 and 2024 — before his reelection — alleging that he was wronged by past federal investigations, The New York Times reported. The first claim centers on alleged violations of his rights during the probe into Russian interference in the 2016 election. The second focuses on the classified documents case, which was dismissed after his return to office, and accuses the FBI of breaching his privacy during the 2022 search of his Mar-a-Lago estate. That filing reportedly sought $100 million in damages, as per CNN. “President Trump continues to fight back against all Democrat-led witch hunts,” his legal spokesperson said, calling the investigations part of the “weaponization of our justice system by Crooked Joe Biden and his handlers.” The Times noted it remains unclear whether Trump or his lawyers have taken new steps to pursue payment. Both filings were made under an administrative process that allows citizens to seek compensation from federal agencies — a procedure separate from a court lawsuit. Complicating matters, two senior Justice Department officials who could now review Trump’s claims previously defended him or his associates. Deputy Attorney General Todd Blanche served as Trump’s criminal defense attorney, while Civil Division chief Stanley Woodward represented one of Trump’s co-defendants in the classified documents case.","summary":"President Trump stated his Justice Department might owe him $230 million for past investigations, though he claimed little knowledge of specifics and would donate any payout to charity. He filed multimillion-dollar claims alleging rights violations during probes into Russian interference and the classified documents case.","url":"https://timesofindia.indiatimes.com/world/us/i-was-damaged-greatly-donald-trump-seeks-230-million-from-justice-department-will-the-president-decide-his-own-payout/articleshow/124731409.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-124731487/124731487.jpg","video":null,"publish_date":"2025-10-22 00:41:00","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.551},{"id":371386038,"title":"NYU Student Group Advocates for Marxist Change at ‘No Kings’ Rally to Challenge Capitalism","text":"EXCLUSIVE TO FOX: Over the weekend, a group believed to be students from New York University (NYU) distributed a Communist newspaper during the “No Kings” protest held in New York City. The group announced their participation on social media, stating their intention to “overthrow capitalism.”\n\nThe Instagram account named “NYU Communists” is linked in its bio to the Revolutionary Communists of America, which claims to be a new political party inspired by the ideologies of Karl Marx and communist principles.\n\nThe group shared on Instagram, “Comrades from the NYU branch organized a communist contingent for the No Kings rally in Manhattan today. Our goal was to engage with the radicalized workers and youth who are tired of capitalism’s exploitation and are prepared to push back.”\n\nThe group’s Instagram page invites those interested in organizing against capitalism to reach out directly, saying, “Want to get organized to overthrow capitalism? DM us!”\n\nThe profile also features the song “Guillotine” by The Coup, with lyrics that warn, “We got the guillotine, you better run,” reflecting their revolutionary stance on their primary social media platform.\n\nDespite its name and appearing to be a student-run chapter of the larger Revolutionary Communists of America organization, “NYU Communists” are not officially affiliated with the university, according to a spokesperson. \n\n“There is no registered or university-recognized group called ‘NYU Communists,’ and we’re unfamiliar with them,” NYU spokesperson John Beckman told Fox News Digital. \n\nFox News Digital obtained a copy of the October 2025 edition of “The Communist” being handed out by “comrades” at the event featuring the headline, “The Billionaires are the Enemy.” \n\n“The Communist” is printed in traditional multicolor newspapers, some with full pages of color and a barcode linking to a sign-up sheet to join the Revolutionary Communists of America. \n\nFifteen pages of articles without author names follow the top story and include articles like “Reserve your Spot at a Marxist School Near You,” “Israel’s War on the Truth” and “Record 70% Now Believe the ‘American Dream’ was a Lie.”\n\nThe paper asks for a $5 “solidarity” donation.\n\nThe “NYU Communists” were joined by thousands of mostly peaceful protesters at the “No Kings” rally in New York City on Saturday, an event that was partially funded by Democratic donor George Soros among other donors and nonprofits. \n\nPresident Donald Trump indicated Sunday that his administration would be looking into the funding behind the protests that took place across the country. \n\n“I guess [the No Kings protest] was paid for by Soros and other radical left lunatics,” Trump told reporters Sunday night. “It looks like it was. We’re checking it out.”\n\nFox News Digital reached out to Revolutionary Communists of America and “NYU Communists” for comment.\n\nPreston Mizell is a writer with Fox News Digital covering breaking news. Story tips can be sent to Preston.Mizell@fox.com and on X @MizellPreston","summary":"Internewscast Journal\n\nInternewscast\n\n\nEXCLUSIVE TO FOX: Over the weekend, a group believed to be students&#8230;\n\n\nThis Post: NYU Student Group Advocates for Marxist Change at &#8216;No Kings&#8217; Rally to Challenge Capitalism first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/nyu-student-group-advocates-for-marxist-change-at-no-kings-rally-to-challenge-capitalism/","image":"https://internewscast.com/wp-content/uploads/2025/10/NYU-Communists-vow-to-fight-capitalism-with-Marxist-revolution-at.jpg","video":null,"publish_date":"2025-10-22 00:39:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.394},{"id":371382892,"title":"Why Paul Ingrassia, Trump's Pick for Federal Watchdog, Withdrew His Nomination","text":"US President Donald Trump's nominee to lead a federal watchdog agency, Paul Ingrassia, has withdrawn following reports that he described himself as having a \"Nazi streak.\" Ingrassia, 30, said in a post on X (formerly Twitter) on Tuesday that he was pulling out of a scheduled Senate hearing because \"I do not have enough Republican votes at this time.\" He added: \"I appreciate the overwhelming support that I have received throughout this process.\" The nomination had faced opposition after Politico reported that Ingrassia, in private text messages with Republican operatives and social media influencers, denounced the Martin Luther King Jr. holiday, writing it \"should be ended and tossed into the seventh circle of hell where it belongs.\" He reportedly also called for the end of other holidays celebrating Black culture, including Juneteenth and Black History Month. In another message, Ingrassia said: \"I do have a Nazi streak in me from time to time,\" according to Politico, which said it obtained the text chain and confirmed the messages with two participants. Also Read: Young Republicans Leaders at Center of Politico's Explosive Chat Leak Senate Majority Leader John Thune, a Republican, called on the White House to withdraw the nomination, saying: \"He's not going to pass.\" Senator Rick Scott of Florida also said he did not support Ingrassia. Ingrassia's lawyer, Edward Andrew Paltzik, said the messages could have been manipulated and added that if authentic, they \"clearly read as self-deprecating and satirical humor.\" Senate Democrats condemned the remarks. Senate Majority Leader Chuck Schumer described the messages as \"foul and disqualifying.\" Ingrassia, a lawyer and former right-wing podcaster, has served in roles at the Department of Justice and Department of Homeland Security during Trump's second administration and supported the former president's efforts to overturn his 2020 election loss. Trump nominated him in May to lead the Office of Special Counsel, which investigates claims of retaliation against federal whistleblowers and enforces restrictions on political activity by federal employees. The withdrawal marks one of the few occasions in the Republican-controlled Senate where Trump nominees have been blocked or withdrawn. Previous nominees, including former Representative Matt Gaetz and E.J. Antoni, were also withdrawn before a vote, while others, including Robert F. Kennedy Jr., Pete Hegseth and FBI Director Kash Patel, were confirmed despite some Republican opposition. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Trump nominated him in May to lead the Office of Special Counsel, which investigates claims of retaliation against federal whistleblowers","url":"https://www.timesnownews.com/world/us/us-news/paul-ingrassia-donald-trump-pick-federal-watchdog-office-of-special-counsel-nomination-article-153034101","image":"https://images.timesnownews.com/thumb/msid-153034102,thumbsize-50306,width-1280,height-720,resizemode-75/153034102.jpg","video":null,"publish_date":"2025-10-22 00:39:23","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.046},{"id":371385532,"title":"Hunter Biden says watching Obama lead Joe off stage at infamous Hollywood fundraiser ‘really pissed me off’: book ","text":"Hunter Biden claims he was so enraged watching Barack Obama lead his father, then-President Joe Biden, off the stage at a Hollywood fundraiser last year that he nearly cursed out the former president. \n\nIn an excerpt of journalist Jonathan Karl’s forthcoming book, “Retribution: Donald Trump and the Campaign that Changed America,” obtained by Axios Tuesday, the former first son recalled the anger he felt toward Obama, who grabbed Joe by the wrist and tugged him in the direction of the curtains after he froze for a full 10 seconds at the star-studded campaign fundraiser. \n\n“I almost jumped up on the stage and said, ‘Don’t ever f–king do that to the president of the United States again — ever,” Hunter told Karl, during an interview months after the awkward moment. \n\n“I knew that that was going to be a meme,” the former first son added. “That really, really, really, really pissed me off.”\n\nJoe’s freeze-up at the Peacock Theater in Los Angeles indeed went viral and took place as concerns over the octogenarian president’s age and mental acuity mounted, following a spate of public moments where the then-president appeared dazed or confused about where he was. \n\nThe Hollywood event raked in more than $30 million in contributions for the Biden campaign, about a week-and-a-half before Joe’s disastrous debate with President Trump, which forced the Democratic incumbent to end his re-election bid less than a month later. \n\nActor and Democratic mega-donor George Clooney was one of several Hollywood luminaries at the event, and later recounted in a New York Times op-ed that the president “was not the Joe ‘big F-ing deal’ Biden of 2010.”\n\n“He wasn’t even the Joe Biden of 2020,” Clooney said of what the president was like at the fundraiser. “He was the same man we all witnessed at the debate.”\n\nJournalists Alex Thompson and Jake Tapper claim Clooney was “shaken to his core” by Joe’s decline.\n\n“The president hadn’t recognized him. A man he had known for years,” Thompson and Tapper wrote in their book, “Original Sin.”\n\nHunter has previously ripped Clooney for writing about his experience with Joe, which led to even more calls for the president to drop out of the 2024 race. \n\n“F‑-k him. F–k him. F–k him and everybody around him,” Hunter said of Clooney in July, during an interview on Andrew Callaghan’s YouTube show, “Channel 5.”\n\n“Number one, I agree with [director] Quentin Tarantino, George Clooney is not a f—king actor … he is a brand,” he added. “He’s great friends with Barack Obama. F—k you. What do you have to do with f—king anything? Why do I have to f—king listen to you?”","summary":"\"I knew that that was going to be a meme,\" the former first son said. \"That really, really, really, really pissed me off.\"","url":"https://nypost.com/2025/10/21/us-news/hunter-biden-says-watching-obama-lead-joe-off-stage-at-infamous-hollywood-fundraiser-really-pissed-me-off-book/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/stands-former-us-president-barack-113934331.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/omX3HRUg-RyIcpnTz.mp4","publish_date":"2025-10-22 00:24:39","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.049},{"id":371383354,"title":"North Korea has fired a ballistic missile toward the east, Seoul says","text":"North Korea fired a ballistic missile in an eastward direction on Wednesday, South Korea's military said, the North's first weapons testing activity in about five months. \n\nA brief statement from South Korea’s Joint Chiefs of Staff gave no further details such as how far the weapon flew. \n\nNorth Korea usually test-launches missiles in the waters between the Korean Peninsula and Japan, causing no damage in neighboring countries. But the Joint Chiefs of Staff statement only said the latest missile was launched in an eastward direction. \n\nThe launch comes days before South Korea hosts the Asia-Pacific Economic Conference. U.S. President Donald Trump, Chinese President Xi Jinping and other world leaders are to gather in the South Korean city of Gyeongju.\n\nExperts earlier said North Korea could launch provocative missile tests before or during the APEC summit to underscore its commitment to being recognized as a nuclear weapons state. Experts say Kim would need that status to call for the U.N. to lift punishing economic sanctions on it.\n\nNorth Korean leader Kim Jong Un has been sharply accelerating the pace of weapons tests since since his high-stakes nuclear diplomacy with Trump fell apart in 2019 due to wrangling over U.S.-led economic sanctions on North Korea. But last month, Kim suggested he could return to talks if the U.S. drops its demand for a denuclearization of North Korea, after Trump repeatedly expressed his hopes for a new round of diplomacy.\n\nEarlier this month, Kim displayed a new intercontinental ballistic missile at a massive military parade in Pyongyang, with top Chinese, Russian and other leaders present. The parade, which marked the 80th anniversary of the founding of the ruling Workers’ Party, highlighted Kim’s growing diplomatic footing and his relentless drive to build an arsenal that could strike the U.S. and its allies. Analysts say Kim would believe an expanded nuclear arsenal would increase his leverage in potential talks with the U.S.\n\nNorth Korea's state media said the Oct. 10 parade featured the Hwasong-20 ICBM, which it described as the country’s “most powerful nuclear strategic weapon system.” Observers said the ICBM is designed to carry multiple nuclear warheads to defeat U.S. missile defenses and that North Korea could test-launch it in coming months. \n\nKim’s diplomatic credentials have been bolstered recently. He took center stage with Chinese leader Xi Jinping and Russian President Vladimir Putin at a Beijing military parade last month. Trump and South Korean President Lee Jae Myung have also repeatedly expressed hopes to meet Kim as he flaunts a provocative nuclear program.\n\nAssociated Press writer Kim Tong-hyung contributed to this report.","summary":"North Korea has fired a ballistic missile in an eastern direction","url":"https://www.independent.co.uk/news/kim-jong-un-north-korea-south-korea-xi-jinping-seoul-b2849714.html","image":"https://static.independent.co.uk/2025/10/22/01/North_Korea_Worker%27s_Party_Anniversary_82634.jpg?width=1200","video":null,"publish_date":"2025-10-22 00:22:45","author":"Hyung-Jin Kim","authors":["Hyung-Jin Kim"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.063},{"id":371386202,"title":"China didn’t buy US soybeans in September at all- here’s where its record imports came from","text":"Soybeans: China imported no soybeans from the United States in September, marking the first time since November 2018 that shipments fell to zero, as per a report. The decline came as Chinese buyers continued to avoid American cargoes amid ongoing trade tensions between the world’s two largest economies.US Soybeans Shipments to China Drops to ZeroAccording to data released Monday by China’s General Administration of Customs, soybean imports from the US dropped to zero from 1.7 million metric tons a year earlier, as reported by Reuters. Analysts attributed the fall to high tariffs on US products and the completion of sales from previously harvested American supplies. Wan Chengzhi, an analyst at Capital Jingdu Futures, said that, \"This is mainly due to tariffs. In a typical year, some old-crop beans would still enter the market,\"as quoted by Reuters.ALSO READ: Donald Trump celebrates Diwali at White House - here’s what he said about Narendra Modi & US-India relationsSouth American Soybean Exports Surge in ChinaWhile imports from the US vanished, shipments from South America surged. Arrivals from Brazil rose 29.9% year-on-year to 10.96 million tons, accounting for 85.2% of China’s total soybean imports, as per the report. Imports from Argentina also jumped sharply, up 91.5% to 1.17 million tons, or 9% of total purchases.Live EventsChina’s Soybean Imports Reach Second-Highest Level in SeptemberOverall, China’s soybean imports in September reached 12.87 million metric tons, the second-highest level on record, reported Reuters.China has not purchased any US soybean cargoes from this autumn’s harvest. With buyers securing shipments mainly from Brazil and Argentina through November, aided by Argentina’s brief tax holiday, the window for US soybean sales is closing quickly, as per the report.ALSO READ: Texas Instruments stock drops after Q3 earnings miss and cautious outlook - what investors need to knowUS soybeans Farmers Could Face Heavy LossesWithout a breakthrough in trade talks, analysts warn that US farmers could face significant losses as Chinese processors continue sourcing from South America. However, Beijing may also risk a potential supply gap early next year before Brazil’s new crop becomes available, as per the Reuters report.Risk of Soybean Supply Gap in Early 2026Johnny Xiang, founder of Beijing-based AgRadar Consulting, said, \"A soybean supply gap may emerge in China between February and April next year if there's no trade deal in place. Brazil has already shipped a huge volume, and no one knows how much old-crop stock remains,\" as quoted by Reuters.Trade Talks Between Beijing and Washington Regain MomentumTrade discussions between Beijing and Washington have shown signs of renewed momentum after weeks of tariff threats and export restrictions, as per the Reuters report. US President Donald Trump said on Sunday that he believed a soybean agreement would eventually be reached, as per the report.Brazil Dominates China’s Soybean Imports in 2025From January to September, China imported 63.7 million tons of soybeans from Brazil, up 2.4% year-on-year, and 2.9 million tons from Argentina, up 31.8%, as per the Reuters report. Despite the halt in recent US shipments, total imports of American soybeans so far this year have reached 16.8 million tons, an increase of 15.5% from the same period last year, as per the report.FAQsWhy did China stop buying soybeans from US?Because of high tariffs and ongoing trade tensions between the two countries, as per the Reuters report.Which countries are supplying soybeans to China?Brazil and Argentina, as per the Reuters report.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onsoybeans latest news todaysoybeansUS soybeans ChinaChina stops buying US soybeansWhy China stopped buying US soybeansChina soybeans imports September 2025China soybean import shift explained\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onsoybeans latest news todaysoybeansUS soybeans ChinaChina stops buying US soybeansWhy China stopped buying US soybeansChina soybeans imports September 2025China soybean import shift explained(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Soybeans: China's soybean imports from the US hit zero in September, a first since 2018, due to trade tensions and tariffs. Buyers are now heavily reliant on Brazil and Argentina, whose shipments have surged. This shift could lead to a supply gap in China early next year if trade talks don't yield results.","url":"https://economictimes.indiatimes.com/news/international/us/china-didnt-buy-us-soybeans-in-september-at-all-heres-where-its-record-imports-came-from/articleshow/124731281.cms","image":"https://img.etimg.com/thumb/msid-124731382,width-1200,height-630,imgsize-306580,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-22 00:15:45","author":"Shreya Biswas","authors":["Shreya Biswas"],"language":"en","source_country":"in","sentiment":-0.472},{"id":371381004,"title":"Trump Boasts He Stopped India-Pakistan War Using Tariffs – But Did He Really?","text":"Washington DC: US President Donald Trump has once again claimed that trade and tariffs played a decisive role in preventing conflicts, including the May escalation between India and Pakistan. Speaking to Senate Republicans at the White House’s newly renovated Rose Garden, he described how he leveraged trade deals to avert what he called a “potential nuclear disaster” in South Asia.“I mentioned eight wars, nine coming. Of the eight, five were based solely on trade and tariffs. India-Pakistan were going at it. Two nuclear powers and serious nuclear. Seven planes were shot down. They were ready to go, and I called them up. I said, ‘You go to war and we are not doing a trade deal,’” Trump said.He claimed that both countries questioned the role of trade in the standoff. “It has a lot. You are nuclear powers, and if you do it, we are not doing a trade deal. 24 hours later, they called me. ‘We have decided not to do it.’ We stopped the war. We stopped a potential disaster, a nuclear disaster, because of trade,” he asserted.His remarks refer to the May escalation following India’s Operation Sindoor, in which precision strikes targeted nine terrorist camps in Pakistan and Pakistan-occupied Jammu and Kashmir (PoJK) after the April 22 Pahalgam terror attack that killed 26 civilians.Trump strongly defended tariffs as a strategic tool, not merely an economic measure. “Tariffs equal national security. Remember that. Tariffs equal national security,” he repeated.He added that tariffs also “equal wealth for our nation because we have taken in hundreds of billions of dollars in a friendly manner, given to us by nations that used to take it from us and they use tariffs on us; we never use tariffs on them because we were foolish”.He went on to claim that tariffs have “made us a wealthy country. They have given us tremendous defence; they have given us things we can do for other countries… Really, it is national security; it is national defence”.Trump has consistently maintained that his trade and tariff policies allowed the United States to de-escalate tensions between India and Pakistan. India, however, has repeatedly rejected such claims, emphasising that all issues with Pakistan, including those related to Jammu and Kashmir, are strictly bilateral matters.","summary":"Trump claims trade and tariffs prevented a nuclear war between India and Pakistan, but experts and officials question his version of events.","url":"https://zeenews.india.com/india/trump-boasts-he-stopped-india-pakistan-war-using-tariffs-but-did-he-really-2974747.html","image":"https://english.cdn.zeenews.com/sites/default/files/2025/10/22/1849691-trump-rose-garden-1.jpg?im=Resize=(1200,900)","video":null,"publish_date":"2025-10-22 00:14:49","author":"Zee Media Bureau,Zee News","authors":["Zee Media Bureau","Zee News"],"language":"en","source_country":"in","sentiment":-0.263},{"id":371383878,"title":"'NYU Communists' vow to fight capitalism with Marxist revolution at 'No Kings' rally","text":"FIRST ON FOX: An apparent group of New York University (NYU) students handed out a Communist newspaper at the \"No Kings\" protest in New York City over the weekend, vowing to \"overthrow capitalism\" in a social media post highlighting their involvement in the event. The Instagram page for \"NYU Communists\" links to the Revolutionary Communists of America in its bio, a self-proclaimed new political party based on Karl Marx’s beliefs and communist policies. \"Comrades from the NYU branch organized a communist contingent for the No Kings rally in Manhattan today to connect with the radicalized workers and youth that are sick of the exploitation of capitalism, and are ready to fight back,\" the caption recapping their involvement in this past weekend’s \"No Kings\" protest read. ‘ABSOLUTELY A COMMUNIST’: MAMDANI DODGES LABEL, BUT HIS RECORD AND EXPERT SAY OTHERWISE \"Want to get organized to overthrow capitalism? DM us!\" The group's profile page features the song \"Guillotine\" by The Coup with lyrics that include, \"We got the guillotine, you better run\" on the organization's main social media platform. Despite its name and appearing to be a student-run chapter of the larger Revolutionary Communists of America organization, \"NYU Communists\" are not officially affiliated with the university, according to a spokesperson. \"There is no registered or university-recognized group called 'NYU Communists,' and we're unfamiliar with them,\" NYU spokesperson John Beckman told Fox News Digital. ‘IT’S A JOKE’: WHITE HOUSE DISMISSES 'NO KINGS' PROTESTS, WHILE NANCY PELOSI RIPS CROWN IN DEFIANCE Fox News Digital obtained a copy of the October 2025 edition of \"The Communist\" being handed out by \"comrades\" at the event featuring the headline, \"The Billionaires are the Enemy.\" \"The Communist\" is printed in traditional multicolor newspapers, some with full pages of color and a barcode linking to a sign-up sheet to join the Revolutionary Communists of America. Fifteen pages of articles without author names follow the top story and include articles like \"Reserve your Spot at a Marxist School Near You,\" \"Israel’s War on the Truth\" and \"Record 70% Now Believe the ‘American Dream’ was a Lie.\" The paper asks for a $5 \"solidarity\" donation. WATCH: 'NO KINGS' PROTESTER STEPS UP TO MIC AND CALLS FOR ICE AGENTS TO BE 'SHOT,' 'WIPED OUT' The \"NYU Communists\" were joined by thousands of mostly peaceful protesters at the \"No Kings\" rally in New York City on Saturday, an event that was partially funded by Democratic donor George Soros among other donors and nonprofits. President Donald Trump indicated Sunday that his administration would be looking into the funding behind the protests that took place across the country. CLICK HERE TO GET THE FOX NEWS APP \"I guess [the No Kings protest] was paid for by Soros and other radical left lunatics,\" Trump told reporters Sunday night. \"It looks like it was. We're checking it out.\" Fox News Digital reached out to Revolutionary Communists of America and \"NYU Communists\" for comment.","summary":"The &quot;NYU Communists&quot; group handed out &quot;The Communist&quot; newspapers at the &quot;No Kings&quot; rally in New York City Saturday, vowing to fight back against capitalism.","url":"https://www.foxnews.com/us/nyu-communists-vow-fight-capitalism-marxist-revolution-no-kings-rally","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/washington-no-kings-protest.jpg","video":null,"publish_date":"2025-10-22 00:12:29","author":"Preston Mizell","authors":["Preston Mizell"],"language":"en","source_country":"us","sentiment":0.102},{"id":371381242,"title":"Trump jangka capai perjanjian dagang 'baik' dengan Jinping di sidang kemuncak Korea Selatan","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menjangkakan akan mencapai satu perjanjian perdagangan \"yang baik\" dengan Presiden China, Xi Jinping, pada sidang kemuncak serantau minggu hadapan di Korea Selatan - namun tidak menolak kemungkinan pertemuan itu dibatalkan pada saat akhir.\n\nTrump berkata demikian ketika menghadiri majlis makan tengah hari bersama senator Parti Republikan di Rumah Putih, semalam.\n\n\"Kita akan dapatkan perjanjian yang adil dan saya fikir pertemuan itu akan berlangsung dengan baik. Ramai yang menantikan hasilnya,\" kata Trump.\n\nNamun beliau kemudian menambah dengan nada berhati-hati: \"Mungkin ia tidak akan berlaku. \n\nKadang-kadang sesuatu boleh terjadi - mungkin seseorang akan berkata, 'Saya tak mahu berjumpa. Suasana terlalu tegang.' Tapi sebenarnya, ia tidaklah seteruk itu.\"\n\nTrump sebelum ini mengumumkan pada 19 September bahawa beliau akan bertemu Jinping di Korea Selatan dan dijadual berkunjung ke China awal tahun depan.\n\nJika diteruskan, ia akan menjadi pertemuan pertama antara kedua-dua pemimpin sejak Trump kembali ke Rumah Putih.\n\nNamun, pada 10 Oktober lalu, beliau mengancam untuk membatalkan pertemuan itu dan mengenakan tarif besar-besaran terhadap China selepas Beijing mengenakan sekatan eksport terhadap mineral nadir bumi - sebelum akhirnya menarik balik kenyataan terbabit.\n\nDalam nada lebih positif, Trump pada Isnin berkata, pertemuan dengan Jinping akan diteruskan dan lawatannya ke China \"pada awal tahun depan\" kini \"hampir pasti ditetapkan.\"\n\nJinping bukan satu-satunya pemimpin yang menerima pendirian berubah-ubah daripada Trump kebelakangan ini.\n\nMinggu lalu, beliau berkata akan bertemu Presiden Russia, Vladimir Putin, di Budapest dalam tempoh dua minggu bagi membincangkan perang di Ukraine.\n\nNamun, Rumah Putih semalam menjelaskan, \"tiada rancangan untuk pertemuan dalam masa terdekat.\"","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menjangkakan akan mencapai satu perjanjian perdagangan “yang baik” dengan Presiden China, Xi Jinping, pada sidang kemuncak serantau minggu hadapan di Korea Selatan - namun tidak menolak kemungkinan pertemuan itu dibatalkan pada saat akhir.","url":"https://www.bharian.com.my/dunia/amerika/2025/10/1461768/trump-jangka-capai-perjanjian-dagang-baik-dengan-jinping-di-sidang","image":"https://assets.bharian.com.my/images/articles/BH22jangka-o_BHfield_image_listing_featured.var_1761091526.jpg","video":null,"publish_date":"2025-10-22 00:05:32","author":"AGENSI","authors":["AGENSI"],"language":"en","category":"politics","source_country":"my","sentiment":-0.336},{"id":371386656,"title":"North Korea Fires Ballistic Missile Toward Eastern Waters, Says South Korea","text":"North Korea fired a ballistic missile toward the North's eastern waters on Wednesday, South Korea's military said.A brief statement from South Korea's Joint Chiefs of Staff gave no further details such as how far the weapon flew.The launch comes days before South Korea hosts the Asia-Pacific Economic Conference. U.S. President Donald Trump, Chinese President Xi Jinping and other world leaders are to gather in the South Korean city of Gyeongju for talks next week.Earlier this month, North Korean leader Kim Jong Un displayed a new long-range missile at a massive military parade in Pyongyang, with top Chinese, Russian and other leaders present. The parade, which marked the 80th anniversary of the founding of the ruling Workers' Party, highlighted Kim's growing diplomatic footing and his relentless drive to build an arsenal that could target the continental United States and his rivals in Asia.Kim's diplomatic credentials have been bolstered recently. He took center stage with Chinese leader Xi Jinping and Russian President Vladimir Putin at a Beijing military parade last month. U.S. President Donald Trump and South Korean President Lee Jae Myung have also repeatedly expressed hopes to meet Kim as he flaunts a provocative nuclear program.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"North Korea fired a ballistic missile toward the North's eastern waters on Wednesday, South Korea's military said.","url":"https://www.ndtv.com/world-news/north-korea-fires-ballistic-missile-toward-eastern-waters-says-south-korea-9494806","image":"https://c.ndtvimg.com/2025-10/8plnbi74_north-korea-ballistic-missile_625x300_22_October_25.jpeg","video":null,"publish_date":"2025-10-22 00:04:33","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":0.153},{"id":371380608,"title":"Trump warns ‘I’d rather have a Democrat than a communist’ as NYC mayoral race enters homestretch","text":"President Donald Trump said Tuesday that he believes New York City could soon elect a \"communist\" mayor and signaled he’d prefer a Democrat to take the reins at City Hall over a far-left candidate. Asked during a White House press gaggle whether he’d urge Republican Curtis Sliwa to drop out of the race, Trump didn’t endorse anyone, but made clear his concern about current polling with just two weeks to go until Election Day. \"Well, I looked at the polls and looks like we're going to have a communist as the mayor of New York,\" Trump said. \"It'll be very interesting. But here's the good news. He's got to go through the White House, everything goes through the White House. At least this White House, it does.\" Trump appeared to suggest that if Sliwa exited the race, former Gov. Andrew Cuomo might close the gap with Democratic socialist nominee Zohran Mamdani, but wasn’t confident it would change the outcome. BILL ACKMAN JUMPS INTO NYC MAYORAL FIGHT, SAYS SLIWA MUST DROP OR ‘WE ARE TOAST' \"If he [Sliwa] dropped out, he's not going to win. And not looking too good for Cuomo either,\" Trump said. \"Maybe if he dropped out, Cuomo would have a little bit of a chance. But not much. Because it looks like the lead is—it’s not a great lead, but it’s big enough that he should be able to win.\" Pressed on whether he’d be willing to meet with Mamdani if elected, Trump said he would. \"Yeah, I’ll speak to him,\" the president said. \"I think I have an obligation to speak to him.\" FOX NEWS POLL: MAMDANI MAINTAINS SIGNIFICANT LEAD IN NYC MAYORAL RACE Still, Trump lamented what he sees as the city’s decline under progressive leadership. \"I love New York. I've always loved New York. I just can't believe a thing like this is happening,\" he said. \"I left New York, and we had a mayor, [Bill] de Blasio, who was a disaster… New York was a hot city. And now it’s — it's sad to see what's happening, frankly.\" \"With the communist in charge… look, you just go back a thousand years. I mean, it's been done many times, a thousand years. It's never worked once. So it's not going to work now.\" Mamdani, a state assemblyman and longtime Democratic Socialist of America (DSA) member, has embraced calls to legalize prostitution and tax the wealthy. His campaign has drawn endorsements from Rep. Alexandria Ocasio-Cortez, D-N.Y., and other national progressives like Sen. Bernie Sanders, I-Vt.CLICK HERE TO GET THE FOX NEWS APP The city's mayoral election is Nov. 4.The Cuomo, Mamdani and Sliwa campaigns did not immediately respond to Fox News Digital’s request for comment.","summary":"Trump said New York City may elect a “communist&quot; mayor, adding he’d prefer a Democrat but said he’d speak to Mamdani if elected and warned the city is in decline.","url":"https://www.foxnews.com/politics/trump-warns-rather-have-democrat-than-communist-nyc-mayoral-race-enters-homestretch","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/mamdani-trump-getty.png","video":null,"publish_date":"2025-10-22 00:01:00","author":"Jasmine Baehr","authors":["Jasmine Baehr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.622},{"id":371384310,"title":"Trump says he wants to be \"nice\" to China, but slaps 155% tariffs from Nov 1","text":"By Reena BhardwajWashington DC [US], October 22 (ANI): US President Donald Trump on Tuesday (local time) stated that Washington would continue with their plans to impose a 155 per cent tariff on Chinese goods imported into the US beginning November 1, despite expressing his desire to maintain amicable ties with Beijing. Responding to a question by ANI if tariffs would be considered on China, as it is still Russia’s largest oil importer, the US President said, “Right now, as of November 1st, China will have about 155 per cent tariffs put on it. I don’t think it’s sustainable for them.”Trump said while he personally wishes to maintain friendly relations with China, years of one-sided economic dealings have left the US with no choice but to take firm action.“I want to be nice to China. But China has been very rough with us over the years because we had presidents that weren’t smart from a business standpoint… They allowed China and every other country to take advantage of us,” Trump added.The US President noted that his earlier trade deals with the European Union, Japan and South Korea were built on tariffs, which he considers a tool for “national security”.“I made a deal with the European Union. I made a deal with Japan and South Korea. A lot of these deals are great deals. It’s about national security. I was able to do it because of tariffs. We’re getting hundreds of billions, even trillions, of dollars paid into the United States… We’ll start paying off debt,” Trump added.Trump’s announcement underscores the intensifying “secondary tariff” strategy that Washington is deploying against countries perceived to be indirectly aiding Russia’s war efforts in Ukraine through its energy trade.While previous measures targeted India, where a 50 per cent tariff was imposed for Russian oil imports, this move conveys a broader escalation toward China, the world’s largest importer of Russian crude.Earlier, also Trump, in a post on Truth Social, announced an additional 100 per cent tariff on Chinese goods “over and above any tariff that they are currently paying”, effective November 1.The US President noted that the decision was taken after what he described as China taking “an extraordinarily aggressive position on trade” by sending “an extremely hostile letter to the world”.He also said that export controls will be placed on all critical software starting the same day.“Based on the fact that China has taken this unprecedented position, and speaking only for the USA, and not other Nations who were similarly threatened, starting November 1, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying. Also on November 1, we will impose Export Controls on any and all critical software,” his post read.“It has just been learnt that China has taken an extraordinarily aggressive position on trade in sending an extremely hostile letter to the world, stating that they were going to, effective November 1, 2025, impose large-scale Export Controls on virtually every product they make, and some not even made by them. This affects ALL Countries, without exception, and was obviously a plan devised by them years ago. It is absolutely unheard of in International Trade, and a moral disgrace in dealing with other Nations,” it added. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/trump-says-he-wants-to-be-nice-to-china-but-slaps-155-tariffs-from-nov-1-9650665.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-10-22 00:00:08","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":-0.162},{"id":371386470,"title":"MP SPEAKS | Export-led industrialisation key to sustainable growth","text":"MP SPEAKS | Investment, Trade and Industry Tengku Zafrul Aziz has reiterated the government’s commitment in Parliament to seek new markets in Africa, Latin America, the Middle East and the Asia Pacific for Malaysian products to replace or substitute those closed by the loss of markets in the United States due to the ongoing tariff war.Apart from the general reciprocal tariffs of 19 percent effective Oct 7, Malaysia faces possible tariffs of 25-30 percent for upholstered furniture, 25-50 percent for kitchen cabinets and vanities, 10 percent for lumber wood, 100 percent for branded pharmaceuticals and patents, as well as up to 300 percent for semiconductors.Those who discredit export-led industrialisation policy ignore the tremendous progress that many countries have made over 40 years, including helping to lift millions of Malaysians out of poverty.However, nothing stands in comparison to the miraculous achievement of China in lifting 800 million people out of poverty, the greatest economic success in modern history. In the process, China has transformed its economy to become the second largest and soon to be the largest economy in the world.Foreign investment fuelling the export-led industrialisation policy provided the financial wherewithal for poverty eradication without losing sight of graduating and evolving from low-cost manufacturing to cutting-edge innovation.Not blithely dismissedThere is no doubt that export-led industrialisation policy is a vital cog of a rational economic model that should not be blithely dismissed as a race to the bottom in terms of low wages, low skill sets, low value, and low technology.Instead, China’s sterling success in using the industrialisation policy as a launching pad to upgrade, upskill and uplift its economy is a testimony to its effectiveness.First, upgrading its work system, manufacturing processes or advanced digital and AI technology.Second, upskilling its workforce to learn or master new digital and AI technologies to enhance performance.Finally, uplift the team to think globally and adapt to changing market needs.Those who attempt to abandon the export-led industrialisation policy have overlooked the fact that many countries still seek new markets after access to the US markets was limited following the imposition of the tariff war by Donald Trump.It is too early to test out a new model that is still unsubstantiated by evidence and remains subjective and even speculative.For this reason, Zafrul, in reply to my question in Parliament, agreed with me and has provided RM1 billion in loan guarantees and RM500 billion in easy financing for small and medium enterprises affected by the US tariffs.US President Donald TrumpThis financial assistance by the government underlines the importance of continuing Malaysia’s export-led industrialisation policy.Clearly, the export-led industrialisation policy is still the economic policy of choice for Malaysia’s sustainable growth and prosperity.LIM GUAN ENG is Bagan MP.The views expressed here are those of the author/contributor and do not necessarily represent the views of Malaysiakini.","summary":"Discrediting policy ignores tremendous progress many countries have made in 40 years.","url":"https://www.malaysiakini.com/columns/758666","image":"https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2022/08/ae4da007961582a4fd6bb5608e2ee249.jpg","video":null,"publish_date":"2025-10-22 00:00:00","author":"Lim Guan Eng","authors":["Lim Guan Eng"],"language":"en","source_country":"my","sentiment":0.231},{"id":371379064,"title":"Trump says he’d have final say on money he seeks over past federal investigations into his conduct","text":"WASHINGTON (AP) — President Donald Trump said Tuesday that the federal government owes him “a lot of money” for prior Justice Department investigations into his actions and insisted he would have the ultimate say on any payout because any decision will “have to go across my desk.”\n\nTrump’s comments to reporters at the White House came in response to questions about a New York Times story that said he had filed administrative claims before being reelected seeking roughly $230 million in damages related to the FBI’s 2022 search of his Mar-a-Lago property for classified documents and for a separate investigation into potential ties between Russia and his 2016 presidential campaign.\n\nTrump said Tuesday he did not know the dollar figures involved and suggested he had not spoken to officials about it. But, he added, “All I know is that, they would owe me a lot of money.”\n\nThough the Justice Department has a protocol for reviewing such claims, Trump asserted, “It’s interesting, ’cause I’m the one that makes the decision, right?”\n\n“That decision would have to go across my desk,” he added.\n\nHe said he could donate any taxpayer money or use it to help pay for a ballroom he’s building at the White House.\n\nThe status of the claims and any negotiations over them within the Justice Department was not immediately clear. One of Trump’s lead defense lawyers in the Mar-a-Lago investigation, Todd Blanche, is now the deputy attorney general at the Justice Department. The current associate attorney general, Stanley Woodward, represented Trump’s valet and co-defendant, Walt Nauta, in the same case.\n\n“In any circumstance, all officials at the Department of Justice follow the guidance of career ethics officials,” a Justice Department spokesperson said. A White House spokesperson referred comment to the Justice Department.\n\nTrump signaled his interest in compensation during a White House appearance last week with Blanche, FBI Director Kash Patel and Attorney General Pam Bondi, who was part of Trump’s legal team during one of the impeachment cases against him.\n\n“I have a lawsuit that was doing very well, and when I became president, I said: ‘I’m suing myself. I don’t know. How do you settle the lawsuit?’” he said. ”I’ll say, ‘Give me X dollars,’ and I don’t know what to do with the lawsuit. It’s a great lawsuit and now I won, it looks bad. I’m suing myself, so I don’t know.”\n\nThe Times said the two claims were filed with the Justice Department as part of a process that seeks to resolve federal complaints through settlements and avert litigation.\n\nOne of the administrative claims, filed in August 2024 and reviewed by The Associated Press, seeks compensatory and punitive damages over the search of his Mar-a-Lago estate and the resulting case alleging he hoarded classified documents and thwarted government efforts to retrieve them.\n\nHis lawyer who filed the claim alleged the case was a “malicious prosecution” carried out by the Biden administration to hurt Trump’s bid to reclaim the White House, forcing Trump to spend tens of millions of dollars in his defense.\n\nThat investigation produced criminal charges that Justice Department special counsel Jack Smith abandoned last November because of department policy against the indictment of a sitting president.\n\nThe Times said the other complaint seeks damages related to the long-concluded Trump-Russia investigation, which continues to infuriate the president.","summary":"The status of the claims and any negotiations over them was not immediately clear.","url":"https://www.sandiegouniontribune.com/2025/10/21/trump-investigations-doj-payout/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Trump_83654-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:55:55","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.556},{"id":371379774,"title":"Trump says he’d have final say on money he seeks over past federal investigations into his conduct","text":"WASHINGTON (AP) — President Donald Trump said Tuesday that the federal government owes him “a lot of money” for prior Justice Department investigations into his actions and insisted he would have the ultimate say on any payout because any decision will “have to go across my desk.”\n\nTrump’s comments to reporters at the White House came in response to questions about a New York Times story that said he had filed administrative claims before being reelected seeking roughly $230 million in damages related to the FBI’s 2022 search of his Mar-a-Lago property for classified documents and for a separate investigation into potential ties between Russia and his 2016 presidential campaign.\n\nTrump said Tuesday he did not know the dollar figures involved and suggested he had not spoken to officials about it. But, he added, “All I know is that, they would owe me a lot of money.”\n\nThough the Justice Department has a protocol for reviewing such claims, Trump asserted, “It’s interesting, ’cause I’m the one that makes the decision, right?”\n\n“That decision would have to go across my desk,” he added.\n\nHe said he could donate any taxpayer money or use it to help pay for a ballroom he’s building at the White House.\n\nThe status of the claims and any negotiations over them within the Justice Department was not immediately clear. One of Trump’s lead defense lawyers in the Mar-a-Lago investigation, Todd Blanche, is now the deputy attorney general at the Justice Department. The current associate attorney general, Stanley Woodward, represented Trump’s valet and co-defendant, Walt Nauta, in the same case.\n\n“In any circumstance, all officials at the Department of Justice follow the guidance of career ethics officials,” a Justice Department spokesperson said. A White House spokesperson referred comment to the Justice Department.\n\nTrump signaled his interest in compensation during a White House appearance last week with Blanche, FBI Director Kash Patel and Attorney General Pam Bondi, who was part of Trump’s legal team during one of the impeachment cases against him.\n\n“I have a lawsuit that was doing very well, and when I became president, I said: ‘I’m suing myself. I don’t know. How do you settle the lawsuit?’” he said. ”I’ll say, ‘Give me X dollars,’ and I don’t know what to do with the lawsuit. It’s a great lawsuit and now I won, it looks bad. I’m suing myself, so I don’t know.”\n\nThe Times said the two claims were filed with the Justice Department as part of a process that seeks to resolve federal complaints through settlements and avert litigation.\n\nOne of the administrative claims, filed in August 2024 and reviewed by The Associated Press, seeks compensatory and punitive damages over the search of his Mar-a-Lago estate and the resulting case alleging he hoarded classified documents and thwarted government efforts to retrieve them.\n\nHis lawyer who filed the claim alleged the case was a “malicious prosecution” carried out by the Biden administration to hurt Trump’s bid to reclaim the White House, forcing Trump to spend tens of millions of dollars in his defense.\n\nThat investigation produced criminal charges that Justice Department special counsel Jack Smith abandoned last November because of department policy against the indictment of a sitting president.\n\nThe Times said the other complaint seeks damages related to the long-concluded Trump-Russia investigation, which continues to infuriate the president.","summary":"The status of the claims and any negotiations over them was not immediately clear.","url":"https://www.twincities.com/2025/10/21/trump-investigations-doj-payout/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Trump_83654-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-21 23:55:55","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.556},{"id":371383612,"title":"Trump says he’d have final say on money he seeks over past federal investigations into his conduct","text":"WASHINGTON (AP) — President Donald Trump said Tuesday that the federal government owes him “a lot of money” for prior Justice Department investigations into his actions and insisted he would have the ultimate say on any payout because any decision will “have to go across my desk.”\n\nTrump’s comments to reporters at the White House came in response to questions about a New York Times story that said he had filed administrative claims before being reelected seeking roughly $230 million in damages related to the FBI’s 2022 search of his Mar-a-Lago property for classified documents and for a separate investigation into potential ties between Russia and his 2016 presidential campaign.\n\nTrump said Tuesday he did not know the dollar figures involved and suggested he had not spoken to officials about it. But, he added, “All I know is that, they would owe me a lot of money.”\n\nThough the Justice Department has a protocol for reviewing such claims, Trump asserted, “It’s interesting, ’cause I’m the one that makes the decision, right?”\n\n“That decision would have to go across my desk,” he added.\n\nHe said he could donate any taxpayer money or use it to help pay for a ballroom he’s building at the White House.\n\nThe status of the claims and any negotiations over them within the Justice Department was not immediately clear. One of Trump’s lead defense lawyers in the Mar-a-Lago investigation, Todd Blanche, is now the deputy attorney general at the Justice Department. The current associate attorney general, Stanley Woodward, represented Trump’s valet and co-defendant, Walt Nauta, in the same case.\n\n“In any circumstance, all officials at the Department of Justice follow the guidance of career ethics officials,” a Justice Department spokesperson said. A White House spokesperson referred comment to the Justice Department.\n\nTrump signaled his interest in compensation during a White House appearance last week with Blanche, FBI Director Kash Patel and Attorney General Pam Bondi, who was part of Trump’s legal team during one of the impeachment cases against him.\n\n“I have a lawsuit that was doing very well, and when I became president, I said: ‘I’m suing myself. I don’t know. How do you settle the lawsuit?’” he said. ”I’ll say, ‘Give me X dollars,’ and I don’t know what to do with the lawsuit. It’s a great lawsuit and now I won, it looks bad. I’m suing myself, so I don’t know.”\n\nThe Times said the two claims were filed with the Justice Department as part of a process that seeks to resolve federal complaints through settlements and avert litigation.\n\nOne of the administrative claims, filed in August 2024 and reviewed by The Associated Press, seeks compensatory and punitive damages over the search of his Mar-a-Lago estate and the resulting case alleging he hoarded classified documents and thwarted government efforts to retrieve them.\n\nHis lawyer who filed the claim alleged the case was a “malicious prosecution” carried out by the Biden administration to hurt Trump’s bid to reclaim the White House, forcing Trump to spend tens of millions of dollars in his defense.\n\nThat investigation produced criminal charges that Justice Department special counsel Jack Smith abandoned last November because of department policy against the indictment of a sitting president.\n\nThe Times said the other complaint seeks damages related to the long-concluded Trump-Russia investigation, which continues to infuriate the president.","summary":"The status of the claims and any negotiations over them was not immediately clear.","url":"https://www.ocregister.com/2025/10/21/trump-investigations-doj-payout/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Trump_83654-1-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:55:55","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.556},{"id":371380034,"title":"EU must do everything for Putin-Trump meeting to achieve peace in Ukraine — Fico","text":"BRATISLAVA, October 22. /TASS/. Slovak Prime Minister Robert Fico believes that the European Union must do everything for a meeting between Russian President Vladimir Putin and his US counterpart Donald Trump in Budapest to happen as soon as possible if the alliance indeed wants peace in Ukraine.\n\n\"If the EU really wants a quick peace in Ukraine, which I do not believe in, it should do everything to make the Trump-Putin meeting happen in Budapest without any obstacles and as quickly as possible. The soonest Trump-Putin summit in Budapest, unhindered and with the EU’s full support - that is my official position,\" he wrote on his page on Facebook (prohibited in Russia due to ownership by Meta, which has been designated an extremist organization).\n\nAccording to him, \"the meeting of the American and Russian presidents in Budapest has not yet been agreed on and there is already clear evidence of efforts to prevent it at all costs. It's a sad thing to see.\" \"I have always said that the EU has turned into a war cabinet, that a significant part of EU member states support the war in Ukraine in the naive belief that it is possible to weaken and defeat Russia this way,\" Fico asserted.","summary":"Slovak Prime Minister Robert Fico pointed out that there is already clear evidence of efforts to prevent it at all costs","url":"https://tass.com/world/2033255","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20251022/1456735.jpg","video":null,"publish_date":"2025-10-21 23:55:05","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.593},{"id":371383376,"title":"What to know about efforts to block National Guard deployments in Chicago, Portland, other US cities","text":"President Donald Trump’s attempts to deploy the military in Democratic-led cities — over the objections of mayors and governors — has brought a head-spinning array of court challenges and overlapping rulings.\n\nAs the U.S. Supreme Court ponders whether to clear the way for the National Guard in Chicago, a federal appeals court is hearing arguments in California Gov. Gavin Newsom’s challenge to the deployment of troops in Los Angeles. Guard troops could also soon be on the ground in Portland, Oregon, pending legal developments there. \n\nHere are some things to know about legal efforts to block, or deploy, National Guard troops in various cities.\n\n Supreme Court ruling to come; federal judge weighs National Guard in Chicago \n\nA federal judge in Chicago already blocked deployment of National Guard troops to the Chicago area for two weeks. On Wednesday, she'll hold a hearing to consider whether to extend that order — but anything she does could be moot if the U.S. Supreme Court rules in the meantime. \n\nAttorneys representing the Trump administration said in court filings Tuesday that they would agree to possibly extend the block on deployment of troops for 30 days. However, they are also continuing to ask the U.S. Supreme Court to intervene. The Trump administration is pressing for an emergency order from the U.S. Supreme Court that would allow Guard troops to be deployed.\n\n“Every day this improper TRO remains in effect imposes grievous and irreparable harm on the Executive,” Solicitor General D. John Sauer wrote in a Supreme Court filing Tuesday. \n\nLawyers representing Chicago and Illinois have asked that the Supreme Court continue to block the deployment to the Chicago area, calling it a “dramatic step.”\n\n National Guard deployment in Portland also in limbo \n\nTrump’s efforts to deploy troops in Portland, Oregon, are similarly in limbo. An appeals court said Monday that Trump could take command of 200 Oregon National Guard troops, but for now a separate court order blocks him from actually deploying them.\n\nU.S. District Judge Karin Immergut, a Trump appointee, issued two temporary restraining orders early this month. One prohibited Trump from calling up the Oregon troops so he could send them to Portland. The other prohibited him from sending any National Guard members to Oregon at all, after he tried to evade the first order by deploying California troops instead.\n\nThe Justice Department appealed the first order, and in a 2-1 ruling Monday, a panel from the 9th U.S. Circuit Court of Appeals sided with the administration.\n\nHowever, Immergut’s second order remains in effect, so no troops may immediately be deployed. \n\nThe case is still before the courts.\n\n Legal battle in California goes before appellate panel \n\nA panel of judges with the 9th U.S. Circuit Court of Appeals in Pasadena is set to hear arguments Wednesday related to Trump’s deployment of National Guard troops to Los Angeles.\n\nA district court found the Trump administration violated federal law when he sent the troops to Los Angeles in early June after protests to his immigration crackdown.\n\nJudge Charles Breyer handed Newsom an early victory in the case on June 13 when he ordered control of National Guard troops back to California. But in an emergency ruling, an appeals court panel sided with the Trump administration, allowing the troops to remain in federal hands as the lawsuit unfolds.\n\nThe appeals court will weigh whether to vacate Breyer’s June order.\n\nThe same three-judge panel is also handling the Trump administration’s appeal to a Sept. 2 ruling by Breyer who found the president violated the Posse Comitatus Act, an 1878 law that prohibits military enforcement of domestic laws.\n\n Groups aim to stop National Guard deployment in D.C. \n\nIn Charleston, West Virginia, a state court hearing is set for Friday in a lawsuit filed by two groups who want to block the deployment of the state National Guard to Washington, D.C. More than 300 Guard members have been in the nation’s capital supporting Trump’s initiative since late August.\n\n Democrats sue to stop National Guard deployment in Memphis \n\nIn Tennessee, Democratic elected officials sued last Friday to try to stop the ongoing Guard deployment in Memphis. They said Republican Gov. Bill Lee, acting on a request from Trump, violated the state constitution, which says the Guard can be called up during “rebellion or invasion” but only with the blessing of state lawmakers.\n\nSince their arrival on Oct. 10, troops have been patrolling areas of downtown Memphis, including near the iconic Pyramid, wearing fatigues and protective vests that say “military police,” with guns in holsters. Officials have said Guard members have no arrest power.\n\nAssociated Press writers Gene Johnson in Seattle, Mark Sherman in Washington, D.C., Olga R. Rodríguez in San Francisco, Adrian Sainz in Memphis, and John Raby in Charleston, West Virginia contributed to this report.","summary":"President Donald Trump’s attempts to deploy the military in Democratic-led cities _ over the objections of mayors and governors _ has brought a head-spinning array of court challenges and overlapping rulings","url":"https://www.independent.co.uk/news/donald-trump-portland-national-guard-oregon-gavin-newsom-b2849705.html","image":"https://static.independent.co.uk/2025/10/22/00/Chicago_Immigration_89837.jpg?width=1200","video":null,"publish_date":"2025-10-21 23:51:04","author":"Christine Fernando","authors":["Christine Fernando"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.181},{"id":371380610,"title":"GOP lawmakers warn Trump's Argentina beef proposal could rattle US ranchers","text":"FIRST ON FOX: A group of House Republicans is raising concerns about the potential effects of the U.S. importing Argentinian beef after President Donald Trump floated the idea earlier this week. Rep. Julie Fedorchak, R-N.D., is leading seven other House GOP lawmakers in a letter to the president on Tuesday evening, warning the potential plan has rattled the multibillion-dollar American ranching industry. \"America’s cattle producers are among the most resilient and hardworking in the nation,\" the Republicans wrote. \"Collectively, the cattle industry supports thousands of jobs across our districts and contributes $112 billion to rural economies nationwide.\" \"In recent days, we have heard strong concerns from producers regarding reports that the U.S. may import beef from Argentina.\" HOUSE PASSES TRUMP-BACKED PLAN TO AVERT GOVERNMENT SHUTDOWN The House Republicans acknowledged the \"importance of strong trade relationships and diverse markets\" but added that beef producers in their districts \"are seeking clarity on how this decision will be made, what safety and inspection standards will apply, and how this policy aligns with your administration’s commitment to strengthening American agriculture.\" Trump suggested Sunday that buying beef from Argentina could help lower prices for Americans at home, amid a wider promise to lower costs for U.S. citizens. \"One of the things we're thinking about doing is beef from Argentina,\" Trump told reporters aboard Air Force One. He later elaborated in his conversation with reporters, \"We would buy some beef from Argentina. If we do that, that will bring our beef prices down.\" \"Our groceries are down, our energy prices are down. I think we're going to have $2 gasoline pretty soon. We're getting close and everything's down. The one thing that's kept up is beef,\" Trump said. He added that it would not be \"that much\" but argued it would help Argentina, a U.S. ally, as well. 58 HOUSE DEMS VOTE AGAINST RESOLUTION HONORING 'LIFE AND LEGACY' OF CHARLIE KIRK But the House Republicans questioned whether imported beef would be held to the same food safety and animal health requirements as that of the U.S., which they called \"the gold standard.\" \"Any import policy must hold foreign suppliers to those same rigorous standards. Introducing beef from countries with inconsistent safety or inspection records could undermine the confidence that U.S. ranchers have worked decades to earn,\" the lawmakers warned. \"We respectfully request additional information on this matter and urge your administration to ensure that any future decisions are made with full transparency, sound science, and a firm commitment to the U.S. cattle industry. America’s producers can compete with anyone in the world. If given an opportunity, they will continue to respond quickly to the market demand for more quality American beef in our grocery stores.\" In addition to Fedorchak, the letter is also signed by Reps. Michelle Fischbach, R-Minn., Troy Downing, R-Mont., Gabe Evans, R-Colo., Dusty Johnson, R-S.D., Derek Schmidt, R-Kan., Jeff Hurd, R-Colo., and Republican Study Committee Chair August Pfluger, R-Texas. White House spokesman Kush Desai told Fox News Digital in response, \"The Trump administration remains committed to addressing the needs and concerns of American cattle producers and safeguarding their interests at home and abroad. That’s why the administration has secured billions in new export opportunities for American agricultural products in our historic trade deals with the UK, Japan, the EU, and others.\" \"It’s also why the administration is focused on reversing a prolonged decrease in the supply of live cattle by growing American cattle herds with robust action to deliver disaster relief to cattle country, support new ranchers, and reduce risk for cattle producers,\" Desai said. Trump's proposal has stirred some anxiety among some Republicans whose constituencies depend on cattle ranching. Sen. Deb Fischer, R-Neb., posted on X Tuesday, \"If the goal is addressing beef prices at the grocery store, this isn’t the way.\" \"The U.S. has safe, reliable beef, and it is the one bright spot in our struggling ag economy. Nebraska’s ranchers cannot afford to have the rug pulled out from under them when they’re just getting ahead or simply breaking even,\" Fischer wrote. Meanwhile, Fox News Digital was told that Rep. Harriet Hageman, R-Wyo., also raised significant concerns about what importing beef from Argentina could do to the U.S. cattle ranching industry during a call with fellow House Republicans on Tuesday. CLICK HERE TO GET THE FOX NEWS APP But some Republican responses were more muted. Sen. Markwayne Mullin, R-Okla., told reporters that Trump \"definitely identified a problem\" regarding a shortage of cattle in the U.S. He added, \"I understand what he's trying to get done. I think there's more ways to implement it.\" Fedorchak herself told Fox News Digital, \"We’ve all received a number of questions and calls from our constituents over the last few days, so we are asking for clarity on the administration’s long-term plans. Our farmers and ranchers stand ready to deliver on the president’s America-First agenda. North Dakotans take great pride in producing the safest, highest-quality beef in the world — and we should be building on that success.\"","summary":"Eight House GOP lawmakers expressed concerns about President Donald Trump&apos;s proposal to import beef from Argentina to lower U.S. grocery prices for consumers.","url":"https://www.foxnews.com/politics/gop-lawmakers-warn-trumps-argentina-beef-proposal-could-rattle-us-ranchers","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/president-donald-trump-speaking-october-2025.jpg","video":null,"publish_date":"2025-10-21 23:50:45","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":371376992,"title":"Trump's embattled nominee for Special Counsel drops out amid racist text scandal","text":"Controversial White House Office of Special Counsel nominee Paul Ingrassia has dropped out after racist text messages he allegedly sent were published. \n\nIngrassia was Donald Trump's pick to lead OSC but he became the latest conservative ensnared in a text message scandal involving a group chat of Young Republicans. \n\nThe chats released by Politico on Monday set off alarm bells for several top-ranking GOP Senators, who are now saying they oppose his nomination.\n\nIngrassia, who at one point had his own mother lobbying for him in Washington, announced he was bowing out on Truth Social. \n\n'I will be withdrawing myself from Thursday’s HSGAC hearing to lead the Office of Special Counsel because unfortunately I do not have enough Republican votes at this time,' Ingrassia wrote. \n\n'I appreciate the overwhelming support that I have received throughout this process and will continue to serve President Trump and this administration to Make America Great Again!' \n\nIngrassia is accused of racist tirades in a group chat with Republican friends. \n\nText messages released by Politico showed Ingrassia admitting he has a 'Nazi streak', it has been reported.\n\nThe messages include calling for MLK day to be 'tossed into the seventh circle of hell where it belongs', adding that there should be 'no moulignon holidays,' using an Italian slur for black people.\n\nRepublican Senate Majority Leader John Thune asked the White House to withdraw Ingrassia's nomination, adding, 'he's not going to pass.'\n\nFlorida Republican Senator Rick Scott told reporters Monday evening that he does 'not support' Ingrassia's nomination. \n\nIngrassia, who already serves in a non-Senate confirmed role at the Department of Homeland Security was additionally revealed earlier this month to have allegedly sexually harassed a female coworker on a work trip.\n\nThe DHS staffer was investigated for sexually harassing a lower-ranking female colleague after he canceled her hotel room so they would be forced to share a room together. \n\nIn regard to the sexual harassment allegations, Ingrassia's lawyer, Edward Andrew Paltzik told the Daily Mail, 'Mr. Ingrassia has never harassed any coworkers — female or otherwise, sexually or otherwise — in connection with any employment.'\n\nPolitico reported that White House liaison for the Department of Homeland Security, Paul Ingrassia faced a probe over a July business trip with other DHS staffers to Orlando, Florida.\n\nUpon arriving at the front desk Ritz-Carlton hotel in Orlando, an unnamed lower-ranking female colleague was informed she did not have a room. Ingrassia then told the staffer she would be staying with him, according to Politico who cited five administration officials familiar with the event.\n\nPaltzik additionally told Daily Mail the following about Ingrassia's alleged text messages:\n\n'In this age of AI, authentication of allegedly leaked messages, which could be outright falsehoods, doctored, or manipulated, or lacking critical context, is extremely difficult. What is certain, though, is that there are individuals who cloak themselves in anonymity while executing their underhanded personal agendas to harm Mr. Ingrassia at all costs.'\n\n'We do not concede the authenticity of any of these purported messages. Moreover, even if, arguendo, the texts are authentic, they clearly read as self-deprecating and satirical humor making fun of the fact that liberals outlandishly and routinely call MAGA supporters 'Nazis.' In reality, Mr. Ingrassia has incredible support from the Jewish community because Jews know that Mr. Ingrassia is the furthest thing from a Nazi,' Paltzik added.\n\nIngrassia was originally nominated for the Office of Special Counsel in June. He was set to be voted on with a slew of other nominees at the end of July, when he was pulled from the noticed calendar.\n\nIngrassia has additionally associated with the likes of far-right media personalities Andrew Tate and Nick Fuentes.","summary":"Paul Ingrassia was Donald Trump's pick to lead OSC but he became the latest conservative revealed by a series of reports on text messages from New York State Young Republicans.","url":"https://www.dailymail.co.uk/news/article-15214817/Donald-Trump-nominee-Paul-Ingrassia-racist-text-scandal.html","image":"https://i.dailymail.co.uk/1s/2025/10/22/00/103155969-0-Paul_Ingrassia_who_has_been_selected_by_President_Donald_Trump_t-a-8_1761090506087.jpg","video":null,"publish_date":"2025-10-21 23:50:07","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.238},{"id":371379934,"title":"Trump reportedly seeks damages from own justice department","text":"US President Donald Trump said he would give any money received to charity or to the White House. (AP pic)\nWASHINGTON: US President Donald Trump addressed reports Tuesday that he was seeking hundreds of millions of dollars in damages from his own justice department, saying it would be \"awfully strange\" to effectively pay himself.\nThe New York Times reported that lawyers for Trump were demanding around US$230 million in compensation for federal investigations into him before he was elected president for a second time.\n\"They probably owe me a lot of money - if I get money from our country, I will do something nice with it like to give it to charity or give it to the White House,\" Trump told reporters in the Oval Office.\n\"That decision would have to go across my desk. And it's awfully strange to make a decision where I'm paying myself.... But I was damaged very greatly.\"\nHe later said that he did \"not know the numbers\".\nTrump has launched a series of legal cases against media firms and other organisations he accuses of bias against him, in some cases winning huge sums.\nBut a situation in which a US president seeks compensation from the very government he heads has \"no parallel in American history,\" the Times said, adding that it also threw up major ethical conflicts.\nOne of Trump's former lawyers, Todd Blanche, is now the deputy US attorney general at the Justice Department.\nA spokesman for Trump's legal team did not directly confirm the New York Times story but told AFP that the president \"continues to fight back against all Democrat-led witch hunts\".\nThese included the investigation into alleged collusion between Trump's 2016 election campaign and Russia, and the \"weaponization\" of the US justice system by then-president Joe Biden, the spokesman said.\nTrump faced a series of federal investigations after his first presidency into the alleged mishandling of classified material and attempts to overturn the results of the 2020 presidential election that Biden won.\nThey were abandoned when Trump was reelected last year.\nTrump has also been convicted of 34 felonies related to hush money payments to a porn star in a case in New York State.","summary":"Donald Trump's lawyers are reportedly demanding around US$230 million in compensation for federal investigations into him after his first presidency.","url":"https://www.freemalaysiatoday.com/category/world/2025/10/22/trump-reportedly-seeks-damages-from-own-justice-department","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/10/323e2182-donald-trump-6.jpg","video":null,"publish_date":"2025-10-21 23:49:52","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.555},{"id":371381246,"title":"Naib Presiden AS yakin dengan gencatan senjata Gaza kekal","text":"KIRYAT GAT: Naib Presiden Amerika Syarikat (AS), JD Vance, menyatakan beliau yakin bahawa gencatan senjata di Gaza akan kekal.\n\nBeliau berkata demikian dalam rangka lawatan ke Israel yang bertujuan mengukuhkan sokongan terhadap pelan damai dan rancangan pembangunan semula pasca perang.\n\nWalaupun wujud kebimbangan di pihak Israel bahawa Hamas mengambil kesempatan daripada tempoh ini untuk menegakkan semula kuasanya di Gaza, Vance menegaskan Washington tidak akan menetapkan tarikh akhir bagi kumpulan itu untuk melucutkan senjata di bawah perjanjian yang diuruskan oleh AS.\n\nKenyataan itu dibuat selepas Presiden AS, Donald Trump, sebelum ini memberi amaran bahawa negara-negara sekutu di rantau itu akan menyerang Gaza dan menghapuskan Hamas jika kumpulan itu gagal mematuhi gencatan senjata terbabit.\n\n\"Apa yang kita lihat sepanjang minggu lalu memberi saya optimisme yang tinggi bahawa gencatan senjata ini akan kekal,\" kata Vance dalam sidang media di Kiryat Gat, sebuah bandar di selatan Israel di mana misi pemantauan gencatan senjata yang dipimpin AS beroperasi.\n\n\"Saya rasa semua orang patut berbangga dengan kedudukan kita hari ini. Ia memerlukan usaha berterusan, pemantauan dan penyeliaan yang berterusan,\" tambahnya.\n\nVance dijadual bertemu pemimpin Israel termasuk Perdana Menteri, Benjamin Netanyahu di Baitulmaqdis esok.\n\nSementara itu Hamas memaklumkan mereka memerlukan masa dan bantuan teknikal untuk mencari mayat tebusan Israel yang masih terperangkap di bawah runtuhan di Semenanjung Gaza.\n\nAhad lalu, berlaku kejadian keganasan paling buruk sejak permulaan gencatan senjata, apabila dua askar Israel terbunuh, mencetuskan serangan udara balas yang hebat.\n\nSebelum ketibaan Vance, Presiden AS, Donald Trump telah mengeluarkan amaran keras kepada Hamas.\n\n\"Banyak sekutu hebat kita di Asia Barat, dan kawasan sekitar Asia Barat, telah... memaklumkan kepada saya bahawa mereka mengalu-alukan peluang, atas permintaan saya, untuk masuk ke Gaza dengan pasukan yang kuat dan 'membetulkan' Hamas sekiranya Hamas terus bertindak buruk,\" tulis Trump di platform media sosialnya, Truth Social.","summary":"KIRYAT GAT: Naib Presiden Amerika Syarikat (AS), JD Vance, menyatakan beliau yakin bahawa gencatan senjata di Gaza akan kekal.","url":"https://www.bharian.com.my/dunia/amerika/2025/10/1461754/naib-presiden-yakin-dengan-gencatan-senjata-gaza-kekal","image":"https://assets.bharian.com.my/images/articles/BH22truce-o_BHfield_image_listing_featured.var_1761090450.jpg","video":null,"publish_date":"2025-10-21 23:47:37","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.373},{"id":371380606,"title":"Racist text scandal sinks Trump nominee for government watchdog post","text":"Paul Ingrassia withdrew his nomination to lead a government watchdog agency on Tuesday after his inflammatory rhetoric came to a head this week in a report about race-fueled text messages he purportedly sent. Ingrassia's decision to remove himself from consideration comes two days before the Senate Committee on Homeland Security & Governmental Affairs was set to consider his nomination. \"I will be withdrawing myself from Thursday’s HSGAC hearing to lead the Office of Special Counsel because unfortunately I do not have enough Republican votes at this time,\" Ingrassia wrote on social media. Senate Majority Leader John Thune, R-S.D., quashed all hope of Ingrassia's confirmation on Monday, saying, \"He's not going to pass.\" When asked on Tuesday if it would be a mistake for Ingrassia to appear for his hearing, Thune laughed and said \"yeah.\" KEY TRUMP NOMINEES STALLED BY SENATE DEMS PUTS PRESSURE ON GOP LEADERS Ingrassia, 30, said in a group chat, according to Politico, that he sometimes had a \"Nazi streak\" in him, and he used the term \"moulignon,\" an Italian slur for black people, to call for doing away with Martin Luther King Jr. Day and Black History Month. The leaked chat was only the latest controversy as Ingrassia has floated around the administration. In July, Ingrassia faced a formal complaint from a lower-ranking female colleague who alleged, according to Politico, that when they arrived at a hotel for a work trip in Orlando, she found she did not have a room and was informed by Ingrassia that she would be sharing one with him. The woman, who did end up sharing a room with him, later retracted the complaint and Ingrassia also disputed it. Ingrassia has publicly defended social media influencer and self-described \"misogynist\" Andrew Tate, and previously worked at a law firm that said he was on Tate’s legal team before his July 2024 admission to the New York bar. Tate and his brother face U.K. charges of rape, actual bodily harm, human trafficking and controlling prostitution for gain, filed by the Crown Prosecution Service in May 2025. They deny the allegations. Ingrassia was first hired as a White House liaison at the Department of Justice, where he was briefly put in charge of hiring Trump loyalists at the department. But he abruptly left and took a job at the Department of Homeland Security instead. President Donald Trump nominated Ingrassia in May to lead the Office of Special Counsel, an independent agency (unaffiliated with the DOJ) that vets workplace complaints from federal employees. TRUMP EXPLOITS LOOPHOLES TO KEEP ALINA HABBA IN US ATTORNEY ROLE, TRIGGERING COURT CLASH \"Paul is a highly respected attorney, writer, and Constitutional Scholar, who has done a tremendous job serving as my White House Liaison for Homeland Security,\" Trump wrote on Truth Social at the time. Ingrassia denied the text messages to Politico, saying through his lawyer that even if they were real, \"they clearly read as self-deprecating and satirical humor making fun of the fact that liberals outlandishly and routinely call MAGA supporters ‘Nazis.’\" Ingrassia has been scrutinized time and again for controversial writings, and pressure had been building on Trump to yank his nomination. In a since deleted X post days after Hamas' terrorist attack on Israel, Ingrassia called the Palestine-Israel conflict a \"psyop.\" CLICK HERE TO GET THE FOX NEWS APP A coalition of Jewish organizations was among those who called for Ingrassia's nomination to be withdrawn. \"Mr. Ingrassia’s public statements and associations with people who espouse antisemitic, racist, and misogynistic views, raise serious questions about his ability to carry out these responsibilities with the integrity, impartiality, and commitment required of the office,\" the coalition wrote. Fox News Digital reached out to the White House on Ingrassia's announcement. Alex Miller contributed to this report.","summary":"Paul Ingrassia said he was removing himself from consideration to head the Office of Special Counsel amid reports of text messages containing racist language.","url":"https://www.foxnews.com/politics/trump-pulls-nominee-lead-government-watchdog-after-racist-text-scandal","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/07/paul-ingrassia-trump-nominee.jpg","video":null,"publish_date":"2025-10-21 23:47:23","author":"Ashley Oliver","authors":["Ashley Oliver"],"language":"en","category":"politics","source_country":"us","sentiment":-0.166},{"id":371379072,"title":"What to know about the $250 million ballroom Trump is adding to the White House","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — Construction started this week on the $250 million ballroom that President Donald Trump is adding to the White House as construction crews began tearing down the facade of the East Wing, where the new space is being built.\n\nThe Republican president and top White House officials had initially said nothing would be demolished during construction.\n\nThe 90,000-square-foot ballroom will dwarf the main White House itself, at nearly double the size, and Trump says it will accommodate 999 people.\n\nTrump said on social media that the ballroom won’t cost taxpayers a dime because it is being privately funded by “many generous Patriots, Great American Companies, and, yours truly.”\n\nHere are some things to know about the newest White House construction project:\n\nWhy is Trump building a ballroom?\n\nTrump says the White House needs a large entertaining space and has complained that the East Room, the current largest space in the White House, is too small, holding about 200 people. He has frowned on the past practice of presidents hosting state dinners and other large events in tents on the South Lawn.\n\nWho is paying the $250 million construction tab?\n\nTrump says the project will be paid for with private donations and that no public money will be spent on the ballroom. The White House promised to release information on which individuals and corporations have pledged or donated money and invited some of the donors to an East Room dinner last week, but has not released a comprehensive list and breakdown of funds.\n\nSome $22 million for the project came from YouTube, a Google subsidiary, as part of a recent settlement for a 2021 lawsuit Trump brought against the company.\n\nThe White House also has not said how much of his own money Trump is contributing.\n\nWhy tear down part of the East Wing to build the ballroom?\n\nThe East Wing is traditionally the social side of the White House and sits across East Executive Avenue from the Treasury Department. It’s where tourists and other guests enter for events.\n\nThe president and his chief spokesperson, Karoline Leavitt, said over the summer that the White House itself would remain intact as the ballroom was going up.\n\n“It’ll be near it but not touching it,” Trump said. “Nothing will be torn down,” Leavitt added.\n\nThat turned out not to be the case.\n\nThe White House said some demolition was needed because the East Wing, the traditional home for the first lady and her staff, is being modernized as part of the ballroom project.\n\nCan Trump build a ballroom?\n\nHe’s moving ahead with construction despite the lack of sign-off from the National Capital Planning Commission, the executive branch agency that has jurisdiction over construction and major renovations to government buildings in the region.\n\nTrump named a top White House aide, Will Scharf, to head the commission. Scharf has made a distinction between demolition work and rebuilding, saying the commission was only required to vet the latter.\n\nWhat happens to the East Room?\n\nBy Trump’s telling, it will become a space where guests will mingle, sip cocktails and eat hors d’oeuvres until they are called into the ballroom for dinner. Trump said a set of windows in the room will be removed to create a passageway to and from the ballroom.\n\nWhat will the new ballroom look like?\n\nRenderings released by the White House suggest a strong resemblance to the gilded ballroom at Mar-a-Lago, Trump’s private club and home in Palm Beach, Florida.\n\nThe project also has grown in size since it was announced, going from accommodating 650 seated guests to holding 999 people, big enough to fit an inauguration if needed, he said at a recent White House dinner for donors. Windows will be bulletproof, he said.\n\nWhen will the ballroom be completed?\n\nThe White House has said the ballroom will be ready for use before Trump’s second term ends in January 2029, an ambitious timeline.\n\nHas Trump made other changes to the White House?\n\nYes. He has heavily redecorated the Oval Office by adding numerous portraits, busts and gold-toned adornments. He converted the Rose Garden into a stone-covered patio, installed towering flagpoles on the north and south lawns, and decorated an exterior wall with portraits of every president except his immediate predecessor, Democrat Joe Biden.\n\nTrump also said he renovated the bathroom in the famous Lincoln Bedroom in the private living quarters and laid down marble floors in a passageway leading to the South Lawn.\n\nHow has construction changed the White House over the years?\n\nPresidents have added to the White House since construction began in 1792 for a host of reasons, and Trump aides say his decision to build a ballroom follows that long tradition.\n\nMany of the prior projects were criticized as being too costly or too lavish, but eventually came to be accepted, according to the White House Historical Association.\n\nThomas Jefferson added the east and west colonnades.\n\nAndrew Jackson built the North Portico on the Pennsylvania Avenue side of the White House, aligning with the South Portico that James Monroe added after the original mansion was rebuilt after the British burned it during the War of 1812.\n\nTheodore Roosevelt added the West Wing to provide dedicated space for the president and key staff, while Franklin D. Roosevelt added the East Wing, which over time became the home base for the first lady’s staff and social functions.\n\nOne of the most significant White House renovations happened under Harry Truman, when the mansion was found to be so structurally unsound that he ordered a complete gutting of the interior that lasted from 1948 to 1952. The project, including Truman’s addition of a balcony to the second floor of the South Portico, was highly controversial.\n\nOther changes include the creation of the Rose Garden during John F. Kennedy’s administration and Richard Nixon’s decision to convert an indoor swimming pool that was built for FDR’s physical therapy into a workspace for the growing White House press corps.","summary":"White House officials had initially said nothing would be demolished during construction.","url":"https://www.sandiegouniontribune.com/2025/10/21/trump-white-house-ballroom-what-to-know/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/White_House_Demolition_71645-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:43:11","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":0.07},{"id":371379786,"title":"What to know about the $250 million ballroom Trump is adding to the White House","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — Construction started this week on the $250 million ballroom that President Donald Trump is adding to the White House as construction crews began tearing down the facade of the East Wing, where the new space is being built.\n\nThe Republican president and top White House officials had initially said nothing would be demolished during construction.\n\nThe 90,000-square-foot ballroom will dwarf the main White House itself, at nearly double the size, and Trump says it will accommodate 999 people.\n\nTrump said on social media that the ballroom won’t cost taxpayers a dime because it is being privately funded by “many generous Patriots, Great American Companies, and, yours truly.”\n\nHere are some things to know about the newest White House construction project:\n\nWhy is Trump building a ballroom?\n\nTrump says the White House needs a large entertaining space and has complained that the East Room, the current largest space in the White House, is too small, holding about 200 people. He has frowned on the past practice of presidents hosting state dinners and other large events in tents on the South Lawn.\n\nWho is paying the $250 million construction tab?\n\nTrump says the project will be paid for with private donations and that no public money will be spent on the ballroom. The White House promised to release information on which individuals and corporations have pledged or donated money and invited some of the donors to an East Room dinner last week, but has not released a comprehensive list and breakdown of funds.\n\nSome $22 million for the project came from YouTube, a Google subsidiary, as part of a recent settlement for a 2021 lawsuit Trump brought against the company.\n\nThe White House also has not said how much of his own money Trump is contributing.\n\nWhy tear down part of the East Wing to build the ballroom?\n\nThe East Wing is traditionally the social side of the White House and sits across East Executive Avenue from the Treasury Department. It’s where tourists and other guests enter for events.\n\nThe president and his chief spokesperson, Karoline Leavitt, said over the summer that the White House itself would remain intact as the ballroom was going up.\n\n“It’ll be near it but not touching it,” Trump said. “Nothing will be torn down,” Leavitt added.\n\nThat turned out not to be the case.\n\nThe White House said some demolition was needed because the East Wing, the traditional home for the first lady and her staff, is being modernized as part of the ballroom project.\n\nCan Trump build a ballroom?\n\nHe’s moving ahead with construction despite the lack of sign-off from the National Capital Planning Commission, the executive branch agency that has jurisdiction over construction and major renovations to government buildings in the region.\n\nTrump named a top White House aide, Will Scharf, to head the commission. Scharf has made a distinction between demolition work and rebuilding, saying the commission was only required to vet the latter.\n\nWhat happens to the East Room?\n\nBy Trump’s telling, it will become a space where guests will mingle, sip cocktails and eat hors d’oeuvres until they are called into the ballroom for dinner. Trump said a set of windows in the room will be removed to create a passageway to and from the ballroom.\n\nWhat will the new ballroom look like?\n\nRenderings released by the White House suggest a strong resemblance to the gilded ballroom at Mar-a-Lago, Trump’s private club and home in Palm Beach, Florida.\n\nThe project also has grown in size since it was announced, going from accommodating 650 seated guests to holding 999 people, big enough to fit an inauguration if needed, he said at a recent White House dinner for donors. Windows will be bulletproof, he said.\n\nWhen will the ballroom be completed?\n\nThe White House has said the ballroom will be ready for use before Trump’s second term ends in January 2029, an ambitious timeline.\n\nHas Trump made other changes to the White House?\n\nYes. He has heavily redecorated the Oval Office by adding numerous portraits, busts and gold-toned adornments. He converted the Rose Garden into a stone-covered patio, installed towering flagpoles on the north and south lawns, and decorated an exterior wall with portraits of every president except his immediate predecessor, Democrat Joe Biden.\n\nTrump also said he renovated the bathroom in the famous Lincoln Bedroom in the private living quarters and laid down marble floors in a passageway leading to the South Lawn.\n\nHow has construction changed the White House over the years?\n\nPresidents have added to the White House since construction began in 1792 for a host of reasons, and Trump aides say his decision to build a ballroom follows that long tradition.\n\nMany of the prior projects were criticized as being too costly or too lavish, but eventually came to be accepted, according to the White House Historical Association.\n\nThomas Jefferson added the east and west colonnades.\n\nAndrew Jackson built the North Portico on the Pennsylvania Avenue side of the White House, aligning with the South Portico that James Monroe added after the original mansion was rebuilt after the British burned it during the War of 1812.\n\nTheodore Roosevelt added the West Wing to provide dedicated space for the president and key staff, while Franklin D. Roosevelt added the East Wing, which over time became the home base for the first lady’s staff and social functions.\n\nOne of the most significant White House renovations happened under Harry Truman, when the mansion was found to be so structurally unsound that he ordered a complete gutting of the interior that lasted from 1948 to 1952. The project, including Truman’s addition of a balcony to the second floor of the South Portico, was highly controversial.\n\nOther changes include the creation of the Rose Garden during John F. Kennedy’s administration and Richard Nixon’s decision to convert an indoor swimming pool that was built for FDR’s physical therapy into a workspace for the growing White House press corps.","summary":"White House officials had initially said nothing would be demolished during construction.","url":"https://www.twincities.com/2025/10/21/trump-white-house-ballroom-what-to-know/","image":"https://www.twincities.com/wp-content/uploads/2025/10/White_House_Demolition_71645-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-21 23:43:11","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":0.07},{"id":371380114,"title":"What to know about the $250 million ballroom Trump is adding to the White House","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — Construction started this week on the $250 million ballroom that President Donald Trump is adding to the White House as construction crews began tearing down the facade of the East Wing, where the new space is being built.\n\nThe Republican president and top White House officials had initially said nothing would be demolished during construction.\n\nThe 90,000-square-foot ballroom will dwarf the main White House itself, at nearly double the size, and Trump says it will accommodate 999 people.\n\nTrump said on social media that the ballroom won’t cost taxpayers a dime because it is being privately funded by “many generous Patriots, Great American Companies, and, yours truly.”\n\nHere are some things to know about the newest White House construction project:\n\nWhy is Trump building a ballroom?\n\nTrump says the White House needs a large entertaining space and has complained that the East Room, the current largest space in the White House, is too small, holding about 200 people. He has frowned on the past practice of presidents hosting state dinners and other large events in tents on the South Lawn.\n\nWho is paying the $250 million construction tab?\n\nTrump says the project will be paid for with private donations and that no public money will be spent on the ballroom. The White House promised to release information on which individuals and corporations have pledged or donated money and invited some of the donors to an East Room dinner last week, but has not released a comprehensive list and breakdown of funds.\n\nSome $22 million for the project came from YouTube, a Google subsidiary, as part of a recent settlement for a 2021 lawsuit Trump brought against the company.\n\nThe White House also has not said how much of his own money Trump is contributing.\n\nWhy tear down part of the East Wing to build the ballroom?\n\nThe East Wing is traditionally the social side of the White House and sits across East Executive Avenue from the Treasury Department. It’s where tourists and other guests enter for events.\n\nThe president and his chief spokesperson, Karoline Leavitt, said over the summer that the White House itself would remain intact as the ballroom was going up.\n\n“It’ll be near it but not touching it,” Trump said. “Nothing will be torn down,” Leavitt added.\n\nThat turned out not to be the case.\n\nThe White House said some demolition was needed because the East Wing, the traditional home for the first lady and her staff, is being modernized as part of the ballroom project.\n\nCan Trump build a ballroom?\n\nHe’s moving ahead with construction despite the lack of sign-off from the National Capital Planning Commission, the executive branch agency that has jurisdiction over construction and major renovations to government buildings in the region.\n\nTrump named a top White House aide, Will Scharf, to head the commission. Scharf has made a distinction between demolition work and rebuilding, saying the commission was only required to vet the latter.\n\nWhat happens to the East Room?\n\nBy Trump’s telling, it will become a space where guests will mingle, sip cocktails and eat hors d’oeuvres until they are called into the ballroom for dinner. Trump said a set of windows in the room will be removed to create a passageway to and from the ballroom.\n\nWhat will the new ballroom look like?\n\nRenderings released by the White House suggest a strong resemblance to the gilded ballroom at Mar-a-Lago, Trump’s private club and home in Palm Beach, Florida.\n\nThe project also has grown in size since it was announced, going from accommodating 650 seated guests to holding 999 people, big enough to fit an inauguration if needed, he said at a recent White House dinner for donors. Windows will be bulletproof, he said.\n\nWhen will the ballroom be completed?\n\nThe White House has said the ballroom will be ready for use before Trump’s second term ends in January 2029, an ambitious timeline.\n\nHas Trump made other changes to the White House?\n\nYes. He has heavily redecorated the Oval Office by adding numerous portraits, busts and gold-toned adornments. He converted the Rose Garden into a stone-covered patio, installed towering flagpoles on the north and south lawns, and decorated an exterior wall with portraits of every president except his immediate predecessor, Democrat Joe Biden.\n\nTrump also said he renovated the bathroom in the famous Lincoln Bedroom in the private living quarters and laid down marble floors in a passageway leading to the South Lawn.\n\nHow has construction changed the White House over the years?\n\nPresidents have added to the White House since construction began in 1792 for a host of reasons, and Trump aides say his decision to build a ballroom follows that long tradition.\n\nMany of the prior projects were criticized as being too costly or too lavish, but eventually came to be accepted, according to the White House Historical Association.\n\nThomas Jefferson added the east and west colonnades.\n\nAndrew Jackson built the North Portico on the Pennsylvania Avenue side of the White House, aligning with the South Portico that James Monroe added after the original mansion was rebuilt after the British burned it during the War of 1812.\n\nTheodore Roosevelt added the West Wing to provide dedicated space for the president and key staff, while Franklin D. Roosevelt added the East Wing, which over time became the home base for the first lady’s staff and social functions.\n\nOne of the most significant White House renovations happened under Harry Truman, when the mansion was found to be so structurally unsound that he ordered a complete gutting of the interior that lasted from 1948 to 1952. The project, including Truman’s addition of a balcony to the second floor of the South Portico, was highly controversial.\n\nOther changes include the creation of the Rose Garden during John F. Kennedy’s administration and Richard Nixon’s decision to convert an indoor swimming pool that was built for FDR’s physical therapy into a workspace for the growing White House press corps.","summary":"White House officials had initially said nothing would be demolished during construction.","url":"https://www.mercurynews.com/2025/10/21/trump-white-house-ballroom-what-to-know/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/White_House_Demolition_71645-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:43:11","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"us","sentiment":0.07},{"id":371383620,"title":"What to know about the $250 million ballroom Trump is adding to the White House","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — Construction started this week on the $250 million ballroom that President Donald Trump is adding to the White House as construction crews began tearing down the facade of the East Wing, where the new space is being built.\n\nThe Republican president and top White House officials had initially said nothing would be demolished during construction.\n\nThe 90,000-square-foot ballroom will dwarf the main White House itself, at nearly double the size, and Trump says it will accommodate 999 people.\n\nTrump said on social media that the ballroom won’t cost taxpayers a dime because it is being privately funded by “many generous Patriots, Great American Companies, and, yours truly.”\n\nHere are some things to know about the newest White House construction project:\n\nWhy is Trump building a ballroom?\n\nTrump says the White House needs a large entertaining space and has complained that the East Room, the current largest space in the White House, is too small, holding about 200 people. He has frowned on the past practice of presidents hosting state dinners and other large events in tents on the South Lawn.\n\nWho is paying the $250 million construction tab?\n\nTrump says the project will be paid for with private donations and that no public money will be spent on the ballroom. The White House promised to release information on which individuals and corporations have pledged or donated money and invited some of the donors to an East Room dinner last week, but has not released a comprehensive list and breakdown of funds.\n\nSome $22 million for the project came from YouTube, a Google subsidiary, as part of a recent settlement for a 2021 lawsuit Trump brought against the company.\n\nThe White House also has not said how much of his own money Trump is contributing.\n\nWhy tear down part of the East Wing to build the ballroom?\n\nThe East Wing is traditionally the social side of the White House and sits across East Executive Avenue from the Treasury Department. It’s where tourists and other guests enter for events.\n\nThe president and his chief spokesperson, Karoline Leavitt, said over the summer that the White House itself would remain intact as the ballroom was going up.\n\n“It’ll be near it but not touching it,” Trump said. “Nothing will be torn down,” Leavitt added.\n\nThat turned out not to be the case.\n\nThe White House said some demolition was needed because the East Wing, the traditional home for the first lady and her staff, is being modernized as part of the ballroom project.\n\nCan Trump build a ballroom?\n\nHe’s moving ahead with construction despite the lack of sign-off from the National Capital Planning Commission, the executive branch agency that has jurisdiction over construction and major renovations to government buildings in the region.\n\nTrump named a top White House aide, Will Scharf, to head the commission. Scharf has made a distinction between demolition work and rebuilding, saying the commission was only required to vet the latter.\n\nWhat happens to the East Room?\n\nBy Trump’s telling, it will become a space where guests will mingle, sip cocktails and eat hors d’oeuvres until they are called into the ballroom for dinner. Trump said a set of windows in the room will be removed to create a passageway to and from the ballroom.\n\nWhat will the new ballroom look like?\n\nRenderings released by the White House suggest a strong resemblance to the gilded ballroom at Mar-a-Lago, Trump’s private club and home in Palm Beach, Florida.\n\nThe project also has grown in size since it was announced, going from accommodating 650 seated guests to holding 999 people, big enough to fit an inauguration if needed, he said at a recent White House dinner for donors. Windows will be bulletproof, he said.\n\nWhen will the ballroom be completed?\n\nThe White House has said the ballroom will be ready for use before Trump’s second term ends in January 2029, an ambitious timeline.\n\nHas Trump made other changes to the White House?\n\nYes. He has heavily redecorated the Oval Office by adding numerous portraits, busts and gold-toned adornments. He converted the Rose Garden into a stone-covered patio, installed towering flagpoles on the north and south lawns, and decorated an exterior wall with portraits of every president except his immediate predecessor, Democrat Joe Biden.\n\nTrump also said he renovated the bathroom in the famous Lincoln Bedroom in the private living quarters and laid down marble floors in a passageway leading to the South Lawn.\n\nHow has construction changed the White House over the years?\n\nPresidents have added to the White House since construction began in 1792 for a host of reasons, and Trump aides say his decision to build a ballroom follows that long tradition.\n\nMany of the prior projects were criticized as being too costly or too lavish, but eventually came to be accepted, according to the White House Historical Association.\n\nThomas Jefferson added the east and west colonnades.\n\nAndrew Jackson built the North Portico on the Pennsylvania Avenue side of the White House, aligning with the South Portico that James Monroe added after the original mansion was rebuilt after the British burned it during the War of 1812.\n\nTheodore Roosevelt added the West Wing to provide dedicated space for the president and key staff, while Franklin D. Roosevelt added the East Wing, which over time became the home base for the first lady’s staff and social functions.\n\nOne of the most significant White House renovations happened under Harry Truman, when the mansion was found to be so structurally unsound that he ordered a complete gutting of the interior that lasted from 1948 to 1952. The project, including Truman’s addition of a balcony to the second floor of the South Portico, was highly controversial.\n\nOther changes include the creation of the Rose Garden during John F. Kennedy’s administration and Richard Nixon’s decision to convert an indoor swimming pool that was built for FDR’s physical therapy into a workspace for the growing White House press corps.","summary":"White House officials had initially said nothing would be demolished during construction.","url":"https://www.ocregister.com/2025/10/21/trump-white-house-ballroom-what-to-know/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/White_House_Demolition_71645-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:43:11","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":0.07},{"id":371379938,"title":"Melania Trump’s crypto architects accused of fraud","text":"The Trump family has reportedly pocketed more than US$1 billion in pre-tax profits from several cryptocurrency-related ventures in the past 12 months. (Reuters pic)\nNEW YORK: The designers of a cryptocurrency launched by US First Lady Melania Trump in January were accused in court filings on Tuesday of organizing the operation knowing that the digital currency's value would plummet.\nThe $MELANIA coins were released for just a few cents each on January 19, the day before her husband Donald Trump was inaugurated as president of the US.\nWithin hours, the $MELANIA coin's price had soared to US$13.73.\nHowever, it then collapsed almost as quickly, and is now only worth around 10 cents - less than 1% of its peak price.\nIn newly filed court papers, investors accuse the executives of the Meteora cryptocurrency exchange platform, on which $MELANIA was initially traded, of setting up a scheme that allowed them to indirectly purchase large quantities of this virtual coin.\nTheir accomplices then quickly resold these digital currencies, pocketing substantial profits while causing the price to plummet, according to documents filed Tuesday in Manhattan federal court and initially reported by the news website Wired.\nThe allegations concerning $MELANIA have been added to legal proceedings involving several other cryptocurrencies, which began in April.\nIn the latest case documents, filed in the Southern District of New York, the plaintiffs said they did not believe Melania Trump to be \"culpable,\" but accused the crypto companies of using her and other familiar faces as \"window dressing\" for their crimes.\nMeteora did not immediately respond to a request for comment from AFP.\nAccording to a Financial Times investigation published last week, the Trump family has pocketed more than US$1 billion in pre-tax profits from several cryptocurrency-related products and companies over the past 12 months.\nIn addition to $MELANIA, Donald Trump launched $TRUMP a few hours before his inauguration.\nAnd the young company World Liberty Financial, whose founders include Donald Trump's three sons, has put the WLFI cryptocurrency up for sale for a total of $550 million.","summary":"Investors allege that executives of the Meteora crypto platform set up a scheme to profit from $MELANIA trades before its value collapsed.","url":"https://www.freemalaysiatoday.com/category/business/2025/10/22/melania-trumps-crypto-architects-accused-of-fraud","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/04/cc56a126-trump-meme-coin.jpg","video":null,"publish_date":"2025-10-21 23:36:55","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.255},{"id":371379088,"title":"Debate verdict: The stalest of stalemates but Connolly's talking like she's already won","text":"We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nConnolly spoke for periods as if she had already been elected president.Leah Farrell/RollingNews.ie\n\none battle after another\n\nDebate verdict: The stalest of stalemates but Connolly's talking like she's already won\n\nIf you’ve been following the campaign up to now you missed nothing from the final debate.\n\n12.35am, 22 Oct 2025\n\nShare options\n\nONE BATTLE AFTER another.\n\nBy this journalist’s count, this was the seventh debate between the candidates and you may be glad to hear that it’s also the final one.\n\nThere have been plenty of other solo broadcast interviews of various lengths and formats thrown in there too but in terms of actual debates last night’s was the last one.\n\nIt’s often thought of as The Big One too.\n\nThe final debate before any election always has extra significance but, ever since The Frontline fiasco of 2011, the final RTÉ debate in a presidential election will always have some extra juice.\n\nBy that measure, the Prime Time debate between Independent Catherine Connolly and Fine Gael’s Heather Humphreys was, in all honesty, a huge disappointment from start to finish.\n\nIt was only in the final question after 70 minutes did we get to hear some semblance of difference to what we’ve heard multiple times before.\n\nAsked if they had any regrets from their time in public life, Humphreys said that hospital restrictions for the terminally ill during Covid were too severe, depriving people of a chance to say goodbye.\n\n“I think we could have found some way around that, and I regret that genuinely,” she said.\n\nConnolly failed to come up with her own answer to that one, merely stating that she agreed with Humphreys and that she also regretted going along with “the government policy” of the time.\n\n“Can I just come in to say that we followed the medical advice, but I just feel that we could have found a way to do it,” Humphreys added.\n\nAdvertisement\n\nGroundhog day\n\nAside from that two minutes of novelty, the rest of the debate touched on the same issues that have been asked and either answered or not answered multiple times before.\n\nConnolly’s work as a barrister, Connolly’s past comments on Europe, Humphreys’ lack of criticism of anything vaguely connected to the government, Connolly’s hiring of a gun convict, Humphreys defence of “rural pursuits” like fox hunting despite never being to a hunt.\n\nIf you’ve heard any of those issues discussed by the candidates over the past few weeks then you didn’t really miss anything from last night’s debate.\n\nThere’s a point at which a doggedness to pursue certain issues starts to look like a lack of imagination and that certainly came through here, if it hadn’t already happened during the campaign.\n\nNaoise Culhane\n\nNaoise Culhane\n\nIf you’re into podiums, there were four of them at least as it was the first stand-up TV debate of the campaign.\n\nThere were four women too thanks to the presence of presenters Miriam O’Callaghan and Sarah McInerney, a “historic” first said Connolly, and one that “should be recognised”.\n\nConnolly said this just before she got into her answer to the question of “why would she be a better president?”\n\nThe most unexpected part of this answer was that she did it while speaking as if she had already been elected.\n\n“I look forward to serving as president of this country,” Connolly said, before adding:\n\nIt will be an absolute privilege to do that.And I say to the people who are listening and watching that, I will do so with humility and with pride, and I will serve the people of Ireland to the best of my ability.\n\nSure, Connolly may perhaps have been just structuring her answer in a certain way, but given she is way ahead in the polls and some bookies have already paid out on her election, it sounded like a confident flex that is unusual for Irish politics.\n\nWhether Humphreys noticed or not, she was busy gearing up to ask Connolly about whether the former barrister had worked for banks in repossession cases whilst also giving out about banks on Galway City Council.\n\nThe merry-go-round on this question turned for a while as Connolly defended the separation of powers before McInerney stepped in to bluntly ask whether she could just agree that she had..\n\n“Yes,” Connolly said, to which Humphreys responded: “That’s fair enough.”\n\nRelated Reads\n\nCovid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate\n\nHumphreys questioned about credit union that she managed taking debtors to court\n\nConnolly calls on Humphreys to withdraw remarks and says Fine Gael are 'absolutely terrified'\n\nMuch of the debate thereafter proceeded along predictable lines, with few noteworthy moments.\n\nWhen asked about whether the US was complicit in genocide in Gaza, Humphreys studiously avoided the g-word and instead pivoted to talking about the US peace efforts, shaky as they may be.\n\nConnolly on the other hand made that connection, saying that genocide in Gaza has been “enabled and resourced by American money”.\n\nLater in the debate, Connolly was pushed on whether as president she would use this language in a meeting with US President Donald Trump. She was less clear in that case.\n\n“It’s a speculative question and so it will absolutely depend on what’s on the agenda for speaking. If it’s just a meet and greet, then I will meet and greet. If the if the discussion is genocide, that’s a completely different thing. But I doubt if that would be the discussion.”\n\nElection Centre\n\nUnlike the famous Frontline debate, there were no major mistakes for either candidate.\n\nMissteps perhaps, such as when Humphreys commented on there being “a lot of foxes around” when asked about fox hunting.\n\n“Cruelty to animals, in my book, is somewhat different to fox hunting,” she said, “there’s a lot of foxes around, as we know, and people go hunting the foxes.”.\n\nEven then though, Humphreys position on fox hunting has come up several times before.\n\nSo where do things stand after the debate? “As you were” is probably the long and the short of it. Nobody won or nobody lost on the night.\n\nGoing by the polls, Humphreys needs a turnaround that would eclipse even Michael D’s of 14 years ago. The Fine Gael candidate may have been hoping her rival had something akin to a Seán Gallagher moment – but that failed to transpire.\n\nThere are two more days of campaigning and no moratorium anymore, so you’ll be hearing from the two of them up until Friday. At least there are no more debates.\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nRónán Duffy\n\nView 9 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Debate verdict: The stalest of stalemates but Connolly's talking like she's already won”.\n\nRecipient's Email\n\nFeedback on “Debate verdict: The stalest of stalemates but Connolly's talking like she's already won”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\none battle after another\n\nNews in 60 seconds\n\nSix arrests and one garda injured as Commissioner condemns 'thuggery' of Citywest riot\n\n53 mins ago\n\nover and out\nCovid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate\n\nChristina Finn\n\n34 mins ago\n\nprime time players\nPlayer ratings: How did the candidates (and the hosts) fare in tonight's debate? \n\nAs it happened\nHow the final debate of the Áras campaign played out \n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nanniversary tour\nWestlife to play 10 shows in Dublin as extra dates added\n\nHere's What Happened Today: Tuesday\n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nWest Dublin\nMan (26) appears in court charged over sexual assault of young girl near Citywest hotel \n\nCitywest Hotel\nYoung girl allegedly assaulted in west Dublin had gone missing from Tusla care\n\nThe Morning Lead\nTown missing unit of gardaí after four members injured in two serious assault incidents\n\nNiall O'Connor\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"If you’ve been following the campaign up to now you missed nothing from the final debate.","url":"https://www.thejournal.ie/rte-prime-time-debate-6850477-Oct2025/","image":"https://img2.thejournal.ie/article/6850477/river/?height=400&version=6851067","video":null,"publish_date":"2025-10-21 23:35:29","author":null,"language":"en","source_country":"ie","sentiment":0.039},{"id":371380028,"title":"Media outlets spread fake news to undermine upcoming Russia-US summit — official","text":"MOSCOW, October 22. /TASS/. News outlets are distorting reports about the Russia-US summit in Budapest in order to undermine it, said Kirill Dmitriev, special presidential representative for investment and economic cooperation with foreign countries and CEO of the Russian Direct Investment Fund.\n\nHe noted that preparations for the summit are underway.\n\n\"Media is twisting comment about the ‘immediate future’ to undercut the upcoming Summit. Preparations continue,\" he wrote in English on the X social network, commenting on the purported cancellation of the Russia-US summit in Hungary.\n\nOn October 16, US President Donald Trump, following a phone conversation with Russian leader Vladimir Putin, said that they had agreed to meet in Budapest soon. Russian Presidential Aide Yury Ushakov also confirmed that Moscow and Washington will begin preparing for a new meeting between the two leaders which may take place in the Hungarian capital \"without delay.\" According to him, this is \"indeed a very important moment.\" Preparations for the meeting will begin in the near future, following a phone conversation between US Secretary of State Marco Rubio and Russian Foreign Minister Sergey Lavrov, Ushakov specified.\n\nIn response, Hungarian Prime Minister Viktor Orban ordered the formation of an organizing committee to facilitate the summit.\n\nOn October 20, Lavrov and Rubio held a phone call where they discussed potential steps to implement the understandings reached during the Putin-Trump phone talks.\n\nLater, CNN reported that a meeting between Lavrov and Rubio had been postponed indefinitely which may impact the Budapest talks between the Russian and US leaders.\n\nAs Kremlin Spokesman Dmitry Peskov noted, the Russia-US summit requires serious preparations so no specific dates had been set.","summary":"Special representative of the Russian President for investment and economic cooperation with foreign countries Kirill Dmitriev emphasized that preparations for the summit are underway","url":"https://tass.com/politics/2033253","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20251022/1456731.jpg","video":null,"publish_date":"2025-10-21 23:34:23","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.044},{"id":371380650,"title":"Trump says US Justice Department may owe him ‘a lot of money’ over probes","text":"US President Donald Trump said he believed the Justice Department probably owes him compensation, following a report that he was seeking some US$230 million after he faced multiple federal investigations.\n“As far as all the litigation, everything that’s going on, yeah, they probably owe me a lot of money,” Trump told reporters on Tuesday at the White House.\nThe New York Times reported earlier that Trump had initiated administrative claim processes alleging violations of his rights.\nThe complaints were related to investigations into whether his campaign colluded with Russia in connection with the 2016 election and his post-presidential retention of classified documents, according to the paper.\nWhile prosecutors did not find evidence that Trump had coordinated with Russia in 2016, the case over his handling of classified material was dismissed after he won a second presidential term.\n\nAccording to the New York Times report, Trump filed a 2023 complaint seeking damages for the investigation into Russian election tampering and a separate complaint in 2024 accusing the FBI of violating his privacy when agents searched his Mar-a-Lago resort for classified documents.\nDecisions about whether to pay Trump damages for the claims would be made by senior Justice Department officials – who may possibly include some lawyers who represented him during the investigations.\nWhen asked about the claims and whether the senior officials that formerly represented Trump in private practice are recused due to possible conflicts of interest, the DOJ said in a statement that “in any circumstance, all officials at the Department of Justice follow the guidance of career ethics officials”.\nThe DOJ declined to comment on the status of the claims.\nAt the White House, Trump said he did not plan to personally retain any settlement he won from taxpayers.\n“As I get money from our country, I’ll do something nice with it, like give it to charity or give it to the White House while we restore the White House,” Trump said.\nThe president cast the issue as being about wrongful prosecution rather than monetary gain.\n“I’m not looking for money. I’m looking for really – I think it’s gotta be handled in a proper way,” he said.","summary":"US President Donald Trump said he believed the Justice Department probably owes him compensation, following a report that he was seeking some US$230 million after he faced multiple federal investigations.\n“As far as all the litigation, everything that’s going on, yeah, they probably owe me a lot of money,” Trump told reporters on Tuesday at the White House.\nThe New York Times reported earlier that Trump had initiated administrative claim processes alleging violations of his rights.\nThe...","url":"https://www.scmp.com/news/world/united-states-canada/article/3329860/trump-says-us-justice-department-probably-owes-him-lot-money-over-probes","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/22/f703084a-a284-4406-8a33-0fc144a7f33f_e6e9ed8b.jpg","video":null,"publish_date":"2025-10-21 23:34:00","author":"Bloomberg","authors":["Bloomberg"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.363},{"id":371376986,"title":"Zelensky is using British-made missiles to attack Putin's gunpowder factory","text":"British Storm Shadow missiles have been used by Volodymyr Zelensky to strike an important chemical plant that produces gunpowder in southern Russia. \n\nThe use of missiles supplied by Britain in Russia's Bryansk region will likely spark condemnation from Vladimir Putin's government. \n\n'A massive combined missile and air strike was carried out, including the use of air-launched Storm Shadow missiles, which successfully penetrated the Russian air defense system,' Ukraine's General Staff said in a statement on X on Tuesday. \n\n'This enterprise produces gunpowder, explosives, and components for rocket fuel, in particular for ammunition and missiles that the enemy uses to shell the territory of Ukraine,' the military said.\n\nThe British government last year approved the use of Storm Shadow missiles by Ukrainian forces in operations on Russian territory, with the first known strikes happening in November. \n\nUkraine's general staff described the plant asa 'key facility' producing gunpowder, explosives and rocket fuel and said damage caused by the operation was being assessed. \n\nImages on social media claim to show flames billowing out of the facility. \n\nThe Ukrainian air force, army and other units carried the attack.\n\nThe military said the outcome of the strike was being assessed. \n\nStorm Shadow missiles have a range of between 155-349 miles and are equipped with advanced navigation systems to strike critical targets.\n\nUkraine has previously used Storm Shadows to hit targets in Russia's Bryansk and Kursk, as well as in Russian-occupied Crimea.\n\nThe latest strike comes on the same day that President Zelensky said that Ukrainian long-range attacks on Russia 'may hold the indispensable key to peace.'\n\nIt also comes after US President Donald Trump's plan for a swift meeting with Russian leader Vladimir Putin was put on hold. \n\nThe meeting was announced last week and was supposed to take place in Budapest, Hungary, in the near future. \n\nHowever, the idea was paused after a call between U.S. Secretary of State Marco Rubio and Russian Foreign Minister Sergey Lavrov, according to the official, who wasn't authorised to speak publicly and spoke on condition of anonymity.\n\nThe decision to hold off on a meeting between Trump and Putin will likely relieve European leaders, who have accused Putin of stalling for time with diplomacy while trying to gain ground on the battlefield.\n\nThe leaders — including the British prime minister, French president and German chancellor — said they opposed any push to make Ukraine surrender land captured by Russian forces in return for peace, as Trump has occasionally suggested.\n\nThey also plan to push forward with plans to use billions of dollars in frozen Russian assets to help fund Ukraine's war efforts, despite some misgivings about the legality and consequences of such a step.\n\nTrump has not yet commented publicly about the change in plans for his meeting with Putin. \n\nThey previously met in Alaska in August, but the encounter did not advance Trump's stalled attempts to end a war that began almost four years ago.\n\nThe Kremlin didn't seem to be in a rush to get Trump and Putin together again either. Spokesperson Dmitry Peskov said Tuesday that 'preparation is needed, serious preparation' before a meeting.\n\nZelensky has been trying to strengthen Ukraine's position by seeking long-range Tomahawk missiles from the US, although Trump has waffled on whether he would provide them.\n\n'We need to end this war, and only pressure will lead to peace,' Zelenskyy said Tuesday in a Telegram post.\n\nHe noted that Putin returned to diplomacy and called Trump last week when it looked like Tomahawk missiles were a possibility. \n\nBut 'as soon as the pressure eased a little, the Russians began to try to drop diplomacy, postpone the dialogue,' Zelensky said.","summary":"The use of missiles supplied by Britain in Russia's Bryansk region will likely spark condemnation from Vladimir Putin 's government.","url":"https://www.dailymail.co.uk/news/article-15214427/Zelensky-British-missiles-attack-Putin-gunpowder-factor.html","image":"https://i.dailymail.co.uk/1s/2025/10/21/23/103192931-0-image-m-31_1761084688617.jpg","video":null,"publish_date":"2025-10-21 23:33:52","author":"Editor,Sabrina Penty","authors":["Editor","Sabrina Penty"],"language":"en","category":"politics","source_country":"gb","sentiment":0.04},{"id":371376976,"title":"Hillary Clinton melts down over Trump's 'big, beautiful White House Ballroom'","text":"Hillary Clinton went ballistic over Donald Trump's plan to demolish the White House's East Wing and recreate the structure as a 'big, beautiful ballroom.' \n\nThe original section of the building was being destroyed on Monday to make way for the president's gilded $250 million ballroom.\n\nThe left has criticized the renovation as everything from destroying the most famous building in America to a waste of money to aesthetically ugly. \n\nThe former secretary of state, first lady and presidential candidate - who lost to Trump in 2016 - joined the growing chorus on social media Tuesday. \n\n'It’s not his house. It's your house. And he's destroying it,' the ex-Senator wrote on X, including a screenshot of a Washington Post story about the remodel.\n\nThe White House responded to the liberal outrage later in the day.\n\n'President Trump is working 24/7 to Make America Great Again, including his historic beautification of the White House, at no taxpayer expense,' spokesperson Abigail Jackson told Fox News.\n\n'These long-needed upgrades will benefit generations of future presidents and American visitors to the People’s House.' \n\nOn Monday, Daily Mail photos showed a backhoe ripping into the once-pristine structure that has formed part of the White House complex for more than a century.\n\nBanging and crashing were heard throughout the area, as clusters of staffers and journalists watched construction equipment tear chunks out of the walls. \n\nWhen the ballroom project was originally announced, the president and White House officials suggested that at least a portion of the East Wing would stay intact. \n\n'It won't interfere with the current building,' the president said at the time. 'It'll be near it, but not touching it and pays total respect to the existing building, which I'm the biggest fan of. It's my favorite.'\n\nPress secretary Karoline Leavitt was asked point-blank if the East Wing would be demolished when the plans were rolled out.\n\nShe said the 'necessary construction will take place' and the East Wing will be 'modernized'.\n\nTrump used similar language in a Truth Social post Monday evening after the demolition footage started to circulate. \n\n'Completely separate from the White House itself, the East Wing is being fully modernized as part of this process, and will be more beautiful than ever when it is complete!' Trump said.\n\nTrump announced in July plans to build a grand, 25,000 square feet ballroom to accommodate state dinners and other formal events. \n\nRenderings show a lavish design - crystal chandeliers, gilded columns and gold inlays - reflecting the opulent aesthetic of the president's Mar-a-Lago resort.\n\nThe new ballroom is supposed to be privately funded, with Trump chipping in himself. \n\nDonors include Silicon Valley titans, Apple and Google, defense behemoth Lockheed Martin, and telecom provider, T-Mobile.\n\nThe East Wing, in its original form, was constructed in 1902 during President Theodore Roosevelt's tenure, initially as a small structure that served as the public entrance.\n\nIt has since been expanded and modified, notably with the addition of a second story in 1942 to provide offices for First Lady Eleanor Roosevelt and her staff. \n\nTrump last week held a glitzy White House dinner with billionaires and company executives who are bankrolling the ballroom. \n\nAmong the guests were oil baron Harold Hamm, Blackstone chief executive Steve Schwarzman, and Cameron and Tyler Winklevoss.\n\n'We're here to celebrate you, because you have given a tremendous amount of money to see a ballroom built,' he told the cheering crowd on Wednesday.\n\n'In between China, Russia, everything else that we deal with, it's going to be a great ballroom... It is starting right behind us.'\n\nTrump opened the gold curtains behind him to unveil the construction site.\n\n'It will be demolished,' he said. 'Everything out there is coming down and it will be replaced by the most beautiful ballroom.'\n\nOn Monday, once construction started, the gold curtains in the East Room remained closed to drown out any noise, but the president referenced the project as he hosted two Louisiana State baseball teams at the White House. \n\nHe said the East Room's primary east-facing window would serve as a 'knockout panel,' and transform into the entry-way for the 'most beautiful ballroom in the country.' \n\n'But that's a knock-out panel and that goes right into the ballroom,' the president explained. 'So you'll have drinks, cocktails, everything on this floor and they'll say \"welcome to dinner,\" walk into the ballroom.' \n\nThe president confirmed construction on the project started Monday, amid the government shutdown.\n\nThe ballroom is expected to have a capacity of 1,000 people and will be fitted with bulletproof glass.\n\n'There won't be anything like it,' he said. 'Because of you, they're going to get it. And me too. So many of you have been really, really generous.'\n\nTrump shared an anecdote of one of the donors in the room asking him 'sir, will $25 million be appropriate?'\n\n'I'll take it. It doesn't take too many 25s [million dollars] to get it done.'\n\nHe said the donors had been so generous that he had 'money left over' which could be put toward the arch he wants to build opposite Arlington National Cemetery.\n\nTrump wanted to construct a White House ballroom as far back as 2010, originally making the pitch to President Barack Obama's adviser David Axelrod. \n\nThe president didn't like the look of the pop-up tents that First Lady Michelle Obama was using to host White House state dinners on the South Lawn. \n\nSince taking office, Trump has redecorated the Rose Garden, Oval Office and is in the process of renovating the Palm Room.","summary":"The original section of the building was being demolished on Monday to make way for the president's gilded $250 million ballroom.","url":"https://www.dailymail.co.uk/news/article-15214419/Hillary-Clinton-Donald-Trump-White-House-Ballroom.html","image":"https://i.dailymail.co.uk/1s/2025/10/21/23/103192419-0-Hillary_Clinton_added_herself_to_the_list_of_liberals_furious_ov-a-11_1761087403153.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/10/21/1242442800982673598/1024x576_MP4_1242442800982673598.mp4","publish_date":"2025-10-21 23:32:17","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.012},{"id":371375326,"title":"Letters: Let’s build on momentum of ‘No Kings’ rallies","text":"Build on momentum\nfrom ‘No Kings’ rallies\n\nRe: “‘No Kings’ rallies galvanize region” (Page A1, Oct. 19).\n\nThank you for your coverage of the Bay Area “No Kings” protests. As a psychiatrist, I recognize the mental health benefits of a joyous gathering to speak on topics that we are passionate about.\n\nOne area of huge importance did not get much coverage — the administration’s attack on clean energy and rollbacks of environmental regulations essential to protect the health of our communities. In California, we have the opportunity to pass the Polluters Pay Climate Superfund Act, AB 1243 and SB 684. Rather than relying on government funds to clean up fossil fuel pollution and climate damage like wildfires, this bill holds the largest polluters accountable. Just imagine what our communities could do with $150 billion — a tiny proportion of the industry’s profits.\n\nWe all need to contact our legislators to demand that they continue California’s climate progress. Action is the antidote to climate anxiety.\n\nWendy Bernstein\n\nMarches are a call\nto stay engaged\n\nRe: “‘No Kings’ rallies galvanize region” (Page A1, Oct. 19).\n\nThe Oct. 18 “No Kings” rallies, which brought out hundreds of thousands across the Bay Area, were heartening and powerful. But these moments must lead to more — sustained civic engagement in our communities and governance.\n\nTo truly be represented, we must consistently participate in democracy at all levels — not just during major elections, but through ongoing involvement in local boards, councils and advocacy.\n\nAs a physician, I worry about how weakened environmental policies directly harm the health of my patients. The federal rollback of climate protections is dangerous, and even in California, Gov. Newsom has supported expanded oil drilling and weakened environmental safeguards. That’s unacceptable during a climate crisis.\n\nDemocracy and climate justice are not separate fights — they are fundamentally connected. Our health, safety and future depend on both. It’s time we make that known to leaders across California and beyond.\n\nHina Fullar\n\n‘Childish ploy’ a serious\nreaction to GOP rigging\n\nRe: “Proposition 50 a childish ploy for dominance” (Page A12, Oct. 19).\n\nI really enjoyed Christopher Andrus’ Oct. 19 letter to the East Bay Times claiming that supporters of Proposition 50 are childish, and lecturing readers on the destruction of democracy.\n\nPerhaps Andrus is unaware that Proposition 50 is in response to Donald Trump’s call on Republican-led states to change (aka “gerrymander”) their congressional districts mid-census to assure that more Republicans win office, and that Texas and Missouri have already done so. Perhaps Andrus believes that the Jan. 6, 2021, insurrection at the Capitol by Trump supporters was acceptable adult behavior, and that assaulting police officers was something to be proud of. It wasn’t, and that’s why more than 1,500 rioters were charged with crimes.\n\nI’ve already voted, and I voted in favor of Proposition 50, the Election Rigging Response Act.\n\nMark Sarconi\n\nProp. 50 a misguided\neffort to strike at Trump\n\nEven if you can’t stand Donald Trump, it makes no sense to hurt yourself by voting yes on Proposition 50.\n\nBy doing so, you are ceding what little power you have remaining back to the politicians in Sacramento, and all because you want to stick it to Trump. Think it through. I plead with you.\n\n‘No Kings’ a counter\nto Trump’s childishness\n\nI was watching a noontime show on the Fox News channel the Monday after over 7 million Americans were demonstrating against the Trump administration. The host of the show just couldn’t understand why we were demonstrating. She repeatedly said how she just didn’t understand the point of the demonstration. “Maybe it’s the shutdown?” she asked.\n\nI really don’t know if she was playing dumb or was just plain ignorant of Donald Trump’s tactics. Meanwhile, in the background, images were being displayed of protesters holding signs that read: “Free Press,” “Free Speech,” “Stay out of Chicago,” “No Ice,” and most importantly, “No Kings.” All she had to do was read those signs.\n\nI wonder if she’ll ever learn about Trump’s Oct. 18 post on Truth Social of the AI-generated video of him flying a jet, which dumped a “brown substance” on the crowds below. This, from our president. What a guy.\n\nLiberals forget about\nprotecting birds\n\nLiberals argue that we need wind power to produce electricity, but they don’t seem very concerned about the number of birds that the large wind turbines kill each year. (The American Bird Conservancy estimates about 1 million birds are killed each year in the United States by wind turbines.)\n\nThis is sure a different story than we heard back in 1990 when the entire lumber industry in the Pacific Northwest was virtually shut down (with a loss of around 25,000 jobs) in order to protect a few spotted owls.\n\nMike Heller\nWalnut Creek","summary":"Also: Stay engaged &#124; Serious reaction &#124; Misguided strike &#124; Trump's childishness &#124; Protecting birds. East Bay Times reader letters to the editor for Oct. 22, 2025.","url":"https://www.mercurynews.com/2025/10/21/letters-build-momentum-no-kings-rallies/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/SJM-L-NOKINGS-1019-41.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-21 23:30:11","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.048},{"id":371379092,"title":"Covid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate","text":"We need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nDaft.ie Property\nAllianz Home\nThe 42 Sport\nTG4 Entertainment\n\nThe Explainer\n\nA deep dive into one big news story\n\nSport meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nAlamy Stock Photo\n\nover and out\n\nCovid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate\n\nIf you were hoping to learn something new in the final debate, you’ll probably be left disappointed.\n\n12.04am, 22 Oct 2025\n\nShare options\n\nLAST UPDATE\n\n34 mins ago\n\nIF YOU WERE hoping to learn something groundbreakingly new in the final live head-to-head TV debate between Áras hopefuls Catherine Connolly and Heather Humphreys, you’ll probably be left disappointed.\n\nDuring the RTÉ Prime Time debate, the candidates were questioned on many of the same talking points that have dogged their campaigns, such as Connolly’s work as a barrister, Humphreys not meeting with the mother of Shane O’Farrell, Connolly’s hiring of a woman convicted of gun offences. \n\nThere were a few cringeworthy, head-in-your-hands moments too.\n\nSo what did we learn?\n\nTen uses of the word ‘sorry’ in the space of four minutes \n\nHumphreys has been questioned repeatedly throughout this campaign about her dealings with the family of hit-and-run victim Shane O’Farrell.\n\nThe 23-year-old was killed in 2011 in a hit-and-run by a man who should have been in State custody at the time. Humphreys was a local TD for Monaghan at the time of Shane’s death.\n\nShane’s mother Lucia, has said that she believes Humphreys is “not capable of being the president for the people of Ireland, when she can’t represent her own people in Monaghan”.\n\nPresenter Miriam O’Callaghan put it to Humphreys that the “bottom line is that you didn’t bother to meet this mother… So you say you want to be a president for all of the people, but you didn’t meet such a deserving woman in your own constituency”.\n\n“I’m really sorry that I wasn’t able to deliver what they wanted.”\n\nHeather Humphreys apologies to the family of Shane O’Farrell who was killed in a hit and run near his home in 2011 and says she’s glad they got an official state apology.\n\nWATCH:@rtenews | #rtept pic.twitter.com/wv6aWUU7Fc— RTÉ Prime Time (@RTE_PrimeTime) October 21, 2025 \n\nWhen asked did she fail Lucia, Humphreys probably went further than she has in previous answers on this issue.\n\n“I did my best, and I’m really sorry if she, you know, I’m really sorry that I wasn’t able to deliver what they wanted. But I’m glad, I really am glad, that they have got a state apology, and I’m sorry that that state apology wasn’t given when I was part of the government.”\n\nWe counted. In all it was the use of the word ‘sorry’ ten times in the space of just a couple of minutes. \n\nCovid regrets \n\nThere is one thing the two candidates can agree on.\n\nThey both have regrets around the Covid restrictions.\n\nIn what was probably the newest piece of information to glean from the debate this evening, both regret endorsing some of the restrictions that were put in place during the pandemic. \n\nIt was the final question in tonight’s debate.\n\nAdvertisement\n\nHumphreys began by saying that she was a minister at the time, and while the government was following medical advice, she thinks they should have found a way for people to visit their loved ones in hospital when they were dying.\n\nHeather Humphreys says one of her regrets is that regulations during the Covid-19 pandemic prevented families from spending time with loved ones in their final days, adding the Government could have handled it better.\n\nWATCH:@rtenews | #rtept pic.twitter.com/iOaHrWtQMr— RTÉ Prime Time (@RTE_PrimeTime) October 21, 2025 \n\n“What really hits me hard is the fact that there were regulations there where, when your relative was dying, you couldn’t hold their hand, you couldn’t whisper something in their ear. And that stays with me, and I regret that, I really do, because I think we could have found some way.”\n\nConnolly, nodding along, agreed with her opponent. \n\nFrom day one, Connolly said she agreed with the government in relation to the restrictions.\n\nAsked about personal regrets, Catherine Connolly says hers was agreeing with Government on lockdown restrictions during the Covid-19 pandemic. @rtenews | #rtept pic.twitter.com/GQk8ibOo9o— RTÉ Prime Time (@RTE_PrimeTime) October 21, 2025 \n\n“I actually regret agreeing with that,” she said, stating: “I went [along] because the fear was so extraordinary that I went with that. Afterwards, I did not give support to the government… because the bond of trust was broken.\n\n“They [the government] gave a commitment that would come back regularly in relation to the review of those restrictions. And that didn’t happen,” said Connolly.\n\nShe said her personal regret is that she agreed in the first place to the restrictions, saying she did so in “good faith”.\n\nConnolly was then, as she is now, an Independent opposition TD. \n\nHeather HumphreysAlamy Stock Photo\n\nAlamy Stock Photo\n\n‘There’s a lot of foxes around’\n\nHumphreys has been questioned throughout this campaign about representations she made in an animal cruelty case, which has led to a discussion on fox hunting tonight.\n\nDuring the debate, Humphreys leaned into her rural Ireland vote, repeating that it is a “rural pursuit”.\n\nIt was a term she repeated ad nauseum tonight. \n\nWhile she said she doesn’t go fox hunting herself, she believes it is “part of our culture”.\n\n“It’s part of our heritage and has been there for many, many years,” she said.\n\nPresenter Sarah McInerney asked: “Do you think it’s cruelty to animals?”\n\n“Well, it’s part of our heritage. Cruelty to animals, in my book, is somewhat different to fox hunting. It’s a rural pursuit and foxes, there’s a lot of foxes around, as we know, ” said Humphreys. \n\nRelated Reads\n\n‘I hardly know what day it is,’ says Humphreys over Shane O’Farrell inquiry vote query\n\nHumphreys questioned about credit union that she managed taking debtors to court\n\nHeather Humphreys says presidential race rival used ‘language of Nigel Farage’\n\nShe added that once the “controls are in place and once the rules are abided by, I support rural pursuits”.\n\nIn case you missed it, she supports rural pursuits. \n\nCatherine ConnollyAlamy Stock Photo\n\nAlamy Stock Photo\n\nA bit more clarity on Connolly acting for the banks\n\nConnolly was questioned about whether she was transparent enough when it came to her work as a barrister. It is a question that has followed the Galway TD around the country during her campaign. \n\nShe was asked why she did not answer numerous questions about whether she worked in repossession cases. \n\nShe responded by stating that she worked with credit institutions, but added that she wouldn’t specify the cases, citing her “duty of confidentiality”.\n\n“Did she represent banks in helping them repossess Irish homes? I think Catherine needs to explain,” said Humphreys. \n\nConnolly hit back by stating that Humphreys has refused to agree to motions to have a ban on evictions, but the former minister simply said that the independent candidate was avoiding the question. \n\nIn the end, Connolly said she had been as clear as she could be. She stated she worked for the financial institutions, and while she didn’t utter the word ‘repossessions’, the clear indication was she did work on such cases.\n\nHumphreys probably could have pushed harder on the matter, but in the end, she seemed to be satisfied enough with the answer. But does it put the matter to bed two days out from polling day? We’ll have to wait and see. \n\nMeet-and-greets in the Áras\n\nWhile Connolly has said she will be a voice for all, she said that – depending on the scenario – she may not be using that voice to speak truth to power when it comes to Donald Trump and Gaza.\n\nAsked if she would tell US President Donald Trump that the US enabled genocide in Gaza, Catherine Connolly said it would depend on the situation and “what’s on the agenda” adding she doubted Gaza would feature if she were to meet him.@rtenews | #rtept pic.twitter.com/tK5fHgkAxW— RTÉ Prime Time (@RTE_PrimeTime) October 21, 2025 \n\nQuestioned this evening on whether she would raise the issue of America’s support for Israel’s assault on Gaza with the US president, were she to host him at an event in Phoenix Park, she said:\n\n“If it’s just a meet and greet, then I will meet and greet. If the discussion is genocide, that’s a completely different thing,” she said, adding that she doubted the issue of genocide in Gaza would be on the agenda if she were meeting Trump as President of Ireland.\n\nAll in all, a bit of a lacklustre debate. Nothing that blows the election wide open, by any means.\n\nNow, with just a couple of days to go, its down to the public to decide. \n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nChristina Finn\n\nView 25 comments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Covid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate”.\n\nRecipient's Email\n\nFeedback on “Covid regrets, Trump meet-and-greets and a lot of foxes: 5 things to know from the final debate”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nCatherine Connolly\nFinal Countdown\nHeather Humphreys\nover and out\nPresidential Election\nthat's it folks\n\nNews in 60 seconds\n\nSix arrests and one garda injured as Commissioner condemns 'thuggery' of Citywest riot\n\n53 mins ago\n\none battle after another\nDebate verdict: The stalest of stalemates but Connolly's talking like she's already won\n\nRónán Duffy\n\n29 mins ago\n\nprime time players\nPlayer ratings: How did the candidates (and the hosts) fare in tonight's debate? \n\nAs it happened\nHow the final debate of the Áras campaign played out \n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nanniversary tour\nWestlife to play 10 shows in Dublin as extra dates added\n\nHere's What Happened Today: Tuesday\n\nWest Dublin\nGarda van set alight as large anti-immigration protest turned violent in Citywest\n\nWest Dublin\nMan (26) appears in court charged over sexual assault of young girl near Citywest hotel \n\nCitywest Hotel\nYoung girl allegedly assaulted in west Dublin had gone missing from Tusla care\n\nThe Morning Lead\nTown missing unit of gardaí after four members injured in two serious assault incidents\n\nNiall O'Connor\n\nmore from us\n\nInvestigates\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nThe Video Review\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"If you were hoping to learn something new in the final debate, you’ll probably be left disappointed.","url":"https://www.thejournal.ie/5-things-to-know-from-the-final-aras-debate-6850854-Oct2025/","image":"https://img2.thejournal.ie/article/6850854/river/?height=400&version=6851038","video":null,"publish_date":"2025-10-21 23:30:00","author":null,"language":"en","source_country":"ie","sentiment":-0.121},{"id":371375550,"title":"Trump administration’s strikes against Venezuela amount to ‘extrajudicial executions’, UN experts say","text":"A group of independent United Nations experts has condemned recent U.S. strikes against suspected drug boats in international waters as a dangerous escalation and amount to “extrajudicial executions”, they announced on Tuesday.\n\nPresident Donald Trump has ordered attacks on at least seven suspected drug vessels in the Caribbean off the coast of Venezuela in recent months, resulting in at least 32 deaths. These operations form part of his ongoing campaign against what he describes as a “narcoterrorist” threat emanating from Venezuela and linked to its president, Nicolas Maduro.\n\nThe U.N. experts acknowledged Trump's justification, but stated: “Even if such allegations were substantiated, the use of lethal force in international waters without proper legal basis violates the international law of the sea and amounts to extrajudicial executions.”\n\nThe independent experts, who are appointed by the U.N. Human Rights Council, said the strikes violate the South American country's sovereignty and the United States' \"fundamental international obligations\" not to intervene in domestic affairs or threaten to use armed force against another country.\n\n\"These moves are an extremely dangerous escalation with grave implications for peace and security in the Caribbean region,\" they said in a statement.\n\nWashington rejects Maduro's 2024 election victory and says there was \"overwhelming evidence\" his opponent won.\n\n\"These so-called 'experts' fail to acknowledge the fact that they're advocating for an illegitimate leader who is a fugitive of American justice who undermines our regional security and poisons Americans,” said a senior State Department official, speaking on condition of anonymity.\n\nThe U.S. has justified its actions as consistent with Article 51 of the founding U.N. Charter, which requires the Security Council to be immediately informed of any action states take in self-defense against armed attack.\n\nVenezuelan Foreign Minister Yvan Gil said the experts have corroborated Caracas' concerns about the U.S. military campaign.\n\n\"The United States fabricates enemies to justify a supposed right to self-defense, which results in massacres in the Caribbean,\" Gil said in a message on Telegram about the U.N. statement.\n\nThe U.S. strikes come against the background of a U.S. military buildup in the Caribbean that includes guided-missile destroyers, F-35 fighter jets, a nuclear submarine and around 6,500 troops as Trump escalates a standoff with the Venezuelan government.\n\nTrump said last week that he had also authorized the Central Intelligence Agency to conduct covert operations in Venezuela.\n\nThe experts, who said they have been in contact with the U.S. regarding their concerns, said covert or direct military action against another sovereign state would constitute \"an even graver breach\" of the U.N. Charter.","summary":"President Donald Trump has ordered attacks on at least seven suspected drug vessels in the Caribbean in recent months","url":"https://www.independent.co.uk/news/world/americas/us-politics/venezuela-boat-strike-trump-united-nations-b2849675.html","image":"https://static.independent.co.uk/2025/10/16/21/12/Trump-boat-strike.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/EVxm3mHs-OhrQWqOm.mp4","publish_date":"2025-10-21 23:29:32","author":"Jasper Ward","authors":["Jasper Ward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.081},{"id":371385434,"title":"FAA Imposes New Flight Restrictions Over Mar-a-Lago (Whether Trump Is There or Not)","text":"The FAA has issued new flight restrictions around President Donald Trump’s Mar-a-Lago club in Palm Beach, Florida. The new restrictions will be in place for at least a year and will apply even when the president isn’t staying at his club, a major departure from what was done previously.\n\nThe new restrictions started at 8:00 a.m. ET on Monday and won’t expire until Oct. 20, 2026, according to the FAA notice posted online. The no-fly zone includes a one nautical mile radius up to 2,000 feet, where all aircraft are banned, including planes, helicopters, and drones. These restrictions apply even when Trump isn’t on the property.\n\nTemporary Flight Restrictions are in place when Trump visits Mar-a-Lago and those will remain, including a 10 nautical mile radius around Palm Beach International Airport. That so-called inner core includes strict limitations on aviation, while the outer ring extends from 10-30 nautical miles and imposes some restrictions on aircraft that get approval for operations, according to a Powerpoint presentation available on the airport’s website.\n\nThe Powerpoint slides also include instructions on what to do if you’re a pilot who’s being intercepted while violating restricted airspace. Number one on the list? Remain calm.\n\nMar-a-Lago is just a few miles directly east of Palm Beach International Airport. The new restrictions will likely cause more air traffic to be diverted to surrounding communities north of Palm Beach, according to a new report from the Palm Beach Post, with pilots using alternate routes to avoid the restricted airspace when landing.\n\nThe areas of Grandview Heights and Flamingo Park in West Palm Beach are expected to see the biggest upticks in air traffic and noise levels, according to the Sun-Sentinel. Palm Beach County Commissioner Gregg Weiss posted about the new restrictions on Facebook and noted that people in the area will likely have complaints.\n\nWeiss explained that noise complaints can be submitted through the Palm Beach International Airport’s website. He told the Palm Beach Post that residents were likely expecting more interruptions soon because Trump would be visiting Florida more frequently during the winter. But the fact that there will be new restrictions, even when he’s not at Mar-a-Lago, came as a surprise.\n\nSecret Service agents recently found what Fox News described as a “suspicious hunting stand,” near the airport. It’s unclear what the purpose of the stand may have been but it was discovered during advance security preparations for Trump’s arrival the airport, according to Fox.\n\nThe FAA didn’t respond to a request for comment Tuesday. Gizmodo received an out-of-office response that reads, “Due to a lapse in funding, the FAA is not responding to routine media inquiries.”","summary":"The new restrictions will be in place for at least a year.","url":"https://gizmodo.com/faa-new-restrictions-mar-a-lago-2000675254","image":"https://gizmodo.com/app/uploads/2025/10/mar-a-lago-aerial-view-sm-1200x675.jpg","video":null,"publish_date":"2025-10-21 23:28:59","author":"Matt Novak","authors":["Matt Novak"],"language":"en","category":"politics","source_country":"us","sentiment":-0.352},{"id":371382876,"title":"'Talked About Trade… No Wars With Pakistan': Trump Dials Modi Again Amid Earlier Dispute Over Phone Call","text":"US President Donald Trump said on Wednesday that he had spoken with Prime Minister Narendra Modi to discuss trade and India's relations with Pakistan. Speaking to reporters in the Oval Office, Trump described Modi as \"a great person\" and \"a great friend\" while extending Diwali greetings to the people of India. \"Let me extend our warmest wishes to the people of India. I just spoke to your Prime Minister today. Had a great conversation. We talked about trade... He's very interested in that,\" Trump said. \"Although we did talk a little while ago about let's have no wars with Pakistan. The fact that trade was involved, I was able to talk about that. And we have no war with Pakistan and India. That was a very, very good thing. He's a great person, and he's become a great friend of mine over the years.\" The US President also used the occasion to claim that his administration was achieving \"total peace\" in the Middle East. Also Read: India Fact-Checks Trump's Claim on PM Modi Call Over Russian Oil \"We are forging peace all over the world... We're getting everybody to get along. I just got a call from the Middle East. We're doing very well there,\" he said. Trump claimed that \"many countries\" had joined peace efforts, adding: \"The Hamas situation, they're pretty violent people. We could put that out in two minutes. We're giving them a chance. They agreed that they'd be very good and straight. They wouldn't be killing people. If they don't honour the deal, they'll be taken care of very quickly.\" He added: \"It is total peace in the Middle East; we have levels of friendship with everybody. Every country that hated each other now loves each other. Nobody ever saw anything like it.\" Trump's comments came a day after he repeated his claim that Modi had assured him India would stop buying Russian oil, a statement New Delhi has denied. \"I spoke with Prime Minister Modi of India, and he said he's not going to be doing the Russian oil thing,\" Trump said aboard Air Force One. When asked about India's denial, he added: \"But if they want to say that, then they'll just continue to pay massive tariffs, and they don't want to do that.\" The remarks coincide with ongoing trade negotiations between Washington and New Delhi, following Trump's decision to impose a 50% tariff on Indian imports, including a 25% penalty over India's oil trade with Russia. India has repeatedly maintained that its energy purchases are guided by national security and market considerations rather than geopolitical alignments, arguing that affordable energy supplies are vital for its population. The Ministry of External Affairs, in its weekly presser, had clarified that no phone call occurred between the two leaders. MEA spokesperson Randhir Jaiswal had told reporters, \"... On the question of whether there was a conversation or a telephone call between Prime Minister Modi and President Trump, I am not aware of any conversation yesterday between the two leaders.\" Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Trump's comments came a day after he repeated his claim that Modi had assured him India would stop buying Russian oil, a statement New Delhi has denied","url":"https://www.timesnownews.com/world/us/us-news/donald-trump-narendra-modi-phone-call-trade-tariffs-pakistan-war-article-153034059","image":"https://images.timesnownews.com/thumb/msid-153034061,thumbsize-89872,width-1280,height-720,resizemode-75/153034061.jpg","video":null,"publish_date":"2025-10-21 23:28:19","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.098},{"id":371386198,"title":"Donald Trump celebrates Diwali at White House - here’s what he said about Narendra Modi &amp; US-India relations","text":"Diwali celebration at White House (Photo: X/@writesaket)\n\nDiwali celebration Donald Trump: The White House glowed a little brighter on Tuesday as President Donald Trump joined in Diwali celebrations, extending warm wishes to the people of India and the Indian-American community, as per a report.Trump Calls PM Modi a “Great Friend”During his address, Trump spoke fondly of Indian prime minister Narendra Modi, describing him as a “great person” and “a great friend,” and he shared that he had spoken with the Indian leader earlier in the day about trade and peace in the region, as per an ANI report.The US president said during the Diwali event at the White House, \"Let me extend our warmest wishes to the people of India. I just spoke to your Prime Minister today. Had a great conversation. We talked about trade... He's very interested in that. Although we did talk a little while ago about let's have no wars with Pakistan,\" adding, \"The fact that trade was involved, I was able to talk about that. And we have no war with Pakistan and India. That was a very, very good thing,\" as quoted by ANI.Trump also emphasized that Modi is \"A great person, and he's become a great friend of mine over the years,\" as quoted in the report.ALSO READ: Texas Instruments stock drops after Q3 earnings miss and cautious outlook - what investors need to knowLive EventsTrump Celebrates Diwali at the White House and Lights DiyasHe then went on to reflect on the deeper meaning of Diwali, saying, \" In a few moments, we'll light the diya as a symbol of faith in the victory of light over darkness... It's knowledge over ignorance and good over evil. During Diwali, the revellers recall ancient stories of enemies defeated, obstacles removed, and captives freed,\" as quoted by ANI.Trump also highlighted that the glowing diya serves as a reminder \"to seek the path of wisdom and to work with diligence and to always give thanks for our many blessings,\" as quoted in the report.ALSO READ: Intuitive Surgical stock jumps after beating Q3 earnings expectations & raising outlook for FY25Senior US and Indian Officials Attend the Diwali Celebration At White HouseAfter his remarks, Trump lit the ceremonial diyas to celebrate Diwali at the White House, reported ANI. The event was attended by several senior officials from his administration, including FBI Director Kash Patel, ODNI Director Tulsi Gabbard, White House Deputy Press Secretary Kush Desai, India’s Ambassador to the US Vinay Mohan Kwatra, and US Ambassador to India Sergio Gor, as per the report.Prominent Indian-American business leaders were also present, symbolizing the growing influence and engagement of the Indian diaspora in US-India relations, as per the ANI report.US Congress Recognizes Diwali’s Cultural ImportanceWhile, US Congressmen Raja Krishnamoorthi and Brian Fitzpatrick introduced a bipartisan resolution to recognize the religious and historical significance of Diwali, which began on October 20. The resolution honors the festival’s meaning to over three million Indian-Americans, including Hindus, Jains, and Sikhs, and acknowledges their contributions to American society, reported ANI.FAQsWhat did President Trump say about Prime Minister Modi?He praised Modi as a “great person” and “a great friend,” as per the ANI report.Did Trump celebrate Diwali?Yes and he also lit ceremonial diyas at the White House.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onDiwali celebration Donald Trump 2025 latest newsDiwali celebration Donald TrumpWhite House Diwali eventDiwali celebrationTrump lights diyas at White HouseNarendra Modi Donald Trump relationship newsWhite House Diwali 2025Trump US India relationsTrump Diwali remarks\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onDiwali celebration Donald Trump 2025 latest newsDiwali celebration Donald TrumpWhite House Diwali eventDiwali celebrationTrump lights diyas at White HouseNarendra Modi Donald Trump relationship newsWhite House Diwali 2025Trump US India relationsTrump Diwali remarks(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Diwali celebration Donald Trump: President Trump celebrated Diwali at the White House, extending warm wishes to India and the Indian-American community. He spoke fondly of Prime Minister Modi, calling him a \"great friend\" and discussing trade and regional peace. Trump also lit ceremonial diyas, symbolizing light over darkness, with senior officials and Indian-American leaders in attendance.","url":"https://economictimes.indiatimes.com/news/international/us/donald-trump-celebrates-diwali-at-white-house-heres-what-he-said-about-narendra-modi-us-india-relations/articleshow/124731231.cms","image":"https://img.etimg.com/thumb/msid-124731246,width-1200,height-630,imgsize-40750,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-10-21 23:25:09","author":"Tionsdonald Trump","authors":["Tionsdonald Trump"],"language":"en","category":"politics","source_country":"in","sentiment":0.345},{"id":371375544,"title":"‘This is sick’: Conservative pundit faces backlash after posting cartoon about Mamdani riffing on 9/11 tragedy","text":"A conservative pundit has faced backlash after posting a cartoon targeted at Zohran Mamdani, the Democratic nominee for New York City mayor, riffing on the tragic 9/11 attacks. \n\nMamdani, a Muslim democratic socialist, has run his campaign on the promise of affordability, pledging to freeze the rent on more than two million rent-stabilized tenants and make city buses free to ride if he’s elected on November 4. \n\nOn Tuesday morning, Larry Elder, who hosts We’ve Got a Country to Save and ran for president in the 2024 election before endorsing President Donald Trump, shared on X a cartoon depicting a red plane with the word “Mamdani” written on the side with the Communist hammer and sickle symbol headed into a building that is reminiscent of one of the World Trade Center’s Twin Towers that has the words “NY CITY” on it. \n\nElder captioned the post, which has garnered 2.1 million views: “#Socialism.”\n\nHis post was harshly criticized by those who found it insensitive to the nearly 3,000 lives lost and thousands injured in the 2001 terrorist attacks. \n\n“Jesus Christ, this is sick. I lost my friend in the North Tower on 9/11. His daughter, my goddaughter, lost her dad who worked for Marsh&McLennan. How dare you find political comedy, gain depicting this is Zorhan. I don’t even like Zorhan. This is disgraceful, disgusting of you,” one X user commented on Elder’s post. \n\nSports broadcaster and writer Roberto Abramowitz said, “Really disgusting. I had friends who died there. But sure, go try and score cheap political points by rekindling New Yorker’s nightmares.”\n\n“Depicting 9/11 imagery to attack a political candidate is beyond tasteless. Do better,” another X user wrote. \n\nThe Independent has reached out to Elder’s show and Mamdani’s campaign for comment. \n\nThere was one prominent far-right figure, Laura Loomer, who agreed with Elder’s post, writing, “100%.”\n\nLoomer, who has called herself a “proud Islamophobe,” wrote on X following Mamdani’s defeat of former New York Governor Andrew Cuomo in the democratic primary in June, “Muslims destroyed NYC on 9/11 and now a Muslim Communist is about to destroy the entire city for eternity.”\n\nLoomer is an ally of Trump, who has repeatedly called Mamdani a “communist.” Mamdani has explicitly said he is not a communist but rather a democratic socialist. \n\nThe New York Times described democratic socialism in a June article as “an ideology rooted in its opposition to capitalism and wanting to shift power to workers from corporations.”\n\nMamdani is leading in the polls against Cuomo, who is now running as an independent, and Republican nominee Curtis Sliwa. \n\nIn a Patriot Polling survey following last week’s mayoral debate, Mamdani stood with 43 percent of support from the city’s registered voters while Cuomo and Sliwa trailed with 32 and 19 percent, respectively.","summary":"‘Jesus Christ, this is sick. I lost my friend in the North Tower on 9/11,’ one person commented on Larry Elder’s social media post","url":"https://www.independent.co.uk/news/world/americas/us-politics/larry-elder-backlash-zohran-mamdani-9-11-cartoon-b2849667.html","image":"https://static.independent.co.uk/2025/10/21/22/25/Screenshot-2025-10-21-at-6-48-27-PM.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/3aWb0mKQ-4VHSaSK0.mp4","publish_date":"2025-10-21 23:24:57","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.109},{"id":371383114,"title":"Shakira Says 'It's About Time' Bad Bunny Headlines Super Bowl Halftime Show: 'The Perfect Moment'","text":"Super Bowl halftime show veteran Shakira is happy to pass on the torch to Bad Bunny.\n\n Six years after the Puerto Rican rapper, 31, joined the Colombian singer-songwriter, 48, on stage during her co-headlining performance with Jennifer Lopez at Super Bowl LIV, he is set to be the star of the Apple Music Super Bowl LX Halftime Show.\n\n Being that Bad Bunny, born Benito Antonio Martínez Ocasio, primarily performs in Spanish, his selection as the 2026 Super Bowl halftime show headliner has been met with criticism.\n\n Days after the announcement was made, President Donald Trump's adviser Corey Lewandowski and Homeland Security Secretary Kristi Noem said U.S. Immigration and Customs Enforcement agents will be present at the 2026 Super Bowl and its halftime show.\n\n The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now!\n\n For Shakira, however, Bad Bunny's time to be at the center stage has been a long time coming — and is very well deserved.\n\n \"It’s about time,\" she told Variety in an interview published Tuesday, Oct. 21. \"I remember when we did ours that even having part of our set in Spanish was a bold move… Acceptance of Spanish-language music as part of the mainstream has come so far from when I started.\"\n\n The “She Wolf\" hitmaker likes to believe that all the time that her music was \"met with resistance or puzzlement from the English-speaking world before it was embraced, helped forge the path to where we are now.\"\n\n Shakira is \"so proud\" to watch Bad Bunny perform on \"the biggest stage in the world\" as he \"represents not only Latin culture but also how important Spanish language music has become on a global scale and how universal it has become.\"\n\n \"It's the perfect moment for a performance like this,\" she said. \"I can't wait to watch it.\"\n\n When asked for her thoughts on Bad Bunny being named the 2026 Super Bowl halftime show performer, Lopez, 56, encouraged sports fans to avoid closing themselves off to \"something wonderful.\"\n\n \"Don't do that to yourself. That's what I would say. I'm telling you, just give it a chance,\" she said during an Oct. 9, appearance on CBS Mornings.\n\n Bad Bunny, for his part, said in a press statement that his appointment as the 2026 Super Bowl Halftime Show performer is bigger than himself.\n\n “What I'm feeling goes beyond myself,\" his statement said. \"It's for those who came before me and ran countless yards so I could come in and score a touchdown… this is for my people, my culture, and our history. Ve y dile a tu abuela, que seremos el HALFTIME SHOW DEL SUPER BOWL.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n Super Bowl LX will take place at Levi's Stadium in Santa Clara, Calif., on Sunday, Feb. 8.","summary":"Bad Bunny joined Shakira on stage during the Super Bowl LIV halftime show to perform a rendition of Cardi B's \"I Like It\"","url":"https://people.com/shakira-says-about-time-bad-bunny-headlines-super-bowl-halftime-show-perfect-moment-11834262","image":"https://people.com/thmb/HxGdHmBvisL8lOt9BgV8gjKICHQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bad-bunny-shakira-102125-e4d4373e88374ddbb8d46d8c558d46a1.jpg","video":null,"publish_date":"2025-10-21 23:20:00","author":"Ingrid Vasquez","authors":["Ingrid Vasquez"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.22},{"id":371386554,"title":"Camila Cabello Joins Cast for Jonah Hill Comedy ‘Cut Off’","text":"Skip to main content\n\nOctober 21, 2025\n\nCamila Cabello during Paris Fashion Week on March 11, 2025.\n\nStephane Cardinale/Corbis via Getty Images\n\nCamila Cabello is back in her acting bag. On Tuesday, Warner Bros. announced that the “I Luv It” musician and Cinderella actress will join the cast for Cut Off, a new comedy film directed by Jonah Hill, who will also star alongside Kristen Wiig.\n\nLangston Kerman, who’s in the Abbott Elementary cast, will also join the cast. Cut Off, which was written by Hill and Ezra Woods, will follow two rich siblings, played by Hill and Wiig, who are cut off from their parents’ money. Nathan Lane and Bette Midler are set to play the parents.\n\nIt’s unclear what roles Cabello and Kerman will play in the movie, which is scheduled to premiere in theaters on July 17, 2026. According to Deadline, the film is being shot in California and is being co-produced by Hill, Matt Dines, and Ali Goodwin for Strong Bay.\n\nCabello has previously flexed her acting chops, after playing the titular character in Kay Cannon’s Cinderella, appearing in Chiwetel Ejiofor’s Rob Peace, and voicing a troll in Trolls Band Together.\n\nTrending Stories\n\nRina Sawayama Has Notes for the Team Behind Sabrina Carpenter’s Japan-Inspired ‘SNL’ Set\n\nRush Add 17 Cities to Surprise 2026 Tour: ‘We Have to Go Back Into the Gym!’\n\nAvenged Sevenfold Singer Defends Message to Israeli Hostages: ‘It’s Not Political — It’s Human’\n\nKenny Loggins Demands Removal of ‘Danger Zone’ From AI Clip of Trump Dumping Poop on Protesters\n\nWhen speaking to Rolling Stone for her cover of “Behind Blue Eyes” by the Who for video game Diablo IV: Vessel of Hatred last year, Cabello shared that she loved “almost acting when I’m singing.” The film announcement comes about a year after she released the “Magic City Edition” of her album C, XOXO. She also joined Adam Port, Stryv, and Malachiii on a viral remix of “Move” last year.\n\nFor his part, Kerman launched his own stand-up special for Netflix titled Bad Poetry, which was directed by John Mulaney. He’s also appeared in The Boys and Abbott Elementary, along with Peacock’s Bust Down.\n\nBillie Lourd Shares ‘Many Emotions’ About Mom Carrie Fisher on Her Birthday: ‘Magical Human’\n\nDavid Browne\n\nRoy Wood Jr.: The Rolling Stone Interview\n\nThe Rolling Stone Interview\n\nNikki McCann Ramirez\n\nRoy Wood Jr.: ‘Logic Isn’t the Weapon. It Might Need to Be Love’\n\nThe Rolling Stone Interview\n\nNikki McCann Ramirez\n\nJon Stewart Dubs Donald Trump the ‘Imitation Crab of Kings’ on ‘The Daily Show’\n\nLate-Night TV\n\nEmily Zemler\n\nPedro Pascal Rallies at ‘No Kings’ Protest in Los Angeles: ‘Protect Democracy’\n\n‘Only Queens’\n\nAngie Martoccio\n\nGo to PMC.com\n\nMost Popular\n\nAce Frehley, Kiss Lead Guitarist and Solo Artist, Dies at 74\n\nYouTube Just Ate TV. It’s Only Getting Started\n\nDiane Keaton’s Cause of Death Revealed After Friends Shared Devastating Details From Her Final Moments\n\nA 1957 Frank Lloyd Wright-Designed Home Added to the National Register of Historic Places\n\nYou might also like\n\nNeon, Waypoint Entertainment Sign Multi-Picture Slate Financing Deal Including ‘Sentimental Value,’ ‘No Other Choice’ and More (EXCLUSIVE)\n\n4 hours ago\n\n17 Halloween Makeup Products to Make the Perfect Costume, According to a Former Pro Body Painter\n\n16 minutes ago\n\n‘Every Heavy Thing’ and ‘Don’t Leave the Kids Alone’ Win Big at the 10th Brooklyn Horror Film Festival\n\n2 hours ago\n\nThis NBA Season Should See More Western Dominance\n\n5 hours ago\n\nRolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved.\n\nPowered by WordPress.com VIP","summary":"Abbott Elementary’s Langston Kerman joins the lineup for the film that also stars Kristen Wiig","url":"https://www.rollingstone.com/tv-movies/tv-movie-news/camila-cabello-joins-cast-jonah-hill-comedy-cut-off-1235451765/","image":"https://www.rollingstone.com/wp-content/uploads/2025/10/GettyImages-2204507125-1.jpg","video":null,"publish_date":"2025-10-21 23:13:59","author":"Tomás Mier","authors":["Tomás Mier"],"language":"en","source_country":"us","sentiment":0.666},{"id":371375328,"title":"Supervisors weigh options in replacing ousted San Mateo County sheriff","text":"A week after the unprecedented removal of Sheriff Christina Corpus, San Mateo County supervisors on Tuesday debated whether to appoint her successor or wait until June 2026 for voters to choose the county’s next top law enforcement officer.\n\nThe Board of Supervisors faces a dilemma between mounting costs from the removal process and the public choice for the next leader of the 800-person office with a $300 million-plus budget. While most supervisors signaled support for waiting until June 2026 to hold an election and avoid the $3.2 million cost of a special vote, they also worried about leaving a non-elected official in charge for months.\n\nUndersheriff Dan Perea, appointed by Corpus last year, is serving as the acting sheriff while the position remains vacant — a situation that some community members have raised as concerning, given his close ties to the former sheriff.\n\nCorpus, elected in 2022 as the county’s first Latina sheriff, was removed last week for alleged conflict-of-interest violations and retaliation. It was the first time in California history that a county board of supervisors has ousted a sitting sheriff.\n\nHer removal was made possible by Measure A, a charter amendment approved by voters in March that allows the board to remove a sheriff for cause with a four-fifths vote through 2028 — the end of what would have been Corpus’ term. The measure gives the board 30 days to either appoint a replacement or call a special or regular election.\n\nBoard President David Canepa acknowledged an election would be costly if held off-cycle, but called it the “cost of democracy.”\n\n“Those would be dollars well spent considering the crisis that we’re in,” Canepa said. “And this is the cost of democracy and bringing healing to a department that has gone through so much.”\n\nSupervisors Jackie Speier and Lisa Gauthier supported a June 2026 election, saying it would give candidates time to prepare their campaigns and engage with the community.\n\nMeanwhile, Supervisor Ray Mueller emphasized the importance of giving voters a choice but expressed concerns about the long-term effects of holding an off-cycle election.\n\nAlthough the county charter does not allow for an interim appointment, Mueller suggested appointing a sheriff who would pre-sign a resignation effective before the June 2026 election and agree not to run for the seat. He also noted that a simple majority could win the election, with as little as 10–11% of the vote.\n\n“It would be a winner-take-all special election,” Mueller said. “And that means that someone with as low as 10% of the vote could become sheriff.”\n\nMueller noted this workaround would give the sheriff’s office a brief period of stable, vetted leadership until the higher-turnout primary election. But County Attorney John Nibbelin confirmed that nothing in the charter would prevent the appointee from changing their mind about running.\n\n“The board, to be clear, when they make an appointment, they’re not making an interim appointment,” Nibbelin said. “And if somebody decided that they didn’t want to resign after they told you they would, we as a county would be stuck with that.”\n\nSupervisor Noelia Corzo said choosing the next sheriff is critical to protecting the county’s vulnerable immigrant residents, citing President Donald Trump’s threats to send federal agents and the National Guard to neighboring San Francisco.\n\n“I also think that, you know, with the reality of the federal administration right now, this is a really sensitive time for our community,” Corzo said. “And frankly, I personally feel a lot of pressure to make sure that we are protecting our undocumented community because they are very, very vulnerable right now. And who we have or when we have someone to fill the role of sheriff in this county is going to be really critical.”\n\nBecause Corpus is seeking reinstatement through ongoing legal challenges, the county agreed to keep the position vacant for at least 14 days.\n\nThe process has already cost taxpayers millions.\n\nThe March special election alone cost $4.4 million, according to county appropriations records, while the investigation into Corpus’ alleged misconduct by retired Judge LaDoris Cordell in November 2024 added at least $200,000.\n\nCorpus was allowed to retire — a decision she said was made “under duress” — in order to keep her pension and health benefits. Transparent California records show Corpus earned $384,000 in 2024, including bonuses and other compensation.\n\nCanepa told KTVU that Corpus was entitled to 90% of her salary and that the board would not challenge her retirement. However, a county spokesperson said the county has no control over the sheriff’s retirement benefits, which are administered by the San Mateo County Employees’ Retirement Association (SamCERA).\n\n“(It) is a separate legal entity from the county; the county does not administer retirement benefits and therefore I can’t speak to retirement benefits or other details,” said county spokesperson Effie Milionis Verducci. “The actions taken under Measure A are distinct actions. Corpus was removed from office by a unanimous vote by the Board of Supervisors, and that action was not affected (by her retirement).”\n\nSamCERA confirmed that Corpus was allowed to retire, but did not disclose the terms of her retirement package, citing privacy concerns.\n\nApart from her retirement, county officials have not revealed additional expenses related to investigations, consultants, or legal fees, due to attorney-client privilege.\n\nMoving forward with Corpus’ replacement, supervisors said they plan to hold a special evening session on Oct. 28 to gather public and stakeholder feedback, with a final decision expected at the Nov. 4 meeting.","summary":"An off-cycle election could cost San Mateo County at least $3.2 million, according to county officials","url":"https://www.mercurynews.com/2025/10/21/san-mateo-sheriff-replacement-appointment-election-debate/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/SJM-L-CORPREMOV-10XX-28.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-21 23:09:50","author":"Ryan Macasero","authors":["Ryan Macasero"],"language":"en","source_country":"us","sentiment":-0.095},{"id":371373370,"title":"San Francisco leaders push back against Trump’s National Guard threat","text":"By OLGA R. RODRIGUEZ and JANIE HAR\n\nSAN FRANCISCO (AP) — President Donald Trump keeps threatening to send National Guard troops to San Francisco next, blasting the California city as crime-ridden and saying its residents are clamoring for federal help.\n\nBut local and state leaders say that couldn’t be farther from the truth, noting overall crime is down and the city has started to turn around its downtrodden pandemic image. Residents and workers out downtown this week said they’re puzzled and concerned by Trump’s threat.\n\n“This is a safe American city,” Mayor Daniel Lurie told The Associated Press last week. “We got this in San Francisco.”\n\nThe Republican president has referenced crime as his justification for possibly sending troops to the city of roughly 830,000. He’s deployed the Guard over crime concerns to Washington, D.C., where he has direct control of the National Guard, and Memphis, where the Republican governor supports their presence. Los Angeles was the first city where Trump deployed the Guard, arguing it was necessary to protect federal buildings and agents as protesters fought back against mass immigration arrests. He’s since said they’re needed in Chicago and Portland, Oregon, as well.\n\nResidents and leaders in Portland were surprised by Trump’s attention when he described the city as besieged by violent protests. In reality, nightly protests were small and limited to the area outside a federal immigration building. While there were some arrests for violence, the demonstrations were far less intense than those that roiled the downtown in 2020 following the death of George Floyd.\n\nIn San Francisco, too, Trump seems to be relying on an outdated picture of a city often targeted by conservatives.\n\n“The difference is, I think they want us in San Francisco,” Trump said Sunday on Fox News. “San Francisco was truly one of the great cities of the world. And then, 15 years ago, it went wrong. It went woke.”\n\nHis comments angered and baffled Kate Freudenberger, who works in retail.\n\n“You’ve been walking around the city, it’s peaceful, there is no insurrection,” she said Tuesday morning, adding that immigration authorities have not been as active in San Francisco as in other cities, “so there’s really been nothing for us to coalesce around.”\n\nMarc Benioff, the chief executive of San Francisco-based software giant Salesforce, caused a stir when he told the New York Times earlier this month that he’d welcome Guard troops to help quell crime ahead of his major annual business conference. He has since apologized for his remarks, saying the conference was the “largest and safest” in its history and the Guard is not needed.\n\nThe city emerges from struggles\n\nSan Francisco is still recovering from the coronavirus pandemic, which emptied its downtown and brought renewed attention to street homelessness and open drug dealing. But signs indicate a city on the upswing. Artificial intelligence startups are snapping up office space, and home rental prices are rising. San Francisco saw a 21% increase from last year in office visits, according to location analytics platform Placer.ai, and public transit ridership is at its highest levels since the pandemic.\n\nThe Wall Street Journal this week declared the city was emerging from its “doom loop,” an article the mayor eagerly shared on social media.\n\nSidewalks are cleaner and tent encampments have largely disappeared from view. In the Tenderloin, one of the most troubled neighborhoods, teams of city and nonprofit workers on Monday helped school children cross the street, walked around picking up trash or counseled homeless people. It was a different image than during the pandemic, when hundreds of people camped on sidewalks.\n\nStill, the Tenderloin is a problem spot for public drug use and dealing, as are the Mid-Market and Mission neighborhoods. But overall crime is down more than 26% this year compared to the same period last year, according to the San Francisco Police Department. Vehicle break-ins — which have vexed tourists and residents alike — are at a 22-year low, Lurie said.\n\nLurie, a centrist Democrat who has tried to avoid confrontations with Trump by ignoring many of the president’s comments, said Monday he’d welcome more federal help to arrest drug dealers and disrupt drug markets. But sending in the Guard wouldn’t achieve that, he said.\n\n“The National Guard does not have the authority to arrest drug dealers—and sending them to San Francisco will do nothing to get fentanyl off the streets or make our city safer,” Lurie said in a statement.\n\nSan Francisco voters in 2024 gave police the authority to use drones, surveillance cameras and other technology to fight crime. They also ousted politically progressive District Attorney Chesa Boudin in a 2022 recall election and installed Brooke Jenkins, considered to be much tougher on crime than her predecessor. Lurie has pushed to hire and retain police officers, and entry-level police applications are up 40% over last year.\n\nCalifornia leaders pledge to fight back\n\nMeanwhile, Gov. Gavin Newsom’s administration has said it would push back forcefully on any deployment, as it did when Trump first ordered the California National Guard into Los Angeles against Newsom’s wishes. California Attorney General Rob Bonta vowed to “be in court within hours, if not minutes” if there is a federal deployment.\n\nLawsuits by Democratic officials in Chicago and Portland have so far blocked troops from going out on city streets.\n\nLibby Baxter, a retired nurse, said Trump has sent the National Guard to Democratic cities to create “chaos and unrest” and she fears the same could happen in San Francisco.\n\n“I believe that that may happen if they come to San Francisco because we are a very tolerant community, but we don’t do well with somebody coming in and trying to dictate or take over certain parts of our city,” she said.","summary":"San Francisco hasn't seen the same federal immigration enforcement as other cities.","url":"https://www.bostonherald.com/2025/10/21/federal-enforcement-san-francisco/","image":"https://www.bostonherald.com/wp-content/uploads/2025/10/Federal_Enforcement_San_Francisco_32147.jpg?w=1024&h=683","video":null,"publish_date":"2025-10-21 23:09:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129},{"id":371379074,"title":"San Francisco leaders push back against Trump’s National Guard threat","text":"By OLGA R. RODRIGUEZ and JANIE HAR\n\nSAN FRANCISCO (AP) — President Donald Trump keeps threatening to send National Guard troops to San Francisco next, blasting the California city as crime-ridden and saying its residents are clamoring for federal help.\n\nBut local and state leaders say that couldn’t be farther from the truth, noting overall crime is down and the city has started to turn around its downtrodden pandemic image. Residents and workers out downtown this week said they’re puzzled and concerned by Trump’s threat.\n\n“This is a safe American city,” Mayor Daniel Lurie told The Associated Press last week. “We got this in San Francisco.”\n\nThe Republican president has referenced crime as his justification for possibly sending troops to the city of roughly 830,000. He’s deployed the Guard over crime concerns to Washington, D.C., where he has direct control of the National Guard, and Memphis, where the Republican governor supports their presence. Los Angeles was the first city where Trump deployed the Guard, arguing it was necessary to protect federal buildings and agents as protesters fought back against mass immigration arrests. He’s since said they’re needed in Chicago and Portland, Oregon, as well.\n\nResidents and leaders in Portland were surprised by Trump’s attention when he described the city as besieged by violent protests. In reality, nightly protests were small and limited to the area outside a federal immigration building. While there were some arrests for violence, the demonstrations were far less intense than those that roiled the downtown in 2020 following the death of George Floyd.\n\nIn San Francisco, too, Trump seems to be relying on an outdated picture of a city often targeted by conservatives.\n\n“The difference is, I think they want us in San Francisco,” Trump said Sunday on Fox News. “San Francisco was truly one of the great cities of the world. And then, 15 years ago, it went wrong. It went woke.”\n\nHis comments angered and baffled Kate Freudenberger, who works in retail.\n\n“You’ve been walking around the city, it’s peaceful, there is no insurrection,” she said Tuesday morning, adding that immigration authorities have not been as active in San Francisco as in other cities, “so there’s really been nothing for us to coalesce around.”\n\nMarc Benioff, the chief executive of San Francisco-based software giant Salesforce, caused a stir when he told the New York Times earlier this month that he’d welcome Guard troops to help quell crime ahead of his major annual business conference. He has since apologized for his remarks, saying the conference was the “largest and safest” in its history and the Guard is not needed.\n\nThe city emerges from struggles\n\nSan Francisco is still recovering from the coronavirus pandemic, which emptied its downtown and brought renewed attention to street homelessness and open drug dealing. But signs indicate a city on the upswing. Artificial intelligence startups are snapping up office space, and home rental prices are rising. San Francisco saw a 21% increase from last year in office visits, according to location analytics platform Placer.ai, and public transit ridership is at its highest levels since the pandemic.\n\nThe Wall Street Journal this week declared the city was emerging from its “doom loop,” an article the mayor eagerly shared on social media.\n\nSidewalks are cleaner and tent encampments have largely disappeared from view. In the Tenderloin, one of the most troubled neighborhoods, teams of city and nonprofit workers on Monday helped school children cross the street, walked around picking up trash or counseled homeless people. It was a different image than during the pandemic, when hundreds of people camped on sidewalks.\n\nStill, the Tenderloin is a problem spot for public drug use and dealing, as are the Mid-Market and Mission neighborhoods. But overall crime is down more than 26% this year compared to the same period last year, according to the San Francisco Police Department. Vehicle break-ins — which have vexed tourists and residents alike — are at a 22-year low, Lurie said.\n\nLurie, a centrist Democrat who has tried to avoid confrontations with Trump by ignoring many of the president’s comments, said Monday he’d welcome more federal help to arrest drug dealers and disrupt drug markets. But sending in the Guard wouldn’t achieve that, he said.\n\n“The National Guard does not have the authority to arrest drug dealers—and sending them to San Francisco will do nothing to get fentanyl off the streets or make our city safer,” Lurie said in a statement.\n\nSan Francisco voters in 2024 gave police the authority to use drones, surveillance cameras and other technology to fight crime. They also ousted politically progressive District Attorney Chesa Boudin in a 2022 recall election and installed Brooke Jenkins, considered to be much tougher on crime than her predecessor. Lurie has pushed to hire and retain police officers, and entry-level police applications are up 40% over last year.\n\nCalifornia leaders pledge to fight back\n\nMeanwhile, Gov. Gavin Newsom’s administration has said it would push back forcefully on any deployment, as it did when Trump first ordered the California National Guard into Los Angeles against Newsom’s wishes. California Attorney General Rob Bonta vowed to “be in court within hours, if not minutes” if there is a federal deployment.\n\nLawsuits by Democratic officials in Chicago and Portland have so far blocked troops from going out on city streets.\n\nLibby Baxter, a retired nurse, said Trump has sent the National Guard to Democratic cities to create “chaos and unrest” and she fears the same could happen in San Francisco.\n\n“I believe that that may happen if they come to San Francisco because we are a very tolerant community, but we don’t do well with somebody coming in and trying to dictate or take over certain parts of our city,” she said.","summary":"San Francisco hasn't seen the same federal immigration enforcement as other cities.","url":"https://www.sandiegouniontribune.com/2025/10/21/federal-enforcement-san-francisco/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/10/Federal_Enforcement_San_Francisco_32147.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-21 23:09:22","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":371379792,"title":"San Francisco leaders push back against Trump’s National Guard threat","text":"By OLGA R. RODRIGUEZ and JANIE HAR\n\nSAN FRANCISCO (AP) — President Donald Trump keeps threatening to send National Guard troops to San Francisco next, blasting the California city as crime-ridden and saying its residents are clamoring for federal help.\n\nBut local and state leaders say that couldn’t be farther from the truth, noting overall crime is down and the city has started to turn around its downtrodden pandemic image. Residents and workers out downtown this week said they’re puzzled and concerned by Trump’s threat.\n\n“This is a safe American city,” Mayor Daniel Lurie told The Associated Press last week. “We got this in San Francisco.”\n\nThe Republican president has referenced crime as his justification for possibly sending troops to the city of roughly 830,000. He’s deployed the Guard over crime concerns to Washington, D.C., where he has direct control of the National Guard, and Memphis, where the Republican governor supports their presence. Los Angeles was the first city where Trump deployed the Guard, arguing it was necessary to protect federal buildings and agents as protesters fought back against mass immigration arrests. He’s since said they’re needed in Chicago and Portland, Oregon, as well.\n\nResidents and leaders in Portland were surprised by Trump’s attention when he described the city as besieged by violent protests. In reality, nightly protests were small and limited to the area outside a federal immigration building. While there were some arrests for violence, the demonstrations were far less intense than those that roiled the downtown in 2020 following the death of George Floyd.\n\nIn San Francisco, too, Trump seems to be relying on an outdated picture of a city often targeted by conservatives.\n\n“The difference is, I think they want us in San Francisco,” Trump said Sunday on Fox News. “San Francisco was truly one of the great cities of the world. And then, 15 years ago, it went wrong. It went woke.”\n\nHis comments angered and baffled Kate Freudenberger, who works in retail.\n\n“You’ve been walking around the city, it’s peaceful, there is no insurrection,” she said Tuesday morning, adding that immigration authorities have not been as active in San Francisco as in other cities, “so there’s really been nothing for us to coalesce around.”\n\nMarc Benioff, the chief executive of San Francisco-based software giant Salesforce, caused a stir when he told the New York Times earlier this month that he’d welcome Guard troops to help quell crime ahead of his major annual business conference. He has since apologized for his remarks, saying the conference was the “largest and safest” in its history and the Guard is not needed.\n\nThe city emerges from struggles\n\nSan Francisco is still recovering from the coronavirus pandemic, which emptied its downtown and brought renewed attention to street homelessness and open drug dealing. But signs indicate a city on the upswing. Artificial intelligence startups are snapping up office space, and home rental prices are rising. San Francisco saw a 21% increase from last year in office visits, according to location analytics platform Placer.ai, and public transit ridership is at its highest levels since the pandemic.\n\nThe Wall Street Journal this week declared the city was emerging from its “doom loop,” an article the mayor eagerly shared on social media.\n\nSidewalks are cleaner and tent encampments have largely disappeared from view. In the Tenderloin, one of the most troubled neighborhoods, teams of city and nonprofit workers on Monday helped school children cross the street, walked around picking up trash or counseled homeless people. It was a different image than during the pandemic, when hundreds of people camped on sidewalks.\n\nStill, the Tenderloin is a problem spot for public drug use and dealing, as are the Mid-Market and Mission neighborhoods. But overall crime is down more than 26% this year compared to the same period last year, according to the San Francisco Police Department. Vehicle break-ins — which have vexed tourists and residents alike — are at a 22-year low, Lurie said.\n\nLurie, a centrist Democrat who has tried to avoid confrontations with Trump by ignoring many of the president’s comments, said Monday he’d welcome more federal help to arrest drug dealers and disrupt drug markets. But sending in the Guard wouldn’t achieve that, he said.\n\n“The National Guard does not have the authority to arrest drug dealers—and sending them to San Francisco will do nothing to get fentanyl off the streets or make our city safer,” Lurie said in a statement.\n\nSan Francisco voters in 2024 gave police the authority to use drones, surveillance cameras and other technology to fight crime. They also ousted politically progressive District Attorney Chesa Boudin in a 2022 recall election and installed Brooke Jenkins, considered to be much tougher on crime than her predecessor. Lurie has pushed to hire and retain police officers, and entry-level police applications are up 40% over last year.\n\nCalifornia leaders pledge to fight back\n\nMeanwhile, Gov. Gavin Newsom’s administration has said it would push back forcefully on any deployment, as it did when Trump first ordered the California National Guard into Los Angeles against Newsom’s wishes. California Attorney General Rob Bonta vowed to “be in court within hours, if not minutes” if there is a federal deployment.\n\nLawsuits by Democratic officials in Chicago and Portland have so far blocked troops from going out on city streets.\n\nLibby Baxter, a retired nurse, said Trump has sent the National Guard to Democratic cities to create “chaos and unrest” and she fears the same could happen in San Francisco.\n\n“I believe that that may happen if they come to San Francisco because we are a very tolerant community, but we don’t do well with somebody coming in and trying to dictate or take over certain parts of our city,” she said.","summary":"San Francisco hasn't seen the same federal immigration enforcement as other cities.","url":"https://www.twincities.com/2025/10/21/federal-enforcement-san-francisco/","image":"https://www.twincities.com/wp-content/uploads/2025/10/Federal_Enforcement_San_Francisco_32147.jpg?w=1024&h=683","video":null,"publish_date":"2025-10-21 23:09:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.129}]}