{"offset":0,"number":50,"available":11395,"news":[{"id":369629540,"title":"NBA suspends employee who mocked Charlie Kirk's assassination online","text":"The NBA has suspended an employee for 'violating multiple polices' after they celebrated Charlie Kirk's assassination on social media.\n\nA league spokesperson told OutKick on Wednesday: 'The project employee has been suspended without pay for two weeks for violating multiple NBA policies.'\n\nIt's alleged the unnamed employee shared Facebook and Instagram stories mocking Kirk after he was shot dead in Utah on September 10.\n\nThe posts reportedly called Kirk a 'terrible person' and a 's***hole'.\n\nAccording to OutKick, a screenshot of Kirk from the @RogueDNC Instagram account was accompanied by the caption, 'What is Charlie Kirk's legacy?'\n\nThe employee then followed up by commenting: 'Did absolutely nothing healthy for the world except spew dangerous rhetoric… There is no legacy… he was a terrible person (a s***hole).' \n\nAnother post read: 'Oh I also forgot to include \"thoughts and prayers\" LMAO.'\n\nThe employee's social media profile photo reportedly includes the NBA logo and their accounts say they work for NBA Entertainment. \n\nIn the aftermath of Kirk's assassination, the NFL's Carolina Panthers fired a junior employee over insensitive posts he made.\n\nCharlie Rock - who worked as the Panthers' Football Communications Coordinator - was dismissed by the team over the alleged posts on Instagram.\n\nTrump ally Kirk was shot and killed while speaking at a Q&A event for Turning Point USA - the conservative nonprofit organization he founded back in 2012 - at Utah Valley University, with his assassination sending shockwaves across the world.\n\nImages circulated on social media appearing to show that Rock shared a video of Kirk saying 'it's worth it to have a cost of, unfortunately, some gun deaths every single year' in order to protect Second Amendment rights, before adding his own comment.\n\nHe allegedly wrote alongside it: 'Why are yall sad? Your man said it was worth it...'\n\nAnother screenshot also showed Rock's Instagram account allegedly posting the song 'Protect Ya Neck' by the Wu-Tang Clan after Kirk was fatally shot in the neck.\n\nThe Panthers said in a statement: 'The views expressed by our employees are their own and do not represent those of the Carolina Panthers. We do not condone violence of any kind. \n\n'We are taking this matter very seriously and have accordingly addressed it with the individual.'\n\nPresident Donald Trump on Tuesday posthumously awarded America's highest civilian honor to Kirk.\n\nReceiving the award on Kirk's behalf was his widow, Erika. Her voice cracking and often falling to a whisper as she wiped away tears, she talked about her late husband's life, political beliefs and legacy.\n\n'Thank you, Mr. President, for honoring my husband, in such a profound and meaningful way. And thank you for making this event a priority,' she said.\n\n'Your support of our family and the work that Charlie devoted his life to will be something I cherish forever.'\n\nThe ceremony coincided with what would have been Kirk´s 32nd birthday. It came about a month after the Turning Point USA founder was fatally shot while speaking to a crowd at Utah Valley University.\n\nIn a sign of Kirk's close ties to the administration, he was the first recipient of the Presidential Medal of Freedom in Trump´s second term.\n\nThe president also spoke at Kirk's funeral in September, calling him a 'great American hero' and 'martyr' for freedom, while Vice President JD Vance accompanied his body home to Arizona on Air Force Two along with Erika.","summary":"It's alleged the unnamed employee shared Facebook and Instagram stories mocking Kirk after he was shot dead in Utah on September 10.","url":"https://www.dailymail.co.uk/sport/nba/article-15196563/NBA-suspends-employee-mocked-Charlie-Kirk.html","image":"https://i.dailymail.co.uk/1s/2025/10/16/01/103028529-0-image-m-22_1760575403620.jpg","video":null,"publish_date":"2025-10-16 01:07:08","author":"Editor,Max Winters","authors":["Editor","Max Winters"],"language":"en","category":"politics","source_country":"jp","sentiment":0.232},{"id":369629546,"title":"Inside LIV's fight for survival: The eye-watering amount of money the Saudis are losing, the players they're desperately trying to tempt from the PGA Tour and the secret meeting that could lead to another twist in golf's most dramatic saga","text":"The first week of this month was tricky for Yasir Al-Rumayyan, a man whose vast power can sway nations but offers no guarantees against the whims of golf.\n\nIt started with nine-figure losses in a certain set of financial accounts and ended with a three-day slog against the gales in Scotland, where he indulged his greatest passion by contesting the Alfred Dunhill Links Championship.\n\nFor the governor of the $1trillion Saudi sovereign wealth fund, whose sidelines include the chairmanships of Newcastle United and the LIV Golf rebel circuit, that meant taking a spot in the tournament’s pro-am alongside Patrick Reed, one of the more maligned golfers on his payroll.\n\nPlaying together, this collaboration of outsiders finished 108th out of 168 teams at St Andrews.\n\nBut golf is nothing if not a test of one’s ability to smile at bad bounces and Al-Rumayyan was still upbeat by the end of the week - he walked on stage at a party for the tournament’s high rollers and belted out a few verses to Sweet Caroline.\n\nHe was having a proper go at it, cutting loose in a world where, for all the carnage he has funded since the inception of his LIV-branded asteroid in 2021, he desperately wants to be accepted.\n\nBut the good times have never seemed overwhelmingly good for his creation, and that is a view hardened by the numbers on a different kind of scorecard from the same week.\n\nAccounts for LIV Golf Ltd, which represents the breakaway league’s business outside the United States, were filed at Companies House in the UK on October 1. Their contents were alarming, considering they showed 2024 was the entity’s best year for revenues, taking in £64.9million, but still they recorded a £461.8m deficit.\n\nIt is an astonishing shortfall that doesn’t even factor for LIV’s dealings in the US, where they staged half of their 14 tournaments last year.\n\nSpanning both markets, the overall outlay from Saudi Arabia across four seasons (counting the 2025 campaign) is an estimated £4billion, but the total returns on that outlay are undisclosed. \n\nSo are the overall losses, but the recent accounts tell us the UK-based operation alone has lost £1.1billion between its incorporation on October 26, 2021 and the close of business in 2024.\n\nWe will go shortly to the progress made on the breakaway circuit. But as of now, LIV remains an entity that has no access to world ranking points, leaving only the narrow portals to the majors for its stars, and is also contending against expiring player contracts at a time when money is pouring through the cracks.\n\nAs LIV slip ever deeper into the red, volume and urgency is added to questions that have existed at every step of the way: what comes next? And is it even remotely sustainable?\n\nDaily Mail Sport has spoken to informed sources on all sides of the divide in efforts to establish an answer.\n\nMuch of the heat has gone out of golf’s frenzied civil war since LIV’s backers, the Saudi Public Investment Fund led by Al-Rumayyan, signed a framework agreement for a merger with the PGA Tour and DP World Tour in June 2023. The shock of the announcement was immense.\n\nBut subsequent progress towards that reunification has been glacial, with the glib truth being that Donald Trump was able to influence a level of peace in Gaza more effectively than he could between rival golf tours.\n\nThe US President boasted it would take him 15 minutes to fix upon re-election, but ever since Al-Rumayyan left the White House unsatisfied on February 20, following a meeting with a PGA Tour delegation featuring Tiger Woods, optimism has been replaced by silence and boredom. ‘No agreement is anywhere close,’ said a prominent source from one of the traditional tours last week.\n\nThe perception remains that the PGA Tour, once terrified by legal costs and the exodus of star names from Phil Mickelson to Bryson DeChambeau, no longer needs the deal.\n\nThe injection of $3bn in 2024 from Strategic Sports Group, a consortium fronted by Liverpool owner John W Henry, has been the biggest factor in the PGA Tour feeling sure of its position. But the failure of LIV to sign a marquee name since the poaching of Jon Rahm (acquired for around £400m) and Tyrrell Hatton (around £40m) either side of Christmas in 2023 has also fed the PGA Tour’s confidence that LIV’s free-spending approach has been curtailed by the Saudis. They appear to think LIV can be starved out.\n\nThat has left LIV in a curious position, nurturing a roster of supreme, expensive and ageing talent but apparently low on ammunition. Furthermore, they now have to look inward to keep what they have.\n\nOf their first wave of star arrivals, it is known that two-time major winner Dustin Johnson, for one, is out of contract this winter. Next year, the cohort of expiring deals will swell to include DeChambeau and Brooks Koepka.\n\nOn that front, LIV sources believe ‘everyone they want to keep will stay’, and their standing is strengthened by the wider political mess. Because where else would they be welcomed in the current climate?\n\nBut as yet there have been no confirmations of deals being signed. That being said, Daily Mail Sport understands Johnson was in New York for meetings with LIV bosses last week. His representatives did not respond to our request for comment, but there is confidence at LIV that the 41-year-old will stick around.\n\nWhat currently seems unlikely is a scenario where large bonuses are paid to those minded to stay. The DeChambeau situation will be particularly interesting, given he has won a second major and become golf’s foremost online influencer since defecting in 2022. His value to LIV has risen, with the added factor that he is personally close to Al-Rumayyan and is among the minority of stars who joined in his prime. Keeping him is both essential and highly probable.\n\nAs for new arrivals viewed as needle-moving, there have been no big beasts since Hatton in January 2024. While Rory McIlroy was left personally disappointed by the departure of Northern Irishman Tom McKibbin earlier this year, it didn’t send out shockwaves. Likewise the signing of Josele Ballester, a talented Spaniard best known for urinating in Rae’s Creek during the Masters this year. Most of the newer recruits have been lower-profile golfers promoted from feeder leagues in Asia.\n\nOne LIV target suggested to Daily Mail Sport by multiple agents spanning all tours was world No 45 Min Woo Lee, who won on the PGA Tour this year. The Australian’s manager, Brent Hamilton, insisted to us on Monday that ‘there is no validity in the rumours – he is happy on the PGA Tour’.\n\nEngland’s Marco Penge, who won the Spanish Open at the weekend, is also the subject of range chatter but is evidently focused on taking a PGA Tour card next season. Quieter rumours around Europe’s Ryder Cup twins, Rasmus and Nicolai Hojgaard, are considered highly unlikely by our sources.\n\nNaturally, all dynamics could change if Al-Rumayyan reconnects the money tap. But presently he appears trapped in a race against time and in possession of depreciating assets – Mickelson is 55, Lee Westwood is 52 and Ian Poulter turns 50 in January.\n\nIt has long been the assumption, or possibly the hope, among golf’s traditional bodies that even the Saudis will have a limit in their indulgence of Al-Rumayyan’s passion project – their efforts in golf have been hugely expensive and failed to deliver the breakthrough achieved for less in football.\n\nTo speak to those at LIV is to hear of an evolving concept that retains its support from up above. With the flammable Greg Norman gone as commissioner and replaced this year by Scott O’Neil, a long-time sports executive of sharper business acumen, there have been legitimate signs of an improving product.\n\nMulti-year deals with HSBC and a mainstream broadcaster in the US, Fox Sports, also suggest growth and some investor faith. Crowds of 102,000 across the three days of their Adelaide event in February would be worthy of envy from both the PGA and DP World Tours.\n\nThe counterpoint would be those dire finances. One well-connected source told Daily Mail Sport that the LIV event in Singapore in March cost almost $50m to stage and drew a four-figure crowd. ‘Not a viable business model,’ they deduced.\n\nIf there is one avenue of great intrigue it comes from a potential collaboration away from the PGA Tour.\n\nThe hierarchy of the DP World Tour, or the European Tour in old money, has been tethered to the PGA Tour by a strategic alliance since 2021, when the LIV threat first appeared.\n\nMany, including Westwood and Sergio Garcia from LIV, have accused the European set-up of subservience in that arrangement and from such sentiments has risen a hypothetical scenario that has been bandied about by onlookers for the better part of two years: what if the DP World Tour and the Saudis got into bed together when that strategic alliance reaches its break clause in 2027?\n\nThe European hierarchy have spoken openly about conversations with the Saudis and LIV, and insist all onus is placed on a three-way co-existence that would not displease the PGA Tour.\n\nOn that front, Daily Mail Sport has learned about a meeting in May, where O’Neil allegedly briefed a number of LIV golfers at their event in South Korea about a closer collaboration with the Europeans and indicated confidence of a development. At face value, that would indicate dialogue was more advanced than previously known.\n\nBut most sources are highly sceptical about any possible side-deal between the DP World Tour and the Saudis, particularly one that would agitate the PGA Tour. Referring to that gathering in South Korea, one experienced insider said: ‘Scott does say a lot of things and not all of them happen…’\n\nThat nothing has materialised can leave one to draw their own conclusions, especially at a point when the DP World Tour is fighting its own skirmishes against LIV.\n\nCurrently, LIV golfers often play in DP events (there is no such bridge to the PGA Tour), but there has been great rancour about heavy, recurring fines levied against members who defected, which is a matter still being fought via a legal appeal from Hatton and Rahm and could result in two European heavyweights missing the next Ryder Cup.\n\nLike so much in the mess of the past four years, that issue is unresolved. \n\nMeanwhile, the imperative only grows on Al-Rumayyan to channel his favourite lyrics by touching hands on a deal - any deal - that makes all the trouble worthwhile.","summary":"The first week of this month was tricky for LIV boss Yasir Al-Rumayyan, a man whose immense power can sway nations but offers no guarantees against the whims of golf.","url":"https://www.dailymail.co.uk/sport/golf/article-15194163/LIV-golf-PGA-Tour-Yasir-Al-Rumayyan.html","image":"https://i.dailymail.co.uk/1s/2025/10/15/13/103008943-0-image-m-19_1760532979339.jpg","video":null,"publish_date":"2025-10-16 01:00:49","author":"Editor,Riath Al-Samarrai","authors":["Editor","Riath Al-Samarrai"],"language":"en","source_country":"jp","sentiment":0.143},{"id":369629056,"title":"Morning Digest: Trump claims India assured not buy Russian oil; U.K. sanctions Gujarat’s Nayara Refinery, and more","text":"Trump claims Modi has assured him India will not buy Russian oil\n\nU.S. President Donald Trump said that Indian Prime Minister Narendra Modi told him that India will stop buying oil from Russia, a move Mr. Trump described as a “big step” in efforts to isolate Moscow economically.\n\nU.K. sanctions Gujarat’s Nayara Refinery\n\nThe British government has sanctioned the Vadinar (Jamnagar) oil refinery owned by Nayara Energy Ltd., on Wednesday. The sanctions are part of the U.K.’s sanctions on Russia’s two largest oil companies, Lukeoil and Rosneft, which own 49.13% of Nayara. The E.U. had already sanctioned the refinery on July 18.\n\nYoung and jobless: key demographic weighs claims and promises of parties\n\nIn poll-bound Bihar, most young voters agree that the need for government jobs is their top priority. There are about 1.63 crore voters aged 18 to 29 years, making up 22% of the State’s electorate, of which 1.5 crore are abve 20 years. \n\nPakistan, Afghanistan agree to 48-hour ceasefire: Pakistani Government\n\nPakistan and Afghanistan agreed to a 48-hour ceasefire on Wednesday (October 15, 2025), the foreign ministry in Islamabad said, after dozens of troops and civilians were killed earlier in a fresh round of border skirmishes.\n\nMaoist menace present in only 11 districts, three ‘most-affected’: Home Ministry\n\nOn a day when senior CPI (Maoist) leader Mallojula Venugopal Rao, alias Bhupati, and 60 other cadres surrendered in Maharashtra, the Union Home Ministry said the number of Left-Wing Extremism-affected (LWE) districts has now come down to 11 from 18 earlier this year.\n\nU.S. judge temporarily halts shutdown layoffs of federal workers\n\nA federal judge ordered a temporary halt to the layoffs by the Trump administration of thousands of federal workers during the government shutdown, U.S. media reported.\n\nLadakh eases curbs after normalcy returns\n\nThe Ladakh administration lifted restrictions on the assembly of more than four persons in Leh, 20 days after the region witnessed violence that left four civilians dead. \n\nIndian team in U.S. to discuss tariffs, shutdown not “right time” for official negotiation on trade deal: Commerce Secretary\n\nA team from India is currently in the U.S. to discuss issues relating to tariffs, according to Commerce Secretary Rajesh Agrawal. However, due to the ongoing shutdown in the U.S. government, it is not “the right time” to hold the next official round of negotiations on a Bilateral Trade Agreement (BTA), he said. \n\nBihar polls: BJP firefights as allies protest ‘disproportionate’ seats for Chirag Paswan\n\nBJP leaders had their hands full on Wednesday as allies Rashtriya Lok Morcha and Hindustan Awam Morcha voiced displeasure over “disproportionate” allocation of seats to Chirag Paswan’s Lok Janshakti Party (Ram Vilas), forcing re-negotiations over several seats.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/the-hindu-morning-digest-october-16-2025/article70168671.ece","image":"https://th-i.thgim.com/public/incoming/heolwr/article70169023.ece/alternates/LANDSCAPE_1200/2025-10-13T111156Z_1988225807_RC2ZTCAS7RD5_RTRMADP_3_USA-TRUMP-TARIFFS-INDIA.JPG","video":null,"publish_date":"2025-10-16 00:40:00","author":"Nayara Energy Ltd","authors":["Nayara Energy Ltd"],"language":"en","category":"politics","source_country":"in","sentiment":-0.13},{"id":369628466,"title":"Trump Claims PM Modi Has Agreed 'India Will Not Buy Russian Oil'","text":"US President Donald Trump said on Wednesday that Prime Minister Narendra Modi had assured him India would stop purchasing oil from Russia, calling it a “big step” toward isolating Moscow economically.India has become one of the largest customers for Russian seaborne crude since Western governments imposed sanctions after Moscow’s 2022 invasion of Ukraine. “I was not happy that India was buying oil, and he assured me today that they will not be buying oil from Russia. That’s a big step. Now we’re going to get China to do the same thing,” Trump told reporters at a White House event.“All we want from President Putin is to stop this — stop killing Ukrainians and stop killing Russians because he’s killing a lot of Russians,” Trump said. “The hatred of the two leaders (Volodymyr Zelensky and Vladimir Putin) is a lot, it’s an obstacle... But I think we’ll get them. If India doesn’t buy oil, it makes it much easier... They will not be buying oil from Russia and they’ll go back to Russia after the war is over.”While India is yet to release a statement, Trump’s remarks, if confirmed, could indicate a major adjustment in India’s energy strategy..India Open To Expand Oil Purchases From US, But Needs The Right Price: Commerce Secy.Trump, who has pressed to limit Russia’s oil revenue, had imposed tariffs on Indian exports to the United States after trade talks had initially stalled. A 25% duty was introduced earlier this year, followed by another 25% increase that the administration linked to India’s continued crude purchases from Russia.India has long defended its right to purchase energy wherever it finds favorable terms, saying its decisions are driven by domestic demand rather than politics. Since the war began, New Delhi has balanced its historic ties with Moscow against growing strategic cooperation with Washington.“I think they were great... Modi is a great man,” Trump said. “He (Sergio Gor) told me that he (PM Modi) loves Trump... I have watched India for years. It’s an incredible country and every single year you would have a new leader... My friend has been there now for a long time and he’s assured me there will be no oil purchases from Russia,” Trump made his comments while discussing U.S. ambassador-designate Sergio Gor’s recent meeting with Modi.Trump said Modi could not halt the oil imports “immediately” but added that “the process is going to be over soon.”(With inputs from ANI.).Tariff Blues: India's Exports To US Fall For Second Month In Row","summary":"US President Donald Trump said on Wednesday that Prime Minister Narendra Modi had assured him India would stop purchasing oil from Russia, calling it a \"big step\" toward isolating Moscow...","url":"https://www.ndtvprofit.com/economy-finance/trump-claims-pm-modi-has-agreed-india-will-not-buy-russian-oil","image":"https://media.assettype.com/bloombergquint/2025-02-03/rleo8vfv/GbrpreaMAAK69.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-10-16 00:30:56","author":"Ndtv Profit Desk","authors":["Ndtv Profit Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.009},{"id":369628258,"title":"World News | PM Modi Assured Me India Will Not Be Buying Oil from Russia, Says Trump at Oval Office Briefing","text":"Washington [US], October 16 (ANI): US President Donald Trump on Wednesday (local time) said that Prime Minister Narendra Modi had assured him that India would stop purchasing oil from Russia, describing it as \"a big step\" in efforts to increase global pressure on Moscow.\nTrump made the remarks during a joint news conference with FBI Director Kash Patel at the Oval Office, where the two highlighted the administration's efforts to curb violent crime.\nAlso Read | India's Steady Export Growth in H1 FY26 Reflects Strong Resilience, Global Competitiveness, Says FIEO.\nResponding to ANI's question on whether he viewed India as a reliable partner, Trump said, \"Yeah, sure. He's (PM Narendra Modi) a friend of mine. We have a great relationship...I was not happy that India was buying oil. And he assured me today that they will not be buying oil from Russia. That's a big stop. Now we've got to get China to do the same thing...\"\nReaffirming his close relationship with the Indian leader, he added, \"He's a friend of mine. We have a great relationship. He just said that two days ago, as you know.\"\nAlso Read | US Tariffs Not a Matter of Huge Concern for India's Growth, Says RBI Governor Sanjay Malhotra at IMF-World Bank Event.\nTrump criticised India's previous oil imports from Russia, stating, \"We were not happy with him buying oil from Russia, because that lets Russia continue on with this ridiculous war, where they've lost a million and a half people, by the way. Russia has lost a million and a half people, soldiers mostly.\"\nIndia has long defended its oil imports from Moscow as essential for economic stability, even as Washington has continued to urge New Delhi to diversify its energy sources.\nCalling the ongoing conflict unnecessary, Trump said, \"This is a war that should have never started, but it's a war that Russia should have won in the first week, and they're going into the fourth year. And I want to see it stop. So I was not happy that India was buying oil.\"\nHe continued, \"And he assured me today that they will not be buying oil from Russia. That's a big stop. Now I got to get China to do the same thing.\"\nDrawing a comparison with his recent diplomatic efforts, Trump said, \"You know, that is relatively easy compared to what we just did over the last week in the Middle East. Middle East was 3,000 years, and we got it done. This is three years.\"\nExpressing optimism about resolving the Russia-Ukraine conflict, he added, \"And I think we'll get it done. I think that Putin, President Putin, I think he's going to, I think he wants to get it done. We'll see.\"\nCommenting on the tensions between Moscow and Kyiv, Trump said, \"There's a great animosity between him (Putin) and Zelensky, you probably have noticed. And it's, I think it's hurting the process. Yeah.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  US President Donald Trump on Wednesday (local time) said that Prime Minister Narendra Modi had assured him that India would stop purchasing oil from Russia, describing it as &quot;a big step&quot; in efforts to increase global pressure on Moscow.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-assured-me-india-will-not-be-buying-oil-from-russia-says-trump-at-oval-office-briefing-7161990.html","image":"https://st1.latestly.com/wp-content/uploads/2025/10/ANI-20251015211234.jpg","video":null,"publish_date":"2025-10-16 00:28:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.29},{"id":369627296,"title":"Israel prepares plan to resume assault in Gaza if ceasefire collapses","text":"Israeli Defense Minister Israel Katz warned on Wednesday that if Hamas does not demilitarize and return all bodies of hostages it holds, Israel will return to fighting, reported Xinhua.\n\n The threat came on the sixth day of a fragile ceasefire, as Hamas handed over the remains of two more hostages and said they were the last bodies in its custody.\n\n In a statement, Katz said: \"If Hamas refuses to comply with the agreement, Israel, in coordination with the United States, will return to fighting and act to achieve the absolute defeat of Hamas, alter the situation in Gaza and attain all the objectives of the war.\"\n\n In a meeting earlier on Wednesday with the chief of staff and senior military officers, Katz instructed the military to prepare \"a comprehensive plan to defeat Hamas\" should Israel decide to resume its campaign in Gaza. He said the plan was to be drafted should Hamas \"refuse to implement (U.S. President Donald) Trump's plan and fighting needs to be renewed.\"\n\n Katz added that, under Trump's plan, Hamas is required to return all bodies of deceased hostages in its custody and disarm. He said Israel, together with an international force led by the United States, \"would move to destroy all tunnels and terror infrastructure in Gaza to ensure the strip is demilitarized and poses no threat to the State of Israel.\"\n\n The ceasefire, brokered by the United States, Türkiye, Qatar and Egypt, went into effect on Friday after more than two years of Israeli bombardments that, according to reports, caused famine, left the enclave in ruins, and killed almost 70,000 people, with the United Nations, academic experts and international aid groups warning Israel may have committed genocide and other crimes against humanity.\n\nMeanwhile, Israel on Wednesday night received the bodies of two hostages handed over by Hamas through the International Committee of the Red Cross (ICRC) in Gaza, the Israeli prime minister's office said.\n\n The two coffins would be escorted into Israel for forensic identification in Tel Aviv, the office statement said.\n\n The handover came after Israel warned it could further restrict humanitarian aid to Gaza if Hamas failed to release all remaining 28 bodies of hostages.\n\n Israel said that forensic examination found one of the eight bodies handed over by Hamas on Monday and Tuesday was not that of an Israeli hostage.\n\n The return of the bodies and 20 surviving captives took place under a ceasefire and prisoner exchange deal in which Israel released about 2,000 Palestinian detainees and prisoners.\n\n Hamas' military wing, al-Qassam Brigades, said in a statement that the group \"has fulfilled its commitment to the agreement by handing over all living Israeli prisoners in its custody, as well as the corpses it could access.\" It said that to recover the remaining bodies would require \"extensive efforts and special equipment.\"","summary":"Israeli Defense Minister Israel Katz warned on Wednesday that if Hamas does not demilitarize and return all bodies of hostages it holds, Israel will return to fighting, reported Xinhua.\n\n The threat came on the sixth day of a fragile ceasefire, as Hamas handed over the remains of two more hostages and said they were the last bodies in its custody.\n\n In a statement, Katz said: \"If Hamas refuses to comply with the agreement, Israel, in coordination with the United States, will return to fighting and act to achieve the absolute defeat of Hamas, alter the situation in Gaza and attain all the objectives of the war.\"\n\n In a meeting earlier on Wednesday with the chief of staff and senior military officers, Katz instructed the military to prepare \"a comprehensive plan to defeat Hamas\" should Israel decide to resume its campaign in Gaza. He said the plan was to be drafted should Hamas \"refuse to implement (U.S. President Donald) Trump's plan and fighting needs to be renewed.\"\n\n Katz added that, under Trump's plan, Ham","url":"https://www.dailyfinland.fi/worldwide/45749/Israel-prepares-plan-to-resume-assault-in-Gaza-if-ceasefire-collapses","image":"https://www.dailyfinland.fi/assets/news_photos/2025/10/16/image-45749-1760571042.jpg","video":null,"publish_date":"2025-10-16 00:27:49","author":"Desh Tv News","authors":["Desh Tv News"],"language":"en","category":"politics","source_country":"fi","sentiment":-0.372},{"id":369626152,"title":"Trump says he is considering strikes on Venezuela, raising pressure on Maduro","text":"Washington: US President Donald Trump says he is considering striking land targets in Venezuela after blowing up a series of vessels in international waters, alleged to have been carrying drugs.\n\nAccording to the New York Times, the CIA has also been authorised to carry out covert operations in Venezuela under a classified Trump directive, marking a sharp escalation in Washington’s efforts to pressure President Nicolás Maduro’s government.\n\nAsked about the next steps in his “war” against Venezuelan drug cartels, Trump told reporters in Washington: “I don’t want to tell you exactly, but we are certainly looking at land now because we’ve got the sea very well under control. We’ve had a couple of days where there isn’t a boat to be found.\n\n“A lot of the Venezuelan drugs come in through the sea. So you get to see that, but we’re going to stop them by land also.”","summary":"After a series of US strikes on alleged drug consignments at sea, there are reports the CIA has been authorised to carry out covert operations inside Venezuela.","url":"https://www.brisbanetimes.com.au/world/south-america/trump-says-he-is-considering-strikes-on-venezuela-raising-pressure-on-maduro-20251016-p5n2y9.html","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/864f29a6ddef8627e3845218d7e080749d15bfa4","video":null,"publish_date":"2025-10-16 00:25:52","author":"Michael Koziol,Nandita Bose","authors":["Michael Koziol","Nandita Bose"],"language":"en","category":"politics","source_country":"au","sentiment":-0.15},{"id":369624902,"title":"Bryson DeChambeau poses with $156M-worth NBA star as he releases a new episode of Break 50","text":"Bryson DeChambeau recently teamed up with NBA superstar Stephen Curry for the latest episode of his YouTube series, Break 50. The LIV golfer shared a carousel of photos with Curry on Instagram, giving fans a peek at their meeting.The video comes shortly after Stephen Curry helped the Golden State Warriors secure a 118-111 preseason win over the Portland Trail Blazers, scoring 28 points along with six rebounds and five assists. Bryson called the episode his favorite yet, writing on Instagram,“What a day! New episode of Break 50 is live on my YouTube channel. This is my favorite one yet.” View this post on Instagram Instagram PostStephen Curry, a four-time NBA champion with an estimated net worth of $156 million, has been an avid golfer since he was 10. The nine-time NBA All-Star regularly participates in pro-am events and also serves as the CEO of Underrated Golf, an organization that creates golf resources for underserved communities.While this marks his first direct collaboration with DeChambeau, the two have followed each other’s careers. Back in 2022, when Curry’s Golden State Warriors defeated the New York Knicks, Bryson DeChambeau took to X to congratulate him, writing,Congratulations @StephenCurry30 on an amazing achievement tonight! A true legend in his craft.Bryson DeChambeau @brysondechLINKCongratulations @StephenCurry30 on an amazing achievement tonight! A true legend in his craft.DeChambeau, meanwhile, continues to grow his presence both on and off the course. One of the top golfers in the world, he boasts a loyal fanbase and over 2.47 million subscribers on YouTube.Bryson DeChambeau recently collaborated with MrBeastBryson DeChambeau joined YouTube star MrBeast for his latest video, “100 Kids vs World’s Strongest Man!”, taking part in a series of fun and quirky challenges alongside professional athletes and amateurs.One standout moment saw Bryson DeChambeau face off against an amateur named Johnny in a golf-based challenge. The goal was to hit a Tesla parked in the middle of a lake. Johnny received three shots for every one of DeChambeau’s attempts. Despite both coming close, neither managed to hit the car. Eventually, Chandler from MrBeast’s crew succeeded.The video also featured retired strongman Brian Shaw, long jumper Darius Clark, and sprinter Melissa Jefferson, all competing for a chance to win $100,000. Those who didn’t win could donate their prize money to a charity of their choice, keeping the competitive spirit fun and charitable.DeChambeau has become no stranger to high-profile collaborations. He’s previously teamed up with US President Donald Trump, actor Adam Sandler, and golfer Tom Bardy. His video with Trump still stands as his most-viewed video with 16 million views on his channel.","summary":"Bryson DeChambeau recently teamed up with NBA superstar Stephen Curry for the latest episode of his YouTube series, Break 50.","url":"https://www.sportskeeda.com/golf/news-bryson-dechambeau-poses-156m-worth-nba-star-releases-new-episode-break-50","image":"https://staticg.sportskeeda.com/editor/2025/10/27194327-1760571900.jpeg","video":null,"publish_date":"2025-10-16 00:23:47","author":"Sonali Verma","authors":["Sonali Verma"],"language":"en","source_country":"in","sentiment":0.415},{"id":369625250,"title":"Chicago Community Leaders and Governor JB Pritzker Allege Possible Violation of Tear Gas Ban by Federal Agents on East Side","text":"On Chicago’s Far South Side, tensions flared as community leaders and politicians voiced their concerns about actions taken by U.S. Immigration and Customs Enforcement. The events of Tuesday, which saw the use of chemical agents and led to several arrests, have sparked significant backlash.\n\nRepresentatives from various organizations, including the 10th Ward Rapid Response, Alliance of the Southeast, and the Chicago Teachers Union, gathered for a press conference at the United Workers’ Center. They criticized the Department of Homeland Security’s handling of the situation.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nThe controversy began on Tuesday when federal agents resorted to using tear gas to disperse protestors near the intersection of 105th Street and Avenue N. The protestors had assembled in opposition to recent federal actions.\n\nAccording to the Department of Homeland Security, some individuals in the crowd threw eggs at the agents, escalating the tense situation.\n\nThe incident further escalated with a car chase, culminating in a collision involving Border Patrol agents and another vehicle. Authorities claim the driver involved in the chase was residing in the U.S. illegally.\n\nRELATED: Agents tackle US citizen after East Side operation leads to crash, spills into Walgreens: VIDEO\n\nOfficials from DHS reported that the driver had intentionally rammed into a DHS vehicle during the pursuit.\n\nFederal officials said Luis Gerardo Pirela-Ramirez was driving and was arrested for assault on a federal agent. Yonder Enrique Tenefe-Perez was arrested as an accessory, DHS said.\n\nThe out-of-control situation also led to the arrest of a 15-year-old boy, who says he was tackled and arrested by agents, even though he says he is an American citizen. He was later released.\n\nAttorneys say he was effectively “disappeared” for five hours.\n\n“We do not welcome ICE in the Southeast Side of Chicago, the south suburbs of Chicago, the entire city of Chicago, as we will continue to organize and advocate for those who are affected, as we see not only, but also people of color are being racially profiled by unjust actions,” said Ana Guajardo of United Workers’ Center.\n\n“The Trump administration continues to lie and claims only to be targeting criminals. But we have seen hardworking people, landscapers, construction workers and street vendors specifically targeted,” said Moises Moreno of 10th Ward Rapid Response. “Our community is a united community bound by a longstanding tradition of resistance and cultural vibrancy.”\n\nGov. JB Pritzker pushed back on the federal immigration crackdown in Chicago, saying ICE is “creating mayhem.”\n\nPritzker believes ICE may have violated the temporary restraining order that was issued last week, which prohibits the use of chemical agents on demonstrators.\n\nThe governor is now also troubled by how long DHS plans to be in the Chicago area.\n\nPritzker was in Minooka Wednesday for an announcement on electric trains, and he called on ICE to back off.\n\n“They’re the ones who are tossing tear gas when people are peacefully protesting. ICE is the one who’s going into neighborhoods where they, frankly, are causing fear among people who live in those neighborhoods, work in those neighborhoods,” he said.\n\nA judge last week granted a TRO banning the use of riot control munitions like tear gas and pepper bullets, which were used against demonstrators and journalists at the Broadview ICE facility.\n\n“And so I know that we’re, you know, everybody’s looking into that question, and no doubt the private attorneys that have brought that case might be going back into court in order to make sure that those rules are enforced upon ICE,” Pritzker said.\n\nThey did previously defend their use of tear gas Tuesday, writing in part, “This incident is not isolated and reflects a growing and dangerous trend of illegal aliens violently resisting arrest and agitators and criminals ramming cars into our law enforcement officers.”\n\nDHS says two people, who they allege are living in the U.S. without legal permission, were arrested on Tuesday.\n\nA DHS spokesperson said claims that Customs and Border Protection kidnapped a U.S. citizen are false, saying, “Here are the facts: immediately following illegal aliens ramming law enforcement with their vehicle, which resulted in the arrest of two illegal aliens from Venezuela, a violent mob began surround law enforcement. Among them, a U.S. citizen teenager threw eggs and hit a CBP Officer in the head. Agents observed him gathering rocks after objects had already been thrown at law enforcement officers. The individual was arrested for the assault and taken to the FBI Field Office in Chicago where he freely admitted without questioning to throwing eggs at agents. His attorney met with him at the field office, and he was released without charges.\n\n“Our officers are facing a surge in assaults against them-without pay during the Democrats’ shutdown-as they put their lives on the line to arrest murderers, rapists, and gang members. Secretary Noem’s message to the rioters is clear: you will not stop us or slow us down. CBP and our federal law enforcement partners will continue to enforce the law. And if you lay a hand on a law enforcement officer, you will be prosecuted to the fullest extent of the law.”\n\nSome residents Wednesday were fearful to leave their homes.\n\n“He saw a man with a big rifle right in front of his house. He immediately went back inside because he said, ‘What are we under attack? Is this a war? What’s happening?’” said Maricela Estrada, with United Workers’ Center.\n\nEstrada and the United Workers’ Center were canvassing the neighborhood Wednesday, in an effort to check on those who live there, make sure they understand they have rights and how to respond when ICE and Border Patrol enter their neighborhood.\n\n“It is very important that we stay calm, that we not, do not engage with them, or do we not get provoked by, you know, their tactics,” Estrada said. “We all seek the same thing that everybody in this country has come here, you know, looking for freedom. Better opportunities to be able to, you know, sustain your family, to be able to work and live freely and be free of violence.”\n\n“It doesn’t hit you like a reality kind of thing, you know? Like, that’s really them. It’s happening here, like in your neighborhood,” one resident said.\n\nThe young man preferred to stay anonymous. He said he was home Tuesday. But unlike many of his neighbors who flocked to the scene, he stayed inside, fearing for his safety.\n\n“When they threw the tear gas, or the smoke or whatever they threw, it was so much that they made it down this way. And I had cops right here just choking,” the resident said. “It feels like they’re just, really going after anybody that looks brown, or just interferes, you know. It just feels like they’re just really after us.”\n\nAlso in Springfield Wednesday, leading Democrats were praising the move by Cook County to ban ICE from enforcing civil warrants at courthouses. It’s something that could be expanded statewide during the veto session.\n\n“Because what’s happening with these masked ICE agents in courthouses and territories around courthouses is unacceptable. People are afraid to go to court. They’re afraid to comply with subpoenas. We can’t allow that,” House Speaker state Rep. Emanuel “Chris” Welch said.\n\nAnd while the use of the National Guard remains on hold pending another court TRO, a source has confirmed that DHS has informed Naval Station Great Lakes that it will be extending its use of the base for immigration enforcement through the end of the year.\n\n“All I can say is that we’ve got to bring an end to this. The federal government and Donald Trump need to recognize that this is not the way that you do immigration enforcement,” Pritzker said.\n\nThe Trump administration has repeatedly insisted it is targeting the so-called worst as part of Operation Midway Blitz. But that has not always been the case.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOn Chicago&#8217;s Far South Side, tensions flared as community leaders and politicians&#8230;\n\n\nThis Post: Chicago Community Leaders and Governor JB Pritzker Allege Possible Violation of Tear Gas Ban by Federal Agents on East Side first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/chicago-community-leaders-and-governor-jb-pritzker-allege-possible-violation-of-tear-gas-ban-by-federal-agents-on-east-side/","image":"https://internewscast.com/wp-content/uploads/2025/10/Chicago-community-leaders-Gov-JB-Pritzker-say-federal-agents-could.jpg","video":null,"publish_date":"2025-10-16 00:20:09","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.362},{"id":369626122,"title":"Woke university 'compares Margaret Thatcher to HITLER and calls Trump a terrorist leader'","text":"Students were reportedly told that former Prime Minister Margaret Thatcher shared a similar leadership style to Adolf Hitler during a lecture at Leicester University.\n\nThe claims were allegedly made in a business management class on Monday, where slides also described Donald Trump as a 'terrorist leader' type of business chief, The Sun reports.\n\nAccording to the lecture material, the 'Iron Lady' was compared to both the Nazi dictator and Russian President Vladimir Putin for having 'dictated policies and procedures' while demanding obedience from others.\n\nMr Trump, meanwhile, was reportedly grouped with figures such as Osama Bin Laden - the mastermind behind the 9/11 attacks - and Elliot Rodger, the London-born killer who murdered six people before taking his own life in California in 2014.\n\nOne student said: 'No one understands why they are going out of their way to make these comparisons.'\n\nLeicester University later defended the lecture, saying it was intended to explore 'how theoretical frameworks relate to a range of well-known people.'\n\nResponding to the lecture, former Conservative Education Secretary Sir Gavin Williamson told GB News: 'It is completely out of order and a shocking comparison.\n\n'Margaret Thatcher has been one of our greatest leaders and it is shocking that this lecturer has said this and should immediately withdraw the remarks and apologise.'\n\nThis isn't the only time universities have face controversy over so-called 'woke' decisions recently.\n\nEarlier this year a university told students not to use colloquial phrases such as 'kill two birds with one stone' or 'a piece of cake' because they are 'very British-English' and won't be understood by other cultures.\n\nUndergraduates at Cardiff University were also warned to avoid using the word 'crazy' as it is a 'derogatory' term for mental health, as well as 'sexist' idioms such as 'man up' or 'like a girl'.\n\nThe guidance was issued in an EDI (Equality, Diversity and Inclusion) awareness module, which is mandatory for all first year students.\n\nStudents are asked a series of questions on how privileged they are which is then converted into a 'privilege rating'.\n\nThey are further told that it is a 'micro aggression' – defined as statements that reveal bias or stereotyping – to make comments such as 'everyone can succeed if you just work hard enough'.\n\nFree speech campaigners criticised the university for attempting to 'police' everyday language.\n\nThe controversy over the course comes amid a growing backlash at EDI programmes, with a rising number of companies and institutions jettisoning them.\n\nPresentation slides from the Cardiff EDI module, shared with The Mail on Sunday, reveal that one of the key areas students are tutored on is the use of 'inclusive language'.","summary":"The claims were allegedly made in a business management class on Monday, where slides also described Donald Trump as a 'terrorist leader' type of business chief, The Sun reports.","url":"https://www.dailymail.co.uk/news/article-15196615/Woke-university-compares-Margaret-Thatcher-HITLER-calls-Trump-terrorist-leader.html","image":"https://i.dailymail.co.uk/1s/2025/10/16/00/103025633-0-image-m-55_1760571484714.jpg","video":null,"publish_date":"2025-10-16 00:14:57","author":"Editor,Olivia Allhusen","authors":["Editor","Olivia Allhusen"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.136},{"id":369628338,"title":"Hamas says all reachable hostage bodies recovered amid Israel threat to resume Gaza fighting","text":"Hamas has announced that the remains of all the deceased Israeli hostages that it can reach have been handed back and it would need specialist recovery equipment to retrieve the rest from Gaza’s ruins, amid threats from Israel to resume fighting if the terms of ceasefire are not honoured.\n\nTwo further bodies were handed over late on Wednesday, after Hamas had already returned the remains of seven of 28 known deceased hostages – along with an eighth body which Israel said was not that of a former hostage.\n\nSoon after, the Ezzedine Al-Qassam Brigades said in a statement on social media that the group had “fulfilled its commitment to the agreement by handing over all living Israeli prisoners in its custody, as well as the corpses it could access … as for the remaining corpses, it requires extensive efforts and special equipment for their retrieval and extraction.”\n\nSince Monday, under a ceasefire agreement brokered by US president Donald Trump, Hamas has handed back 20 surviving hostages to Israel in exchange for nearly 2,000 Palestinian prisoners freed from Israeli jails.\n\nIsrael’s defence minister threatened on Wednesday to resume fighting if Hamas does not honour the continuing terms of the deal.\n\n“If Hamas refuses to comply with the agreement, Israel, in coordination with the United States, will resume fighting and act to achieve a total defeat of Hamas, to change the reality in Gaza and achieve all the objectives of the war,” a statement from Israel Katz’s office said.\n\nSeeking to keep the pressure on Hamas, Trump said he would consider allowing Israeli forces to resume fighting in Gaza if Hamas fails to uphold its end of the ceasefire deal that he brokered.\n\n“Israel will return to those streets as soon as I say the word. If Israel could go in and knock the crap of them, they’d do that,” Trump was quoted as saying to CNN in a brief telephone call when asked what would happen if Hamas refused to disarm.\n\nAfter the threat from Katz, senior US advisers briefed the media late on Wednesday that Hamas was aiming to stick to its pledge to return the bodies of dead hostages.\n\nRetrieving the bodies from Gaza was difficult because it had been “pulverised,” the advisers said, adding “here was a lot of disappointment and outrage when only four bodies were returned, and they could have just said, you know, we’re moving on … But they returned bodies the next day and then the next day, as quickly as we give them intelligence.”\n\nThe US and other mediators were looking at a program of rewards for people helping locate the bodies of dead hostages, he said. Turkey, one of the key mediators in the deal, was meanwhile in talks to provide experts on body retrieval to send to Gaza, the adviser added.\n\nAid trucks rolled into Gaza on Wednesday and preparations resumed to open the main Rafah crossing on Thursday, but Israel has warned it could keep the crossing shut and reduce aid supplies if Hamas returned bodies too slowly.\n\nUnderscoring the political challenges facing Israeli prime minister Benjamin Netanyahu, far-right national security minister Itamar Ben-Gvir, an opponent of the ceasefire plan, said on X that the aid delivery was a “disgrace” and accused Hamas of lies over the return of hostages’ bodies.\n\nAid agencies and the United Nations are calling for Israel to open more crossings to allow “thousands of trucks” to enter the devastated territory every day.\n\nTom Fletcher, the UN’s most senior relief coordinator, called on Israel to facilitate the “massive surge of humanitarian aid – on which so many lives depend, and on which the world has insisted”.\n\n“We need more crossings open and a genuine, practical, problem-solving approach to removing remaining obstacles. Throughout this crisis, we have insisted that withholding aid from civilians is not a bargaining chip. Facilitation of aid is a legal obligation,” Fletcher said.\n\nAid agencies say thousands of tonnes of aid, including food and medical supplies, has been loaded on to trucks waiting in Egypt or stockpiled elsewhere in the region. It is the only border point that connects Gaza to the world without passing through Israel.\n\nIsrael has repeatedly blocked aid from entering Gaza during the conflict, prompting accusations it has used starvation as a weapon of war. A famine was declared in parts of the territory in August.\n\nHumanitarian officials in Gaza City said on Wednesday assistance was desperately needed, with hundreds of thousands of people without clean water, food and other essentials and many more suffering greatly.\n\nThe deal also requires Israel to return the bodies of 360 Palestinians. Many of the 90 bodies returned by Israeli authorities so far showed signs of torture and execution, including blindfolds, cuffed hands and bullet wounds in the head, according to doctors’ accounts.\n\n“Almost all of them had been blindfolded, and had been bound up and they had gunshots between the eyes. Almost all of them had been executed,” said Dr Ahmed al-Farra, the head of the Nasser hospital’s paediatric department in Khan Younis.\n\nThe dispute over the return of bodies still has the potential to upset the ceasefire deal along with other major issues that are yet to be resolved.\n\nIsrael has said that the next phase of the truce calls for Hamas to disarm and cede power, which it has so far refused to do. It has launched a security crackdown, parading its power in Gaza through public executions and clashes with local clans.\n\nWith Agence France-Presse and Reuters","summary":"Israel’s defence minister has said the country could resume fighting if Hamas does not honour the terms of the ceasefire deal\n\n\nPalestinian leader Marwan Barghouti assaulted by Israeli prison guards, son says\n\nHamas has announced that the remains of all the deceased Israeli hostages that it can reach have been handed back and it would need specialist recovery equipment to retrieve the rest from Gaza’s ruins, amid threats from Israel to resume fighting if the terms of ceasefire are not honoured.\n\nTwo further bodies were handed over late on Wednesday, after Hamas had already returned the remains of seven of 28 known deceased hostages – along with an eighth body which Israel said was not that of a former hostage.\n\n Continue reading...","url":"https://www.theguardian.com/world/2025/oct/16/hamas-hostage-bodies-recovered-amid-israel-gaza-fighting-ceasefire-deal","image":"https://i.guim.co.uk/img/media/3012b8b3ecdf0b3e227969d40686122518773f7b/1322_0_6827_5464/master/6827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64","video":null,"publish_date":"2025-10-16 00:14:20","author":"Guardian staff and agencies","authors":["Guardian staff and agencies"],"language":"en","category":"politics","source_country":"us","sentiment":-0.499},{"id":369626126,"title":"ROBERT TOMBS: Trump isn't just the U.S. President. He now bestrides the Western world like no leader since Napoleon. But that didn't end well...","text":"Donald Trump accepted the homage of other world leaders this week – less like a US president than an emperor.\n\nBy imposing peace on Gaza and Israel through a combination of brute force and political charisma, he has achieved what no other head of state could do.\n\nAs he acknowledged the fawning praises of each one in turn, it became obvious that he no longer sees himself only as the POTUS, President of the United States.\n\nIn his own mind, and to a large extent in reality, he bestrides the planet like a colossus, the King of the Western World.\n\nIt was an extraordinary spectacle – coming only two months after European leaders were similarly summoned to the White House to be told of Trump’s recent summit with Vladimir Putin – but amid the euphoria we should be wary. History teaches that peace never lasts under the rule of an egomaniac.\n\nPrime Minister Keir Starmer must have supposed he was attending the Gaza summit in Sharm el-Sheikh, Egypt, on Monday as an equal – sharing the glory not only with the likes of French president Emmanuel Macron and Italian PM Giorgia Meloni, but with Trump himself.\n\nThe Donald didn’t see it that way. Waved forward to the rostrum, Starmer appeared to think he was being invited to speak – but instead the US president turned his back, leaving Sir Keir floundering, to the undisguised amusement of Pakistani PM Shehbaz Sharif beside him.\n\nTrump’s humiliating dismissal of Starmer brought to mind a painting of the last man who could truly claim to be an all-powerful emperor in the West, the French dictator Napoleon Bonaparte.\n\nHis coronation in 1804 is depicted by Jacques-Louis David, who paints the Bonaparte in front of the altar in Notre Dame cathedral, surrounded by sycophantic dignitaries. Among them was Pope Pius VII, who journeyed to Paris for the ceremony. This was irregular – even Charlemagne, the great medieval emperor, had gone to Rome to receive his blessing.\n\nBut at first, the Holy Father felt flattered by his treatment. His room in the Palace of the Tuileries was decorated to look exactly like his own papal quarters in the Roman Quirinal.\n\nThen Pius discovered that, despite everything he had assumed, he would not be crowning Napoleon himself. He was simply there to applaud, as the 35-year-old absolute ruler placed the crown on his own head... demonstrating that no one else had authority over him.\n\nWhen the Pope learned that Napoleon had composed an imperial oath, vowing to uphold freedom for all religions (and not just Catholicism), he began to wish he’d never agreed to come. The final humiliation for him was the discovery that Napoleon and his empress, Josephine, were not even married in the eyes of the church. Their wedding eight years earlier had been a civil one.\n\nDonald Trump’s autocratic and frequently unpredictable behaviour often parallels that of Napoleon. Trump, like Bonaparte, sees himself as without equal.\n\nBonaparte, like Trump, was fond of sacking people without warning and often in humiliating fashion and then replacing them with allies. Making no secret of his contempt for the Spanish royal family, he summoned them in 1808 and deposed them.\n\nHis army occupied swathes of Spain so King Charles IV and his son, King Ferdinand VII had no choice in the abdication. They were replaced by Napoleon’s older brother, Joseph. He was already King of Naples but was succeeded by his wife’s brother, who happened to be Napoleon’s ex aide-de-camp.\n\nThese puppet monarchs had one quality. The emperor could count on their loyalty.\n\nTrump operates on a similar basis. His son Donald Jr played a leading role in successive election campaigns. Junior’s ex-fiance Kimberly Guilfoyle is the US ambassador to Greece. Daughter Ivanka was an adviser during Trump’s first administration, as was her husband Jared Kushner.\n\nKushner’s father Charles is US ambassador to France and Monaco, after he was pardoned by Trump in 2020 for tax fraud.\n\nTrump’s diplomatic techniques often mirror those of Napoleon, whose temper was notoriously short. The Oval Office savaging of Ukrainian president Volodymyr Zelensky in March, was not unlike the French ruler’s treatment of British ambassador Charles Whitworth.\n\nArriving in Paris in November 1803, Lord Whitworth made the mistake of not heaping sufficient flattery on Napoleon. When they met to discuss if England would hand Malta and Alexandria over to the French, the ambassador was staggered by the ferocity of the dictator’s language.\n\nOne phrase Napoleon used to indicate his contempt for Switzerland was so obscene that Whitworth could not bring himself to write it down. It was ‘too trivial and vulgar to find a place in a dispatch, or anywhere but in the mouth of a hackney coachman’ – that is, a cab driver.\n\nEurope had never seen a force like Napoleon. It took a decade of war, from the British victory at Trafalgar, through the exhausting Spanish and Russian campaigns, to the final rout at Waterloo, to dethrone him.\n\nBut the world has never seen a US president like Donald Trump either. The great difference between him and Napoleon is that, whereas the French emperor could not rule without waging constant war, Trump’s priority is the business deal.\n\nHe casts himself as a dealmaker, treating the world as real estate to be carved into profitable parcels. The evidence of the past week is that this can be an effective path to peace, at least in the short term.\n\nWhat destroyed Napoleon, ultimately, was his own hubris, his conviction that everything he did was bound to succeed. And that towering self-regard could be Trump’s greatest weakness, too.\n\nIf any of the previous American presidents can be compared to him, it is Woodrow Wilson. A Democrat and an idealist, Wilson achieved what Trump longs to have – the Nobel Prize for Peace.\n\nWhen Wilson, who was US president during World War I, set out his own 14 points – the ground rules for post-war peace – the French PM remarked that God himself only issued ten.\n\nHe also helped establish the League of Nations, the forerunner of the United Nations.\n\nHe was acclaimed after 1918 as the saviour of the world by everyone from Arab warriors to students in Peking. Italian soldiers knelt in his honour.\n\nBut Wilson’s peace was short-lived. The US lost interest in peace-keeping and the world saw the collapse of the global economy, the rise of the Nazis, and ultimately World War II.\n\nThe world breathed a sigh of relief this week as Trump announced an end to the war in Gaza. But history shows peace requires patience, commitment and determination. And time will tell if Trump has those crucial qualities. \n\nProfessor Robert Tombs is the author of The English And Their History.","summary":"Donald Trump accepted the homage of other world leaders this week -less like a US president than an emperor.","url":"https://www.dailymail.co.uk/debate/article-15196247/Trump-bestrides-Western-world-like-Napoleon.html","image":"https://i.dailymail.co.uk/1s/2025/10/15/21/103022125-0-image-a-48_1760560048797.jpg","video":null,"publish_date":"2025-10-16 00:08:37","author":"Editor,Robert Tombs","authors":["Editor","Robert Tombs"],"language":"en","category":"politics","source_country":"gb","sentiment":0.089},{"id":369628272,"title":"World News | Trump is a 'go' on Meeting with China's Xi, Says US Treasury Secretary Bessent","text":"Washington [US], October 16 (ANI): US Treasury Secretary Scott Bessent on Wednesday expressed confidence about progress in trade discussions with China, even as tensions between the two sides deepened over Beijing's restrictions on rare earth exports.\nBessent, speaking at an event hosted by CNBC, confirmed that US President Donald Trump still planned to meet Chinese President Xi Jinping \"in the near future,\" with the meeting expected to take place at the upcoming Asia-Pacific Economic Cooperation (APEC) summit later this month.\nAlso Read | India's Steady Export Growth in H1 FY26 Reflects Strong Resilience, Global Competitiveness, Says FIEO.\nDespite recent strains in bilateral relations, Bessent maintained that \"President Trump is a 'go' on that,\" emphasising to CNBC that both leaders share \"an excellent relationship.\"\nEarlier in the event, Bessent said he was \"optimistic\" about the ongoing talks with Beijing, noting that \"we are now communicating at a very high level\" and that \"there have been many outreaches.\"\nAlso Read | US Tariffs Not a Matter of Huge Concern for India's Growth, Says RBI Governor Sanjay Malhotra at IMF-World Bank Event.\nHe added that both sides were also holding working-level discussions on the sidelines of the International Monetary Fund (IMF) and World Bank annual meetings.\nBessent's remarks came against the backdrop of renewed trade friction. Last week, Trump had threatened to cancel the meeting with Xi after China announced new export controls on rare earth materials and technologies vital to US industries.\nThe move, widely seen as a countermeasure, prompted the White House to escalate its trade stance further.\nTrump later unveiled a sweeping new tariff package, announcing an additional 100% duty on Chinese imports, bringing the total tariff burden on goods from China to 130%.\nIn a post on Truth Social, he said, \"In response to China's export control on rare earths and related items, the United States will impose a tariff of 100 per cent on China, over and above any tariff that they are currently paying.\"\nHe also revealed that the US would implement \"export controls on all critical software\" starting November 1, accusing Beijing of adopting an \"unprecedented and hostile\" position in trade relations.\nIn response, a spokesperson from China's Ministry of Commerce warned that \"willful threats of high tariffs are not the right way to get along with China,\" asserting that while Beijing does not seek a trade war, it is \"not afraid of it either.\"\nThe ministry urged Washington to \"correct its wrong practices\" and resolve differences through dialogue.\n\"Properly manage differences through dialogues and on the basis of mutual respect and equal-footed consultation, so as to ensure the stable, sound and sustainable development of the China-US economic and trade relationship,\" the ministry said.\nDefending its recent actions, China described the October 9 export controls as \"normal actions taken by the Chinese government in accordance with laws and regulations to refine its export control system.\"\nThe ministry added, \"As a responsible major country, China firmly safeguards national and international security and implements export control measures in a prudential and moderate manner,\" according to Global Times.\nBeijing also accused Washington of hypocrisy, stating that \"the US remarks reflect typical double standards.\"\nIt said the United States had \"overstretched the concept of national security, abused export control, and imposed unilateral long-arm jurisdiction measures\" on thousands of Chinese entities.\nSince the China-US trade talks in Madrid in September, the ministry added, Washington had introduced \"a string of new restrictive measures\" targeting Chinese industries.\n\"In just 20 days, the US has added multiple Chinese firms to the Entity List, expanded control over affiliates, and persisted with Section 301 measures on China's maritime and shipbuilding sectors,\" the statement read.\nConcluding its response, Beijing said that these actions \"have severely harmed China's interests and undermined the atmosphere of bilateral economic and trade talks,\" reiterating that it \"is resolutely opposed to them.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  US Treasury Secretary Scott Bessent said he was &quot;optimistic&quot; about trade talks with China and confirmed that &quot;President Trump is a 'go' on that&quot; meeting with Xi Jinping at the APEC summit, despite rising tensions over Beijing's rare earth export restrictions.","url":"https://www.latestly.com/agency-news/world-news-trump-is-a-go-on-meeting-with-chinas-xi-says-us-treasury-secretary-bessent-7161970.html","image":"https://st1.latestly.com/wp-content/uploads/2025/10/ANI-20251015182844.jpg","video":null,"publish_date":"2025-10-16 00:08:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.194},{"id":369628458,"title":"\"Great Man\": Trump Praises PM Modi's Meeting With US Envoy Sergio Gor","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-praises-pm-modis-meeting-with-us-envoy-sergio-gor-9463790\" on this server.\nReference #18.1d011002.1760576499.2021ecf8\nhttps://errors.edgesuite.net/18.1d011002.1760576499.2021ecf8","summary":"Lauding Prime Minister Narendra Modi as a \"great man,\" US President Donald Trump praised the outcome of the recent meeting between US Ambassador-designate Sergio Gor and the Indian leader.","url":"https://www.ndtv.com/world-news/donald-trump-praises-pm-modis-meeting-with-us-envoy-sergio-gor-9463790","image":null,"video":null,"publish_date":"2025-10-16 00:08:17","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":369623580,"title":"Trump authorises CIA operations in Venezuela, raising pressure on Maduro","text":"WASHINGTON: US President Donald Trump confirmed on Wednesday (Oct 15) that he authorised the CIA to conduct covert operations in Venezuela, marking a sharp escalation in US efforts to pressure President Nicolas Maduro's government.\n\nThe New York Times first reported the classified directive, citing US officials familiar with the decision, saying the Trump administration's Venezuela strategy aims to remove Maduro from power. The administration has offered US$50 million for information leading to Maduro's arrest and conviction on drug trafficking charges.\n\nTrump said he authorised the action because large amounts of drugs were entering the United States from Venezuela, much of it trafficked by sea.\n\n\"We are looking at land now, because we've got the sea very well under control,\" Trump said.\n\nTRUMP: VENEZUELA \"FEELING HEAT\"\n\nHe has repeatedly accused Venezuela of being a hub for trafficking of the deadly drug fentanyl, but US records have shown that Mexico is the main source of fentanyl.\n\nTrump was asked by a reporter why he did not have the Coast Guard stop suspected drug trafficking boats, which has been US practice for decades. Trump called such efforts \"politically correct\" and said they had not worked.\n\nTrump declined to answer when asked if the CIA has the authority to execute Maduro, saying, \"I think Venezuela is feeling heat.\"\n\nTrump has ordered a large US military buildup in the southern Caribbean, and the troops have conducted at least five strikes on vessels the Trump administration has described as involved in drug trafficking, without providing evidence.","summary":"","url":"https://www.channelnewsasia.com/world/trump-authorises-cia-operations-in-venezuela-raising-pressure-maduro-5405066","image":"https://dam.mediacorp.sg/image/upload/s--jmqKNQ11--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-10-15T211018Z_2_LYNXNPEL9E11T_RTROPTP_3_USA-TRUMP.JPG?itok=4fLnT4Gr","video":null,"publish_date":"2025-10-16 00:04:24","author":null,"language":"en","category":"politics","source_country":"SG","sentiment":-0.121},{"id":369625912,"title":"Trump declares US-China trade war, Bessent floats long truce","text":"By Daniel Flatley and Jennifer A. Dlouhy, Bloomberg News\n\nWASHINGTON — President Donald Trump said he saw the U.S. as locked in a trade war with China, even as Treasury Secretary Scott Bessent proposed a longer pause on high tariffs on Chinese goods to resolve a conflict over critical minerals.\n\n“Well, you’re in one now,” Trump said Wednesday when asked by a reporter if the world’s two largest economies are in for a sustained trade war if they cannot reach a trade deal. “We have a 100% tariff. If we didn’t have tariffs, we would be exposed as being a nothing.”\n\nTrump spoke just hours after Bessent dangled the possibility of extending a pause of import duties on Chinese goods for longer than three months if China halts its plan for strict new export controls on rare-earth elements. The U.S. and China have agreed to a series of 90-day truces since earlier this year, with the next deadline looming in November.\n\n“Is it possible that we could go to a longer roll in return? Perhaps. But all that’s going to be negotiated in the coming weeks,” Bessent said during a press conference in Washington.\n\nThe dueling remarks underscored the whiplash investors have felt as tensions have flared in the relationship between Washington and Beijing. U.S. equities extended gains after Bessent’s comments, while Trump’s remarks came after trading closed in New York.\n\nU.S. Trade Representative Jamieson Greer cast doubt that Beijing would go ahead with the plan, which he said would choke off trade in a wide variety of consumer products that contain even a trace of rare earths.\n\n“The scope and the scale is just unimaginable, and it cannot be implemented,” Greer said.\n\nIn the meantime, Bessent predicted a coordinated response to China’s move from the U.S. and several allies.\n\n“We’re going to have a fulsome, group response to this, because bureaucrats in China cannot manage the supply chain or the manufacturing process for the rest of the world,” Bessent said earlier Wednesday at a CNBC-hosted forum in Washington.\n\nCoordinated response\n\nPointing out that “all my counterparts” are in Washington for the annual gathering of the International Monetary Fund and World Bank this week, he said, “We’re going to be speaking with our European allies, with Australia, with Canada, with India and the Asian democracies.”\n\nAn escalating tit-for-tat between Washington and Beijing has renewed investors’ fears that world’s two largest economies could soon be locked in a full-blown trade war.\n\nChina’s new rules, announced last week, require overseas firms to obtain Chinese government approval before exporting products containing even trace amounts of certain rare earths that originated in China.\n\nTrump responded by threatening to impose an additional 100% tariff on Chinese goods by Nov. 1. He floated the idea of scrapping a planned meeting with President Xi Jinping and warned the U.S. could cut off trade in cooking oil, a key input in biofuels.\n\nThe Treasury chief said that as far as he’s aware, Trump “is a go” on meeting Xi later this month in South Korea. Bessent said there’s a “very good chance” that he travels to Asia before Trump and meets with his Chinese counterpart, Vice Premier He Lifeng.\n\nBessent said he expected trade announcements to be made during Trump’s Asia tour. The president is expected to attend a summit with Association of Southeast Asian Nations in Malaysia before going on to Japan and South Korea, which will be hosting the annual Asia-Pacific Economic Cooperation leaders meeting.\n\nThe U.S. is “about to finish up” negotiations with South Korea, Bessent added. Those talks have lately revolved around the contours of a giant investment program. U.S.-Canada talks are “back on track,” Bessent also said. He also indicated progress with India.\n\nBessent dismissed the notion that a slide in the stock market would force the Trump administration into a negotiating position with Beijing, saying that what spurs such talks is instead the economic interest of the nation. The U.S. won’t negotiate with China “because the stock market is going down,” he said.\n\nHe also rejected the idea that the rising price of gold reflects some fundamental concern with regard to the dollar. He flagged that U.S. interest rates have come down relative to other economies, and said with regard to the euro that it “should be strong,” given how currency theory would suggest exchange-rate appreciation when fiscal expansion is underway.\n\n‘Unhinged’ official\n\nBessent also on Wednesday singled out a Chinese vice Commerce minister, Li Chenggang, for particular criticism, referencing comments he made during an August visit to Washington. He said Li had shown up “uninvited.”\n\n“Perhaps the vice minister who showed up here with very incendiary language on August 28 has gone rogue,” Bessent said during the press conference at Treasury. “This individual was very disrespectful,” he said, after earlier calling him “unhinged” in the CNBC event.\n\nLi had warned China would “cause global chaos” if the U.S. went ahead with plans for port fees for Chinese ships, Bessent said. “Maybe he thinks he’s a wolf warrior,” he said, referring to a term used for aggressive Chinese diplomats.\n\nBessent also said that China had initially ascribed a slowdown in the supply of rare earth magnets to a holiday — an argument that suggested “they can’t be trusted with the global supply chain.”\n\n“If China wants to be an unreliable partner to the world, then the world will have to decouple,” he said. “The world does not want to decouple,” he said. “We want to de-risk. But signals like this are signs of decoupling, which we don’t believe China wants.”\n\nWith assistance from Catherine Lucey, Phil Kuntz, Lauren Dezenski and Derek Wallbank.\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.","summary":"The dueling remarks underscored the whiplash investors have felt.","url":"https://www.mercurynews.com/2025/10/15/trump-bessent-china/","image":"https://www.mercurynews.com/wp-content/uploads/2025/10/202510151940MCT_____PHOTO____US-NEWS-USCHINA-TARIFFS-ZUM.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-15 23:54:14","author":"Gqlshare,Tribune News Service","authors":["Gqlshare","Tribune News Service"],"language":"en","category":"politics","source_country":"us","sentiment":-0.403},{"id":369620738,"title":"Trump declares US-China trade war, Bessent floats long truce","text":"By Daniel Flatley and Jennifer A. Dlouhy, Bloomberg News\n\nWASHINGTON — President Donald Trump said he saw the U.S. as locked in a trade war with China, even as Treasury Secretary Scott Bessent proposed a longer pause on high tariffs on Chinese goods to resolve a conflict over critical minerals.\n\n“Well, you’re in one now,” Trump said Wednesday when asked by a reporter if the world’s two largest economies are in for a sustained trade war if they cannot reach a trade deal. “We have a 100% tariff. If we didn’t have tariffs, we would be exposed as being a nothing.”\n\nTrump spoke just hours after Bessent dangled the possibility of extending a pause of import duties on Chinese goods for longer than three months if China halts its plan for strict new export controls on rare-earth elements. The U.S. and China have agreed to a series of 90-day truces since earlier this year, with the next deadline looming in November.\n\n“Is it possible that we could go to a longer roll in return? Perhaps. But all that’s going to be negotiated in the coming weeks,” Bessent said during a press conference in Washington.\n\nThe dueling remarks underscored the whiplash investors have felt as tensions have flared in the relationship between Washington and Beijing. U.S. equities extended gains after Bessent’s comments, while Trump’s remarks came after trading closed in New York.\n\nU.S. Trade Representative Jamieson Greer cast doubt that Beijing would go ahead with the plan, which he said would choke off trade in a wide variety of consumer products that contain even a trace of rare earths.\n\n“The scope and the scale is just unimaginable, and it cannot be implemented,” Greer said.\n\nIn the meantime, Bessent predicted a coordinated response to China’s move from the U.S. and several allies.\n\n“We’re going to have a fulsome, group response to this, because bureaucrats in China cannot manage the supply chain or the manufacturing process for the rest of the world,” Bessent said earlier Wednesday at a CNBC-hosted forum in Washington.\n\nCoordinated response\n\nPointing out that “all my counterparts” are in Washington for the annual gathering of the International Monetary Fund and World Bank this week, he said, “We’re going to be speaking with our European allies, with Australia, with Canada, with India and the Asian democracies.”\n\nAn escalating tit-for-tat between Washington and Beijing has renewed investors’ fears that world’s two largest economies could soon be locked in a full-blown trade war.\n\nChina’s new rules, announced last week, require overseas firms to obtain Chinese government approval before exporting products containing even trace amounts of certain rare earths that originated in China.\n\nTrump responded by threatening to impose an additional 100% tariff on Chinese goods by Nov. 1. He floated the idea of scrapping a planned meeting with President Xi Jinping and warned the U.S. could cut off trade in cooking oil, a key input in biofuels.\n\nThe Treasury chief said that as far as he’s aware, Trump “is a go” on meeting Xi later this month in South Korea. Bessent said there’s a “very good chance” that he travels to Asia before Trump and meets with his Chinese counterpart, Vice Premier He Lifeng.\n\nBessent said he expected trade announcements to be made during Trump’s Asia tour. The president is expected to attend a summit with Association of Southeast Asian Nations in Malaysia before going on to Japan and South Korea, which will be hosting the annual Asia-Pacific Economic Cooperation leaders meeting.\n\nThe U.S. is “about to finish up” negotiations with South Korea, Bessent added. Those talks have lately revolved around the contours of a giant investment program. U.S.-Canada talks are “back on track,” Bessent also said. He also indicated progress with India.\n\nBessent dismissed the notion that a slide in the stock market would force the Trump administration into a negotiating position with Beijing, saying that what spurs such talks is instead the economic interest of the nation. The U.S. won’t negotiate with China “because the stock market is going down,” he said.\n\nHe also rejected the idea that the rising price of gold reflects some fundamental concern with regard to the dollar. He flagged that U.S. interest rates have come down relative to other economies, and said with regard to the euro that it “should be strong,” given how currency theory would suggest exchange-rate appreciation when fiscal expansion is underway.\n\n‘Unhinged’ official\n\nBessent also on Wednesday singled out a Chinese vice Commerce minister, Li Chenggang, for particular criticism, referencing comments he made during an August visit to Washington. He said Li had shown up “uninvited.”\n\n“Perhaps the vice minister who showed up here with very incendiary language on August 28 has gone rogue,” Bessent said during the press conference at Treasury. “This individual was very disrespectful,” he said, after earlier calling him “unhinged” in the CNBC event.\n\nLi had warned China would “cause global chaos” if the U.S. went ahead with plans for port fees for Chinese ships, Bessent said. “Maybe he thinks he’s a wolf warrior,” he said, referring to a term used for aggressive Chinese diplomats.\n\nBessent also said that China had initially ascribed a slowdown in the supply of rare earth magnets to a holiday — an argument that suggested “they can’t be trusted with the global supply chain.”\n\n“If China wants to be an unreliable partner to the world, then the world will have to decouple,” he said. “The world does not want to decouple,” he said. “We want to de-risk. But signals like this are signs of decoupling, which we don’t believe China wants.”\n\nWith assistance from Catherine Lucey, Phil Kuntz, Lauren Dezenski and Derek Wallbank.\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.","summary":"The dueling remarks underscored the whiplash investors have felt.","url":"https://www.ocregister.com/2025/10/15/trump-bessent-china/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/202510151940MCT_____PHOTO____US-NEWS-USCHINA-TARIFFS-ZUM-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-15 23:54:14","author":"Gqlshare,Tribune News Service","authors":["Gqlshare","Tribune News Service"],"language":"en","category":"politics","source_country":"US","sentiment":-0.403},{"id":369621202,"title":"President Trump says CIA authorized to operate in Venezuela","text":"Oct. 15 (UPI) -- The CIA is authorized to conduct operations in Venezuela and likely has been for at least a couple of months, President Donald Trump confirmed on Wednesday.\n\nTrump commented on a possible CIA deployment in Venezuela when a reporter asked why he authorized the CIA to work in the South American nation during a Wednesday news conference.\n\nThe president said he has two reasons for authorizing the CIA to be involved in Venezuela.\n\n\"They have emptied their prisons into the United States,\" Trump said. \"They came in through the border because we had an open-border policy.\"\n\n\"They've allowed thousands and thousands of prisoners, people from mental institutions and insane asylums emptied out into the United States,\" Trump said. \"We're bringing them back.\"\n\nThe president said Venezuela is not the only country to do so, \"but they're the worst abuser\" and called the South American nation's leaders \"down and dirty.\"\n\nHe said Venezuela also is sending a lot of drugs into the United States.\n\n\"A lot of the Venezuelan drugs come in through the sea, so you see it,\" the president explained. \"We're going to stop them by land, also.\"\n\nTrump declined to answer a follow-up question regarding whether or not the CIA is authorized to \"take out\" Venezuelan President Nicolas Maduro.\n\nThe president called the question a fair one but said it would be \"ridiculous\" for him to answer it.\n\nThe president's answer regarding CIA deployment in Venezuela comes after he earlier said the U.S. military obtains intelligence on likely drug smuggling operations in Venezuela.\n\nSuch intelligence enabled the military to strike a vessel carrying six passengers off the coast of Venezuela on Tuesday.\n\n\"Intelligence confirmed the vessel was trafficking narcotics, was associated with illicit narco-terrorist networks and was transiting along a known [designated terrorist organization] route,\" Trump said in a Truth Social post announcing the military strike.\n\nAll six crew members were killed in the lethal kinetic airstrike on the vessel, and no U.S. forces were harmed.\n\nTrump told media that Venezuela and a lot of other countries are \"feeling heat\" and he \"won't let our country be ruined\" by them, ABC News reported.\n\nThe president in September notified several Congressional committees that the nation is in \"active conflict\" with transnational gangs and drug cartels, many of which he has designated as terrorist organizations.\n\nVenezuela's Tren de Aragua is among those so designated, and the United States has a $50 million bounty on Maduro, whom Trump says profits from the drug trade.\n\nDuring Trump's first term in office, the CIA similarly worked against drug cartels in Mexico and elsewhere in Central and South America.\n\nThe Biden administration continued those efforts, including flying drones over suspected cartel sites in Mexico to identify possible fentanyl labs.","summary":"The CIA is authorized to conduct operations in Venezuela and likely has been for at least a couple of months, President Donald Trump confirmed on Wednesday.","url":"https://www.upi.com/Top_News/US/2025/10/15/cia-venezuela/3521760571496/","image":"https://cdnph.upi.com/sv/ph/og/upi/3521760571496/2025/1/7c32a249846814b7493ba4d77c9d7897/v1.5/President-Trump-says-CIA-authorized-to-operate-in-Venezuela.jpg","video":null,"publish_date":"2025-10-15 23:54:01","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.243},{"id":369622282,"title":"FCC seeks to bar Hong Kong Telecom carrier from operating in US","text":"In a further sign of mounting tension between the US and China, the US Federal Communication Commission (FCC) on Wednesday took the initial step to “expel Hong Kong Telecom” from the US telecommunication network.\nIn a notice issued late in the day, the US regulatory agency announced that it had sent “Communist Party-controlled” HKT International an order to show cause why it should not revoke the carrier’s right to provide international and domestic services to and from the United States.\nThe basis for the show-cause order appeared to be that Hong Kong Telecom is affiliated with China Unicom (Americas), which is already listed on the agency’s Covered List involving national security determinations.\n“Today’s order continues the FCC’s work of ensuring that CCP-controlled entities that pose national security risks to our country cannot connect to our telecom networks,” said FCC Chairman Brendan Carr in a statement.\n\n“The FCC’s action on HKT today is an appropriate step towards ensuring the safety and integrity of our communications networks. The FCC will continue to safeguard America’s networks against penetration from foreign adversaries, like China.”\nThe Chinese embassy in Washington did not immediately respond to a request for comment.\nHong Kong Telecom has 30 days to file a response.\nAfter an uneasy stability, US-China ties have resumed their downward slide in recent days.\nLast week, Beijing tightened export controls over rare earth minerals and magnets. US President Donald Trump responded by threatening to slap another 100 per cent tariff on all Chinese goods, in addition to levies already in place. Strategic minerals are used in a wide variety of hi-tech products, from home appliances to fighter jets.\nIn the latest twist on Wednesday, Washington sought to rally allies – many of which face very high US tariffs themselves – to apply more pressure on Beijing.\nThe FCC said its latest move is part of a series of revocations against Chinese telecom carriers.\n“Over several years, the Commission has, on a unanimous bipartisan basis and on the recommendation of Executive Branch national security agencies, denied or revoked authorisations to provide telecommunications services in the US to Chinese state-owned enterprises,” the agency said.\nIn 2019, the FCC moved against China Mobile International, in 2020 against Huawei and China Telecom, in 2021 against China Unicom (Americas) and in 2022 against Pacific Networks and Comnet.\nThe FCC order cited “serious and unacceptable concerns that the Chinese government can, for example, direct or otherwise influence” Chinese and Hong Kong telecom carriers to “act on opportunities presented by its access to US telecommunications infrastructure and US customer information.\nThe order added that even if China Unicom did not own Hong Kong Telecom, it is still subject to Chinese law requiring the company and its subsidiaries – PCCW Global, Gateway Global Communications and PCCW Global UK – to “cooperate, assist, and support Chinese intelligence efforts wherever they are in the world”.\nThe order added that Hong Kong Telecom and its subsidiaries may be required to show that they have the “requisite character” to continue serving US “public interest, convenience, and necessity” given the past failure of Chinese carriers to satisfy US intelligence agencies.\nThis move highlights Washington’s “clean networks” initiative aimed at pressuring the industry into diversifying its supply chains and avoiding vendors seen as introducing intelligence vulnerabilities.\nThe FCC plans to vote on October 28 to tighten restrictions on telecommunications equipment made by Chinese companies deemed national security risks.\nLast week, Carr said that leading US online retail websites had removed several million listings for prohibited Chinese electronics as part of an FCC crackdown, including home security cameras and smartwatches made by Huawei, Hangzhou Hikvision, ZTE, Dahua Technology and others.\nIn March, the FCC announced an investigation into nine Chinese companies seen as potential national security concerns, including China Unicom, Huawei, ZTE and Pacific Networks/Comnet.","summary":"In a further sign of mounting tension between the US and China, the US Federal Communication Commission (FCC) on Wednesday took the initial step to “expel Hong Kong Telecom” from the US telecommunication network.\nIn a notice issued late in the day, the US regulatory agency announced that it had sent “Communist Party-controlled” HKT International an order to show cause why it should not revoke the carrier’s right to provide international and domestic services to and from the United States.\nThe...","url":"https://www.scmp.com/news/us/diplomacy/article/3329174/fcc-seeks-bar-hong-kong-telecom-carrier-operating-us","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/10/16/df98046a-d223-4bc5-8bc3-ddc116c9090c_65411cdf.jpg","video":null,"publish_date":"2025-10-15 23:49:16","author":"Mark Magnier","authors":["Mark Magnier"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.211},{"id":369620286,"title":"FBI director: Operation Summer Heat posts nation's best crime-fighting numbers","text":"Oct. 15 (UPI) -- FBI Director Kash Patel said the first seven months of the Trump administration's Operation Summer Heat have posted the best crime-fighting numbers in the nation's history.\n\nPresident Donald Trump, Attorney General Pam Bondi and Patel detailed the results of \"Operation Summer Heat\" to thwart crime in Washington and other major cities during the summer months during a Wednesday afternoon press conference at the White House.\n\n\"Since the start of the administration, the FBI has arrested over 23,000 violent criminals,\" the president said, adding that the number is more than double the amount arrested during the final year of the Biden administration.\n\n\"The FBI has also destroyed or severely disrupted more than 170 organized criminal enterprises and gangs, 1,600 of the most violent gangs and confiscated more than 6,000 illegal firearms,\" Trump said.\n\nHe said the FBI also has arrested four out of 10 of the most wanted criminals in the United States, two of whom Trump said were the two most wanted criminals in the world.\n\nThe president said there is still more work to be done and suggested the FBI add San Francisco to its list of cities in which the FBI and other federal agencies should increase law enforcement activities.\n\nPatel said Operation Summer Heat over three months arrested 8,700 violent criminals and seized 2,200 firearms, 421 kilograms of fentanyl and 45,000 kilograms of cocaine.\n\nThe amount of fentanyl seized over the summer months was enough to kill more than 5,500 people, Patel said, adding that the federal law enforcement operation secured 2,100 criminal indictments from June to September.\n\n\"That in and of itself would be historic for a four-year presidency,\" Patel told Trump. \"You did that in seven months because you let good cops be cops, and you partnered us with the right people in the Department of Justice.\"\n\nPatel compared the number of arrests of violent criminals, 28,600, during the first seven months under the Trump administration versus the annual totals over the Biden administration, which Patel said posted between about 15,000 and 17,000 such arrests per year.\n\nBondi said the president has removed restraints on law enforcement agents so that they can do their respective jobs.\n\n\"That's why all of this is happening,\" Bondi said, adding that FBI staff are \"working around the clock.\"\n\nShe said many of them have families and small children at home, but are working non-stop to keep the country and world safe.\n\n\"That's what Operation Summer Heat did,\" Bondi added. She then thanked Patel and FBI Deputy Director Andrew Bailey for the work done by the FBI.\n\nShe said the FBI has \"set the stage\" for a federal law enforcement operation in Memphis, which in one night netted nearly 70 arrests, seized a dozen guns and arrested a 70-year-old man suspected of raping a child under the age of 3.\n\n\"That one case makes everything we are doing worthwhile,\" Bondi said of the arrest of the suspected pedophile.\n\nAfter Bondi concluded her statements, a reporter asked the president why he is using the military to target suspected drug smugglers in boats instead of using the Coast Guard.\n\nTrump said the drug smugglers use boats that are too fast for the Coast Guard to intercept, which has made the Coast Guard ineffective at stopping drug smuggling on the open seas.\n\n\"Some of these boats are world-class speedboats, but they're not faster than missiles,\" the president added.","summary":"FBI Director Kash Patel said the first seven months of the Trump administration's Operation Summer Heat have posted the nation's best crime-fighting numbers.","url":"https://www.upi.com/Top_News/US/2025/10/15/operation-summer-heat/1661760565101/","image":"https://cdnph.upi.com/sv/ph/og/upi/1661760565101/2025/1/d2a09392ab2794eeabb621e8c8820fc1/v1.5/FBI-director-Operation-Summer-Heat-posts-nations-best-crime-fighting-numbers.jpg","video":null,"publish_date":"2025-10-15 23:48:42","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"us","sentiment":-0.172},{"id":369620740,"title":"Trump confirms the CIA is conducting covert operations inside Venezuela","text":"By AAMER MADHANI\n\nWASHINGTON (AP) — President Donald Trump confirmed on Wednesday that he has authorized the CIA to conduct covert operations inside Venezuela and said he was weighing carrying out land operations on the country.\n\nThe acknowledgement of covert action in Venezuela by the U.S. spy agency comes after the U.S. military in recent weeks has carried out a series of deadly strikes against alleged drug-smuggling boats in the Caribbean. U.S. forces have destroyed at least five boats since early September, killing 27 people, and four of those vessels originated from Venezuela.\n\nAsked during an event in the Oval Office on Wednesday why he had authorized the CIA to take action in Venezuela, Trump affirmed he had made the move.\n\n“I authorized for two reasons, really,” Trump replied. “No. 1, they have emptied their prisons into the United States of America,” he said. “And the other thing, the drugs, we have a lot of drugs coming in from Venezuela, and a lot of the Venezuelan drugs come in through the sea.”\n\nTrump added the administration “is looking at land” as it considers further strikes in the region. He declined to say whether the CIA has authority to take action against President Nicolás Maduro.\n\nTrump made the unusual acknowledgement of a CIA operation shortly after The New York Times published that the CIA had been authorized to carry out covert action in Venezuela.\n\nEarly this month, the Trump administration declared drug cartels to be unlawful combatants and pronounced the United States is now in an “armed conflict” with them, justifying the military action as a necessary escalation to stem the flow of drugs into the United States.\n\nThe move has spurred anger in Congress from members of both major political parties that Trump was effectively committing an act of war without seeking congressional authorization.\n\nOn Wednesday, Sen. Jeanne Shaheen, the ranking Democrat on the Senate Foreign Relations Committee, said while she supports cracking down on trafficking, the administration has gone too far.\n\n“The Trump administration’s authorization of covert C.I.A. action, conducting lethal strikes on boats and hinting at land operations in Venezuela slides the United States closer to outright conflict with no transparency, oversight or apparent guardrails,” Shaheen said. “The American people deserve to know if the administration is leading the U.S. into another conflict, putting servicemembers at risk or pursuing a regime-change operation.”\n\nThe Trump administration has yet to provide underlying evidence to lawmakers proving that the boats targeted by the U.S. military were in fact carrying narcotics, according to two U.S. officials familiar with the matter.\n\nThe officials, who were not authorized to comment publicly and spoke on the condition of anonymity, said the administration has only pointed to unclassified video clips of the strikes posted on social media by Trump and Defense Secretary Pete Hegseth and has yet to produce “hard evidence” that the vessels were carrying drugs.\n\nLawmakers have expressed frustration that the administration is offering little detail about how it came to decide the U.S. is in armed conflict with cartels or which criminal organizations it claims are “unlawful combatants.”\n\nEven as the U.S. military has carried out strikes on some vessels, the U.S. Coast Guard has continued with its typical practice of stopping boats and seizing drugs.\n\nTrump on Wednesday explained away the action, saying the traditional approach hasn’t worked.\n\n“Because we’ve been doing that for 30 years, and it has been totally ineffective. They have faster boats,” he said. ”They’re world-class speedboats, but they’re not faster than missiles.”\n\nHuman rights groups have raised concerns that the strikes flout international law and are extrajudicial killings.","summary":"Trump added the administration “is looking at land” while considering further strikes in the region.","url":"https://www.ocregister.com/2025/10/15/trump-venezuela-cia/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Trump_52216.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-15 23:48:18","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.233},{"id":369622964,"title":"Tariffs heighten urgency to boost B.C. productivity, BoC official warns Vancouver audience (BC)","text":"U.S. tariffs have given Canada “a shot in the arm” to address its productivity challenges, Carolyn Rogers, senior deputy governor of Bank of Canada, said at a Vancouver event this week.\n\nRogers spoke Tuesday to around 400 attendees at the BCBC Business Summit 2025: Productivity Awakens. She gave a speech in Halifax last year warning that Canada's low labour productivity had reached \"emergency\" levels. \n\n“It’s only gotten more important. What has changed is the sense of urgency people are feeling, the willingness to tackle some of these difficult problems,” said Rogers.\n\n“You have to have that little bit of a shot in the arm to make those hard decisions. If there's a silver lining [of U.S. tariffs], it's maybe that shot in the arm you need.”\n\nRogers said there is no “magic bullet” to Canada’s productivity problem and that real progress requires efforts from both public and private sectors.\n\n“These won't all be easy decisions. In fact, many of them will be difficult decisions, and some will involve short-term pain to get to a better future,” she said.\n\nCanada’s GDP per capita is about 70 per cent of that of the U.S. this year – in other words, Americans are producing nearly 44 per cent more per person than Canadians, according to economist David Williams, vice-president of policy of Business Council of B.C., who also spoke at the event.\n\nBetween 2014 and 2024, real GDP per person in Canada grew by 0.2 per cent, the second weakest among the 38 countries of the Organisation for Economic Co-operation and Development (OECD), which includes most of the world’s developed economies. \n\nBy comparison, U.S. GDP per capita grew by 1.8 per cent, the average OECD was 1.4 per cent, Australia saw 0.7 per cent and the U.K. 0.6 per cent. \n\n“Adjusted population, the [Canadian] economy essentially is the same size as it was 10 years ago,” said Williams.\n\n“And since the pandemic, we've actually seen productivity have a decline, which is pretty concerning.”\n\nHe noted that the number figures predate U.S. President Donald Trump’s tariff increases, which have added further pressure on the Canadian and B.C. economies. \n\nFrom 2019 to 2023, Canada saw minimal growth in capital investment and workforce skills, while innovation and business scaling declined, according to BCBC data.\n\n“Even in its heyday, skills never contributed more than about 0.3 to 0.5 percentage points [to productivity], so while skills are important, it’s not enough,” Williams said.\n\n“We need capital investment, and we need innovation and operating at scale - our companies in Canada are too small.”\n\nTrevor Tombe, professor and director of fiscal and economic policy of the University of Calgary, said both the federal and provincial governments must act to attract investment and close the productivity gap.\n\nThis includes sales tax reform, such as exempting capital and intermediate goods from provincial sales taxes.\n\nProductivity varies by sectors—construction, transportation, utilities and manufacturing saw the most significant decline in Canada over the past 10 years, according to Tombe.\n\nHe noted that the B.C. government also needs to tackle the fiscal sustainability challenge by ensuring that revenue keeps pace with the province’s GDP, and “shrink the excess growth” in health-care costs.\n\n“Provinces need to adopt modest changes year by year—in fees and tuition, or modest changes in other tax rates that are automatic and proportional to income,” he said.","summary":"U.S. tariffs have given Canada 'a shot in the arm' to address its productivity challenges, Carolyn Rogers, senior deputy governor of Bank of Canada, said at a Vancouver event this week. Rogers spoke Tuesday to around 400 attendees at the BCBC Business Summit 2025: Productivity Awakens. She gave a sp...","url":"https://www.castanet.net/news/BC/578172/Tariffs-heighten-urgency-to-boost-B-C-productivity-BoC-official-warns-Vancouver-audience","image":"https://www.castanet.net/content/2025/10/glacier_173117_p.jpg","video":null,"publish_date":"2025-10-15 23:48:00","author":"Contributed,Daisy Xiong","authors":["Contributed","Daisy Xiong"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.045},{"id":369625626,"title":"Arc de Trump: Inside the President’s Vision For A Triumphal Arch In Washington DC","text":"President Donald Trump is reportedly spearheading plans for a monumental arch in Washington, DC, to mark the nation’s 250th anniversary, one born of his personal vision and style ambitions. The proposed structure would stand near the Virginia side of the Arlington Memorial Bridge, nestled in the traffic circle between Arlington National Cemetery and the Lincoln Memorial. Renderings by Harrison Design depict a stone arch with columns, eagles, wreaths, and a gilded winged figure, echoing classic triumphal designs such as Paris’s Arc de Triomphe. Sources tell CNN that Trump was intimately involved with the idea, saying, “He came up with the design and has been part of the process every step of the way.” At least two 3D models of the arch appeared on his Oval Office desk during recent meetings with foreign leaders, and he has shared a watercolor version on social media. Although construction timing and funding remain unsettled, the White House has already instated a broader mandate: a preference for classical architecture in federal projects, with deviations, like Brutalist styles, requiring his personal approval. While the arch itself won’t fall under those new rules, its aesthetic is said to align with that classical vision. Trump’s architectural influence in DC is already evident. He has overseen renovations to the White House Rose Garden, redecorated the Oval Office and Cabinet Room with opulent touches, and is proceeding with a major ballroom expansion. This new arch seems poised to be his most monumental imprint on the capital yet. When asked about the object on his desk by a reporter, Trump quipped, “It’s an Arc, take a look.” And when pressed on its dedication? He tapped his chest: “Me.” Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"President Trump is personally leading plans to build a triumphal arch in Washington, DC, to mark America’s 250th anniversary, drawing inspiration from Paris’s Arc de Triomphe. The proposed monument reflects Trump’s classical aesthetic and would stand near Arlington Memorial Bridge.","url":"https://www.timesnownews.com/world/us/us-news/arc-de-trump-inside-the-presidents-vision-for-a-triumphal-arch-in-washington-dc-article-153007332","image":"https://images.timesnownews.com/thumb/msid-153007333,thumbsize-1008390,width-1280,height-720,resizemode-75/153007333.jpg","video":null,"publish_date":"2025-10-15 23:47:17","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":0.323},{"id":369625636,"title":"Why Narendra Modi Stadium In Ahmedabad Is Capable of Hosting Commonwealth Games 2030?","text":"Ahmedabad: India has set its sights on hosting the 2030 Commonwealth Games, recommending Ahmedabad as the host city. Central to this ambitious plan is the Narendra Modi Stadium, a state-of-the-art facility that stands as a testament to India's growing prominence in the global sporting arena. After hosting grand events like 'Namaste Trump' and the final match of the ODI 2024 World Cup, city is now proposed to host world's biggest sports event. A Modern Marvel in the Heart of GujaratLocated in Ahmedabad, Gujarat, the Narendra Modi Stadium is not just the largest cricket stadium globally but also a versatile venue capable of hosting a variety of events. Its impressive features include: Seating Capacity: Accommodating up to 132,000 spectators, it surpasses all other cricket stadiums worldwide in terms of capacity. Advanced Facilities: The stadium boasts modern amenities such as multiple dressing rooms, a cutting-edge drainage system, and LED floodlights, ensuring an unparalleled experience for both players and fans. Multipurpose Design: Beyond cricket, the stadium is equipped to host a range of sports and large-scale events, making it an ideal choice for the Commonwealth Games. A Track Record of Hosting Prestigious EventsSince its inauguration in 2020, the Narendra Modi Stadium has been the venue for several high-profile events given its capability to handle international spectacles: International Cricket Matches: It has hosted numerous Test matches, One-Day Internationals (ODI), and T20 games, including significant fixtures during the 2023 One Day International World Cup. Cultural Extravaganzas: The stadium gained global attention during the \"Namaste Trump\" event in 2020, which was attended by then-U.S. President Donald Trump, showcasing its versatility as a venue for large-scale cultural and political gatherings. Strategic Advantages for the Commonwealth Games Choosing Ahmedabad and the Narendra Modi Stadium for the 2030 Commonwealth Games offers several strategic benefits: Infrastructure Readiness: The city's existing infrastructure, combined with the stadium's world-class facilities, ensures preparedness for an event of this magnitude.Economic Impact: Hosting the Games is expected to boost local economies, generate employment opportunities, and enhance tourism in the region.Global Recognition: Successfully organising the Commonwealth Games would further cement India's reputation as a capable host of international sporting events, paving the way for future bids, including potential Olympic aspirations.","summary":"India has proposed Ahmedabad's Narendra Modi Stadium as the venue for the 2030 Commonwealth Games, given its world-class infrastructure and massive seating capacity. The bid aims to showcase India's sporting prowess and strengthen its case for hosting the Olympics in 2036.","url":"https://www.timesnownews.com/city/ahmedabad/why-narendra-modi-stadium-in-ahmedabad-is-proposed-to-host-commonwealth-games-2030-article-119297103","image":"https://images.timesnownews.com/thumb/msid-119297286,thumbsize-1572965,width-1280,height-720,resizemode-75/119297286.jpg","video":null,"publish_date":"2025-10-15 23:47:16","author":"Avni Arya","authors":["Avni Arya"],"language":"en","source_country":"in","sentiment":0.682},{"id":369622884,"title":"Olivia Nuzzi’s memoir ‘American Canto’ will include sexually charged RFK Jr. texts, bombshell details","text":"It’s a text and tell. \n\nOlivia Nuzzi — the former New York Magazine reporter who had a “digital affair” with Robert F. Kennedy Jr. while he was a presidential candidate — is coming out with a book that’s set to potentially incinerate his marriage to Cheryl Hines, a source tells Page Six.\n\nNuzzi’s planned book will include sexually charged text messages between the political journo and RFK Jr., a source tells Page Six. We hear that the book — titled “American Canto” in a nod to Dante’s “Inferno” — will delve into her headline-sparking relationship with the Kennedy scion, complete with spicy messages between her and the now Secretary of the US Department of Health and Human Services.\n\n“Its hard to imagine RFK surviving this with his marriage and job intact,” said a source with knowledge of the book. \n\nThe “MAHA” movement big and the “Curb Your Enthusiasm” star have been married since 2014.\n\nWe hear Nuzzi’s upcoming book will also detail her relationship with her former fiancé and fellow political journo, Ryan Lizza, which devolved amid the sexting scandal, and even led to a messy legal skirmish.\n\nAccording to a source, the planned book is more than just a juicy tell-all, but a literary endeavor of historical merit delving into Nuzzi’s decade covering Donald Trump, along with information pulled from hours of taped conversations between herself and the president.\n\nNews of the book first broke in Oliver Darcy’s Status newsletter.\n\nThe leak must have taken Simon & Schuster by surprise. We hear the publishing house has been taking extra precautions to keep the tome top secret.\n\nA source tells us there are no galleys (preliminary copies for internal review), and that there is an entirely separate server set up to keep the book in it’s very own, very secure bubble.\n\nPublishers normally set up an Amazon page early to keep as an online landing spot. In the case of Nuzzi’s book, we hear the listing has no image, no author and is titled, “To Be Announced AC.”\n\nThe publication date on the secret page is Dec. 2, 2025.\n\nNot only was the announcement supposed to go public right before publication, sources tell us, but there was an effort not to overlap with any news surrounding Hines’ upcoming book, “Unscripted,” out Nov. 11.\n\nWe’re told the book is so hot, there is concern for Nuzzi’s safety.\n\nWe hear there’s also fear there could be an injunction, or that the Trump White House could try and block the publication as its latest battle with the media.\n\nWe hear the rollout is being handled by top crisis PR guru Risa Heller, who previously has worked with disgraced congressman Anthony Weiner (aka Carlos Danger), Jared Kushner and Jeff Zucker.\n\nNuzzi’s sextual affair with Kennedy began after she profiled the then-independent presidential candidate in November 2023 for New York Magazine.\n\nThe pair had “incredible” sex over FaceTime, a source previously told Page Six and she reportedly sent “demure” nudes.\n\nKennedy — the son of Sen. Robert F. Kennedy, and nephew of President John F. Kennedy — previously denied a fling with Nuzzi, and his camp said the two only met in person once for the profile story.\n\nNuzzi parted ways with New York Magazine in October 2024. The mag said an outside investigation found no evidence of bias in Nuzzi’s reporting on the one-time candidate during the 2024 campaign.\n\nNuzzi, in a statement last fall, stressed that the relationship was not physical.\n\n“The relationship was never physical but should have been disclosed to prevent the appearance of a conflict,” she said. “I deeply regret not doing so immediately and apologize to those I’ve disappointed, especially my colleagues at New York.”\n\nShe was just hired as Vanity Fair’s West Coast editor last month.\n\nReps for Nuzzi and Simon & Schuster did not respond to requests for comment.","summary":"Nuzzi's upcoming memoir, \"American Canto,\" is being kept so top secret at Simon &amp; Schuster, it's even on its own server, we hear.","url":"https://pagesix.com/2025/10/15/society/olivia-nuzzis-memoir-set-to-shake-up-rfk-jr-s-marriage/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/10/113529896.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/GzCfhRTw-guILbWnz.mp4","publish_date":"2025-10-15 23:46:13","author":"Mara Siegler,mliss1578","authors":["Mara Siegler","mliss1578"],"language":"en","source_country":"us","sentiment":0.056},{"id":369620550,"title":"Trump administration withholds $40M from California over trucker English proficiency rules","text":"The Trump administration plans to withhold $40 million from California over its refusal to enforce English language requirements for truckers, Transportation Secretary Sean Duffy said Wednesday. The move came weeks after an investigation found that an illegal immigrant truck driver, Harjinder Singh, killed three people after making an illegal U-turn on a Florida road in August. California had issued the driver a commercial license, but these English rules predate the crash. Duffy cited failures by California to enforce English proficiency rules following one of President Donald Trump’s executive orders. DUFFY RESPONDS WITH 'CROCODILE TEARS' COMMENT ON BANNED CALIFORNIA TRUCK DRIVER CASE \"California is the only state in the nation that refuses to ensure big rig drivers can read our road signs and communicate with law enforcement. This is a fundamental safety issue that impacts you and your family on America’s roads,\" Duffy said. \"The Golden State thinks it’s OK to ignore @USDOT English language requirements for truckers. You can play all the games you want, but not at the expense of American lives,\" Duffy wrote on X. Duffy said the truck driver in the Florida crash should not have been given a commercial license because of his immigration status. Diana Crofts-Pelayo, a spokesperson for California Gov. Gavin Newsom, told Fox News Digital that California commercial truck drivers have a lower crash rate than the national average. \"It seems the Secretary of Transportation needs a lesson about the laws of his own roads,\" Crofts-Pelayo said. \"The reality is simple: Commercial driver's license holders in California had a fatal accident rate nearly 40% LOWER than the national average. Texas, the only state with more commercial driver's license holders, has a rate nearly 50% higher than California's.\" \"The facts don't lie, although for the Trump Administration, they seem optional,\" she added. GOP REP TARGETS TRUCKER'S ENGLISH SKILLS AFTER ILLEGAL MIGRANT CHARGED IN DEADLY FLORIDA CRASH Singh, an Indian citizen, is being held without bond after being charged with three state counts of vehicular homicide and immigration violations. Investigators said he failed an English proficiency test but was still issued a license to drive trucks. Duffy and Florida officials have blamed California as well as Washington state for issuing him a commercial driver’s license. However, California officials said Singh had a valid work permit at the time. Authorities said he entered the United States illegally from Mexico in 2018. CLICK HERE TO GET THE FOX NEWS APP To have the funding reinstated, California must enforce the English rules and ensure that state inspectors test truck drivers’ English skills during roadside inspections and remove anyone from the road who fails. The Associated Press contributed to this report.","summary":"California faces $40 million federal funding cut for refusing to enforce English proficiency rules for truck drivers after fatal crash involving illegal immigrant.","url":"https://www.foxnews.com/politics/trump-administration-withholds-40m-california-trucker-english-proficiency-rules","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/newsom-sean-duffy-split.jpg","video":null,"publish_date":"2025-10-15 23:46:05","author":"Louis Casiano","authors":["Louis Casiano"],"language":"en","source_country":"us","sentiment":-0.273},{"id":369625264,"title":"Judge’s Fiery Critique of DOJ Attorney Ignites Controversy Over Recent Firings","text":"A federal judge in San Francisco has issued a significant ruling, halting a controversial move by the Trump administration to lay off federal workers amidst the ongoing government shutdown. This decision was handed down on Wednesday by U.S. District Judge Susan Illston, who was appointed by former President Bill Clinton.\n\nJudge Illston’s bench ruling specifically blocks the implementation of “reductions in force” (RIFs) that the Trump administration had proposed. These reductions were initially suggested at the end of the previous month, just days before the shutdown began, with the aim of cutting down the number of federal employees.\n\nThe court strongly criticized the proposed mass layoffs, describing them as politically driven and exceeding the confines of executive authority. According to a report by Politico, Judge Illston remarked that the administration appears to be exploiting the government shutdown to bypass legal constraints and impose preferred structural changes.\n\nFurthermore, the judge declared these intended layoffs “illegal and in excess of authority,” a sentiment echoed in a courtroom report by Bloomberg Law.\n\nThis legal challenge, filed on September 30, was brought forth by the American Federation of Government Employees. This union represents a significant number of federal workers across various government agencies, all of whom stood to be impacted by the proposed layoffs. More details on the case can be found through the court records.\n\nThe underlying Sept. 30 litigation was filed by the American Federation of Government Employees, which represents thousands of federal workers assigned to various federal agencies.\n\nIn their 31-page complaint, the plaintiffs asked for injunctive relief under the Administrative Procedure Act (APA), the federal statute governing agency behavior. On Oct. 4, the labor union plaintiffs filed a 29-page motion for a temporary restraining order.\n\n“In contravention of binding authority, even before the shutdown began, the Administration announced its plan to engage in mass terminations of federal employees — not temporary furloughs, but permanent reductions-in-force — during the shutdown,” the second filing reads. “And now, it has become clear that those threats have become action and will soon be carried out.”\n\nMotions practice has been quick due to the presumed speed with which such layoffs might be effectuated – a rapidity singled out by the plaintiffs in their restraining order request. Indeed, in their own haste, U.S. Department of Justice attorneys filed an error-filled motion in opposition, prompting the subsequent filing of an errata notice – a formal document admitting to, and correcting, certain mistakes.\n\nOver the weekend, Illston set the date for the hearing, which ended with the court blocking the government from “taking any action” that might result in RIFs being issued to workers represented by the AFGE.\n\nThe lawsuit noted the plans to fire government workers were previewed in a memorandum issued by the Office of Management and Budget (OMB), which advised all administrative agency heads to “use this opportunity” to reduce staff.\n\nDuring the hearing, the judge listed public comments made by President Donald Trump, Vice President J.D. Vance and OMB Director Russ Vought. Those comments, the court noted, evidenced a desire to attack and dismantle programs supported by the Democratic Party.\n\n“It’s really ready, fire, aim on most of these programs,” Illston opined on Wednesday. “It’s a human cost that cannot be tolerated.”\n\nThe government, in its opposition motion and during the hearing, argued the plaintiffs do not have standing to sue because the harms they describe are too speculative – insisting the OMB memo is not actually binding on any federal agency.\n\n“Many of them may well decide not to do RIFs at all,” DOJ attorney Elizabeth Hedges argued – to little effect.\n\nThe judge rejected that line of thought, upbraiding the DOJ for attempting to make its case only on jurisdictional issues.\n\n“You’re not making any statement concerning the government’s position on the merits…whether the RIFs are legal?” Illston asked.\n\nTo which Hedges replied: “Not today, your honor.”\n\n“You’re not going to get to the merits with me today because the merits are just so troublesome,” Illston intoned.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump attends a meeting with the Fraternal Order of Police&#8230;\n\n\nThis Post: Judge&#8217;s Fiery Critique of DOJ Attorney Ignites Controversy Over Recent Firings first appeared on Internewscast Journal","url":"https://internewscast.com/crime/judges-fiery-critique-of-doj-attorney-ignites-controversy-over-recent-firings/","image":"https://internewscast.com/wp-content/uploads/2025/06/Judge-declares-Trumps-use-of-Alien-Enemies-Act-unlawful.jpg","video":null,"publish_date":"2025-10-15 23:43:26","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.305},{"id":369626376,"title":"NYC socialist mayoral wannabe Zohran Mamdani enters hostile territory for Fox News interview and issues direct challenge to Trump","text":"Socialist New York City mayoral favorite Zohran Mamdani looked directly into the camera and addressed Donald Trump during a combative interview with Fox News.\n\nThe left-winger spoke to FOX News Channel’s The Story With Martha MacCallum about the upcoming election. He remains the frontrunner for City Hall over disgraced governor Andrew Cuomo and Republican candidate Curtis Sliwa. \n\nMamdani answered a question by turning to the camera and admitting that Trump 'might be watching right now' and he wanted to 'speak directly' to the president.\n\n'I will not be a mayor like Mayor Adams who will call you to figure out how to stay out of jail or be a disgraced governor like Andrew Cuomo who will call you to ask how to win this election,' he said.\n\nAdams - who had been under federal indictment until Trump bailed him out - exited the race last month after amid criticism about his ties to the administration.\n\nMamdani continued by delivering a direct challenge to Trump. \n\n'I will, however, be a mayor who is ready to speak at any time to lower the cost of living,' Mamdani, a state assemblyman, said. 'That is the way that I will lead the city and the partnership.'\n\nHe said that he would work with anyone, including Trump, to make his goals of an affordable Big Apple come true. \n\n'I want to build not only with Washington, D.C., but anyone across this country,' he said. \n\n'It's important because too often the focus on the needs of working-class Americans are put to the side as we talk more and more about the very times of corrupt politicians like Andrew Cuomo that delivered us into this kind of crisis.'\n\nElsewhere in the interview, Mamdani repeated his promise to apologize to police officers over repeating woke, defund the police rhetoric and reiterated that he would arrest Israeli Prime Minister Benjamin Netanyahu. \n\nMamdani and Trump have often tested one another in the press since the Democratic Socialist won the Democrat nomination. \n\nLast month, Mamdani challenged President Donald Trump to a debate, while calling out the White House for attempting to get involved in the race. \n\nHe made the comments after a New York Times report which said the Trump administration asked Adams and Sliwa if they would consider abandoning their campaigns to take federal jobs. \n\nThe idea would be to set up a head-to-head race between Mamdani and former Cuomo, who lost out on the Democratic primary to Mamdani. \n\nTrump had suggested that Mamdani could win the mayoral election if the field of candidates isn't cut down, before branding him a communist. \n\nHe told reporters before a White House dinner: 'I don't think you can win unless you have one on one, because somehow he's gotten a little bit of a lead.\n\n'I don't think you can win unless you have one on one, because somehow he's gotten a little bit of a lead. I think that's a race that could be won.'\n\nWhen asked by reporters if he would encourage other candidates in the race to drop out, he said no before adding: 'I don't like to see a communist become mayor, I will tell you that.'\n\nEven if either of the men were to take Trump up on any potential offer, it would be difficult to have their names removed from the ballot in time.\n\nAnd it would be a substantial risk, betting on New Yorkers to rally behind Cuomo, who resigned in 2021 after multiple accusations of sexual harassment, which he denied.\n\nTrump has consistently branded Mamdani a communist, while Mamdani previously labeled himself as 'Trump's worst nightmare'.\n\nThe president went as far as threatening him with an arrest or even deportation if Mamdani defied his Immigration and Customs Enforcement earlier this year. \n\nMamdani was born in Uganda and immigrated to the United States at the age of seven, he became a naturalized US citizen in 2018. \n\nTrump was born in the Queens borough of the city and pushed his father's real estate business into Manhattan before turning toward politics.\n\nHe officially moved his primary residence from New York to Florida in 2019, during his first White House term.\n\nRelatively unknown when the contest began, Mamdani secured endorsements from progressives including Senator Bernie Sanders and Rep. Alexandria Ocasio-Cortez.\n\nOn his way to trouncing the competition in the primary, Mamdani beat out Cuomo and several other candidates.\n\nHis campaign ran on ideas including free public buses, rent freezes for rent-stabilized apartments, as well as grocery stores that would be owned by the city.\n\nMany Republicans in Washington believe Mamdani becoming mayor of New York would serve them well in the midterms as they'd be able to link his extreme liberal policies to their rival Democrats.","summary":"Mamdani did a rare hostile interview with Fox News and took time out to directly address the president, who he said 'might be watching right now.'","url":"https://www.dailymail.co.uk/news/article-15196171/NYC-socialist-Zohran-Mamdani-challenges-Donald-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/10/15/23/103024205-0-image-m-20_1760568903961.jpg","video":null,"publish_date":"2025-10-15 23:42:01","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.405},{"id":369624014,"title":"Trump confirms the CIA is conducting covert operations inside Venezuela","text":"WASHINGTON (AP) — President Donald Trump confirmed on Wednesday that he has authorized the CIA to conduct covert operations inside Venezuela and said he was weighing carrying out land operations on the country.\n\nThe acknowledgement of covert action in Venezuela by the U.S. spy agency comes after the U.S. military in recent weeks has carried out a series of deadly strikes against alleged drug-smuggling boats in the Caribbean. U.S. forces have destroyed at least five boats since early September, killing 27 people, and four of those vessels originated from Venezuela.\n\nAsked during an event in the Oval Office on Wednesday why he had authorized the CIA to take action in Venezuela, Trump affirmed he had made the move.\n\n“I authorized for two reasons, really,” Trump replied. “No. 1, they have emptied their prisons into the United States of America,” he said. “And the other thing, the drugs, we have a lot of drugs coming in from Venezuela, and a lot of the Venezuelan drugs come in through the sea.”\n\nTrump added the administration “is looking at land” as it considers further strikes in the region. He declined to say whether the CIA has authority to take action against President Nicolás Maduro.\n\nTrump made the unusual acknowledgement of a CIA operation shortly after The New York Times published that the CIA had been authorized to carry out covert action in Venezuela.\n\nEarly this month, the Trump administration declared drug cartels to be unlawful combatants and pronounced the United States is now in an “armed conflict” with them, justifying the military action as a necessary escalation to stem the flow of drugs into the United States.\n\nThe move has spurred anger in Congress from members of both major political parties that Trump was effectively committing an act of war without seeking congressional authorization.\n\nOn Wednesday, Sen. Jeanne Shaheen, the ranking Democrat on the Senate Foreign Relations Committee, said while she supports cracking down on trafficking, the administration has gone too far.\n\n“The Trump administration’s authorization of covert C.I.A. action, conducting lethal strikes on boats and hinting at land operations in Venezuela slides the United States closer to outright conflict with no transparency, oversight or apparent guardrails,” Shaheen said. “The American people deserve to know if the administration is leading the U.S. into another conflict, putting servicemembers at risk or pursuing a regime-change operation.”\n\nThe Trump administration has yet to provide underlying evidence to lawmakers proving that the boats targeted by the U.S. military were in fact carrying narcotics, according to two U.S. officials familiar with the matter.\n\nThe officials, who were not authorized to comment publicly and spoke on the condition of anonymity, said the administration has only pointed to unclassified video clips of the strikes posted on social media by Trump and Defense Secretary Pete Hegseth and has yet to produce “hard evidence” that the vessels were carrying drugs.\n\nLawmakers have expressed frustration that the administration is offering little detail about how it came to decide the U.S. is in armed conflict with cartels or which criminal organizations it claims are “unlawful combatants.”\n\nEven as the U.S. military has carried out strikes on some vessels, the U.S. Coast Guard has continued with its typical practice of stopping boats and seizing drugs.\n\nTrump on Wednesday explained away the action, saying the traditional approach hasn’t worked.\n\n“Because we’ve been doing that for 30 years, and it has been totally ineffective. They have faster boats,” he said. ”They’re world-class speedboats, but they’re not faster than missiles.”\n\nHuman rights groups have raised concerns that the strikes flout international law and are extrajudicial killings.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump confirmed on Wednesday that he has authorized the CIA to conduct covert operations inside Venezuela and said he was...","url":"https://wsvn.com/news/politics/trump-confirms-the-cia-is-conducting-covert-operations-inside-venezuela/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/10/101525-Trump-holds-presser-with-FBI-on-drugsa.jpg?quality=60&strip=color","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/d565eb9a-1ec7-4a86-a322-9910e75d637f/737ca688-baae-46f0-b6d1-1004dcc06b89/main.mp4?fastly_token=NjhmMDg5OTZfMTE0NmJkZThiZWE5NjRhNWVkMDc0ZDM2M2IyMDY4NDFlO","publish_date":"2025-10-15 23:40:37","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.23},{"id":369629036,"title":"Trump confirms CIA authorization in Venezuela","text":"U.S. President Donald Trump confirmed reports on Wednesday (October 15, 2025) that he authorized the CIA to conduct covert operations in Venezuela, marking a sharp escalation in U.S. efforts to pressure President Nicolas Maduro's government.\n\nThe New York Times first reported the classified directive, citing U.S. officials familiar with the decision.\n\nMr. Trump said he authorized the action because large amounts of drugs were entering the United States from Venezuela, much of it trafficked by sea.\n\n\"We are looking at land now, because we've got the sea very well under control,\" Mr. Trump said.\n\nMr. Trump was asked why he did not have the Coast Guard stop suspected drug trafficking boats, which has been U.S. practice for decades. Mr. Trump called such efforts \"politically correct\" and said they had not worked.\n\n\"I think Venezuela is feeling heat,\" Mr. Trump said, although he declined to answer when asked if the CIA has the authority to execute Maduro.\n\nMr. Trump also accused Venezuela of releasing large numbers of prisoners, including individuals from mental health facilities, into the United States, although he did not specify which border they were crossing.\n\nNeither Maduro's Information Ministry nor press representatives for opposition leader Maria Corina Machado immediately responded to requests for comment on Trump's remarks.","summary":"Trump said he authorized the action because large amounts of drugs were entering the United States from Venezuela, much of it trafficked by sea.","url":"https://www.thehindu.com/news/international/trump-confirms-cia-authorization-in-venezuela/article70169456.ece","image":"https://th-i.thgim.com/public/incoming/7krxzf/article70169581.ece/alternates/LANDSCAPE_1200/2025-10-15T212650Z_617825239_RC2LCHAN3BV1_RTRMADP_3_USA-TRUMP.JPG","video":null,"publish_date":"2025-10-15 23:38:57","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.143},{"id":369625622,"title":"Zohran Mamdani Turns Fox Interview Into 'Message' For Trump: 'I Won't Call You To...'","text":"Democratic mayoral candidate Zohran Mamdani used his Fox News interview to respond directly to US President Donald Trump, who has repeatedly called him a “communist” and questioned his work experience. The exchange came just a day before the first New York City mayoral debate, where Mamdani will face Andrew Cuomo and Curtis Sliwa. Appearing on The Story with Martha MacCallum, Mamdani looked straight into the camera to address Trump’s remarks that he’s “never worked a day in his life.” “I will not be a mayor like Mayor Eric Adams who will call you to figure out how to stay out of jail,” he said. “I won’t be a disgraced governor like Andrew Cuomo who will call you to ask how to win this election. I can do those things on my own. I will, however, be a mayor who is ready to speak at any time to lower the cost of living. That’s the way that I’m going to lead the city,” he added. During the interview, he tackled several controversial topics expected to arise during the debates, including his past comments about the NYPD. Mamdani apologized for calling officers “racist” and “wicked” in social media posts made during the 2020 George Floyd protests, saying his comments came from anger and grief. He also reaffirmed his controversial promise to order the NYPD to arrest Israeli Prime Minister Benjamin Netanyahu if Netanyahu visits New York City, insisting he would “exhaust every legal option” to do so. When pressed by MacCallum on whether Hamas, a US-designated terrorist group, should “lay down their arms” following the Gaza ceasefire, Mamdani avoided taking a direct stance. “I don’t really have opinions about the future of Hamas and Israel beyond the question of justice and safety,” he said. “Anything that happens must abide by international law, that applies to Hamas, the Israeli military, or anyone else,” he added. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Democratic mayoral candidate Zohran Mamdani directly addressed Donald Trump’s criticism during a Fox News interview, saying he won’t be a “disgraced governor like Andrew Cuomo” or a “mayor like Eric Adams.”","url":"https://www.timesnownews.com/world/us/us-news/zohran-mamdani-turns-fox-interview-into-message-for-trump-i-wont-call-you-to-article-153007318","image":"https://images.timesnownews.com/thumb/msid-153007331,thumbsize-562485,width-1280,height-720,resizemode-75/153007331.jpg","video":null,"publish_date":"2025-10-15 23:38:24","author":"Dimple Singh","authors":["Dimple Singh"],"language":"en","source_country":"in","sentiment":0.064},{"id":369620736,"title":"Federal government to withhold $40M from California for not enforcing trucker English requirements","text":"By JOSH FUNK\n\nTransportation Secretary Sean Duffy said Wednesday he will withhold $40 million from California because it is the only state that is failing to enforce English language requirements for truckers.\n\nAn investigation launched after a deadly Florida crash involving a foreign truck driver who made an illegal U-turn on Aug. 12 found what Duffy called significant failures in the way California is enforcing rules that took effect in June after one of President Donald Trump’s executive orders. California had issued the driver a commercial license, but these English rules predate the crash.\n\nTruckers are supposed to be disqualified if they can’t demonstrate English proficiency, and Duffy said the driver involved in the crash should not have been given a commercial license because of his immigration status. The crash has become increasingly political, with the governors of California and Florida criticizing each other and Duffy highlighting the administration’s immigration concerns in interviews.\n\n“California is the only state in the nation that refuses to ensure big rig drivers can read our road signs and communicate with law enforcement. This is a fundamental safety issue that impacts you and your family on America’s road,” Duffy said.\n\nCalifornia defended its practices in a formal response to the Transportation Department last month, but federal officials weren’t satisfied.\n\nThe office of California Gov. Gavin Newsom quickly pushed back after the announcement Wednesday. Diana Crofts-Pelayo, a spokesperson for the governor, said statistics show that California commercial truck drivers have a lower crash rate than the national average.\n\nBut Duffy said when he announced his concerns in August that California had conducted roughly 34,000 inspections that found at least one violation since the new language standards took effect. But only one inspection involved an English language rules violation that resulted in a driver being taken out of service. And 23 drivers with violations in other states were allowed to continue driving after inspections in California.\n\nThe Transportation Department said that to get this funding reinstated, California must adopt regulations to enforce the English rules and ensure that state inspectors are testing truck drivers’ English skills during roadside inspections and pulling anyone that fails out of service.\n\nIn addition to this English language issue, Duffy has threatened to pull another $160 million from California because of the way the state issues commercial drivers licenses. Duffy significantly restricted who can qualify for those licenses last month.\n\nThree people died when truck driver Harjinder Singh made an illegal U-turn on a highway about 50 miles north of West Palm Beach and a minivan slammed into his trailer, according to Florida’s Highway Patrol. Singh and his passenger were not injured.\n\nHe is being held without bond after being charged with three state counts of vehicular homicide and immigration violations. His lawyer has previously declined to comment on the case.\n\nThe crash received intense scrutiny because of questions about Singh’s immigration status and because investigators said he failed an English proficiency test afterward. Duffy and Florida officials blamed California as well as Washington state for issuing him a commercial driver’s license.\n\nBut California officials said he had a valid work permit at the time. And New Mexico released video of a traffic stop that showed Singh communicating with an officer effectively after he was pulled over there in July.\n\nDuffy, President Donald Trump and Florida Gov. Ron DeSantis have all be trading barbs with Newsom over the crash and whether Singh should have been driving a truck.\n\nNewsom’s office said California followed all the rules when it issued a license for Singh in July 2024, while the federal government confirmed at that time that he was in the country legally.\n\nDuffy and Florida authorities have said Singh, who is from India, entered the country illegally from Mexico in 2018.","summary":"Duffy says truckers are supposed to be disqualified if they can’t demonstrate English proficiency.","url":"https://www.ocregister.com/2025/10/15/deadly-illegal-u-turn-california-english-requirements/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Government_Shutdown_Aviation_54436_c24acb.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-10-15 23:34:46","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.216},{"id":369624630,"title":"MAGA lambasted for deceptive new spin on Republican shutdown","text":"This Saturday, October 18, roughly 2500 No Kings Day protests will, according to organizers, be held in cities all over the United States. The demonstrations are expressing opposition to President Donald Trump's policies and are a follow-up to the No Kings Day protests held four months ago on Saturday, June 14, when the flagship event in Philadelphia reportedly attracted over 100,000 participants.\n\nAllies of Trump, from House Speaker Mike Johnson (R-Louisiana) to Treasury Secretary Scott Bessent, are going out of their way to demonize the No Kings gatherings. Johnson is claiming that the protests are \"Hate America\" events consisting of Hamas supporters and Antifa agitators, but in fact, the June 14 gatherings were much different from the way the House speaker characterized them and drew a wide range of participants — from liberals to centrist Democrats to democratic socialists to right-wing libertarians and Never Trump conservatives.\n\nNow, Bessent has a new talking point against the No Kings protests and is blaming them for the partial shutdown of the federal government, which has been going on for half a month.\n\nThe New Republic's Edith Olmsted, in an article published on October 15, reports, \"Republicans are rushing to recast upcoming protests against President Donald Trump as anti-American rallies that are somehow prolonging the government shutdown. During an interview on CNBC Wednesday, Treasury Secretary Scott Bessent blamed the Democrats for a lack of movement on reopening the federal government, claiming that they were waiting to move until after the 'No Kings Day' rally planned for October 18 opposing the (Trump) Administration's authoritarian tilt.\"\n\nBessent told CNBC, \"No Kings equal no paycheck.\"\n\nJohnson, at a press conference, told reporters, \"Let’s see who shows up for that. I bet you see pro-Hamas supporters. I bet you see antifa-types. I bet you see the Marxists in full display. The people who don't want to stand and defend the foundational truths of this republic, and that’s what we're here doing every single day.\"\n\nBessent's claim that the No Kings protests are to blame for the shutdown is generating a lot of comments on X, formerly Twitter.\n\nKrassenCast's Brian Krassenstein tweeted, \"You hear that America? Scott Bessent just said that 'no kings equal no paycheck.' Seems pretty pro kings to me.\"\n\nX user Pramod Sharma wrote, \"Bessent's 'no kings, no paychecks' remark is a cynical deflection from the administration's shutdown failures, undermining protest rights and distorting reality. It's a troubling prioritization of politics over governance. #NoKings #GovernmentShutdown.\"\n\nNew Jersey resident Kimberly Clem posted, \"Now they're blaming the shutdown on the NO KINGS PEACEFUL PROTESTS?? Seriously, f— these lying m— and RELEASE THE TRUMPSTEIN FILES!!\"\n\nX user Maddened Ranter commented, \"Such BS. The rally has nothing to do with the shutdown. It was planned months ago. @SecScottBessent always lies. It's not crazy to protest a president who clearly wants to be a dictator and king. That is not what the US is about.\"\n\nAnother X user, Mark Cavanaugh, wrote, \"The two events are not connected but these GOP ghouls certainly seem scared by the No Kings rallies. Funny since NO KINGS is a founding principle of our government.\"s\n\nRead Edith Olmsted's full article for The New Republic at this link.","summary":"This Saturday, October 18, roughly 2500 No Kings Day protests will, according to organizers, be held in cities all over the United States. The demonstrations are expressing opposition to President Donald Trump's policies and are a follow-up to the No Kings Day protests held four months ago on Saturday, June 14, when the flagship event in Philadelphia reportedly attracted over 100,000 participants.\n\nAllies of Trump, from House Speaker Mike Johnson (R-Louisiana) to Treasury Secretary Scott Bessent, are going out of their way to demonize the No Kings gatherings. Johnson is claiming that the protests are \"Hate America\" events consisting of Hamas supporters and Antifa agitators, but in fact, the June 14 gatherings were much different from the way the House speaker characterized them and drew a wide range of participants — from liberals to centrist Democrats to democratic socialists to right-wing libertarians and Never Trump conservatives.\n\nNow, Bessent has a new talking point against the No Kings protests and is b","url":"https://www.alternet.org/no-kings-shutdown-bessent-johnson/","image":"https://www.alternet.org/media-library/image.jpg?id=60938719&width=1200&height=600&coordinates=0%2C268%2C0%2C268","video":null,"publish_date":"2025-10-15 23:29:51","author":"Alex Henderson","authors":["Alex Henderson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.288},{"id":369625602,"title":"How Trump Changed Republicans’ Shutdown Game","text":"There’s no end in sight for the current government shutdown, which entered its third week on Wednesday. While Democrats are clinging to their $1.5 trillion demands—and Republicans, for once, are refusing to capitulate—there has been a palpable shift in the government shutdown state of play. This week, Rep. Mike Haridopolos, R-Fla., joins “The Signal Sitdown” to discuss the evolving dynamics of shutdown politics.\n\n“Historically it should be a surprise,” that Democrats have opted to shut down the government, Haridopolos told The Daily Signal. “The Democrats historically have always got along with a clean [continuing resolution],” he added. That’s especially the case in recent history, as Democrats have voted upwards of a dozen times for a nearly identical continuing resolution that kept the government open and running on spending levels set during former President Joe Biden’s administration. \n\nTo add insult to injury, the continuing resolution that would last through Nov. 21 was negotiated by Republican and Democrat appropriators. “We negotiated this ahead of time,” Haridopolos told The Daily Signal. “[House Appropriations Chairman] Tom Cole sat down, of course, with the House appropriators and Democrat appropriators, and said, ‘We’re going to have a clean [continuing resolution], what else do you need? We want to do it till January.”\n\nDemocrats, however, wanted the continuing resolution to expire in November. “We acquiesced and said, ‘Okay, fine, November 21,’” Haridopolos continued. “We negotiated. So this drama about ‘They never had a seat at the table’ is wrong.”\n\nDemocrats went on to reject the continuing resolution because, in Haridopolos’s telling, “the modern Democrat Party is clearly being held hostage by the more left-wing, if not super left-wing, part of their party.”\n\n“It’s a ransom note,” the Florida congressman added.\n\nIn years past, it’s very possible Republicans would have already caved to the Democrats’ ransom demands—but not this time. “I’m glad to see we’re not budging. We shouldn’t budge because we won the election,” Haridopolos argued. “The American public spoke very clearly. They want to reform some of these broken programs, and the Democrats seem to act like they won the 2024 election. They did not, and I’m glad to see we’re digging in.”\n\nThat strategy is paying dividends for Republicans. A recent YouGov/Economist poll found that, in the past week, the public’s sentiment on who will likely be blamed for the shutdown has moved 5 points in Republicans’ favor. It’s a major change in the state of play, even if Senate Democrats are not yet turning on Senate Majority Leader Chuck Schumer and reopening the government because polling at the beginning of the shutdown saw Republicans underwater by double digits.\n\nPresident Donald Trump has been the difference maker. “It’s so important to have that unified mouthpiece,” Haridopolos told The Daily Signal.\n\n“I mean, Obama won the shutdowns before because he had a unified voice. Even Clinton before that,” Haridopolos said, reflecting on past shutdowns. “It’s really important to have the president there… he has been such a remarkable leader.”\n\nTrump has kept the Republican messaging unified and on target, the congressman said. The president has “expos[ed] life is about choices.”\n\n“One group wants to give away health care to a non-citizen for free,” Haridopolos claimed, “while citizens, hardworking citizens, are paying $1,500 a month, $18,000 a year.”\n\n“It’s about choices,” Haridopolos added. “Pick your team.”\n\n“When the other team’s saying it’s $1.5 trillion, or we keep the government shut down, I think everyday citizens say, ‘I don’t think these guys are on our team,’” the Florida congressman concluded. \n\nThe president has created the contrast, but Republicans still need to use that leverage to end the government shutdown.","summary":"There’s no end in sight for the current government shutdown, which entered its third week on Wednesday. While Democrats are clinging to their $1.5 trillion... Read More\n\n\nThe post How Trump Changed Republicans&#8217; Shutdown Game appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/10/15/how-trump-changed-republicans-shutdown-game/","image":"https://www.dailysignal.com/wp-content/uploads/2025/10/Untitled-1.gif","video":null,"publish_date":"2025-10-15 23:27:47","author":"Bradley Devlin","authors":["Bradley Devlin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.433},{"id":369624628,"title":"Trump's latest 'mad king presser' was more 'power crazed than usual': analysis","text":"On an episode of The New Republic's \"Daily Blast\" podcast, host and journalist Greg Sargent speaks with fellow journalist Brian Beutler on how President Donald Trump seems \"more crazed and power-mad than usual\" in his Tuesday press conference.\n\nReferring to Trump's refusal to take a question from an ABC reporter because of an interview with Vice President JD Vance that went badly, the Pentagon requiring media to sign a pledge in exchange for curated coverage, and his threats to cut funds off from New York City if mayoral candidate Zohran Mamdani wins, Sargent says, \"Trump is clearly emboldened in a new kind of way.\"\n\nBeutler agrees, saying, \"And now they’re having hissy fits at reporters who want better, clearer, fuller answers from the administration about what actually happened there.\"\n\nReferring to Sunday's interview with Vance, when host George Stephanopoulos cut the interview when the vice president refused to answer his question about a $50,000 bribe that border czar Tom Homan reportedly may have accepted, and then a $16 million settlement that Trump was able to \"extort\" from the network when Stephanopoulos said Trump was \"liable for rape\" of writer E. Jean Carroll, the president \"went out of his way to attack ABC\" at Tuesday's presser. \n\n\"So Brian, what we’re really seeing here is that the $16 million extortion payment didn’t buy anything in return,\" Sargent said to Beutler. \"Trump is again attacking them for asking questions that displease him.\"\n\nBeutler replied, saying, \"every outlet that has paid a price has then gone on to be embarrassed,\" noting that media has to choose whether or not to be Trump's \"lapdog.\"\n\n\"The Washington PostThe Washington Post, I feel like, is the poster child for this,\" Beutler says. They have not gone all the way toward sheer pro-Trump propaganda, but they’ve gone about halfway—and it’s cost them essentially everything.\"\n\nIn reference to Trump's taunting of Time Magazine for posting an unflattering picture of him to go with a glowing Gaza review of him by tech titan Marc Benioff, Sargent says, \"That confidence is almost bottomless. It’s endless.\"\n\nBeutler offered his own take, saying Trump's confidence is \"hilarious,\" and that he \"he looks—he sounds ridiculous. He sounds like a baby, you know?\"\n\nSargent says that Trump's short-lived victory in the Middle East has further emboldened him, saying, \"I think what’s going on here, he’s come back from the Mideast thinking he’s a world historical figure now . . . and it's ’s emboldened him to be even more of a mad dictator.\"\n\nBeutler doesn't think Trump is delusional, but he does think that he knows he's not the greatest. \"I think Trump is as much convinced of his own greatness as he is aware of his own mediocrity,\" he said.\n\n\"He knows that none of this is real—that he’s just trying to put on the best show possible to make him seem like a real-deal peacemaker, kingmaker, all-powerful figure—but that it’s all smoke and mirrors, ultimately,\" Beutler added.","summary":"On an episode of The New Republic's \"Daily Blast\" podcast, host and journalist Greg Sargent speaks with fellow journalist Brian Beutler on how President Donald Trump seems \"more crazed and power-mad than usual\" in his Tuesday press conference.\n\nReferring to Trump's refusal to take a question from an ABC reporter because of an interview with Vice President JD Vance that went badly, the Pentagon requiring media to sign a pledge in exchange for curated coverage, and his threats to cut funds off from New York City if mayoral candidate Zohran Mamdani wins, Sargent says, \"Trump is clearly emboldened in a new kind of way.\"\n\nBeutler agrees, saying, \"And now they’re having hissy fits at reporters who want better, clearer, fuller answers from the administration about what actually happened there.\"\n\nReferring to Sunday's interview with Vance, when host George Stephanopoulos cut the interview when the vice president refused to answer his question about a $50,000 bribe that border czar Tom Homan reportedly may have accept","url":"https://www.alternet.org/mad-king-presser/","image":"https://www.alternet.org/media-library/image.jpg?id=61637681&width=1200&height=600&coordinates=0%2C468%2C0%2C468","video":null,"publish_date":"2025-10-15 23:26:11","author":"Lesley Abravanel","authors":["Lesley Abravanel"],"language":"en","source_country":"US","sentiment":-0.271},{"id":369622900,"title":"Transportation secretary withholding $40M from California for not enforcing English proficiency in truckers","text":"Transportation Secretary Sean Duffy said Wednesday he will withhold $40 million from California because it is the only state that is failing to enforce English language requirements for truckers.\n\nAn investigation launched after a deadly Florida crash involving a foreign truck driver who made an illegal U-turn on Aug. 12 found what Duffy called significant failures in the way California is enforcing rules that took effect in June after one of President Donald Trump’s executive orders. California had issued the driver a commercial license, but these English rules predate the crash.\n\nTruckers are supposed to be disqualified if they can’t demonstrate English proficiency, and Duffy said the driver involved in the crash should not have been given a commercial license because of his immigration status. The crash has become increasingly political, with the governors of California and Florida criticizing each other and Duffy highlighting the administration’s immigration concerns in interviews.\n\n“California is the only state in the nation that refuses to ensure big rig drivers can read our road signs and communicate with law enforcement. This is a fundamental safety issue that impacts you and your family on America’s road,” Duffy said.\n\nCalifornia defended its practices in a formal response to the Transportation Department last month, but federal officials weren’t satisfied.\n\nThe office of California Gov. Gavin Newsom quickly pushed back after the announcement Wednesday. Diana Crofts-Pelayo, a spokesperson for the governor, said statistics show that California commercial truck drivers have a lower crash rate than the national average.\n\nBut Duffy said when he announced his concerns in August that California had conducted roughly 34,000 inspections that found at least one violation since the new language standards took effect. But only one inspection involved an English language rules violation that resulted in a driver being taken out of service. And 23 drivers with violations in other states were allowed to continue driving after inspections in California.\n\nThe Transportation Department said that to get this funding reinstated, California must adopt regulations to enforce the English rules and ensure that state inspectors are testing truck drivers’ English skills during roadside inspections and pulling anyone that fails out of service.\n\nIn addition to this English language issue, Duffy has threatened to pull another $160 million from California because of the way the state issues commercial drivers licenses. Duffy significantly restricted who can qualify for those licenses last month.\n\nThree people died when truck driver Harjinder Singh made an illegal U-turn on a highway about 50 miles (80 kilometers) north of West Palm Beach and a minivan slammed into his trailer, according to Florida’s Highway Patrol. Singh and his passenger were not injured.\n\nHe is being held without bond after being charged with three state counts of vehicular homicide and immigration violations. His lawyer has previously declined to comment on the case.\n\nThe crash received intense scrutiny because of questions about Singh’s immigration status and because investigators said he failed an English proficiency test afterward. Duffy and Florida officials blamed California as well as Washington state for issuing him a commercial driver’s license.\n\nBut California officials said he had a valid work permit at the time. And New Mexico released video of a traffic stop that showed Singh communicating with an officer effectively after he was pulled over there in July.\n\nDuffy, President Donald Trump and Florida Gov. Ron DeSantis have all be trading barbs with Newsom over the crash and whether Singh should have been driving a truck.\n\nNewsom’s office said California followed all the rules when it issued a license for Singh in July 2024, while the federal government confirmed at that time that he was in the country legally.\n\nDuffy and Florida authorities have said Singh, who is from India, entered the country illegally from Mexico in 2018.","summary":"Transportation Secretary Sean Duffy said Wednesday he will withhold $40 million from California because it is the only state that is failing to enforce English language requirements for truckers.","url":"https://nypost.com/2025/10/15/us-news/transportation-secretary-withholding-40-million-from-california-for-not-enforcing-english-proficiency-in-truckers/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/113534491.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/yFRYQIWx-RyIcpnTz.mp4","publish_date":"2025-10-15 23:23:24","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.212},{"id":369625576,"title":"Oct. 7 is ‘indicative of a larger indoctrination problem’: Former Pentagon official","text":"to top close Video This video is playing in picture-in-picture.\n\nOn Air October 15, 2025 02:10 \n\n Oct. 7 is ‘indicative of a larger indoctrination problem’: Former Pentagon official \n Former Pentagon official Alex Plitsas weighs in on some members of the Left reluctant to credit President Donald Trump for his work on the Gaza peace deal and more on 'The Will Cain Show.'\n Tags SHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE WILL CAIN SHOW LATEST VIDEOSV-VIDEODONALD TRUMPWORLDCONFLICTS","summary":"Former Pentagon official Alex Plitsas weighs in on some members of the Left reluctant to credit President Donald Trump for his work on the Gaza peace deal and more on &apos;The Will Cain Show.&apos;","url":"https://www.foxnews.com/video/6382818735112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/66bb40b4-92bc-4a21-b2cd-2d923ff0b310/29423335-85a5-4948-8d57-807b33cf5e85/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-10-15 23:22:13","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.399},{"id":369625642,"title":"Daylight Saving Time Ends Soon — Here’s What Trump Says About Ending The Clock Changes","text":"As Americans prepare to turn back their clocks on Sunday, November 2, President Donald Trump has again voiced frustration with the twice-yearly time change, calling it unnecessary and costly — but also acknowledging that public opinion is too divided for swift reform. “Daylight Saving Time is inconvenient, and very costly to our Nation,” Trump posted on Truth Social in December, pledging that “the Republican Party will use its best efforts to eliminate” the seasonal clock adjustments. The former president and current commander-in-chief has long criticised the clock changes, arguing they disrupt sleep and productivity. Despite his preference to scrap the system, Trump conceded earlier this year that the debate remains evenly split. In comments to Reuters in March, he said: “This should be the easiest one of all, but it’s a 50-50 issue. If something’s a 50-50 issue, it’s hard to get excited.” He added that while many Americans want “more light later,” others prefer brighter mornings for school commutes and work routines, leaving the issue politically deadlocked. Congress Stalls on Permanent Time Plan Efforts to end daylight saving time have repeatedly stalled in Congress, despite growing public fatigue with the semiannual changes. The Sunshine Protection Act, which would make daylight saving time permanent nationwide, passed the Senate in 2022 but never advanced through the House. In April 2025, Trump reiterated his belief that lawmakers should “push for more daylight at the end of the day,” aligning with his earlier 2019 stance supporting permanent DST, according to Politico. However, the White House has not confirmed whether the administration will back any specific legislation during the upcoming session. When Do the Clocks Change? Clocks across most of the country will “fall back” one hour at 2 a.m. local time on Sunday, November 2, 2025, marking the return to standard time. The next Daylight Saving Time period will begin on Sunday, March 8, 2026. Not all states follow the change. Hawaii and most of Arizona remain on standard time year-round, while Florida, California, South Carolina, Washington, Colorado, Tennessee, and Maine have passed legislation to adopt permanent daylight saving time if Congress gives approval. As the seasonal shift nears, experts continue to warn that the time change can affect sleep cycles, accident rates, and energy consumption, fuelling calls from both sides to “pick a time — and stick with it.” Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Daylight Saving Time (DST) will end across most of the United States on November 2, 2025, when clocks “fall back” one hour. The twice-yearly clock change remains a divisive issue, with President Donald Trump expressing support for ending the practice altogether but admitting the country is evenly split.","url":"https://www.timesnownews.com/world/us/us-news/daylight-saving-time-ends-november-2-heres-what-trump-says-about-ending-the-clock-changes-article-153007315","image":"https://images.timesnownews.com/thumb/msid-153007314,thumbsize-30594,width-1280,height-720,resizemode-75/153007314.jpg","video":null,"publish_date":"2025-10-15 23:20:59","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","source_country":"in","sentiment":-0.048},{"id":369625222,"title":"'The View' Co-Host Sunny Hostin Gets in Shouting Match With Cheryl Hines Over Her Husband RFK Jr.'s Qualifications on Live Show — 'May I Finish?'","text":"Tempers flared on The View when ultra-liberal Sunny Hostin began attacking guest Cheryl Hines over her husband, Health and Human Services Secretary Robert F. Kennedy Jr.'s viewpoints, RadarOnline.com can reveal. \n\nThe former federal prosecutor tore into the actress, who was promoting her new memoir Unscripted, to the extent that Hines, 60, had to shout, \"May I finish?\" in response to fighting back against Hostin's claims against RFK Jr.'s alleged lack of qualifications for the cabinet position.Sparks Fly on 'The View'Moderator Whoopi Goldberg initially triggered Hines when she commented about RFK Jr., \"I do want to say, you know, he's not a doctor and he's not a professional.\"\n\nThe Curb Your Enthusiasm star responded, \"Just to be clear, 90% of secretaries of HHS have not been doctors,\" to which Hostin snapped, \"But they've had a science background.\"\n\nHines pointed her finger in the air and countered that \"One of Obama's Secretaries of HHS was an economist.\"\n\nHostin fired back, \"The majority of them that haven't had medical backgrounds have a science background.\"\n\nAs Hines was about to respond, Goldberg, 69, interrupted to take the show to a commercial break. The actress boldly stated that she was ready to counter both women's claims against her husband's qualifications as soon as the taping resumedTempers Flare Between Hostin and HinesTaking a break only heated things up, as Hines picked up her second segment where her first left off. \n\nShe turned to Hostin and explained how RFK Jr. \"dedicated his career\" as an environmental lawyer to suing big companies over toxins that have been \"affecting people's healthcare, people's health.\"\n\nWhile rattling off his other achievements in fighting against cancer-causing chemicals, Hostin interrupted Hines to tell her, \"But the problem respectfully is that your husband is the least qualified Department of Health and Human Services head that we have had in history.\"\n\n\"Less qualified than an economist? How is that possible?\" said a dumbfounded Hines, looking taken aback.'May I Finish?'The Flight Attendant star said about her husband, \"He has spent his career studying toxins, studying people's health. Fighting for one guy who was using Roundup for his job,\" to which Hostin retorted, \"He has also spread a lot of misinformation, a lot of chaos, a lot of confusion. I think it's just a hazardous thing,\" which received a round of applause from the audience. \n\nJoy Behar attempted to cool down temperatures in the room, noting, \"Some of it's good and some of it's not, that's the point,\" and Hines somewhat agreed.\n\n\"Listen, we all have different views here. When you say misinformation, disinformation, we could go back to COVID when...\" she continued as Hostin interrupted her guest to say, \"he connected circumcision to autism.\"\n\nHines had had enough at that point, angrily telling Hostin, \"May I finish?\" \n\nGoldberg hopped in and made it clear their guest was allowed to complete what she wanted to say, and Hines continued with her train of thought.A 'Difficult Decision'Hines and RFK Jr. married in 2014, when both were staunch Democrats. \n\nHowever, the former attorney endorsed Donald Trump's presidential campaign in 2024 after bowing out of the race against Kamala Harris while he was running as an Independent.\n\n\"So with Bobby, that was a very difficult decision to make with President Trump,\" Hines revealed on The View before things went awry. \"At the end of the day, President Trump and Bobby sat down and talked, and yes, they did have a lot of common goals.\"","summary":"Sunny Hostin got into a nasty shouting match with guest Cheryl Hines on 'The View' after calling out her husband RFK Jr's HHS qualifications..","url":"https://radaronline.com/p/the-view-co-host-sunny-hostin-shouting-match-fight-cheryl-hines-rfk-jr/","image":"https://media.radaronline.com/brand-img/WaTstLlXT/0x0/cheryl-hines-defends-rfk-jr-the-view-sunny-hostin-1760566168042.jpg","video":null,"publish_date":"2025-10-15 23:20:00","author":"Beth Shilliday","authors":["Beth Shilliday"],"language":"en","source_country":"us","sentiment":-0.228},{"id":369621748,"title":"US senators express 'profound concern' over EA buyout: 'The proposed transaction poses a number of significant foreign influence and national security risks'","text":"The $55 billion buyout of Electronic Arts by a consortium that includes Saudi Arabia's Public Investment Fund and Jared Kushner's Affinity Partners investment firm has resulted in no small amount of consternation among observers. Much of that arises from the perceived likelihood of a less-than-ideal long-term outcome for EA, its creative output, and its staff—but some elements of the US government are also uncertain about the whole thing for different reasons: In a letter to US treasury secretary Scott Bessent, senators Richard Blumenthal and Elizabeth Warren expressed \"profound concern about the foreign influence and national security risks\" that could result from the takeover.\n\n\"The proposed transaction poses a number of significant foreign influence and national security risks, beginning with the PIF's reputation as a strategic arm of the Saudi government,\" the letter states, all but explicitly pointing the finger at longstanding allegations of \"sportswashing\" being conducted by Saudi Arabia via millions of dollars invested in sports, videogames, and \"other cultural institutions.\"\n\nArguing that these deals aren't just about money, \"they are about influence,\" the senators also note that the agreed purchase price represents a significant and largely unjustified premium over EA's actual value: \"Saudi Arabia's desire to buy influence through the acquisition of EA is apparent on the face of the transaction—the investors propose to pay more than $10 billion above EA's trading value for a company whose stock has 'stagnated for half a decade' in an unpredictably volatile industry.\"\n\nOf course, there's also the matter of Jared Kushner, the son-in-law of current US president Donald Trump, whose Affinity Partners received an investment of $2 billion from the PIF just six months after stepping down as senior advisor to the president in 2021, during Trump's first term. The senators say his role in this deal \"raises troubling questions about whether Mr. Kushner is involved in the transaction solely to ensure the federal government's approval of the transaction,\" adding, \"consistent with the Trump administration's unprecedented corruption and monetization of federal government power, 'What regulator is going to say no to the president's son-in-law?'\"\n\nEven disregarding any potential political shenanigans, the senators say the deal demands scrutiny because of its \"potential to expand and strengthen Saudi foreign influence in the United States.\" EA has a huge user base, from which it has collected (and will continue to collect) a massive trove of personal information over the years—all of which will effectively be at the fingertips of the Saudi government. Furthermore, because EA will be taken private once the deal is concluded, there will be no oversight from the SEC.\n\n\"The unrestricted access to this information by a repressive, authoritarian government poses significant potential risks of surveillance of Americans, covert Saudi propaganda, and selective retaliation and censorship of persons disfavored by the Saudi government,\" the letter states.\n\n\"The PIF's control over EA's operations could extend to influencing or directing the company’s design, features, and product decisions to advance the Saudi government's specific and long-term objectives. PIF would be well positioned to dictate or veto what stories are told to Americans through the popular medium of video games, controlling narratives about US history and culture. In short, the Saudi government's ability to exert its influence through EA would offer the authoritarian regime an effective tool to project power worldwide. As one analyst observed, 'Saudi Arabia clearly recognizes the political and cultural influence of video games, especially among young people'.\"\n\nI want to tap the brakes here for just a minute to ponder the irony. The US has, for generations, leaned heavily into cultural hegemony to exert its influence around the world, in videogames as much as any other medium. (There is no more influential cultural lever than Hollywood, for example.) Americans and their allies are the good guys, even when they're not, a perspective that persists in contemporary videogame storytelling: The notorious Highway of Death massacre as it was depicted in the Call of Duty: Modern Warfare reboot, for instance, was carried out not by Western forces (as happened in real life) but by Russia, while the assassination of Iranian general Qasem Soleimani by US forces, widely regarded as a violation of international law, is instead cool and good in Modern Warfare 2.\n\nIn that light, one might take the senatorial concern about the stories EA will tell once it's in Saudi hands with a pinch of salt. At the same time, though, there's no denying that Saudi Arabia is, as the letter puts it, ruled by an \"oppressive, authoritarian government\" with a grim record on human rights, whose de facto ruler (and PIF chairman) is widely believed to have ordered the murder of journalist Jamal Khashoggi in 2018.\n\nWhich, say Blumenthal and Warren, is why at the very least this proposed deal warrants a closer look. They're calling for a \"thorough investigation\" of the buyout by the Committee on Foreign Investment in the United States, particularly with an eye to ensuring the PIF and Saudi government don't misuse personal information belonging to American customers, gain access to sensitive technologies (in particular artificial intelligence), or \"use its control of EA to take action to impair US national security.\"\n\nObservations about the situational application of soft power aside, I think the concerns expressed by Blumenthal and Warren are valid. Whether the EA deal will face any meaningful challenge is an open question, though: Blumenthal and Warren are both Democrats, for one thing, the party recently described by Trump deputy chief of staff for policy Stephen Miller as a \"domestic extremist organization,\" in case you were holding out hope for bipartisan cooperation on the matter. Bessent, the secretary of the treasury, is a stalwart backer of Donald Trump, while FTC chair Andrew Ferguson, who was appointed to the head of the agency by Trump, has indicated that he will be less aggressive in scrutinizing mergers than his predecessor, Lina Khan, who recently pointed out that everything she predicted about Microsoft's acquisition of Activision-Blizzard is coming true.","summary":"Whether it adds up to anything remains to be seen, but Elizabeth Warren and Richard Blumenthal are big mad about it.","url":"https://www.pcgamer.com/gaming-industry/us-senators-express-profound-concern-over-ea-buyout-the-proposed-transaction-poses-a-number-of-significant-foreign-influence-and-national-security-risks/","image":"https://cdn.mos.cms.futurecdn.net/iS7NvTFdqRZsdbUMZJocTX-2560-80.png","video":null,"publish_date":"2025-10-15 23:17:51","author":"Andy Chalk","authors":["Andy Chalk"],"language":"en","category":"politics","source_country":"us","sentiment":0.032},{"id":369616202,"title":"How experts say Zohran Mamdani can earn the NYPD's trust","text":"A productive relationship with the NYPD is still within mayoral front-runner Zohran Mamdani’s reach, law enforcement experts and former NYPD officers and executives from across the political spectrum told Gothamist, rejecting the notion that Mamdani has irreparably alienated the force.\n\nFor months, Mamdani’s critics and opponents have seized on his prior statements calling for a reduction in NYPD officers and labeling the department as “racist, anti-queer and a major threat to public safety,” even though he has since walked back all those remarks.\n\nWhile experts acknowledged that many officers will view Mamdani skeptically, they added that he could make inroads in the department by appointing a competent commissioner, listening to officers’ needs and overhauling responses to emergency mental health calls.\n\nMamdani’s relationship with the NYPD will be critical to safety in the city and his success in office. New York City voters consistently rank public safety as a top issue in polls, and discontent or upheaval in the department could signal dysfunction in a key city agency. The stakes are even higher as President Donald Trump has threatened to deploy the National Guard and federal law enforcement officers to New York City, as he has done in other cities, including Portland, Oregon, and Washington, D.C.\n\nNot a monolith\n\nAlthough Mamdani's critics and opponents have warned that his election could spur a mass exodus of NYPD officers, experts and former department executives said they expect a more mixed response.\n\nIt will take work to overcome public skepticism over Mamdani's past statements about the department, according to Rodney Harrison, who served as chief of department and chief of detectives under former Mayor Bill de Blasio. Harrison has publicly expressed support for some of Mamdani’s public safety proposals.\n\n“It's going to be a little bit of an uphill battle,” Harrison said.\n\n“He could definitely rebound from it,” he added. “But his actions have to be shown, and some of the actions have to be, you know, talking about the heroic work that the men and women of law enforcement do on a regular basis.”\n\nLiz Glazer, a former federal prosecutor and head of the office of criminal justice under de Blasio, said the notion that there is an inherent friction between officers and Mamdani is overblown.\n\n“ The police department is not a monolith,” Glazer said. “It's an incredibly diverse department, which is now majority-minority … it really reflects the diversity of the city.”\n\nSal Greco, a conservative former NYPD officer who now hosts a podcast about the department, also cast doubt on the possibility of a mass exodus of NYPD officers if Mamdani is elected.\n\n“That's never happened before,” Greco said in an interview. “ I think if you took a poll, I don't think they would want Mamdani to be the mayor. I think they want someone who's pro-law enforcement, like Curtis Sliwa. But they'll just deal with whoever is the mayor. It's not going to make or break their career.”\n\nEffective leadership\n\nThe experts and former officers who spoke to Gothamist said if Mamdani is elected, his choice for commissioner will be crucial in maintaining a strong relationship with the department.\n\nIf elected, Mamdani will inherit a department that for years was beset by allegations of corruption and cronyism during the administration of Mayor Eric Adams, and which has begun to rebound under Commissioner Jessica Tisch's leadership.\n\nThe allegations of corruption and cronyism have worsened morale in the department, Glazer said.\n\n“It's not as if it's a worker's paradise right now,” Glazer said of the NYPD. “Part of that has to do with the fact that the department was run on a friends and family plan for many years under Adams.”\n\n“There is nothing more demoralizing to cops who want to do a good job, which is pretty much the whole department, than to see those kinds of shenanigans take place,” she added.\n\nIn recent years, the department has struggled with retaining police officers for a host of reasons, including long hours and the offer of better pay at nearby departments. The stress has also weighed on police officers, according to the union that represents rank-and-file cops.\n\n“Our members are exhausted from chronic understaffing, frustrated by the dysfunction in our justice system and burned out by a climate of second-guessing and demonization,” Police Benevolent Association President Patrick Hendry said in a statement.\n\n“Fixing these issues will require sustained engagement with police officers and a willingness to stand up to the extremists who want to abolish our entire profession. That is our priority, and it will remain our priority no matter who is in City Hall,” he added.\n\nHarrison said acknowledging these challenges is important to officers.\n\n“The difficulty in being a cop in the city is, unfortunately, seeing people commit violent crimes over and over again. The recidivism is a big issue,” he said.\n\nAccording to numbers compiled by Vital City, recidivism has increased in the city during the Adams administration, and has nearly doubled for violent crimes on the subway.\n\nHe added that police officers want to hear from politicians that people who commit violent crimes are being held accountable.\n\nDepartment of Community Safety\n\nMonths ago, Mamdani met with members of the NYPD in a meeting set up by Shamsul Haque, a former lieutenant commander who was initially skeptical of Mamdani but has since endorsed him.\n\nHaque told Gothamist that Mamdani won him over partly because of his plan for a Department of Community Safety. If Mamdani can execute it, the plan would further limit the number of 911 calls police officers respond to for homelessness and mental health emergencies. Many of those calls would instead be assigned to mental health professionals and clinicians, instead of police officers, according to his campaign.\n\nBoth Haque and Harrison said the overhaul of policies could face opposition at first, as is usually the case. Haque pointed to the rollout of body-worn cameras for officers during the de Blasio administration, which officers initially viewed skeptically, but now support.\n\n“ Any time you put a new procedure in place, there’s always a level of concern over how is it going to work,” Harrison said.\n\nBut both added that the idea could become more popular among police officers if they’re responsible for fewer mental health calls.\n\n“This is a management innovation from the side of Mamdani to bring NYPD law enforcement and mental health professionals to the 21st century. And I think that is the right approach,” Haque said. “They will eventually realize it's a good program. And they will accept it.”","summary":"New York City mayoral candidate Zohran Mamdani attends a news conference to address the cost of rent on October 01, 2025 in the Bronx borough of New York City.\n\n\n  \n\nIf Mamdani is elected, experts said he could make inroads by appointing a competent commissioner, listening to officers’ needs and overhauling responses to emergency mental health calls [ more › ]","url":"https://gothamist.com/news/how-experts-say-zohran-mamdani-can-earn-the-nypds-trust","image":"https://api-prod.gothamist.com/images/353659/fill-1200x800|format-webp|webpquality-85/","video":null,"publish_date":"2025-10-15 23:16:50","author":"Ben Feuerherd","authors":["Ben Feuerherd"],"language":"en","category":"politics","source_country":"us","sentiment":0.019},{"id":369625640,"title":"What Does 'Remigrate' Mean? Term Used by Trump DHS To Promote Voluntary Self‑Deportation","text":"The Department of Homeland Security sparked backlash this week after it posted a single word, \"Remigrate,” from its official X (formerly Twitter) account, linking to a government site promoting voluntary self-deportation. The post, which racked up over 5 million views, was seen by critics as a sign of the Trump administration’s growing embrace of far-right terminology to signal tougher immigration enforcement. Civil rights groups and immigration advocates condemned the language, warning that the term “remigration” is deeply tied to extremist ideology, particularly in Europe. What Does Remigrate Mean? In European far-right circles, remigration refers not simply to voluntary returns but to mass deportations, often along racial or ethnic lines. The concept has been pushed by Austrian activist Martin Sellner, who helped popularize the term as a euphemism for ethnic cleansing. Sellner, once a leader in Austria’s Identitarian Movement, promoted a “master plan” for removing immigrants and their descendants, even those born in the country. The word has since been adopted by far-right politicians such as Herbert Kickl in Austria and Alice Weidel, leader of Germany’s Alternative für Deutschland (AfD). In these contexts, remigration typically targets non-white immigrants and is widely condemned by moderates and civil rights organizations across Europe. Now, similar language is appearing in US policy discussions, and being used by official US government accounts. DHS Post Signals Broader Deportation Push The DHS’s use of “remigrate” is not an isolated incident. In May, Axios reported that the State Department was planning to establish an “Office of Remigration” as part of a sweeping internal overhaul under the Trump administration. A department official said the move marked a strategic shift, from aiding refugees to actively removing immigrants. If approved, the office would fall under the Bureau of Population, Refugees, and Migration, a department long known for humanitarian work. But critics say its new role, and name, signals a radical turn in US immigration policy. Political Reaction: Applause and Outrage The DHS post drew strong reactions across the political spectrum. MAGA supporters applauded the move as a long-overdue crackdown on undocumented immigration. But others, including California Governor Gavin Newsom, blasted the post and called out its hypocrisy, noting that former President Donald Trump’s own grandparents were immigrants from Germany and Scotland. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"The Department of Homeland Security used the term “remigrate” in a viral post promoting voluntary self-deportation. The move sparked backlash due to the term’s ties to far-right, racially driven ideologies in Europe.","url":"https://www.timesnownews.com/world/us/us-news/what-does-remigrate-mean-term-used-by-trump-dhs-to-promote-voluntary-selfdeportation-article-153007287","image":"https://images.timesnownews.com/thumb/msid-153007316,thumbsize-1244353,width-1280,height-720,resizemode-75/153007316.jpg","video":null,"publish_date":"2025-10-15 23:12:25","author":"Naman Trivedi","authors":["Naman Trivedi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.259},{"id":369620732,"title":"What to know about deporting family members of US troops","text":"By JESSE BEDAYN\n\nThe deportation of a U.S. Marine’s father in California is bringing new attention to President Donald Trump’s apparent changes to a longstanding policy seeking to protect military families from deportation.\n\nTrump’s new immigration tactics follow years of the military recruiting from immigrant communities to fill out its ranks and touting the immigration benefits for enlistees’ families.\n\nHere’s what to know.\n\nWhat was the policy?\n\nAlong with possible protection from deportation, enlisting in the military often meant deference in your family’s immigration cases and a better shot at a green card.\n\nThose benefits were used by the armed forces to recruit more people, and, as of last year, an estimated 40,000 people were serving in the military without citizenship.\n\nUnder President Joe Biden, U.S. Immigration and Customs Enforcement considered your and your immediate family’s military service as a “significant mitigating factor” when making immigration decisions, such as removal from the country.\n\nThe idea was to boost recruitment and maintain morale, fearing that it could take a hit if a service member’s family was deported.\n\nWhat did the Trump administration change?\n\nThe administration issued a memo in February doing away with the older approach.\n\nIt said that immigration authorities “will no longer exempt” categories of people that had been afforded more grace in the past.\n\nThat included families of service members or veterans, said Margaret Stock, a military immigration law expert.\n\nDo certain crimes void the protections?\n\nThey can, but Stock said there’s no explicit list of convictions that would make someone ineligible for protections and that U.S. Citizenship and Immigration Services can waive factoring in criminal convictions in making an immigration decision.\n\nHave other military members’ families been detained?\n\nYes. A Marine Corps veteran’s wife, who was seeking a green card, was detained in May in Louisiana but a judge barred her removal.\n\nAnd veterans without citizenship are increasingly worried about deportation.\n\nWill this impact recruitment to the U.S. Armed Forces?\n\nStock says it will.\n\nThe military has struggled in the past to meet recruitment numbers.\n\nThat’s partly because there aren’t enough U.S. citizens without immigrant family members to meet the need, said Stock, a retired lieutenant colonel in the military police, U.S. Army Reserve, who taught law at West Point during the presidencies of George W. Bush and Barack Obama.\n\nThe immigration benefits for a recruit and their family were key to expanding the military’s ranks, said Stock, and recruitment would suffer without them.\n\nThe Marine Corps told The Associated Press last month that recruiters have been told that they “are not the proper authority” to “imply that Marine Corps can secure immigration relief for applicants or their families.”","summary":"Previously, service helped protect families from deportation and a better chance of receiving green cards.","url":"https://www.ocregister.com/2025/10/15/military-immigration-changes/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/Military_Immigration_What_to_Know_57503-1.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-15 23:11:35","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.25},{"id":369620730,"title":"ICE sued over removal of survivors of human trafficking, domestic violence","text":"A coalition of legal organizations and undocumented immigrants has filed suit in Los Angeles challenging an ICE policy that authorizes the “routine” jailing and deportation of noncitizen survivors of domestic violence and human trafficking, according to court papers obtained Wednesday.\n\nThe suit filed Tuesday by the Center for Human Rights and Constitutional Law and others contends the policy “violates the very legal protections, crafted by Congress and passed with bipartisan support, that were designed to shield vulnerable adults and children from harm.”\n\nThe plaintiffs also allege in Los Angeles federal court that ICE “routinely imprisons and deports immigrant survivors who have been formally granted the right to remain in the U.S.” and “regularly deports survivors of trafficking and other serious crimes without carrying out the required legal review to determine if they are eligible for protections that Congress specifically created to keep survivors safe from deportation.”\n\nA message requesting comment sent to U.S. Immigration and Customs Enforcement was not immediately answered Wednesday.\n\nAccording to the lawsuit, the government’s practices are harming “vulnerable survivors,” including Yessenia Ruano, who says she came to the United States from El Salvador seeking safety from human trafficking in 2011 and worked as a teacher’s aid in Milwaukee until June 2025, when she says she was forced by ICE to self-deport.\n\nIn compliance with the law, Ruano said she applied for a T Visa, which protects survivors of crimes related to human trafficking, in February while working in Wisconsin, and her attorney requested a stay. ICE denied the stay in March and informed her attorney that if she did not “promptly” return to El Salvador, she would be detained at a forthcoming June check-in with ICE, according to the lawsuit.\n\nRuano returned to her home country with her U.S. citizen children.\n\n“At the first check-in, the agents told me I would be deported,” Ruano said, according to a news release from the plaintiffs in the suit. “They said that if I didn’t go on my own, they would hunt me down and find me, and that I would be separated from my daughters, detained and deported. I was in turmoil, because I also could not face being taken away from my kids and imprisoned.”\n\nTo address the fear that frequently prevents immigrant survivors from seeking help due to the threat of deportation, Congress created the U and T visa programs in 2000 through its renewal of the Violence Against Women Act and the Victims of Trafficking and Violence Protection Act.\n\nThose protection were designed to offer a pathway to permanent status, according to legal organizations focusing on immigration. The lawsuit’s plaintiffs allege the administration of President Donald Trump “is actively denying and unlawfully dismantling these vital protections, all in the service of illegal enforcement actions that ignore the law.”","summary":"The plaintiffs allege that ICE \"routinely imprisons and deports immigrant survivors who have been formally granted the right to remain in the U.S.\"","url":"https://www.ocregister.com/2025/10/15/ice-sued-over-removal-of-survivors-of-human-trafficking-domestic-violence/","image":"https://www.ocregister.com/wp-content/uploads/2025/10/LPT-L-DOWNTOWN-PROTEST-0612-KB19.jpg?w=150&strip=all","video":null,"publish_date":"2025-10-15 23:09:50","author":"City News Service,Gqlshare","authors":["City News Service","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.362},{"id":369620360,"title":"Pennsylvania judge upholds county sheriff’s ICE cooperation agreement","text":"The ACLU, which filed a lawsuit in June, argued that Harran exceeded his authority by signing the agreement without county commissioners’ consent. The court rejected that argument, citing similar findings from a New York appellate decision that found memorandums of understanding like the one at issue to be “unenforceable contracts.”\n\nIn a 13-page decision, Trauger concluded that “none of the Plaintiffs have proper legal standing to bring this action under Pennsylvania law,” adding that even if they could, the memorandum of understanding signed by Harran “is not an enforceable contract and therefore [was] not subject to the approval of the Bucks County Commissioners.”\n\nThe ruling affirms that sheriffs in Pennsylvania are independent constitutional officers who may coordinate directly with federal agencies. Harran’s agreement with ICE allows his deputies to perform certain immigration enforcement functions under federal supervision, part of a long-standing framework known as the 287(g) program.\n\nHarran has said he intends to use the agreement to check the immigration status of people already in custody or those wanted by his office. In a statement posted online, he called the ruling a victory for residents and validation of what he described as a “common-sense” approach to public safety that leverages partnerships and federal resources.\n\n“This decision affirms our ability to use this simple tool to ensure individuals who commit crimes in our county are held fully accountable — regardless of their immigration status,” Harran said.\n\nThe ACLU strongly condemned the decision and vowed to appeal, saying in a statement to the Washington Examiner that it “undermines our values, our laws, and our humanity.”\n\n“This fight is far from over,” said Stephen Loney, senior supervising attorney at the ACLU of Pennsylvania. “It’s unfortunate that the judge in this case failed to appreciate what the law clearly states. The sheriff does not have the authority to sign onto a 287(g) agreement with ICE. We will appeal this decision, and in the meantime, we will continue to work to hold Sheriff Harran accountable for the rule of law.” \n\nThe decision for now is a win for America First Legal, a conservative legal group founded by President Donald Trump’s senior adviser Stephen Miller, which represented Harran in partnership with the law firm Zimolong. AFL said the outcome reinforces that local law enforcement agencies can assist ICE in removing dangerous criminals and ensuring public safety.\n\n“This is a decisive victory for the rule of law and for every law enforcement officer who refuses to bow to political pressure,” said Gene Hamilton, president of AFL. “Radical activists tried to weaponize the courts to stop a sheriff from enforcing the law. The court saw through it.”\n\nHOMELAND SECURITY DEMOCRATS EYE MEASURES TO CONDITION DHS FUNDING TO ICE REFORMS\n\nAFL claimed the case has “sweeping implications,” saying the ACLU and its affiliates “attempted to strip an elected sheriff of his authority to assist federal immigration officials.” \n\nThe group said the court’s ruling “reaffirms that local law enforcement can lawfully work with ICE to remove criminals and keep communities safe.”","summary":"A Pennsylvania judge upheld Bucks County Sheriff Fred Harran’s authority to cooperate with federal immigration authorities on Wednesday, dismissing an American Civil Liberties Union lawsuit that sought to block his participation in a federal enforcement program. Judge Jeffrey Trauger of the Court of Common Pleas of Bucks County ruled that the ACLU’s plaintiffs lacked standing [&#8230;]","url":"https://www.washingtonexaminer.com/news/3848245/pennsylvania-judge-upholds-county-sheriffs-ice-cooperation-agreement/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/ICE.webp?w=696","video":null,"publish_date":"2025-10-15 23:09:36","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","category":"politics","source_country":"US","sentiment":-0.368},{"id":369622904,"title":"The new resistance, Trump’s risky ‘revenge lawfare’ and other commentary","text":"Eye on NY: The New Resistance\n\nThe “new alliance” between New York Attorney General Letitia James and Democratic Socialist mayoral candidate Zohran Mamdani marks them as “the face of the Resistance in the second Trump administration,” sniffs the Washington Examiner’s Byron York. This alliance is “also about the leadership of the Democratic Party”: A Mayor Mamdani won’t compromise on his “pro-Palestinian advocacy” but “might ascend to another level of national leadership,” alongside “anti-Trump governors like California’s Gavin Newsom and Illinois’s JB Pritzker.” However “the alliance between Letitia James, the lawfare warrior, and Zohran Mamdani, the pro-Palestinian activist running the nation’s largest city” proceeds, expect “some unexpected turns as the second generation of Trump resistance goes forward.”\n\nConservative: Trump’s Risky ‘Revenge Lawfare’\n\n“The lawfare Democrats waged against Donald Trump” was “one of the main reasons behind his comeback,” contends The Wall Street Journal’s Gerard Baker yet he still “seems intent on repaying his enemies in kind.” That “moral absurdity,” sadly, “corrupts the legal process, corrodes public faith in civic institutions, and invites further leaps up the partisan warfare escalator.” It’s also “politically unwise”: “Being the object of a dubious, politically inspired lawsuit may be among the best things that could happen” to Trump’s enemies. More broadly, targeting political foes is part of the current constraint-free “personalist system of government.” “Americans don’t seem to care as much as they should about abuses of power. They’ll be less forgiving if they wind up the losers.”\n\nMedia watch: Lefties’ Beloved . . . Dog Torturer\n\nHasan Piker, a Twitch streamer “beloved by the far left for his stupendously bloodthirsty anti-American and anti-Israeli politics,” sits in the “basement of his comfortable Southern California mansion and reads through the news of the day,” observes National Review’s Jeffrey Blehar. Since his views go up when his Siberian husky is on screen, Piker “has attached a shock collar incredibly tightly to his dog’s neck, and he shocks it to keep it in place, in fear.” The public’s reaction to this “vile animal abuse” has been “negative, to say the least.” Evidently “the world will happily tolerate — even elevate — a vicious antisemitic moron” who said that America deserved 9/11, but “it won’t stand for” “a guy who shocks his dog” to make it function as a prop for his podcast.\n\nDomestic terror beat: Dems’ Antifa Denial\n\nLike FBI Director J. Edgar Hoover’s “stubborn denial” of the existence of the mafia, Rep. Dan Goldman (D-NY) Democrats “seem to be adopting a Hoover-esque wilful blindness about another violent group: Antifa,” smirks Jonathan Turley at The Hill. The denial “is meant to deflect the discussion of the rising violence on the left,” “even as Antifa deploys its signature black hoodies and masks.” Yet some progressives confess “to having coordinated violent protests with Antifa groups.” Dems may think they’re using “the violent group for political advantage” — but “Antifa is unlikely to have much use for establishment liberals once it gains more power.” For now, “Antifa can count on” Democratic enablers “to give them cover in denying that they exist.”\n\nWall St. review: Sarbanes-Oxley’s Hidden Cost\n\nThe 2002 Sarbanes-Oxley Act “is considered a success” since “no major corporate accounting scandals” have hit since, but its “massive unintended consequences” are “more severe than if existing laws and self-correcting market forces were used to deal with the deceptive accounting” exposed in the Enron, WorldCom, Tyco, Adelphia, etc. scandals, argues Jared Dillian at Reason. The law “is very expensive to comply with, typically costing companies millions of dollars per year, on an ongoing basis, and thousands of man-hours,” which discourages companies from going public. We’ve dropped from more than 6,500 US public companies in the ’90s to about 4,700 today. And companies now don’t go public until they’ve matured, so “most of the gains are captured by venture capitalists and private investors rather than by ordinary investors who might once have bought in shortly after an initial public offering.”\n\n— Compiled by The Post Editorial Board","summary":"The “new alliance” between New York Attorney General Letitia James and Democratic Socialist mayoral candidate Zohran Mamdani marks them as “the face of the Resistance in the second Trump administration,” sniffs the Washington Examiner’s Byron York.","url":"https://nypost.com/2025/10/15/opinion/the-new-resistance-trumps-risky-revenge-lawfare-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/10/new-york-attorney-general-letitia-113430042-e1760567818204.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-10-15 23:02:38","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.277},{"id":369625712,"title":"Live updates, analysis from Detroit mayoral debate between Mary Sheffield, Solomon Kinloch - Detroit Free Press","text":"Detroit City Council President Mary Sheffield and the Rev. Solomon Kinloch, Jr. will face off in a televised mayoral debate Wednesday evening, Oct. 15.\n\nDetroit's WXYZ-TV is hosting the debate at 7 p.m. on Wednesday ahead of the Nov. 4 general election. Viewers also can stream it live online at WXYZ.com, or the station's Facebook and YouTube pages. WXYZ's Editorial Director Chuck Stokes and 7 News Detroit Anchor Carolyn Clifford will host the debate.\n\nFollow our live updates and analysis from the Detroit mayoral debate below.\n\nWhat to do first, as mayor?\n\nSheffield and Kinloch made promises for their first day on the job, including how they would operate their administration.\n\nKinloch, who went first, said he would evaluate leadership to ensure they are “ready to do something courageous and creative” to deliver to Detroiters.\n\n“The second thing I would do is engage Lansing and our federal elected officials in Washington to make sure that we’re coming together, collectively, to deal with a lot of the issues,” said Kinloch, adding he would also convene corporate leaders.\n\n“This should not be a ‘Me’ administration, it should be a ‘We’ administration,” Kinloch said.\n\nSheffield’s immediate plans are to ensure she has the “best and brightest” and most efficient leadership team around her.\n\nShe would also “look at ways to enhance and improve city services. We understand that there are a lot of residents who are complaining about basic quality of life issues that we want to figure out how we can better enhance and address,” along with providing residents better access to city government.\n\n— Dana Afana\n\nRegional transit\n\nBefore the debate, a $40 million investment in passenger rail and intercity bus service was announced adjacent to Michigan Central in Corktown. Candidates were asked what’s needed to continue to improve transit in the city.\n\nSheffield said she would strive to increase frequency and reliability of the system by paying drivers “wages they deserve” and making sure the system is safe. She pledged to build regional partnerships and find innovative options like micro transit shuttles to supplement the city’s bus service. Sheffield also touted her endorsement by the Amalgamated Transit Union Local 26.\n\n“My number one focus is reducing wait times,” Sheffield said.\n\nKinloch said he remembers using buses to traverse the city when he grew up in Detroit. He said students and families are dependent on public transportation to get to school and work. He agreed with the need to pay drivers better and train mechanics to keep buses operational.\n\n“It’s not an option; it's an obligation that we provide reliable transportation,” Kinloch said. “These are issues that have been negated and neglected for a long time, and it should not take us running for mayor to bring attention, weight and gravity to this.”\n\nSheffield said a robust transit system is needed to attract new residents and pledged to invest in the bus system every year to execute the city’s DDOT Reimagined plan.\n\n— Malachi Barrett\n\nBuilding bridges and coalitions\n\nSheffield and Kinloch were asked to prove whether they could work with different political parties and ensure collaborations, and explain how their backgrounds afford them the opportunity to build those relationships.\n\nSheffield pointed to her 12 years on the council, lending her the “privilege to make numerous relationships and connections, whether it’s in the private sector, the corporate sector and with elected officials,” she said.\n\nShe cited the inclusionary housing ordinance to preserve affordable housing as an example of her riding up to Lansing to work across the aisle.\n\n“What I think is most important is during these very politically challenging times is that we need someone who can find common ground, who can put aside differences,” Sheffield said.\n\nKinloch called himself an executive.\n\n“I’m the only one here tonight in this race that is a CEO, has been a CEO. I’ve hired, retained, recruited and developed hundreds of staff members. I have created a budget and had to execute that budget and didn’t have the city’s piggy bank,” said Kinloch, adding he would work with various political parties.\n\nHe also took aim at Sheffield for attempting to smear his campaign. Sheffield called it a “complete distraction” and has “no need to try and tarnish his reputation.”\n\n“Construction doesn’t happen by destruction. You don’t have to tear someone else down to build someone else up but that’s exactly what you’ve been doing,” Sheffield said.\n\nKinloch fired back: “You have attacked my church, you attacked me, you attacked my wife, you attacked every good work we’ve done in this community. And I have not attacked you. This is not the type of leadership this city needs,” Kinloch said.\n\n–Dana Afana\n\n'Never throw stones from a glass house'\n\nKinloch said Sheffield’s inner circle is “populated with individuals that have been found guilty of bribing city officials,” raising suspicions about her commitment to ethical governance. He also raised concerns about her solicitation of concert tickets, claiming she sold them.\n\n“At the end of the day, you can't have that kind of cloud of suspicion over the next mayor of the city of Detroit,” Kinloch said. “We have to be honest and transparent about the stuff that we are hearing. We’ve got to hold my opponent’s feet to the fire.”\n\nSheffield has said she gave Jeezy concert tickets to constituents who worked on community issues in her district. She pointed out that the city’s corporation counsel affirmed she did not violate any ethics rules.\n\nSheffield said Kinloch should “never throw stones from a glass house,” arguing Kinloch purchased his home and other property from Triumph Church.\n\n“You have a myriad of challenges that I would not go into,” Sheffield said. “I think what's most important here is that we continue to move the city forward in a positive way.”\n\n— Malachi Barrett\n\nFighting poverty\n\nFighting poverty is a top concern, particularly among Detroit’s youth. Sheffield recalled her grandmother, who struggled to make ends meet, but always talked about the importance of education.\n\n“I would be a champion for education, from cradle to career, and ensure we are attracting high-wage, livable wage jobs in our city,” Sheffield said. “We have to invest in our people,” she said, pointing to programs such as Skills for Life and Learn to Earn to pay and help people obtain certifications and find jobs.\n\nKinloch said he would initiate the ambitious “Kinloch Promise” trust fund for kids.\n\n“The Kinloch promise will include a children’s trust fund, that every baby in the city of Detroit will receive a seed of $1,000 and it will be allocated on a yearly basis up until that child gets to the age of 18 and they can use that to open up a business, to go into college, to start a career, to buy a home or to invest in their community,” Kinloch said.\n\n– Dana Afana\n\nSheffield continued to criticize Kinloch for being “silent” on important issues until it was time to run for mayor, prompting Kinloch to warn of “the danger of having individuals who are privileged to sit in these seats of power.”\n\nKinloch said Sheffield hasn’t worked with Triumph Church as it distributed laptops and groceries to Detroiters. Sheffield countered that she’s hosted “Occupy the Corner” events where residents can obtain shoes, backpacks, school supplies and coats.\n\nSheffield said Triumph Church’s east campus is in her district but Kinloch has never come to her office or a City Council meeting to raise concerns around housing, property tax reform, infrastructure or transit.\n\n— Malachi Barrett\n\nKeeping Detroit growing and affordable\n\nDetroit’s population has grown after years of decline. Candidates were asked to address how they will continue that growth and ensure Detroit is affordable for residents.\n\n“Housing is a human right and every resident deserves access to safe, quality affordable housing,” said Sheffield, adding that she created the Housing Trust Fund which provides funding for housing units for Detroit’s most vulnerable, along with funding a home repair grant program for seniors and residents with disabilities.\n\nShe also touted the downpayment assistance program.\n\n“We have 700 new first-time homebuyers in that program. We also have to ensure that we have more inclusionary policies in place,” Sheffield said.\n\nKinloch said “it’s amazing” that housing has become more of a hot topic since Kinloch “started discussing it in February…it’s become hot now because the residents have gotten to the point where they said, ‘Enough is enough.’”\n\n“She created the homelessness task force, poverty has gone up and the majority of our kids are still living in poverty… Whatever she’s said tonight that she has done, it has not gone far enough to change the experiences of the people that live in this city,” Kinloch added.\n\n–Dana Afana\n\nHelping Detroit's children\n\nBoth candidates said they believe the mayor has a responsibility to ensure children in Detroit have access to a quality education.\n\nKinloch said he would be an “educational mayor” and hire a chief education officer to partner with the Detroit Public Schools Community District. Kinloch said students should have access to healthy food and mental health resources. He also promoted the work Triumph Church has done to host child mentorship events on Sundays.\n\nSheffield said she will have a liaison working directly with DPSCD and charter schools. She wants to create after-school programs within a two-mile radius of every school, focused on literacy and wraparound services. She wants more residents to take advantage of the Detroit Promise, which offers free post-secondary education for qualified students.\n\nSheffield also jabbed Kinloch for avoiding campaign forums hosted by community groups, claiming he has been “virtually absent this entire campaign with a sense of entitlement.”\n\n— Malachi Barrett\n\nLet's talk about housing\n\nKinloch said he would use a combination of low-interest loans and grants and direct property owned by the Detroit Land Bank Authority to residents so they can rebuild neighborhoods. Kinloch has argued Detroit is a “tale of two cities” where growth is concentrated downtown.\n\nSheffield said Kinloch doesn’t have a sense of what’s happening on the ground in Detroit because he owns a home in Oakland Township.\n\n“While you’ve been building up Southfield, you could have been helping build up Detroit,” Sheffield said. “We know pastors all around the city that have contributed to economic development, who built housing, who helped transform their communities. His church is in my district, and our community wants to know where he's been.”\n\nKinloch said only 5% of federal pandemic relief spending has gone toward neighborhood investments. Sheffield said that’s false, touting investments in commercial corridors along Kercheval, Dexter, East Warren and Livernois.\n\n— Malachi Barrett\n\nKeeping the positive momentum going\n\nOn maintaining Detroit’s post-bankruptcy momentum, Sheffield acknowledged progress made, but said there is still more work to do, including fostering a business-friendly environment, cutting red tape and “making Detroit the best place in America to grow and start a business.\n\n\"We will also ensure that we’re driving property tax reform…a huge barrier to both businesses and residents, and we’re going to ensure we’re investing in our workforce,” Sheffield said.\n\nKinloch said the city has not gone far enough.\n\n“When you look at a budget like Detroit and see just a small portion of those resources have been allocated to people and neighborhoods, people have not been prioritized….we have not prioritized the neighborhoods. No one is trying to tear businesses down, but what we are trying to do is lift the citizens of Detroit up,” Kinloch said.\n\nSheffield pointed out that the city invested in various commercial corridors along Kercheval Avenue, Dexter, East Warren and Livernois, along with approving affordable housing units and investing in city parks.\n\nKinloch fired back, questioning for whom the affordable houses were made.\n\n“Affordable for who? The median income in the city of Detroit is less than $40,000 a year. And you’re telling me you built $1.5 billion in affordable housing? Not for the people that live in the city,” Kinloch said.\n\n–Dana Afana\n\nThe National Guard to Detroit?\n\nCandidates addressed whether they would allow President Donald Trump to deploy National Guard troops in Detroit to help fight crime and enforce immigration policies.\n\nSheffield said she is strongly opposed.\n\n“What we must do is become a national model of how to drive crime down in Detroit…it’s about a coordinated strategy that is rooted in partnerships with our law enforcement agencies and our communities,” said Sheffield, suggesting seeking federal resources to address underlying social issues of gun violence in city, mental health, and launch an office of gun violence prevention to treat gun violence as public health crisis.\n\nKinloch said he would not launch them in a “martial law fashion, but in collaboration in order to make sure we’re protecting soft spots throughout the city of Detroit.”\n\nHe added that Detroiters are looking for “people that go on to fight and stand for them\" and questioned what officials have been doing for the last 12 years.\n\nSheffield hit back, saying “he has the ability to convene…pulling stakeholders together. He’s been absent on every single public safety initiative in the city. We do need more than rhetoric and talk, and slow dance.”\n\nKinloch fired back, saying to Sheffield, “People in this city are not looking for movement, they’re looking for substance, they’re looking for change.\"\n\n– Dana Afana\n\nCrime and safety\n\nThe first question dealt with the disconnect residents experience between declining crime statistics and their feelings of safety in their neighborhoods.\n\nKinloch, who has presided over funerals of children slain by gun violence, said Sheffiled believes residents want “headlines and headlights instead of headway.” He also suggested there’s “fudging of the numbers” with crime data. Kinloch said residents deserve safety and justice.\n\nSheffield said Kinloch has been “completely absent” on providing solutions to violence. She said she’s on the ground advocating for additional funding for Community Violence Intervention programs.\n\n“What we don't need is someone who consistently calls out the problems; we've heard not one solution in his response to how we can address the issue of public safety,” Sheffield said.\n\nSheffield said she would lead a holistic approach to public safety that includes investing in prevention, provide youth employment opportunities, launch the city’s first Office of Gun Violence prevention and expand community policing and mental health resources.\n\n—Malachi Barrett\n\nFirst shots fired\n\nEach candidate was given 90 seconds for opening statements and another 90 seconds for closing statements. Candidates have 1 minute to answer questions and 30 seconds for rebuttals. A random draw determined Kinloch would speak first.\n\nQuestions were generated by WXYZ-TV Channel 7 staff and compiled from listeners.\n\nCandidates are taking questions from reporters gathered in the Channel 7 studio after the debate.\n\nKinloch kicked off by pointing to a failure of institutional politics and leadership, noting “Detroit is at a critical point” due to its poverty rate reaching its highest level since 2017. He repeated that he will ensure children have a pathway to good education and that families can move on from being renters to homeowners.\n\nSheffield opened up by noting that she gave her “entire life” to serving Detroit — while also pointing out that she is the only experienced candidate \"who will be ready on Day 1.\"\n\n“Twelve years ago, as we emerged from bankruptcy, when people and businesses were leaving this city, I made the decision to step up and to serve,” said Sheffield, adding that she, among others, improved city services, reduced crime, invested in parks and home repairs, preserved affordable housing and provided jobs for Detroiters.\n\n—Dana Afana","summary":"Live updates, analysis from Detroit mayoral debate between Mary Sheffield, Solomon Kinloch  Detroit Free Press","url":"https://www.freep.com/story/news/local/michigan/detroit/2025/10/15/detroit-mayor-debate-live-updates-analysis/86704199007/","image":"https://www.freep.com/gcdn/authoring/authoring-images/2025/08/06/PDTF/85538233007-sheffield-kinloch.png?crop=799,449,x0,y0&width=799&height=399&format=pjpg&auto=webp","video":null,"publish_date":"2025-10-15 23:02:03","author":null,"language":"en","source_country":"us","sentiment":0.168},{"id":369618424,"title":"Trump team can’t stop exploiting Charlie Kirk’s death","text":"The Trump administration continues exploiting the death of right-wing activist Charlie Kirk to wage war against freedom of expression.\n\nThe State Department announced Tuesday that it has revoked visas from six people for making comments on social media about Kirk and the hate he spewed. \n\n“The United States has no obligation to host foreigners who wish death on Americans,” the department wrote on X. “The State Department continues to identify visa holders who celebrated the heinous assassination of Charlie Kirk.”\n\nThe action fulfilled threats from President Donald Trump and members of his administration to use the power of the government to silence dissent in the days following Kirk’s killing.\n\nIn one X post, the State Department reshared one of the messages that it found to be offensive. \n\nThe person wrote, “I do not give a fuck about the death of a person who devoted his entire life spreading racist, xenophobic, misogynistic rhetoric.”\n\nAnd in another post, a person described the event where Kirk was lionized by the right as a “racist rally,” adding that Kirk was “white nationalist trailer trash.”\n\nKirk was in fact a racist and misogynist who spent his time as a political commentator and activist promoting bigoted causes and leaders. He also promoted right-wing conspiracy theories and regularly denigrated people based on their gender, sexual orientation, and race.\n\nConservatives have tried to sanitize Kirk’s image since his death, but his comments are well documented and easy to find. Being a bigot was central to his fame and influence.\n\nThe State Department’s announcement came on the same day that Trump posthumously awarded Kirk the Presidential Medal of Freedom, America’s highest civilian honor. \n\nDuring the ceremony, Trump falsely claimed that Kirk was “boldly speaking the truth” at the time of his death.\n\nThe decision to bestow the honor on a bigot echoes Trump’s decision in 2020 to give the medal to conservative radio host Rush Limbaugh, who spent decades spewing hate on the radio. Limbaugh died a few months later in February 2021.\n\nRevoking visas over dissenting speech is in line with Trump’s attempts to squelch voices that he doesn’t agree with. Most notably, the Federal Communications Commission tried to squeeze late-night host Jimmy Kimmel off the airwaves after he made comments about the right’s response to Kirk’s death.\n\nFollowing public outcry, Kimmel returned to massive ratings. Unfortunately for those whose visas have been revoked, they will not have such luck.","summary":"The Trump administration continues exploiting the death of right-wing activist Charlie Kirk to wage war against freedom of expression.\n\n\n\nThe State Department announced Tuesday that it has revoked visas from six people for making comments on social media about Kirk and the hate he spewed. \n\n\n\n\nA photo of Charlie Kirk is seen on a large screen during a memorial on Sept. 21.\n\n\n“The United States has no obligation to host foreigners who wish death on Americans,” the department wrote on X. “The State Department continues to identify visa holders who celebrated the heinous assassination of Charlie Kirk.”\n\n\n\nThe action fulfilled threats from President Donald Trump and members of his administration to use the power of the government to silence dissent in the days following Kirk’s killing.\n\n\n\nIn one X post, the State Department reshared one of the messages that it found to be offensive. \n\n\n\nThe person wrote, “I do not give a fuck about the death of a person who devoted his entire life spreading racist, xenophobic, mi","url":"https://www.dailykos.com/story/2025/10/15/2348770/-Trump-team-can-t-stop-exploiting-Charlie-Kirk-s-death?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1476633/story_image/AP25253675698555.jpg?1757531640","video":null,"publish_date":"2025-10-15 23:00:10","author":"Oliver Willis","authors":["Oliver Willis"],"language":"en","category":"politics","source_country":"US","sentiment":0.205},{"id":369624162,"title":"Opinion: What Brazil can teach us about democracy","text":"That this is remarkable is, in itself, remarkable. In a world where democratic institutions are under attack, Brazil’s judiciary upheld the rule of law. Contrast this with the United States, where President Donald Trump pardoned those who stormed the Capitol in 2021 to overturn the results of their election. Against that backdrop, Brazil’s response stands out.","summary":"Unlike the U.S., Brazil’s judiciary drew a line at election denial. The lesson: Institutions are only as strong as the people behind them.","url":"https://montrealgazette.com/opinion/op_eds/opinion-what-brazil-can-teach-us-about-democracy","image":"https://smartcdn.gprod.postmedia.digital/montrealgazette/wp-content/uploads/2025/10/1016-oped-johnston.jpg","video":null,"publish_date":"2025-10-15 23:00:07","author":"Montreal Gazette","authors":["Montreal Gazette"],"language":"en","category":"politics","source_country":"ca","sentiment":0.232},{"id":369626862,"title":"Tulsi Gabbard Claims Trump Works ‘Tirelessly’ and Never Sleeps as the Internet Calls Him ‘Dozy Don’","text":"Tulsi Gabbard has stepped in to help Donald Trump fight the ‘Dozy Don’ allegations. For the past few weeks, the President has been repeatedly mocked on the internet after he almost nodded off during an important meeting that he called. The Director of National Intelligence has now spoken up, giving props to the “tirelessly” working commander-in-chief while contradicting the allegations.\n\nGabbard has made it a mission to dismiss all rumors of Trump slacking off on the job. The 44-year-old recently appeared on Fox News, where she sang praises of how the President has been giving it his all while “tirelessly” working day and night.\n\nDuring the conversation, the Director of Intelligence noted how the 79-year-old made an 11-hour journey to Egypt and back in his quest to bring peace. Trump was seen signing a declaration of peace alongside other world leaders as a promise to bring peace and end the Israel-Hamas conflict.\n\n“I know somebody made a comment on the plane, you know, [that] he goes on these long trips, these long plane rides,” Gabbard noted. She claimed that the President “doesn’t sleep” on the flights either. “He’s working throughout those flights, hits the ground running, and gets directly to business,” she shared while in conversation with host Jesse Watters.\n\nCNN reporter Kaitlan Collins previously made similar claims on a podcast. “I had a source who said you never want to be on Air Force One on a trip,” she noted on Jason Tatrick’s podcast. The reporter revealed that she had heard that the President is always active and wants to talk to his staff on these flights.\n\n🚨HOLY SMOKES! DNI Tulsi Gabbard says President Trump doesn’t sleep at all on overseas trips:\n“He takes these long trips, long flights, doesn’t sleep, works throughout the flight, hits the ground running, and gets down to business.\nHe’s 79 years old.\npic.twitter.com/D3OwC8hl6b\n— Jack (@jackunheard) October 15, 2025\n\n“He’ll like have them go and wake staff up if they’re asleep because he wants to talk to them,” she added. Attorney General Pam Bondi has previously revealed how nobody can “keep up with him.” While in conversation with Stephen Miller’s wife, Katie, Bondi admitted that she doesn’t know how the President manages to do that.\n\nShe also shared how none of his staff know when he even sleeps. “He’s working all the time, and it’s just constant for him,” the Attorney General revealed. JD Vance is another one of the administration’s members who has testified to Trump’s work ethic.\n\nThe Vice President has spoken about how the President “doesn’t have an off switch.” Vance shared how he has been awoken for discussion at 2 a.m. and again for a second time at 6 a.m.\n\nAs much as the President’s staff finds his dedication to his job commendable, other MAGA supporters have expressed their concern for him. Alex Jones noted how the President might “collapse” if he doesn’t “take his foot off the gas pedal.”\n\nJones also suggested that the 79-year-old take one day every week off to kick back and relax. “If he could just go play golf and watch movies and have some fun—he deserves it,” he added.","summary":"Tulsi Gabbard claims Donald Trump 'doesn't sleep' and is always working while the internet thinks otherwise.","url":"https://www.inquisitr.com/tulsi-gabbard-claims-trump-works-tirelessly-and-never-sleeps-as-the-internet-calls-him-dozy-don","image":"https://www.inquisitr.com/wp-content/uploads/2025/10/Donald-Trump-and-Tulsi-Gabbard-1.jpg","video":null,"publish_date":"2025-10-15 22:56:40","author":"Redeagle Updates/ @spencer Hakimian Via X.com,Vaishnavi Shetye","authors":["Redeagle Updates/ @spencer Hakimian Via X.com","Vaishnavi Shetye"],"language":"en","source_country":"US","sentiment":-0.048}]}