{"offset":0,"number":50,"available":24437,"news":[{"id":263443552,"title":"Black men explain why they ditched Democrats and voted for Trump: ‘He was was authentic with the community’","text":"President-elect Donald Trump doubled his support among black men from last cycle while likely amassing the largest percentage of nonwhite voters for a Republican presidential hopeful since Richard Nixon. \n\nBlack men opted for Trump by about 21%, while black women backed him at 7%, with 12% of black supporters voting for him overall — up from 8% eight years prior, according to Edison Research.\n\nFor black men who shifted to Trump, the change was the culmination of growing dismay over Democrats’ attitude toward them, a rebellion against being pigeon-holed politically due to their race, and broadly warming up to GOP policies. \n\nThere was also a lingering sense that Trump was someone with whom they could relate. \n\n“By the president getting that mug shot, he was able to see through a black man’s eyes,” Duke Tanner, a former undefeated professional boxer whom Trump granted clemency, told The Post.\n\n“He was able to really see through a black man’s eyes at what we go through and [have] been going through for years.”\n\nTanner was arrested at the age of 24 for a drug conspiracy for which he was later convicted and sentenced to life behind bars, a stint that kept him away from his son. He has since penned a book on his journey, \n\n“My son didn’t want to learn how to ride a bike because I wasn’t there to teach him. He wanted me to teach him how to ride a bike — not his uncle, not his grandpa,” Tanner recalled. \n\nBut just over four years ago, Trump intervened and “saved the day,” Tanner recounted. He also credited Trump for helping others in a similar situation by signing the First Step Act, which was aimed at reducing certain federal sentences and reforming the prison system. \n\nPrior to Trump’s presidency, Tanner surmised that he probably would’ve identified more with the Democrats, but he was impressed with the soon-to-be 47th president’s policies. \n\n“As a black person, no matter what, you [were] taught from [when you were] a kid that you were a Democrat,” he reflected.\n\nIf Vice President Kamala Harris had prevailed in the election, she would’ve been the first black female president to win the White House and the second black president overall.\n\nShe had largely steered clear of harping on identity politics and carefully navigated questions about polls suggesting that she was hemorrhaging support from black males and rolled out a suite of policies aimed at courting them, including legalizing marijuana.\n\n“It’s very important to not operate from the assumption that black men are in anybody’s pocket,” Harris said during a National Association of Black Journalists panel in September. \n\nThat sentiment about black voters being expected to be Democrats is something that hits home with a lot of black conservatives. \n\n“I grew up being told that if you’re black you’re a Democrat,” former NFL player Jack Brewer told The Post. \n\n“I was told that only rich people and racists vote Republican.”\n\n“When I supported Trump back in 2016, I lost friends. I had family members stop talking to me. But now these same black people are calling me in 2024 saying, you know, I think you were on to something.”\n\nBrewer, who helms the eponymous Jack Brewer Foundation, also posited that there has been a growing segment of “black men who reject the soft liberalism of figures like Barack and Michelle Obama, Kamala Harris and other left-leaning Democrats who aim to feminize our children and our culture.”\n\nThe shift among black men dovetails with a broader gender gap across racial lines. \n\nHarris scored 53% of women compared to 45% who went for Trump, per Edison Research. Meanwhile, the president-elect nabbed 55% of men compared to Harris’ 42%. \n\nTrump also won a majority of Latino male voters (54%), per the poll. \n\nOn the campaign trail, former President Barack Obama was caught on vi,deo grousing about Harris’ shortcomings among the “brothers” and pondered if they “just aren’t feeling the idea of having a woman as president.” \n\nHis wife, former first lady Michelle Obama, had also begged men to “take our lives seriously.”\n\n“I believe that they were trying to use the guilt trip, and they wanted to pull the race card. But this isn’t about that,” Tanner said of the Obamas’ comments.\n\nT.W. Shannon, the 2024 campaign adviser to Black Men for Trump and Oklahoma’s first African-American speaker of the House, assessed that black voters were a critical pillar of the so-called “Blue Wall” states of Michigan, Pennsylvania and Wisconsin that went for Trump on Tuesday.\n\n“Donald Trump alone gets the credit for going after the black vote like no other Republican. He was honest, offered a real plan, had a record of success his first term, and most importantly was authentic with the community — none of which Kamala could deliver on,” Shannon explained.\n\n“In contrast, Harris showed up at black churches in typical Democrat fashion two weeks before the election, and the only plan she had was abortion on demand for black women and weed shops for black men.”\n\nAs the election postmortems roll in, prominent Democrats are trying to figure out how they hemorrhaged minority male voters.\n\n“I am going to state the obvious here: vilifying voters of color as white supremacists will not attract them back to the Democratic Party. It will drive them further into Trump’s camp,” Rep. Ritchie Torres (D-NY) wrote on X. \n\n“The purpose of politics is not to repel but to attract. Condescension is the most powerful repellant in politics. Voters viscerally resent condescension and will punish you for it at the ballot box.”\n\nDuring the Obama era, some Democratic operatives had felt bullish that demographic destiny could help ensure long-term political dominance as the party seems to have a toehold on minority voters. \n\nNow Republicans are hoping they can continue making inroads with working-class minority voters.","summary":"President-elect Donald Trump doubled his support among black men from last cycle while amassing the largest percentage of nonwhite voters for a Republican presidential hopeful since Richard Nixon.","url":"https://nypost.com/2024/11/07/us-news/black-men-explain-why-they-ditched-democrats-for-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/93224072.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/fMBxYVaF-RyIcpnTz.mp4","publish_date":"2024-11-08 01:09:49","author":"Ryan King","authors":["Ryan King"],"language":"en","source_country":"us","sentiment":-0.241},{"id":263443558,"title":"Moment Labour minister squirms on TV as Question Time audience member bluntly tells her the Budget has 'screwed a lot of people over'","text":"This is the moment Labour's Sarah Jones felt the pressure as a Question Time audience member bluntly told her the Budget had 'screwed a lot of people over'.\n\nThe Minister of State for Industry was grilled on last night's showing as one member of the public asked when working people would feel the benefits of the Budget.\n\n'Quite frankly, you've screwed a lot of people over: pensioners, farmers... and it's alright saying \"make an unpopular decision now\"... but when are we going to feel the benefits because what we don't want is another return to austerity,' he asked.\n\nMs Jones insisted 'there will be no return to austerity' before blaming the last government for inherited finance problems and responding that measures to raise the living wage would immediately help the worst off.\n\nThe Chancellor's monumental October Budget has proven divisive over its tax grab on employers and inheritance, with tens of millions to be set aside for public spending to 'rebuild' Britain.\n\nThe audience member began by acknowledging 'I accept we have had 14 years of sheer incompetence which needs to be fixed' under the last government, receiving a round of applause.\n\nHe then continued 'but surely better decisions could have been made' before listing some of the demographics hit hard by the Budget.\n\n'Many Labour voters will go against you...' he began, before being cut off.\n\n'It's alright saying \"make an unpopular decision now\". Many governments when they come into government make an unpopular Budget. But when are we going to feel...'\n\nMs Jones finished the sentence: 'The benefits, yep.'\n\nShe assured a return to austerity was 'not the plan in the Budget and that is not the long term plan'.\n\n'The second thing I want to say is, I came in as a minister in the Department of Business and Trade.\n\n'It's where the money for the Horizon Scandal was supposed to be. It wasn't there.\n\n'It's where the money for the advanced manufacturing fund: £4.5bn, important to this region... There was no money for that.\n\n'The scale of the problem was significant.'\n\nAnswering his question, she added: 'First, people on the lowest income will get a benefit now because we have increased the living wage to a point where three million people will get a payrise that will be significant and will make a difference.'\n\nFiona Bruce hosted the hour of live debate from Hartlepool, where Sarah Jones, MP for Croydon West, was joined by Matt Vickers MP, Bonnie Greer and Tim Montgomerie.\n\nThe panel also spoke on the election of Donald Trump, prospects for the war in Ukraine, Labour's increase to tuition fees and the effects of the Budget.\n\nMs Jones referenced the OBR's forecast that by the end of the parliament 'there will be growth and people will be getting better off', adding 'we want to beat that'.\n\n'But I understand where you're coming from. As someone who voted Labour it's my job to persuade you that you're better off...'\n\nBonnie Greer, Chancellor of Kingston University, jibed: 'He's got to feel that he's better off - not persuade him!'\n\nLabour's first Budget saw huge changes to tax that it said would raise an additional £36.2bn, or just over 1 per cent of GDP.\n\nAccording to the IFS, this will result in a rise in taxation, as a share of GDP, the second largest of any post-war fiscal event by the end of the decade.\n\nLabour promised going into the election that it would not raise tax on what it called 'working people' if it won.\n\nBut the government was challenged on its definition ahead of the Budget - and after, as employers and farmers felt significant hikes.\n\nThe rate of employers' National Insurance Contributions will rise by 1.2 percentage points to 15 per cent from April 6, 2025.\n\nExperts warn this could be felt by employees, though, as pressure on finances slows wage growth - a key issue for many young people trying to keep up with rising house prices.\n\nChancellor Rachel Reeves urged firms to accept reduced profits rather than squeezing staff wages. \n\nThe Chancellor has since conceded that workers would be hit by the knock-on impact of her Budget, which will raise taxes by £40 billion a year. \n\nShe insisted: 'I said that it will have consequences. It will mean businesses will have to absorb some of this through profits and it is likely to mean that wage increases might be slightly less than they otherwise would have been.'\n\nFarmers also worry they may be put out of business by changes to inheritance tax.\n\nUnder the reforms, the tax will be levied at an effective rate of 20 per cent on the value of business and agricultural assets over £1million - axing a previous exemption. \n\nOutraged farmers have called the move 'bonkers' and warning that unaffordable tax bills faced by the inheritors of family farms will lead to them going under. \n\nFarmers have also contested the claim that it will only affect 'super-wealthy' land owners.\n\nEmma Gray, a shepherdess from Argyll and Bute on the west coast of Scotland, declared the policy 'a disgusting land grab'. \n\n'A lot of family farms are going to go under when they have to pay the death duties,' she said in a TikTok video. \n\n'And you might think a farm being worth £2million sounds like a lot of money, but a lot of the time the person who has the farm has already been paying out siblings who also have a stake in the farm. \n\n'So they spend their whole life paying it off and are ready to pass it on to the next generation - but now they're going to be hit with inheritance tax, which is going to make the whole thing completely unaffordable. \n\nBuilders, electricians and farmers in Britain are also set to be hit by a new stealth tax buried in the Budget.\n\nA new rule set to be introduced by Chancellor Rachel Reeves will classify double-cat pickups - often used by builders, electricians and farmers - as company cars for tax purposes.\n\nThe new rule will start from April 2025, the Sun reports.\n\nCurrently cab pick-ups are treated as good vehicles and which means they are treated as essential tools of the trade allowing for certain tax benefits.\n\nBut under the new rule, they will be categorised as company cars which will come with higher tax implications.\n\nThis change will increase the tax burden on a typical-cab pick up by as much as 211 per year, according to analysis by the Countryside Alliance. \n\nA Nissan Navara Tekna, commonly used by workers, which costs around £33,265, and emits 167g/km of CO2, would see its benefits in kind (BIK) tax rise dramatically—from £3,960 to £12,308.","summary":"The Minister of State for Industry was grilled on last night's Question Time as one member of the public asked when working people would feel the benefits of the Budget","url":"https://www.dailymail.co.uk/news/article-14057519/labour-minister-question-time-budget.html","image":"https://i.dailymail.co.uk/1s/2024/11/08/01/91830911-0-image-a-84_1731027922898.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/01/4567757680520704401/1024x576_MP4_4567757680520704401.mp4","publish_date":"2024-11-08 01:08:37","author":"Editor,James Reynolds","authors":["Editor","James Reynolds"],"language":"en","source_country":"gb","sentiment":-0.367},{"id":263443190,"title":"The Federal Reserve cuts interest rates by a quarter point after election. Here’s what that means for you","text":"The Federal Reserve announced Thursday that it will lower its benchmark rate by a quarter point, or 25 basis points, less than two days after President-elect Donald Trump won the 2024 election.\n\nEconomic uncertainty was a prevailing mood heading into Election Day after a prolonged period of high inflation left many Americans struggling to afford the cost of living.\n\nBut recent economic data indicates that inflation has been falling back toward the Fed’s 2% target, which paved the way for the central bank to trim rates this fall. Thursday’s cut is the second, following a half-point reduction Sept. 18.\n\nThe federal funds rate sets overnight borrowing costs for banks but also influences consumer borrowing costs.\n\nMore from Personal Finance:28% of credit card users are paying off last year’s holiday debtHoliday shoppers plan to spend more while taking on debt2 in 5 cardholders have maxed out a credit card or come close\n\nSince the central bank last met, the personal consumption expenditures price index — the Fed’s preferred inflation gauge — showed a rise of just 2.1% year over year. \n\nEven though the central bank operates independently of the White House, Trump has been lobbying for the Fed to bring rates down.\n\nFor consumers struggling under the weight of high borrowing costs after a string of 11 rate increases between March 2022 and July 2023, this move comes as good news — although it may still be a while before lower rates noticeably affect household budgets.\n\n“The Fed raised rates from the equivalent of the ground floor to the 53rd floor of a skyscraper, now they are on the 47th floor and another rate cut will take us to the 45th floor — the view is not a whole lot different,” said Greg McBride, chief financial analyst at Bankrate.com.\n\nFrom credit cards and mortgage rates to auto loans and savings accounts, here’s a look at how a Fed rate cut could begin to affect your finances in the months ahead.","summary":"The Federal Reserve Building in Washington, D.C. Joshua Roberts &#124; Reuters The Federal Reserve announced Thursday that it will lower its benchmark rate by a quarter point, or 25 basis points, less than two days after President-elect Donald Trump won the 2024 election. Economic uncertainty was a prevailing mood heading into Election Day after a prolonged &#8230;\n\n\nThe post The Federal Reserve cuts interest rates by a quarter point after election. Here&#8217;s what that means for you appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/the-federal-reserve-cuts-interest-rates-by-a-quarter-point-after-election-heres-what-that-means-for-you/","image":"https://image.cnbcfm.com/api/v1/image/107390096-17109471052024-03-20t100145z_1159386497_rc2lp6atrkcn_rtrmadp_0_usa-fed.jpeg?v=1724220830&w=1920&h=1080","video":null,"publish_date":"2024-11-08 01:06:09","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.444},{"id":263443136,"title":"Trump’s victory may affect Nigeria’s inflation – Analyst","text":"It has been projected that the emergence of Donald Trump as the 47th President of the United States of America may worsen inflationary pressure in Nigeria and cause a dip in the global oil prices which will affect Nigeria’s oil revenue.\n\nThis was disclosed Thursday in an investor note from a trading platform, FXTM.\n\nThe note, titled ‘US Elections: Trump wins! What does this mean for Nigeria?’ was authored by a Senior Market Analyst, Lukman Otunuga.\n\nIn the note, Otunuga affirmed that given Trump’s policy direction, Nigeria’s economic climate may be impacted negatively.\n\nHe said, “Trump’s victory may pressure oil prices as he is seen pushing for a further increase in domestic oil and gas production, leading to increased supply in the long term. In addition, his policies could see a boost in US growth – triggering inflationary pressures.\n\n“Should this prompt the Fed to keep interest rates higher for longer, a stronger dollar may drag oil prices lower as a result. This could be bad news for major oil-producing countries that acquire most of their revenues from oil sales. For Nigeria, the combination of lower global oil prices and a stronger dollar could add to its woes as it navigates a rough period.”\n\nThe PUNCH reports that the dollar surged and Bitcoin hit a record high on Wednesday as traders bet on a victory for Donald Trump, with the ex-president securing key swing states necessary to take the White House. This boosted expectations for fresh tax cuts, tariffs, and rising inflation.\n\nReports said the dollar jumped by 1.5 per cent to 154.33 yen, its highest since July. It also rose by more than one per cent against the euro and by more than three per cent against the Mexican peso. \n\nBitcoin surged nearly $6,000, hitting a record $75,330.88, surpassing its previous peak of $73,797.98 in March.\n\nOn the S&P500 index, futures climbed 1.4 per cent signalling that the S&P500 will open hitting fresh all-time highs. As mentioned in its weekly market report, FTXM said that the prospects of corporate tax cuts and a softer regulatory environment under Trump are good news for US equity bulls.\n\nOtunnuga opined that Trump’s return to the White House will most likely set the market tone for the next few years with the USD, Bitcoin and other assets tied to the “Trump trade” the biggest winners.\n\n“Investors with some skin in the game have already experienced how markets reacted under Trump between 2017 – 2021. Trump’s unpredictability, policy uncertainty and tariff wars with China left investors on edge. This and other major themes triggered sharp moves on the Vix index during his term. Market volatility jumped over 60 per cent during Trump’s previous administration, from 2017 until 2020. Since then, volatility fell about 10 per cent under President Joe Biden,” he asserted.\n\nThe analyst added that Trump’s return to the White House is likely to trigger fresh levels of volatility across the globe.\n\n“Trump’s proposed tariff increases in Europe and China could spark a global trade war. If this pushes up the prices for American consumers, a return of inflation may spell higher interest rates – boosting the USD.\n\n“An appreciating USD could hit gold prices along with emerging market currencies. On the geopolitical front, Trump has already vowed to ‘stop wars’ and swiftly end the war in Ukraine.\n\nAny major shifts in US foreign policy that escalate tensions could trigger risk-aversion,” it was said.","summary":"It has been projected that the emergence of Donald Trump as the 47th President of the United States of America may worsen inflationary pressure in Nigeria and cause a dip in the global oil prices which will affect Nigeria’s oil revenue. This was disclosed Thursday in an investor note from a trading platform, FXTM. The \n\n\n \n Read More","url":"https://punchng.com/trumps-victory-may-affect-nigerias-inflation-analyst/","image":"https://cdn.punchng.com/wp-content/uploads/2021/02/01101831/a3.jpg","video":null,"publish_date":"2024-11-08 01:05:39","author":"Taiwo Ojoye","authors":["Taiwo Ojoye"],"language":"en","source_country":"ng","sentiment":-0.067},{"id":263443394,"title":"What Trump's victory means for immigration and mass deportation in the US","text":"Throughout President-elect Donald Trump's 2024 campaign he made it clear one of his first priorities would be mass deportations of undocumented migrants.Now that the election is decided, border agents, locals leaders and law enforcement are wondering how this could all work.\"With the current resources that are allocated to ICE, he can get nowhere near the kind of numbers he's been talking about, you know, a million deportations in a year,\" said John Sandweg, former acting director of ICE.During the entire first Trump administration, ICE carried out around 1.5 million deportations.In order to ramp up that number, Trump has proposed tapping local law enforcement officials to carry out the deportations.David Hathaway is the Sheriff for Santa Cruz County in Arizona, which features the largest ports of entry with Mexico of any border County in the state.RELATED STORY | 'Operation Aurora:' Trump promises nationwide deportation effort during Colorado rally\"The courts have already ruled in Arizona that this is unconstitutional, that local police cannot be enforcing immigration law. It's a separate thing. It's a federal thing,\" said Hathaway.States like Texas, Arizona, Iowa and Oklahoma have all passed legislation to extend the limits of what local authorities can do to curb illegal immigration.The implementation of these laws, though, are all currently held up in federal court.Despite legal challenges, Sheriff David Rhodes, president of the Arizona Sheriffs Association, says these kinds of laws are necessary.\"The voters of Arizona, they voted for this expecting some kind of action and I believe we as elected leaders need to give it to them,\" said Rhodes.Hathaway says aside from his legal concerns, he believes carrying out mass deportations would terrorize communities like his.\"To do these mass deportation things, which would put anybody that looks like a migrant — It would put you in the crosshairs, even if you're here with all your documents and everything like that. It would put that whole class of people in scrutiny,\" said Hathaway. According to the American Immigration Council, deporting one million immigrants per year would cost more than $88 billion annually.RELATED STORY | Though it has strong support, experts say mass deportation would take herculean effort","summary":"Throughout President Elect Donald Trump's 2024 campaign he made it clear one of his first priorities would be mass deportations of undocumented migrants. So how would it all work?","url":"https://www.scrippsnews.com/politics/immigration/what-trumps-victory-means-for-immigration-and-mass-deportation-in-the-us","image":"https://ewscripps.brightspotcdn.com/dims4/default/18997bc/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fb6%2Fd2%2Fa6b5c3d74aea855d90a93f54d72b%2Fap24263667239744.jpg","video":null,"publish_date":"2024-11-08 01:04:35","author":"Jamal Andress","authors":["Jamal Andress"],"language":"en","category":"politics","source_country":"us","sentiment":-0.343},{"id":263443192,"title":"Consequence, Chuck D Blast America’s Treatment of Black People in New Collab","text":"In their new video “What Has America Done,” Black people are depicted with their backs up against the wall, as Cons questions their position in the country going into President Donald Trump‘s new term … “So what has America done for me? / Push the goal line further? / Accuse me of murder? / Fed me French fries and burgers?”","summary":"Consequence and Chuck D are fired up this post-election after the poll results didn&#8217;t go in their favor and firing at America with a lyrical blast about the treatment of its Black citizens!!! In their new video &#8220;What Has America Done,&#8221; Black people are depicted with their backs up against the wall, as Cons questions &#8230;\n\n\nThe post Consequence, Chuck D Blast America&#8217;s Treatment of Black People in New Collab appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/entertainment/consequence-chuck-d-blast-americas-treatment-of-black-people-in-new-collab/","image":"https://imagez.tmz.com/image/83/16by9/2024/11/07/83f6ea17de604df9b030cffd63509d9e_xl.jpg","video":null,"publish_date":"2024-11-08 01:03:08","author":"Ashleigh Durden","authors":["Ashleigh Durden"],"language":"en","source_country":"us","sentiment":-0.028},{"id":263443078,"title":"Joe Rogan advises President-elect Donald Trump against retaliating against critics on the left: “Let them voice their opinions freely.”","text":"Joe Rogan warned President-elect Donald Trump not to attack his haters on the left and just ‘Let them all talk their s—-.’ \n\nThe comedian and UFC color commentator, 57, encouraged Trump to unite the country during his second term in office while speaking on his highly popular podcast ‘The Joe Rogan Experience.’ \n\nHe told his guest Dave Smith: ‘This one is one of the first times ever where there’s a real chance to make real tangible change that’s gonna be for the good of everybody.\n\n‘He’s gotta unite people. He’s gotta not attack the left, not attack everybody. Let them all talk their s***, but unite. Now it’s time to unite everybody.’\n\nRogan had interviewed Trump late last month as the race for the White House intensified and publicly endorsed him for the presidency. \n\nAfter sitting down with Tesla CEO and ardent Trump supporter Elon Musk, Rogan said: ‘If it wasn’t for him (Musk) we’d be f***ed.\n\n”He makes what I think is the most compelling case for Trump you’ll hear, and I agree with him every step of the way.\n\n‘For the record, yes, that’s an endorsement of Trump. Enjoy the podcast’.\n\nIt was a drastic reversal from his 2020 support for Sen. Bernie Sanders, I-Vt., a self-proclaimed democratic socialist who helped develop the Green New Deal.\n\nTrump and Rogan had spoken at large about UFOs, the unopened JFK and Martin Luther King assassination files as well as Trump’s brush with death. \n\nThe podcaster interviewed the former president for three hours from his studio in Austin, Texas.\n\nRogan later revealed there had been talks to have Kamala Harris on his show with more than 18 million listeners, but it never materialized.\n\nHarris wanted to have the sit-down on the road while campaigning, but Rogan pushed back, saying that he wished they could have had conversation in his studio.\n\nTrump, meanwhile, made the journey to the Texas studio. The video has since been viewed over 46 million times. \n\nRepublican vice presidential nominee Ohio Sen. J.D Vance also recently sat down with Rogan.\n\nThe two delved into immigration, the economy and shot the breeze as the Trump campaign pulled out all the stops to reach young male voters – the primary audience of the podcaster’s hugely popular show.\n\nHearing about the ‘big news’ on the eve of Election Day, Trump informed his audience at a rally of the podcasters endorsement of him.\n\n‘So somebody that’s very, very respected asked me to do his show two weeks ago, and I said, why not? \n\n‘And to me, it’s very big, because he’s the biggest there is, I guess, in that world, by far.’\n\n‘His name is Joe Rogan, and he’s never done this before. And it just came over the wires that Joe Rogan just endorsed me, is that, right? Thank you, Joe,’ Trump said.\n\nTrump joked to his crowd that his appearance on the show made him hours late to a rally afterwards.\n\nRogan said in 2022 that he would never have Trump on his podcast over fears it would help his campaign. \n\nDuring their podcast, Rogan revealed that once Thomas Matthew Crooks attempted to assassinate him he had to get him on. \n\n Trump told Rogan that the attempt on his life and the scarring had made him a ‘tougher guy’. \n\nDuring an interview with Lex Fridman in 2022, Rogan told him that he had turned down multiple offers to have Trump on his podcast.","summary":"Joe Rogan warned President-elect Donald Trump not to attack his haters on the left&#8230;","url":"https://internewscast.com/news/us/joe-rogan-advises-president-elect-donald-trump-against-retaliating-against-critics-on-the-left-let-them-voice-their-opinions-freely/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Joe-Rogan-warned-President-elect-Donald-Trump-not-800x430.jpg","video":null,"publish_date":"2024-11-08 01:02:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.061},{"id":263443024,"title":"Protesters hold up disturbing 'women are property' signs at Texas college campus","text":"Protestors have caused outrage after turning up to a Texas college campus with despicable signs bearing derogatory messages about women. \n\nThe religious demonstrators, self-identified as members of Official Street Preachers, arrived at Texas State University on Wednesday afternoon with an array of signage which immediately caused uproar among students.\n\nThe group, who claim to 'share the gospel every day', were also heard shouting provocative religious-themed slogans at students,' a university spokesperson told Lonestar Live. \n\n'Women are property,' one sign read.\n\nAnother man held a sign which stated: 'Types of property: women, slaves, animals, land, etc.' \n\nOther messages seen at the San Marcos campus shared hatred about people of color and the LGBTQ+ community. \n\nThe group are not affiliated with the college, but were let on campus because it is considered a public space.\n\nA crowd of counter-protestors surrounded the Street Preachers until the Official Street Preachers eventually left campus. Campus police did get involved, but no arrests were made. \n\nVideo from Wednesday showed students crowding around and confronting the demonstrators.\n\nOne woman shouted: 'Women are property? Who am I property of?'\n\nAnother woman posted a video on TikTok of the events, saying: 'This is getting out of hand.'\n\nUnited Campus Ministry Reverend Todd Salmi participated in the counter-protests, holding signs reading 'Jesus values and respects Texas State women' and 'Jesus loves all y'all,' Texas State University's student newspaper, The University Star, reported. \n\nSalmi told the student newspaper: 'These Street Preachers come and they rile, and they feed off of hatred and attention, and then they leave.'\n\nLouie Dean Valencia, a history professor at Texas State University, posted pictures of the protestors on X.\n\n'Went outside to get lunch just now. Lost my appetite,' he wrote.\n\nIn the comments, he elaborated on his concern: 'As an expert on fascism… this is where it starts. Extremists at home who feel emboldened. The ones holding these signs were not part of our Texas State community. \n\n'They might be outsiders, but they aren’t strangers to those of us who study the radical right.'\n\nOn social media, some claimed the protest was inspired by the election of Donald Trump as the 2025 president.\n\nJoshua Martin, University of Houston's Student Body President, posted on X: 'Not even one full day after the election was called, this was the image at Texas State University today. \n\n'Times are going to be tough, but the fight has just begun.'\n\nAnother user wrote: 'This was Texas State University yesterday, now that the racists and misogynists feel emboldened again.'\n\nAfter Wednesday's events, the university president Kelly Damphousse posted on his Instagram, saying the group 'sow confusion, anger, distrust, bitterness, fear, and anxiety.'\n\nIn an official statement released on behalf of the university, Damphousse wrote: 'I condemn the hateful words these two men wrote and spoke while they were on our campus. That kind of hate is not welcome here.\n\n'Friends, I know that this incident was particularly disturbing because it occurred the day after a presidential election that was charged with emotion. \n\n'Even though the timing may not have been intentional, it may have seemed like these events were related.'\n\nThe president also explained why the radical-Christian demonstrators were allowed on campus to begin with, siting the fact that the university is legally required to allow 'expressive activities.'\n\nIn response, associate professor Jelena Tešić wrote on X: 'Please move the free speech area away from students, classrooms and Labs so my students are spared the telling of the slurs on them while they are walking by to their research lab or classroom.'\n\nOthers argued that these activities should not be protected by the university because they threaten students' safety.\n\nSomeone wrote in response to the university's statement: 'How are young women on your campus supposed to feel safe?'\n\n'I don’t think there’s any room for that on this campus,' student Cade Crockett told CBS Austin. 'I think it’s very shameful that people assume that it’s okay to promote this behavior, promote this bigotry.'\n\nBeyond the Texas campus community, the offensive signs have caught the attention of people across the country. \n\nNew York State Senator Alessandra Biaggi addressed the Official Street Preachers in a social media post. \n\n'Hey @ospofci, bring that sign to New York. Would love to see how New York women welcome you,' she said.\n\nThis is not an isolated incident, as the Official Street Preachers have documented their protests across various educational institutions in different states over the years.","summary":"The religiously-driven demonstrators arrived at Texas State University on Wednesday afternoon, bearing disturbing signs that caused an instantaneous uproar among students.","url":"https://www.dailymail.co.uk/news/article-14056917/Texas-State-University-Official-Street-Preachers-disturbing-signs.html","image":"https://i.dailymail.co.uk/1s/2024/11/08/00/91830137-0-image-m-12_1731025466542.jpg","video":null,"publish_date":"2024-11-08 01:02:33","author":"Editor,Sonya Gugliara","authors":["Editor","Sonya Gugliara"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.103},{"id":263443570,"title":"Trump expected to use economic leverage to enhance US influence on Korean firms","text":"Tariffs, regulations to weigh heavily on firms doing business with US\n\nBy Nam Hyun-woo\n\nOn Oct. 28, shares of the world’s largest semiconductor foundry, TSMC, closed down 4.3 percent following then-presidential candidate Donald Trump’s pledge to implement tariffs on chips from Taiwan instead of providing subsidies to the company.\n\nHours later, this also impacted Korea’s SK hynix, whose stocks closed down 2.91 percent. The chipmaker had been experiencing a solid rally after reporting strong earnings for the third quarter of this year, but its momentum was halted due to concerns over potential tariffs.\n\nExperts say this will likely be the case for many Korean businesses over the next four years. President-elect Trump’s strategic decoupling from Beijing presents an opportunity for Korean chipmakers, carmakers, and other export-oriented businesses to capture market share from China. However, his plans to leverage economic pressure in trade negotiations are expected to place significant burdens on partner countries, including Seoul.\n\n“Trump suggests the implementation of a baseline tariff of 10 percent on imports to the U.S, and warns of imposing a much stricter tariff of 60 percent on all Chinese goods,” said Jang Sang-sik, head of trade trend analysis at the Korea International Trade Association (KITA).\n\nOpportunities and challenges for chipmakers \n\nFor Korean chipmakers, Trump’s second presidency brings considerable uncertainty, given his stance on the CHIPS Act and his strategic decoupling from China.\n\nAccording to a report by the Korea Institute for Industrial Economics & Trade (KIET), Korean chipmakers can anticipate benefits in a second Trump administration, as Chinese competitors in key semiconductor and demand industries — such as smartphones and other IT devices — are likely to encounter stricter regulatory scrutiny.\n\n“The CHIPS Act, which was designed by the (first) Trump administration, played a key role in slowing the progress of China’s semiconductor industry and curbing the rise of major Chinese tech firms, effectively safeguarding the market share of leading chipmakers,” the report said. “Although there are uncertainties surrounding incentives coming from the CHIPS Act, Korean companies can expect benefits due to the decline of Chinese players.”\n\nIn 2019, Chinese smartphone maker Huawei delivered 241 million smartphones, but that number plummeted to 4.3 million in 2021 after Trump signed an executive order to block Chinese telecommunications companies and then-Secretary of Commerce Wilbur Ross placed Huawei on a blacklist in May 2019. \n\nExperts also noted that Trump's recent attacks on the CHIPS Act and threats to impose tariffs are viewed as election rhetoric, and the likelihood of the president-elect actually implementing tariffs at the expense of increased costs for U.S. device makers is slim.\n\n“Trump’s current policy promises regarding semiconductors will likely be adjusted,” said Professor Lee Jong-hwan at Sangmyung University’s Department of System Semiconductor Engineering. “If blanket tariffs are imposed recklessly, U.S. device makers will inevitably feel the impact as well. If this becomes excessive, there's always an option of passing over the increased cost to the U.S. market, given that the major manufacturers in both memory and non-memory sectors are located outside the U.S.”\n\nKITA’s Jang also pointed out that imposing duties on chips would necessitate Washington’s annulment of both the Korea-U.S. free trade agreement and the Information Technology Agreement, which ensure tariff-free trade for certain semiconductor-related items.\n\n“Trump tends to use an anchoring effect in negotiations: if he wants to get 50, he’ll start by asking for 100,” Jang said. “If the final deal lands at around 50, the other party feels like they’re getting a break, as if the president-elect has gone easy on them. While it might not be straightforward to impose tariffs directly on semiconductors, he could employ measures such as reducing subsidies for Samsung Electronics or TSMC or limiting investment incentives.”\n\nSetbacks on EV strategy, battery\n\nThe automobile and battery industries anticipate significant policy shifts under Trump’s second term, especially given his threat to impose tariffs of up to 200 percent on vehicles imported from Mexico, with potential extensions to other imported vehicles.\n\nHyundai Motor and Kia have been addressing U.S. investment expectations through their manufacturing plants in Alabama and Georgia. However, a substantial share of their U.S.-sold vehicles is still imported from Korea. If high tariffs are imposed, they could face pressure to raise vehicle prices, potentially impacting their price competitiveness.\n\nThe KIET report noted that \"risks are high for hefty tariffs on automobiles\" and emphasized the need for \"diplomatic efforts for Korea to align with other car-producing nations to resist these measures.\"\n\nAnother concern for carmakers is Trump’s pessimism toward eco-friendly vehicles, likely leading to significant cuts in incentives currently offered to eco-friendly car and battery manufacturers.\n\nFollowing the enactment of the Inflation Reduction Act (IRA), which offers incentives for U.S.-manufactured electric vehicle (EV) purchases, Korean carmakers and battery manufacturers have ramped up their EV-related investments in the U.S.\n\nHowever, Trump has voiced plans to revoke IRA incentives, with his running mate, J.D. Vance, introducing a proposal to redirect EV credits toward gas-powered vehicles. While it is unlikely that Trump will fully eliminate the IRA, analysts suggest he may reduce EV credit amounts through executive orders.\n\nThis shift suggests that internal combustion engine (ICE) and hybrid vehicles could increasingly substitute EVs in the market. Consequently, carmakers may need to reallocate or repurpose investments in EV production facilities, while battery manufacturers might face an extended period of reduced demand for EV-related products.\n\n“It is de facto impossible to retrieve trillions of won worth of investments that have already been made, so companies cannot help but leave open all the scenarios and constantly revise their strategies in order to receive more tax benefits and incentives even under a Trump presidency,” Kim Moon-tae, head of the industry policy division at the Korea Chamber of Commerce and Industry, said.\n\nRising pressure across industries\n\nKIET anticipates that a second Trump presidency will put substantial pressure on the steel industry, with risks arising from potential tariff hikes. The administration is expected to uphold Section 232 of the Trade Expansion Act, which currently enforces a 25 percent baseline tariff on steel imports.\n\nThe defense industry is also expected to face downward pressure as Trump aims to create a U.S.-centric defense supply chain, leaving limited opportunities for Korean defense contractors looking to expand exports.\n\nOn the other hand, the Korea Atomic Industrial Forum (KAIF) anticipates that a second Trump presidency will expedite a return to fossil fuels, while also projecting growth in nuclear energy, particularly with the expected expansion of small modular reactors (SMRs).\n\n“Trump is expected to reverse the Biden-Harris administration’s energy policies by promoting fossil fuel and nuclear power expansion while reducing government support and incentives for renewable energy,” Kang Goo-sang, head of KAIF’s economic research institute, said. “Trump has consistently highlighted his goal of increasing energy production from domestic fossil fuels and expanding nuclear development. He asserts that this strategy would lower energy costs, create jobs, and stimulate economic growth.”","summary":"On Oct. 28, shares of the world’s largest semiconductor foundry, TSMC, closed down 4.3 percent following then-presidential candidate Donald Trump’s pledge to implement tariffs on chips from Taiwan instead of providing subsidies to the company.","url":"https://nation.lk/online/trump-expected-to-use-economic-leverage-to-enhance-us-influence-on-korean-firms-282579.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/a80abca959ad44ea86d91b1283953a44.jpg","video":null,"publish_date":"2024-11-08 01:00:35","author":"Nam Hyun","authors":["Nam Hyun"],"language":"en","source_country":"lk","sentiment":-0.235},{"id":263443334,"title":"LAURA INGRAHAM: This is 'incredibly encouraging' for Republicans","text":"Fox News host Laura Ingraham asks whether Democrats \"really show signs of understanding\" why Vice President Kamala Harris lost the 2024 election on \"The Ingraham Angle.\" LAURA INGRAHAM: It's not even been 48 hours since we learned that Donald Trump blew the doors off the presidential race, and our so-called experts, they kind of remain in a suspended state of shock — shocked by President Trump's strength across pretty much all demographic groups… ESPN HOST STEPHEN A. SMITH RAGES OVER HARRIS AVOIDING INTERVIEWS: ‘WHAT YOU HIDING FOR?’ Well, not only did Trump grow his support among Hispanics, among young people, African American men — he grew his support in deep blue states that he lost. In New York, where Trump lost by almost 23 points in 2020, on Tuesday, he cut that margin in half, and then in New Jersey in 2020 — and we saw a little bit of this with that governor's race that was so close — Trump lost by a whopping 16 points to Biden, but this time he came within 5 points of Harris. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE This is incredibly encouraging for Republicans. Now, basically the same story in Illinois, where Trump also cut his deficit there by about a half. So, as these numbers settle in, you have to wonder, do Democrats or their informal advisers — they recognize some of the problems, you could hear that in those clips that we played — do they really show signs of understanding what substantively went wrong?","summary":"Fox News host Laura Ingraham reacts to President-elect Trump&apos;s growing base nationally after his victory in the 2024 race on &quot;The Ingraham Angle.&quot;","url":"https://www.foxnews.com/media/laura-ingraham-incredibly-encouraging-republicans","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/11/931/523/laura-ingraham-republicans-should-make-an-effort-to-flip-california.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-08 01:00:08","author":null,"language":"en","source_country":"us","sentiment":-0.341},{"id":263443568,"title":"Berkeley’s natural gas tax for big buildings is headed for defeat. What’s next for the electrification movement?","text":"Berkeley voters are poised to reject a ballot measure that would tax property owners of large buildings that rely on natural gas for heating, cooking and other uses.\n\nMeasure GG, an effort to slash climate change-causing emissions, would have imposed a tax on most buildings 15,000 square feet or larger that use natural gas. It was designed as a more“pragmatic” alternative to Berkeley’s first-in-the-nation ban on natural gas hookups, which was struck down by the 9th U.S. Circuit Court of Appeals.\n\n“We are obviously disappointed by the early results, but are also not surprised given that we were outspent on the campaign by hundreds of thousands of dollars,” Daniel Tahara, a city climate commissioner and a leader of Fossil Free Berkeley, the group that organized the measure, wrote in an email. He did not concede, saying in a text Wednesday it was “a bit premature” as there are still votes left to be counted.\n\nThe city is behind on its efforts to address methane emissions and meet its climate goals, Tahara wrote in the email. The measure, he said, was an attempt to address what he considers a “huge equity burden facing our community in the coming years.”\n\nThe initial tax rate — $2.96 for every 100 cubic feet of gas consumed — would have been about 1.5-2 times what PG&E charges its customers for natural gas, and would rise at 6% above inclination each year, expiring in 2050. The rate, according to the measure’s authors, was based on the social cost of carbon, an estimate of how harmed society is by greenhouse gas emissions. It needed a simple majority to pass. \n\nThe Bay Area Air Quality Management District has amended its building appliance rules to gradually phase out some gas appliances that emit nitrogen oxides, which have been linked to asthma, lung cancer and premature death. By 2027, you will only be able to buy zero-emission electric water heaters in the Bay Area. \n\nBut the regulation ​“left a lot of the thorny implementation issues to local municipalities,” such as how to make it affordable for homes and businesses to make the switch, Tahara told Berkeleyside last month. The measure sought to bridge the gap by raising funds for electrification projects like heat pumps, induction stoves, solar panels, battery storage and electric vehicle charging. \n\n“We put forward Measure GG because we see a huge equity burden facing our community in the coming years and because of the City’s failure to meet its climate goals,” Tahara wrote. “Unless that changes, we have no choice but to try again with adjustments, taking into account new feedback from community members about various ideas for the next round.”\n\nMeasure GG faced a well-funded opposition campaign\n\nThe measure’s supporters included environmental and progressive advocacy groups such as 350 Bay Area, Sunrise Movement Bay Area and the Wellstone Democratic Renewal Club of the East Bay. Had it passed, legal experts said it would have been the first tax in the country to target the use of a specific fuel source for buildings. \n\nBut the effort faced a strong “No” campaign funded by business interests and endorsed by well-known brands like Boichik Bagels, Berkeley Bowl and Berkeley Repertory Theatre, which argued the measure would harm businesses and nonprofits.\n\n“We’re pleased at the outcome thus far,” said Berkeley Chamber of Commerce CEO Beth Roessner, who co-chaired the No on GG campaign alongside John Caner, the CEO of the Downtown Berkeley Association. \n\nRoessner said she’s waiting for the county’s official results before declaring victory. \n\n“We believe we ran a really robust campaign meant to educate voters on the true impact of the ordinance and we’re delighted to see that folks recognize that and saw the impact it was going to have on the arts and nonprofits and they voted accordingly,” Roessner said.\n\nThe “No” campaign reported taking in $239,785 during the most recent period, from Sept. 22 to Oct. 19, for a total fundraising haul of $370,840. That’s the most raised by any of the measure campaigns. The money the “No” campaign raised just in the four-week reporting period is more than double the $95,335 raised by the “Yes” side over its entire campaign.\n\nIn the latest fundraising period, the National Association of Realtors gave the “No campaign” $100,000. The commercial builder Wareham Development gave $58,500, while the political arm of the arm of the Bay Area Council, the regional business lobby, gave $30,000. As of the filing deadline, the campaign had spent $275,000, much of which went toward advertising and literature.\n\n“This is a case of the corporate opposition misleading voters,” Tahara said in the email, noting the opposition campaign’s funding came “largely from outside influences.”\n\nHe also blamed “the media and City leaders” for repeating the opposition’s misrepresentation of facts. “Voters were not given an opportunity to see through the lies,” he wrote. \n\nRoessner pushed back against Tahara’s criticism of the “No” campaign’s funding.\n\n“The very businesses that were going to be impacted by this tax — if they can’t afford the tax and they can’t afford expensive upgrades with very little lead time, we certainly did not expect them to contribute to the campaign financially and we had other interests who were willing to contribute to the campaign,” Roessner said. \n\nShe noted that the measure could have ultimately impacted tenants, making it a “real estate issue to a degree.” \n\nThe measure’s language barred building owners from raising rents or passing the cost of the tax — which would be added directly to the landlord’s yearly property tax — to residential tenants. But a city report said that would be difficult to enforce in practice, noting that “the tax may result in higher rental costs” at the time of lease renewal or “for price controlled units … during times of vacancy.”\n\nRoessner said she believes climate action policies should focus on providing incentives, not imposing penalties. \n\n“We are willing to come to the table and help craft reasonable policy to achieve our climate goals but it needs to be equitable and the measure that was put before the voters was not equitable and it would have impacted small businesses housed in large buildings,” she said.\n\nWhat comes next for electrification in Berkeley? \n\nA lack of public understanding of the dangers of methane may have contributed to the measure’s defeat, according to some clean energy experts. \n\nRic O’Connell, the executive director of GridLabs, a nonprofit clean energy consultancy housed in the David Brower Center, opposed the tax, likening it to “doubling the cost of gasoline at the pump and expecting people to switch to electric cars immediately” in a letter to the City Council. (The David Brower Center, an environmental activism hub that owns a 50,000-square-foot building downtown, also opposed the tax.)\n\nO’Connell said he was frustrated because he felt the measure was a “wasted opportunity” for Berkeley to again lead the way for innovative climate policy, as it did when it originally passed the since-reversed gas ban. But good, durable policies, he said, needed “a little bit more consensus.” \n\n“Just the level of the tax, I think if it had been 10% of what it would have been proposed, I don’t think I would have opposed it,” O’Connell said. “I think I would decide, well, it’s maybe not the best policy, but it’s pretty good and we’ll go with it.” \n\nO’Connell believes a combination of incentives — such as those offered through President Joe Biden’s IRA, or Inflation Reduction Act, a sweeping piece of climate legislation, which allocated $370 billion toward shifting the U.S. to cleaner forms of energy — and penalties for those who fail to move away from climate-harming fuels are needed, as well as more workforce development and consumer education on how to decarbonize and switch to heat pumps. \n\nBut he said a carbon tax may be more effective if implemented statewide instead of just in Berkeley, where a few large facilities could simply move. \n\nBen Paulos, a clean energy consultant and former city energy commissioner, urged caution in interpreting Berkeley voters’ rejection of the proposed tax as a wider rejection of the need for climate action.\n\n“I think the story is more obvious — that a tax is seen as a punishment and voters did not want to punish these beloved Berkeley institutions,” said Ben Paulos, “I’m sure if you asked Berkeley voters, ‘should we do something about global warming,’ you’d get a strong response.” \n\nPaulos said he voted for Measure GG as he felt it would motivate owners of large buildings to reduce natural gas consumption, even if they could not immediately afford a full electrification retrofit. But the measure faced a great messaging challenge: People don’t consider gas water heaters and ovens as health risks and contributors to climate pollution. \n\n“We’ve been taught for a long time that coal is the big problem, that cars are a problem … It’s only recently that there’s been a focus on natural gas as a significant climate pollution source, so I think the general public is not there yet on that issue,” Paulos said. \n\nLike Paulos, Tahara said Berkeley residents want climate action but need more education.\n\n“But there’s still a lot of work to do to educate and support people on the options and the importance,” Tahara wrote, noting that many don’t understand what technologies and financial resources are available to help them switch to cleaner energy sources. Nor do they understand the health dangers of methane, he said. \n\nPaulos said he is hopeful that a “structural approach,” such as making buildings greener by tightening building codes and enacting regulations like the Bay Area Air Quality Management District’s gradual phase-out of gas appliances that emit nitrogen oxides, will drive long-term change.\n\nBerkeley City Council member Igor Tregub, who works as a climate policy consultant, said the city is drafting amendments to Berkeley’s green code that could tighten regulations around — but not outright ban — construction of new buildings that release nitrogen oxide emissions. He’s hopeful this pathway would not open the city up to potential lawsuits. (The city spent nearly $300,000 defending its now-defunct ban on gas hookups in new construction from a lawsuit from California’s restaurant industry.)\n\n“It’s a different way to achieve the same outcome, but one that would be less likely to open us up to legal scrutiny,” Tregub said. No timeline has been set, but Tregub said he expects it to go before the council “fairly expeditiously.” \n\nIt remains to be seen what impact President-elect Donald Trump, who in his four years in office rolled back many environmental protections and criticized gas bans like Berkeley’s, will have on climate change, but with a Republican-controlled Senate, he could undo key national climate policies, including the IRA.\n\n“It’s clear that we cannot rely on the federal government to fund the transition for us, so we need to figure out how to fund it ourselves,” Tahara wrote. \n\nThe Measure GG campaign, Tahara said, helped “grow the climate movement in Berkeley” and in the wake of Trump’s election, he plans to continue his local advocacy efforts to secure funding for climate action. \n\nBerkeleyside associate editor Nico Savidge contributed reporting to this story.","summary":"Measure GG, an effort to slash climate change-causing emissions, would have imposed a tax on big Berkeley buildings that use natural gas.","url":"https://nation.lk/online/berkeley-s-natural-gas-tax-for-big-buildings-is-headed-for-defeat-what-s-next-for-the-electrification-movement-282574.html","image":"https://newspack-berkeleyside-cityside.s3.amazonaws.com/wp-content/uploads/2024/11/large-IMG_3690.jpg","video":null,"publish_date":"2024-11-08 01:00:08","author":null,"language":"en","source_country":"lk","sentiment":-0.102},{"id":263443476,"title":"Trump poised to appoint conservative justices if Thomas, Alito step down","text":"Trump poised to appoint conservative justices if Thomas, Alito step down\n President-elect Donald Trump's return to the White House puts him in a position to influence the make-up of the Supreme Court and the effects could be felt for decades. CBS News legal contributor Jessica Levinson explains.","summary":"President-elect Donald Trump's return to the White House puts him in a position to influence the make-up of the Supreme Court and the effects could be felt for decades. CBS News legal contributor Jessica Levinson explains.","url":"https://www.cbsnews.com/video/trump-poised-appoint-conservative-justices-thomas-alito-step-down/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/08/87f10e52-f0ae-43aa-9e95-f34595040cbf/thumbnail/1200x630/a8d975ac3a2e24ffb114d0b9536c9330/cbsn-fusion-trump-poised-appoint-conservative-justices-thomas-alito-step-down-thumbnail.jpg?v=c1d30b1df13c40bf65c","video":null,"publish_date":"2024-11-08 00:57:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.365},{"id":263442536,"title":"The real reason Australian elites hate Trump: The bandana bore says Americans are just dumb. The truth is Don's comeback reminds us of something we lost and will never get back, writes STEPHEN JOHNSON","text":"Australia's cultural elites are really scoffing at working-class pride when they have a meltdown reaction to Donald Trump's election victory.\n\nLeft-wing author Peter FitzSimons struggled to have any civility when an X follower politely called him out for adopting the mindset that Trump supporters were beneath contempt.\n\n'I have no respect for Trump whatsoever,' he replied as the election results rolled in.\n\nFitzSimons, a resident of Mosman on Sydney's very upmarket lower north shore, would probably struggle to comprehend how working-class Americans voted Republican because they are more concerned about high inflation and job security than identity politics on race and gender.\n\nVice-President Kamala Harris didn't just lose the industrial states of Wisconsin, Michigan and Pennsylvania after making abortion and 'defending democracy' key themes of her campaign.\n\nShe also delivered the Democrats their worst electoral college vote in a presidential election since 1988, as Trump's Republicans swept up the states with the highest proportion of blue-collar workers.\n\nBut this time, she also became the first Democrat in two decades to lose the popular vote after preferring to campaign on stage with the likes of Bon Jovi, Beyonce and Jennifer Lopez.\n\nTrump instead donned a McDonald's uniform, scooping up fries, and also sat in a garbage truck wearing an orange fluoro vest - drawing ridicule from left-wing media outlets.\n\nThe Republican president-elect at least showed an affinity with low-paid workers, or those doing hard physical labour.\n\nThis is something certain snobbish B-grade celebrity pontificators - including those who wear a red bandana as a fashion statement - would have trouble comprehending as centre-left political parties from the American Democrats to the Australian Labor Party lose the support of those without a university degree.\n\nFitzSimons even contemptuously suggested Australian followers of Trump - with their red Make America Great Again hats - were mentally unwell.\n\n'The saddest thing, for me, is the Australian MAGA supporters claiming to be \"patriots\" - completely oblivious to the fact that they are no more than a rundown branch of American nutters,' he posted on X a month before the election.\n\n'About as UN-Australian and unpatriotic as it gets!'\n\nThe irony of FitzSimons describing Trump supporters as unpatriotic and 'nutters' for wanting to protect local jobs!\n\nTrump's plan to impose 10 to 20 per cent tariffs on imports is, in fact, exactly the kind of policy Australia had when it still had a car industry.\n\nFrom 2000 to 2005, Australia had 15 per cent tariffs on imported cars.\n\nBack in 2002, Holden - and not Toyota - was still Australia's top-selling brand, with the Adelaide-built Commodore the No. 1 selling car.\n\nImport tariffs fell to 10 per cent in 2005, and under Labor prime minister Kevin Rudd they were halved again to just five per cent in 2010.\n\nBy 2011, the Australian-made Holden Commodore was no longer Australia's top selling car, with the fully-imported Mazda3 taking that crown.\n\nNever before had a fully imported car been Australia's bestseller, with the nation's most popular car previously being either assembled or fully manufactured locally. \n\nJust six years later, Australia made its last car, with Holden, Ford and Toyota having all closed their local manufacturing operations.\n\nThis occurred during Trump's first year in office in 2017.\n\nThe end of Holden was a blow to Australia's national pride, ending 100 years of the former Adelaide saddlery company assembling American General Motors cars and launching the first Holden in 1948.\n\nThe brand synonymous with the Kingswood and the Commodore was once the pride of Australia but the car make with the lion badge died in 2021. \n\nThe Ford Falcon nameplate had lasted 56 years - as a car proudly made in Australia - but the world's longest-surviving model moniker is now no more than an historic footnote.\n\nTrump may get ridiculed by the elites for wanting to impose high tariffs, including the 60 per cent tariffs on Chinese goods.\n\nBut from 1978 to 1988, Australia in fact had 57.5 per cent tariffs on all imported cars.\n\nThe elites also like to mock Trump for wanting to rip up free-trade deals.\n\nThey are all well and good if both parties operate in good faith - but in the case of Thailand, Australia got dudded after signing such a deal in 2005.\n\nIn a bid to protect its own car-making industry, Thailand imposed special taxes on larger cars, which made it impossible for Ford Australia to export the Territory SUV to that market.\n\nFord only made right-hand drive cars, too, and having obstacles put in the way, despite a free-trade deal, meant it didn't have a viable export program to survive beyond 2016 as a local manufacturer.\n\nIt's too late now for Australia to revive its car industry. \n\nTrump - the author of The Art of the Deal - at least understands how it's the working class who get screwed over in bad deals.\n\nThat's something those wealthy, lefty elites may wish to consider - but that is probably beyond them.","summary":"Australia's cultural elites are really scoffing at working-class pride when they have a meltdown reaction to Donald Trump's election victory, writes STEPHEN JOHNSON.","url":"https://www.dailymail.co.uk/news/article-14056949/why-Australian-elites-hate-Trump-trade-tarrifs.html","image":"https://i.dailymail.co.uk/1s/2024/11/07/23/91828527-0-image-m-18_1731023204874.jpg","video":null,"publish_date":"2024-11-08 00:56:04","author":"Editor,Stephen Johnson","authors":["Editor","Stephen Johnson"],"language":"en","source_country":"gb","sentiment":-0.198},{"id":263443474,"title":"Comparing Kamala Harris' and Hillary Clinton's performances against Trump","text":"Comparing Kamala Harris' and Hillary Clinton's performances against Trump\n Hillary Clinton attempted to shatter the highest glass ceiling in U.S. politics and went up against now-President-elect Donald Trump in 2016. CBS News deputy director of elections and data analytics Kabir Khanna compares her performance with Vice President Kamala Harris' run in 2024.","summary":"Hillary Clinton attempted to shatter the highest glass ceiling in U.S. politics and went up against now-President-elect Donald Trump in 2016. CBS News deputy director of elections and data analytics Kabir Khanna compares her performance with Vice President Kamala Harris' run in 2024.","url":"https://www.cbsnews.com/video/comparing-kamala-harris-hillary-clintons-performances-against-trump/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/08/4529bd5f-afef-4d75-acbc-63c13a86f4ac/thumbnail/1200x630/5d6f7353a3a47d7a9a7d841ac62923e7/cbsn-fusion-comparing-kamala-harris-hillary-clintons-performances-against-trump-thumbnail.jpg?v=c1d30b1df13c40bf6","video":null,"publish_date":"2024-11-08 00:54:00","author":null,"language":"en","source_country":"US","sentiment":-0.098},{"id":263443392,"title":"Putin congratulates Trump on his election victory in his first public comments on the US vote","text":"Russian President Vladimir Putin on Thursday congratulated Donald Trump on his election victory in his first public comment on the U.S. vote, and he praised the president-elect's courage during the July assassination attempt.“His behavior at the moment of an attempt on his life left an impression on me. He turned out to be a brave man,\" Putin said at an international forum following a speech in the Black Sea resort of Sochi.\"He manifested himself in the very correct way, bravely as a man,” he added.RELATED STORY | World leaders react to Donald Trump winning 2024 presidential electionPutin also said that what Trump has said “about the desire to restore relations with Russia, to help end the Ukrainian crisis, in my opinion, deserves attention at least.”The Kremlin earlier welcomed Trump’s claim that he could negotiate an end to the conflict in Ukraine “in 24 hours” but emphasized that it will wait for concrete policy steps.\"I would like to take this opportunity to congratulate him on his election as president of the United States of America,” Putin said in a question-and-answer session at the conference.As to what he expects from a second Trump administration, Putin said, “I don’t know what will happen now. I have no idea.”\"For him, this is still his last presidential term. What he will do is his matter,” added Putin, who this year began a fifth term that will keep him in power until 2030 and could seek six more years in office after that.RELATED STORY | Trump says if elected, he would settle the war in Ukraine before his inaugurationKremlin spokesman Dmitry Peskov said Thursday the Kremlin is not ruling out the possibility of contact between Putin and Trump before the inauguration, given that Trump “said he would call Putin before the inauguration.”Peskov has emphasized that Moscow views the U.S. as an “unfriendly” country that is directly involved in the Ukrainian conflict. He dismissed arguments that Putin’s failure to reach out quickly to Trump could hurt future ties, saying that Moscow's relations with Washington already are at the “lowest point in history” and arguing that it will be up to the new U.S. leadership to change the situation.The Kremlin’s cautious stand reflected its view of the U.S. vote as a choice between two unappealing possibilities. While Trump is known for his admiration of Putin, the Russian leader has repeatedly noted that during Trump’s first term, there were “so many restrictions and sanctions against Russia like no other president has ever introduced before him.”","summary":"Russian President Vladimir Putin has congratulated Donald Trump on his election victory in his first public comment on the outcome of the U.S. balloting.","url":"https://www.scrippsnews.com/politics/america-votes/putin-congratulates-trump-on-his-election-victory-in-his-first-public-comments-on-the-us-vote","image":"https://ewscripps.brightspotcdn.com/dims4/default/e6ab43e/2147483647/strip/true/crop/4173x2191+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F11%2F12%2F47dd246346b4803f4f4957853abd%2Fap24312665858928.jpg","video":null,"publish_date":"2024-11-08 00:52:52","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","category":"politics","source_country":"us","sentiment":0.149},{"id":263442538,"title":"Team Trump 2.0! TOM LEONARD looks at who is in with the future US president-elect and who's right out in the cold","text":"It was the victory entourage that spoke volumes about who is in and who is out in Team Trump.\n\nDonald's youngest son Barron, darling of the MAGA crowd, almost in pole position with mother Melania, while Barron's half-sister Ivanka – once the apple of Daddy's eye – out in social Siberia with husband Jared Kushner on the far-right of the picture above.\n\nIt's the price the couple, who were two of Mr Trump's closest advisers during his first term, had to pay for deserting him during his 2024 campaign.\n\nIn a telling indication of their own falling stars and the unlikely rise of others in the Trump firmament, even a bald-headed mixed martial arts tycoon, Dana White, who has become one of the president-elect's key backers, was closer to the main man as he gave his victory speech at a rally in West Palm Beach, Florida, on Tuesday night.\n\nSuch events are often designed to look spontaneous and casual, but all you needed on this occasion was a tape measure to work out who currently matters most.\n\nKimberly Guilfoyle\n\nThe former Fox News presenter and (embarrassingly for Team Trump) ex-wife of uber-liberal California governor Gavin Newsom became engaged to Donald Trump Jr in December 2020. \n\nShe was considered for the role of press secretary in Mr Trump's first administration and is reportedly vying for a senior role in the next one.\n\nDonald Trump Jr\n\nWith the retreat of sister Ivanka and her husband Jared, Trump's eldest son has been far more involved in his father's political career than he was during the first Trump White House term when he concentrated on working for the family business. \n\nA keen hunter, 46-year-old Don Jr has been valued within the campaign for his ability to connect with its core supporters, especially on his podcast, Triggered. \n\nHe encouraged his father to choose JD Vance as his running mate. \n\n'Don has the pulse of the base and knows where the energy of the party is, so he's sort of the go-to person now on a lot of political things,' said his father in 2021.\n\nThe 55-year-old, thuggish-looking, ex-boxer and multi-millionaire president of the Ultimate Fighting Championship, a major mixed martial arts promotional company, is an old friend and supporter of Mr Trump. \n\nAfter he took the microphone during Mr Trump's victory speech and delivered his own combative attack on the media, MAGA fans want him to be Mr Trump's next press secretary – while he was pictured deep in conversation with their billionaire ally Elon Musk and Mr Trump on election night at Mar-a-Lago. \n\nInsiders say he's the sort of no-nonsense loyalist the president-elect values after being saddled with more moderate Republicans during his first White House term.\n\nLike big brother Don Jr, Eric, 40, has become more involved in his father's campaign this time round – although he remains 'executive vice president' of the family business. \n\nInsiders say that while Don Jr concentrates on charming supporters on the ground, the less charismatic Eric busies himself with the Republican Party organisation, joined by wife Lara, 42.\n\nSusie Wiles\n\nThe power behind the Trump throne. His campaign co-manager may be peeping out from behind Eric but she's been dubbed the 'most feared and least known political operative in America'. \n\nThe soft-spoken, 67-year-old grandmother, who describes herself as a moderate and worked for Ronald Reagan, has masterminded Mr Trump's political comeback. \n\nHaving effectively been his chief of staff during his recent campaign, she's hotly tipped to be offered the same role in the White House.\n\nThe proximity of Mr Trump's daughter-in-law to him on the Florida stage is no accident. \n\nA loyal rising star, the 42-year-old former television producer was hand-picked by Mr Trump as the co-chairman of the Republican Party. \n\nProviding the female glamour ingredient of a campaign missing sister-in-law Ivanka and Melania, she has reportedly become one of Mr Trump's most trusted advisers and was the first family member to speak at this summer's Republican National Convention.\n\nMelania Trump\n\nThe first lady-elect barely featured in the campaign but insiders say her importance to her husband's electoral prospects – particularly given his long history of infidelity and sexual misconduct allegations – cannot be overstated. \n\nShe was often absent from official White House engagements during the first Trump administration and sources predict the same will be true of the second for a woman who hates politics and public scrutiny.\n\nBarron Trump\n\nHe's only 18 and is studying at university in New York but he's adored by hardcore Trump supporters who gave him two standing ovations when his father introduced him at a rally in July. \n\nSince then, he played a crucial campaign role in advising his 78-year-old father on how to attract the youth vote – which podcaster 'bros' to talk to – and educating him on cryptocurrencies. \n\nBarron has a special place in MAGA hearts and many have hailed him on social media as their preferred successor to the Trump political crown. \n\nA surprising proportion of the more fanatical MAGA faithful cling to a bizarre conspiracy theory that claims Barron was mentioned in a series of obscure 1890s books about the magical adventures of a precocious time-travelling boy called Baron Trump.\n\nViktor Knavs\n\nMelania's father – who lost his wife, Amalija, in January – is very close to her and 'hyper-involved' in the upbringing of grandson Barron, say insiders. (Melania has called her late mother a 'ray of light in the darkest days'). \n\nThey spent much of the first Trump term living in the White House flat previously occupied by Michelle Obama's mother and were often seen travelling with the first couple. \n\nViktor, a former chauffeur and travelling salesman in Slovenia, is only two years older than his son-in-law.\n\nJD Vance and wife Usha\n\nThe vice president-elect won fame writing memoir, Hillbilly Elegy, about his impoverished Rust Belt upbringing, but was lambasted for joining the Trump ticket when he'd previously suggested he was 'Hitler' and accused of sexism when he derided Democrat leaders as 'childless cat ladies'. \n\nMr Trump now says Vance 'turned out to be a good choice – I took a little heat at the beginning, but I knew the brain was a good one'. He is married to lawyer Usha, with whom he has three children.\n\nIvanka Trump\n\nOnce all-powerful in the Trump White House as half of the power couple dubbed 'Javanka', she distanced herself from her father after the January 6 attack on the US Capitol in 2021 and had no involvement in his 2024 campaign. \n\nHours before the election, she posted a 17-strong list of 'life lessons' but didn't mention her father once. She clapped noticeably less than others during the victory rally and her choice of a Democrat-blue suit that night took some nerve.\n\nJared Kushner\n\nThe other half of Javanka was reportedly even more Machiavellian than his wife but has also stepped away from the Trump campaign. \n\nThe young multi-millionaire property developer and investor prefers to concentrate on making money but has been attacked for exploiting rich Middle Eastern contacts he made while working in the White House. \n\nOnce highly prized, his placing so far from Mr Trump surely shows how far he has fallen in the boss's eyes.","summary":"It was the victory entourage that spoke volumes about who is in and who is out in Team Trump.","url":"https://www.dailymail.co.uk/news/article-14057463/Team-Trump-2-0-TOM-LEONARD-looks-future-president-elect-whos-right-cold.html","image":"https://i.dailymail.co.uk/1s/2024/11/08/00/91831171-0-image-a-112_1731026757498.jpg","video":null,"publish_date":"2024-11-08 00:52:49","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","category":"politics","source_country":"gb","sentiment":0.387},{"id":263442556,"title":"Donald Trump’s election win: Letters to the Editor — Nov. 8, 2024","text":"The Issue: The United States decisively electing Donald Trump to be its 47th president.\n\nThe 2024 presidential election has concluded, and the American people have spoken, choosing Donald Trump as their next president (“He’s Don It Again,” Nov. 6).\n\nA major factor contributing to Trump’s victory was the state of the economy and the standard of living, which were central issues for voters.\n\nMany Americans felt that they were worse off now compared to four years ago, and this sentiment played a significant role in the election’s outcome.\n\nThroughout the campaign, it seemed that the Democratic Party failed to address these concerns effectively. \n\nVice President Kamala Harris, in particular, gave the impression that the policies of President \n\nBiden would remain largely unchanged under her leadership. \n\nThis perception may have led many voters to feel that a shift in direction was necessary.\n\nUltimately, the election result reflects the dissatisfaction many Americans felt with their current economic conditions and their desire for change.\n\nMartin Blumberg\n\nAt the very end of the campaign, while people struggled to put food on the table and gas in their cars, Trump appeared at McDonald’s cooking fries and delivering orders at the drive-in window, and then sat in a garbage truck with a sanitation worker.\n\nMeanwhile, Harris was inviting her elite friends like former President Barack Obama, former First Lady Michelle Obama, Bruce Springsteen, Oprah, and Beyoncé to her rallies to campaign on her behalf.\n\nThese people are either millionaires or billionaires: So which candidate do you think related to the average American? \n\nWe know now the answer is Trump. \n\nHelen Jaeger\n\nWilliston Park\n\nNot only did President-elect Donald Trump collect enough Electoral College votes needed to win the presidency (a virtual replay of 2016), he is on track to get the popular vote as well. \n\nThat tells me that America has spoken.\n\nBut what is America saying — and are Democrats listening?\n\nOne thing is certain: America is not a gaggle of A-list celebrities, nor is it a bunch of mega-donors. \n\nAmerica is the average person on the street, with an average job and an average family. \n\nThe average American is not rich or famous or powerful.\n\nThey’re just people, and on Tuesday, those people spoke. \n\nAnd they said they prefer what Trump represents over what Harris represents.\n\nArthur Saginian\n\nSanta Clarita, Calif.\n\nThey called us “deplorables” and “garbage” and they called Trump “Hitler” and a “fascist.”\n\nNow we get to call them “losers.”\n\nAlan Marrus\n\nFairfax, VA\n\nIf Trump delivers on what he has promised, then all Democrats have to worry about for the next four years is the economy improving, and loan rates coming down, especially for mortgages.\n\nPhil MacDonald\n\nMarine Park\n\nDuring the course of this year’s presidential campaign, Trump has spoken openly about all the people he hates.\n\nAllow me to remind the new president-elect that “Hate will never make America great again.” \n\nPlease govern wisely.\n\nDenny Freidenrich\n\nLaguna Beach, Calif.\n\nTuesday, the voters of America spoke. \n\nThey told the world that we are a country focused on democracy and strength.\n\nPresident-elect Trump has a lot of work to do to fix all of the things that the Biden administration broke.\n\nThis time, he should appoint the right people who will actually get the job accomplished from the start.\n\nAmerica is back! Congrats to the American voters and to Trump for standing up for America.\n\nChuck Floyd\n\nMachipongo, Va.\n\nThis is the consequence of the Democrats’ actions, their rhetoric and the identity politics that they brought into the American political landscape.\n\nProgressive liberals: You have made your bed. \n\nNow lie in it.\n\nCharles Michael Sitero\n\nOrmond Beach, Fla.\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss the United States decisively electing Donald Trump to be its 47th president.","url":"https://nypost.com/2024/11/07/opinion/donald-trump-wins-2024-election-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/jtpa1.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-11-08 00:52:45","author":"Post Readers","authors":["Post Readers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.316},{"id":263442140,"title":"Arizona and Nevada Senate Races Face Unfounded Claims of Election Stealing","text":"Evidence-free claims of attempts to \"steal\" elections from Republican U.S. Senate candidates in Arizona and Nevada have emerged online despite the candidates exceeding expectations in both races.Republicans took control of the Senate on the back of a decisive presidential election victory by President-elect Donald Trump over Vice President Kamala Harris. Trump appears poised to win the popular vote and has won all of the swing states that have been called so far.As of Thursday evening, Republicans had a 53-seat majority in the Senate with the two seats in Arizona and Nevada still up for grabs, according to the Associated Press. Arizona and Nevada's presidential election are also yet to be called, although Trump has a clear lead in both states.In Arizona, Democratic U.S. Representative Ruben Gallego was leading Republican Kari Lake on Thursday by just over 50,000 voter, or around 2 percent of the vote total. Incumbent Democratic Senator Jacky Rosen was leading by a little more than 13,000 votes in Nevada, about 0.9 percent of the vote.While the final results are far from certain, it is clear that the Republican candidates in both states performed better than polling suggested. The bulk of pre-election polls showed the Democratic candidates with comfortable leads, including some surveys that suggested double-digit advantages.Regardless, conspiracy theorists have already emerged on social media to put forward unfounded claims that any loss by the Republican candidates must be the result of fraud.Newsweek reached out for comment to the campaign of Brown, Rosen, Lake and Gallego via email on Thursday evening.Robert Beadles, a businessman and right-wing activist with a history of pursuing unfounded election fraud claims, wrote that he \"can't wait for the investigations and prosecutions into all the election fraud in Nevada to begin\" in a Thursday post to X, formerly Twitter.Beadles claimed in a subsequent post that the reason Brown was trailing Rosen was a mysterious \"they\" had \"flooded the system with enough illegal votes days after the election to take the lead.\"\"Prominent Nevada election denier Robert Beadles claims without evidence 'they' are stealing the Senate race from Republican Sam Brown - referring to the process of counting legally cast mail ballots,\" Reno, Nevada journalist Ben Margiott wrote in response to Beadles. \"Unclear why 'they' also allowed Trump to win.Similar unsubstantiated claims were made about Lake's race against Gallego in Arizona. Mike Adams, a self-proclaimed \"Health Ranger\" who was described by Chicago Health magazine as a trafficker \"in conspiracies and supplements,\" claimed without evidence that the \"fraud\" was \"obvious.\"\"The obvious fraud in Arizona needs to be challenged in the courts, RIGHT NOW. Senate seats at stake,\" Adams wrote on X. \"And there's other fraud in House seats, in other states. The Dems ALWAYS steal the down-ballot races in the days after the election.\"None of the Senate candidates in Arizona and Nevada appear to be supporting the \"stolen\" election claims. Even Lake, who followed up her support for Trump's false 2020 election fraud claims by launching similar baseless claims about her loss in Arizona's 2022 gubernatorial election, was yet to make any fraud claims in the hours and days after this year's election.\"There is an extremely committed band of election deniers who are convinced Dems are stealing the Senate races in Nevada and Arizona but somehow forgot to steal the presidential,\" wrote senior Politico legal affairs reporter Kyle Cheney.","summary":"Conspiracy theories have emerged to claim the elections are being \"stolen\" from Republicans Sam Brown and Kari Lake.","url":"https://www.newsweek.com/arizona-nevada-senate-races-face-unfounded-claims-election-stealing-1982506","image":"https://d.newsweek.com/en/full/2515941/republican-senate-fraud-claims-election-arizona-nevada.jpg","video":null,"publish_date":"2024-11-08 00:52:08","author":"Aila Slisco","authors":["Aila Slisco"],"language":"en","category":"politics","source_country":"us","sentiment":-0.105},{"id":263442266,"title":"Ukrainians concerned about a Trump presidency","text":"Ukrainians concerned about a Trump presidency\n Many Ukrainians fear that President-elect Donald Trump will cut critical support to Ukraine or broker a deal that would have their country surrender territory and influence to Russian President Vladimir Putin. Imtiaz Tyab reports from Kyiv.","summary":"Many Ukrainians fear that President-elect Donald Trump will cut critical support to Ukraine or broker a deal that would have their country surrender territory and influence to Russian President Vladimir Putin. Imtiaz Tyab reports from Kyiv.","url":"https://www.cbsnews.com/video/ukrainians-concerned-about-a-trump-presidency/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/08/75802f40-a65d-4ef0-b552-5a7d3b8c3f3f/thumbnail/1200x630/574e3911c7867001ed741c2356c02f1d/1107-en-tyab.png?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-08 00:50:04","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.022},{"id":263442282,"title":"Rogan pleads with Trump: Choose unity, not revenge","text":"Podcaster Joe Rogan urged Donald Trump to choose unity rather than retribution after his presidential election victory.\n\nIn Thursday's episode on his wildly popular podcast, Rogan expressed enthusiasm for Trump's second term, but only if the president-elect could abandon his worst impulses.\n\n“He’s got to unite people. He’s got to not attack the left, not attack everybody, let them all talk their s**t, but unite,” Rogan said.\n\nRogan endorsed the president-elect the day before the election. The host spoke with Trump at length in October and listened to him call Democrats the “enemy from within,” but is still convinced Trump is the right man to depolarize the country.\n\nRogan made it clear that he thinks fears of a Trump dictatorship are overblown, noting that Trump has already held the office once. He blamed the media for fears of the second term that Trump is promising, singling out MSNBC's Joy-Ann Reid as a doomsayer.\n\n“Reid spent the entire time she was discussing Trump comparing him to Mussolini, Stalin, Hitler, talking about a right-wing authoritarian regime as if he had never been president for four years and didn’t behave like any of those things,” Rogan said.\n\n“We got a real chance to make real change,” Rogan added, sharing his excitement over Robert F. Kennedy Jr.’s potential role in Trump’s second administration. “This is like one of the first times ever where there’s a real chance to make real substantive change.\"\n\nWatch the episode below","summary":"The popular podcaster hoped Trump would try and bring people together, in spite of his campaign rhetoric","url":"https://www.salon.com/2024/11/07/rogan-pleads-with-trump-choose-unity-not-revenge/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2022/07/joe-rogan-0706221.jpg ?>","video":null,"publish_date":"2024-11-08 00:50:00","author":"Griffin Eckstein","authors":["Griffin Eckstein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.257},{"id":263442908,"title":"What migrants and border officials are saying about Trump's border plans","text":"What migrants and border officials are saying about Trump's border plans\n President-elect Donald Trump has promised to conduct mass deportations of undocumented migrants as part of his immigration overhaul. CBS News immigration and politics reporter Camilo Montoya-Galvez has migrants' and border officials' reactions.","summary":"President-elect Donald Trump has promised to conduct mass deportations of undocumented migrants as part of his immigration overhaul. CBS News immigration and politics reporter Camilo Montoya-Galvez has migrants' and border officials' reactions.","url":"https://www.cbsnews.com/video/what-migrants-border-officials-saying-trumps-border-plans/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/08/78e83362-93f3-4ea7-adb3-8f6c072a68c9/thumbnail/1200x630/26fbe6cf7a7837821e7ffd69676739d2/cbsn-fusion-what-migrants-border-officials-saying-trumps-border-plans-thumbnail.jpg?v=c1d30b1df13c40bf65c6c1e6d9a","video":null,"publish_date":"2024-11-08 00:50:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.487},{"id":263442264,"title":"Trump selects Susie Wiles as White House chief of staff, first woman ever in the role","text":"Trump selects Susie Wiles as White House chief of staff, first woman ever in the role\n As President-elect Donald Trump gears up for his second term in office, Trump announced Thursday that he has selected his campaign manager Susie Wiles to be his White House chief of staff. Wiles will be the first woman in U.S. history to hold the position. Robert Costa has the latest.","summary":"As President-elect Donald Trump gears up for his second term in office, Trump announced Thursday that he has selected his campaign manager Susie Wiles to be his White House chief of staff. Wiles will be the first woman in U.S. history to hold the position. Robert Costa has the latest.","url":"https://www.cbsnews.com/video/trump-selects-susie-wiles-as-white-house-chief-of-staff-first-woman-ever-in-the-role/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/07/19240428-ff04-42c4-9005-936eade64cf7/thumbnail/1200x630/f7f127ce21f16136f4a879740ecac36c/cbsn-fusion-trump-taps-susie-wiles-as-white-house-chief-of-staff-thumbnail.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-08 00:49:42","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.032},{"id":263442408,"title":"Trump names Susie Wiles as chief of staff, first woman in the post","text":"President-elect Donald Trump has named Susie Wiles, the defacto manager of his victorious campaign, as his White House chief of staff, the first woman to hold the influential role. Wiles is widely credited within and outside Trump’s inner circle for running what was, by far, his most disciplined and well-executed campaign, and was seen as the leading contender for the position. She largely avoided the spotlight, even refusing to take the mic to speak as Trump celebrated his victory early Wednesday morning. She resisted the formal title of campaign manager, avoiding becoming a target, given Trump’s history of cycling through people in that role. Wiles’ hire is Trump’s first major decision as president-elect and one that could be a defining test of his incoming administration, as he must quickly build the team that will help run the massive federal government. Wiles doesn’t bring much federal government experience to the role, but has a close relationship with the president-elect. On the campaign, Wiles was able to do what few others have been able to: help control Trump’s impulses — not by chiding him or lecturing, but by earning his respect and showing him that he was better off when he followed her advice than flouting it. Eight years ago, Trump tossed the careful planning of his transition team and instead hired a motley assortment of campaign aides, family members and Republican insiders who spent the better part of his first year in office engaged in infighting that dominated news coverage of the new administration. It was what many experts consider a foundational mistake that hamstrung a president who was new to Washington and government upon his swearing in. Trump went through four chiefs of staff — including one who served in an acting capacity for a year — during his first administration, part of a record-setting personnel churn. Many top aides were cast out by Trump in his first term, who resented being made to feel managed or condescended to, while others got caught up in ideological spats within the factionalized West Wing. Trump aides see hope that Wiles’ selection marks a sign that the president-elect is aiming to build a more cohesive team, though one that will almost certainly remain less conventional than his Democratic or Republican predecessors. Trump, who promised in 2016 to hire “only the best people” has since repeatedly said that he believes the biggest mistake of his first term was hiring the wrong people. He was new to Washington then, he has said, and didn’t know any better. But now, Trump said, he knows the “best people” and those to avoid for roles in his administration. “Susie is tough, smart, innovative, and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again,\" Trump said in a statement. \"It is a well deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud.” Successful chiefs of staff serve as the president’s confidant, help execute a president’s agenda and balance competing political and policy priorities. They also tend to serve as a gatekeeper, helping determine whom the president spends his time with and whom he speaks to — an effort Trump chafed under inside the White House. The chief of staff is “absolutely critical to an effective White House,” said Chris Whipple, whose book “The Gatekeepers” details how the White House chief of staff role shapes and defines a presidency. “At the end of the day the most important thing is telling the president what he doesn’t want to hear.\" “On the plus side, she’s shown that she can manage Trump, that she works with him and can sometimes tell him hard truths, and that’s really important,\" said Whipple. “On the minus side, she really has no White House experience and hasn’t really worked in Washington in 40 years. And that’s a real disadvantage.” Wiles is a longtime Florida-based Republican strategist who ran Trump’s campaigns in the state in 2016 and 2020, and Florida Gov. Ron DeSantis' successful bid for office in 2018. Before that, she ran Rick Scott’s 2010 campaign for Florida governor and briefly served as the manager of former Utah Gov. Jon Huntsman’s 2012 presidential campaign. Wiles also worked in the offices of former Jacksonville mayors John Delaney and John Peyton. Chris LaCivita, who along with Wiles served as de-facto campaign manager, described Wiles as someone who is inclusive in conversations, who seeks input from others and is steadfastly loyal. “Susie is just functionally built differently because she has that rare commodity to be able to work on so many different important issues simultaneously,” ...","summary":"","url":"https://www.deccanchronicle.com/world/trump-names-susie-wiles-as-chief-of-staff-first-woman-in-the-post-1836299","image":"https://www.deccanchronicle.com/h-upload/2024/11/08/1860357-aa-3420617.webp","video":null,"publish_date":"2024-11-08 00:49:41","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":-0.116},{"id":263441850,"title":"Oil Set for Weekly Gain as Market Digests Trump and China Impact","text":"A Donald Trump presidency may be net bearish for crude prices on higher domestic production and tariffs that will weigh on the Chinese economy, according to Citigroup Inc. Standard Chartered Plc said US oil producers won’t necessarily heed Trump’s call for more drilling. The president-elect is also expected to clamp down on Iranian oil exports.\n\nOil has been on a downward trend since April on tepid Chinese demand and a surge in supply from outside of the OPEC+ alliance, although the prospect of a ratcheting up in hostilities in the Middle East is keeping the market on edge. There are widespread expectations of a glut next year, but there’s still a lot of uncertainty that could tighten balances, according to Russell Hardy, chief executive officer of Vitol Group.\n\n“There’s still a lot of unknowns around the Middle East, around Iranian exports and Venezuelan exports under a new presidency,” Hardy said at a conference in Singapore on Thursday. “So I think it’s a little premature to conclude that the market’s going to be oversupplied in 2025.”\n\nThe Federal Reserve cut interest rates by a quarter percentage point on Thursday in a widely expected move. Economists expected the US central bank may have to slow down the pace of easing due to the inflationary impact of Trump policies including tax cuts and trade tariffs.\n\nTo get Bloomberg’s Energy Daily newsletter into your inbox, click here.","summary":"Oil headed for a weekly gain as the market digested the implications of a second Trump presidency, including whether it would spur an expansion of stimulus efforts from No. 1 importer China.","url":"https://financialpost.com/pmn/business-pmn/oil-set-for-weekly-gain-as-market-digests-trump-and-china-impact","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/11/775252323.jpg","video":null,"publish_date":"2024-11-08 00:47:23","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"ca","sentiment":-0.328},{"id":263442912,"title":"What could happen in Trump's hush money, election and classified documents cases","text":"What could happen in Trump's hush money, election and classified documents cases\n When President-elect Donald Trump takes office in 2025, he will be the first convicted felon to serve as president. CBS News contributor Rebecca Roiphe explains what will likely happen in his state and federal cases.","summary":"When President-elect Donald Trump takes office in 2025, he will be the first convicted felon to serve as president. CBS News contributor Rebecca Roiphe explains what will likely happen in his state and federal cases.","url":"https://www.cbsnews.com/video/what-could-happen-trumps-hush-money-election-classified-documents-cases/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/08/88d75c3e-01a3-4d47-b846-59fceb89185d/thumbnail/1200x630/607f27c4e45aad60a682382ebe44fb0d/cbsn-fusion-what-could-happen-trumps-hush-money-election-classified-documents-cases-thumbnail.jpg?v=c1d30b1df13c4","video":null,"publish_date":"2024-11-08 00:46:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.074},{"id":263443390,"title":"How the Latino voter shift powered Donald Trump to victory","text":"In U.S. elections, when Democratic presidential candidates get less than around 64% of the Latino vote, they typically lose, according to data reported on by Scripps News and found in an NBC exit poll.In 2024, Donald Trump received 45% of the Latino vote, while Kamala Harris received 53%, Scripps News reported. Hispanic voters became a deciding factor in the 2024 presidential election in an election marked by very dramatic turns over the weeks and months in the run up to Election Day. That bloc helped lead Trump to victory and a return for a second term in the White House. Harris' slight majority in that block was well below Joe Biden's 33 point margin there just four years ago. An October survey by the Hispanic Federation, a nonprofit organization, and Latino Victory Fund, a self-described progressive organization, found 64% of Latino voters in battleground states reported contact with campaigns and Latino civic organizations to encourage their vote — with more contact from Democrats, Scripps News previously reported. RELATED | Explaining the difference between Hispanic, Latino, Latina, Latinx, and LatineFrederick Velez, a senior director of community outreach with Hispanic Federation told Scripps News, \"Latinos keep becoming the most important bloc right now, of swing voters. What's important to say is a majority of Latinos, a majority of minorities still voted for VP Harris' policies. At the end, what we're seeing in the data is that Latinos prioritize the economy, and they felt that President-elect Trump was talking to them about the economic issues.\"","summary":"While Democrats had very significant amounts of contact with Latino organizations to encourage their vote according to multiple surveys, the bloc had a large push on Trump's victory in the election.","url":"https://www.scrippsnews.com/politics/how-the-latino-voter-shift-powered-donald-trump-to-victory","image":"https://ewscripps.brightspotcdn.com/dims4/default/b56b69f/2147483647/strip/true/crop/1052x552+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ffa%2F90%2F61d801cf4392a599713c6d1ad6cc%2Fscreenshot-2024-11-07-at-6-31-","video":null,"publish_date":"2024-11-08 00:45:26","author":"Scripps News Staff","authors":["Scripps News Staff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.461},{"id":263442136,"title":"Joe Rogan gives stern warning to Trump about how to make 'real tangible change' in second term","text":"Joe Rogan has warned President-elect Donald Trump that he has to unite people in his second term in office. \n\nThe comedian and UFC color commentator, 57, had been speaking on his highly popular podcast 'The Joe Rogan Experience' when he made the remarks. \n\nHe told his guest Dave Smith: 'This one is one of the first times ever where there's a real chance to make real tangible change that's gonna be for the good of everybody.\n\n'He's gotta unite people. He's gotta not attack the left, not attack everybody. Let them all talk their s***, but unite. Now it's time to unite everybody.'\n\nRogan had interviewed Trump late last month as the race for the White House intensified and publicly endorsed him for the presidency. \n\nAfter sitting down with Tesla CEO and ardent Trump supporter Elon Musk, Rogan said: 'If it wasn't for him (Musk) we'd be f***ed.\n\n''He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.\n\n'For the record, yes, that's an endorsement of Trump. Enjoy the podcast'.\n\nIt was a drastic reversal from his 2020 support for Sen. Bernie Sanders, I-Vt., a self-proclaimed democratic socialist who helped develop the Green New Deal.\n\nTrump and Rogan had spoken at large about UFOs, the unopened JFK and Martin Luther King assassination files as well as Trump's brush with death. \n\nThe podcaster interviewed the former president for three hours from his studio in Austin, Texas.\n\nRogan later revealed there had been talks to have Kamala Harris on his show with more than 18 million listeners, but it never materialized.\n\nHarris wanted to have the sit-down on the road while campaigning, but Rogan pushed back, saying that he wished they could have had conversation in his studio.\n\nTrump, meanwhile, made the journey to the Texas studio. The video has since been viewed over 46 million times. \n\nRepublican vice presidential nominee Ohio Sen. J.D Vance also recently sat down with Rogan.\n\nThe two delved into immigration, the economy and shot the breeze as the Trump campaign pulled out all the stops to reach young male voters - the primary audience of the podcaster's hugely popular show.\n\nHearing about the 'big news' on the eve of Election Day, Trump informed his audience at a rally of the podcasters endorsement of him.\n\n'So somebody that's very, very respected asked me to do his show two weeks ago, and I said, why not? \n\n'And to me, it's very big, because he's the biggest there is, I guess, in that world, by far.'\n\n'His name is Joe Rogan, and he's never done this before. And it just came over the wires that Joe Rogan just endorsed me, is that, right? Thank you, Joe,' Trump said.\n\nTrump joked to his crowd that his appearance on the show made him hours late to a rally afterwards.\n\nRogan said in 2022 that he would never have Trump on his podcast over fears it would help his campaign. \n\nDuring their podcast, Rogan revealed that once Thomas Matthew Crooks attempted to assassinate him he had to get him on. \n\n Trump told Rogan that the attempt on his life and the scarring had made him a 'tougher guy'. \n\nDuring an interview with Lex Fridman in 2022, Rogan told him that he had turned down multiple offers to have Trump on his podcast.","summary":"The comedian and UFC color commentator, 57, had been speaking on his highly popular podcast 'The Joe Rogan Experience' when he made the remarks.","url":"https://www.dailymail.co.uk/news/article-14056979/joe-rogan-stern-warning-donald-trump-change-second-term.html","image":"https://i.dailymail.co.uk/1s/2024/11/07/23/91828141-0-image-a-12_1731022527096.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/05/9206198868158267989/1024x576_MP4_9206198868158267989.mp4","publish_date":"2024-11-08 00:44:41","author":"Editor,Joe Hutchison","authors":["Editor","Joe Hutchison"],"language":"en","source_country":"gb","sentiment":0.095},{"id":263442788,"title":"Who is Susie Wiles, Donald Trump's new White House chief of staff?","text":"WASHINGTON (AP) — With her selection as President-elect Donald Trump ‘s incoming White House chief of staff, veteran Florida political strategist Susie Wiles moves from a largely behind-the-scenes role of campaign co-chair to the high-profile position of the president’s closest adviser and counsel.\n\nShe’s been in political circles for years. But who is Wiles, who is set to be the first woman to step into the powerful role of White House chief of staff?\n\nShe has decades of experience, most of it in Florida\n\nIn the 1970s, she worked in the Washington office of New York Rep. Jack Kemp. Following that were stints on Ronald Reagan’s campaign and in his White House as a scheduler.\n\nWiles then headed to Florida, where she advised two Jacksonville mayors and worked for Rep. Tillie Fowler. After that came statewide campaigns in rough and tumble Florida politics, with Wiles being credited with helping businessman Rick Scott win the governor’s office.\n\nAfter briefly managing Utah Gov. Jon Huntsman’s 2012 presidential campaign, she ran Trump’s 2016 effort in Florida, when his win in the state helped him clinch the White House.\n\nShe has a history with Ron DeSantis\n\nTwo years later, Wiles helped get Ron DeSantis elected as Florida’s governor. But the two would develop a rift that eventually led to DeSantis to urge Trump’s 2020 campaign to cuts its ties with the strategist, when she was again running the then-president’s state campaign.\n\nWiles ultimately went on to lead Trump’s primary campaign against DeSantis and trounced the Florida governor. Trump campaign aides and their outside allies gleefully taunted DeSantis throughout the race — mocking his laugh, the way he ate and accusing him of wearing lifts in his boots — as well as using insider knowledge that many suspected had come from Wiles and others on Trump’s campaign staff who had also worked for DeSantis and had had bad experiences.\n\nWiles had posted just three times on X this year at the time of her announcement. Shortly before DeSantis dropped out of the presidential race in January, Wiles made a rare appearance on social media. She responded to a message that DeSantis had cleared his campaign website of upcoming events with a short but clear message: “Bye, bye.”\n\nShe shuns the spotlight — most of the time\n\nJoining up with Trump’s third campaign in its nascent days, Wiles is one of the few top officials to survive an entire Trump campaign and was part of the team that put together a far more professional operation for his third White House bid — even if the former president routinely broke through those guardrails anyway.\n\nShe largely avoided the spotlight, even refusing to take the mic to speak as Trump celebrated his victory early Wednesday morning.\n\nBut she showed she was not above taking on tasks reserved for volunteers. At one of Trump’s appearances in Iowa in July of last year, as the former president posed for pictures with a long line of voters, Wiles grabbed a clipboard and started approaching people waiting to get them to fill out cards committing to caucus for Trump in the leadoff primary contest.\n\n“If we leave the conference room after a meeting and somebody leaves trash on the table, Susie’s the person to grab the trash and put it in the trash can,” said Chris LaCivita, who served as campaign co-chair along with Wiles.\n\nAnother of her three posts on X this year was in the closing days of the campaign, clapping back after billionaire Mark Cuban remarked that Trump didn’t have “strong, intelligent women” in his orbit. After Wiles’ selection as White House chief of staff, Sen. Marco Rubio of Florida, a Trump backer, quipped on X that the president-elect had chosen a “strong, intelligent woman” as his chief of staff.\n\nShe can control some of Trump’s worst impulses\n\nWiles was able to help control Trump’s worst impulses — not by chiding him or lecturing, but by earning his respect and showing him that he was better off when he followed her advice than flouted it. At one point late in the campaign, when Trump gave a widely criticized speech in Pennsylvania in which he strayed from his talking points and suggested he wouldn’t mind the media being shot, Wiles came out to stare at him silently.\n\nTrump often referenced Wiles on the campaign trail, publicly praising her leadership of what he said he was often told was his “best-run campaign.”\n\n“She’s incredible. Incredible,” he said at a Milwaukee rally earlier this month, noting that Wiles was the daughter of Pat Summerall, the football player and sportscaster.\n\nWill she have staying power?\n\nIn his first administration, Trump went through four chiefs of staff — including one who served in an acting capacity for a year — in a period of record-setting personnel churn.\n\nA chief of staff serves as the president’s confidant, helping to execute an agenda and balancing competing political and policy priorities. They also tend to serve as a gatekeeper, helping determine whom the president spends their time and to whom they speak — an effort under which Trump chafed inside the White House.\n\nTrump has repeatedly said he believes the biggest mistake of his first term was hiring the wrong people. He was new to Washington then, he has said, and didn’t know any better.\n\nBut now, Trump says, he knows the “best people” and those to avoid for jobs.\n\nAssociated Press writers Michelle L. Price and Zeke Miller in Washington and Jill Colvin in West Palm Beach, Florida, contributed to this report.\n\nMeg Kinnard can be reached at http://x.com/MegKinnardAP","summary":"WASHINGTON (AP) — With her selection as President-elect Donald Trump 's incoming White House chief of staff, veteran Florida political strategist Susie Wiles moves from a largely behind-the-scenes role of campaign co-chair to the high-profile position of the president's closest…","url":"https://www.thestar.com/news/world/united-states/who-is-susie-wiles-donald-trumps-new-white-house-chief-of-staff/article_1b876744-2b55-5381-a076-66fdce15db50.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/custom/image/f84403b8-7d76-11ee-9d02-a72a4951957f.png?resize=600%2C600","video":null,"publish_date":"2024-11-08 00:44:36","author":"Meg Kinnard The Associated Press,Wire Content","authors":["Meg Kinnard The Associated Press","Wire Content"],"language":"en","category":"politics","source_country":"ca","sentiment":0.098},{"id":263442142,"title":"Donald Trump picks Susie Wiles as his White House chief of staff","text":"WEST PALM BEACH, Florida: P resident-elect Donald Trump on Thursday announced that Susie Wiles, one of his two campaign managers, will be his White House chief of staff, entrusting a top position to a political operative who helped the Republican win election. The appointment was the first of what is expected to be a flurry of staffing announcements as Trump girds for a return to the White House on Jan. 20. As gatekeeper to the president, the chief of staff typically wields great influence. The person manages White House staff, organizes the president's time and schedule, and maintains contact with other government departments and lawmakers. The low-key Wiles, 67, will be the first woman to serve as White House chief of staff. Susie is tough, smart, innovative, and is universally admired and respected, Trump said in a statement. I have no doubt that she will make our country proud. Trump has been secluded at his Mar-a-Lago club in Palm Beach, Florida, since defeating Democrat Kamala Harris in Tuesday's election. He is considering a wide array of people for top jobs in his administration, many of them familiar figures from his 2017-2021 presidency, four sources said. Wiles, a long-time Florida-based political strategist, and fellow campaign manager Chris LaCivita are credited with running a more disciplined operation for Trump's third presidential bid compared with his past campaigns. Trump thanked them both during his victory speech early on Wednesday. Susie likes to stay in the back, let me tell you, Trump said, as she stood toward the back of the stage. We call her the ice maiden. Several people who have worked with Wiles said in interviews on Thursday that she would provide stability and sage counsel to Trump in the White House. Trump ran through four chiefs of staff - an unusually high number - during his 2017-2021 term as they struggled to rein in the famously undisciplined president. Susie is a strong woman and a true leader with a proven track record of getting things done, said Florida-based Republican consultant David Johnson. Wiles previously worked on Ronald Reagan's 1980 presidential campaign and helped Florida's Republican Governor Ron DeSantis win election in 2018. She served as a senior adviser on Trump's 2016 and 2020 bids. Trump chose Wiles over former House of Representatives Speaker Kevin McCarthy, a California Republican who is close to Trump and has been a frequent visitor to Mar-a-Lago. Sources said McCarthy had been in contention as well as Brooke Rollins, who was the former acting director of Trump's Domestic Policy Council. A fierce Trump ally, New York Republican Representative Elise Stefanik, is under consideration to be U.S. ambassador to the United Nations, a source familiar with the matter said. Former U.S. Ambassador to Germany Richard Grenell, who was an acting intelligence chief in Trump's first term and was with him when he recently met Ukrainian President Volodymyr Zelenskiy in New York, is under consideration for secretary of state. Republican Senator Bill Hagerty, a former U.S. ambassador to Japan, is also under consideration for that position, the sources said. Hagerty, asked by CNN about being considered for a role in Trump's administration, said, I'll leave the speculation to the speculators.","summary":"President-elect Donald Trump has appointed Susie Wiles as his White House chief of staff. Wiles, who served as one of Trump's campaign managers, played a key role in his election victory. Known for her political acumen and discreet approach, Wiles becomes the first woman to hold this significant position. Trump expressed confidence in her ability to serve the nation effectively.","url":"https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-picks-susie-wiles-as-his-white-house-chief-of-staff/articleshow/115067221.cms","image":"https://img.etimg.com/thumb/msid-115067224,resizemode-4,width-1200,height-900,imgsize-204876,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-11-08 00:44:25","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":0.398},{"id":263442914,"title":"Rep. Clyburn responds to Sen. Sanders saying Democrats lost working class","text":"Rep. Clyburn responds to Sen. Sanders saying Democrats lost working class\n Democrats and their allies are grappling with how Vice President Kamala Harris fell short to President-elect Donald Trump in the race for the White House. Independent Sen. Bernie Sanders of Vermont released a statement criticizing the Democratic Party for abandoning working-class people. Rep. James Clyburn of South Carolina joins \"The Daily Report\" to discuss.","summary":"Democrats and their allies are grappling with how Vice President Kamala Harris fell short to President-elect Donald Trump in the race for the White House. Independent Sen. Bernie Sanders of Vermont released a statement criticizing the Democratic Party for abandoning working-class people. Rep. James Clyburn of South Carolina joins \"The Daily Report\" to discuss.","url":"https://www.cbsnews.com/video/rep-clyburn-responds-sen-sanders-saying-democrats-lost-working-class/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/08/d70c22b4-82f4-4a82-a351-12ae3877cdd0/thumbnail/1200x630/01331d273ff40379073976b89527c2bf/cbsn-fusion-rep-clyburn-responds-sen-sanders-saying-democrats-lost-working-class-thumbnail.jpg?v=c1d30b1df13c40bf","video":null,"publish_date":"2024-11-08 00:43:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.413},{"id":263442138,"title":"\"Trump and the Future of American Power\"","text":"Stephen Kotkin is a preeminent historian of Russia, a fellow at Stanford University's Hoover Institution and Freeman Spogli Institute for International Studies, and the author of an acclaimed three-volume biography of Joseph Stalin. (The third volume is forthcoming.) Kotkin has also written extensively and insightfully on geopolitics, the sources of American power, and the twists and turns of the Trump era. Executive Editor Justin Vogt spoke with Kotkin on Wednesday, November 6, in the wake of Donald Trump's decisive victory in the U.S. presidential election.\n\nYou've written a number of times for about the war in Ukraine and what it means for the world and for American foreign policy. So let's start with an obvious question. It's impossible to know, of course, but what do you imagine Russian President Vladimir Putin is thinking right now, with Donald Trump poised to return to the White House for a second term?\n\nI wish I knew. These opaque regimes in Moscow and Beijing don't want us to know what they think. What we do know from their actions as well as their frequent public pronouncements is that they came to the view that America was in irreversible decline. We had the Iraq War and the shocking incompetence of the follow-up, where Washington lost the peace. And we lost the peace in Afghanistan. We had the 2008 financial crisis and the Great Recession. We had a lot of episodes that reinforced their view that we were in decline. They were only too happy to latch onto examples of their view that the United States and the collective West, as they call it, is in decline and, therefore, their day is going to come. They are the future; we are the past.\n\nNow, all of that happened before Trump. True, it looks like Trump is potentially a gift to them, because he doesn't like alliances, or at least that's what he says: allies are freeloaders. But what happened under Biden? It's not as if American power vastly increased under Biden, or under Obama, for that matter. So Trump may accelerate what Moscow and Beijing see as that self-weakening trend. But he's unpredictable. They may get the opposite. And they have revealed a lot of their own weaknesses and poor decision-making, to put it mildly.\n\nOn Ukraine, Trump's unpredictability could cut in many directions. Trump doesn't believe one thing or the other on Ukraine. And so in a way, anything is possible. It may turn out to be worse for Ukraine, but it may turn out to be better. It's extremely hard to predict because Trump is hard to predict, even for himself. You could even have Ukraine getting into NATO under Trump, which was never going to happen under Biden. Now, I'm not saying that's going to happen. I'm not saying there's even a high probability—nor am I saying it would be a good thing, or a bad thing, if it happened. I'm just saying that the idea that Trump is some special gift to our adversaries doesn't wash with me. And he may surprise them on alliances and on rebuilding American power. It might well cut in multiple directions at once.\n\nOK, but if you had to give Ukrainian President Volodymyr Zelensky advice right now, what would it be? …","summary":"A very interesting conversation in Foreign Affairs with my Hoover colleague Stephen Kotkin. The first several paragraphs: Stephen Kotkin is&#8230;\nThe post &#34;Trump and the Future of American Power&#34; appeared first on Reason.com.","url":"https://reason.com/volokh/2024/11/07/trump-and-the-future-of-american-power/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2021/11/the-volokh-conspiracy.jpg","video":null,"publish_date":"2024-11-08 00:42:50","author":"Eugene Volokh,Jacob Sullum","authors":["Eugene Volokh","Jacob Sullum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.302},{"id":263442614,"title":"FREDDY GRAY: Why Trump's hillbilly Veep JD Vance could be next in the White House?","text":"FREDDY GRAY: Why Trump's hillbilly Veep JD Vance could be next in the White House?\n\nFollow DailyMail.com's presidential election live blog for all the latest news and updates\n\nBy FREDDY GRAY\n\nPublished: 00:38 GMT, 8 November 2024 | Updated: 00:42 GMT, 8 November 2024\n\nHalfway through his victory speech on Tuesday night, a jubilant but exhausted Donald Trump turned to his soon-to-be vice-president, J D Vance, and asked him to take over. ‘Say a couple of words,’ Trump ordered.\n\nVance dutifully thanked the boss ‘for the trust that you placed in me’ and promised the crowd: ‘We’re going to lead the greatest economic comeback in American history.’\n\n‘He’s turned out to be a good choice,’ boasted Trump. ‘I took a little heat at the beginning, but... I know the brain was a good one, about as good as it gets.’\n\nThat’s high praise from The Donald, and Trumpologists were quick to note the possible significance of his blessing in that moment. \n\nWas it a portent of how the next US administration might shake out? Or a hint that, even in Trump’s mind, Vance is his heir apparent?\n\nTrump is 78 years old. By the start of his second stint in the White House, he’ll be 159 days older than his rival Joe Biden was on his inauguration day in 2021 – though Biden of course declined swiftly in office.\n\nJD Vance and his wife Usha (pictured)\n\nRepublican vice presidential nominee Sen. JD Vance, R-Ohio, arrives at a campaign event at Penn State Behrend Erie Hall, Saturday, Oct. 26, 2024, in Erie, Pa\n\nTrump is, inevitably, beginning to show some signs of frailty. And so Vance, 38 years Trump’s junior, will take on more and more of the executive workload.\n\nMoment tiny Indian village where JD Vance wife Usha's parents are from reacts to Trump win\n\nInsiders told me that the man they refer to as ‘J D’ will be the true driving force and the intellectual heft of the Trump agenda in 2025. \n\n‘He’s got a great team around him,’ says one. ‘They’re ready to get to work.'\n\nIt’s been quite the turnaround year for Vance, 40. After Trump nominated him on July 15, he suffered a torrid time at the hands of the Left-wing US media. \n\nPundits branded him ‘weird’ because he’s a devout Catholic and a staunch conservative. \n\nDemocrats inevitably took great pleasure in pointing out the awkward fact that, back in 2016, Vance had been highly critical of Trump, comparing him to ‘Hitler’ and ‘cultural heroin’.\n\nHis Indian-American wife, Usha Chilukuri Vance, has been the target of online abuse. Plus an old video of him insulting ‘childless cat ladies’ went viral, which led woke commentators to brand him a terrible and potentially election-losing nominee.\n\nRepublican vice presidential nominee JD Vance and his wife Usha listen as Republican presidential nominee former U.S. President Donald Trump speaks at his election night rally at the Palm Beach County Convention Center in West Palm Beach, Florida, U.S., November 6, 2024\n\nRepublican vice-presidential nominee JD Vance, Ivanka Trump and her husband Jared Kushner listen as Republican presidential nominee former U.S. President Donald Trump speaks at his election night rally\n\nRather than being cowed by these attacks, however, Vance opted to meet his critics head-on. \n\nIvanka's election night outfit sparks wild fan theories about how she really feels\n\nHe became the campaign’s best fighter in what Trump calls ‘the enemy camp’ – that is America’s utterly imbalanced Left-liberal media. \n\nHe made dozens of appearances on hostile news channels, showing skill in dismantling the arguments of his opponents. \n\nAnd while Trump flopped in his debate against Kamala Harris, Vance performed brilliantly in his head-to-head with the Democratic vice-presidential nominee Tim Walz.\n\nVance and Trump are opposites in many ways, but that has made them a formidable duo – with the former expected to act as a vital consigliere to his boss. \n\nVance is modest and unassuming in person. Trump is infamous for his braggadocio.\n\nVance grew up very poor in Ohio, served in the Marine Corps, and used his formidable brain to get into Yale Law School on a scholarship before going into politics. \n\nRepublican presidential candidate former President Donald Trump appears with vice presidential candidate JD Vance, R-Ohio, during the Republican National Convention, Monday, July 15, 2024, in Milwaukee\n\nRepublican vice presidential nominee JD Vance and his wife Usha, Ivanka Trump and her husband Jared Kushner, Linda McMahon, Howard Lutnick and Bryson Dechambeau listen as Republican presidential nominee former U.S. President Donald Trump speaks at his election night rally at the Palm Beach County Convention Center in West Palm Beach, Florida, U.S., November 6, 2024\n\nTrump was a New York rich kid who avoided military service and turned himself into a billionaire tycoon and TV star.\n\nTrump family portrait (minus Melania): First Lady skips celebratory picture after election victory\n\nTrump had other people write his books for him. Vance is the author of Hillbilly Elegy, an acclaimed memoir about his young life with a drug-addicted mother and no father figure.\n\nTrump has been married three times and used to pride himself on being a playboy. Vance is a devoted husband to Usha, with whom he has three children. \n\nTrump’s approach to politics is instinctive and transactional. Vance is an intellectual with a deep philosophical understanding of the conservative movementin America.\n\nBut – and this is the crucial point – Vance was not chosen simply because he could help Trump win in 2024. \n\nHe was selected as the man to lead the Make America Great Again movement after Trump moves on.\n\nVance and Trump agree on policy – from ‘America First’ in all matters to the importance of tariffs, drilling for oil and gas and strong borders. \n\nSenator JD Vance (3rd L) and his wife Usha Chilukuri Vance (2nd L), former senior adviser to Donald Trump, Ivanka Trump (3rd R) and former senior White House adviser, Jared Kushner (2nd R) attend an election night event held by Former US President and Republican presidential candidate Donald Trump at the Palm Beach Convention Center in West Palm Beach, Florida, United States, on November 06, 2024\n\nRepublican presidential nominee former President Donald Trump gives a thumbs-up as Republican vice presidential nominee Sen. JD Vance, R-Ohio, speaks at an election night watch party, Wednesday, Nov. 6, 2024, in West Palm Beach, Fla\n\nRepublican U.S. vice presidential nominee Senator JD Vance and his wife Usha Vance look at each other at Palm Beach County Convention Center, following early results from the 2024 U.S. presidential election, in West Palm Beach, Florida, U.S., November 6, 2024\n\nNow back in office, Trump may well do exactly what Biden did in his first year with Kamala Harris – make his vice-president the ‘border tsar’ with a special remit to address the issue of illegal immigration.\n\nWho is JD Vance's wife, Usha? Meet the woman behind Donald Trump's vice presidential pick\n\nHarris famously fluffed that role. Yet Vance is now expected to throw himself into what could be the defining – and most controversial – policy of the incoming administration’s first 100 days: a push to deport more than one million undocumented migrants.\n\nWith Trump approaching his dotage, Vance will also soon be deployed on the world stage. \n\nSome predict that, while Trump is likely to do the public peace deal-making with Vladimir Putin, his ‘Veep’ will play a key role behind the scenes in figuring out how to bring the stalemate in Ukraine to an end.\n\nOf course, it could all end badly: Trump’s former VP, Mike Pence, worked dutifully for four years only to find himself persona non grata in Trumpworld because he would not accept Trump’s dangerous insistence that he should refuse to certify the results of the contested 2020 election. \n\nJ D Vance may find himself, like so many before him, frozen out of Trump’s affections in the end.For now, however, he is in prime position to lead America’s resurgent Right into the 2028 presidential election – and beyond.\n\nDonald Trump\n\nShare or comment on this article:\nFREDDY GRAY: Why Trump's hillbilly Veep JD Vance could be next in the White House?\n\nAdd comment","summary":"Halfway through his victory speech on Tuesday night, a jubilant but exhausted Donald Trump turned to his soon-to-be vice-president, J D Vance, and asked him to take over.","url":"https://www.dailymail.co.uk/debate/article-14057459/FREDDY-GRAY-Trumps-hillbilly-Veep-JD-Vance-White-House.html","image":"https://i.dailymail.co.uk/1s/2024/11/08/00/91830833-0-image-a-93_1731026075338.jpg","video":null,"publish_date":"2024-11-08 00:42:48","author":"Editor,Freddy Gray","authors":["Editor","Freddy Gray"],"language":"en","category":"politics","source_country":"gb","sentiment":0.172},{"id":263442296,"title":"President-elect Trump names Susie Wiles as chief of staff, first woman in the post","text":"WASHINGTON — President-elect Donald Trump has named Susie Wiles, the defacto manager of his victorious campaign, as his White House chief of staff, the first woman to hold the influential role.\n\nWiles is widely credited within and outside Trump’s inner circle for running what was, by far, his most disciplined and well-executed campaign, and was seen as the leading contender for the position. She largely avoided the spotlight, even refusing to take the mic to speak as Trump celebrated his victory early Wednesday morning. She resisted the formal title of campaign manager, avoiding becoming a target, given Trump’s history of cycling through people in that role.\n\nWiles’ hire is Trump’s first major decision as president-elect and one that could be a defining test of his incoming administration, as he must quickly build the team that will help run the massive federal government. Wiles doesn’t bring much federal government experience to the role but has a close relationship with the president-elect.\n\nOn the campaign, Wiles was able to do what few others have been able to: help control Trump’s impulses — not by chiding him or lecturing, but by earning his respect and showing him that he was better off when he followed her advice than flouting it.\n\nEight years ago, Trump tossed the careful planning of his transition team and instead hired a motley assortment of campaign aides, family members and Republican insiders who spent the better part of his first year in office engaged in infighting that dominated news coverage of the new administration. It was what many experts consider a foundational mistake that hamstrung a president who was new to Washington and government upon his swearing-in.\n\nTrump went through four chiefs of staff – including one who served in an acting capacity for a year – during his first administration, part of a record-setting personnel churn. Many top aides were cast out by Trump in his first term, who resented being made to feel managed or condescended to, while others got caught up in ideological spats within the factionalized West Wing.\n\nTrump aides see hope that Wiles’ selection marks a sign that the president-elect is aiming to build a more cohesive team, though one that will almost certainly remain less conventional than his Democratic or Republican predecessors.\n\nTrump, who promised in 2016 to hire “only the best people” has since repeatedly said that he believes the biggest mistake of his first term was hiring the wrong people. He was new to Washington then, he has said and didn’t know any better. But now, Trump said, he knows the “best people” and those to avoid for roles in his administration.\n\n“Susie is tough, smart, innovative, and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again,” Trump said in a statement. “It is a well-deserved honor to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud.”\n\nSuccessful chiefs of staff serve as the president’s confidant, help execute a president’s agenda and balance competing political and policy priorities. They also tend to serve as gatekeepers, helping determine whom the president spends his time with and whom he speaks to – an effort Trump chafed under inside the White House.\n\nThe chief of staff is “absolutely critical to an effective White House,” said Chris Whipple, whose book “The Gatekeepers” details how the White House chief of staff role shapes and defines a presidency. “At the end of the day, the most important thing is telling the president what he doesn’t want to hear.”\n\n“On the plus side, she’s shown that she can manage Trump, that she works with him and can sometimes tell him hard truths, and that’s really important,” said Whipple. “On the minus side, she really has no White House experience and hasn’t really worked in Washington in 40 years. And that’s a real disadvantage.”\n\nWiles is a longtime Florida-based Republican strategist who ran Trump’s campaigns in the state in 2016 and 2020, and Florida Gov. Ron DeSantis’ successful bid for office in 2018. Before that, she ran Rick Scott’s 2010 campaign for Florida governor and briefly served as the manager of former Utah Gov. Jon Huntsman’s 2012 presidential campaign.\n\nWiles also worked in the offices of former Jacksonville mayors John Delaney and John Peyton.\n\nChris LaCivita, who along with Wiles served as de-facto campaign manager, described Wiles as someone who is inclusive in conversations, who seeks input from others and is steadfastly loyal.\n\n“Susie is just functionally built differently because she has that rare commodity to be able to work on so many different important issues simultaneously,” LaCivita told the Associated Press.\n\nWiles was the one who was tasked with having the toughest discussions with Trump and every pivotal conversation. She worked well with his family and developed relationships with Robert F. Kennedy Jr. and Elon Musk that put her in a position as a key conduit for Trump’s budding alliances with those men.\n\n“She can manage really any ego that comes her way,” LaCivita said. “And she doesn’t do it by any other way other than just being very straightforward and on top of the details.”\n\nHe added: “The most important commodity in politics is honesty and loyalty and Susie has both in copious amounts.”\n\nWiles was seen by Trump aides as someone who could guide his moods and impulses without necessarily restraining him. Trump often referenced Wiles on the campaign trail, publicly praising her leadership of what he said he was often told was his “best-run campaign.”\n\n“She’s incredible. Incredible,” he said at a Milwaukee rally earlier this month,\n\nAt a rally in Pennsylvania where Trump made one of his last appearances before the election, he launched into a profane and conspiracy-laden speech. Wiles was spotted standing offstage and appearing to glare at him.\n\nLater, at a rally in Pittsburgh, Trump seemed to acknowledge his advisers’ efforts to keep him on message.\n\nAfter complaining that men aren’t allowed to call a woman “beautiful” any longer, he asked if he could strike that word from the record. “I’m allowed to do that, aren’t I, Susan Wiles?” he mused.","summary":"On the campaign, Wiles was able to do what few others have been able to: help control Trump’s impulses — not by chiding or lecturing, but by earning his respect and showing him he was better off when he followed her advice.","url":"https://www.centralmaine.com/2024/11/07/president-elect-trump-names-susie-wiles-as-chief-of-staff-first-woman-in-the-post/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/11/Election_2024_Trump_32203_f32ab9.jpg?w=1000","video":null,"publish_date":"2024-11-08 00:42:19","author":"MICHELLE L. PRICE and JILL COLVIN - Associated Press,ZEKE MILLER,Zeke Miller, Michelle L. Price And Jill Colvin","authors":["MICHELLE L. PRICE and JILL COLVIN - Associated Press","ZEKE MILLER","Zeke Miller, Michelle L. Price And Jill Colvin"],"language":"en","category":"politics","source_country":"US","sentiment":-0.129},{"id":263442106,"title":"Donald Trump Announces First Female Chief Of Staff In US History","text":"Part of the hysterical, hyperbolic overreaction to the 2024 presidential election has been that Donald Trump's victory represents a \"war on women.\" Well, it appears to have been a quick war, if there ever was one. The Trump team announced on Thursday afternoon that the president-elect had chosen Susie Wiles as his chief of staff as the transition process begins. Wiles, who led the 2024 campaign for Trump, becomes the first ever female chief of staff in U.S. presidential history. A miraculous achievement, considering women had to ask their husband's permission to vote and no longer have any civil rights. \"Susie just helped me achieve one of the greatest political victories in American history and was an integral part of both my 2016 and 2020 successful campaigns,\" President-Elect Trump said in a statement. \"Susie is tough, smart, innovative and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again.\" Donald Trump Promotes Strong, Intelligent Woman After Mark Cuban Criticism Wiles, who is the daughter of late legendary football broadcaster Pat Summerall, is a universally respected figure in national politics. She's also a smart, strong, extremely competent woman, something that Kamala Harris campaign surrogate Mark Cuban said was an impossibility. Never doubt Mark Cuban's ability to be hopelessly incorrect on every possible issue. Wiles making history is notable on its own, but in a rare, unexpected turn of events, Trump's decision has been widely praised by all factions on the political right. Bizarre for a party that hates women, isn't it? Trump's appointment is yet another indication of how utterly absurd the left's hysterical ravings have become. The Trump administration is not going to erode women's rights; it didn't happen from 2016-2020 and it won't happen from 2024-2028. Quite simply, Democrats in 2024 have no common sense issues to run on. Their only tactic is to fear monger in hopes of boosting turnout from young women who get their information from TikTok. It didn't work. And the Wiles' choice is the first step in proving those fears wrong.","summary":"","url":"https://www.outkick.com/analysis/donald-trump-announces-first-female-chief-staff-us-history","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/11/trump-8.jpg","video":null,"publish_date":"2024-11-08 00:41:49","author":"Ian Miller","authors":["Ian Miller"],"language":"en","category":"politics","source_country":"us","sentiment":0.138},{"id":263441180,"title":"Trump ally — who could be AG — warns NY’s Letitia James to back off president-elect: ‘We will put your fata– in prison’ ","text":"A fierce ally of President-elect Donald Trump warned Thursday that the new administration will have no patience for New York Attorney General Letitia James if she weaponizes the legal system against the 47th president. \n\n“I dare you to try to continue your lawfare against President Trump in his second term,” Mike Davis, the founder of the Article III Project, an advocacy group that pushes for the nominations of conservative judges, said during an appearance on “The Benny Show” podcast. \n\n“Listen here, sweetheart,” Davis continued, addressing James. “We’re not messing around this time and we will put your fata– in prison for conspiracy against rights. I promise you that.” \n\nDavis, who has been floated as a possible Trump pick for attorney general or White House counsel in his incoming administration, urged the New York AG to “think long and hard” before potentially violating the president-elect’s “constitutional rights or any other Americans’ constitutional rights.”\n\n“It’s not going to happen again,” he declared. \n\nThe day after Trump defeated Vice President Kamala Harris in the presidential election, James, 66, threatened to “use the rule of law to fight back” against the future administration, noting that her office has been “preparing for several months” to counter Trump’s ascendance. \n\nJames won a $454 million civil fraud judgment against Trump, 78, earlier this year after accusing the real estate magnate of inflating his net worth by billions of dollars to get better loan and insurance terms.\n\nTrump has appealed the ruling.\n\n“I can imagine that the Trump 47 Justice Department is not going to have any patience for this Democrat lawfare over the next four years,” Davis said in an interview with Newsmax.\n\nThe former chief counsel for nominations to Senate Judiciary Chairman Chuck Grassley (R-Iowa) argued that James would be in violation of 18 U.S.C. § 241 — “conspiracy against rights” — if she continues to go after her “political enemies.”\n\nIn response to a Wall Street Journal report linking Davis to the White House counsel role under Trump, the lawyer suggested that his ambitions lie elsewhere. \n\n“No, thank you. I want to serve as the Viceroy,” he wrote on X.","summary":"A fierce ally of President-elect Donald Trump warned Thursday that the new administration will have no patience for New York Attorney General Letitia James if she weaponizes the legal system against the 47th president.  “I dare you to try to continue your lawfare against President Trump in his second term,” Mike Davis, the founder of &#8230;\n\n\nThe post Trump ally — who could be AG — warns NY’s Letitia James to back off president-elect: ‘We will put your fata– in prison’  appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/trump-ally-who-could-be-ag-warns-nys-letitia-james-to-back-off-president-elect-we-will-put-your-fata-in-prison/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/93230168.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-11-08 00:40:08","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.416},{"id":263441064,"title":"Chevrolet Silverado HD recalled","text":"Close navigation menu\n\nSubscriber Exclusive\n\nToday's Paper\n\nWest Rewards\n\nVanishing Cousins\n\nThe West Live\n\nCourt in the Act\n\nReveal sub navigationChevron Down Icon\n\nCourts & Justice\n\nReveal sub navigationChevron Down Icon\n\nWest Coast Eagles\nFremantle Dockers\n\nRugby Union\nHorse Racing\n\nReveal sub navigationChevron Down Icon\n\nHerd On The Terrace\n\nAgriculture\nBulls N’ Bears\n\nReveal sub navigationChevron Down Icon\n\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\n\nReveal sub navigationChevron Down Icon\n\nGreat Southern\n\nPeel/Rockingham\n\nReveal sub navigationChevron Down Icon\n\nEmma Garlett\nSarah-Jane Tasker\nJosh Zimmerman\nDean Alston\nRangi Hirini\n\nPaul Murray\n\nBasil Zempilas\nJoe Spagnolo\n\nReveal sub navigationChevron Down Icon\n\nHealth & Wellbeing\n\nReal Estate\nHouse That!\n\nEntertainment\nReveal sub navigationChevron Down Icon\n\nCelebrity Gossip\n\nCompetitions & Puzzles\n\nReveal sub navigationChevron Down Icon\n\nWestern Australia\n\nWest Travel Club\nPhotography\nTravel Tips\n\nReveal sub navigationChevron Down Icon\n\nSmartphones\n\nTelecommunications\n\nThe West Australian\nToday's PaperPlace an AdFriday, 8 November 2024\n\nBreaking News: Neighbour recalls moment he was confronted with burning homeChevron Right Icon\n\nChevrolet Silverado HD recalled\n\nWest Rewards External Logo\n\nEnjoy exclusive member discounts, giveaways and competitions with our subscriber rewards program.\n\nBook Now Perth’s most popular family outdoor cinemas is back! All profits improve the lives of kids facing health challenges. \nFind out More\n\nFrom around the site\n\n2025 Land Rover Discovery price and specs: More powerful diesel joins lineup\nHonda hybrids recalled due to fire risk\nHow will Donald Trump’s presidency affect Australia’s car industry?Premium\n2025 Deepal S07 price and specs: Electric SUV undercuts Model YPremium\n2025 Peugeot E-308 price and specs: Unusual launch for EV hatch\n2025 Mini John Cooper Works price and specs\n\nTop Stories\n\nFederal PoliticsCommentsStates greenlight PM’s social media age limits\n\n liveThe NightlyComments\n\n liveTrump names ‘tough’ chief of staff in US first\n\nThe Best Australian YarnCommentsThe 50 authors who made our short story contest’s longlist\n\nOur Network\n\nWest Rewards\nWest Regional Network\nWest Announcements \nWest Classifieds\nWestBusiness Events \nWest Travel Club\n\nMedia Education\nThe Nightly\n\nOur Partners\n\nReal Estate View\nHealthengine\nHuddle Insurance\n\nRaiz Invest\n\nStarts at 60\n\nSubscribe To\n\nThe West Australian Newspaper\nThe West Email Newsletters\n\nConnect with usMessenger IconSend us a message\nShare to FacebookShare to TwitterShare to InstagramShare to YoutubeRSS FeedEmail Us\n\nFrequently Asked Questions\nEditorial Policy\nEditorial Complaints\nPlace an ad in the Classifieds\nAdvertise in The West Australian\n\n© West Australian Newspapers Limited 2024\nPrivacy Policy\nTerms of Use\nCookie Settings\nThe West Australian","summary":"Chevrolet has recalled its Silverado HD pickup in Australia for a transmission fault that could cause sudden braking or wheel lockup.","url":"https://thewest.com.au/lifestyle/motoring/chevrolet-silverado-hd-recalled-c-16680591","image":"https://images.thewest.com.au/publication/C-16680591/9a93b6f506074ef904bef6f076e963d2577fbf8a-16x9-x0y156w3000h1688.png?imwidth=1200","video":null,"publish_date":"2024-11-08 00:38:40","author":"Josh Nevett","authors":["Josh Nevett"],"language":"en","source_country":"au","sentiment":0.887},{"id":263440866,"title":"Seoul shares open sharply higher on US rate cut","text":"South Korean stocks opened sharply higher, tracking overnight gains on Wall Street, after the US Federal Reserve lowered its benchmark interest rate by a quarter-percentage point. The Korean won also sharply gained against the greenback.\n\nThe benchmark Korea Composite Stock Price Index added 25.57 points, or 1 percent, to 2,590.2 in the first 15 minutes of trading.\n\nThe rate cut marked the second consecutive reduction following a 50-basis-point cut in September. The move came after Republican flag-bearer Donald Trump won in Tuesday's presidential election.\n\nOvernight the tech-heavy Nasdaq Composite increased 1.51 percent, and the S&P 500 went up 0.74 percent, closing at a record-high level. The Dow Jones Industrial Average closed nearly unchanged.\n\nIn Seoul, top tech giant Samsung Electronics rose 0.87 percent, and No. 2 chipmaker SK hynix added 1.82 percent.\n\nLeading battery maker LG Energy Solution gained 4.02 percent, and Samsung SDI increased 1.39 percent.\n\nCarmakers also opened higher, with Hyundai Motor moving up 0.48 percent and its sister Kia adding 0.74 percent. Auto parts maker Hyundai Mobis climbed 1.88 percent.\n\nThe local currency was trading at 1,384.9 won against the greenback, up 11.7 won from the previous session. (Yonhap)","summary":"South Korean stocks opened sharply higher, tracking overnight gains on Wall Street, after the US Federal Reserve lowered its benchmark interest rate by a quarter-percentage point. The Korean won also sharply gained against the greenback. The benchmar","url":"https://www.koreaherald.com/view.php?ud=20241108050116","image":"https://res.heraldm.com/content/image/2024/11/08/20241108050115_0.jpg","video":null,"publish_date":"2024-11-08 00:34:45","author":"Yonhap","authors":["Yonhap"],"language":"en","source_country":"KR","sentiment":-0.432},{"id":263441088,"title":"US President-elect Donald Trump names campaign manager Susie Wiles as Chief of Staff","text":"US President-elect Donald Trump on Thursday (local time) named his campaign manager Susan Summerall Wiles as White House Chief of Staff, his first major appointment since winning this week’s election.Her appointment was confirmed by US Vice President-elect JD Vance. “This is great news. Susie was a huge asset to President Trump on the campaign and will be a huge asset in the White House. She’s also just a really good person. Onward!,” Vance posted on X.Vance said that Wiles would serve as the first-ever female Chief of Staff in the history of the US.In a statement posted on X, he said, “The 45th and 47th President of the United States of America Donald J. Trump announced today that Susan Summerall Wiles, the winning Campaign Manager for President Trump’s highly successful 2024 Campaign for President, will be named President Trump’s White House Chief of Staff.”\n\nThis is great news. Susie was a huge asset to President Trump on the campaign and will be a huge asset in the White House. She’s also just a really good person. Onward! pic.twitter.com/Yj1aLYK4So\n— JD Vance (@JDVance) November 7, 2024\n\n“Susie Wiles just helped me achieve one of the greatest political victories in American history, and was an integral part of both my 2016 and 2020 successful campaigns,” President Trump said. “Susie is tough, smart, innovative, and is universally admired and respected. Susie will continue to work tirelessly to Make America Great Again. It is a well-deserved honour to have Susie as the first-ever female Chief of Staff in United States history. I have no doubt that she will make our country proud,” the statement further read.Earlier in the day, US President Joe Biden congratulated Trump and said that he would ensure an orderly transition of power following his victory in the presidential election.Biden emphasized that the will of the people prevails in a democracy and that his administration will work with Trump’s team to ensure a peaceful transfer of power.In a post on X, he said, “Yesterday, I spoke with President-elect Trump to congratulate him on his victory. And I assured him that I would direct my entire Administration to work with his team to ensure a peaceful and orderly transition. That’s what the American people deserve.”\n\nYesterday, I spoke with President-elect Trump to congratulate him on his victory. And I assured him that I would direct my entire Administration to work with his team to ensure a peaceful and orderly transition.\nThat’s what the American people deserve.\n— President Biden (@POTUS) November 7, 2024\n\nHe further emphasised the transparency of the American electoral system and stated that the system is “honest, fair, and transparent.”Biden also expressed gratitude to election workers, acknowledging their efforts in staffing voting sites, counting votes, and safeguarding the election’s integrity.","summary":"The News Mill","url":"https://thenewsmill.com/2024/11/us-president-elect-donald-trump-names-campaign-manager-susie-wiles-as-chief-of-staff/","image":"https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg","video":null,"publish_date":"2024-11-08 00:33:28","author":"ANI","authors":["ANI"],"language":"en","category":"politics","source_country":"in","sentiment":0.093},{"id":263442616,"title":"How Melania Trump will be a 'semi-attached' First Lady: TOM LEONARD looks at why she could spend more time in Mar-a-Lago and New York than in Washington DC","text":"Brief and bloodless, it was the classic Donald and Melania show of affection. As he turned to greet his wife on stage at his victory rally in Florida on Tuesday night, Melania, wearing a sombre grey Dior skirt-suit, offered him the usual chaste kiss on the cheek as she smiled serenely at the adoring MAGA crowd.\n\nSphinx-like as ever, the 54-year-old acknowledged the applause with a wave as her husband – 24 years her senior – proudly told supporters her memoir was the ‘number one bestselling book in the country’.\n\nHe went on: ‘She’s done a great job – she works very hard to help people so I just want to thank her.’\n\nBut whoever Melania’s been working hard to help, it’s hardly The Donald.\n\nWhen she made a brief and stilted speech nearly two weeks ago in New York’s Madison Square Garden, it was the first time she’d appeared alongside him, let alone spoken at a rally during the campaign.\n\nIn fact, during the past year or so, husband and wife have been seen together publicly on only a handful of occasions – and always at events that didn’t involve Melania having to travel more than a few minutes from home, whether in New York or Palm Beach, Florida.\n\nMelania – whose mother Amalija Knavs died in January – appears to have been preoccupied with raising her son, Barron, to whom she is clearly devoted. Aged 18 and 6ft 9in tall, he now towers over both his parents. Just as there’s nothing like a Melania Trump vanishing act to set the Washington rumour mill whirring – and there have been a few over the years – so a reappearance is calculated to set off fresh speculation about exactly how much the Slovenian former model wants to be a part of her husband’s political life.\n\nThat question has never been more relevant as she faces a return to the White House and reprising the role of First Lady. On election night 2016, this was a prospect she reportedly found so appalling that she burst into tears when it became clear Trump had won.\n\nMelania so hated the intense scrutiny she attracted as First Lady, she resisted moving into the White House for five months (blaming her son’s education) and frequently didn’t accompany her husband on official duties.\n\nNow sources close to the third Mrs Trump say that she will remain only semi-attached to the second Trump presidency.\n\nThe public expect the First Lady to reside in the White House with the President, but insiders have revealed she is likely to divide her time between her private apartment there, the Trump resort of Mar-a-Lago in Palm Beach, and their gold-encrusted penthouse apartment in Manhattan.\n\n‘She definitely won’t be going back to Washington to live,’ said a source. ‘She’ll stay between Florida and NYC. This is not what she signed up for.’\n\nAnd the Big Apple will always be her preferred base. New York has been Melania’s favourite city since she moved to the US from Eastern Europe in 1996, and it now has the added attraction of being the place where Barron goes to university.\n\nNone of this will come as a huge surprise to anyone who has read her autobiography, Melania, which revealed a carefully controlled if not icy woman – far from the helpless pawn of a domineering husband, as the Democrats first tried to claim.\n\nAfter all, she reportedly spent the best part of 2023 renegotiating the terms of the prenuptial agreement she has with her billionaire spouse.\n\nMelania was reportedly worried about how much money would be left over for her and Barron after his father had finished paying court-ordered damages and the lawyers’ bills incurred by his various legal cases. These now run into the hundreds of millions.\n\nA source told the New York Post: ‘Trump remains very rich, but with mounting legal bills and judgments.’ The renegotiated prenup would ‘provide a more solid future’ for Melania and their son should the couple split.\n\n‘It’s not that she threatened to leave him,’ the insider told the Post. The Trump camp declined to comment on the claims. One of the prices Melania has to pay for being the most hands-off First Lady in recent history is endless jibes from her husband’s opponents when she does suddenly pop up next to him.\n\n‘Melania Trump made a rare appearance in compliance with section 3, subsection 2.7 of her prenuptial agreement,’ said late night chat show host Jimmy Kimmel after she showed up at the New York rally two weeks ago.\n\nIt’s true that the couple’s physical chemistry can hardly be described as smouldering. Their public displays of affection rarely extend beyond some limp hand-holding and a few kisses on the cheek – although Trump did appear to move in for a kiss on the lips at the recent New York event.\n\nBut what can Americans expect? Being married to Donald Trump is hardly for the faint-hearted –and the past 18 months have been a bumper period for spousal embarrassment. Many might think a peck on the cheek is rather more than he deserves.\n\nLast year a jury in a civil case found that Trump sexually abused a writer and former agony aunt called E Jean Carroll in a New York shop changing room in 1996 but absolved him of raping her. When Trump insisted the episode had never happened, Carroll argued he had damaged her reputation by calling her a liar and sued for defamation. In January, a New York jury ordered Trump to pay $83.8million in damages.\n\nMrs Trump wasn’t seen at that trial nor was she present three months later when Trump appeared in another New York court, facing felony charges of falsifying business records over the Stormy Daniels scandal.\n\nThe case hinged on a $130,000 ‘hush money’ payment to the ex-porn star just before the 2016 election relating to Daniels’s claims that she’d had a brief sexual liaison with Trump ten years earlier, soon after Barron was born, at a Nevada golf tournament. Trump was reportedly angry Melania didn’t show her face at the six-week trial, which ended with him being found guilty on 34 charges and becoming the first US president to be convicted of a criminal offence.\n\nDespite a newspaper report that Melania had accepted Trump’s argument that the case against him was a ‘disgrace’ and a cynical attempt to damage his election prospects, his wife never made any statement in support of him. Insiders claimed she had privately referred to the Daniels farrago as ‘his problem’.\n\nIn the final weeks of his election campaign, however, she rallied to his aid, giving two interviews (to the pro-Trump Fox News) in which she sang her husband’s praises – as she did in her book.\n\nAsked what she most liked about him in September, she was unexpectedly gushing. ‘His being. His humour. His personality. His kindness,’ she enthused. ‘He’s very special. His positivity. His energy. It’s unbelievable. Yeah, so we have a beautiful relationship.’\n\nAs we have seen, it is a relationship that has been sorely tested by scandals, lawsuits and accusations of infidelity and sexual misconduct, yet in her 182-page memoir Melania ignored them and dwelt on the finer side of a man she insisted ‘isn’t flashy or dramatic, just genuine and caring’.\n\nThis is all very well but these qualities were clearly not sufficient to have her rushing to his side as he prepared for a second stab at the presidency.\n\nNor have they left Washington insiders expecting to see too much of her during his second turn as the most powerful man on the planet.","summary":"Brief and bloodless, it was the classic Donald and Melania show of affection. As he turned to greet her stage at his victory rally on Tuesday night, Melania, offered him the usual chaste kiss on the cheek","url":"https://www.dailymail.co.uk/debate/article-14057429/How-Melania-Trump-semi-attached-Lady-TOM-LEONARD-looks-spend-time-Mar-Lago-New-York-Washington-DC.html","image":"https://i.dailymail.co.uk/1s/2024/11/08/00/91830461-0-image-a-77_1731025514387.jpg","video":null,"publish_date":"2024-11-08 00:33:18","author":"Editor,Tom Leonard","authors":["Editor","Tom Leonard"],"language":"en","category":"politics","source_country":"gb","sentiment":0.17},{"id":263440414,"title":"Trump ally — who could be AG — warns NY’s Letitia James to back off president-elect: ‘We will put your fata– in prison’ ","text":"A fierce ally of President-elect Donald Trump warned Thursday that the new administration will have no patience for New York Attorney General Letitia James if she weaponizes the legal system against the 47th president. \n\n“I dare you to try to continue your lawfare against President Trump in his second term,” Mike Davis, the founder of the Article III Project, an advocacy group that pushes for the nominations of conservative judges, said during an appearance on “The Benny Show” podcast. \n\n“Listen here, sweetheart,” Davis continued, addressing James. “We’re not messing around this time and we will put your fata– in prison for conspiracy against rights. I promise you that.” \n\nDavis, who has been floated as a possible Trump pick for attorney general or White House counsel in his incoming administration, urged the New York AG to “think long and hard” before potentially violating the president-elect’s “constitutional rights or any other Americans’ constitutional rights.”\n\n“It’s not going to happen again,” he declared. \n\nThe day after Trump defeated Vice President Kamala Harris in the presidential election, James, 66, threatened to “use the rule of law to fight back” against the future administration, noting that her office has been “preparing for several months” to counter Trump’s ascendance. \n\nJames won a $454 million civil fraud judgment against Trump, 78, earlier this year after accusing the real estate magnate of inflating his net worth by billions of dollars to get better loan and insurance terms.\n\nTrump has appealed the ruling.\n\n“I can imagine that the Trump 47 Justice Department is not going to have any patience for this Democrat lawfare over the next four years,” Davis said in an interview with Newsmax.\n\nThe former chief counsel for nominations to Senate Judiciary Chairman Chuck Grassley (R-Iowa) argued that James would be in violation of 18 U.S.C. § 241 — “conspiracy against rights” — if she continues to go after her “political enemies.”\n\nIn response to a Wall Street Journal report linking Davis to the White House counsel role under Trump, the lawyer suggested that his ambitions lie elsewhere. \n\n“No, thank you. I want to serve as the Viceroy,” he wrote on X.","summary":"“We're not messing around this time and we will put your fata-- in prison for conspiracy against rights. I promise you that,” Mike Davis said of New York AG James.","url":"https://nypost.com/2024/11/07/us-news/trump-ally-mike-davis-warns-ny-ag-letitia-james-to-back-off-president-elect/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/93230168.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/CB1DjW3f-RyIcpnTz.mp4","publish_date":"2024-11-08 00:33:02","author":"Victor Nava","authors":["Victor Nava"],"language":"en","category":"politics","source_country":"us","sentiment":-0.416},{"id":263441102,"title":"NBA coach Doc Rivers says 'we have to support Trump' after bashing the him throughout election cycle","text":"Milwaukee Bucks head coach Doc Rivers gave his thoughts on Donald Trump's election win, saying Americans must stand behind the next president. \"Donald Trump is our president, and we're going to have to support him. We want him to do the best job for the country at the end of the day,\" Rivers told reporters after practice Wednesday. \"Do I like some of the things that he does? No. But now he's getting a second chance to be a better president than he was the first time, and I hope he is. I'm cheering for him. I really am.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Rivers has been a vocal critic of Trump and a staunch supporter of Kamala Harris after she became the Democratic nominee in July. Rivers most recently called Trump's campaign rally at Madison Square Garden Oct. 28 \"atrocious.\" Rivers even appeared in multiple political ads in support of Harris, providing his voice in one ad that accused Trump of \"empty promises.\" In another, he appeared in person next to Harris' husband, Doug Emhoff. \"I've known Kamala. This is the most involved I've ever been in an election, and a lot of it was personal because I've known Kamala for over 15 years. I thought she would have been a terrific president,\" Rivers said Wednesday. \"The problem is 65 million-plus disagreed with me.\" WALZ ZINGS BEARS AFTER CHICAGO SUFFERS CRUSHING LOSS ON HAIL MARY PLAY Trump has received more than 72 million votes in the election. Rivers is one of many high-profile NBA figures who have been outwardly critical of Trump, joining fellow coaches Steve Kerr of the Golden State Warriors and Gregg Popovich of the San Antonio Spurs and Dallas Mavericks minority owner Mark Cuban. That group has publicly acknowledged and accepted Trump's victory and encouraged other Americans to do the same since Tuesday's results despite previous partisan criticisms of the president. Rivers' made his comments about Trump's Madison Square Garden rally when the Bucks were playing the Brooklyn Nets across the East River Oct. 28. CLICK HERE TO GET THE FOX NEWS APP \"If you saw Madison Square Garden, I mean come on. … Like, right?\" Rivers said, via Sports Illustrated \"So, to me, it’s so important to vote. I’m gonna keep it as close to that as possible. But gosh. When I tell people, if the guy was so great, why did 80 million people vote against him the last time he ran. \"I don’t know. I don’t get it. But we gotta do something about — that was atrocious what we saw. If you’re a Black man or woman, Brown, Latino or Puerto Rican or … they hit everybody. And it was awful.\" Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Milawaukee Bucks head coach Doc Rivers told Americans they have to support President-elect Trump after being one of the president-elect&apos;s biggest critics.","url":"https://www.foxnews.com/sports/nba-coach-doc-rivers-says-we-have-support-trump-after-bashing-him-throughout-election-cycle","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/c76e2980-doc-rivers.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-08 00:32:39","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.235},{"id":263441252,"title":"Trump’s Win: Trade, Tariffs, and Australia’s Next Moves","text":"With Donald Trump poised to return as U.S. president, former Australian Ambassador to the U.S. Joe Hockey has outlined some challenges Australia could face as the new administration begins shaping its policies.\n\nHockey pointed to issues such as tariffs, China relations, and America’s economic priorities, stressing that Australia must prepare to navigate potential disruptions.\n\n“He will challenge us on tariffs, stepping up on international relations, confronting China, and much more,” Hockey said.\n\nDuring his campaign, Trump pledged to impose tariffs of up to 20 percent on most imports to the U.S. and significantly higher rates of 60 to 100 percent on goods from China.\n\nAustralia’s trade with the U.S. is governed by the Australia-United States Free Trade Agreement (AUSFTA), which has provided substantial tariff relief since it was enacted in 2005. Currently, 96.1 percent of Australian exports to the U.S. are tariff-free.\n\nHowever, when Trump took office in 2017, he introduced sweeping tariffs on global imports but granted Australia an exemption after significant diplomatic efforts.\n\n“We were the only country exempted from both tariff increases and quotas,” he noted.\n\nHowever, he said that there were many in the Trump administration keen to impose tariffs on Australia even then.\n\nShe pointed out that while the U.S. represents a smaller portion of Australia’s overall exports, it accounts for over 10 percent of South Australian exports, notably in beef, wine, and lead.\n\n“Any tariffs could seriously impact South Australian businesses,” Stone said.\n\n“He ran a campaign based on policy, because there’s no enormous love of Donald Trump on the ground in the United States, but there is great affection and hope in his policies,” he said.\n\nIn addition to the economy, immigration remains a key issue.\n\n“It’s tough to be the incumbent,” he said, noting that voters ousted both Trump and Biden after single terms when voter concerns were not addressed.\n\n“And they'll do it again unless Trump delivers this time around.”\n\nHe further highlighted the need to prioritise policies around voters’ financial security and personal safety.\n\nHockey commented, “Trump does forgive, but he doesn’t forget.”\n\nHe added that successful diplomacy under Trump hinges on personal rapport rather than ideological alignment.\n\n“Trump doesn’t automatically oppose those on the left or right. He’s more interested in personalities,” he said.\n\nHe also highlighted Rudd’s efforts to engage key figures within the Trump administration.\n\n“I know Kevin Rudd has been working overtime on a number of senior Trump Republicans, and hopefully for the sake of Australia, those relationships develop into a closer working relationship with a Trump administration.”","summary":"Former US Ambassador Joe Hockey urges Australia to brace for US challenges under Trump: tariffs, shifting trade policies, and China tensions.","url":"https://www.theepochtimes.com/world/trumps-win-trade-tariffs-and-australias-next-moves-5756350","image":"https://img.theepochtimes.com/assets/uploads/2024/11/07/id5756084-outside-300x180.jpg","video":null,"publish_date":"2024-11-08 00:32:32","author":"Naziya Alvi Rahman","authors":["Naziya Alvi Rahman"],"language":"en","source_country":"us","sentiment":-0.139},{"id":263440582,"title":"Kelly Dodd from Real Housewives of Orange County teases Andy Cohen for his response to Trump’s win","text":"Andy Cohen was trolled by Kelly Dodd over his surprising reaction to Donald Trump’s presidential election victory.\n\nWhen the Bravo head honcho, 56, took to social media to share a message to dejected voters and show his support for Vice President Kamala Harris, Dodd trolled him.\n\nThe Watch What Happens Live host reacted to the vice president’s loss in the election by sharing a message of hope and unity to his 5.5 million followers.\n\nMany of them left divisive messages in the comment section underneath his post.\n\nSome of them shared the same sentiment while some others, who shared a different opinion and were thrilled about Trump’s victory, mocked him instead.\n\nOne of them was Dodd, a former star on the Real Housewives of Orange County, who left a sarcastic comment: ‘Am I still on the wrong side of history?? Asking for a friend.’ \n\nDodd, a vocal supporter of the president-elect, also shared a post on her own Instagram page and tagged Cohen as she continued trolling him for supporting Harris.\n\nThe reality star shared a video of stand-up comedian Dave Chappelle getting a crowd laughing alongside the text: ‘Trying to stay humble today like…’ \n\nDodd wrote in her caption that she was laughing at the fact others said she was ‘on the wrong side of history.’ \n\nShortly after learning of the election results, Cohen had shared a video of him and his son talking about their ‘love’ for America. \n\n‘We love our country, yes we do. We will persist, we will move forward,’ he said even though he was one of the most vocal supporters of both the Democratic party and Harris. \n\nDuring Wednesday’s episode of What What Happens Live, Cohen also shared a similarly hopeful message as he gave his ‘Mazel of the Day.’\n\nFor the segment, he praised the democracy of America and encouraged those who were disappointed by the results to not give up. \n\n‘It is time for my Mazel of the Day, and in the spirit of unity, I want to give it to America, the country that I love,’ he began.\n\n‘I know, after last night’s election, half the country woke up feeling depressed, angry and scared, the other half was very excited,’ Cohen continued.\n\n‘That is democracy, and that is OK,’ he said. ‘Feel those feelings today, but please, for the love of God, don’t give up or threaten to move to Canada or anywhere else.’\n\nHe added: ‘The truth is, we need you right here, in this fight. You matter, and so do all the issues that made you vote in the first place. So, tomorrow, and every day forward, keep pushing for progress.’\n\nDodd was previously fired from the Real Housewives of Orange County after season 15 due to her controversial comments on the show. \n\nShe is known for being a controversial cast member, who has sparked fan outrage with her actions both on and off the show. \n\nIn 2021, she spoke about being ‘blindsided’ by her exit while making an appearance on SiriusXM’s Jeff Lewis Live. \n\n‘Listen, ultimately, I was fired because of myself. I’m the one who got myself fired,’ she said. \n\n‘I was causing them a lot of grief. I was causing them a lot of trouble. And you know, I’m sorry about that. Like, I feel bad.’","summary":"Andy Cohen was trolled by Kelly Dodd over his surprising reaction to&#8230;","url":"https://internewscast.com/news/us/kelly-dodd-from-real-housewives-of-orange-county-teases-andy-cohen-for-his-response-to-trumps-win/","image":"https://internewscast.com/wp-content/uploads/2024/11/rewrite-this-title-Andy-Cohen-trolled-by-Real-Housewives-of-800x430.jpg","video":null,"publish_date":"2024-11-08 00:31:12","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.196},{"id":263441072,"title":"A look at the top contenders to staff Trump's government","text":"Washington - U.S. President-elect Donald Trump on Thursday made the first appointment of his new administration — naming a chief of staff — with other key jobs set to be filled in the 'days and weeks ahead,' according to his team.'There are some people that will be returning (from Trump's first term),' senior Trump aide Jason Miller told Fox Business on Wednesday. 'And they'll be some new people joining the mix.'Linda McMahon, a former CEO of World Wrestling Entertainment, and Howard Lutnick, the founder of the brokerage firm Cantor Fitzgerald, are leading the transition process.","summary":"Susie Wiles, his election campaign chief, became Donald Trump's first appointment when she was unveiled as his chief-of-staff, as widely expected.","url":"https://www.japantimes.co.jp/news/2024/11/08/world/politics/trump-government-possibilities/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/08/432917.JPG?v=3.1","video":null,"publish_date":"2024-11-08 00:31:00","author":"Adam Plowright,Web Master","authors":["Adam Plowright","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.142},{"id":263441408,"title":"Trump and Zelenskyy agree to \"advance\" cooperation in war with Russia","text":"Trump and Zelenskyy agree to \"advance\" cooperation in war with Russia\n Ukrainian President Volodymyr Zelenskyy said he spoke with President-elect Donald Trump, agreeing to \"advance\" cooperation in its war with Russia on Thursday. CBS News correspondent Imtiaz Tyab has more on what a Trump presidency could mean for the war.","summary":"Ukrainian President Volodymyr Zelenskyy said he spoke with President-elect Donald Trump, agreeing to \"advance\" cooperation in its war with Russia on Thursday. CBS News correspondent Imtiaz Tyab has more on what a Trump presidency could mean for the war.","url":"https://www.cbsnews.com/video/trump-zelenskyy-agree-advance-cooperation-war-russia/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/08/b8063b03-df6e-4618-ab76-1676e85cd4c3/thumbnail/1200x630/e714ec338fa0fba05fda042700927e56/cbsn-fusion-trump-zelenskyy-agree-advance-cooperation-war-russia-thumbnail.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-08 00:31:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.407},{"id":263441768,"title":"Letters to the Editor, Nov. 8, 2024","text":"I am wondering if the Nov. 7 editorial “Massive rebuke for left-wing know-it-alls” was intended as an editorial or an ‘in-house’ staff memo meant to be sent directly to Warren Kinsella?\n\nPaul Taylor Toronto\n\n(We welcome diverse opinions in the Toronto Sun unlike many other media outlets)\n\nSIMPLY LAUGHABLE\n\nRe “Trump not only won but also taught valuable lesson to those in need of one” (Joe Warmington, Nov. 6): Warmington’s paean to Donald Trump has to be one of the finest pieces of political satire ever written.\n\nLouis Desjardins Belleville\n\n(Why do you hate Trump so much?)\n\nWHAT DIVIDES US\n\nRe “Trudeau’s long division” (Brian Lilley, Nov. 5): Thank you, Justin Trudeau. Long swords on the streets of a Canadian city and a battle over Indian politics and religion. Another outstanding and embarrassing Trudeau moment on the world stage. It’s interesting that he holds no one, including himself, accountable but simply said, “Every Canadian has the right to practice their faith freely and safely.” Trudeau definitely did not show the strong leadership that Mayor Patrick Brown did. This is Canada. There is no way the politics of India or any other country should be played out on the streets of any Canadian city. Trudeau’s open-door policies and lack of immigration controls are what created this mess, something he just woke up to a few weeks ago. Canada has always been acknowledged as a melting pot of nationalities, cultures and people. Individuals and families came to Canada to get away from religious strife and suffering, to be embraced by open, friendly and welcoming Canadian arms and the possibilities of a bright future. Trudeau has turned this country into a melting pot of hatred, religious feuds, and bladed weapons on our streets. It’s time to stand strong as Canadians, remove this hatred and these religious zealots from Canadian soil, and tell these individuals, ‘Canada isn’t for you, we will not tolerate your violence and religious hatred, please leave.’ And, as polite and respectful Canadians, we would also say, ‘Please take Justin with you.’\n\nMichael McNutt\n\n(The sooner Canada has the chance to throw Trudeau and his divisive government out of office, the better off our country will be)","summary":"MEMO TO WARREN I am wondering if the Nov. 7 editorial &#8220;Massive rebuke for left-wing know-it-alls&#8221; was intended as an editorial or an &#8216;in-house&#8217; staff memo meant to be sent directly to Warren Kinsella? Paul Taylor Toronto (We welcome diverse opinions in the Toronto Sun unlike many other media outlets) SIMPLY LAUGHABLE Re &#8220;Trump not [&#8230;]","url":"https://torontosun.com/opinion/letters/letters-to-the-editor-nov-8-2024","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/01/Friday-letters.jpg","video":null,"publish_date":"2024-11-08 00:30:27","author":"Postmedia News","authors":["Postmedia News"],"language":"en","source_country":"ca","sentiment":0.2},{"id":263440072,"title":"Will Trump use threat of closing Hong Kong trade offices as bargaining chip with Beijing?","text":"US President-elect Donald Trump may use legislation aimed at closing Hong Kong’s three trade offices in the country as a bargaining chip in talks with Beijing in the hopes of achieving his foreign policy goals, political watchers have said.\nIn response to inquiries from the Post about the former president’s political comeback and the implications for the offices, the Hong Kong government stressed on Thursday it attached importance to trade and business ties with both mature and emerging markets.\n“We therefore welcome interaction with the US’ trade and business sector,” a government spokesman said. “At the same time, we will continue to actively reach out to different places around the world to promote trade relationships and cultural ties, and tell the good stories of Hong Kong.”\nThe bipartisan Hong Kong Economic and Trade Office Certification Act, which passed the House of Representatives in September, must now clear the Senate before it can be sent to the US president and signed into law.\nOnce enacted, the president will have 30 days to explain to Congress why Hong Kong’s three offices should remain open or lose their privileges. If the president opts for decertification, the missions will be required to close within 180 days.\nVeteran political observer Sonny Lo Shiu-hing said passage of the bill would be tied to national security interests and Trump might use his power to shut down the Hong Kong Economic and Trade Offices (HKETO) to gain leverage against Beijing, as he was known for prioritising deal-making over ideological principles.\n“This may [become] a bargaining chip for the US to talk to China. There may be give-and-take politics,” Lo said. “For example, regarding the alleged North Korean involvement in Russia’s invasion of Ukraine, he might ask whether China can mediate with North Korea.”\n\nBrian Wong Yue-shun, assistant professor of philosophy at the University of Hong Kong, said the bill was almost certain to pass in its current form or a modified version in the new legislative session.\nBut he questioned whether Trump would indeed treat the bill as a bargaining chip, arguing the shutdown of the offices would force Beijing leaders to then decide what action to take to preserve reciprocity while also minimising escalation.\n“What we might realistically expect, really, is more pressure from Congress to close down the HKETOs, to target Hong Kong-registered companies and to enforce what the Americans view to be so-called compliance with their requirements concerning export bans and trade restrictions,” Wong said.\n“If the Republican Party gains a majority in both the House and Senate, then this absolute majority could well grant them impunity to pursue reckless politicisation and overt weaponisation of our very city for their own gains.”\nLawmaker Rock Chen Chung-nin, honorary chairman of the Chinese General Chamber of Commerce, said that while closing the offices would affect communication between the Hong Kong administration and the business and political communities in the United States, alternative solutions could be found.\n“The Hong Kong government has to think of some kind of new organisations, like non-government organisations, to replace the offices’ role in the US,” said Chen, who is also a member of the Legislative Council’s financial affairs panel.\n\nRonny Tong Ka-wah, a member of the key decision-making body Executive Council, expressed doubt that any strategic changes from Hong Kong would make a difference in changing the prejudices of US politicians against Hong Kong.\n“Our target should be the American people and businessmen, and hope they will exert some pressure on the administration,” he said. “In this sense, Trump is better than [Democratic opponent Kamala] Harris in that he’s driven not by political ideology but self-interest.”\nTong said Hong Kong could invest in lobbying and media advocacy in a bid to foster public opinion in the US that would favour better trade arrangements between the city and the country, although he recognised “we are not good at both”.\nThe appointment of a China hawk in key positions, such as secretary of state, would also discount such efforts, he added.\nAs a candidate, Trump also said he would “100 per cent” speak to Chinese President Xi Jinping about getting former media mogul Jimmy Lai Chee-ying out of the country. The promise was a rare reference to Hong Kong in a campaign overwhelmingly focused on the domestic concerns faced by voters.\nLai is behind bars in the maximum-security Stanley Prison and awaiting the resumption of his high-profile national security trial on foreign collusion and sedition charges.\nBernard Chan, former convenor of Exco, dismissed Trump’s comments about freeing Lai, saying the decisions of Hong Kong’s courts “would not be influenced by anyone’s remarks”.\nHe said Trump might not raise tariffs on Chinese goods as previously suggested, but communication between the Hong Kong and US administrations would continue to be challenging.\nAdditional reporting by William Yiu","summary":"Bill allowing president to close city’s trade missions has passed House and could become tool for Trump to negotiate with China, experts say.","url":"https://www.scmp.com/news/hong-kong/politics/article/3285642/will-trump-use-threat-closing-hong-kong-trade-offices-bargaining-chip-beijing","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/07/fd93839f-7ae9-4311-a9c9-5aaf013db645_e87e6989.jpg","video":null,"publish_date":"2024-11-08 00:30:08","author":"Kahon Chan","authors":["Kahon Chan"],"language":"en","category":"politics","source_country":"cn","sentiment":0.017},{"id":263440406,"title":"‘We won’t sit idle’: Newsom, California officials prepare for Trump legal battles","text":"On the heels of Donald Trump’s decisive victory to reclaim the White House, Gov. Gavin Newsom and California officials in the deep blue state are reviving legal and legislative strategies to push back on the president-elect’s vision to “restore America to greatness” in his second term.\n\nOn Thursday, Newsom directed state lawmakers to hold a special session next month to prepare for how to respond to Trump’s agenda, including combating what California Democrats fear will be attacks on reproductive rights, climate measures, health care programs and undocumented immigrants.\n\nWithout offering details, Newsom urged the State Legislature to set aside additional funding for the California Department of Justice in anticipation of a potential flurry of litigation against the Trump administration.\n\n“The freedoms we hold dear in California are under attack — and we won’t sit idle,” Newsom said in a statement. “California has faced this challenge before, and we know how to respond.”\n\nOn the campaign trail, Trump pledged to deport millions of undocumented immigrants, slash environmental regulations, roll back LGBTQ protections, force homeless people into “tent cities” and threatened to send the military into cities run by Democrats as part of an effort to root out “the enemy from within.”\n\nAfter a sweeping electoral victory and Republicans claiming likely majorities in both the U.S. House of Representatives and U.S. Senate, Trump appears emboldened to push aggressively to realize that agenda.\n\n“I will govern by a simple motto: promises made, promises kept,” he told supporters during his acceptance speech in Florida on Tuesday.\n\nDuring Trump’s first term, California had some success in thwarting his plans and policies. The state sued the Trump administration more than 120 times, scoring victories to preserve the Deferred Action for Childhood Arrivals — which protects undocumented immigrants who came to the United States as children — defend the state’s clean air rules and halt restrictions on abortion access at federally funded clinics.\n\nAt a news conference in the foreground of the Golden Gate Bridge at San Francisco’s Crissy Field on Thursday, California Attorney General Rob Bonta said his office has already prepared draft litigation, and has been coordinating with other state attorneys general in recent months in the event of a Trump victory. The specific details of those efforts were unclear.\n\nBonta said California won the “supermajority” of cases it filed against Trump’s administration during his first term and was confident it could be successful again. “We are ready, we are prepared, we have thought through all of the possibilities of the attacks on our values — on our state,” he said.\n\nState Republicans, meanwhile, were quick to dismiss the moves by Newsom and Bonta as a “political stunt” to distract from Democrats’ losses not just in Washington, D.C., but across California.\n\n“Even with the massive deficit he created, Governor Newsom wants to hand his Attorney General a blank check to wage endless battles against the federal government—while our own state is on fire, both literally and metaphorically,” Senate Minority Leader Brian Jones, from San Diego, said in a statement, apparently referring to the destructive Mountain Fire burning in Ventura County.\n\nLegal experts and officials expect clashes between California and Trump could come over attempts to pass a national abortion ban or restrictions on abortion medication, revoke the state’s ability to regulate automobile emissions, weaken its gun laws, cut funding to Medi-Cal and Obamacare health insurance exchanges, ban transgender athletes in women’s sports and end protections for undocumented immigrants.\n\nPaul Nolette, a Marquette University political science professor who studies state lawsuits against the federal government, said Democratic attorneys general across the country are preparing an “unprecedented amount of litigation” to file on “literally day one of the Trump Administration.”\n\nHe added that when it comes to defending California’s climate policies, the state will likely continue seeking regulatory agreements and settlements directly with automakers, energy companies and other industries. In 2019, the state inked agreements with Ford, Honda, BMW and Volkswagen to comply with California’s emissions standards.\n\nNolette said California, which boasts among the largest economies in the world, could also seek climate pacts with other countries in Europe or Canada, even if the Trump administration pulls out of international climate accords.\n\n“That can run largely independently of what’s happening in Washington, and it gives an opportunity to really advance California’s goals,” he said.","summary":"Newsom asked state lawmakers to set aside funding to sue Trump administration.","url":"https://www.mercurynews.com/2024/11/07/california-trump-newsom-bonta-lawsuits-special-session/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/SJM-L-ASSEMBLY-1002-1_1084694446_206885449.jpg?w=1024&h=720","video":null,"publish_date":"2024-11-08 00:28:24","author":"Ethan Varian","authors":["Ethan Varian"],"language":"en","source_country":"us","sentiment":0.332},{"id":263442550,"title":"What will a second Donald Trump term mean for Mexico?","text":"Migrants. Drugs. Imports that pose a threat to the viability of industries in the United States.\n\nU.S. President-elect Donald Trump would like to stop them all from entering the U.S. from Mexico.\n\nThe lengths to which he is willing to go to get what he wants could significantly define Mexico’s relationship with the United States during the four years of the second Trump presidency.\n\nTrump’s stated plans to carry out “the largest deportation operation in American history” and renegotiate the USMCA free trade pact are also likely to have a profound impact on Mexico if they come to fruition.\n\nClaudia Sheinbaum, sworn in as Mexico’s first female president five weeks ago, will become the third Mexican president to deal with soon-to-be President Trump, who is well-known for his unpredictability.\n\nSheinbaum’s capacity, and that of other Mexican officials, to effectively manage the relationship with the second Trump administration, and defend Mexico’s interests under the almost inevitable pressure to come, will be crucial to the success of her government, and the country as a whole.\n\nIn her initial remarks on Trump’s victory, she sought to downplay the risk he will pose to Mexico as president, telling Mexicans both here and in the United States that “there is no reason for concern.”\n\n“… There will be a good relationship with the United States. I’m sure about that,” Sheinbaum said.\n\nWhile there is no certainty that the Trump administration will execute plans precisely as they were described during the presidential election campaign — perhaps it is even unlikely — there is still significant concern in Mexico about how the country will be affected by them.\n\nWhile he is a polarizing — and popular — figure in the United States, Trump is widely disliked in Mexico, in large part due to the various disparaging remarks he has made about the country and its people.\n\nWith the commencement of a second Trump administration just 2 1/2 months away, let’s take a closer look at how some of the plans of the 47th U.S. president could affect Mexico.\n\nTrump’s border security plan and Mexico’s potential role in it \n\nDuring a victory speech in Florida in the early hours of Wednesday morning, Trump once again pledged to “fix our borders.”\n\nHe made stopping illegal immigration to the United States via Mexico a central platform of his third presidential bid, and during his campaign outlined plans to hire an additional 10,000 border agents, deploy the military to the border, expand the border wall and implement immigration policies even stricter than those of his first term.\n\nThe success of his plan, however, could ultimately hinge on Mexico’s willingness and capacity to stop migrants from reaching the Mexico-United States border.\n\nTrump is well aware of that, prompting him on the eve of the U.S. presidential election to issue a threat to “immediately” impose a 25% tariff on all Mexican exports to the United States if the government of Mexico doesn’t stop what he called an “onslaught” of criminals (read migrants) and drugs to the U.S.\n\nHe used a tariff threat to his advantage during his first term as president, pledging to impose 5% duties on all Mexican exports if the Mexican government didn’t do more to stem migration to the United States.\n\nThe two countries subsequently reached a deal that averted the blanket tariffs and resulted in Mexico deploying federal security force members to both its southern and northern border.\n\n“We got Mexico to give us 28,000 soldiers free of charge, no cost, and we had the greatest border in history,” Trump said at a rally in 2023.\n\nWill he have similar success in getting Mexico to effectively become a second “border wall” during his second term as president? According to a former head of Mexico’s National Immigration Institute, his chances are good.\n\n“We’ve seen what Trump does. What he is proposing is the 3.0 version of the same increased pressures on Mexico,” Tonatiuh Guillén told The New York Times.\n\n“Mexico gave in to the pressures back then, and the question is whether Mexico will give in again. I think the likelihood it will is high,” he said.\n\nTrump on Monday said his tariff plan has “a 100% chance of working” because if Mexico — the world’s biggest exporter to the United States — doesn’t respond to a 25% tariff threat, he’ll increase it to 50%, 75% or even 100% if need be.\n\nWhile he has continued to claim that the United States is being “invaded” by migrants, illegal crossings into the U.S. have in fact declined significantly since U.S. President Joe Biden enforced a new border policy in early June.\n\nHow would mass deportations from the US affect Mexico?\n\nIn addition to stopping migrants coming into the United States, Trump wants to get large numbers of those already there out of the country.\n\nReuters reported on Wednesday that Trump is “expected to mobilize agencies across the U.S. government to help him deport record numbers of immigrants, building on efforts in his first term to tap all available resources and pressure so-called ‘sanctuary’ jurisdictions to cooperate, according to six former Trump officials and allies.”\n\nThere are an estimated 4 million undocumented Mexican migrants in the United States that could face expulsion under Trump’s mass deportation plan.\n\n“Mexico could also find itself pressured, as in the past, to accept Venezuelans, Nicaraguans or Cubans, who are sometimes unable to be deported to their origin countries for diplomatic reasons,” the New York Times reported.\n\nThe deportation of large numbers of Mexicans could have a considerable impact on the amount of money Mexico receives in remittances (more than US $63 million in 2023), and completely cut off a much-needed source of income for many Mexican families.\n\nFurthermore, the Mexican economy could struggle to provide jobs for large numbers of deportees who suddenly find themselves in Mexico after being uprooted from their lives in the United States. Unemployment would inevitably increase if the economy can’t integrate them all.\n\nNeedless to say, the deportation of large numbers of migrants from the United States — many of whom work in low-paid but essential jobs — would also have a major impact on the U.S. economy.\n\n“It would be an economic disaster for America and Americans,” said Zeke Hernández, an economics professor at the Wharton School of the University of Pennsylvania.\n\n“It’s not just the immigrants who would be harmed, but we, the people of America, would be economically harmed,” he said.\n\nHow far could Trump go to combat Mexican cartels?\n\nBoth “criminals” and “drugs” are what Mexico needs to stop crossing the border into the U.S. if it is to avoid tariffs on its exports, according to the threat Trump made on Monday.\n\nWhile he put the onus on Mexico with that remark, Trump has indicated that his future government could take additional action of its own to stem the northward flow of drugs such as cocaine, methamphetamine and fentanyl, a powerful synthetic opioid largely responsible for the drug overdose crisis in the United States in recent years.\n\nIn August, he pledged to “impose the death penalty on major drug dealers and traffickers.”\n\nIn July, he said that military strikes against Mexicans cartels such as the powerful Sinaloa Cartel, and their drug-manufacturing facilities, were “absolutely” an option.\n\n“Mexico’s going to have to straighten it out really fast or the answer is ‘absolutely,'” Trump told Fox News.\n\nDuring his first term as president, Trump floated the idea of firing missiles into Mexico to combat cartels, according to his former Secretary of Defense Mark Esper.\n\nOther Republican party figures, such as Senator Lindsey Graham, have advocated the use of the United States military in Mexico to combat cartels that smuggle fentanyl and other drugs into the U.S.\n\nFormer president Andrés Manuel López Obrador categorically rejected the idea that the United States military could be used in Mexico, and in 2019 declined an offer from Trump to help Mexico combat organized crime after an attack on members of an extended Mormon family in northern Mexico that killed three women and six children.\n\nIf the United States was to unilaterally use its military against Mexican cartels, it would be “extremely damaging” for the U.S.-Mexico relationship, according to the head of the Inter-American Dialogue, Rebecca Bill Chavez, who was quoted by The New York Times.\n\nShe said that such a move — which would not necessarily result in less narcotics reaching the United States — could jeopardize all cooperation between Mexico and the U.S., including on trade.\n\nSheinbaum is continuing to use the Mexican military for law enforcement against cartels, but it is virtually unthinkable that she would consent to U.S. military action against the criminal organizations, no matter how determined she is to combat high levels of violent crime in Mexico.\n\nIn response to a tariff threat from Trump, the Sheinbaum administration could conceivably argue that Mexico is already making significant efforts to stop illegal drugs crossing into the United States.\n\nFederal officials made that argument during the previous term of government, with former foreign affairs minister and current Economy Minister Marcelo Ebrard describing Mexico as “the United States’ main ally in the fight against fentanyl.” \n\nIndeed, the Mexican government seized a record amount of fentanyl during former President Andrés Manuel López Obrador’s six-year term, an achievement acknowledged by U.S. Secretary of State Antony Blinken earlier this year.\n\nTrump’s other tariff threats\n\nDuring the election campaign, Trump also made repeated threats to impose hefty tariffs on vehicles made in Mexico. His threats appeared mainly directed at Chinese automakers that are planning to open plants in Mexico, such as BYD, but in September he pledged to “put a 100% tariff on every single car coming across the Mexican border.”\n\nLast month, he issued the following warning to Chinese automakers planning to establish a presence in Mexico, and export cars to the United States (which BYD, for one, has said it has no intention of doing):\n\n“I will impose whatever tariffs are required — 100%, 200%, 1,000% — they’re not going to sell any cars into the United States with those plants,” Trump said, referring to facilities that have not yet been built.\n\nAs president, he also said he would “seek strong new protections against transshipment so that China and other countries cannot smuggle their products and auto parts into the United States tax-free through Mexico to the detriment of our workers and our supply chains.”\n\nU.S. tariffs on vehicles made in Mexico would of course be detrimental to Mexico’s vast auto sector, whose exports primarily go to the United States. Tariffs specifically targeted at vehicles made in Mexico by Chinese automakers could cause such companies to reconsider their plans to invest in Mexico, even as they publicly say they have no intention to export to the U.S.\n\nCancellation of Chinese auto plant plans would, of course, mean that Mexico doesn’t receive the investment and associated benefits it otherwise would.\n\nMexico could also come under pressure from the Trump administration to limit its trade and investment dealings with China and Chinese companies.\n\nThere are signs that it is already yielding to U.S. pressure.\n\nWhile federal officials have insisted that Chinese investment is welcome in Mexico, Reuters reported in April that pressure from United States authorities had led the Mexican government to refuse to offer incentives to Chinese electric vehicle manufacturers planning to invest in Mexico.\n\nFurthermore, the Sheinbaum administration appears determined to reduce reliance on Chinese imports. Deputy Economy Minister for Foreign Trade Luis Rosendo Gutiérrez Romano told The Wall Street Journal last month that the government wants U.S. automakers and semiconductor manufacturers with a presence in Mexico, as well as large aerospace and electronics companies, to substitute some goods and components made in China as well as Malaysia, Vietnam and Taiwan.\n\nSuch an initiative would presumably be welcomed by a U.S. administration led by Trump, who initiated a trade war with China during his first term as president and looks set to be even tougher on the East Asian economic powerhouse during his second term.\n\nWillingness to cooperate with the United States on efforts to reduce reliance on China and bolster the North American economy — as the Sheinbaum administration has demonstrated in its first month in office — could help Mexico to get a more favorable outcome when the USMCA is renegotiated in 2026.\n\nTrump said last month that he would have “a lot of fun,” renegotiating the three-way pact as he seeks to improve — from a United States’ perspective — what he described as already “a great deal.”\n\nReuters: Sheinbaum has ‘room to negotiate’ \n\nReuters reported on Wednesday that Mexico “must maneuver carefully” given that Trump will soon return to the White House, but added that President Sheinbaum “still has room to negotiate and soften the impact on trade, migration and security.”\n\nCiting analysts, the news agency said that after a likely deterioration of relations with the U.S. in the short term, “Mexico has some leverage, particularly on migration, that could help dilute some of Trump’s pledges in areas such as trade and security.”\n\nMariana Campero, senior associate with the CSIS Americas Program, told Reuters that Sheinbaum could say to the Trump administration, “‘Okay, Mexico can take [deported] Mexican nationals back, but you won’t impose the tariffs.'”\n\nThe Mexican government, Reuters said, could also ask U.S. companies that benefit from the USMCA to lobby the Trump administration against tariffs on Mexican exports.\n\nLeeway to negotiate with the next U.S. government could also be assisted by Trump’s transactional tendencies — his apparent, or alleged, willingness to enter into quid pro quos.\n\nBy Mexico News Daily chief staff writer Peter Davies ([email protected])","summary":"Peter Davies examines the challenges, pressures and leverage Mexico might have once Donald Trump again becomes president of the United States in 2025.     \n\n\nThe post What will a second Donald Trump term mean for Mexico? appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/news/mexico-trump-united-states/","image":"https://mexiconewsdaily.com/wp-content/uploads/2024/11/Trump-at-rally-2024-Gage-Skidmore-Wikimedia-Commons.jpg","video":null,"publish_date":"2024-11-08 00:28:12","author":"MND Staff","authors":["MND Staff"],"language":"en","category":"politics","source_country":"mx","sentiment":0.25},{"id":263441412,"title":"What Democrats should focus on ahead of a Trump presidency","text":"What Democrats should focus on ahead of a Trump presidency\n The transition of power began following President-elect Donald Trump's win, while Democrats worked to understand what went wrong in the 2024 election. Trump picked his chief of staff, Susie Wiles, on Thursday. CBS News chief Washington correspondent Major Garrett reports.","summary":"The transition of power began following President-elect Donald Trump's win, while Democrats worked to understand what went wrong in the 2024 election. Trump picked his chief of staff, Susie Wiles, on Thursday. CBS News chief Washington correspondent Major Garrett reports.","url":"https://www.cbsnews.com/video/what-democrats-should-focus-ahead-trump-presidency/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/08/29509cca-c71a-4678-b562-011c674859ba/thumbnail/1200x630/dbb1cd8b71c34b65d2e98dfec746e690/cbsn-fusion-what-democrats-should-focus-ahead-trump-presidency-thumbnail.jpg?v=c1d30b1df13c40bf65c6c1e6d9ac4ad7","video":null,"publish_date":"2024-11-08 00:28:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.778}]}