{"offset":0,"number":50,"available":5875,"news":[{"id":253187966,"title":"State Rep. Gloria Johnson wins high-profile Democratic Senate primary in Tennessee","text":"State Rep. Gloria Johnson emerged the victor in Tennessee’s closely watched Democratic Senate primary and will take on incumbent Republican Sen. Marsha Blackburn in November’s election. Johnson took home the victory by garnering 74% of the vote over challengers Marquita Bradshaw, Civil Miller-Watkins and Lola Brown, at the time the race was called by the Associated Press Thursday night. KAMALA HARRIS EYES GOVERNORS FROM BATTLEGROUND STATES AS POSSIBLE VP PICKS The race garnered interest from Democrats nationwide after Johnson, who was seen as the front-runner in the race, attracted widespread attention last year by staging a protest on the floor of the Republican-controlled state House in the aftermath of a deadly shooting at a Tennessee elementary school. Johnson’s protest was joined by two other lawmakers, state Reps. Justin Pearson and Justin Jones, both Democrats, who together became known as the \"Tennessee Three.\" Pearson and Jones were both expelled for violating House rules after the protest, though they were later reappointed. Johnson’s toughest primary challenger was thought to be Bradshaw, an environmental activist who secured the party’s nomination in 2020 before being soundly defeated by incumbent Republican Sen. Bill Hagerty. DEMOCRAT GOVERNORS REEL FROM BIDEN'S PUTIN-ZELENSKYY GAFFE, IMPLICATIONS FOR US LEADERSHIP ON WORLD STAGE Johnson will now have an uphill climb in the heavily Republican-leaning state. Blackburn won her race in 2018 by 11 points, while Hagerty defeated Bradshaw by a whopping 30 points in 2020. Two years later, incumbent Republican Gov. Bill Lee won reelection by more than 30 points as well, while former President Donald Trump carried the state in both 2016 and 2020 by 26 and 23 points, respectively. Blackburn is a heavy favorite in her own primary against former Tennessee legislative staffer Tres Wittum, the only challenger to the incumbent Republican. CLICK HERE TO GET THE FOX NEWS APP Blackburn also has a significant fundraising advantage over all the state’s senate hopefuls, having close to $9 million cash on hand. Johnson, meanwhile, has raised about $5 million and still has over $2 million on hand. But Johnson has expressed optimism that Blackburn can be defeated, arguing that Democrats can win by focusing on issues such as abortion, gun control, and the environment.","summary":"State Rep. Gloria Johnson won Tennessee&apos;s Democratic senate primary, a race that garnered some national interest thanks to Johnson&apos;s involvement in the &quot;Tennessee Three&quot; last year.","url":"https://www.foxnews.com/politics/xx-wins-high-profile-democratic-senate-primary-tennessee","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/GettyImages-1250835440-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-02 00:22:38","author":"Michael Lee","authors":["Michael Lee"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.121},{"id":253187964,"title":"Sen. Marsha Blackburn secures Tennessee GOP senate primary","text":"Sen. Marsha Blackburn took home Tennessee’s Republican Senate primary on Thursday, likely securing the senate seat in the process in the heavily-Republican state. Blackburn led Thursday’s primary with almost 93% of the vote over Tres Wittum, at the time the race was called by the Associated Press. Blackburn, the incumbent senator, was largely seen as the favorite in the race heading in, having won her first race for Senate in 2018 over former Tennessee Gov. Phil Bredesen by 11 points. KAMALA HARRIS EYES GOVERNORS FROM BATTLEGROUND STATES AS POSSIBLE VP PICKS Blackburn’s lone challenger was Wittum, a former Tennessee legislative staffer who finished last in a primary bid for the state’s 5th Congressional District in 2022. Blackburn will now move on to face off with Democratic state Sen. Gloria Johnson. Johnson rose to fame last year after being one of three members of the Tennessee legislature to stage a protest on the state House floor in the aftermath of a shooting at an elementary school. She was dubbed as a member of the \"Tennessee Three,\" being joined in the protest by fellow Reps. Justin Pearson and Justin Jones, both Democrats. DEMOCRAT GOVERNORS REEL FROM BIDEN'S PUTIN-ZELENSKYY GAFFE, IMPLICATIONS FOR US LEADERSHIP ON WORLD STAGE The protests, which violated House rules, resulted in the expulsion of both Pearson and Jones, who were later reappointed and easily won special elections to regain their seats. Blackburn will now likely be the favorite in November’s general election, with Tennessee having leaned heavily Republican in statewide elections in recent years. CLICK HERE TO GET THE FOX NEWS APP Blackburn’s Tennessee colleague, Republican Sen. Bill Hagerty, was reelected in 2020 by about 30 points, while Republican Gov. Bill Lee was able to secure reelection in 2022 by over 30 points. Former President Donald Trump also easily won the state in 2016 and 2020, taking Tennessee by 26 and 23 points, respectively.","summary":"Sen. Marsha Blackburn won the Tennessee Republican senate primary Thursday, beating Tres Wittum in a race that is likely to decide who wins the general election in the heavily-Republican state.","url":"https://www.foxnews.com/politics/blackburn-secures-tennessee-gop-senate-primary","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/GettyImages-2162183528-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-02 00:21:37","author":"Michael Lee","authors":["Michael Lee"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.109},{"id":253187818,"title":"Stephen King Asks Republicans to 'Hold Your Nose' and Vote Kamala Harris","text":"Bestselling author Stephen King has asked Republican voters to \"hold your nose\" and cast a ballot for Vice President Kamala Harris in November.The critically acclaimed \"King of Horror,\" who is often vocal about his political views online, has been a staunch critic of former President Donald Trump in recent years. King wrote in his post to X, formerly Twitter, on Thursday that Trump was \"dangerous\" to elect back into the White House, and called the former president \"a child.\"\"Republicans: If you have to hold your nose to vote for Harris, please do so,\" read King's post. \"Trump is dangerous; a child doing a tantrum. There's only one adult in this contest. It's Harris.\"A handful of users agreed with King's sentiment, including Denison Barb, who responded to the author's post, \"The Trump experiment failed the first time. Lets move forward and not backwards. Kamala Harris 2024!\"Others spoke up in support of Trump. Online personality Stefen Anderson responded to King, \"? Uh no.. We're voting Trump.. Sorry Stephen Queen.\"Another user wrote, \"Are you stupid? We are all watching the democrats destroy the country right before our eyes. You have made a deal with the devil and you are a pathetic loser.\"King's comment comes a day after Trump received widespread backlash for his appearance at the National Association for Black Journalists (NABJ) convention in Chicago, during which the former president showed hostility to the journalists who hosted him for a Q&A session. Trump also made comments questioning Harris' racial heritage, accusing her of happening to \"turn Black.\" Harris is the first female, Black and Asian American to serve as vice president.\"She was always of Indian heritage, and she was always only promoting Indian heritage,\" Trump said at the event. \"I didn't know she was Black until a number of years ago when she happened to turn Black and now she wants to be known as Black. So I don't know. Is she Indian or is she Black?\"Several supporters of Harris have ripped Trump for his comments on the vice president's ethnicity. Arizona Senator Mark Kelly, reported to be on Harris' shortlist for a potential running mate, told CNN Wednesday evening that the former president's comments were \"the reaction of a desperate and scared old man.\"King said in a post to X on Wednesday that Trump \"screwed the pooch\" at the NABJ event.\"His supporters don't care (many won't even know), and Trump himself doesn't care,\" King added. \"All he wants is to yank back the spotlight from Kamala Harris to where it belongs: him.\"Newsweek on Thursday night reached out to Trump's campaign seeking comment on his statements at the NABJ convention.","summary":"King, who frequently criticizes Donald Trump, said that the former president is \"dangerous.\"","url":"https://www.newsweek.com/stephen-king-asks-republicans-hold-your-nose-vote-kamala-harris-1933605","image":"https://d.newsweek.com/en/full/2441334/king-asks-republicans-vote-harris.jpg","video":null,"publish_date":"2024-08-02 00:19:13","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.421},{"id":253187736,"title":"U.S. court blocks Biden administration net neutrality rules","text":"WASHINGTON >> A U.S. appeals court on Thursday blocked the Federal Communications Commission’s reinstatement of landmark net neutrality rules, saying broadband providers are likely to succeed in a legal challenge. The FCC voted in April along party lines to reassume regulatory oversight of broadband internet and reinstate open internet rules adopted in 2015 that were rescinded under then-President Donald Trump. The Sixth Circuit U.S. Court of Appeals, which had temporarily delayed the rules, said on Thursday it would temporarily block net neutrality rules and scheduled oral arguments for late October or early November on the issue, dealing a serious blow to President Joe Biden’s effort to reinstate the rules. “The final rule implicates a major question, and the commission has failed to satisfy the high bar for imposing such regulations,” the court wrote. “Net neutrality is likely a major question requiring clear congressional authorization.” The court on July 12 had temporarily placed the net neutrality rules on hold until Aug. 5 as it considered industry legal challenges. FCC Chair Jessica Rosenworcel said: “The American public wants an internet that is fast, open, and fair. Today’s decision by the Sixth Circuit is a setback but we will not give up the fight for net neutrality.” Net neutrality rules require internet service providers to treat internet data and users equally rather than restricting access, slowing speeds or blocking content for certain users. The rules also forbid special arrangements in which ISPs give improved network speeds or access to favored users. The rules would bar internet service providers from blocking or slowing down traffic to certain websites, or engaging in paid prioritization of lawful content, as well as give the FCC new tools to crack down on Chinese telecom companies and the ability to monitor internet service outages. Reinstating net neutrality has been a priority for Biden, who signed a July 2021 executive order encouraging the FCC to reinstate the rules adopted in 2015 under President Barack Obama, a fellow Democrat. Under Trump, the FCC had argued that net neutrality rules were unnecessary, blocked innovation and resulted in a decline in network investment by internet service providers, a contention disputed by Democrats.","summary":"WASHINGTON >> A U.S. appeals court on Thursday blocked the Federal Communications Commission&#8217;s reinstatement of landmark net neutrality rules, saying broadband providers are likely to succeed in a legal challenge.","url":"https://www.staradvertiser.com/2024/08/01/breaking-news/u-s-court-blocks-biden-administration-net-neutrality-rules/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-02T000942Z_3_LYNXMPEK702A3_RTROPTP_3_USA-INTERNET.JPG","video":null,"publish_date":"2024-08-02 00:11:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.435},{"id":253187748,"title":"GOP Congressional Super PACs Hold $15 Million Advantage Over Democrat-Aligned Counterparts Heading Into November","text":"Political action committees providing additional funding to Republican congressional candidates entered the stretch run of the 2024 election season with a slight cash-on-hand advantage over opposing PACs backing Democratic candidates. Between July 15 and July 20, four funds unofficially boosting the campaigns of Democratic and Republican candidates running for the House and Senate issued quarterly and monthly statements with the Federal Election Commission. Those forms showed conservative-leaning funds outraised liberal PACs and headed into July with about $15 million more in the bank. Two political action committees work to support Democratic candidates: the super PAC, Senate Majority PAC, and the hybrid PAC, House Majority PAC. Their conservative counterparts—the hybrid PAC Congressional Leadership Fund and the super PAC Senate Leadership Fund—help fund Republican campaigns. None of the PACs are officially associated with the political parties. On July 15, the Congressional Leadership Fund and the Senate Leadership Fund told the FEC they together raised about $106.6 million between April and June 2024. Collectively, the two funds held about $227.9 million at the end of June. Singer, the founder of Elliott Investment Management LP, is a regular supporter of conservative causes. In December, Singer sent $5 million to the SFA Fund, which supported the former U.S. Ambassador to the U.N.’s run for president. The biggest check of the quarter for either conservative fund came from One Nation. In June, the 501(c)(4) nonprofit sent $18.4 million to the Senate Leadership Fund. One Nation is closely linked to the Senate Leadership Fund. According to its most recent tax filing, both the Fund and One Nation are led by Steven Law. Miriam Adelson, the widow of late GOP megadonor Sheldon Adelson, sent $5 million to the Congressional Leadership Fund and $10 million to the Senate Leadership Fund in May. Representatives of Adelson previously told The Epoch Times the donor plans on making significant contributions to Republican causes and will financially support the reelection of former President Donald Trump. Ken Griffin, the CEO of Citadel, sent $10 million to the Congressional Leadership Fund in May and $7.5 million to the Senate Leadership Fund in March. According to the watchdog organization OpenSecrets, Griffin is the fourth largest individual donor of the 2024 election cycle. He has not donated to Trump’s campaign so far, but he did support Nikki Haley’s. A number of donors sent checks of $2 million or more to either fund. American Action Network, a 501(c)(4) nonprofit, sent $2.5 million to the Congressional Leadership Fund in June. Both the nonprofit and the hybrid PAC are led by Daniel Conston, according to the IRS and the Fund. Brothers Christopher Reyes and Jude Reyes, the co-founders of Reyes Holdings LLC, both sent $2.25 million to the Senate Leadership Fund in June. According to donor records maintained by OpenSecrets, both brothers have supported the funds in past election cycles. Both Rob Walton and Jim Walton gave $2 million to the Senate Leadership Fund in June. Both are heirs to the Walton family fortune. Steven Schwarzman, the chairman and CEO of the Blackstone Group, sent $2 million to the Congressional Leadership Fund in April. Schwarzman gave millions to both groups in the past, according to donor records maintained by OpenSecrets. James Simons, most recently the president of Euclidean Capital, and his wife, Marilyn Simons, the president of the Simons Foundation, are significant backers of progressive groups, according to OpenSecrets donor records. Fred Eychaner, one of the most prominent individual supporters of progressive politics in recent years, gave $2 million to the Senate Majority PAC and $3 million to the House Majority PAC during the quarter. According to OpenSecrets, Eychaner, the former leader of Chicago-based Newsweb Corp., is the 10th largest individual donor of the 2024 election cycle. This makes him the second-most generous contributor behind LinkedIn Corp. founder Reid Hoffman. Stephen Mandel, the founder and president of Lone Pine Capital, sent $3 million to the Senate Majority PAC in May. According to OpenSecrets donor records, Mandel is a regular, seven-figure supporter of progressive PACs. A pair of donors broke the $2 million mark during the second quarter, too. In the quarter, Elizabeth Simons, daughter of James Simons, and Jeff Skoll, an investor and former film producer, sent $2 million to the Senate Majority PAC. Simons co-founded the Heising-Simons Foundation with her husband, Mark Heising. That group focuses on climate, education, human rights, and science philanthropy. Skoll, who told the FEC he is currently a member at Sequoia Holdings LLC, founded Participant Media LLC in 2004. The production company announced its closure in 2024 but was known for making films with a progressive worldview, such as “An Inconvenient Truth” and “Food Inc.” It produced Oscar winners like “Green Book” and “Spotlight.”","summary":"GOP megadonors like Paul Singer, Miriam Adelson, and Ken Griffin opened their checkbooks in the second quarter of 2024.","url":"https://www.theepochtimes.com/us/gop-congressional-super-pacs-hold-15-million-advantage-over-democrat-aligned-counterparts-heading-into-november-5698025","image":"https://img.theepochtimes.com/assets/uploads/2024/07/25/id5693263-GettyImages-1769333224-300x180.jpg","video":null,"publish_date":"2024-08-02 00:03:57","author":"Austin Alonzo","authors":["Austin Alonzo"],"language":"en","source_country":"us","sentiment":-0.194},{"id":253187146,"title":"Court blocks FCC’s reinstatement of net neutrality rules that were scrapped by Trump admin","text":"A US appeals court on Thursday blocked the Federal Communications Commission’s reinstatement of landmark net neutrality rules, saying broadband providers are likely to succeed in a legal challenge. The FCC voted in April along party lines to reassume regulatory oversight of broadband internet and reinstate open internet rules adopted in 2015 that were rescinded under then-President Donald Trump. The Sixth Circuit US Court of Appeals, which had temporarily delayed the rules, said on Thursday it would temporarily block net neutrality rules and scheduled oral arguments for late October or early November on the issue, dealing a serious blow to President Biden’s effort to reinstate the rules. “The final rule implicates a major question, and the commission has failed to satisfy the high bar for imposing such regulations,” the court wrote. “Net neutrality is likely a major question requiring clear congressional authorization.” The court on July 12 had temporarily placed the net neutrality rules on hold until Aug. 5 as it considered industry legal challenges. FCC Chair Jessica Rosenworcel said: “The American public wants an internet that is fast, open, and fair. Today’s decision by the Sixth Circuit is a setback but we will not give up the fight for net neutrality.” Net neutrality rules require internet service providers to treat internet data and users equally rather than restricting access, slowing speeds or blocking content for certain users. The rules also forbid special arrangements in which ISPs give improved network speeds or access to favored users. The rules would bar internet service providers from blocking or slowing down traffic to certain websites, or engaging in paid prioritization of lawful content, as well as give the FCC new tools to crack down on Chinese telecom companies and the ability to monitor internet service outages. Reinstating net neutrality has been a priority for Biden, who signed a July 2021 executive order encouraging the FCC to reinstate the rules adopted in 2015 under President Barack Obama, a fellow Democrat. Under Trump, the FCC had argued that net neutrality rules were unnecessary, blocked innovation and resulted in a decline in network investment by internet service providers, a contention disputed by Democrats.","summary":"The FCC voted in April along party lines to reassume regulatory oversight of broadband internet and reinstate open internet rules.","url":"https://nypost.com/2024/08/01/business/court-blocks-fccs-reinstatement-of-landmark-net-neutrality-rules/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/fcc-net-neutrality.jpg?quality=75&strip=all&1722536909&w=1200","video":null,"publish_date":"2024-08-01 23:58:35","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.442},{"id":253187002,"title":"Trump focuses on Harris’ race in his 2024 campaign, despite Republican preferences","text":"NEW YORK – Donald Trump has found tremendous success from the very first moment he stepped onto the presidential stage by stoking racial animus. Democrats expressed new outrage this week at the former president’s derisive and false charge that Vice President Kamala Harris, who is of Jamaican and Indian heritage, only recently “turned Black” for political gain. Some Republicans — even from within Trump’s own campaign — seemed to distance themselves from the comment. But Trump’s rhetoric this week, and his record on race since he entered politics nearly a decade ago, indicate that divisive attacks on race may emerge as a core GOP argument in the three-month sprint to Election Day — whether his allies want them to or not. A Trump adviser, granted anonymity Thursday to discuss internal strategy, said the campaign doesn’t need to focus on “identity politics” because the case against Harris is that she is “so liberal it’s dangerous.” The adviser pointed to Harris’ record on the Southern border, crime, the economy and foreign policy. In a sign that Trump may not be coordinating his message with his own team, the Republican presidential nominee doubled down on the same day with a new attack on Harris’ racial identity. He posted on his social media site a picture of Harris donning traditional Indian attire in a family photo. Sen. Cynthia Lummis, a Wyoming Republican who has endorsed Trump, was among a number of lawmakers on Capitol Hill who said Thursday that the rhetoric around race and identity is not “helpful to anyone” this election cycle. “People’s skin color doesn’t matter one iota,” Lummis said in an interview. Trump turned to an old tactic against Harris It’s been less than two weeks after President Joe Biden ended his reelection bid and endorsed Harris. Trump has had to pivot from campaigning against an 81-year-old white president showing signs of decline to facing a 59-year-old biracial vice president who is drawing much larger crowds and new enthusiasm from Democratic donors. Trump went to the National Association of Black Journalists convention on Wednesday. In an appearance carried live on cable news and shared widely online, he falsely suggested Harris misled voters about her race. “I didn’t know she was Black until a number of years ago when she happened to turn Black and now she wants to be known as Black. So, I don’t know, is she Indian or is she Black?” Trump said Wednesday. At a Pennsylvania rally hours later, Trump’s team displayed years-old news headlines describing Harris as the “first Indian-American senator” on the big screen in the arena. And Ohio Sen. JD Vance, Trump’s running mate, told reporters traveling with him that Harris was a “chameleon” who changed her identity when convenient. Harris attended Howard University, the historically Black institution where she pledged the Alpha Kappa Alpha sorority, and has often talked throughout her career about being both about being Black and Indian American. Some Republicans argued that Trump’s message on race is part of a broader pitch that may appeal to some Black voters. “We’re focused on policy and how we can actually make waves and changes in the Black community. Economics, education, inflation, lowering costs. That’s what the message is,” said Diante Johnson, president of the Black Conservative Federation, which supports Trump’s efforts to win over more Black voters and hosted him at a gala in February. Veteran Republican pollster Frank Luntz said he explored the issue during a Wednesday focus group with swing voters almost immediately after Trump’s interview. He found that Harris may be vulnerable to criticism based on her gender, but race-based attacks could hurt Trump among the voters that matter most this fall. Much has changed, Luntz said, since Trump rose to prominence by questioning the citizenship of Barack Obama, the nation’s first Black president. “Trump seems to think that he can criticize her for how she’s dealt with her race. Well, no one’s listening to that criticism. It simply doesn’t matter,” Luntz said. “If it’s racially driven, it will backfire.” Eugene Craig, the former vice chair of the Maryland Republican Party, said that Trump “got what he wanted” at the NABJ convention but that the substance of his argument risked being more offensive than appealing. “The one thing that Black folks will never tolerate is disrespecting Blackness, and that goes for Black Republicans too,” said Craig, who is Black and worked as a staffer for conservative pundit Dan Bongino’s 2012 Senate campaign. He is now supporting Harris. Trump has a long history of racist attacks Trump has frequently used race to go after his opponents since he stepped into presidential politics nearly a decade ago. Trump was perhaps the most famous member of the so-called “birther” movement questioning where Obama was born. He kicked off his first campaign by casting Mexican immigrants as “rapists” and drug traffickers and later questioned whether a U.S. federal judge of Mexican heritage could be fair to him. While in the White House, Trump defended a white supremacist march in Charlottesville, Virginia, and suggested that the U.S. stop accepting immigrants from “shithole” countries including Haiti and parts of Africa. In August 2020, he suggested Harris, who was born in California, might not meet the Constitution’s eligibility requirements to be vice president. And just two weeks after formally entering the 2024 campaign, he dined with notorious white supremacist Nick Fuentes at his Mar-a-Lago residence. Trump won in 2016 but lost reelection in 2020 to Biden by close margins in several swing states. He swept the 2024 Republican primary even while facing a raft of criminal charges. “I hope Trump’s attacks on Harris are just him flailing about ineffectively. But put together Trump’s shamelessness, his willingness to lie, his demagogic talent, and the issue of race — and a certain amount of liberal complacency that Trump is just foolish — and I’m concerned,” Bill Kristol, a leading conservative anti-Trump voice, posted on social media Thursday. The Harris campaign thinks there’s little upside for Trump A Harris adviser described the moment as an opportunity to remind voters of the chaos and division that Trump breeds. But the adviser, granted anonymity to discuss internal strategy, said it would be a mistake for Democrats to engage with Trump’s attacks on race at the expense of the campaign’s broader focus on key policies. So long as the campaign does not get distracted, the adviser said, Harris’ team believes there is little political upside for Trump to continue attacking Harris’ racial identity. Harris told a gathering of a historically Black sorority on Wednesday that Trump’s attack was “the same old show: the divisiveness and the disrespect.” On the ground in at least one swing state, however, there were signs that Trump’s approach may be resonating — at least among the former president’s white male base. Jim Abel, a 65-year-old retiree who attended a rally for Vance in Arizona on Wednesday, said he agreed with Trump’s focus on Harris’ racial identity. “She’s not Black,” Abel said. “I’ve seen her parents. I’ve pictures of her and her family and she’s not Black. She’s looking for the Black vote.” But several high-profile Republican voices disagreed. Conservative commentator Ben Shapiro posted on X a picture of a road sign with two directions. One led to, “Attack Kamala’s record, lies and radicalism,” while the other, “Is she really black?” “I dunno guys, I just think that maybe winning the 2024 election might be more important than having this silly and meaningless conversation,” Shapiro wrote. ___ Brown reported from Chicago. AP writers Stephen Groves, Mary Clare Jalonick and Farnoush Amiri in Washington; and Gabriel Sandoval in Glendale, Arizona, contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK – Donald Trump has found tremendous success from the very&#8230;\n\n\nThis Post: Trump focuses on Harris&#8217; race in his 2024 campaign, despite Republican preferences first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-focuses-on-harris-race-in-his-2024-campaign-despite-republican-preferences/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Trump-is-making-his-2024-campaign-about.jpg","video":null,"publish_date":"2024-08-01 23:55:01","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.108},{"id":253187510,"title":"What was Harris' role in prisoner swap with Russia?","text":"What was Harris' role in prisoner swap with Russia? With fewer than 100 days to go until the 2024 election, the White House touted Vice President Kamala Harris' role in the prisoner swap with Russia, while former President Donald Trump criticized the Biden team for giving away too much in the exchange. CBS News chief election and campaign correspondent Robert Costa reports.","summary":"With fewer than 100 days to go until the 2024 election, the White House touted Vice President Kamala Harris' role in the prisoner swap with Russia, while former President Donald Trump criticized the Biden team for giving away too much in the exchange. CBS News chief election and campaign correspondent Robert Costa reports.","url":"https://www.cbsnews.com/video/what-was-harris-role-russia-prisoner-swap/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/01/780d2939-3f40-4685-bdb8-819bad8bcce1/thumbnail/1200x630/74cf74368bb6cf12b53e223c81adad15/cbsn-fusion-what-was-harris-role-russia-prisoner-swap-thumbnail.jpg?v=d7dedd293aad546f97f947149642d369","video":null,"publish_date":"2024-08-01 23:49:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.158},{"id":253187028,"title":"Trump’s net worth has dropped by $900m since Harris entered the race","text":"Donald Trump’s net worth has dropped by an estimated $900m since since Kamala Harris entered the presidential race last month, according to an analysis from CNN. The precipitious decline is due to the changing value of Trump’s stake in Trump Media and Technology Group (TMTG), the parent company of his Twitter clone Truth Social. Trump has over 114m shares in TMTG, whose value has declined 23 percent since July 21, from $4bn to about $3.1bn, according to CNN. TMTG stock has often served as a stand-in for Trump’s political fortunes, declining during his hush money trial, then spiking when he bested Joe Biden at the debates and bumping up again when he survived an assassination attempt. The latest plunge follows a season of bad news for TMTG. The platform has suffered some of its worst-ever audience numbers as of late, according to a media analysis. In June, the site had just over 2.11m unique visitors down 38 percent compared to the same period last year. It is the second lowest site traffic has dipped since June 2022, when Truth Social attracted 1.8 million visitors, according to Howard Polskin, of media monitoring firm TheRighting, who based his analysis on Comscore data. And it’s a world away from the site’s more than 3.2 million visitors upon launch in February of 2022. “The diminishing audience levels for Truth Social suggest a rejection of the harsh rhetoric expressed by the ex-president and his political allies that is one of the hallmarks of the two-year-old platform,” Polskin told The Guardian. “If this softness persists, it might portend trouble for Mr Trump at the ballot box in November,” he added. That hasn’t stopped the company from continuing to try and grow Truth Social. Earlier this month, it announced its first major purchase, of technology that would help stream TV on Truth Social. One of the companies involved in the deal is JedTech LLC, a Louisiana-based firm controlled by James E Davison, a major Republican donor with business interests impacted by the federal government, according to ProPublica.","summary":"Truth Social has experienced declining audience numbers too","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-net-worth-truth-social-b2589954.html","image":"https://static.independent.co.uk/2024/07/31/19/SEI215154435.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/nRdT7ePM-4VHSaSK0.mp4","publish_date":"2024-08-01 23:48:25","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","source_country":"gb","sentiment":-0.374},{"id":253187018,"title":"Trump loses appeal of gag order in hush money criminal case","text":"NEW YORK >> A New York state appeals court on Thursday rejected Donald Trump’s challenge to a gag order in his hush money criminal case, where the former president was convicted in May on charges stemming from hush money paid to a porn star. The decision by the Appellate Division in Manhattan means the Republican presidential nominee cannot comment publicly about individual prosecutors and others in the case until Justice Juan Merchan sentences him on Sept. 18, seven weeks before the Nov. 5 election. Trump’s lawyers have argued that the gag order violated Trump’s constitutional free speech rights under the First Amendment. “The gag order is blatantly un-American,” Steven Cheung, a spokesperson for Trump’s campaign, said in a statement. A Reuters/Ipsos poll released on Tuesday showed Trump locked in a tight race with Vice President Kamala Harris, who is poised to become the Democratic nominee. Harris led Trump 43%-42% among registered voters, within the margin of error. On Thursday afternoon, Trump’s lawyers renewed their demand that Merchan recuse himself, citing his daughter’s work as a Democratic political consultant and her “long-standing” relationship with Harris. They also said the “unjust and unconstitutional” gag order restricts Trump’s ability to respond to Harris, saying she framed her candidacy as that of “prosecutor vs convicted felon.” Harris served as California’s attorney general earlier in her career. Merchan rejected a similar recusal request by Trump before the trial began, and another recusal request last year. The judge imposed the gag order a few weeks before the trial began on April 22, saying Trump’s history of making threatening statements could undermine the proceedings. Merchan’s original order prevented Trump from commenting on prosecutors, court staff, witnesses and jurors. A separate order against naming the anonymous jurors remains in effect. Merchan lifted the restrictions on witnesses and jurors following Trump’s May 30 conviction. The Appellate Division, a mid-level appeals court, said threats that Bragg’s staff received in the wake of the verdict continue to pose a “significant and immediate” threat. “Justice Merchan did not act in excess of jurisdiction by maintaining the narrowly tailored protections,” the five-judge panel said. The appeals court upheld Merchan’s original gag order in May, citing the need to protect people from “threats, intimidation, harassment, and harm,” and rejecting Trump’s First Amendment argument. The order leaves Trump free to speak about Bragg and Merchan. Jurors found Trump guilty on 34 felony counts of falsifying business records, for covering up former personal lawyer and fixer Michael Cohen’s $130,000 payment to adult film actress Stormy Daniels. The payment was made in exchange for Daniels’ silence before the 2016 election about a sexual encounter she says she had with Trump a decade earlier, which Trump denied. Trump won the presidency by defeating Democrat Hillary Clinton. The criminal trial was the first of any U.S. president. Trump faces up to four years in prison, and can also be fined. Time behind bars is rare for people convicted in New York for falsifying business records, especially those like Trump with no prior criminal histories. Trump has vowed to appeal his conviction after he is sentenced.","summary":"NEW YORK >> A New York state appeals court on Thursday rejected Donald Trump&#8217;s challenge to a gag order in his hush money criminal case, where the former president was convicted in May on charges stemming from hush money paid to a porn star.","url":"https://www.staradvertiser.com/2024/08/01/breaking-news/trump-loses-appeal-of-gag-order-in-hush-money-criminal-case/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-01T185921Z_2_LYNXMPEK70254_RTROPTP_3_USA-TRUMP-NEW-YORK.JPG","video":null,"publish_date":"2024-08-01 23:48:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.133},{"id":253186904,"title":"Vance border speech hits Harris in latest barrage of attacks between campaigns on migrant crisis","text":"The crisis at the southern border has become a centerpiece of the 2024 presidential race, as GOP vice presidential candidate Sen. JD Vance of Ohio hit out at Vice President Kamala Harris at the border on Thursday over her handling of the crisis — days after her campaign sought to draw a contrast between her and former President Trump on the hot-button issue. \"It's hard to believe until you see it with your own eyes, just how bad the policies of the Kamala Harris administration have been when it comes to the southern border,\" Vance said in Cochise County, Arizona. \"They started their administration, Kamala Harris came into office... they stopped deportations on day one. They stopped construction of the border wall.\" Vance tapped into Republican arguments about how the Biden administration ended what they see as successful Trump-era policies and unleashed havoc at the border. 2024 SHOWDOWN: TRUMP CAMPAIGN REJOICES AFTER HARRIS LEANS IN ON KEY ISSUE HAUNTING HER VICE PRESIDENCY \"We see the border wall sitting here, ready to be completed behind us. And that can't happen because of Kamala Harris' administration. They reinstated catch-and-release and they stopped Remain in Mexico,\" he continued. \"So all these asylum claimants who come to our border, they can now get released into our country because they're not forced to stay in Mexico while we adjudicate their asylum claims.\" Vance also described securing the border as \"not rocket science.\" \"You just have to re-implement some commonsense policies. You've got to re-implement Remain in Mexico. You've got to stop catch-and-release,\" he said. \"You've got to force these asylum seekers to stay in Mexico while their claims are being adjudicated. And you've got to finish this border wall and re-implement deportations.\" Vance’s border visit came after former President Trump also said he will visit the border before November, potentially multiple times. Republicans have hammered Harris on the southern border, given not only the crisis there but Harris’ leadership in international diplomacy on root causes, which led to her being dubbed the \"border czar\" by the media and Republicans. But Harris has pushed back, highlighting an endorsement by a group of mayors in Arizona border towns \"praising her long record of fighting to secure the border and fix our broken immigration system, including her work going after transnational gangs smuggling weapons and drugs as California Attorney General and bringing border crossings to their lowest level in years with tough border policies in the White House.\" This week, Harris released an ad contrasting her support of a bipartisan border package unveiled in the Senate which would have increased border funding and placed some limits on entries into the U.S. The Biden administration has said it would help tackle the border crisis, but Trump and his allies killed it off. FLASHBACK: HARRIS FUMED AT AMERICANS FOR SAYING ‘MERRY CHRISTMAS’ BEFORE ILLEGAL IMMIGRANTS GOT PROTECTIONS The video argued that Harris \"helped lead the way to record low border crossings and has spent her entire career keeping our communities safe,\" and charged that Trump \"sided with drug traffickers and the cartels to block the strongest, fairest reforms to secure the border in decades.\" The Trump campaign instantly pilloried the video. \"Every statement in Kamala’s border ad is an absolute lie. The truth is that President Trump handed the most secure border in history to the Biden-Harris Administration, and they opened it up by erasing every one of his good policies,\" the Trump campaign charged. \"As Border Czar, Kamala Harris has overseen the worst immigration crisis in American history, enabling drug cartels to smuggle deadly fentanyl across our border and allowing more than 11 million illegal criminals and terrorists from all over the world to enter our country.\" CLICK HERE FOR MORE COVERAGE OF THE BORDER SECURITY CRISIS Harris criticized Trump at a rally in Atlanta earlier this week, saying he \"has been talking a big game about securing our border, but he does not walk the walk.\" She charged that the former president \"tanked the bipartisan deal because he thought it would help him win an election\" and pledged that \"as the president I will bring back the border security bill that Donald Trump killed.\" After Vance’s speech on Thursday, Harris' campaign took aim at both Trump and Vance. CLICK HERE TO GET THE FOX NEWS APP \"Donald Trump and JD Vance are not offering Americans solutions — only insults, chaos, and fear. They don’t want security at our border, they want to spread fear. They don’t want to help working families, their Project 2025 agenda only hurts them,\" Harris for President spokesperson James Singer said. Fox News' Greg Norman and Paul Steinhauser contributed to this report.","summary":"Sen. JD Vance, R-Ohio, hammered Vice President Kamala Harris on the crisis at the southern border on Thursday in a back-and-forth between the two campaigns over who is stronger on the hot-button issue.","url":"https://www.foxnews.com/politics/vance-border-speech-hits-harris-latest-barrage-attacks-campaigns-migrant-crisis","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/b6f46133-Vance-Harris.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-01 23:46:42","author":"Adam Shaw","authors":["Adam Shaw"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.144},{"id":253187900,"title":"A sojourn in Knuckles Range","text":"What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them! Cassandra selected her single phrase title this Friday because the US of A has been much in international news mostly because of a woman, and one labeled Black South Asian American. She is the present Vice President of the country, married to a Jew, and step mother to an adult son and daughter. Most significantly she is now the accepted-by-Democratic Party contender for the presidential elections scheduled for November, pitting herself against Donald Trump who was soaring high against Biden – showing signs of aging, slowing down and making mistakes in speech. Trump has been stumped, thank goodness we say, even though we are miles away and need not have vested interests in American politics. At least, it will save one Sri Lankan woman from migrating to Britain which she threatened to do if Trump became Prez of the USA again. Women power or feminine power has emerged mightily in America. This power is a force that has been assured Kamala Harris after being endorsed by retiring Biden to contest to be President. Many powerful Democrats including the Clintons and Obamas endorsed her. Now, within this pair are two powerful women so Harris has the support of Hillary Clinton and Michelle Obama. But more importantly. Kamala has been fully endorsed by Nancy Pelosi. No sooner had Joe Biden announced his endorsement of Kamala Harris to become the 47th President of the United States of America with his stepping out of the race on July 21, former Speaker of the House than Nancy Pelosi followed suit in a strong voice. She was soon discerned as the power behind Harris’ bid. Pelosi had been instrumental in a behind-the-scenes campaign to have Biden step aside. She then endorsed Harris with, as she announced, “immense pride and limitless optimism for our country’s future.” She added that her support was “official, personal and political,” Other endorsements came in thick and fast as did donations to the campaign fund. Three possible contenders for the post of President, Governors Gretchen Whitmer, Michigan; J B Pritsker of Illinois and Andy Beshear of Delaware backed Harris. At her first appearance to fete Biden, she referred to his presidency as a “legacy of accomplishment unmatched in modern history.” It was interesting to watch her reception to visiting Israeli PM Netanyahu. Biden smiled and warmly greeted the Head of Israel as an old buddy and again promised aid to Israel. Kamala Harris showed less warmth and much less support. She also mentioned the fact that horrors of war could not be overlooked. Said she in an interview: “I also expressed with the prime minister my serious concern about the scale of human suffering in Gaza, including the death of far too many innocent civilians.” Of course, she had to be very civil to Netanyahu and not offend Jews, but she, as Cass said before, gives a glimmer of hope for the Palestinians. Wondering about her religion, Cass googled and found she is a Baptist with faith that traces back to Martin Luther King and Gandhi. Her mother would have been a Hindu and her father is an Anglican Christian. Her husband probably follows the Jewish faith. So, let’s hope Kamala Harris wins the presidency of the US of A, a great honour to women around the world. Though not openly sexist, Harris has shown she is sympathetic to women’s issues. She seems to be against the SC’s putting aside Roe V Wade and thus stamping down on women’s right to abortion. Re-elected Another outstanding woman is the re-elected President of the European Union – Ursula Gertrude von der Leyen – serving as the 13th Prez of the EU since 2019. She served in the German federal government between 2005 and 2019, holding positions in Angela Merkel’s cabinet, lastly as Federal Minister of Defence. Cass read when Merkel resigned that Ursula von der Leyen was tipped to be the next German Chancellor but preferred her post as head of the EU. Born in 1958, she higher studied in the London School of Economics – 1978 and followed a medical course in the Hanover Medical School graduating in 1987. Married to a medical physician, the pair have seven, yes, seven children. She is outstandingly beautiful, composed, and though more sedate and restrained, is regal in posture and manner. Unfortunate Leader The travails of Aung San Suu Kyi have been long, included tragedies, separation from husband and two sons, and imprisonment. Born in 1945 to national hero father Aung San and wise mother Khin Kyi, she studied in New Delhi both secondary and higher at the University of Delhi till 1964, then proceeded to London and joined St Hugh’s College, Oxford, graduating in 1968. She joined the UN in New York while her fiancee Dr Michael Aris was in Bhutan; a keen student of Tibetan language, Buddhism and culture. Married in 1972, they settled in UK and had two sons. She joined SOAS to follow a doctorate course. In 1988 she returned alone to Myanmar to care for her ill mother. She stayed on joining and then leading the National League for Democracy (NLD). Her party won the parliamentary election in 1989 but was not allowed to form a government by the military government which names itself the State Peace and Development Council (SPDC). She suffered house arrest for three decades -1989 to 2010, then won an election in 2016 and was appointed State Counsellor of Myanmar, equal to Prime Minister. In 19 91 she won the Nobel Prize for Peace. Her life continued to be wrought with troubles and tragedies. Her husband suffering terminal cancer was not given a visa to enter Myanmar though world leaders appealed for this. The SPDC said she could go but Suu Kyi sacrificed her spending time with her husband and sons because she suspected this to be a ruse to get her out of the country and not allow returning. Another problem faced by her was world censure on her personally for allowing the genocide of the Rohingyar in Rakhine State. She even had to appear before the International Court of Justice in the Hague in 2019. But her hands were tied. She could not act counter to the military. After elections in November 2020 when her party again won a landslide victory, she was arrested in 2021 and several charges leveled against her of corruption, inciting violence etc. She was convicted several times adding up to 33 years in prison, reduced to 27. She is now under house arrest, said to be because she is ill. Cass listened to a YouTube interview with her elder son, ponytailed and unimpressive, saying he was spearheading her full release since she is very ill. No definite news is out about her condition, delicate and frail as she looks. She’s proved to be hero and martyr for her country like her father who is named The Father of the Nation. Local It’s still full preoccupation with presidential elections; who joins which Party and the SLPP deciding not to support independent candidate Ranil Wickremesinghe. Namal Rajapaksa has been referred to as Namal Baba even in press editorials, cultivating his face to resemble his father’s and emerging to the limelight; however, Cass surmises too protective of himself to be a candidate in September 21 elections. He sure will be up front in 2029/30. Our women? There are one or two good women politicians in parliament but no one in the political firmament. Hirunika is on the fringe in spite of her spending a couple of days in prison for the offence of abduction. Notwithstanding, Cassandra places bets on Hirunika becoming a leader in this country. She demonstrated woman power in her active criticism of Prez Gotabaya. What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them!","summary":"by Anula Wijesundere My brother, Hemantha, made the bookings and all travel arrangements for our Knuckles journey over the Independence weekend well in advance.On Friday, the third of February, our driver Manoj arrived with Malli and Devika, sharp at 5 am to pick up Ajita and me. Soon after, we collected Deepa and Sanath from [&#8230;]","url":"https://island.lk/a-sojourn-in-knuckles-range/","image":"http://island.lk/wp-content/uploads/2024/08/image-one.jpg","video":null,"publish_date":"2024-08-01 23:45:44","author":"Thilina Walpola","authors":["Thilina Walpola"],"language":"en","catgory":"sports","source_country":"ik","sentiment":0.165},{"id":253187896,"title":"Women’s Power","text":"What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them! Cassandra selected her single phrase title this Friday because the US of A has been much in international news mostly because of a woman, and one labeled Black South Asian American. She is the present Vice President of the country, married to a Jew, and step mother to an adult son and daughter. Most significantly she is now the accepted-by-Democratic Party contender for the presidential elections scheduled for November, pitting herself against Donald Trump who was soaring high against Biden – showing signs of aging, slowing down and making mistakes in speech. Trump has been stumped, thank goodness we say, even though we are miles away and need not have vested interests in American politics. At least, it will save one Sri Lankan woman from migrating to Britain which she threatened to do if Trump became Prez of the USA again. Women power or feminine power has emerged mightily in America. This power is a force that has been assured Kamala Harris after being endorsed by retiring Biden to contest to be President. Many powerful Democrats including the Clintons and Obamas endorsed her. Now, within this pair are two powerful women so Harris has the support of Hillary Clinton and Michelle Obama. But more importantly. Kamala has been fully endorsed by Nancy Pelosi. No sooner had Joe Biden announced his endorsement of Kamala Harris to become the 47th President of the United States of America with his stepping out of the race on July 21, former Speaker of the House than Nancy Pelosi followed suit in a strong voice. She was soon discerned as the power behind Harris’ bid. Pelosi had been instrumental in a behind-the-scenes campaign to have Biden step aside. She then endorsed Harris with, as she announced, “immense pride and limitless optimism for our country’s future.” She added that her support was “official, personal and political,” Other endorsements came in thick and fast as did donations to the campaign fund. Three possible contenders for the post of President, Governors Gretchen Whitmer, Michigan; J B Pritsker of Illinois and Andy Beshear of Delaware backed Harris. At her first appearance to fete Biden, she referred to his presidency as a “legacy of accomplishment unmatched in modern history.” It was interesting to watch her reception to visiting Israeli PM Netanyahu. Biden smiled and warmly greeted the Head of Israel as an old buddy and again promised aid to Israel. Kamala Harris showed less warmth and much less support. She also mentioned the fact that horrors of war could not be overlooked. Said she in an interview: “I also expressed with the prime minister my serious concern about the scale of human suffering in Gaza, including the death of far too many innocent civilians.” Of course, she had to be very civil to Netanyahu and not offend Jews, but she, as Cass said before, gives a glimmer of hope for the Palestinians. Wondering about her religion, Cass googled and found she is a Baptist with faith that traces back to Martin Luther King and Gandhi. Her mother would have been a Hindu and her father is an Anglican Christian. Her husband probably follows the Jewish faith. So, let’s hope Kamala Harris wins the presidency of the US of A, a great honour to women around the world. Though not openly sexist, Harris has shown she is sympathetic to women’s issues. She seems to be against the SC’s putting aside Roe V Wade and thus stamping down on women’s right to abortion. Re-elected Another outstanding woman is the re-elected President of the European Union – Ursula Gertrude von der Leyen – serving as the 13th Prez of the EU since 2019. She served in the German federal government between 2005 and 2019, holding positions in Angela Merkel’s cabinet, lastly as Federal Minister of Defence. Cass read when Merkel resigned that Ursula von der Leyen was tipped to be the next German Chancellor but preferred her post as head of the EU. Born in 1958, she higher studied in the London School of Economics – 1978 and followed a medical course in the Hanover Medical School graduating in 1987. Married to a medical physician, the pair have seven, yes, seven children. She is outstandingly beautiful, composed, and though more sedate and restrained, is regal in posture and manner. Unfortunate Leader The travails of Aung San Suu Kyi have been long, included tragedies, separation from husband and two sons, and imprisonment. Born in 1945 to national hero father Aung San and wise mother Khin Kyi, she studied in New Delhi both secondary and higher at the University of Delhi till 1964, then proceeded to London and joined St Hugh’s College, Oxford, graduating in 1968. She joined the UN in New York while her fiancee Dr Michael Aris was in Bhutan; a keen student of Tibetan language, Buddhism and culture. Married in 1972, they settled in UK and had two sons. She joined SOAS to follow a doctorate course. In 1988 she returned alone to Myanmar to care for her ill mother. She stayed on joining and then leading the National League for Democracy (NLD). Her party won the parliamentary election in 1989 but was not allowed to form a government by the military government which names itself the State Peace and Development Council (SPDC). She suffered house arrest for three decades -1989 to 2010, then won an election in 2016 and was appointed State Counsellor of Myanmar, equal to Prime Minister. In 19 91 she won the Nobel Prize for Peace. Her life continued to be wrought with troubles and tragedies. Her husband suffering terminal cancer was not given a visa to enter Myanmar though world leaders appealed for this. The SPDC said she could go but Suu Kyi sacrificed her spending time with her husband and sons because she suspected this to be a ruse to get her out of the country and not allow returning. Another problem faced by her was world censure on her personally for allowing the genocide of the Rohingyar in Rakhine State. She even had to appear before the International Court of Justice in the Hague in 2019. But her hands were tied. She could not act counter to the military. After elections in November 2020 when her party again won a landslide victory, she was arrested in 2021 and several charges leveled against her of corruption, inciting violence etc. She was convicted several times adding up to 33 years in prison, reduced to 27. She is now under house arrest, said to be because she is ill. Cass listened to a YouTube interview with her elder son, ponytailed and unimpressive, saying he was spearheading her full release since she is very ill. No definite news is out about her condition, delicate and frail as she looks. She’s proved to be hero and martyr for her country like her father who is named The Father of the Nation. Local It’s still full preoccupation with presidential elections; who joins which Party and the SLPP deciding not to support independent candidate Ranil Wickremesinghe. Namal Rajapaksa has been referred to as Namal Baba even in press editorials, cultivating his face to resemble his father’s and emerging to the limelight; however, Cass surmises too protective of himself to be a candidate in September 21 elections. He sure will be up front in 2029/30. Our women? There are one or two good women politicians in parliament but no one in the political firmament. Hirunika is on the fringe in spite of her spending a couple of days in prison for the offence of abduction. Notwithstanding, Cassandra places bets on Hirunika becoming a leader in this country. She demonstrated woman power in her active criticism of Prez Gotabaya. What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them!","summary":"What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as [&#8230;]","url":"https://island.lk/womens-power/","image":"http://island.lk/wp-content/uploads/2024/08/chamari-1000x600.jpg","video":null,"publish_date":"2024-08-01 23:45:39","author":"Thilina Walpola","authors":["Thilina Walpola"],"language":"en","catgory":"sports","source_country":"ik","sentiment":0.165},{"id":253187898,"title":"Understanding adverse possession and its impact on agricultural value chains in SL","text":"What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them! Cassandra selected her single phrase title this Friday because the US of A has been much in international news mostly because of a woman, and one labeled Black South Asian American. She is the present Vice President of the country, married to a Jew, and step mother to an adult son and daughter. Most significantly she is now the accepted-by-Democratic Party contender for the presidential elections scheduled for November, pitting herself against Donald Trump who was soaring high against Biden – showing signs of aging, slowing down and making mistakes in speech. Trump has been stumped, thank goodness we say, even though we are miles away and need not have vested interests in American politics. At least, it will save one Sri Lankan woman from migrating to Britain which she threatened to do if Trump became Prez of the USA again. Women power or feminine power has emerged mightily in America. This power is a force that has been assured Kamala Harris after being endorsed by retiring Biden to contest to be President. Many powerful Democrats including the Clintons and Obamas endorsed her. Now, within this pair are two powerful women so Harris has the support of Hillary Clinton and Michelle Obama. But more importantly. Kamala has been fully endorsed by Nancy Pelosi. No sooner had Joe Biden announced his endorsement of Kamala Harris to become the 47th President of the United States of America with his stepping out of the race on July 21, former Speaker of the House than Nancy Pelosi followed suit in a strong voice. She was soon discerned as the power behind Harris’ bid. Pelosi had been instrumental in a behind-the-scenes campaign to have Biden step aside. She then endorsed Harris with, as she announced, “immense pride and limitless optimism for our country’s future.” She added that her support was “official, personal and political,” Other endorsements came in thick and fast as did donations to the campaign fund. Three possible contenders for the post of President, Governors Gretchen Whitmer, Michigan; J B Pritsker of Illinois and Andy Beshear of Delaware backed Harris. At her first appearance to fete Biden, she referred to his presidency as a “legacy of accomplishment unmatched in modern history.” It was interesting to watch her reception to visiting Israeli PM Netanyahu. Biden smiled and warmly greeted the Head of Israel as an old buddy and again promised aid to Israel. Kamala Harris showed less warmth and much less support. She also mentioned the fact that horrors of war could not be overlooked. Said she in an interview: “I also expressed with the prime minister my serious concern about the scale of human suffering in Gaza, including the death of far too many innocent civilians.” Of course, she had to be very civil to Netanyahu and not offend Jews, but she, as Cass said before, gives a glimmer of hope for the Palestinians. Wondering about her religion, Cass googled and found she is a Baptist with faith that traces back to Martin Luther King and Gandhi. Her mother would have been a Hindu and her father is an Anglican Christian. Her husband probably follows the Jewish faith. So, let’s hope Kamala Harris wins the presidency of the US of A, a great honour to women around the world. Though not openly sexist, Harris has shown she is sympathetic to women’s issues. She seems to be against the SC’s putting aside Roe V Wade and thus stamping down on women’s right to abortion. Re-elected Another outstanding woman is the re-elected President of the European Union – Ursula Gertrude von der Leyen – serving as the 13th Prez of the EU since 2019. She served in the German federal government between 2005 and 2019, holding positions in Angela Merkel’s cabinet, lastly as Federal Minister of Defence. Cass read when Merkel resigned that Ursula von der Leyen was tipped to be the next German Chancellor but preferred her post as head of the EU. Born in 1958, she higher studied in the London School of Economics – 1978 and followed a medical course in the Hanover Medical School graduating in 1987. Married to a medical physician, the pair have seven, yes, seven children. She is outstandingly beautiful, composed, and though more sedate and restrained, is regal in posture and manner. Unfortunate Leader The travails of Aung San Suu Kyi have been long, included tragedies, separation from husband and two sons, and imprisonment. Born in 1945 to national hero father Aung San and wise mother Khin Kyi, she studied in New Delhi both secondary and higher at the University of Delhi till 1964, then proceeded to London and joined St Hugh’s College, Oxford, graduating in 1968. She joined the UN in New York while her fiancee Dr Michael Aris was in Bhutan; a keen student of Tibetan language, Buddhism and culture. Married in 1972, they settled in UK and had two sons. She joined SOAS to follow a doctorate course. In 1988 she returned alone to Myanmar to care for her ill mother. She stayed on joining and then leading the National League for Democracy (NLD). Her party won the parliamentary election in 1989 but was not allowed to form a government by the military government which names itself the State Peace and Development Council (SPDC). She suffered house arrest for three decades -1989 to 2010, then won an election in 2016 and was appointed State Counsellor of Myanmar, equal to Prime Minister. In 19 91 she won the Nobel Prize for Peace. Her life continued to be wrought with troubles and tragedies. Her husband suffering terminal cancer was not given a visa to enter Myanmar though world leaders appealed for this. The SPDC said she could go but Suu Kyi sacrificed her spending time with her husband and sons because she suspected this to be a ruse to get her out of the country and not allow returning. Another problem faced by her was world censure on her personally for allowing the genocide of the Rohingyar in Rakhine State. She even had to appear before the International Court of Justice in the Hague in 2019. But her hands were tied. She could not act counter to the military. After elections in November 2020 when her party again won a landslide victory, she was arrested in 2021 and several charges leveled against her of corruption, inciting violence etc. She was convicted several times adding up to 33 years in prison, reduced to 27. She is now under house arrest, said to be because she is ill. Cass listened to a YouTube interview with her elder son, ponytailed and unimpressive, saying he was spearheading her full release since she is very ill. No definite news is out about her condition, delicate and frail as she looks. She’s proved to be hero and martyr for her country like her father who is named The Father of the Nation. Local It’s still full preoccupation with presidential elections; who joins which Party and the SLPP deciding not to support independent candidate Ranil Wickremesinghe. Namal Rajapaksa has been referred to as Namal Baba even in press editorials, cultivating his face to resemble his father’s and emerging to the limelight; however, Cass surmises too protective of himself to be a candidate in September 21 elections. He sure will be up front in 2029/30. Our women? There are one or two good women politicians in parliament but no one in the political firmament. Hirunika is on the fringe in spite of her spending a couple of days in prison for the offence of abduction. Notwithstanding, Cassandra places bets on Hirunika becoming a leader in this country. She demonstrated woman power in her active criticism of Prez Gotabaya. What is brightest is the honour brought to our country by sports women. Our cricket team led by Chamari Athapaththu won the Asian cricket cup recently. Not for them glamour and panache and vanity, displayed recently by some male cricketers; and losing games. The women, as is wont, train hard and play the game as it should be played. Our two women athletes at the Olympics may not win medals but them qualifying to compete is honour enough. Congrats and thanks to all of them!","summary":"By Lalin I De Silva In Sri Lanka, adverse possession allows an individual to claim ownership of land after occupying it openly, continuously, and without the owner&#8217;s permission for a period of typically 10 years. This legal concept involves specific requirements such as continuous and open occupation, treating the land as one&#8217;s own, and possessing [&#8230;]","url":"https://island.lk/understanding-adverse-possession-and-its-impact-on-agricultural-value-chains-in-sl/","image":"http://island.lk/wp-content/uploads/2024/06/THE-ISLAND.jpg","video":null,"publish_date":"2024-08-01 23:45:23","author":"Thilina Walpola","authors":["Thilina Walpola"],"language":"en","source_country":"ik","sentiment":0.165},{"id":253187174,"title":"Kamala Harris’ poll surge and Fed rate cut odds deflate ‘Trump trade’","text":"In the 11 days since President Joe Biden declared he wouldn’t seek a second term and Democrats united behind the candidacy of Vice President Harris, strategies seen benefiting from a win by Donald Trump have lost steam. The dollar has stagnated, Treasuries have rallied and Bitcoin has slid. Polls now suggest a dead heat between Harris and Trump in swing states, handing markets a harsh reminder on the risk of betting on political events. Just weeks ago, an assassination attempt and doubts over Biden’s age were seen as helping Trump, who is seen embracing looser fiscal policy, higher trade tariffs and softer financial regulation if he returns to the White House. “We have seen some Trump trades unwinding,” Neeraj Seth, chief investment officer and head of APAC fundamental fixed income at BlackRock, said in a Bloomberg Television on Thursday. “We’ll go back and forth between now and the fifth of November.” The markets aren’t solely reacting to the electoral outlook. Fed Chair Jerome Powell acknowledged this week the central bank could pare rates in September, also pushing investors to favor Treasuries and doubt the dollar. That signaling is likely to annoy Trump, who recently told Bloomberg Businessweek a rate cut just weeks before the vote is something officials “know they shouldn’t be doing.” What Bloomberg’s Strategists Say… “Investors have received a cautionary lesson in the dangers of underestimating how rapidly political landscapes can shift. The more likely outcome, especially with the Fed putting a rate cut on the table for next meeting, is for trades tied to US politics to go to sleep until September ends.” — Garfield Reynolds, MLIV Asia team leader. Click here for more Here’s a rundown of how the Trump trades are faring: Bond Trades Focus in the world’s biggest bond market has recently been more tied to monetary policy then politics. Treasuries rallied to cap a third-straight month of gains in July — the longest winning streak for US bonds in three years — after Powell spoke on Wednesday. That runs counter to one iteration of the Trump trade, which posits the Republican’s return to the White House would likely lead to tax cuts and add to the national debt, casting a shadow over longer-dated Treasuries. However, a favorite way to express that concern, via bets on a steeper yield curve, remains a good play for traders thanks to the Fed’s shift toward cuts. An easing Fed is likely to support a so-called bull steepener, where short-dated Treasuries rally more than bonds with further-out maturities. BlackRock’s Seth sees the Fed policy path as “more important” from a 12-to-18 month time horizon, rather than trying to speculate on where the elections are going. “We are moving toward the easing cycle, that’s unambiguous,” he said. Dollar A gauge of the US dollar has stalled since Biden pulled out of the race. Some traders had been wagering that the dollar would rally into a Trump victory on the premise that it would benefit from a haven bid before the election and then from trade tariffs thereafter. But that bet got a lot more complicated when Trump weighed in last month to argue that a highly-valued greenback is a “tremendous burden” on US companies, and chose strong-dollar skeptic and Ohio Senator JD Vance as his running mate. Roughly two-thirds of respondents to a Bloomberg MLIV Pulse survey conducted between July 22 and 26 said they expected a second term for Trump would ultimately undermine the greenback as the world’s reserve currency. Still, 26% saw the dollar as the best refuge from volatility if he were to win. Given the competing impulses, the Fed’s shift is arguably the more consequential driver for the dollar going forward. The Bloomberg Dollar Spot Index suffered its worst day in more than two months on Wednesday as Powell confirmed the central bank’s growing bias toward easing. A softer dollar is “the path of least resistance until the election outcome reduces the uncertainty associated with post-election trades,” Steven Englander, head of global G-10 FX research at Standard Chartered, wrote Thursday. Stocks Prison companies GEO Group Inc. and CoreCivic Inc. are expected to benefit in case of a Republican sweep, given Trump’s tough stance on immigration. But their shares have slid since Biden dropped out of the race. By contrast, gun stocks like Smith & Wesson Brands and Sturm Ruger & Co. are faring well so far. Bank stocks — which have been called out as a key potential beneficiary from a Trump administration because of optimism for regulatory relief — have largely held on to their July gains amid the broader market’s rotation trade. Meanwhile, Trump Media & Technology Group Corp., parent of Truth Social, has slumped over 20% since July 21. The stock had seen some wild swings lately among all the election headlines. “What was viewed as a cake walk has become very competitive leading many to question whether the Trump Trade was done a bit premature,” said Peak Capital Management CEO Brian Lockhart. “I expect there to be a lot of ‘noise’ in the markets that will likely mean higher levels of volatility through the election.” China Risk Belying expectations the yuan will be hammered as Trump trades gather momentum, the offshore unit strengthened 1% against the dollar in July — the best performance since November. Recent gains in the yuan have been partly driven by a surge in the yen, with the two currencies increasingly moving in lockstep. Investors agree that Chinese assets remain at risk regardless of who wins the election, though they’ll likely fare worse under Trump. The former president has floated slapping 60% tariffs on imports from China and 10% duties from the rest of the world. Harris may continue existing national security and industrial policy measures directed against the world’s second-largest economy. The developments can favor regions like India and defensive stocks such as Asia REITs, which are less exposed to trade risks and stand to benefit from a lower rate environment, said Ray Sharma-Ong, head of multi-asset investment solutions for Southeast Asia at abrdn. Cryptocurrencies Rising doubt that Trump will get a chance to implement his pro-crypto agenda has undermined Bitcoin in recent days. The original cryptocurrency has become something of a proxy for Trump’s odds of returning to the White House after he pledged to make the US the “crypto capital of the planet and the Bitcoin superpower.” Crypto stocks Coinbase Global Inc., Marathon Digital Holdings Inc. and Riot Platforms Inc. have also fallen since Biden dropped out. Kyle Doane, head of trading at Arca, said some of the recent Bitcoin weakness may be due to Harris “inching up in the polls.” Harris Trade Unlike the Trump trade, strategies associated with a Harris win have been touted less so far. With the expectation that she will inherit Biden administration’s policy stance, market watchers are placing more weight on macro drivers. “We would favor more bullish positioning on Asian equities on unhedged basis if Harris wins, since Harris is unlikely to introduce large inflationary shocks to the global economy,” said Homin Lee, senior macro strategist at Lombard Odier Singapore Ltd. “The core drivers of the ongoing disinflation in the US will be preserved.” For abrdn Plc, the Harris trade has yet to emerge because it’s not clear what the composition of the US Congress will be. “Should we get a blue wave in Congress, we expect the Democrats to push for the reintroduction of their pandemic-era child tax credits and an increase in corporation tax,” Sharma-Ong said. “This will be a drag on the bottom line of corporates, and markets will favor stocks with strong margins.” For some, it’s just too early to play the Harris trade. “Her lead, for now, isn’t due to anything she has done but rather because nothing has been done or initiated, leaving room for optimism to grow,” said Hebe Chen, an analyst at IG Markets in Melbourne.","summary":"Polls now suggest a dead heat between Harris and Trump in swing states, a harsh reminder on the risk of betting on political events.","url":"https://fortune.com/2024/08/01/kamala-harris-poll-surge-fed-rate-cut-trump-trade/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/08/GettyImages-2164054795-e1722555574160.jpg","video":null,"publish_date":"2024-08-01 23:41:26","author":"Bloomberg,Carter Johnson,Tania Chen,Winnie Hsu","authors":["Bloomberg","Carter Johnson","Tania Chen","Winnie Hsu"],"language":"en","source_country":"US","sentiment":-0.017},{"id":253187020,"title":"Harris praises Rep. Sheila Jackson Lee as champion of justice","text":"Vice President Kamala Harris on Thursday lauded Rep. Sheila Jackson Lee as a “fierce champion of justice” at the funeral of the prominent voice on African American and women’s rights within the Democratic Party. Jackson Lee announced in June she had pancreatic cancer and was undergoing treatment. The Texas lawmaker died on July 19, aged 74. Harris was the highest-ranking U.S. official at Jackson Lee’s Houston service, acting as consoler in chief for the 15-term representative who promoted legislation addressing social justice, economic inequality and public health. “To know her was to marvel at her mastery of the legislative process,” said Harris, who is poised to become the Democratic presidential nominee after President Joe Biden quit the race last month. Harris recalled her work with the congresswoman on a bill to recognize “Juneteenth” as a federal holiday commemorating the end of the legal enslavement of Black Americans. She recognized they were both members of Alpha Kappa Alpha, a historically African American sorority for female students at U.S. universities and colleges. The vice president’s rival, Republican Donald Trump, on Wednesday falsely suggested to the country’s largest annual gathering of Black journalists that Harris had previously downplayed her Black heritage. Harris, who is of Indian and Jamaican heritage, has long identified as both Black and Asian. The service at Fallbrook Church included a gospel choir, singers and tributes from fellow Democrats ranging from U.S. Representative Pramila Jayapal to former U.S. President Bill Clinton, who lauded Jackson Lee’s commitment to democracy. She “really believed that we were all created equal,” said the 42nd president. Jackson Lee, a graduate of Yale College and the University of Virginia Law School, was a vocal proponent of police reform in the face of congressional roadblocks after the 2020 police killing of George Floyd, a Black man whose death sparked nationwide protests. Civil rights attorney Ben Crump said she was among the first to support the families of Black people killed by police, ranging from Breonna Taylor to Trayvon Martin and Michael Brown. He was among speakers who said she prepared the ground for Harris to become the first Black woman to be a major party’s presidential candidate. The Reverend Al Sharpton called on the audience to follow in Jackson Lee’s footsteps fighting for criminal and racial justice. “We will fight every bigot and racist whether they’re Black of white or orange,” said Sharpton.","summary":"Vice President Kamala Harris on Thursday lauded Rep. Sheila Jackson Lee as a &#8220;fierce champion of justice&#8221; at the funeral of the prominent voice on African American and women&#8217;s rights within the Democratic Party.","url":"https://www.staradvertiser.com/2024/08/01/breaking-news/harris-praises-rep-sheila-jackson-lee-as-champion-of-justice/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-01T205838Z_1671936445_RC2879ALKFLL_RTRMADP_3_USA-ELECTION-HARRIS.JPG","video":null,"publish_date":"2024-08-01 23:34:00","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"US","sentiment":-0.198},{"id":253186168,"title":"Washington Post Prepares for Potential Election Disruption with Results Expected to be Delayed","text":"Last Updated on August 1, 2024 Over three months before the 2024 Presidential Election, The Washington Post is setting the stage for electoral chaos, and “election results [that] could again take days to count” in the battleground states of Pennsylvania and Wisconsin, where the Democrat-dominated courts have upheld Covid-era mail-in voting rules that election watchdogs call unconstitutional. A recent report from The Washington Post threatens GOP voters and election integrity hawks with the prospect of delayed election results and chaos at vote-counting facilities this November while quoting Democrat lawmakers to get its point across. The report reads staunchly in favor of “pre-canvassing,” a practice where mail-in or drop-box election ballots are opened and counted BEFORE election day, making for a vote-counting free-for-all that only ends when election officials say it ends. The “pre-canvassing” scheme has drawn major election integrity concerns in states across the country, but especially in presidential battlegrounds, where Democrats have demanded that Republicans pass legislation to allow ballots to be filled out, collected, and counted throughout election season. In both Pennsylvania and Wisconsin, however, they’ve been unable to get the legislation passed, and now, they appear to be resorting to emotional blackmail; threatening delayed election results and 2020-style chaos at vote-counting facilities, if “pre-canvassing” which is often akin to ballot harvesting, isn’t written into state election laws. As The Washington Post reported: “If the electoral college comes down to Pennsylvania or Wisconsin, we might still face a long period where we don’t know the winner,” said Rachel Orey, an elections expert at the Bipartisan Policy Center. … “It’s reprehensible that they didn’t get it done,” said Kathy Boockvar, a Democrat who was Pennsylvania’s secretary of state during the 2020 election. “This is not rocket science. The reality is that not passing this bill will mean that ballots will take longer to count, which means it will be longer until we have the results of the election.” … “Do you want the results on election night? Or do you want to wait a day or two?” said Lisa Deeley, a Democratic city commissioner in Philadelphia. “If you want to wait, then wait you will.” EXCLUSIVE NATIONAL FILE INTERVIEW: Election Integrity Defender Tina Peters Claims That Election Fraud Crimes Occurred In Colorado As She Faces Prison In Political Witch Hunt Remarkably, at the top of The Washington Post article, the report’s authors go out of their way to explain away massive Democrat ballot drops during the 2020 Presidential Election, specifically in Pennsylvania. There, they admitted that “President Donald Trump appeared to be winning” on election night, only for his lead to evaporate after mail-in ballots were counted and tabulated, seemingly all at once, and almost entirely for Democrats.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLast Updated on August 1, 2024 Over three months before the 2024&#8230;\n\n\nThis Post: Washington Post Prepares for Potential Election Disruption with Results Expected to be Delayed first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/washington-post-prepares-for-potential-election-disruption-with-results-expected-to-be-delayed/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-WaPo-Sets-Stage-for-Election-Chaos-Results.jpg","video":null,"publish_date":"2024-08-01 23:32:34","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.289},{"id":253186568,"title":"Letters: Textile waste | Promoting vaccines | Running for himself | Honest pick | Harris’ example","text":"State bill could impact global textile waste Re: “Fast fashion comes home to roost in Chinese landfills” (July 10). When I saw the July 10 headline about textile waste in China’s landfills, my first reaction was guilt. I’ve made many purchases from fast fashion companies that contribute to this growing waste problem. It feels like every purchase I make worsens the climate crisis and I have little power to fix it. I was able to find hope in a bill in the California Legislature that could reduce wasteful practices in the fashion industry, not only in California but across the globe. The Responsible Textile Recovery Act (Senate Bill 707) would establish regulations that hold clothing companies responsible for creating a statewide textile recycling program to divert their garments from entering landfills. This bill can change the entire fashion industry because it sets a precedent for similar legislation across the globe. As Californians, we have the opportunity to initiate a sustainable fashion movement by calling on our representatives to pass SB 707. Radha Feist Berkeley Promoting vaccines overseas protects U.S. Re: “U.S. must honor vaccination promise” (Page A6, July 26). Ricardo Narvaez’s recent letter about vaccines makes an excellent point about their value. An abundance of air travel to anywhere in the world is making our planet seem smaller and smaller. To protect ourselves and our families from the many contagious diseases we must encourage our representatives to support GAVI, the international vaccine alliance. Florida lost more than 404 per 100,000 people due to COVID in past years, while California lost 256. This was because of our state’s high vaccination rate. The more we protect the world, the more we protect ourselves. Bill Nicholson Martinez Like Trump, Vance is in race for himself Re: “The unnerving changeability of JD Vance” (Page A7, July 30). In her column, Michelle Goldberg suggests psychological factors that might explain JD Vance’s political transformation. I think the appeal of choosing to be Donald Trump’s running mate is much simpler. If Trump wins and JD Vance becomes vice president, by certifying only an election result he approves of, he alone will choose the president who follows Trump. If he runs for election, he may certify his own victory. Chris Brown Oakland Liars in both parties make Haley best pick On the right, we have Donald Trump’s big lie that he actually won the last election. And now the left has its own big lie: that Joe Biden was perfectly healthy and able to function in his capacity as president. Kamala Harris, now the Democrats’ candidate for president, helped propagate that lie. The fact that both major candidates for president are proven liars shows how the lust for power has corrupted our major political parties. The Democrats have gone so far as to dispense with any democratic process in the selection of Harris. Neither party is deserving of the presidency, and neither Trump nor Harris is qualified or fit to be president. Our democracy is in trouble — from the Democrats as much as the Republicans. The solution is a new, moderate party. Absent that, the only viable presidential candidate to emerge is Nikki Haley. In November, write in Nikki for president. Dick Patterson El Cerrito Harris sets good example for the youth My 4-year-old grandson does not subscribe to the old adage, “Children should be seen and not heard.” Lately, he has been asserting, “Excuse me. I’m not done talking.” I’m proud of him. I’m also proud of Kamala Harris, who embodies a heart and a soul, and who, I am confident, has the grit, experience and wisdom to create a forward trajectory for all inhabitants of our country. Kamala’s talking and I’m listening. Sharon Brown Walnut Creek Harris administration would offer hard lesson I can understand why many young, first-time voters, especially those right out of high school, will flock to Kamala Harris. It gives them the exciting opportunity to make history by electing our first woman president with the promise of a lot of free stuff and a comfortable life. It will take them a few election cycles to learn that all politicians lie and that there is no such thing as a free lunch. They will also learn that most presidents do more harm than good, and some are so bad their policies and decisions get people killed. Right now, our volunteer military enlistments are falling short of their goals and the world is a tinder box in part because of our country’s perceived weakness. How the bad guys act under a Harris presidency versus a Donald Trump one may result in a life-altering change of plans for those first-time voters of draft age. Bill Behan Brentwood Local delegation must support vaccine pledge Re: “U.S. must honor vaccination promise” (Page A6, July 26). I thought polio and measles were done. But they, as well as new diseases, return in times of war, increasing poverty and climate stress. I assume my California senators, as well as my representative, Rep. Barbara Lee, and the rest of the Bay Area representatives, will support keeping the U.S. promise to the GAVI Alliance and vote for H. Res. 1286 and S. Res 684. I just want to say that it is important and to remember to vote for it. Susan Oehser Oakland","summary":"East Bay Times Letters to the Editor for Aug. 2, 2024","url":"https://www.mercurynews.com/2024/08/01/letters-1818/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/sjm-inable-Fashion_199921444.jpg?w=1024","video":null,"publish_date":"2024-08-01 23:30:46","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.07},{"id":253187198,"title":"Trump's Nephew Fred Reveals on the 'The View' That His Uncle Wanted a Black Kid Thrown in Jail","text":"Fred Trump III, nephew of former President Donald Trump, made waves on Tuesday's episode of The View with startling revelations from his new book, \"All in the Family: The Trumps and How We Got This Way.\" The memoir gives a close-up view of the Trump family's life. Fred talks about his own experiences and shows a pretty disturbing side of his uncle. Growing up in Jamaica, Queens, Fred had a close relationship with Donald due to his own father's struggles with alcoholism. He recounted, \"I had a bike stolen by three Black kids,\" Fred explained. When the police recovered the bicycle, it was Donald who accompanied young Fred to retrieve it. \"Donald was — he absolutely wanted to see this kid put in jail,\" Fred recalled. Despite being just 10 years old at the time, Fred said he objected, not wanting to ruin another child's life over a bicycle theft, as per The Raw Story. The conversation took a darker turn as Fred described hearing his uncle use racial slurs. \"I was there. I have absolutely no doubt whatsoever. Twice, he used the N-word,\" he stated firmly. Fred talked about how this incident tied into what Donald did later, like when he loudly criticized the Central Park Five, who are now called the Exonerated Five. But the most surprising part was when Fred talked about his son, William Trump, who was born with a rare genetic disorder causing serious disabilities. Fred said that when he asked Donald for more money to help with William's medical care, his uncle's response was chilling. \"Without hesitation, [Trump] said, 'Your son doesn't recognize you. Let him die and move to Florida,'\" Fred told the visibly shocked hosts. He added, \"I don't think you could hear something like that and not be surprised. But that is what he has become. It's sad.\" The Donald team quickly shot down these accusations. Steven Cheung, who handles Trump's communications, put out a statement saying the claims were \"completely fabricated and total fake news of the highest order.\" Cheung said, \"Anyone who knows President Trump knows he would never use such language.\" Fred has been pretty open about not liking his uncle's politics. On a show, he said he's gonna vote for Vice President Kamala Harris in the next election. \"I believe in policy over politics, and without question, Kamala Harris's policies are what I get behind,\" he declared. Fred's book and interviews offer a unique peek into the private life of a very well-known political figure. Fred was on The View as part of a media tour for his book. Earlier that same day, he was on Good Morning America, where he called his uncle \"atomic crazy\" and said he had really made a mark on the family, as per The Hill.","summary":"&#34;I was there&#34; and heard him &#34;use the N-word,&#34; Fred Trump III stated firmly. In response, Steven Cheung defended Donald Trump with a statement.","url":"https://www.inquisitr.com/trumps-nephew-fred-reveals-on-the-the-view-that-his-uncle-wanted-a-black-kid-thrown-in-jail","image":"https://dab57h0r8ahff.cloudfront.net/708520/uploads/c65e10d0-4ff5-11ef-b55a-d15f864f7a3e_1200_630.jpeg","video":null,"publish_date":"2024-08-01 23:30:11","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","source_country":"US","sentiment":-0.211},{"id":253187176,"title":"Why Trump needs people who might kill him to vote for him","text":"I have been saying the exact motive of the young man from rural Pennsylvania who tried assassinating the former president is not that mysterious. He was clearly someone who believed political violence is an acceptable alternative to democratic politics, and this was evidenced by, you know, his trying to assassinate the former president. A man who believes political violence is an acceptable alternative to democratic politics is a man who’s been steeped in rightwing politics, which is to say, he’s a man who listens to what Donald Trump has to say about Jews, immigrants, Black people and the republic itself. Put two and two together, and you don’t need the FBI or any other law enforcement body to tell you Trump was a victim of rightwing political violence, which is another way of saying he reaped what he sowed. That, to me, is the biggest story of our time. Rightwing political violence is such a threat to democracy, freedom and the rule of law that even the country’s leading advocate of rightwing political violence is not safe from it. Indeed, his life remains in grave danger, as he continues to stoke hatreds of racial and sexual minorities while also knowing that in doing so, he’s taking his life into his own hands. Worse, Trump and the Republicans are preventing wider discussion of the effect of rightwing political violence on democratic politics. After all, they don’t want to deter people from voting for Trump, though they might also try killing him if the conditions are right. He needs them to bully Democratic voters and GOP officials who might reconsider loyalty to him. His attempted assassination should have shown how fragile he is. Authoritarianism is a house of cards. As it is, however, we’re still wondering about the assassin’s exact motives. Even so, his exact motive is important, as is any declaration from the law enforcement body that ascertains what that motive is. So I hope Tuesday’s testimony by the FBI’s second-in-command moves the needle somewhat. According to NPR, FBI investigators found “a social media account featuring antisemitic and anti-immigration comments that investigators believe to be associated with the gunman.” “There were over 700 comments posted; some of these comments, if ultimately attributable to the shooter, appear to reflect antisemitic and anti-immigration themes to espouse political violence and are described as extreme in nature,\" FBI Deputy Director Paul Abbate told a session of the Senate Judiciary and Homeland Security committees. Abbate was circumspect. There’s more digging to do. But I don’t think he’d offer evidence of the role of rightwing political violence in Trump’s attempted assassination if he were not fairly confident in the strength of that evidence. Moreover, the FBI, as an institution, tends to overlook the realities of rightwing political violence. (The bureau is majority white, and its agents are often sympathetic to rightwing politics, though they may not share its affinity for violence.) The evidence must be pretty strong if it can overcome that blind spot. Yet for all the public interest in the assassin’s motive, the Republicans on the Senate committees didn’t seem interested. Instead of wanting to know why he tried killing Trump, they wanted to know why the Secret Service allowed him to be in a position to try killing him. That’s not unreasonable, to be sure. The Secret Service screwed up. But let’s not pretend the assassin’s motive doesn’t matter to the Republicans. US Senator and vice presidential pick JD Vance was quick to assign motive even before the assassin’s gun stopped smoking: “The central premise of the Biden campaign is that President Donald Trump is an authoritarian fascist who must be stopped at all costs,” he said. “That rhetoric led directly to President Trump’s attempted assassination.” But if it’s not the right motive, they seem uninterested. They’d rather blame institutions, in this case the FBI or Secret Service, to gin up conspiracies about Trump’s victimhood by the Democrats or “the deep state.” US Senator Roger Marshall, of Kansas, told the acting head of the Secret Secret his institution has “some type of a cultural problem.” That wouldn’t be so bad, I figure, if everyone else, especially the Washington press corps, did not play along with their demagoguery. Even when the FBI uncovers real evidence of a real assassin who really was participating in rightwing politics, and who really did believe political violence is an acceptable alternative to democratic politics, reporters don’t seem to notice the significance of it. It doesn’t fit the framing of the news, which is to say, the GOP’s preference for blaming enemies for the bad things that happen to happen to Donald Trump. In the end, the Republicans on the Senate committees probably don’t need the FBI to tell them about the assassin’s motive. They already know. They already know for the same reasons I already know. The difference is that I don’t think that fact is damned inconvenient. Indeed, a wider conversation about the dangers of rightwing political violence would be a great service to America as well as a practical way of protecting Trump from the evils he seems bent on stirring up. It may be too late for Trump, though. Anything short of complete rightwing politics is going to be seen as compromise, which is going to be seen as a betrayal so complete as to be worthy of assassination.","summary":"I have been saying the exact motive of the young man from rural Pennsylvania who tried assassinating the former president is not that mysterious. He was clearly someone who believed political violence is an acceptable alternative to democratic politics, and this was evidenced by, you know, his trying to assassinate the former president. \n\nA man who believes political violence is an acceptable alternative to democratic politics is a man who’s been steeped in rightwing politics, which is to say, he’s a man who listens to what Donald Trump has to say about Jews, immigrants, Black people and the republic itself. Put two and two together, and you don’t need the FBI or any other law enforcement body to tell you Trump was a victim of rightwing political violence, which is another way of saying he reaped what he sowed. \n\nThat, to me, is the biggest story of our time. Rightwing political violence is such a threat to democracy, freedom and the rule of law that even the country’s leading advocate of rightwing political ","url":"https://www.alternet.org/alternet-exclusives/trump-assassinaiton-attempt/","image":"https://www.alternet.org/media-library/image.jpg?id=53076744&width=1200&height=600&coordinates=0%2C148%2C0%2C73","video":null,"publish_date":"2024-08-01 23:30:07","author":"John Stoehr","authors":["John Stoehr"],"language":"en","source_country":"US","sentiment":-0.362},{"id":253187196,"title":"A Peek Into the Alleged Extramarital Affairs of the Trump Family","text":"The Trumps and Their Reported 'Affairs' Donald Trump's controversial connections are an integral part of his image, and people will continue to associate him with them. The real estate mogul from New York City gained national notoriety in the 1980s due to the intense media attention surrounding his first divorce, which was caused by an alleged extramarital romance with a model. But he's not the only Trump family member to be surrounded by extramarital affairs scandals. Donald Trump Jr.' purported links to a former participant and Tiffany Trump's alleged involvement with Secret Service agents have been the subject of several rumors. Some of the other members of the clan also have fascinating tales to tell. 1. Donald Trump Jr. Alleged Affair With a ‘Celebrity Apprentice’ Participant Donald Jr. and Aubrey O'Day first bonded, when she was a competitor and he was an advisor on the program. In 2012, Donald Trump Jr.'s wife Vanessa found some texts between Donald and Aubrey O'Day, a previous participant on Celebrity Apprentice. This led to the sudden end of what was supposedly an affair between the two. One insider told People, \"This is how Vanessa found out and the affair ended. To Don Jr. [the affair] was very exciting. Aubrey was very, very into Don. He liked her but she was definitely more keen on him.\" 2. Vanessa and Tiffany Trump Alleged Affairs With Secret Service Agents As per The Guardian, during Donald Trump's presidency, a book said that his youngest daughter Tiffany, and daughter-in-law Vanessa had suspicious ties with the Secret Service members assigned to their protection. According to Pulitzer Prize-winning Washington Post reporter Carol Leonnig's book Zero Fail: The Rise and Fall of the Secret Service, the youngest daughter of former president and the now-ex-wife of Donald Trump Jr. both grew 'inappropriately — and perhaps dangerously — close' to members of the security detail. 3. The Alleged Affair of the Previous President With Marla Maples The beginning of Donald Trump's affair with Marla Maples caused intrigue and controversy. In 1989, Donald and Ivana's marriage was rocked by rumours of an affair with a young model, and the marriage eventually ended in a high-profile divorce. Despite conflicting narratives and widespread interest, the affair and its aftermath revealed the intricate relationships inside the Trump family and captivated the media, as pointed out by Nicki Swift. In 1991, two years after Ivana and Donald's divorce, the ex-president got married to Marla. In 1997, they announced their divorce. 4. Alleged Affair With Stormy Daniels Stormy Daniels first met Donald Trump in 2006 at a golf event. In a 2018 interview with CBS 60 Minutes, it was revealed that Daniels met up with Donald in his hotel room where they had a brief chat. She added, \"It started off — all about him just talking about himself. And he's like — 'Have you seen my new magazine?'\" The ostentation shown by Donald failed to impress Daniels. Rather, she spanked him after humorously asking him to remove his trousers, which he dutifully did. She added, \"And — from that moment on, he was a completely different person. He quit talking about himself and he asked me things and I asked him things and it just became like more appropriate.\" 5. Affair Claims by a Playboy Model Karen McDougal, a former Playboy model, said in an interview with CNN's Anderson Cooper that she and Donald had an affair for ten months after meeting at a Playboy Mansion party. According to McDougal, she went to see Donald on many occasions, and he even took her to Trump Tower. The model stated, \"We went into the back entrance, and at that point I realized where we were going, and I said, 'Aren't you afraid to bring me here?' He's like, 'They won't say anything.' I'm like, 'OK.' So, we went upstairs and we looked around.\"","summary":"Additionally, there were allegations of an adulterous affair involving the oldest son of the previous president.","url":"https://www.inquisitr.com/a-peek-into-the-alleged-extramarital-affairs-of-the-trump-family","image":"https://dab57h0r8ahff.cloudfront.net/708323/uploads/88b4e700-4f36-11ef-a4a5-a753b5e50914_1200_630.jpeg","video":null,"publish_date":"2024-08-01 23:30:01","author":"INQUISITR,Priyanka Pandey","authors":["INQUISITR","Priyanka Pandey"],"language":"en","source_country":"US","sentiment":0.243},{"id":253186232,"title":"Trump campaign responds to heated interview with Black journalists","text":"Trump campaign responds to heated interview with Black journalists Former President Donald Trump is not backing down from his fiery remarks at the National Association of Black Journalists convention on Wednesday. Janiyah Thomas, director of Black media affairs for the Trump campaign, joins \"America Decides\" to discuss the Republican presidential nominee's false attack on Vice President Kamala Harris' racial identity.","summary":"Former President Donald Trump is not backing down from his fiery remarks at the National Association of Black Journalists convention on Wednesday. Janiyah Thomas, director of Black media affairs for the Trump campaign, joins \"America Decides\" to discuss the Republican presidential nominee's false attack on Vice President Kamala Harris' racial identity.","url":"https://www.cbsnews.com/video/trump-campaign-responds-heated-interview-black-journalists/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/01/0a778904-1b09-48a5-a34d-062dcdd8a42b/thumbnail/1200x630/c1ab9572216501a1c6ed40a25560b1d4/trump.jpg?v=d7dedd293aad546f97f947149642d369","video":null,"publish_date":"2024-08-01 23:30:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.062},{"id":253186696,"title":"How Trump can reshape his messaging on DEI after NABJ interview goes off the rails","text":"Former President Donald Trump’s messaging on diversity, equity, and inclusion was put under the microscope during a hostile interview at the National Association of Black Journalists convention on Wednesday. Trump was directly asked if he believes Vice President Kamala Harris is a “DEI hire,” and his response was to criticize Harris for previously leaning into her Indian heritage only to “turn black” and embrace her African American heritage. Some Republicans were disconcerted by his retort. “Race and gender have nothing to do with why Kamala Harris is the most unpopular Vice President in history,” Karoline Leavitt, the Trump campaign National press secretary, told the Washington Examiner. “Kamala failed at her job as Border Czar, supported all of Joe Biden’s disastrous policies, and lied to the American people about Biden’s cognitive decline,” Leavitt added. “She is weak, dishonest, and dangerously liberal, and that’s why the American people will reject her on November 5th.” Harris publicly supported Biden to remain as Democrats’ presidential nominee up until the point that he dropped his reelection bid and endorsed her. She has not signaled any knowledge or feeling that she believes his mental acuity has been impaired. Republicans, such as Trump and his campaign, however, have accused her of covering for her boss. From a longtime NABJ member’s point of view Tariq Nasheed, a longtime member of the NABJ, shared his thoughts on Trump’s messaging on DEI with the Washington Examiner. Nasheed said that “Trump needs to drop the DEI messaging” because people used the term as “another boogieman code word meant to vilify Black people.” He warned that “it would be hard for Trump to get away from the racism allegations while still using racial code words, that everyone understands to be racial.” Nasheed, who has been critical of Harris regarding her black identity before, said he doesn’t believe the vice president was “a DEI hire,” but he doesn’t consider Trump’s comments about her racial identity to be “an attack.” “This has been a major discussion within Black American society,” he said. “Many Black people question why Kamala Harris, who does NOT come from a Foundational Black American lineage, starts engaging in performative Blackness during every political season. We remember when she was absolutely being promoted and identified as an Indian American woman.” He added, “She has a practice of cosplaying Foundational Black American cultural aesthetics, and this legitimately causes many Black people to question her motives and authenticity.” Black commentators warn Trump not to ‘take the bait’ Three black conservative or conservative-leaning political commentators told the Washington Examiner how they would recommend Trump reshape his messaging on DEI going forward. The commentators, all of whom have been critical of Harris before, agreed that the former president should turn his focus away from race and slam Harris on policy. “DEI is a tired dog whistle for Democrats,” Armstrong Williams, radio host and part owner of the Baltimore Sun, said. “Trump & Co. don’t need to take the bait. Make this race NOTHING about color. No one cares.” Williams said inflation is “killing the black community” just as much if not more than it is the white community. He also listed fentanyl use, housing, immigration, and wage growth as issues that are hurting black people the most. “You name the policy, and Harris is weak on it.” “So don’t chase these DEI and other fake words,” he added. “Stay on mission: she’s a failed border czar who can’t govern on the issues that matter most.” Stacy Washington, an Air Force veteran and ambassador for black leadership network Project 21, agreed with criticism of Harris leaning into her black heritage “after years of her using her Indian heritage to identify with voters in California,” but warned that focusing on this distracts the public from Harris’s far-left record. Washington told the Washington Examiner that Harris leaning into her black heritage “smacks of rank opportunism” but “that is her personality, and she will continue to distract from her far left viewpoints as long as we dance to her tune.” “From here on out,” Washington said Trump should focus on the issues voters by and large agree on. “Americans want the southern border closed, lower interest rates, lower inflation, and less foreign entanglements (less war),” Washington said. “President Trump gave America all of these things and can do so again.” Deroy Murdock, Fox News contributor and emeritus media fellow with the Hoover Institution, said, “Kamala Harris and the far-Left Democrats want Donald J. Trump to focus on race” so that anything “he says will be turned into, ‘Racist!’” “Rather than play their game,” he offered, “Trump should focus on public policy.” He recommended Trump ask voters if they are better off now than they were under his first term, if they are “happier now paying higher prices for energy, food, and housing,” if they prefer the Biden-Harris administration’s “wide-open border” to Trump’s “much-tighter border,” and if they “feel safer on America’s streets and with this country’s place in the world” under the current administration. What is a ‘DEI hire’? When ABC’s Rachel Scott asked Trump if Harris was a “DEI hire,” before mentioning her race, he asked for a definition of “DEI.” Scott told him that it stands for “diversity, equity, and inclusion” but did not elaborate, possibly standing as the reason Trump did not directly answer the question. Featured in many colleges, businesses, and government agencies, DEI initiatives were designed to foster the participation and equitable treatment of all people regardless of their race, sex, and other categories. However, these initiatives have resulted in such categories being considered for college admittance, job roles, and other positions that are traditionally awarded through merit. When Scott asked Trump if Harris was a “DEI hire,” she was really asking him if the vice president was selected based on her race, sex, or some other unchangeable category. As Nasheed, the longtime NABJ member, noted, this language has adopted racial undertones, and some people have used the term “DEI hire” to describe any woman or minority chosen for a prominent role. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER However, accusations of Harris being a “DEI hire” were fed by then-presidential hopeful Joe Biden’s 2020 promise to select a woman as his running mate. He additionally vowed to put a black woman on the Supreme Court before eventually nominating Justice Ketanji Brown Jackson in 2022. As of 2024, 10 states have signed anti-DEI legislation into law and 16 other states have proposed similar legislation.","summary":"Former President Donald Trump’s messaging on diversity, equity, and inclusion was put under the microscope during a hostile interview at the National Association of Black Journalists convention on Wednesday. Trump was directly asked if he believes Vice President Kamala Harris is a “DEI hire,” and his response was to criticize Harris for previously leaning into [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3108110/trump-messaging-dei-nabj-convention/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/donald-trump-nabj-convention.webp","video":null,"publish_date":"2024-08-01 23:29:43","author":"Peter Cordi","authors":["Peter Cordi"],"language":"en","source_country":"US","sentiment":-0.366},{"id":253186666,"title":"Amazon says distraction of Olympics, Trump assassination attempt contributed to weak forecast","text":"Amazon is pointing to an unusually busy news cycle as one of the drivers behind its weak revenue forecast. On a call with reporters following the company's second-quarter earnings report on Thursday, Amazon CFO Brian Olsavsky said one reason the company expects a slippage in online shopping this quarter is because consumers are distracted. There's the Paris Olympics, which began last month, as well as the ramp up to the 2024 presidential election in November. Olsavsky also pointed to the attempted assassination of former President Donald Trump at a Pennsylvania rally last month, which came just before the Republican National Convention. \"Customers only have so much attention,\" Olsavsky said. \"When high profile things happen, or the assassination attempt a couple of weeks ago, you see that people shift their attention to news. It's more about distractions.\" For the third quarter, which runs through September, Amazon said it expects revenue of $154 billion to $158.5 billion. The midpoint of the range, $156.25 billion, fell short of consensus estimates of $158.24 billion, according to LSEG. The disappointing guidance, coupled with a revenue miss for the second quarter, sent Amazon shares sliding more than 7% in extended trading. The chaotic news cycle isn't the only factor affecting consumer spending patterns, and company executives didn't even bring up that topic on the quarterly earnings call with analysts. One big issue they did address is that shoppers continue to be cautious with their spending due to economic challenges. CEO Andy Jassy said on the analyst call that consumers are buying cheaper items, meaning there's a lower average selling price (ASP) on products sold. \"Customers continue to trade down on price when they can,\" Jassy said. \"More discretionary, higher ticket items like computers or electronics or TVs are growing faster for us than what we see elsewhere in the industry but more slowly than we see in a more robust economy.\" On the media call, Olsavsky said consumers are \"continuing to be cautious\" and are more focused on buying everyday essentials, which helps explain why Amazon \"came in a little short\" on revenue for the quarter. Other e-commerce companies have made similar observations. Wayfair saw a slowdown in home goods purchases due to inflation and a stagnant housing market. Etsy CEO Josh Silverman said in an interview on CNBC's \"Squawk Box,\" following second-quarter earnings on Wednesday, that \"it's a tough time for the consumer,\" and that \"every industry is really seeing it.\" When it comes the the Olympics, Amazon's loss is NBCUniversal's gain. The company, which is the parent of CNBC, said this week that it's hit at least $1.25 billion in ad revenue from broadcasting the Paris Olympics. \"More than 70% of advertisers for the 2024 Summer Games are new, with nearly half a billion dollars coming from first-time sponsors,\" the company said in a statement on Wednesday. It's a short-term blip for Amazon, but one that Olsavsky says contributes to a difficult forecast. \"A lot of times, purchases will defer and you know people will come back and buy what they were going to buy,\" he said. Disclosure: CNBC parent NBCUniversal owns NBC Sports and NBC Olympics. NBC Olympics is the U.S. broadcast rights holder to all Summer and Winter Games through 2032. WATCH: A pullback in Amazon is a buying opportunity","summary":"Amazon CFO Brian Olsavsky told reporters after the company's earnings reports that \"we do see different traffic patterns during those events.\"","url":"https://www.cnbc.com/2024/08/01/amazon-says-distraction-of-olympics-trump-shooting-caused-weak-guide.html","image":"https://image.cnbcfm.com/api/v1/image/106953082-1633520942768-gettyimages-1235716018-GEEKWIRE_2021.jpeg?v=1722554794","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2024/M08D01/7000347519/1722544440-35627219978-hd_L.mp4","publish_date":"2024-08-01 23:26:54","author":"Annie Palmer","authors":["Annie Palmer"],"language":"en","source_country":"US","sentiment":-0.41},{"id":253186222,"title":"Vance blames Harris for illegal immigration during border visit","text":"HEREFORD, Arizona >> Donald Trump’s running mate JD Vance blamed Vice President Kamala Harris for illegal immigration during a visit to the U.S.-Mexico border in Arizona on Thursday and claimed that migrants were overwhelming U.S. schools and hospitals. Vance, speaking in front of the border wall in the town of Hereford, called Harris a failed “border czar” and said she should have worked with U.S. agencies to deal with illegal crossings, even though Harris was tasked with a narrower role of addressing migration from Northern Central America. “Kamala Harris as border czar was asked to coordinate all these functions in government and she’s done nothing,” he said. Republicans have tried to hold Harris responsible for high levels of illegal immigration under President Joe Biden, a Democrat who dropped his presidential bid last month. Biden’s exit paved the way for Harris to become the likely nominee. Harris has responded by emphasizing her support for a bipartisan U.S. Senate border security bill introduced earlier this year. Republicans rejected the bill after Trump came out in opposition. “Donald Trump does not care about border security,” Harris said during a speech in Atlanta on Tuesday. “He only cares about himself.” While the number of migrants caught illegally crossing the border soared to record levels under Biden, they have plummeted since Biden issued new border restrictions in June. U.S. Border Patrol caught around 57,000 migrants crossing illegally in July, two U.S. officials told Reuters, the lowest monthly total since September 2020 when Trump was still president. Vance, a Republican U.S. senator from Ohio who often speaks of his childhood exposure to drug addiction, said Harris’ policies had allowed fentanyl to enter the U.S. although most convicted fentanyl traffickers in recent years were U.S. citizens. Vance said American children “feel overwhelmed with migrant children who shouldn’t be there” and that hospital wait times “have exploded” because migrants are seeking healthcare. The Trump campaign did not immediately provide supporting evidence for either assertion. “The human toll of this is the thing that we cannot forget,” Vance said.","summary":"HEREFORD, Arizona >> Donald Trump&#8217;s running mate JD Vance blamed Vice President Kamala Harris for illegal immigration during a visit to the U.S.-Mexico border in Arizona on Thursday and claimed that migrants were overwhelming U.S. schools and hospitals.","url":"https://www.staradvertiser.com/2024/08/01/breaking-news/vance-blames-harris-for-illegal-immigration-during-border-visit/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_2024-08-01T200757Z_1_LYNXMPEK7027N_RTROPTP_3_USA-ELECTION-VANCE-BORDER.JPG","video":null,"publish_date":"2024-08-01 23:22:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.486},{"id":253186178,"title":"Trump is making his 2024 campaign about Harris’ race, whether Republicans want him to or not","text":"NEW YORK (AP) — Donald Trump has found tremendous success from the very first moment he stepped onto the presidential stage by stoking racial animus. Democrats expressed new outrage this week at the former president’s derisive and false charge that Vice President Kamala Harris, who is of Jamaican and Indian heritage, only recently “turned Black” for political gain. Some Republicans — even from within Trump’s own campaign — seemed to distance themselves from the comment. But Trump’s rhetoric this week, and his record on race since he entered politics nearly a decade ago, indicate that divisive attacks on race may emerge as a core GOP argument in the three-month sprint to Election Day — whether his allies want them to or not. A Trump adviser, granted anonymity Thursday to discuss internal strategy, said the campaign doesn’t need to focus on “identity politics” because the case against Harris is that she is “so liberal it’s dangerous.” The adviser pointed to Harris’ record on the Southern border, crime, the economy and foreign policy. In a sign that Trump may not be coordinating his message with his own team, the Republican presidential nominee doubled down on the same day with a new attack on Harris’ racial identity. He posted on his social media site a picture of Harris donning traditional Indian attire in a family photo. Sen. Cynthia Lummis, a Wyoming Republican who has endorsed Trump, was among a number of lawmakers on Capitol Hill who said Thursday that the rhetoric around race and identity is not “helpful to anyone” this election cycle. “People’s skin color doesn’t matter one iota,” Lummis said in an interview. Trump turned to an old tactic against Harris It’s been less than two weeks after President Joe Biden ended his reelection bid and endorsed Harris. Trump has had to pivot from campaigning against an 81-year-old white president showing signs of decline to facing a 59-year-old biracial vice president who is drawing much larger crowds and new enthusiasm from Democratic donors. Trump went to the National Association of Black Journalists convention on Wednesday. In an appearance carried live on cable news and shared widely online, he falsely suggested Harris misled voters about her race. “I didn’t know she was Black until a number of years ago when she happened to turn Black and now she wants to be known as Black. So, I don’t know, is she Indian or is she Black?” Trump said Wednesday. At a Pennsylvania rally hours later, Trump’s team displayed years-old news headlines describing Harris as the “first Indian-American senator” on the big screen in the arena. And Ohio Sen. JD Vance, Trump’s running mate, told reporters traveling with him that Harris was a “chameleon” who changed her identity when convenient. Harris attended Howard University, the historically Black institution where she pledged the Alpha Kappa Alpha sorority, and has often talked throughout her career about being both about being Black and Indian American. Some Republicans argued that Trump’s message on race is part of a broader pitch that may appeal to some Black voters. “We’re focused on policy and how we can actually make waves and changes in the Black community. Economics, education, inflation, lowering costs. That’s what the message is,” said Diante Johnson, president of the Black Conservative Federation, which supports Trump’s efforts to win over more Black voters and hosted him at a gala in February. Veteran Republican pollster Frank Luntz said he explored the issue during a Wednesday focus group with swing voters almost immediately after Trump’s interview. He found that Harris may be vulnerable to criticism based on her gender, but race-based attacks could hurt Trump among the voters that matter most this fall. Much has changed, Luntz said, since Trump rose to prominence by questioning the citizenship of Barack Obama, the nation’s first Black president. “Trump seems to think that he can criticize her for how she’s dealt with her race. Well, no one’s listening to that criticism. It simply doesn’t matter,” Luntz said. “If it’s racially driven, it will backfire.” Eugene Craig, the former vice chair of the Maryland Republican Party, said that Trump “got what he wanted” at the NABJ convention but that the substance of his argument risked being more offensive than appealing. “The one thing that Black folks will never tolerate is disrespecting Blackness, and that goes for Black Republicans too,” said Craig, who is Black and worked as a staffer for conservative pundit Dan Bongino’s 2012 Senate campaign. He is now supporting Harris. Trump has a long history of racist attacks Trump has frequently used race to go after his opponents since he stepped into presidential politics nearly a decade ago. Trump was perhaps the most famous member of the so-called “birther” movement questioning where Obama was born. He kicked off his first campaign by casting Mexican immigrants as “rapists” and drug traffickers and later questioned whether a U.S. federal judge of Mexican heritage could be fair to him. While in the White House, Trump defended a white supremacist march in Charlottesville, Virginia, and suggested that the U.S. stop accepting immigrants from “shithole” countries including Haiti and parts of Africa. In August 2020, he suggested Harris, who was born in California, might not meet the Constitution’s eligibility requirements to be vice president. And just two weeks after formally entering the 2024 campaign, he dined with notorious white supremacist Nick Fuentes at his Mar-a-Lago residence. Trump won in 2016 but lost reelection in 2020 to Biden by close margins in several swing states. He swept the 2024 Republican primary even while facing a raft of criminal charges. Some Trump critics worried that his racial strategy might resonate with a significant portion of the electorate anyway. Voters will decide in November whether to send a Black woman to the Oval Office for the first time in the nation’s nearly 250-year history. “I hope Trump’s attacks on Harris are just him flailing about ineffectively. But put together Trump’s shamelessness, his willingness to lie, his demagogic talent, and the issue of race — and a certain amount of liberal complacency that Trump is just foolish — and I’m concerned,” Bill Kristol, a leading conservative anti-Trump voice, posted on social media Thursday. The Harris campaign thinks there’s little upside for Trump A Harris adviser described the moment as an opportunity to remind voters of the chaos and division that Trump breeds. But the adviser, granted anonymity to discuss internal strategy, said it would be a mistake for Democrats to engage with Trump’s attacks on race at the expense of the campaign’s broader focus on key policies. So long as the campaign does not get distracted, the adviser said, Harris’ team believes there is little political upside for Trump to continue attacking Harris’ racial identity. Harris told a gathering of a historically Black sorority on Wednesday that Trump’s attack was “the same old show: the divisiveness and the disrespect.” On the ground in at least one swing state, however, there were signs that Trump’s approach may be resonating — at least among the former president’s white male base. Jim Abel, a 65-year-old retiree who attended a rally for Vance in Arizona on Wednesday, said he agreed with Trump’s focus on Harris’ racial identity. “She’s not Black,” Abel said. “I’ve seen her parents. I’ve pictures of her and her family and she’s not Black. She’s looking for the Black vote.” But several high-profile Republican voices disagreed. Conservative commentator Ben Shapiro posted on X a picture of a road sign with two directions. One led to, “Attack Kamala’s record, lies and radicalism,” while the other, “Is she really black?” “I dunno guys, I just think that maybe winning the 2024 election might be more important than having this silly and meaningless conversation,” Shapiro wrote. ___ Brown reported from Chicago. AP writers Stephen Groves, Mary Clare Jalonick and Farnoush Amiri in Washington; and Gabriel Sandoval in Glendale, Arizona, contributed to this report. Steve Peoples And Matt Brown, The Associated Press","summary":"NEW YORK (AP) — Donald Trump has found tremendous success from the very first moment he stepped onto the presidential stage by stoking racial animus. Democrats expressed new outrage this week at the former president&#8217;s derisive and false charge that Vice President Kamala Harris, who is of Jamaican and Indian heritage, only recently “turned Black” [&#8230;]","url":"https://toronto.citynews.ca/2024/08/01/trump-is-making-his-2024-campaign-about-harris-race-whether-republicans-want-him-to-or-not/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/ce50489bded2307f5fad26d86c512bccd161aa821c3e8b0a3348c94281419a6a.jpg","video":null,"publish_date":"2024-08-01 23:19:12","author":"News Staff,Steve Peoples And","authors":["News Staff","Steve Peoples And"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.108},{"id":253185886,"title":"Appeals court upholds Donald Trump's gag order as he again presses judge to exit hush money case","text":"Nation Appeals court upholds Donald Trump's gag order as he again presses judge to exit hush money case Two months after his felony conviction, Donald Trump still isn't allowed to say everything he wants about his historic hush money criminal case. After a New York appeals court upheld his gag order Thursday, he won't be for a while. By MICHAEL R. SISAK Associated Press August 1, 2024 at 11:16PM Former President Donald Trump sings along with “God Bless the USA” as he takes to the stage at a rally at the Herb Brooks National Hockey Center on July 27, 2024 St. Cloud, Minn. (Glen Stubbe/Star Tribune) NEW YORK — Two months after his felony conviction, Donald Trump still isn’t allowed to say everything he wants about his historic hush money criminal case. After a New York appeals court upheld his gag order Thursday, he won’t be for a while. The state's mid-level appellate court denied the Republican former president and current nominee's latest bid to lift the restrictions, swatting away a last-minute argument that he's unfairly muzzled while Vice President Kamala Harris, his likely Democratic opponent, pits herself as an ex-prosecutor taking on a ''convicted felon.'' At the same time, Trump's lawyers are again asking trial Judge Juan M. Merchan to exit the case, saying his daughter's work for Harris' 2020 presidential campaign underscores questions about his ability to be impartial. Merchan rejected two prior recusal requests, last year and at the start of the trial in April, saying the defense's concerns were ''hypothetical'' and based on ''innuendos'' and ''unsupported speculation.'' In a letter to Merchan made public Thursday, Trump lawyer Todd Blanche said Harris' entry into the presidential race makes those issues ''even more concrete'' and said the judge hasn't addressed them \"at a level of detail sufficient to repair the lack of public confidence in the integrity of these proceedings.\" Separately, House Judiciary Committee Chairman Rep. Jim Jordan, R-Ohio, sent a letter to Loren Merchan demanding she turn over any documents pertaining to Harris' campaign, President Joe Biden's abandoned reelection campaign, and any discussions she or her firm may have had about Trump's hush money prosecution. Jordan's request Thursday includes any conversations she may have had with her father about the case. A message seeking comment was left with Loren Merchan. In its gag order ruling Thursday, a five-judge panel found that Judge Merchan was correct in keeping some restrictions in place until Trump is sentenced because the case is still pending and his conviction doesn't constitute a change in circumstances that warrants lifting it. ''The fair administration of justice necessarily includes sentencing,'' they wrote. The gag order bars Trump from speaking out about the prosecution team, court staffers or their families, including Merchan's daughter, a Democratic political consultant. In June, Merchan lifted a ban on Trump commenting about witnesses and jurors, and he has always been free to speak about the judge and Manhattan District Attorney Alvin Bragg, an elected Democrat whose office prosecuted the case. Trump is scheduled to be sentenced on Sept. 18, but the case and gag order could end before that if Merchan grants a defense request to throw out his conviction in light of the Supreme Court's presidential immunity ruling. Merchan said he plans to rule on Sept. 6. Most Read Nation Donald Trump falsely suggests Kamala Harris misled voters about her race World US and Russia complete biggest prisoner swap in post-Soviet history, freeing Gershkovich and Whelan Nation 9/11 ‘20th hijacker’ arrested in Minnesota is denied transfer from federal supermax to French prison Nation Japan Osprey crash caused by cracks in a gear and pilot's decision to keep flying, Air Force says Most Read Nation Donald Trump falsely suggests Kamala Harris misled voters about her race World US and Russia complete biggest prisoner swap in post-Soviet history, freeing Gershkovich and Whelan Nation 9/11 ‘20th hijacker’ arrested in Minnesota is denied transfer from federal supermax to French prison Nation Japan Osprey crash caused by cracks in a gear and pilot's decision to keep flying, Air Force says Blanche and a Manhattan DA's office spokesperson declined to comment on Thursday's ruling. The appeals court ruled a day after Blanche tried filing papers asking it to immediately lift the gag order. With a decision imminent, the court rejected the filing, which called the restrictions an ''unconstitutional, election-interfering'' restraint on Trump's free speech while he seeks to retake the White House. In a copy of the prospective filing provided to The Associated Press, Blanche wrote that Harris' entering the race had given the matter new urgency and that it's ''unconscionable that Harris can speak freely about this case, but President Trump cannot.\" The defense also revived complaints that prosecutor Matthew Colangelo was biased because he was a Justice Department official under Biden. Trump is unable to air those grievances himself because of the gag order. Trump's lawyers have made several efforts to lift the gag order. Their latest fight landed in the state's intermediate appeals court — the Appellate Division, one rung up from Merchan's trial court level — after they struck out with the state's top court. The Court of Appeals last month declined to hear Trump's gag order challenge, finding it did not raise ''substantial'' constitutional issues that would warrant immediate intervention. Merchan imposed the gag order in March, restricting Trump from commenting about witnesses, jurors and others connected to the case, after prosecutors raised concerns about his habit of attacking people involved in his legal matters. The judge soon expanded it to prohibit comments about his own family after Trump lashed out on social media at the judge's daughter and made false claims about her. During the trial, the judge held Trump in contempt of court and fined him $10,000 for violations, and he threatened to jail him if he did it again. Trump, who has denied any wrongdoing, was originally scheduled to be sentenced July 11. Merchan postponed it until September while he considers the impact of the Supreme Court's ruling, which gave broad protections to presidents and insulated them from prosecution for official acts. The ruling also restricted prosecutors from citing any official acts as evidence in trying to prove a president's unofficial actions violated the law. Trump's lawyers argue his trial was ''tainted'' by evidence that shouldn't have been allowed, pressing their case in a new court filing Thursday. Prosecutors contend the high court's opinion ''has no bearing'' on the hush money case because it involves unofficial acts for which the former president is not immune. A Manhattan jury convicted Trump on May 30 of falsifying records to cover up a potential sex scandal, making him the first ex-president convicted of a crime. Trump's conviction, on 34 felony counts, arose from what prosecutors said was an attempt to cover up a hush money payment to porn actor Stormy Daniels just before the 2016 presidential election. She claims she had a sexual encounter with Trump a decade earlier, which he denies. Trump's former lawyer Michael Cohen paid Daniels and was later reimbursed by Trump. Prosecutors said Cohen disguised the reimbursements with Trump's knowledge by submitting monthly invoices for retainer payments as his personal lawyer. Trump's company logged the payments to Cohen as legal expenses. Prosecutors said the Daniels payment was part of a broader scheme to buy the silence of people who might have gone public during the 2016 campaign with embarrassing stories alleging Trump had extramarital sex. Trump has pledged to appeal his conviction, but he would not be able to do so until he is sentenced.","summary":"Two months after his felony conviction, Donald Trump still isn't allowed to say everything he wants about his historic hush money criminal case. After a New York appeals court upheld his gag order Thursday, he won't be for a while.","url":"https://www.startribune.com/new-york-appeals-court-leaves-trumps-gag-order-in-place-after-hush-money-conviction/600596626","image":"https://cloudfront-us-east-1.images.arcpublishing.com/startribunemedia/2O7K4NPOWJH2RIA5DYAGS4TPWE.jpg","video":null,"publish_date":"2024-08-01 23:16:25","author":"Michael R. Sisak","authors":["Michael R. Sisak"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.181},{"id":253185596,"title":"Sony Music Group Renews Voter Registration Campaign for 2024 Election","text":"As the 2024 presidential election heats up ahead of Nov. 5, Sony Music is throwing its hat in the ring with a campaign to increase voter turnout. Called Your Voice, Your Power, Your Vote, the non-partisan initiative is meant to educate artists, songwriters, industry professionals and communities across the country about voter registration. Its website offers resources to register to vote, check voter registration status and request a ballot. The site also provides free imagery that can be used on social media and other platforms to encourage others to vote. Originally launched ahead of the 2020 presidential election, the project is presented in partnership with APIAVote, Black Futures Lab, National Black Justice Collective, Rock the Vote, Vote.Org, Voto Latino, and When We All Vote. “2024 is another important election year in the U.S., and we know that people can make their voices heard through voting,” said Towalame Austin, executive vp for global philanthropy and social impact at Sony Music Group. “We helped bring more voters out to the polls in 2020 with our partner organizations and we’re hoping to contribute to an even higher turnout this year. SMG is proud to once again use our platform to support civic participation.” The music industry is getting involved with the presidential election in increasingly prominent ways, with Megan Thee Stallion performing and Quavo speaking at a Kamala Harris rally in Atlanta earlier this week and the presumptive Democratic nominee also garnering support from artists including Charli XCX and Beyoncè, whose “Freedom” soundtracks Harris’ debut campaign video. Meanwhile, Republican nominee Donald Trump has gotten support from artists including Kid Rock and Jason Aldean. Additionally, the Music Sustainability Alliance recently announced a new monthly webinar series called The Green Room. The free series launches Sept. 3 with a session called “Turning Fans Into Activists,” which will focus on how artists are encouraging fans to become politically active and how they can do so without alienating them.","summary":"First launched in 2020, the non-partisan initiative is meant to educate artists, songwriters, industry professionals and communities about voter registration and turnout.","url":"https://www.billboard.com/pro/sony-music-voter-registration-campaign-2024-election/","image":"https://www.billboard.com/wp-content/uploads/media/american-flag-july-4th-2019-billboard-1548.jpg","video":null,"publish_date":"2024-08-01 23:12:57","author":"Katie Bain","authors":["Katie Bain"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.397},{"id":253186694,"title":"Dan Bongino shocked over new phone footage capturing Trump’s would-be assassin","text":"Former Secret Service agent and talk show host Dan Bongino questioned how security missed former President Donald Trump’s would-be assassin, as newly unearthed footage captured on a cellphone was able to spot the shooter on the roof. The would-be assassin, who has been identified as Thomas Matthew Crooks, was visible in cellphone video moving across the roof across from Trump for a few seconds, then reappearing just a few seconds later. Bongino, who previously served in the Secret Service for 12 years, referenced how acting Secret Service Director Ronald Rowe had claimed the locals stated they were working through “an issue” with the area where Crooks was, or “the three o’clock.” “If you’re looking at the three o’clock, how the hell do you miss this?!” Bongino said on his show. “This is a cell phone camera! Geen went to school for film stuff. This is not a zoom, high, telephoto, freaking lens used to film a Marvel movie! It’s a cellphone! You can see the guy clear as day! How did they miss this?!” Bongino then asked those who are still defending the Secret Service’s handling of securing Trump, “What is left to defend?” He argued that with so many failures happening with this event, the defenders are asking people “to believe the implausible.” Rowe claimed Tuesday that neither the Secret Service countersniper teams nor members of Trump‘s security detail had “any knowledge” that there was a shooter with a gun on the roof. He also called the assassination attempt of Trump a “failure on multiple levels” Rowe took over as acting director after Kimberly Cheatle resigned from the position following her testimony before the House Oversight Committee last month. Bongino argued Cheatle needed to resign immediately for her “apocalyptic security failure” on security at Trump’s event. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER The shooting at Trump’s rally in Butler, Pennsylvania, happened two days before the 2024 Republican National Convention, where Trump became the party’s presidential nominee. Podcast host Joe Rogan said he initially believed the shooting would have guaranteed Trump’s victory in the election. However, he now says the press has “memory-holed” the assassination attempt very quickly, and that Vice President Kamala Harris could end up being the victor.","summary":"Former Secret Service agent and talk show host Dan Bongino questioned how security missed former President Donald Trump’s would-be assassin, as newly unearthed footage captured on a cellphone was able to spot the shooter on the roof. The would-be assassin, who has been identified as Thomas Matthew Crooks, was visible in cellphone video moving across [&#8230;]","url":"https://www.washingtonexaminer.com/news/entertainment/3108126/dan-bongino-shocked-over-new-phone-footage-capturing-trumps-would-be-assassin/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Trump-failed-assassination-scaled.webp","video":null,"publish_date":"2024-08-01 23:11:06","author":"Asher Notheis","authors":["Asher Notheis"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.362},{"id":253185498,"title":"Kamala’s ‘all foam, no beer’ campaign has her ducking media, while Trump tussles","text":"After watching the opening act of the Kamala Harris presidential campaign, one thing is abundantly clear: She and her handlers think they can win the White House by pleading the Fifth from now through Nov. 5. Ever since she launched her first presidential campaign back in January of 2019, Kamala Harris has not held one US press conference. She has not done anything resembling a tough interview. She’s really no different from Joe Biden: Take away her teleprompter and her script, and things go sideways in a hurry. Compare that to Donald Trump, who on Wednesday was invited to appear before the National Association of Black Journalists in Chicago. Trump, in an effort to expand his inroads with black voters by making himself accessible, accepted the invitation. Smart move — because he has shown he can connect with minority voters across the board, especially during this campaign cycle. Recall his visits to the South Bronx and Harlem this spring, his sneaker convention appearance before a largely minority and Gen Z audience and his rally in the blue state of New Jersey with an estimated 100,000 people in attendance. His NABJ appearance was classic Trump, sparring out of the gate with the hopelessly biased ABC News correspondent Rachel Scott. Scott accused Trump of racism based on his criticism of Manhattan DA Alvin Bragg — a profoundly ridiculous premise, given how critical Trump has been of prosecutor Jack Smith, who at last check was a white guy. But when Trump was actually asked relevant questions about inflation and illegal immigration by Fox News anchor Harris Faulkner, he hammered Kamala on both issues, underscoring that during his time as president, black voters were far better off. The facts and numbers back that up: Inflation was lower, employment was higher. And illegal immigration under Biden-Harris has greatly impacted citizens in urban areas, where they’re seeing their jobs and social services like sanitation and education and police taken away. The Trump outreach is paying dividends: A recent CNN poll shows the Republican getting an eye-popping 30% of the black vote compared to Harris, who gets 63%. Usually the split is around 90/10 for the Democrat — so needless to say, if Trump can get even half that level of support, this race is over. For her part, Harris also received an invitation from the NABJ, but declined to appear live and will only do so at some point by Zoom (sound familiar?). The reason is simple: Harris and actual journalists asking germane questions about her radical policy positions simply cannot co-exist. And as we’ve seen from the Queen of Word Salads, she does not possess the ability to speak extemporaneously with anything resembling coherent arguments. She would have to answer questions on ending the fossil-fuel industry, abolishing ICE, ending all private health insurance and providing free health care to illegal immigrants, for starters. Harris would also be asked to explain her support of late-term abortion, sanctuary cities, allowing violent criminals to vote from jail and everything from her desire to expand the Supreme Court to allowing biological men to compete against biological women in sports. Team Harris thinks she can win not on the issues (outside of abortion), but on thin-sliced identity groups working on her behalf, such as the testosterone-challenged White Dudes for Harris, and perhaps the occasional interview with RuPaul’s drag queens. All foam and no beer. That’s Kamala Harris. And at a time when Americans face a raft of serious problems, from inflation to crime to an open border to an increasingly unstable world, we can’t have another candidate who hides from questions and accountability while going up against a fearless candidate like Donald Trump. Joe Concha is the author of the new bestseller “Progressively Worse: Why Today’s Democrats Ain’t Your Daddy’s Donkeys.”","summary":"She's really no different from Biden: Take away her teleprompter and her script, and things go sideways in a hurry.","url":"https://nypost.com/2024/08/01/opinion/kams-all-foam-no-beer-campaign-has-her-ducking-scrutiny/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-0293rizfc-1722550300092.jpg?quality=75&strip=all&1722535971&w=1200","video":"https://cdn.jwplayer.com/videos/tTVnuAka-RyIcpnTz.mp4","publish_date":"2024-08-01 23:06:27","author":"Joe Concha","authors":["Joe Concha"],"language":"en","source_country":"us","sentiment":0.088},{"id":253185842,"title":"US Vice President Kamala Harris, the presumptive Democratic presidential nominee, said Republican rival Donald Trump's criticism of her was 'the same old show' of his 'divisiveness' and disrespect","text":"US Vice President Kamala Harris, the presumptive Democratic presidential nominee, said Republican rival Donald Trump's criticism of her was 'the same old show' of his 'divisiveness' and disrespect | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save US Vice President Kamala Harris, the presumptive Democratic presidential nominee, said Republican rival Donald Trump's criticism of her was 'the same old show' of his 'divisiveness' and disrespect Brandon Bell Tags Partners/afp As featured on Trump attacks Harris's racial identity, says she opted to 'turn Black' Donald Trump suggested Wednesday that Vice President Kamala Harris had decided to \"turn Black\" for political gain, as he attacked his Democratic White House rival during a combative interaction with African American journalists in Chicago. Facebook Twitter WhatsApp SMS Email Print Save GEC conducts test election 14 hrs ago Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Parents arrested for murder, child abuse, in 3-year-old boy's near-drowning Brandon Duenas remembered as humble, respectful, family man; GPD investigation continues NWS: Wetter conditions expected for later this week, weekend 15-year sentence for former Guam resident who defrauded Army of over $108M Man on pre-trial release accused of stealing wallet, money, gasoline, car Local Events","summary":"US Vice President Kamala Harris, the presumptive Democratic presidential nominee, said Republican rival Donald Trump's criticism of her was 'the same old show' of his 'divisiveness' and disrespect","url":"https://www.guampdn.com/news/national/us-vice-president-kamala-harris-the-presumptive-democratic-presidential-nominee-said-republican-rival-donald-trumps/image_ecdd6c9f-62e0-554c-ba93-21a3e3a35aca.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/e/cd/ecdd6c9f-62e0-554c-ba93-21a3e3a35aca/66aafdc661066.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-01 23:06:12","author":"Brandon Bell","authors":["Brandon Bell"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.018},{"id":253185836,"title":"Republican US presidential nominee, former president Donald Trump, prepares to address a rally on July 31, 2024 in Harrisburg, Pennsylvania","text":"Republican US presidential nominee, former president Donald Trump, prepares to address a rally on July 31, 2024 in Harrisburg, Pennsylvania | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Republican US presidential nominee, former president Donald Trump, prepares to address a rally on July 31, 2024 in Harrisburg, Pennsylvania SPENCER PLATT Tags Partners/afp As featured on Trump attacks Harris's racial identity, says she opted to 'turn Black' Donald Trump suggested Wednesday that Vice President Kamala Harris had decided to \"turn Black\" for political gain, as he attacked his Democratic White House rival during a combative interaction with African American journalists in Chicago. Facebook Twitter WhatsApp SMS Email Print Save GEC conducts test election 14 hrs ago Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Parents arrested for murder, child abuse, in 3-year-old boy's near-drowning Brandon Duenas remembered as humble, respectful, family man; GPD investigation continues NWS: Wetter conditions expected for later this week, weekend 15-year sentence for former Guam resident who defrauded Army of over $108M Man on pre-trial release accused of stealing wallet, money, gasoline, car Local Events","summary":"Republican US presidential nominee, former president Donald Trump, prepares to address a rally on July 31, 2024 in Harrisburg, Pennsylvania","url":"https://www.guampdn.com/news/national/republican-us-presidential-nominee-former-president-donald-trump-prepares-to-address-a-rally-on-july/image_df78433d-7976-57ff-8773-ba42c6355418.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/d/f7/df78433d-7976-57ff-8773-ba42c6355418/66aafdc63865d.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-01 23:06:11","author":"Spencer Platt","authors":["Spencer Platt"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.006},{"id":253185844,"title":"Former US president and 2024 Republican presidential nominee Donald Trump, speaking to an organization of African-American journalists, suggested his Democratic rival Kamala Harris decided to 'turn Black' for political expediency","text":"Former US president and 2024 Republican presidential nominee Donald Trump, speaking to an organization of African-American journalists, suggested his Democratic rival Kamala Harris decided to 'turn Black' for political expediency | National News | guampdn.com Skip to main content You have permission to edit this image. Edit Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Save Former US president and 2024 Republican presidential nominee Donald Trump, speaking to an organization of African-American journalists, suggested his Democratic rival Kamala Harris decided to 'turn Black' for political expediency KAMIL KRZACZYNSKI Tags Partners/afp As featured on Trump attacks Harris's racial identity, says she opted to 'turn Black' Donald Trump suggested Wednesday that Vice President Kamala Harris had decided to \"turn Black\" for political gain, as he attacked his Democratic White House rival during a combative interaction with African American journalists in Chicago. Facebook Twitter WhatsApp SMS Email Print Save GEC conducts test election 14 hrs ago Latest E-Edition Pacific Daily News Pacific Daily News 2024 Guam Liberation Day Parade Liberation 80th Gallery CHamorus in Hawaii celebrate Liberation Day More images from Guam's 80th Liberation Day Parade 80th Liberation Day celebrations wrap up with fireworks over Hagåtña Trending Now Parents arrested for murder, child abuse, in 3-year-old boy's near-drowning Brandon Duenas remembered as humble, respectful, family man; GPD investigation continues NWS: Wetter conditions expected for later this week, weekend 15-year sentence for former Guam resident who defrauded Army of over $108M Man on pre-trial release accused of stealing wallet, money, gasoline, car Local Events","summary":"Former US president and 2024 Republican presidential nominee Donald Trump, speaking to an organization of African-American journalists, suggested his Democratic rival Kamala Harris decided to 'turn Black' for political expediency","url":"https://www.guampdn.com/news/national/former-us-president-and-2024-republican-presidential-nominee-donald-trump-speaking-to-an-organization-of/image_b5ff4602-3a9f-5d22-8d54-f8ddb2b4bf08.html","image":"https://bloximages.newyork1.vip.townnews.com/guampdn.com/content/tncms/assets/v3/editorial/b/5f/b5ff4602-3a9f-5d22-8d54-f8ddb2b4bf08/66aab7b1034b5.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize","video":null,"publish_date":"2024-08-01 23:06:10","author":"Kamil Krzaczynski","authors":["Kamil Krzaczynski"],"language":"en","catgory":"politics","source_country":"GU","sentiment":-0.037},{"id":253184974,"title":"Trump campaign reveals substantial July fundraising haul that’s likely to fall short of Kamala Harris’ windfall ","text":"Former President Donald Trump raised nearly $139 million last month, a massive fundraising haul in itself — but likely not enough to surpass Vice President Kamala Harris’ eye-popping July total. The 78-year-old Republican nominee and his authorized committees raked in $138.7 million in July and had $327 million in cash on hand, his campaign announced Thursday. “These numbers reflect continued momentum with donors at every level and provide the resources for the final 96 days until victory November 5th,” the Trump campaign said in a statement. Trump’s July haul came during a chaotic month that saw the former president survive an assassination attempt, formally receive the GOP nomination at the Republican National Convention and have to face a new opponent after President Biden dropped out of the race. His July sum eclipsed his $111.8 million June total but fell short of the $141 million in contributions he received in May, the same month he was found guilty in the Manhattan hush-money case. The Harris campaign has not announced its July totals, but they are expected to easily surpass Trump’s. Harris, 59, quickly locked up support from top Democrats after the 81-year-old president ended his re-election bid and endorsed her in a historically unprecedented move. Last week, her campaign claimed that the vice president enjoyed a mind-boggling $200 million fundraising bonanza in the days after Biden’s July 21 withdrawal. The quickly rebranded Harris for President campaign said that 66% of those donations came from first-time contributors during the 2024 cycle. Harris’ haul does not include funds the vice president inherited from Biden’s campaign and committee accounts, which the Trump campaign has asked the Federal Election Commission to look into, arguing that the transfer is the “largest campaign finance violation in American history.”","summary":"The 78-year-old Republican nominee and his authorized committees raked in $138.7 million in July and had $327 million in cash on hand, the Trump campaign announced Thursday. ","url":"https://nypost.com/2024/08/01/us-news/trump-campaign-reveals-substantial-july-fundraising-haul-thats-likely-to-fall-short-of-kamala-harris-windfall/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/trump-campaign-reveals-substantial-july-86699861.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Z3HXEpOH-RyIcpnTz.mp4","publish_date":"2024-08-01 23:00:52","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.42},{"id":253184976,"title":"Violent leftist hate has been ignored for too long — new map calls it out","text":"The bullet that whizzed through the ear of former President Donald Trump in Butler, Penn., on July 13 was fired by a shooter with apparently leftist sympathies. The man who opened fire on Republicans practicing for the Congressional baseball game and nearly took House Majority Leader Steve Scalise’s life in 2017 campaigned for Democratic Sen. Bernie Sanders. The transgender perpetrator of the 2023 Nashville school shooting, who murdered three 9-year-olds and three adults at the Presbyterian Covenant School, held a deep hatred for Christianity and said she would “kill” to get puberty blockers. These aren’t one-off events. A through-line unites all three harrowing incidents as well as hundreds of others: All emerged amid the extremist hate fomented by America’s progressive left. One could be forgiven for not making the connection. The image portrayed in mass media and by the Southern Poverty Law Center — long considered the gold standard for tracking “hate” in the United States — presents violent radicalism as the exclusive domain of the right. It’s not. The SPLC’s vaunted “Hate Map” is currently tracking 1,430 “hate and antigovernment groups” across the country. At first glance, the number is staggering — but a deeper look reveals it to be inflated. Among the 1,430 are all 310 nationwide chapters of the parental rights group Moms for Liberty. The Alliance Defending Freedom, a religious-liberty organization that has argued — and won — cases before the US Supreme Court, also features on the SPLC’s map, along with the Family Research Council, a traditional-values advocacy group. The latter was itself the target of leftist violence in 2012, when a radicalized LGBTQ activist opened fire in the lobby of FRC headquarters in Washington, DC. The attacker shot and injured the building’s security guard, but the carnage could have been far worse — the assailant came armed with 50 rounds of ammunition and 15 Chick-Fil-A sandwiches he intended to smear on his dead victims’ faces. Here’s the latest on the assassination attempt against Donald Trump: Newly surfaced texts show Trump rally gunman was on authorities’ radar more than 90 minutes before shooting: report FBI to conduct victim interview with Donald Trump after assassination attempt Trump promises more outdoor rallies despite Secret Service warning after assassination attempt Ex-Trump doc says FBI’s Wray is ‘wrong’ to doubt ex-prez was struck by bullet: ‘Absolutely no evidence’ Trump defends female Secret Service agent who was criticized after assassination attempt: ‘So brave’ When asked by law enforcement why FRC was in his crosshairs, the gunman replied, “Southern Poverty Law lists anti-gay groups. I found them online.” It’s a sad decline and a far cry from the SPLC’s message at the time of its 1971 founding, when it formed to rightfully condemn legitimately hateful domestic terrorist organizations like the Ku Klux Klan. “Time and again, I see the SPLC using the reputation it gained decades ago fighting the Klan as a tool to bludgeon mainstream politically conservative opponents,” Cornell professor and SPLC critic William Jacobson told Politico in 2017. In fact, in all its history, the SPLC has never put a left-wing group on its Hate Map. Such an abdication of duty and abandonment of mission isn’t just dishonest; it’s dangerous. By giving the veneer of objectivity but focusing only on one side of the equation, the SPLC allows hate on the left to go unmonitored and unchecked. That ends now. This week, the New Tolerance Campaign launched our own Hate Map project, cataloging individuals and organizations on the left that are inspiring and often directly engaging in physical violence against those with whom they disagree. There is no shortage of source material. Antifa militants in 2020 nearly killed conservative blogger Chad Nesbitt in North Carolina, and in 2019 another Antifa-led assault in Portland, Ore., left journalist Andy Ngo with a bleeding brain. In Atlanta, 23 Antifa activists were arrested and charged with terrorism following a January 2023 riot in which they threw “rocks, bricks, Molotov cocktails and fireworks at police.” The same faction also attempted to storm CNN headquarters on June 27 with the goal of shutting down the network’s presidential debate. The vicious attacks against Jewish students that rocked college campuses in the spring were entirely the product of the left. In May, Students for Justice in Palestine hunted Jewish students at Cooper Union in New York who barricaded themselves in the school library to escape their harassers. SJP is facing a lawsuit alleging it’s a “propaganda and recruiting wing” for Hamas terrorists. Radical transgender crusaders are on record condoning “any and all violence” against TERFs (“trans-exclusionary radical feminists) for the transgression of believing in biological sex and women’s-only spaces. Climate extremists such as Earth First promote “ecological resistance” — that is, industrial sabotage — that destroys private property and puts lives in danger. One thing is clear: the left in America has a hate problem. The first step to ending it is calling it out. Gregory T. Angelo is president of the New Tolerance Campaign.","summary":"The New Tolerance Campaign's \"Hate Map\" project tracks the leftists inspiring and often engaging in physical violence against those with whom they disagree.","url":"https://nypost.com/2024/08/01/opinion/new-map-calls-out-leftist-hate-and-violence/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/djetbeu12.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-01 23:00:43","author":"Gregory T. Angelo","authors":["Gregory T. Angelo"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.158},{"id":253185104,"title":"Letters: Desalination’s flaws | Trump sentencing | GOP fears","text":"Desalination would hurt wallets and environment Re: “Agency officials OK feasibility study for desalination facility” (Page A1, July 23). The Mercury News identifies many reasons for the public to be skeptical of desalination as a viable solution to our water crisis. Desalination is an unjust greenwashing scheme that can privatize water, is costly and energy-intensive, and could harm communities and ecosystems already affected by climate change. As someone born and raised in the Bay Area, I was shocked to see a false water solution that is so awful for people and the environment popping up in my own community. That’s why organizations like Food & Water Watch advocate for true, sustainable climate-resilient solutions like water conservation. An emphasis on so-called technological solutions like desalination blames water shortages on a lack of natural resources instead of short-sighted water policy. The Santa Clara Valley Water District must engage impacted communities before moving ahead with this failed plan. Their voices and livelihoods matter. Francesca Rossi Saratoga Let Trump’s behavior set terms of sentence The problem with sentencing Donald Trump is that half the country will be seriously upset if his Sept. 18 sentencing is strict and the other half will be equally upset if it isn’t. The solution is to make Mr. Trump directly responsible for his own sentence. If he upholds the convictions, Judge Merchan should inform Trump that sentencing takes into consideration many factors, but foremost is whether the defendant takes responsibility for his behavior and shows remorse. He should then allow Mr. Trump a few days to file a statement of what he requests the judge to consider. If nothing is filed, Donald Trump’s behavior, including 10 gag order violations, sets the tone for justifying a stern sentence, including incarceration. Same if a filing made lacks responsibility. But if he takes responsibility and expresses remorse, Judge Merchan could cite that as the basis for leniency. Todd Lowenstein San Jose GOP fears competitive women and minorities Republicans despise Diversity Equity and Inclusion policies. They claim that Democratic Vice President and presumptive nominee Kamala Harris is where she is in her career because of DEI. The advantage they had in business and government, based on their gender and race is now in contention, as women graduate from college in greater numbers than men. Positions once exclusively held by White men are now competitive for women and minorities because of education and experience, which is exactly what Kamala Harris embodies. Warren Seifert Gilroy","summary":"Mercury News Letters to the Editor for Aug. 2, 2024","url":"https://www.mercurynews.com/2024/08/01/letters-1817/","image":"https://www.mercurynews.com/wp-content/uploads/2018/01/sjm-l-desal-0130-1.jpg?w=1024","video":null,"publish_date":"2024-08-01 23:00:21","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.362},{"id":253187926,"title":"Trump lashes out at Biden over historic prisoner exchange that freed Paul Whelan, Evan Gershkovich","text":"Former President Donald Trump has been using the wrongful detention of Americans Evan Gershkovich and Paul Whelan in Russia to criticize President Joe Biden for failing to bring them home, especially during his reelection campaign. And following Thursday's historic prisoner swap that freed those men along with two other U.S. prisoners, the GOP presidential nominee continued to bash the administration with baseless speculation. White House officials said the deal involved no exchange of cash, but in a Truth Social post on Thursday, Trump questioned that denial without offering specifics. \"Are we also paying them cash? Are they giving us cash (Please withdraw that question, because I’m sure the answer is NO)?\" he said. Trump has repeatedly made false claims that the U.S. has given Iran billions of dollars in cash. \"Just curious because we never make good deals, at anything, but especially hostage swaps. Our 'negotiators' are always an embarrassment to us!\" he added in his social media post. The former president repeated the false allegations that cash was involved in the deal during an interview on the \"Clay Travis & Buck Sexton Show.\" When asked by a reporter about Trump's repeated claims he could've gotten the hostages out of Russia without concessions, Biden took a direct jab at his former political opponent. \"Why didn't he do it when he was president?\" Biden said. Trump's rhetoric over the detained Americans has been part of ongoing back and forth, dating back to his term in office, and at times sparked the ire of the hostages' family members. Even though members of Trump's administration, including Secretary of State Mike Pompeo, criticized the espionage charges against Whelan after he was arrested in 2018, Trump did not mention Whelan's name publicly while he was in office. David Whelan, Paul Whelan's brother, said in a statement Thursday that his family was \"discouraged from speaking out about Paul's case.\" \"Those first years were hard when the Trump Administration ignored Paul’s wrongful detention, and it was media attention that helped to finally create critical mass and awareness within the U.S. government,\" he said. During his trial, Paul Whelan, who had met with U.S. officials during his case, appealed directly to Trump for help. \"Mr. President, we cannot keep America great unless we aggressively protect and defend Americans wherever they are in the world,\" he said in prepared remarks in June 2019. Trump would only mention Whelan by name in a post on Truth Social condemning Biden for arranging a prisoner transfer that freed U.S. basketball player Brittney Griner from Russian custody in December 2022. \"Why wasn’t former Marine Paul Whelan included in this totally one-sided transaction? He would have been let out for the asking.\" Trump said in his post. The U.S. exchanged Russian arms dealer Viktor Bout for Griner as part of that swap. Following the swap, Trump claimed that he had been working on a deal for Whelan that involved Bout. \"I turned down a deal with Russia for a one-on-one swap of the so-called Merchant of Death for Paul Whelan. I wouldn’t have made the deal for a hundred people in exchange for someone that has killed untold numbers of people with his arms deals,\" he said. David Whelan slammed the former president over his social media statements, in a post on X. \"Former President Trump appears to have mentioned my brother #PaulWhelan's wrongful detention more in the last 24 hours than he did in the 2 years of his presidency in which Paul was held hostage by #Russia (zero). I don't suggest he cares now any more than he did then (zero),\" David Whelan said in the December 2022 post. Trump did not comment on Gershkovich's situation until an April 12, 2024 interview with Time Magazine, more than a year after his March 29, 2023 arrest. \"The reporter should be released and he will be released,” Trump said without referring to Gershkovich by name. “I don’t know if he’s going to be released under Biden.\" In a May Truth Social post, Trump claimed Gershkovich \"will be released almost immediately after the Election, but definitely before I assume Office.\" \"Vladimir Putin, President of Russia, will do that for me but not for anyone else,\" he said in his post. Trump’s attacks against Biden over the hostages came up again during the June presidential debate. He again claimed he would get Gershkovich out if elected, contending that \"Putin is laughing at [Biden], probably asking for billions of dollars for the reporter.\" \"He should have had him out a long time ago. But Putin is probably asking for billions and billions of dollars because this guy pays it every time,\" Trump said of Biden. Trump did not directly name Gershkovich during the debate. Trump lashes out at Biden over historic prisoner exchange that freed Paul Whelan, Evan Gershkovich originally appeared on abcnews.go.com","url":"https://www.yahoo.com/news/trump-lashes-biden-over-historic-230000829.html","image":"https://s.yimg.com/ny/api/res/1.2/RNE_HDQDV0VZf9S_tpuDhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/us.abcnews.go.com/951bfd8d5145be41b437313466532f95","video":"","publish_date":"2024-08-01 23:00:00","author":"Ivan Pereira","authors":["Ivan Pereira"],"language":"en","source_country":"us","sentiment":-0.435},{"id":253186224,"title":"Trump elevates false, fringe attacks on Harris","text":"When former President Donald Trump questioned Vice President Kamala Harris’ racial identity Wednesday, he lifted a long-standing and false line of attack from the fringes of political discourse to the very center of a presidential campaign. For years, rivals and critics have lodged accusations that Harris shifts her personal identity to her political advantage and that she is, in fact, not who she claims to be. Those attacks, based on falsehoods, misinformation and conspiratorial notions, have increased dramatically in the week and a half since she emerged as Democrats’ all-but-certain standard-bearer. Just hours after President Joe Biden announced that he would not seek a second term, right-wing agitator Laura Loomer posted on social media site X that Harris “pretends to be black” as part of what she called a “delusional, Democrat DEI quota.” The next day, Tucker Carlson, the former Fox News host who spoke at the Republican National Convention last month, said on his popular interview show that the vice president was “sort of Black, sort of Indian.” Rapper Lil Pump, a Trump supporter who has some 20 million followers across Instagram, TikTok and X, said Sunday that “Kamala Harris isn’t even black…she’s Indian.” Their comments, seemingly aimed at suggesting to Black voters that the Democratic candidate does not represent them and, more broadly, planting the idea that Harris is inauthentic, helped turn what had been a trickle of such content into a gusher. Overnight, conservative corners of the internet, long fixated on Biden’s age, swung to what looked to be their newest target. Years-old video clips of Harris acknowledging her South Asian heritage found fresh currency, along with memes mocking her speaking style and even a Billy Joel song modified to say that “she’s not Black or white, Indian, Jamaican.” In fact, the vice president is the daughter of a Black Jamaican father and an Indian mother, both of whom immigrated to the United States before Harris was born in Oakland, California. She has long identified as both Black and Indian. “This is something she’s dealt with her entire career,” said Neil Makhija, president of the advocacy group Indian American Impact. He pointed out that Harris attended Howard University, a historically Black university, and belongs to a prominent Black sorority, Alpha Kappa Alpha. “Trump questioning her identity and heritage is nothing new, and it’s part of a long-running strategy of employing racial division and animus.” On Wednesday, Trump embraced the discourse wholeheartedly while sitting for a Q&A session at the National Association of Black Journalists convention in Chicago. “I didn’t know she was Black,” Trump said, “until a number of years ago when she happened to turn Black.” He later followed that statement, which drew gasps from the room, with a post on his social network, Truth Social, that Harris was “stating she’s Indian, not Black” and that she was a “stone cold phony.” Defenders of Harris compared the remarks to birtherism — the debunked idea that Barack Obama should not have served as president because he was not a natural-born citizen. Trump is widely credited as an originator of the birther conspiracy. Sen. Mark Kelly, D-Ariz., who is on the short list to be Harris’ running mate, called the former president’s comments Wednesday “overtly racist.” The campaign against Harris similarly began with questions about whether she was legally able to serve. As far back as January 2019, Chris Cuomo, then a CNN anchor, responded to a claim by Jacob Wohl, a right-wing activist and Trump supporter, that she was “not eligible to be president” by suggesting that Harris, then a senator, could settle the matter by producing “proof.” Harris responded weeks later, saying, “This is the same thing they did to Barack” in an interview on “The Breakfast Club” podcast, which has three Black hosts. “This is not new to us. And so, I think we know what they are trying to do.” By August 2020, when she was selected to be Biden’s running mate, copies of Harris’ California birth certificate began circulating on social media, often amplified by conservative voices looking to discredit her. They wrongly pointed to a line on the document noting that her father’s “color or race” was “Jamaican” as evidence that she was not in fact Black. While more than 92% of Jamaicans have Black ancestry, some people have falsely asserted that because her father, Donald J. Harris, was descended from a man who had owned slaves in the early 19th century, he could not be Black. But it was quite common for slaveholders to father children with women held as slaves. Donald Harris is credited as the first Black scholar to receive tenure in Stanford University’s economics department. Lavern Spicer, a prominent Trump supporter who is running for Congress in Florida, referred to Kamala Harris as Black in late 2020 but soon began claiming that the opposite was true, stating on social media in January 2021 that Harris “can play the Black card because the media covers for her, but that girl is not Black.” Since then, Spicer has hammered on that point in scores of posts, including one last week asserting that Harris was not Black but an “Indian woman married to a Jewish man.” Other critics have also challenged her Indian identity, claiming that she hides it for political benefit. “Show me a picture of Kamala in a sari,” said Vish Burra, executive secretary of the New York Young Republican Club, while discussing Asian American identity on a panel hosted by Vice in late 2022. Burra, who is of South Asian descent, quipped, “I’ve seen Justin Trudeau wear Indian clothes before her.” (Trump, continuing his false line of attack on Harris on Thursday, posted a photo that has been widely circulated among right-wing influencers in recent weeks of Harris wearing a sari.) So far, Harris and her campaign have largely tried to avoid debates about her background, focusing instead on the divisive nature of such rhetoric. Speaking at an event for a Black sorority in Houston on Wednesday evening, Harris avoided any rebuttals to Trump’s statements, saying simply that “the American people deserve better.” But later in the evening, her campaign’s rapid response team took on the matter more directly, posting on X that “Kamala is both Black and Indian” and that “you can be two things at once.” Regardless, some of Trump’s most avid supporters have dug in. On Wednesday afternoon, Loomer resurfaced Harris’ birth certificate, writing on X that it “proves she is NOT BLACK.” This article originally appeared in The New York Times. © 2024 The New York Times Company","summary":"When former President Donald Trump questioned Vice President Kamala Harris&#8217; racial identity Wednesday, he lifted a long-standing and false line of attack from the fringes of political discourse to the very center of a presidential campaign.","url":"https://www.staradvertiser.com/2024/08/01/breaking-news/trump-elevates-false-fringe-attacks-on-harris/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/08/web1_20240801_brk_tru02.jpg","video":null,"publish_date":"2024-08-01 23:00:00","author":"New York Times","authors":["New York Times"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.04},{"id":253185944,"title":"Scrapped fundraisers and watching from the treadmill. How Harris’ VP contenders wait for her choice","text":"WASHINGTON (AP) — One is sparking speculation that he’ll be the choice by forgoing swanky fundraisers in the Hamptons. Another watched TV commentators speculate about his viability as the pick while getting in a workout. A third is sticking to praising the new presidential candidate who is closing in on a decision. As Vice President Kamala Harris prepares to decide on a running mate, three Democrats thought to be on her short list — Pennsylvania Gov. Josh Shapiro, Minnesota Gov. Tim Walz and Arizona Sen. Mark Kelly — did nothing Thursday to suggest they aren’t still in contention. Shapiro scrapped three weekend fundraisers in the seaside communities on the coast of Long Island, New York, and his press secretary, Manuel Bonder, offered little explanation as to why. “The governor’s trip was planned several weeks ago and included several fundraisers for his own campaign committee,” Bonder said in a statement. “His schedule has changed and he is no longer traveling to the Hamptons this weekend.” One Shapiro fundraiser was to be hosted by Michael Kempner, a member of President Joe Biden ‘s national finance committee. Kempner said in a note to invitees that the gathering had been postponed and openly advocated for Shapiro to be Harris’ No. 2, writing that “many are speculating that this is a sign he will be the vice president.” “While this has not been confirmed, I continue to believe he is the best person for the job. And hope the speculation is true,” Kempner wrote. “As I learn more and get a new date for an event, I will keep you updated. There will also be many other events coming up to support Kamala, I will be sending out that information soon. I hope you will participate.” Harris has intensified her travel and fundraising schedule since Biden announced that he was abandoning his reelection bid and endorsing her on July 21. It’s given new hope to some Democrats who worried about the 81-year-old Biden’s prospects against Republican former President Donald Trump in November. The vice president and her team were still poring through reams of vetting material submitted by her choices for possible running mate, and staff have interviewed a number of potential picks. Harris is expected to conduct final interviews herself before making a selection. The Democratic National Committee is using virtual voting among delegates to compete the process of formally nominating Harris — and her yet-to-be-named running mate — by Monday, two weeks before the party’s convention opens in Chicago. The vice president and her No. 2 then plan to head out on a seven-state swing of key battlegrounds, including Pennsylvania, Arizona and North Carolina. Harris aides were looking to make the public announcement of her choice in the hours between when she officially becomes the Democratic nominee on Monday evening and a Tuesday rally in Philadelphia, where she is set to introduce her running mate to the country. Walz said Thursday that he’d watched commentary on his chances while running on his treadmill. “I don’t know if every high school geography teacher expects to be in this position,” joked Walz, who taught and coached football. He also acknowledged that he’s still in contention to join the Democratic ticket at an event in Bloomington, Minnesota, highlighting a state law increasing criminal penalties for gun crimes. Asked what set him apart from the other vice presidential contenders, Walz said he was excited about all of Harris’ possible choices, but pointed to his work implementing federal policy as a governor. “I’m not interviewing for anything. I just am who I am and put it out there,” Walz said. “I’m just going to say this, Yes, I’m a bit biased. I’m the chair of the Democratic Governors Association and Democratic governors have implemented the Biden-Harris administration in a way that has improved lives.” Kelly, meanwhile, refused to discuss his upcoming schedule or say whether he’d been vetted by Harris’ team. “It’s so obvious, she’s the person to bring us into the future,” Kelly said of Harris. “Donald Trump is about divisiveness and about taking away rights from women. Now he’s talking about voting rights, he did this week. So I think people are getting it.” —- Associated Press writers Zeke Miller and Mary Clare Jalonick in Washington, Steve Peoples in New York and Michael Goldberg in Bloomington, Minnesota, contributed to this report. Marc Levy And Will Weissert, The Associated Press","summary":"WASHINGTON (AP) — One is sparking speculation that he&#8217;ll be the choice by forgoing swanky fundraisers in the Hamptons. Another watched TV commentators speculate about his viability as the pick while getting in a workout. A third is sticking to praising the new presidential candidate who is closing in on a decision. As Vice President [&#8230;]","url":"https://toronto.citynews.ca/2024/08/01/scrapped-fundraisers-and-watching-from-the-treadmill-how-harris-vp-contenders-wait-for-her-choice/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/9809b8b4e6d5e958861be12f3db4f153ce6188f603ea1a031bbe72ba3e0b3f4a.jpg","video":null,"publish_date":"2024-08-01 22:59:47","author":"Marc Levy And,News Staff","authors":["Marc Levy And","News Staff"],"language":"en","source_country":"ca","sentiment":0.011},{"id":253187216,"title":"Appeals court upholds Trump’s gag order","text":"NEW YORK — Two months after his felony conviction, Donald Trump still isn’t allowed to say everything he wants about his historic hush money criminal case. After a New York appeals court upheld his gag order on Thursday, he won’t be for a while. The state’s mid-level appellate court denied the Republican former president and current nominee’s latest bid to lift the restrictions, swatting away a last-minute argument that he’s being unfairly muzzled while Vice President Kamala Harris, his likely Democratic opponent, pits herself as an ex-prosecutor taking on a “convicted felon.” At the same time, Trump’s lawyers are again asking the trial judge, Juan M. Merchan, to step aside from the case, saying his daughter’s past work as a Democratic political consultant for Harris’ 2020 presidential campaign underscores questions about his ability to be impartial. Merchan rejected the defense’s two prior recusal requests, last year and at the start of the trial in April, saying its concerns were “hypothetical” and based on “innuendos” and “unsupported speculation.” In a letter Thursday to Merchan, Trump lawyer Todd Blanche said Harris’ entry into the presidential race makes those issues “even more concrete” and said the judge has failed to address them “at a level of detail sufficient to repair the lack of public confidence in the integrity of these proceedings.” In its gag order ruling Thursday, a five-judge panel found that Merchan was correct in keeping some restrictions in place until Trump is sentenced because the case is still pending and his conviction doesn’t constitute a change in circumstances that would warrant lifting it. “The fair administration of justice necessarily includes sentencing,” they wrote. The gag order bars Trump from speaking out about members of the prosecution team, court staffers or their families, including Merchan’s daughter, who has been the target of Trump’s wrath in the past. In June, Merchan lifted a ban on Trump publicly commenting about witnesses and jurors in the case, and he has always been free to speak directly about the judge and Manhattan District Attorney Alvin Bragg, an elected Democrat whose office prosecuted the case. Trump is scheduled to be sentenced on Sept. 18, but the case and the gag order could be terminated before that if Merchan grants a defense request to throw out his conviction in light of the Supreme Court’s presidential immunity ruling. He said he plans to rule on Sept. 6. Trump lawyer Todd Blanche and a spokesperson for the Manhattan district attorney’s office declined to comment on Thursday’s ruling. The ruling came a day after Blanche tried to file papers asking the appeals court to immediately lift the gag order. With its decision imminent, the court rejected the filing, which had called the restrictions an “unconstitutional, election-interfering” muzzle on Trump’s free speech while he seeks to return to the White House. In a copy of the prospective filing provided to The Associated Press, Blanche wrote that Harris’ recent entry into the presidential race had given the matter new urgency and that “it is unconscionable that Harris can speak freely about this case, but President Trump cannot.” The defense also revived complaints that Merchan has a “glaring conflict of interest” because of his daughter’s ties to Harris and that one of the prosecutors, Matthew Colangelo, was biased because he was a Justice Department official under President Biden, a Democrat. Trump is unable to air those grievances himself because of the gag order. Trump’s lawyers have made several efforts to have the gag order lifted. Their latest fight landed in the state’s intermediate appeals court – the Appellate Division, one rung up from Merchan’s trial court level – after they struck out with the state’s top court. The Court of Appeals last month declined to hear Donald Trump’s gag order challenge, finding it did not raise “substantial” constitutional issues that would warrant immediate intervention. Merchan imposed the gag order in March, restricting Trump from commenting about witnesses, jurors and others connected to the case, after prosecutors raised concerns about his habit of attacking people involved in his legal matters. The judge soon expanded it to prohibit comments about his own family after Trump lashed out on social media at the judge’s daughter and made false claims about her. During the trial, the judge held Trump in contempt of court and fined him $10,000 for violations, and he threatened to jail him if he did it again. Trump, who has denied any wrongdoing, was originally scheduled to be sentenced July 11. Merchan postponed it until September while he considered the impact of the Supreme Court’s ruling, which gave broad protections to presidents and insulated them from prosecution for official acts. The ruling also restricted prosecutors from citing any official acts as evidence in trying to prove a president’s unofficial actions violated the law. Trump’s lawyers argue his trial was “tainted” by evidence that shouldn’t have been allowed, pressing their case in a new court filing Thursday. Prosecutors contend the high court’s opinion “has no bearing” on the hush money case because it involves unofficial acts for which the former president is not immune. A Manhattan jury convicted Trump on May 30 of falsifying records to cover up a potential sex scandal, making him the first ex-president convicted of a crime. Trump’s conviction, on 34 felony counts, arose from what prosecutors said was an attempt to cover up a hush money payment to porn actor Stormy Daniels just before the 2016 presidential election. She claims she had a sexual encounter with Trump a decade earlier, which he denies. Trump’s former lawyer Michael Cohen paid Daniels and was later reimbursed by Trump. Prosecutors said Cohen disguised the reimbursements with Trump’s knowledge by submitting monthly invoices for retainer payments as his personal lawyer. Trump’s company logged the payments to Cohen as legal expenses. Prosecutors said the Daniels payment was part of a broader scheme to buy the silence of people who might have gone public during the 2016 campaign with embarrassing stories alleging Trump had extramarital sex. Trump has pledged to appeal his conviction, but he would not be able to do so until he is sentenced. « Previous","summary":"Trump's lawyers are again asking the trial judge, Juan M. Merchan, to step aside from the case.","url":"https://www.centralmaine.com/2024/08/01/appeals-court-upholds-trumps-gag-order/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/08/Election_2024_Trump_90338_15ecf8.jpg?w=1000","video":null,"publish_date":"2024-08-01 22:50:53","author":"Michael R. Sisak,MICHAEL R. SISAK - Associated Press","authors":["Michael R. Sisak","MICHAEL R. SISAK - Associated Press"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.336},{"id":253185042,"title":"US appeal court blocks Biden administration net neutrality rules","text":"A US appeal court on Thursday blocked the Federal Communications Commission’s reinstatement of landmark net neutrality rules, saying broadband providers are likely to succeed in a legal challenge. The FCC voted in April along party lines to reassume regulatory oversight of broadband internet and reinstate open internet rules adopted in 2015 that were rescinded under then-US president Donald Trump. The Sixth Circuit US Court of Appeals, which had temporarily delayed the rules, said on Thursday it would temporarily block net neutrality rules and scheduled oral arguments for late October or early November on the issue, dealing a serious blow to US President Joe Biden’s effort to reinstate the rules. “The final rule implicates a major question, and the commission has failed to satisfy the high bar for imposing such regulations,” the court wrote. “Net neutrality is likely a major question requiring clear congressional authorisation.” The court on July 12 had temporarily placed the net neutrality rules on hold until August 5 as it considered industry legal challenges. FCC chairwoman Jessica Rosenworcel said: “The American public wants an internet that is fast, open, and fair. Today’s decision by the Sixth Circuit is a setback but we will not give up the fight for net neutrality.” Net neutrality rules require internet service providers to treat internet data and users equally rather than restricting access, slowing speeds or blocking content for certain users. The rules also forbid special arrangements in which ISPs give improved network speeds or access to favoured users. The rules would bar internet service providers from blocking or slowing down traffic to certain websites, or engaging in paid prioritisation of lawful content, as well as give the FCC new tools to crack down on Chinese telecoms companies and the ability to monitor internet service outages. Reinstating net neutrality has been a priority for Biden, who signed a July 2021 executive order encouraging the FCC to reinstate the rules adopted in 2015 under former US president Barack Obama, a fellow Democrat. Under Trump, the FCC had argued that net neutrality rules were unnecessary, blocked innovation and resulted in a decline in network investment by internet service providers, a contention disputed by Democrats.","summary":"Rules would give FCC tools to crack down on Chinese telecoms firms; bar internet service providers from blocking traffic to some websites.","url":"https://www.scmp.com/news/world/united-states-canada/article/3272866/us-appeal-court-blocks-biden-administration-net-neutrality-rules","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/08/02/c72b73cb-ce9d-44c7-accb-fa5b25a1ca40_2be10d4d.jpg","video":null,"publish_date":"2024-08-01 22:45:12","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.467},{"id":253185062,"title":"Walz sidesteps questions about being a candidate for Kamala Harris’ running mate","text":"Minnesota Gov. Tim Walz is still playing coy about his prospects of joining the Democratic ticket as Kamala Harris’ vice presidential pick. In public remarks on Thursday, after an unrelated press conference in Bloomington, Walz didn’t acknowledge being in the final mix. But he said it’s been surreal being part of a shortlist of candidates considered. Walz avoided questions about whether Harris’ campaign is vetting him for the post or requesting an interview. “I don’t know if every high school geography teacher expects to be in this position at some point. But it is very strange to be running on my treadmill and have people talking about the things that are there and, and scream back, ‘This guy is too old,’ ” he said. “I’m running my butt off here on the treadmill.” Walz, a two-term governor and former six-term congressman, is said to be among a group of Democratic governors, including Pennsylvania Gov. Josh Shapiro and Kentucky Gov. Andy Beshear, in the running. Harris’ campaign is also considering U.S. Sen. Mark Kelly of Arizona days ahead of an expected announcement. Walz encouraged Harris to pick a Democratic governor. As chair of the Democratic Governors Association, he said a governor could be a strong running mate. He didn’t say whether he viewed himself as a strong candidate. “I’m not interviewing for anything, I just am who I am and put it out there,” Walz said, adding, “I think there’s just that’s a decision that needs to be made by the vice president, and she will make it on what she sees.” Harris, who could be declared the official Democratic nominee by Monday, is expected to announce her pick in the coming days. That person will make the rounds with her next week on a five-day tour through several swing states, including an event in neighboring Wisconsin on Wednesday. Walz made the rounds appearing on national television outlets for interviews this week and distinguished himself by branding former President Donald Trump’s policy platforms as “weird.” It’s a line that landed and that other Democrats have repeated, while Republicans have attempted to deflect the moniker.","summary":"Walz, a two-term governor and former six-term congressman, is said to be among a group of Democratic governors in the running.","url":"https://www.twincities.com/2024/08/01/walz-sidesteps-questions-about-being-a-candidate-for-kamala-harris-running-mate/","image":"https://www.twincities.com/wp-content/uploads/2024/02/AP24040636278458.jpg?w=1024","video":null,"publish_date":"2024-08-01 22:44:54","author":"Dana Ferguson","authors":["Dana Ferguson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.224},{"id":253184584,"title":"Whistleblower from Secret Service reveals shocking details about new director following Kimberly Cheatle, agents had been warning about issues for months before Trump’s assassination attempt","text":"A Republican senator has received ‘disturbing information’ on Donald Trump’s near assassination from a whistleblower alleging a major protocol was broken before the Butler, Pennsylvania, rally. The latest allegation, from an anonymous whistleblower, contends that the Secret Service’s Counter Surveillance Division (CSD) – the unit tasked with evaluating event sites in advance – was not present at the deadly rally and never performed a ‘typical evaluation’ before the event. The anonymous whistleblower’s complaint is one of several filed to Missouri Republican Sen. Josh Hawley in recent weeks. In addition, the source alleges that Secret Service Acting Director Ronald Rowe, the freshly minted agency chief after former boss Kimberly Cheatle resigned, is at fault for the huge oversight. Rowe ‘personally directed significant cuts to CSD,’ the whistleblower says. The new boss was also personally responsible for slashing the counter surveillance team manpower 20 percent, the whistleblower continues. All of the allegations outlined by the whistleblower were revealed in a letter Hawley sent to Rowe himself. ‘The whistleblower also alleges retaliation against those within the Secret Service who expressed concerns about the security at President Trump’s events,’ the Missouri senator informs the acting director. Rowe has only been in the job for a handful of days after Cheatle resigned last week following a bruising hearing before Congress. She repeatedly refused to provide new insight into the historic murder attempt yet she stonewalled both Republicans and Democrats, earning scorn and verbal beat downs from both sides of the aisle. ‘Further, Secret Service personnel expressed alarm that individuals were admitted to Trump events ‘without vetting’ and were later ‘retaliated against,’ the letter continues. Hawley demanded Rowe fork over information about the Secret Service’s Butler rally plan and some of his work communications by August 8. DailyMail.com reached out to the Secret Service for a response to the allegations. Similarly devastating is the discovery of a technical flaw that led to radio signals not properly transmitting between Secret Service agents at the rally, the New York Times reports. The bug helped Trump shooter Thomas Matthew Crooks sneak around the rally site freely as officers’ communications were inconsistent and ineffective. An agent was able to yell out ‘Long gun!’ over the local Pennsylvania law enforcement radio network. But a critical 30 seconds ticked by and the message was never heard. The report indicates that there were multiple instances of counter measure tool malfunction and improper deployment. The agency, for example, turned down offers to use drone technology at the rally location, whistleblowers previously disclosed to Hawley. He revealed that one whistleblower had told his office the night before the rally Secret Service ‘repeatedly denied offers from a local law enforcement partner to utilize drone technology to secure the rally.’ The whistleblower alleged that after the shooting Secret Service ‘changed course and asked the local partner to deploy the drone technology to surveil the site in the aftermath.’ The drones that were offered ‘had the ability not only to identify active shooters but to neutralize them,’ according to Hawley. From Homeland Security Sec. Alejandro Mayorkas Hawley demanded all records and communications related to the drone offer. The new claim adds another layer to the probe of the Secret Service’s biggest security failure since Ronald Reagan was shot in 1981.","summary":"Internewscast Journal\n\nInternewscast\n\n\nA Republican senator has received &#8216;disturbing information&#8217; on Donald Trump&#8217;s near assassination&#8230;\n\n\nThis Post: Whistleblower from Secret Service reveals shocking details about new director following Kimberly Cheatle, agents had been warning about issues for months before Trump&#8217;s assassination attempt first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/whistleblower-from-secret-service-reveals-shocking-details-about-new-director-following-kimberly-cheatle-agents-had-been-warning-about-issues-for-months-before-trumps-assassination-attempt/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Secret-Service-whistleblower-makes-stunning-claim-about.jpg","video":null,"publish_date":"2024-08-01 22:42:19","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.541},{"id":253186008,"title":"Who Will Be Kamala Harris’s Veep Pick? Here Are the Finalists","text":"In the days since President Joe Biden bowed out of the race and endorsed Harris in his stead, the political-pundit class and everyday Americans have been throwing out their guesses for who will join the presumptive Democratic nominee’s historic 2024 ticket. The Harris campaign is expected to announce its VP pick by Tuesday. The duo will make their first combined campaign stop in Philadelphia, before touring seven swing states in four days, according to Politico. “Harris is planning to interview potential vice presidential nominees in the upcoming days,” the outlet reported earlier this week; when asked if she’d made her pick yet, Harris responded, “not yet.” Before Biden had even dropped out of the race, people began questioning who Harris ought to pick as her running mate, with many positing, both jokingly and not, that she would pick a white man—an assumption that drew backlash from those questioning why another woman or person of color couldn’t join the team. By the middle of last week, Harris’s team had reportedly requested vetting materials from numerous top Democrats, including Transportation Secretary Pete Buttigieg, Illinois governor J.B. Pritzker, US senator Mark Kelly of Arizona, Pennsylvania governor Josh Shapiro, and Minnesota governor Tim Walz. Michigan governor Gretchen Whitmer and North Carolina governor Roy Cooper were previously under consideration, but both have since bowed out. While other Democrats beyond this list could theoretically get tapped, three potential candidates are reportedly the current front-runners: Kelly, Shapiro, and Walz. Senator Mark Kelly First elected to the Senate in a 2020 special election, Kelly is a Navy veteran and former astronaut from the Grand Canyon state. Choosing Kelly would mean a West Coast–heavy ticket. However, the senator has firsthand experience working on immigration policy from a border state. Plus, his past wins with Latino voters could help secure that bloc. Kelly has also been a vocal supporter of abortion access, and recently switched his stance and endorsed pro-union legislation. Long before running for office, Kelly stood beside his wife, former US representative Gabby Giffords, after she survived an assassination attempt in 2011 that left six dead and several injured. Kelly’s experience with supporting a powerful woman in office could benefit him as a running mate for Harris, who has already faced deeply misogynistic and racist attacks from the right. According to recent polling on the veepstakes, Kelly is the most well-known of the picks, and holds high favorability. Following Harris’s campaign announcement, Kelly shared on X that he believed she was the candidate to defeat former president Donald Trump, adding, “Gabby and I will do everything we can to elect her President of the United States.” When asked about his spot in the veepstakes, Kelly said that it “ain’t about me.” Governor Josh Shapiro As Pennsylvania attorney general during the 2020 election cycle, Shapiro repeatedly—and successfully—fought lawsuits filed by Trump and his legal team after he lost the state to Biden. “I went to court against Donald Trump 43 times and won every single time because I stayed focused on the law and I stayed focused on applying the law without fear or favor,” Shapiro told New York magazine earlier this year. Still, the 51-year-old has faced scrutiny for being pro-school-choice—and for his staunchly pro-Isreal views, which have already soured some progressive voters on his potential vice presidential candidacy. If elected, Shapiro would be the first Jewish vice president in American history. Additionally, the director of the National Women’s Defense League has urged Harris to consider Shapiro’s handling of a sexual harassment complaint against his aide when choosing a VP, saying that he “should have done a better job” in that situation. (A spokesperson told the Pennsylvania Capital-Star that the governor and his administration “take every allegation of discrimination and harassment extremely seriously and have robust procedures in place to thoroughly investigate all reports.”) As leader of one of Democrats most coveted states ahead of the election, Shapiro offers Harris an opportunity to secure Pennsylvania in 2024. While the choice to first visit Philadelphia with her new running mate may seem like a wink at a potential Shapiro win, a Harris campaign aide “cautioned against reading too much into the first city chosen for the tour,” per Politico. In 2022, Shapiro won by nearly 15 points against his opponent, Doug Mastriano, who was backed by Trump. According to polling from this year, 42% of Republicans and 39% of independent voters have positive opinions about Shapiro’s track record in his first term as governor. Governor Tim Walz Tim Walz has been in public office since 2007. He served as a US representative from Minnesota’s First Congressional District for 12 years before becoming governor of the midwestern state in 2019. Prior to running for office, Walz was a member of the Army National Guard and a longtime teacher and football coach. In the past few weeks, Walz has been active on TV news, sharing his family’s experience using IVF reproductive care, promoting his administration’s free school meals program, and pushing back against the Trump-Vance ticket as just plain “weird.” “I grew up in a small town. JD Vance is dead wrong about what makes small-town America tick,” Walz said. “Small towns don’t work because everyone is closed-minded and prejudiced. They work because people mind their own damn business.” Walz has signaled an openness to rethinking his past positions. At one point, he had an A rating from the National Rifle Association and received their endorsement. Later, he denounced the gun rights organization and proposed a ban on assault weapons. He also shifted his tone on how restrictive vetting should be on refugees. Walz has stood out in the veepstakes for his blunt, conversational speaking style as well as his focus on family and local issues. He’s reportedly in a group chat with dozens of current and former members of Congress dedicated to trash-talking one another’s favorite sports teams.","summary":"The presumptive Democratic nominee is expected to choose between US senator Mark Kelly of Arizona, Pennsylvania governor Josh Shapiro, and Minnesota governor Tim Walz.","url":"https://www.vanityfair.com/news/story/who-will-be-kamala-harriss-veep-pick-here-are-the-finalists","image":"https://media.vanityfair.com/photos/66ac0af4b8d2fffce004ae4d/16:9/w_6000,h_3375,c_limit/2162425804","video":null,"publish_date":"2024-08-01 22:35:17","author":"Katie Herchenroeder","authors":["Katie Herchenroeder"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.01},{"id":253184190,"title":"'Why are they coming home?' JD Vance gives bizarre response to US-Russia prisoner swap","text":"President Joe Biden on Thursday announced the finalization of a 24-prisoner exchange involving five different countries that resulted in the release of falsely imprisoned journalist Evan Gershkovich and other American captives. But the 2024 Republican presidential ticket's response to the news has prompted head-scratching. On Thursday afternoon, former President Donald Trump notably did not express any appreciation for the safe return of Gershkovich or former U.S. Marine Paul Whelan, who have been held prisoner in Russia since early 2023 and 2018, respectively. Instead, he lamented about the complexity of the deal and suggested without evidence that the Biden administration gave cash to Russian President Vladimir Putin in exchange for the American hostages. Sen. JD Vance (R-Ohio) — whom Trump selected as his running mate last month – had a puzzling response of his own when asked about the prisoner exchange. According to CNN, the Ohio Republican acknowledged that the U.S. citizens and residents released as part of the deal was \"great news, at least what little we know,\" and that it was \"ridiculous that they were in prison to begin with.\" However, he then pivoted to suggesting that Trump was more responsible for the safe return of the hostages than the Biden administration. READ MORE: 'We never make good deals': Trump complains about Biden bringing imprisoned Americans home \"But we have to ask ourselves, why are they coming home?” Vance told the network. “And I think it’s because bad guys all over the world recognize Donald Trump’s about to be back in office, so they’re cleaning house. That’s a good thing, and I think it’s a testament to Donald Trump’s strength.” Vance's statement drew mockery on social media. Matt Steinglass — a Europe correspondent for the Economist — posted sarcastically to the social media platform Bluesky: \"Why did the sun go down? I think it’s because it’s scared. Scared of Donald Trump. It’s a tribute to Donald Trump’s unimaginable majesty.\" Former New York Daily News journalist Helen Kennedy piled on, noting that \"even Trump didn't have the chutzpah to claim credit.\" Northwestern University law professor wrote that her \"mind goes immediately to this,\" and posted a screenshot of the 1962 film \"The Manchurian Candidate,\" in which Frank Sinatra's character (who has been brainwashed) repeats the mantra, \"Raymond Shaw is the kindest, bravest, warmest, most wonderful human being I’ve ever known in my life.\" Vance's argument that Trump's \"strength\" resulted in the release of the American captives makes even less sense when considering that Trump said in May that only he would be able to negotiate the release of the prisoners, and that he would do so during Biden's lame-duck period after the election. On his Truth Social platform, Trump promised that Putin would release Gershkovich \"for me, but not for anyone else.\" READ MORE: Biden's historic prisoner swap an indication Putin betting Trump will lose: pundits \"Evan Gershkovich, the Reporter from The Wall Street Journal, who is being held by Russia, will be released almost immediately after the Election, but definitely before I assume Office. He will be HOME, SAFE, AND WITH HIS FAMILY,\" Trump wrote. In addition to his comments about the prisoner swap, Vance was also asked about what he thought of Trump's comments during a live interview at a National Association of Black Journalists event on Wednesday. During that interview, Trump suggested that Vice President Kamala Harris only recently started to identify as Black (she attended Howard University, which is a historically Black college, and joined the historically Black sorority Alpha Kappa Alpha). Vance, who has three biracial children with his Indian American wife, Usha, said the former president's comments were \"totally reasonable\" and that they \"don’t give me pause at all.\" \"Look, all he said is that Kamala Harris is a chameleon,\" said Vance, who once referred to Trump as \"America's Hitler\" in a text message. \"She is everything to everybody, and she pretends to be somebody different depending on which audience she is in front of. I think it’s totally reasonable for the president to call that out, and that’s all he did.\" READ MORE: 'Trump-proof the alliance': NATO countries now 'bracing for the possibility of big change' Click here to read CNN's full report.","summary":"President Joe Biden on Thursday announced the finalization of a 24-prisoner exchange involving five different countries that resulted in the release of falsely imprisoned journalist Evan Gershkovich and other American captives. But the 2024 Republican presidential ticket's response to the news has prompted head-scratching.\n\nOn Thursday afternoon, former President Donald Trump notably did not express any appreciation for the safe return of Gershkovich or former U.S. Marine Paul Whelan, who have been held prisoner in Russia since early 2023 and 2018, respectively. Instead, he lamented about the complexity of the deal and suggested without evidence that the Biden administration gave cash to Russian President Vladimir Putin in exchange for the American hostages.\n\nSen. JD Vance (R-Ohio) — whom Trump selected as his running mate last month – had a puzzling response of his own when asked about the prisoner exchange. According to CNN, the Ohio Republican acknowledged that the U.S. citizens and residents released as p","url":"https://www.alternet.org/jd-vance-bizarre-response/","image":"https://www.alternet.org/media-library/image.png?id=53076638&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2024-08-01 22:30:02","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.515},{"id":253186534,"title":"Putin greets freed Russian prisoners after swap deal with West","text":"Vladimir Putin has personally greeted the Russian prisoners freed in a deal with the West as they arrived in Moscow. The Russian leader welcomed Vadim Krasikov, who was convicted over an assassination in Germany, Artem Dultsev and Anna Dultseva, whom he gave a bouquet of flowers. “I want to congratulate you on your return to the motherland,” Putin said as they disembarked at Moscow’s Vnukovo airport. Putin signed an order to secure the release of eight Russians held in prisons in the US, Norway, Poland and elsewhere. In return, Russia freed journalists Evan Gershkovich and Aslu Kurmasheva, ex-US Marine Paul Whelan and others. Joe Biden said the “brutal ordeal” for those being held by Russia was over and that Donald Trump failed to bring them home. Trump dismissed the deal as a bad one for the US and questioned the US’s role in it, claiming the US is useless at negotiations. “[We] never make good deals, at anything, but especially hostage swaps.”","summary":"<![CDATA[Vladimir Putin has personally greeted the Russian prisoners freed in a deal with the West as they arrived in Moscow.&nbsp;\n\n]]>","url":"https://www.telegraph.co.uk/world-news/2024/08/01/ukraine-russia-war-latest-news15/","image":"https://www.telegraph.co.uk/content/dam/world-news/2024/08/01/TELEMMGLPICT000388042550_17225512414600_trans_NvBQzQNjv4BqVeV8OoZxp1WMt6i1E9eewB1hYV1R6IP1odsGnfiFm3g.jpeg?impolicy=logo-overlay","video":null,"publish_date":"2024-08-01 22:29:31","author":"George Styllis,Iona Cleave,Verity Bowman","authors":["George Styllis","Iona Cleave","Verity Bowman"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.247},{"id":253184200,"title":"Jordan investigates daughter of judge in NY v. Trump case over her work for Kamala Harris, Democrats","text":"House Judiciary Committee Chairman Jim Jordan is investigating the daughter of the judge who presided over former President Trump’s criminal trial for her past work for Vice President Kamala Harris, Fox News Digital has learned. Fox News Digital has obtained a letter Jordan, R-Ohio, sent to Loren Merchan, the daughter of Judge Juan Merchan who presided over New York v. Trump. A jury found Trump guilty on all counts of falsifying business records in the first degree. Trump has requested Merchan overturn that verdict. TRUMP FILES MOTION REQUESTING JUDGE IN HUSH MONEY TRIAL BE RECUSED AMID DAUGHTER'S DEMOCRAT-AFFILIATED WORK Prior to the start of the trial, Trump’s legal team urged Judge Merchan to recuse himself from the case due to his daughter’s work for Democrat-affiliated political work for a firm called Authentic Campaigns, Inc. Trump lawyers said the company \"services exclusively Democrat clients\" and is \"the #21 ranked vendor in the country in connection with the 2024 election.\" Trump lawyers, at the time, said Loren Merchan \"has a direct financial interest in these proceedings by virtue of her ownership stake and leadership role at Authentic Campaigns, Inc.\" The company’s featured clients include top Democrats – such as President Biden and now-Democratic presidential nominee Vice President Kalama Harris. In a letter to Loren Merchan Thursday, obtained by Fox News Digital, Jordan highlighted her work related to Harris. \"During your time working on behalf of Vice President Harris, Authentic Campaigns received over $7 million in compensation for its services,\" he wrote. \"According to your now-deleted LinkedIn, after Vice President Harris dropped out of the Democrat primary, you were promoted to President of Authentic Campaigns.\" TRUMP'S APPEAL TO LIFT REMAINING PARTS OF NY GAG ORDER DENIED \"Authentic Campaigns then conducted work for the 2020 Biden-Harris campaign, which included \"digital paid media, design and development, social media, mobile messaging, [and] artificial intelligence,\" Jordan continued. Based on the funds collected by the firm through its work with top Democrats – also including Rep. Adam Schiff and the Senate Majority PAC – Jordan said \"at a minimum, there is a perception that you and Authentic Campaigns could profit considerably from President Trump’s prosecution in a forum overseen by your father.\" Jordan is now demanding Loren Merchan turn over \"all contracts and invoices referring or relating to work performed by Authentic Campaigns\" for work on behalf of the Biden campaign, the Harris campaign, or the Democratic National Committee from the period of Jan. 1, 2023 to the present. He is also demanding \"all documents and communications between or among Authentic Campaigns or any of its employees, agents, or representatives, the Biden for President campaign, or the Harris for President campaign referring or relating to the indictment, prosecution, or conviction of President Donald J. Trump for the period April 1, 2023, to the present.\" He is also asking for records related to any work the company performed related to Trump’s indictment, prosecution or commitment, and communications with her father, Judge Juan Merchan, related to the indictment, prosecution or conviction of Trump. CLICK HERE TO GET THE FOX NEWS APP Jordan gave her a deadline of August 8 to comply with his request. The request comes as part of the House Judiciary Committee’s investigation into \"politically motivated prosecutions by state and local officials.\"","summary":"House Judiciary Committee Chairman Jim Jordan is investigating the daughter of the judge who presided over former President Trump’s criminal trial for her past work for Vice President Kamala Harris, Fox News Digital has learned.","url":"https://www.foxnews.com/politics/jordan-investigates-daughter-judge-in-ny-v-trump-case-over-her-work-kamala-harris-democrats","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/09/931/523/jim-jordan-impeachment-inquiry.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-01 22:28:45","author":"Brooke Singman","authors":["Brooke Singman"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.073},{"id":253184822,"title":"Harris’s separation from Biden crucial among key voting bloc in Nevada","text":"Vice President Kamala Harris’s campaign is fighting to secure Nevada’s minority vote after President Joe Biden’s reelection bid leaked support among one of the battleground state’s critical Democratic voting blocs. As Biden fought to win a second term in the White House, enthusiasm for the 81-year-old among key components of the Democratic coalition tanked. In the wake of Biden’s historic campaign exit, Harris’s ascension to the top of the Democratic ticket appears to be gaining traction with black Nevada voters disillusioned with the incumbent president. Last weekend, the Harris campaign held a multitude of events in Nevada, garnering support that surpassed all of Biden’s previous efforts. Nevada is home to the third-highest-growing black population in the nation as of 2022. The vice president held more than 50 events, many aimed at attracting black and LGBT support, and reached nearly 50,000 voters, according to the Nevada Independent. Nationwide, Harris’s approval rating among black voters surpasses Biden’s by 7 points, according to a recent poll from the Data for Progress. Enthusiasm for a Harris presidency appears to be building in the battleground state as the vice president fights to make a comeback with voters who soured about Biden’s reelection bid. Some voters pointed to specific reasons they prefer Harris over her current boss. For Lesile Swest, an African American voter who showed up at a Nevada Harris campaign event this week, the vice president’s perceived progressiveness stance lured her back to the party. Swest told the Nevada Independent that the black community is “looking for progressiveness,” adding, “We weren’t getting progressiveness from Biden or Trump.” Seen by some as further to the left than Biden, Harris’s position on the Gaza conflict, if she were to push back against Israel more, could expand Democratic support, with Muslim Americans and many young voters disillusioned with Biden’s stance on the war. Still, Harris faces challenges to prove that she is different than her boss and more inclined to follow through on her campaign promises. Stephone Revels Sr., an African American Nevadan, told the New York Times, “I’m looking for some direct, tangible assistance. You’ve got to stop talking and start acting.” The battle in Nevada is far from over. Former President Donald Trump holds a narrow lead over Harris in the state and continues to make the pitch to majority-minority communities across the country that Democrats have failed them.","summary":"Vice President Kamala Harris’s campaign is fighting to secure Nevada’s minority vote after President Joe Biden’s reelection bid leaked support among one of the battleground state’s critical Democratic voting blocs. As Biden fought to win a second term in the White House, enthusiasm for the 81-year-old among key components of the Democratic coalition tanked. In [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3108237/harris-separation-biden-crucial-key-voting-bloc-nevada/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Kamala-Harris-Nevada.webp","video":null,"publish_date":"2024-08-01 22:20:05","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.069},{"id":253184198,"title":"Trump replies to DA Bragg in case to get conviction tossed in light of Supreme Court immunity decision","text":"Former President Donald Trump has filed a reply brief in his case to have his conviction in N.Y. v Trump overturned after the Supreme Court ruled presidents have some immunity for official acts in office. Trump was found guilty in an unprecedented criminal trial last month on all counts of falsifying business records in the first degree, following a six-week trial stemming from Bragg's investigation. Trump has already requested Judge Juan Merchan overturn the verdict. TRUMP'S APPEAL TO LIFT REMAINING PARTS OF NY GAG ORDER DENIED In the filing Thursday, lawyers for Trump argued that \"The Supreme Court of the United States ruled conclusively and unequivocally that President Trump is protected by immunity for his official acts.\" \"In this case, a politically motivated district attorney violated that immunity by using official-acts evidence in grand jury proceedings and at trial. Therefore, the case must be dismissed, and the jury’s verdicts must be vacated.\" The Supreme Court ruled in Trump v. United States that a former president has substantial immunity from prosecution for official acts in office but not for unofficial acts. The high court said Trump is immune from criminal prosecution for \"official acts\" but left it to the lower court to determine exactly where the line between official and unofficial is. \"The President therefore may not be prosecuted for exercising his core constitutional powers, and he is entitled, at a minimum, to a presumptive immunity from prosecution for all his official acts,\" the majority opinion written by Chief Justice John Roberts states. \"That immunity applies equally to all occupants of the Oval Office, regardless of politics, policy, or party.\" TRUMP TOUTS SUPREME COURT'S PRESIDENTIAL IMMUNITY RULING AS 'BIG WIN FOR OUR CONSTITUTION AND FOR DEMOCRACY' The question of presidential immunity stemmed from special counsel Jack Smith’s Jan. 6 case against Trump. Trump pleaded not guilty to those charges. That trial was put on hold in a lower court pending the Supreme Court’s ruling, which wiped out any charges related to official presidential acts. Trump attorney Todd Blanche, in the filing Thursday, argued that Bragg offered official acts evidence during the six-week-long unprecedented criminal trial. Blanche said that included official White House communications with staffers like Hope Hicks, Madeleine Westerhout, and more. Blanche also said Trump's official public statements made via Twitter were used as evidence; his official acts in response to inquiries by the Federal Election Commission; official acts relating to inquiries by Congress and prosecutors; and more. CLICK HERE TO GET THE FOX NEWS APP \"President Trump was subjected to fundamentally unfair proceedings that invited jurors to examine official-acts evidence based on ‘their views of the President’s policies and performance while in office,’\" Blanche wrote. \"This fundamental unfairness also harms the public because of the adverse impact of these violations on the work of future Presidents to serve the American people.\" He added: \"For the reasons set forth in the Defense Motion and herein, the Court should dismiss the Indictment and vacate the jury’s verdicts based on violations of the Presidential immunity doctrine and the Supremacy Clause.\" Judge Juan Merchan, last month, agreed to Trump's request to delay his original sentencing date, July 11, and said that a hearing on Trump’s potential sentencing would take place Sept. 18.","summary":"Former President Donald Trump has filed a reply brief in his case to have his conviction in N.Y. v Trump overturned after the Supreme Court&apos;s immunity decision.","url":"https://www.foxnews.com/politics/trump-replies-da-bragg-case-get-conviction-tossed-light-supreme-court-immunity-decision","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/05/931/523/Donald-Trump-Guilty_07.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-01 22:19:00","author":"Brianna Herlihy,Brooke Singman","authors":["Brianna Herlihy","Brooke Singman"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.104},{"id":253186022,"title":"Panel recommends Trump ally Jeffrey Clark’s law license be suspended over his role in efforts to overturn 2020 election","text":"(CNN) — Jeffrey Clark, the Trump-era Justice Department official who advocated for the department to contact Georgia and cast doubt on Donald Trump’s 2020 election loss, should face a two-year suspension from practicing law, a disciplinary committee in Washington, DC, said Thursday. As an environmental lawyer at the Justice Department, Clark tried to push through an official letter to officials in Georgia after the 2020 election, urging the state to interfere with the election results. His superiors at the Justice Department told him no. The disciplinary committee found Clark included false and misleading information in the letter. “What Mr. Clark did was objectively reckless, but subjectively, the evidence indicated that he thought he had been chosen for a historic cause, to which he applied all of his energies,” the three-person hearing committee wrote in its findings. Clark maintained he believed he could send the letter to Georgia, and even took the stand in his own defense at the disciplinary trial. Then-acting Attorney General Jeffrey Rosen and Deputy Attorney General Richard Donohue also testified in Clark’s proceeding, saying the Justice Department didn’t find significant fraud in the elections even while Clark insisted it might. “His sincerity of belief does not make him less reckless,” the committee wrote in its findings. “To the contrary, we conclude that his personal beliefs blinded him from objectively assessing the facts and the reality of his proposed course of action, and caused him to rationalize a broader role for the Department of Justice, failing to distinguish President Trump from candidate Trump.” The disciplinary counsel that brought the case against Clark sought for him to face a severe sanction like disbarment, while Clark’s team wanted him to avoid being disciplined. The recommendation — laid out in a 213-page report after a quasi-trial proceeding — is an early step in the process of attorney discipline. If the recommendation is adopted, Clark would face less fallout than two other attorneys who may be disbarred for their work for Trump: John Eastman and Rudy Giuliani. The hearing committee wrote in its report that it doesn’t believe there was “clear and convincing evidence that Mr. Clark was as culpable” as those two, who worked privately for Trump after the election. “We cannot recommend sanctioning Mr. Clark from what might be true or what evidence was presented in other cases. We can only recommend sanctioning him for what has been proven in this case by clear and convincing evidence,” the report said. (Copyright (c) 2024 CNN. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"(CNN) —&#160;Jeffrey Clark, the Trump-era Justice Department official who advocated for the department to contact Georgia and cast doubt on Donald Trump’s 2020 election loss,...","url":"https://whdh.com/news/panel-recommends-trump-ally-jeffrey-clarks-law-license-be-suspended-over-his-role-in-efforts-to-overturn-2020-election/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/08/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbHpic3Qycm8wMDA0M2I2a3p2eDFlejh6-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NsemFkcWY0dTAwMWo0NXFjaDJlb2Q4ZXI.jpg?quality=60&strip=color","video":null,"publish_date":"2024-08-01 22:18:55","author":"Bailey Allen","authors":["Bailey Allen"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.557}]}