{"offset":0,"number":50,"available":14542,"news":[{"id":302825442,"title":"Dawn Robinson de En Vogue vive la vida de un auto, una modelo blanca tiñe su piel de negro, el atuendo de Malia Obama al estilo Matrix, internet responde a la amenaza de un pastor negro y otras noticias culturales de la semana.","text":"La cantante de En Vogue, Dawn Robinson, no es la única mujer negra que elige vivir en su coche. Bienvenidos a “Car Life Culture”.\n\nComo miembro fundador de EnVogue La confesión de Dawn Robinson Que ha estado viviendo en su auto se extiende por internet, las reacciones han variado desde la conmoción hasta la lástima por lo que algunos creen que es una terrible caída en desgracia para una persona que una vez fue parte de un grupo musical exitoso.- Angela Johnson Leer más\n\nEsta modelo blanca literalmente se volvió negra y hay mucho más\n\nUn blanco modelo Quien en realidad cree ser negra se prepara para mudarse a África, donde dice ser más apreciada. Pero incluso después de someterse a varios procedimientos para verse como tal, el resto del mundo le dice que no tan rápido. - Angela Johnson Leer más\n\nEl atuendo estilo Matrix de Malia Obama hizo que todos hablaran, pero hay algo más en su look que hizo que todos gritaran.\n\nCon toda la locura que rodea a los actuales ocupantes de la Casa Blanca, no es sorprendente que la gente sienta todo tipo de nostalgia por nuestra Primera Familia por Siempre. Los Obama. Desde que dejaron 1600 Pennsylvania Avenue, han hecho un gran trabajo manteniéndose fuera del foco de atención (aunque lo hacemos casi imposible para ellos). Pero es por esa misma razón que somos tan rápidos en aprovechar cualquier pequeño vistazo a sus vidas que nos brindan. - Angela Johnson Leer más\n\nEl amor que este bebé mostró por su padre en un video viral te hará llorar\n\nYa sea que estén haciendo el tonto en el centro comercial o haciendo el tonto a la hora del baño, Vincent Pierre Spencer y su hijo de cinco años, Micah Zane, tienen muchas Divertirnos juntos. Spencer ha comenzado a compartir sus aventuras. en TikTok como @micahzanesworld. Pero probablemente no tenía idea de que un momento tierno entre los dos se volvería increíblemente viral y tocaría los corazones de millones de personas en línea. - Angela Johnson Leer más\n\nInternet responde a un pastor negro que amenaza desde el púlpito a jóvenes con pasamontañas\n\nUn pastor negro no se anduvo con rodeos al pronunciar un discurso. Anuncio de servicio público a los autodenominados «YN» que llevan pasamontañas e incluso piensa sobre haberlo alcanzado. Por supuesto, internet tiene mucho que decir al respecto. - Angela Wilson Leer más\n\nMomentos racialmente insensibles en 2025... hasta ahora\n\nLlevamos solo tres meses del año y el país ya se ha visto destrozado por lo que parece un aumento en ataques racistas flagrantes contra los estadounidenses negros. La violencia verbal, física y política hacia nuestra gente ha generado temor en muchos sobre lo que traerá el futuro de Estados Unidos, especialmente en medio del segundo mandato del presidente Donald J. Trump. -Phenix S. Halley Leer más\n\n13 cosas que debes saber sobre Nicole Lynn, la agente deportiva de Jalen Hurt\n\nConocer Nicole Lynn. \n\nPionero. Rompedor. Jefe.\n\nLynn se convirtió en la primera agente femenina en representar a una agencia importante de la NFL en PlayersRep. Sin embargo, la mayoría la conoce como la agente que negoció el contrato más lucrativo en la historia de la NFL, cuando el mariscal de campo de los Philadelphia Eagles, Jalen Hurts, firmó nuevamente con los campeones del Super Bowl LIX por una extensión de contrato de cinco años y $255 millones. - Angela Wilson Leer más\n\nVea cómo una mujer de Georgia aprovecha al máximo el alto costo de los óvulos\n\nHace cinco años, tú saber Habrías mirado de reojo a Naeema Finley si hubieras descubierto que criaba gallinas en su patio trasero de Georgia. Pero hoy en día, como precio de los huevos Sigue siendo uno de los temas más candentes en el país. Cada vez más personas creen que Finley está en lo cierto y que ha encontrado la manera de convertir su gallinero casero en un exitoso negocio secundario. - Angela Johnson Leer más","summary":"Como miembro fundador de EnVogue La confesión de Dawn Robinson Que ha estado viviendo en su auto se extiende por internet, las reacciones han variado desde la conmoción hasta la lástima por lo que algunos creen que es una terrible caída en desgracia para una persona que una vez fue parte de un grupo musical exitoso.-…\n\nRead more...","url":"https://es.theroot.com/dawn-robinson-de-en-vogue-vive-la-vida-de-un-auto-una-1851771743","image":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/4940c8eed59de2f8bfed29c098105150.jpg","video":null,"publish_date":"2025-03-22 01:00:00","author":"The Root Bot","authors":["The Root Bot"],"language":"en","source_country":"us","sentiment":1},{"id":302825180,"title":"Tulsi Gabbard's India visit highlights strong U.S.-India relationship: DNI","text":"U.S. Director of National Intelligence (DNI) Tulsi Gabbard's visit to India highlights the decades-strong U.S.-India relationship, which is bolstered by the friendship between Prime Minister Narendra Modi and President Donald Trump, a statement said.\n\nMs. Gabbard was on her first multi-nation trip as the DNI, visiting Hawaii, Japan, Thailand, India, and France.\n\n\"Having been born and raised in the Indo-Pacific region, DNI Gabbard brought a nuanced understanding of the area’s crucial partnerships and complex challenges as she explored opportunities to advance President Trump’s America First policies across the Indo-Pacific,\" a DNI statement said on Thursday (March 20, 2025).\n\nMS. Gabbard in India held several bilateral engagements, including with Prime Minister Modi.\n\n\"This visit highlights the decades-strong U.S.-India relationship that is bolstered by the leadership of and friendship between Prime Minister Modi and President Donald Trump,\" the statement said.\n\n\"Ms. Gabbard’s meetings in India focused on intelligence-sharing, defence, counterterrorism, and transnational threats,\" it said.\n\nMs. Gabbard also joined the Raisina Dialogue where she delivered keynote remarks on the collective effort to drive toward Mr. Trump's goals of a peaceful, free, secure, and prosperous society, the statement said.\n\n“Securing peace through strength requires strong leadership with a clear-eyed and realistic understanding of global challenges and opportunities, a commitment to fostering cultural and economic ties that reduce the likelihood of an escalation to conflict, and a dedication to reinforcing mutual interests,” the statement quoted Ms. Gabbard as saying.","summary":"Ms. Gabbard also joined the Raisina Dialogue where she delivered keynote remarks on the collective effort to drive toward Mr. Trump's goals of a peaceful, free, secure, and prosperous society","url":"https://www.thehindu.com/news/national/tulsi-gabbards-india-visit-highlights-strong-us-india-relationship-dni/article69357491.ece","image":"https://th-i.thgim.com/public/incoming/dy51e/article69357551.ece/alternates/LANDSCAPE_1200/2025-03-18T084752Z_933596197_RC2GFDA5J3DW_RTRMADP_3_INDIA-USA-GABBARD.JPG","video":null,"publish_date":"2025-03-22 00:59:24","author":null,"language":"en","source_country":"in","sentiment":0.364},{"id":302824532,"title":"Russian tanks roll across the border, a barrage of missiles are fired on Britain - then nuclear hell breaks out: GENERAL SIR RICHARD SHIRREFF reveals how he believes WW3 will begin... and we have just two years to prepare","text":"Ceasefire: even the word is ominous. The deal being brokered by America to bring a halt to the battlefield slaughter in Ukraine is not a peace treaty.\n\nIt is exactly what it implies – a temporary cessation in the fighting. \n\nWhatever emerges from the negotiations, there can be no lasting peace, not as long as Russia is intent on expansion.\n\nThe concessions being forced on Ukraine amount to little more than appeasement. \n\nAs Adolf Hitler took advantage of Allied naivety in 1938 at Munich, using the paper-thin treaty negotiated by British PM Neville Chamberlain to buy more time for his war preparations, so Russian dictator Vladimir Putin will use this ceasefire to rebuild his forces and get ready for all-out war with the West.\n\nWe don't yet know all the details of the deal with Russia. But one thing is certain: when the Kremlin is ready, Russia will renege in the most bloodthirsty fashion.\n\nI predict there will be war in two years at the outside, unless we do what is needed to deter Russia.\n\nWhat dictates whether the West can survive is how well prepared we are.\n\nEurope's 'coalition of the willing', urged on by the UK, has pledged to put peacekeeping troops into Ukraine to enforce the ceasefire. \n\nPresident Donald Trump and his vice-president JD Vance have made it clear the US will do no such thing – there will be no military guarantees from Washington, merely hundreds of American miners overseeing the extraction of up to half a trillion dollars-worth of rare minerals from Ukraine soil. \n\nAs well as the possibility of the US taking ownership of Ukraine's nuclear power plants to provide 'the best protection' for the country's energy infrastructure.\n\nThis civilian contingent, Trump claims, is the only US presence required because Russia would never dare attack if it meant putting American lives at risk. He is living in cloud cuckoo land.\n\n Putin proved he cares nothing for the lives of Westerners when he ordered the assassination of defector Sergei Skripal in Salisbury seven years ago, using a weapons-grade nerve agent.\n\nSkripal and his daughter Yulia survived but an innocent Briton was killed and a policeman suffered life-changing harm. The death toll could easily have been in the tens of thousands in the quiet cathedral city of Salisbury.\n\nWestern politicians have to work on the basis that, intentionally or not, Trump is effectively a Russian asset. \n\nThere's plenty of solid evidence to show that he was close to the Soviet regime in the 1980s and, when his business empire faltered in the 1990s, he was bankrolled by Russians.\n\nWhether he is actively colluding with the Kremlin has not been established, but without doubt he is a sympathetic agent of influence for Putin's regime.\n\n I would also nominate him as Putin's most useful idiot, aided and abetted by his blundering diplomats, Marco Rubio and his real estate sidekick Steve Witkoff.\n\nSome sort of European peace enforcement presence will need to be in Ukraine, without active US involvement, but Russia will strongly resist any front line presence. Wherever the border is drawn between free Ukraine and the annexed territories, Putin will never agree to having Nato troops on his doorstep.\n\nThe worst-case scenario would be an under-powered, nominal force in the centre and west of Ukraine, around Kyiv and Lviv, too far away for a rapid reaction to any Russian incursion, and lacking the firepower to defend themselves against a full-throttle attack.\n\nIt's very unlikely that Putin will launch a surprise assault on the peacekeepers. His instinct is to proceed by a steady stream of provocations, testing what he can get away with.\n\nTo Putin, his war on the West has already begun, with a constant barrage of lies and conspiracy theories polluting social media. \n\nHis aim for the past decade has been to destabilise our democracies, stirring up division and polarising debate, with considerable success.\n\n Only this week it was revealed that Russian agents researched fire protocols at a factory owned by a German arms firm shortly before it burst into flames last summer. Putin's saboteurs were seemingly trying to disrupt arms deliveries to Ukraine.\n\nThe fire which brought Heathrow to a standstill yesterday may be an accident. But if it is sabotage, it is straight out of the Kremlin playbook.\n\nThough he regards Britain as a particular enemy, all Nato countries are his targets. Russia already has allies within the hard-right governments of Slovakia and Hungary, and Romania is next. \n\nPutin's ultimate goal is to reunite the Eastern Bloc, from Bulgaria to Poland, under a new Russian empire. The more this can be done by subverting democracy instead of military means, the easier it will be.\n\nThe far-Right Romanian populist rabble-rouser Calin Georgescu lost his appeal this month against a ruling that bars him from standing in May's presidential elections.\n\nGeorgescu won the first round of voting last year but was disqualified when Romanian intelligence discovered that hundreds of TikTok accounts backing his candidacy were set up by Russian agents.\n\nBut the damage is done. Thousands of Georgescu supporters have staged angry protests, no doubt stirred up by Russia's military intelligence service, the GRU. They are proclaiming his victory and denouncing the judges who barred him as traitors.\n\nEvery Nato country which shows support for Russia will weaken the Western alliance that has kept the peace for nearly 80 years. But a far greater loss to our unity than Hungary or Romania is the effective withdrawal by the US.\n\nTrump has made it plain that Article 5, the common pledge between Nato members that we protect each other, no longer applies in all circumstances, even issuing threats against a Nato country, Denmark, over its refusal to cede Greenland to the US.\n\nWe cannot rely on American troops and munitions in a conflict with Russia. More shocking still, as Ukraine discovered earlier this month, we cannot rely on the US to share its intelligence. \n\nPerhaps we cannot even be fully sure, in the event of war, whose side Trump would be on.\n\nEurope has perhaps two years to prepare for a head-on confrontation with Russia and we must be ready now for the unconventional war of sabotage, arson, cyber attacks, propaganda and assassination which will set the conditions for full-scale war. \n\nIt is no exaggeration to say that tens of millions of lives and the national survival of Britain, France, Germany and all our true allies are at stake.\n\nEarlier this month, the European Commission's president Ursula Von der Leyen announced up to 800billion euros will be spent on rearming the continent and delivering aid to Ukraine. \n\nWelcome though that decision is, we might have left it too late.\n\nWhen war comes, as it will come, events will unfold at devastating speed. \n\nThis is how the timeline could look:\n\nMonday March 1, 2027: A Russian unit patrolling occupied Donetsk is attacked and, after a brief firefight, surrenders. The soldiers are executed in cold blood. Russia blames Ukrainian special forces.\n\nKyiv immediately denies it. Bodycam footage from one of the dead soldiers shows the ambush was carried out by men in Ukraine uniforms.\n\nTuesday March 2: The Kremlin announces that, for the safety of its citizens and soldiers, and the protection of American mining installations along the border, it will be establishing a 100-mile 'buffer zone'.\n\nHeavily equipped Russian forces immediately roll into Ukraine. \n\nPresident Vitali Klitschko, who succeeded Volodymyr Zelensky after the 2025 elections, denies again the involvement of Ukrainian troops and accuses Russia of a 'false flag' operation.\n\n 'Putin is a psychopath,' he says, 'who murders his own soldiers to create a lie.' Klitschko demands Nato support Ukraine in driving back the Russian advance.\n\nMore than 500 miles away, the peacekeeping force prepares to mobilise, but Trump steps in. The White House welcomes the creation of a buffer zone, he says, to keep American mining operations safe from Ukraine rebels.\n\nThursday March 4: At a UN Security Council emergency meeting, the US votes with Russia to redraw the map. Poland's prime minister Donald Tusk warns that Putin is testing Europe's resolve. \n\nUnless we have the determination to force a Russian retreat, without US involvement and in open battle if necessary, he will interpret our weakness as an invitation to go further. Russia offers to negotiate a withdrawal.\n\nKlitschko rejects the ploy, dismissing it as a cynical trick: the longer the West delays, the more time Putin has to reinforce his positions. But Nato chiefs agree to talks.\n\nSunday March 7: Tusk is proven right. Putin has decided we are toothless. At 4.30am, a full Russian armoured division begins to roll across the border into Estonia and Latvia. Within four hours they are approaching the Estonian capital of Tallinn.\n\nThe British-led Enhanced Forward Battle Group in Estonia puts up brief resistance but takes heavy losses before being overwhelmed and forced to withdraw. \n\nThis is a tripwire force, numbering just over a thousand, of which around 90 per cent are British with the rest from other nations. More than 50 UK soldiers are among those killed and seriously wounded in the ferocious first action.\n\nAt 11am, Sir Keir Starmer announces Britain is formally at war with Russia. \n\nTelevised statements are made by the German chancellor, the French president and the Italian prime minister.\n\nBut not all Nato countries are united in the reaction. As well as Romania, Hungary and Slovakia, the US refuses to offer support.\n\nOn his Truth Social service, Donald Trump posts: 'This is Europe's mess. I gave them peace. They screwed it up. America is staying out of this fight, as long as our great Engineers in Ukraine are safe under Russian protection. Vitali, this warning is for you.'\n\nMonday March 8: The blitzkrieg continues, with forces surging into Latvia over the Russian border and driving towards the Baltic sea. \n\nBut the Estonians, combined with the remains of the Nato battle group and reinforcements hastily flown in from UK and other Nato nations, are putting up fierce resistance. \n\nThe RAF, German Luftwaffe, Finnish and Swedish airforces, with support from the French, rapidly establish dominance in the air.\n\nPutin unleashes a missile attack on RAF bases in east England, but Britain's air defences prove solid. Patrolling in the North Sea, a pair of newly commissioned Type 45 destroyers pick off the Geran-2 rocket drones, fired in clusters from Kaliningrad.\n\nSome missiles hit targets in Western Europe, but the hundreds of billions of euros poured into strengthening our armed forces in the past two years means we can defend ourselves – and hit back hard.\n\nRetaliatory strikes deep inside Russia take out oil refineries and missile silos. But the European war plan is not to win by sheer firepower. Instead, we turn the tables on the Kremlin's cyber-warfare tactics, with a devastating barrage of electronic tricks.\n\nAs night falls, Russia's computer networks are crippled, taking down their fuel supplies, electricity grid and financial systems. It's -6C in Moscow and millions are without heating.\n\nTuesday March 9: Fighting intensifies in the Baltic states. The advance has slowed but defenders are hugely outnumbered. They will face a bitter struggle to fend off the invaders until reinforcements can arrive by sea – and even then Russia could still have the upper hand.\n\nTheir forces are battle-hardened after three years of trench warfare and house-to-house fighting in Ukraine, and they can absorb horrendous losses.\n\nBut if Putin is close to winning on the battlefield, he is close to losing control in his cities. European missiles continue to pick off vital targets in Russia. \n\nTransport is grinding to a halt. Food is scarce. The internet is not functioning, and the security forces are stretched, trying to contain anti-war protests.\n\nRussia, consumed by the demands of an insane warmongering dictator for so many years, is on the brink of total collapse.\n\nWednesday March 10: In a desperate last attempt to blackmail the world, Putin announces he will use nuclear weapons before allowing the West to defeat Russia. Satellite intelligence suggests this is no bluff, and that Kyiv is a likely first target.\n\nThat is all the provocation Ukraine needs. During two years of ceasefire, its own nuclear scientists have not been idle. \n\nThey have the Bomb and a burning hatred of everything Russian. In an act of stupendous revenge, Ukraine launches a nuclear strike against the industrial Volgograd. The city is instantly obliterated.\n\nWithin the hour, Trump declares Ukraine a terrorist state. But he also warns Russia – and others – against retaliation with nuclear weapons. China orders the Kremlin to sue for peace immediately.\n\nThere is no need. By nightfall, ultra-nationalists enraged at the destruction of their country have staged a palace coup and overthrown Putin. \n\nThe madman of Moscow has finally gone. Russia's vassal republics in the far east and Caucasus begin to declare their independence from Putin's rapidly disintegrating empire.\n\nFiction this might be, but if we duck the opportunity to become masters of our fate, it will be Putin, not us, who is in control.\n\nAgain, whether the West can survive depends on how well prepared we are. Tens of millions of lives and the very existence of Britain, France, Germany and the democracies of Europe are at stake.\n\nDefence must be our only priority, taking precedence over everything. Because without it we will cease to exist.\n\nSir Richard Shirreff is former Deputy Supreme Allied Commander Europe for Nato.","summary":"Ceasefire: even the word is ominous. The deal being brokered by America to bring a halt to the battlefield slaughter in Ukraine is not a peace treaty.","url":"https://www.dailymail.co.uk/news/article-14525377/Russian-tanks-missiles-fired-nuclear-hell-general-reveals-WW3-begin.html","image":"https://i.dailymail.co.uk/1s/2025/03/22/00/96455771-0-image-m-22_1742604921229.jpg","video":null,"publish_date":"2025-03-22 00:58:30","author":"Editor,General Sir Richard Shirreff","authors":["Editor","General Sir Richard Shirreff"],"language":"en","category":"politics","source_country":"gb","sentiment":0.104},{"id":302824524,"title":"Is Keir Starmer's Ukraine  plan dead in water? He pledged 30,000 peacekeepers after truce... now figure is slashed to 10,000","text":"Is Keir Starmer's Ukraine plan dead in water? He pledged 30,000 peacekeepers after truce... now figure is slashed to 10,000\n\nLISTEN: Trump, Zelensky, the rise of Europe’s Far Right and what’s next for NATO – listen to Alas Vine & Hitchens wherever you get your podcasts..\n\nBy MARK NICOL DEFENCE EDITOR\n\nPublished: 00:58 GMT, 22 March 2025 | Updated: 00:58 GMT, 22 March 2025\n\nFears were growing last night that plans for a peacekeeping force in Ukraine led by British troops could be watered down.\n\nKeir Starmer has pledged to protect the air, sea and land in the war-ravaged country after any truce with Russia.\n\nBut while the UK still hopes to send soldiers to Ukraine's major cities, the force is expected to be smaller than expected. Previously, officials boasted the multinational force could be up to 30,000.\n\nBut estimates of 10,000 are now being offered as more realistic, and troops will deploy to more benign areas than initially anticipated.\n\nLast night, Downing Street insisted it was too soon to 'rule anything out'. But the prospect of thousands of British and French troops facing off against the Russians appears to be fading.\n\nIt comes against the backdrop of Russia's objections to the plan, UK manpower issues as well as the US's apparent refusal to provide a 'backstop'. \n\nChanges to the make-up of the peacekeeping force were discussed in the UK on Thursday.\n\nThe Prime Minister has won praise for assembling the coalition, but is struggling to meet his 'boots on the ground' pledge. \n\nSources expect Ukrainian troops to provide the ground force, with the UK and allies protecting the skies and Black Sea.\n\nKeir Starmer has pledged to protect the air, sea and land in the war-ravaged country after any truce with Russia\n\nUS President Donald Trump yesterday said a full ceasefire is close. But asked if he would punish Russia with more sanctions for recent attacks on Ukraine, he refused to criticise the Kremlin\n\nRussia has rejected Ukraine's offer of a 30-day ceasefire – only air strikes on energy infrastructure have been ruled out. Pictured: Vladimir Putin\n\nStarmer willing to keep UK peacekeeping troops in Ukraine 'for years' amid Trump concession fears\n\nUS President Donald Trump yesterday said a full ceasefire is close.\n\nBut asked if he would punish Russia with more sanctions for recent attacks on Ukraine, he refused to criticise the Kremlin. \n\nRussia has rejected Ukraine's offer of a 30-day ceasefire – only air strikes on energy infrastructure have been ruled out.\n\nMr Trump said: 'Pretty soon we're going to have a full ceasefire. The contract is being negotiated, in terms of dividing up the land.'\n\nMeanwhile, the UK and its European allies are planning for an overhaul of Nato over the next five years, with the US giving up its leadership and taking a back seat.\n\nThe US general acting as Supreme Allied Commander Europe, a post dating back to World War Two, is expected to be the last from across the Atlantic. \n\nIt could see the head of the UK's armed forces, Admiral Sir Tony Radakin, enter the running to become chief.\n\nBut officials are optimistic the US will stay in Nato, due to increases in defence spending. European countries, Britain included, have also set a target of being ready to repel any Russian threat by 2030.\n\nOn Ukraine, the PM's spokesman said: 'Nothing is off the table on any front. There's a spectrum of support and obviously a spectrum of capability, and the whole premise of the coalition of the willing is a joint effort to support Ukraine to secure a lasting peace, and that's what we're intent on doing.'\n\nSpeaking to the presidents of the European Council and European Commission last night, as well as the leaders of Turkey, Norway and Iceland, Sir Keir told them Europe was 'facing a different chapter of history and had to step up to meet that challenge'.\n\nHe said it was clear Vladimir Putin was 'trying to delay and add conditions to any meaningful ceasefire'.\n\nUkraineRussiaKeir Starmer\n\nShare or comment on this article:\nIs Keir Starmer's Ukraine plan dead in water? He pledged 30,000 peacekeepers after truce... now figure is slashed to 10,000\n\nAdd comment","summary":"Keir Starmer has pledged to protect the air, sea and land in the war-ravaged country after any truce with Russia.","url":"https://www.dailymail.co.uk/news/article-14525405/Keir-Starmers-Ukraine-plan-pledged-peacekeepers-truce-figure-slashed.html","image":"https://i.dailymail.co.uk/1s/2025/03/22/00/96455775-0-image-a-36_1742604956703.jpg","video":null,"publish_date":"2025-03-22 00:58:09","author":"Editor,Mark Nicol","authors":["Editor","Mark Nicol"],"language":"en","source_country":"gb","sentiment":0.108},{"id":302825186,"title":"Morning Digest: Supreme Court says Delhi HC judge’s transfer is not related to ‘rumours’; ahead of PM’s Nagpur visit, police focus on restoring normalcy, and more","text":"As PM Modi’s Nagpur visit draws near, police focus on restoring normalcy in RSS hub\n\nThe Nagpur Police have arrested 99 people, registered 13 first information reports (FIRs), and started an investigation into the communal clashes that wracked the city centre on March 17, Police Commissioner Ravinder Singal told The Hindu on Friday. Normalcy is gradually returning to the city just days ahead of Prime Minister Narendra Modi’s scheduled visit at the end of the month.\n\nIPL 2025 | Indian cricket’s reactionary child turns 18... how fast the night changes!\n\nWhen the Indian Premier League baby was born in 2008, it had a burden to carry. Birthed by Lalit Modi and blessed by the ruling BCCI, the IPL came into existence to mainly thwart the rebel Indian Cricket League and maintain the governing body’s monopoly over the sport in the country. And come Saturday at the Eden Gardens in Kolkata, when the clock strikes half past seven in the evening, the IPL will turn a major, fully ready to march ahead with even more clarity, strength and confidence.\n\nParbhani violence: Probe holds police accountable for law student’s death, Congress demands action\n\nAfter the magisterial inquiry concluded that law student Somnath Suryawanshi died due to police torture, Maharashtra Congress president Harshwardhan Vasantrao Sapkal on Friday (March 21, 2025) accused CM Devendra Fadnavis of protecting the police allegedly responsible for Somnath Suryawanshi’s custodial death, seeking action against the police.\n\nA riot in Nagpur over a long-dead emperor’s tomb\n\nOn the evening of March 17, Mohammed Aslam, a 61-year-old realtor, was sitting in his office with his son, 31-year-old Sohil Shaikh, in the Motha Taj Bagh area of Nagpur in Maharashtra, when he got a call from his wife, Shakeela Banu. Banu sounded really scared, recalls Aslam. “She said riots were taking place near our house and asked us to come home immediately. But minutes later, she urged us to stay put saying the situation had worsened,” he says.\n\nThere is progress on GM food crops, says official\n\nAhead of a fresh series of hearings in the Supreme Court next month over genetically modified (GM) food crops, the Department of Biotechnology (DBT) said there was “progress” on this front. “The matter is sub judice but GM mustard stories are being taken up again,” DBT Secretary Rajesh Gokhale said at a biotechnology event on Friday. The DBT, which has for years funded research and development into transgenic and GM food crops, comes under the Ministry of Science and Technology.\n\nIt is important for Indian students in U.S. to comply with local laws: MEA\n\nRanjani Srinivasan, the U.S.-based Indian scholar who took refuge in Canada after Columbia University cancelled her enrollment in a PhD programme, has not yet approached Indian missions in the U.S., the Ministry of External Affairs (MEA) said on Friday. Official Spokesperson Randhir Jaiswal stated at a media briefing that neither Ms. Srinivasan nor Badar Khan Suri, a student at Georgetown University, had contacted Indian authorities.\n\nSupreme Court says Delhi High Court judge’s transfer is not related to ‘rumours’\n\nThe Supreme Court issued a statement on Friday that “misinformation and rumours” are being spread with regard to an “incident” at the residence of Delhi High Court judge, Justice Yashwant Varma, compelling the apex court Collegium to transfer him out. The statement from the Supreme Court came after a report by The Times of India, followed by source-based online media reports, that a “huge pile of cash” was recovered when a fire broke out in the residential bungalow of the judge.\n\nTrump awards next-generation F-47 fighter jet contract to Boeing\n\nU.S. President Donald Trump announced on Friday that Boeing has been awarded the contract for the Air Force’s next-generation stealth fighter plane, which the 47th US president said would be named the F-47. “Nothing in the world comes even close to it, and it’ll be known as the F-47. The generals picked a title, and it’s a beautiful number, F-47,” said Mr. Trump at the White House. The contract aims to develop the replacement for the F-22 jet — which has been in operation for some two decades — with a new, more advanced aircraft able to operate alongside uncrewed drones.\n\nUnder threat from Trump, Columbia University agrees to policy changes\n\nUnder threat from the Trump administration, Columbia University has agreed to implement a suite of policy changes, including overhauling its rules for protests and conducting an immediate review of its Middle Eastern studies department. The changes, detailed in a letter sent by interim president, Katrina Armstrong, came one week after the Trump administration ordered the Ivy League school to implement those and other changes in order to continue receiving federal funding, an ultimatum widely criticised in academia as an attack on academic freedom.\n\nU.S. senators push for more funding for California fire recovery\n\nTwo Democratic U.S. senators on Friday visited the charred ruins of Altadena nearly three months after a devastating fire and made a case for more funding to rebuild the California community. With burned residences and businesses in the background, senators Alex Padilla of California and Cory Booker of New Jersey said there were bright spots in the recovery. This included faster removal of toxic debris, initially expected to take 18 months and now projected to finish in less than a year.","summary":"Here is a select list of stories to start your day","url":"https://www.thehindu.com/news/the-hindu-morning-digest-march-22-2025/article69359768.ece","image":"https://th-i.thgim.com/public/incoming/91vlaj/article69360578.ece/alternates/LANDSCAPE_1200/20250321357L.jpg","video":null,"publish_date":"2025-03-22 00:58:09","author":"The Times","authors":["The Times"],"language":"en","category":"politics","source_country":"in","sentiment":-0.076},{"id":302823050,"title":"Columbia University yields to pressure from Trump and agrees to make policy modifications","text":"NEW YORK (AP) — Columbia University agreed Friday to put its Middle East studies department under new supervision and overhaul its rules for protests and student discipline, acquiescing to an extraordinary ultimatum by the Trump administration to implement those and other changes or risk losing billions of dollars in federal funding.\n\nAs part of the sweeping reforms, the university will also adopt a new definition of antisemitism and expand “intellectual diversity” by staffing up its Institute for Israel and Jewish Studies, according to a letter published Friday by the interim president, Katrina Armstrong.\n\nThe announcement drew immediate condemnation from some faculty and free speech groups, who accused the university of caving to President Donald Trump’s largely unprecedented intrusion upon the school’s academic freedom.\n\n“Columbia’s capitulation endangers academic freedom and campus expression nationwide,” Donna Lieberman, the executive director of the New York Civil Liberties Union, said in a statement.\n\nEarlier this month, the Trump administration pulled $400 million in research grants and other funding over the university’s handling of protests against Israel’s military campaign in Gaza. As a precondition to restoring those funds — along with billions more in future grants — federal officials last week demanded the university immediately enact nine separate reforms to its academic and security policies.\n\nIn her response Friday, Armstrong indicated Columbia would implement nearly all of them. As ordered, it will hire new public safety personnel and empower them to make arrests on campus, bar students from protesting in academic buildings and revamp its long-standing process for student discipline.\n\nStudents will no longer be permitted to wear face masks on campus “for the purposes of concealing one’s identity.” An exception would be made for people wearing them for health or religious reasons.\n\nThe university will also appoint a new senior provost to review the leadership and curriculum of several international studies departments to “ensure the educational offerings are comprehensive and balanced.”\n\nThe appointment appeared to be a concession to the Trump administration’s most contentious demand: that the university place its Middle Eastern, South Asian and African Studies Department under “academic receivership for a minimum of five years.”\n\nThe Trump administration has repeatedly accused Columbia University of letting antisemitism go unchecked at protests against Israel that began at the university last spring and quickly spread to other campuses — a characterization disputed by those involved in the demonstrations.\n\nIn her letter, Armstrong said the university had worked hard to “address the legitimate concerns raised both from within and without our Columbia community, including by our regulators, with respect to the discrimination, harassment, and antisemitic acts our Jewish community has faced.”\n\n“The way Columbia and Columbians have been portrayed is hard to reckon with,” she added. “We have challenges, yes, but they do not define us.”\n\nThe Trump administration has ratcheted up its attacks on Columbia in recent weeks, thrusting the campus into crisis and sparking fears of additional reprisals at colleges across the country.\n\nOn March 8, federal immigration officials arrested Mahmoud Khalil, a prominent Palestinian activist and legal permanent resident in his university-owned apartment building -– the “first of many” attempted deportations, according to Trump.\n\nJustice Department leaders say they are also investigating whether Columbia hid students sought by the U.S. over their roles in the demonstrations.\n\nWhile Trump has made Columbia the most visible target of his crackdown on higher education, he has put other universities on notice that they will face cuts if they do not embrace his agenda.\n\nHis administration has announced investigations into 52 universities for their diversity, equity and inclusion programs. And it has suspended approximately $175 million in federal funding for the University of Pennsylvania over a transgender swimmer who last competed for the school in 2022.\n\nOn Friday, free speech groups warned Columbia’s response to Trump’s threat would reverberate far beyond the Manhattan campus.\n\n“Shaking under government pressure, Columbia crumbled,” said Tyler Coward, the lead counsel for government affairs at the Foundation for Individual Rights and Expression. “If Columbia — with its immense resources and influence — can’t stand up to government demands that threaten free speech, what are other colleges to do?”","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK (AP) — Columbia University agreed Friday to put its Middle&#8230;\n\n\nThis Post: Columbia University yields to pressure from Trump and agrees to make policy modifications first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/columbia-university-yields-to-pressure-from-trump-and-agrees-to-make-policy-modifications/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Under-threat-from-Trump-Columbia-University-agrees.jpeg","video":null,"publish_date":"2025-03-22 00:47:55","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.195},{"id":302824286,"title":"Trump’s back-door attempt to break his Social Security promise","text":"In 2016, one of the keys to Donald Trump’s popularity didn’t get the attention it deserved: his declaration that “I’m not going to cut Social Security like every other Republican,” rejecting GOP orthodoxy.\n\nThe argument that controlling the program’s cost is an urgent priority has math behind it in an aging nation saddled with trillions of dollars in debt. As the ratio between workers paying Social Security taxes and program beneficiaries steadily shrinks, it makes sense to consider increasing the retirement age and the limit on how much of earnings are subject to Social Security taxes, as well as means testing to reduce payments to affluent retirees.\n\nBut with about 40 percent of retired Americans likely to have only Social Security to rely on for income, Trump recognized such rhetoric only hurt Republicans.\n\nFlash-forward nine years later, however, and the Trump administration’s need to find $1.7 trillion in reduced spending over the next 10 years to allow for the extension of tax cuts that expire this year — the president’s top priority — has put Social Security on the chopping block. But instead of already-discussed reforms, the White House is pursuing a cruel back-door strategy of cutting costs by making it more difficult for beneficiaries to get paid. An internal agency memo from March 13 detailed plans to eliminate programs in which millions of elderly Americans who are not computer savvy can get direct help in phone calls with agency representatives.\n\nThis is being justified with completely unsubstantiated claims that Social Security is riddled with fraud. On Friday, Commerce Secretary Howard Lutnick, a billionaire investment banker, even made the blanket assertion that any American who complained about not getting a Social Security check in coming months was likely a “fraudster.”\n\nTo be clear, there is no doubt that federal waste is a huge problem. The Government Accountability Office estimated last year that $233 billion was at the low end of the scale in likely fraudulent annual spending. But instead of doing the hard work to actually ferret out waste, the White House has instead chosen to make things up. This is a reckless threat to the well-being of 73 million Social Security recipients — many of whom, as AARP points out, backed Trump for the second time in November.\n\nThis view is unlike to carry much weight with younger MAGA fans. But it will with millions of bullied senior Americans. And after they vote in the 2026 congressional elections, many House and Senate Republicans can expect to lose their jobs as a result.","summary":"In 2016, one of the keys to Donald Trump&#8217;s popularity didn&#8217;t get the attention it deserved: his declaration that “I’m not going to cut Social Security like every other Republican,&#8221; rejecting GOP orthodoxy. The argument that controlling the program&#8217;s cost is an urgent priority has math behind it in an aging nation saddled with trillions of dollars in debt. As the ratio between workers paying Social Security taxes and program beneficiaries steadily shrinks, it makes sense to consider increasing the retirement age and the limit on how much of earnings are subject to Social Security taxes, as well as means [&#8230;]","url":"https://www.sandiegouniontribune.com/2025/03/21/trumps-back-door-attempt-to-break-his-social-security-promise/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/06/OCR-Z-SS-BENEFITS.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-22 00:45:53","author":"U T Editorial Board","authors":["U T Editorial Board"],"language":"en","source_country":"us","sentiment":-0.397},{"id":302825970,"title":"Trump Expresses Support for Reported Proposal for US to Be ‘Associate Member’ of British Commonwealth","text":"President Donald Trump appears interested in King Charles III’s reported “secret offer” to make the United States an “associate member” of the British Commonwealth.\n\nIt is unclear what associate membership in the Commonwealth would entail. The White House did not provide further details when reached by The Epoch Times for comment. The publication has also contacted the British Embassy in the United States for more information.\n\nThe Commonwealth has 56 members, including Canada, New Zealand, Australia, India, and Mozambique.\n\nNotably, Trump has locked horns with Canada, repeatedly saying it should join the United States as a state. Canada has said it has no interest in being part of the United States, which declared independence from Great Britain in 1776.\n\n“It’s a great honor because it’s never happened before,” the president said on Feb. 27 in an Oval Office meeting with UK Prime Minister Keir Starmer, referring to the possibility of being the first sitting U.S. president to make two state visits to the UK.\n\nA White House official previously told The Epoch Times that it has not been decided when Trump will visit the UK and what issues will be discussed.\n\nTrump last visited the UK as president in 2019, during Queen Elizabeth II’s reign, when Charles was the Prince of Wales.\n\n“Visits by American Presidents always remind us of the close and longstanding friendship between the United Kingdom and the United States, and I am so glad that we have another opportunity to demonstrate the immense importance that both our countries attach to our relationship,” the queen said during Trump’s visit.\n\nStarmer, during the Oval Office meeting, said the royal family is pulling out all the stops for Trump’s visit.\n\n“I think the last state visit was a tremendous success,” the prime minister said. “The king wants to make this even better than that.”","summary":"President Donald Trump appears interested in King Charles III&#8217;s reported &#8220;secret offer&#8221; to make the United States an &#8220;associate member&#8221; of the British Commonwealth. &#8220;I love King Charles. Sounds good to me!&#8221; Trump said in a March 21 post on Truth Social that included a link to an article by the U.S. edition of the UK tabloid The [&#8230;]","url":"https://www.theepochtimes.com/us/trump-expresses-support-for-reported-proposal-for-us-to-be-associate-member-of-british-commonwealth-5829323","image":"https://img.theepochtimes.com/assets/uploads/2025/02/27/id5817650-Trump-King-Charles-letter-GettyImages-2201637797-300x180.jpg","video":null,"publish_date":"2025-03-22 00:44:38","author":"Jackson Richman","authors":["Jackson Richman"],"language":"en","category":"politics","source_country":"us","sentiment":0.222},{"id":302823058,"title":"Migrant returns to US from Honduras to face charges in Sarah Root’s death in 2016","text":"An illegal immigrant accused of killing a promising young woman in a devastating DUI crash has been hauled back to American after nearly a decade on the run.\n\nThe life of Sarah Root life was abruptly cut short in Omaha, Nebraska one night in January 2016. She had been out celebrating with friends just a day after receiving her degree from Bellevue University.\n\nThe recent college graduate was stopped at a red light when her vehicle was struck by a drunk driver – an undocumented Honduran national named Eswin Mejia who was street racing in his truck.\n\nRoot’s family kept her on life support for three days, but her injuries were too severe. \n\nThe tragedy sparked a national outrage and igniting debates about immigration enforcement failures.\n\nRoot’s tragic story was even used by Donald Trump in his acceptance speech at the Republican convention in 2016.\n\nIn a statement released after the speech, Root’s parents said: ‘We are very appreciative that Mr. Trump is speaking of our daughter. He & his staff have been very compassionate about what we have been going through & have tried to help however they can.’ \n\nHe highlighted it as one of many examples of foreigners crossing America’s borders illegally and committing a horrific crime.\n\nMejia had entered the US illegally as an unaccompanied minor years earlier in 2013, was arrested and charged with motor vehicle homicide. He was three times over the legal limit.\n\nDespite the seriousness of the charge, he was released on a $50,000 bond after a relative posted the cash fee – $5,000.\n\nMejia took advantage of the judge’s decision and instead of showing up for court, he vanished and fled back to Honduras where he was able to hide in the shadows of Central America. His family insisted that he no longer lived at home.\n\nMejia essentially became a ghost but Sarah’s family waited while officials placed his his name on ICE’s ‘Most Wanted’ list.\n\nOn Thursday, Mejia was finally captured, cuffed, and immediately extradited back to America on Friday. \n\nMejia was pictured shackled in handcuffs, aboard a the US-bound private jet. \n\nSecretary of State Marco Rubio confirmed the extradition on social media.\n\n‘Nine years ago, Sarah was tragically killed by an illegal immigrant who later fled our country. Today, the Trump Administration is announcing the extradition of Sarah’s killer from Honduras to the United States to face justice once and for all,’ Rubio tweeted. \n\nSenator Joni Ernst of Iowa also issued a statement praising the return.\n\n‘The Trump administration never forgot Sarah Root’s story. Together, we fought for justice to hold the illegal immigrant who took her life accountable. Iowans and every American know that this administration will always put our citizens first.’ \n\nMejia first entered the US illegally in 2013 at the Nogales, Arizona border, where he was classified as an unaccompanied minor. \n\nAs required by law, he was transferred to the Office of Refugee Resettlement and was sent to live with his brother in Omaha in 2014.\n\nBut less than two years later, he was behind the wheel of a vehicle that killed Sarah Root. \n\nEven after his arrest, federal immigration officials failed to place a detainer on him, allowing him to walk free on bond.\n\nICE admitted it encountered Mejia only once following his arrest, and at that time, deemed him to be ‘not an enforcement priority.’\n\nThe missed opportunities and countless red flags led to the creation of ‘Sarah’s Law,’ aimed at keeping suspected undocumented immigrants charged with serious crimes in custody.\n\nThe aim would also enforce stricter detention on illegal immigrants.\n\nThe case became a flashpoint in the broader immigration debate, serving as a grim example for those calling for stricter enforcement policies. \n\nSarah’s parents became outspoken advocates for reform, meeting with national leaders and appearing before Congress to ensure no other family would have to endure such an agonizing injustice.\n\nMejia’s extradition comes shortly after a renewed agreement between Honduras and the United States to enforce a century-old treaty. \n\nThe cooperation had been uncertain amid recent political tensions – especially following a controversial meeting between Honduran leaders and Venezuela’s Defense Minister, a figure wanted on drug trafficking charges in the US.\n\nBut Eswin Mejia finally back on American soil to face justice, it appears the tide has finally turned.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAn illegal immigrant accused of killing a promising young woman in a&#8230;\n\n\nThis Post: Migrant returns to US from Honduras to face charges in Sarah Root&#8217;s death in 2016 first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/migrant-returns-to-us-from-honduras-to-face-charges-in-sarah-roots-death-in-2016/","image":"https://i.dailymail.co.uk/1s/2025/03/22/00/96454249-14525143-The_life_of_Sarah_Root_life_was_abruptly_cut_short_in_Omaha_Nebr-a-40_1742602955217.jpg","video":null,"publish_date":"2025-03-22 00:42:50","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.305},{"id":302823862,"title":"Trump rubbishes claim Russia rejected Ukraine ceasefire","text":"US President Donald Trump has denied claims that Russia rejected his proposal for a Ukraine ceasefire. He reiterated that he remained optimistic about ending the conflict. \n\nTrump briefly spoke to reporters outside the White House on Friday. He said that he “had a couple of good conversations today” about Ukraine, without elaborating.\n\nA journalist asked Trump whether he had presented a deadline for a ceasefire to Russian President Vladimir Putin. “Not a deadline, but I think we’ll have [a ceasefire]... I think we’ll have it done fairly soon,” Trump said.\n\nAnother reporter asked, “Why won’t you impose sanctions on Russia after Putin rejected your ceasefire offer?”\n\nTrump replied, “He didn’t reject anything, and they do have sanctions. They have a lot of sanctions.” \n\nAfter his phone call with Trump on Tuesday, Putin ordered the Russian troops to pause strikes on Ukrainian energy infrastructure for 30 days. Although Ukrainian leader Vladimir Zelensky later claimed that Kiev was also respecting the ‘energy truce,’ Moscow accused Ukraine of violating the arrangement.\n\n“We believe that the truce proposed by the United States has already been violated by Kiev,” Foreign Ministry spokeswoman Maria Zakharova said on Thursday. \n\nKremlin spokesman Dmitry Peskov told journalists on Friday that Putin’s order to halt attacks on energy sites remained active. \n\nPutin has said that he agreed to Trump’s proposal for a 30-day comprehensive ceasefire in principle but stressed that a potential agreement must address “a number of significant points,” including control over implementation. He further said that Ukraine must stop mobilization, and that Kiev’s Western backers must stop the weapons deliveries.","summary":"US President Donald Trump has denied that Russia rebuffed his ceasefire proposal \nRead Full Article at RT.com","url":"https://www.rt.com/news/614611-trump-rejects-russia-ceasefire-rejection/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67de066285f54055b42da850.jpg","video":null,"publish_date":"2025-03-22 00:40:36","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.737},{"id":302825972,"title":"DOJ Wants Judge Removed From Case Challenging Trump’s Executive Order","text":"The Department of Justice filed a motion on March 21 requesting District of Columbia District Judge Beryl Howell disqualify herself from Perkins Coie LLP’s case challenging President Donald Trump’s executive order against it due to her publicly declared disdain for the president and her connection with essential aspects of the case.\n\nMizelle also said Howell directly rejected Trump’s stance that the indictments against individuals for conduct at or near the Capitol on Jan. 6, 2021, was a “national injustice” and called his supporters “sore losers.”\n\nHe also referred to when she held Twitter in contempt of court in 2023 for not complying with Smith’s demands for Trump’s direct messages. She asked if tech billionaire Elon Musk, who had bought the platform a year prior, wanted “to cozy up with the former president.”\n\nOutside of the courtroom, Mizelle cited comments Howell made in November 2023 to the Women’s White Collar Defense Association, during which she “lamented that America is at a ‘crossroads,’” apparently insinuating that the path of Trump would lead to authoritarianism. Those comments sparked a judicial misconduct complaint by Rep. Elise Stefanik (R-N.Y.).\n\nTrump’s executive order called “Addressing Risks from Perkins Coie LLP,” sought to identify and terminate the firm’s security clearances, contracts, and resources and also to ensure larger industry-leading law firms have ceased their Diversity Equity and Inclusion-based hiring practices. He signed it on March 6.\n\nPerkins Coie filed suit on March 11, alleging violations of the firm’s rights to free speech and free association, as well as due process under the Constitution.\n\nHowell said she would grant a temporary restraining order on March 12, blocking the executive order from going into effect.\n\nPerkins Coie was hired by Hillary Clinton’s presidential campaign and the Democratic National Committee in 2016.\n\nThat firm hired opposition research company Fusion GPS, which then hired Christopher Steele, the retired British counterintelligence specialist who compiled the now-discredited Steele dossier accusing the Trump 2016 presidential campaign of conspiring with Russia.\n\nThat dossier sparked an investigation by special counsel Robert Mueller, which, Mizelle said, involved Howell. Mueller’s report was followed by an investigation by special counsel John Durham, which Mizelle also said involved a member of Perkins Coie in an essential role.","summary":"District of Columbia District Judge Beryl Howell already granted a temporary restraining order stopping the executive order on March 12.","url":"https://www.theepochtimes.com/us/doj-wants-judge-removed-from-case-challenging-trumps-executive-order-5829482","image":"https://img.theepochtimes.com/assets/uploads/2025/03/07/id5821776-beryl-howell-LSedit-300x180.jpg","video":null,"publish_date":"2025-03-22 00:40:00","author":"T.j. Muscaro","authors":["T.j. Muscaro"],"language":"en","category":"politics","source_country":"us","sentiment":-0.086},{"id":302826048,"title":"Tesla vehicles, dealerships targeted with arson, gunfire and vandalism in at least 9 states: FBI","text":"After nationwide incidents targeting Tesla electric vehicles, dealerships, storage lots and charging stations, the FBI on Friday warned the public to \"exercise vigilance\" near the company's properties. Since January 2025, Tesla electric vehicles have been targeted in at least nine states, according to the FBI. The incidents involved arson, gunfire and vandalism, including graffiti expressing grievances against those the perpetrators perceive to be racists, fascists or political opponents, the FBI said. The attacks, which some are calling domestic terrorism, come after the company's CEO, Elon Musk, was appointed by President Donald Trump to lead the Department of Government Efficiency (DOGE). TESLA VEHICLES, CHARGING STATIONS TARGETED AS PROTESTERS DENOUNCE DOGE, ELON MUSK DOGE, tasked with slashing wasteful federal spending, has laid off tens of thousands of federal employees as part of its cuts. Fox News Digital previously reported several Teslas in Las Vegas were set on fire with Molotov cocktails, an Oregon Tesla dealership was shot up, a second Oregon Tesla dealership was damaged by incendiary devices and several Tesla charging stations were set on fire in Massachusetts. TESLA ARSONS PROBED AS 'DOMESTIC TERRORISM' CHEERED BY 'ANTI-CAPITALIST' GROUP LINKED TO 2020 RIOTS Those responsible for the criminal acts against Tesla appear to be \"lone offenders\" who target the properties at night, according to the FBI. \"Individuals require little planning to use rudimentary tactics, such as improvised incendiary devices and firearms and may perceive these attacks as victimless property crimes,\" the FBI said. The agency urged the public to \"exercise vigilance\" for suspicious activity in areas occupied by Tesla dealerships or Tesla-related entities. It noted criminals could make threats online, inquire about or examine security measures at Tesla dealerships, take photos of security-related equipment or personnel at Tesla dealerships or attempt to gain access to restricted areas at Tesla-related properties by bypassing security. This week, a website called \"Dogequest\" claimed to have compiled a list of Tesla owners, their addresses, phone numbers and email addresses in an apparent effort to dox those who have not sold their vehicles out of fear of being targeted. REPORT: JEWISH TESLA OWNER ‘SPEECHLESS’ AFTER JEWISH MASK-HATER FINGER-TRACES SWASTIKA ON HIS CYBERTRUCK The site, which appeared to have been taken down as of Friday afternoon, also contained a map of Tesla dealerships and charging stations. If there is an emergency, the FBI urges people to call local law enforcement or 911 immediately. CLICK HERE TO GET THE FOX NEWS APP \"Be aware of your surroundings at all times and report suspicious activities to the authorities,\" the FBI wrote in the statement. \"Reporting these crimes can help law enforcement identify violent or malicious actors and prevent further damage.\" To report a threat, individuals can contact an FBI field office at fbi.gov/contact-us/field-offices, call 1-800-CALL-FBI or visit tips.fbi.gov. Fox News Digital's Peter D'Abrosca and Sarah Rumpf-Whitten contributed to this report.","summary":"The FBI released a statement Friday warning the public about nationwide incidents targeting Tesla vehicles, dealerships and charging stations.","url":"https://www.foxnews.com/us/tesla-vehicles-dealerships-targeted-arson-gunfire-vandalism-least-9-states-fbi","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/elon-musk-tesla-attacks.png?ve=1&tl=1","video":null,"publish_date":"2025-03-22 00:39:28","author":null},{"id":302824526,"title":"Migrant who fled to Honduras after 2016 death of Sarah Root dragged back US to face charges","text":"An illegal immigrant accused of killing a promising young woman in a devastating DUI crash has been hauled back to American after nearly a decade on the run.\n\nThe life of Sarah Root life was abruptly cut short in Omaha, Nebraska one night in January 2016. She had been out celebrating with friends just a day after receiving her degree from Bellevue University.\n\nThe recent college graduate was stopped at a red light when her vehicle was struck by a drunk driver - an undocumented Honduran national named Eswin Mejia who was street racing in his truck.\n\nRoot's family kept her on life support for three days, but her injuries were too severe. \n\nThe tragedy sparked a national outrage and igniting debates about immigration enforcement failures.\n\nRoot's tragic story was even used by Donald Trump in his acceptance speech at the Republican convention in 2016.\n\nIn a statement released after the speech, Root's parents said: 'We are very appreciative that Mr. Trump is speaking of our daughter. He & his staff have been very compassionate about what we have been going through & have tried to help however they can.' \n\nHe highlighted it as one of many examples of foreigners crossing America's borders illegally and committing a horrific crime.\n\nMejia had entered the US illegally as an unaccompanied minor years earlier in 2013, was arrested and charged with motor vehicle homicide. He was three times over the legal limit.\n\nDespite the seriousness of the charge, he was released on a $50,000 bond after a relative posted the cash fee - $5,000.\n\nMejia took advantage of the judge's decision and instead of showing up for court, he vanished and fled back to Honduras where he was able to hide in the shadows of Central America. His family insisted that he no longer lived at home.\n\nMejia essentially became a ghost but Sarah's family waited while officials placed his his name on ICE's 'Most Wanted' list.\n\nOn Thursday, Mejia was finally captured, cuffed, and immediately extradited back to America on Friday. \n\nMejia was pictured shackled in handcuffs, aboard a the US-bound private jet. \n\nSecretary of State Marco Rubio confirmed the extradition on social media.\n\n'Nine years ago, Sarah was tragically killed by an illegal immigrant who later fled our country. Today, the Trump Administration is announcing the extradition of Sarah's killer from Honduras to the United States to face justice once and for all,' Rubio tweeted. \n\nSenator Joni Ernst of Iowa also issued a statement praising the return.\n\n'The Trump administration never forgot Sarah Root's story. Together, we fought for justice to hold the illegal immigrant who took her life accountable. Iowans and every American know that this administration will always put our citizens first.' \n\nMejia first entered the US illegally in 2013 at the Nogales, Arizona border, where he was classified as an unaccompanied minor. \n\nAs required by law, he was transferred to the Office of Refugee Resettlement and was sent to live with his brother in Omaha in 2014.\n\nBut less than two years later, he was behind the wheel of a vehicle that killed Sarah Root. \n\nEven after his arrest, federal immigration officials failed to place a detainer on him, allowing him to walk free on bond.\n\nICE admitted it encountered Mejia only once following his arrest, and at that time, deemed him to be 'not an enforcement priority.'\n\nThe missed opportunities and countless red flags led to the creation of 'Sarah's Law,' aimed at keeping suspected undocumented immigrants charged with serious crimes in custody.\n\nThe aim would also enforce stricter detention on illegal immigrants.\n\nThe case became a flashpoint in the broader immigration debate, serving as a grim example for those calling for stricter enforcement policies. \n\nSarah's parents became outspoken advocates for reform, meeting with national leaders and appearing before Congress to ensure no other family would have to endure such an agonizing injustice.\n\nMejia's extradition comes shortly after a renewed agreement between Honduras and the United States to enforce a century-old treaty. \n\nThe cooperation had been uncertain amid recent political tensions - especially following a controversial meeting between Honduran leaders and Venezuela's Defense Minister, a figure wanted on drug trafficking charges in the US.\n\nBut Eswin Mejia finally back on American soil to face justice, it appears the tide has finally turned.","summary":"A Honduran illegal immigrant, Eswin Mejia, accused of killing 21-year-old Sarah Root in a 2016 drunk-driving crash, has been extradited to the US after nearly nine years on the run.","url":"https://www.dailymail.co.uk/news/article-14525143/Eswin-Mejia-fled-cuba-death-sarah-root-deported-charges.html","image":"https://i.dailymail.co.uk/1s/2025/03/21/23/96454249-0-image-m-17_1742601096284.jpg","video":null,"publish_date":"2025-03-22 00:37:31","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","source_country":"gb","sentiment":-0.305},{"id":302823054,"title":"Advocacy Groups Petitioning Judge to Compel ICE to Regularly Disclose Information on Immigration Arrests in Chicago","text":"CHICAGO (WLS) — A lawsuit filed this week is asking a federal judge to order U.S. Immigration and Customs Enforcement to release specific reports and data on all immigration arrests made since President Donald Trump took office, as well as provide weekly reports moving forward.\n\nIn the past 60 days, since immigration enforcement has ramped up under President Trump, the public has mostly learned of immigration arrests through social media posts by federal law enforcement agencies.\n\nABC7 Chicago is now streaming 24/7. Click here to watch\n\nFor example, the Drug Enforcement Administration announced in a social media post on Friday that an investigation led to the arrest of a Tren de Aragua member in Matteson. The post included no additional details, like the person’s name, the crimes they are accused of or where they are being held in custody – only that the person is in custody “pending deportation.”\n\nThis throws into sharp relief the historically opaque practices of ICE and the Department of Homeland Security’s investigations arm – Homeland Security Investigations.\n\nBut this week, four civil rights advocacy groups in Chicago filed a lawsuit against ICE, asking a judge to change that pattern of keeping arrest information in the dark.\n\nThe National Immigrant Justice Center (NIJC), Illinois Coalition for Immigrant and Refugee Rights (ICIRR), American Civil Liberties Union Illinois and Organized Communities Against Deportations (OCAD) sued ICE, accusing the agency of violating the terms of a past legally binding agreement surrounding how agents conduct immigration enforcement.\n\nAccording to the lawsuit, nearly two-dozen people in Chicago have accused ICE agents of arresting them illegally in the past two months, violating the 2022 federal court “Castañon Nava settlement.”\n\nThat settlement, stemming from a 2018 lawsuit, requires the Chicago Field Office of ICE to “document the facts and circumstances surrounding a warrantless arrest or vehicle stop in the individual’s arresting documentation,” among other requirements.\n\nAt a news conference this week, Yolanda Orozco, one of the plaintiffs in the new lawsuit, said the agency has recently flouted the “Castañon Nava” agreement that requires prior warrants and proof that an individual is a flight risk before agents can take a person into custody.\n\nOrozco said she saw this firsthand, when agents recently arrested her husband, Abel Orozco, without a warrant. She said her husband was on his way home after buying tamales for the family when he was pulled over by ICE in Lyons.\n\n“Since that da,y my family has been facing a lot of challenges,” Yolanda Orozco said. “We have been living in a crisis.”\n\nRELATED: Alleged Venezuelan gang member arrested in deadly triple shooting on South Side, officials say\n\nProfessor Kathleen Arnold, DePaul University’s Refugee and Forced Migrations Studies director, said the release of arrest data by ICE would provide valuable insight into who’s being targeted and which communities agents are focused on.\n\n“The worry would be that despite the fact that we’re being told that criminals are the ones who are the targets, that there’s no adjudication process, no independent verification that this is true,” Arnold said.\n\nWhat’s at issue, Arnold explained, is whether ICE and the federal government are unfairly targeting Chicago and Illinois with raids and roundups or engaging in racial and ethnic profiling when making arrests.\n\n“The inability of the public to scrutinize this information or contest it, which is a normal democratic right to be able to examine evidence, and we don’t have that evidence,” Arnold said.\n\nWithout disclosing that data, the plaintiffs in the Castañon Nava lawsuit said it’s impossible to hold ICE accountable.\n\n“Because of the number and scale of violations which occurred in just a few weeks after Trump took office and the likelihood that violations will continue, the plaintiffs also ask the court to produce a report of all immigration arrests since January 20, 2025, and to provide weekly reports going forward of all immigration arrests,” a press release from the National Immigrant Justice Center states.\n\nLooking at ICE’s arrests and removals webpage, where the agency has previously touted sharing this kind of information, the I-Team found the most recent publicly available details on immigration arrests and removals are from last year.\n\nArnold said this is why that information needs to be released and updated.\n\n“We need that data,” Arnold said. “Unless the government has something to hide, they should be willing to share this information.”\n\nLast year, the Government Accountability Office criticized ICE’s data release practices, concluding in a report that “ICE should strengthen (the agency’s) data reporting.”\n\nBut because of the agency’s authority and foreign policy mandate, ABC7 Chicago chief legal analyst Gil Soffer said there is a high bar to force ICE to report any specific details on the people it has in custody.\n\n“What can force ICE to provide data is a judicial order to provide data,” Soffer said. “If such an order is issued, then under our systems of laws, ICE is obligated to provide it. That is not to say that ICE won’t fight it, and fight it at all levels of the courts, including up to the Supreme Court.”\n\nICE has not formally responded to the lawsuit accusing it of violating the Castañon Nava settlement.\n\nThe U.S. District Court judge overseeing the case has given ICE an April 3 deadline to respond.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCHICAGO (WLS) &#8212; A lawsuit filed this week is asking a federal&#8230;\n\n\nThis Post: Advocacy Groups Petitioning Judge to Compel ICE to Regularly Disclose Information on Immigration Arrests in Chicago first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/advocacy-groups-petitioning-judge-to-compel-ice-to-regularly-disclose-information-on-immigration-arrests-in-chicago/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-03-22 00:32:45","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":302820706,"title":"Trump administration to revoke legal status for 532,000 migrants brought to US during Biden admin","text":"MIAMI — The Department of Homeland Security said Friday that it will revoke legal protections for hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans, setting them up for potential deportation in about a month.\n\nThe order applies to about 532,000 people from the four countries who came to the United States since October 2022. They arrived with financial sponsors and were given two-year permits to live and work in the U.S. Homeland Security Secretary Kristi Noem said they will lose their legal status on April 24, or 30 days after the publication of the notice in the Federal Register.\n\nThe new policy impacts people who are already in the U.S. and who came under the humanitarian parole program. It follows an earlier Trump administration decision to end what it called the “broad abuse” of the humanitarian parole, a long-standing legal tool presidents have used to allow people from countries where there’s war or political instability to enter and temporarily live in the U.S.\n\nDuring his campaign President Donald Trump promised to deport millions of people who are in the U.S. illegally, and as president he has been also ending legal pathways for immigrants to come to the U.S. and to stay.\n\nBefore the new order, the beneficiaries of the program could stay in the U.S. until their parole expires, although the administration had stopped processing their applications for asylum, visas and other requests that might allow them to remain longer.\n\nThe administration decision has already been challenged in federal courts.\n\nA group of American citizens and immigrants sued the Trump administration for ending humanitarian parole and seeks to reinstate the programs for the four nationalities.\n\nThe Biden administration allowed up to 30,000 people a month from the four countries to come to the United States for two years with eligibility to work. It persuaded Mexico to take back the same number from those countries because the U.S. could deport few, if any, to their homes.\n\nCuba generally accepted about one deportation flight a month, while Venezuela and Nicaragua refused to take any. All three are U.S. adversaries.\n\nHaiti accepted many deportation flights, especially after a surge of migrants from the Caribbean country in the small border town of Del Rio, Texas, in 2021. But Haiti has been in constant turmoil, hampering U.S. efforts.\n\nSince late 2022, more than half a million people have come to the U.S. under the policy, also known as CHNV. It was a part of the Biden administration’s approach to encourage people to come through new legal channels while cracking down on those who crossed the border illegally.","summary":"The order applies to about 532,000 people from the four countries who came to the United States under the Biden Administration.","url":"https://nypost.com/2025/03/21/us-news/trump-administration-to-revoke-legal-status-for-532000-migrants-brought-to-us-during-biden-admin/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/newspress-collage-f7ln9pfqu-1742603434986.jpg?quality=75&strip=all&1742589076&w=1200","video":"https://cdn.jwplayer.com/videos/MqBus3Kw-RyIcpnTz.mp4","publish_date":"2025-03-22 00:32:09","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.264},{"id":302822256,"title":"Columbia University placates Trump, announces policies in bid to restore funding","text":"Columbia University, targeted by Donald Trump over student protests and alleged antisemitism from some demonstrators, unveiled a package of policies on Friday in a bid to placate the president.\nTrump has targeted US universities that saw significant surges of protests against Israel’s war in Gaza that followed the October 7, 2023 attacks by Hamas.\nThe administration had demanded that the university deploys external oversight, but the school stopped short of that with its raft of measures, instead vowing to engage with outside academics on the issue.\nColumbia’s student movement has been at the forefront of protests that have exposed deep rifts over the war.\nActivists called them a show of support for the Palestinian people, while Trump condemned them as anti-Semitic, and said they must end.\nThe president had cut US$400 million in federal funding for Columbia – including research grants and other contracts – on the grounds that the institution had not adequately protected Jewish students from harassment.\n\nColumbia announced on Friday “improvements to our disciplinary processes” as well as making it mandatory that protesters identify themselves when challenged – even if they wear masks, as many did during the height of the pro-Palestinian protests.\nIt also announced the expansion of its security team, including the hiring of 36 officers empowered to remove or arrest those that break the prestigious Ivy League university’s rules.\nIn the document titled “Advancing our work to combat discrimination, harassment and antisemitism at Columbia,” the university announced the creation of a new “Office of Institutional Equity” as well as updating its anti-discrimination and discriminatory harassment policy for students and groups.\n“The University’s approach and relevant policies will incorporate the definition of antisemitism recommended by Columbia’s Antisemitism Taskforce in August 2024,” the policy document said.\nAs well as budget cuts to Columbia’s federal funds, with more threatened, immigration officers have targeted a leader of the pro-Palestinian protests, Mahmoud Khalil.\n\nKhalil, a US permanent resident with Palestinian roots and a graduate student at Columbia, was arrested by officers and has been held in Louisiana as he and his supporters fight his deportation on foreign policy grounds.\nColumbia’s interim president, Katrina Armstrong, previously acknowledged the “critical moment for higher education” in a recent statement.\nLast week, the private university announced a battery of disciplinary measures – including suspensions, temporary degree revocations and expulsions – aimed at student protesters who occupied a campus building last year.\nIn a recent letter sent to Columbia, the Trump administration gave the university one week to agree to a series of drastic reforms if it wanted to open negotiations to recover the US$400 million.\nThe letter demanded Columbia codify a definition of antisemitism that included a focus on anti-Zionism, and insisted the Middle Eastern, South Asian, and African Studies departments be put under “academic receivership.”\nFriday’s policy announcement did not use that language to describe the measures the university would take towards the departments of Middle Eastern, South Asian, and African Studies – but did announce a review of their work.","summary":"Columbia University unveiled new policies to combat antisemitism and restore US$400 million in federal funding amid pressure from the US president.","url":"https://www.scmp.com/news/world/united-states-canada/article/3303429/columbia-university-placates-trump-announces-policies-bid-restore-funding","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/22/29a2c584-9b1b-4286-b2dd-9e6a82be2c32_d44be8c1.jpg","video":null,"publish_date":"2025-03-22 00:25:36","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"cn","sentiment":0.175},{"id":302821072,"title":"World News | Trump Administration Cuts Legal Help for Migrant Children Travelling Alone","text":"Washington, Mar 22 (AP) The Trump administration has ended a contract that provides legal help to migrant children entering the country without a parent or guardian, raising concerns that children will be forced to navigate the complex legal system alone. The Acacia Center for Justice contracts with the government to provide legal services through its network of providers around the country to unaccompanied migrant children under 18, both by providing direct legal representation as well as conducting legal orientations — often referred to as “know your rights” clinics — to migrant children who cross the border alone and are in federal government shelters. Also Read | 'F47 Will Be Most Lethal Aircraft Ever Built': Donald Trump Unveils F-47, America's Sixth-Generation Fighter Jets (See Pics and Video). Acacia said they were informed Friday that the US Department of Health and Human Services was terminating nearly all the legal work that the centre does, including paying for lawyers for roughly 26,000 children when they go to immigration court. They're still contracted to hold the legal orientation clinics. “It's extremely concerning because it's leaving these kids without really important support,” said Ailin Buigues, who heads Acacia's unaccompanied children programme. \"They're often in a very vulnerable position.” Also Read | 'Bangladesh Elections Will Be in December': Information Adviser Mahfuj Alam Urges All Parties To Prepare for Polls. People fighting deportation do not have the same right to representation as people going through criminal courts, although they can hire private attorneys. But there has been some recognition that children navigating the immigration court system without a parent or guardian are especially vulnerable. The Trafficking Victims Protection Act of 2008 created special protections for children who arrive in the US without a parent or a legal guardian. Emily G. Hilliard, deputy press secretary at Health and Human Services, said in an emailed statement that the department “continues to meet the legal requirements established” by the Act as well as a legal settlement guiding how children in immigration custody are being treated. The termination comes days before the contract was to come up for renewal on March 29. Roughly a month ago the government temporarily halted all the legal work Acacia and its subcontractors do for immigrant children, but then days later Health and Human Services reversed that decision. The programme is funded by a five-year contract, but the government can decide at the end of each year if it renews it or not. A copy of the termination letter obtained by The Associated Press said the contract was being terminated “for the Government's convenience.” Michael Lukens is the executive director of Amica, which is one of the providers contracting with Acacia in the Washington, DC area. He said with the renewal date swiftly approaching, they had been worried something like this would happen. He said they will continue to help as many kids as they can \"for as long as possible” and will try to fight the termination. “We're trying to pull every lever but we have to be prepared for the worst, which is children going to court without attorneys all over the country. This is a complete collapse of the system,” he said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The Trump administration has ended a contract that provides legal help to migrant children entering the country without a parent or guardian, raising concerns that children will be forced to navigate the complex legal system alone.","url":"https://www.latestly.com/agency-news/world-news-trump-administration-cuts-legal-help-for-migrant-children-travelling-alone-6726412.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-22 00:24:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.241},{"id":302822760,"title":"Dan Bernstein's latest misstep was too much for The Score to overlook","text":"If there’s one thing about Dan Bernstein that everyone can agree on, it’s that he’s crazy.\n\nNot crazy like certifiably crazy. Not crazy like he’d stick a sharp metal object in your head for no reason, although that northern pike he caught at Northerly Island might beg to differ.\n\nHe’s crazy intense. Not about everything but certainly too many things for his own good. It got the best of him last week when an exchange on X about that fish went south and he threatened to dox the person and involve his kids.\n\nThat led to The Score essentially suspending him for a week, followed by his ouster Friday, as announced in a brief statement on the air by station vice president Mitch Rosen. It ends a 30-year run at the station in which Bernstein became one of the best sports-talkers in town, if not the country.\n\n“I’m sad for Dan and for the radio station,” said Dan McNeil, another sports-talk great whom The Score fired in 2020, also for an inappropriate social media post. “They had no choice because the mighty X is America’s human-resources department. People are gonna be mad at Mitch. He had no choice.\n\n“People are mad at Dan for being stupid, and he knows he was stupid. I exchanged brief texts with him earlier in the week. He works hard at him, and he’s not getting many miles per gallon lately. I hope that changes, and I think he’ll put in the work to do that, as I have.”\n\nBut Bernstein’s intensity made him must-listen radio. His sports thoughts weren’t just fire and passion, they were articulate and well-informed. He was the only host at the station who could speak with authority about every major team in town. The Score often eschews hockey talk, but when the Blackhawks were winning, Bernstein could talk about them knowledgeably.\n\nHis strongest subjects were basketball, which he could break down tactically like a coach, football and baseball analytics. He was on top of it all, somehow turning myriad pieces of information into succinct, digestible soundbites. He didn’t just spew hot takes, he made an argument and backed it up. Like him or not, he’s a special talent.\n\nBut as talented as he is, he can be reckless. The incident last week was the latest in a yearslong series in which Bernstein put himself in hot water. Last year, he came under fire for his poor reaction to being called by his last name on the air, which was caught on video. He never went off the air, but he took a beating on social media.\n\nIn 2015, Bernstein drew ire for a lewd remark on Twitter about a former Comcast SportsNet Chicago reporter’s appearance. He angered listeners for mockingly referring to late Cubs Hall of Famer Ron Santo’s amputated legs as stumps. Bernstein often attacked callers he found to be incapable of making suitable arguments, which rubbed some listeners the wrong way.\n\nThe nastiness, though, is somewhat part of the sports-radio genre. “Fan” is short for “fanatic,” which is defined as “a person filled with outsized and single-minded zeal.” When such people call into a sports-talk show, things can get ugly, and that’s supposed to be part of the fun. Sometimes it just comes off as mean. But that didn’t lead to Bernstein’s downfall.\n\n“Dan’s strongest convictions weren’t in line with the station’s mission statement at the beginning,” McNeil said. “We wanted to be a place where people could get away from the ways of the wicked world. And Penn State [sexual-abuse revelations] was the beginning, then came [Donald] Trump and [Colin] Kaepernick.\n\n“That fraternity house became a think tank, and we lost something. I wasn’t there for all of it, and then the pandemic and George Floyd. The climate in the country has sullied sports talk. And Dan was a part of that side that was screaming. We make our own beds in this world.”\n\nThe station couldn’t save Bernstein this time, despite three decades of service and strong ratings. When the situation called for him to lower the intensity, he raised it, another self-inflicted wound that was entirely avoidable. He should’ve learned by now. But the smartest person in the room doesn’t always make the smartest decisions.","url":"https://chicago.suntimes.com/sports-media/2025/03/21/dan-bernstein-dan-mcneil-the-score-chicago-sports-radio-mitch-rosen","image":"https://cst.brightspotcdn.com/dims4/default/26db02e/2147483647/strip/true/crop/1126x643+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fcf%2F9d%2Fe54a9032490fa2833c6dfb303155%2Fscreens","video":null,"publish_date":"2025-03-22 00:21:08","author":"Jeff Agrest","authors":["Jeff Agrest"],"language":"en","source_country":"us","sentiment":-0.219},{"id":302820704,"title":"Beyoncé’s dad Mathew Knowles issues scathing response to Kanye West’s attack on grandkids: ‘Pay a price for being stupid’","text":"Daddy lessons. \n\nMathew Knowles is speaking out following Kanye West’s attack on his daughter Beyoncé and son-in-law Jay-Z’s children on social media.\n\nEarlier this week, the disgraced rapper questioned the mental capacity of the couple’s 7-year-old twins, Rumi and Sir, and claimed they were conceived via in vitro fertilization (IVF) in a disturbing post shared on X.\n\nKnowles, 73, who served as Bey’s manager in the early days of her career, believes that West (aka Ye), 47, will get his comeuppance. \n\n“People pay a price for being stupid, especially in the music industry,” Knowles told TMZ on Friday. \n\nAlluding to West’s increasingly unhinged behavior, Knowles added, “I’m hopeful Kanye gets the type of help he needs, in terms of mental health.”\n\nKnowles’ comments arrived on the heels of his ex-wife Tina Knowles sharing a video on Instagram Wednesday that was widely viewed to be a thinly-veiled clapback at Ye’s vile posts.\n\n“What happens when a snowman throws a tantrum? He has a meltdown,” Tina, 71, quipped.\n\n“Corny joke, time!” she began her caption.\n\n“It’s hard to remain positive and classy in the face of ignorance and evil. But I know that no weapon formed against me or my family shall prosper. This battle is not mine, but the Lord’s, I know that God has got this,” she added in a since-deleted excerpt of the post.\n\nNo stranger to public controversy, Ye has been more embattled than ever lately: from selling Swastika T-shirts and launching antisemitic tirades to accusing his ex-wife Kim Kardashian of running a sex-trafficking ring involving their children.\n\nAnd though he deleted his original post on X about Jay-Z and Beyoncé’s children, he later reposted it, noting that he didn’t remove it to be “a good person.”\n\n“I need everyone to know that I took the post about Jay-Z and Beyoncé’s family down … because there was a possibility of my Twitter being cancelled [sic],” he wrote on Wednesday.\n\nAfter making a series of new antisemitic comments on X later that day, Ye turned his attention back to the “99 Problems” rapper, 55, and the “Texas Hold ‘Em” singer, 43.\n\n“I LOVE JAY Z AND I DO FEEL BAD,” the Yeezy founder began, seemingly walking back his prior attacks. “I ALWAYS FELT LIKE THE BLACK SHEEP LIKE I WANTED FAMILY IN THIS MUSIC S[—]T[.]\n\n“I’D RUN ON STAGES THINKING I WAS DOING THE RIGHT THING AND WOULD ALWAYS BE A SLIGHT HOV NOT COMING TO MY FIRST WEDDING,” he added, possibly alluding to his storming onstage and stealing the mike from Taylor Swift at the 2009 VMAs. The statement also referred to how Jay-Z, who sometimes goes by HOV, short for HOVA, didn’t attend Ye’s wedding to Kardashian, 44.\n\nContinuing to write about Jay-Z, Kanye posted, “HIM PUTTING KENDRICK ON THE SUPERBOWL OVER ME OR EVEN US NEVER BEING INVITED TO S[—]T TAKING [sic] JABS ABOUT MY RED HAT ON DONDA.”\n\nJay-Z signed a partnership with the NFL in 2019 to produce the Super Bowl halftimes. The Roc Nation founder tapped Kendrick Lamar to perform at the 2025 show. Jay-Z has also been critical of Kanye’s past support of Donald Trump, who has become synonymous with his red “Make America Great Again” hats that Ye has famously and controversially worn.\n\n“I FELT LIKE BOTH HIM AND HIS WIFE COULD HAVE HELPED ME HAVE MORE LEVERAGE WITH MY KIDS,” Ye went on. “THEY COULD HAVE USED THEIR CULTURAL POSITION TO NOT JUST WATCH THE KARDASHIANS RUN ME OVER.\n\n“S[—]T HURTS SO F[—]K BOTH OF THEM CAUSE WHEN I NEEDED THEM IT WAS F[—]K ME,” he concluded.","summary":"Daddy lessons.","url":"https://nypost.com/2025/03/21/entertainment/beyonces-dad-mathew-knowles-has-scathing-response-to-kanye-wests-attack-on-grandkids/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100880556.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-22 00:20:08","author":"Sean Mandell","authors":["Sean Mandell"],"language":"en","source_country":"zm","sentiment":-0.134},{"id":302821082,"title":"World News | Earthquake of 6.1 Magnitude Jolts Panama","text":"Panama City [Panama], March 22 (ANI): An earthquake of magnitude 6.1 on Richter Scale jolted Panama late on Friday, a statement from the National Center for Seismology said.\nAs per the statement, the earthquake occurred at a shallow depth of 10km, making it susceptible to aftershocks.\nAlso Read | 'F47 Will Be Most Lethal Aircraft Ever Built': Donald Trump Unveils F-47, America's Sixth-Generation Fighter Jets (See Pics and Video).\n\"EQ of M: 6.1, On: 21/03/2025 20:20:50 IST, Lat: 7.17 N, Long: 82.20 W, Depth: 10 Km, Location: South of Panama,\" the NCS said in a post on X.\nhttps://x.com/NCS_Earthquake/status/1903106627697512662\nAlso Read | 'Bangladesh Elections Will Be in December': Information Adviser Mahfuj Alam Urges All Parties To Prepare for Polls.\nShallow earthquakes like this one are more dangerous than deeper ones due to their greater energy release closer to the Earth's surface, causing stronger ground shaking and increased damage to structures and casualties, compared to deeper earthquakes, which lose energy as they travel to the surface.\nAs per Global Earth Model, Panama is an independent country located in the sourthen part of Central America. The construction of the interoceanic canal has made it a commercial hub in the region. Panama City, the most populated urban center, is characterized by tall buldings mixing residential and commercial occupancies. Only a small portion of the population resides in zones of high seismic hazard.\nThe Pedro Miguel Fault is a seismic fault that runs beneath the Panama Canal and near Panama City, home to approximately 1.2 million of Panama's approximately 3.3 million inhabitants.\nBoth faults are active, cause earthquakes every 600 to 900 years, and could cause ground slippage of up to 9.8 feet (3.0 m). An earthquake in 1882 caused a regional tsunami. A team of seismologists led by Tom Rockwell of San Diego State University found evidence suggesting both faults slipped simultaneously around 700 CE.\nThe Pedro Miguel and the Limon Fault system are a concern for geologists, as a strong earthquake centered on either could damage the canal, drain the lake that supplies water for the operation of its locks, Lago Gatun, and cause severe damage in the capital. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  As per the statement, the earthquake occurred at a shallow depth of 10km, making it susceptible to aftershocks.","url":"https://www.latestly.com/agency-news/world-news-earthquake-of-6-1-magnitude-jolts-panama-6726408.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250321192630.jpg","video":null,"publish_date":"2025-03-22 00:18:21","author":null,"language":"en","source_country":"in","sentiment":0.092},{"id":302823426,"title":"‘Tell Your People To Stop Firebombing’ Tesla Facilities, Fox Host Tells Democratic Strategist","text":"Fox News’ Jesse Watters on Friday evening urged Democratic Party strategist and fellow Fox panelist Jessica Tarlov to tell her “people” to “stop firebombing” Tesla facilities.\n\nProtests against billionaire Elon Musk and his electric vehicle company Tesla erupted this month, with some charging stations being graffitied and set on fire. While discussing the protests over Musk’s involvement with the Department of Government Efficiency (DOGE), “The Five” panelist Judge Jeanine Pirro called out Democrat lawmakers who have previously condemned domestic terrorism but have remained silent about the attacks on Musk’s company.\n\n“OK, Jessica, the Dems have railed against domestic terrorism for years, and in fact the 13 who had proposed a federal domestic terrorism law apparently refused to respond to Fox News as to whether or not they felt that they agreed with this being domestic terrorism,” Pirro said.\n\n“I don’t know who they were. I would advise anyone who can go on the record and is in any position of power to come on and denounce any violent action,” Tarlov responded. “I think it’s pretty simple.”\n\nThe panel went on to debate about lawmakers like Democrat Texas Rep. Jasmine Crockett, who have called for Musk to be “taken down” while speaking with the Tesla Takedown movement. During a call with the protest group on Thursday, Crockett said that all she wanted on her birthday, March 29, was for “Elon to be taken down,” quickly adding that she meant it “figuratively.”\n\n“OK, do you want to then take responsibility for everyone who sent a pipe bomb that was influenced by Donald Trump?” Tarlov asked. “The guy from Florida who was sending pipe bombs to prominent Democrats like Nancy Pelosi, Hillary Clinton and George Soros?”\n\nGutfeld called out Tarlov for only having one example to use against Republicans, but the Democrat strategist listed other scenarios.(RELATED: EXCLUSIVE: Federal Gov’t Agencies Quietly Went On Massive Spending Sprees Under Biden, Report Finds)\n\n“No, I don’t have one example,” Tarlov said. “People who show up and shoot up Walmarts looking for brown people. You want to take people who’ve been influenced by Donald Trump.”\n\n“That’s not Donald Trump calling for that. The Democrats are calling for the destruction,” Pirro said.\n\nTarlov said no one was calling for destruction. Pirro then cited failed Democratic vice presidential nominee Tim Walz, who was seen gloating about Tesla’s stocks dropping while on stage during his tour around the country.\n\n“I said yesterday, I thought that it was really stupid,” Tarlov said. “And Ro Khanna is right. He has 20,000 people who work at Tesla. There are hundreds of millions of dollars in Tesla stock that fuel these pensions or fund these pensions, I should say. That part of it absolutely has to stop. If you don’t want to buy the car, don’t buy the car. If you want to sell the car, sell the car.”\n\n“But Donald Trump’s saying on Truth Social that maybe you’ll go to El Salvador. At this moment, when the ACLU attorneys are reporting that people have been falsely sent to El Salvador, which is what we said was going to happen, they’re being sent back because guess what? They’re not Venezuelan,” Tarlov added. “Also, they sent some women. El Salvador doesn’t want to take women. Are you going to finally admit that the way that they are vetting these people is inaccurate?”\n\nPirro and Tarlov argued over Trump’s deportation plans. Pirro said she believes it’s important to “get rid of the criminals” in the U.S. before asking Watters about investing in Tesla.\n\n“I’m invested. I’ve been invested. So go for it if you want. Am I in trouble now, Jessica?” Watters teased.\n\nTarlov responded by saying that she “probably” is invested in Tesla’s stock as well.\n\n“OK, good. So tell your people to stop firebombing,” Watters said.\n\n“I have,” Tarlov whispered.\n\nOn Thursday, U.S. Attorney General Pam Bondi announced charges against the three individuals arrested for violently destroying Tesla properties. In a statement, the Department of Justice said the individuals would “face the full force of the law” for using Molotov cocktails to set fire to Tesla cars and charging stations.\n\n“The days of committing crimes without consequence have ended,” Bondi said. “Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.”\n\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.","summary":"'Am I in trouble now, Jessica?'","url":"https://dailycaller.com/2025/03/21/telsa-fox-news-jesse-watters-jessica-tarlov-democrats-elon-musk/","image":"https://cdn01.dailycaller.com/wp-content/uploads/2025/03/Untitled-design-13-e1742599750711.jpg","video":null,"publish_date":"2025-03-22 00:18:01","author":"Hailey Gomez","authors":["Hailey Gomez"],"language":"en","category":"politics","source_country":"us","sentiment":-0.422},{"id":302823060,"title":"DR Congo Proposes Mineral Deal to Trump in Return for Assistance Against Rebels","text":"Democratic Republic of the Congo (DRC) President Felix Tshisekedi wrote a letter to President Donald Trump in which he offered extensive mineral rights to the U.S. Sovereign Wealth Fund in exchange for military assistance against the Rwanda-backed insurgent group M23.\n\nThe February 8 letter, which has not officially been disclosed to the public, was allegedly reviewed by the Wall Street Journal (WSJ) on Wednesday.\n\n“Your election has ushered in the golden age for America,” Tshisekedi told Trump. “Our partnership would provide the U.S. with a strategic advantage by securing critical minerals such as cobalt, lithium, copper and tantalum from the Democratic Republic of Congo.”\n\nTshisekedi asked Trump for unspecified military assistance and a “formal security pact” to push back M23, which has been advancing from the eastern reaches of the DRC to capture key cities and threaten the capital of Kinshasa.\n\nA spokeswoman for Tshisekedi’s office confirmed the authenticity of the letter and said negotiations with U.S. officials over the DRC’s natural resources are already underway. A source told the WSJ that the White House National Security Council (NSC) requested a briefing on Tshisekedi’s proposal.\n\n“The DRC is interested in partnering with the Trump administration to end the conflict and stop the flow of blood minerals via Rwanda,” Tshisekedi’s spokeswoman said.\n\nThe White House, on the other hand, refused to comment on the letter, which it described as “private correspondence to the president.”\n\nThe WSJ noted that the DRC has been separately attempting to work out a deal for securing its mining operations with former Blackwater CEO and founder Erik Prince. Blackwater is long gone, having been sold off in 2010, but Prince is involved with other private security operations and he is an outspoken supporter of President Trump.\n\nThe eastern Congo has abundant mineral resources and it could certainly use some more security. More than a hundred armed groups are known to be operating in the area, creating massive security problems for mining operations, as well as a major humanitarian crisis.\n\nThe rebel group M23, which is largely made up of fighters from the Tutsi ethnic group and is supported by Tutsi-dominated Rwanda, launched a major offensive at the beginning of the year. M23 captured the strategically vital city of Goma with Rwandan assistance in January and has taken control of other population centers since then, most recently including the mining hub of Walikale. M23 announced its capture of Walikale on Thursday, one day after Tshisekedi and Rwandan President Paul Kagame met in Doha, Qatar and called for an immediate ceasefire.\n\n“We are Congolese who are fighting for a cause. What happened in Doha, as long as we don’t know the details, and as long as it doesn’t solve our problems, we’ll say it doesn’t concern us,” said a spokesman for the Congo River Alliance (AFC), the larger coalition of insurgent groups that M23 belongs to.\n\nWalikale, with a population of about 15,000, marks the furthest west M23 has been able to push into the DRC. Thousands of refugees reportedly fled the city as the insurgent force rolled in. The DRC military said it had to abandon the town because fighting back would have resulted in heavy civilian casualties.\n\nIn addition to displacing large numbers of civilians, the M23 offensive has also caused some mining companies to shut down.\n\nM23 was supposed to meet with Congolese government officials in Angola on Tuesday for ceasefire talks, but the insurgent group pulled out of the meeting on Monday, angered by European Union (EU) sanctions imposed on several of the insurgent group’s leaders, as well as DRC efforts to recapture territory occupied by M23 forces.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDemocratic Republic of the Congo (DRC) President Felix Tshisekedi wrote a letter&#8230;\n\n\nThis Post: DR Congo Proposes Mineral Deal to Trump in Return for Assistance Against Rebels first appeared on Internewscast Journal","url":"https://internewscast.com/news/dr-congo-proposes-mineral-deal-to-trump-in-return-for-assistance-against-rebels/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Report-DR-Congo-Offers-Trump-Minerals-in.jpg","video":null,"publish_date":"2025-03-22 00:15:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.059},{"id":302826046,"title":"Trump misses chance at March Madness bracket predictions, says he can backdate one","text":"President Donald Trump missed the deadline to fill out a March Madness bracket. But it doesn't mean he won't try and sneak one in afterward. While speaking with reporters outside the White House Friday, Trump was asked by Fox News Senior White House correspondent Peter Doocy if he filled out a March Madness bracket. \"I didn't. I should have. Have there been upsets? A couple, right?\" Trump responded. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I can give you one but maybe backdated.\" That would allow Trump to disregard the round that ruined almost every bracket in the country. Through Friday’s early first-round games, the number of perfect brackets in the NCAA Tournament was down to 0.0044% out of 34 million, according to the NCAA. TRUMP TO PRESIDE OVER HISTORIC SPORTING EVENTS — WHICH TEAMS AND STARS COULD SKIP WHITE HOUSE VISITS? ESPN’s tracker listed 1,098 perfect brackets remaining out of 24 million on its site after Ole Miss’ 71-64 win over North Carolina. That game also took out more than 100 brackets in Yahoo Sports’ Men’s Bracket Mayhem, leaving 81 perfect brackets, essentially down to 0%. CBS Sports had a similar attrition rate, down to 0.005% unblemished brackets after the Ole Miss win. More than 85% of Yahoo’s brackets had Clemson advancing, but the Tigers lost to McNeese State, 69-67. That game knocked out 6.6 million ESPN brackets, too. CLICK HERE TO GET THE FOX NEWS APP Creighton was listed as ESPN’s top bracket buster after its 89-75 win over Louisville in Thursday’s first game, knocking out 13,339,089. Conversely, ESPN reported that every pick was incorrect on 30 of its brackets. The Associated Press contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"President Donald Trump missed the deadline for a March Madness bracket, but he says he can fill out a &quot;backdated&quot; one after games have concluded.","url":"https://www.foxnews.com/sports/trump-misses-chance-march-madness-bracket-predictions-says-he-can-backdate-one","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2019/02/931/523/Ivanka-3.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-22 00:13:39","author":null},{"id":302822252,"title":"US to revoke legal status of migrants that came under fraud-ridden Biden administration program","text":"Despite the large number of entries under the program, an internal investigation found it was rife with fraud, prompting its temporary freezing last year.\n\nThe program was put on the chopping block on President Donald Trump’s first day in office, with Section 7 of the Jan. 20 Executive Order 14165 directing the DHS to “[t]erminate all categorical parole programs that are contrary to the policies of the United States established in [the President’s] Executive Orders, including the program known as the ‘Processes for Cubans, Haitians, Nicaraguans, and Venezuelans.’”\n\nThe order canceling the CHNV program will take effect on April 24. Those who entered through the program were urged to self-deport as soon as possible or face deportation by Immigration and Customs Enforcement agents.\n\nThe Washington Examiner reached out to DHS for further comment.\n\nFriday’s notice undercut the Biden administration’s arguments in favor of the CHNV program, created under former DHS secretary Alejandro Mayorkas’s leadership.\n\nThe Trump administration argued, “These programs do not serve a significant public benefit, are not necessary to reduce levels of illegal immigration, did not sufficiently mitigate the domestic effects of illegal immigration, are not serving their intended purposes, and are inconsistent with the Administration’s foreign policy goals.”\n\nThe CHNV program allowed migrants from Cuba, Haiti, Nicaragua, and Venezuela to bypass normal immigration protocols. Despite the Biden administration’s insistence that all applicants had been screened and vetted, a report from the DHS Office of Inspector General found migrant applicants had used repetitive and false information to secure admission into the country.\n\nDHS RESUMES FRAUD-RIDDEN CHNV PROGRAM WITH NEW MIGRANT VETTING PROTOCOLS\n\nIt was frozen in July 2024 but resumed the following month.\n\nA report by the Federation for American Immigration Reform, a nonprofit group that calls for restricting immigration levels, said the Social Security numbers of deceased sponsors in the U.S. and fake phone numbers were used on applications.","summary":"The Trump administration terminated the legal status of over 530,000 Latin American and Haitian migrants brought in under a Biden administration sponsorship program. A Friday notice from the Department of Homeland Security announced the termination of &#8220;categorical parole programs for inadmissible aliens from Cuba, Haiti, Nicaragua, and Venezuela and their immediate family members,&#8221; otherwise known [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3355968/us-revoke-legal-status-migrants-biden-administration-program-chnv/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/trump-world-leader-parade.webp","video":null,"publish_date":"2025-03-22 00:10:16","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.54},{"id":302819760,"title":"Homeland Security makes cuts to offices overseeing civil rights protections","text":"WASHINGTON (AP) — The Department of Homeland Security is making cuts to three key offices that oversee civil rights protections across its broad mission, suggesting that they were impeding immigration enforcement efforts.\n\nA spokeswoman for the department, Tricia McLaughlin, said in a statement Friday that it was implementing a “reduction in force” for three offices: the Office for Civil Rights and Civil Liberties, the Office of the Immigration Detention Ombudsman, and the Office of the Citizenship and Immigration Services Ombudsman.\n\nPresident Donald Trump has made downsizing the federal government a key policy goal.\n\nFederal agencies were directed to submit by March 13 plans that would not only lay off employees but eliminate positions altogether and consolidate programs. The DHS developments were first reported by The New York Times.\n\nMcLaughlin said Homeland Security is “committed to civil rights protections” but said these offices were a roadblock to immigration enforcement.\n\n“These offices have obstructed immigration enforcement by adding bureaucratic hurdles and undermining DHS’s mission. Rather than supporting law enforcement efforts, they often function as internal adversaries that slow down operations,” she said.\n\nThe Office for Civil Rights and Civil Liberties was created by the Homeland Security Act of 2002, with the mission of protecting civil liberties in the department created in the wake of the Sept. 11 attacks. It investigates hundreds of complaints a year about the agency’s mission and recommends changes as necessary.\n\nThe Office of the Immigration Detention Ombudsman is an independent office within Homeland Security — not connected to either Immigration and Customs Enforcement or Customs and Border Protection. Its job it is to make sure immigration detention facilities are safe and humane.\n\nThe Office of the Citizenship and Immigration Services Ombudsman is another independent office in the department responsible for helping people or businesses resolve issues with the agency that oversees immigration benefits.\n\nDemocrats slammed the moves, saying they would hurt transparency.\n\n“With Trump’s mass firing of the entire DHS Civil Rights and Civil Liberties workforce, he is ensuring in advance that there will be no transparency or oversight of his extreme agenda,” said Rep. Bennie G. Thompson of Mississippi, the top Democrat on the House Committee on Homeland Security.\n\nA staffer who works in the Civil Rights and Civil Liberties office and asked not to be identified for fear of retribution stressed that the office’s mission stretches far beyond immigration and border security, noting that they look into allegations concerning all parts of Homeland Security, including the Transportation Safety Administration and the Federal Emergency Management Agency.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The Department of Homeland Security is making cuts to three key offices that oversee civil rights protections across its broad mission, suggesting that they...","url":"https://wsvn.com/news/politics/homeland-security-makes-cuts-to-offices-overseeing-civil-rights-protections/","image":"https://wsvn.com/wp-content/uploads/sites/2/2022/12/Department-of-Homeland-Security-sign.jpg?quality=60&strip=color","video":null,"publish_date":"2025-03-22 00:08:50","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":-0.216},{"id":302821096,"title":"World News | Johnson & Johnson Increases US Investment to More Than USD 55 Billion over Next 4 Yrs","text":"Washington, DC [US], March 22 (ANI): Johnson and Johnson, US healthcare's leading, most comprehensive innovation powerhouse, announced on Friday that it will invest more than USD 55 billion in manufacturing, research and development, and technology in the United States over the next four years. According to Johnson and Johnson's statement, this represents a 25 per cent increase in investment compared to the previous four years and builds upon the Company's already elevated US investment levels resulting from the passage of the 2017 Tax Cuts & Jobs Act.\nAlso Read | 'F47 Will Be Most Lethal Aircraft Ever Built': Donald Trump Unveils F-47, America's Sixth-Generation Fighter Jets (See Pics and Video).\n\"Today's announcements accelerate our nearly 140-year legacy as an American innovation engine tackling the world's toughest healthcare challenges,\" said Joaquin Duato, Chairman and Chief Executive Officer of Johnson and Johnson. \"Our increased US investment begins with the ground-breaking of a high-tech facility in North Carolina that will not only add US-based jobs but manufacture cutting-edge medicines to treat patients in America and around the world.\"\nIn addition to the facility in Wilson, North Carolina, the Company's increased investment in the US over the next four years includes three new advanced manufacturing facilities and the expansion of several existing sites across the Company's Innovative Medicine and medtech businesses, which will create high-paying, high-technology jobs. The Company will share further information on these sites once it is available.\nAlso Read | 'Bangladesh Elections Will Be in December': Information Adviser Mahfuj Alam Urges All Parties To Prepare for Polls.\nFurther, it also included significant investments in extensive R&D infrastructure aimed at developing lifesaving and life-changing treatments in areas such as oncology, neuroscience, immunology, cardiovascular disease, and robotic surgery. Increased technology investments will help speed drug discovery and development, support workforce training, and enhance our business operations. According to the company's statement, the North Carolina investment creates jobs starting today in Wilson, North Carolina, where the Company is officially breaking ground on its new, 500,000-square-foot, state-of-the-art biologics manufacturing facility.\n\"Expand our capacity to manufacture next-generation medicines for people living with cancer and immune-mediated and neurological diseases in America and around the world. Support approximately 5,000 jobs during construction and create over 500 positions in North Carolina,\" it added.\nJohnson & Johnson has more manufacturing facilities in the US than in any other country and is a leading investor in American innovation and R&D. Focusing on pharmaceuticals and medical technology, the Company stands alone in its ability to impact the full spectrum of disease.\nFrom cardiology to cancer, mental health to vision, cell therapies to robotics, the depth and breadth of Johnson & Johnson's expertise and capabilities are unique. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  According to Johnson and Johnson's statement, this represents a 25 per cent increase in investment compared to the previous four years and builds upon the Company's already elevated US investment levels resulting from the passage of the 2017 Tax Cuts &amp; Jobs Act.","url":"https://www.latestly.com/agency-news/world-news-johnson-johnson-increases-us-investment-to-more-than-usd-55-billion-over-next-4-yrs-6726399.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250321164043.jpg","video":null,"publish_date":"2025-03-22 00:08:20","author":null,"language":"en","source_country":"in","sentiment":0.242},{"id":302818576,"title":"USS Carl Vinson Ordered to Join Carrier in Middle East, Delaying Return to San Diego","text":"Defense Secretary Pete Hegseth, in a rare move, is beefing up Navy warship presence in the Middle East, ordering the USS Carl Vinson to be there next month.\n\nThe move coincides with the U.S. increase in strikes on the Yemen-based Houthi rebels, according to a U.S. official.\n\nIt will be the second time in six months that the U.S. has kept two carrier strike groups in that region, when generally there is only one. It had been years since the U.S. had committed that much warship power to the Middle East.\n\nAccording to the official, Hegseth signed orders on Thursday to keep the USS Harry S. Truman in the Middle East for at least an additional month. The official spoke on the condition of anonymity to discuss ongoing military operations.\n\nThe ship has been conducting operations in the Red Sea against the Houthis and was scheduled to begin heading home to Norfolk, Virginia, at the end of March.\n\nAnd Hegseth has ordered the USS Carl Vinson, which has been operating in the Pacific, to begin steaming toward the Middle East, which will extend the carrier’s scheduled deployment by three months.\n\nThe Vinson is expected to arrive in the region early next month. It had been conducting exercises with Japanese and South Korean forces near the Yellow Sea and the Sea of Japan and was slated to head home to port in San Diego in three weeks.\n\nThe presence of so much U.S. naval power in the region not only gives commanders additional ships to patrol and launch strikes, but it also serves as a clear message of deterrence to Iran, the Houthis’ main benefactor.\n\nThe Houthis have been waging persistent attacks against commercial and military ships in the region. Houthi rebels attacked more than 100 merchant vessels with missiles and drones, sinking two vessels and killing four sailors, from November 2023 until January of this year. \n\nTheir leadership described the attacks as aimed at ending the Israeli war against Hamas in the Gaza Strip.\n\nHegseth’s move shifts the Vinson and its warships away from the Indo-Pacific region, which the Trump administration has touted as its main focus.\n\nInstead, this bolsters the latest U.S. campaign against the Iran-backed Houthis. U.S. ships and aircraft have launched a new intensive assault against the militant group, including a barrage of attacks over the weekend that continued into this week.\n\nPresident Donald Trump, in a marked departure from the previous administration, lowered the authorities needed for launching offensive strikes against the Houthis. He recently gave U.S. Central Command the ability to take action when it deems appropriate.\n\nPresident Joe Biden’s administration had required White House approval to conduct offensive strikes such as the ones over the weekend. It did allow U.S. forces to launch defensive attacks whenever necessary, including the authority to take out weapons that appeared to be ready to fire.\n\nBiden went to two carriers in the region for several weeks last fall. Then-Defense Secretary Lloyd Austin had ordered the Roosevelt to extend its deployment for a short time and remain in the region as the USS Abraham Lincoln was pushed to get to the area more quickly. \n\nThe Biden administration beefed up the U.S. military presence there to help defend Israel from possible attacks by Iran and its proxies and to safeguard U.S. troops.","summary":"In a rare move, the U.S. is beefing up Navy warship presence in the Middle East, ordering two aircraft carriers to be there next month.","url":"https://timesofsandiego.com/military/2025/03/21/uss-carl-vinson-ordered-to-join-carrier-in-middle-east-delaying-return-to-san-diego/","image":"https://timesofsandiego.com/wp-content/uploads/2023/11/USS-Carl-Vinson.jpg","video":null,"publish_date":"2025-03-22 00:04:20","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.108},{"id":302821100,"title":"World News | Dialogue and Diplomacy: India Reaffirms Its Commitment to Finding Peaceful Resolution to Ukraine-Russia Conflict.","text":"New Delhi [India], March 22 (ANI): India reaffirmed its commitment to finding a peaceful resolution to the Ukraine-Russia conflict on Friday. In a weekly media briefing, the Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal said that India's position on the conflict is well-known and understood, emphasising the need for sincere and practical engagement between the two parties and other stakeholders through dialogue and diplomacy.\nAlso Read | 'F47 Will Be Most Lethal Aircraft Ever Built': Donald Trump Unveils F-47, America's Sixth-Generation Fighter Jets (See Pics and Video).\nWhen asked about comments made by Poland's Deputy Foreign Minister and Secretary of State, Wladyslaw Teofil Bartoszewski, who credited Prime Minister Modi with persuading Russian President Vladimir Putin not to use tactical nuclear weapons, Jaiswal said, \"Our position on the Ukraine-Russia conflict is well-known and understood as well. We have always advocated sincere and practical engagement between the two parties and other stakeholders and key stakeholders through dialogue and diplomacy to arrive at or find a lasting resolution to the conflict.\"\nIndia has been engaging in conversations with both Ukraine and Russia, as well as other stakeholders, to facilitate a lasting resolution to the conflict.\nAlso Read | 'Bangladesh Elections Will Be in December': Information Adviser Mahfuj Alam Urges All Parties To Prepare for Polls.\n\"Our conversations with the two parties to the conflict, as well as with other stakeholders, have been in keeping with this larger approach,\" he added.\nMeanwhile, while speaking to ANI, Poland's Deputy Foreign Minister said that Prime Minister Narendra Modi played a role in persuading Russian President Vladimir Putin not to use nuclear weapons against Ukraine.\nSpeaking to ANI, Bartoszewski stated that Putin had \"threatened\" to use tactical nuclear weapons on Ukrainian territory, but calls from India and China influenced his decision to reconsider.\n\"President Putin was threatening to use tactical nuclear weapons on the territory of Ukraine. The Americans sent lots of messages for him not to think about it... That didn't necessarily persuade him at first. He received two phone calls- one from the President of China, Xi Jinping, and one from PM Modi, telling him that neither China nor India independently approve of the war. When two major nations, which Russia consider to be friendly, said don't do it. He decided that it was not a good idea, so PM Narendra Modi played a role in it,\" Bartoszewski said.\nBartoszewski, along with several world leaders, is attending the Raisina Dialogue in New Delhi. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal, in a weekly media briefing, said that India's position on the conflict is well-known and understood, emphasising the need for sincere and practical engagement between the two parties and other stakeholders through dialogue and diplomacy.","url":"https://www.latestly.com/agency-news/world-news-dialogue-and-diplomacy-india-reaffirms-its-commitment-to-finding-peaceful-resolution-to-ukraine-russia-conflict-6726392.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250321173145.jpg","video":null,"publish_date":"2025-03-22 00:02:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.001},{"id":302823854,"title":"Edmonton statue of Oilers great Wayne Gretzky smeared with poop","text":"Lorne Thurston and Joseph McIntyre were planning to get an up-close look at the Wayne Gretzky statue in downtown Edmonton on Friday, when they realized it had been smeared with what appeared to be — and strongly smelled like — feces.\n\nWearing a white Oilers jersey, McIntyre was visiting from Nova Scotia and had hoped to get a photo with the Great One’s likeness.\n\n“Disappointing,” he said. “It shouldn’t have been done.”\n\nThurston, who hails from British Columbia, also said he was disheartened by the desecration.\n\n“I thought people had more class.” \n\n Tweet This\n Click to share quote on Twitter: \"I thought people had more class.\"\n\nThe pair were part of a group of friends who stopped to watch as an employee walked out of Rogers Place and wiped Gretzky’s face with a towel doused in cleaning product.\n\nThe statue, which stands outside the current home of the National Hockey League team, was first unveiled on the grounds of Northlands Coliseum in August 1989.\n\nIt was relocated in 2016 for the start of the Oilers’ inaugural season at the new Rogers Place arena.\n\nGretzky has recently drawn the ire of many in Canada for his public support of U.S. President Donald Trump, who has expressed his desire for Canada to join the U.S and become its 51st state.\n\nThe Ontario-born Gretzky’s ties to Edmonton are deep, as he led the Oilers to four Stanley Cup victories and set multiple scoring records that stand to this day. A trade in August 1988 sent him to Los Angeles.\n\nOff the ice, Gretzky and his wife, Janet, were married at St. Joseph’s Basilica in Edmonton in July 1988 in a lavish service that garnered global attention.\n\nHis accomplishments, much like the statue honouring his likeness, still resonate with hockey fans, like Juanita Taylor.\n\n“Why would someone want to do that?” said Taylor, standing with the group of friends at the statue.\n\n“(The statue) might not mean much to some people, but it means something to other people.”\n\nThe Oilers Entertainment Group said unfortunately, the arena area has not been immune to the disorder and other issues affecting the downtown core in recent years.\n\n“We have zero tolerance for vandalism of any kind within our District, especially one of our city’s most iconic landmarks that celebrates the career of Wayne Gretzky, the greatest hockey player to ever play the game, and his special connection with Oilers fans around the world.\n\n“We are currently investigating and will take the appropriate next steps as information becomes available.”\n\nA spokesperson for the Edmonton Police Service said it hadn’t been made aware of any vandalism.\n\n— With files from Karen Bartko, Global News","summary":"Wayne Gretzky has recently drawn the ire of many in Canada for his public support of U.S. President Donald Trump.","url":"https://globalnews.ca/news/11093349/wayne-gretzky-statue-vandalism/","image":"https://globalnews.ca/wp-content/uploads/2025/03/IMG_6816.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2025-03-22 00:01:26","author":"Karen Bartko","authors":["Karen Bartko"],"language":"en","source_country":"ca","sentiment":0.026},{"id":302815924,"title":"Trump to spend weekend in New Jersey instead of Florida","text":"March 21 (UPI) -- For the first time since he became president two months ago, Donald Trump traveled to New Jersey this weekend instead of his home in Palm Beach, Fla.\n\nOn Friday night, Air Force One flew to Morristown Municipal Airport and his motorcade then went to Trump National Golf Club in Bedminster, N.J., 45 miles from Manhattan.\n\nHe plans to stay there going to the NCAA wrestling championships in Philadelphia. He also attended the 2023 wrestling championships in Tulsa, Okla.\n\nTrump was at the Super Bowl in New Orleans on Feb. 9 and NASCAR's Daytona 500 in Daytona Beach, Fla., one week later.\n\nAlso, he visited North Carolina and California on Friday, Jan. 24, surveying storm and fire damage.\n\nThe last time Trump was at Bedminister was after the assassination attempt in Butler, Pa., on July 13, 2024.\n\nTrump has spent at least 18 nights in Florida, according to CNN. That is every weekend except when he stayed in Washington, D.C., to speak at the Conservative Political Action Conference.\n\nDuring his second presidency, Trump also has gone to his Doral golf resort.\n\nTrump usually doesn't go to his New Jersey Club until April when the Mar-a-Lago season ends for the summer. He has referred to the estate as his \"Winter White House\" before it gets hot and humid there.\n\nTrump announced his run for a second presidential term on Nov. 15, 2022.\n\nIn Trump's first year as president 2017, Trump did not travel to Bedminster until May.\n\nPeople in Palm Beach County usually get advance notice the president is coming there.\n\nThe Federal Aviation Administration Safety Team issues flight restrictions and the latest shows him in New Jersey from Friday through Sunday.\n\nBy not going to Palm Beach County, Secret Service and the Palm Beach County Sheriff's Office won't have to deal with security at the Palm Beach International Boat Show from Wednesday through Sunday. South Ocean Boulevard next to his club is closed when he is in town.\n\nEstates are in Bedminster and Palm Beach.\n\nThe 500-acre Bedminster property, including automaker John DeLorean's mansion, was sold in 2000 to a golf course developer and then to Trump for $35 million in 2002.\n\nThe property includes two 18-hole golf courses and a mansion built in 1939.\n\nTrum's first wife, Ivana, is buried in the Trump family cemetery there.\n\nTrump and his wife, Melania, became permanent Palm Beach residents in 2019 instead of New York City.\n\nDuring his first presidency, he hosted Japanese prime minister Shinzo Abe and Chinese president Xi Jinping.\n\nMar-a-Lago is where Trump housed classified documents, including in a showroom and a bathroom.\n\nTrump often criticized his predecessor, Joe Biden, for spending weekends at home in Delaware.","summary":"For the first time since he became president two months ago, Donald Trump traveled to New Jersey this weekend instead of his home in Palm Beach, Fla.","url":"https://www.upi.com/Top_News/US/2025/03/21/NJ-Trump-in-Bedminister-instead-Palm-Beach/2191742596413/","image":"https://cdnph.upi.com/ph/st/th/2191742596413/2025/upi/5dc0922ef314cfce455f6592bd1e8567/v1.2/Trump-to-spend-weekend-in-New-Jersey-instead-of-Florida.jpg","video":null,"publish_date":"2025-03-22 00:00:48","author":"Allen Cone","authors":["Allen Cone"],"language":"en","source_country":"US","sentiment":-0.002},{"id":302820976,"title":"Homeland Security revokes temporary status for 532,000 Cubans, Haitians, Nicaraguans and Venezuelans","text":"The Department of Homeland Security said Friday that it will revoke legal protections for hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans, setting them up for potential deportation in about a month.The order applies to about 532,000 people from the four countries who came to the United States since October 2022. They arrived with financial sponsors and were given two-year permits to live and work in the U.S. Homeland Security Secretary Kristi Noem said they will lose their legal status on April 24, or 30 days after the publication of the notice in the Federal Register.The new policy impacts people who are already in the U.S. and who came under the humanitarian parole program. It follows an earlier Trump administration decision to end what it called the “broad abuse” of the humanitarian parole, a long-standing legal tool presidents have used to allow people from countries where there’s war or political instability to enter and temporarily live in the U.S.During his campaign President Donald Trump promised to deport millions of people who are in the U.S. illegally, and as president he has been also ending legal pathways for immigrants to come to the U.S. and to stay.Before the new order, the beneficiaries of the program could stay in the U.S. until their parole expires, although the administration had stopped processing their applications for asylum, visas and other requests that might allow them to remain longer.The administration decision has already been challenged in federal courts.A group of American citizens and immigrants sued the Trump administration for ending humanitarian parole and seeks to reinstate the programs for the four nationalities.RELATED STORY | Immigrant rights activist taken into ICE custody in Colorado without warning, advocacy groups sayThe Biden administration allowed up to 30,000 people a month from the four countries to come to the United States for two years with eligibility to work. It persuaded Mexico to take back the same number from those countries because the U.S. could deport few, if any, to their homes.Cuba generally accepted about one deportation flight a month, while Venezuela and Nicaragua refused to take any. All three are U.S. adversaries.Haiti accepted many deportation flights, especially after a surge of migrants from the Caribbean country in the small border town of Del Rio, Texas, in 2021. But Haiti has been in constant turmoil, hampering U.S. efforts.Since late 2022, more than half a million people have come to the U.S. under the policy, also known as CHNV. It was a part of the Biden administration’s approach to encourage people to come through new legal channels while cracking down on those who crossed the border illegally.","summary":"The Department of Homeland Security said Friday that it will revoke legal protections for hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans.","url":"https://www.scrippsnews.com/politics/immigration/homeland-security-revokes-temporary-status-for-532-000-cubans-haitians-nicaraguans-and-venezuelans","image":"https://ewscripps.brightspotcdn.com/dims4/default/17daff8/2147483647/strip/true/crop/6000x3150+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F71%2F1f%2F0e4a702b437fb0eef33e91287c00%2Fap25076667160255.jpg","video":null,"publish_date":"2025-03-22 00:00:11","author":"AP via Scripps News","authors":["AP via Scripps News"],"language":"en","source_country":"us","sentiment":-0.234},{"id":302818336,"title":"Elon Musk's Loyal Supporters Furiously Defend Him After Bill Burr Jokes Billionaire 'Doesn't Know How to Talk to Hot Women' During Appearance on 'The View' — 'He's a Moron!'","text":"Fans of Elon Musk have rushed to defend the president's personal advisor after comedian Bill Burr's relentless attacks on recent talk shows. \n\nBurr has pulled no punches when discussing his opposition to Musk and Donald Trump.Burr is out promoting his role in the new Broadway revival of Glengarry Glen Ross, and stopped by to talk with the ladies on The View.\n\nDuring their chat, co-host Joy Behar asked: \"Is there anybody getting your ire up these days more than usual?\"\n\nTaking the bait, Burr answered: \"the nerds,\" adding, \"The nerds that own the politicians. All these tech nerds that want to build robots because they don’t know how to talk to hot women.\n\n\"They’re going to take over the world. They are literally going to replace us. We’re like Beta right now and they’re coming out with the VCR.\"Online, Musk's supporters jumped to defend the Tesla founder, pointing out last month author Ashley St. Clair revealed on X that she gave birth to Musk's 13th child. He's since revealed a 14th child.\n\nOne person on X singled out Burr: \"He's a moron,\" while another asked: \"Why is he so obsessed with Elon?\"\n\nAnother person pointed out: \"Sure, he’s a weird nerd but, the man has like 15 kids. I don’t think he’s having any issues talking to women.\"\n\nWhile a fourth added: \"Elon has more Rizz on a bad day than Burr has on the best day of his life.\"\n\nOthers went for a more personal insult, singling out Burr's wife Nia Renee Hill. The comedian has been married to the 46-year-old since 2013.\n\nOne person insulted: \"Has Billy Boy ever been with an attractive woman? Not likely, just Google his wife,\" as another tacked on: \"I'm sorry but a guy with a wife like his has no place to say anyone struggles to talk to beautiful women.\"\n\nA third insisted: \"Look at Bill's wife compared to the women Elon has kids with. I rest my case.\"This isn't the first time Burr – and his wife – have gone after Trump and his team. Two years ago, Hill was photographed flipping off the president at a UFC fight in New York.\n\nBurr later sneered at how devoted MAGA supporters were furious at the gesture on The Rich Eisen Show, arguing that Trump devotees can't take a dose of their own medicine.\n\n\"Those Trump guys — they're always going, 'Ah, f--- your feelings,' and all of that,\" he reasoned. \"And then you make fun of Trump, they're like, 'Oh my God, it's so disrespectful!' You're saying, 'f--- Joe Biden!' It's like, you can't have it both ways!\"The Old Dads star continued: \"The guy walked in the arena, everybody cheered. She gave him the finger. Nobody got arrested. That's why this country's great. Everybody expressed themselves. \n\n\"Can we all be adults? I mean, I don't know about you, but I came here to go to the fights. I didn't know I was going to the Republican National Convention.\"\n\nBurr later jokingly compared the way Trump thanked the crowd to \"when OJ Simpson got acquitted.\" \n\nDuring the interview, it was noted that Burr's wife had given Trump not one, but two middle fingers, which he got a chuckle out of while agreeing before adding that \"she's hilarious.\"","summary":"Comedian Bill Burr has felt the wrath of Elon Musk's supporters after he criticized the Tesla billionaire and his behavior around 'hot women.'","url":"https://radaronline.com/p/elon-musk-supporters-defend-billionaire-hot-women-bill-burr-the-view/","image":"https://media.radaronline.com/brand-img/5bQMxH7Ub/0x0/bill-burr-elon-musk-1742595335929.jpg","video":null,"publish_date":"2025-03-22 00:00:00","author":"Daniel Gura","authors":["Daniel Gura"],"language":"en","source_country":"us","sentiment":0.085},{"id":302822604,"title":"Is the U.S. Headed For a Dictatorship, Trump's Gold and Gaudy Oval Office Additions, Decoding Michelle Obama's Speech, White Woman on TikTok Begs For Segregation Push, Judges and Politicians Not Backing Down From Trump and Other Political News of the Week","text":"White Woman on Tiktok Begs White Folks to Fight Trump’s Segregation Push, But Black People’s Response Will Surprise You... If You’re White\n\nAs the Trump administration continues its “anti-woke” agenda, it recently announced that it would roll back a clause in the Federal Acquisition Regulation (which is used to write Federal contracts) that prohibits Federal contractors from having segregated restaurants, waiting rooms and drinking fountains. The news should be shocking to everyone –except the 8 in 10 Black voters who came out in support of Vice President Kamala Harris in the 2024 Presidential election. Now, a white woman who acknowledges that Black people have more than done their part is calling on her fellow white people to get involved. - Angela Johnson Read More\n\nAs Her Battle With Brain Cancer Comes to an End, the First Black Republican Woman Elected to Congress Shares Her Living Wish With the World\n\nFormer Utah Congresswoman Mia Love first shared the news that she was battling a malignant brain tumor in May of 2024. Now, less than a year after that terrible diagnosis, her family just provided her friends a loved ones a heartbreaking update. - Angela Johnson Read More\n\nIs The US Headed For a Dictatorship? Trump’s Ex-White House Strategist Explains the Terrifying Reason Why It’s Likely\n\nAll U.S. presidents are limited to two terms in office by the Constitution, according to the 22nd Amendment. The amendment was put in place to prevent any American president from becoming too powerful. - Angela Wilson Read More\n\nSee All Trump’s Gold and Gaudy New Additions to the Oval Office\n\nLast time President Donald Trump was in office, he made some serious changes to the White House including the removal of the Obamas’ portraits from alongside the previous presidents and first ladies. - Kalyn Womack Read More\n\nDon Lemon’s Comments About ‘Black MAGA’ Stirred Up A Nasty Fight Between D.L. Hughley And Black Republican Wesley Hunt\n\nDon Lemon has started a feud. After making some heated comments about Black Donald Trump supporters, Rep. Wesley Hunt and D.L. Hughley have gone to war over how Black MAGA supporters should be viewed. - Noah A. McGee Read More\n\nJudges, Politicians Who Aren’t Backing Down from Trump and Talks of Dictatorship\n\nWith all the talks about dictatorship and ongoing fears about President Donald Trump’s administration, there are still many political leaders who refuse to let the president slide. In fact, Trump and his administration have been sued over 100 times, proving that folks simply aren’t happy with his efforts to reshape the government. - Phenix S Halley Read More\n\nDecoding Michelle Obama’s Speech, Which Perfectly Predicted Trump’s Destructive Actions\n\nDuring former Vice President Kamala Harris’ presidential campaign, a number of big names and political officials came onto the stage to help her gather votes. However, when former First Lady Michelle Obama grabbed the mic, she also took that moment to serve a chilling warning of what a second Trump presidency would look like. - Kalyn Womack Read More","summary":"As the Trump administration continues its “anti-woke” agenda, it  recently announced that it would roll back a clause in the Federal Acquisition Regulation (which is used to write Federal contracts) that prohibits Federal contractors from having segregated restaurants, waiting rooms and drinking fountains. The news…\n\nRead more...","url":"https://www.theroot.com/is-the-u-s-headed-for-a-dictatorship-trumps-gold-and-1851771607","image":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/7012437c60c0c882d55f2e9ff15975d9.jpg","video":null,"publish_date":"2025-03-22 00:00:00","author":"The Root Bot","authors":["The Root Bot"],"language":"en","category":"politics","source_country":"US","sentiment":-0.013},{"id":302815934,"title":"Columbia caves to Trump's policy demands in fear of losing $400M in federal funds after anti-Israel protests","text":"Columbia caves to Trump's policy demands in fear of losing $400M in federal funds after anti-Israel protests\n\nPODCAST: All the latest headlines, including Trump’s bold move to void Biden’s pardons and Gavin Newsom’s unexpected statue plans\n\nBy STEPHEN M. LEPORE FOR DAILYMAIL.COM\n\nPublished: 23:04 GMT, 21 March 2025 | Updated: 23:56 GMT, 21 March 2025\n\nColumbia University has agreed to meet Donald Trump's demands for several policy changes after he threatened to take away $400 million in government grants from the Ivy League institution. \n\nThe Trump administration pulled the grants and other federal funding and had threatened to cut more, over the university's handling of rampant protests against Israel. \n\nThose protests led to the detaining of activist Columbia grad student Mahmoud Khalil by ICE, 30, a legal resident in the US, for his role in the demonstrations. \n\nThe changes, detailed in a letter sent by the university's interim president, Katrina Armstrong, came one week after the Trump administration ordered the Ivy League school to enact reforms or lose all federal funding.\n\nIn her letter, Armstrong said the university would immediately appoint a senior vice provost to conduct a thorough review of the portfolio of its regional studies programs, 'starting immediately with the Middle East.'\n\nColumbia will also revamp its long-standing disciplinary process and bar protests inside academic buildings. Students will not be permitted to wear face masks on campus 'for the purposes of concealing one´s identity.' \n\nAn exception would be made for people wearing them for health reasons.\n\nIn an effort to expand 'intellectual diversity' within the university, Columbia will also appoint new faculty members to its Institute for Israel and Jewish Studies department. \n\nColumbia University has agreed to meet Donald Trump's demands for several policy changes after he threatened to take away $400 million in government grants from the Ivy League institution\n\nThe administration pulled the grants and other federal funding and had threatened to cut more, over the university's handling of protests against Israel's war against Hamas\n\nIt will also adopt a new definition of antisemitism and expand programming in its Tel Aviv Center, a research hub based in Israel.\n\nThe White House has labeled the protests antisemitic, a label rejected by those who participated in the student-led demonstrations.\n\nA message seeking comment was left with a spokesperson for the Education Department.\n\nAs a 'precondition' for restoring funding, federal officials demanded that the university to place its Middle Eastern, South Asian and African Studies Department under 'academic receivership for a minimum of five years.'\n\nThey also told the university to ban masks on campus, adopt a new definition of antisemitism, abolish its current process for disciplining students and deliver a plan to 'reform undergraduate admissions, international recruiting, and graduate admissions practices.'\n\nHistorians had described the order as an unprecedented intrusion on university rights long treated by the Supreme Court as an extension of the First Amendment.\n\nOn Friday, freedom of speech advocates immediately decried Columbia's decision to acquiesce.\n\n'A sad day for Columbia and for our democracy,' Jameel Jaffer, the director of Knight First Amendment Institute at Columbia University, said in a social media post.\n\nThose protests led to the detaining of activist Columbia grad student Mahmoud Khalil , 30, a legal resident in the US, for his role in the demonstrations \n\nThe changes, detailed in a letter sent by the university's interim president, Katrina Armstrong, came one week after the Trump administration ordered the Ivy League school to enact those and other reforms or lose all federal funding\n\nThe president launched the dramatic move 'due to the school’s continued inaction in the face of persistent harassment of Jewish students,' his administration said.\n\nIt represents only a first round of canceled funds and additional cuts are expected. \n\nTrump's Education Secretary Linda McMahon said: 'Since October 7, Jewish students have faced relentless violence, intimidation, and anti-Semitic harassment on their campuses – only to be ignored by those who are supposed to protect them.\n\n'Universities must comply with all federal anti-discrimination laws if they are going to receive federal funding.'\n\nThe announcement coincided with recent anti-Israel campus protests at Barnard College, which Trump aggressively condemned. \n\n'Agitators will be imprisoned/or permanently sent back to the country from which they came. American students will be permanently expelled or, depending on the crime, arrested. NO MASKS!' he stated on social media.\n\nTrump officials said the Joint Task Force to Combat Anti-Semitism will continue to review and coordinate with other federal agencies to move swiftly. \n\nThat group is made up of officials at the Justice Department, Education Department, Department of Heath and Human Services and U.S. General Services Administration (GSA).\n\nColumbia, located in New York City, 'abandoned (their) obligation to Jewish students studying on its campus,' officials said. \n\nSince the horrific attack, anti-Israel protests have sprung up across the nation, including most recently at Columbia University and Barnard College in Manhattan—a university hotbed of pro-Gaza activism. \n\nState Department officials also shared that they will soon review foreign student visa holders who were arrested though allowed to stay in the country. \n\nThis AI-enabled review will also look for clues in news articles about the protests which have been on and off for the past year and a half.\n\nAlready officials have reviewed 100,000 individuals in the Student Exchange Visitor System.\n\nHamasColumbia UniversityDonald Trump\n\nShare or comment on this article:\nColumbia caves to Trump's policy demands in fear of losing $400M in federal funds after anti-Israel protests\n\nAdd comment","summary":"Columbia University has agreed to meet Donald Trump's demands for several policy changes after he threatened to take away $400 million in government grants from the Ivy League institution.","url":"https://www.dailymail.co.uk/news/article-14525195/columbia-university-trump-policy-changes-federal-funds-anti-israel-protests.html","image":"https://i.dailymail.co.uk/1s/2025/03/21/22/96453957-0-image-a-9_1742597707117.jpg","video":null,"publish_date":"2025-03-21 23:56:16","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":0.183},{"id":302817298,"title":"B.C. NDP government secrecy extended to its own Sunshine Coast candidate","text":"Randene Neill, the new NDP MLA for Powell River-Sunshine Coast and the minister for water, land and resource stewardship. Photo by B.C. NDPArticle contentVICTORIA — The New Democrats finally got around this week to providing a public information session for Sunshine Coast residents on the far-reaching agreement the government signed in secret with the shishalh Nation last August.Article contentArticle contentThe terms included payments of $104 million over five years, the transfer of six square kilometres of public land, and strengthened commitments to negotiate aboriginal title and exclusive jurisdiction for the Indigenous nation.Article contentAdvertisement 1Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentThursday’s online session began with an admission by Randene Neill, the new NDP MLA for Powell River-Sunshine Coast and the minister for water, land and resource stewardship.Article contentInformed OpinionA daily roundup of Opinion pieces from the Sun and beyond.By signing up you consent to receive the above newsletter from Postmedia Network Inc.Thanks for signing up!A welcome email is on its way. If you don't see it, please check your junk folder.The next issue of Informed Opinion will soon be in your inbox.We encountered an issue signing you up. Please try againInterested in more newsletters? Browse here.Article contentNeill answered a question her constituents have been asking since the terms were made public on Jan. 29, namely whether she was aware of the agreement before she was elected as MLA.Article content“I was not aware of the agreement when I was a candidate,” said Neill, who won by a comfortable margin in October.Article contentShe only learned the details when appointed to cabinet. Her ministry is one of those in charge of implementing the amended foundation agreement, as it is known.Article contentThe belated discovery caused Neill some political embarrassment. She lives in Pender Harbour and last month the local residents’ association called on her to account for the coverup and explain whether she’d known the terms in advance.Article contentDuring Thursday’s information session, Neill acknowledged how the government-imposed secrecy on its dealings with the Indigenous nation had raised suspicions.Article contentAdvertisement 2Story continues belowThis advertisement has not loaded yet, but your article continues below.Sign In or Create an Accountor View more offersArticle content“There was mistrust in our community because of this plan,” she told the online audience of 300. “One reason why I got into politics included the feeling that you haven’t been heard.”Article contentStories You May Like Scrapping carbon tax might make life more unaffordable, advocates say Donald Trump says U.S. doesn't need Canadian lumber. Here's why that's not true Advertisement embed-more-topicStory continues belowThis advertisement has not loaded yet, but your article continues below.Article contentNeill was a reporter and anchor for Global TV – and a good one – before going into communications, then politics.Article contentHer candor had me thinking that she’d just gained a first-hand lesson about what it is really like to work for a secretive, controlling government. While she was kept in the dark, I have no doubt the premier’s office knew all about the agreement.Article contentThe fallout continued in a briefing from Tom McCarthy, deputy minister and the senior public servant for Indigenous relations and reconciliation. It is the lead ministry in negotiating the agreement and a partner with Neill’s ministry in implementing the terms.Article contentMcCarthy addressed another question that has dogged the government since the agreement was made public, namely why the terms were not disclosed before the election.","summary":"Vaughn Palmer: This government needs to be watched closely for its habit of burying anything that could become controversial","url":"https://vancouversun.com/opinion/columnists/bc-ndp-government-secrecy-extended-to-its-own-sunshine-coast-candidate","image":"https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/54003660107_94c2a595e1_o_294550606.jpg","video":null,"publish_date":"2025-03-21 23:54:04","author":"Massey Padgham,Vaughn Palmer","authors":["Massey Padgham","Vaughn Palmer"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.066},{"id":302819198,"title":"NYT writer says Dems are 'getting destroyed' as data show Gen Z 'most conservative' generation in decades","text":"New York Times columnist Ezra Klein spoke with a Democratic pollster Tuesday about how the dream of an ascendant Democratic majority is imploding as younger voters, especially White men, flee the party. Klein interviewed David Shor, the head of data science at Blue Rose Research, a Democratic polling firm, for his podcast in an episode titled \"Democrats Need to Face Why Trump Won.\" When Klein and Shor reviewed numerous charts, including one headlined, \"2024 Democratic Support by Age – Split by Race and Gender,\" the pollster explained that in this chart in particular, \"One thing you can notice is that among 18-year-olds, women of color are the only of the four [race and gender demographic groups] that Harris won. Trump narrowly won nonwhite men.\" The Times columnist seized on one \"shocking\" finding in the data that defies one of the Democratic Party’s core beliefs. JOURNALIST TELLS CNN THE DEMOCRATS' ADVANTAGE WITH YOUNG MEN IS ‘COMPLETELY GONE’ \"I find this part of this chart shocking. I sometimes talk about narrative violations, and if we knew anything about Donald Trump eight years ago, it was that young people didn’t like him. And Republicans had been maybe throwing away young people for generations in order to run up their margins among seniors,\" Klein said. \"But if you look at this chart, 75-year-old White men supported Kamala Harris at a significantly higher rate than 20-year-old White men.\" \"It is a real shift,\" Shor agreed. \"This is the thing I am the most shocked by in the last four years — that young people have gone from being the most progressive generation since the Baby Boomers, and maybe even in some ways more so, to becoming potentially the most conservative generation that we’ve experienced maybe in 50 to 60 years.\" The data expert went on to discuss what he called \"the scariest chart in this entire presentation,\" which shows the massive and historically unusual polarization between young men and women. \"What’s crazy is that if you look at people under the age of 30, the gender gap has exploded. Eighteen-year-old men were 23 percentage points more likely to support Donald Trump than 18-year-old women, which is just completely unprecedented in American politics,\" Shor said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE While he argued it is still too early to explain exactly why, Shor observed there are similar patterns in countries like Canada, the U.K., and Norway. \"There’s a lot of research to do here, but it’s still very striking,\" Shor said. \"It’s similar to how a lot of people talk about the Democratic young men problem — and it’s still somehow underrated, because the actual numbers are just a lot worse than people think.\" Klein noted numerous factors at play in recent years, ranging from the #MeToo movement and the rise of the Manosphere, to how \"there’s a sense the Democratic Party is becoming much more a pro-women party and in some ways, sort of anti-young men. And that, in turn, had a huge effect on young men’s political opinions.\" Shor responded by stressing again that \"this seems to be a global phenomenon,\" saying he seeks to focus on the \"broader cultural shifts.\" After discussing a theory that part of the polarization may be driven by how men and women are interacting with wildly different content on social media, Klein spoke again about how Democratic narratives about an ascendant majority from younger generations have fallen apart. CLICK HERE TO GET THE FOX NEWS APP \"Democrats are getting destroyed now among young voters. I do think that, even as the idea of the rising demographic Democratic majority became a little discredited in 2016 and 2020, Democrats believed that these young voters were eventually going to save them,\" he said. \"They thought that this was a last gasp of something and that if Donald Trump couldn’t run up his numbers among seniors and you had Millennials and Gen Z really coming into voting power, that would be the end of this Republican Party. That is just completely false, and it might be the beginning of this Republican Party,\" Klein added. \"I have to admit, I was one of those liberals four years ago, and it seems I was wrong,\" Shor replied. \"The future has a way of surprising us.\"","summary":"NYT columnist Ezra Klein spoke with Democratic pollster David Shor about how the youth voted has shifted radically in a piece headlined, “Democrats Need to Face Why Trump Won.&quot;","url":"https://www.foxnews.com/media/nyt-writer-says-dems-getting-destroyed-data-show-gen-z-most-conservative-generation-decades","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/ezra-klein-on-podcast.png?ve=1&tl=1","video":null,"publish_date":"2025-03-21 23:51:17","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.205},{"id":302819200,"title":"Trump excited to attend NCAA Wrestling Championships: 'We're going to the big fight'","text":"President Donald Trump on Friday spoke about going to the NCAA Wrestling Championships on Saturday. Trump told reporters outside the White House that he is headed to Philadelphia to attend the final rounds of the tournament, as Penn State looks to close out the championship with a substantial lead of 90.5 over second-place Nebraska at 62.5 and third-place Oklahoma at 61.0. \"We're going to the big fight. The reason I'm going is in Philadelphia. They have the NCAA, world, wrestling for college. And I've always supported the wrestlers,\" Trump said. \"So I want to support them. These are the great college wrestlers from the various schools. I think Penn State is leading, and Nebraska is in second place right now. And a lot of good things.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM OutKick co-founder Clay Travis broke the news that Trump would attend the event on Tuesday when he said in an X post that he would be traveling \"with\" the president on \"Air Force One\" to the championships. The White House confirmed Friday that Trump would attend the event. House Judiciary Committee Chairman Jim Jordan, R-Ohio, is also reportedly joining Trump in Philadelphia, a source familiar with his plans told Fox News Digital. Jordan himself was a noted wrestling champion during his time in high school and at the University of Wisconsin-Madison, where he won the NCAA Division I men's wrestling title twice. He was later an assistant coach at Ohio State University's wrestling program from 1987 to 1995. LA TIMES WRITERS SUGGEST WORLD SERIES CHAMPION DODGERS SHOULD SKIP WHITE HOUSE VISIT: 'THANKS, BUT NO' Sen. Dave McCormick, R-Pa., will also be tagging along. McCormick previously confirmed that Trump would be in attendance at the event in the senator's home state of Pennsylvania. \"I’m thrilled to be in Philadelphia this weekend with [Trump] for the [NCAA Wrestling] Championship,\" McCormick wrote on X. \"I grew up wrestling in small towns across PA and at West Point. It taught me grit, resilience, and hard work.\" CLICK HERE TO GET THE FOX NEWS APP The wrestling championships are making their return to Philadelphia's Wells Fargo Center for the first time since 2011, when Penn State took advantage of being in their home state and won it all. That kicked off a dominant run by the Nittany Lions that is still going — they've won eight of the last 11 of the last 13 titles, including each of the last three. With a win on Saturday, it would be their third four-peat in that stretch. Fox News Digital's Elizabeth Elkind contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"President Donald Trump on Friday spoke about going to the NCAA Wrestling Championships, saying &quot;We&apos;re going to the big fight,&quot; as he will watch Penn State try to win another title on Saturday.","url":"https://www.foxnews.com/sports/trump-excited-attend-ncaa-wrestling-championships-were-going-big-fight","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2020/12/931/523/AP20334644546013-e1606925054815.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-21 23:50:42","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":0.18},{"id":302814948,"title":"Teacher from South Florida seeking asylum deported to Honduras","text":"From the small living room, in a house tucked away in a tiny and remote Honduran village, Wualner Sauceda recalled what it was like to be deported from the United States. \n\nSauceda, 24, was a rookie science teacher at Palms Spring Middle School in Hialeah, a city in South Florida, when he was detained in early January and deported a month later.\n\n“I applied for asylum and that application process took several years,” Sauceda said. \n\nHis asylum application was eventually denied, and his appeal didn’t go anywhere, he told NBC6 in Miami during an exclusive two-part interview.\n\nSo he was looking for other legal pathways to remain in the country. \n\nGiven his unresolved immigration status, Sauceda had to check in with immigration officials. \n\nPrevious appointments were uneventful, and officials would typically issue a follow-up appointment. \n\nOn Jan. 7, he missed school to go to his appointment at the Miramar immigration office in South Florida. This time, he said, something felt different. \n\n“I got there at 8 a.m., and I noticed it was 1 p.m. and then 2 p.m. and then 3 p.m.,” Sauceda said. \n\nHe was then told to park his car inside the lot. And once inside the government building, he asked officers what was going on.\n\n“They told me, ‘you’re detained’,” said Sauceda, who added it was such a shocking blow that he couldn’t tell his parents. Instead, he called an uncle so he could break the news to the rest of the family. \n\n“Emotionally, it was hard for me,” he said. \n\nSauceda now lives with his uncle and maternal grandparents in a rural area three hours northeast of Tegucigalpa, the Honduran capital. Surrounded by dirt roads and mountainous terrain, the family relies partly on what they grow and farm animals they raise.\n\nUnlike the United States, most if not all homes in that area, lack running water or air conditioning. \n\nA nearby river is their source for water. They use it to bathe and wash. Their drinking water comes from a well. \n\nDespite growing up in that setting until he was 13, Sauceda had become used to the comforts of South Florida. \n\n“I was born here,”in Honduras, said Sauceda, who added that he and his cousin fled their native country after a close relative had been killed. Migrating to the U.S as a teen remains a vivid memory. \n\n“I remember crossing…the river,” he recalled, and he eventually reunited with his parents, who were already in South Florida. \n\nHe enrolled at Henry H. Filer Middle School in Hialeah for 8th grade, then attended Westland Hialeah Senior High School. \n\nOf his early school days, Sauceda said, “I felt that I can do things that I never thought I could do.” He quickly learned English, and by senior year, he was taking advanced courses. \n\n“I remember taking honors English for seniors, honors pre-calculus and honors history, and that was something that I really liked because I went from ESOL level 1 to ESOL level 4,” he proudly remembered. \n\nDespite his pending immigration case, he had aspirations for more. \n\n“I knew that I wanted to be a teacher since I was a kid,” Sauceda remembered fondly. \n\nAt first, he thought he could be a math teacher, but eventually settled on science and started his college career at Miami-Dade College. \n\nFinancially though, college was draining because without a work permit, he couldn’t work, and finding scholarship money for undocumented students was tough. \n\nBut he found TheDream.us — an organization that claims to have provided more than 10,000 scholarships to undocumented students. \n\nSauceda applied to Florida International University and the University of Central Florida, and got accepted to both, but chose to go to FIU to be closer to his family. \n\nIn December 2023, Sauceda graduated with a 3.4 grade point average and a bachelor’s in chemistry with a track in education. \n\n“This is my diploma from FIU,” he showed with excitement and pride. “I got even happier when I received my teaching certificate.”\n\nA month after graduation, he was able to secure a job as a teacher at Miami-Dade Public Schools. \n\n“I was a little bit scared because I was not a U.S. citizen and not a permanent resident, but I did have a social security, so that’s how I applied for teacher’s certificate,” he told NBC6. \n\nIt was a constant fear not just with work, but with life in general and perhaps foreshadowing what was to come. \n\nAfter being detained, he was then transferred to the Broward Transitional Center, a Pompano Beach facility where migrants are held. Sauceda estimates he was at the facility for more than 20 days. \n\nHis attorney, Ivan Torres Hidalgo Gato, filed for deferred action, but Sauceda said nothing worked. \n\nNBC6 contacted Hidalgo Gato with the intention of learning the details of Sauceda’s case, but he told us he was not interested in providing any insight into the Sauceda case. \n\nSauceda said he’ll never forget what an immigration officer told him while he was detained. \n\n“He literally said that he was told to start putting people on that plane,” said Sauceda.\n\nHe was initially detained during the administration of President Joe Biden, but deported on Feb. 6, shortly after President Donald Trump took office.\n\nSauceda recalled being transported to a facility in Louisiana, which he described as a horrible experience. He said the rooms were over capacity, with 60 people in a room made for 24 detainees.\n\n“I remember people moving the mattresses to the floor, and I was sleeping on the pure metal of the bed,” Sauceda added. “But during the day, the room would be really, really hot, and then during the night, it would be really, really cold, and I don’t know if they did that on purpose, but it was really bad.”\n\nSauceda recalled he was shackled by his hands, waist and feet before being placed in a deportation flight to Honduras.\n\n“It was shocking to me because I have never experienced anything like that,” he said. “Sometimes I think about it and it saddens my heart,” Sauceda said, stoic but certainly with emotion. \n\nNBC6 in Miami will air two additional interviews next week as part of their four-part series reporting on Sauceda’s case.\n\nA version of this story was first published on NBCMiami.com.","summary":"Internewscast Journal\n\nInternewscast\n\n\nFrom the small living room, in a house tucked away in a&#8230;\n\n\nThis Post: Teacher from South Florida seeking asylum deported to Honduras first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/teacher-from-south-florida-seeking-asylum-deported-to-honduras/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2025-03/250321-WTVJ-ch-1705-ff974a.jpg","video":null,"publish_date":"2025-03-21 23:49:58","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.237},{"id":302818106,"title":"Ex-GOP Rep torches Bill Maher for hinting at sitdown with Trump","text":"Remember when Bill Maher called Donald Trump an orangutan and was hit with a lawsuit by an overly sensitive and litigious guy in orange makeup? \n\nRemember when Maher mocked president and candidate Trump (and his family) with nearly every breath? \n\nRemember when he harped on the corruption and incompetence and sounded the air-raid siren every week on his HBO show, Real Time with Bill Maher?\n\nRemember when Maher gave a million dollars to the Democrats to fight for Senate control during Trump’s first administration — because legislatively checkmating the mad king was crucial to the future of U.S. democracy?\n\nRemember when Maher predicted that Trump wouldn’t leave the White House without a fight, then spent the four years after the insurrection telling us, “I told you so”?\n\nGood times, right?\n\nWell, they’re over.\n\nMaher — with MAGA consigliere Kid Rock brokering the most unlikely peace summit since Vito Corleone met with his son’s assassins in The Godfather ... and we know how that turned out — said he plans to meet with Trump at the White House.\n\nEven this is a bridge too far for former Republican Rep. Joe Walsh, who spent the final weeks of the presidential campaign listening to Trump supporters and trying to pull them to Kamala Harris.\n\nWalsh excoriated Maher on Twitter on Friday after the upcoming meeting was reported:\n\n“I respect Bill Maher, and my whole mantra is sitting down with anyone, but this is a bullshit business move by Maher,” Walsh wrote. “I would never sit down with Trump. \n\n“Trump is purposely ignorant and cruel, he lies as he breathes, and he tried to overthrow an American election. Trump is our democracy’s enemy. Bill Maher deserves ZERO props for meeting with Trump. In fact, those of you who love our democracy should condemn Bill Maher. \n\n“Because by sitting down with Trump, Maher is only normalizing Trump and helping Trump politically. \n\n“And f--k you, Bill Maher by calling those of us who criticize you for doing this as ‘mean girls.’ I’ll sit down with any Trump supporter. Sitting down with Trump is completely different. And you know it. But you’re trying to score points here. \n\n“And by the way, shame on you, Bill Maher, for taking an ugly cheap shot at Zelensky by saying that, unlike Zelensky, you’ll ‘wear a suit when you meet with Trump.’ Hey, Bill, lead a country that’s been invaded, a country at war, a country that’s already lost tens of thousands of its men and had tens of thousands of its children abducted, and then criticize Zelensky for not wearing a suit. \n\n“And by the way, Bill, Trump stands with Putin, the evil dictator who invaded Ukraine and stands against freedom, sovereignty, and the free world. Why don’t you ask him about that while you’re enjoying your steak with him?‘”\n\nMaher — following MSNBC’s Joe Scarborough and Mika Brzezinski’s kiss-up example — knows criticism like Walsh’s is coming. After all, Morning Joe’s ratings still haven’t recovered from the pow-wow they kept secret, then were roasted for, even by regular guests of their show. \n\nMaher (should we reveal that he comes from New Jersey?) doesn’t care. He predicts liberals will be angry about the meeting with Trump, but so what?\n\n“And there will be lots of people on the left who will be like, ‘How dare you talk to this man.’ It’s, like, f— you, I’m not playing this game that you mean girls play,” Maher said. “‘Oh, you know what? You can’t sit at my lunch table, because I’m just not talking to you.’ Not talking to you? You lost the election. Who the f— do you think you have to talk to?”\n\nOur journalism needs your support. Please subscribe today to NJ.com.","summary":"He adds: \"And [bleep] you, Bill Maher\" for criticizing those of us against it","url":"https://www.nj.com/politics/2025/03/ex-gop-rep-torches-bill-maher-for-agreeing-to-meet-with-trump.html","image":"https://www.nj.com/resizer/v2/N72EFUO2I5A5PKGQ4WNP55CRJU.jpg?auth=4c2b5eb7ee833d3e224fb747b26cc422ee5cf8f00af6479f1cfae7380dcc2b5f&width=1280&quality=90","video":null,"publish_date":"2025-03-21 23:49:47","author":"Kevin Manahan","authors":["Kevin Manahan"],"language":"en","source_country":"us","sentiment":-0.324},{"id":302822250,"title":"Trump administration lays off employees from three DHS offices deemed ‘internal adversaries’","text":"“These offices have obstructed immigration enforcement by adding bureaucratic hurdles and undermining DHS’s mission,” a DHS spokeswoman said in a statement to the Washington Examiner. “Rather than supporting law enforcement efforts, they often function as internal adversaries that slow down operations.”\n\n“DHS remains committed to civil rights protections but must streamline oversight to remove roadblocks to enforcement. These reductions ensure taxpayer dollars support the Department’s core mission: border security and immigration enforcement,” she added.\n\nThe three offices are dedicated to investigating the claims of migrants and their families.\n\nPresident Donald Trump’s promised sweeping immigration reforms have been repeatedly hindered by legal challenges and other hurdles, much to his frustration. While border crossings have all but ceased, his mass deportation plan has been more difficult to implement due to legal challenges.\n\nJUDGE WHO BLOCKED DEPORTATION FLIGHTS ‘DEFIES LOGIC’: TOM HOMAN\n\nThe gutting of the three internal DHS offices will likely stall some legal efforts, although many challenges are already underway.\n\nJudge James Boasberg of the U.S. District Court for the District of Columbia is one of the most recent hinderers of Trump’s deportation plans after he blocked deportation flights while immigrants’s cases were being examined.","summary":"The Trump administration laid off employees from three internal Department of Homeland Security offices, accusing them of obstructing immigration enforcement. The &#8220;Reduction in Force&#8221; applied to the Office for Civil Rights and Civil Liberties, the Office of the Immigration Detention Ombudsman, and the Office of the Citizenship and Immigration Services Ombudsman. &#8220;These offices have obstructed [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3355925/trump-administration-lays-off-employees-dhs-office/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/Homeland-Security-department-aa3.webp","video":null,"publish_date":"2025-03-21 23:48:54","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.531},{"id":302821098,"title":"World News | Woman Drowns Her Dog in Airport Bathroom After Being Denied Boarding, Police Say","text":"Orlando (Florida), Mar 22 (AP) A woman drowned her dog in a Florida airport bathroom and then boarded her international flight after she was prevented from bringing the white miniature schnauzer with her because of a paperwork issue, authorities said. The woman was arrested in Lake County on Wednesday on a charge of aggravated animal abuse, a third-degree felony. She was released on USD 5,000 bail. Also Read | 'F47 Will Be Most Lethal Aircraft Ever Built': Donald Trump Unveils F-47, America's Sixth-Generation Fighter Jets (See Pics and Video). “This act was intentional and resulted in a cruel and unnecessary death of the animal,” said an arrest affidavit from the Orlando Police Department. Online court records showed no attorney listed for the woman from Kenner, Louisiana. Also Read | 'Bangladesh Elections Will Be in December': Information Adviser Mahfuj Alam Urges All Parties To Prepare for Polls. The investigation into the death of the 9-year-old schnauzer named Tywinn started in December when a janitor found the dog in a trash bag in a bathroom stall at Orlando International Airport. The janitor earlier had seen the woman in the stall cleaning up water and dog food from the stall's floor. The janitor was pulled away for a cleanup emergency and returned to the bathroom 20 minutes later where she found Tywinn in the trash container, along with a companion vest, collar, rabies tag, a dog travel bag and a bone-shaped dog tag with the woman's name and phone number, investigators said. Airport surveillance cameras captured the woman speaking for 15 minutes to a Latam Airlines agent with the dog in tow, walking into a bathroom near the ticketing area with the dog and exiting the bathroom without Tywinn less than 20 minutes later. The woman then went outside the terminal building, reentered a short time later, passed through security and boarded the Colombia-bound plane, the report said. Authorities said the woman had been told she could not bring her dog aboard because she did not have the proper paperwork. According to the US Department of Agriculture, dogs travelling from the US to Colombia must be accompanied by a veterinarian-issued health certificate and a rabies vaccination certificate. The dog was identified by its implanted microchip and a necropsy determined that Tywinn had been drowned. US Customs and Border Protection also confirmed to detectives that the woman had boarded a flight to Bogota, Colombia, and then flew to Ecuador. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   A woman drowned her dog in a Florida airport bathroom and then boarded her international flight after she was prevented from bringing the white miniature schnauzer with her because of a paperwork issue, authorities said.","url":"https://www.latestly.com/agency-news/world-news-woman-drowns-her-dog-in-airport-bathroom-after-being-denied-boarding-police-say-6726389.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-03-21 23:48:09","author":null,"language":"en","source_country":"in","sentiment":-0.571},{"id":302815204,"title":"Columbia University Caves to Trump; Pro-Palestinian Students Fume","text":"Columbia University announced new actions on Friday amid a fiery back and forth with President Donald Trump over protests and alleged antisemitism at the school.Newsweek reached out to Columbia student workers via email Friday night for comment.What To KnowInterim Columbia University President Katrina Armstrong announced the actions on Friday, highlighting points that include banning masks to conceal identity, hiring 36 campus officers \"who will have the ability to remove individuals from campus and/or arrest them when appropriate,\" and appointing a new senior vice provost to review \"programs in regional areas across the University, starting immediately with the Middle East,\" the announcement says.Trump previously demanded that the university implement change by revoking control of an international studies department and implementing additional policy changes or permanently lose federal funding amounting to $400 million.Reacting to the university's announcement in a post to X, formerly Twitter on Friday, the Columbia Students for Justice in Palestine account posted, \"rather than stand up against fascist administration, armstrong and cu trustees have bent over backwards to cater to zionist interests—even as the genocide in gaza escalates once again.\"Things to highlight:\n1. THEY ARE OPENING AND \"ADVANCING\" THE TEL AVIV GLOBAL CENTER\n2. de facto columbia police force with power to arrest\n2. a mask ban, from a doctor\n3. mesaas under what is essentially receivership\"This is a developing story that will be updated with additional information.","summary":"Interim Columbia University President Katrina Armstrong announced the actions on Friday.","url":"https://www.newsweek.com/columbia-university-caves-trump-pro-palestinian-students-fume-2048932","image":"https://d.newsweek.com/en/full/2612663/columbia-university-protests.jpg","video":null,"publish_date":"2025-03-21 23:45:40","author":"Anna Commander,Peter Aitken","authors":["Anna Commander","Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.038},{"id":302818332,"title":"There Goes the Friendship? President Trump Blocked Elon Musk From Seeing Military Plans on Possible War With China During Pentagon Meeting: 'You Wouldn't Show it to a Businessman!'","text":"Donald Trump has to draw the line somewhere when it comes to Elon Musk, and it is apparently drawn when it has to do with a possible war with China.\n\nOn Friday, March 21, the president made it clear the billionaire – who has been attached to him for months – didn't come close to seeing military plans while at a meeting in the Pentagon, RadarOnline.com can reveal.While speaking with reporters at the Oval Office, Trump said: \"I don’t want to show it to anybody. You know you’re talking about a potential war with China.\n\n\"We don’t want to have a potential war with China, but I can tell you, if we did, we’re very well equipped to handle it.”\n\nTrump's confirmation comes amid theories as to why Musk was at the Pentagon on Friday morning, where he met with Secretary of Defense Pete Hegseth for over an hour.It was previously reported the Tesla founder was receiving a briefing on the military’s plan for a possible battle with China, however, Pentagon officials shut down the rumors – as did Trump.\n\nHe said: “I don’t want to show that to anybody – but certainly, you wouldn’t show it to a businessman who is helping us so much. You know, Elon has businesses in China, and he would be susceptible, perhaps, to that – but it was such a fake story.”\n\nWhen asked about his meeting with Hegseth, Musk was of course giddy as he responded: \"It’s always a great meeting.”\"I’ve been here before, you know,” the 53-year-old joked, and added \"Why would I tell you?\" when asked if the meeting focused on China.\n\nThis is not the first time Trump has told the public Musk – known as 'First Buddy' – does not have as much power as everyone thinks.\n\nOn March 6, during a Cabinet-level meeting, Trump is said to have reminded heads of agencies that they are pulling the strings when it comes to firing employees, and not Musk.According to sources, Musk was in the meeting when Trump told his top officials the DOGE boss is only there to make recommendations on who to terminate, but does not have any power when it comes to actually doing the firing.\n\nTrump's reported instructions came after the businessman was open about cutting government waste, even sending an email to federal employees urging them to list five things they had done that week. He gave them a deadline, too.\n\nMusk then took to X, telling workers the email was to figure out “who had a pulse and two working neurons,\" and then warned those who did not send the email would “soon be furthering their career elsewhere.”However, the email was met with pushback, including from department leads Kash Patel and Tulsi Gabbard.\n\nMusk took another big hit recently as he watch his automotive and clean energy company Tesla plunge in the stock market. According to Business Insider, from December to March 14 after trading hours, the company lost almost 50 percent of its market cap.\n\nTesla saw its peak value of $1.54trillion from the end of 2024 fall to about $777billion.\"We struggle to think of anything analogous in the history of the automotive industry, in which a brand has lost so much value so quickly,\" JPMorgan analysts told the outlet.","summary":"Donald Trump revealed he did not let Elon Musk anywhere close to military plans focused on a potential war with China, despite the two being good buddies.","url":"https://radaronline.com/p/trump-blocked-elon-musk-military-plans-war-with-china-pentagon-meeting-businessman/","image":"https://media.radaronline.com/brand-img/61t35ebAf/0x0/trump-blocks-musk1-1742597028627.jpg","video":null,"publish_date":"2025-03-21 23:45:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","category":"politics","source_country":"us","sentiment":-0.297},{"id":302816576,"title":"Smith says she'd form second Fair Deal Panel if Ottawa doesn't meet policy demands (Canada)","text":"A day after threatening a national unity crisis, Premier Danielle Smith says she would strike a panel to poll Albertans on what to do if her list of demands is ignored.\n\nSmith, facing repeated questions from reporters in Calgary about how far she'd be willing to go in a renewed fight with Ottawa, said Friday she'd strike a second Fair Deal Panel to \"listen to what it is that Albertans want to do in consequence.\"\n\nSmith's latest demands, posted on social media Thursday after a meeting with Prime Minister Mark Carney in Edmonton, include ending a number of policies put in place under former prime minister Justin Trudeau.\n\nShe says those policies, such as Ottawa's proposed emissions cap, have done nothing but harm Alberta's oil and gas sector.\n\nSmith said in a statement after the meeting that she wanted her demands meaningfully addressed within months of the next federal election, which is expected to be called Sunday.\n\nThe first Fair Deal Panel was formed by former United Conservative premier and Smith's predecessor Jason Kenney shortly after he took office in 2019, citing the province's widespread frustration with the federal government.\n\nThe panel was tasked with finding ways to gain leverage against Ottawa.\n\nAt the time, then-Opposition NDP leader Rachel Notley said the whole endeavour was a way for Kenney to stoke \"the fires of separation in order to distract from his own economic failures.\"\n\nThe panel published a report in 2020 with more than two dozen recommendations, including to create an Alberta pension plan and to replace the RCMP with a provincial police force.\n\nKenney adopted neither. Five years later, Smith hasn't explicitly committed to the recommendations.\n\nSmith said Friday her list of preferred federal policy reversals is reasonable, especially if Carney's Liberal government is as different as Trudeau's, as Carney says it is.\n\nShe also took issue with what she said were conflicting messages coming from Carney's government.\n\nShe said that in their meeting Carney alluded to the possibility of scrapping the yet-to-be-implemented emissions cap. But Environment Minister Terry Duguid told The Canadian Press in a recent interview that the cap would go ahead.\n\nThe mixed messaging led Smith to call on Friday for clarity from the prime minister.\n\nSmith said Albertans and Canadians needed to know what the promise is before an election.\n\nBesides ditching the emissions cap, Smith said she wants guarantees that pipelines can be built in every direction and that Ottawa's single-use plastics prohibition will be abolished, \"so we can start using straws again.\"\n\nShe's also calling for net-zero electricity and vehicle targets to be shelved and for Canada's greenwashing law to be repealed.\n\n\"None of what I put on here is unreasonable,\" Smith said. \"And if there is a true change of heart, then the prime minister and his cabinet will move in that direction.\"\n\nNDP Leader Naheed Nenshi said Thursday that Smith is \"playing chicken with people's lives,\" at a time when many Albertans feel their livelihoods are already under threat because of tariffs from U.S. President Donald Trump.\n\n\"It's juvenile, it's childish, it's not very bright, and it's certainly not going to get Alberta what we need,\" Nenshi said.\n\nSmith provided few details on what she'd expect out of a second Fair Deal Panel but said she believes in \"direct democracy.\"\n\n\"I always feel like big important decisions need to be put to a referendum of all Albertans,\" she said.\n\n\"I don't want to prejudge what it is Albertans might want. But there are mechanisms to be able to identify those, so we can put it to the people.\"","summary":"A day after threatening a national unity crisis, Premier Danielle Smith says she would strike a panel to poll Albertans on what to do if her list of demands is ignored. Smith, facing repeated questions from reporters in Calgary about how far she&amp;#39;d be willing to go in a renewed fight with Ottawa,...","url":"https://www.castanet.net/news/Canada/539979/Smith-says-she-d-form-second-Fair-Deal-Panel-if-Ottawa-doesn-t-meet-policy-demands","image":"https://www.castanet.net/content/2025/3/44d9f1561c5e1ece86be4c53d785b8e2fa68bb70d537eff7f92562a67cc3d457_p4165833.jpg","video":null,"publish_date":"2025-03-21 23:44:00","author":"Jack Farrell,The Canadian Press","authors":["Jack Farrell","The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.033},{"id":302819216,"title":"Carney Says Liberals Will Cancel Capital Gains Rate Hike","text":"Prime Minister Mark Carney has announced his government will cancel the Liberal government’s planned hike in the capital gains inclusion rate.\n\nIn a statement released on March 21, the Prime Minister’s Office said this cancellation is part of a “recognition of the vital role that builders and small businesses play,” adding that the change would allow for more private investment to create jobs and opportunities for Canadians.\n\nThe statement also said the Liberal government will maintain the increase in the lifetime capital gains exemption rate to $1.25 million for small business shares, and farming, and fishing property. The statement added that the government will introduce legislation to formalize the changes to the exemption limit “in due course.”\n\nThe increase to the share of taxable capital gains was introduced last year and included in the federal budget of April 2024. The change meant that Canadians with annual capital gains over $250,000 would have 66.7 percent of those gains taxed, up from the current level of 50 percent.\n\nThis legislation was still being debated in the House of Commons when Parliament was prorogued on Jan. 6, which meant the legislation died and would need to be reintroduced from scratch at the next session of Parliament.\n\nThe proposed capital gains increase had proved to be a controversial policy, with groups like the Canadian Federation for Independent Business and the Canadian Chamber of Commerce saying in a May 9 letter that the change would make Canada “less competitive and less innovative.”\n\nRelated StoriesOttawa Defers Effective Date of Capital Gains Changes to 20261/31/2025Quebec Follows Federal Government and Delays Capital Gains Tax Hike Until 20262/3/2025\n\nThe Canadian Medical Association also opposed the tax changes, saying it would make recruitment and retention of doctors more difficult. \n\nThe Conservative Party vowed to scrap the capital gains tax increase if it formed government after the next election, with Leader Pierre Poilievre saying the tax policy was “outright insanity” when combined with the threat of 25 percent tariffs by U.S. President Donald Trump.\n\nThen-Prime Minister Justin Trudeau had defended the tax changes as a way to provide “more fairness for every generation,” and said the tax would impact less than 1 percent of Canadians. The Liberal government also estimated that the higher inclusion rate would bring in an additional $19.4 billion in revenue over the next five years.\n\nOn Jan. 31, 2025, the Liberal government announced it was deferring the date on which the capital gains inclusion rate would increase to 66.7 percent to Jan. 1, 2026, instead of June 25, 2024.\n\nDuring the Liberal leadership race, former Deputy Prime Minister and Minister of Finance Chrystia Freeland and former House Leader Karina Gould had also pledged to scrap the capital gains tax increase if they became the leader of the party.","summary":"Prime Minister Mark Carney has announced his government will cancel the Liberal government&#8217;s planned hike in the capital gains inclusion rate. In a statement released on March 21, the Prime Minister’s Office said this cancellation is part of a “recognition of the vital role that builders and small businesses play,” adding that the change would [&#8230;]","url":"https://www.theepochtimes.com/world/carney-says-liberals-will-cancel-capital-gains-rate-hike-5829455","image":"https://img.theepochtimes.com/assets/uploads/2025/03/21/id5829177-CP174328322-300x180.jpg","video":null,"publish_date":"2025-03-21 23:43:43","author":"Matthew Horwood","authors":["Matthew Horwood"],"language":"en","source_country":"us","sentiment":0.039},{"id":302816578,"title":"Carney, premiers seeking plan for national energy, trade corridor (Canada)","text":"Prime Minister Mark Carney says he and the country's premiers agreed today to work on a plan to develop a national trade and energy corridor.\n\nCarney and the premiers are meeting in Ottawa to deal with what he called a \"crisis\" caused by U.S. President Donald Trump's tariffs.\n\nHe says after some discussions about the response to the tariffs directly, the premiers turned their sights on \"nation building\" to build things faster than ever before.\n\nThat includes finding ways to better move energy and critical minerals and improve digital connectivity.\n\nThe first ministers also talked about moving quickly to eliminate trade barriers between provinces and with the federal government.\n\nJust days before an expected election call, Carney says Ottawa is also going to waive the one-week waiting period to get employment insurance if your job is cut because of the tariffs, and temporarily allow Canadian businesses to defer income tax and GST and HST payments to help boost their liquidity.","summary":"Prime Minister Mark Carney says he and the country&amp;#39;s premiers agreed today to work on a plan to develop a national trade and energy corridor. Carney and the premiers are meeting in Ottawa to deal with what he called a &amp;quot;crisis&amp;quot; caused by U.S. President Donald Trump&amp;#39;s tariffs. He say...","url":"https://www.castanet.net/news/Canada/539978/Carney-premiers-seeking-plan-for-national-energy-trade-corridor","image":"https://www.castanet.net/content/2025/3/0c3a38aaace655164d9effa6eb61d1459d8f9cbc77db6e9949e8c2e1e44b7d4b_p4165724.jpg","video":null,"publish_date":"2025-03-21 23:41:00","author":"Catherine Morrison,The Canadian Press","authors":["Catherine Morrison","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.053},{"id":302814956,"title":"USPS official cautions of upcoming major changes following delivery issues – customers will quickly see a noticeable difference","text":"The head of the US Postal Service has cautioned that the post office is set for a significant overhaul within a few weeks, and clients will see the changes right away.\n\nThe USPS is set to introduce artificial intelligence to streamline operations, speed up responses, and overhaul its call center system.\n\nMarc McCrery, the agency’s VP of customer experience, revealed the bombshell changes during a keynote session at the Salesforce World Tour DC event.\n\nAfter the pandemic, the postal service faced an overwhelming surge of complaints, handling nearly 100 million calls and 13 million service requests.\n\nMcCrery commended the service for handling unprecedented business levels but said there was always room for improvement.\n\nWhile handling the service requests, the USPS was able to collect a vast amount of data, reported Next Gov.\n\nNow, with new AI tools, executives hope to learn from their hard work and optimize sectors like the call center.\n\n“During the summer, we plan to transition our call center system to a cloud-based program featuring conversations in natural language,” McCrery announced.\n\n“That’ll be the start of our AI journey.”\n\nPackage complaints make up a staggering 65% of all USPS customer grievances.\n\nExecs hope that AI will be used to give more accurate, real-time updates on package deliveries.\n\nAccording to McCrery, this system will enable the monitoring of parcels within designated postal containers, allowing for the identification of whether a delay in delivery is a widespread problem or an isolated incident.\n\n“That’s very manual today. We can be learning and growing where we can then start to monitor the improvements of resolution and bring those into the innovation,” he said.\n\nBut there’s a new wrinkle in the plan.\n\nThe Trump administration, along with the Elon Musk-led Department of Government Efficiency, has thrown an extra layer of scrutiny into the USPS overhaul.\n\nLast week, Postmaster General Louis DeJoy told lawmakers he signed an agreement with the General Services Administration and DOGE to ramp up efficiency across the agency.\n\nIn a letter to Congress this week, DeJoy called for swift action as he sounded the alarm about the failing federal mail service and cited four changes he wants to implement.\n\nHe also specifically asked the Department of Government Efficiency for help in addressing four main challenges.\n\nThe first concern centers around leases for USPS’ post offices and retail centers.\n\nDeJoy said the agency is also battling a surge in counterfeit postage, which he said is costing an estimated $1 billion annually.\n\nHe wants help looking for “additional innovative solutions” to crack down on the fraud.\n\nThe third issue he noted was federal laws burdening the Postal Service.\n\nHe said unfunded congressional mandates are costing USPS between $6 billion and $11 billion every year.\n\nAnd lastly, he highlighted regulatory restrictions that have piled on $50 billion in losses.\n\nDeJoy, who has pushed aggressive cost-cutting and operational streamlining, is set to step down once a replacement is found.\n\nPresident Donald Trump and Musk have previously voiced support for privatizing the USPS.\n\nAdding to the uncertainty, The Washington Post reported last month that Trump was preparing an executive order to dissolve the service’s leadership and fold USPS into the Commerce Department.\n\nThat order has yet to be released, but the shake-up is looming.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe head of the US Postal Service has cautioned that the post&#8230;\n\n\nThis Post: USPS official cautions of upcoming major changes following delivery issues &#8211; customers will quickly see a noticeable difference first appeared on Internewscast Journal","url":"https://internewscast.com/news/usps-official-cautions-of-upcoming-major-changes-following-delivery-issues-customers-will-quickly-see-a-noticeable-difference/","image":"https://internewscast.com/wp-content/uploads/2025/03/USPS-exec-warns-of-big-change-coming-in-weeks-after.jpg","video":null,"publish_date":"2025-03-21 23:40:11","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.111},{"id":302814958,"title":"Columbia University Agrees to Trump’s Policy Terms to Avoid Losing $400M Federal Funds Amid Anti-Israel Demonstrations","text":"Columbia University has agreed to meet Donald Trump’s demands for several policy changes after he threatened to take away $400 million in government grants from the Ivy League institution. \n\nThe Trump administration pulled the grants and other federal funding and had threatened to cut more, over the university’s handling of rampant protests against Israel. \n\nThose protests led to the detaining of activist Columbia grad student Mahmoud Khalil by ICE, 30, a legal resident in the US, for his role in the demonstrations. \n\nThe changes, detailed in a letter sent by the university’s interim president, Katrina Armstrong, came one week after the Trump administration ordered the Ivy League school to enact reforms or lose all federal funding.\n\nIn her letter, Armstrong said the university would immediately appoint a senior vice provost to conduct a thorough review of the portfolio of its regional studies programs, ‘starting immediately with the Middle East.’\n\nColumbia will also revamp its long-standing disciplinary process and bar protests inside academic buildings. Students will not be permitted to wear face masks on campus ‘for the purposes of concealing one´s identity.’ \n\nAn exception would be made for people wearing them for health reasons.\n\nIn an effort to expand ‘intellectual diversity’ within the university, Columbia will also appoint new faculty members to its Institute for Israel and Jewish Studies department. \n\nIt will also adopt a new definition of antisemitism and expand programming in its Tel Aviv Center, a research hub based in Israel.\n\nThe White House has labeled the protests antisemitic, a label rejected by those who participated in the student-led demonstrations.\n\nA message seeking comment was left with a spokesperson for the Education Department.\n\nAs a ‘precondition’ for restoring funding, federal officials demanded that the university to place its Middle Eastern, South Asian and African Studies Department under ‘academic receivership for a minimum of five years.’\n\nThey also told the university to ban masks on campus, adopt a new definition of antisemitism, abolish its current process for disciplining students and deliver a plan to ‘reform undergraduate admissions, international recruiting, and graduate admissions practices.’\n\nHistorians had described the order as an unprecedented intrusion on university rights long treated by the Supreme Court as an extension of the First Amendment.\n\nOn Friday, freedom of speech advocates immediately decried Columbia’s decision to acquiesce.\n\n‘A sad day for Columbia and for our democracy,’ Jameel Jaffer, the director of Knight First Amendment Institute at Columbia University, said in a social media post.\n\nThe president launched the dramatic move ‘due to the school’s continued inaction in the face of persistent harassment of Jewish students,’ his administration said.\n\nIt represents only a first round of canceled funds and additional cuts are expected. \n\nTrump’s Education Secretary Linda McMahon said: ‘Since October 7, Jewish students have faced relentless violence, intimidation, and anti-Semitic harassment on their campuses – only to be ignored by those who are supposed to protect them.\n\n‘Universities must comply with all federal anti-discrimination laws if they are going to receive federal funding.’\n\nThe announcement coincided with recent anti-Israel campus protests at Barnard College, which Trump aggressively condemned. \n\n‘Agitators will be imprisoned/or permanently sent back to the country from which they came. American students will be permanently expelled or, depending on the crime, arrested. NO MASKS!’ he stated on social media.\n\nTrump officials said the Joint Task Force to Combat Anti-Semitism will continue to review and coordinate with other federal agencies to move swiftly. \n\nThat group is made up of officials at the Justice Department, Education Department, Department of Heath and Human Services and U.S. General Services Administration (GSA).\n\nColumbia, located in New York City, ‘abandoned (their) obligation to Jewish students studying on its campus,’ officials said. \n\nSince the horrific attack, anti-Israel protests have sprung up across the nation, including most recently at Columbia University and Barnard College in Manhattan—a university hotbed of pro-Gaza activism. \n\nState Department officials also shared that they will soon review foreign student visa holders who were arrested though allowed to stay in the country. \n\nThis AI-enabled review will also look for clues in news articles about the protests which have been on and off for the past year and a half.\n\nAlready officials have reviewed 100,000 individuals in the Student Exchange Visitor System.","summary":"Internewscast Journal\n\nInternewscast\n\n\nColumbia University has agreed to meet Donald Trump&#8217;s demands for several policy&#8230;\n\n\nThis Post: Columbia University Agrees to Trump&#8217;s Policy Terms to Avoid Losing $400M Federal Funds Amid Anti-Israel Demonstrations first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/columbia-university-agrees-to-trumps-policy-terms-to-avoid-losing-400m-federal-funds-amid-anti-israel-demonstrations/","image":"https://i.dailymail.co.uk/1s/2025/03/21/22/96453899-14525195-image-a-6_1742597634719.jpg","video":null,"publish_date":"2025-03-21 23:39:03","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.083},{"id":302818866,"title":"Donald Trump insists plans to carve up Ukraine are ‘being negotiated as we speak’","text":"PLANS to carve up Ukraine are “being negotiated as we speak”, Donald Trump insisted yesterday.\n\nHe claimed a “full ceasefire” was imminent despite Russian tyrant Vladimir Putin rejecting a 30-day pause this week.\n\nMoscow appears to have ramped-up attacks since Putin and Trump spoke in a phone call on Tuesday.\n\nPutin agreed to a 30-day break in his army’s strikes on energy infrastructure.\n\nBut since then, Moscow blitzed Odesa when Czech President Petr Pavel was visiting and Ukraine accused Russia of carpet bombing its city Kropyvnytskyi.\n\nSpeaking last night, the US President said: “I believe we’re pretty soon going to have a full ceasefire. Then we’re gonna have a contract.\n\n“The contract is being negotiated in terms of dividing up the lands, etcetera. It is being negotiated as we speak.”\n\nIt came as Ukraine accused Russia of launching a “false flag” attack on a gas metering station in Russia’s contested Kursk province.\n\nKyiv said the station “was repeatedly shelled by the Russians themselves”.\n\nDramatic footage showed flames erupting on the site near Sudzha, where Ukraine’s frontline had collapsed earlier this month.\n\nThe pipeline had been used to send gas to Europe until Ukraine cut it off in December when the previous contract expired.","summary":"","url":"https://www.thescottishsun.co.uk/news/14527849/donald-trump-carve-up-ukraine/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2025/03/u-s-president-donald-trump-981494092_0fd83c.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-03-21 23:38:48","author":"Jerome Starkey","authors":["Jerome Starkey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.839},{"id":302818710,"title":"Donald Trump insists plans to carve up Ukraine are ‘being negotiated as we speak’","text":"PLANS to carve up Ukraine are “being negotiated as we speak”, Donald Trump insisted yesterday.\n\nHe claimed a “full ceasefire” was imminent despite Russian tyrant Vladimir Putin rejecting a 30-day pause this week.\n\nMoscow appears to have ramped-up attacks since Putin and Trump spoke in a phone call on Tuesday.\n\nPutin agreed to a 30-day break in his army’s strikes on energy infrastructure.\n\nBut since then, Moscow blitzed Odesa when Czech President Petr Pavel was visiting and Ukraine accused Russia of carpet bombing its city Kropyvnytskyi.\n\nSpeaking last night, the US President said: “I believe we’re pretty soon going to have a full ceasefire. Then we’re gonna have a contract.\n\n“The contract is being negotiated in terms of dividing up the lands, etcetera. It is being negotiated as we speak.”\n\nIt came as Ukraine accused Russia of launching a “false flag” attack on a gas metering station in Russia’s contested Kursk province.\n\nKyiv said the station “was repeatedly shelled by the Russians themselves”.\n\nDramatic footage showed flames erupting on the site near Sudzha, where Ukraine’s frontline had collapsed earlier this month.\n\nThe pipeline had been used to send gas to Europe until Ukraine cut it off in December when the previous contract expired.","summary":"","url":"https://www.thesun.co.uk/news/33984462/donald-trump-carve-up-ukraine/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/03/u-s-president-donald-trump-981494092_0fd83c.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-03-21 23:38:48","author":"Jerome Starkey","authors":["Jerome Starkey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.839}]}