{"offset":0,"number":50,"available":6173,"news":[{"id":258837658,"title":"CBS News calls in ‘DEI expert’ who mocked black senator as ‘Uncle Tim’ in wake of Tony Dokoupil scandal","text":"CBS News’ new DEI consultant may need to take some racial sensitivity training of his own.\n\nNetwork brass reportedly tapped Dr. Donald Grant — who dubs himself a “mental health expert DEI strategist and trauma trainer” on his Instagram — to quell internal turmoil after they declared an interview between morning show host Tony Dokoupil and author Ta-Nehisi Coates was not up to its “editorial standards.”\n\nBut CBS may want to reconsider its choice of mediator.\n\nThe apparently MAGA-hating Grant, who is black, posted an altered cover of the classic Harriet Beecher Stowe novel about slavery “Uncle Tom’s Cabin” — featuring the face of Donald Trump-supporting South Carolina Sen. Tim Scott photoshopped over the images of several other characters. \n\nThe post to Grant’s Instagram account, which he put up earlier this year, changed the title to “Uncle Tim’s Cabin” and also included an image of conservative commentator Candace Owens.\n\nA source close to the situation called the move by CBS News “idiotic” and pointed to the irony that the Tiffany Network would hire someone who is “insanely racist.” \n\nCBS News did not comment on its decision to tap Grant, which was first report by Puck News.\n\nScott immediately jumped on the controversial decision to bring in Grant, re-posting his altered book cover on the Win Red fund-raising platform late Monday. \n\n“The disgusting rhetoric above is EXACTLY what’s in store for us if we allow the Radical and Intolerant left to win,” Scott wrote.\n\n“If you believe in a Stronger America, if you believe that we are better together than we are divided, then I’m counting on you to stand with me right now!”\n\nEarlier in the day, the network raised hackles among CBS News staffers after calling out Dokoupil for pressing Coates about the controversial author’s pro-Palestinian framing of Hamas’ war with Israel during last week’s testy interview on “CBS Mornings.” \n\nCBS News boss Wendy McMahon and Adrienne Roark, the president of content development for the news division, claimed the “CBS Mornings” host brought his own bias to the interview with Coates during the meeting with workers on the one-year anniversary of the Oct. 7 massacre, according to multiple reports.\n\nThey said the sit-down, conducted last week, did not meet editorial standards for impartiality — though they declined to provide any details, Puck News and Bari Weiss’s Free Press reported.\n\n“We will still hold people accountable. But we will do so objectively, which means checking our biases and opinions at the door,” Roark said, according to the outlets. “We are here to report news without fear or favor.”\n\nThe strong criticism did not sit well with several Dokoupil’s backers, including CBS News chief legal correspondent Jan Crawford.\n\n“I don’t even understand how Tony’s interview failed to meet our editorial standards… I thought our commitment was to truth,” Crawford was quoted as saying by Puck.\n\n“When someone comes on our air with a one-sided account of very complex situation — which Coates himself acknowledges that he has — it’s my understanding that as a journalist we are obligated to challenge that worldview, so that our viewers can have access to the truth and can have a more balanced account.”\n\nCritics on social media and CBS staffers blasted Dokoupil’s direct questioning about Coates’ book “The Message,” in which he condemned what he called Israeli “apartheid” in its administration of the territories captured in the Six-Day War of 1967.\n\nDokoupil, a convert to Judaism whose ex-wife lives in Israel along with their two children, took issue with Coates, saying that the book “would not be out of place in the backpack of an extremist” due to its characterization of Israel.\n\nDokoupil asked Coates why he didn’t include more pro-Israel voices or note in his work that “little kids [were] blown to bits” in Palestinian terrorist attacks.\n\n“Is it because you just don’t believe that Israel, in any condition, has a right to exist?” Dokoupil asked.\n\nCoates replied that the Israeli narrative was well-represented in the American mainstream press and that few Palestinian voices had a chance to be heard.\n\n“I wrote a 260-page book,” Coates said. “It is not a treatise on the entirety of the conflict between the Palestinians and the Israelis,” Coates said, acknowledging that the account was based on his 10-day trip to Israel and the Palestinian West Bank.\n\nCrawford praised Dokoupil for “challeng[ing] Coates’ one-sided worldview” and then giving the author a chance to respond.\n\n“It was civil…I don’t see how we can say that it failed to meet our editorial standards,” Crawford is reported to have said.\n\nShe added that Dokoupil “prevented a one-sided account from being broadcast on our network about a deeply complex situation that completely was devoid of history or fact. “As journalists, that’s what we have an obligation to do.”","summary":"CBS News' new DEI consultant may need to take some racial sensitivity training of his own.","url":"https://nypost.com/2024/10/07/media/cbs-news-calls-in-dei-expert-who-mocked-black-senator-as-uncle-tim-in-wake-of-tony-dokoupil-scandal/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/91207767-2.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-08 00:28:30","author":"Alexandra Steigrad","authors":["Alexandra Steigrad"],"language":"en","source_country":"us","sentiment":-0.112},{"id":258837354,"title":"Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’","text":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. \n\nThe somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked the current destructive conflict in Gaza.\n\nCeremonies in Israel started around 6:29 a.m. local time to mark the hour when Hamas launched rockets into the Jewish state at the start of their attack.\n\nFamily and friends of victims gathered for a ceremony on the grounds of the Nova Festival, where hundreds of innocent music revelers were killed. The event got under way to the sounds of the final track that was played at the fest last year.\n\n“We will remember always who kidnapped, who murdered, who raped, who slaughtered,” Israeli President Isaac Herzog said. “At the same time, we have also seen extraordinary fortitude. We have a wonderful people and on this day we strengthen it and call for unity.”\n\nOther ceremonies occurred in kibbutz villages and towns near Israel’s border throughout the day.\n\n“The memory of our citizens who were killed in the terrorist attack and the memory of all the fallen heroes from the IDF and security forces will be cherished forever,” Israeli Prime Minister Benjamin Netanyahu said in videotaped message.\n\n“On October 7th, we were all hurled into a critical battle, but we were not defeated. On the contrary, it is we who are acting to defeat and deter our enemies.”\n\nOutside the controversial PM’s residence in Jerusalem, about 300 people led by loved ones of the hostages held up photos of the captives and observed a minute of silence for the fallen as an air siren sounded.\n\n“We’re still stuck in Oct. 7, 2023, in one unending day of terror, of fear, of anger, of despair,” said Yuval Baron, whose father-in-law Keith Siegel was abducted.\n\n“We wanted to start this day together to remind ourselves, our prime minister, the public of Israel that even though it is a day of grief, there is still a holy mission to bring back the hostages,” Baron said.\n\nDuring a ceremony in Tel Aviv, Nitza Korngold, who had seven relatives that were kidnapped, delivered a message to her son Tal Shoham, who is still a hostage, the New York Times reported.\n\n“My dear Tal, if you can see or hear me, we all miss you so much,” she said. “We are doing everything to bring you and all the hostages home soon. We will not give up on you.”\n\nA large ceremony at Central Park was held Monday evening and included a speech by a Nova survivor, Natalie Sanandaji. \n\n“Our community, in Israel, in New York — around the world — will never forget the hundreds murdered, the hundreds kidnapped and taken hostage. The rape. The unspeakable acts of violence against mothers and fathers, children and babies. So many ordinary people,” the victim said.\n\nA woman who did want to be named told The Post, “We’re really, really injured and hurting and sad and shocked and depressed. It’s just a very, very difficult time.”\n\nThe Manhattan gathering also drew hordes of politicians — everyone from Gov. Kathy Hochul to Mayor Eric Adams to Sens. Chuck Schumer and Kirsten Gillibrand.\n\nAdams drew cheers from the crowd, but did not appear to interact with any of his fellow Democrats on stage during the somber ceremony.\n\nAdams directed all city flags be lowered to half-staff, while City Hall and five additional government buildings were lit yellow Monday evening in honor of the hostages. \n\n“One year ago today, people of all faiths and creeds gathered at the Nova Music Festival in Israel to sing songs of peace and coexistence,” Adams said in a statement.\n\n“With the brutal murder of more than 1,200 innocent men, women, and children by cowardly terrorists, a part of all of us died that day. Hundreds more were taken hostage in the aftermath, and many still remain in captivity today.\n\n“And as we see the devastation wrought on innocent people in the Middle East in the aftermath of this unprovoked attack, the thought of peace becomes even more distant,” Hizzoner said.\n\n“But that is exactly why we must continue to strive for peace — for the safe return of all of the hostages, for the defeat of Hamas, and for an end to this deadly conflict.”\n\nPresident Biden stood next to first lady Jill Biden while lighting a yahrzeit candle in DC and observing a moment of silence after Rabbi Aaron Alexander of Washington’s Adas Israel Congregation read the Jewish prayer for Oct. 7 victims at the White House.\n\nEarlier in the day, Biden and Israeli President Herzog spoke, according to the White House.\n\nCandidates running to succeed Biden — Vice President Kamala Harris and former President Donald Trump — also marked the solemn day.\n\nTrump paid a visit to the gravesite of Rabbi Menachem Mendel Schneerson, who was the leader of the Chabad-Lubavitch movement of Orthodox Judaism from 1951 until his death in 1994, in Queens. Video showed the Republican nominee wearing a black yarmulke as he unfolded and read a piece of paper.\n\nHe also took a moment of silence and placed a small rock on the rabbi’s tombstone before he left, which is a traditional Jewish custom.\n\nTrump was later expected to fly down to Florida to host an event with Jewish community leaders at his resort in Doral, the Times reported.\n\nHarris, the Democratic nominee, called Hamas’ deadly Oct. 7 assault “an act of pure evil” and cited the Kaddish, a Jewish prayer in mourning, to talk about “our enduring belief in God, even in our darkest moments.”\n\nShe and second gentleman Doug Emhoff planted a pomegranate tree at their official residence in memory of the victims, the Times of Israel reported.\n\nThe ceremonies came as thousands of protesters both in support and against Israel took to the streets throughout the day Monday.\n\nThe one-year mark also comes as the Middle East faces the threat of a larger regional conflict.\n\nAdditional reporting by Dorian Geiger and Post Wires","summary":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. The somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked &#8230;\n\n\nThe post Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’ appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/heart-breaking-memorials-from-tel-aviv-to-central-park-for-oct-7-victims-one-unending-day-of-terror/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/families-leaders-commemorate-vics-oct-91204213.jpg?quality=75&strip=all&w=1024","video":null,"publish_date":"2024-10-08 00:21:00","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.013},{"id":258837832,"title":"Ứng cử viên D. Trump cảnh báo áp thuế 200% với ô tô nhập khẩu từ Mexico","text":"Ứng cử viên Trump cam kết đán.h thuế 100% xe ô tô nhập khẩu từ Mexico\n\n Ngày 24/9, ứng cử viên Tổng thống Mỹ của đảng Cộng hòa, ông Donald Trump cho biết nếu giành chiến thắng trong cuộc bầu cử ngày 5/11 tới, ông sẽ áp thuế 100% đối với mọi ô tô nhập khẩu vào Mỹ qua biên giới với Mexico.\n\n Ô tô mới được xếp tại cảng Veracruz, Mexico. Ảnh tư liệu: AFP/TTXVN\n\nPhát biểu tại Savannah, bang Georgia, ông Trump khẳng định: \"Chúng tôi sẽ áp dụng mức thuế 100% đối với mọi chiếc xe nhập khẩu qua biên giới Mexico\". Ông cũng gợi ý cách duy nhất để xóa bỏ mức thuế này là các công ty hãy xây dựng một nhà máy tại Mỹ và thuê nhân công bản địa.\n\nÔng Trump đã cam kết ngăn chặn các doanh nghiệp Mỹ chuyển việc làm ra nước ngoài, chiếm việc làm và nhà máy của các nước khác bằng cách dựa vào thuế quan toàn diện để thúc đẩy sản xuất. Ông nhấn mạnh: \"Tôi muốn các công ty ô tô Đức trở thành các công ty ô tô Mỹ. Tôi muốn họ xây dựng nhà máy của họ ở đây\".\n\nÝ tưởng trên của ông Trump, nếu trở thành hiện thực, có thể gây ra một cuộc đảo lộn lớn trong ngành sản xuất ô tô của Mỹ. Nhiều công ty đang sản xuất những chiếc xe nhỏ hơn, giá rẻ hơn ở Mexico (được tạo điều kiện thuận lợi từ một thỏa thuận thương mại mà ông Trump đã đàm phán khi còn là Tổng thống) hoặc ở các quốc gia khác.\n\nChi phí lao động thấp hơn ở Mỹ giúp các công ty có lợi nhuận. Nay họ sẽ phải chuyển nhà máy sản xuất về Mỹ mới tránh được việc phải nộp thuế nhập khẩu 100%.\n\nCác hãng sản xuất ô tô Đức và nước khác đã có hoạt động sản xuất rộng rãi tại Mỹ và nhiều hãng hiện đang sản xuất nhiều xe tại Mỹ hơn so với số xe họ xuất sang Mỹ. Hãng xe BMW có xưởng rộng 300.000 m2 ở bang South Carolina, sử dụng 11.000 nhân viên, sản xuất hơn 1.500 xe SUV mỗi ngày cho Mỹ và 120 thị trường xuất khẩu. Các hãng Mercedes và Volkswagen cũng có các nhà máy lớn tại đây.","summary":"Trước đó, trong quá trình vận động tranh cử, ông Trump từng khẳng định sẽ áp thuế 100% đối với xe ô tô và xe tải nhập khẩu nhằm hỗ trợ công nghiệp xe hơi trong nước.","url":"https://vietgiaitri.com/ung-cu-vien-d-trump-canh-bao-ap-thue-200-voi-o-to-nhap-khau-tu-mexico-20241008i7286779/","image":"https://t.vietgiaitri.com/2024/10/3/ung-cu-vien-d-trump-canh-bao-ap-thue-200-voi-o-to-nhap-khau-tu-mexico-600x432-1aa-7286779.webp","video":null,"publish_date":"2024-10-08 00:19:22","author":"Vũ Hiệp","authors":["Vũ Hiệp"],"language":"en","category":"politics","source_country":"vn","sentiment":-0.674},{"id":258837126,"title":"GOP combat vet Sam Brown calls in ground support for Nevada Senate bid","text":"LAS VEGAS — Sam Brown, the combat veteran who survived massive burn injuries in Afghanistan in 2008, called in some high-powered ground support for his quest to unseat first-term Democratic Sen. Jacky Rosen.\n\nSen. John Kennedy (R-La.) joined Brown at a campaign office here Thursday to rally some three dozen volunteers in crucial get-out-the-vote efforts. In 2022, Democratic Nevada Sen. Catherine Cortez Masto beat former state Attorney General Adam Laxalt by just 8,000 votes, an average of four ballots per precinct.\n\nThe Louisiana lawmaker lauded Brown as someone who’d fight for Silver State residents while pursuing fiscal responsibility.\n\n“Sam Brown is tougher than a three-hour steak,” Kennedy declared.\n\nBrown is in a heated battle with Rosen. Her campaign accuses him of favoring an “extreme MAGA agenda.” In turn, the Reno-based Army vet says Rosen’s vote for the Biden-Harris administration’s spending bills substantially created the 5.2% unemployment here and hikes in rent, groceries and gas.\n\nHe said President Biden and Vice President Kamala Harris “introduced to us Bidenomics, and what that’s resulted in is that Nevadans, on average, are paying $1,200 or more a month now than they were four years ago.”\n\nKennedy agreed, saying, “The people of Nevada do not deserve to have to sell blood plasma to go to the grocery store, and they don’t deserve to have to cash in their retirement account to pay their rent or to make their mortgage paid, and they’re scared.”\n\nDespite one recent poll showing an 11-point gap with Rosen, Brown — who former President Donald Trump has also endorsed — believes he will win.\n\n“Nevadans are stressed. As you’ve seen and heard from across the state, people are driven to a point of desperation,” he said. “You will see a high turnout in this election, and when I’m across this state from city to city, town to town, mile after mile, people are furious with what has happened with this government and what it’s done to them.”\n\nBrown said another poll shows “only a 1.5-point race, so that feels much more like what we’re seeing on the ground.”\n\nKennedy said polling is less reliable in the current cycle than in earlier years.\n\n“People on both sides are so angry right now, particularly about inflation, that I think a small number, but a meaningful number of people, instead of just not taking the call from the pollster, they take the call, and they just screw with the pollster,” he said.\n\n“I’m not an expert in many things, if any, but I’ve been polling for 30 years, and if you get 4% to 6% of the people, even 3% who lie to a pollster just to screw with him, you can throw that thing away,” he said.\n\nDespite Kennedy spurring on the troops, one Brown supporter conceded it’s a difficult contest.\n\n“I think this is a tough seat,” Joanna Gorman of Summerlin told The Post. “I would not be surprised if it did not go our way, but we are trying by getting the vote out.”\n\nThe retired dietitian and diabetic educator said she and others are working to boost Republican turnout.\n\n“We are knocking, we are calling, we are sending out so much information that we need to get those voters who did not come out four years ago out, and that’s our main focus, Republicans who didn’t show up and independents,” Gorman said. “So, I think the polls underestimate the Republicans in general, but in this particular race, it is going to be an uphill battle.”\n\nA day after the Brown-Kennedy event, Nevada Independent publisher Jon Ralston tweeted that the National Republican Senatorial Committee — the GOP’s campaign arm funding Senate races — had canceled ad buys in Nevada through Election Day. \n\nBut an NRSC spokesman directed The Post to a Politico report in which the group said it’s shifting expenditures to “hybrid” ads that attack an issue and boost a candidate, claiming such expenditures yield more advertising bang for the buck.","summary":"LAS VEGAS — Sam Brown, the combat veteran who survived massive burn injuries in Afghanistan in 2008, called in some high-powered ground support for his quest to unseat first-term Democratic Sen. Jacky Rosen. Sen. John Kennedy (R-La.) joined Brown at a campaign office here Thursday to rally some three dozen volunteers in crucial get-out-the-vote efforts....","url":"https://nypost.com/2024/10/07/us-news/gop-combat-vet-sam-brown-calls-in-ground-support-for-nevada-senate-bid/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/sen-john-kennedy-r-la-91012087.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-08 00:19:06","author":"Mark A. Kellner","authors":["Mark A. Kellner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.466},{"id":258837120,"title":"Stream It Or Skip It: ‘Tim Dillon: This Is Your Country’ On Netflix, Where The Comedian Springers Into Action As A Would-Be Daytime Talk Show Ringmaster","text":"Tim Dillon’s brand of comedy made his podcast hugely popular during the pandemic, raising his profile and hsi tax bracket, and landing him his first Netflix special two years ago (Tim Dillon: A Real Hero). The streaming giant couldn’t quite capture in an hourlong stand-up set what makes Dillon tick. Perhaps this homage to the scandalous daytime talk shows of the 19990s and 2000s will do the trick?\n\nTIM DILLON: THIS IS YOUR COUNTRY: STREAM IT OR SKIP IT?\n\nThe Gist: Earlier this year, Netflix made an ambitious bet on John Mulaney by allowing the stand-up comedian to host and preside over a multi-night series of live talk shows that evoked nostalgia for the freewheeling nature those talkers seemed to carry in the 1970s, mixed with the unpredictability of live TV.\n\nNow comes Tim Dillon with a talk show of a different flavor, very much in the vein of the daytime talkers of the 1990s and 2000s, from Maury to Montel, but squarely landing within the aesthetic of the late Jerry Springer, who died last year but not before presiding over a tabloid brand of talk that emphasized sensationalist confrontation over philosophical debate, making the genre look more like a circus or pro wrestling than a talk show. Dillon’s take on it isn’t much of a rebrand. He’s just stamping his particular personality onto a format we all remember.\n\nWhat Comedy Specials Will It Remind You Of?: Again, this is not so much a comedy special as an homage or an effort to resurrect The Jerry Springer Show.\n\nMemorable Jokes: As such, the tropes all feel familiar, if perhaps with a few updates, such as the guy who apparently lost $200,000 on NFTs but wants to assure his pregnant partner that if he just dumps even more of their money into crypto “shitcoins,” they’ll be back in business.\n\nThey trot out a man in a dog costume, calling him Bandit, in a perverse attempt ot convince a man’s dad to stay in America rather than returning to Central America.\n\nAfterward, in passing, Dillon says “It’d be hilarious if you remove the dog head and it was RFK,” and then impersonating the latest Kennedy to run for president, adds: “I’m going to dress up like a dog on Netflix because I want to be the president of the United States.” \n\nOur Take: In real life, Dillon performed at shows raising money and stature for Robert F. Kennedy Jr.’s would-be presidential campaign earlier this year. And yet, nothing Dillon did here could even remotely compare to the currently ongoing scandals coming out about RFK Jr. just in the past week or two, from his dalliance with a political reporter to more recent revelations suggesting he cheated on his famous wife, Cheryl Hines of Curb Your Enthusiasm fame, with multiple other women. In fact, Dillon taped this special a week before RFK Jr. even announced he was suspending his campaign to support Donald Trump instead.\n\nAll that aside, though, what are we even doing here? What is Dillon hoping to accomplish here?\n\nDoes he actually want to be our new Springer, hoping Netflix gives him the opportunity to host a talk show on the regular? Or is this just a one-off satirizing the form? Is this a sketch show in disguise? Does any of that even matter?\n\nBecause as is, it feels so ephemeral as television that you could just have it on in the background while doing chores and not pay much attention to. Which, in a more high-minded pursuit, could be one way to parody America, by suggesting this is what’s happening in our country and we’re not paying enough attention to it in the first place.\n\nAs comedy highlighting a comedian, however, this feels more like Matt Rife’s crowd-work special, falling prey to the same problems that effort did by focusing our attention more on the random audience members who grabbed the spotlight away from the star comedian we clicked over to see.\n\nDillon is the kind of guy who’ll make fun of you for losing your money on crypto and NFTs, while also taking your money to make fun of you about it and sell it in Miami. But where is Dillon in all of these 47 minutes? He’s more of a bystander than a ringmaster. This could be so much more of a commentary on ugly Americans, if only Dillon put as much of himself into this project as he does his regular podcasts. Here, he’s taking the Netflix cash without putting his mouth where his money is. So to speak.\n\nThat he titles it Your Country and not Our Country also serves as a reminder that Dillon would much rather be the outsider barking at us at how idiotic we are, than be one of us actually looking in the mirror with us at ourselves and perhaps solving any of the problems. He remains nihilistic at his core. At least the core he lets us see.\n\nIf only he’d let us see it onscreen.\n\nOur Call: SKIP IT. Netflix cannot seem to figure out how to show the world what it is about Tim Dillon that makes him worth paying attention to, but it almost seems as though they care as little about that as he does. As long as they’re getting the viewing metrics for comedians, the quality of the comedy or the satisfaction of the audience somehow seems secondary to them.\n\nSean L. McCarthy works the comedy beat. He also podcasts half-hour episodes with comedians revealing origin stories: The Comic’s Comic Presents Last Things First.","summary":"Tim Dillon's brand of comedy made his podcast hugely popular during the pandemic.","url":"https://decider.com/2024/10/07/tim-dillon-this-is-your-country-netflix-review/","image":"https://decider.com/wp-content/uploads/2024/10/AAAABfszY-kKWdJ1N5RT-WTu0LsJj-j9p3FTR1I77tz9T3ezYcgiYyQLIhciG5ZU8lK71NDLwmshlwoNTHNwit4P8QyxScxK0Eow3niJ.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/Ss83EYtr-QVS3bn7S.mp4","publish_date":"2024-10-08 00:15:00","author":"mliss1578,Sean L. McCarthy","authors":["mliss1578","Sean L. McCarthy"],"language":"en","source_country":"us","sentiment":-0.214},{"id":258836878,"title":"Heart-breaking memorials from Tel Aviv to Central Park for Oct. 7 victims: ‘One unending day of terror’","text":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday. \n\nThe somber day was filled with tears, comforting words and somber gestures in remembrance of the roughly 1,200 Israelis killed and the 250 kidnapped during the shocking display of depravity last year that sparked the current destructive conflict in Gaza.\n\nCeremonies in Israel started around 6:29 a.m. local time to mark the hour when Hamas launched rockets into the Jewish state at the start of their attack.\n\nFamily and friends of victims gathered for a ceremony on the grounds of the Nova Festival, where hundreds of innocent music revelers were killed. The event got under way to the sounds of the final track that was played at the fest last year.\n\n“We will remember always who kidnapped, who murdered, who raped, who slaughtered,” Israeli President Isaac Herzog said. “At the same time, we have also seen extraordinary fortitude. We have a wonderful people and on this day we strengthen it and call for unity.”\n\nOther ceremonies occurred in kibbutz villages and towns near Israel’s border throughout the day.\n\n“The memory of our citizens who were killed in the terrorist attack and the memory of all the fallen heroes from the IDF and security forces will be cherished forever,” Israeli Prime Minister Benjamin Netanyahu said in videotaped message.\n\n“On October 7th, we were all hurled into a critical battle, but we were not defeated. On the contrary, it is we who are acting to defeat and deter our enemies.”\n\nOutside the controversial PM’s residence in Jerusalem, about 300 people led by loved ones of the hostages held up photos of the captives and observed a minute of silence for the fallen as an air siren sounded.\n\n“We’re still stuck in Oct. 7, 2023, in one unending day of terror, of fear, of anger, of despair,” said Yuval Baron, whose father-in-law Keith Siegel was abducted.\n\n“We wanted to start this day together to remind ourselves, our prime minister, the public of Israel that even though it is a day of grief, there is still a holy mission to bring back the hostages,” Baron said.\n\nDuring a ceremony in Tel Aviv, Nitza Korngold, who had seven relatives that were kidnapped, delivered a message to her son Tal Shoham, who is still a hostage, the New York Times reported.\n\n“My dear Tal, if you can see or hear me, we all miss you so much,” she said. “We are doing everything to bring you and all the hostages home soon. We will not give up on you.”\n\nA large ceremony at Central Park was held Monday evening and included a speech by a Nova survivor, Natalie Sanandaji. \n\n“Our community, in Israel, in New York — around the world — will never forget the hundreds murdered, the hundreds kidnapped and taken hostage. The rape. The unspeakable acts of violence against mothers and fathers, children and babies. So many ordinary people,” the victim said.\n\nA woman who did want to be named told The Post, “We’re really, really injured and hurting and sad and shocked and depressed. It’s just a very, very difficult time.”\n\nThe Manhattan gathering also drew hordes of politicians — everyone from Gov. Kathy Hochul to Mayor Eric Adams to Sens. Chuck Schumer and Kirsten Gillibrand.\n\nAdams drew cheers from the crowd, but did not appear to interact with any of his fellow Democrats on stage during the somber ceremony.\n\nAdams directed all city flags be lowered to half-staff, while City Hall and five additional government buildings were lit yellow Monday evening in honor of the hostages. \n\n“One year ago today, people of all faiths and creeds gathered at the Nova Music Festival in Israel to sing songs of peace and coexistence,” Adams said in a statement.\n\n“With the brutal murder of more than 1,200 innocent men, women, and children by cowardly terrorists, a part of all of us died that day. Hundreds more were taken hostage in the aftermath, and many still remain in captivity today.\n\n“And as we see the devastation wrought on innocent people in the Middle East in the aftermath of this unprovoked attack, the thought of peace becomes even more distant,” Hizzoner said.\n\n“But that is exactly why we must continue to strive for peace — for the safe return of all of the hostages, for the defeat of Hamas, and for an end to this deadly conflict.”\n\nPresident Biden stood next to first lady Jill Biden while lighting a yahrzeit candle in DC and observing a moment of silence after Rabbi Aaron Alexander of Washington’s Adas Israel Congregation read the Jewish prayer for Oct. 7 victims at the White House.\n\nEarlier in the day, Biden and Israeli President Herzog spoke, according to the White House.\n\nCandidates running to succeed Biden — Vice President Kamala Harris and former President Donald Trump — also marked the solemn day.\n\nTrump paid a visit to the gravesite of Rabbi Menachem Mendel Schneerson, who was the leader of the Chabad-Lubavitch movement of Orthodox Judaism from 1951 until his death in 1994, in Queens. Video showed the Republican nominee wearing a black yarmulke as he unfolded and read a piece of paper.\n\nHe also took a moment of silence and placed a small rock on the rabbi’s tombstone before he left, which is a traditional Jewish custom.\n\nTrump was later expected to fly down to Florida to host an event with Jewish community leaders at his resort in Doral, the Times reported.\n\nHarris, the Democratic nominee, called Hamas’ deadly Oct. 7 assault “an act of pure evil” and cited the Kaddish, a Jewish prayer in mourning, to talk about “our enduring belief in God, even in our darkest moments.”\n\nShe and second gentleman Doug Emhoff planted a pomegranate tree at their official residence in memory of the victims, the Times of Israel reported.\n\nThe ceremonies came as thousands of protesters both in support and against Israel took to the streets throughout the day Monday.\n\nThe one-year mark also comes as the Middle East faces the threat of a larger regional conflict.\n\nAdditional reporting by Dorian Geiger and Post Wires","summary":"Heartwrenching memorials honoring the victims of Oct. 7 were held across the globe from Tel Aviv to Central Park on Monday.","url":"https://nypost.com/2024/10/07/us-news/heart-breaking-memorials-from-tel-aviv-to-central-park-for-oct-7-victims-one-unending-day-of-terror/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/families-leaders-commemorate-vics-oct-91204213.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/KOS0Ahym-RyIcpnTz.mp4","publish_date":"2024-10-08 00:12:40","author":"David Propper","authors":["David Propper"],"language":"en","category":"politics","source_country":"us","sentiment":0.013},{"id":258837074,"title":"Russia, China and Iran Intend to Stoke False Election Claims, Officials Warn","text":"Foreign efforts to undermine American democracy will continue after Election Day, U.S. intelligence officials said on Monday, with covert influence campaigns focused on questioning the validity of election results after polls close.\n\nAdversaries believe that the possibility of a close presidential race and contested control of the Senate and House of Representatives offer opportunities to undermine trust in the election’s integrity, the officials said as part of an update one month before the vote.\n\nThe officials said they were worried about foreign adversaries amplifying domestic concerns about voting irregularities, as well as manufacturing their own allegations. After the 2020 vote, Donald J. Trump’s campaign made false allegations about voting irregularities, and he and his supporters have already advanced similar claims ahead of this year’s vote, many of them echoed by Russian state media or Kremlin-friendly organizations.\n\nThe intelligence community “expects foreign influence actors to continue their campaigns by calling into question the validity of the election’s results after the polls close,” the Office of the Director of National Intelligence wrote in an update on election threats. “They will likely take advantage of such an opportunity to use similar tactics in a post-election period to undermine trust in the integrity of the election, election processes and further exacerbate divisions among Americans.”","summary":"Intelligence officials said that foreign adversaries were planning to take advantage of another close U.S. election to undermine trust in the country’s democratic process.","url":"https://www.nytimes.com/2024/10/07/us/politics/russia-china-iran-false-election-claims.html","image":"https://static01.nyt.com/images/2024/10/07/multimedia/07dc-election-threat-pfbl/07dc-election-threat-pfbl-facebookJumbo.jpg","video":null,"publish_date":"2024-10-08 00:05:26","author":"Julian E. Barnes,Julian E. Barnes and Steven Lee Myers,Steven Lee Myers","authors":["Julian E. Barnes","Julian E. Barnes and Steven Lee Myers","Steven Lee Myers"],"language":"en","category":"politics","source_country":"us","sentiment":-0.298},{"id":258836344,"title":"New analysis suggests national debt could increase under Harris, but it would surge under Trump","text":"No one is likely to be happy with the projected higher deficits laid out in a new analysis of Kamala Harris’ and Donald Trump’s economic plans.\n\nThe analysis released yesterday by the nonpartisan Committee for a Responsible Federal Budget suggests a Harris presidency could increase the national debt over 10 years by $3.5 trillion.\n\nThat’s even though the vice president’s campaign insists her proposed investments in the middle class and housing would be fully offset by higher taxes on corporations and the wealthy.\n\nHer campaign policy guide states that Harris is “committed to fiscal responsibility — making investments that will support our economy, while paying for them and reducing the deficit at the same time.”\n\nThe same analysis says former President Trump’s ideas could heap another $7.5 trillion onto the debt and possibly as much as $15.2 trillion. That’s even though he suggests growth would be so strong under his watch that no one would need to worry about deficits.\n\nThe 34-page report released by the fiscal watchdog group puts a spotlight on the issue of government borrowing that will confront the winner of November’s election.","summary":"No one is likely to be happy with the projected higher deficits laid out in a new analysis of Kamala Harris’ and Donald Trump’s economic plans. The analysis released yesterday by the nonpartisan Committee for a Responsible Federal Budget suggests a Harris presidency could increase the national debt over 10 years by $3.5 trillion. That’s [&#8230;]\n\n\nThe post New analysis suggests national debt could increase under Harris, but it would surge under Trump appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/new-analysis-suggests-national-debt-could-increase-under-harris-but-it-would-surge-under-trump.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2017/10/mdtimes-300x200.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2024-10-08 00:04:05","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.026},{"id":258836656,"title":"VP Kamala Harris makes the case for why she should be president","text":"Kamala Harris has been a candidate for president for just two-and-a-half months and the post convention \"honeymoon\" is over. With the election just 29 days away, Harris and her running mate Minnesota Gov. Tim Walz face unrelenting attacks from Donald Trump, and the race remains extremely close.We met the 59-year-old vice president this past week on the campaign trail and later at the vice president's residence in Washington, DC. We spoke about the economy and immigration, Ukraine, and China, but we began with the escalating war in the Middle East. one year after the Hamas terror attack on IsraelBill Whitaker: The events of the past few weeks have pushed us to the brink, if—if not into an all-out regional war in the Middle East. What can the U.S. do at this point to stop this from spinning out of control?Vice President Kamala Harris: Well, let's start with October 7. 1,200 people were massacred, 250 hostages were taken, including Americans, women were brutally raped, and as I said then, I maintain Israel has a right to defend itself. We would. And how it does so matters. Far too many innocent Palestinians have been killed. This war has to end.Vice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsBill Whitaker: We supply Israel with billions of dollars in military aid, and yet Prime Minister Netanyahu seems to be charting his own course. The Biden-Harris administration has pressed him to agree to a ceasefire. He's resisted. You urged him not to go into Lebanon. He went in anyway. Does the U.S. have no sway over Prime Minister Netanyahu?Vice President Kamala Harris: The work that we do diplomatically with the leadership of Israel is an ongoing pursuit around making clear our principles.Bill Whitaker: But it seems that Prime Minister Netanyahu is not listening.Vice President Kamala Harris: We are not gonna stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end.Bill Whitaker: Do we have a--a real close ally in Prime Minister Netanyahu?Vice President Kamala Harris: I think, with all due respect, the better question is do we have an important alliance between the American people and the Israeli people. And the answer to that question is yes.While the war in the Middle East has dominated recent headlines, it's the economy that most concerns American voters this election year, as always.Bill Whitaker: There are lots of signs that the American economy is doing very well, better than most countries, I think. But the American people don't seem to be feeling it. Groceries are 25% higher and people are blaming you and Joe Biden for that. Are they wrong?Vice President Kamala Harris: We now have historic low unemployment in America among all groups of people. We now have an economy that is thriving by all macroeconomic measures. And, to your point, prices are still too high. And I know that, and we need to deal with it, which is why part of my plan—you mentioned groceries. Part of my plan is what we must do to bring down the price of groceries.Harris says she'll press Congress to pass a federal ban on price gouging for food and groceries, but details are yet to be defined.Bill Whitaker: You want to expand– the child tax credit.Vice President Kamala Harris: Yes, I do.Bill Whitaker: You want to give tax breaks to first-time home buyers.Vice President Kamala Harris: Yes.Bill Whitaker: And people starting small businesses.Vice President Kamala Harris: Correct.Bill Whitaker: But it is estimated by the Nonpartisan Committee for Responsible Federal Budget that your economic plan would add $3 trillion to the federal deficit over the next decade. How are you gonna pay for that?Vice President Kamala Harris: OK, so the other econ- economists that have reviewed my plan versus my opponent and determined that my economic plan would strengthen America's economy. His would weaken it. Bill Whitaker: But--Vice President Kamala Harris: My plan, Bill, if you don't mind, my plan is about saying that when you invest in small businesses, you invest in the middle class, and you strengthen America's economy. Small businesses are part of the backbone of America's economy.Bill Whitaker: But—but pardon me, Madame Vice President, I-- the-- the question was, how are you going to pay for it?Vice President Kamala Harris: Well, one of the things is I'm gonna make sure that the richest among us, who can afford it, pay their fair share in taxes. It is not right that teachers and nurses and firefighters are paying a har-- a higher tax rate than billionaires and the biggest corporations.Bill Whitaker: But—butVice President Kamala Harris: And I plan on making that fair.Bill Whitaker: But we're dealing with the real world here.Vice President Kamala Harris: But the real world includes—Bill Whitaker: How are you gonna get this through Congress?Vice President Kamala Harris: You know, when you talk quietly with a lot of folks in Congress, they know exactly what I'm talking about, 'cause their constituents know exactly what I'm talking about. Their constituents are those firefighters and teachers and nurses. Their constituents are middle-class, hard-working folk.Bill Whitaker: And Congress has shown no inclination to move in your direction.Vice President Kamala Harris: I-- I disagree with you. There are plenty of leaders in Congress who understand and know that the Trump tax cuts blew up our federal deficit. None of us, and certainly I cannot afford to be myopic in terms of how I think about strengthening America's economy. Lemme tell you something. I am a devout public servant. You know that. I am also a capitalist. And I know the limitations of government.Kamala Harris has been in government for decades; she was first elected San Francisco district attorney in 2003, then California attorney general, she went on to the U.S. Senate, and now vice president.Bill Whitaker: A quarter of registered voters still say they don't know you. They don't know what makes you tick. And-- and why do you think that is? What–what's the disconnect?Vice President Kamala Harris: It's an election, Bill. And I take-- it seriously that I have to earn everyone's vote. This is an election for president of the United States. No one should be able to take for granted that they can just declare themselves a candidate and automatically receive support. You have to earn it. And that's what I intend to do.Bill Whitaker: Lemme tell you what your critics and the columnists say.Vice President Kamala Harris: OK.Bill Whitaker: They say that the reason so many voters don't know you is that you have changed your position on so many things. You were against fracking, now you're for it. You supported looser immigration policies, now you're tightening them up. You were for Medicare for all, now you're not. So many that people don't truly know what you believe or what you stand for. And I know you've heard that. Vice President Kamala Harris: In the last four years I have been vice president of the United States. And I have been traveling our country. And I have been listening to folks and seeking what is possible in terms of common ground. I believe in building consensus. We are a diverse people. Geographically, regionally, in terms of where we are in our backgrounds. And what the American people do want is that we have leaders who can build consensus. Where we can figure out compromise and understand it's not a bad thing, as long as you don't compromise your values, to find common-sense solutions. And that has been my approach.But one issue that has proven impervious to compromise is immigration. Over the past four years, the Biden/Harris approach has been inconsistent, and Republicans are convinced immigration is the vice president's achilles heel.Bill Whitaker: You recently visited the southern border and-- embraced President Biden's recent crackdown on asylum seekers. And that crackdown produced an almost immediate and dramatic decrease in the number of border crossings. If that's the right answer now, why didn't your administration take those steps in 2021?Vice President Kamala Harris: The first bill we proposed to Congress was to fix our broken immigration system, knowing that if you want to actually fix it, we need Congress to act. It was not taken up. Fast forward to a moment when a bipartisan group of members of the United States Senate, including one of the most conservative members of the United States Senate, got together, came up with the border security bill. Well, guess what happened? Donald Trump got word that this bill was afoot and could be passed and he wants to run on a problem instead of fixing a problem, so he told his buddies in Congress, \"Kill the bill. Don't let it move forward.\"Bill Whitaker: But I've been covering the border for-- for years. And so I know this is not a problem that started with your administration.Vice President Kamala Harris: Correct. Correct.Bill Whitaker: But there was an historic flood of undocumented immigrants coming across the border the first three years of your administration. As a matter of fact, arrivals quadrupled from the last year of President Trump. Was it a mistake to loosen the immigration policies as much as you did?Vice President Kamala Harris: It's a longstanding problem. And solutions are at hand. And from day one, literally, we have been offering solutions.Bill Whitaker: What I was asking was, was it a mistake to kind of allow that flood to happen in the first place?Vice President Kamala Harris: I think-- the policies that we have been proposing are about fixing a problem, not promoting a problem, okay? But the--Bill Whitaker: But the numbers did quadruple under your--Vice President Kamala Harris: And the numbers today--Bill Whitaker: --under your watch--Vice President Kamala Harris: --because of what we have done-- we have cut the flow of illegal immigration by half. We have cut the--Bill Whitaker: But should you have done that--Vice President Kamala Harris: --flow of fentanyl--Bill Whitaker: --should you have done that-- Vice President Kamala Harris: --by half. But we need Congress to be able to act to actually fix the problem. Bill Whitaker: You have accused Donald Trump of using racist tropes when it comes to Haitian immigrants in Springfield, Ohio, when it comes to birtherism, when it comes to Charlottesville. In fact, you have called him a racist and divisive. Yet Donald Trump has the support of millions and millions of Americans. How do you explain that?Vice President Kamala Harris: I am glad you're pointing these comments out that he has made, that have resulted in a response by most reasonable people to say, \"It's just wrong. It's just wrong.\"Bill Whitaker: With so many people supporting Donald Trump, a man you have called a racist. How do you bridge that seemingly unbridgeable gap?Vice President Kamala Harris: I believe that the people of America want a leader who's not tryin' to divide us and demean. I believe that the American people recognize that the true measure of the strength of a leader is not based on who you beat down, it's based on who you lift up. The Harris campaign has been hopscotching the country and with less than a month to go, the pace is picking up. The vice president told us, she's lost track of how many states she's visited. Vice President Kamala Harris: How are you doing?Bill Whitaker: I'm doing well.Vice President Kamala Harris: You well?We joined her on the trail late last week, in the crucial swing state of Wisconsin, in the town of Ripon, the birthplace in 1854 of the Republican Party. And at a rally plastered with \"country over party\" banners, Harris appeared with staunch conservative Liz Cheney. As vice chair of the House January 6th Committee, Cheney became one of Donald Trump's fiercest critics. Liz Cheney: I have never voted for a Democrat, but this year, I am proudly casting my vote for Vice President Kamala Harris (applause)That proclamation spurred a chant of approval from the crowd…Bill Whitaker: Four years ago if someone had told you that you would be campaigning with Liz Cheney, what would you have said to them?Vice President Kamala Harris: That'd be great. (laughter)Liz Cheney: She's really diplomatic. (laughter)Bill Whitaker: Would you ever have thought that you'd be campaigning with Kamala Harris?Liz Cheney: I hope that if you had said to me four years ago, \"Our constitution is going to be under threat and it's gonna be crucial for the parties to come together-- and to support Vice President Harris because she'll defend the rule of law\"-- I know I would've said, \"That's exactly what I'll do.\"Whoever wins the presidency will take on a host of daunting challenges, especially beyond our borders. Back in Washington, Vice President Harris told us she's determined the U.S must win the economic competition with China for the 21st century. And as for the war between Russia and Ukraine?Bill Whitaker: What does success look like in ending the war in Ukraine?Vice President Kamala Harris: There will be no success in ending that war without Ukraine and the UN charter participating in what that success looks like.Bill Whitaker: Would you meet with President Vladimir Putin to negotiate a solution to the war in Ukraine?Vice President Kamala Harris: Not bilaterally without Ukraine, no. Ukraine must have a say in the future of Ukraine. Bill Whitaker: As president, would you support the effort to expand NATO to include Ukraine?Vice President Kamala Harris: Those are all issues that we will deal with if and when it arrives at that point. Right now, we are supporting Ukraine's ability to defend itself against Russia's unprovoked aggression. Donald Trump, if he were president, Putin would be sitting in Kyiv right now. He talks about, \"Oh, he can end it on day one.\" You know what that is? It's about surrender. Bill Whitaker: A hard left turn here. But-- you recently surprised people when you said that you are a gun owner and that if someone came into your house--Vice President Kamala Harris: That was not the first time I've-- I've--Bill Whitaker: --they would get shot.Vice President Kamala Harris: --talked about it. That's not the first time I've talked about it.Bill Whitaker: So what kind of gun do you own, and when and why did you get it?Vice President Kamala Harris: I have a Glock, and-- I've had it for quite some time. And-- I mean, look, Bill, my background is in law enforcement. And-- so there you go. Bill Whitaker: Have you-- ever fired it?Vice President Kamala Harris: Yes. (laugh) Of course I have. At a shooting range. Yes, of course I have.Democratic vice-presidential candidate Tim Walz was little-known outside Minnesota just two months ago. He didn't exactly come from nowhere. He was a six-term congressman and now is governor of Minnesota, where he has championed abortion rights, gun control, and other progressive ideas. But it was calling former President Trump and Sen. JD Vance \"weird\" that may have landed him on the ticket.Bill Whitaker: Two months ago, you and Kamala Harris barely knew each other. Now, you're running together, vying for the top offices in the land. It's not possible that you agree on everything.Gov. Tim Walz: Yeah.Bill Whitaker: What have been some disagreements you've had since you became a team?Gov. Tim Walz: Well—I—she'd probably disagreed with—she said, \"Tim, you know, you need to be a little more careful on how you say (laugh) things,\" whatever it might be. Whatever it might be, Walz has been criticized for embellishing or telling outright falsehoods about his military record, and about his travels to Asia in the 1980s.Bill Whitaker: In your debate with JD Vance, you said, \"I'm a knucklehead (laugh) at times.\" And I think you were referring to the time that you said that you were in Hong Kong during the Tiananmen Square unrest when you were not.Gov. Tim Walz: Yeah.Bill Whitaker: Is that kind of misrepresentation, isn't that more than just being a knucklehead?Gov. Tim Walz: I think folks know who I am. And I think they know the difference between someone expressing emotion, telling a story, getting a date wrong by--you--rather than a pathological liar like Donald Trump.Bill Whitaker: But I think it comes down to the question of whether—whether you can be trusted to tell the truth.Gov. Tim Walz: Yeah. Well-- I can-- I think I can. I will own up to being a knucklehead at times, but the folks closest to me know that I keep my word. Walz proudly touts his record as governor of Minnesota, but it also has opened him up to criticism from his Republican opponents.Bill Whitaker: Former President Trump says that you and your administration here in Minnesota has been dangerously liberal. Radical left, he calls it. So, what do you say to that criticism, that rather than leading the way, you and Minnesota are actually out of step with the rest of the country?Gov. Tim Walz: President Trump may be referring to that – that our children get breakfast and lunch in school so that they can learn. He may be talkin' about we have a paid family medical leave policy that was promoted by the business community. Donald Trump spends his time tearing down states rather than lifting up the things we do, the best of it. Donald Trump's critiques of that, not only are they wrong, but I'm waiting for, \"What—what is his solution? Here in Minnesota, we're so optimistic, we walk on water half the year (laugh).It was that kind of humor and candor that helped land Tim Walz the job as Kamala Harris's running mate.Bill Whitaker: Before you joined the– ticket, you called Republicans \"weird.\" And that's sort of become a rallying cry for Democrats. Why do you think that label stuck?Gov. Tim Walz: I was really talking about the behaviors. Being obsessed with people's personal lives in their bedrooms and their reproductive rights, making up stories about legal –folks legally here eating cats and dogs, they're dehumanizing. They go beyond weird because I said this: it becomes almost dangerous. Let's debate policy in a real way and let's try and find an objective truth again.Kamala Harris and Tim Walz are in a full sprint to November 5th, hoping their arguments will give them a chance to cross the line ahead of Donald Trump and JD Vance.Bill Whitaker: You are sitting here with us. The Trump campaign canceled an interview that they had agreed to, to participate in this broadcast. What do you make of that?Vice President Kamala Harris: If he is not gonna give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies. You're gonna hear conversations that are about himself and all of his personal grievances. And what you will not hear is anything about you, the listener. You will not hear about how he is gonna try to bring the country together, find common ground. And, Bill, that is why I believe in my soul and heart, the American people are ready to turn the page.Produced by Marc Lieberman and Rome Hartman. Associate producers: Cassidy McDonald, Matthew Riley and LaCrai Scott. Broadcast associates: Mariah Johnson and Georgia Rosenberg. Edited by Warren Lustig and Craig Crawford.","summary":"In a 2024 election interview, Vice President Kamala Harris discusses the economy, immigration, the ongoing Ukraine and Mideast wars, and the differences between herself and former President Trump.","url":"https://www.cbsnews.com/news/kamala-harris-2024-election-interview-60-minutes-transcript/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/746904a9-b05c-479e-ac29-14669055f254/thumbnail/1200x630/75a9f3edbd6cae6eac24164eb8f84f52/harris-video-whitaker.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:01:00","author":"Bill Whitaker","authors":["Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.15},{"id":258836632,"title":"How the Trump campaign is marking 1 year since Oct. 7 attack","text":"How the Trump campaign is marking 1 year since Oct. 7 attack\n Former President Donald Trump is marking one year since Hamas' Oct. 7 attack on Israel with events in New York and Florida. CBS News political correspondent Caitlin Huey-Burns has the details.","summary":"Former President Donald Trump is marking one year since Hamas' Oct. 7 attack on Israel with events in New York and Florida. CBS News political correspondent Caitlin Huey-Burns has the details.","url":"https://www.cbsnews.com/video/how-trump-campaign-marking-1-year-since-oct-7-attack/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/08/b11eb0ec-b6f4-4314-be18-35cf0a434170/thumbnail/1200x630/f11aaab3f34c325b53f71d8fd37ba7b2/cbsn-fusion-how-trump-campaign-marking-1-year-since-oct-7-attack-thumbnail.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-08 00:00:58","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.171},{"id":258836178,"title":"Joe Scarborough and other lefties’  ‘civil war’ shrieking exposes they’ve only got fear to run on","text":"MSNBC’s Joe Scarborough went on an epic rant Monday morning about the supposed threat of “civil war”; talking about the actual issues in this election, we guess, doesn’t help his ratings.\n\nOr maybe he thinks his team is losing on the merits.\n\nDonald Trump and his family are “preparing for civil war,” Scarborough fumed, focusing on weekend speeches by the ex-prez and running-mate J.D. Vance — including one in which Trump had the nerve to note that his enemies have “slandered me, impeached me, indicted me, tried to throw me off the ballot. And who knows? Maybe even tried to kill me.”\n\nAll of which is undeniably true.\n\nAnd pointing it out is fair game: Any Democrat so targeted sure wouldn’t stop talking about it. \n\nIt’s not just Scarborough pouring gas on the flames: President Biden himself hinted the same last week in discussing next month’s presidential election: “I don’t know whether it will be peaceful,” he warned.\n\n Really? Does the nation’s highest leader truly want Democrats to prepare for an actual, physical war they pretend Republicans are planning? Could anything be more irresponsible?\n\nYes, Jan. 6 was an outrage. But it was far from a true insurrection, and there’s no sign yet that we’ll see even that again this year.\n\nThese warnings are just a step up from Dems’ equally outlandish claims that a Trump victory spells the end of democracy — claims that provide the context for actual assassination attempts on Trump.\n\nIf anything, it’s Dems who’ve circumvented democracy, and not just by weaponizing the judicial system to try to bankrupt and even jail him.\n\nThe Harris-Biden folks have knowingly and proudly flouted Congress and laws dealing with the border, student loans, COVID mandates, eviction bans . . .\n\nWith their efforts to police “misinformation,” they seek to suppress free speech — the very cornerstone of democracy. \n\nThey want to pack the Supreme Court.\n\nTrue, they can’t run on the Harris-Biden record, which has done so much damage to the nation: Trump leads on every major issue — and even on abortion, the Democrats feel compelled to insist he has a secret (and politically impossible!) plan to completely outlaw it nationwide.\n\nAnd so they fall back on scaremongering.\n\nIf the left cared about the country’s future, they’d stick to policy disagreements, no matter how much of a losing battle that may be.","summary":"Warnings like one Joe Scarborough made Monday that Donald Trump is \"preparing for civil war\" is a dangerous as it is ludicrous.","url":"https://nypost.com/2024/10/07/opinion/joe-scarborough-lefties-warnings-of-civil-war-will-only-fan-the-flames-of-division/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-tklx5mtjk-1728340242324.jpg?quality=75&strip=all&1728325946&w=1200","video":null,"publish_date":"2024-10-08 00:00:47","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.113},{"id":258836648,"title":"Arizona election officials work to restore confidence in results","text":"With Donald Trump pulling out of his \"60 Minutes\" interview tonight, we'll turn to a different Republican who is paying the price for Trump's claims of a stolen 2020 election. Stephen Richer helps administer voting in Maricopa County, Arizona. That's Phoenix and home to 60% of Arizona voters. Maricopa is often decisive in a state which swings either way. Trump claimed Maricopa county was stolen in 2020. Republican Stephen Richer was determined to find the truth -- to restore belief in the ballot. He discovered that truth wasn't what many wanted to hear.Stephen Richer: I've become much more cynical about politics. There are a lot of people who have no lines in the sand. A lot of politicians. A lot of politicians for whom it's like oxygen, that if you told them they weren't going to be reelected, it would be like unplugging them from oxygen. So whichever way the winds are blowing, even if it's highly immoral, that they're on-- they're on for the ride. Scott Pelley: What are your fears for this coming Election Day?Stephen Richer: That we'll, we'll be doing this again for another four years.Nearly four years ago, Republican attorney Stephen Richer was the voter's choice for Maricopa County recorder, the office that records voter registration and handles ballots by mail. Richer took office after the 2020 vote when his own party was up in arms over allegations of fraud. It was Richer's first elected office and he knew what to do.Stephen Richer: They just need answers. It-- it-- it's not that complicated of an issue. It's just people are uncertain. They expected Donald Trump to win. I expected Donald Trump to win in Maricopa County. He didn't win. They have questions. As soon as we give them logical, factual answers, all will be well. Scott Pelley: And that's not what happened?Stephen Richer: That is not what happened.The 'logical, factual' answers came after multiple investigations. A hand recount of Maricopa County's 2.1 million paper ballots confirmed Joe Biden won. Statewide, prosecutions for illegal voting involved a total of 19 ballots. In Maricopa, 50 ballots had been counted twice for a typical reason.Stephen Richer: Somebody made a mistake. A human being made a mistake. There were 2.1 million ballots cast in the 2020 election. These 50 shouldn't have been tabulated. By no means were the 50 all for one candidate or another, so it had a negligible impact on the actual contest.Negligible too, because Trump lost Maricopa County by 45,109 votes.Scott Pelley: What evidence of widespread fraud was found in Maricopa County in 2020?Stephen Richer: Oh, none. And I would say Maricopa County's 2020 election is the most scrutinized election in human history.Scott Pelley: When you began to tell your fellow Republicans in Maricopa County that the election was fair and there was no fraud that would change the outcome, how did they react to you?Stephen Richer: Not well. Yeah. Not well at all. They included Trump, who said, \"the entire database of Maricopa County in Arizona has been deleted.(!)\" He called it an \"unbelievable election crime.\" Stephen Richer: It was a Saturday afternoon, and I was in the office looking at the very thing that he was-- saying we had deleted. And so just sort of the-- like, the-- the-- the-- the ludicrous nature of it, it just is-- is-- is offensive. Scott Pelley: What did you say in response to what the president had written?Stephen Richer: I said something like, \"This is unhinged. I'm looking at the voter registration database right now. These lies have to stop. This is as disprovable as saying two plus two equals five.\"Scott Pelley: And the reaction was what?Stephen Richer: The reaction was significant. Three violent threats to Stephen Richer have been prosecuted. One man got three-and-a-half years. The others are awaiting trial.Undaunted, Richer explained the facts. Here, in 2021, he was heckled and followed to his car. Stephen Richer: People were banging on my windshield as I got into the car. Scott Pelley: What were they shouting? Stephen Richer: \"Turncoat,\" \"You're wrong,\" \"You're an idiot,\" \"Don't be a traitor,\" \"How could you?\" The fever has never broken. This was three months ago.Stephen Richer: I do not believe the 2020 election was stolen. Response: Boooooo!Scott Pelley: So why do so many people remain passionately unconvinced?Stephen Richer: I think it has become-- the-- the-- the tattoo. I think it has become the tattoo to show that you're a true believer of the movement.Scott Pelley: You believe the election was stolen.Shelby Busch: I do.Shelby Busch started a political action committee which investigates what she calls widespread fraud in Maricopa County—fraud no credible investigation has found. She's taken in nearly a million dollars in donations for the work of her PAC. And the Arizona Republican Party awarded her the leadership of its delegation at last summer's national convention. Shelby Busch: …and that's why I, Shelby Busch, the delegation chair and our wonderful state chairwoman Gina Swoboda and this entire delegation counts their 43 delegates to Donald J. Trump. Scott Pelley: You are a rising star in the state party.Shelby Busch: Well, I definitely have brought some attention onto myself, that is for sure.Scott Pelley: What do you believe happened in the Maricopa vote in 2020?Shelby Busch: I believe that fraudulent votes were put into the system. I also believe that a lot of-- state statutes and regulations and policies were broke, which makes the election questionable at best.Busch still questions whether signature verification was proper and whether some ballots were collected illegally. She's an administrator in a medical practice.Scott Pelley: You're self-educated--Shelby Busch: That's correct--Scott Pelley: --when it comes to elections.Shelby Busch: That's correct.Scott Pelley: In a recent case a judge disqualified you from testifying in the case because he said you were, quote, \"Obviously unqualified... not even in the ballpark.\"Shelby Busch: That's one judge's opinion. who is a radical leftist who is legislating from the bench and I don't believe that it had any merit in my credibility whatsoever.Scott Pelley: Is there a danger in undermining people's faith in the election system by persisting with these conspiracy theories that no one has been able to validate?Shelby Busch: Again, I'm going to disagree with you, sir, respectfully-- it has been validated. And because--Scott Pelley: Where? By whom?Shelby Busch: The election officials--Scott Pelley: Give me-- give me a court case. Give me something.Shelby Busch: I don't need a government official with a vested interest in disproving information to tell me whether what I have is valid. It's up to each individual citizen, as a member of this society, to review the evidence, to think for themselves and make those decisions.Scott Pelley: It's valid 'cause you say it is.Shelby Busch: I say it's valid because I say it is. And if somebody looks at it, they can determine whether it's valid. The evidence speaks for itself. Data does not lie. Data doesn't lie. Election officials do.Ben Ginsberg: The election was not stolen, it was lost.Attorney Ben Ginsberg has represented the Republican Party in many of its most important election cases. In 2022, he joined conservative judges and senators in \"Lost, Not Stolen,\" an investigation that exposes election fraud lies. Part of it centers on Trump's swing state lawsuits.Ben Ginsberg: Donald Trump and his supporters brought 64 cases. They lost 63 of them outright. There was one that was a partial victory involving 200 votes, far from outcome determinative.Scott Pelley: And all of that told you what?Ben Ginsberg: The evidence to back up the allegations of fraud and elections being unreliable simply does not exist.Scott Pelley: The election deniers in Arizona will say, \"We did lose all those cases, but the judges weren't fair.\"Ben Ginsberg: Under the rule of law, you have every right to submit your litigation. But under the rule of law, a conservative principle, a Republican principle for as long as I've been practicing election law, you have to accept the rulings of the court.Shelby Busch: I don't have time, frankly, to worry about whether people believe me or question my integrity. I have what I believe is the mission that I am on, and that mission is for my children and my grandchildren. I'm not here to make friends. I am here to do a job.Scott Pelley: Where does that mandate for that mission come from?Shelby Busch: It comes from my own personal drive, and it also comes from, I believe, a calling from God.It has been a calling for many, over nearly four years, in meetings of the Republican-led Maricopa County Board of Supervisors, which certifies the vote.Scott Pelley: Have you been accused of treason?Clint Hickman: Oh yeah. treason-- murdering fellow officials that would talk.Republican Clint Hickman has been a county supervisor 11 years. In 2020 he was among Trump's most loyal supporters. Clint Hickman: Still proud that he took the time to call me out and thank me for the work that I was trying to accomplish But Hickman saw no evidence of fraud and said so when he voted to certify the election.Scott Pelley: You've received a number of death threats.Clint Hickman: I've lost count. I have lost count. And so have my colleagues. And so have-- so have election workers.Scott Pelley: Well, you've lost count, but here's one.Voicemail: Hello Mr. Hickman, I am glad that you are standing up for democracy and want to place your hand on the Bible and say that the election was honest and fair. I really appreciate that. When we come to lynch your stupid lying Commie ass, you'll remember that you lied on the f***ing Bible, you piece of s**t. You're gonna die, you piece of s**t. We're going to hang you. We're going to hang you.That man is in prison for two-and-a-half years. But there were others. Clint Hickman: But the chilling one that you didn't play is one of the guys said, \"We know the restaurants that you are in. And we know where your kids go to school.\" Menace grew in the shadows and emerged on the stage. Shelby Busch: I hear the word \"unity\" and I get sick to my stomach. Because there is a lot of earthly, fake and vile unity talk going around in our state. This is Shelby Busch, the Maricopa County Republican Party vice-chair, talking about fellow Republican Stephen Richer this past March. Shelby Busch: So what does unity mean to me? It means unifying with those that share the core biblical, Christian—Judeo principles that we share. That's unity. But if Stephen Richer walked in this room, I would lynch him. I don't unify with people who don't believe in the principles we believe in and the American cause that founded this country. Scott Pelley: When you heard Shelby Busch say that she would lynch you--Stephen Richer: Yeah.Scott Pelley:--you thought what?Stephen Richer: I first thought like, \"Why is that word in your vocabulary?\" Lynch is a weirdly historically loaded and oddly specific term. Busch offered a modified definition of lynching. Shelby Busch: I think many people are familiar with a political lynching. It's-- it's referred to as-- destroying someone's career. It was not ever meant physically in any way, shape, or form. Probably a poor choice of words. Scott Pelley: You have seen the unrest in this county. The civil disorder in this county. You're contributing to that.Shelby Busch: What I am doing is I am shining a big bright light on the disdain and the arrogance of some of the elected officials. They are elected to represent the interests of the people. And until they are ready to step up and do that, then there will be unrest. Scott Pelley: Is election denialism a swindle?Stephen Richer: Oh, 100% so for some people. It's a swindle emotionally for some. It's a swindle politically for some. It's a swindle economically for some. This past July, Stephen Richer ran in the primary for reelection. He lost to a fellow Republican who said Maricopa elections are a \"laughing stock.\" Richer moves on after this election, leaving behind his enduring contribution -- the fortress defenses around the center where the votes are counted—a wall to defend America from Americans.Stephen Richer: I have seen some ugliness in the character of human beings. It has given me great insight into horrific moments of human history. I would look at some of these historical moments and say, like, \"Well, that-- that--that couldn't happen here.\" But moments like these begin to give you insight on how stuff like that can build up, how the animal passions, how going along with the crowd, how the emotions of just being your side versus their side. It's just to say that some of the same human impulses-- that I didn't understand, I now do understand.Scott Pelley: You understand how things can go wrong?Stephen Richer: I understand how a society of educated people can do something truly horrible.Produced by Aaron Weisz and Ian Flickinger. Broadcast associate, Michelle Karim. Edited by Sean Kelly.","summary":"Republican election officials in Maricopa County, Arizona, are working to restore faith in elections amid former President Trump's false claims that the 2020 election was stolen.","url":"https://www.cbsnews.com/news/maricopa-election-officials-work-to-restore-belief-in-ballot-60-minutes-transcript/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/06/c12e09a1-9c7b-46c6-985c-999367850662/thumbnail/1200x630/553fc56b2194b0e22e42176308ae35f8/01.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378455619562/3247835_hls/master.m3u8","publish_date":"2024-10-08 00:00:42","author":"Scott Pelley","authors":["Scott Pelley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.474},{"id":258836624,"title":"How 60 Minutes found out Trump would not participate in election special","text":"It's been a tradition for more than half a century that the major party candidates for president sit down with 60 Minutes in October. In 1968, it was Richard Nixon and Hubert Humphrey. This year, Vice President Kamala Harris and former President Donald Trump accepted invitations. Unfortunately, last week, Trump canceled. The Trump campaign had said that the interview would be this past Thursday at Mar-A-Lago, Trump's Florida home. It also asked whether 60 Minutes would meet 78-year-old Trump in Butler, Pennsylvania, where the Republican candidate for president was grazed by a bullet in an assassination attempt. 60 Minutes agreed. On Sept. 9, Trump communications director Steven Cheung sent a text that read: \"I'm working with our advance team to see logistically if Butler would work in addition to the sit down.\"Days later, Cheung called to say \"the president said yes.\"Then, a week ago, Trump backed out. The campaign offered shifting explanations. First, it complained that 60 Minutes would fact check the interview. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsKamala Harris and Tim Walz: More from their 60 Minutes interviews\"There were initial discussions, but nothing was ever scheduled or locked in,\" Cheung said in a post on X, formerly Twitter. \"They also insisted on doing live fact checking, which is unprecedented.\"60 Minutes fact checks every story it broadcasts. Later, Trump said he needed an apology for his interview in 2020. Trump claims correspondent Lesley Stahl said, in that interview, that Hunter Biden's controversial laptop came from Russia. She never said that. \"Where's my apology? They should apologize,\" Trump said on Tuesday night at a Milwaukee press conference. \"They were wrong on everything. So I'd like to get an apology. So I've asked them for an apology.\"Trump has said Harris doesn't do interviews because she can't handle them. He has declined to participate in a second debate with Harris. So the Monday night election special may have been the last opportunity between now and Election Day for a national audience to hear from both candidates on a range of issues, including the economy, immigration, reproductive rights and the wars in the Middle East and Europe. Both campaigns understood this special would go ahead if either candidate backed out. Harris, who participated in an interview with 60 Minutes, addressed the issue.\"If he is not going to give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies,\" Harris said. \"You're going to hear conversations that are about himself and all of his personal grievances.\"","summary":"Voters will not hear directly from former President Donald Trump during the 60 Minutes election special. Trump, after initially accepting, later declined to participate.","url":"https://www.cbsnews.com/news/donald-trump-2024-60-minutes-interview-what-happened/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/f5c45c3c-d4de-4358-8a9e-9d819ada225a/thumbnail/1200x630/a932cf4983dff3ef33612866d57ca9fd/gettyimages-2176516555.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378477635890/3248187_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":null,"language":"en","source_country":"US","sentiment":-0.308},{"id":258836628,"title":"Tim Walz, after misspeaking on his record, says \"folks know who I am\"","text":"Unlike his running mate, who has been on the national stage for many years, Democratic Gov. Tim Walz was little-known outside Minnesota just two months ago.He's been on a much bigger stage and facing more intense scrutiny since Vice President Kamala Harris chose him as her running mate in August. The six-term congressman and current governor of Minnesota has championed abortion rights, gun control and family and medical leave in his state. On the campaign trail, he is working to win over voters in other states.Walz' background and recordWalz promoted his background as having worked as a bipartisan member of Congress while representing a Republican district before being elected as governor.\"That sense of service fits with what I think people think this job is. This is not about you. This is about the American people,\" he said. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsTwo months ago, Walz and Harris barely knew each other. Now they're running together for the top office in the land. If elected, he says he knows what his role will be. \"I'm part of this team, but it will be President Harris,\" Walz said. Walz proudly touts his record as governor of Minnesota, but it also has opened him up to criticism from his Republican opponents. Former President Donald Trump has said that Walz and his administration have been dangerously liberal. \"Donald Trump spends his time tearing down states rather than lifting up the things we do, the best of it. Donald Trump's critiques of that, not only are they wrong, but I'm waiting for, 'what is his solution,'\" Walz said.Republicans question Walz' backgroundWalz has been criticized for misstating some facts about his military record and his travels to Asia in the 1980s. He recently referred to himself as a \"knucklehead,\" referencing a time that he said that he was in Hong Kong during the Tiananmen Square crackdown when he wasn't. Walz has said he \"misspoke on this.\"60 Minutes correspondent Bill Whitaker asked about any disagreements Walz and Harris have had since they became a team.\"Well, I, she'd probably disagreed with – she said, 'Tim, you know, you need to be a little more careful on how you say things,' whatever it might be.'\"Walz said those closest to him know he keeps his word and that people know who he is. \"And I think they know the difference between someone expressing emotion, telling a story, getting a date wrong, rather than a pathological liar like Donald Trump,\" he said.Where \"weird\" came fromBefore he joined the ticket, Walz became known for his folksy criticism of Donald Trump and JD Vance. He called the GOP standard-bearers \"weird\", and it quickly became a rallying cry for Democrats.\"I was really talking about the behaviors: being obsessed with people's personal lives in their bedrooms and their reproductive rights, making up stories about legal folks, legally here eating cats and dogs, they're dehumanizing. They go beyond weird because I said this: it becomes almost dangerous,\" Walz said. \"Let's debate policy in a real way. And let's try and find an objective truth again.\"","summary":"Kamala Harris running mate Tim Walz has been criticized for embellishing or telling outright falsehoods about his military record and his travels to Asia","url":"https://www.cbsnews.com/news/tim-walz-2024-election-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/71a6208d-ed6f-4f08-b6f7-5259abbc1d60/thumbnail/1200x630/dc22d59f914b123db5fb039c62221057/tim-walz-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.043},{"id":258836630,"title":"What Kamala Harris says her tax plans mean for voters","text":"Vice President Harris is proposing a tax increase on the wealthiest Americans to help fund an expansion of the child tax credit, along with tax breaks for first-time home buyers and people starting small businesses. The nonpartisan Committee for a Responsible Federal Budget estimates that Harris' economic plan would add more than $3 trillion to the federal deficit over the next decade, while Trump's plan would increase the debt by $7.5 trillion. Harris has defended her plan, arguing that economists who've reviewed it say it would strengthen America's economy.\"My plan is about saying that when you invest in small businesses, you invest in the middle class, and you strengthen America's economy,\" Harris said. \"Small businesses are part of the backbone of America's economy.\"Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsTo pay for her plan, Harris would raise taxes on high-income earners.\"It is not right that teachers and nurses and firefighters are paying a higher tax rate than billionaires and the biggest corporations,\" Harris said. She'll also need to get her plan through Congress.\"There are plenty of leaders in Congress who understand and know that the Trump tax cuts blew up our federal deficit,\" Harris said.Harris' plan to increase the corporate tax rate from 21% to 28% would raise revenue by about $900 billion through 2035.What Americans are experiencing in their day-to-day livesThere are many signs that the American economy is doing well. America's employers added 254,000 jobs in September and the unemployment rate dropped for a second straight month, from 4.2% in August to 4.1% in September. The Federal Reserve last month cut its benchmark interest rate for the first time in more than four years.Despite all that, many Americans don't seem to be feeling it. Some voters blame the Biden-Harris administration for the high cost of groceries.\"We now have historic low unemployment in America among all groups of people. We now have an economy that is thriving by all macroeconomic measures,\" Harris said. \"And, to your point, prices are still too high.\"Part of Harris' plan to target high prices is a federal ban on price gouging for food and groceries.","summary":"The economy has weighed heavily on voters' minds as the Nov. 5 presidential election nears. Vice President Kamala Harris shares her plans.","url":"https://www.cbsnews.com/news/kamala-harris-economy-tax-plan-60-minutes/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/08fbb741-f996-4fb4-806a-9853a048fa5c/thumbnail/1200x630/265400c70c6eeeed7710773b7ab16a40/harris-tax-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","source_country":"US","sentiment":-0.341},{"id":258836634,"title":"Kamala Harris on whether Israel's Netanyahu is a close U.S. ally","text":"aOne year after Hamas launched a deadly cross-border attack into Israel on Oct. 7, Vice President Kamala Harris reiterated her call for the war to end as the death toll climbs. The Biden-Harris administration has pushed for a cease-fire, but the White House's relationship with Israeli Prime Minister Benjamin Netanyahu has been tested as he charts his own course -- sometimes against the urging of the president and vice president.\"We're not going to stop pursuing what is necessary for the United States to be clear about where we stand on the need for this war to end,\" Harris said. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsShe maintained that Israel, which is still working to recover hostages taken into Gaza, has a right to defend itself, but said that \"far too many innocent Palestinians have been killed.\"While the bulk of Israel's focus has been on Hamas in Gaza, Israel in late September began increasingly targeting the operations of the Iran-backed militant group Hezbollah in Lebanon. For months, the group has been firing rockets into Israel from southern Lebanon. Now Israel is responding with airstrikes and, what it calls a limited ground operation into Lebanon, fueling fears of a broader war in the Middle East.President Biden has called for a cease-fire in Lebanon, raising more questions about the relationship between Mr. Biden and Netanyahu. \"I think, with all due respect, the better question is, do we have an important alliance between the American people and the Israeli people,\" Harris said. \"And the answer to that question is yes.\"","summary":"One year after Oct. 7, Harris answers questions about the U.S. relationship with Israeli Prime Minister Benjamin Netanyahu as war in the Middle East continues.","url":"https://www.cbsnews.com/news/kamala-harris-israel-war-one-year-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/7f5a88ee-4d6e-496e-80bf-15cd0be3cddd/thumbnail/1200x630/f763c531de543e44b38439c7a7e5246c/harris-israel-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.402},{"id":258836638,"title":"Kamala Harris defends record on immigration: \"Solutions are at hand'","text":"Vice President Kamala Harris is campaigning on a pledge to toughen border restrictions as Republicans hammer her over the Biden-Harris administration's record on immigration.Harris in late September visited the U.S.-Mexico border for the first time as the Democratic presidential nominee and embraced President Biden's recent crackdown on asylum seekers, which produced an almost immediate and dramatic decrease in the number of border crossings. Harris said she would take it even further. Immigration problems are nothing new, but there was a record number of undocumented immigrants coming across the border during the first three years of the Biden-Harris administration after pandemic-era immigration policies and other restrictions were loosened.\"Solutions are at hand. And from Day One, literally, we have been offering solutions,\" Harris said.Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsShe pointed to the recent decrease in illegal immigration: Border crossings plunged this year, with illegal crossings at the southern border reaching the lowest point of President Biden's administration in September, according to internal Department of Homeland Security statistics obtained by CBS News.Earlier this year, bipartisan legislation aiming to overhaul the immigration system failed in Congress after Trump urged Republicans to oppose it.\"We need Congress to be able to act to actually fix the problem,\" Harris said. As vice president, Harris' responsibilities on the immigration issue have often been mischaracterized by her political opponents. Mr. Biden in 2021 tasked Harris with leading the administration's diplomatic efforts to address the \"root causes\" of migration from Central America's Northern Triangle — Guatemala, Honduras and El Salvador. Trump has wrongly called Harris the administration's \"border czar.\"","summary":"Republicans have pounded Vice President Kamala Harris on immigration. She's announced plans to enact tougher border restrictions and has called on Congress to act on long-term solutions.","url":"https://www.cbsnews.com/news/kamala-harris-immigration-border-60-minutes/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/eb166293-3ab4-4662-8454-0fa1053e20f7/thumbnail/1200x630/652732bb0a50f8761d5a57d7af0231b2/harris-immigration-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.496},{"id":258836640,"title":"Vice President Harris, Gov. Walz 60 Minutes' interview highlights","text":"Vice President Kamala Harris has been the Democratic candidate for president for less than three months. In that time, she's dealt with unrelenting attacks from former President Donald Trump as she's defended her record and pitched herself and her plans to the American public.This week on 60 Minutes, correspondent Bill Whitaker interviewed Harris and running mate Gov. Tim Walz to learn more about the Democratic ticket's plans on the economy, immigration, foreign affairs and more.It is the third time Whitaker has interviewed Harris and his first sit-down with Walz. The interviews were conducted with less than a month to go before the Nov. 5 election, when Harris and Walz will face off against former President Donald Trump and his running mate, Sen. JD Vance.One year after the Hamas terror attack on Israel, Harris discusses war in the Middle East Whitaker asked Harris if the U.S. lacks influence over Israeli Prime Minister Benjamin Netanyahu and whether he is a close ally. President Biden's White House has called for a cease-fire in Gaza, but Israel has pressed on with the war. The administration also called for a cease-fire in Lebanon, before Israel expanded its bombardment there. \"I think, with all due respect, the better question is do we have an important alliance between the American people and the Israeli people,\" Harris said. \"And the answer to that question is yes.\"How Harris says she'll handle Putin, the Ukraine warWhile the Israel-Hamas war has dominated headlines over the last year since Hamas launched the Oct. 7 terror attack, the Ukraine-Russia war has been grinding on for more than two years. Harris said she would not meet with Russian President Vladimir Putin to negotiate an end to the war without Ukraine's involvement. \"Ukraine must have a say in the future of Ukraine,\" she said. \"Donald Trump, if he were president, Putin would be sitting in Kyiv right now. Let's be clear about that. He talks about, 'Oh, he can end it on Day One.' You know what that is? It's about surrender.\"Harris responds to Trump's decision not to sit down with 60 MinutesVoters will not hear directly from former President Donald Trump during the 60 Minutes election special. Trump, after initially accepting, later declined to participate.\"If he is not going to give your viewers the ability to have a meaningful, thoughtful conversation, question and answer with you, then watch his rallies,\" Harris said. \"You're going to hear conversations that are about himself and all of his personal grievances.\"Voters' top concern: the economyThe economy tops voters' concerns as Election Day nears, but Harris defended the Biden administration's record, pointing to low unemployment numbers. She also touted her campaign proposals to institute a federal ban on price gouging on food and groceries, expand the child tax credit and give tax breaks to first-time home buyers and people starting small businesses.Whitaker asked how she intends to pay for her plans and get them through Congress.\"One of the things is I'm going to make sure that the richest among us who can afford it pay their fair share in taxes,\" Harris said. \"It is not right that teachers and nurses and firefighters are paying a higher tax rate than billionaires and the biggest corporations.\"Harris defends immigration record, shares plans for the futureHarris recently visited the southern border and embraced President Biden's recent crackdown on asylum seekers. \"It's a longstanding problem,\" Harris said. \"And solutions are at hand. And from Day One, literally, we have been offering solutions.\"Longer-term, Harris said, \"We need Congress to be able to act to actually fix the problem.\" Earlier this year, bipartisan border security legislation failed after Trump urged Republicans to oppose it.\"Donald Trump got word that this bill was afoot and could be passed,\" she said, \"...and he wants to run on a problem instead of fixing a problem, so he told his buddies in Congress, 'Kill the bill. Don't let it move forward.'\"Gov. Tim Walz on the national stageUnlike his running mate, who has been on the national stage for many years, Democratic vice presidential candidate Gov. Tim Walz was little-known outside Minnesota just two months ago. Since Harris chose him as her running mate in August, he's been on a much bigger stage, and facing more scrutiny than ever before. He's been criticized for misstatements about his military record and about his travels to Asia in the 1980s.In his debate with Trump running mate Sen. JD Vance, Walz said, \"I'm a knucklehead at times.\" \"I think folks know who I am,\" Walz told Whitaker, adding that he believes people know the difference between someone like him and a \"pathological liar like Donald Trump.\"","summary":"60 Minutes correspondent Bill Whitaker interviewed Vice President Kamala Harris and Gov. Tim Walz ahead of the 2024 election.","url":"https://www.cbsnews.com/news/kamala-harris-tim-walz-60-minutes-interview-highlights-2024-election/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/73e72b4e-6c5d-4f09-992c-ce7a81445378/thumbnail/1200x630/27466c16acb311985a56a4da15a780f9/60-minutes-full-episode-10-7-24.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.072},{"id":258836642,"title":"Arizona election officials subjected to violent threats","text":"With just weeks to go until Election Day, election officials continue to face threats in Maricopa County, Arizona: a county that's been a hotbed of voter fraud misinformation since former President Donald Trump lost to President Biden in 2020.Trump lost Maricopa County to Mr. Biden in 2020 by 45,109 votes. The former president falsely claimed the election was stolen. Republican Stephen Richer was elected as Maricopa County recorder in 2020. In 2021, he took over the office, which records voter registration and handles ballots by mail in the county. He explains no widespread fraud has been found in the county's 2020 election, which he believes is the \"most scrutinized election in human history.\" Still, allegations of fraud persist. Reviewing the results of the 2020 electionRicher took office after the 2020 election, when his own party was up in arms over allegations of fraud. It was Richer's first elected office and he knew what to do.\"They just need answers,\" Richer said he thought. \"It's not that complicated of an issue. It's just people are uncertain. They expected Donald Trump to win. I expected Donald Trump to win in Maricopa County. He didn't win. They have questions. As soon as we give them logical, factual answers, all will be well.\"But that's not what happened. There were multiple investigations. The Republican-led State Senate commissioned a hand recount of Maricopa County's 2.1 million paper ballots, which reconfirmed Mr. Biden won. Statewide, prosecutions for illegal voting involved a total of 19 ballots. In May of 2021, Trump said \"the entire database of Maricopa County in Arizona has been deleted,\" calling it an \"unbelievable election crime.\" Richer remembers being in the office on a Saturday afternoon looking at a database Trump was saying had been deleted. \"The ludicrous nature of it, it just is offensive,\" he said. Richer called for the \"lies\" to stop.\"This is as disprovable as saying two plus two equals five,\" he said. Election officials face threatsRicher faced threats after he spoke out and defended the county's results. After a meeting in 2021, Richer says he was heckled and followed to his car. Three violent threats to Richer have been prosecuted. Frederick Francis Goltz, who pleaded guilty to a charge of interstate threatening communications, was sentenced to three-and-a-half years in prison. The others are awaiting trial.The threats didn't stop after 2020. Just months ago, Richer was booed when he said he didn't believe the 2020 election was stolen.He's far from alone in facing threats. Republican Clint Hickman served as the chairman of the Maricopa County Board of Supervisors in 2020, which is responsible for certifying the election. He has been a supervisor on the board for 11 years and was among Trump's most loyal supporters in 2020. Then-President Trump publicly thanked him in 2020 at a campaign rally days before the election. But after all the votes were tallied, Hickman found no evidence of fraud and said so when he and the Republican majority Board of Supervisors voted to certify the county's election. Since then, he says he has been accused of treason and received death threats.\"I've lost count. I have lost count,\" Hickman said. \"And so have my colleagues. And so have election workers.\"In one instance, Hickman got a call from Mark A. Rissi, who threatened to \"lynch your stupid lying Commie a—.\" Rissi, who in the voicemail went on to threaten to hang him, received a two-and-a-half year prison sentence after he pleaded guilty to sending threatening communications. Hickman recalled another message he received he called \"chilling\".The caller stated, \"'We know the restaurants that you are in. And we know where your kids go to school,'\" Hickman said.Ongoing allegations of fraudMaricopa County Republican Party vice-chair Shelby Busch started a political action committee which investigates what she claims is widespread fraud in Maricopa County's elections. \"What I am doing is, I am shining a big bright light on the disdain and the arrogance of some of the elected officials,\" she said. \"They are elected to represent the interests of the people. And until they are ready to step up and do that, then there will be unrest.\"Busch believes state statutes and regulations were violated. She still questions whether signature verification was proper and whether some ballots were collected illegally. In a recent case, a judge disqualified Busch — an administrator in a medical practice — from testifying as an expert because he said she was \"obviously unqualified...not even in the ballpark.\"\"That's one judge's opinion who is a radical leftist who is legislating from the bench and I don't believe that it had any merit in my credibility whatsoever,\" she said.\"60 Minutes\" correspondent Scott Pelley asked Busch if there was any danger in undermining people's faith in the election system by continuing to share unvalidated conspiracy theories about the election.Busch disagreed with Pelley, saying she believed allegations of fraud have been validated.\"I don't need a government official with a vested interest in disproving information to tell me whether what I have is valid. It's up to each individual citizen, as a member of this society, to review the evidence, to think for themselves and make those decisions,\" she said.Busch called for people to determine what's valid and said she doesn't have time to worry about whether people believe her.\"I have what I believe is the mission that I am on, and that mission is for my children and my grandchildren,\" she said. \"I'm not here to make friends. I am here to do a job.\"In a speech, recorded on video earlier this year, Busch said she would \"lynch\" Richer. \"If Stephen Richer walked in this room, I would lynch him,\" she said in March. \"I don't unify with people who don't believe in the principles we believe in and the American cause that founded this country.\"Busch later said she was referring to a \"political lynching.\"\"It's referred to as destroying someone's career. It was not ever meant physically in any way, shape, or form,\" Busch said. \"Probably a poor choice of words.\"What's next for Maricopa CountyRicher, who fought to defend the legitimacy of Maricopa's elections, lost his reelection bid this July during the Republican primary election.\"I've become much more cynical about politics. There are a lot of people who have no lines in the sand. A lot of politicians,\" Richer said. \"A lot of politicians for whom it's like oxygen, that if you told them they weren't going to be reelected, it would be like unplugging them from oxygen. So whichever way the winds are blowing, even if it's highly immoral, that they're on for the ride.\"He worries about what may happen on Nov. 5 and in the aftermath that allegations of widespread fraud and threats of violence against election officials could continue.Fighting election fraud allegations across the countryArizona isn't the only state dealing with false claims of widespread election fraud in the 2020 contest. A group of prominent conservatives, including attorney Ben Ginsberg, spent a year investigating claims the 2020 election was stolen. The group, which includes conservative judges and senators, authored \"Lost, Not Stolen,\" an investigation that exposes election fraud lies. \"The evidence to back up the allegations of fraud and elections being unreliable simply does not exist,\" Ginsberg said.Part of the report centers on Trump's swing state lawsuits. \"Donald Trump and his supporters brought 64 cases. They lost 63 of them outright,\" Ginsberg explained. The case they won related to a small number of ballots \"far from outcome determinative,\" he says. Election deniers have said that they lost in court because the judges weren't fair.\"Under the rule of law, you have every right to submit your litigation,\" Ginsberg said. \"But under the rule of law, a conservative principle, a Republican principle for as long as I've been practicing election law, you have to accept the rulings of the court.\"","summary":"Republican officials in Maricopa County, Arizona have faced threats after speaking out in defense of election results.","url":"https://www.cbsnews.com/news/voter-fraud-threats-maricopa-county-arizona-60-minutes/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/06/838e4501-7630-43e8-ae6d-5051ef4fe1a8/thumbnail/1200x630/9e3e8f19b2b47e93f4781acf093e4747/03.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378455619562/3247835_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Scott Pelley","authors":["Aliza Chasan","Scott Pelley"],"language":"en","category":"politics","source_country":"US","sentiment":-0.451},{"id":258836646,"title":"Kamala Harris fighting to \"earn everyone's vote\" in leadup to Nov. 5 election","text":"In the final countdown to the election, Vice President Kamala Harris is defending her record and making her case for the presidency while dealing with unrelenting attacks from former President Donald Trump. The Democratic Party rallied around Harris and her running mate, Minnesota Gov. Tim Walz, after President Biden dropped his reelection bid in July. Supporters across the country responded with relief and optimism in the early days of Harris' candidacy, but the race remains extremely close. \"I take it seriously that I have to earn everyone's vote,\" Harris said. \"This is an election for president of the United States. No one should be able to take for granted that they can just declare themselves a candidate and automatically receive support. You have to earn it. And that's what I intend to do.\"A quarter of registered voters in a recent poll said they need to learn more about Harris, even though she's been vice president for nearly four years and has been on the national stage for even longer. Critics say the reason so many voters don't have a clear picture of Harris is because she's changed her position on so many issues. She was against fracking, but now supports it; she supported looser immigration policies, but is now in favor of tougher restrictions; she was for Medicare for all, but now she's not. Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviewsHarris defended her evolution, saying it reflects her experience as vice president seeking common ground.\"What the American people do want is that we have leaders who can build consensus,\" she said. \"Where we can figure out compromise and understand it's not a bad thing, as long as you don't compromise your values, to find common-sense solutions. And that has been my approach.\"Building that consensus also involves bridging the gap in a politically divided America. \"I believe that the people of America want a leader who's not trying to divide us and demean,\" Harris said. \"I believe that the American people recognize that the true measure of the strength of a leader is not based on who you beat down, it's based on who you lift up.\"Late last week, Harris was in Ripon, Wisconsin — the 1854 birthplace of the Republican Party. She was joined by staunch conservative and former U.S. Rep. Liz Cheney at a rally plastered with \"country over party\" banners.\"I have never voted for a Democrat, but this year, I am proudly casting my vote for Vice President Kamala Harris,\" Cheney said to applause at the rally. As vice chair of the House January 6th committee, Cheney became one of Trump's fiercest critics.\"I hope that if you had said to me four years ago, 'Our constitution is going to be under threat and it's going to be crucial for the parties to come together and to support Vice President Harris because she'll defend the rule of law,' I know I would've said, 'That's exactly what I'll do,'\" Cheney said.","summary":"Vice President Kamala Harris is in the midst of a whirlwind campaign as she works to sway undecided voters before the Nov. 5 election.","url":"https://www.cbsnews.com/news/kamala-harris-election-support-60-minutes/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/07/4b33ba70-5d59-4c18-877a-51263c6f762b/thumbnail/1200x630/5e8a8341a136820ab75351857bf45a36/harris-votes-article.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378476099866/3248196_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Aliza Chasan,Bill Whitaker","authors":["Aliza Chasan","Bill Whitaker"],"language":"en","category":"politics","source_country":"US","sentiment":-0.089},{"id":258836654,"title":"More from Vice President Harris and Gov. Walz","text":"This week on 60 Minutes, correspondent Bill Whitaker followed the Democratic ticket for president and vice president, both in Washington DC and on the campaign trail in Wisconsin.With only four weeks to go until election day and mail-in ballots already being marked, 60 Minutes watched as Vice President Kamala Harris and Gov. Tim Walz campaigned in the battleground state, making their appeal to voters Harris otherwise could have met months ago during a more traditional election cycle.Here is more of Whitaker's interviews with Harris and Walz.Was democracy best served without a Democratic primary?When President Joe Biden stepped out of the race for reelection in July, he immediately endorsed Harris, who assumed the role of presidential hopeful a year later than candidates ordinarily do in modern American elections. In addition to a truncated timeline for campaigning, Harris won the nomination without having to fight fellow Democrats in a primary. Whitaker wanted to know: Was democracy best served by side-stepping the traditional primary process? \"I am proud to have earned the support of the vast majority of delegates, and to have been elected the Democratic nominee,\" Harris answered. \"I am honored to have received the endorsement of leaders around this country from every background and walk of life, to fight in this election over the next month for our democracy.\"Kamala Harris makes the case in 60 Minutes interview for why she should be presidentVice President Kamala Harris, Gov. Tim Walz 60 Minutes' interview highlightsHow 60 Minutes found out Donald Trump would not participate in an election specialKamala Harris and Tim Walz: More from their 60 Minutes interviews Ordinarily, a lengthy primary process gives candidates enough time to get to know voters â and be known by them. Because she did not spend months speaking to reporters and debating other candidates, Harris has had to make up for lost time with undecided voters who say they simply do not know who she is.\"It is, without any question, a short period of time,\" Harris acknowledged. \"There's no question about that. Which is why I'm traveling around our country from one state to the next, to the next. It is my responsibility to earn the vote, and I'm going to work to do that.\"The fear of election-related violenceAmid a deeply polarizing election that has seen two assassination attempts against former President Donald Trump, three-quarters of likely American voters say they are concerned about the possibility of election violence. What role does Harris think she should play in lowering the temperature?The vice president told Whitaker she was \"deeply disturbed, shocked, and shaken\" by the potential assassinations and said she called Trump for a quick conversation after the second attempt in August.\"It is really important that all of us speak loudly, regardless of who we're voting for, to say, 'Our differences have to be settled at the ballot box and not through violence,'\" Harris said. \"We cannot lose our soul in terms of who we are as Americans by resorting to violence to settle our differences, much less to make a decision about who's going to be the next President of the United States.\"On Iran and China Whoever wins in November will have a full slate of foreign policy issues to tackle. Whitaker asked Harris which foreign country she considers America's greatest adversary.Iran, Harris responded, is an obvious one.\"Iran has American blood on their hands,\" she said. \"And what we saw in terms of just this attack on Israel, 200 ballistic missiles, what we need to do to ensure that Iran never achieves the ability to be a nuclear power, that is one of my highest priorities.\"Harris stopped short of answering whether the U.S. would take military action if the administration found proof that Iran is building a nuclear weapon.On China, Harris said the U.S. \"should not seek conflict,\" but instead protect American business interests. She would not answer whether the U.S. would use military force to support Taiwan.\"I'm not going to get into hypotheticals,\" Harris said. \"But listen, we need to make sure that we maintain a 'One China' policy, but that includes supporting Taiwan's ability to defend itself, including what we need to do to ensure the freedom of the Taiwan Strait.\"The role Tim Walz would play as vice presidentWhether the issue is foreign policy, the economy, immigration, or any of the other critical decisions that will come from the Oval Office, Whitaker asked Minnesota Gov. Tim Walz what role he might play, should he and Harris get elected. Walz said he views his role as an advisor, noting that Harris understands he has different lived experiences that he can draw on, including serving as governor of Minnesota and spending 24 years in the National Guard.\"My job is to give that experience,\" Walz said.When asked how he might handle times that he and Harris disagree, Walz said he would draw on his experience as an enlisted soldier.\"Many times the officers who were higher ranking had much less time. My job was to be their lead advisor, and I would give my best advice to them, and they would make their decision,\" he explained. \"If it was not the advice I gave, I turned around to our troops, and I said, 'Here's what we're going to do. Here's the mission. Here's how it's going be executed.' The commander's plan was clear.\"Walz went on to offer that Harris would be a leader who seeks that input. \"She doesn't believe she has all the answers,\" Walz said. \"That's what the president should do.\"The video above was produced by Brit McCandless Farmer and edited by Scott Rosann.","summary":"More from Bill Whitaker's 60 Minutes interview with Vice President Kamala Harris and Gov. Tim Walz, the Democratic ticket in the 2024 presidential election.","url":"https://www.cbsnews.com/news/kamala-harris-and-tim-walz-more-from-their-60-minutes-interviews/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/fceb0341-600b-4421-a9fc-0b0bbb0313ea/thumbnail/1200x630/bd15219f80483d3bfc7ce2832f7390c5/ot-whitakerthedemocaticticket.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/07/2378495043971/3248450_hls/master.m3u8","publish_date":"2024-10-08 00:00:00","author":"Brit McCandless Farmer","authors":["Brit McCandless Farmer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.218},{"id":258837772,"title":"Snoopy fans angered by one account's pro-Trump post","text":"Some Snoopy fans are enraged that an account dedicated to the beloved character is engaging with politics. Snoopy Weekly, a now-deleted popular X account unaffiliated with the “Peanuts” comic, got backlash for a post that endorsed former President Donald Trump in the election next month. The account, which had more than 19,000 followers, was among several Snoopy fan pages on social media that have amassed large audiences in the last few years amid the beagle’s resurgence in meme culture. The animated pup, who is primarily known as Charlie Brown's best pal, debuted in comic form in October 1950. But in recent years, he has garnered the love of a new generation of fans, made up of Gen Zers, who post everything from fan edits to memes about him across X, TikTok and Instagram. \"Snoopy hates you btw,\" a fan of the cartoon wrote in response to the Snoopy Weekly endorsement, sharing a screenshot of the now-removed post. \"Snoopyweekly recently made an aggressive fascistic push,\" another X user wrote, encouraging fans of Snoopy to instead check a different unaffiliated account, dailysnoopys. That account, which has 123,000 followers on X, appears to be more left-leaning. It advocates for a cease-fire between Israel and Hamas. NBC News could not reach the people behind Snoopy Weekly or Dailysnoopys for comment. The Snoopy Weekly account appears to have been deleted as of Monday evening. Before it was removed from X, the account encouraged people to register to vote in Arizona and Georgia, two swing states. The post featured an image of Snoopy doing a thumbs-up in front of a voting box while standing next to the American flag. Other Snoopy fan accounts, like badsnoopy__, have also showcased some political leanings in their posts. Snoopy Weekly's post came a month ahead of Election Day amid a divisive campaign season, prompting more widespread scrutiny from engaged followers of the character. It's unclear whether Snoopy, if he were real, would endorse any candidate. But Charles M. Schulz, the creator behind the “Peanuts” series, who died in 2000, did not shy away from politics, according to historian Blake Scott Ball's book \"Charlie Brown’s America: The Popular Politics of Peanuts.\" \"I think for a lot of people, Peanuts was kind of viewed as so universal, so inoffensive, that I think a lot of people imagine it as apolitical,\" Ball said in a phone interview. \"When in fact, Shulz was really good at asking questions that challenged people on both sides about controversial issues, including school prayer, the draft in Vietnam and women's rights.\" Even Snoopy the character has been political. For example, in 1972, there was a popular bumper sticker that said \"Snoopy For President.\" \"Snoopy has always been, in one way or another, sort of in the political discourse,\" Ball said. In posts on his Medium blog, Ball elaborating further, writing that “Schulz believed that given a fair shot, Americans would find (and make) the right choice.\" Schultz, according to Ball, was a soldier in World War II who throughout his cartooning career \"kept fighting for a fair shot for all Americans like his friends Mortie Turner, a Black cartoonist in Oakland whom Schulz constantly promoted, or Billie Jean King, the tennis phenom and advocate for women’s rights whom Schulz supported with both his time and money for years.\" \"He elevated characters like Franklin, the first Black character in a mainstream comic strip, and Peppermint Patty, a gender-fluid child from a broken home, into the national conversation,\" Ball wrote. \"Yes, Charles Schulz believed that democracy would guide the way.\" A spokesperson for Peanuts Worldwide LLC, which controls Snoopy intellectual property, did not immediately respond to a request for comment Monday. Peanuts.com, the official fan page for the comic, currently directs users on its homepage to another website, Peanuts Rocks the Vote. There, fans are encouraged to register to vote. \"Scroll through the Peanuts Presidential candidates below to see where they stand and then vote for the character you want to be President!\" it says.","summary":"Some Snoopy fans are enraged that an account dedicated to the beloved character is engaging with politics.","url":"https://www.nbcnews.com/pop-culture/viral/snoopy-fans-angered-fan-accounts-trump-endorsement-rcna174394","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241007-donald-trump-snoopy-se-554p-7e4064.jpg","video":null,"publish_date":"2024-10-07 23:58:57","author":"Saba Hamedy","authors":["Saba Hamedy"],"language":"en","category":"politics","source_country":"us","sentiment":0.16},{"id":258837770,"title":"Harris calls Trump 'irresponsible' for spreading disinformation about hurricane aid","text":"Vice President Kamala Harris criticized former President Donald Trump on Monday over false claims he has made talking about disaster relief for victims of Hurricane Helene. Harris told reporters that there's a lot of \"disinformation being pushed out there by the former president about what is available, in particular to the survivors of Helene,\" from the Federal Emergency Management Agency. \"It’s extraordinarily irresponsible. It’s about him; it’s not about you,\" Harris said. \"And the reality is that FEMA has so many resources that are available to folks who desperately need them now and resources that are about helping people get back on their feet and rebuild and have places to go.\" A Trump campaign spokesperson didn’t immediately respond to a request for comment Monday night. Trump last week amplified a false claim about FEMA's disaster funds, saying they were being distributed to migrants who entered the U.S. illegally. “They stole the FEMA money, just like they stole it from a bank, so they could give it to their illegal immigrants that they want to have vote for them this season,” Trump said at a rally in Saginaw, Michigan. NBC News has reported that Trump and his allies were conflating a more than $20 billion fund exclusively set aside for disaster relief and a separate program established under direction from Congress in 2022 to distribute funds from Customs and Border Protection to help U.S. communities provide services to migrants released by the Department of Homeland Security. FEMA has also responded, saying its emergency response money \"has not been diverted to other, non-disaster related efforts.” Trump spread false claims about the agency at a rally in Butler, Pennsylvania, where he said the federal government was providing disaster victims only $750, a claim FEMA has disputed, describing the initial sum as a payment to help cover essentials and emergency supplies while it reviews survivors' eligibility for more funds. FEMA Administrator Deanne Criswell referred to Trump’s comments as “just plain false” and “a truly dangerous narrative” in an interview Sunday with ABC News. “It’s really a shame that we’re putting politics ahead of helping people, and that’s what we’re here to do,” Criswell said. The storm, which made landfall in Florida on Sept. 26, became the deadliest on record since Hurricane Katrina in 2005 as the death toll rose to 230.","summary":"Harris criticized Trump for amplifying a false claim about the distribution of Federal Emergency Management Agency funds to victims of Hurricane Helene.","url":"https://www.nbcnews.com/politics/2024-election/kamala-harris-calls-trump-irresponsible-disinformation-helene-aid-rcna174402","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241007-kamala-harris-hurricane-ew-552p-56aaa0.jpg","video":null,"publish_date":"2024-10-07 23:58:39","author":"Nnamdi Egwuonwu,Zoë Richards","authors":["Nnamdi Egwuonwu","Zoë Richards"],"language":"en","source_country":"us","sentiment":-0.415},{"id":258837504,"title":"Republican apologizes after telling Muslim voters she attacked Islam out of 'frustration'","text":"A far-right homeschooling activist running on the Republican ticket for North Carolina's superintendent of public instruction has apologized to Muslim voters for her past comments disparaging their religion, according to a report.\n\nSpeaking at a candidate forum over the weekend hosted by the Muslim American Public Affairs Council in Raleigh, Michele Morrow said she was only speaking out of \"frustration\" that no one acknowledged 2020 protests were turning violent, particularly in “primarily Islamic areas,” reported NC Newsline. She did not specify what areas she was referring to.\n\n“There were several people that were in Congress that were basically giving heed to and saying, ‘this is just a peaceful protest, that there’s nothing wrong with this,'” Morrow said. “My concern was that’s not true. Like it’s one thing to peacefully protest, it’s another thing to demand that people think like you or that you have your way, and if you don’t get that way, you’re going to be violent, you’re going to be destroying property, you’re going to be threatening people.”\n\nShe added that surely she and Muslims could find common ground, because, “I know you agree with me that we do not want the LGBTQIA agenda pushed on our children.”\n\nMorrow has spewed Islamophobic invective on social media in prior years, including suggesting that Muslims should be banned from public office and that “The DEEP STATE globalists and Muslim extremists, intent on destroying America, placed [Congresswoman Ilhan] Omar and MANY others into our govt.\"\n\nShe also proclaimed Omar should \"head back to Somalia.\" At least some of these posts occurred months before the protests over the police murder of George Floyd that started in May 2020, which she claimed was the source of her frustration.\n\nIn addition, Morrow has also called for President Joe Biden and former President Barack Obama to be executed for treason on pay-per-view TV, and suggested that the Chinese Communist Party stationed thousands of troops in Canada to rig the 2020 election against former President Donald Trump.\n\nAll of this is occurring as Republicans in North Carolina run away from their gubernatorial candidate, Lt. Gov. Mark Robinson, following new revelations that he expressed admiration for Adolf Hitler and called himself a \"Black Nazi\" on a pornographic internet forum years before entering politics.","summary":"A far-right homeschooling activist running on the Republican ticket for North Carolina's superintendent of public instruction has apologized to Muslim voters for her past comments disparaging their religion, according to a report.\n\nSpeaking at a candidate forum over the weekend hosted by the Muslim American Public Affairs Council in Raleigh, Michele Morrow said she was only speaking out of \"frustration\" that no one acknowledged 2020 protests were turning violent, particularly in “primarily Islamic areas,” reported NC Newsline. She did not specify what areas she was referring to.\n\n“There were several people that were in Congress that were basically giving heed to and saying, ‘this is just a peaceful protest, that there’s nothing wrong with this,'” Morrow said. “My concern was that’s not true. Like it’s one thing to peacefully protest, it’s another thing to demand that people think like you or that you have your way, and if you don’t get that way, you’re going to be violent, you’re going to be destroying proper","url":"https://www.alternet.org/republican-muslim-voters/","image":"https://www.alternet.org/media-library/image.png?id=53778648&width=1200&height=600&coordinates=0%2C0%2C0%2C244","video":null,"publish_date":"2024-10-07 23:56:31","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","category":"politics","source_country":"US","sentiment":-0.511},{"id":258836622,"title":"Why voters won't hear directly from Donald Trump in the 60 Minutes election special","text":"Why voters won't hear directly from Donald Trump in the 60 Minutes election special\n Voters will not hear directly from former President Donald Trump during tonight's 60 Minutes election special. Correspondent Scott Pelley explains why.","summary":"Voters will not hear directly from former President Donald Trump during tonight's 60 Minutes election special. Correspondent Scott Pelley explains why.","url":"https://www.cbsnews.com/video/trump-declines-interview-60-minutes-video-2024-07-21/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/07/2a574da8-ba5d-433b-bd2d-7841a3cb0949/thumbnail/1200x630/c5d128a81eeaf9f3a90e7a34fd4491ba/1007-60minutes-trump-3248190-640x360.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-07 23:55:32","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.932},{"id":258836912,"title":"Former Democratic lawmaker hoping for ‘world peace’ rolls out Trump endorsement","text":"Former Florida Rep. Peter Deutsch is a Jewish American Democrat who was a lawmaker in the Sunshine State from 1993 to 2005. On Monday, which is the first anniversary of Hamas’s attack on Israel, Deutsch announced he would not be supporting the top of his party’s ticket on Election Day. \n\n“I think that Kamala Harris and the Harris-Biden administration in terms of what they have done and are doing … [and] their policies toward Iran make the world a dramatically less safe place,” Deutsch said. \n\nInstead, he decided to endorse Trump during a press call organized by the former president’s campaign to commemorate the Hamas attacks on Israel. \n\nDeutsch said that the “driving force for me to make this decision is what I believe is the most important factor in being president, which is really world peace.”\n\n“I feel very comfortable today publicly announcing that I’m endorsing Donald Trump to be reelected as president,” Deutsch added. \n\nHamas, which is a terrorist group backed by Iran, killed 1,200 civilians during its attacks. The year since the attack has seen tensions continue to boil over in the Middle East, with Iran launching a direct missile attack on Israel last week. \n\nDeutsch said during the call Monday that he believes another Trump term will restore stability in the region. \n\n“For what I believe is the most important job of the President of the United States, which is trying to retain peace in the world, there is an extraordinarily clear choice that I think every American hopefully will come to the same conclusion that I have: that President Trump should become the next president of the United States,” he said. \n\nDeutsch is the latest of a slew of current and former Democrats, including longtime environmental lawyer and former presidential candidate Robert F. Kennedy Jr., former Rep. Tulsi Gabbard, Tesla and SpaceX CEO Elon Musk, and Arab American Michigan Mayor Amer Ghalib, who have decided to back Trump. \n\nMany of them have cited Trump’s foreign policy stances as their decision to back the former president this November. \n\n“He not only didn’t start any new wars, he took action to de-escalate and prevent wars,” Gabbard said when she endorsed Trump in September. \n\nClaiming Trump views war “as a last resort,” she hoped he would “walk us back from the brink of nuclear war.” \n\nTrump has often touted his work in brokering the Abraham Accords in 2020, which normalized relations between Israel and the United Arab Emirates and between Israel and Bahrain. \n\nThroughout the course of his 2024 presidential campaign against Vice President Kamala Harris, he has often accused her of fueling foreign policies, such as unfreezing billions in sanctions against Iran, that have destabilized Israel and unleashed terror in the Middle East. \n\n“It is no surprise that Iran desperately wants Kamala Harris to be President because they know as long as she is in power, they can take advantage of America,” Trump said in a statement last week. “When I was President, Iran was in total check. They were starved for cash, fully contained, and desperate to make a deal.”\n\nWhile Trump says the Biden administration’s policies have empowered Iran to wreak terror against Israel, Harris has argued that she has “my entire career and life supported Israel and the Israeli people.”\n\n“He knows that,” she said during her presidential debate against Trump last month. “He’s trying to again divide and distract from the reality, which is it is very well known that Donald Trump is weak and wrong on national security and foreign policy.”","summary":"A six-term Democratic lawmaker expressed faith that putting former President Donald Trump back in the White House would make the world a safer place as the United States reflects on the deadly Oct. 7 Hamas attack that unleashed turmoil in the Middle East. Former Florida Rep. Peter Deutsch is a Jewish American Democrat who was [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3180409/former-democratic-lawmaker-hoping-world-peace-rolls-out-trump-endorsement/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Deutsch.webp","video":null,"publish_date":"2024-10-07 23:55:07","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","category":"politics","source_country":"US","sentiment":-0.171},{"id":258836232,"title":"The Phony Populism of Donald Trump","text":"Taegan Goddard is the founder of Political Wire, one of the earliest and most influential political web sites. He also runs Political Job Hunt, Electoral Vote Map and the Political Dictionary.\n\nGoddard spent more than a decade as managing director and chief operating officer of a prominent investment firm in New York City. Previously, he was a policy adviser to a U.S. Senator and Governor.\n\nGoddard is also co-author of You Won - Now What? (Scribner, 1998), a political management book hailed by prominent journalists and politicians from both parties. In addition, Goddard's essays on politics and public policy have appeared in dozens of newspapers across the country.\n\nGoddard earned degrees from Vassar College and Harvard University. He lives in New York with his wife and three sons.\n\nGoddard is the owner of Goddard Media LLC.","summary":"Tom Nichols: &#8220;The candidate’s tirades are the most obviously bizarre part of his performances, but the nature of the gathering itself is a fascinating paradox. Thousands of people, mostly from [&#8230;]","url":"https://politicalwire.com/2024/10/07/the-phony-populism-of-donald-trump/","image":"https://politicalwire.com/wp-content/uploads/2018/02/PW-podcast-logo.jpg","video":null,"publish_date":"2024-10-07 23:55:03","author":"Taegan Goddard","authors":["Taegan Goddard"],"language":"en","category":"politics","source_country":"US","sentiment":0.196},{"id":258835650,"title":"Melania Trump witnesses special forces taking down ISIS leader alongside Conan the dog in the Situation Room – What went down?","text":"Melania Trump revealed that it was her husband Donald Trump who invited her to the White House Situation Room to watch the October 2019 raid to kill ISIS leader Abu Bakr al-Baghdad.\n\n‘I was caught off guard when I received a call informing me that the president wanted to see me in the Oval Office,’ she writes in forth-coming memoir Melania, a copy of which was obtained by the Daily Beast. \n\n‘I was directed to join him in the Situation Room – a first and unique experience for me.’ \n\n‘Watch this incredible action at work,’ Donald whispered to me,’ she writes.\n\nIt’s unusual for a first lady to be in the Situation Room of the White House, a room in the basement that is heavily guarded and contains the nation’s top secrets. Originally established in 1961, it’s where leaders gather for classified meetings and it has the technology to show military operations from around the world live on its TV screens. \n\nThe first lady does not have a security clearance but the president can give one to whomever he chooses. \n\n‘The mission to eliminate the leader of ISIS was a significant objective, and the successful completion of this operation would be a major accomplishment,’ Melania writes. ‘This pivotal moment was one that Donald wanted to share with me.’ \n\nAt the time, al-Baghdadi was the world’s most wanted terrorist. \n\nAnd it was Melania who suggested Trump highlight the role Conan, the hero military dog, played in the action, Trump’s Defense Secretary Christopher Miller in his memoir.\n\nMiller was the first to reveal Melania was present during the raid, noting she was horrified when someone asked what would happen if al-Baghdadi detonated his suicide vest.\n\n‘His head will pop off like a champagne cork,’ an aide said to the first lady’s shock.\n\nConan, a Belgian Malinois, helped military special forces track down al-Baghdadi through a tunnel during the raid in Syria. \n\nThe dog was hurt in the action but, when he recovered, he came to the White House to be honored in the Rose Garden.\n\n‘We were honored to welcome him to the White House to present him with a medal for his exceptional courage,’ the former first lady writes in Melania, which is published on Tuesday. \n\nThe October 2019 raid to take out al-Baghdadi was named Operation Kayla Mueller after the 26-year-old humanitarian worker from Arizona who died in Syria in 2015. \n\nIt’s suspected that al-Baghdadi ordered Mueller’s death. The ISIS leader reportedly held her hostage and named her his ‘ISIS bride.’\n\nKayla Mueller was abducted a day after crossing into Syria on Aug. 4, 2013. She had lived in Turkey for the previous eight months doing humanitarian work. She had crossed into Syria with a friend to head to a Doctors Without Borders compound.\n\nKayla’s parents, Marsha and Carl Mueller were heavily critical of Barack Obama for not doing enough to rescue their daughter. Obama had authorized a raid but commandos found Kayla and the other hostages had been moved. \n\nThe Muellers endorsed Donald Trump for president and were at his 2020 State of the Union address as Melania’s guests. \n\nPresident Trump honored them and Kayla in his remarks. Melania greeted them at the event. \n\nAfter the raid was a success and al-Baghdadi was killed, then-President Trump asked how he should announce it.\n\nIt was Melania who suggested he personally make a public statement, Miller writes in his book ‘Soldier Secretary.’\n\n‘You should talk about the dog,’ she said. ‘Everyone loves dogs.’\n\nTrump did so. \n\n‘Our ‘K-9,’ as they call it,’ Trump said of Conan in his remarks. ‘I call it a dog. A beautiful dog — a talented dog — was injured and brought back.’\n\nAdditionally, in his announcement of al-Baghdadi’s death, Trump compared the ISIS leader to a dog, a slur when applied in the way he used: ‘He died like a dog. He died like a coward. The world is now a much safer place.’\n\nTrump later hosted Conan the hero dog in the Rose Garden of the White House where the dog was given an award for his service.\n\n‘Conan did a fantastic job and we’re very honored to have Conan here and to have given Conan a certificate and an award,’ Trump said at that ceremony.\n\nThe raid was led by Green Berets and U.S Army Rangers. U.S. helicopters entered Syrian airspace, where they could be detected by Syrian and Russian radar. \n\nUltimately al-Baghdadi detonated a suicide vest while holding two of his own children, killing them. Two of his wives were also killed. \n\nHe had fled into a tunnel network under the compound, wearing a suicide vest and chased by U.S. military dogs.\n\nThe American soldiers dug through the debris to find his remains, which were identified by DNA.","summary":"Internewscast Journal\n\nInternewscast\n\n\nMelania Trump revealed that it was her husband Donald Trump who invited&#8230;\n\n\nThis Post: Melania Trump witnesses special forces taking down ISIS leader alongside Conan the dog in the Situation Room &#8211; What went down? first appeared on Internewscast Journal","url":"https://internewscast.com/politics/melania-trump-witnesses-special-forces-taking-down-isis-leader-alongside-conan-the-dog-in-the-situation-room-what-went-down/","image":"https://i.dailymail.co.uk/1s/2024/10/07/18/67343661-13933969-Melania_Trump_with_President_Donald_Trump_Vice_President_Mike_Pe-a-13_1728323599814.jpg","video":null,"publish_date":"2024-10-07 23:50:50","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.254},{"id":258835922,"title":"Harris and Trump mark Oct. 7 on campaign trail","text":"Harris and Trump mark Oct. 7 on campaign trail\n Former President Donald Trump marked Oct. 7 at a memorial in Queens, New York, while in Washington, Vice President Kamala Harris planted a pomegranate tree, a symbol of a hope. Nancy Cordes has more on how Israel's war with Hamas is unavoidably a factor in the U.S. presidential election.","summary":"Former President Donald Trump marked Oct. 7 at a memorial in Queens, New York, while in Washington, Vice President Kamala Harris planted a pomegranate tree, a symbol of a hope. Nancy Cordes has more on how Israel's war with Hamas is unavoidably a factor in the U.S. presidential election.","url":"https://www.cbsnews.com/video/harris-and-trump-mark-oct-7-on-campaign-trail/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/dc274d69-5064-4662-a58e-ebb9479e56f9/thumbnail/1200x630/567ce7f812c38b899324f4d253948cf0/1007-en-cordes.jpg?v=3a0e65dbe151135b3f2e1627f423e21b","video":null,"publish_date":"2024-10-07 23:50:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.221},{"id":258837760,"title":"Musk's PAC offers $47 payouts to refer swing state voters to sign petition","text":"Elon Musk’s pro-Trump America PAC is offering people $47 if they successfully get one registered swing-state voter to sign a petition supporting the First and Second Amendments of the Constitution. “Easy money,” Musk said in a post about the initiative. The payout offer appears to be a way to financially encourage voter registration of individuals who might prefer Republican candidate Donald Trump in swing states. Paying individuals directly to register to vote is illegal, but America PAC’s petition appears to skirt laws that forbid certain types of election-related payments, paying referrers of registered voters instead. Both Musk and America PAC have vocally encouraged swing-state voter registration ahead of the mandatory deadlines. A representative of America PAC declined to comment. The monetary offer was widely shared on X, Musk’s social media platform. Over the weekend, X repurposed the account handle “@america,” which used to belong to a different account, for Musk’s America PAC. It is labeled as an official X organization. The account has since promoted the pro-Constitution petition, swing-state voter registration and the $47 offer. “I’ve not seen anything like this,” said Dr. Richard Hasen, a professor at UCLA School of Law and an NBC News election law analyst. “He has mobilized the platform to be in Trump’s corner in a way that is far more blatant and direct than anything we’ve seen from any other social media platform or traditional media platform.” Hasen said he doesn’t think that Musk has broken any campaign finance laws and is within his free speech rights to steer X in the direction of his political preferences, as long as he discloses his connections with Trump. “The law prohibits paying people to vote, to register to vote, to vote in a particular way or not to vote in a federal election. And this is none of those things,” Hasen said. Musk’s America PAC was formed in May and has previously stoked controversy with its unusual tactics to encourage swing-state voter registration. The super PAC has received donations from Musk, who officially endorsed Trump after his assassination attempt in July, and his Silicon Valley peers. The organization has run ads on Facebook and Instagram for voter registration in swing states. In August, the PAC’s website collected personal data from users under the guise of voter registration, but only directed them to complete the process if they were in a swing state. Election officials in Michigan and North Carolina investigated whether the website was misleading voters. Michigan said it hadn’t found any evidence of violating state campaign finance law and a spokesperson for America PAC declined to comment to NBC News at the time beyond the letters it sent to state officials. Political finance tracker and nonprofit organization OpenSecrets reports that America PAC has spent more than $77 million so far, with over $41 million supporting Republicans and over $35 million directly opposing Democrats. Now, the America PAC website displays posts on X from conservative accounts and advertises paid positions to help increase voter registration and turnout in swing states. “Pay starts at $30 per hour, with bonuses for performance,” the website says. “It seems like a lot of money to be offering,” Hasen said. “Only someone who is extremely rich would even consider it, and we’ll see if it actually happens.”","summary":"Elon Musk’s pro-Trump America PAC is offering people $47 if they successfully get one registered swing-state voter to sign a petition supporting the First and Second Amendments of the Constitution.","url":"https://www.nbcnews.com/tech/tech-news/musk-pac-signature-47-pay-refer-swing-state-voters-sign-petition-rcna174310","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-06/240621-elon-musk-ch-0934-a3ca17.jpg","video":null,"publish_date":"2024-10-07 23:49:51","author":"Kat Tenbarge","authors":["Kat Tenbarge"],"language":"en","category":"politics","source_country":"us","sentiment":-0.251},{"id":258836564,"title":"Exclusive -- Faith & Freedom Coalition's Ralph Reed: Galvanizing Evangelical, Catholic Swing-State Voters Could Deliver Trump Victory","text":"The Faith & Freedom Coalition has been working to galvanize low propensity Evangelical and Catholic voters for former President Donald Trump, in what founder and chairman Ralph Reed is calling “the best ground game” he has ever seen.\n\n“We’re hitting ten million doors, just Faith & Freedom [Coalition]. That’s half of all the doors that were knocked on by the entire Republican Party four years ago,” Reed said during an interview on Breitbart News Saturday. “That doesn’t count what Trump does. It doesn’t count Turning Point or SBA [Pro-Life America]. It doesn’t count what Elon Musk is doing through his PAC.”\n\n“I can tell you right now, this is the best ground game that I have ever seen…I’m not talking about robocalls and computer-generated text messages. I’m talking about people at the door or phone calls from volunteers,” he added. “This is more than we have ever delivered as a movement.”\n\nIn the interview with Breitbart D.C. Bureau Chief Matthew Boyle, Reed specifically broke down the numbers he is seeing from voters of faith in swing states, what percentage supports Trump, and how boosting voter turnout by a few percentage points could potentially gain Trump thousands of more votes to secure his victory in November. \n\n“We are focused primarily on low propensity self-identified evangelical voters, modeled pro-life, social conservatives who have voted in one or fewer of the last three elections,” he said. \n\nFrom the Faith & Freedom Coalition’s estimation, between 25 percent and 27 percent of electorate are self-identified Evangelical conservative Christians, while devout, mass-attending Catholic comprise another 10 percent to 11 percent, Reed said.\n\n“So you’re talking about 37 percent to 38 percent of the electorate. It’s bigger than the Hispanic vote, the African American vote, and the union vote combined,” he said. \n\n“Today, as you and I talk, Donald Trump is already winning 82 percent of that Evangelical vote. I think he’s on his way…to matching his 2020 margin, which was 84 percent, and I think there’s a chance he could go higher,” he continued. \n\n“Then you turn to the Roman Catholic vote, which is going to be so critical, particularly in the upper Midwest states like Pennsylvania, Wisconsin, Michigan. He’s already winning the Catholic vote today, 52 to 47 percent,” he said, citing Pew Research data which he noted was taken before Vice President Kamala Harris became the first nominee for president since the 1980s to decline attending the Al Smith Dinner. \n\nThe organization’s after-action analysis in 2022 and 2024 primaries astoundingly revealed that if these low-propensity voters of faith are visited with at least two door-knocks, backed with vote checks and phone calls, the turnout among them can increase between 5 and 11 percent, Reed said.\n\n“No poll is going to pick that up when those people come and they come in bigger numbers than they did in 2020 or in 2016,” he said. “It’s going to be a big surprise to a lot of people, including all of these media pollsters.”\n\nBoyle pointed out that increasing voter turnout by those percentages in swing states like Pennsylvania, Michigan, or Wisconsin, could mean “possibly tens of thousands, hundreds of thousands” more votes for Trump than in previous elections. \n\n“It’s definitely a game changer,” Reed replied:\n\nSo let’s just take an example. Let’s take the state of Georgia where we have 1.9 million modeled social conservative voters, and 535,000 of them are low propensity voters. Now look, we can’t deliver a door knock to every one of them because some of them are in rural areas where it’s just not efficient. So let’s say we get 400,000 of them where we deliver two door knocks and we bump that turn out — let’s be conservative and say 5 percent. That’s 20,000 votes. If it goes up 10 percent, it’s 40,000 votes that [other pollsters] are not counting because they’re modeling these polls based on 2020 turnouts.”\n\n“I’m telling you, these people are coming and they’re coming in bigger numbers. I think the margin in the Catholic vote, which is gonna be critical in a state like Pennsylvania, Wisconsin, or Michigan, I think his margin is going to be bigger than it was against Hillary Clinton,” he said. \n\nReed opined that while Democrats “had to dump Biden,” Catholics who “held their nose and voted for Joe Biden because he was one of them” are “not going to do that for Kamala Harris.” \n\n“I think we’re also getting a pull, and that is the pull of these voters who are expressing, as all voters are by a margin of three to one, that they’re unhappy with the direction of the country — that they don’t like Biden’s policy,” he said. “[Harris] cannot disentangle herself from those policies and their deleterious effects on the American people, whether it’s the economy, inflation, all of this runaway spending, an open border with a humanitarian and national security and crime crisis, and wars on virtually every continent on the globe.” \n\nReed said he believes left-leaning media and Democrats are downplaying conservative ground game ahead of the election to distract from their long list of policy failures. \n\n“I think they’re up to their usual shenanigans — the same reason why they spent two weeks talking about childless cat ladies and three weeks talking about Haitian immigrants in Springfield,” he said.\n\n“I mean, let’s be honest, [the media are] joined at the hip with the Democratic Party and the left at this point. And it’s the same reason why Kamala Harris, Tim Walz, and all these Democratic Senate candidates only want to talk about two things: Project 2025 and abortion. Because they don’t want to talk about the issues that voters care about, which is the economy, inflation, crime, and the border.”\n\n“Those issues are losers for them,” he added. “They’re trying to change the subject. I just don’t think it’s going to work.”\n\nBreitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 a.m. to 1:00 p.m. Eastern.","summary":"Reed broke down how boosting voter turnout by a few percentage points could potentially gain Trump thousands more votes.\n\n\nThe post Exclusive &#8212; Faith &#038; Freedom Coalition&#8217;s Ralph Reed: Galvanizing Evangelical, Catholic Swing-State Voters Could Deliver Trump Victory appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/07/exclusive-faith-freedom-coalitions-ralph-reed-galvanizing-evangelical-catholic-swing-state-voters-could-deliver-trump-victory/","image":"https://media.breitbart.com/media/2024/10/AP23164790420526-640x335.jpg","video":null,"publish_date":"2024-10-07 23:49:49","author":"Katherine Hamilton","authors":["Katherine Hamilton"],"language":"en","source_country":"US","sentiment":-0.293},{"id":258836784,"title":"Karine Jean-Pierre Dismisses Fox Reporter’s ‘Misinformation’","text":"White House Press Secretary Karine Jean-Pierre sparred with Fox News correspondent Peter Doocy during Monday’s daily briefing after he raised a question based on a false claim about hurricane relief that has been kicked around by Republicans in recent days.\n\n“President Biden is fond of saying, ‘Show me your budget and I will tell you what you value,’” Doocy said. “If he’s got money for people in Lebanon right now, without Congress having to come back [and approve it], what does it say about his values if there is not enough money for people in North Carolina?”\n\n“His values?” Jean-Pierre asked in disbelief.\n\n“That’s not misinformation,” Doocy quickly added, although nobody had claimed otherwise.\n\nThe funds flowing to Lebanon—$157 million pledged by the U.S. last week to help with humanitarian assistance—come from the State Department. \n\nDomestic disaster relief funding comes from a different agency entirely, the Federal Emergency Management Agency, which is part of the Homeland Security Department.\n\nJean-Pierre broke in as Doocy tried to keep going. “Wait. No, that is—Your whole premise of your question is misinformation, sir,” she said. \n\nThen, as Doocy tried to talk over her, she continued, “Yes, yes, it’s misinformation. I just mentioned to you that we provided more than $200 million to folks who are impacted in the area.”\n\nThe press secretary was referring to money in the Small Business Administration’s disaster loan program, which has been doled out to impacted residents of the six states ravaged by Hurricane Helene.\n\nThe SBA’s coffers are in danger of running dry in a matter of weeks, however, as President Joe Biden said in a letter to congressional leadership late Friday. He urged the chambers to reconvene from recess to replenish the agency’s emergency funding.\n\nCongress’ next session isn’t scheduled until after the November presidential election. An administration official familiar with the matter told CBS News that there was not enough money to tide the SBA over until that point.\n\nBack in the briefing room, Doocy brought up Biden’s letter, asking if it was “misinformation, would you agree?”\n\n“No, the way you’re asking me the question is misinformation,” Jean-Pierre retorted. “There is money we are allocating to the impacted areas. And there’s money there to help people who truly need it. There are survivors who need the funding.”\n\n“You can’t call a question you don’t like misinformation,” Doocy said. “That’s very unfair.”\n\n“I actually said we have the money available to help survivors of Hurricane Helene and Hurricane Milton,” Jean-Pierre replied. “Now, there’s going to be a shortfall, right? Because we don’t know how bad Hurricane Milton is going to be. So we’re going to need additional funding.”\n\n“That’s exactly what I just asked about,” Doocy whined. “And you said it was misinformation.”\n\n“No, what you’re asking me is why Congress needs to come back and do their job,” Jean-Pierre said, closing her binder. “That’s what Congress needs to do, and we’re going to continue to urge that. You may not want that. But that’s OK. That’s what this president wants, and that’s what this vice president wants.”\n\nShe then thanked the reporters in the room and left the podium.\n\nHouse Speaker Mike Johnson has said that he won’t call Congress back early to consider increasing disaster funding. “We wouldn’t even conceivably have the request ready before we get back in November,” he told The New York Times last week. “There’s no necessity for Congress to come back.”\n\nIn addition to outrage over funds earmarked for Lebanon, prominent Republicans, including former President Donald Trump, have circulated false claims that the federal government has diverted FEMA funds from hurricane victims to illegal immigrants in the U.S.\n\n“Kamala spent all her FEMA money, billions of dollars, on housing for illegal migrants, many of whom should not be in our country,” Trump blustered at a Michigan rally last week. “The Harris-Biden administration says they don’t have any money, they’ve spent it all on—they spent all of their money, they have almost no money—because they spent it all on illegal migrants.”\n\nJean-Pierre dismissed such allegations as “categorically false” on Friday. The grant funding issued by FEMA to states to handle immigration comes from its Shelter and Services Program, an entirely separate pot of money from the agency’s disaster relief funds.\n\nBut although FEMA is meeting its “immediate needs,” Homeland Security Secretary Alejandro Mayorkas warned on Thursday that it does not have the funding to make it through the rest of hurricane season, which is set to run until late November.\n\nHurricane Helene made landfall in Florida as a Category 4 storm a little over a week ago and has killed at least 215 people since. Milton is expected to hit the Gulf Coast late this Wednesday as a Category 5 hurricane.","summary":"Kevin Dietsch/Getty ImagesWhite House Press Secretary Karine Jean-Pierre sparred with Fox News correspondent Peter Doocy during Monday’s daily briefing after he raised a question based on a false claim about hurricane relief that has been kicked around by Republicans in recent days.\n\n“President Biden is fond of saying, ‘Show me your budget and I will tell you what you value,’” Doocy said. “If he’s got money for people in Lebanon right now, without Congress having to come back [and approve it], what does it say about his values if there is not enough money for people in North Carolina?”\n\n“His values?” Jean-Pierre asked in disbelief.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/karine-jean-pierre-clashes-with-fox-reporter-peter-doocy-over-federal-hurricane-response","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1576,w_2801,x_0,y_424/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1728342786/GettyImages-2177304074_ukhkuy","video":null,"publish_date":"2024-10-07 23:47:24","author":"Aj McDougall","authors":["Aj McDougall"],"language":"en","source_country":"US","sentiment":-0.295},{"id":258835476,"title":"Elon Musk’s Mom, Maye, Sparks Controversy with X Post About Voting","text":"Elon Musk’s mother, Maye Musk, appeared to encourage a form of voter fraud in a post on X.” \n\n“The Democrats have given us another option. You don’t have to register to vote,” Musk’s mother wrote in the Oct. 5 post. “On Election Day, have 10 fake names, go to 10 polling booths and vote 10 times. That’s 100 votes, and it’s not illegal. Maybe we should work the system too.”\n\nMusk later called the post sarcastic in response to criticism, but did not delete the post.\n\nHer post appeared to be echoing conspiracy theories about large-scale voter fraud that have been shared by Elon Musk. In reality, investigations have found voter fraud to be a rare occurrence. Democrats have not been found to be orchestrating an operation of the type Maye Musk mentioned.\n\nBut if voters were to follow Maye Musk’s call to “work the system too,” they would most likely be in violation of election law, said Nate Persily, an election expert at Stanford Law School and an NBC News contributor.\n\nTitle 52 of the United States’ code says it is illegal to use false information to register to vote. Violations are punishable by a $10,000 fine or up to five years imprisonment.\n\nWhat’s more, a fake name isn’t enough to get you on the voter rolls. Registering to vote requires proof of identity, such as a driver’s license number or the last four digits of your Social Security number. That information is later checked by election officials, and if voters don’t provide it, they will be asked for a utility bill or other proof of residency can be used depending on the state.\n\nMusk’s post was flagged with a “Community Note” that pointed out that registering to vote under a false name and casting more than one vote “is, in fact, illegal.” The Federal Elections Commission declined to comment on Musk’s post or if it was investigating it.\n\nThe code, however, does not appear to forbid Maye Musk’s statements of encouragement, Persily said. \n\n“There is a lot of untrue information that circulates on social media with respect to voting,” Persily said. “The fact that someone makes an exaggerated statement like this does not seem to me like it’s a prosecutable offense.”\n\nThree hours after the original post, Maye Musk made another one telling users to ignore the first one. She also replied in comments to various users concerned with the misinformation in her post, saying that they “don’t understand sarcasm” and adding that “this comes from Gavin Newsom,” the California governor who signed off on Senate Bill 1174, which prevents local governments from imposing voter ID requirements in local elections. \n\nElon Musk has similarly condemned the bill in various posts on X, including one in which he wrote that “they just made PREVENTING voter fraud against the law” and compared Newsom, a Democrat, to “The Joker.”\n\nPersily said that many states, including New York, Massachusetts, and Minnesota, do not require voters to bring identification to the polls and that, despite this, there is no evidence that there are different rates of fraud between states that have more lenient voter identification laws and those with stricter ones.\n\nMaye Musk’s post was made the same day her son spoke at a rally for former President Donald Trump in Butler, Pennsylvania — the same place Trump was injured in an assassination attempt in July. \n\nAt Saturday’s rally, while encouraging people in the crowd to vote, Musk said that “if they don’t, this will be the last election.” His mother’s post on X was also in response to one of his posts pushing people to register to vote, reminding them of the deadline to so in Georgia.\n\nDuring his speech at the rally, Musk reiterated his disapproval for legislation that does not require voter identification.\n\n“You got 14 states now that don’t require voter ID,” Musk said. “California, where I used to live, just passed a law banning voter ID, for voting. I still can’t believe that’s real. So, how you supposed to have a good, proper election if there’s no ID? It’s meaningless.”\n\nCritics of laws requiring voter ID say that the requirements prevent voter turnout of eligible voters who may not have government-issued forms of ID like a driver’s license because of financial or other constraints. Proponents of the laws say that they prevent voter fraud, which studies have found to be an extremely rare occurrence. \n\nMusk publicly endorsed Trump’s campaign on X following the assassination attempt in July, and he has since joined other tech millionaires in vowing to donate to the pro-Trump super PAC, America PAC, which Musk started.\n\nMusk’s posts on X regarding the election, many of which have been deemed as false or misleading, have generated around 1.2 billion views, according to a report by the nonprofit Center for Countering Digital Hate. Out of 50 posts from Musk containing misinformation that researchers from the center analyzed this year, none were flagged with a “Community Note” correcting or adding context to his claims.\n\n“It is quite clear that there is a substantial minority of the American population that does not believe the election will be run with integrity, or that the results can be trusted,” Persily said. “And it is extremely difficult to counteract those beliefs when people with large megaphones are spreading falsehoods. Ultimately, the real question is whether the people will act on these kinds of posts.”\n\nElon and Maye Musk did not immediately respond to requests for comment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nElon Musk’s mother, Maye Musk, appeared to encourage a form of voter&#8230;\n\n\nThis Post: Elon Musk&#8217;s Mom, Maye, Sparks Controversy with X Post About Voting first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/elon-musks-mom-maye-sparks-controversy-with-x-post-about-voting/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-10/241007-elon-musk-maye-musk-vl-1248p-37d456.jpg","video":null,"publish_date":"2024-10-07 23:47:02","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.496},{"id":258836528,"title":"Taylor Swift is back to watch Travis Kelce and the Chiefs with Eras Tour soon to resume - The Associated Press","text":"KANSAS CITY, Mo. (AP) — Taylor Swift was back at Arrowhead Stadium on Monday night to see her boyfriend, Travis Kelce, and the Kansas City Chiefs play the New Orleans Saints after the pop superstar had missed the team’s previous two games on the road.\n\nSwift is in the final days of a break from her record-setting Eras Tour, which resumes with the first of three shows Friday night at Hard Rock Stadium in Miami. The tour’s North American leg continues in New Orleans and Indianapolis before heading to Toronto and Vancouver in November and December. The final show is scheduled for Dec. 8.\n\nSwift also missed Kelce’s annual Kelce Car Jam over the weekend, a charity car show that raises money for his 87 and Running foundation, which helps underserved youth in the areas around Kansas City and Cleveland. There was still plenty of star power with Patrick Mahomes and his wife, Brittany, joining Kelce’s parents his brother, retired Eagles center Jason Kelce.\n\nSwift began her high-profile romance with Kelce last season, when he invited the “Anti-Hero” singer to watch him in a September matchup with the Bears. Since then, the two have spent plenty of time together, often with cameras following every move. \n\nSwift has stayed out of the spotlight the past couple of weeks, though. That after a particularly headline-grabbing week in which she endorsed Kamala Harris for president, took home seven trophies from the MTV Video Music Awards, and show up to see the Chiefs beat the visiting Cincinnati Bengals.\n\nSwift has become close friends with the Mahomes family over the past year. That created some controversy when the 14-time Grammy winner said she supported Harris over Donald Trump in the November election; Trump has referenced the quarterback’s wife after she had liked — and then unliked — an Instagram post by the Republican presidential nominee.\n\nPatrick Mahomes has declined to endorse anyone in the election, instead urging people to register to vote.\n\n“I don’t want my place and my platform to be used to endorse a candidate,” Mahomes said. “My place is to inform people to get registered to vote. It’s to inform people to do their own research and then make the best decision for them and their family.”\n\nAP NFL: https://apnews.com/hub/nfl","summary":"Taylor Swift is back to watch Travis Kelce and the Chiefs with Eras Tour soon to resume  The Associated Press","url":"https://apnews.com/article/chiefs-taylor-swift-travis-kelce-arrowhead-b386bd5deb5b6588f255d62068417cae","image":"https://dims.apnews.com/dims4/default/ae653d6/2147483647/strip/true/crop/5818x3273+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdc%2F5e%2F92c22d812dd241608e817cc44cf7%2Fc28b6a7ca6a9479fa06a59100cfd85a0","video":null,"publish_date":"2024-10-07 23:47:00","author":"Dave Skretta","authors":["Dave Skretta"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.467},{"id":258835742,"title":"Biden, Harris, Trump each commemorate anniversary of Oct. 7 attack on Israel","text":"Oct. 7 (UPI) -- President Joe Biden and Vice President Kamala Harris on Monday observed the one-year anniversary of the Oct. 7 terrorist attacks against Israel at separate events in Washington while former President Donald Trump marked the event in New York.\n\nThe president and first lady Jill Biden honored the victims of the surprise attack launched by the Palestinian militant group Hamas with a candle lighting ceremony in the Blue Room of the White House, accompanied by Rabbi Aaron Alexander of Adas Israel Congregation in Washington, D.C.\n\nAn estimated an 1,200 men, women, and children of all ages were slain in the cross-border Hamas strike, while more than 250 others taken hostage. Some 97 of the abductees are still believed to be in captivity a year later.\n\nThe attack prompted Israel's strongest response actions against its foes in decades, as the Israel Defense Forces launched airstrikes and a ground invasion of Gaza aimed at dismantling Hamas that continue to this day, resulting in 42,000 Palestinian deaths in the enclave.\n\nAt the White House, Alexander recited the El Malei Rachamim prayer, a traditional Jewish prayer often heard at funerals and on the anniversary of a death, conducing a brief service in Hebrew and English.\n\nThe president lit a yahrzeit candle in memory of the Jewish victims of Oct. 7, which was followed by a moment of silence.\n\nBiden didn't speak or take questions during the candle lighting ceremony but issued a statement earlier marking the occasion.\n\n\"On this day last year, the sun rose on what was supposed to be a joyous Jewish holiday. By sunset, October 7 had become the deadliest day for the Jewish people since the Holocaust,\" he said.\n\n\"Today marks one year of mourning for the more than 1,200 innocent people of all ages, including 46 Americans, massacred in southern Israel by the terrorist group Hamas. One year since Hamas committed horrific acts of sexual violence. One year since more than 250 innocents were taken hostage, including 12 Americans. One year for the survivors carrying wounds, seen and unseen, who will never be the same. And one year of a devastating war.\n\n\"On this solemn anniversary, let us bear witness to the unspeakable brutality of the October 7th attacks but also to the beauty of the lives that were stolen that day,\" he said.\n\nThe president also marked the solemn occasion by speaking with Israeli President Isaac Herzog in a phone conversation, during which he \"expressed his deepest condolences to the people of Israel and to the families of the 1,200 innocent people -- including 46 Americans -- massacred by the terrorist group Hamas on a day of unspeakable brutality,\" according to a White House readout.\n\nBiden also \"expressed deep sadness for the loss of innocent life in Gaza and the ongoing suffering of Palestinian civilians as a result of the war that Hamas unleashed.\"\n\nMeanwhile, Harris and second gentlemen Doug Emhoff commemorated Oct. 7 at the vice president's official residence on the grounds of the U.S. Naval Observatory, planting a tree and dedicating it to \"the 1,200 innocent souls, in an act of pure evil on October 7, 2023, who were massacred by Hamas terrorists.\"\n\n\"Forty-six of our fellow Americans were killed in this brutal terrorist attack, including a singer from Missouri who died shielding her son from bullets, an academic and peace activist who studied in Seattle and who was the grandson of Holocaust survivors, and a dancer from California who was killed alongside her fiancé while attending the Nova Music Festival,\" the vice president said.\n\nShe urged Americans to not \"lose faith\" as the they \"reflect on the horrors of October 7\" and promised \"to always ensure that Israel has what it needs to defend itself and that I will always work to ensure the safety and security of the Jewish people here and around the world.\"\n\nTrump marked Oct. 7 on Monday with a visit to Ohel Chabad Lubavitch in New York City, the resting place of \"the Rebbe,\" Rabbi Menachem Mendel Schneerson, leader of the Chabad-Lubavitch movement.\n\nThere, he placed a note praying for the release of the Gaza hostages near the Rebbe's grave and read from the Jewish book of Psalms while accompanied by the parents of American-Israeli hostage Idan Alexander.\n\nTrump was also accompanied by Rabbi Abba Refson, director of the visitor's center at the Ohel, and Rabbi Motti Seligson, a spokesman for the Chabad-Lubavitch movement.\n\nAuschwitz death camp survivor Jerry Wartski and two Jewish college students \"currently speaking out against antisemitism on campus\" were also present, the Chabad organization said.\n\nThe GOP nominee later took part in an event held by Jewish leaders in Doral, Fla.\n\nThe Oct. 7 anniversary, meanwhile, prompted protests and vigils in various locales across the United States, both supporting Israel's actions in Gaza and others denouncing the deaths of tens of thousands of Palestinian civilians during Israel's year-long Gaza campaign.\n\nA pro-Israel demonstration staged by the Christian Philos Project near the Washington Monument was attended by Trump's running mate, Sen. JD Vance, R-Ohio, who promised that if elected his administration would target the accreditation of universities deemed to be \"using federal money to harass Jewish students,\" the Washington Post reported.\n\nOn the National Mall in Washington, an empty Shabbat table was set up, displaying one chair and one place setting for each of the remaining hostages in Gaza as flags for each of the nationalities of the hostages flew beside them.\n\nIn New York, thousands of pro-Palestinian protesters marched through parts of the city to mark the first anniversary of the onset of the Israel-Hamas war. Social media video posted by the advocacy group Within Our Lifetime showed demonstrators waving Palestinian flags in Madison Square Park and in the city's Fashion District on Seventh Avenue.\n\nHowever, due to what the group called \"several violent threats from Zionists,\" the planned marches to Times Square and Columbus Circle were called off.","summary":"President Joe Biden, Vice President Kamala Harris and former President Donald Trump on Monday each observed the anniversary of the Oct. 7 terrorist attacks against Israel at separate events.","url":"https://www.upi.com/Top_News/US/2024/10/07/Biden-Harris-Trump-each-commemorate-anniversary-Oct-7-attack-Israel/8401728337028/","image":"https://cdnph.upi.com/ph/st/th/8401728337028/2024/upi/8da4fbbe4424b84607f443c1ad2d69f3/v1.2/Biden-Harris-Trump-each-commemorate-anniversary-of-Oct-7-attack-on-Israel.jpg","video":null,"publish_date":"2024-10-07 23:46:25","author":"Don Jacobson","authors":["Don Jacobson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.107},{"id":258836636,"title":"Harris, Trump mark 1 year since Hamas' Oct. 7 attack on Israel","text":"Harris, Trump mark 1 year since Hamas' Oct. 7 attack on Israel\n Monday marks one year since the deadliest massacre in Israel's history, when Hamas launched a surprise attack killing 1,200 people and taking more than 250 hostages. Vice President Kamala Harris marked Oct. 7 in Washington, D.C., by planting a memorial tree, while former President Donald Trump visited a Jewish holy site in New York. CBS News' Chris Livesay and Nancy Cordes have more.","summary":"Monday marks one year since the deadliest massacre in Israel's history, when Hamas launched a surprise attack killing 1,200 people and taking more than 250 hostages. Vice President Kamala Harris marked Oct. 7 in Washington, D.C., by planting a memorial tree, while former President Donald Trump visited a Jewish holy site in New York. CBS News' Chris Livesay and Nancy Cordes have more.","url":"https://www.cbsnews.com/video/harris-trump-mark-1-year-since-hamas-oct-7-attack-israel/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/07/cadf3d3f-be37-4dff-a186-3c01a6b97a4b/thumbnail/1200x630/3f87a2f450c16e2f501905f73f6a397f/cbsn-fusion-harris-trump-mark-1-year-since-hamas-oct-7-attack-israel-thumbnail.jpg?v=3a0e65dbe151135b3f2e1627f423","video":null,"publish_date":"2024-10-07 23:45:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.372},{"id":258836426,"title":"Elon Musk's weirdest weekend, explained","text":"In September, there were signs that Elon Musk's attempts to elect Donald Trump — on and off the network formerly known as Twitter — were faltering. Now, after a weekend in which Musk immortalized the hashtag #DorkMAGA at a Trump rally, appropriated the @America account from its owner, and used it to literally offer money to swing state voters, those attempts have entered uncharted territory. How did we get here? Let's recap. On September 23, Musk was successfully fact-checked, a.k.a. Community Noted, on an X post relating to U.S. politics, for the first time in 2024. Musk spread a false rumor that a bomb had been found at a Trump rally. A New York Times examination of Musk's 171 posts that week found that nearly a third of them were \"false, misleading or lacked vital context.\" The fact that only one of them was marked as such gives you a sense of just how much Musk's supporters on the service are downvoting Community Notes on his posts. Even for the stans, it seems, a fake bomb threat was beyond the pale. Meanwhile IRL, Musk's pro-Trump America PAC was stumbling. In two swing states that will decide the 2024 election, Arizona and Nevada, where voter turnout is crucial, Musk fired its entire turnout operation. Given that America PAC is pretty much the only ground game the Trump campaign has, this was bad news for the GOP candidate that Musk officially endorsed back in July. As of last week, with early voting already underway in some states, America PAC was still hiring. Then on Friday, Musk got another very public online fact-check. Not a Community Note this time, but a response from Transport Secretary Pete Buttigieg to Musk sharing a screenshot of an anonymous text making wild claims about the Federal Emergency Management Agency. \n\n Tweet may have been deleted\n\n\"Support flights are underway, much appreciated,\" Musk replied after talking to Buttigieg — kind of claiming credit for solving a nonexistent problem, but also essentially walking back his fake claim about FEMA blocking Musk's satellite internet company from aiding in hurricane relief. Could the weekend get any more embarrassing for him? Musk: hold my beer\n\n Tweet may have been deleted\n\nAt a weekend rally for Trump in Pennsylvania, Musk appeared in a black \"Make America Great Again\" cap and declared himself \"dark MAGA.\" According to the Global Network for Extremism and Technology, the #DarkMAGA hashtag goes back to 2022, and represents a desire to go down a harsh path of retribution against MAGA critics. Dark MAGA posts frequently include Nazi and QAnon imagery. If Musk's intent was to evoke a more terrifying image, he succeeded in part — though not in the way he might have hoped. When Musk shook Trump's hand, a strange look crossed his face — and one photograph launched a thousand memes. \n\n Tweet may have been deleted\n\n Tweet may have been deleted\n\nBut even that meme could not withstand the firepower of Musk's midriff-baring ... well, let's just call it a rocket launch. \n\n Tweet may have been deleted\n\nPut the two together, and it's no surprise that a new hashtag blossomed: #DorkMAGA. New profile, who disThose images contrasted with Musk's new Twitter/X profile photo. His red-armored Halloween costume, used on and off since October 2022, was replaced after the Trump rally Saturday by a more flattering (and more edited) picture of Musk in the Dark MAGA cap against an American flag. (Even some of Musk's blue-check buying supporters were quick to note they would lose their verification badge if they were to change their profile photo.) Clearly, this was a long way from the claim Musk made back in April 2022, when he was preparing to buy Twitter, that the service should be \"politically neutral\" and upset \"the far left and the far right equally.\" And in case anyone was confused by the subtlety of the black-on-black MAGA cap, Musk also made his political message clear in his new bio: \"Read @America to understand why I'm supporting Trump for president.\" This was the first indication that Musk had seized the @America account from its original owner, and handed it over to his America PAC. As my Mashable colleague Matt Binder revealed, the original account owner — someone who happened to call Musk \"anti-American\" in 2020 — was given the rather less memorable handle of @America123_12. Musk is within his rights to seize any account, of course — it's his service, he overpaid for it. He has done so once before, appropriating the \"X\" handle from a photographer. But at least that was the new name of his company. Seizing the name of a country, for entirely political purposes ... well, let's say it may not fully convey the \"free speech\" concept Musk believes himself to be defending. \n\n Tweet may have been deleted\n\nBut hey, what's more American than promising free money for election-related purposes? That's what Musk proceeded to do with the America account, posting a bounty of $47 for any user who got a user in a swing state to sign the PAC's petition (and of course, harvesting their contact data in the process). Given that America PAC is having trouble hiring, posting the bounty makes sense. Whether it counts as a violation of federal election law, in particular 18 U.S. Code § 597, is up to the Federal Election Commission, which has not yet weighed in. Some seasoned political observers were in no doubt, however. \n\n Tweet may have been deleted\n\nNot helping, mom\n\n Tweet may have been deleted\n\nAnd as if that weren't enough, Musk's mother, Maye, weighed in on another one of the X owner's posts — jokingly suggesting election fraud. \"It's not illegal,\" Mother Musk claimed of the suggestion that her son's supporters register 10 times and vote 10 times at different polling stations. \"This is, in fact, illegal,\" read a Community Note that was appended on Maye Musk's Saturday tweet. The note appeared to have been removed on Sunday, but was restored on Monday. For Musk fans, evidently, supporting mom's right to suggest this kind of electoral fraud — something that Republican officials have already been prosecuted for doing — was a step too far.","summary":"Elon Musk, declaring himself 'Dark MAGA,' stumped for Trump and appropriated the @America account on Twitter/X for his Trump PAC.","url":"https://mashable.com/article/musk-weird-weekend","image":"https://helios-i.mashable.com/imagery/articles/02pHcNNzqVmpkeuPV2MFwwj/hero-image.fill.size_1200x675.v1728341546.jpg","video":null,"publish_date":"2024-10-07 23:44:55","author":"Chris Taylor","authors":["Chris Taylor"],"language":"en","category":"politics","source_country":"US","sentiment":-0.487},{"id":258835756,"title":"Kanye West and Bianca Censori's wildest moments as a couple: A look back amid pair's split","text":"Amid news that Kanye West and his spouse Bianca Censori appear to be headed for a split, Dailymail.com is taking a look back at the couple and their wildest moments.\n\nWest, 47, and Censori, 29, initially emerged as a pair in January of 2023, a time in which West's career and reputation was reeling from a series of anti-Semitic remarks he had made via multiple media platforms.\n\nWest - who also made national headlines bringing white supremacist Nick Fuentes to visit former President Donald Trump at Mar-a-Lago the November prior, had been romantically linked to Uncut Gems actress Julia Fox and model Chaney Jones in the timeframe after his 2022 divorce from Kim Kardashian.\n\nCensori, a native of Melbourne with a background in architecture who bares a resemblance to Kardashian, had past worked with West on his Yeezy brand.\n\nThe couple turned heads after they wed in January of 2023, and honeymooned at the Amangiri resort in Canyon Point, Utah, where they were seen in good spirits enjoying a meal. \n\nThe pair had a wholesome outing in August of 2023 when they were seen at an Italy restaurant singing along to West's Devil in a New Dress and the Black Eyed Peas' I Gotta Feeling. \n\nWest and Censori made headlines after an August 2023 incident in which they appeared to engage in an intimate act while on a boat ride in Venice, Italy. \n\nAt one point, West's rear end was partially exposed while Censori's head was positioned in his lap in the view of nearby tourists, with some calling for legal action after the amorous exhibition. \n\nThe couple turned heads this past June 19 in Paris at the Prototypes Menswear Spring/Summer 2025, where West was clad in an all-white ensemble while Censori showed off her pink locks in a revealing bodysuit. \n\nBritish PR expert Mark Borkowski told Dailymail.com of the outing that the eye-catching ensemble was West's attempt to establish Censori as a pop culture figure on par with that of his former spouse.\n\n'This is a statement and Kanye West sees the media as his canvas and sees this as an opportunity to paint his picture,' he said. 'Bianca is his artwork and his muse and the person he influences to create a statement'.\n\nBorkowski added, 'I think this is a well sculptured PR stunt but artists create art and this is what Kanye West is doing.'\n\nThings appeared to hit a fever pitch in regards to Censori's racy outfits earlier this year.\n\nA source told DailyMail.com that Kardashian told West that he needed Censori to ‘cover up’ around their four kids: daughters North, 11, and Chicago , six, and sons Saint, eight, and Psalm, five,\n\n'Kim instructed Kanye to never let Bianca dress like that around their kids,' a source told DailyMail.com in Feburary. 'She is truly surprised that Kanye would let his wife leave the house like that.'\n\nThe latest split comes less than a year after Censori and West reportedly parted ways for a time last November, amid concerns about their relationship and how much control he exerted over her.","summary":"West, 47, and Censori, 29, initially emerged as a pair in January of 2023, a time in which West's career and reputation was reeling from a series of anti-Semitic remarks.","url":"https://www.dailymail.co.uk/tvshowbiz/article-13934673/kanye-west-bianca-censori-wildest-moments-split.html","image":"https://i.dailymail.co.uk/1s/2024/10/07/23/90568519-0-image-m-97_1728338500246.jpg","video":null,"publish_date":"2024-10-07 23:43:32","author":"Adam S. Levy,Editor","authors":["Adam S. Levy","Editor"],"language":"en","source_country":"GB","sentiment":0.166},{"id":258837302,"title":"Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response - The Associated Press","text":"WASHINGTON (AP) — Vice President Kamala Harris on Monday called former President Donald Trump “incredibly irresponsible” for spreading falsehoods about the federal response to Hurricane Helene ‘s destruction, offering especially sharp words as a new storm bears down on Florida with just weeks until Election Day. \n\n“There’s a lot of mis- and disinformation being pushed out there by the former president about what is available, particularly to the survivors of Helene,” Harris told reporters before boarding Air Force Two to fly to New York. “It’s extraordinarily irresponsible. It’s about him. It’s not about you.”\n\nHelene has killed more than 220 people in six states, and Category 5 Hurricane Milton is on a path toward Florida’s Gulf Coast. \n\nTrump has made a series of false claims in the wake of Helene, including saying incorrectly that the federal government is intentionally withholding aid to Republican disaster victims. He also falsely claimed the Federal Emergency Management Agency had run out of money because all of it had gone to programs for immigrants in the country illegally. \n\nHarris said “the reality is that FEMA has so many resources that are available to folks who desperately need them now, and resources that are about helping people get back on their feet and rebuild and have places to go.”\n\n“People are entitled to these resources, and it is critically important that people apply for the help that is there to support,” the vice president added. “All those resources were created for just these types of moments, in an emergency situation, knowing that folks are entitled to have the relief that they so rightly need.”\n\nTrump also said during a visit Valdosta, Georgia, last week that President Joe Biden was “sleeping” and not responding to calls from Georgia Gov. Brian Kemp. Biden had, in fact, spoken with Kemp and said of Trump, “He’s lying, and the governor told him he was lying.” \n\nHarris also criticized another high-profile Republican, Florida Gov. Ron DeSantis, suggesting he’s “playing political games” and engaging in “political gamesmanship” in Helene’s wake. \n\nHarris office says the vice president reached out to DeSantis last week in the storm’s aftermath. DeSantis said Monday that he “didn’t know that she had called” and “they didn’t call me.”\n\n“It wasn’t anything anybody in my office did in saying that it was political,” DeSantis said. \n\nBut Harris, asked about DeSantis, said “people are in desperate need of support right now and playing political games at this moment in these crisis situations … is utterly irresponsible.”\n\n“It is selfish and it is about political gamesmanship instead of doing the job that you took an oath to do, which is to put the people first,” Harris said without naming DeSantis. \n\nWhite House press secretary Karine Jean-Pierre, at her briefing with reporters Monday, noted that DeSantis was invited to tour Helene damage in Florida with Biden but didn’t join him. \n\n“If you have the president, and you have the vice president, reaching out to offer up assistance — providing to your constituents, the people who live in your state, to make sure we are doing everything that we need to do from the federal response,” Jean-Pierre said. “It’s up to the governor, it’s up to him if he wants to respond to us or not.”","summary":"Harris calls Trump 'incredibly irresponsible' for spreading misinformation about Helene response  The Associated Press","url":"https://apnews.com/article/trump-harris-hurricane-helene-misinformation-552e413dfb6c1b3e37eca0d2114668ea","image":"https://dims.apnews.com/dims4/default/d89e4aa/2147483647/strip/true/crop/6739x3791+0+353/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2Fb0%2F4e683ff6da44060ba1420b326452%2F99bf1ca386eb4001bb4e89e902ba5547","video":null,"publish_date":"2024-10-07 23:42:00","author":"Will Weissert","authors":["Will Weissert"],"language":"en","source_country":"us","sentiment":-0.292},{"id":258837622,"title":"The more the fighting spreads in the Middle East, the fewer the thoughts of peace","text":"After weeks of stunning tactical success, Israel’s prime minister seems to harbour grand ambitions.\n\nIn a direct address to the Iranian people, he hinted that regime change was coming in Tehran. “When Iran is finally free, and that moment will come a lot sooner than people think, everything will be different,” he said.\n\nFor some observers, his rhetoric carried uncomfortable echoes of the case made by American neoconservatives in the run up to the US-led invasion of Iraq in 2003.\n\nBut for all the danger of the moment, fragile guardrails do still exist.\n\nThe Iranian regime may dream of a world without Israel, but it knows that it’s far too weak to take on the region’s only superpower, especially at a time when Hezbollah and Hamas - its allies and proxies in the so-called “axis of resistance” - are being crushed.\n\nAnd Israel, which would dearly like to get rid of the threat posed by Iran, also knows that it cannot do this alone, despite its recent successes.\n\nRegime change is not on Joe Biden’s agenda, nor that of his vice president, Kamala Harris.\n\nAs for Donald Trump, the one time he seemed poised to attack Iran - after Tehran shot down a US surveillance drone in June 2019 - the former president backed down at the last moment (although he did order the assassination of a top Iranian general, Qasem Soleimani, seven months later).\n\nFew would have imagined, a year ago, that the Middle East was heading for its most perilous moment in decades.\n\nBut looked at through that same juggernaut’s rear view mirror, the past 12 months seem to have followed a terrible logic.\n\nWith so much wreckage now strewn all across the road, and events still unfolding at an alarming pace, policy makers - and the rest of us - are struggling to keep up.\n\nAs the conflict that erupted in Gaza grinds on into a second year, all talk of the “day after” – how Gaza will be rehabilitated and governed when the fighting finally ends – has ceased, or been drowned out by the din of a wider war.\n\nSo too has any meaningful discussion of a resolution of Israel’s conflict with the Palestinians, the conflict which got us here in the first place.\n\nAt some point, when Israel feels it has done enough damage to Hamas and Hezbollah, Israel and Iran have both had their say - assuming this doesn’t plunge the region into an even deeper crisis - and the US presidential election is over, diplomacy may get another chance.\n\nBut right now, that all feels a very long way off.","summary":"Talk of how the Israel-Palestine conflict could be resolved has been drowned out amid the increased fighting.","url":"https://www.bbc.com/news/articles/c2ek1ejj11ko","image":"https://ichef.bbci.co.uk/news/1024/branded_news/a4f8/live/fac3f6c0-84d2-11ef-83dd-fbf1b9732cf0.png","video":null,"publish_date":"2024-10-07 23:41:31","author":"Paul Adams","authors":["Paul Adams"],"language":"en","source_country":"gb","sentiment":-0.252},{"id":258835760,"title":"Elon Musk tells Tucker Carslon he's f***ed if Trump loses election: 'How long do you think my prison sentence is going to be?'","text":"Elon Musk told Tucker Carlson that if Kamala Harris wins the election, 'I'm f***ed' and predicts the vice president will send him to prison.\n\nThe Tesla CEO, 50, sat down with the ex-Fox News host for a 90-minute interview on the Musk-owned social media app X. \n\nThe chat began with Carlson wondering what would happen to Musk if Trump loses, with both beginning to cackle. \n\n'If Trump loses, you're f***ed, dude,' Carlson said, with Elon laughing along and agreeing. \n\n'If he loses, I'm f***ed,' he affirmed. 'How long do you think my prison sentence is going to be? Will I see my children? I don't know.'\n\nMusk and Carlson both said that if Harris beats Trump in November, it will be the last election.\n\nHowever, Musk confirmed that he will continue to support the former president even if he loses.\n\nBoth joked that Harris and Joe Biden are figureheads for a movement rather than substantial politicians.\n\n'Kamala is gonna say whatever the teleprompter is gonna say,' Musk claimed.\n\nHe also told Carlson of his concerns that religion has been replaced in society with the 'woke mind virus.'\n\nThe interview comes on the back of Musk's appearance at a Trump rally on Saturday in Pennsylvania.\n\nMusk jumped wildly with his fists in air as he joined Donald Trump on stage for the first time.\n\nThe dramatic appearance by the Tesla and SpaceX boss came as Trump returned to the Butler Farm Show grounds in Pennsylvania, where he survived an attempted assassination three months ago.\n\nAfter leaping up and down, Musk told the huge crowd: 'America is the home of the brave and the true test of someone’s character is how they behave under fire.\n\n'We had one president who couldn’t climb a flight of stairs and another who was fist-pumping after getting shot! FIGHT, FIGHT, FIGHT!'\n\nMusk, wearing a black baseball hat, urged supporters to vote, and register to vote, and to get others to 'vote right now'.\n\n'I'm being repetitive for a reason,' he said. 'Honestly you want to be a pest. Fight, fight, fight! Vote, vote, vote!'\n\nMusk's appearance at Trump's rally in Butler was the first time he has taken the stage at a political rally. \n\nThe billionaire was inspired to endorse Trump publicly after the failed assassination attempt of the former president at Butler on July 13. \n\nAs the two men were on stage Trump praised Musk for donating Starlink systems to victims of hurricane Helene, joking he did not understand what the space satellite internet system was.\n\n'I didn't know what the hell Starlink was,' Trump admitted.\n\nThe crowds shouted 'Elon! Elon! Elon!' In response","summary":"Elon Musk told Tucker Carlson that if Kamala Harris wins the election, 'I'm f***ed' and predicts the vice president will send him to prison.","url":"https://www.dailymail.co.uk/news/article-13934743/Elon-Musk-tells-Tucker-Carslon-hes-f-ed-Trump-loses-election-long-think-prison-sentence-going-be.html","image":"https://i.dailymail.co.uk/1s/2024/10/08/00/90570167-0-image-a-12_1728342700292.jpg","video":null,"publish_date":"2024-10-07 23:34:55","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.307},{"id":258834744,"title":"Lawmakers mark one year since Oct. 7 terrorist attack on Israel, issue calls for peace","text":"It’s been a full year since Hamas-backed terrorists stormed into Israel and slaughtered more than 1,200 civilians before taking hundreds more hostage, and politicians of all stripes used the day to call for the release of those still held captive and an end to the ongoing violence.\n\nPresident Joe Biden issued a statement of support for Israel to mark the anniversary of an atrocity which “brought to the surface painful memories left by millennia of hatred and violence against the Jewish people.”\n\n“On this solemn anniversary, let us bear witness to the unspeakable brutality of the October 7th attacks but also to the beauty of the lives that were stolen that day,” Biden said.\n\nThe President also pointed to Gaza, where Hamas has ruled for nearly two decades, and where Israel’s swift and violent response to the horror visited on them on October 7 has led to tens of thousands of civilian deaths.\n\n“I believe that history will also remember October 7th as a dark day for the Palestinian people because of the conflict that Hamas unleashed that day,” Biden said.\n\nVice President Kamala Harris said in a statement that a Harris Administration would stand firm with Israel, adding she is “heartbroken over the scale of death and destruction in Gaza over the past year.”\n\n“It is past time for a hostage and ceasefire deal to end the suffering of those innocent people,” Harris said.\n\nFormer President Donald Trump’s campaign declared that a second Trump term could have prevented the attack and that the Biden Administration’s response has not helped.\n\n“The Biden-Harris Administration continues to criticize Israel’s defense efforts, appease Hamas’ puppet master — Iran, and pander to Hamas’ sympathizers and anti-Semites,” the campaign wrote.\n\nThe Bay State’s senior senator, U.S. Sen. Elizabeth Warren, said via the social media platform formerly known as Twitter that Israeli Prime Minister Benjamin Netanyahu “has unleashed unthinkable violence on innocent civilians in Gaza.”\n\n“We urgently need a ceasefire, release of the hostages, massive humanitarian relief in Gaza, and diplomatic efforts towards a two-state solution,” she wrote.\n\nU.S. Rep. Katherine Clark, the House Minority Whip, said in a statement that Israel’s “right to defeat Hamas” has nevertheless “caused unfathomable devastation” in Gaza.\n\n“We need a lasting ceasefire in the region. That is the only path to security for both the Israeli and Palestinian people,” she said.\n\nMassachusetts Gov. Maura Healey ordered flags at government buildings flown at half staff to mark a year since Hamas launched their “horrific, indefensible attack.”\n\n“Since that day, terror, grief and trauma have continued to reverberate throughout the Jewish community, coupled with a rise in antisemitism and hate both here in Massachusetts and across the globe,” she said.","summary":"“I believe that history will also remember October 7th as a dark day for the Palestinian people because of the conflict that Hamas unleashed that day,” Biden said.","url":"https://www.bostonherald.com/2024/10/07/lawmakers-mark-one-year-since-oct-7-terrorist-attack-on-israel-issue-calls-for-peace/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/AP24281691011041.jpg?w=1024","video":null,"publish_date":"2024-10-07 23:32:57","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.151},{"id":258834448,"title":"Trump’s Mar-a-Lago, golf resorts are outside Milton’s path. But Truth Social’s offices are at risk","text":"Former President Donald Trump‘s marquee Florida properties, including his Mar-a-Lago Club and various golf resorts lie outside the anticipated path of Hurricane Milton, the Category 5 storm that is expected to make landfall later this week on Florida’s Gulf Coast.\n\nBut the Sarasota offices of Trump Media, the parent company of Truth Social, are directly in the storm’s projected sight line.\n\nMar-a-Lago, the Trump International Golf Club in West Palm Beach and the Trump National Golf Club in Jupiter are all located in Palm Beach County. The Trump National Doral Miami is in Miami-Dade County.\n\nBoth areas are outside of the National Weather Service’s forecast cone for Milton, though those projections could change over the coming days.\n\nOfficials have nonetheless declared a local state of emergency in both counties, which are also under flood watch. Residents are encouraged to develop evacuation plans and have disaster kits ready as Milton’s projected path evolves.\n\nMeanwhile, the Truth Social offices are located directly within the zone where Milton is expected to make landfall on the Gulf Coast late Wednesday. \n\nTrump is the largest shareholder of Trump Media, a publicly traded company that mainly operates the Truth Social platform. \n\nIn a August filing with the Securities and Exchange Commission, the company said it had cut back expenses in part by reducing rent costs. But its most recent disclosure, filed Oct. 4, listed the Sarasota address and an area telephone number as the company’s principal executive offices.\n\nTrump Media did not immediately respond to questions from CNBC about the office, how many employees work from it and how often, and how the company is preparing for Milton. The former president does not own the Sarasota office property himself.","summary":"An aerial view of former U.S. President Donald Trump&#8217;s Mar-a-Lago home after Trump said that FBI agents raided it, in Palm Beach, Florida, U.S. August 15, 2022.  Marco Bello &#124; Reuters Former President Donald Trump&#8216;s marquee Florida properties, including his Mar-a-Lago Club and various golf resorts lie outside the anticipated path of Hurricane Milton, the &#8230;\n\n\nThe post Trump&#8217;s Mar-a-Lago, golf resorts are outside Milton&#8217;s path. But Truth Social&#8217;s offices are at risk appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/trumps-mar-a-lago-golf-resorts-are-outside-miltons-path-but-truth-socials-offices-are-at-risk/","image":"https://image.cnbcfm.com/api/v1/image/108006127-17210537622024-07-15t142645z_1935895531_rc2ywv9njv6u_rtrmadp_0_usa-trump-documents.jpeg?v=1721053796&w=1920&h=1080","video":null,"publish_date":"2024-10-07 23:28:01","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.143},{"id":258834804,"title":"Elon Musk Put on Blast by MSNBC for Spreading ‘Nonsense’ About Hurricane Helene | Video","text":"Elon Musk was thoroughly roasted online over the weekend for his energetic onstage leaps at Donald Trump’s rally on Sunday. However, the inaccuracies he posted about the government’s response to Hurricane Helene have now also come under scrutiny.\n\n“His irresponsibility is, frankly, astounding in light of the fact that he … is a contractor to the Department of Defense,” guest analyst Claire McCaskill told MSNBC host Nicolle Wallace on Monday.\n\n“Keep in mind, Elon Musk’s company is now responsible for some of the satellites that are going in some sensitive equipment, and he is doing this nonsense,” the former Senator from Missouri continued.\n\nShe also called out Trump for sharing “the most bizarre lies,” including that the federal government is blocking aid to the people in North Carolina affected by the devastating storm and seizing it for their own use as well as seizing the property of anyone who files a claim with FEMA.\n\n“It is crazy and Elon Musk is part of it. He is a partner in it. His platform is promoting it. Sinclair New Channels all over the country are repeating Elon Musk’s claims on X that the federal government is blocking aid to communities,” McCaskill added. “I think the modern motives are pretty obvious, but that is really broken through in the right wing dis-info sphere.”\n\n“Anybody who’s in hurricane country knows it’s B.S., because they know you could apply for much more,” she elaborated. “$750 is just the check they cut right away. You can get food and water, housing and gas. It is not all you get.”\n\nWallace then discussed Musk herself, saying, “I want to understand what the business model is that rewards the most powerful humans on the planet using his mighty, once great platform to destroy lives, to tear apart this country at a moment of genuine natural disaster crisis.”\n\nThe above statements came days after Musk falsely asserted that the FAA was going to “shut down” airspace over impacted states. His Friday Tweets were promptly called out by Pete Buttigieg, among others.","summary":"\"Anyone in hurricane country knows it's B.S.,\" Claire McCaskill tells host Nicolle Wallace\n\n\nThe post Elon Musk Put on Blast by MSNBC for Spreading &#8216;Nonsense&#8217; About Hurricane Helene | Video appeared first on TheWrap.","url":"https://www.thewrap.com/elon-musk-hurricane-helene-lies-msnbc-claire-mccaskill/","image":"https://www.thewrap.com/wp-content/uploads/2024/10/elon-musk-trump-rally.jpg","video":null,"publish_date":"2024-10-07 23:26:37","author":"Sharon Knolle","authors":["Sharon Knolle"],"language":"en","source_country":"US","sentiment":-0.147},{"id":258834108,"title":"Israel-Hezbollah conflict live updates","text":"More than a hundred aircraft were involved in the strikes, according to the Israeli Defence Forces (IDF).\n\n“These targets belonged to various units of the Hezbollah terrorist organisation, including regional units of Hezbollah’s southern front, the Radwan Forces, the Missiles and Rockets Force, and the Intelligence Directorate,” the IDF said.\n\n“This operation follows a series of strikes aimed at degrading Hezbollah’s command, control, and firing capabilities, as well as assisting ground forces in achieving their goals.”\n\nEarlier on Monday, local time, Israeli Prime Minister Benjamin Netanyahu marked the anniversary of last year’s October 7 attack by Hamas by vowing that his country would “continue to fight”.\n\n“As long as there are kidnapped in Gaza, we will continue to fight. We will not give up any of them. I will not give up,” said Mr Netanyahu.\n\n“As long as our citizens do not return to their homes safely, we will continue to fight.”\n\nMore than 1200 Israelis were murdered in the October 7 attack, most of them civilians, and hundreds more were kidnapped.\n\nAccording to the health ministry in Hamas-run Gaza, about 42,000 people have been killed in Israel’s retaliatory strikes over the past year.\n\nRead on for the latest updates from the conflict in the Middle East\n\n‘A nightmare’: Agony of hostage’s mother\n\nThe mother of Romi Gonen, one of the Israeli hostages who still remains in Gaza, has spoken to CNN about her year of torment.\n\nRomi, who’s now 24 years old, was one of the people kidnapped from the Nova music festival during the Hamas attack on October 7.\n\n“I cannot even explain how you feel when you wake up in the morning, and for the first moments you hope this is only a nightmare, a dream, a bad dream. But then you are waking up to a reality,” Meirav Gonen told CNN.\n\n“This is so agonizing, it’s so difficult.”\n\nMs Gonen revealed that some other hostages who were with her daughter in Gaza have since been returned to Israel.\n\n“They came back with stories. Funny stories, and some disturbing also stories. She’s holding up. She was saying she’s holding up for me. And I want her to see me and I want her to see that I’m strong. I’m strong for her. I’m strong for her brothers and sisters,” she said.\n\nRomi’s hand was injured by a gunshot during the attack.\n\n“The color in her fingers was changing, her hand is not functioning,” Ms Gonen said.\n\n“Today I’m saying, it doesn’t matter if she lost her hand. We just have to bring her back alive.”\n\nUnited States condemns ‘unspeakable brutality’\n\nIn the United States, President Joe Biden, Vice President Kamala Harris and Republican presidential nominee Donald Trump have all marked the anniversary of October 7.\n\nIn a solemn Jewish ceremony of mourning at the White House, Mr Biden lit a candle while a rabbi chanted a prayer for the victims. Ms Harris, the Democratic Party’s nominee, planted a memorial tree at her residence in Washington. Meanwhile Mr Trump met Jewish leaders at a sacred gravesite in New York.\n\n“Far too many civilians have suffered far too much during this year of conflict,” Mr Biden said in a statement.\n\nThe President lashed out at the “unspeakable brutality” of the Hamas attacks and said he and Ms Harris were “fully committed” to Israel’s security against Iran and its regional allies.\n\nBut he also described October 7 as a “dark day for the Palestinian people”, and said he and Ms Harris “will not stop working to achieve a ceasefire deal in Gaza.”\n\nThe Vice President told reporters that a Gaza ceasefire deal was the best hope to “bring any type of stability to the region”.\n\n“We’re not giving up. We’re doing everything we can possibly do to get the ceasefire hostage deal done,” she said.\n\nMr Trump’s campaign issued a statement saying: “It’s imperative that President Trump is re-elected so he can end the bloodshed.”\n\nMore strikes in suburbs of Beirut\n\nSmoke can still be seen rising above the suburbs of the Lebanese capital, Beirut, as Israel continues to strike against Hezbollah targets.\n\nLebanese state media said late on Monday that a pair of strikes from “enemy war planes” had hit the city’s southern suburbs.\n\nThe IDF had given residents warning to clear the area ahead of time.\n\nThose strikes followed the earlier flurry involving a hundred aircraft, which bombarded 120 different targets across southern Lebanon.\n\nIsrael warned against hitting airport\n\nThe United States has warned Israel not to attack Beirut’s airport or the roads leading to it.\n\n“We think it’s very important that not only the airport be open, but that the roads to the airport be open, so that American citizens who want to leave can get out, but also citizens of other countries,” said Matthew Miller a spokesman for the US State Department.\n\nFor the past week, the United States has been chartering near-daily flights to get its citizens and their families out of the country as the conflict between Israel and Iran-backed Lebanese terror group Hezbollah escalates.\n\nSome 900 people have taken the flights so far, Miller said, though he added that none of them were fully booked.\n\nThe US is also reserving seats on commercial flights that continue to operate. Some 8500 Americans have contacted the State Department to inquire about departure conditions, but this does not mean they all wish to leave, he added.\n\nThe spokesman refused to comment on Israeli strikes in Lebanon – Beirut in particular – and whether or not they respected international law.\n\n“I don’t have a characterisation of them one way or the other,” he said.\n\n“But of course, we expect them to target Hezbollah in a way that complies with international humanitarian law and minimises civilian casualties.”\n\nMr Miller stressed that, while the US supports Israel in its fight against Hezbollah, “we are very cognisant of the many times in the past where Israel has gone in on what looked like limited operations and has stayed for months or for years”.\n\n“Ultimately, that is not the outcome that we want to see.”","summary":"Israel has launched a new flurry of air strikes across southern Lebanon, targeting approximately 120 different sites within a single hour.","url":"https://www.news.com.au/world/middle-east/israelhezbollah-conflict-live-updates-israelis-mark-anniversary-of-october-7-hamas-attack/news-story/0ddfe3e4b7befbb29521f73af43675c0?from=rss-basic","image":"https://content.api.news/v3/images/bin/7e99a53b7a85f48baa447484c7c22ef3","video":null,"publish_date":"2024-10-07 23:22:36","author":"Samuel Clench","authors":["Samuel Clench"],"language":"en","category":"politics","source_country":"au","sentiment":-0.353},{"id":258834226,"title":"FEMA Chief Continues Countering False Claims About Helene Response","text":"As Hurricane Milton threatens, the head of the Federal Emergency Management Agency (FEMA) continued to push back on false claims pertaining to its response to Hurricane Helene.FEMA Administrator Deanne Criswell on Monday highlighted the agency's expansive and growing collaborative efforts, urging residents in the hardest-hit areas to take advantage of the government's assistance programs.\"We have thousands of people on the ground, not just federal, but also our volunteers in the private sector,\" Criswell said while speaking at a news conference in North Carolina. \"And frankly, that type of rhetoric is demoralizing to our staff that have left their families to come here and help the people of North Carolina. And we will be here as long as they're needed.\"In the wake of Helene, misinformation has circulated in the ravaged communities, including false claims that the federal government is deliberately withholding aid from Republican areas. Presidential nominee and former President Donald Trump and other Republicans have criticized FEMA's response, saying without evidence that the agency's disaster relief funding is being diverted to migrants or foreign conflicts.Since Helene, FEMA has used portions of its website to combat misinformation and to address rumors on the storm and the agency's response to it.On Friday, FEMA issued a statement debunking rumors that it would only provide $750 to disaster survivors. Criswell clarified that the initial payment is intended to cover immediate needs, such as food and medicine. She emphasized that additional funds would be available to reimburse residents for home repairs, personal losses and temporary housing, including rental units and hotel stays.\"But I can't give it to them if they don't apply,\" Criswell said while speaking about the payments. \"And if people are afraid to apply, then it is hurting them.\"During the news conference, Criswell was asked about claims that FEMA would push to seize the assets of recipients who did not pay the $750 back, which she called \"absolutely false.\"Recovery efforts continued Monday in the wake of the storm that killed at least 230 people, as Hurricane Milton rapidly intensified into a Category 5 storm. Milton is heading toward Florida, targeting the same region devastated by Helene less than two weeks ago.According to data from Poweroutage.us, there are more than 100,000 customers in North Carolina still without power due to Helene's wrath. In the Tar Heel State, more than 1,600 local and state search-and-rescue personnel have been deployed, along with an additional 1,700 members of the state National Guard, according to Governor Roy Cooper's office.The Pentagon announced Monday that 500 more active-duty troops have been deployed to North Carolina, bringing the total number to around 1,500. Pentagon press secretary Major General Pat Ryder said the incoming forces are equipped with advanced surveillance technology, which will help officials gain a clearer view of the region's conditions.Air Force General Gregory Guillot, commander of the North American Aerospace Defense Command, said military search-and-rescue aircraft were conducting 10-hour sorties to provide wellness checks, medical assistance and evacuations. He described the operation as the military's \"most important and honorable mission,\" emphasizing their role in helping fellow citizens.This article includes reporting from the Associated Press.","summary":"Since Helene, FEMA has used portions of its website to combat misinformation about the agency's response to the storm.","url":"https://www.newsweek.com/fema-chief-hurricane-helene-misinformation-claims-1965314","image":"https://d.newsweek.com/en/full/2489620/fema.jpg","video":null,"publish_date":"2024-10-07 23:21:10","author":"Matthew Impelli","authors":["Matthew Impelli"],"language":"en","category":"politics","source_country":"us","sentiment":-0.455},{"id":258835492,"title":"North Carolina families mourn loved ones by burying them in yards amid criticism towards FEMA for hurricane ‘concealment’","text":"Grieving families in North Carolina have been forced to bury their dead in their backyards – and are accusing authorities of downplaying the damage caused by Hurricane Helene.\n\nThe official death toll rose to 227 over the weekend – half of whom were from North Carolina – but state and federal officials told The Spectator that this number is woefully inaccurate. \n\nMany bodies haven’t even been recovered amid debris and flooding. There are also piles of deceased people who have yet to be identified. They are being transported all over the state in hopes of finding open morgue space.\n\n‘According to folks on the ground – fire, medical, law enforcement officials – they’re way underreporting the numbers. All the morgues are full and they’ve hauled a ton [of bodies] to Greensboro,’ the state official said. ‘People are starting to bury them in their yards because they have no place to put them.’\n\nOne individual who was in Asheville when Helene hit told The Spectator: ‘It’s so much worse than they’re saying…I think there’s a massive cover-up.’\n\nThe destruction from Helene, and the immense multi-state death toll, comes just days before Category 5 Hurricane Milton is set to barrel into Florida’s coastline. \n\nHelene made landfall in the Big Bend region of Florida at night on September 26 before laying waste to Georgia and the Carolinas with record storm surges and tornados.\n\nNorth Carolina alone had six confirmed tornados on the morning of September 27, two days before 500 members of state’s national guard were deployed to help with rescue efforts.\n\nLocals say they are ‘pissed’ at General Major Todd Hunt, director of the North Carolina National Guard, for waiting a whole 48 hours to get boots on the ground.\n\nThere were 5,500 national guardsmen deployed around this time, some of them from other states such as Florida. \n\n‘That’s why you saw the Florida National Guard and other units out there – and why private citizens stepped in, even as state and federal officials tried to shut down their efforts,’ an anonymous source familiar with the situation in North Carolina told The Spectator.\n\nBefore North Carolina national guardsmen were deployed, a four-year-old girl was killed in a car crash in Claremont, a town around 40 miles north of Charlotte.\n\nAnother person died after a tree fell on their Charlotte home.\n\nIn North Carolina’s Buncombe County, 40 people have died, the county manager has stated. \n\nAsheville, a popular tourist destination in Buncombe County, was one of the hardest hit towns, where scenes of complete devastation are all too common.\n\nThe small mountain town of Swannanoa dealt with flood levels not seen since 1791, and locals have said their community was ‘entirely erased.’\n\nThis comes days after a whistleblower wrote a letter to Rep. Matt Gaetz, R-Fla., that details how the Federal Emergency Management Agency (FEMA) has wasted and misappropriated funds in the wake of Helene and is now ‘exacerbating the emergency.’\n\nThe letter to Gaetz also alleges ‘hundreds if not thousands’ of first responders and service members have been ‘without deployment orders’ with some waiting around in hotels while others ‘have sat idle’ as Americans throughout the southeast are in dire need.\n\nLast week, Department of Homeland Security Secretary Alejandro Mayorkas admitted that FEMA ran out of money to make it through the hurricane season, after it handed out more than $1 billion in taxpayer dollars to give housing assistance to illegal migrants over the last two years. \n\nJoe Gabriel Simonson, a reporter for the Washington Free Beacon, snapped a picture of Mayorkas shopping in a luxury department store in Washington D.C. allegedly on October 5, which would have been during the peak of the Helene rescue efforts.\n\n‘So, suffice to say, the guy isn’t working around the clock,’ Simonson wrote on X.\n\nDailyMail.com approached Homeland Security for comment.\n\nPresident Joe Biden also came under fire for his response to the disaster because he spent the weekend of the hurricane hit at his Rehoboth Beach vacation home.\n\n‘I was commanding, I was on the phone for at least two hours yesterday, and the day before, as well. I commanded, it’s called a telephone,’ he told reporters. \n\nFollowing this criticism, Biden deployed 1,000 active duty soldiers to North Carolina. He also took an aerial tour with Governor Roy Cooper to witness the damage before giving a news conference.\n\nVice President Kamala Harris, the Democratic nominee for president, has also visited the designated hurricane disaster zone twice.\n\nHer opponent, former President Donald Trump, has slammed both her and Biden for what he called ‘the worst response in the history of hurricanes’ during a rally last Thursday in battleground Michigan. \n\n‘A certain president, I will not name him, destroyed his reputation with Katrina,’ Trump said, referring to former President George W. Bush. ‘And this is going even worse. She’s doing even worse than he did.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nGrieving families in North Carolina have been forced to bury their dead in their&#8230;\n\n\nThis Post: North Carolina families mourn loved ones by burying them in yards amid criticism towards FEMA for hurricane &#8216;concealment&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/north-carolina-families-mourn-loved-ones-by-burying-them-in-yards-amid-criticism-towards-fema-for-hurricane-concealment/","image":"https://i.dailymail.co.uk/1s/2024/10/07/21/90564327-13934059-A_drone_view_shows_a_damaged_area_in_Swannanoa_North_Carolina_on-a-186_1728332219044.jpg","video":null,"publish_date":"2024-10-07 23:19:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.479},{"id":258833980,"title":"Hochul pushing staff changes at ‘Titanic’ City Hall as she avoids ousting Adams before Nov. 5 election: sources","text":"Gov. Kathy Hochul is intent on filling top posts in Eric Adams’ administration as City Hall turns into the “Titanic” — but insiders say she’s won’t push out the mayor before the election for fear of backlash.\n\nExercising the governor’s authority to oust the embattled Adams would carry outsize political risks for Hochul, including alienating black leaders who’ve rallied behind Hizzoner and the unsavory potential of her former boss, Andrew Cuomo, jumping into the mayoral race, sources said.\n\nHochul is likely also smarting from Rep. Nancy Pelosi bluntly blaming her for 2022 losses in New York congressional races that cost Democrats their House majority, said political strategist Hank Sheinkopf.\n\n“The trick here is to not remove [Adams] before next June, if possible, so you don’t provide the opportunity for someone like Andrew Cuomo to come into power,” he said. “She is worried about suburban black votes.\n\n“She can’t take the risk of pushing him out before the November election and seem to be affecting the suburban black vote. The best thing for her to do is get managers in place to run the city.”\n\nSeveral City Hall officials touched by churning federal investigations have either resigned or been forced out since Adams’ indictment — an exodus driven by Hochul’s behind-the-scenes decree that the mayor clean house if he wants to keep his job, according to sources.\n\n“She’s not looking to install people, but she wants to make sure the mayor has a strong team in place to help keep things running smoothly,” a source familiar with Hochul’s thinking said.\n\nInsiders said City Hall’s day-to-day functioning has all but been crippled as Adams battles federal bribery and corruption charges.\n\n“No one is picking up the phone over there,” a Democratic political operative said. “Everyone who is making decisions is hunkering down, trying to figure out how to fight, how to handle these investigations.”\n\nThe stain of corruption and dysfunction is scaring off outside candidates as Adams tries to fill important vacant or soon-to-be vacant jobs like NYPD commissioner and first deputy mayor, the source said.\n\n“Who in their right mind is going over to the Titanic?” the operative said.\n\n“I don’t know why anyone would want to come into this administration right now,” a political pundit said.\n\nHochul has taken an outsize role in shaping a City Hall staffed with top officials with no allegiance to Adams — a break from Hizzoner’s practice of giving plum gigs to scandal-plagued friends such as Phil Banks, who resigned Sunday night and whose brothers David Banks, the outgoing schools chancellor, and Terence Banks were raided by the feds last month.\n\nReplacing cronies with good-government types not only could help Adams temporarily keep his job, but also lay the groundwork for a functional New York City government if Hochul later moves to boot the mayor, sources said.\n\nCity Public Advocate Jumaane Williams will take over as mayor until another is elected in a special election to be held within 80 days of Adams’ ouster, or even longer if Adams exits on or after March 26, 2025 — a situation that also creates more pressure to fill high-level vacancies soon, according to sources.\n\nThe upcoming mayoral primaries in June 2025 are also a ticking clock element.\n\n“If Jumaane comes into power and he’s the temporary mayor, it would be unseemly for him to start tossing those people, so you have a management administration,” a source said.\n\n“The thinking is, get good people in there because between now and June there’s going to be chaos whether Eric Adams stays or goes. There’s not doubt you’ll need that level of competency. So one way or another you’ll get those people in there.”\n\nTwo sources told The Post that First Deputy Mayor Sheena Wright — who is ambiguously clinging to her post after insiders said the mayor will force her to resign — likely will be replaced by Maria Torres-Springer, the city’s deputy mayor for housing.\n\nTorres-Springer carries a reputation for competence that the Democratic operative said Wright didn’t.\n\n“The water was above her head,” the operative said. “She was too much of a celebrity, not an administrator.”\n\nSanitation Commissioner Jessica Tisch and Anthony Shorris, a veteran of former Mayor Bill de Blasio’s administration who previously served as first deputy mayor, are also in the running for Wright’s job, sources said.\n\nThe Hochul-driven reshuffling likely will stop short of Adams himself, at least so long as he has the backing of black leaders, insiders said.\n\n“I don’t see her doing it,” said one black Democratic official with ties to City Hall and Albany. “Black leaders have respect for the justice system to let it play out.”\n\nHazel Dukes, the longtime president of New York’s chapter of the NAACP, said she’s sticking with Adams, as long as he wants to remain in office and fight the charges.\n\nShe noted that former President Donald Trump is fighting the myriad indictments against him and believes Adams should be afforded the same right.\n\n“Trump’s hearings have been postponed until after the election,” she said.\n\n“Eric Adams has the right to have his day in court. People can stay and fight, or resign.\n\nJohn Kaehny, executive director of Reinvent Albany, however, blasted Hochul’s “completely political” choice to avoid taking action before the presidential election.\n\n“This whole thing of throwing the pirates overboard and leaving Captain Hook in charge is just ridiculous,” he said.\n\n“It’s just completely cynical politics. Again, who got indicted? Not the deputy mayors who are all resigning.”","summary":"Gov. Kathy Hochul is intent on filling top posts in Eric Adams’ administration as City Hall turns into the “Titanic” — but insiders say she’s won’t push out the mayor before the election for fear of backlash. Exercising the governor&#8217;s authority to oust the embattled Adams would carry outsize political risks for Hochul, including alienating...","url":"https://nypost.com/2024/10/07/us-news/hochul-pushing-staff-changes-at-titanic-city-hall-as-she-avoids-ousting-adams-before-nov-5-election-sources/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/100224-ny-governor-kathy-hochul-91194769.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-07 23:15:16","author":"Carl Campanile,Craig McCarthy,Matt Troutman,Vaughn Golden","authors":["Carl Campanile","Craig McCarthy","Matt Troutman","Vaughn Golden"],"language":"en","category":"politics","source_country":"us","sentiment":-0.205},{"id":258837502,"title":"Vance reveals Trump’s plan for abortion: reports","text":"2024 GOP vice presidential nominee JD Vance revealed that Donald Trump plans to completely gut Planned Parenthood if he defeats Kamala Harris next month, The Daily Beast reports.\n\nWith a history of flip-flopping on the issue of abortion, Trump successfully reversed Roe v. Wade by appointing conservative justices to the Supreme Court in 2022, and just last month submitted that Florida’s six week abortion ban was too strict. \n\nThe former president even said last month that his administration would be \"great for women and their reproductive rights.\"\n\nREAD MORE: Melania Trump defends reproductive rights in new memoir: reports\n\nVance suggested the opposite over the weekend.\n\n\"On the question of defunding Planned Parenthood, look, I mean our view is we don’t think that taxpayers should fund late-term abortions,\" the Ohio senator JD Vance said, according to NBC News. \"That has been a consistent view of the Trump campaign the first time around. It will remain a consistent view.\"\n\nThe Beast notes that Vance's assertion drew criticism from Harris' spokesperson, Lauren Hitt, said Vance's comment proved that \"a second Trump term is too big a risk for American women and their families.\"\n\nHitt added, \"The only way to stop an unchecked Trump and his MAGA allies from ripping away freedoms from American women is to elect Vice President Harris, who will defend women’s access to health care and reproductive freedom.\"\n\nREAD MORE: 'He is not done': Harris responds to Trump’s latest flip-flop on Florida ballot measure\n\nVance's comment also comes after The Guardian revealed last week that Trump's wife, Melania Trump, confirms in her new memoir that she's an advocate for abortion rights.","summary":"2024 GOP vice presidential nominee JD Vance revealed that Donald Trump plans to completely gut Planned Parenthood if he defeats Kamala Harris next month, The Daily Beast reports.\n\nWith a history of flip-flopping on the issue of abortion, Trump successfully reversed Roe v. Wade by appointing conservative justices to the Supreme Court in 2022, and just last month submitted that Florida’s six week abortion ban was too strict.  \n\nThe former president even said last month that his administration would be \"great for women and their reproductive rights.\"\n\nREAD MORE: Melania Trump defends reproductive rights in new memoir: reports\n\nVance suggested the opposite over the weekend.\n\n\"On the question of defunding Planned Parenthood, look, I mean our view is we don’t think that taxpayers should fund late-term abortions,\" the Ohio senator JD Vance said, according to NBC News. \"That has been a consistent view of the Trump campaign the first time around. It will remain a consistent view.\"\n\nThe Beast notes that Vance's asserti","url":"https://www.alternet.org/trump-abortion-vance/","image":"https://www.alternet.org/media-library/image.jpg?id=26955354&width=1200&height=600&coordinates=0%2C18%2C0%2C19","video":null,"publish_date":"2024-10-07 23:15:03","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":258833360,"title":"Rams HC Sean McVay Reveals Return Timeline for Star WR Cooper Kupp","text":"The Los Angeles Rams might be one of the most hurt teams in the NFL. They currently have players on both sides of the ball on the IR including wide receiver Puka Nacua, offensive linemen Jonah Jackson, Steve Avila, and Joe Noteboom.More news: Raiders' Davante Adams Trade Could Happen Very Soon: ReportTo make matters worse, the team has also been without Pro Bowl wide receiver Cooper Kupp. Kupp injured his ankle in Week 2 and has yet to suit up since then. The Rams couldn't afford to put him on the IR, so he has just not played.With Kupp and Nacua out, the offense has not been the most dynamic. Backup receivers Tutu Atwell, Jordan Whittington, and Demarcus Robinson have done a decent job, but more help is needed.The good news is though Kupp has been out for multiple weeks, Rams head coach Sean McVay has finally offered a positive update on Kupp's return.According to The Athletic's Rams reporter Jordan Rodrigue, \"Los Angeles Rams coach Sean McVay said Monday that a Week 7 return for star receiver Cooper Kupp would be 'an ideal target' but 'by no means is that guaranteed.'\"Though Kupp will still be out for the next game, he is being slated as presumably returning in Week 7. The Rams desperately need both Kupp and Nacua back, and it appears they will finally get a chance to have one of their Pro Bowl receivers back.Kupp has dealt with injuries the past two seasons that have hampered his productivity greatly.In 2023, Kupp suffered an ankle injury that kept him out of four games for the season. He also missed the regular season finale. Despite being out for five games, Kupp still put up 737 yards and five touchdowns.Kupp being out in 2024 is eerily similar to that of 2023. However, the hope is he can also return and make an immediate impact.The Rams do have the benefit of having a Pro Bowl-caliber running back in Kyren Williams, who has now gone eight straight games with a touchdown, but more is needed. Adding Kupp back to the offense will allow it to change in a way that will help Matthew Stafford.More news: Antonio Brown Accuses NBC of Censoring Elon Musk After Donald Trump Rally AppearanceStafford has not had the same weapons around him that he did in 2023, and the offense not being in sync has certainly been proven. The Rams are currently 1-4 and have not looked like they did in 2022 when they were also dealing with a multitude of injuries.The good news is the Rams are heading into a bye week, and will face the lowly Las Vegas Raiders in Week 7. With Kupp ready to return then, the Rams might be able to rebound their season.For more on the Rams and NFL, head to Newsweek Sports.","summary":"The Los Angeles Rams have been without Cooper Kupp, who might finally be working his way back to the timeline.","url":"https://www.newsweek.com/sports/nfl/rams-hc-sean-mcvay-reveals-return-timeline-star-wr-cooper-kupp-1965331","image":"https://d.newsweek.com/en/full/2489664/rams-wr-cooper-kupp.jpg","video":null,"publish_date":"2024-10-07 23:09:06","author":"James Brizuela","authors":["James Brizuela"],"language":"en","source_country":"us","sentiment":-0.033}]}