{"offset":0,"number":50,"available":7907,"news":[{"id":261322114,"title":"Humor columnist from The Washington Post subtly endorses a presidential candidate after the newspaper declined to support Kamala Harris","text":"The Washington Post’s humor columnist has penned a column in which she shares her personal endorsement for Kamala Harris after the newspaper withheld the paper’s planned endorsement of the Democratic candidate. \n\nAlexandra Petri, who is described as being a writer with ‘a lighter take on the news and opinions of the day’ outlined her choice in her column on Saturday. \n\n‘I would be a little embarrassed that it has fallen to me, the humor columnist, to make our presidential endorsement. I will spare you the suspense: I am endorsing Kamala Harris for president, because I like elections and want to keep having them,’ Petri wrote.\n\n‘I’m just a humor columnist. I only know what’s happening because our actual journalists are out there reporting, knowing that their editors have their backs, that there’s no one too powerful to report on, that we would never pull a punch out of fear.\n\n‘…if we think Trump should not return to the White House and Harris would make a fine president, we’re going to be able to say so. That’s why I, the humor columnist, am endorsing Kamala Harris by myself!’ she added.\n\nLast week it emerged how the Post’s editorial board had written a leader column endorsing Democratic candidate Kamala Harris, but the piece was allegedly spiked after the newspaper’s owner and Amazon found Jeff Bezos stepped in. \n\nThe decision was immediately condemned by a former executive editor but one that the current publisher insisted was ‘consistent with the values the Post has always stood for.’ \n\nSuch claims have been denied by the paper’s publisher Will Lewis, but the decision has roiled the newsroom with more than a dozen staffers wrote their own column slamming the Post’s decision accusing the paper of ‘abandoning the fundamental editorial convictions of the newspaper that we love.’\n\n‘This is a moment for the institution to be making clear its commitment to democratic values, the rule of law and international alliances, and the threat that Donald Trump poses to them—the precise points The Post made in endorsing Trump’s opponents in 2016 and 2020,’ the columnists wrote. \n\nIn an article posted on the front of its website, the Washington Post – reporting on its own inner workings – also quoted unidentified sources within the publication as saying that an endorsement of Harris over Trump had been written but not published. \n\nThose sources told the Post reporters that Amazon billionaire and Washington Post owner Jeff Bezos made the decision.\n\nThe Post’s publisher, Will Lewis, wrote in a column that the decision was actually a return to a tradition the paper had years ago of not endorsing candidates.\n\nHe said it reflected the paper’s faith in ‘our readers’ ability to make up their own minds.’\n\n‘We recognize that this will be read in a range of ways, including as a tacit endorsement of one candidate, or as a condemnation of another, or as an abdication of responsibility. That is inevitable,’ Lewis wrote. \n\n‘We don’t see it that way. We see it as consistent with the values the Post has always stood for and what we hope for in a leader: character and courage in service to the American ethic, veneration for the rule of law, and respect for human freedom in all its aspects.’\n\nThe Post said the decision had ‘roiled’ many on the opinion staff, which operates independently from the Post’s newsroom staff – what is known commonly in the industry as a ‘church-state separation’ between those who report the news and those who write opinion.\n\nSeveral other longtime columnists have resigned in disgust at the decision to pull any endorsement. \n\nEx-editor at large and longtime columnist Robert Kagan, a conservative Trump critic, resigned from his position in the editorial board after the decision emerged.\n\nKagan suggested Bezos had set up a deal with Bezos and his space company Blue Origin.\n\nAnother columnist, Michele Norris, walked out the door on Sunday writing on X that the decision not to endorse was a ‘terrible mistake’. \n\n‘The Posts decision to withhold an endorsement that had been written & approved in an election where core democratic principles are at stake was a terrible mistake & an insult to the paper’s own longstanding standard.’\n\nThe response from the Post’s staff has been ‘uniformly outraged,’ according to NPR’s David Folkenflik. \n\nThe Washington Post Guild issued a statement denouncing the move.\n\n‘We are deeply concerned that The Washington Post would make the decision to no longer endorse presidential candidates, especially a mere 11 days ahead of an immensely consequential election,’ it read.\n\nThe two infamous Washington Post reporters who uncovered Watergate also slammed the paper’s decision not to endorse a candidate. \n\nBob Woodward and Carl Bernstein released a joint statement to CNN in which they expressed their disappointment in the Post’s decision. \n\nIt said: ‘We respect the traditional independence of the editorial page, but this decision 11 days out from the 2024 presidential election ignores the Washington Post’s own overwhelming reportorial evidence on the threat Donald Trump poses to democracy.\n\n‘Under Jeff Bezos’s ownership, the Washington Post’s news operation has used its abundant resources to rigorously investigate the danger and damage a second Trump presidency could cause to the future of American democracy.\n\n‘That makes this decision even more surprising and disappointing, especially this late in the electoral process.’\n\nWoodward and Bernstein became legends in the world of journalism after they broke Watergate – a sordid political scandal that involved the Nixon administration and his re-election campaign. \n\nThanks to the pair’s investigative reporting, the true extent of Watergate was uncovered, and Nixon was ultimately forced to resign from office. \n\nWoodward and Bernstein aren’t the only ones who are frustrated with the Post’s decision, though. \n\nMany of the outlet’s liberal readers are now pledging to cancel their subscriptions.\n\nThe paper’s page editor David Shipley had already approved an endorsement of Harris and had reportedly told colleagues that it was being reviewed by the paper’s owner Jeff Bezos, according to NPR. \n\nBut on Friday CEO Will Lewis published an op-ed that the paper is returning to its ‘roots of not endorsing presidential candidates.’\n\nThe paper’s staff learned of the decision from page editor Shipley in a ‘tense’ meeting on Friday, according to NPR. \n\nShipley told staff he owned the decision and it was meant to create ‘independent space’ where the paper does not tell people how to vote. \n\nHowever, The Post itself has reported that it was Bezos who made the decision to not endorse a presidential candidate.\n\n‘The role of an Editorial Board is to do just this: to share opinions on the news impacting our society and culture and endorse candidates to help guide readers… The message from our chief executive, Will Lewis — not from the Editorial Board itself — makes us concerned that management interfered with the work of our members in Editorial\n\n‘According to our own reporters and Guild members, an endorsement for Harris was already drafted, and the decision to not to publish was made by The Post’s owner, Jeff Bezos.\n\n‘We are already seeing cancellations from once loyal readers. This decision undercuts the work of our members at a time when we should be building our readers’ trust, not losing it.’\n\nFormer Post executive editor Martin Baron said: ‘This is cowardice, a moment of darkness that will leave democracy as a casualty. Donald Trump will celebrate this as an invitation to further intimidate The Post’s owner, Jeff Bezos (and other media owners). \n\n‘History will mark a disturbing chapter of spinelessness at an institution famed for courage.’","summary":"The Washington Post&#8217;s humor columnist has penned a column in which she&#8230;","url":"https://internewscast.com/news/us/humor-columnist-from-the-washington-post-subtly-endorses-a-presidential-candidate-after-the-newspaper-declined-to-support-kamala-harris/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-The-Washington-Posts-humor-columnist-sneaks-in-800x430.jpg","video":null,"publish_date":"2024-10-28 01:05:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.099},{"id":261321796,"title":"Melania Trump headlines Donald’s Madison Square Garden rally in rare campaign appearance","text":"Former First Lady Melania Trump took the stage at Madison Square Garden Sunday night, headlining for her husband Donald’s New York City rally in a rare appearance on the campaign trail this cycle. \n\nMelania, wearing a long, zebra print dress, welcomed the crowd to her and Donald’s “hometown” deep into the night’s line-up. She celebrated all of the city’s accomplishments — before introducing the former president to the stage in a warm embrace.\n\n“Our hometown, where architectural symbols of strength, courage and unity, create a canvas for the world’s undisputed capital of industry,” the proud New Yorker said. \n\n“Where titans of finance, fashion and entertainment convene among an iconic range of superior design, structures and artistic accomplishments,” Melania added.\n\nThe former first lady had not spoken publicly on the 2024 campaign trail — and has only rarely been spotted next to her husband, choosing to spend her time with their 18-year-old son Barron in Florida and the Big Apple instead. \n\nShe went to Milwaukee, Wisc., to sit next to her husband at the Republican National Convention days after he was shot in Butler, Pa., but did not make a speech on stage then, choosing to issue a heartfelt statement about the assassination attempt instead.\n\nThe former model moved back to New York shortly before Barron entered college in September and finished high school down in Palm Beach. He’s attending NYU and is commuting to class from the family apartment in Trump Tower.\n\nThe campaign appearances Melania did make were held in private venues and she was paid hundreds of thousands to appear, like at a Log Cabin Republicans event back in the spring. She also recently published her book “Melania” and has been making media appearances to speak about her life and the contents of the memoir, including her views on women and abortion.\n\nShe made her speaking debut at her husband’s MSG rally just over a week before Election Day and talked about New York, where she made her career after moving to the US from Slovenia.\n\nMelania spoke about New York being “unforgiving” and about the “decline in the quality of life” in the city in recent years, while the crowd shouted and applauded her.\n\n“Love you too!” she chimed back at the 20,000-seater arena.\n\n“New York City and America needs their magic back,” she went on, arguing her husband will be the “next commander-in-chief” who will bring greatness back.\n\nMelania Trump finished her speech by introducing the former president to the massive crowd. He walked into the arena to fierce applause and cheers and hugged his wife, kissing her on her cheeks and holding her hand while looking out at the audience\n\n“We are pleased to be joined by my beautiful wife,” Trump said.\n\n“It’s a great book,” he congratulated her on her best-selling novel.\n\nHe revealed Barron is “at home watching,” calling him the “king of the internet,” as he has advised him on key podcast appearances.","summary":"\"We are pleased to be joined by my beautiful wife,\" Trump said.","url":"https://nypost.com/2024/10/27/us-news/melania-trump-headlines-donalds-madison-square-garden-rally-in-rare-campaign-appearance/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/former-first-lady-melania-trump-92544284.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/7p5F5L12-RyIcpnTz.mp4","publish_date":"2024-10-28 00:59:42","author":"Diana Glebova","authors":["Diana Glebova"],"language":"en","category":"politics","source_country":"us","sentiment":0.438},{"id":261321794,"title":"Donald Trump unveils new tax break for family caregivers at Madison Square Garden rally","text":"Former President Donald Trump revealed a new tax break policy aimed at family caregivers at the start of his address to a packed Madison Square Garden Sunday night.\n\n“I’m announcing a new policy today that I will support a tax credit for family caregivers who take care of a parent or a loved one,” the 45th president announced to some 20,000 supporters.\n\nTrump added it’s time to “recognize” these workers after his campaign previously pledged to step up for seniors and the family members who care for them.\n\nPolicy documents released during the Republican National Convention in July mentioned that Trump promises to protect and bolster Medicare while focusing on at-home care for older Americans.\n\nA campaign spokesperson, Karoline Leavitt, told USA Today on Friday that Trump “will take care of our seniors by shifting resources back to at-home senior care, overturning disincentives that lead to care worker shortages, and supporting unpaid family caregivers through tax credits and reduced red tape.”\n\nIt was not immediately clear how much tax incentive Trump was proposing or how the credits would work.\n\nVice President Kamala Harris has also recently touched on providing more support for caregivers that includes expanding Medicare to cover home care, the newspaper reported.\n\nTrump’s latest policy proposal comes after he has campaigned on ending taxes on overtime pay, tips and Social Security if voters return him to the White House.","summary":"Trump said it’s time to “recognize” family caregivers.","url":"https://nypost.com/2024/10/27/us-news/trump-unveils-tax-break-for-family-caregivers-at-msg-rally/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-nbipxytd8-1730075121780.jpg?quality=75&strip=all&1730060741&w=1200","video":"https://cdn.jwplayer.com/videos/QApvGbhp-RyIcpnTz.mp4","publish_date":"2024-10-28 00:58:42","author":"David Propper,Diana Glebova","authors":["David Propper","Diana Glebova"],"language":"en","category":"politics","source_country":"us","sentiment":-0.019},{"id":261322190,"title":"Donald Trump has Europe and China in a panic","text":"The EU is America’s biggest two-way trade partner and would be hit heavily should Trump return to the White House and use executive powers to follow through with his trade threats. China, which has a significantly bigger trade surplus with the US than the EU, would fear the consequences for its already-fragile economy of a new and more intense trade war with the US.\n\nGermany, in particular, would be concerned, given Trump’s fixation with imports of its vehicles and America’s role as its largest market for automotive exports. Where a 10 per cent tariff on EU exports is estimated to slice about a percentage point off the EU’s GDP, the estimate for Germany – Europe’s biggest economy – is closer to 1.5 percentage points.\n\nShould the worst fears of the Europeans be realised – Trump has talked loosely of tariffs of up to 100 per cent or more as part of a thought bubble involving the use of tariff revenues to fund the abolition of all US income taxes – they would also have to contemplate the prospect that, effectively denied access to the US market, China would look to Europe as the dumping ground for its already swollen excess manufacturing capacity.\n\nWhen Trump embarked on his last bout of trade wars in 2018, slapping tariffs on some European and Chinese exports, he provoked a response. China placed its own retaliatory tariffs on some key US exports, notably agricultural products, while the EU targeted iconic US products like Harley-Davidson motorcycles, jeans and bourbon whisky.","summary":"The EU and China are hastily drawing up their plans for retaliation should Trump win next week’s US election and press ahead with his plans to launch a global trade war.","url":"https://www.smh.com.au/business/the-economy/donald-trump-has-europe-and-china-in-a-panic-20241028-p5kls5.html","image":"https://static.ffx.io/images/$zoom_0.1773%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_45/t_crop_custom/q_86%2Cf_auto/4b0a663abf9d751c5dedfaa2ecedc8c236e1ba37","video":null,"publish_date":"2024-10-28 00:56:46","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.329},{"id":261322104,"title":"Donald Trump has Europe and China in a panic","text":"The EU is America’s biggest two-way trade partner and would be hit heavily should Trump return to the White House and use executive powers to follow through with his trade threats. China, which has a significantly bigger trade surplus with the US than the EU, would fear the consequences for its already-fragile economy of a new and more intense trade war with the US.\n\nGermany, in particular, would be concerned, given Trump’s fixation with imports of its vehicles and America’s role as its largest market for automotive exports. Where a 10 per cent tariff on EU exports is estimated to slice about a percentage point off the EU’s GDP, the estimate for Germany – Europe’s biggest economy – is closer to 1.5 percentage points.\n\nShould the worst fears of the Europeans be realised – Trump has talked loosely of tariffs of up to 100 per cent or more as part of a thought bubble involving the use of tariff revenues to fund the abolition of all US income taxes – they would also have to contemplate the prospect that, effectively denied access to the US market, China would look to Europe as the dumping ground for its already swollen excess manufacturing capacity.\n\nWhen Trump embarked on his last bout of trade wars in 2018, slapping tariffs on some European and Chinese exports, he provoked a response. China placed its own retaliatory tariffs on some key US exports, notably agricultural products, while the EU targeted iconic US products like Harley-Davidson motorcycles, jeans and bourbon whisky.","summary":"The EU and China are hastily drawing up their plans for retaliation should Trump win next week’s US election and press ahead with his plans to launch a global trade war.","url":"https://www.theage.com.au/business/the-economy/donald-trump-has-europe-and-china-in-a-panic-20241028-p5kls5.html","image":"https://static.ffx.io/images/$zoom_0.1773%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_45/t_crop_custom/q_86%2Cf_auto/4b0a663abf9d751c5dedfaa2ecedc8c236e1ba37","video":null,"publish_date":"2024-10-28 00:56:46","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.329},{"id":261322012,"title":"Donald Trump has Europe and China in a panic","text":"The EU is America’s biggest two-way trade partner and would be hit heavily should Trump return to the White House and use executive powers to follow through with his trade threats. China, which has a significantly bigger trade surplus with the US than the EU, would fear the consequences for its already-fragile economy of a new and more intense trade war with the US.\n\nGermany, in particular, would be concerned, given Trump’s fixation with imports of its vehicles and America’s role as its largest market for automotive exports. Where a 10 per cent tariff on EU exports is estimated to slice about a percentage point off the EU’s GDP, the estimate for Germany – Europe’s biggest economy – is closer to 1.5 percentage points.\n\nShould the worst fears of the Europeans be realised – Trump has talked loosely of tariffs of up to 100 per cent or more as part of a thought bubble involving the use of tariff revenues to fund the abolition of all US income taxes – they would also have to contemplate the prospect that, effectively denied access to the US market, China would look to Europe as the dumping ground for its already swollen excess manufacturing capacity.\n\nWhen Trump embarked on his last bout of trade wars in 2018, slapping tariffs on some European and Chinese exports, he provoked a response. China placed its own retaliatory tariffs on some key US exports, notably agricultural products, while the EU targeted iconic US products like Harley-Davidson motorcycles, jeans and bourbon whisky.","summary":"The EU and China are hastily drawing up their plans for retaliation should Trump win next week’s US election and press ahead with his plans to launch a global trade war.","url":"https://www.brisbanetimes.com.au/business/the-economy/donald-trump-has-europe-and-china-in-a-panic-20241028-p5kls5.html","image":"https://static.ffx.io/images/$zoom_0.1773%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_45/t_crop_custom/q_86%2Cf_auto/4b0a663abf9d751c5dedfaa2ecedc8c236e1ba37","video":null,"publish_date":"2024-10-28 00:56:46","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.329},{"id":261322046,"title":"Australia Yanks Visa Of Trump-Supporting Extremist Candace Owens","text":"Far-right commentator Candace Owens was barred from entering Australia because of her attacks on Jewish, Muslim and trans people, according to a report Sunday.Immigration Minister Tony Burke said a visa issued to Owens was canceled following demands by politicians and and Jewish groups, Australian newspaper The Age reported.\"From downplaying the impact of the Holocaust with comments about [torturous Nazi physician Josef] Mengele through to claims that Muslims started slavery, Candace Owens has the capacity to incite discord in almost every direction,\" Burke said. \"Australia's national interest is best served when Candace Owens is somewhere else.\"Owens is an outspoken supporter of former President Donald Trump although she complained after the 2022 midterm elections that he wasn't listening to his base about COVID-19 vaccines and she recently called for him to replace his running mate, Sen. JD Vance of Ohio.The cancellation of her visa came as the Australian government has been trying to tamp down pro-Palestinian protests against Israel's war against Hamas in Gaza, The Age said.In September, thousands of anti-war protesters clashed with police outside a military arms convention in Melbourne, the Associated Press reported at the time.Owens, who has claimed that Israel was founded by a \"cult\" and that \"secret Jewish gangs\" operate in Hollywood, was scheduled to visit Australia next month for a speaking tour that was promoted as \"raw and unfiltered commentary on politics, culture and everyday life,\" according to The Age.Tickets ranged in price from about $63 to nearly $1,000 each and Burke had previously suggested he would deny Owens a visa, saying, \"I hope she has a good refunds policy.\"During an August interview with Australian radio station 2GB, Owens reacted to critics of her planned tour by saying, \"It's kind of incredible to think people could be so fearful of just speech and conversation.\"On Sunday, she didn't directly address the cancellation of her visa in social media post that said, \"Christ reigns supreme — over politics and media.\"\"I will never bend the knee to those whom reject Christ. I welcome any and all persecution that may come my way because of this,\" she wrote.","summary":"'Australia's national interest is best served when Candace Owens is somewhere else,' Immigration Minister Tony Burke said.","url":"https://www.ibtimes.com/australia-yanks-visa-trump-supporting-extremist-candace-owens-3748371","image":"https://d.ibtimes.com/en/full/4557129/candace-owens.jpg","video":null,"publish_date":"2024-10-28 00:53:09","author":"Bruce Golding","authors":["Bruce Golding"],"language":"en","category":"politics","source_country":"US","sentiment":0.135},{"id":261321930,"title":"Hulk Hogan dubbed 'joke' as he struggles to rip off t-shirt during Donald Trump rally","text":"WWE icon Hulk Hogan was dubbed a 'joke' by disappointed fans as he struggled to rip his shirt open during Donald Trump's rally in New York.\n\nThe Hulkster is a big supporter of former US President Trump, who is seeking a second term in office against Democrat Kamala Harris. But during an appearance at Trump's latest rally at Madison Square Garden, Hogan made a scene as he struggled to recreate one of his trademark moves.\n\nInstead of ripping open his iconic red and yellow shirt, the 71-year-old Hogan, whose real name is Terry Bollea, struggled with the clothing and spent nearly 20 seconds wrestling with his top.\n\nAs his WWE theme music Real American played over the top, Hogan eventually managed to rip his top open before recreating some of Trump's dance moves on stage.\n\nFans and critics of Hogan alike were quick to mock the former wrestling icon, calling him a 'joke'.\n\nThe Public Enemies Wresting Podcast wrote on X, formerly known as Twitter: \"Bro was fighting for his life to rip that shirt. I sincerely feel bad for anyone who grew up with Hulk Hogan as their GOAT.\"\n\nA fan added: \"This is a joke\" while others said it was \"sad\" seeing Hogan unable to recreate his famous moves.\n\nDuring the rally, Hogan endorsed Trump and took aim at Kamala Harris. When he asked the room \"whatcha gonna do?\", echoing one of his famous catchphrases, he answered with \"vote for Trump\".\n\nHogan later posted a photo with Trump, as the pair took part in an arm wrestle. He wrote: \"Donald J Trump says there’s no substitute for victory\" as fans of the Republican Presidential candidate praised the pair.","summary":"WWE superstar and Donald Trump supporter Hulk Hogan made an appearance at the former US President's rally in New York but fans all said the same thing after the Hulkster struggled to rip his shirt","url":"https://www.dailystar.co.uk/news/us-news/hulk-hogan-dubbed-joke-struggles-33982709","image":"https://i2-prod.mirror.co.uk/incoming/article33982720.ece/ALTERNATES/s1200/0_US-VOTE-POLITICS-TRUMP.jpg","video":null,"publish_date":"2024-10-28 00:46:32","author":"Richard Brown","authors":["Richard Brown"],"language":"en","category":"politics","source_country":"gb","sentiment":0.071},{"id":261321442,"title":"Melania Trump makes a dazzling debut at Madison Square Garden in her first rally appearance to introduce her husband Donald","text":"Entertainment\n\nSupport Our Cause\n\nAfter Leaving Hollywood, Of Course Chris Hemsworth’s Happy Valentine’s Day Post To His Wife Includes A Kangaroo\n\nFebruary 14, 2022\n\nAt least 6 dead after windstorm on Illinois interstate\n\nMay 2, 2023\n\nBest Tips for Navigating the Holidays If You Have High Cholesterol\n\nDecember 13, 2022\n\nWoman in custody for attempted arson after allegedly trying to set MLK Jr.'s Atlanta birth home on fire\n\nDecember 8, 2023\n\nMan from Montpelier admits to raping minor and could receive life in prison\n\nJuly 7, 2024\n\n Order Now - 50% Off + Free Shipping \n\nEntertainment\n\nSupport Our Cause \n\nSearch for:\n\nMelania Trump makes a dazzling debut at Madison Square Garden in her first rally appearance to introduce her husband Donald\n\nConcerns mount as Amy Dowden considers quitting show following dancer’s collapse and hospitalization in front of worried cast members\n\nPublished on 28 October 2024\n\nInternewscast \n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nShare this @internewscast.com\nFacebookXRedditPinterest\n\nYou May Also Like\n\nLive Updates: MAGA Crowd Fills 20,000-Seat Arena at Trump’s Madison Square Garden Rally\n\nInternewscast\nOctober 27, 2024\n\nLatin music sensation Bad Bunny is endorsing Harris for president.\n\nOctober 28, 2024\n\nBruce Willis wears a Dodgers cap and smiles while driving with his bodyguard in LA during his struggle with aphasia and dementia.\n\nOctober 28, 2024\n\nMcDonald’s confirms beef patties not source of E. coli outbreak\n\nOctober 28, 2024\n\nHow to treat hair loss and eczema using leftover Halloween items\n\nOctober 28, 2024\n\nPolice Looking for Suspect Following Discovery of Body with Stolen Identification in Monroe County\n\nOctober 28, 2024\n\nConcerns mount as Amy Dowden considers quitting show following dancer’s collapse and hospitalization in front of worried cast members\n\nStrictly Come Dancing insiders fear Amy Dowden could quit the show after she…\n\nInternewscast\nOctober 28, 2024\n\nFire Investigation Started in Ocala After Intense Rescue\n\nOCALA, Fla. – A late-night house fire in Ocala has prompted an…\n\nInternewscast\nOctober 28, 2024\n\nPutin Promises Retaliation if Ukraine Deploys Long-Range Missiles Against Russia, Army Officials Prepare Various Responses\n\nVLADIMIR PUTIN has vowed to hit back if Ukraine uses long-range missiles…\n\nInternewscast\nOctober 28, 2024\n\nTua Tagovailoa comes back to play despite worries about concussion\n\nMIAMI GARDENS, Fla.— Despite calls to consider retirement, Miami Dolphins quarterback…\n\nInternewscast\nOctober 28, 2024\n\nInternewscast Journal\n\nAdvertise / Guest Post\nBBCGist Health\nTerms and Conditions\nSupport Our Cause\n\nCopyright 2023. All Right Reserverd\n\nGet the Latest Updates and Happening around the Globe. Click to Subcribe","summary":"","url":"https://internewscast.com/celeb/celeb-news/melania-trump-makes-a-dazzling-debut-at-madison-square-garden-in-her-first-rally-appearance-to-introduce-her-husband-donald/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Melania-Trump-stuns-Madison-Square-Garden-with-800x430.jpg","video":null,"publish_date":"2024-10-28 00:45:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.489},{"id":261322044,"title":"Republican Lawmakers In Florida Rush To Condemn Trump Rally Speaker Who Called Puerto Rico 'Island Of Garbage'","text":"Some Republican lawmakers in Florida quickly attacked jokes a speaker made about Puerto Rico at Donald Trump's Madison Square Garden rally in New York City on Sunday evening.Comedian Tony Hinchcliffe was given a slot ahead of President Trump at the event.\"I don't know if you know this but there's literally a floating island of garbage in the middle of the ocean right now. I think it's called Puerto Rico,\" Hinchcliffe told the crowd.\"This joke bombed for a reason. It's not funny and it's not true,\" Sen. Rick Scott said on X. \"Puerto Ricans are amazing people and amazing Americans! I've been to the island many times. It's a beautiful place. Everyone should visit! I will always do whatever I can to help any Puerto Rican in Florida or on the island.\"\"Disgusted by @TonyHinchcliffe's racist comment calling Puerto Rico a 'floating island of garbage.' This rhetoric does not reflect GOP values,\" Rep. María Elvira Salazar said on X. \"Puerto Rico sent 48,000+ soldiers to Vietnam, with over 345 Purple Hearts awarded. This bravery deserves respect. Educate yourself!\"Democratic lawmakers also condemned Hinchcliffe.\"As a Puerto Rican, I am tempted to call Hinchcliffe racist garbage but doing so would be an insult to garbage,\" Rep. Richie Torres, a New York Democrat posted on X.A short time after Hinchcliffe's joke, superstar Puerto Rican recording artist Bad Bunny shared a video on social media of Kamala Harris giving her plans for Puerto Rico and endorsed her.","summary":"Comedian Tony Hinchcliffe was given a slot ahead of President Trump at the event.","url":"https://www.ibtimes.com/tony-hinchcliffe-puerto-rico-pile-garbage-trump-rally-3748384","image":"https://d.ibtimes.com/en/full/4557159/donald-trump-msg-rally.jpg","video":null,"publish_date":"2024-10-28 00:42:03","author":"Luke Funk","authors":["Luke Funk"],"language":"en","category":"politics","source_country":"US","sentiment":-0.101},{"id":261321254,"title":"Donald Trump Announces New Policy as Melania Makes Rare Appearance at MSG","text":"Former President Donald Trump's campaign rally in Madison Square Garden (MSG) on Sunday played out as a greatest hits of allies and campaign promises as the former president prepared the final push ahead of next week's election.Speaking at 7:15 p.m. EDT, Trump went through his usual slate of campaign wishes, such as \"defeating\" inflation and making America \"affordable\" through a raft of tax cuts, including no tax on tips, overtime or social security benefits.Trump announced a new policy plan to provide tax credit for caregivers who attend to a family or loved one, saying such individuals have been \"ignored for far too long.\"The former president has previously pledged to end taxes on everything from tips to Social Security and overtime pay if he's elected again. However, Trump has yet to explain how he would fund those ideas and avoid creating a huge budget shortfall.He also claimed that he was leading in all swing states. According to polling aggregates on election website FiveThirtyEight, Trump and Vice President Kamala Harris are statistically tied in the key battleground states of Wisconsin, Nevada, Pennsylvania and Michigan, while Trump holds a slender lead of 1.4 points in North Carolina, 1.6 points in Georgia and 2 points in Arizona.Trump later repeated debunked claims that the Federal Emergency Managment Agency (FEMA) had run out of money to help Americans who suffered great losses in the recent hurricanes that devasted Southeastern states like North Carolina and Florida.Newsweek contacted Trump's campaign via email on Sunday for comment.The preamble to Trump's appearance featured a litany of guests including the usual appearances of family and supporters such as Elon Musk and Dr. Phil, as well as a rare appearance by former First Lady Melania Trump.Melania's speech touched on the strength of Trump supporters, calling them \"the heartbeat of this great metropolis\" while pointing out about how tough it is to live in the Big Apple.The former First Lady also insisted that crime was on the rise but praised the city for producing leaders who \"changed the world\" before claiming that New York City and America needed \"it's magic back.\"Trump promoted his wife's new book, joking that he was \"nervous\" when she released it but proudly touted that the book had hit the top of The New York Times best seller list.Melania spoke after Musk, who declared that Trump supporters needed to \"sweep\" swing states and even \"states that aren't swing states.\" He spoke briefly, as did most of the other guests who stood at the podium at the heart of the famous arena.Donald Trump Jr. also took the stage to talk about his father \"built\" New York City, having \"changed the skyline\" and \"fixed what bureaucrats couldn't.\" He also claimed that inflation was so bad that in 2023 on the way back from a fishing trip, he paid $48 to buy food from McDonald's with his children, aged 10 and 14.Republican Vice President nominee Sen. JD Vance, spoke earlier in the evening, during which he once again raised doubts as to whether or not Harris worked at McDonald's, as she has discussed numerous times throughout her campaign.","summary":"Trump capped off a laundry list of speakers at Madison Square Garden on Sunday night with a fresh campaign promise and a rare appearance by his wife.","url":"https://www.newsweek.com/donald-trump-announces-policy-melania-rare-appearance-msg-1975676","image":"https://d.newsweek.com/en/full/2505373/donald-trump-melania-msg-rally-nyc.jpg","video":null,"publish_date":"2024-10-28 00:41:41","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.062},{"id":261322050,"title":"Trump Calls For 'Greatest Years' After Puerto Rico Is Ripped As 'Garbage Dump' At Crude Madison Square Garden Rally","text":"Donald Trump promised the \"greatest years of the history of our country\" Sunday night at his much bally-hooed Madison Square Garden rally, but his vision was marred by vile jokes about the \"garbage dump\" of Puerto Rico and gags about a Black voter carving watermelons for Halloween.The event included the surprise appearance of Melania Trump, who introduced — and even kissed — her husband.Before Trump took the stage anti-woke comedian and \"Kill Tony\" podcaster Tony Hinchcliffe bashed Black, Latino and Jewish voters, all important constituents in the race.He set the low bar with a creepy joke about last month's federal sex trafficking indictment of hip-hop icon Sean \"Diddy\" Combs. \"Every day, the Democrat Party looks more like a Diddy party!\" he reportedly said to hoots.Then came the big kicker.\"I don't know if you guys know this, but there's literally a floating island of garbage in the middle of the ocean right now. I think it's called Puerto Rico,\" Hinchcliffe guffawed. The dig was quickly attacked by Harris' campaign, and rapper Bad Bunny, who is from Puerto Rico, endorsed Harris.Hinchcliffe followed up with a gag about a Black voter in the audience \"carving watermelons\" for Halloween.Local radio host Sid Rosenberg profanely blasted Hillary Clinton for suggesting that Trump was \"reenacting\" an infamous 1939 pro-Nazi rally at the Garden.\"What a sick son of a b----! The whole f---ing party [is] a bunch of degenerates,\" he said, likely not recognizing the irony of his insult, given his use of language.David Rem, a childhood friend of Trump's, held up a crucifix and slammed Vice President Kamala Harris as the \"anti-Christ.\"Trump criminal defense lawyer Alina Habba, who represented Trump during the Stormy Daniels hush-money trialat which he was convicted of 34 felonies, walked on stage wearing a spangly sequined jacket with MAGA spelled out in varsity-style letters.\"We're going to be the ones herding sheep out of the Oval Office,\" she crowed.Former Trump lawyer and ex-New York City Mayor Rudy Giuliani — who's facing prosecution on election-interference charges in Arizona and Georgia and has been ordered to turn over his Manhattan condo, car and watch collection to poll workers he defamed — gushed that the Garden \"the most iconic of venues in the United States.\"\"This is where a Republican is not supposed to come, which is why Donald Trump came here,\" said Giuliani, who also spoke in the Garden during the 2004 Republican National Convention.Outside, the Democratic National Committee had arranged to flash messages on the building reading: \"Trump = Cheat\" and \"Trump Praised Hitler.\" Others gathered with Nazi flag mockingly hailing the \"Fourth Reich.\"","summary":"Kamala Harris bashed with vile insults as 'anti-Christ' in profanity-riddled tirades at bally-hooed event","url":"https://www.ibtimes.com/madison-square-garden-trump-rally-marred-racism-vile-insults-3748383","image":"https://d.ibtimes.com/en/full/4557144/trump-madison-square-garden.jpg","video":null,"publish_date":"2024-10-28 00:40:12","author":"Mary Papenfuss","authors":["Mary Papenfuss"],"language":"en","category":"politics","source_country":"US","sentiment":-0.263},{"id":261321056,"title":"Hulk Hogan, Dr. Phil, Elon Musk Speak at Donald Trump’s Insult-Filled Rally at Madison Square Garden","text":"Hulk Hogan, Dr. Phil McGraw, UFC CEO Dana White and Tesla/SpaceX/X chief Elon Musk spoke in support of Donald Trump at a rally hosted by the Republican presidential candidate on Sunday at New York’s Madison Square Garden.\n\n Hogan, returning to the venue where he performed years ago as a professional wrestler, seemed to reprise his character, emerging wearing a giant red, orange and yellow boa and violently waving a large American flag as he posed and danced. He spat on the stage during his speech, flexed his muscles repeatedly and referred to those in the crowd as “Trumpomaniacs” during the event.\n\n Declared Hogan in his characteristic raspy growl: “I don’t see no stinkin’ Nazis in here. I don’t see now stinkin’ domestic terrorists in here. The only thing I see here are a bunch of hard-working men and women that are real Americans, brother.”\n\n He also blamed Democratic president candidate Kamala Harris for inflation and said “she acts like she’s the victim. And then all of a sudden, she flips, she flops, she spins and turns it around, and she acts like she’s going to be the damn here, but we all know Trump is the only man that can fix this country today.”\n\n McGraw also took the stage, arguing that folks who call Trump a bully are wrong because there’s no “imbalance of power” between him and his opponents.\n\n “When there’s not, it’s just called a debate, and he’s just better at it than anyone else,” he said. “It’s called debating, it’s called arguing, even name-calling, but it’s not bullying unless there’s an imbalance of power. Whoever he talks to, they’ve got a microphone, they’ve got on their big-boy pants, they’ve got a stage. He’s just better at it.”\n\n McGraw added that when Trump’s opponents call him “Hitler” or a fascist, that may be “ugly” but it also isn’t bullying.\n\n “The last thing he needs is some celebrity endorsement,” McGraw added. “What the hell do I know? I know I’m no celebrity to begin with, and celebrities don’t know anything about policies or politics,” he added, to applause. “So the only difference between me and them is I’m willing to admit it. So why am I here? I’m here to talk to and stand up for the people who have declared their support for Donald J. Trump, or they get found out, or they want to do it but they’re too intimidated. They get canceled, intimidated, marginalized, excluded, or even fired or boycotted.”\n\n White took the stage to note he’s been friends with Trump for decades. He said anyone who votes for Harris is supporting the “status quo” and also addressed inflation and his support for cracking down on illegal immigration.\n\n Musk came onstage wearing all black attire, including a black “Make America Great Again” hat. “I’m not just MAGA; I’m Dark Gothic MAGA,” Musk said, referring to his outfit. Musk, who has spent tens of millions of dollars to boost his campaign, went on to add that he could cut $2 trillion from the current U.S. budget.\n\n Melania Trump, the former first lady, was a surprise guest at Sunday’s rally, introducing her husband, who took the stage the two hours late. His remarks included a nod to the assassination attempts against him.\n\n “If you become president of the United States, you got a hell of a shot at dying,” he said. “I never knew that when I ran. I never thought about it, but here we are, and I’m OK with it. And I would rather be here than anyplace in the world. It’s called a very dangerous profession. But if we win, our enemies won’t be laughing anymore.”\n\n The lineup also included vice presidential candidate J.D. Vance, House Speaker Mike Johnson, Tucker Carlson, former presidential candidate Robert F. Kennedy Jr., former New York City Mayor Rudy Giuliani and Staten Island activist Scott LoBaido.\n\n At the event, several speakers crudely insulted Harris, who is vying to become the first woman and Black woman to win the presidency.\n\n Stand-up comedian Tony Hinchcliffe made lewd and racist comments about Latinos, Jews and Black people, all key constituencies in the election just nine days away.\n\n “I don’t know if you guys know this, but there’s literally a floating island of garbage in the middle of the ocean right now. I think it’s called Puerto Rico,” said Hinchcliffe, whose joke was immediately criticized by Harris’ campaign as it competes with Trump to win over Puerto Rican communities in Pennsylvania and other swing states.\n\n The closing message that Trump delivered Sunday is that Harris “broke” the country and that Trump “will fix it.” Rallygoers hours beforehand waved signs with the words “Trump will fix it.”\n\n “Hey guys, they’re now scrambling and trying to call us Nazis and fascists,” said Alina Habba, one of Trump’s attorneys, who draped a sparkly “MAGA” jacket over the lectern as she spoke. “And you know what they’re claiming, guys? It’s very scary. They’re claiming we’re going to go after them and try and put them in jail. Well, ain’t that rich?”\n\n Trump has denounced the four criminal indictments brought against him as politically motivated. He has ramped up his denunciations in recent weeks of “enemies from within,” naming domestic political rivals, and suggested he would use the military to go after them. Harris, in turn, has called Trump a “fascist.”\n\n The arena, which some news outlets reported was sold out, was full hours before Trump was scheduled to speak. Outside the arena, the sidewalks were overflowing with Trump supporters in red “Make America Great Again” hats. There was a heavy security presence. Streets were blocked off and access to Penn Station was restricted.\n\n Democratic organization Battleground New York released a statement Sunday night about the rally, calling the speeches “a torrent of unhinged crazy, racism and xenophobia.”\n\n “Whether it was targeting Puerto Rico with obscene hate, continuing to claim the 2020 election was stolen, or trying to lay the groundwork to say the same in 2024, this rally was an obscene display of unvarnished bigotry for millions to see,” the group said. “It’s time to turn the page on this era of politics that’s seen abortion bans, kooky conspiracy theories mainstreamed, and an endless stream of nonsense that does nothing to solve problems for working people.”\n\n The rally is one of a series of detours Trump has made from battleground states, including a recent rally in Coachella, California — best known for the famous music festival named after the town — and one in May on the Jersey Shore. This summer he campaigned in the South Bronx.\n\n To reach them, Trump has spent hours appearing on popular podcasts. And his campaign has worked to create viral moments like his visit last weekend to a McDonald’s restaurant, where he made fries and served supporters through the drive-thru window. Video of the stop posted by his campaign has been viewed more than 40 million times on TikTok alone.\n\n Harris has also traveled to non-battleground states for major events intended to drive a national message. She appeared in Houston on Friday with music superstar Beyoncé to speak about reproductive rights, and will deliver her own closing argument Tuesday from the Ellipse in Washington, where Trump spoke ahead of the Jan. 6, 2021, Capitol riot.\n\n Trump often compares himself to the country’s greatest entertainers. The former reality TV star has long talked about wanting to hold a rally at the venue in interviews and private conversations.\n\n Beyond the national spotlight and the appeal of appearing on one of the world’s most famous stages, Republicans in the state say the rally will also help down-ballot candidates. New York is home to a handful of competitive congressional races that could determine which party controls the House next year.\n\n Trump also used the stop as a major fundraising opportunity as he continues to seriously lag Harris in the money race.\n\n New York has not voted for a Republican for president in 40 years. But that hasn’t stopped Trump from continuing to insist he believes he can win.\n\n Trump routinely uses his hometown as a foil before audiences in other states, painting a dark vision of the city that bears little resemblance to reality. He’s cast it as crime-ridden and overrun by violent, immigrant gangs who have taken over Fifth and Madison avenues and occupied Times Square.\n\n Trump has a complicated history with the place where he built his business empire and that made him a tabloid and reality TV star. Its residents indicted him last year on 34 felony counts of falsifying business records. He was found guilty in that case, and also found liable in civil court for business fraud and sexual abuse.","summary":"Dana White, J.D. Vance, Tucker Carlson and Melania Trump also took the stage at Sunday's event.","url":"https://www.hollywoodreporter.com/news/general-news/hulk-hogan-dr-phil-elon-musk-donald-trump-rally-madison-square-garden-1236046330/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/10/trumpmsg.jpg","video":null,"publish_date":"2024-10-28 00:39:44","author":"Kimberly Nordyke,The Associated Press","authors":["Kimberly Nordyke","The Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.21},{"id":261320870,"title":"Trump gives a shoutout to NYC Mayor Adams, says he’s ‘going to through hard time’","text":"Former President Donald Trump thanked Mayor Adams for making his blockbuster rally at Madison Square Garden possible.\n\n“We want to thank Mayor Adams,” Trump said. “[He] is going through a hard time with these people.”\n\n“Mayor Adams [is] being treated badly,” Trump further contended, noting Adams’ criticism of the migrant crisis. “I predicted he’d be indicted for saying that, and now they’ve indicted him.”\n\nThere is no evidence Adams was indicted for his concerns about the migrant crisis. \n\nThe crowd did not seem very receptive to the overture toward Adams. Virtually no one cheered at the shoutout and some boos were audible.","summary":"\"We want to thank Mayor Adams,\" Trump said. \"[He] is going through a hard time with these people.\"","url":"https://nypost.com/2024/10/27/us-news/trump-gives-a-shoutout-to-nyc-mayor-adams-says-hes-going-to-through-hard-time/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-tytbrey3p-1730075543477.jpg?quality=75&strip=all&1730061172&w=1200","video":"https://cdn.jwplayer.com/videos/vrBY8Qhr-RyIcpnTz.mp4","publish_date":"2024-10-28 00:35:02","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.874},{"id":261321148,"title":"Famous faces and billionaires endorse Trump at NYC rally","text":"UFC President Dana White proudly endorsed Trump at the rally.\n\nIt's not the first time White has been a special guest at a Trump event. \n\nHe introduced the former president at the Republican National Convention in Milwaukee.﻿\n\n\"Donald Trump and I have been friends for 25 years,\" White said in NYC.\n\n\"I've said this before, and I'm going to say it again. He is the most resilient, hardest working human being that I've ever met in my life.\"","summary":"The Republican nominee and former US President was endorsed by a bevy of stars, including Elon Musk, Dr. Phil and Hulk Hogan, before he took to the stage to call for voters to help &quot;begin the greatest years in the history of our country&quot;.﻿","url":"https://www.9news.com.au/world/us-election-2024-donald-trump-madison-square-rally-new-york-city-in-photos/169016c2-4885-4bba-88ed-3fce79c3913b","image":"https://imageresizer.static9.net.au/EWbDH_TrYWoYjDCmjgu0ZKW-vOI=/0x89:3065x1813/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fba9a4b5e-be84-4184-a599-11c81ec1bb6b","video":null,"publish_date":"2024-10-28 00:34:50","author":"9News,April Glover","authors":["9News","April Glover"],"language":"en","category":"politics","source_country":"au","sentiment":-0.077},{"id":261320874,"title":"In the ultimate battle of the sexes in the most visceral of elections, who will prevail?","text":"It is the ultimate battle of the sexes in the most visceral of elections. Who will prevail? The women, especially young women, who are appalled at the cartoonish macho posturing and benighted stances of Donald Trump and his entourage? Or the men, including many young men, union men, Latino and black men, who are drawn to Trump’s swaggering, bullying and insulting, seeing him as the reeling-backward antidote to shrinking male primacy.\n\nDrilling into the primal yearnings of men and women – their priorities, identities, anger and frustration – makes this election even more fraught. When I wrote a book about gender in 2005, I assumed that a couple of decades later, we’d all be living peacefully on the same planet. But no Cassandra, I. The sexual revolution intensified our muddle, leaving women in a tangle of dependence and independence in the 21st century. The more we imitated men, the more we realised how different we were.\n\nProgress zigzags. But it was dispiriting to see the fierce backlash to Geraldine Ferraro, Anita Hill and Hillary Clinton’s co-presidency and candidacy.\n\nIn Kamala Harris’ case, the backlash was evident even before the election. Surveys reflect the same doubts about a woman in the White House that I saw covering Ferraro in 1984. Many men – and many women – still wonder if women are too emotional to deal with world leaders and lead the military.","summary":"Trump is running a hypermasculine campaign that is breathtakingly offensive to women, where Harris public enemy number one. And yet, it appears to be working.","url":"https://www.smh.com.au/world/north-america/in-the-ultimate-battle-of-the-sexes-in-the-most-visceral-of-elections-who-will-prevail-20241027-p5klns.html","image":"https://static.ffx.io/images/$zoom_0.9819%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/003b42fc7c40789b6debb40a997a9aa9f42191fd","video":null,"publish_date":"2024-10-28 00:30:00","author":"Maureen Dowd","authors":["Maureen Dowd"],"language":"en","category":"politics","source_country":"au","sentiment":-0.171},{"id":261320772,"title":"In the ultimate battle of the sexes in the most visceral of elections, who will prevail?","text":"It is the ultimate battle of the sexes in the most visceral of elections. Who will prevail? The women, especially young women, who are appalled at the cartoonish macho posturing and benighted stances of Donald Trump and his entourage? Or the men, including many young men, union men, Latino and black men, who are drawn to Trump’s swaggering, bullying and insulting, seeing him as the reeling-backward antidote to shrinking male primacy.\n\nDrilling into the primal yearnings of men and women – their priorities, identities, anger and frustration – makes this election even more fraught. When I wrote a book about gender in 2005, I assumed that a couple of decades later, we’d all be living peacefully on the same planet. But no Cassandra, I. The sexual revolution intensified our muddle, leaving women in a tangle of dependence and independence in the 21st century. The more we imitated men, the more we realised how different we were.\n\nProgress zigzags. But it was dispiriting to see the fierce backlash to Geraldine Ferraro, Anita Hill and Hillary Clinton’s co-presidency and candidacy.\n\nIn Kamala Harris’ case, the backlash was evident even before the election. Surveys reflect the same doubts about a woman in the White House that I saw covering Ferraro in 1984. Many men – and many women – still wonder if women are too emotional to deal with world leaders and lead the military.","summary":"Trump is running a hypermasculine campaign that is breathtakingly offensive to women, where Harris public enemy number one. And yet, it appears to be working.","url":"https://www.theage.com.au/world/north-america/in-the-ultimate-battle-of-the-sexes-in-the-most-visceral-of-elections-who-will-prevail-20241027-p5klns.html","image":"https://static.ffx.io/images/$zoom_0.9819%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/003b42fc7c40789b6debb40a997a9aa9f42191fd","video":null,"publish_date":"2024-10-28 00:30:00","author":"Maureen Dowd","authors":["Maureen Dowd"],"language":"en","category":"politics","source_country":"au","sentiment":-0.171},{"id":261320660,"title":"In the ultimate battle of the sexes in the most visceral of elections, who will prevail?","text":"It is the ultimate battle of the sexes in the most visceral of elections. Who will prevail? The women, especially young women, who are appalled at the cartoonish macho posturing and benighted stances of Donald Trump and his entourage? Or the men, including many young men, union men, Latino and black men, who are drawn to Trump’s swaggering, bullying and insulting, seeing him as the reeling-backward antidote to shrinking male primacy.\n\nDrilling into the primal yearnings of men and women – their priorities, identities, anger and frustration – makes this election even more fraught. When I wrote a book about gender in 2005, I assumed that a couple of decades later, we’d all be living peacefully on the same planet. But no Cassandra, I. The sexual revolution intensified our muddle, leaving women in a tangle of dependence and independence in the 21st century. The more we imitated men, the more we realised how different we were.\n\nProgress zigzags. But it was dispiriting to see the fierce backlash to Geraldine Ferraro, Anita Hill and Hillary Clinton’s co-presidency and candidacy.\n\nIn Kamala Harris’ case, the backlash was evident even before the election. Surveys reflect the same doubts about a woman in the White House that I saw covering Ferraro in 1984. Many men – and many women – still wonder if women are too emotional to deal with world leaders and lead the military.","summary":"Trump is running a hypermasculine campaign that is breathtakingly offensive to women, where Harris public enemy number one. And yet, it appears to be working.","url":"https://www.brisbanetimes.com.au/world/north-america/in-the-ultimate-battle-of-the-sexes-in-the-most-visceral-of-elections-who-will-prevail-20241027-p5klns.html","image":"https://static.ffx.io/images/$zoom_0.9819%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/003b42fc7c40789b6debb40a997a9aa9f42191fd","video":null,"publish_date":"2024-10-28 00:30:00","author":"Maureen Dowd","authors":["Maureen Dowd"],"language":"en","category":"politics","source_country":"au","sentiment":-0.171},{"id":261320770,"title":"Kamala Harris is confident in her progress and believes she will emerge victorious despite Trump’s event at Madison Square Garden.","text":"Kamala Harris insisted she has the momentum and ‘will win’ the presidential race as rival Donald Trump sold out Madison Square Garden for a massive rally of his faithful.\n\nThe Democratic nominee spent a low-key day in Philadelphia, courting minority and youth voters. She visited an African American church, barbershop and bookstore. And then she stopped by Puerto Rican restaurant.\n\nHarris, who previously portrayed herself as the underdog, shifted to a new tone, saying the presidential contest is hers to win.\n\n‘There’s a lot of hard work ahead of us but make no mistake we will win,’ she told a cheering crowd of 3,000 at a community center.\n\n‘We will win because if you know what you stand for, you know what to fight for.’\n\nPolls show the presidential race is essentially tied, which means each campaign needs to make sure it turns out as many voters as possible on November 5th.\n\nAs Harris rallied voters in the critical battleground state of Pennsylvania, Trump was in New York, a Democratic-strong hold, to speak to a gathering of 20,000 strong MAGA fans.\n\nIn Pennsylvania, Trump leads in the polling average in the state, but only by one point, so it’s within the margin of error.\n\nThe state could decide the presidential election with its 19 electoral votes. In addition to making multiple campain stops, the Harris campaign released a new ad called ‘Philly vs. Trump.’\n\nThe ad reminds voters about the negative comments the former president has made about the city. The ad will run during Sunday’s football game between the Philadelphia Eagles and the Cincinnati Bengals, which means it’ll get good coverage.\n\nBut Harris focused her time in the city, a majority Democratic stronghold, on appealing to minority voters and Generation Z, reminding them to use their voice on Election Day.\n\n‘Philadelphia is a very important part of our path to victory, and it is the reason I’m spending time here,’ Harris told reporters. ‘But I’m feeling very optimistic about the enthusiasm that’s here and the commitment from folks of every background.’ \n\nAt her rally, she reminded young voters the choice is theirs on Election Day.\n\n‘We have the ability to turn the page on that same old tired payback,’ Harris said. ‘We are ready to chart a new way forward.’\n\n‘We are a new generation of leadership that is optimistic and excited,’ she noted.\n\n‘The great thing about living in a democracy – as long as we keep it – is that we the people have the power to choose our direction,’ Harris said.\n\nHarris’ 15-minute speech was interrupted twice – by a medical emergency and a protester.\n\nShortly after she started talking, someone toward the back fainted. Harris paused to let medical professionals get to the person.\n\n‘That’s what we do. We look out for each other,’ she said.\n\nA few minutes later she was interrupted by a Gaza protester. The crowd responded in chats of: ‘We aren’t going back!’\n\nHarris said she is committed to end this war and bring the hostages home – then she got back to her speech.\n\nThe vice president didn’t focus her fire on Trump during her remarks. She left that to her surrogates.\n\nOn Sunday, her running mate Tim Walz compared Trump’s Madison Square Garden rally to the Nazi party event at the same venue in 1939.\n\nSpeaking on the campaign trail in Nevada, Walz said: ‘Donald Trump’s got this big rally going at Madison Square Garden. There’s a direct parallel to a big rally that happened in the 1930s at Madison Square Garden’ \n\nAnd Doug Emhoff, Harris’ husband, said Trump is ‘falling apart.’\n\n‘The other side is just trying to put all this noise and gaslighting and misinformation,’ the second gentleman said during a campaign stop in Atlanta.\n\nHe then turned his fire on Trump: ‘Just look at him. He’s falling apart. …. Just listen to what he is saying.’\n\nEmhoff also blamed Trump for the ‘chilling of free speech’ as large news outlets – including the Washington Post and the Los Angeles Times – decide not to endorse a presidential candidate.\n\n‘People in the media [are] afraid to do something because there is a chilling effect,’ he said. ‘We cannot live like that.’\n\nHarris, meanwhile, had a packed day of events in Philadelphia, talking nonstop with voters, giving hugs, and making small talk. \n\nHer goal was to boost voter turnout nine days ahead of the election. \n\nAt the Philly Cuts in West Philly, Harris sat down in a chair that has been a good luck touchstone for political candidates. \n\nThe barbers told her that every candidate running for elected office who has sat in the chair has won their election.\n\nHarris also visited a bookstore with books about Africa, civil rights icons, and slavery on the shelves.\n\nShe asked for book recommendations for an 8-year-old and a 6-year-old — the ages of her grandnieces.\n\n‘Victory runs through Philly,’ Harris reminded people at the stop. ‘It runs through Pennsylvania.’\n\nShe also told one person there: ‘I plan on putting on some pounds after this is over. They’re working me to the bone.’\n\nAnd at her stop at in working class Puerto Rican neighborhood, at a restaurant called Freddy and Tony’s Restaurant, she stayed on message.\n\n‘Nine days, and hard work is good work as we know — and we are winning,’ she said.","summary":"Kamala Harris insisted she has the momentum and &#8216;will win&#8217; the presidential&#8230;","url":"https://internewscast.com/news/us/kamala-harris-is-confident-in-her-progress-and-believes-she-will-emerge-victorious-despite-trumps-event-at-madison-square-garden/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Kamala-Harris-insists-she-has-the-momentum-800x430.jpg","video":null,"publish_date":"2024-10-28 00:29:12","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.08},{"id":261321508,"title":"\"Jackwad\": Walz responds to racist joke about Puerto Rico at Trump MSG rally","text":"Minnesota Governor Tim Walz responded to controversial comments about Puerto Rico from a comedian and podcast host who opened Donald Trump's rally at Madison Square Garden, calling the entertainer a \"jackwad.\"\n\nComic Tony Hinchcliffe called the U.S. territory a \"floating island of garbage\" and made racist jokes about Latin Americans in the set ahead of Trump's appearance.\n\nThe vice presidential candidate's response came on a Twitch stream with Democratic Rep. Alexandria Ocasio-Cortez on Sunday. Walz also took the time to criticize Trump's handling of Hurricane Maria, which devastated the island in 2017.\n\n“Does anybody remember how he responded to Maria in Puerto Rico? It was absolutely horrific, down there insulting people,\" Walz said. \"Look, I know that the folks who are on here today understand this — people in Puerto Rico are citizens. They pay taxes and they serve in the military at almost a higher rate than anybody else.”\n\nHinchcliffe has already responded to the backlash to his set, saying that Walz and AOC \"have no sense of humor.\"\n\n\"Wild that a vice presidential candidate would take time out of his 'busy schedule' to analyze a joke taken out of context to make it seem racist,\" he wrote on X. \"I love Puerto Rico and vacation there.\"","summary":"The vice presidential candidate dressed down comic Tony Hinchcliffe on a Twitch stream","url":"https://www.salon.com/2024/10/27/jackwad-walz-responds-to-joke-about-puerto-rico-at-msg-rally/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/08/tim_walz_kamala_harris_2166132919.jpg ?>","video":null,"publish_date":"2024-10-28 00:25:24","author":"Alex Galbraith","authors":["Alex Galbraith"],"language":"en","category":"politics","source_country":"US","sentiment":-0.658},{"id":261320170,"title":"DNC projects message tying Trump to Hitler on Madison Square Garden during rally","text":"The Democratic National Committee is projecting digital messages on Madison Square Garden’s exterior during former President Donald Trump’s campaign rally on Sunday about recent reports that he once praised Adolf Hitler and his generals and that cast him as unhinged.\n\n“Trump praised Hitler,” one of five planned projections from the DNC says, referring to Trump’s longest-serving chief-of-staff, four-star Marine Corps. Gen. John Kelly, telling The Atlantic this week that Trump had admirable things to say about the German dictator.\n\nTrump says he “never said it,” and campaign aides have denied Kelly’s accounts.\n\nSunday marks the first time the DNC is projecting counterprogramming onto a building while Trump will be inside it, but it’s far from the first time Democrats have deployed the technique. The DNC put projections on Trump Tower in New York City on the night of the vice presidential debate and on Chicago’s Trump International Hotel and Tower during the Democratic National Convention in August.\n\nThis time, the stunt comes as some Democrats make comparisons to a 1939 rally supporting Hitler and the Nazi party at a previous reiteration of Madison Square Garden ahead of World War II. Billed as a “Pro American Rally,” the February 1939 event was organized by German American Bund, an pro-Hitler organization, attended by more than 20,000 people and saw an even larger number of counter-protesters outside. \n\nDemocratic vice presidential candidate Gov. Tim Walz on Sunday also compared Trump’s rally there to the 1939 rally. \n\n“Donald Trump’s got this big rally going at Madison Square Garden,” Walz said, speaking to voters in Nevada. “There’s a direct parallel to a big rally that happened in the mid 1930s at Madison Square Garden. And don’t think that he doesn’t know for one second exactly what they’re doing there.”\n\nWalz and Vice President Kamala Harris have recently increased their criticisms of the former president as they push their final message to voters in the final stretch ahead of the election. In a CNN town hall, Harris agreed that Trump was a fascist and Walz has called comments from the former president “so damn racist.”\n\nIn an interview with CNN on Thursday, Hillary Clinton said Trump’s choice of venue for his closing message was no coincidence and that he was “actually reenacting the Madison Square Garden rally in 1939,” following similar comparisons from others including New York state Sen. Brad Hoylman-Sigal.\n\nTrump campaign national press secretary Karoline Leavitt fired back to say Clinton herself has held events there while her husband, former President Bill Clinton, accepted the Democratic nomination there in 1992.\n\n“Putting aside her hypocrisy, Hillary’s rhetoric about half of the country is disgusting,” Leavitt said in a statement.\n\nSunday’s rally comes just days after Kelly also told The New York Times Trump has little appreciation of history, saying, “I think he’s lacking in that.”\n\nTrump also personally rebuffed the criticism at a rally later on Friday in Michigan, distancing himself and his base from the comparison. \n\n“I guess in the 1930s or something, some guy who was inclined toward the Nazis had something, and she said it’s just like the 1930s. No, no, this is called Make America Great Again,” Trump told a crowd in Traverse City.\n\nDNC Chair Jaime Harrison didn’t go as far as to make the same comparison as Clinton but told CBS News in a statement he sees Trump as having “grown increasingly unhinged in the final weeks heading into Election Day; so much so that those who know Trump best are warning voters that he is dangerously unfit to lead.”\n\nTo that end, the DNC is also projecting messages onto Madison Square Garden questioning Trump’s competency including, “Trump = Unhinged” and “Trump = Unfit.”\n\nDavid Schwartz, a trial attorney in New York City, has previously told CBS News it’s illegal to project digital signs in New York City for longer than 60 seconds without a permit. A spokesperson with the DNC, however, said they are aware of the law and complying with it by rotating through individual messages.\n\n contributed to this report.","summary":"Campaign 2024 comes to NYC with Trump rally at MSG Campaign 2024 comes to NYC with Trump rally at MSG 02:18 The Democratic National Committee is projecting digital messages on Madison Square Garden&#8217;s exterior during former President Donald Trump&#8217;s campaign rally on Sunday about recent reports that he once praised Adolf Hitler and his generals &#8230;\n\n\nThe post DNC projects message tying Trump to Hitler on Madison Square Garden during rally appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/dnc-projects-message-tying-trump-to-hitler-on-madison-square-garden-during-rally/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/27/113f3b1b-50fc-4a44-bfe6-0ac5c63e0c8b/thumbnail/1200x630/215d500e2ffe3fb7a33b9a1df8b43d22/original-0cda769a-6b6f-4f98-9905-ed717cf164f3.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":null,"publish_date":"2024-10-28 00:15:06","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","source_country":"us","sentiment":-0.033},{"id":261320354,"title":"Melania Trump stuns Madison Square Garden with her first rally appearance ever to introduce husband Donald","text":"Elon Musk announced the former first lady, who was not on the list of speakers. Appearance came as Trump and Harris are running even in the polls. Follow DailyMail.com's presidential election live blog for all the latest news and updates","summary":"Melania Trump made her first appearance on the campaign trail with a surprise speech at husband Donald Trump's rally at Madison Square Garden.","url":"https://www.dailymail.co.uk/news/article-14008881/Melania-Trump-donald-madison-square-garden.html","image":"https://i.dailymail.co.uk/1s/2024/10/27/23/91353123-0-image-m-16_1730071743305.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/10/28/2718168244993374586/1024x576_MP4_2718168244993374586.mp4","publish_date":"2024-10-28 00:13:18","author":"Editor,Emily Goodin","authors":["Editor","Emily Goodin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.178},{"id":261319980,"title":"Biden calls out Musk over report that the Tesla CEO once worked in the US illegally","text":"NEW YORK — President Joe Biden slammed Elon Musk for hypocrisy on immigration after a published report that the Tesla CEO once worked illegally in the United States.\n\nThe South Africa-born Musk denies the allegation.\n\n“That wealthiest man in the world turned out to be an illegal worker here. No, I’m serious. He was supposed to be in school when he came on a student visa. He wasn’t in school. He was violating the law. And he’s talking about all these illegals coming our way?” Biden said while campaigning on Saturday in Pittsburgh at a union hall.\n\nThe Washington Post reported that Musk worked illegally in the country while on a student visa.\n\nThe newspaper, citing company documents, former business associates and court documents, said Musk arrived in Palo Alto, California in 1995 for a graduate program at Stanford University “but never enrolled in courses, working instead on his startup.”\n\nMusk wrote on X in reply to a video post of Biden’s comments: “I was in fact allowed to work in the US.” Musk added, “The Biden puppet is lying.”\n\nInvestors in Musk’s company, Zip2, were concerned about the possibility of their founder being deported, according to the report, and gave him a deadline for obtaining a work visa.\n\nThe newspaper also cited a 2005 email from Musk to his Tesla co-founders acknowledging that he did not have authorization to be in the US when he started Zip2.\n\nAccording to the account, that email was submitted as evidence in a now-closed California defamation lawsuit and said that Musk had applied to Stanford so he could stay in the country legally.\n\nMusk is today the world’s richest man. He has committed more than $70 million to help Republican presidential nominee Donald Trump and other GOP candidates win on Nov. 5, and is one of the party’s biggest donors this campaign season.\n\nHe has been headlining events in the White House race’s final stretch, often echoing Trump’s dark rhetoric against immigration.\n\nTrump has pledged to give Musk a role in his administration if he wins next month.\n\nThere was no immediate response to messages left with X and Tesla seeking Musk’s comment.","summary":"“That wealthiest man in the world turned out to be an illegal worker here. No, I’m serious. He was supposed to be in school when he came on a student visa. He wasn’t in school,\" Biden claimed.","url":"https://nypost.com/2024/10/27/us-news/biden-calls-out-musk-over-report-that-the-tesla-ceo-once-worked-in-the-us-illegally/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-o940ec4uj-1730072372366.jpg?quality=75&strip=all&1730058024&w=1200","video":"https://cdn.jwplayer.com/videos/vrBY8Qhr-RyIcpnTz.mp4","publish_date":"2024-10-28 00:12:41","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.256},{"id":261319868,"title":"Latin music sensation Bad Bunny is endorsing Harris for president.","text":"Bad Bunny is throwing his support behind Vice President Kamala Harris by sharing a video of the Democratic presidential nominee to his more than 45 million followers on Instagram.\n\nBad Bunny, whose official name is Benito Antonio Martínez Ocasio, is one of the most famous artists of the moment. His backing could be a boost for the Harris campaign as it tries to bolster its support with Latino voters, among whom Trump has been working to gain ground.\n\nThe 30-year-old Puerto Rican reggaeton artist, who has popular songs such as “Dakiti” and “Titi Me Preguntó,” has won three Grammy Awards. He was the most streamed artist on Spotify in 2020, 2021 and 2022, and was only surpassed by Taylor Swift in 2023. He was named Artist of the Year by Apple Music in 2022.\n\nThe video shared by Bad Bunny on Instagram shows Harris saying “there’s so much at stake in this election for Puerto Rican voters and for Puerto Rico.” A representative of the artist confirmed that Bad Bunny is supporting Harris.\n\nThe artist then shared several times another part of the clip where Harris says, “I will never forget what Donald Trump did and what he did not do when Puerto Rico needed a caring and a competent leader,” she says.\n\nHis endorsement came shortly after a comedian who spoke at the opening of Trump’s rally at Madison Square Garden on Sunday called Puerto Rico a “floating island of garbage.” The remarks by comedian Tony Hinchcliffe were immediately criticized by Harris’ campaign and were also criticized by Puerto Rican star Ricky Martin, who was among the first to support Harris as she launched her presidential bid in July.\n\n“That’s what they think of us,” Ricky Martin shared on Instagram, and encouraged followers to vote for Harris.\n\nThe Puerto Rican vote is sizable in Pennsylvania, which is arguably the hardest fought of the swing states in the 2024 election. Other Puerto Rican singers such as Jennifer Lopez and Marc Anthony had already expressed support for Harris. Trump has also attracted support from other popular stars from the island such as Anuel AA and Nicky Jam.\n\nBad Bunny has been vocal about criticizing Puerto Rico’s electric system, which was razed by Hurricane Maria. In a 2022 music video for his song “El Apagon,” the artist called out the company Luma Energy, which handles transmission and distribution, for the constant power outages that plague the island.\n\nOne of his most recent songs, “Una Velita,” is also a protest against the government response following Hurricane Maria in Puerto Rico in 2017.\n\nA year after the storm, public health experts estimated that nearly 3,000 perished because of the effects of Hurricane Maria. But Trump, whose efforts to help the island territory recover have been persistently criticized, repeatedly questioned that number saying it rose “like magic.”\n\nHis visit to the island after the hurricane elicited controversy such as when he tossed paper towels. His administration released $13 billion in assistance years later, just weeks before the 2020 presidential election. And a federal government watchdog found that officials hampered an investigation into delays in aid delivery.\n\nBad Bunny also shared a part of the clip showing Harris saying that Trump “abandoned the island, tried to block aid after back-to-back devastating hurricanes and offered nothing more than paper towels and insults.”\n\nHarris visited a Puerto Rican restaurant in North Philadelphia earlier on Sunday and released her policy related to the island saying she wants to create a task force to attract investment to fix the electrical grid. And Trump is headed on Tuesday to Allentown, Pennsylvania, where more than half of its population is Hispanic and a majority of them from Puerto Rico.\n\nIn 2020, Bad Bunny allowed the Biden campaign to use one of his hits “Pero Ya No” in a TV ad.","summary":"Bad Bunny is throwing his support behind Vice President Kamala Harris by&#8230;","url":"https://internewscast.com/local-news/latin-music-sensation-bad-bunny-is-endorsing-harris-for-president/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Latin-superstar-Bad-Bunny-is-supporting-Harris-700x430.jpg","video":null,"publish_date":"2024-10-28 00:11:11","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.079},{"id":261320218,"title":"Donald Trump's rally draws apparent sellout crowd to MSG","text":"NEW YORK -- Thousands of people, including from other parts of the country, descended on Madison Square Garden in New York City on Sunday afternoon for former President Donald Trump's campaign rally.The NYPD said it had drones over the area, robots, and a helicopter, as well as antiterrorism units outside monitoring the situation to keep everyone safe.With just nine days to go until Election Day, a new CBS News poll has the two presidential candidates neck and neck, with Vice President Kamala Harris at 50% and Trump at 49% among likely voters. In battleground states, both are polling at 50%.The focus of the respective campaigns has been on issues, including immigration, the war between Israel and Hamas, and crime.Read more: Kamala Harris widens lead over Donald Trump in New York. Here's what pundits say the new poll could mean for the House race.JD Vance, Elon Musk, Melania Trump spokeSunday's rally marked a detour from the battleground states for Trump. Among those who took the stage before the former president spoke were former New York City Mayor Rudy Giuliani and Staten Island activist Scott LoBaido.\"President Trump grew up here. He's a New Yorker,\" Giuliani said. \"That's why people get a little bit annoyed at him. He speaks his mind.\"When Trump entered the arena there was applause, a standing ovation, and everyone started chanting. Every seat appeared to be filled from the floor to the highest sections. In addition to Trump, vice presidential nominee JD Vance, billionaire supporter Elon Musk and Trump's wife, Melania, all spoke. Trump supporters revel in former president's appearanceThe former president is from Queens. CBS News New York met supporters from his home borough, but also a couple from Chicago.\"I just love him, and he's the best. I want the economy to get better,\" a woman said.\"We have an influx of migrants, illegal migrants. Our economy is ... just go to the grocery store,\" a man from Dutchess County added.Nassau County Executive Bruce Blakeman was one of several Long Island representatives who came to the Garden in the Trump motorcade.\"Just look around. This is incredible. We're in New York City in the middle of, you know, this is liberal ... one of the most liberal cities in the country, and it's amazing,\" New York City Councilwoman Inna Vernikov said.Vulgar language during the introductions Before Trump took the stage, there was some vulgar language in the speeches. Comedian Tony Hinchcliffe, who goes by Kill Tony, referred made a crude joke referring to Puerto Rico as a \"floating island of garbage\" and made other offensive jokes about Black people and Latinos. Sid Rosenberg, a radio host that Trump often talks to, called Hillary Clinton a \"sick son of a b***,\" and referred to migrants as \"f---ing illegals.\" David Rem, a childhood friend of Trump's, called Harris \"the antichrist.\" Grant Cardone, a business owner, said Harris \"and her pimp handlers will destroy the country.\"","summary":"Thousands descended on Madison Square Garden on Sunday for former President Donald Trump's campaign rally.","url":"https://www.cbsnews.com/news/donald-trump-madison-square-garden-rally/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/27/f8e7012e-2b3a-4ff3-8c6d-a338388ed874/thumbnail/1200x630/6f33011b26d8ce7eb5c93ab35b46e539/trump-msg-rally.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":null,"publish_date":"2024-10-28 00:10:41","author":"Lisa Rozner","authors":["Lisa Rozner"],"language":"en","category":"politics","source_country":"US","sentiment":0.236},{"id":261319706,"title":"What would happen to US-Philippine ties under a Harris or Trump presidency?","text":"With the US presidential election just days away, the Philippines watches with bated breath, aware that the outcome could redefine the two countries’ defence relationship. Will the winner be Donald Trump, whose past tenure in the White House suggests a transactional approach, or Kamala Harris, who promises continuity and a renewed commitment to alliance?\nBoth candidates have largely kept their positions on the South China Sea under wraps throughout the campaigns, even as the US and the Philippines have deepened their long-standing security alliance. This year, Washington has pledged an unprecedented US$500 million in military aid, a significant boost aimed at fortifying Manila’s military modernisation amid rising tensions with China in the disputed waters.\nIn past engagements, both candidates have identified China as America’s foremost competitor. Harris declared at the Democratic Convention that “America, not China” will prevail in the competition for the 21st century, promising the US would not “abdicate its international leadership”. Trump, meanwhile, has consistently advocated for imposing stiff tariffs on Beijing to protect the US economy.\nAnalysts predict the candidates will adopt differing strategies regarding Washington’s ties with the Philippines, based on their views of China.\n\n‘Familial’ vs transactional\nA Harris administration may continue the supportive policies of President Joe Biden, while a Trump presidency could shift gears, observers say.\nChester Cabalza, president of the Manila-based International Development and Security Cooperation think tank, believes a Harris victory would secure continued support for the Philippine government.\n“Harris visited Palawan as US vice-president, and she knows the real picture of security dilemma in the West Philippine Sea,” Cabalza said, referring to the Philippines’ term for its exclusive economic zone in the South China Sea.\nCabalza anticipates that Harris would maintain a “familial” commitment between the US and the Philippines, emphasising Biden’s “ironclad commitment to Manila” by expanding the sites available for US forces under the Enhanced Defence Cooperation Agreement (EDCA).\nThis expansion “raised optimism of heightened minilateral cooperation from other like-minded nations as the two allied countries changed the contours of regional security in the Indo-Pacific while China feels security anxiety”, he said.\nHarris, with her Jamaican and Indian heritage, could leverage her background to strengthen US engagement in the Indo-Pacific, Cabalza added.\n“I think she will assert America’s strong presence in this most dynamic region,” he said. “After Asia, Africa is poised as the next darling of investments. Kamala, given her heritage, should usher the US interests in these vast and ancient yet postmodern continents of the world.”\n\nVincent Wei-cheng Wang, a political-science professor at Adelphi University and dean of its College of Arts and Sciences, highlighted the Biden administration’s efforts to revitalise bilateral ties, especially in security, following former President Rodrigo Duterte’s pivot towards Beijing.\nWang said that Duterte’s policies emboldened China’s assertiveness in the South China Sea, a challenge that has become more pronounced under Ferdinand Marcos Jnr, who has shifted Manila’s stance back toward the US.\n“Base access, joint exercise, and capacity building are all real gains. It’s a good policy, and Harris is wise not to upend it,” Wang said.\nHowever, a Trump presidency could complicate US-Philippine relations, particularly beyond security. Matteo Piasentini, a geopolitical analyst for Geopolitica.info and a lecturer at the University of the Philippines’ political science department, warned that Trump’s protectionist stance might hinder economic cooperation.\n“The Philippines is also demanding investments and favourable market access conditions. Given Trump’s protectionism, I don’t see room for progress on that front,” he said.\nPiasentini added that while a shift in the Philippines’ alignment with the US may not occur immediately, it could change if Manila grows frustrated with slow economic engagement.\n“Should China resume its ‘charm offensive’, that may have the potential to impact Philippine-US ties, he said, noting that Trump’s focus on trade could lead him to overlook crucial geopolitical issues in the region.\n\nTrump primarily looks at US-China competition through the lens of trade, analysts say – a perspective that could cause him to gloss over geopolitical issues in the region.\nThis “pragmatic perspective of regional security in the Indo-Pacific will overshadow his appreciation of the Taiwan Strait and the West Philippine Sea”, Cabalza said, warning that Trump’s transactional view of the South China Sea might escalate into a “trade war 2.0”, as he would frame Washington’s Indo-Pacific strategy as a competition of markets with Beijing.\nThis could mean reduced funding and support from the US, observers say.\nTrump would likely openly call for the Philippines to shoulder more defence costs, similar to his approach towards other allies, Wang said.\n“Trump might contend that the Philippines’ self-defence matters more to the Philippines than to the US, so the Philippines should pay more,” he said. “He may demand the Philippines to spend a certain percentage of its gross domestic product on defence to show proof.”\nCabalza cautioned that Trump’s “America First” policy might leave strategic developments in the EDCA sites in limbo. Compounding these concerns are ongoing global conflicts, such as Russia-Ukraine and Israel-Gaza, which could lead Trump to compartmentalise his foreign policy.\n\nThe Philippines should “focus on its own strategic interests on widening its economic reforms and increased self-reliance defence postures, while allies of the US see the Philippines as more attractive for robust investments”, Cabalza advised.\nMeanwhile, Piasentini said the US would keep engaging with the Indo-Pacific region, even under Trump, with the Philippines remaining strategic to its interests.\n“The Trump administration may opt for arming Taiwan and Taiwan only, while a Democrat administration will keep on working with allies and partners in the region in multi- and mini-lateral forms of cooperation,” he said.\n“Either way, I think that the Philippines, due to its geographical proximity or Taiwan, will be the object of possible US strategies in case of a contingency in the strait. So I don’t really see Manila being irrelevant.”","summary":"The contrasting visions of Harris and Trump could either fortify the US-Philippine alliance or leave Manila vulnerable to regional pressures.","url":"https://www.scmp.com/week-asia/politics/article/3284082/what-would-happen-us-philippine-ties-under-harris-or-trump-presidency","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/10/28/bb7538bf-3635-4ed1-b347-f6bf683892c1_0f117223.jpg","video":null,"publish_date":"2024-10-28 00:00:11","author":"Sam Beltran","authors":["Sam Beltran"],"language":"en","category":"politics","source_country":"cn","sentiment":0.398},{"id":261319578,"title":"Speakers at Trump's NYC event crudely denounce Harris and Democrats","text":"Donald Trump took the stage on Sunday night (Monday morning AEST) at New York's Madison Square Garden after several of his allies used crude and extreme rhetoric toward Vice President Kamala Harris and other critics of the former president.\n\nThe Republican nominee began what his campaign said would be his closing argument with the election nine days away by asking the same questions he's asked at the start of every recent rally: \"Are you better off now than you were four years ago?\" \n\nThe crowd responded with a resounding \"No!\"\n\nREAD MORE: How the US presidential vote works: Everything you need to know about the election on November 4\n\n\"This election is a choice between whether we'll have four more years of gross incompetence and failure, or whether we'll begin the greatest years in the history of our country,\" he said after being introduced by his wife, Melania Trump, whose rare surprise appearance comes after she has been largely absent on the campaign trail.\n\nThe event was marked by a series of racist and sexist comments from several speakers.\n\nTrump's childhood friend David Rem referred to the Democratic presidential candidate, who is vying to become the first woman to be elected president, as \"the Antichrist\" and \"the devil.\" \n\nBusinessman Grant Cardone told the crowd that Harris \"and her pimp handlers will destroy our country.\"\n\nREAD MORE: Australia's 3G network is shutting down today. This is what you need to know\n\nThe opening of the rally was a hodgepodge of Trumpism, with an extended clip played from the 1970 film Patton, a painting of the American flag with Trump in front of it hugging the Empire State Building as God Bless America blared from the speakers, and a stand-up routine from comedian Tony Hinchcliffe that was full of lewd jokes, often invoking racist stereotypes of Latinos, Jews and Black people.\n\n\"I don't know if you guys know this, but there's literally a floating island of garbage in the middle of the ocean right now. I think it's called Puerto Rico,\" said Hinchcliffe, whose comment was immediately flagged by Harris' campaign as it competes with Trump to win over Puerto Rican communities in Pennsylvania and other swing states.\n\nShortly after Hinchcliffe's appearance, music superstar Bad Bunny, who is from Puerto Rico, endorsed Harris.\n\nREAD MORE: Police offer $1 million reward to solve 2015 case of woman killed while talking on phone\n\nWith just over a week to go before Election Day, the former president was to take the stage Sunday at one of the country's most well-known venues, hosting a hometown rally to deliver his campaign's closing message against Harris.\n\nThe program leading up to his appearance was filled with conservative officials, longtime allies and media figures popular with conservatives like Dr Phil McGraw and former Fox News host Tucker Carlson.\n\nMuch of the program resembled a somewhat surreal version of July's Republican National Convention, which convened less than two days after Trump survived an assassination attempt in Butler, Pennsylvania.\n\nREAD MORE: Missing photographer found with suspected snake bite after a week missing\n\nWrestling icon Hulk Hogan, who appeared at the RNC, strutted again on Sunday wearing a feather boa and tearing off his shirt to reveal a Trump campaign tee underneath.\n\nHe flexed his muscles repeatedly and gestured to the crowd after telling the audience: \"Trump is the only man that can fix this country today.\"\n\nWhile some Democrats and pundits have questioned Trump's decision to hold what they dismiss as a vanity event in his hometown, the rally guarantees Trump what he most craves: the spotlight, wall-to-wall coverage and a national audience.\n\nThe closing message he will deliver on Sunday, according to his campaign, is that Harris \"broke\" the country and that Trump \"will fix it.\" \n\nRallygoers hours beforehand waved signs with the words \"Trump will fix it.\"\n\nSeveral speakers ripped Hillary Clinton, the Democrat defeated by Trump eight years ago, for saying Trump on Sunday would be \"re-enacting\" a pro-Nazi event at the Garden in February 1939. \n\nREAD MORE: Israeli strikes on northern Gaza kill at least 22, while truck ramming near Tel Aviv kills one\n\nOne critic, radio host Sid Rosenberg, used a profanity to denounce the former secretary of state.\n\n\"Hey guys, they're now scrambling and trying to call us Nazis and fascists,\" said Alina Habba, one of Trump's attorneys, who draped a sparkly \"MAGA\" jacket over the lectern as she spoke. \n\n\"And you know what they're claiming, guys? It's very scary. They're claiming we're going to go after them and try and put them in jail. Well, ain't that rich?\"\n\nDeclared Hogan in his characteristic raspy growl: \"I don't see no stinkin' Nazis in here.\"\n\nTrump has denounced the four criminal indictments brought against him as politically motivated. \n\nHe has ramped up his denunciations in recent weeks of \"enemies from within,\" naming domestic political rivals, and suggested he would use the military to go after them. Harris, in turn, has called Trump a \"fascist.\"\n\nREAD MORE: School disruptions expected in NSW as teachers stop work for union meeting\n\nThe arena was full hours before Trump was scheduled to speak. \n\nOutside the arena, the sidewalks were overflowing with Trump supporters in red \"Make America Great Again\" hats. \n\nThere was a heavy security presence. Streets were blocked off and access to Penn Station was restricted.\n\nIn the crowd was Philip D'Agostino, a longtime Trump backer from Queens, the borough where Trump grew up. \n\nThe 64-year-old said it was appropriate for Trump to be speaking at a place bills itself as \"the world's most famous arena.\"\n\n\"It just goes to show ya that he has a bigger following of any man that has ever lived,\" D'Agostino said.\n\nThe rally is one of a series of detours Trump has made from battleground states, including a recent rally in Coachella, California — best known for the famous music festival named after the town — and one in May on the Jersey Shore.\n\n This summer he campaigned in the South Bronx.\n\nTo reach them, Trump has spent hours appearing on popular podcasts. \n\nAnd his campaign has worked to create viral moments like his visit last weekend to a McDonald's restaurant, where he made fries and served supporters through the drive-thru window. \n\nVideo of the stop posted by his campaign has been viewed more than 40 million times on TikTok alone.\n\nHarris has also travelled to non-battleground states for major events intended to drive a national message. \n\nShe appeared in Houston Friday with music superstar Beyoncé to speak about reproductive rights, and will deliver her own closing argument on Tuesday from the Ellipse in Washington, where Trump spoke ahead of the Jan. 6, 2021 Capitol riot.\n\nTrump will be joined at the rally by supporters including Tesla and SpaceX CEO Elon Musk, who has spent tens of millions of dollars to boost his campaign.\n\nTrump often compares himself to the country's greatest entertainers. The former reality TV star has long talked about wanting to hold a rally at the venue in interviews and private conversations.\n\nBeyond the national spotlight and the appeal of appearing on one of the world's most famous stages, Republicans in the state say the rally will also help down-ballot candidates. \n\nNew York is home to a handful of competitive congressional races that could determine which party controls the House next year.\n\nTrump will also use the stop as a major fundraising opportunity as he continues to seriously lag Harris in the money race.\n\nNew York has not voted for a Republican for president in 40 years. But that hasn't stopped Trump from continuing to insist he believes he can win.\n\nREAD MORE: How does the Electoral College work? Explaining the centuries-old system that decides the US election\n\nTrump routinely uses his hometown as a foil before audiences in other states, painting a dark vision of the city that bears little resemblance to reality. \n\nHe's cast it as crime-ridden and overrun by violent, immigrant gangs who have taken over Fifth and Madison avenues and occupied Times Square.\n\nTrump has a complicated history with the place where he built his business empire and that made him a tabloid and reality TV star. \n\nIts residents indicted him last year on 34 felony counts of falsifying business records. \n\nHe was found guilty in that case, and also found liable in civil court for business fraud and sexual abuse.","summary":"Donald Trump took the stage on Sunday night at New York&#x27;s Madison Square Garden after several of his allies used crude and extreme rhetoric toward Vice President Kamala Harris and other critics of the former president.","url":"https://www.9news.com.au/world/donald-trump-holds-madison-square-garden-rally/e45692a5-30be-4a7f-af8d-d9d5bb82b2c8","image":"https://imageresizer.static9.net.au/ylXL6XeHGafeJWsm_Tr4qeGLbf8=/0x267:4639x2876/750x422/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F8b79bc4b-0c31-4b00-bc2c-dac7fd2544e4","video":null,"publish_date":"2024-10-27 23:57:56","author":"9News,Associated Press","authors":["9News","Associated Press"],"language":"en","category":"politics","source_country":"AU","sentiment":0.013},{"id":261319222,"title":"The 2024 choice on education: Trump sides with families, Harris with the teacher unions","text":"Of all the policy issues where the choice between Donald Trump and Kamala Harris is stark, perhaps the most surprising is education: He’s all-in for parental choice; she’s committed to serving the interests of the teachers unions.\n\nAnd polling shows a majority of Americans are on his side, after decades when the Democratic had a strong edge on education.\n\nBut the pandemic was a huge eye-opener for millions of us: Not only did we see the unions and their office-holding pawns vociferously demand to keep schools closed as fully and as long as possible — long after all the science showed that it posed zero risk of spreading COVID — the “remote learning” offered in the place of real schooling gave us a window on what our public schools were teaching.\n\nStrong supporters of public education in the abstract saw how badly it served their own children, as so many teachers didn’t even try to actually teach online.\n\nThe bitter result: US kids lag their peers around the world.\n\nOn the 2022 math exams by the Program for International Student Assessment, for example, American 15-year-olds ranked 28th out of 37 industrialized (OECD) nations, even though we spend far more per-pupil than peer countries.\n\nTo be clear: Public schools still host lots of dedicated educators — but also far too many who are only in it for the paycheck and the benefits. Thanks to union power, it’s near-impossible to fire even terrible teachers.\n\nTheir eyes opened, hundreds of thousands of families did what was best for their kids, and chose something else — a public charter school, a private school (including Catholic and other faith-based institutions) or even home-schooling.\n\nFrom the 2019-20 school year to 2021-2, US public-school enrollment fell from 50.8 million to 49.4 million — even though that includes public charter schools, which saw an increase.\n\nMeanwhile, private school enrollment rose from 4.65 million to 4.73 million.\n\nThe exodus would be far larger, but many families lack the means to flee the “free” public system.\n\nAnd in states like New York, teacher-union power stops charter schools from growing to meet the demand for public schools that work because the unions don’t control them. \n\nIt doesn’t help that the unions are firmly allied with progressives who push extremist Diversity, Equity and Inclusion policies — racially divisive nonsense that treats traits like “showing up on time” as tools of White Supremacy.\n\nNor that this alliance despises standardized testing — the chief measure for parents to know how well their children are really learning.\n\nIt’s also how we all know that pandemic school shutdowns cost the nation’s children years of progress in math and English — and that’s on average.\n\nBut for the American Federation of Teachers and the National Education Association, the only things that matter are their union members’ pay and perks: For all their claims to care about the kids, AFT chief Randi Weingarten proved otherwise during COVID by using her pull with the Biden-Harris administration to overrule health officials and issue absurdly stringent guidelines for “safely” reopening schools.\n\nEven as most schools across the Western world never closed, or reopened after just a few months — with zero health impact. (And don’t get us started on the mad masking mandates.)\n\nOf course, it wasn’t just the feds: Teacher unions are also a huge political force in many states and cities — and union power was the main factor determining how long public schools stayed closed all across America.\n\nTrump, to be clear, is a longtime school-choice fan: That’s why he chose Betsy DeVos, a huge choice backer, as his first-term secretary of education.\n\nAnd Harris, a devoted California progressive, is a lockstep teacher-union ally: Weingarten is out campaigning furiously for her even now; the NEA and her AFT have supported and donated to Democrats overwhelmingly (more than 10-1) for decades now.\n\nThis year’s Democratic platform firmly opposes school choice.\n\nThat’s a shift for the worse, incidentally: To his great credit, President Barack Obama supported choice in the form of public charter schools, despite bitter union opposition.\n\nAnd here’s a note for those self-declared “true conservatives” who pooh-pooh Trump: He’s the first presidential candidate since Ronald Reagan to say he means to shut down the federal Department of Education, which has been a force for union power (and little else) ever since President Jimmy Carter created it in 1980 to repay the AFT and NEA for their support.\n\nNot that Trump means to end federal support for education: Indeed, he’s come out for the Educational Choice for Children Act, a bill to set up a nationwide school-choice plan that would be neither run nor regulated by the federal DOE.\n\n(Ensuring that bill makes it to his desk, by the way, is another reason to vote Republican in congressional races.)\n\nThe unions and their allies insist school choice will destroy public education, but the reverse is true: It’s the best hope to save the public schools, by forcing them to up their game to compete with other options. \n\nConsider Florida, which launched its school-choice tax-credit scholarship program back in 2001: Nearly half a million kids have benefited since, even as the state as added other school-choice options.\n\nOver those decades, Florida’s education system has climbed to the top of the national rankings — despite spending 27% below the national per-student average.\n\nNew York state spends more than twice the national average, yet lingers in mediocrity.\n\nSchools, especially public schools, shouldn’t be a jobs program for adults, but that’s how the unions and the Democrats see them.\n\nFor decades, that alliance has gotten away with pretending to care about the children — but now the mask is off.\n\nVoters’ choice on education is clear: Trump wants change for the better; Harris is just a tool of the failed status quo.","summary":"Of all the policy issues where the choice between Donald Trump and Kamala Harris is stark, perhaps the most surprising is education.","url":"https://nypost.com/2024/10/27/opinion/the-2024-choice-on-education-trump-sides-with-families-harris-with-the-teacher-unions/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-vc5yy612l-1730070827738.jpg?quality=75&strip=all&1730056605&w=1200","video":null,"publish_date":"2024-10-27 23:53:35","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.354},{"id":261319254,"title":"Down to the wire: Trump, Harris book sprint of stops across US in final days of 2024 election","text":"Both former President Donald Trump and Vice President Kamala Harris, as well as their campaign surrogates, have very busy weeks ahead, with stops planned across the country and through key battleground states.","summary":"Both former President Donald Trump and Vice President Kamala Harris, as well as their campaign surrogates, have very busy weeks ahead, with stops planned across the country and through key battleground states.","url":"https://www.bostonherald.com/2024/10/27/down-to-the-wire-trump-harris-book-sprint-of-stops-across-us-in-final-days-of-2024-election/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/AP24301843511197.jpg?w=1024","video":null,"publish_date":"2024-10-27 23:49:44","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","category":"politics","source_country":"us","sentiment":0.157},{"id":261319418,"title":"Illinois elected officials deploy to swing states to get out the vote for Harris-Walz and Congress candidates","text":"Rep. Robin Kelly, the Democrat whose sprawling district stretches from Chicago’s South Side to rural downstate Illinois, spent part of Friday and Saturday in Nebraska, in and around Omaha where control of the White House and House of Representatives may be decided next month.\n\nKelly is one of the corps of elected Illinois Democrats who have been on the road these past months stumping for Vice President Kamala Harris and Gov. Tim Walz and Democrats running for Congress. Boosting Democratic turnout lifts all Democrats on the ballot.\n\nThese Illinois Democrats are available because our state is deep blue, backing Democratic presidential nominees since 1992 and none of them have any consequential re-election battles.\n\nOver the weekend, Kelly was campaigning in Nebraska’s 2nd Congressional District for the Harris-Walz ticket and Democratic House hopeful Tony Vargas. This political turf is nicknamed the “blue dot” because it has lots of Democrats in what is otherwise a very Republican red state.\n\nWhen it comes to electoral votes, Nebraska allocates electoral votes on a per-district basis — it is not winner-take-all, like most states. In the tight race between Harris and former President Donald Trump, this single electoral vote from the blue-dot district could be crucial.\n\nDemocrats can win control of the House by picking up just four seats. As a vice chair of the House Democratic political operation’s “red to blue” project, Kelly told me Saturday she was also in Omaha because “I’m helping to flip the seat.” Among other things, Kelly spoke at a rally along with Vargas and Maya Harris, Kamala Harris’ sister.\n\nLast Sunday Kelly was in Milwaukee, in presidential battleground Wisconsin with 10 electoral votes, at present a toss-up between Harris and Trump. She was campaigning with Sen. Tammy Baldwin, who is in a tough re-election battle. Kelly’s been in Petersburg, Virginia, to canvass with Rep. Jennifer McClellan and did a variety of events in Miami with local Florida Black leaders, all aimed at getting out the Black vote.\n\nThe campaign will likely dispatch her to another state in the days ahead. “Sometimes I am preaching to the choir,” Kelly said of her efforts to get out the vote, and “sometimes the choir needs practice.”\n\nKam Buckner on turning out the Black male vote \n\nState Rep. Kam Buckner, a Chicago Democrat, met Harris 15 years ago in San Francisco through mutual friends when he was working for Mitch Landrieu, then the mayor of New Orleans. He was an early Harris backer when she ran for president in 2020. After President Joe Biden dropped out of the race on July 21, her team called, asking Buckner if he wanted to be a surrogate.\n\n“I said absolutely,” Buckner told me when we talked last Wednesday at the University of Chicago’s Institute of Politics, where he is a fellow this quarter. Buckner said he has been “traveling the country, doing everything from canvassing, talking to folks who are canvassing, talking to folks who are phone banking, doing a lot of churches on Sundays. So I was in Philadelphia this past Sunday, doing churches in both north and south Philly, and I’ll be in North Carolina and Charlotte this Sunday, doing churches there as well.” Swing-state North Carolina has 16 electoral votes.\n\nBuckner’s also been deployed to the key swing state of Michigan — hitting Grand Rapids, Detroit, Flint and South Haven. He’s also campaigned in Arizona and in Broward and Dade counties in south Florida.\n\nGetting out the Black vote is key to a Harris victory. Buckner said he spends “a lot of time doing the kind of our souls-to-the-poll stuff, a lot of the faith-based stuff. But also, you know, as a Black male and a Black male elected [official] a lot of my energy has been focusing on Black men who are going to be a huge part of whatever happens in this election.”\n\nHe added, “at the end of the day, Black men are going to go overwhelmingly for the vice president. …There are a lot of folks that I’ve talked to in places like Grand Rapids and Flint and Detroit who need to believe again in the electoral process. They’re not anti-Kamala Harris, they’re not pro-Donald Trump, they’re anti-politics. And that has to be addressed.”\n\nBuckner briefly saw Harris on Oct. 18, while backstage at a Grand Rapids rally. She gave him a hug, a high five and asked him, he recalled, “how’s it going out there.” He told her: “We’re getting the message out. We’re pushing.”\n\nSusana Mendoza and 23 years of door-knocking\n\nIllinois Comptroller Susana Mendoza and Buckner were on the same Grand Rapids swing, along with state Rep. Bob Morgan of Highland Park and state Sen. Natalie Toro from Chicago.\n\nBesides Michigan, with 15 electoral votes, Mendoza’s surrogate travels have also taken her to Las Vegas in battleground Nevada, with six electoral votes.\n\nOn Saturday, she rallied the troops in Lancaster, Pennsylvania, with 19 electoral votes, the biggest swing state prize.\n\nMendoza said sending elected officials from other states to battlegrounds, where they are not well-known, boosts volunteers. \n\n“They may not know who we are, but remember, anytime you get a statewide elected official from any state coming to a volunteer event, the volunteers are like, ‘Wow, that’s really cool. And then also, when Hispanic volunteers see me, or women see me and I give a good speech, they get fired up.” \n\nWhen Mendoza knocks, she brings her 23 years of campaign experience to the door. “I know how to speak to voters. I know, more importantly, how to listen to voters, how to hear their concerns, and then listen to what they have to say, especially these undecideds [and] hopefully make a good case to them as to why I think that our candidate is the one who will best represent them and best fight for the things that matter to them.”\n\nDuckworth looking for veterans, female and AANHPI votes\n\nSen. Tammy Duckworth, a Harris-Walz campaign co-chair, has been traveling extensively for the ticket and Senate candidates using her unique background: Asian American, wounded Iraq War vet, mother through IVF, to target voting groups, including veterans, Asian American and Native Hawaiian/Pacific Islanders and women — with reproductive rights a major focus.\n\nThis month, Duckworth has been in Janesville, Madison and Whitewater in Wisconsin, with Baldwin. She talked to groups, did phone banking and a rally at various stops in swing state Georgia, with 16 electoral votes. She made stops in Ohio, with 17 electoral votes, helping Sen. Sherrod Brown, who is in a close race.\n\nOn Tuesday, she’s heading to Pennsylvania to campaign for the ticket and Sen. Bob Casey Jr. who is up for re-election. In the final days, she hits battleground Nevada, with six electoral votes and Sen. Jacky Rosen in a fight for another term.\n\nPritzker, other Illinois surrogates\n\nGov. JB Pritzker on Sunday was in Wisconsin doing canvass launches in Kenosha and Waukesha. Democratic Party of Illinois chair Lisa Hernandez and more than 100 volunteers canvassed in Kenosha on Sunday, joining Pritzker and Rep. Jan Schakowsky.\n\nArizona and New Hampshire are among Pritzker’s other stops. Lt. Gov. Juliana Stratton has stumped in Michigan and Minnesota. At Las Vegas and Detroit events, Mayor Brandon Johnson aimed to lift Black male turnout.\n\nRep. Raja Krishnamoorthi has traveled to Detroit, Pittsburgh, Las Vegas, Kenosha, Tampa and Morrisville, N.C. for more than 50 canvass, get-out-the-vote and phone banking events. Many of these events have targeted AANHPI groups.\n\nRep. Jesus “Chuy” Garcia focused on turning out the Mexican American vote at events in Milwaukee, Minneapolis, and Detroit. Rep. Mike Quigley, co-chair of the Congressional Ukraine Caucus, has been focusing on voters with Eastern European roots, with St. Joseph, Michigan, among his stops.\n\nThe Illinois Harris-Walz campaign is led by Valerie Alexander, with Lindsay Mueller, the state director; David Seman, the senior advisor; and Charles Kyle, the organizing director.","url":"https://chicago.suntimes.com/elections/2024/10/27/presidential-election-illinois-officials-swing-states-harris-pritzker-johnson-buckner-kelly-mendoza","image":"https://cst.brightspotcdn.com/dims4/default/c4994c9/2147483647/strip/true/crop/3300x1884+0+158/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F18%2F7c%2Fa018b5da48f2baddbe4ded69c653%2Fmend","video":null,"publish_date":"2024-10-27 23:49:00","author":"Lynn Sweet","authors":["Lynn Sweet"],"language":"en","category":"politics","source_country":"us","sentiment":0.033},{"id":261321214,"title":"Trump’s Madison Square Garden event turns into a rally with crude and racist insults","text":"Donald Trump took the stage Sunday night at New York’s Madison Square Garden to deliver his campaign’s closing argument with the election nine days away after several of his allies used crude and racist insults toward Vice President Kamala Harris and other critics of the former president.\n\nThe Republican nominee began by asking the same questions he’s asked at the start of every recent rally: “Are you better off now than you were four years ago?” The crowd responded with a resounding “No!”\n\n“This election is a choice between whether we’ll have four more years of gross incompetence and failure, or whether we’ll begin the greatest years in the history of our country,” he said after being introduced by his wife, Melania Trump, whose rare surprise appearance comes after she has been largely absent on the campaign trail.\n\nSeveral speakers earlier on Sunday crudely insulted Harris, who is vying to become the first woman and Black woman to win the presidency. And a stand-up comedian made lewd and racist comments about Latinos, Jews and Black people, all key constituencies in the election just nine days away.\n\n“I don’t know if you guys know this, but there’s literally a floating island of garbage in the middle of the ocean right now. I think it’s called Puerto Rico,” said comedian Tony Hinchcliffe, whose joke was immediately criticized by Harris’ campaign as it competes with Trump to win over Puerto Rican communities in Pennsylvania and other swing states. Shortly after Hinchcliffe’s appearance, music superstar Bad Bunny, who is from Puerto Rico, endorsed Harris.\n\nTrump’s childhood friend David Rem, meanwhile, referred to Harris as “the Antichrist” and “the devil.” Businessman Grant Cardone told the crowd that Harris ”and her pimp handlers will destroy our country.” And former Fox News host Tucker Carlson called Harris, the daughter of Jamaican and Indian immigrants, “a Samoan, Malaysian, low-IQ former California prosecutor.”\n\nTURNS TO SPECTACLE\n\nThe event was a surreal spectacle, turning what his campaign had advertised as the event where he would deliver his closing message in the campaign’s final days to an illustration of what turns off his critics. The lineup included House Speaker Mike Johnson, TV psychologist Dr. Phil McGraw, former professional wrestler Hulk Hogan, and someone who painted a picture of Trump hugging the Empire State Building.\n\nAnd that was all before the Republican presidential nominee took the stage more than two hours late.\n\nTrump on Sunday added a new proposal to his list of tax cuts aimed at winning over older adults and blue-collar workers, which already includes vows to end taxes on Social Security benefits, tips and overtime pay: A tax credit for family caregivers.\n\nThis comes after Harris has talked about the “sandwich generation” of adults caring for aging parents while raising their children at the same time. Harris has proposed federal funding to cover home care costs for older Americans.\n\nTrump otherwise repeated familiar lines about foreign policy and immigration, calling for the death penalty for any migrant who kills a U.S. citizen and saying that the day he takes office, “The migrant invasion of our country ends.”\n\nAMPED-UP VERSION OF RNC\n\nMany of the speakers Sunday appeared on stage at the Republican National Convention. This time, the same speakers shouted and railed more against Democrats.\n\nHogan, returning to the venue where he performed years ago as a professional wrestler, seemed to reprise his character, emerging wearing a giant red, orange and yellow boa and violently waving a large American flag as he posed and danced. He spat on the stage during his speech, flexed his muscles repeatedly and told the audience: “Trump is the only man that can fix this country today.”\n\nWhile some Democrats and pundits have questioned Trump’s decision to hold what they dismiss as a vanity event in his hometown, the rally guarantees Trump what he most craves: the spotlight, wall-to-wall coverage and a national audience.\n\nThe closing message he will deliver Sunday, according to his campaign, is that Harris “broke” the country and that Trump “will fix it.” Rallygoers hours beforehand waved signs with the words “Trump will fix it.”\n\nSome Democrats, arguing that Trump is a “fascist,” have compared his Sunday event to a pro-Nazi rally at the Garden in February 1939. Several speakers on Sunday ripped Hillary Clinton, the Democrat defeated by Trump eight years ago, for saying recently that Trump would be “reenacting” the 1939 event.\n\n“Hey guys, they’re now scrambling and trying to call us Nazis and fascists,” said Alina Habba, one of Trump’s attorneys, who draped a sparkly “MAGA” jacket over the lectern as she spoke. “And you know what they’re claiming, guys? It’s very scary. They’re claiming we’re going to go after them and try and put them in jail. Well, ain’t that rich?”\n\nDeclared Hogan in his characteristic raspy growl: “I don’t see no stinkin’ Nazis in here.”\n\nTrump has denounced the four criminal indictments brought against him as politically motivated. He has ramped up his denunciations in recent weeks of “enemies from within,” naming domestic political rivals, and suggested he would use the military to go after them. Harris, in turn, has called Trump a “fascist.”\n\nThe arena was full hours before Trump was scheduled to speak. Outside the arena, the sidewalks were overflowing with Trump supporters in red “Make America Great Again” hats. There was a heavy security presence. Streets were blocked off and access to Penn Station was restricted.\n\nIn the crowd was Philip D’Agostino, a longtime Trump backer from Queens, the borough where Trump grew up. The 64-year-old said it was appropriate for Trump to be speaking at a place bills itself as “the world’s most famous arena.”\n\n“It just goes to show ya that he has a bigger following of any man that has ever lived,” D’Agostino said.\n\nA NEW YORKER RETURNS HOME\n\nNew York has not voted for a Republican for president in 40 years. But that hasn’t stopped Trump from continuing to insist he believes he can win.\n\nTrump routinely uses his hometown as a foil before audiences in other states, painting a dark vision of the city that bears little resemblance to reality. He’s cast it as crime-ridden and overrun by violent, immigrant gangs who have taken over Fifth and Madison avenues and occupied Times Square.\n\nTrump has a complicated history with the place where he built his business empire and that made him a tabloid and reality TV star. Its residents indicted him last year on 34 felony counts of falsifying business records. He was found guilty in that case, and also found liable in civil court for business fraud and sexual abuse.\n\nThe rally is one of a series of detours Trump has made from battleground states, including a recent rally in Coachella, California — best known for the famous music festival named after the town — and one in May on the Jersey Shore. This summer he campaigned in the South Bronx.\n\nTo reach them, Trump has spent hours appearing on popular podcasts. And his campaign has worked to create viral moments like his visit last weekend to a McDonald’s restaurant, where he made fries and served supporters through the drive-thru window. Video of the stop posted by his campaign has been viewed more than 40 million times on TikTok alone.\n\nHarris has also traveled to non-battleground states for major events intended to drive a national message. She appeared in Houston Friday with music superstar Beyoncé to speak about reproductive rights, and will deliver her own closing argument Tuesday from the Ellipse in Washington, where Trump spoke ahead of the Jan. 6, 2021 Capitol riot.\n\nBeyond the national spotlight and the appeal of appearing on one of the world’s most famous stages, Republicans in the state say the rally will also help down-ballot candidates. New York is home to a handful of competitive congressional races that could determine which party controls the House next year.","summary":"Several of Trump’s allies have used crude and extreme rhetoric toward Harris and other Trump critics before the former president was to take the stage at New York’s Madison Square Garden.","url":"https://www.centralmaine.com/2024/10/27/trumps-madison-square-garden-event-turns-into-a-rally-with-crude-and-racist-insults-2/","image":"https://www.centralmaine.com/wp-content/uploads/sites/2/2024/10/Election_2024_Trump_04436_b40bd2-1730076120.jpg?w=1000","video":null,"publish_date":"2024-10-27 23:47:57","author":"Jill Colvin And Michelle L. Price,JILL COLVIN and MICHELLE L. PRICE - Associated Press","authors":["Jill Colvin And Michelle L. Price","JILL COLVIN and MICHELLE L. PRICE - Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.272},{"id":261318874,"title":"Comedian quips ‘Democrat Party like a Diddy Party’","text":"Kill Tony podcast host Tony Hinchcliffe likened the Democratic Party to a “Diddy party,” alluding to the infamous “Freak Off” parties hosted by rapper Sean ‘P. Diddy’ Combs — and declared Travis Kelce “might be the next OJ Simpson” during his remarks at the Trump rally in Madison Square Garden. \n\n“I don’t know about you guys, but I think Travis Kelce might be the next OJ Simpson,” the comedian quipped during his opening speech listing off celebrity endorsements on the left including the Chiefs tight-end and others such as Eminem and Leonardo DiCaprio, the New York Post reports.\n\n“Every day, the Democrat Party looks more like a Diddy Party!” he jabbed, drawing sheepish laughs. “Oh okay, I see what you guys want.”\n\nRevelations about Combs surfaced last month after he was indicted on charges of racketeering and sex trafficking.\n\nProsecutors alleged that he was involved in the “creation of a criminal enterprise in which he abused, threatened, and coerced women.”\n\nMany of those allegations centred around his “Freak Off” parties. Comb has pleaded not guilty and was denied bail.\n\nHinchcliffe sprinkled in a handful of off-coloured jokes during his opener at the Trump rally.\n\nHis crass humour drew mixed reactions from the crowd. At one point he suggested that Israel and the Palestinians should “settle their stuff already” and pitched rock paper scissors as a way to resolve the bloody conflict. \n\nHinchcliffe also mused about the July 13 assassination attempt against former President Donald Trump in Butler, Pa., joking about how President Biden contracted COVID-19 right after. \n\n“Trump survived an assassination attempt and Biden got Covid. We vote next week. God voted three months ago,” he quipped. \n\nDuring another portion of his speech, Hinchcliffe sparked outrage from outside observers with an incendiary insult directed at Puerto Ricans.\n\n“There’s literally a floating island of garbage in the middle of the ocean right now. I think it’s called Puerto Rico,” he said in a swipe against the US territory.\n\nHe also targeted Latino migrants. \n\n“I welcome migrants to the United States with open arms and by open arms, I mean like this,” he said with hand gestures signally “no.”\n\n“It’s wild and these Latinos love making babies too, just know that,” They don’t do that. They come inside, just like they did to our country. Republicans are the party with a good sense of humour.”\n\nTrump’s rally in Madison Square Garden attracted thousands to the iconic venue. It marks a foray into a deep blue state just nine days out from the election in which battleground states are usually top of mind for presidential campaigns.\n\nThis article originally appeared in the New York Post and has been reproduced with permission.","summary":"A US comedian has likened the Democratic Party to a “Diddy party” in a controversial remark at Donald Trump’s New York rally.","url":"https://www.news.com.au/world/north-america/us-politics/democrat-party-looks-more-like-a-diddy-party-comedian-tony-hinchcliffe-makes-shock-quip-at-trump-rally/news-story/fd2a50abb08b2f5c538e362648e55855?from=rss-basic","image":"https://content.api.news/v3/images/bin/6c3f5b4ecf7bfa4ffc8a0d8e854ba903","video":null,"publish_date":"2024-10-27 23:45:59","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"au","sentiment":-0.03},{"id":261319080,"title":"The Eisenhower-era blueprint of Trump's deportation plan","text":"Former President Donald Trump has sought to make immigration a defining issue in the 2024 presidential race, pledging to oversee mass deportations if voters return him to the White House.\"The Republican platform promises to launch the largest deportation operation in the history of our country,\" he said at the Republican National Convention this past July, as his crowd of supporters held signs bearing the phrase \"mass deportation now!\"It's a pledge Trump has made frequently this campaign cycle, including at his rallies, in a recent conversation with billionaire Elon Musk, and in the official Republican Party platform. But it is not just during this election that Trump has promised to conduct the largest deportation operation in American history. He has said it since at least 2015, when he was first running for commander in chief. He brought it up in the fourth Republican primary debate, and earlier that year, he raised the subject of mass deportation in an interview with 60 Minutes correspondent Scott Pelley.Trump's mass deportation plan for undocumented immigrants could cost billions a yearIn the last nine years, one thing has frequently come up when Trump mentions removing en masse the migrants who have crossed the border illegally: the name of another former president.\"You look back in the 1950s, you look back at the Eisenhower administration, take a look at what they did, and it worked,\" Trump told Pelley in 2015.What the U.S. government did under Dwight D. Eisenhower was a massive military-style sweep. U.S. Border Patrol agents conducted raids to round up Mexican laborers from farms and ranches, then transported them deported deep into Mexico. Historians say the program tore families apart, violated civil rights â and at times, even turned deadly.Moreover, those who have studied the Eisenhower administration's approach say this short-term show-of-force did not stop the problem.\"I would describe [it] as a very cruel operation of deportation,\" said immigration historian Mae Ngai, whose book \"Impossible Subjects\" examines how illegal migration became a central issue of U.S. immigration policy. \"But also, it was a kind of political theater. It did not solve the issue of undocumented migration.\"The blueprint for Trump's idea: \"Operation Wetback\"Following World War II, immigration into the United States was fairly low. The U.S. government imposed strict immigration quotas that limited the number of people allowed to enter the country. The controversy over immigration arose in the early 1950s, around the Bracero program, a guest worker program for agricultural laborers from Mexico.According to Ngai, the American growers who were hiring these Mexican laborers preferred undocumented workers because they had fewer regulations governing their treatment. This embarrassed the Immigration and Naturalization Service, Ngai said, because they wanted the farmers to only take the legally contracted Braceros.Although the terms have since become ethnic slurs, in the 1950s, most everyone involved in immigration policy on both sides of the border referred to people who crossed the river illegally from Mexico as \"wetbacks\" or \"mojados.\" In 1953, CBS's Edward R. Murrow reported on the situation at the border using that term.Trump vows to deport millions. Would it mean family separations?\"Every 30 seconds, a Mexican wetback enters this country illegally,\" Murrow detailed. \"The number is increasing. Some days as many as 5,000 are caught and sent back in a single day.\"To deal with the issue of illegal entries from Mexico, Eisenhower assigned his Commissioner of Immigration and Naturalization, Lieutenant General Joseph Swing, Eisenhower's friend and former West Point classmate. Swing concocted a military-style plan to round up and mass deport those laborers who crossed the border outside of the Bracero program. The plan became known as \"Operation Wetback.\"Although the U.S. had steadily increased deportations of Mexican laborers, the largest effort commenced in June 1954, when U.S. Border Patrol head Harlon Carter promised \"the biggest drive against illegal aliens in history,\" according to a contemporaneous report by the Los Angeles Times. Over the next year, hundreds of Border Patrol agents apprehended and deported anyone suspected of being in the United States illegally. They flew airplanes over the Rio Grande Valley to see where people were working and would check to see if there was a farm that was illegally contracting workers. While the operation included some raids in cities such as Los Angeles and Chicago, Ngai said, the primary focus was laborers near the Mexican border.\"These people were just rounded up, put on trucks and buses, driven over the border, dumped on the other side, sometimes in the desert,\" Ngai said. Ngai said about a quarter of the people deported through \"Operation Wetback\" were put on ships and taken across the Gulf of Mexico to Veracruz in the Yucatan Peninsula.\"There was a big exposÃ© that these ships were barely converted freighters that were very old and dirty,\" Ngai said. \"One person in Congress called them 'hell ships.'\"Mass deportation would come with hefty bill, require more manpower, immigration experts sayAccording to Ngai, migrants were sometimes left in the scorching Mexican desert, with temperatures soaring over 100 degrees. \"In one case, 88 people died from sun stroke, and more would have died had the Mexican Red Cross not come to their rescue,\" Ngai said.\"Operation Wetback,\" Ngai said, was largely intended to show force to two audiences: Americans living near the border who had complained about the migration problem, and the growers, in an effort to make them obey the federal hiring program. It was not intended to score political points nationally.\"It was not a campaign issue,\" Ngai said. \"Most Americans didn't think about farm workers at the border, legal or not.\"The mass deportation operation lasted about a year. The program had become expensive to maintain, and American agriculture growers had begun to comply with the Bracero program to hire Mexican workers legally, leading them to use fewer undocumented laborers.At the time, the Eisenhower administration said it carried out more than one million \"returns,\" but historians believe many people were deported more than once and that the actual number of people is significantly less. Two historians told 60 Minutes that some American citizens were mistakenly deported in the roundups.How Trump's plan today connectsFormer President Trump's running mate Sen. JD Vance once believed the Republican Party was being \"tone deaf\" to suggest millions of undocumented people could be deported. While a law student at Yale, he wrote a since-deleted blog post for the Center for World Conflict and Peace that criticized the Republican Party's immigration positions.\"Think about it: we conservatives (rightly) mistrust the government to efficiently administer business loans and regulate our food supply, yet we allegedly believe that it can deport millions of unregistered aliens,\" Vance wrote in 2012. \"The notion fails to pass the laugh test.\"Today, Vance supports Trump's pledge of mass deportation, telling the New York Times in an interview that meaningful border enforcement requires both a physical deterrent and a willingness to deport people.\"I think it's certainly reasonable to deport around a million people per year,\" he told the Times.To see how Trump's plan today connects to that of the Eisenhower administration, 60 Minutes correspondent Cecilia Vega spoke with Tom Homan, the acting director of U.S. Immigration and Customs Enforcement (ICE) during the first year and a half of the Trump administration. Homan led ICE when thousands of migrant children were separated from their parents at the border, and Trump has counted Homan among those who will join him if he wins a second term.Vega noted to Homan that Trump often invokes Eisenhower's name, referencing a deportation program in which civil rights were violated, migrants were deported in dangerous conditions, and some people died. Vega suggested this history might give people pause. \"That doesn't mean people are going to die,\" Homan said. \"That doesn't mean civil rights are going to be violated. President Trump doesn't mean that.\"Examining the mass deportation Trump vows to carry out if he wins the electionAlthough he said he did not know what the Eisenhower administration's plan entailed, Homan said Trump's plan would not follow it in all aspects.\"He could say he's got the Eisenhower plan, because the Eisenhower plan was a massive deportation, but it doesn't mean all the negative things that happened are going to happen under his leadership,\" Homan said.But mass deporting undocumented migrants would be much more complicated now than it was in the 1950s.\"They're not Mexican workers,\" Ngai said. \"The large numbers of people who are crossing the border are asylum seekers. They're people who are fleeing civil war, civil strife, gang violence.\"Today's migrants live in cities throughout the country, not just near the border, and many have been in the country for years, often establishing families and work histories. A study by the American Immigration Council found that mass deportation could result in the removal of millions of construction, hospitality, and agriculture workers, which would reduce the GDP by $1.7 trillion.To see how ICE conducts targeted apprehensions today, 60 Minutes embedded with a group of ICE agents in Silver Springs, Maryland. There, the agents were locating and arresting undocumented immigrants identified by ICE as a threat to public safety, including those with criminal histories such as assault, robbery, drug and gun convictions.60 Minutes watched as it took a team of more than a dozen officers seven hours to arrest six people, not including the many hours spent searching for them.Matt Elliston, the director of ICE's Baltimore field office, said that deporting a mass number of undocumented migrants â such as the one million number Vance suggested â would be logistically infeasible. \"I could say here in Maryland, we would never be able to resource or find that amount of detention, which would be our biggest challenge,\" Elliston said. \"And just the amount of money that that would cost in order to detain everybody, it'd be, you know, at the Department of Defense level of financing.\"No matter how many people an administration were to deport, historian Ngai said, history suggests mass deportation is no panacea.\"You can try to have a big show, but ultimately you don't solve the problem,\" Ngai said. \"You hurt some people, and then people don't look anymore, and the problem doesn't go away.\"The video above was produced by Brit McCandless Famer and edited by Scott Rosann.","summary":"Former President Donald Trump has pledged to deport millions of undocumented migrants, a plan modeled after a 1954 operation that historians say ultimately did not work.","url":"https://www.cbsnews.com/news/blueprint-of-trump-deportation-plan-a-questionable-approach-by-eisenhower-60-minutes/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/27/0428df0b-c64b-4a3e-a74b-d68230e34d4a/thumbnail/1200x630/2dc37118bd9e1a93ddc4584a0342f113/ot-deportation.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/27/2383470147597/3295407_hls/master.m3u8","publish_date":"2024-10-27 23:45:13","author":"Brit McCandless Farmer","authors":["Brit McCandless Farmer"],"language":"en","category":"politics","source_country":"US","sentiment":-0.086},{"id":261319068,"title":"Migrant families worry over possible family separations if Trump wins","text":"Former President Donald Trump's pledge to implement mass deportation if he's reelected has ignited fears of family separations. Monica Camacho Perez and her family have lived and worked in the United States since coming illegally from Mexico more than 20 years ago. Camacho Perez teaches English as a second language to immigrant adults, and she also works in the public high schools. Her family lives in Baltimore. \"We are a normal family, like anybody else,\" she said. \"We go to church. We work every day. We pay taxes,\" she said.The blueprint of Trump's deportation plan: A questionable approach by EisenhowerShe's among the more than 500,000 undocumented immigrants brought to the country as children who are protected from deportation under the Deferred Action for Childhood Arrivals program known as DACA.\"I'm the only one right now that's, like, protected, while my parents are not, my brothers are not,\" she said. \"My brothers have children that are born here. So if they were to get deported, what will happen to their kids?\"Would families be separated if Trump's reelected?When asked whether there was a way to carry out mass deportations without separating families, Tom Homan, who led immigration enforcement during the first year-and-a-half of the Trump administration, said, \"Of course there is. Families can be deported together.\" Like Camacho Perez's nieces and nephews, more than four million U.S.-born children live with an undocumented parent.Asked why children should have to leave the country where they were born and raised, Homan said, \"Because their parent absolutely entered the country illegally, had a child knowing he was in the country illegally. So he created that crisis.\"During Homan's time leading ICE – in what became one of the most controversial policies of the Trump administration – at least 5,000 migrant children were forcibly separated from their parents when their parents were arrested at the border and prosecuted for crossing into the U.S. illegally.Trump's mass deportation plan for undocumented immigrants could cost billions a yearAsked about published accounts saying that family separation at the border was his idea, Homan replied: \"Not true. I didn't write the memorandum to separate families. I signed the memo. Why'd I sign the memo? I was hoping to save lives. While you and I are talking right now, a child's going to die in the border. . . . So we thought, 'so maybe if we prosecute people, they'll stop coming.'\"Trump has said Homan would be joining him in the new administration if he wins a second term. Asked if this family separation policy would be re-instituted then, Homan said, \"I don't know of any formal policy where they're talking about family separations.\"Asked whether it should be on the table, he replied, \"It needs to be considered, absolutely.\"How that would happen given a court settlement reached late last year between the federal government and the American Civil Liberties Union is unclear. Under the settlement, the federal government is barred from separating migrant families at the border for the next eight years if the sole purpose is to prosecute the parents for entering the U.S. illegally. \"I can't imagine living here without them.\"Back in Baltimore, Camacho Perez said she has given a lot of thought to what she would do if her parents were deported. Even though Baltimore is where she grew up, and she now owns her own home there, she thinks she would go back to Mexico with her parents if they were deported.\"They're also part of my American dream,\" she said. \"And I can't imagine living here without them.\"","summary":"With the U.S. just days away from an election that could see former President Trump back in office, some undocumented migrants fear family separations.","url":"https://www.cbsnews.com/news/family-separation-immigration-60-minutes/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/27/074df124-5a1e-4269-a298-ccaefc7e134c/thumbnail/1200x630/108a4afe5f3e91ec33d8137cb7062be2/deportation-article-3.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/27/2383457859787/3295299_hls/master.m3u8","publish_date":"2024-10-27 23:45:02","author":"Aliza Chasan,Camilo Montoya-Galvez,Cecilia Vega","authors":["Aliza Chasan","Camilo Montoya-Galvez","Cecilia Vega"],"language":"en","category":"politics","source_country":"US","sentiment":-0.119},{"id":261319070,"title":"Mass deportation could cost billions","text":"The mass deportation plan former President Donald Trump has pledged to institute if he's reelected would come with a hefty price tag.The American Immigration Council estimated that it could cost $88 billion annually to deport one million people a year. The removal of millions of construction, hospitality and agriculture workers could reduce the U.S. gross domestic product by $1.7 trillion. Tom Homan, who led U.S. Immigration and Customs Enforcement during the first Trump administration, said he doesn't know if the $88 billion a year cost estimate is accurate, but he says mass deportation is necessary.\"What price do you put on national security? Is it worth it?\" Homan said.How deportations work now60 Minutes recently joined ICE officers in Silver Spring, Maryland, as they located and arrested undocumented immigrants with criminal histories, including assault, robbery, drug and gun convictions. They'd been identified by ICE as threats to public safety.They stopped a van and arrested the passenger, a 24-year-old Guatemalan with an assault conviction, who had been ordered deported by a judge five years ago. ICE officers said the driver of the van was also in the country illegally and had been deported once before, but he was let go. Matt Elliston, director of ICE's Baltimore field office, said the driver didn't have a criminal record.The blueprint of Trump's deportation plan: A questionable approach by Eisenhower\"He was picking up his employee to go to work,\" Elliston said. \"It doesn't make sense to waste a detention bed on someone like that when we have other felons to go out and get today.\"Elliston said ICE's mission is targeted enforcement — using immigration law to improve public safety.\"It's not to just aimlessly arrest anyone we come across,\" he said.It took a team of more than a dozen officers seven hours to arrest six people, and that doesn't include the many hours spent searching for them.Are there resources to support mass deportation?There are more than 11 million undocumented immigrants living in the United States — about 3% of the population — and Trump has vowed to launch the largest mass deportation program in U.S. history. Homan, who Trump has said would join him if he wins a second term, said he's unaware of any written mass deportation plan.Trump's mass deportation plan for undocumented immigrants could cost billions a year\"ICE is very good at these operations. This is what they do,\" Homan said.But Elliston doesn't know how, in Maryland, the agency could find the resources for mass deportation. \"Just the amount of money that that would cost in order to detain everybody, you know, it [would be] at the Department of Defense level of financing,\" he said.Jason Houser, ICE chief of staff during the first two years of the Biden administration, said it costs $150 a night to detain people like those 60 Minutes saw arrested. The average stay as they await deportation is 46 days. One deportation flight can cost $250,000, and that assumes the home country will accept them. Many, like Cuba and Venezuela, rarely do.Who would handle mass deportation?ICE currently has around 6,000 law enforcement officers in its deportation branch. It would require a massive increase in manpower to arrest and deport a million people a year, Houser said.Trump vows to deport millions. Would it mean family separations?\"You're talking 100,000 official officers, police officers, detention officers, support staff, management staff,\" he said.Trump adviser Stephen Miller has said staff could come from other government agencies, like the Drug Enforcement Administration, but Houser criticized the idea of taking people from other agencies outside ICE off their set missions. Immigration enforcement also requires specialized training and language skills that most military and law enforcement officers don't have.\"It is not an easy swap,\" Elliston said. \"What I can tell you in, from the Immigration and Nationality Act, immigration law is second to the U.S. tax code in complexity.\"","summary":"Bankrolling mass deportation would be costly. It would also require a lot more manpower.","url":"https://www.cbsnews.com/news/mass-deportations-cost-government-resources-60-minutes/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/27/76c201d1-5690-43b7-acb0-d3ffa401718c/thumbnail/1200x630/9d1f47cce99745692c83f7d74d335131/deportation-article-2.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/27/2383457859787/3295299_hls/master.m3u8","publish_date":"2024-10-27 23:45:00","author":"Aliza Chasan,Camilo Montoya-Galvez,Cecilia Vega","authors":["Aliza Chasan","Camilo Montoya-Galvez","Cecilia Vega"],"language":"en","category":"politics","source_country":"US","sentiment":-0.361},{"id":261319066,"title":"What Trump's mass deportation plan might look like if he wins the election","text":"Former President Donald Trump on Friday predicted he'd break records for the number of people deported from the United States if he were elected for a second term. Trump has vowed to launch the largest mass deportation program in U.S. history. Tom Homan, who led immigration enforcement during the first year-and-a-half of the Trump administration as acting director of U.S. Immigration and Customs Enforcement, proudly pitched the idea at the Republican National Convention this summer, telling undocumented immigrants to start packing.\"Let me tell you what it's not going to be first,\" he told 60 Minutes of the mass deportation plan. \"It's not going to be a mass sweep of neighborhoods. It's not going to be building concentration camps. I've read it all. It's ridiculous.\"Plans for mass deportationThere are more than 11 million undocumented immigrants living in the United States, about 3% of the population. Nearly 80% of them have lived in the country for a decade or more, according to estimates by the Department of Homeland Security.The blueprint of Trump's deportation plan: A questionable approach by EisenhowerHoman, who Trump has said would join his administration if he wins a second term, said a mass deportation operation would be based on targeted arrests. \"We'll know who we're going to arrest, where we're most likely to find them based on numerous investigative processes,\" he said.Trump's running mate, Sen. JD Vance of Ohio, has said it would be reasonable to deport a million people a year. And Trump's top immigration adviser, Stephen Miller, told the audience at the Conservative Political Action Conference earlier this year that deportees would be removed from the country in a massive military air operation.\"You grab illegal immigrants and then you move them to the staging ground and that's where the planes are waiting for federal law enforcement to then move those illegals home,\" Miller said at the conference. \"You deputize the National Guard to carry out immigration enforcement.\"Homan said he doesn't use the term \"raids,\" but immigration enforcement operations at worksites would be needed. \"If I'm in charge of this, my priorities are public safety threats and national security threats first,\" he said.Trump's mass deportation plan for undocumented immigrants could cost billions a yearOthers would follow for removals, he said. During a targeted enforcement operation, for instance, if an undocumented grandmother was found in a house, an immigration court judge should decide her fate, Homan indicated\"Let the judge decide,\" he said. \"We're going to remove people that have a judge's order deported.\"Shift in policyHoman's suggestion that an undocumented grandmother might face arrest would mark a major shift in policy. Under President Biden, ICE is mostly targeting those deemed national security or public safety threats — and people who just crossed the border illegally.\"It's not OK to enter a country illegally, which is a crime,\" Homan said. \"That's what drives illegal immigration, when there's no consequences.\" The majority of the four million deportations carried out by the Biden administration have occurred at the southern border, where an unprecedented influx of migrants created scenes of chaos, a humanitarian crisis, and one of Vice President Kamala Harris' biggest political vulnerabilities.","summary":"Former President Trump has vowed to launch the largest mass deportation program in U.S. history.","url":"https://www.cbsnews.com/news/trump-mass-deportation-plan-60-minutes/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/27/64543c48-a893-45b3-9051-b27c3433243b/thumbnail/1200x630/ff91452b3a038916c23f51d1d7632041/deportation-video-vega.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/27/2383457859787/3295299_hls/master.m3u8","publish_date":"2024-10-27 23:44:57","author":"Aliza Chasan,Camilo Montoya-Galvez,Cecilia Vega","authors":["Aliza Chasan","Camilo Montoya-Galvez","Cecilia Vega"],"language":"en","category":"politics","source_country":"US","sentiment":-0.097},{"id":261319076,"title":"Trump mass deportation plan could cost billions a year","text":"With nine days until Election Day, former President Trump has stepped up his attacks on the Biden-Harris administration's record on illegal immigration and pledged that, if elected, he'll conduct the largest deportation in American history.There are more than 11 million undocumented immigrants living in the United States.…about 3% of the population. Nearly 80% of them have lived in the country for a decade or more.How realistic is this mass deportation campaign promise? What would be the human and financial cost? We took these questions to one of the people Donald Trump has said would join him if he wins a second term – Tom Homan… who led immigration enforcement during the first Trump administration when thousands of migrant children were separated from their parents at the border.The blueprint of Trump's deportation plan: A questionable approach by EisenhowerTom Homan: I hear a lot of people say, you know, the talk of a mass deportation is racist. It's-- it's-- it's threatening to immigrant community. It's not threatening to the immigrant community. It should be threatening to the illegal immigrant community. But on the heels of [a] historic illegal immigration crisis. That has to be done.At the Republican National Convention this summer… Tom Homan was the proud pitchman of mass deportation…Tom Homan speaking at the RNC: I got a message to the millions of illegal aliens that Joe Biden's released in our country. You better start packing now. Over three decades, he worked his way up from border patrolman to acting director of Immigration and Customs Enforcement – the agency known as \"ICE\" -- during the first year and a half of the Trump administration. This election cycle, former President Trump has mentioned mass deportation at nearly every rally…Donald Trump: We will begin the largest deportation operation in the history of our country because we have no choiceCecilia Vega: What would the largest deportation in American history look like to you?Tom Homan: Well, lemme tell you what it's not going to be first. It's not gonna be-- a mass sweep of neighborhoods. It's not gonna be building concentration camps. I've read it all. It's ridiculous.Cecilia Vega: But if mass deportation is not going to be, as you said, massive sweeps and concentration campsTom Homan: It'll be concentratedCecilia Vega: What is it?Tom Homan: They'll be targeted arrests. We'll know who we're going to arrest, where we're most likely to find 'em based on numerous inve-- you know, investigative processes.Trump vows to deport millions. Would it mean family separations?Former President Trump's running mate JD Vance said it would be reasonable to deport a million people a year…Trump's top immigration advisor Stephen Miller told a conservative audience that deportees would be removed from the country in a massive military air operation… Stephen Miller : So you grab illegal immigrants and then you move them to the staging ground and that's where the planes are waiting for federal law enforcement to then move those illegals home. You deputize the National Guard to carry out immigration enforcement Cecilia Vega: Stephen Miller said that this will involve large-scale raids.Tom Homan: He-- I-- I don't use the term \"raids,\" but you're probably talking about work-site enforcement operations-- which this administration pretty much stoppedCecilia Vega: Workplace enforcement, that's a roundup.Tom Homan: And that's gonna be necessary. Work-site enforcement operations just not about people who's working illegally in the country and companies that hire 'em that's gonna undercut their competition that has U.S. citizen employees. It's where we find a lot of trafficking cases you know, women and children who are forced into forced labor to pay off their smuggling fees. A study by the American Immigration Council found that mass deportation could result in the removal of millions of construction, hospitality and agriculture workers-- reducing the GDP by $1.7 trillion.Cecilia Vega: Can you just limit it to criminals and national security threat though?Tom Homan: If I'm in charge of this, my priorities are public safety threats and national security threats first.Cecilia Vega: First implies others follow, though, right?Tom Homan: Absolutely.Cecilia Vega: So game that out for me. What's the scenarioTom Homan: It's not OK to enter a country illegally, which is a crime. That's what drives illegal immigration, when there's no consequences. The Biden-Harris administration has proven this, You can get to the border, turn yourselves in, get released within 24 hoursCecilia Vega: So you are carrying out a targeted enforcement operation. Grandma's in the house. She's undocumented. Does she get arrested too?Tom Homan: It dependsCecilia Vega: WhichTom Homan: Let-- let the judge decide. We're gonna remove people that-- a judge's order deported.Homan's suggestion that grandma might face arrest would mark a major shift in policy. Under President Biden, ICE is mostly targeting those deemed national security or public safety threats — and people who just crossed the border illegally.Mass deportation would come with hefty bill, require more manpower, immigration experts sayThe majority of the 4 million deportations carried out by the Biden administration have occurred at the southern border, where an unprecedented influx of migrants created scenes of chaos, a humanitarian crisis and one of Vice President Harris' biggest political vulnerabilities.Homan says mass deportation is the solution.Cecilia Vega: How many people would be deported?Tom Homan: That's-- that's-- you can't answer that question.Cecilia Vega: Why not?Tom Homan: How many officers do I have?Cecilia Vega: Is there a written plan on this?Tom Homan: Not that I know of.Cecilia Vega: If there's no memo, if there's no plan, is this fully baked?Tom Homan: We've done it before. Cecilia Vega: But not-- a deportation of this scale.Tom Homan: ICE is very good at these operations. This is what they doTo see what they do, we went to Silver Spring, Maryland, a suburb of Washington, DC … where earlier this month, ICE agents gathered in a parking lot before dawn …It's what ICE does every day… and has been doing for many years.Their task this morning-- locate and arrest undocumented immigrants with criminal histories including assault, robbery, drug and gun convictions...… identified by ICE as a threat to public safetyMatt Elliston, director of ICE's Baltimore field office, told us the goal was to catch the first target by surprise..Cecilia Vega: You've been f-- watchin' him? He-- you know-- you know his routine?Matt Elliston: Yeah, we know his routine. We've been watchin' him for a couple days.Examining the mass deportation Trump vows to carry out if he wins the electionSure enough, a white van soon appeared to pick him up. But they didn't get very far…The man they arrested was a 24-year-old Guatemalan with an assault conviction, who had been ordered deported by a judge five years ago. The ICE agents discovered that the driver of the van was also in the country illegally. They told us he'd been deported once before.Matt Elliston: He has no criminal record. He was picking up his employee to go to work. It doesn't make sense to waste a detention bed on someone like that when we have other felons to go out and get today. Cecilia Vega: A lotta folks might hear you and say like, \"Hold on, you've got an undocumented immigrant who comes face-to-face with ICE, who's responsible for deporting folks from this country, and you let him go?\"Matt Elliston: We utilize immigration law to enhance public safety. It's not to just aimlessly arrest anyone we come across, right? We do targeted enforcement at ICE.It took a team of more than a dozen officers 7 hours to arrest six people …. and that doesn't include the many hours spent searching for them.Cecilia Vega: So how would it even be possible then for ICE to arrest a million people in this country if that mass deportation plan were to take effect?Matt Elliston: I could say here in Maryland, we would never be able to resource or find th-- find that amount of detention, which would be our biggest challenge. Right? And just the amount of money that that would cost in order to detain everybody-- you know, it be, you know, at-- at the Department of Defense level of financing.Jason Houser: It's insane to think about it at this sort of scale.: Jason Houser, ICE chief of staff during the first two years of the Biden administration, says it costs $150 a night to detain people like those we saw arrested. The average stay as they await deportation is 46 days. One deportation flight can cost a quarter of a million dollars. And that assumes the home country will accept them…. Many like Cuba and Venezuela rarely do.Cecilia Vega: ICE currently has some 6,000 law enforcement agents. How much manpower would it take to arrest and deport a million people?Jason Houser: You're talking, 100,000 official officers, police officers, detention officers, support staff, management staffTrump adviser Stephen Miller has said staff could come from other government agencies like the DEA. Jason Houser: The idea that you're gonna take the FBI, or the Marshal Service, or the Bureau of Prisons, or the Security Service, or FEMA off of their mission sets that protect-- and protect our communities will not make us safer.Immigration enforcement requires specialized training and language skills that most military and law enforcement officers don't have.Cecilia Vega: There's this discussion out there that makes it sound like it's just an easy swap.Matt Elliston: It is not an easy swap. So-- what I can tell you in, from the Immigration and Nationality Act, immigration law is second to the U.S. tax code in complexity Cecilia Vega: We have seen one estimate that says it would cost $88 billion to deport a million people a year.Tom Homan: I don't know if that's accurate or not.Cecilia Vega: Is that what American taxpayers should expect?Tom Homan: What price do you put on national security? Is it worth it? Cecilia Vega: Is there a way to carry out mass deportation without separating families?Tom Homan: Of course there is. Families can be deported together.Monica Camacho Perez and her family worry about that. They have lived and worked in the country since coming illegally from Mexico more than 20 years ago.Cecilia Vega: What scares you the most?Monica Camacho: I think of-- of my nieces and my nephews that they're gonna get separated from their parents. They made a life in Baltimore where Monica, who's 30, teaches English as a second language.Monica Camacho Perez: We are a normal family, like anybody else, right? We go to church. We work, every day. We pay taxesShe's among the more than 500,000 undocumented immigrants brought to the country as children who are protected from deportation under the Deferred Action for Childhood Arrivals program- known as DACA. Monica Camacho Perez: I'm the only one right now that's, like, protected, while my parents are not, my brothers are not. My brothers have-- children that are born here. So if they were to get deported, what will happen to their kids. Although I have my life here, I think that I would take the decision to go back with my parents, to take care of them.Cecilia Vega: You would?Monica Camacho Perez: Yes.Cecilia Vega: You own a home here. This is the city you grew up in.Monica Camacho Perez: But…They're also part of my American dream. And I can't imagine living here without them.Like Monica's nieces and nephews…more than 4 million U.S.-born children live with an undocumented parent.Cecilia Vega: Why should a child who is an American citizen have to pack up and move to a country that they don't know?Tom Homan: 'Cause their parent absolutely entered the country illegally, had a child knowing he was in the country illegally. So he created that crisisWhile Homan ran ICE -- in what became one of the most controversial policies of the Trump administration-- at least 5,000 migrant children were forcibly separated from their parents, who were prosecuted for crossing the border illegally.Cecilia Vega: You've been called the \"father of Trump's family separation policy.\" How does that sit with you?Tom Homan: Not true. I didn't write the memorandum to separate families. I signed the memo. Why'd I sign the memo? I was hopin' to save lives. While you and I are talkin' right now, a child's gonna die in the border. So we thought, maybe if we prosecute people, they'll stop comin'.And if Trump wins a second term?Tom Homan: I don't know of any formal policy where they're talkin' about family separations.Cecilia Vega: Should it be on the table?Tom Homan: It needs to be considered, absolutely.Cecilia Vega: Do you think a mass deportation plan would deter other people from coming to this country illegally?Monica Camacho Perez: No, I don't think so. Regardless, people are still going to try to come for a better life.Produced by Andy Court, Annabelle Hanflig, Camilo Montoya-Galvez. Broadcast associate, Katie Jahns. Edited by Craig Crawford.","summary":"Immigration experts say Donald Trump's mass deportation plan, if carried out, could be complicated and cost billions a year. It could also lead to more family separations.","url":"https://www.cbsnews.com/news/trump-mass-deportation-plan-cost-consequences-60-minutes-transcript/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/27/64543c48-a893-45b3-9051-b27c3433243b/thumbnail/1200x630/ff91452b3a038916c23f51d1d7632041/deportation-video-vega.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/10/27/2383457859787/3295299_hls/master.m3u8","publish_date":"2024-10-27 23:44:55","author":"Cecilia Vega","authors":["Cecilia Vega"],"language":"en","category":"politics","source_country":"US","sentiment":-0.13},{"id":261318924,"title":"China hacked audio from unnamed Trump campaign adviser","text":"Chinese state-affiliated hackers intercepted audio from the phone calls of US political figures including an unnamed campaign adviser of Republican presidential candidate Donald Trump, the Washington Post says.\n\nThe FBI and the US Cybersecurity and Infrastructure Security Agency said on Friday they were investigating unauthorised access to commercial telecommunications infrastructure by people associated with China.\n\nTrump's campaign and the FBI did not immediately respond to a request for comment.\n\nThe Post also reported the hackers were able to access unencrypted communications like text messages, of the individual.\n\nReuters reported on Friday that Chinese hackers also targeted phones used by people affiliated with the campaign of Democratic presidential candidate Kamala Harris.\n\nTrump and his running mate, JD Vance, were targeted, various media outlets reported last week.\n\nThe Trump campaign was made aware last week that Trump and Vance were among a number of people inside and outside of government whose phone numbers were targeted through the infiltration of Verizon phone systems, the New York Times reported Friday.\n\nThe Trump campaign was hacked earlier this year. The US Justice Department charged three members of Iran's Revolutionary Guard Corps with the hack, accusing them of trying to disrupt the November 5 election.\n\nVerizon said on Friday it was aware of a sophisticated attempt to target US telecoms and gather intelligence and is working with law enforcement.\n\nCongress is also investigating and earlier this month US lawmakers asked AT&T, Verizon and Lumen Technologies to answer questions about reports Chinese hackers accessed the networks of US broadband providers.\n\nThe Chinese embassy in Washington said last week it was unaware of the specific situation but said China opposes and combats cyber attacks and cyber thefts in all forms.","summary":"Phone calls of US political figures, including a campaign adviser of Donald Trump, have been hacked by people associated with China, the Washington Post says.","url":"https://thewest.com.au/politics/china-hacked-audio-from-unnamed-trump-campaign-adviser-c-16545108","image":"https://images.thewest.com.au/publication/C-16545108/b3fa6b8cefaacd5c692e5f6a9e59c13bbbf537da-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-10-27 23:44:14","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.489},{"id":261318836,"title":"China hacked audio from unnamed Trump campaign adviser","text":"Camera IconChinese state-affiliated hackers have intercepted audio from the phone of a Donald Trump staffer. (AP PHOTO) Credit: AAP\n\nChina hacked audio from unnamed Trump campaign adviser\n\nStaff WritersReutersOctober 28, 2024 7:44AM","summary":"Phone calls of US political figures, including a campaign adviser of Donald Trump, have been hacked by people associated with China, the Washington Post says.","url":"https://www.perthnow.com.au/politics/china-hacked-audio-from-unnamed-trump-campaign-adviser-c-16545106","image":"https://images.perthnow.com.au/publication/C-16545106/b3fa6b8cefaacd5c692e5f6a9e59c13bbbf537da-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-10-27 23:44:14","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"AU","sentiment":-1},{"id":261319964,"title":"Latin superstar Bad Bunny is supporting Harris for president","text":"Bad Bunny is throwing his support behind Vice President Kamala Harris by sharing a video of the Democratic presidential nominee to his more than 45 million followers on Instagram.\n\nBad Bunny, whose official name is Benito Antonio Martínez Ocasio, is one of the most famous artists of the moment. His backing could be a boost for the Harris campaign as it tries to bolster its support with Latino voters, among whom Trump has been working to gain ground. \n\nThe 30-year-old Puerto Rican reggaeton artist, who has popular songs such as “Dakiti” and “Titi Me Preguntó,” has won three Grammy Awards. He was the most streamed artist on Spotify in 2020, 2021 and 2022, and was only surpassed by Taylor Swift in 2023. He was named Artist of the Year by Apple Music in 2022.\n\nThe video shared by Bad Bunny on Instagram shows Harris saying “there’s so much at stake in this election for Puerto Rican voters and for Puerto Rico.” A representative of the artist confirmed that Bad Bunny is supporting Harris.\n\nThe artist then shared several times another part of the clip where Harris says, “I will never forget what Donald Trump did and what he did not do when Puerto Rico needed a caring and a competent leader,” she says.\n\nHis endorsement came shortly after a comedian who spoke at the opening of Trump’s rally at Madison Square Garden on Sunday called Puerto Rico a “floating island of garbage.” The remarks by comedian Tony Hinchcliffe were immediately criticized by Harris’ campaign and were also criticized by Puerto Rican star Ricky Martin, who was among the first to support Harris as she launched her presidential bid in July. \n\n“That's what they think of us,” Ricky Martin shared on Instagram, and encouraged followers to vote for Harris.\n\nThe Puerto Rican vote is sizable in Pennsylvania, which is arguably the hardest fought of the swing states in the 2024 election. Other Puerto Rican singers such as Jennifer Lopez and Marc Anthony had already expressed support for Harris. Trump has also attracted support from other popular stars from the island such as Anuel AA and Nicky Jam. \n\nBad Bunny has been vocal about criticizing Puerto Rico’s electric system, which was razed by Hurricane Maria. In a 2022 music video for his song “El Apagon,” the artist called out the company Luma Energy, which handles transmission and distribution, for the constant power outages that plague the island.\n\nOne of his most recent songs, “Una Velita,” is also a protest against the government response following Hurricane Maria in Puerto Rico in 2017. \n\nA year after the storm, public health experts estimated that nearly 3,000 perished because of the effects of Hurricane Maria. But Trump, whose efforts to help the island territory recover have been persistently criticized, repeatedly questioned that number saying it rose “like magic.”\n\nHis visit to the island after the hurricane elicited controversy such as when he tossed paper towels. His administration released $13 billion in assistance years later, just weeks before the 2020 presidential election. And a federal government watchdog found that officials hampered an investigation into delays in aid delivery.\n\nBad Bunny also shared a part of the clip showing Harris saying that Trump “abandoned the island, tried to block aid after back-to-back devastating hurricanes and offered nothing more than paper towels and insults.”\n\nHarris visited a Puerto Rican restaurant in North Philadelphia earlier on Sunday and released her policy related to the island saying she wants to create a task force to attract investment to fix the electrical grid. And Trump is headed on Tuesday to Allentown, Pennsylvania, where more than half of its population is Hispanic and a majority of them from Puerto Rico.\n\nIn 2020, Bad Bunny allowed the Biden campaign to use one of his hits “Pero Ya No” in a TV ad.","summary":"Bad Bunny is throwing his support behind Vice President Kamala Harris in the 2024 presidential election by sharing a video of the Democratic presidential nominee to his more than 45 million followers on Instagram","url":"https://www.independent.co.uk/news/world/americas/bad-bunny-ap-donald-trump-pennsylvania-puerto-rico-b2636581.html","image":"https://static.independent.co.uk/2024/10/27/23/Election_2024_Bad_Bunny_75059.jpg?width=1200","video":null,"publish_date":"2024-10-27 23:43:14","author":"Adriana Gomez Licon","authors":["Adriana Gomez Licon"],"language":"en","source_country":"gb","sentiment":0.079},{"id":261319380,"title":"Speakers at Trump’s event in Madison Square Garden harshly criticize Harris and Democrats.","text":"NEW YORK — Several of Donald Trump ‘s allies used crude and extreme rhetoric Sunday toward Vice President Kamala Harris and other Trump critics before the former president was to take the stage at New York’s Madison Square Garden.\n\nTrump’s childhood friend David Rem referred to the Democratic presidential candidate, who is vying to become the first woman to be elected president, as “the Antichrist” and “the devil.” Businessman Grant Cardone told the crowd that Harris ”and her pimp handlers will destroy our country” before saying, of Democrats, “we need to slaughter these other people.”\n\nThe opening of the rally was a hodgepodge of Trumpism, with an extended clip played from the 1970 film “Patton,” a painting of the American flag with Trump in front of it as “God Bless America” blared from the speakers, and a stand-up routine from comedian Tony Hinchcliffe that was full of lewd jokes, often invoking racist stereotypes of Latinos, Jews and Black people.\n\n“I don’t know if you guys know this, but there’s literally a floating island of garbage in the middle of the ocean right now. I think it’s called Puerto Rico,” said Hinchcliffe, whose joke was immediately flagged by Harris’ campaign as it competes with Trump to win over Puerto Rican communities in Pennsylvania and other swing states.\n\nWith just over a week to go before Election Day, the former president was to the stage Sunday at one of the country’s most well-known venues, hosting a hometown rally to deliver his campaign’s closing message against Harris.\n\nWhile some Democrats and pundits have questioned Trump’s decision to hold what they dismiss as a vanity event in his hometown, the rally guarantees Trump what he most craves: the spotlight, wall-to-wall coverage and a national audience.\n\nThe closing message he will deliver Sunday, according to his campaign, is that Harris “broke” the country and that Trump “will fix it.” Rallygoers hours beforehand waved signs with the words “Trump will fix it.”\n\nSeveral speakers ripped Hillary Clinton, the Democrat defeated by Trump eight years ago, for saying Trump on Sunday would be “reenacting” a pro-Nazi event at the Garden in February 1939. One critic, radio host Sid Rosenberg, used a profanity to denounce the former secretary of state.\n\n“Hey guys, they’re now scrambling and trying to call us Nazis and fascists,” said Alina Habba, one of Trump’s attorneys, who draped a sparkly “MAGA” jacket over the lectern as she spoke. “And you know what they’re claiming, guys? It’s very scary. They’re claiming we’re going to go after them and try and put them in jail. Well, ain’t that rich?”\n\nTrump has denounced the four criminal indictments brought against him as politically motivated. He has ramped up his denunciations in recent weeks of “enemies from within,” naming domestic political rivals, and suggested he would use the military to go after them. Harris, in turn, has called Trump a “fascist.”\n\nThe arena was full hours before Trump was scheduled to speak. Outside the arena, the sidewalks were overflowing with Trump supporters in red “Make America Great Again” hats. There was a heavy security presence. Streets were blocked off and access to Penn Station was restricted.\n\nIn the crowd was Philip D’Agostino, a longtime Trump backer from Queens, the borough where Trump grew up. The 64-year-old said it was appropriate for Trump to be speaking at a place bills itself as “the world’s most famous arena.”\n\n“It just goes to show ya that he has a bigger following of any man that has ever lived,” D’Agostino said.\n\nThe rally is one of a series of detours Trump has made from battleground states, including a recent rally in Coachella, California — best known for the famous music festival named after the town — and one in May on the Jersey Shore. This summer he campaigned in the South Bronx.\n\nTo reach them, Trump has spent hours appearing on popular podcasts. And his campaign has worked to create viral moments like his visit last weekend to a McDonald’s restaurant, where he made fries and served supporters through the drive-thru window. Video of the stop posted by his campaign has been viewed more than 40 million times on TikTok alone.\n\nHarris has also traveled to non-battleground states for major events intended to drive a national message. She appeared in Houston Friday with music superstar Beyoncé to speak about reproductive rights, and will deliver her own closing argument Tuesday from the Ellipse in Washington, where Trump spoke ahead of the Jan. 6, 2021 Capitol riot.\n\nTrump will be joined at the rally by supporters including Tesla and SpaceX CEO Elon Musk, who has spent tens of millions of dollars to boost his campaign.\n\nTrump often compares himself to the country’s greatest entertainers. The former reality TV star has long talked about wanting to hold a rally at the venue in interviews and private conversations.\n\nBeyond the national spotlight and the appeal of appearing on one of the world’s most famous stages, Republicans in the state say the rally will also help down-ballot candidates. New York is home to a handful of competitive congressional races that could determine which party controls the House next year.\n\nTrump will also use the stop as a major fundraising opportunity as he continues to seriously lag Harris in the money race.\n\nNew York has not voted for a Republican for president in 40 years. But that hasn’t stopped Trump from continuing to insist he believes he can win.\n\nTrump routinely uses his hometown as a foil before audiences in other states, painting a dark vision of the city that bears little resemblance to reality. He’s cast it as crime-ridden and overrun by violent, immigrant gangs who have taken over Fifth and Madison avenues and occupied Times Square.\n\nTrump has a complicated history with the place where he built his business empire and that made him a tabloid and reality TV star. Its residents indicted him last year on 34 felony counts of falsifying business records. He was found guilty in that case, and also found liable in civil court for business fraud and sexual abuse.","summary":"With just over a week to go before Election Day, the former&#8230;","url":"https://internewscast.com/news/speakers-at-trumps-event-in-madison-square-garden-harshly-criticize-harris-and-democrats/","image":null,"video":null,"publish_date":"2024-10-27 23:39:52","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":261321364,"title":"China hacked audio from unnamed Trump campaign adviser","text":"Chinese state-affiliated hackers intercepted audio from the phone calls of US political figures including an unnamed campaign adviser of Republican presidential candidate Donald Trump, the Washington Post says.\n\nThe FBI and the US Cybersecurity and Infrastructure Security Agency said on Friday they were investigating unauthorised access to commercial telecommunications infrastructure by people associated with China.\n\nTrump’s campaign and the FBI did not immediately respond to a request for comment.\n\nThe Post also reported the hackers were able to access unencrypted communications like text messages, of the individual.\n\nReuters reported on Friday that Chinese hackers also targeted phones used by people affiliated with the campaign of Democratic presidential candidate Kamala Harris.\n\nTrump and his running mate, JD Vance, were targeted, various media outlets reported last week.\n\nThe Trump campaign was made aware last week that Trump and Vance were among a number of people inside and outside of government whose phone numbers were targeted through the infiltration of Verizon phone systems, the New York Times reported Friday.\n\nThe Trump campaign was hacked earlier this year. The US Justice Department charged three members of Iran’s Revolutionary Guard Corps with the hack, accusing them of trying to disrupt the November 5 election.\n\nVerizon said on Friday it was aware of a sophisticated attempt to target US telecoms and gather intelligence and is working with law enforcement.\n\nCongress is also investigating and earlier this month US lawmakers asked AT&T, Verizon and Lumen Technologies to answer questions about reports Chinese hackers accessed the networks of US broadband providers.\n\nThe Chinese embassy in Washington said last week it was unaware of the specific situation but said China opposes and combats cyber attacks and cyber thefts in all forms.","summary":"Chinese state-affiliated hackers intercepted audio from the phone calls of US political figures including an unnamed campaign adviser of Republican presidential candidate Donald Trump, the Washington Post says. The FBI and the US Cybersecurity and Infrastructure Security Agency said on Friday they were investigating unauthorised access to commercial telecommunications infrastructure by people associated with China. [&#8230;]","url":"https://www.fbcnews.com.fj/world/china-hacked-audio-from-unnamed-trump-campaign-adviser/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2024/10/China-hacked-audio-from-unnamed-Trump-campaign-adviser.jpg","video":null,"publish_date":"2024-10-27 23:37:57","author":"The North West Star],Timoci Batibasaga","authors":["The North West Star]","Timoci Batibasaga"],"language":"en","category":"politics","source_country":"fj","sentiment":-0.489},{"id":261320288,"title":"Trump promises not to fight foreign wars","text":"Former US President Donald Trump has promised not to send Americans to fight and die in countries they have never even heard of while addressing a crowd in the battleground state of Pennsylvania this weekend.\n\nSpeaking at a campaign rally on Saturday, Trump once again claimed he is the only one capable of preventing all-out global conflict, arguing that his Democratic rival Kamala Harris “would get us into World War III guaranteed because she is too grossly incompetent to do the job.”\n\n“To make her president would be to gamble with the lives of millions of people. Sons and daughters will end up getting drafted to fight in a war in a country you’ve never heard of,” he said.\n\nIn his nomination acceptance speech earlier this year, Trump vowed to “end every single international crisis that the current administration has created,” particularly the Ukraine and Gaza conflicts. He never offered specific plans to bring about world peace but repeatedly warned that by supporting and financing “other people’s wars” under the leadership of President Joe Biden and Vice President Kamala Harris, the US is increasing the likelihood of sliding into WWIII.\n\nLast week, Trump claimed on his Truth Social platform that “if Kamala gets four more years, the Middle East will spend the next four decades going up in flames, and your kids will be going off to war.”\n\n“But I will not send you to fight and die in a foolish, never-ending foreign war,” he told the crowd on Saturday.\n\nYou don't have to send your kids out to war, have your kid blown up for a country that you've never heard of, and that doesn’t want anything to do with you anyway.\n\nThe Republican has repeatedly promised to end the Ukraine conflict within 24 hours of being elected, before even being sworn into office, by forcing both sides into negotiations.\n\nHarris, a staunch supporter of Ukraine, has criticized Trump’s approach, claiming he would essentially force Kiev to surrender. The Kremlin has cast doubt on Trump’s promises of peace, with spokesman Dmitry Peskov suggesting that he does not “think there is a magic wand” that can stop the fighting overnight.\n\nTrump also claimed that he could have prevented last year’s October 7 Hamas incursion into Israel, telling podcaster Joe Rogan that when he was president, he made sure Tehran had no money to fund its proxies.","summary":"Former US President Donald Trump has promised not to send Americans to fight and die in countries they have never even heard of \nRead Full Article at RT.com","url":"https://www.rt.com/news/606592-trump-us-foreign-wars/","image":"https://mf.b37mrtl.ru/files/2024.10/article/671ecda885f540607c5837d4.jpg","video":null,"publish_date":"2024-10-27 23:37:03","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.403},{"id":261320364,"title":"Louis Tomlinson's lookalike son Freddie, eight, is the spitting image of the One Direction star as he makes rare appearance in family TikTok video","text":"Kim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nMonday, Oct 28th 2024\n\n5-Day Forecast\n\nAdvertisement\n\nStrictly stars and fans rally behind Amy Dowden as she is forced to miss results show after collapsing backstage: Drama comes eight months after dancer revealed she was cancer-free after a year of gruelling treatment\n\nLabour MP Mike Amesbury is quizzed by police and suspended after sucker-punching constituent and beating him while he lay on the ground: Mail's shocking exclusive CCTV shows moment attack unfolded after politician claimed man 'threatened' him\n\nTV soap star arrested on suspicion of sexually abusing FIVE underage boys: Police swarm home and seize computers after accusations against man who's worked with 'some of Britain's most famous names'\n\nCompensation could be given to thousands left 'disabled' by the AstraZeneca Covid jab\n\nNIALL FERGUSON: Why Kamala Harris poses a greater threat to democracy - both at home and abroad - than Donald Trump\n\nHow Ozempic could cure common leg problem one in ten women suffer... as some say NHS should pay for 'remarkable' drug\n\nNew blow for businesses as Rachel Reeves is set to announce a mega inflation-busting hike in the minimum wage during the Budget\n\nIndia-born paedophile who was jailed for distributing child sex abuse images CAN'T be deported from the UK - as it would be 'too harsh' on HIS children\n\nGino D'Acampo slams English Christmas tradition as he criticises Britons for eating 'the worst meal in the world'\n\nMelania Trump stuns Madison Square Garden with her first rally appearance ever to introduce husband Donald\n\n'Thugs and criminals' involved in the violent Southport riots should expect up to a decade in prison, Labour MP Mike Amesbury said just weeks before he sucker-punched and beat a man on the street\n\nFury as NHS tells its staff that women are 'transphobic' if they do not want not to share a bathroom with a transgender colleague\n\nI'm regularly visited by my dad who gives me life advice - but he's been dead for 40 years\n\nLouis Tomlinson's lookalike son Freddie, eight, is the spitting image of the One Direction star as he makes rare appearance in family TikTok video\n\nAlmost six decades after spinning his first disc, Johnnie Walker bids a heart-rending farewell to BBC Radio 2: CHRISTOPHER STEVENS listens in to the terminally ill veteran DJ's emotional final show\n\nDEAR JANE: I gave my husband a 'hall pass'... but then he slept with the one person I wish he hadn't\n\nThe six products you must own if you're over 60: YOU editor JACKIE ANNESLEY reveals the insider's guide to the best line-smoothing and face-flattering secrets\n\nWe sold our homes and everything in them to live on cruise ships - we've figured out a system to afford it\n\nKEMI BADEONOCH: Labour is driven only by ideological fervour - it has no vision for our schools and universities\n\nIndian business tycoonleaves large chunk of his £91million fortune to his DOG: Ratan Tata asks for 'unlimited care' for his beloved hound after he died ages 86\n\nThe Grinning gangster: Why Kinahan Cartel henchmansmiled as he was jailed for machine gun plot\n\nOur fashion expert's supermarket picks for winter from just £12 - you'll never guess where the party season's best £20 skirt is from!\n\nUK weather map shows where snow could strike - but only after Britain feels as hot as Spain in mini-heatwave\n\nEddie Redmayne reveals his secret trick to avoid being recognised as he gives rare insight into his quiet family life with wife Hannah and their two children Iris, eight, and Luke, six\n\nLouis Tomlinson's lookalike son Freddie, eight, is the spitting image of the One Direction star as he makes rare appearance in family TikTok video\n\nHave YOU got a story? Email tips@dailymail.com \nBy Lily Jobson For Mailonline \n Published:23:09 GMT, 27 October 2024 |Updated:23:36 GMT, 27 October 2024 \n\nLouis Tomlinson's son Freddie looked the spitting image of the former One Direction star as he made a rare appearance in a family TikTok video.\nEight-year-old Freddie could be seen with his long blond hair enjoyed a day out with his aunties, Louis' twin sisters Phoebe and Daisy Tomlinson, in Los Angeles.\nLouis, 32, who shares Freddie with his ex Briana Jungwirth, also 32, welcomed their son in 2016, following a brief fling.\nGobsmacked fans couldn't believe how grown up Freddie has got and said how similar he and Louis now look.\nIn the video, Daisy documented their trip to get frozen yogurt with Phoebe and her 9-month-old daughter Olive.\n\nLouis Tomlinson's son Freddie, eight, looked the spitting image of the former One Direction star, 32, as he made a rare appearance in a family TikTok video\nIn the video, Daisy said: 'Me, Phoe, Freddie and Rach headed out to Pinkberry. We really fancied one, so I thought, \"Let’s go!\"'\nIn the comments some fans wrote: 'Freddie got so big', 'HELP HE WALKS LIKE LOUIS', 'freddy is definitely louis twin', 'freddy is a mini louis'.\nLouis' other sister Lottie Tomlinson also shared a video on Instagram of her son Lucky playing with Freddie in the swimming pool on holiday earlier this month.\nFollowing Louis' One Direction bandmate Liam Payne's tragic death on October 16, Louis shared a heartbreaking tribute to his bandmate.\nLiam tragically fell to his death from a third-floor balcony in Argentine capital Buenos Aires, aged just 31. \nIn a statement shared to Instagram, Louis said he was 'beyond devastated' by his friend's death, and said that he will 'always be an uncle' for the late singer's eight-year-old son Bear.\n'I am beyond devastated to be writing this but yesterday I lost a brother. Liam was somebody I looked up to everyday, such a positive, funny, and kind soul.\n'I first met Liam when he was 16 and I was 18, I was instantly amazed by his voice but more importantly as time went on I got a chance to see the kind brother I'd longed all my life for.\n\nLouis, who shares Freddie with his ex Briana Jungwirth, also 32, welcomed their son in 2016, following a brief fling (Louis pictured with Freddie in 2016)\n\nGobsmacked fans couldn't believe how grown up Freddie has got and said how similar he and Louis now look\n\nLouis' other sister Lottie Tomlinson also shared a video on Instagram of her son Lucky (L) playing with Freddie (R) in the swimming pool on holiday earlier this month\n\nFollowing Louis' One Direction bandmate Liam Payne's tragic death on October 16, Louis shared a heartbreaking tribute to his bandmate (pictured together in 2015) \n\nIn a statement shared to Instagram, Louis said he was 'beyond devastated' by his friend's death, and said that he will 'always be an uncle' for the late singer's eight-year-old son Bear\n\nOne Direction shot to fame on the X Factor in 2010 and became Britain's biggest pop group since The Beatles\n'Liam was an incredible song writer with a great sense of melody, we often spoke of getting back in the studio together to try and recreate the writing chemistry we had built up in the band.\n'And for the record, Liam was in my opinion the most vital part of One Direction. His experience from a young age, his perfect pitch, his stage presence, his gift for writing. The list goes on. Thank you for shaping us Liam.\n'A message to you Liam if you're listening: I feel beyond lucky to have had you in my life but I'm really struggling with the idea of saying goodbye. \n'I'm so grateful that we got even closer since the band, speaking on the phone for hours, reminiscing about all the thousands of amazing memories we had together is a luxury I thought I'd have with you for life. \n'I would have loved to share the stage with you again but it wasn't to be.\n'I want you to know that if Bear ever needs me I will be the Uncle he needs in his life and tell him stories of how amazing his dad was.\n'I wish I got chance to say goodbye and tell you one more time how much I loved you. Payno, my boy, one of my best friends, my brother, I love you mate. Sleep well X.'\nLouis shared the moving post along with a snap of himself and Liam performing together in 2015, before One Direction announced their hiatus the following year.\n\nShare or comment on this article: \nLouis Tomlinson's lookalike son Freddie, eight, is the spitting image of the One Direction star as he makes rare appearance in family TikTok video\n\nAdd comment\n\nEnter search term:\n\nStrictly stars and fans rally behind Amy Dowden as she is forced to miss results show after collapsing backstage:\n\nNewly-engaged Georgia Toffolo flashes her dazzling diamond ring in fun snaps after BrewDog founder James Watt popped the question\n\nJennifer Lopez enjoys dinner with vocal coach Stevie Mackey and her twins Emme and Max, 16\n\nEXCLUSIVEI don't feel old, says FERN BRITTON, but the thought of starting a new relationship in my 60s is terrifying\n\nTimothée Chalamet sparks chaos as he shows up to his OWN lookalike event - before cops swoop and make arrests\n\nEXCLUSIVEFancy bagging a bargain holiday from just 1p? You can bid for next year's break for a fraction of the cost - here's how!\n\nStrictly insiders fear Amy Dowden could QUIT show after dancer collapsed backstage and was rushed to hospital in front of her concerned co-stars\n\nWhy I promised to cover up the last secret the tormented 'fifth Beatle' took to his grave, reveals biographer PHILIP NORMAN\n\nEXCLUSIVECelebrity SAS: Who Dares Wins' Jason Fox reveals which 'useless' star managed to win him over and become the 'biggest standout'\n\n'Talking about our finances made us feel more in control': How opening up about money helped one couple plan for the future\n\nLouis Tomlinson's lookalike son Freddie, eight, is the spitting image of the One Direction star as he makes rare appearance in family TikTok video\n\nFears Nicole Kidman is going to suffer a 'burnout' as she 'throws herself into even more work' and signs on to another release to deal with her grief over losing her mother\n\nPete Wicks reveals he's had a 'tough week' as he makes it through to Strictly Icons week with Jowita Jzystal after Maura Higgins confirms their romance\n\nWho left Strictly Come Dancing? Dr Punam Krishan is voted off after receiving the lowest results and landing in the dance-off against Shayne Ward\n\n'It's now dramatic and fun - we love it': Watch as one family's ugly and unloved little downstairs loo becomes a stylish 'maximalist' cloakroom\n\nEddie Redmayne reveals his secret trick to avoid being recognised as he gives rare insight into family life with two children Iris, eight, and Luke, six\n\nNewly-engaged Holly Ramsay looks incredible as she displays her toned abs in a pink bikini while soaking up the sun in Greece\n\nMolly-Mae Hague shows off her impressive Irish dancing moves in a fun new video as she attends her dance school reunion\n\nMadonna, 66, turns heads in a sexy sheer dress and a black leather coat as she steps out in Paris\n\nSuper soft hair in three easy steps: Simple routine provides up to 7x* more moisture for up to 72 hours**\n\nBBC Radio 2 listeners in tears as terminally ill DJ Johnnie Walker, 79, bids farewell in emotional final show\n\nTV soap star arrested on suspicion of sexually abusing FIVE underage boys: Police swarm home and seize computers \n\nBruce Willis smiles and dons Dodgers cap on drive with bodyguard in LA amid aphasia and dementia battle\n\nHollyoaks heart-throb returns after 10 years and has already started filming for his permanent comeback\n\nStaying flexible in older age: How we think about people over 60 'should be challenged', says TV star Angela Rippon\n\nAmy Dowden misses Strictly results show after being rushed to hospital in 'medical emergency' leaving her dance partner JB Gill standing solo\n\nClarkson's Farm star Kaleb Cooper reveals he is on a strict diet after 'receiving a message in a dream' following Jeremy Clarkson's recent health scare\n\nColin Farrell breaks down as he completes Dublin City Marathon with Emma Fogarty in emotional bid to raise money for people with her skin condition\n\nMegan McKenna shares honest update on breastfeeding and her postpartum body with candid photos three weeks after welcoming first child\n\nFrightfully delicious! Put the treat into trick-or-treating during dinner time this Halloween\n\nThe reason Taylor Swift isn't attending Travis Kelce's Chiefs vs Raiders game\n\nKatie Price's ex-fiance Carl Woods reveals how she REALLY broke both of her feet and ended up wheelchair bound back in 2020\n\nHer mother played Tom Cruise's lover and her father was in a big disco movie in the '70s (and he can fly planes) - who is she?\n\nEXCLUSIVESelling Sunset's Chrishell Stause takes on exciting hosting role on popular 'throuple' dating show Love Triangle\n\nRiviera glamour, Ibiza nightlife and the most stylish ships at sea: Why THIS is the ultimate cruise for your adults-only Mediterranean escape\n\nRecap the Strictly Come Dancing results show as Dr Punam Krishan becomes latest celebrity to be eliminated in Halloween week as Shayne Ward survives dance off\n\nVenom: The Last Dance wins box office with $51 million ahead of the Halloween holiday\n\nEXCLUSIVEGeorgia Toffolo is engaged! Former Made In Chelsea star accepts marriage proposal from millionaire BrewDog founder James Watt \n\nStrictly Come Dancing star Amy Dowden is rushed to hospital in 'medical emergency' after collapsing backstage at live show \n\nHow understanding your glucose levels can help you feel less tired after meals\n\nColeen Rooney reveals her biggest fashion faux pas and the item of clothing she couldn't live without as she takes fans inside her wardrobe\n\nAdele is left temporarily DEAF in one ear after suffering from an agonising infection which she claims was 'more painful than childbirth'\n\nI was on Big Brother - bosses intervened if this secret rule was broken and we couldn't believe the dramatic moments they cut from the show\n\nOlivia Bowen puts on a leggy display in a tweed blazer and mini skirt as she attends The Baby Show in London\n\nCalling all DIY newbies! THIS is the easiest and most effective way to update your interiors - and it won't blow the budget\n\nSophie Turner pays tribute to boyfriend Peregrine Pearson on his milestone 30th birthday as actress shares previously unseen pictures\n\nStrictly Come Dancing result is leaked yet AGAIN - leaving fans 'shocked' and 'devastated' \n\nGino D'Acampo slams English Christmas tradition as he criticises Britons for eating 'the worst meal in the world'\n\nKaia Gerber puts on a leggy display in pleated skirt as she departs Billie Eilish's Halloween bash\n\nFrom fashion to fragrance and the coolest new tech! Make Christmas sparkle with our ultimate gift guide\n\nPaddy McGuinness is in great spirits as he strolls out of his BBC Radio 2 show after leaving ex wife Christine 'devastated' with divorce jokes during his new tour\n\nBrad Pitt surprises fans with Mexican Grand Prix appearance as he films scenes for F1 movie\n\nJack Whitehall and Roxy Horner channel their Halloween spirit as they transform into the Joker and notorious Australian Olympic breakdancer Raygun\n\nThe emotional moment Adele bursts into tears as she spots Celine Dion in the audience at her Las Vegas residency\n\nLaundry legend or sock-shrinking disaster? Share this quiz with your loved ones so they can identify their bad household habits - and change them for good!\n\nJermaine Jenas returns to punditry at Arsenal's clash with Liverpool - just two months after being sacked from £190,000 job by the BBC\n\nM. Night Shyamalan dons hair-raising Joker costume for his 'Shyamaween' Halloween party\n\nKelsea Ballerini 'loves' how proud boyfriend Chase Stokes is of their relationship\n\nSecret signs Nicole Kidman has always been Hollywood's biggest diva\n\nHer curated image came crashing down recently\n\nLooking to refresh your space before winter? Transform your home and interiors with these 10 top must-know brands\n\nOlivia Attwood's wild transformation: How the peroxide blonde Love Island star has gone from cosmetic surgery fan to exposing the beauty industry \n\nCruz Beckham, 19, puts on adorable display with girlfriend Jackie Apostel, 29, as he twirls her around on a stroll through Miami\n\nQueen Camilla's son Tom Parker Bowles recalls embarrassing gaffe he made while meeting Queen Elizabeth II for the first time aged 8\n\nSharon Horgan says there is life after divorce as she reveals her brood is a 'bit of a circus family' as she juggles acting and parenting\n\nDreaming of looking naturally radiant all the time? Here's how you can do it\n\nBlake Lively and Ryan Reynolds attend BFF Taylor Swift's New Orleans concert for a second night\n\nStepping out \n\nThe Netflix series axed before their time - how streamer cancelled string of shows with whopping Rotten Tomatoes scores against all odds\n\nKatie Price sparks confusion as she shares photo cuddling newborn baby boy after 'welcoming twins'\n\nEXCLUSIVETV presenter Naomi Isted, 45, claims she was 'told to have an unnecessary hysterectomy' while battling health woes \n\nLooking to manage your weight more effectively and feel fuller for longer? Celebrity nutritionist Gabriela Peacock's Fibre supplements can help\n\nNetflix horror movie is so terrifying viewers are unable to finish it\n\nNetflix fans have expressed their fear over one horror movie\n\nWhat HAS happened to Lady Gaga's face? Cosmetic doctors give verdict on star's 'secret' plastic surgery\n\nAll change \n\nThe real reason we can't get enough of TV shows about middle-aged men on road trips\n\nHugh Dennis and David Baddiel are the latest celebrity pairing\n\nDani Dyer admits the transition from being a mother of one was 'overwhelming' after she welcomed twins with West Ham United star Jarrod Bowen\n\nHave YOU suffered hair loss? Here's the science-backed solution experts are raving about\n\nShirley Ballas cuts an elegant figure in cream coat during charity event at Heathrow after Amy Dowden was rushed to hospital\n\nPregnant Stephanie Davis rushed to A&E after being left struggling to breathe as she admits 'it's killing me'\n\nEXCLUSIVEI'm Ernest Hemingway's granddaughter: Liam Payne's tragic death is a reminder of demons that killed my family\n\nIs this the reason behind Andy Caroll and Billi Mucklow's split? Friends claim footballer and Lou Teasdale were in contact before the break-up\n\nCommunication is key, so here's how to build strong relationships with your colleagues\nAdvertising\n\nMalia and Sasha Obama party it up in Hollywood dressed in Wild West costumes at Billie Eilish's Halloween bash\n\nEXCLUSIVESecrets of Prince William's 'rugged rebrand': How future King went from balding dad to hot heir - thanks to new trainers and THAT stubble\n\nTV presenter, 59, is unrecognisable in a throwback snap from his younger days - can YOU guess who it is?\n\nAngelina Jolie debuts curly hairdo at screening of her new film Maria after trailer set off Oscar buzz\n\nWould YOU swap wine for the new viral carbonated calm drink? It's filled with 'mood-boosting' botanicals and adaptogens\n\nBroadcaster Emma Freud forced to apologise due to blunder live on air\n\nAll the times Joe Lycett has discussed his dating life, from coming to terms with being pansexual to getting a serious girlfriend\n\nMartin Clunes reveals he built a coffin for his Jack Russell while it was still alive after his beloved pet was diagnosed with cancer\n\nEXCLUSIVEEerie footage that terrified Saw director while filming inside ancient haunted house\n\nFuller hair in weeks? 'Obsessed' shoppers praise this hair foam for its impressive results: 'Thin patches on my scalp are now thickening'\n\nRivals star Aidan Turner says he threw himself into racy sex scenes with co-star Victoria Smurfit - as he admits it's 'like doing a dance' \n\nLiam Payne fans call for memorial to be erected in his honour in One Direction star's home city after he fell to his death from hotel balcony\n\nStrictly Come Dancing fans left in stitches after witnessing 'absolutely PERFECT' moment on the BBC dance show\n\nPrince William's olive branch to Harry: Prince of Wales publicly names his brother for the first time in six years as he pays fond tribute to their mother Diana\n\nJoe Lycett reveals exactly what he wants from an ideal partner in unearthed interview - as notoriously private comedian stuns fans by confirming he's a dad \n\nEXCLUSIVEGillian Anderson, 56, looks sensational as she showcases toned midriff in a black bikini during Mexico getaway\n\nKing Charles emotionally says he 'hopes he survives long enough to return' after heartwarming ceremony in Samoan village \n\nStrictly bosses 'move Pete Wicks and Jowita Przystal to different training room after they bumped into her ex Giovanni Pernice\n\nHeir come the hecklers! Awkward moments royals were confronted by public - including woman who told Kate: 'Ireland belongs to the Irish'\n\nChristine McGuinness is 'devastated' after ex husband Paddy 'takes a swipe at her' just minutes into his new stand-up comedy show'\n\nNicole Kidman cosies up to Keith Urban at Concert For Carolina benefit show after shock orgasm confession\n\nEXCLUSIVEEric Bana's model daughter Sophia makes her runway debut during Melbourne Fashion Week\n\nAnother neop-baby \n\nJennifer Lopez shows off legs amid Ben Affleck divorce at photo call for their film Unstoppable\n\nLooking good \n\nIs Nicole Kidman Hollywood's ultimate cougar? Actress's latest movie Babygirl sees her star opposite youngest love interest yet\n\nHe's a TV nepo-baby with an actor dad and BBC star mum who has just announced his new project - can YOU guess who his parents are?\n\nDanny Dyer reveals his family were driven out of their home by their 'crazy' neighbours who 'resented' living near him\n\nMadonna, 66, looks unrecognizable in a head scarf and coat while out with boyfriend Akeem Morris, 28, in NYC\n\nTaylor Swift and Sabrina Carpenter team up for a surprise duet of Espresso during New Orleans Eras Tour stop\n\nJoining forces \n\nSpringwatch star Kate Humble says women who undergo makeover transformations can 'turn into sex dolls'\n\nTaylor Swift gives special nod to boyfriend Travis Kelce during Eras Tour concert in New Orleans\n\nPippa Middleton and her husband James Matthew embroiled in village row over the use of a footpath at £15million country estate\n\nSelena Gomez and Benny Blanco debut their first couple's costume ahead of Halloween\n\nKate Beckinsale posts photos of series of gruesome injuries as fans share concern for the actress\n\nEXCLUSIVETom Hiddleston shows off his guns as he flaunts action-hero attributes on set of second series of The Night Manager in Barcelona\n\nTaylor Swift unveils new koi fish inspired dress during surprise song set at New Orleans Eras Tour stop\n\nRebekah Vardy WILL be tuning in to watch Wagatha Christie rival Coleen Rooney on I'm A Celebrity - but only when she is tackling gross trials\n\nRumer Willis says sister Tallulah's autism diagnosis 'gave her permission to be exactly who she is'\n\nOpening up \n\nCarol Vorderman 'confirms' Joe Lycett has become a father after fans shared 'prank' theories - as celebs inundate star with messages\n\nStrictly Come Dancing's JB Gill shares his desire to pay tribute to Liam Payne on the BBC show after One Direction star's tragic death\n\nReese Witherspoon is 'having fun' dating Oliver Haarmann and 'loves' that he's 'not into Hollywood'\n\nStrictly Come Dancing recap: Sarah Hadland and Vito Coppola top the leaderboard as the BBC contest is embroiled in fix rows \n\nPatrick Dempsey in talks to return as Detective Mark Kincaid for Scream 7 after 20-plus year hiatus\n\nRecurring role \n\nRita Ora and Taika Waititi enjoy World Series double date with Jon Hamm and wife as celebs watch Yankees-Dodgers\n\nSaoirse Ronan reveals she would love to play a Bond villain opposite her husband Jack Lowden as 007 - who is tipped to play the iconic role\n\nCorrie star reveals his shocking family ties to real-life cult that helped him prepare for soap role\n\nTaylor Swift once said Diddy was among her dream prom dates in resurfaced 2011 interview: 'He's always been very nice to me'\n\nStrictly Come Dancing embroiled in favouritism row after judges are accused of 'over marking' and giving one couple 'preferential treatment'\n\nSaturday Kitchen viewers are left outraged by guest's 'inappropiate' outfit: 'She changed into that to cook?'\n\nMatthew Perry's Pacific Palisades mansion sells for $8.5M - one year after his tragic ketamine death\n\nBella Hadid proudly shows off first champion buckle while posing with her horse Metallic Tito\n\nColdplay's Music of the Spheres tour set list leaked ahead of their Australian tour\n\nFans may already have a sneak peek \n\nTravis Kelce and Chiefs touch down in Las Vegas for Raiders showdown - as Taylor Swift continues Eras Tour\n\nDiana Vickers turns head as she transforms into a VERY sexy Victoria Secret Angel for Halloween bash\n\nDua Lipa gets roasted over her stripped-down Tiny Desk performance: 'This hurt my ears'\n\nStrictly Come Dancing fans go into meltdown as Nikita Kuzmin steps out in a VERY racy outfit wearing stockings and suspenders\n\nStrictly's Wynne Evans laughs off controversy by dressing as the devil for Halloween week - but fans claim he was 'missing'\n\nJames Franco says he has 'changed' following sexual assault allegations: 'Being told you're bad is painful'\n\nWill Miranda Hart follow in her co-star Sarah Hadland's dance steps and waltz on to the next series of Strictly Come Dancing?\n\nRaygun keeps folder of her own memes on her phone: 'I've got a digital pool room'\n\nMegyn Kelly leaves audience stunned as she describes horror of transgender surgeries to Bill Maher\n\nStrictly Come Dancing viewers all share the same complaint over Shirley Ballas' Hocus Pocus Winifred Sanderson Halloween costume\n\nMichelle Obama fights through tears as she discusses 'debilitating' health journey\n\nKacey Musgraves says her dog Pepper saved her from stepping on venomous Timber Rattlesnake barefoot\n\nProtective pup \n\nPrince William says he's started talking about homelessness to his children so they're not in 'their own little worlds'\n\nLizzo dresses as Ozempic for Halloween after denying taking the weight loss drug to slim down\n\nTALK OF THE TOWN: JK Rowling's role on new Harry Potter TV series... in a chamber of secrets\n\nAmber Rose accuses Beyonce of COPYING her speech after Kamala Harris rally\n\nIs Gwyneth Paltrow's Goop on the droop? As Hollywood A-lister returns to making movies, her wellness empire has suffered setbacks\n\nRicky Martin, 52, sends pulses racing in shirtless thirst trap as he shows off physique in steamy selfie\n\nNicole Kidman looks thinner than ever after previously sparking concern over 'incredibly skinny' appearance\n\nEXCLUSIVEBinky Felstead on life Beyond Chelsea: As she prepares to open up like never before on 'raw' new show, and how she overcame TV heartbreak\n\nJamie Lang looks as loved-up as ever with his stylish wife Sophie Habboo as they attend reality TV event\n\nThe former Made In Chelsea stars put on a loved-up display as they attended the first-ever reality TV event, Hayu FanFest.\n\nLucas Bravo shades Emily in Paris as he insists the show doesn't 'stimulate' him as an actor\n\nAmy Adams, 50, reveals why she felt 'so vulnerable and exposed' during her early 'naive' years in Hollywood\n\nJennifer Garner wears a mask of her cat Moose to tease him on his birthday\n\nDemi Lovato's sister Madison De La Garza grieves loss of daughter after undergoing 'emergency C-section'\n\nChris Brown accuser claims star 'raped and drugged' her during a yacht party outside Diddy's Miami mansion\n\nEXCLUSIVEHugh Jackman's ex-wife Deborra-Lee Furness was 'suspicious' of his Broadway costar Sutton Foster\n\nSophie Turner transforms into the Matrix's Neo in a racy PVC playsuit as she attends Halloween bash\n\nLily-Rose Depp puts on a VERY leggy display in skimpy striped bodysuit as she poses for outdoor photoshoot in Beverly Hills\n\nAs Joe Lycett reveals he's welcomed a son with girlfriend 'Denise' - how the flamboyant comedian has slammed fans for assuming he's only attracted to men\n\nJess Glynne supported by girlfriend Alex Scott and her family at Las Vegas concert - amid claims she and former Lioness could move to the US\n\nEXCLUSIVEDWTS' Gleb Savchenko 'ended things' with Brooks Nader 'via text'\n\nEXCLUSIVEChloe Sims reveals the real reason she abruptly pulled her daughter, 19, from filming TOWIE and discloses Madison's secret talent \n\nBBC DJ Johnnie Walker blasts 'age of celebrity' and radio bosses' preference for inexperienced TV stars as terminally-ill music veteran, 79, signs off from last show\n\nNoel Gallagher flashes a beaming smile as he joins his son Donovan, 17, in cheering on his beloved Manchester City at a match\n\nTori Spelling and her kids enjoy annual outing to Universal Studios' Halloween Horror Nights\n\nChrissy Teigen roasts John Legend for not knowing what a grand slam was before attending the World Series\n\nEXCLUSIVEJessica Alves puts on a glamorous display in a lip print dress as she poses with hot air balloons after splitting from personal trainer boyfriend\n\nDavid Beckham plants a kiss on daughter Harper's cheek as he watches Inter Miami game with wife Victoria in Fort Lauderdale\n\nJordyn Woods seen for first time after Kylie Jenner said she was heartbroken over their 2019 falling out\n\nEXCLUSIVECould YOU survive Celebrity SAS: Who Dares Wins? Here's what happened when Jason Fox took me through training needed to prepare for the show\n\nMichelle Keegan shares photo of her husband Mark Wright with his 'mistress' at a furniture shop\n\nFormer Bake Off host and Traitors star join forces to front new BBC show based off popular board game\n\nREVEALED: The Travis Kelce traits that make Taylor Swift feel more protected than 'anyone she's ever known'\n\nNetflix fans go wild over 'brilliant' psychological thriller and say 'it was a fun ride'\n\nEXCLUSIVEJames Buckley weighs in on The Inbetweeners after his co-star Simon Bird made a heartbreaking announcement about the reunion\n\nAbbey Clancy reveals she and husband Peter Crouch 'used to get helicopters to dinner' as she discusses 'outrageous' football scene\n\nStrictly's Tasha Ghouri wraps up in a baby pink tracksuit and white faux fur coat as she and Wynne Evans join stars heading to Halloween Week\n\nEXCLUSIVERHONJ star makes shock claim that the future of show is 'not looking good'\n\nCoronation Street's Bruce Jones goes shopping with his wife Sandra as he is seen for the first time since revealing his character was axed via email\n\nNicole Kidman's raciest roles yet! From steamy affairs to orgy scenes as she reveals how filming scenes for Babygirl left her with 'orgasm burnout'\n\nIconic 70s TV show star still looks youthful on rare outing - but can you guess who it is?\n\nBBC puts trigger warning on old episode of Michael Palin's Around The World In 80 Days in case viewers are upset by cooking scenes\n\nTom Parker's widow Kelsey shares a kiss on the beach with boyfriend Will Lindsay during a family holiday - two years after The Wanted star's death\n\nQueen Letizia looks chic in smart casual ensemble as she visits winner of Exemplary Town of Asturias Awards with the Spanish royal family\n\nFoyle's War star Honeysuckle Weeks accuses Jerry Hall's niece of being her late husband's mistress\n\nStrictly's Wynne Evans embroiled in further controversy as 'vulgar joke he made is leaked' - amid 'wandering hand' incident\n\nEXCLUSIVEStrictly star Sam Quek insists the show IS a 'safe' place for women after 'bullying' scandal as she breaks silence on Question of Sport axing\n\nWho is Joe Lycett's secret girlfriend 'Denise'? Inside the comedian's very private love life as he welcomes his first child with mystery partner\n\nRyan Thomas throws lavish 16th birthday bash for daughter Scarlett - but 'mum Tina O'Brien is nowhere to be seen'\n\nKeanu Reeves, 60, holds hands with girlfriend Alexandra Grant, 51, as they enjoy a rare outing for a lunch date at Scott's in London\n\nDaisy Ridley cuts a chic figure in a satin black blazer and matching trousers as she attends a Magpie screening in New York\n\nAl Pacino says the pressures of fame left him 'feeling out of place' and made him seek therapy - as he reveals the REAL reason he skipped the Oscars\n\nTop TV presenter 'set to join star-studded Celebrity Traitors line-up' after leaving BBC for rival broadcaster\n\nBig Brother fans are left furious over 'foul' contestant remaining in the house after the latest eviction\n\nLottie Moss sets pulses racing in a sheer black lace dress as she transforms into a sexy vampire for Hallowzeem bash\n\nPrince Andrew chats to dog walkers as he travels home from morning ride in Windsor - days before King Charles set to 'axe private security team'\n\nJamie Oliver slams his heroes who were 'so f**king horrible' to him as he details his long and difficult journey to success\n\nReal Housewives star Ashley Darby puts on a busty display in a red corset mini dress as she joins the cast for a night out in London \n\nTaylor Swift is supported by BFFs Blake Lively and Ryan Reynolds at sold-out Eras Tour concert in New Orleans\n\nBig Brother star says she was 'kicked, punched and verbally abused' by a passenger on a £1k flight after rowing over a reclined seat\n\nPrince William to be joined by supermodels Heidi Klum and Winnie Harlow for Earthshot Prize ceremony (but Kate Middleton looks set to miss it)\n\nI was on Married At First Sight - show bosses sabotaged our dates and now I can't find love as my reality TV fame is an 'ick'\n\nGwen Stefani, 55, cuts a stylish figure in torn jeans and a colourful checked gilet as she goes shopping for Halloween essentials\n\nAndy Carroll and Lou Teasdale make their first public appearance after his split from wife Billi Mucklow as they join Lottie Moss at star-studded Hallowzeem \n\nTom Holland goes viral protecting girlfriend Zendaya from photographers out in NYC\n\nMadonna visits grave of late brother Christopher with model daughter Lourdes weeks after tragic death\n\nStrictly's JB Gill reveals gruelling exercise routine for the show has spiced things up with wife Chloe\n\nEXCLUSIVERevealed: How Bridgerton star Nicola Coughlan, 37, met her toyboy lover Jake Dunn, 24\n\nDenise Lewis, 52, exudes elegance in a flowing blue dress as she leads the stars at the Powerlist Black Excellence Awards at Grosvenor House Hotel\n\nThe patience of Paris: How Tyson Fury's wife has been his rock through mental health struggles, intense training and raising his SEVEN kids \n\nHas Giovanni Pernice found his amore on the dancefloor? After a tumultuous year, friends say there's a twinkle in his eye again, KATIE HIND reveals\n\nEXCLUSIVEStrictly dancer who left Fern Britton in tears revealed by MailOnline: TV star's experience with Artem Chigvintsev revealed\n\nOutrage as 24/7 Christmas TV channel goes live with festive favourites before Halloween is even out of the way\n\nPregnant Jennifer Lawrence hides bump in oversized blouse at World Series game one after baby news\n\nThe Royal Family's most relatable parenting moments: Princess Diana tells Prince William off on sports day, Prince Louis pulls faces at Kate \n\nHave Harry and Meghan moved on from their matchmaker? Harry's childhood pal Violet von Westenholz seems to have disappeared from their lives\n\nEXCLUSIVEWhat Prince Charles said when Holby City actress and artist Rebecca Grant told him her own fascinating royal secret\n\nTaylor Swift fans are convinced her ex-boyfriend Joe Alwyn is dating a Kardashian\n\nWho left Big Brother? Izaaz becomes the third contestant to be evicted after Head of House nominations twist\n\nGleb Savchenko posts cryptic song lyrics amid Brooks Nader 'split'\n\nKelsea Ballerini reveals she and Chase Stokes have taken a MAJOR step in their relationship\n\nJustin Bieber shares photos with wife Hailey from their romantic date night\n\nAnne Hathaway looks unrecognizable with blonde wig and spooky makeup as she kicks off Halloween early\n\nLana Del Rey breaks silence on marriage to alligator tour guide Jeremy Dufrene\n\nTom Hanks, 68, and Robin Wright, 58, reunite at premiere of their new film Here - 30 years after Forrest Gump\n\nAdvertisement\n\nMORE DON'T MISS\n\nJessica Simpson and husband Eric Johnson hit with 'divorce' rumors after 10 years of marriage\n\nDodgers fans Ashton Kutcher and Mila Kunis take their kids to World Series game one in LA\n\nChappell Roan demands photographer 'apologize' to her during heated red carpet exchange\n\nRoman Kemp reveals bitter feud with a James Bond star who 'nearly made him cry' after EXTREMELY rude meeting\n\nJoe Lycett is a FATHER! Comedian reveals he's welcomed a son with mystery partner as he shares sweet snap of him cradling the newborn\n\nLisa Snowdon, 52, showcases her jaw-dropping figure in a VERY racy bikini as she opens up on body confidence\n\nOlivia Rodrigo supported by her old opener Chappell Roan at premiere of her Guts World Tour concert film\n\nI'm A Celebrity bosses 'eyeing up Maura Higgins to replace Tommy Fury in the jungle after boxer pulled out last minute'\n\nGrateful Dead received touching honor just days before bassist Phil Lesh died at age 84\n\nBianca Censori flashes sideboob in risqué leather bra for husband Kanye West's album launch in Tokyo\n\nPete Wicks shares the one bizarre thing he is scared of while Wynne Evans reveals the 'weird' tattoo Katya Jones gave him as the stars dress up for Halloween Week\n\nBeyoncé introduces Kamala Harris and says 'I'm here as a mother' at Texas rally as VP tries to reverse poll slump\n\nJames Franco gives devastating update on friendship with Seth Rogen\n\nLeonardo DiCaprio reveals who he is voting for ahead of presidential election\n\nJustin Bieber is in better spirits as he cracks a rare smile amid Diddy scandal\n\nSophie Habboo puts on a racy display in a sheer lace dress as she steps out with husband Jaime Laing to celebrate their recent podcast success\n\nPixie Lott goes all out for Halloween by dressing up as an Aperol Spritz as she arrives at exclusive Mayfair members club for lavish bash\n\nWorld Series 2024: Jimmy Kimmel and John Legend headline celebrities at Yankees versus Dodgers Game 1\n\nMiriam Margoyles and Kristen Scott-Thomas in tears on Gogglebox Stand Up To Cancer special\n\nBeyonce's sister Solange Knowles, 38, reveals debilitating diagnosis\n\nPete Davidson flaunts bare arms after having tattoos removed as he emerges from rehab looking healthier than ever\n\nVenom sparks 'woke' debate for unlikely reason over pronouns\n\nPaddy McGuinness seemingly sees the funny side of his divorce as he takes a swipe at Christine just moments into his new stand-up comedy show\n\nDavid Gandy blasts British Airways for splitting him from his daughter, two, who was forced to sit next to a stranger on overbooked flight \n\nEXCLUSIVEJamie Foxx fuels Diddy 'poisoning rumors' as he swerves questions about wild theory\n\nPhil Lesh dies aged 84: Grateful Dead bassist and founding member passes away as tributes paid\n\nEXCLUSIVEWelcome to the new Beckingham Palace: Inside the Beckhams' recording-breaking £60m Miami mansion with nine palatial bedrooms\n\nAlex Scott poses up a storm in sexy 40th birthday shoot as she details struggles with rejection\n\nDJ Clark Kent who worked with Jay-Z and Mariah Carey is dead at 57 after colon cancer battle\n\nDancing on Ice star Chelsee Healey takes a break from training as she showcases her incredible figure in a tight fitting black maxi at a charity event with boyfriend\n\nHeartstopper actor Kit Connor praised by critics for Broadway debut in Romeo and Juliet\n\nSam Smith looks sharp in a black suit as they cosy up to boyfriend Christian Cowan at the US premiere screening of Andrea Bocelli 30: The Celebration\n\nBraless Joey King suffers embarrassing wardrobe malfunction at fashion event\n\nBrooks Nader and Gleb Savchenko SPLIT after brief romance amid 'showmance' claims\n\nSingle Liam Neeson, 72, says he's 'madly in love' with co-star Pamela Anderson, 57, in gushing interview\n\nNicole Scherzinger says she is 'heartbroken' over Liam Payne's death in first interview since his passing\n\nSarah Hyland says she is still 'triggered' by a past abusive relationship that a Modern Family costar helped her get out of\n\nKatie Holmes, 45, chats on her phone in NYC after sharing rare photo with all 3 of her sisters\n\nEmily Atack nearly spills out of her tiny white bikini as she shows off her tan lines in BTS Rivals snaps\n\nEXCLUSIVE'I've found Lord Lucan': Bombshell as son of murdered nanny reveals breakthrough\n\nAll five One Direction albums return to the UK Top 40 Chart following the tragic death of Liam Payne aged 31\n\nJade Thirlwall reveals Stormzy has 'always supported and inspired her' as she covers his song during her first solo BBC1 Live Lounge performance\n\nCoronation Street legend Bruce Jones reveals ITV have APOLOGISED for axing his character Les Battersby via email\n\nIs Tommy Fury making a mad dash for cash? As star 'pulls out of I'm A Celeb' for fight deal - how he's making a fortune after split from Molly-Mae Hague\n\nRaye reveals birthday nightmare as her car is robbed with her song book for second album inside the boot\n\nSarah Jessica Parker looks busty in racy satin corset as she films And Just Like That... in NYC\n\nKim Kardashian, 44, is nearly unrecognizable with red hair and micro-freckles for announcement\n\nStanley Tucci, 63, cosies up to wife Felicity Blunt, 42, as they attend UK premiere of Small Things Like These\n\nParis Hilton models a low-cut dress as she sings for Kim Kardashian and Nicole Richie in Hollywood\n\nRevealed: The real reason Hugh Jackman has been the subject of false gay rumours for two decades - amid 'new romance' after shock split from wife\n\nShocking moment Antiques Road trip expert SHOVES 'horrid' co-star and barks 'get your hands off me!' as pair lock horns on BBC show\n\nJennifer Lawrence shows off her baby bump in a white shirt as she takes son Cy, two, to a Los Angeles park\n\nVanessa Feltz reveals she had her first ever kiss with a celebrity when she was on holiday in Mallorca - and it's rather a surprising choice!\n\nMatthew Perry's mom had premonition he would die just before shock passing from drug overdose aged 54\n\nOnly Fools And Horses episode 'was so dark and cruel' it was banned from being shown on TV\n\nEXCLUSIVEBen Affleck is ready to start dating after his split from Jennifer Lopez - but he has a non-negotiable\n\nBoy George looks typically stylish in all black as he is joined by Lizzie Cundy who puts on a busty display at the launch of the singer's limited edition art collection\n\nBen F-ogled! Countryfile star, 50, sends fans wild with 'thirst trap' snap of his muscular thighs as he declares his love of 'short shorts'\n\nPaul Mescal and Eddie Redmayne clash as they reveal 'horrendous' truth behind their hunky transformations \n\nThe Traitors star Charlotte Chilton poses in her pre-pregnancy clothes two weeks after welcoming 'miracle' baby daughter with Conor Maynard\n\nRose Ayling-Ellis looks downcast filming at a police station for her leading role in ITV's Code of Silence\n\nDua Lipa puts on a leggy display in a black bodysuit and coat as she drinks dirty martinis during fun night out\n\nFamily outing! Queen Letizia brings her teenage daughters to meet competition winners in Oviedo\n\nTigerlily Taylor, 30, does the Can-Can around Soho with her rocker dad Roger, 75, and sisters Rory, 38, and Lola, 24\n\nFurious Bargain Hunt fans sink claws into BBC for 'awful' change to hit daytime show - raging 'why do it?!'\n\nJack Grealish and Sasha Attwood beam as they are seen for the first time since welcoming their baby daughter Mila\n\nKelly Emberg, 65, romanced Rod Stewart and posed for Vogue in the 1980s - see her now\n\nMAFS UK fans rage 'I feel physically ill!' after Luke's VERY graphic sex chat at dinner party 'gives them the ick'\n\nTipping Point fans 'switch off' as they spot problem with ITV game show that makes it 'too annoying to watch'\n\nLewis Capaldi 'set to make a comeback next year with new album' after taking a career hiatus amid Tourette's battle\n\nNicole Scherzinger reveals she was texting Liam Payne on the day he died as she pays tribute to her X Factor mentee with sweet photos\n\nJohn Mulaney details heartbreaking moment with Olivia Munn during her breast cancer surgery\n\nEXCLUSIVEPete Wicks' ex Chloe Sims reveals the real reason he's been linked with Maura Higgins AND his Strictly partner Jowita Przystal \n\nSelena Gomez makes a 'Diddy slip' at fundraiser after her ex Justin Bieber was linked to the jailbird\n\nOlivia Munn flashes mastectomy scar in a slip dress when with John Mulaney at an awards show after SKIMS ad\n\nOlivia Wilde shows off her taut tummy as she leaves her Los Angeles gym\n\nGeorgia Harrison shares more details on 'refreshing' new romance and says she's finally found a 'really good person' after revenge porn ordeal \n\nThe sickening Rivals moment writers begged Disney to cut from 'bonkbuster' show - and how it made it into screens against all odds\n\nBrooks Nader shares very pointed video amid romance with DWTS partner Gleb Savchenko\n\nKevin Kline reveals secret to 35-year marriage to former child star\n\nNetflix fans beg that 'tremendous' legal drama is renewed as it tops the charts - pleading 'don't you dare cancel it!'\n\nMichelle Keegan shows off her svelte physique in a diamante mini dress before changing into a pink gown as she unveils her new Very collection\n\nKanye West reveals his forthcoming album Bully is available to pre-order for just £16 as rapper unveils new merchandise\n\nThe Chase fans concerned for Bradley Walsh's health as 'sick' ITV host struggles through show - fretting 'he doesn't sound right'\n\nSofia Vergara, 52, shares sizzling flashback bikini photo as she hints she is 'single' after Justin Saliman split\n\nNaomi Campbell, 54, breaks her silence on Liam Payne's tragic death aged 31 - four years after they briefly dated\n\nAddison Rae shows off her jaw-dropping figure in a nude leotard as she does the SPLITS in her VERY racy new music video\n\nEXCLUSIVENicola Coughlan, 37, confirms new romance with much younger Renegade star Jake Dunn, 24, as they head home from a night out in London\n\nGeorgina Rodriguez reveals she was hospitalised with serious illness for four days - as Cristiano Ronaldo's partner releases health update\n\nKatie Price rocks a crop top as she takes her new £800 Sphynx cat Daisy for a walk in a PRAM after sparking concern with her drastic weight loss\n\nAntiques Roadshow crowd gasp as woman learns SIX-FIGURE value of 'never before seen' relic left in house by former owners\n\nKesha playfully gasps as fans stuff money down her semi dress as she is joined by rarely seen singer-songwriter mum Pebe Sebert\n\nRachel Zegler, 23, wears blood covered dress as she joins Heartstopper star Kit Connor, 20, to celebrate Romeo & Juliet opening night\n\nSarah Ferguson shares a video from Irish beach as she says she enjoys 'fresh air when things get overwhelming'\n\nRita Ora puts on a cheeky display in racy stage costumes as she shares a behind the scenes look from her Japan tour\n\nRivals may be a 1980s throwback, but its focus on female pleasure puts modern shows to shame, writes DAISY BUCHANAN\n\nEXCLUSIVELiam Payne: The unanswered questions. As police investigate the pop star's death, GRANT TUCKER reveals ten key lines of inquiry\n\nKing Charles beams in Samoan-themed dress at official dinner for the Commonwealth Heads of Government in Samoa alongside Queen Camilla\n\nGood Morning Britain viewers blast 'unwatchable' Kate Garraway and Adil Ray for 'beyond irritating' interviews - raging that ITV show has 'ruined their day'\n\nNicole Kidman tears up on the red carpet following the death of her mother Janelle - as she reveals shock weight loss\n\nLeonardo DiCaprio's incredible dating track record in graphs: How he appears to have finally broken his golden '25 and under' rule\n\nEXCLUSIVEThe warning sign of trouble at Radio 5: On-air spat between Tony Livesey and Clare McDonnell before he sent an email slagging her off straight to her and triggered meltdown\n\nFerne McCann is laser-focused on the rink as she begins another day of gruelling Dancing On Ice training - after opening up about skating fears\n\nX Factor star Janet Devlin says she battled alcoholism and suicidal thoughts after appearing on the show\n\nCharlie Stayt mortified as BBC Breakfast guest swipes 'I hope you get better' and insists he 'looks peaky' leaving co-star Naga Munchetty smirking\n\nEXCLUSIVEVictoria Beckham gives her seal of approval to Cruz Beckham's girlfriend Jackie Apostel, 29, as they join up for Miami boating trip\n\nEXCLUSIVEJess Wright reveals why she will never call her son Presley, 2, 'naughty' to his face or get angry with him as she details unique parenting style\n\nChloe Ferry flaunts her eye-popping cleavage in a busty red bikini as she shares sizzling snaps from her lavish Dubai getaway\n\nLindy Klim SPLITS from her second husband Adam Ellis after six years of marriage... as the Balinese princess is seen without her wedding ring\n\nAmanda Holden and Ashley Roberts transform into sexy reincarnations of Beetlejuice characters to kick off Heart FM's Halloween celebrations\n\nPrincess Elisabeth's all-American birthday! Heir to the Belgian throne celebrates turning 23 with autumnal photoshoot at Harvard\n\nKate Bush is back! Iconic 80's singer reveals return to the spotlight with an intriguing career change - and more music is to come\n\nKate Beckinsale stuns in a quirky mini dress with a corset and theatrical skirt at Variety's 2024 Power Of Women event\n\nNewly-single Ellie Goulding, 37, flashes sideboob in a backless top as she joins Brooks Nader at Paris Hilton's concert after splitting from toyboy surf instructor boyfriend, 29\n\nFake Or Fortune fans rage 'the licence fee isn't worth paying!' as they blast the BBC and complain 'we're absolutely fed up!'\n\nTommy Fury 'pulls out of I'm A Celebrity' just weeks before flying to Australia for filming as boxer is offered another more lucrative opportunity\n\nLeonardo DiCaprio, 49, enjoys a bike ride with model girlfriend Vittoria Ceretti, 26, who poses for a snap with a fan\n\nNetflix drama dubbed 'best on the platform' scoops perfect 100% Rotten Tomatoes score - and there are three full seasons ready to binge\n\nHow Liam Payne came to rely on an Argentinian friend who helped him back to his Buenos Aires hotel room, reveals ALISON BOSHOFF\n\nKim Kardashian cuts an edgy figure in grey as she joins Nicole Richie and sideboob-flashing Ellie Goulding for Paris Hilton's star-studded concert\n\nHeretic is hailed by critics who praise Hugh Grant's 'astonishing transformation from heartthrob to horror villain' in 'spine-chilling' thriller\n\nThe Supervet Noel Fitzpatrick stunned as sickly dog exposes owner's AFFAIR in most outrageous way\n\nHow Paris Fury battled through the pain of miscarrying at 6 months pregnant and was forced to give birth to her lost little boy - all without telling Tyson\n\n'They asked me how I felt being naked!' Daisy May Cooper reveals she was hoodwinked into joining a swingers club when she tried to pursue her interest in witchcraft\n\nEXCLUSIVEALISON BOSHOFF: David Beckham set to get Hollywood Walk of Fame gold star\n\nLottie Moss layers her mini dress under a cosy brown faux fur coat as she enjoys a night out at Chiltern Firehouse\n\nBlockbuster fantasy show SCRAPS final series - replacing full season with a feature-length film in blow to fans\n\nLiam Payne fans' call for new 'Liam's Law' to protect mental health of young pop stars will be debated in Parliament after petition passes 110,000\n\nShock twist in Hugh Jackman and Sutton Foster romance rumours as body language makes bold claim about red carpet photos\n\nNatalie Cassidy reveals the real reason she hasn't married partner Marc Humphreys after nine-year engagement\n\nBraless Zendaya shows support for boyfriend Tom Holland wearing hat to promote his alcohol-free beer\n\nTell Me Lies actor Jackson White reveals he was critiqued for 'not thrusting right' in intimate scenes\n\nAmy Adams stuns in an elegant blue satin gown as she joins Selma Blair and Zoe Saldana at Variety's 2024 Power Of Women event in LA\n\nLady Gaga 'forced to push back her global tour due to fellow major artists booking up all the arenas'\n\nTommy Fury 'is in talks with KSI over a rematch' after pulling out of I'm A Celebrity... Get Me Out of Here! at short notice'\n\nEastEnders star leaves HUGE sum of money in her will after her death last year aged 89\n\nSacha Baron Cohen brings back Borat and Ali G to poke fun at Donald Trump and Kamala Harris on The Tonight Show\n\nDutch courage! How Queen Maxima and her daughters have upped their game with bold fashion choices\n\nMaya Jama is the epitome of glamour in a white silk halterneck gown as she commands attention at the Fashion Trust Arabia 2024 event in Morocco\n\nKristen Stewart, Chrissy Teigen and Camila Cabello bring their fashion A game to InStyle's Imagemaker Awards in Los Angeles\n\nCillian Murphy debuts his eye-catching new hairstyle as he poses with his Small Things Like These co-stars Eileen Walsh and Emily Watson at UK premiere\n\nToday's headlines\n\nAmy Dowden's Strictly partner JB Gill breaks his silence as dancer is forced to miss results show after...\n\nLabour MP Mike Amesbury is quizzed by police and suspended after sucker-punching constituent and beating him...\n\nTV soap star arrested on suspicion of sexually abusing FIVE underage boys: Police swarm home and seize...\n\nHow compensation could be given to thousands of people left 'disabled' by the AstraZeneca Covid jab\n\nNIALL FERGUSON: Why Kamala Harris poses a greater threat to democracy - both at home and abroad - than...\n\nHow Ozempic could cure common leg problem one in ten women suffer... as some say NHS should pay for...\n\nNew blow for businesses as Rachel Reeves is set to announce a mega inflation-busting hike in the minimum...\n\nIndia-born paedophile who was jailed for distributing child sex abuse images CAN'T be deported from the UK -...\n\nGino D'Acampo slams English Christmas tradition as he criticises Britons for eating 'the worst meal in the...\n\nTrump Madison Square Garden rally live updates: 20,000 fans roar as former president take stage\n\nFury as NHS tells its staff that women are 'transphobic' if they do not want not to share a bathroom with a...\n\nAlmost six decades after spinning his first disc, Johnnie Walker bids a heart-rending farewell to BBC Radio...\n\nDEAR JANE: I gave my husband a 'hall pass'... but then he slept with the one person I wish he hadn't\n\nThe six products you must own if you're over 60: YOU editor JACKIE ANNESLEY reveals the insider's guide to...\n\nWe sold our homes and everything in them to live on cruise ships - we've figured out a system to afford it\n\nKEMI BADEONOCH: Labour is driven only by ideological fervour - it has no vision for our schools and...\n\nIndian business tycoon leaves large chunk of his £91million fortune to his DOG: Ratan Tata asks for...\n\nThe Grinning gangster: Why Kinahan Cartel boss smiled as he was jailed for machine gun plot\n\nOur fashion expert's supermarket picks for winter from just £12 - you'll never guess where the party...\n\nUK weather map shows where snow could strike - but only after Britain feels as hot as Spain in mini-heatwave\n\nEddie Redmayne reveals his secret trick to avoid being recognised as he gives rare insight into his quiet...\n\nKemi Badenoch claims Labour's VAT tax raid on private school fees 'won't raise a penny' - and says the...\n\nWannabe influencers who dreamed of making it big forced back into 'real jobs' with mounting credit card debt\n\nMan arrested four months after woman vanished without a trace: Police say they are 'very concerned' about...\n\nNewly-engaged Holly Ramsay looks incredible as she displays her toned abs in a pink bikini while soaking up...\n\nMoment hundreds of 'anti-tourist' activists storm the streets of Spain in protest amid wave of campaigning...\n\nI don't feel old, says FERN BRITTON, but the thought of starting a new relationship in my 60s is...\n\nI have a rare condition that makes me orgasm up to 25 times a day- but they're so painful and embarrassing I...\n\nI spent 30 days in a coma fighting for me life - and what happened next changed everything\n\nI almost died after giving birth when a flesh-eating bug developed in my C-section incision\n\nLabour left embarrassed by 'total cock-up' as it emerges Rachel Reeves won't unveil any new freeports in her...\n\nCelebrity SAS: Who Dares Wins' Jason Fox reveals which 'useless' star managed to win him over and become the...\n\nWidowed with a child I'd never wanted, I hit a forbidden low - then my wife saved us from beyond the grave\n\nNewly-engaged Georgia Toffolo flashes her dazzling diamond ring in fun snaps after BrewDog founder James...\n\nHow I escaped after being kidnapped by a machete-wielding gang: 'Hardest Geezer' RUSS COOK reveals his...\n\nThe five money deadlines you can't afford to miss. No it's not just the Budget, says financial expert ROSIE...\n\nMore Labour 'working people' chaos as minister repeatedly fails to say whether Brits running small firms...\n\nBritish Airways cancels ALL flights between New York and major UK airport until 2025 as it warns travellers...\n\nLocals furious at 'hideous' plans for 200 newbuild homes on the greenbelt that will 'stare them in the face'...\n\nProstate cancer is surging in the middle-aged: Now experts say there's a simple solution that can save your...\n\nPalestinian boy, 11, shot and killed by Israeli Army 'after throwing stones at vehicle': Father opens up...\n\nThree-week-old baby dies and two adults hospitalised in two-car crash - as police charge man, 39, with...\n\nGeorgia Toffolo is engaged! Former Made In Chelsea star accepts birthday marriage proposal from...\n\nMadonna, 66, turns heads in a sexy sheer dress and a black leather coat as she steps out in Paris\n\nClarkson's Farm star Kaleb Cooper reveals he is on a strict diet after 'receiving a message in a dream'...\n\nJennifer Lopez enjoys dinner with vocal coach Stevie Mackey and her twins Emme and Max, 16\n\nStrictly Come Dancing result is leaked yet AGAIN - leaving fans 'shocked' and 'devastated' as they say 'it...\n\nPolice hunt for on-the-loose XL Bully that killed Staffordshire bull terrier and attacked owner at beauty...\n\nHorror footage shows inside of ex-Bolivian President's vehicle during assassination attempt that saw car...\n\nBroadcaster Emma Freud forced to apologise due to blunder live on air\n\nMORE HEADLINES\n\nMoment Labour MP Mike Amesbury sucker punched constituent and then beat him six times while he lay on the ground caught on shocking CCTV footage\n\nBritish Airways cancels ALL flights between New York and major UK airport until 2025 as it warns travellers it doesn't believe 'issue will be solved quickly'\n\nWidowed with a child I'd never wanted, I hit a forbidden low - then my wife saved us from beyond the grave\n\nMystery of tower block mum-of-five who fell to her death: A criminal boyfriend, a 'dangerous' window, a miracle baby - and why those closest to her believe her death is not as it appears...\n\nKorean cannibal clan who ATE their wealthy victims: How warped Chijon Family hunted 'rich snobs' to eat, fed terrified captive human liver and held a pork barbecue to hide the smell\n\nLabour MP Mike Amesbury is quizzed by police and suspended after sucker-punching constituent and beating him while he lay on the ground: Mail's shocking exclusive CCTV shows moment attack unfolded after politician claimed man 'threatened' him\n\nThe exam that put 'straight A student' Meghan Markle in her place: After an internship in Argentina she thought she was destined for a career in the US diplomatic service... but failed the exam - so could YOU pass it?\n\nFather-of-three who built 6ft fence to keep autistic son safe while playing in his garden ordered to tear it down by council\n\nRollercoaster at British theme park closed and passengers left in need of rescue after metal beam falls onto the track\n\nWe sold our homes and everything in them to live on cruise ships - we've figured out a system to afford it\n\nRevealed: How Romanian 'Fagin' gang bosses are using a network of organised beggars 'pretending to be homeless' with the same handwritten sign to prey on Brit shoppers on Oxford Street\n\nMore Labour 'working people' chaos as minister repeatedly fails to say whether Brits running small firms count ahead of £35bn Budget tax raid\n\nThe people who came back from the dead: Thrashing around during organ removal, waking up in body bags and a 'knock, knock' from inside the coffin... terrifying tales of life after 'death'\n\nWannabe influencers who dreamed of making it big forced back into 'real jobs' with mounting credit card debt\n\nLabour left embarrassed by 'total cock-up' as it emerges Rachel Reeves won't unveil any new freeports in her Budget... just days after PM boasted he's creating five new freeports\n\nHuge cliff collapses and sends rocks flying onto beach below on Jurassic Coast - as safety chiefs issue warning\n\nLocals furious at 'hideous' plans for 200 newbuild homes on the greenbelt that will 'stare them in the face' and make their houses 'unsellable'\n\nCustomers issue scam warning after booking Lastminute.com holidays - how to make sure YOU don't get caught out\n\nSecrets of Prince William's 'rugged rebrand': How future King went from balding middle aged dad to hot heir - thanks to new trainers and THAT stubble\n\nRoyal Navy academy where King Charles and Prince William underwent military training faces being axed in Labour defence review\n\nThree-week-old baby dies and two adults hospitalised in two-car crash - as police charge man, 39, with causing death by dangerous driving\n\nThe Grinning gangster: Why Kinahan Cartel boss smiled as he was jailed for machine gun plot\n\nPolice find body in search for Joanne Jones after frantic bid to find hiker, 49, who went missing in Welsh forest six days ago\n\nMajor Labour donor tells rich threatening to flee Britain over Rachel Reeves' tax rises to 'f*** off'\n\nInside the Democrat implosion as Kamala's team is gripped by fear and 'vibes' drain away: 'Nobody should be even slightly optimistic right now'\n\nTV soap star arrested on suspicion of sexually abusing FIVE underage boys: Police swarm home and seize computers after accusations against man who's worked with 'some of Britain's most famous names'\n\nLabour could open MORE asylum hotels amid fears they could run out of space as nearly 150,000 migrants cross the channel in just six years\n\nPolice hunt for on-the-loose XL Bully that killed Staffordshire bull terrier and attacked owner at beauty spot\n\nMOST READ IN DETAIL\n\nNEW ARTICLESHomeTop\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"Eight-year-old Freddie could be seen with his long blond hair enjoyed a day out with his aunties, Louis' twin sisters Phoebe and Daisy Tomlinson, in Los Angeles.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14008691/Louis-Tomlinson-son-Freddie-spitting-image-One-Direction-star.html","image":"https://i.dailymail.co.uk/1s/2024/10/27/22/91350977-0-image-m-53_1730069013888.jpg","video":null,"publish_date":"2024-10-27 23:36:58","author":"Editor,Lily Jobson","authors":["Editor","Lily Jobson"],"language":"en","source_country":"gb","sentiment":0.235},{"id":261318446,"title":"The Post endorses Mike Lawler, Alison Esposito & Marc Molinaro for  the House","text":"New York’s not a swing state, but it’s central to the battle for control of the House of Representatives. Several of the “swing districts” are north of the city, in or near the Hudson Valley.\n\nThe key issues in these districts include the Harris-Biden illegal-migrant crisis, rising crime and taxes.\n\nEndorsing these Republicans is a no-brainer choice on all fronts:\n\nThe current GOP House already passed an excellent border-control bill (HR2) that the Democratic Senate refused to consider. A Democratic House might pass something, but it would be tailored to appease the party’s progressives, who don’t really want the border controlled at all.\n\nCrime is more a state and local issue than a national one, but Democrats keep trying to pretend it’s not an issue at all, citing a single outdated FBI statistic to claim it’s going down nationally. And there’s no question that New York Democrats are on the wrong side: They’ve given us the no-bail and Raise the Age laws and other “reforms” that have sent crime through the roof since 2019 — and they’re the party of #DefundThePolice (and #AbolishICE, for that matter).\n\nDemocratic majorities always want to raise taxes, and it never winds up being only “the rich” who get hit. Meanwhile, New York Republicans have also gotten Donald Trump to agree to ease up on the SALT (state and local tax) deduction, which he massively reined in with the 2017 tax law that launched a huge economic boom — while Dems did nothing on SALT even when they controlled Congress in 2021-’2.\n\nDem candidates are also insisting that their GOP opponents will be the deciding vote to ban abortion nationwide; that’s an outright lie on every level.\n\nAny such bill (indeed, any national abortion measure, whether pro-life or pro-choice) has zero chance of passing either chamber of Congress for the foreseeable future; this GOP House hasn’t tried; all these candidates say they’d oppose it — and Trump has said he’d veto it. \n\nEvery time Democrats raise this issue, it’s to avoid the ones that actually count.\n\nNational Democrats and left-wing dark-money outfits have poured tens of millions into these races, funding endless televised smears of the Republicans. Race by race, here are the details:\n\nNY-17 (Rockland and Putnam counties, plus parts of Westchester County and Dutchess)\n\nRep. Michael Lawler narrowly beat then-incumbent Rep. Sean Patrick Maloney in 2022; he’s since gone on to serve as one of the most bipartisan members of the House, passing multiple bills including several that President Biden signed into law.\n\nThe Democrat is progressive ex-Rep. Mondaire Jones, who left the district in 2022 to avoid a primary against Maloney, opting for a failed run in a Brooklyn district.\n\nIn his one term, Jones was a solid ally of The Squad and other far-left pols — a fan of defunding cops, letting criminals loose, abolishing ICE, throwing the border open and handcuffing the Border Patrol; he also voted four times against funding Israel’s Iron Dome.\n\nHe now tells voters he’ll be a moderate on all these issues; no one should believe him.\n\nLawler, by the way, was an early and loud voice for pushing fraudster Republican Rep. George Santos (R-Long Island) out of the House. He’s a steadfast supporter of Israel and a solid opponent of “sanctuary city” nonsense as well as the disastrous Harris-Biden border policies.\n\nHe’s got the backs of cops, too; every police union endorses him.\n\nAnd Lawler actually got a bill to partly restore SALT up for a vote in the House — but House Minority Leader Hakeem Jeffries had every New York Democrat vote against it. \n\nHe’s also a strong voice in state politics, rightly denounced Gov. Kathy Hochul’s pause of congestion pricing as “no more than an election ploy.”\n\nNY-18 (Orange County, most of Dutchess and Ulster, plus the cities of Newburgh, Beacon, Kingston, and Poughkeepsie)\n\nRepublican Alison Esposito retired from the NYPD to be Lee Zeldin’s running mate in their 2022 bid to oust Gov. Kathy Hochul; she’s stayed in politics to challenge Rep. Pat Ryan.\n\nThe former NYPD deputy inspector is campaigning on a law-and-order and border-security platform; she also backs restoring SALT and standing with Israel.\n\nAnd she’s a whirlwind of energy, a charming straight-shooter who’ll work tirelessly for the district.\n\nRyan, by contrast, has voted multiple times against aid to Israel, even as the Jewish State faces war on seven fronts. Last December, he voted “present” on a resolution to condemn anti-Zionism as antisemitism, also choosing not to condemn the genocidal “from the river to the sea” call for the elimination of Israel.\n\nHe started calling for a cease-fire in February, long before Israel had finished its necessary campaign to eliminate Hamas in response to the Oct. 7, 2023 atrocities, and has sat largely silent as pro-Hamas agitators act out on campuses in the district.\n\nAnd as Ulster county exec in 2019, he banned local law enforcement from working with ICE; in the House, he’s voted against restarting work on the border wall, against beefing up the Border Patrol, against restoring Remain in Mexico and against tightening up rules for using asylum claims to enter the country illegally.\n\nHe’s a Democrat: His vote in the House supports the party line on the border, crime and so on. He even joined all other New York Democrats in voting against lifting the SALT cap.\n\nNY-19 (spans the Catskills, Finger Lakes, Hudson Valley and Southern Tier)\n\nThis is a rematch, as Rep. Marc Molinaro beat Democrat Josh Riley in 2022 by a slim 2% margin.\n\nBut that was actually Riley’s second choice for where to run: He’d first moved further upstate — after decades living and working in DC and California — before deciding this district was the best place to plant his carpet bag.\n\nMolinaro, by contrast, has deep roots in the district, serving an assemblyman and Dutchess County executive. In two years in the House, he’s scored as the second-most-bipartisan member and the fifth-most productive when it comes to passing legislation — no easy feat for a freshman.\n\nRiley’s running ads on his “Republican values” and border toughness, but in his long career (out of state) as a Democratic operative, supported 32 (thirty-two!) lawsuits to open the border, ease up on immigration enforcement, etc.\n\nHe fought for the Biden “prosecutorial discretion” policy that’s let thousands (or more) criminals, gang members and terrorists into our nation.\n\nAs a staffer for lefty then-Sen. Al Franken, he wrote a bill to grant citizenship and benefits (including Social Security) to millions of illegal immigrants.\n\nAnd he has long ties to the far-left, anti-Israel Working Families Party — which is also a huge backer of open immigration, sanctuary-city policies and vast benefits for illegal migrants.\n\nHe not only got the WFP endorsement in 2022 and again this year, he was a keynote speaker at the WFP annual fundraiser in 2017. On a WFP questionnaire, he endorsed voting rights for illegal immigrants.\n\nAnd he’s been silent on anti-semitism at his alma mater, Harvard — while pulling big campaign bucks from other Harvard alums who’ve also been bankrolling the pro-Hamas protests.\n\nMolinaro has called the hate and antisemitism flooding campuses and social media since Oct. 7, and been a solid Israel supporter in Congress.\n\nHe was another player in getting Trump to rethink SALT, and in ridding the House of George Santos.","summary":"New York’s not a swing state, but it’s central to the battle for control of the House of Representatives. Several of the “swing districts” are north of the city, in or near the Hudson Valley.","url":"https://nypost.com/2024/10/27/opinion/the-post-endorses-mike-lawler-alison-esposito-amp-marc-molinaro-for-the-house/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-xwkaqo7d6-1730070217525.jpg?quality=75&strip=all&1730055859&w=1200","video":"https://cdn.jwplayer.com/videos/vrBY8Qhr-RyIcpnTz.mp4","publish_date":"2024-10-27 23:32:35","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.421},{"id":261318652,"title":"Melania Trump makes shock appearance at her husband’s Madison Square Garden rally","text":"Melania Trump took the stage at her husband’s New York City rally to “Paradise City” by Guns n’ Roses, then launched into a bleak, but misguided, diatribe about how bad things are in the Big Apple — and the rest of the country.\n\nGnR frontman Axl Rose has spoken out against Donald Trump’s use of the band’s songs, without permission, at his public appearances.\n\n“Hello Madison Square Garden!” the former first lady began, calling the metropolis “the world's undisputed capital of industry, where titans of finance, fashion, and entertainment convene.” New York is an “unforgiving” city, Melania went on, apparently empathizing with the audience about how “our lives are complicated, even during the best of times.”\n\n“And sadly, today, a declining quality of life, coupled with economic instability, makes it difficult for businesses and American ingenuity to blossom among determined citizens who race across city streets, and between offices, striving for success.”\n\nCrime is rising, not just in New York but coast to coast, she declared.\n\nHowever, NYPD data released in July showed crime down over the previous six months. And figures released in August by Gov. Kathy Hochul showed a statewide dip in crime, and singled out Nassau County, the Long Island suburb nearest to the city, as the safest county in the entire nation.\n\nNationwide, violent crime is down some 15 percent, according to the FBI.\n\nThe speech capped off a long afternoon of speakers, including Dr. Phil, Elon Musk, and a wild-eyed NYC sanitation worker named David Rem, all of whom painted the United States, counterfactually, as a nation in decline.","summary":"The former first lady launched into a bleak diatribe about New York that the facts do not support","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-rally-melania-msg-b2636577.html","image":"https://static.independent.co.uk/2024/10/27/23/SEI227424076.jpg?width=1200","video":null,"publish_date":"2024-10-27 23:31:45","author":"Justin Rohrlich","authors":["Justin Rohrlich"],"language":"en","source_country":"gb","sentiment":0.074},{"id":261318918,"title":"US presidential election remains very close; late counting in Australian elections","text":"The United States presidential election will be held on November 5. In analyst Nate Silver’s aggregate of national polls, Democrat Kamala Harris leads Republican Donald Trump by 48.6–47.4, a gain for Trump since last Wednesday, when Harris led by 48.8–47.2. Harris’ national lead peaked on October 2, when she led by 49.4–45.9.\n\nThe US president isn’t elected by the national popular vote, but by the Electoral College, in which each state receives electoral votes equal to its federal House seats (population based) and senators (always two). Almost all states award their electoral votes as winner-takes-all, and it takes 270 electoral votes to win (out of 538 total).\n\nRelative to the national popular vote, the Electoral College is biased to Trump, with Harris needing at least a two-point popular vote win to be the narrow Electoral College favourite in Silver’s model.\n\nIn Silver’s poll averages, Trump is now 0.3% ahead in Pennsylvania (19 electoral votes), which was tied last Wednesday. He leads in North Carolina (16) and Georgia (16) by 1.3–1.4 points and in Arizona (11) by 2.1 points. Harris leads in Michigan (15 electoral votes) by 0.7 points and in Wisconsin (ten) by 0.5 points. In Nevada (six), it’s tied.\n\nIf the election results exactly reflect the current polls, Trump would win the Electoral College by 281–251 with Nevada’s six electoral votes undecided.\n\nThe good news for Harris is that state polls haven’t moved to Trump as much as national polls in the last two weeks. If Harris regains the lead in Pennsylvania, she will probably win. But Harris would likely be better placed in Pennsylvania now if she had made the popular Pennsylvania governor Josh Shapiro her running mate.\n\nSilver’s model now gives Trump a 53% chance to win the Electoral College, unchanged from last Wednesday. While Trump is barely ahead, it’s still effectively a 50–50 coin flip. There’s a 26% chance that Harris wins the popular vote but loses the Electoral College. The FiveThirtyEight forecast gives Trump a 54% win probability.\n\nThere’s just over a week until the election. If there’s late movement to either Harris or Trump or either candidate outperforms their polls, that candidate could win decisively. While the election appears very close now, it may not be so close once we see results.\n\nSilver wrote Saturday that worries about illegal immigration are a key issue for Trump supporters. In the three years that Joe Biden has been president, apprehensions at the US southwestern border surged to record highs, with 2.2 million apprehensions in the 2022 fiscal year\n\nLNP margin extended in Queensland on late counting\n\nWith 68% of enrolled voters now counted in Saturday’s Queensland election, The Poll Bludger’s results give the Liberal National Party (LNP) 44 of the 93 seats, Labor 27, Katter’s Australian Party (KAP) three and independents one. \n\nIncluding undecided seats where one party leads, it’s 53 LNP, 34 Labor, four KAP, one Green and one independent. In Saturday night’s article, the LNP led Labor by 49 seats to 38. Analyst Kevin Bonham expects the final result to be 52 LNP, 34 Labor, five KAP, one Green and one independent.\n\nVote shares have also moved to the LNP, as they now lead Labor by 54.1–45.9 on the estimated two-party vote, compared with 53.1–46.9 on Saturday night. Primary votes are 42.0% LNP, 32.7% Labor, 9.4% Greens, 7.8% One Nation, 2.6% KAP and 5.5% for all Others.\n\nOn the statewide two-party vote, the most accurate poll taken in the last two weeks is currently a YouGov poll that gave the LNP a 54.5–45.5 lead. Resolve gave the LNP a 53–47 lead, Newspoll gave them a 52.5–47.5 lead and uComms was the worst, giving the LNP just a 51–49 lead.\n\nAnalyst Ben Raue wrote in The Guardian that Labor is trailing in 11 of its 14 regional seats while doing much better in south-east Queensland. Right-wing parties have been gaining in regional areas in Australia and internationally in the last ten years, while the left has gained in higher-education, urban areas.\n\nIn Australia Labor can win elections if it dominates big cities except in Queensland and Tasmania. I wrote about this in April 2022 and May 2021.\n\nACT election final result\n\nThe ACT uses the Hare-Clark proportional representation method with five five-member electorates, for a total of 25 seats. A quota is one-sixth of the vote or 16.7%.\n\nThe final result of the October 19 election was ten Labor (steady since 2020), nine Liberals (steady), four Greens (down two) and two independents (up two). Labor retained office in coalition with the Greens; they have governed in the ACT since 2001.\n\nACT-wide vote shares were 34.1% Labor (down 3.7%), 33.5% Liberals (down 0.4%), 12.2% Greens (down 1.3%), 8.5% Independents for Canberra (new) and 11.7% for all Others (down 3.1%).\n\nIn Brindabella, the Liberals had 2.59 quotas, Labor 2.03, the Greens 0.54 and Independents for Canberra 0.46. \n\nIt was initially thought that postals would help the Liberals win the last seat, but they didn’t do well enough on postals, and the Greens defeated the Liberals for the last seat by 166 votes or 0.02 quotas. Bonham followed this count.\n\nTeal wins Pittwater by bigger than expected margin\n\nNew South Wales byelections in the Liberal-held seats of Epping, Hornsby and Pittwater occurred on October 19. Labor didn’t contest any of these seats, and the Liberals retained Epping and Hornsby easily.\n\nIn Pittwater, The Poll Bludger’s election night forecast was a 54.1–45.9 win for teal independent Jacqui Scruby, but she actually won by 56.2–43.8, a 6.8% swing to Scruby since the 2023 state election. Primary votes were 54.5% Scruby (up 18.6%), 41.5% Liberals (down 3.2%) and 4.0% for a Libertarian (new). Labor and the Greens, who received a combined 17.0% in 2023, didn’t contest.\n\nAdrian Beaumont does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.","summary":"With the US presidential election just over a week away, the polls remain very close.","url":"https://nation.lk/online/us-presidential-election-remains-very-close-late-counting-in-australian-elections-281120.html","image":"https://counter.theconversation.com/content/242281/count.gif","video":null,"publish_date":"2024-10-27 23:30:32","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.164},{"id":261319062,"title":"What Trump's mass deportation plan might look like if he wins the election | 60 Minutes","text":"What Trump's mass deportation plan might look like if he wins the election | 60 Minutes\n Immigration experts say Donald Trump's mass deportation plan, if carried out, could be complicated and cost billions a year. It could also lead to more family separations.","summary":"Immigration experts say Donald Trump's mass deportation plan, if carried out, could be complicated and cost billions a year. It could also lead to more family separations.","url":"https://www.cbsnews.com/video/deportation-undocumented-immigrants-60-minutes-video-2024-10-27/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/27/8149d980-356f-4f08-aa91-d3cce6150ec5/thumbnail/1200x630/fd612cce45cb8fb4aa333f6cd580c6d1/deportation-video-vega-3295302-640x360.jpg?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":null,"publish_date":"2024-10-27 23:30:31","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.295},{"id":261318920,"title":"Trump returns to ‘epicenter of everything’ for Madison Square Garden rally","text":"Published at 5:01 pm, October 27, 2024 \n | Updated at 5:27 pm, October 27, 2024\n\nVideo: Robert F. Kennedy Jr., Tucker Carlson and Hulk Hogan set the stage at a massive President Trump rally Sunday at Madison Square Garden, New York City. | Pool via CNN Newsource. Photo: Former President Donald Trump attends a rally in Coachella, California, on October 12. | Mike Blake, Reuters file via CNN Newsource\n\nNEW YORK CITY (CNN) — Donald Trump is kicking off the final full week of the presidential race Sunday with a rally at Madison Square Garden, betting on his own showmanship as he seeks to fill the iconic venue and create a spectacle that will reach television and phone screens in all seven battleground states.\n\nThe former president is returning to his hometown of New York City – deep-blue turf that virtually no Republicans expect to win, but where signs of discontent and state and local Democratic leadership struggles could help endangered GOP incumbents hold House seats in the surrounding suburbs.\n\nIt’s the latest in a line of Trump visits to blue states that has also included a rally in California’s Coachella Valley this month, one on Long Island in the summer and a recent stop for an economic forum in Chicago.\n\nAt each stop, in dehumanizing terms, Trump is laying the blame for crime and growing numbers of migrants at the feet of his Democratic rival, Vice President Kamala Harris.\n\n“I will rescue every town across America that has been invaded and conquered,” he said Thursday in Las Vegas.\n\nThe Madison Square Garden event follows a precedent set by campaigns past. The venue, including its earlier locations, boasts an extensive political history. It has hosted presidents such as Grover Cleveland, Herbert Hoover and Franklin D. Roosevelt, and has welcomed both Republican and Democratic national conventions – most recently the GOP confab in 2004. It was also famously the site of John F. Kennedy’s birthday celebration in 1962, when Marilyn Monroe performed her iconic serenade for the president.\n\nYet, Madison Square Garden’s history is not without controversy. It has played host to far more divisive events, including the notorious “Pro-American Rally” of 1939, a pro-Nazi gathering organized by the German American Bund and attended by thousands in the lead-up to World War II. Days later, a Communist Party rally filled the arena. In 1968, George Wallace, the onetime segregationist governor of Alabama, pushed a law-and-order message in a speech at the Garden days before the presidential election, where he won nearly 10 million votes and carried five states as a third-party candidate.\n\nDemocratic vice presidential nominee Tim Walz alluded to that history while in Henderson, Nevada, on Sunday.\n\n“Go do your Google on this. Donald Trump’s got this big rally going at Madison Square Garden. There’s a direct parallel to a big rally that happened in the mid 1930s at Madison Square Garden and … and don’t think that he doesn’t know for one second exactly what they’re doing there,” the Minnesota governor said.\n\nIn response, the Trump campaign attacked Vice President Kamala Harris and Walz and noted that Holocaust survivor Jerry Wartski is attending the rally.\n\n“Tim Walz is accusing a Holocaust survivor of attending a Nazi rally. Walz should be ashamed of himself and apologize,” Alex Pfeiffer, Trump campaign spokesman, told CNN.\n\nFor Trump, Sunday’s event signifies more than just a campaign stop. It’s also an important moment for him personally. The former president has long voiced a desire to take the stage at the Midtown Manhattan landmark. His name will most likely appear on the same kind of marquee that has so often welcomed guests like Billy Joel, Elton John and other legendary entertainers.\n\nNew York remains a safely blue state, though Trump has privately and publicly said that he thinks he could win it, an idea those in his campaign have acknowledged is far from reality.\n\n“We think there’s a chance of winning New York first time since, well, long time, many, many decades. And we think there’s a real chance with what’s going on, with the migrants taking over the city, taking over, the whole state, frankly,” he said on Fox News Radio. Ronald Reagan in 1984 was the last Republican presidential nominee to carry the Empire State.\n\nIt has also been more than two decades since a Republican won a statewide election in New York – the most recent being former Gov. George Pataki when he won a third term in 2002.\n\nHowever, Republicans have expressed some hope that the event could help bolster vulnerable New York GOP lawmakers vying to hold on to their House seats come November. Several of them joined Trump at a tele-rally Saturday hosted by New York Rep. Elise Stefanik – the No. 4 House Republican – to push early voting. Some also appeared at Trump’s September event at Nassau Coliseum on Long Island.\n\nNone of them, however, are on the speaker’s list released by the Trump campaign for the Madison Square Garden rally.\n\nSunday’s rally will also serve as one of Trump’s largest fundraisers to date, according to multiple sources familiar with the logistics. Donors have been offered a series of packages, including VIP suites, tickets to an exclusive “pre event” at the venue, backstage passes and photo opportunities.\n\n“The Trump campaign is going to make an insane amount of money off this event,” one source familiar with the guest list told CNN.\n\nDozens of Republican lawmakers, allies, donors and celebrities are expected to attend. The Trump campaign said speakers at the rally will include the former president’s running mate, Ohio Sen. JD Vance, tech magnate Elon Musk, former independent presidential candidate Robert F. Kennedy Jr., House Speaker Mike Johnson, Stefanik, former New York Mayor Rudy Giuliani and former Fox News host Tucker Carlson.\n\nA number of popular internet celebrities and rappers have endorsed the former president over the course of the campaign, many of whom are likely to attend Sunday, a source close to Trump told CNN.\n\nA source close to Trump said there are systems in place to stop Trump critics from signing up for tickets without any intention of showing up, something some allies expressed concerned over.\n\nThough Trump won’t be in one of the seven states – Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin – that both campaigns expect to decide the outcome of the November 5 election, the former president’s aides said they expect Sunday’s rally to draw extensive media coverage.\n\n“It’s New York City. It’s the biggest media market in the world,” a campaign adviser told CNN. “It’s the epicenter of everything.”\n\nThis story had been updated with additional developments. \n\nCNN’s Danya Gainor contributed to this report.\n\nThe-CNN-Wire™ & © 2024 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.","summary":"NEW YORK CITY (CNN) — Donald Trump is kicking off the final full week of the presidential race Sunday with a rally at Madison Square Garden, betting on his own showmanship as he seeks to fill the iconic venue...","url":"https://nation.lk/online/trump-returns-to-epicenter-of-everything-for-madison-square-garden-rally-281119.html","image":"https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2024/10/Trump-rally-in-full-swing-at-Madison-Square-Gardens.jpg","video":null,"publish_date":"2024-10-27 23:30:08","author":"New York Rep","authors":["New York Rep"],"language":"en","source_country":"lk","sentiment":0.192},{"id":261319126,"title":"Trump N.Y. rally begins with vulgar, racist remarks from allies","text":"NEW YORK/PHILADELPHIA >> Republican presidential candidate Donald Trump was set to lead a rally at New York’s Madison Square Garden today that began with a series of vulgar and racist remarks by allies of the former president.\n\nTrump, a New York celebrity for decades, hoped to use the event at the iconic venue known for Knicks basketball games and Billy Joel concerts to deliver his closing argument against Democratic candidate Kamala Harris, even though the state last backed a Republican presidential candidate in 1984.\n\n“We want to close it out with a beautiful bang,” he said last week.\n\nSome of the introductory speakers used racist and misogynistic language in warming up a capacity crowd in the hours before Trump was set to speak.\n\nRudy Giuliani, the one-time New York City mayor and a former personal lawyer to Trump, falsely claimed that Harris was “on the side of the terrorists” in the Israeli-Palestinian conflict and wanted to bring Palestinians to the United States.\n\nComedian Tony Hinchcliffe used crass language in joking that Latinos “love making babies” and called the Caribbean U.S. territory of Puerto Rico a “floating island of garbage.”\n\nPuerto Rican singer Ricky Martin posted a clip of the comments on his Instagram and wrote, in Spanish, “This is what they think of us.”\n\nHarris earlier today visited a Puerto Rican restaurant in Philadelphia in the must-win state of Pennsylvania to encourage people to vote. She posted a video on social media promising to “invest in Puerto Rico’s future” as president.\n\nHarris’s campaign in an email said the Madison Square Garden rally was “mirroring the same dangerously divisive and demeaning message” as Trump.\n\nTrump’s 2016 presidential opponent, Democrat Hillary Clinton, has accused him of “re-enacting” a pro-Nazi rally that was held at Madison Square Garden in 1939 on the eve of World War Two.\n\nTrump’s critics have long accused him of empowering white supremacists with dehumanizing and racist rhetoric.\n\nTrump rejected the comparison to the 1930s. “This is called Make America Great Again, that’s all this is,” he said on Friday.\n\n“Today this is Donald Trump’s house,” said the wrestler Hulk Hogan in a speech at the New York event today, later rejecting accusations that Trump is a fascist: “I don’t see any Nazis in here.”\n\nPolls show the rival candidates are neck and neck in the battleground states that will decide the next president with just over a week until Election Day. More than 38 million votes have already been cast.\n\nTrump has been seeking to tie Harris to the Biden administration’s handling of immigration and the economy. Last week, Trump debuted a new attack line: “She broke it, and I promise you I will fix it.”\n\nThe U.S. economy has outperformed the rest of the developed world since the COVID crisis, and stock markets hit record highs this year. But high prices of food, utilities and housing have roiled voters, who believe the economy is headed in the wrong direction.\n\nHarris, who held a rally with Bruce Springsteen in Atlanta on Thursday and Beyonce in Houston on Friday, will hold another high-profile event with a speech on Tuesday on the National Mall in Washington, where she will highlight contrasts between herself and Trump.\n\n“He is full of grievance. He is full of dark language that is about retribution and revenge,” Harris said of Trump in Philadelphia today.\n\nTrump, who held a rally in Long Island, New York, in September, has said he is making a play for the state. Ronald Reagan’s reelection was the last time New York backed a Republican for president; Democrat Joe Biden won the state in 2020 by 23 percentage points.\n\n‘SHOW OF STRENGTH’\n\nBy staging the attention-grabbing event in the world’s biggest media market, Trump could help boost Republican candidates in New York congressional races. The state has seven competitive seats that could help determine whether the party holds onto the U.S. House of Representatives next year.\n\nIt could also give Trump a boost in nearby northeastern Pennsylvania, a battleground state that has increasingly become home for New York commuters.\n\nTrump’s campaign said the event at the 19,500-seat arena, which can cost upwards of $1 million to rent, was sold out. Tickets are free and on a first-come-first-served basis, as was the case with Harris’ Houston rally.\n\nA crowd of some 30,000 people attended Harris’ rally with Beyonce on Friday night in Houston, and about 20,000 attended the Atlanta rally.\n\n“My internal polling is my instinct,” Harris said to reporters in Philadelphia when asked how the campaign is faring in its internal election projections.\n\n“The momentum is with us,” she said.\n\nAfter Sunday’s neighborhood Philadelphia stops, Harris plans to visit every battleground state in coming days, including a Madison, Wisconsin, rally and concert with folk rock band Mumford & Sons and a Las Vegas event with Mexican pop band Mana.","summary":"NEW YORK/PHILADELPHIA >> Republican presidential candidate Donald Trump was set to lead a rally at New York&#8217;s Madison Square Garden today that began with a series of vulgar and racist remarks by allies of the former president.","url":"https://www.staradvertiser.com/2024/10/27/breaking-news/trump-n-y-rally-begins-with-vulgar-racist-remarks-from-allies/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241027_brk_tru01.jpg","video":null,"publish_date":"2024-10-27 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":-0.215}]}