{"offset":0,"number":50,"available":11491,"news":[{"id":341972862,"title":"Here Are the Trump Tariffs That Are in Effect","text":"() Tariffs have been central to President Donald Trump’s trade strategy, but a tangle of delays, threats and actual levies has made it difficult to determine what’s actually in effect.\n\nApril’s so-called “Liberation Day” marked a major escalation, sending stocks plunging before Trump paused some of the harshest “reciprocal” tariffs to give countries a chance to negotiate deals.\n\nBut after 90 days, and only a few agreements, Trump is ramping up the pressure, setting a new deadline of Aug. 1 before harsher tariffs kick in.\n\nAt the same time, Trump has followed through on tariffs targeting steel, aluminum and automotive imports all of which are currently in effect. A 10% baseline tariff on nearly all U.S. imports is also being enforced.\n\nRecently announced tariffs currently in effect:\n\n10% global baseline tariff on nearly all U.S. imports (Canada and Mexico excluded)\n25% tariff on imports from Mexico and Canada that are not compliant with the United States-Mexico-Canada Agreement\n\n10% tariff on Canadian energy products like oil and natural gas\n10% tariff on any potash (popular fertilizer) imported from Canada or Mexico \n\n25% tariff on vehicle imports and auto parts\n30% tariff on most Chinese imports (some electronics, including smartphones, face a 20% tariff)\n\n54% tariff on packages under $800, “de minimis” exemption eliminated\n\n50% tariff on steel and aluminum imports, U.K. at 25%\n\nTariffs that have recently been announced/threatened\n\nNew “reciprocal” tariff rates to take effect on Aug. 1\n\nFollowing a 90-day pause, Trump has been issuing letters informing dozens of countries of their updated tariff rates\n\n30% tariff on Mexico and the European Union starting Aug. 1\n35% tariff on Canada to take effect Aug. 1\n50% tariff on Brazil to take effect Aug. 1\n50% tariff on copper imports, effective Aug. 1\nUp to 100% tariffs on Russia if it doesn’t reach a ceasefire with Ukraine in 50 days\nUp to 200% on pharmaceuticals “very soon,” Trump said earlier this month\n\nWhat’s going on with reciprocal tariffs?\n\nIn early April, Trump imposed a 10% global baseline tariff on nearly all U.S. imports, and dozens of countries faced higher “reciprocal” tariffs, marking what he called a “Liberation Day” for American trade.\n\nA few days later, Trump paused the reciprocal tariffs for 90 days to work out specific deals with each country a plan that has yielded three new trade agreements so far.\n\nThe White House has begun sending letters to countries, informing them of a new deadline: Aug. 1. At that point, Trump says, imports from nations like Japan and South Korea, both major car exporters, would face a 25% tariff.\n\nOther countries, including South Africa (30%) and Brazil (50%), would face even steeper rates.\n\nIt remains to be seen if Trump will follow through on those threats. So far, Wall Street has been unfazed, suggesting investors have their doubts.\n\nAs of July 14, consumers are facing an overall average effective tariff rate of 20.6%, the highest since 1910, according to the Budget Lab at Yale University.\n\nThe federal government has collected $100 billion in tariffs and excise taxes during the first seven months of the year, according to Treasury Department data compiled by the Bipartisan Policy Center.\n\nThose tariffs are mostly paid by American businesses and ultimately consumers in the form of higher prices.\n\nWhat’s happening with tariffs on Canada and Mexico?\n\nCanada and Mexico, the United States’ top two trading partners, currently face a 25% tariff on goods that don’t comply with the countries’ free trade agreement.\n\nHowever, that rate is set to rise Aug. 1 following Trump’s announcement of a 35% tariff on imports from Canada, with Mexico facing a 30% levy that same day.\n\nThe president has accused America’s allies of exploiting the U.S. on trade and not doing enough to curb the flow of drugs like fentanyl into the country.\n\n“The United States of America has been ripped off on TRADE (and MILITARY!), by friend and foe, alike, for DECADES,” Trump wrote on Truth Social Monday. \n\nIf the tariff hikes move forward, families could face higher grocery bills, and American businesses would see increased production costs two trends that have already begun to emerge. The latest Consumer Price Index shows inflation rose 2.7% in June from a year earlier, marking the highest annual increase since February.\n\nIn a recent social media post, Canadian Prime Minister Mark Carney said his country would continue to work toward a new trade framework with the U.S. and has made “vital progress to stop the scourge of fentanyl.”\n\nMeanwhile, Mexican President Claudia Sheinbaum has expressed confidence that the countries will come to terms and emphasized the importance of keeping a cool head during a public appearance Saturday.\n\nTrump has imposed lower duties on Canadian energy products and fertilizer, which are currently subject to a 10% tariff. Those exclusions are expected to stay in place, though the president hasn’t made a final decision, according to Reuters. \n\nTargeted tariffs: Steel, aluminum and auto parts\n\nTrump has enacted several tariffs targeting specific industries, rather than countries, and more could be coming soon.\n\nThe president recently announced a 50% tariff on copper, citing national security concerns and declaring on Truth Social that America will “once again, build a DOMINANT Copper Industry.”\n\nTrump has also threatened to impose a 200% tariff on pharmaceutical imports “very soon” but clarified those levies would not take effect immediately.\n\n“We’re going to give people about a year, year and a half, to come in, and after that, they’re going to be tariffed,” Trump said during a recent Cabinet meeting. “We’ll give them a certain period of time to get their act together.”\n\nIn June, Trump hiked nearly all of his tariffs on steel and aluminum imports to 50%, a move economists warn could squeeze consumers and businesses alike. The two materials are used in household staples like soup cans and paperclips as well as big-ticket products like refrigerators and cars.\n\nA 25% tariff on imported vehicles and auto parts is also in effect, potentially adding thousands of dollars to the price of a new car.\n\nTrump has pitched his tariffs as a way to protect U.S. industry and bring jobs back, but economists remain unconvinced, saying there is little evidence supporting that approach in the long run.\n\nWhich countries have negotiated new trade deals?\n\nIn June, Trump and British Prime Minister Keir Starmer said they had signed a trade deal that will slash tariffs on U.K. auto and aerospace industry imports but the details on steel and aluminum have yet to be finalized.\n\nEarlier this month, Trump announced a deal with Vietnam that would impose a 20% tariff on Vietnamese products entering the U.S., as well as a 40% tariff on any transshipped products, goods from other countries passing through Vietnam en route to the U.S. \n\nTrump has also claimed victory for a trade truce with China, with both countries pledging to scale back the retaliatory measures that had intensified in recent months, albeit temporarily. \n\nDozens of countries remain in tariff limbo, and predictions of “90 deals in 90 days” have not materialized. In one interview, the president even claimed to have made 200 deals. Instead, Trump has extended the negotiation deadline to Aug. 1 and sent letters warning of potential action if agreements aren’t reached.\n\nKevin Hassett, the director of the U.S. National Economic Council, told ABC News on Sunday morning that the president had seen “some sketches of deals” negotiated by his advisers, but that he thinks they “need to be better.”\n\nWhen asked whether the threatened tariffs are real, or merely a negotiating tactic, Hasset said, “These tariffs are real if the president doesn’t get a deal that he thinks is good enough, but, you know, conversations are ongoing, and we’ll see where the dust settles.”\n\nOn Tuesday, Trump said he had finalized a deal with Indonesia in which goods from the country will face a 19% tariff while U.S. exports won’t be taxed.\n\nWhat about the lawsuits?\n\nIn May, a U.S. federal court blocked much of Trump’s tariff package, ruling that an emergency law did not provide Trump with unilateral authority to impose tariffs on nearly every country.\n\nTrump had invoked emergency powers under a 1977 law when he initially declared the tariffs, but a three-judge panel of the U.S. Court of International Trade ruled he had exceeded his power.\n\nHowever, a federal appeals court agreed to let the tariffs stay in place while the administration appeals the decision. Arguments in that case are set to take place July 31.\n\nThat case specifically concerned the broad 10% tariffs, not the sector-specific levies, such as those on auto parts and aluminum.\n\nSenior lawmakers have also floated legislation to rein in Trump’s tariff authority, but the efforts have yet to gain traction.\n\nThe Associated Press contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\n() Tariffs have been central to President Donald Trump&#8217;s trade strategy, but&#8230;\n\n\nThis Post: Here Are the Trump Tariffs That Are in Effect first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/here-are-the-trump-tariffs-that-are-in-effect/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-Here039s-which-Trump-tariffs-are-actually-happening.jpg","video":null,"publish_date":"2025-07-16 01:37:20","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.018},{"id":341972850,"title":"Is Now a Good Time to Buy LVMH Stock? Analysts Predict Recovery After Recent Price Dip","text":"LVMH shareholders have endured a torrid 2025 so far, with the French luxury group’s stock market value sinking by a quarter over the last six months. \n\nThe group, which counts Louis Vuitton, Dior and Givenchy among its stable of fashion brands, has seen shares sink by almost a third over the last 12 months as the global luxury rebound has probed sluggish. \n\nLast week Louis Vuitton announced it was targeted by a cyberattack for the third time in the past three months at the beginning of July, after Marks & Spencer, the Co-op and Harrods were all targeted earlier this year. \n\nMeanwhile, LVMH’s drinks division, Moët Hennessy, is being gripped by a €1.3million court case brought by Maria Gasparovic, former chief of staff to executive Jean-Marc Lacave, who was sacked four months after reporting alleged sexual misconduct by senior colleagues. \n\nDespite these recent tribulations for the firm, analysts think shares could be due a rebound. \n\nLVMH revenues contracted 3 per cent to €20.3billion in the first quarter, from €20.7billion a year ago, well below analyst forecasts for sales growth of 2 per cent.\n\nRevenue in the firm’s wines and spirits division, headed up by its Moët and Hennessy brands, declined 9 per cent to €1.3billion.\n\nIts largest category, fashion and leather goods, saw sales fall 5 per cent to €10.1billion, from €10.5billion previously.\n\nThe firm, which was the first in its sector to post figures after the Donald Trump’s ‘liberation day’ tariff announcements, said: ‘In a disrupted geopolitical and economic environment, LVMH remains both vigilant and confident at the start of the year.’\n\nThe French firm, which has a market capitalisation of almost €250billion, owns 75 luxury brands.\n\nIt will publish its results for the first half of its 2025 financial year on 24 July.\n\nA luxury slump \n\nIt isn’t just LVMH that is feeling the pinch, the entire luxury sector is facing a similar downturn.\n\nAfter a post-pandemic peak that saw luxury brands surge on the back of huge demand, external pressures such as geopolitical uncertainty and economic slowdown have precipitated a downturn across the sector.\n\nDuring the course of 2024, the market dipped from €369billion to €364billion, according to figures from Bain & Company, with weaker demand, especially from China and the US, pushing the shrink.\n\nAmerican luxury demand was down around 10 per cent in 2024 compared to its peak in 2022, according to data from Morningstar, while Chinese demand has slipped a quarter in compared with its pre-pandemic high point.\n\nEven so, LVMH has suffered a worse fate than many, with the firm underperforming luxury peers.\n\nMorningstar analysts said LVMH is currently trading below the broker’s value estimate of €620 per share.\n\nAt midday on Thursday, LVMH shares were trading at €496.05 per share.\n\nWhy is LVMH undervalued?\n\nSince January, LVMH shares have fallen some 34 per cent, and was surpassed in value by Hermes, which became the largest luxury goods firm in April.\n\nMorningstar says this is a normalisation after the post pandemic boom, during which the firm said LVMH’s valuation was stretched.\n\nAt the time, LVMH was operating on a price to earnings ratio of 26. Now, having seen its share price half, its PE ratio on a one year rolling basis now stands at 20.2, according to figures form Stockopedia.\n\nIn comparison, the new king of luxury, Hermes, is operating on a PE ratio of 50.8. Likewise, a number of other luxury goods firms have significantly larger PE ratios than LVMH, with Burberry standing at 48.2, EssilorLuxotica at 33.1 and Kering at 26.7.\n\nJelena Sokolova, senior equity analyst at Morningstar, said: ‘We have seen luxury sector slowdowns many times before, but this time LVMH’s valuation has been unfairly hit.\n\n‘The retailer is trading at its lowest forward earnings multiple in seven years and roughly half that of comparable wide-moat peers, which presents an opportunity for investors.’\n\nMorningstar added: ‘Forward earnings multiples are at the lowest for the last seven years and are meaningfully below peers, offering around 30 per cent upside to our fair value estimate.’\n\nHowever, others argue that LVMH’s downturn is far from an unfair reflection on the rest of the business.\n\nDan Coatsworth, investment analyst at AJ Bell, however, told This is Money: ‘LVMH has lost its sparkle after a series of setbacks in recent years. It has focused too much on the aspirational market and these types of buyers have become more cash-conscious, watching their pennies rather than opening their wallets without a care in the world.\n\n‘In contrast, Hermes has explicitly focused on the ultra-rich and has enjoyed more resilient trading. LVMH might now be thinking hard about narrowing its customer focus as that could help to make its products more desirable, which is ultimately what luxury goods is all about.’\n\nIs there a turnaround on the horizon?\n\nLVMH still has exceptional brand strength, which Morningstar says will give it the edge against its peers.\n\nThe group’s brands making up 29 per cent of the luxury leather market, compared to just 8 per cent for Hermes.\n\nThe firm’s impressive storefronts and higher capital spending on retail may help its brands to stand out from their competition.\n\nThe strength of the brand remains, with LVMH having seen fashion and leather sales grow slightly better than the wider sector last year, though this dipped in the first quarter of 2025.\n\nCoatsworth, however, said: ‘LVMH has too many different interests. We’re in an environment where companies are focusing on what they do best and jettisoning non-core assets. LVMH would be better if it just focused on fashion and got rid of the Sephora and DFS retail arms and its various food and drink operations.’\n\nLVMH’s brand strength, unwieldy though it may be, could combine with the potential for an upswing in the sector after the slowdown of the past few years.\n\nMorningstar’s Sokolova certainly thinks this is the case.\n\nShe told This is Money: ‘We expect the luxury industry to return to growth after the current – and last year’s – slowdown, driven by normalisation of demand in the US as post-pandemic excess spending is flushed out – a trend we’ve seen since 2023 – and as Chinese real estate prices stabilize, boosting consumer sentiment. ‘\n\nLVMH derives around 24 per cent of its sales from the US, where consumer sending has also stalled.\n\nMorningstar said: ‘We estimate that post-pandemic excesses have been flushed out of the market, US luxury consumption should come back to growth from more normal levels. We expect US GDP to hold up stronger in the long term.’\n\nChina accounts for a significant portion of LVMH’s sales, with Asia (excluding Japan), accounting for 30 per cent of LVMH sales.\n\nChina’s economy is currently in a period of slow growth, with consumers remaining tight on spending.\n\nIn the first quarter, LVMH revenue from China fell by 11 per cent, with the second quarter expected to follow suit.\n\nSokolova said: ‘Many Chinese spenders are still sitting on substantial savings following the pandemic. We expect LVMH to outperform the industry growth longer-term thanks to strength of the brands and substantial marketing budget.\n\n‘Once sentiment in key markets like China and the US returns to its pre-pandemic trajectory, we expect LVMH to leverage its brand strength and investment capabilities to emerge stronger and better positioned than ever.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nLVMH shareholders have endured a torrid 2025 so far, with the French&#8230;\n\n\nThis Post: Is Now a Good Time to Buy LVMH Stock? Analysts Predict Recovery After Recent Price Dip first appeared on Internewscast Journal","url":"https://internewscast.com/business/is-now-a-good-time-to-buy-lvmh-stock-analysts-predict-recovery-after-recent-price-dip/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-Are-LVMH-shares-cheap-Analysts-eye-rebound.jpg","video":null,"publish_date":"2025-07-16 01:29:19","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.498},{"id":341972856,"title":"DOJ Seeks to Dismiss Lawsuit Concerning Trump’s Election Directive","text":"The Trump administration is urging a federal court to permit the government to implement a series of federally-mandated revisions to election laws that have been in place for many years in certain states.\n\nOn March 25, President Donald Trump signed Executive Order 14248, known as “Preserving and Protecting the Integrity of American Elections.” This directive aims to fundamentally modify the management of elections nationwide, including enforcing a mandate for voters to verify their citizenship through official documentation and curbing vote-by-mail practices where ballots received after Election Day but postmarked beforehand are counted.\n\nOregon and Washington – which have used vote by mail as their default voting mechanism for decades – originally sued for an injunction in early April and then moved to short-circuit the proceedings with a motion for partial summary judgment in late May.\n\nNow, the Trump administration is looking to short-circuit the case in its own favor – and by using a different procedural posture.\n\nOn Monday, in a 41-page motion to dismiss, the government argues there is not even a “case” or “controversy” currently before the district. Rather, the U.S. Department of Justice argues, the states have asked the judge to adjudicate an “abstract dispute.”\n\n“[T]his Court should dismiss this case without even reaching the merits,” the motion argues. “Plaintiffs’ claims also fail on the merits.”\n\nFor the majority of the claims leveled by the states, the Trump administration’s argument is a time-honored recitation of an analytical framework widely understood by legal scholars as “conservative standing doctrine.”\n\nThis judicial theory was created in two cases from the 1920s by conservative judges who sought to restrain the use and limits of constitutional redress. In other words, standing doctrine was created — and has over time been honed and sustained — to limit lawsuits against the government. While technically procedural in nature, as opposed to relying on the underlying merits arguments in a dispute, standing arguments tend to be fact-intensive.\n\nHere, the government says the facts as alleged by the states simply do not add up to something that can even be challenged.\n\nTo hear the DOJ tell it, the section of Trump’s executive order that deals with proof of citizenship is, for now at least, a form of guidance instructing the Election Assistance Commission (EAC) to “take appropriate action” and begin the process of rulemaking. That process, the government says, has not concluded. And, since there is no actual rule to challenge, the states are suing too far in advance.\n\n“Plaintiffs thus cannot establish the requisite ‘concrete and particularized’ and ‘actual or imminent’ injury in fact for standing purposes,” the motion to dismiss reads.\n\nIn fact, the government says, the only action taken toward the “documentary proof of citizenship” portion of the executive order is one letter sent by the EAC to state election officials “seeking ‘consultation’ on ‘development’ of the federal form” that will be used.\n\nThe paucity of action taken so far, the government says, also implicates the overlapping legal concept of ripeness – the idea that a lawsuit must challenge something at the appropriate time, lest it be deemed premature.\n\nFrom the motion to dismiss, at length:\n\nWhile standing seeks to keep federal courts out of disputes involving conjectural injuries, the ripeness doctrine seeks to prevent the adjudication of claims relating to “contingent future events that may not occur as anticipated, or indeed may not occur at all.”\n\nUnder these circumstances—where an operative rule has not even been proposed, much less promulgated in final form—Plaintiff States cannot establish that [the citizenship section of the executive order] is “fit” for review because future events have not yet occurred and, indeed, they “may not occur as anticipated.” This lack of finality and definiteness counsels against judicial intervention. Since a final rule does not yet exist, Plaintiff States do not yet know how they will be harmed—if at all.\n\nThe government largely reprises the same standing and ripeness arguments in order to defend the vote-by-mail section of Trump’s order – which is written in terms of enforcing current ballot receipt deadlines.\n\n“What that action will be, how it will be enforced, and against whom is entirely speculative, and is not a basis for Article III standing or ripeness,” the motion to dismiss argues. “At the outset, the Attorney General has done nothing so far—and so any dispute about what she may do in the future, and whether any such action would violate Plaintiffs’ legal rights, is necessarily speculative.”\n\nThe executive order also contains additional language keyed toward enforcing the directive to require proof of citizenship. Chiefly, and challenged by the plaintiff states, are two sections which discuss combing through state voting records and “prioritizing” existing laws which limit noncitizen voting.\n\nThe government rubbishes Oregon’s and Washington’s concerns in exceedingly strong terms.\n\n“Plaintiffs aver that [the two enforcement sections] will ‘harm Plaintiff States,’ but they do not explain how, when, or why,” the motion goes on. “Plaintiffs allege no facts to suggest that DHS or the Attorney General have taken any steps to review State records and do not explain what about either occurrence would harm them.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nIn this image taken by Mark Schiefelbein for the AP, President Donald&#8230;\n\n\nThis Post: DOJ Seeks to Dismiss Lawsuit Concerning Trump&#8217;s Election Directive first appeared on Internewscast Journal","url":"https://internewscast.com/crime/doj-seeks-to-dismiss-lawsuit-concerning-trumps-election-directive/","image":"https://internewscast.com/wp-content/uploads/2025/06/Man-threatened-to-kill-Trump-and-Vance-on-Bluesky-Feds.jpg","video":null,"publish_date":"2025-07-16 01:22:30","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.226},{"id":341972630,"title":"Vance casts Senate tiebreaker to advance Trump’s DOGE-inspired cuts","text":"This was Vance’s sixth tiebreaker in the Senate, following his deciding vote on July 1 to pass the One Big Beautiful Bill Act.\n\nRepublicans are expected to open debate on the legislation, which also includes $1.1 billion in public broadcasting cuts, in a second vote planned for Tuesday evening. A final vote is expected later this week, but hurdles still remain. \n\nThe White House has pressured the GOP-led Congress to pass the Department of Government Efficiency, with President Donald Trump threatening political consequences for any Republican who votes “no.”\n\nCongress has a tight timeline to send the cuts, totaling roughly $9 billion, back to the House, which narrowly approved the legislation in June. The bill targets funding for the U.S. Agency for International Development, which became slightly smaller after Republicans agreed to exempt $400 million in funding for PEPFAR, a Bush-era AIDS prevention program, in a major concession to centrists wavering on the White House request.\n\nIf Congress does not approve the request by Friday, the clawback statute says the White House must spend the funds before the end of fiscal 2025, which ends on Sept. 30.\n\nSenate Majority Leader John Thune (R-SD) said the rescission is in a quest to “do something meaningful when it comes to reducing the size and scope of the federal government, particularly in areas of our government where we know there is waste, fraud, and abuse.”\n\n“There has been a renewed commitment to reducing spending,” Thune added. \n\nCollins, who leads the Appropriations Committee, said earlier in the day she was “grateful” that PEPFAR would be removed but signaled she still has concerns with other “problematic” parts of the bill.\n\nOther Republicans, including McConnell, have expressed broader complaints that the rescission request could undermine America’s “soft power” on the world stage to deter adversaries. \n\nDemocrats, none of whom voted in favor of advancing the rescission bill, condemned the proposed cuts as kneecapping life-saving foreign aid and vital funding for domestic news programs on NPR and PBS. To win over rural-state Republicans concerned about slashing broadcast funds for tribal communities, the administration promised to redirect a separate pool of money through the Interior Department to tribal broadcasting.\n\n“DOGE comes along with its chainsaw approaches. They just cut, cut, cut,” Senate Minority Chuck Schumer (D-NY) said. “They have no idea what the consequences will be, and they don’t give a hoot.”\n\nSENATE REPUBLICANS TO SPARE GLOBAL AIDS PROGRAM FROM DOGE CUTS\n\nSchumer is trying to convince enough Republicans to buck final passage by threatening to retaliate with a de facto shutdown and withholding required Democratic votes later this year to fund the government. \n\nRepublicans so far see it as a bluff to appease a frustrated base and are placing early bets that the latest shutdown rhetoric is a repeat of a claim made earlier this year that Schumer ultimately reversed.","summary":"Republicans moved one step closer to clawing back billions in foreign aid on Tuesday after Vice President JD Vance cast his latest tiebreaking vote to bring the package of DOGE-inspired cuts to the Senate floor. In a 51-50 vote, the Senate discharged the funding clawback, known as a rescissions request, out of the Appropriations Committee [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3472375/vance-tiebreaker-rescissions-vote-senate-doge-inspired-cuts-trump/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/02/20250203-East-Palestine-VP-JD-Vance-04-1024x683.webp","video":null,"publish_date":"2025-07-16 01:20:24","author":"Ramsey Touchberry and David Sivak","authors":["Ramsey Touchberry and David Sivak"],"language":"en","category":"politics","source_country":"US","sentiment":-0.154},{"id":341969694,"title":"'Not going to talk about it...': US Attorney General Pam Bondi dodges question on Epstein Files","text":"US Attorney General Pam Bondi dodged questions, on July 15, about US President Donald Trump's comments on the Epstein files at a press conference at the Drug Enforcement Administration (DEA). When asked if she is expected to keep her job, she said, \"I am going to be here for as long as the president wants me here - and I believe he's made that crystal clear.\" Bondi declined to comment on deputy FBI Director Dan Bongino, saying she does not discuss personnel matters. Bongino returned to work following a weekend call with the president, according to one source.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/not-going-to-talk-about-it-us-attorney-general-pam-bondi-dodges-question-on-epstein-files/videoshow/122544874.cms","image":"https://img.etimg.com/thumb/msid-122544874,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-122544874,imgsize-53748.cms","publish_date":"2025-07-16 01:18:16","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.499},{"id":341971882,"title":"Trump officials to send home 2,000 National Guard troops deployed to Los Angeles after immigration raids","text":"The Trump administration is releasing 2,000 National Guard troops, half the number deployed last month in response to protests, following immigration raids in the area.\n\n“Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,” Pentagon spokesperson Sean Parnell said in a statement Tuesday. “As such, the Secretary has ordered the release of 2,000 California National Guardsmen (79th IBCT) from the federal protection mission.”\n\nThe move comes after President Donald Trump ordered 4,000 troops to be deployed last month in the wake of protests breaking out in response to a string of ICE raids across Los Angeles.\n\nAfter disembarking Marine One Tuesday evening, the president didn’t respond when asked why he was pulling troops from Los Angeles.\n\nCalifornia Governor Gavin Newsom called for the remaining 2,000 troops to be sent home in a statement shared to social media on Tuesday evening.\n\nThe Trump administration ordered half the National Guard troops in Los Angeles to be sent home, one month after they were first deployed in response to demonstrations over immigration raids (AFP via Getty Images)\n\n“For more than a month, @realDonaldTrump has been exploiting @TheCalGuard as his political pawns. Thousands of members are still federalized in Los Angeles for no reason and unable to carry out their critical duties across the state,” the governor wrote. “End this theater and send everyone home.”\n\nAfter deploying the initial 2,000 National Guard troops, the president ordered the mobilization of an additional 2,000 California National Guard to be called into federal service to support ICE’s efforts. At the time, Newsom blasted the move as “purposefully inflammatory” and predicted it would “only escalate tensions.”\n\nThe state of California then sued the Trump administration over its deployment, claiming the decision has “caused real and irreparable damage” to both Los Angeles and the state’s larger sovereignty. Trump’s decision marked the first time the state National Guard had been federalized by a president since 1965. The appeals court sided with the president, saying Trump \"exercised his statutory authority\" when he activated the troops.\n\nProtests erupted in Los Angeles and across the country last month as Immigration and Customs Enforcement conducted raids, disrupting communities (Getty Images)\n\nThe decision to send troops home comes days after Department of Homeland Security Secretary Kristi Noem announced federal officers arrested more than 300 people at a marijuana facility in southern California on July 10. Days later, that figure rose to 361 after DHS said agents raided another cannabis farm in the area.\n\nAt least one worker died after he was chased by federal agents during one of the farm raids, according to United Farm Workers.\n\nThe move also follows a federal judge ordering the Trump administration to halt indiscriminate immigration stops and arrests across seven counties in the state.\n\nThe Justice Department appealed the decision on Monday.","url":"https://uk.news.yahoo.com/trump-officials-send-home-2-010823965.html","image":"https://media.zenfs.com/en/the_independent_577/0ec3e4afbc99ab13d62349eef9b3fb3b","video":"","publish_date":"2025-07-16 01:08:23","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.342},{"id":341972156,"title":"Trump officials to send home 2,000 National Guard troops deployed to Los Angeles after immigration raids","text":"The Trump administration is releasing 2,000 National Guard troops, half the number deployed last month in response to protests, following immigration raids in the area.\n\n“Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,” Pentagon spokesperson Sean Parnell said in a statement Tuesday. “As such, the Secretary has ordered the release of 2,000 California National Guardsmen (79th IBCT) from the federal protection mission.”\n\nThe move comes after President Donald Trump ordered 4,000 troops to be deployed last month in the wake of protests breaking out in response to a string of ICE raids across Los Angeles. \n\nAfter disembarking Marine One Tuesday evening, the president didn’t respond when asked why he was pulling troops from Los Angeles.\n\nCalifornia Governor Gavin Newsom called for the remaining 2,000 troops to be sent home in a statement shared to social media on Tuesday evening. \n\n“For more than a month, @realDonaldTrump has been exploiting @TheCalGuard as his political pawns. Thousands of members are still federalized in Los Angeles for no reason and unable to carry out their critical duties across the state,” the governor wrote. “End this theater and send everyone home.”\n\nAfter deploying the initial 2,000 National Guard troops, the president ordered the mobilization of an additional 2,000 California National Guard to be called into federal service to support ICE’s efforts. At the time, Newsom blasted the move as “purposefully inflammatory” and predicted it would “only escalate tensions.”\n\nThe state of California then sued the Trump administration over its deployment, claiming the decision has “caused real and irreparable damage” to both Los Angeles and the state’s larger sovereignty. Trump’s decision marked the first time the state National Guard had been federalized by a president since 1965. The appeals court sided with the president, saying Trump \"exercised his statutory authority\" when he activated the troops. \n\nThe decision to send troops home comes days after Department of Homeland Security Secretary Kristi Noem announced federal officers arrested more than 300 people at a marijuana facility in southern California on July 10. Days later, that figure rose to 361 after DHS said agents raided another cannabis farm in the area.\n\nAt least one worker died after he was chased by federal agents during one of the farm raids, according to United Farm Workers.\n\nThe move also follows a federal judge ordering the Trump administration to halt indiscriminate immigration stops and arrests across seven counties in the state.\n\nThe Justice Department appealed the decision on Monday.","summary":"Half the number deployed last month remain in the area","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-national-guard-los-angeles-b2789764.html","image":"https://static.independent.co.uk/2025/07/16/0/19/Members-of-the-California-National-Guard-stand-watch-in-front-of-the-Edward-Roybal-Federal-Building.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/3XimNRpI-OhrQWqOm.mp4","publish_date":"2025-07-16 01:08:23","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.367},{"id":341969696,"title":"Sesame Workshop condemns antisemitic content after Elmo's X account hacked","text":"APSesame Workshop released statement condemning antisemitic and racist content posted to Elmo's X account after it was hacked by outside party Sunday\n\nSesame Workshop released a statement condemning antisemitic and racist content posted to Elmo's X account after it was compromised by hackers Sunday, July 12.The organization confirmed that Elmo's social media account was \"briefly hacked by an outside party\" despite existing security measures. The hack resulted in the posting of what Sesame Workshop described as \"abhorrent antisemitic and racist content.\" Also read: Donald Trump dragged into Elmo X account hack: Antisemitic posts spark outrage | Controversy explainedSesame Workshop responds to Elmo account hackSesame Workshop's official statement addressed the security breach and the inappropriate content that appeared on the popular children's character's social media account.\"We strongly condemn the abhorrent antisemitic and racist content, and the account has since been secured,\" the organization stated.Elmo's X account restored after antisemitic postsThe children's entertainment company emphasized that the offensive posts did not represent the values of either Sesame Workshop or Sesame Street. No employees or representatives from the organization were involved in creating or posting the controversial content.\"These posts in no way reflect the values of Sesame Workshop or Sesame Street, and no one at the organization was involved,\" the statement continued.Sesame Street distances itself from hacked contentSesame Workshop's response highlighted the disconnect between the hacked content and the educational mission of Sesame Street. The organization worked to quickly restore security to Elmo's X account following the breach.Also read: 'Words I never expected...': Elmo’s X account goes rogue with offensive messages, sends netizens into frenLive EventsThe hack of Elmo's account represents a security incident involving one of children's television's most recognizable characters. Sesame Workshop has not disclosed additional details about the investigation into the account compromise or specific security measures implemented following the incident.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onantisemitic contentSesame WorkshopSesame StreetElmo's X account hackracist contenthacked social media account\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onantisemitic contentSesame WorkshopSesame StreetElmo's X account hackracist contenthacked social media account(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"Sesame Workshop issued statement after Elmo's X account was hacked Sunday, July 12, posting antisemitic and racist content. Organization condemned posts and confirmed account security has been restored following breach","url":"https://economictimes.indiatimes.com/news/international/us/sesame-workshop-condemns-antisemitic-content-after-elmos-x-account-hacked/articleshow/122544191.cms","image":"https://img.etimg.com/thumb/msid-122544170,width-1200,height-630,imgsize-76744,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-16 01:05:57","author":"Tionssesame Workshop","authors":["Tionssesame Workshop"],"language":"en","category":"politics","source_country":"in","sentiment":-0.383},{"id":341969188,"title":"Trump Denies Urging Ukraine To Strike Moscow, Warns Putin Over Ceasefire Deadline","text":"US President Donald Trump on Tuesday distanced himself from recent reports claiming he encouraged Ukraine to launch strikes deep into Russian territory, firmly stating that Ukrainian President Volodymyr Zelenskyy \"should not target Moscow.\"\nThe statement came just a day after Trump revealed a more aggressive approach toward Russia, which includes a fresh round of military aid to Ukraine—part of what he described as a \"toughened stance.\"\n\"I’m not on anyone’s side,\" Trump told reporters gathered on the South Lawn of the White House. \"I’m on the side of humanity, because I want to stop the killing.\"\n.@POTUS: \"I'm on nobody's side ... I want the killing to stop in the Ukraine-Russia war. That's the side I'm on.\" pic.twitter.com/ohuOudFp6R\n— Rapid Response 47 (@RapidResponse47) July 15, 2025\nBacktracking On Moscow Strike Claims\nThe president's comment came in response to a report by The Financial Times, which alleged that Trump had privately asked Zelenskyy whether Ukraine could target Moscow if equipped with long-range American weapons. When asked directly about the claim on Tuesday, Trump dismissed the idea outright.\n\"No, he shouldn’t target Moscow,\" Trump responded bluntly, signaling a retreat from any suggestion of direct assaults on the Russian capital.\nFrustration With Putin, Blame On Biden\nTrump expressed disappointment with Russian President Vladimir Putin, despite noting his role in ending other global conflicts. Framing the ongoing war as something his administration would have avoided, Trump labeled it \"a Biden war, not a Trump war,\" emphasising that his aim now is to extricate the United States from what he views as a spiraling conflict.\n50-Day Countdown: Ceasefire Or Consequences\nIn a bold move, Trump issued a 50-day ultimatum to Moscow: agree to a ceasefire or face sweeping new sanctions and tariffs, including a possible 100% duty on Russian oil and goods. The warning marks a sharp escalation, although Trump offered few details on how a peace deal might be brokered—or whether negotiations are even underway.\n\"If there's no deal in 50 days, we'll impose secondary tariffs - 100 percent. That's how it's going to be,\" he warned. \"I don't think 50 days is very long — and it could be sooner than that.\"\nHis latest remarks follow a recent decision by the Pentagon to pause military aid shipments to Ukraine. However, during a press briefing from the Oval Office with NATO Secretary-General Mark Rutte at his side, Trump confirmed that billions of dollars’ worth of U.S.-manufactured weapons would be sent to NATO allies.\n\"We are going to produce top-of-the-line weapons, and they will go to NATO,\" Trump declared.","summary":"&lt;p&gt;US President Donald Trump on Tuesday distanced himself from recent reports claiming he encouraged Ukraine to launch strikes deep into Russian territory, firmly stating that Ukrainian President Volodymyr Zelenskyy &quot;should not target Moscow.&quot;&lt;/p&gt;\n&lt;p&gt;The statement came just a day after Trump revealed a more aggressive approach toward Russia, which includes a fresh round of military aid to Ukraine&amp;mdash;part of what he described as a &quot;toughened stance.&quot;&lt;/p&gt;\n&lt;p&gt;&quot;I&amp;rsquo;m not on anyone&amp;rsquo;s side,&quot; Trump told reporters gathered on the South Lawn of the White House. &quot;I&amp;rsquo;m on the side of humanity, because I want to stop the killing.&quot;&lt;/p&gt;\n&lt;blockquote class=&quot;twitter-tweet&quot;&gt;\n&lt;p dir=&quot;ltr&quot; lang=&quot;en&quot;&gt;.&lt;a href=&quot;https://twitter.com/POTUS?ref_src=twsrc%5Etfw&quot;&gt;@POTUS&lt;/a&gt;: &quot;I'm on nobody's side ... I want the killing to stop in the Ukraine-Russia war. That's ","url":"https://news.abplive.com/news/world/us-president-donald-trump-denies-urging-ukraine-to-strike-moscow-warns-putin-over-ceasefire-1788115","image":"https://feeds.abplive.com/onecms/images/uploaded-images/2025/07/10/cc5ced48da807a301a76ac3877df87c41752115951606208_original.jpg?impolicy=abp_cdn&imwidth=1200&height=675","video":null,"publish_date":"2025-07-16 01:05:38","author":"ABP Live News","authors":["ABP Live News"],"language":"en","category":"politics","source_country":"in","sentiment":-0.172},{"id":341969616,"title":"'It's a delicate subject, but...': Trump aide Mike Johnson on release of Epstein files","text":"US House Speaker Mike Johnson has called on the Justice Department to release all documents related to Jeffrey Epstein, the disgraced financier who died in federal custody in 2019 while facing sex-trafficking charges.In an interview on Tuesday with podcaster Benny Johnson, Mike said: “It’s a very delicate subject, but we should put everything out there and let the people decide it.”Johnson’s remarks marked a rare public disagreement with US President Donald Trump, his close ally in Congress, over an issue that has angered many in Trump’s conservative base, as reported by The Guardian.Trump has faced criticism from his supporters for failing to make public all information about Epstein, who allegedly had ties to many powerful figures. Last week, the justice department concluded that Epstein’s death was a suicide and announced that no list of clients would be released, rejecting conspiracy theories.Conservative allies of Trump have accused him and US attorney general Pam Bondi of handling the case poorly.During the interview, Speaker John also referred to Bondi’s earlier claim on Fox News that she had Epstein’s client list on her desk to review: “She needs to come forward and explain that to everybody. We need the DOJ focusing on major priorities. So let’s get this thing resolved.”Earlier on Tuesday, House Republicans voted down a proposal from Democrats. The proposal would have added a rule to a new law that would require the justice department to release Epstein-related files.Despite this setback, Democrats say they will keep pushing the issue. Members of the House Judiciary Committee have called on its Republican chair, Representative Jim Jordan, a Trump ally, to hold hearings with Bondi, her deputy and FBI leaders to answer questions about Epstein.Speaking to reporters before leaving the White House for Pittsburgh on Tuesday, Trump defended Bondi but suggested she could choose to release more documents: “She’s handled it very well, and it’s going to be up to her. Whatever she thinks is credible, she should release.”When NBC News asked Bondi about Trump's MAGA allies' frustration with how she has handled the case, she shifted the focus to other issues: “We’re going to fight to keep America safe again. We’ve got a war on drugs. We’ve got a war on human trafficking. We’ve got cartels in this country … we have foreign adversaries around this world as well, and we’re all going to work together as a team.”","summary":"US House Speaker Mike Johnson has urged the Justice Department to release all Jeffrey Epstein documents, a move that contrasts with ally Donald Trump's stance. This call follows criticism of Trump's administration for its handling of the case. House Republicans rejected a Democratic proposal to mandate the release of Epstein-related files.","url":"https://timesofindia.indiatimes.com/world/us/its-a-delicate-subject-but-trump-aide-mike-johnson-on-release-of-epstein-files-demands-pam-bondi-to-come-forward/articleshow/122543931.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-122544097/122544097.jpg","video":null,"publish_date":"2025-07-16 01:02:12","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.11},{"id":341972308,"title":"Joy Reid claims MAGA voters will sacrifice their daughters to please Trump","text":"Ex-MSNBC host Joy Reid said that MAGA voters would \"let their daughters be destroyed\" just to make President Donald Trump \"happy.\" During a recent episode of \"NIGHT SCHOOL with Marc Lamont Hill,\" Reid mentioned her concern that Trump \"could declare a national emergency\" and that the country would no longer have \"free and fair elections.\" Lamont remarked that the \"one glimmer of hope\" he sees is that Trump is limited to this term and questioned whether \"the Trump movement has the ability to move beyond Trump,\" and if Vice President JD Vance can lead MAGA after Trump leaves office. TRUMP'S MAGA IMPRINT ON GOP STRONG NOW, BUT WILL IT LAST? EXPERTS WEIGH IN Reid remarked how former President Barack Obama had an electorate that would only show up for him, and that Trump's following is similar but more cult-like. \"There is just an Obama voter that will only vote when Obama is on the ballot and will not vote even below the ballot,\" Reid said. \"They will not vote down ticket, just Obama.\" \"Trump has those kind of voters,\" she added. \"They are dedicated to him personally. They care more about him being happy than them being happy. They care more about him having what he wants than them having what they want.\" \"They will give up their healthcare. They will let their daughters be destroyed. They will let their families be destroyed. They will do- there's nothing he can do. He can drown them in … Texas. He can take away their FEMA. He can do anything he wants to them. There's nothing you can do about it's a cult.\" JOY REID FLOATS SPECULATION THAT HER RACE, 'ANXIETY' SURROUNDING TRUMP PLAYED ROLE IN MSNBC FIRING Reid then went on to say that she believes Vance does not have what it takes to keep the Trump momentum alive. \"And JD Vance, with his lack of charisma, he's just an a--hole, he has no personality,\" Reid said. \"He's the personality of Ron DeSantis. Um, so, no, there is no one else who can run the cult.\" However, Reid said, she was concerned about White voters and their \"propensity\" to vote for Republicans. \"But the problem is, there's the cult and then there is just this propensity among White voters to vote for any Republican and to create an adherence to any Republican because they just hate Democrats, and they don't care … no one likes Ted Cruz, but they'll vote for him any day of the week because he is not a Democrat,\" Reid added. CLICK HERE TO GET THE FOX NEWS APP","summary":"Joy Reid criticized MAGA voters as cult-like followers who prioritize Trump over their wellbeing, stating they would sacrifice their families while claiming JD Vance lacks charisma.","url":"https://www.foxnews.com/media/joy-reid-claims-maga-voters-sacrifice-daughters-please-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/joy-reid.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-16 01:00:48","author":"Rachel Del Guidice","authors":["Rachel Del Guidice"],"language":"en","source_country":"us","sentiment":-0.337},{"id":341969488,"title":"Stormy Parliament Monsoon Session Ahead: Govt Lists Key Bills; Oppn To Raise Bihar SIR, Air India Crash","text":"With the monsoon session of Parliament set to begin on July 21, an intense showdown is on the cards between the government and the opposition. While the government has lined up a list of key bills for introduction and passage, opposition parties are gearing up to corner the treasury benches on a range of contentious issues.\nThe opposition is expected to demand discussions on the recent Air India crash and the preliminary probe that appears to attribute blame to the two deceased pilots, raising concerns over accountability and transparency. Additionally, the opposition is likely to question the government on the timing and circumstances surrounding US President Donald Trump’s declaration of India’s ceasefire with Pakistan during Operation Sindoor, which was announced even before any official Indian confirmation.\nThe opposition is also raising questions over the special intensive revision (SIR) of voter rolls currently being undertaken by the Election Commission in poll-bound Bihar, demanding greater clarity and transparency.\nDespite these looming confrontations, the government has prioritised legislative business. At the top of the agenda is the Income-tax Bill, 2025, which was introduced in the Lok Sabha on February 13 this year and referred to a joint parliamentary committee (JPC) led by BJP MP Baijayant “Jay” Panda. The JPC is scheduled to adopt the draft report on Wednesday, after which the amended bill will be sent to the union cabinet for approval and is expected to be brought to Parliament for passage during this session.\nAmong the other bills listed for consideration is the Manipur Goods and Services Tax (Amendment) Bill, 2025, aimed at aligning the state GST law with the central legislation. Another key bill is the Jan Vishwas (Amendment of Provisions) Bill, 2025, which seeks to promote ease of doing business and improve regulatory compliance.\nIn the education sector, the Indian Institutes of Management (Amendment) Bill, 2025, proposes to bring IIM Guwahati under the formal fold of the IIM Act, giving it statutory recognition. Tax reforms are also on the cards through the Taxation Laws (Amendment) Bill, 2025, which introduces changes to streamline current tax laws.\nThe government is also focusing on environmental and scientific resource conservation. The Geoheritage Sites and Geo-relics (Preservation and Maintenance) Bill, 2025, aims to protect geologically important sites, while the Mines and Minerals (Development and Regulation) Amendment Bill, 2025, seeks to regulate the scientific exploration of deep-seated and critical minerals.\nIn the sports sector, the National Sports Governance Bill, 2025, proposes ethical and governance reforms to improve accountability in sports bodies. Just last week, the government declared its new sports policy.\nThe National Anti-Doping (Amendment) Bill, 2025, aligns India’s anti-doping regulations with global standards set by the World Anti-Doping Agency (WADA) and ensures the institutional independence of the National Anti-Doping Appeal Panel.\nUnder other business, the government has listed a resolution for the extension of President’s Rule in Manipur, originally imposed on February 13, 2025. As per constitutional provisions under Article 356(1), Parliament’s approval is required every six months, and President’s Rule cannot be extended beyond three years.\nAdditionally, the demands for grants for the state of Manipur for the financial year 2025 will also be taken up during the session.\nAn all-party meeting has been called on Sunday, July 20, where the government will brief leaders across the political spectrum on the legislative agenda and floor strategy for the session. This meeting will also provide the opposition a platform to raise its list of pressing issues and demand time for urgent discussions.\nThe monsoon session will run from July 21 to August 21, with a three-day break from August 13 to 15 on account of Independence Day celebrations. On the opening day of the session, Prime Minister Narendra Modi is expected to address the media ahead of House proceedings.","summary":"The session will run from July 21 to August 21, with a three-day break from August 13 to 15 on account of Independence Day celebrations","url":"https://www.news18.com/politics/stormy-parliament-monsoon-session-ahead-govt-lists-key-bills-oppn-to-raise-bihar-sir-air-india-crash-9443007.html","image":"https://images.news18.com/ibnlive/uploads/2025/02/Parliament-Budget-Session-1-2025-02-ff8a20404f99d966f6292c6d75b68230.jpg","video":null,"publish_date":"2025-07-16 01:00:13","author":"News18,Pathikrit Sen Gupta,Payal Mehta","authors":["News18","Pathikrit Sen Gupta","Payal Mehta"],"language":"en","category":"politics","source_country":"in","sentiment":0.265},{"id":341969708,"title":"With Epstein conspiracy theories, Trump faces a crisis of his own making","text":"AgenciesTrump called the Epstein case \"pretty boring\" and said \"the credible information has been given.\"\n\nNEW YORK: As his supporters erupt over the Justice Department's failure to release much-hyped records in Jeffrey Epstein's sex trafficking investigation, President Donald Trump's strategy has been to downplay the issue. \"I don't understand what the interest or what the fascination is,\" Trump told reporters Tuesday. His problem? That nothing-to-see-here approach doesn't work for those who've learned from him they must not give up until the government's deepest, darkest secrets are exposed. Last week, the Justice Department and the FBI abruptly walked back the notion there's an Epstein client list of elites who participated in the wealthy New York financier's trafficking of underage girls. Trump quickly defended Attorney General Pam Bondi and chided a reporter for daring to ask about the documents. The online reaction was swift, with followers calling the Republican president \"out of touch\" and demanding transparency.Live Events Trump's comments to reporters Tuesday while returning to Washington from a brief Pittsburgh trip were just the latest in a days-long campaign to quell the uproar. He called the Epstein case \"pretty boring\" and said \"the credible information has been given.\" \"I don't understand why the Jeffrey Epstein case would be of interest to anybody.\" he said. Trying to 'put the genie back in the bottle' Over the weekend, Trump used his Truth Social platform to attempt to call supporters off the Epstein trail amid reports of infighting between Bondi and FBI Deputy Director Dan Bongino over the issue. He suggested the turmoil was undermining his administration - \"all over a guy who never dies, Jeffrey Epstein.\" That did little to mollify Trump's supporters, who urged him to release the files or risk losing his base. The political crisis is especially challenging for Trump because it's one of his own making. The president has spent years stoking dark theories and embracing QAnon-tinged propaganda that casts him as the only savior who can demolish the \"deep state.\" Now that he's running the federal government, the community he helped build is coming back to haunt him. It's demanding answers he either isn't able to or doesn't want to provide. Asked Tuesday whether Bondi had told him his name was in the Epstein files, Trump said no. He praised her handling of the case and said she should release \"whatever she thinks is credible.\" But he also claimed there were credibility issues with the documents, suggesting without citing evidence they were \"made up\" by former FBI Director James Comey and former Presidents Barack Obama and Joe Biden, both Democrats. Bondi declined to discuss the Epstein files Tuesday during a press briefing about drug trafficking. \"The faulty assumption Trump and others make is they can peddle conspiracy theories without any blowback,\" said Matt Dallek, a political scientist at George Washington University. \"The Epstein case is a neat encapsulation that it is hard to put the genie back in the bottle.\" A problem that's not going away Last week's two-page statement from the Justice Department and the FBI saying they had concluded Epstein didn't possess a client list roiled Trump's supporters, who pointed to past statements from several administration officials that the list ought to be revealed. Bondi had suggested in February such a document was sitting on her desk waiting for review, though last week she said she'd been referring generally to the Epstein case file, not a client list. Conservative influencers have since demanded to see all the files related to Epstein's crimes, even as Trump has tried to put the issue to bed. Far-right commentator Jack Posobiec said at Turning Point USA's Student Action Summit on Saturday he wouldn't rest \"until we go full Jan. 6 committee on the Jeffrey Epstein files.\" Trump's weekend post called on supporters to focus on investigating Democrats and arresting criminals rather than \"spending month after month looking at nothing but the same old, Radical Left inspired Documents on Jeffrey Epstein.\" His first-term national security adviser, retired Lt. Gen. Michael Flynn, pleaded with him to reconsider. \"@realdonaldtrump please understand the EPSTEIN AFFAIR is not going away,\" Flynn wrote. Other Trump allies continue to push for answers, among them far-right activist Laura Loomer, who has called for Bondi to resign. She told Politico's Playbook newsletter on Sunday a special counsel should be appointed to investigate the handling of the files on Epstein, who was found dead in his federal jail cell in 2019 weeks after he was arrested. House Speaker Mike Johnson told right-wing influencer Benny Johnson in an interview released Tuesday that he is \"for transparency,\" and wants Bondi to \"put everything out there and let the people decide.\" He said the Justice Department needs to focus on crime and other priorities, including elections and investigating ActBlue, the Democrats' top fundraising platform. Experts who study conspiracy theories warned more sunlight doesn't necessarily make far-fetched narratives disappear. \"For some portion of this set of conspiracy theory believers, no amount of contradictory evidence will ever be enough,\" said Josephine Lukito, who studies conspiracy theorists at the University of Texas at Austin. Trump and his colleagues set their own trap The president and many figures in his administration - including Bondi, Bongino and FBI Director Kash Patel - earned their political capital over the years in part by encouraging disproven conspiracy theories. Now, they're tasked with trying to reveal the evidence they'd long insisted was there - a challenge that's reached across the government. Last week, Environmental Protection Agency Administrator Lee Zeldin posted on X what seemed like an endorsement of a conspiracy theory that the contrails left by aircraft are releasing chemicals for potentially nefarious reasons. But a second post from Zeldin underscored the fine line the Trump administration is trying to walk by linking to a new page on the EPA website that essentially debunked the theory. The value of conspiratorial fabrications is they help people get political power, said Russell Muirhead, who teaches political science at Dartmouth College. He said Trump has been skilled in exploiting that. But the Epstein case brings unique challenges, he said. That's because it's rooted in truth: A wealthy and well-connected financier did spend years abusing large numbers of young girls while escaping justice. So, Trump needs to come forward with truth and transparency on the topic, Muirhead said. If he doesn't, \"large segments of his most enthusiastic and devoted supporters are going to lose faith in him.\" A potentially costly distraction Trump's rivals have been taking advantage of right-wing fissures over Epstein. Democrats sought to capitalize on the controversy, with several lawmakers calling for the release of all Epstein files and suggesting Trump could be resisting because he or someone close to him is featured in them. The Democratic House Majority PAC on Tuesday emailed a memo that called out some House Republicans by name. It said they are \"complicit\" with the Trump administration because they had called for the Epstein files to be made public but then voted against a Democratic amendment to force their release. Conservatives expressed concerns Trump's approach on Epstein could hurt them in the midterms. \"For this to go away, you're going to lose 10% of the MAGA movement,\" right-wing podcaster Steve Bannon said during the Turning Point USA Student Action Summit on Friday. There's also the challenge of governing. Bondi and Bongino had a tense exchange last week at the White House over a story about Epstein, according to a person familiar with the matter who spoke on the condition of anonymity to discuss a private conversation. And Loomer, who's close to Trump, said Friday she was told Bongino was \"seriously thinking about resigning.\" The FBI declined to comment. Dallek, the George Washington University professor, said it's alarming that the country's top law enforcement officials are feuding over a conspiracy theory. \"It's possible at some time voters are going to notice the things they want or expect government to do aren't being done because the people in charge are either incompetent or off chasing rabbits,\" he said. \"Who is fulfilling the mission of the FBI to protect the American people?\"(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onepsteinepstein conspiracy theoriestrump epsteinsex traffickingepstein filesBondi epstein files\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onepsteinepstein conspiracy theoriestrump epsteinsex traffickingepstein filesBondi epstein files(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"The political crisis is especially challenging for Trump because it's one of his own making. The president has spent years stoking dark theories and embracing QAnon-tinged propaganda that casts him as the only savior who can demolish the \"deep state.\"","url":"https://economictimes.indiatimes.com/news/international/global-trends/with-epstein-conspiracy-theories-trump-faces-a-crisis-of-his-own-making/articleshow/122543925.cms","image":"https://img.etimg.com/thumb/msid-122544386,width-1200,height-630,imgsize-32706,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-07-16 00:57:25","author":"Ectionswith Epstein","authors":["Ectionswith Epstein"],"language":"en","category":"politics","source_country":"in","sentiment":-0.185},{"id":341967024,"title":"Pew survey finds Australians now favour China economic ties over US","text":"A majority of Australians say it is more important to have strong economic ties with China than with the United States, according to new research from the Washington-based Pew Research Centre.\n\nPew's latest survey of 24 countries found that opinion towards the US and its president, Donald Trump, had deteriorated, while views of China and its president, Xi Jinping, had improved in many countries worldwide.\n\nMore than half — 53 per cent — of Australians surveyed said they favoured placing more importance on economic ties with China, a large increase from 39 per cent in 2021.\n\nOnly 42 per cent of Australians said it was more important to prioritise economic ties with the US — a drop from 52 per cent who said the same thing in 2021.\n\nPew found the US was viewed more favourably than China in eight countries, China was viewed more favourably in seven, and the two were viewed about equally in the remainder.\n\nPew did not provide definitive explanations for the shifts, but Laura Silver, associate director of research, said it is possible that views of a country may change when those of another superpower shift.\n\n\"As the US potentially looks like a less reliable partner and people have limited confidence, for example, in Trump to lead the global economy, China may look different in some people's eyes,\" Dr Silver said.\n\nAlso, China's human rights policies and its handling of the pandemic — which were related to negative views of the country in the past — may not weigh as much this time, she said.\n\nA group of Democratic senators this week accused the Trump administration of ceding global influence to China by shuttering foreign aid programs, imposing tariffs on allies, cracking down on elite universities, and restricting visas for international students.\n\nIn the Pew findings, 35 per cent of those in 10 high-income countries surveyed consistently — including Canada, France, Germany and Italy — have favourable opinions of the US, down from 51 per cent from last year.\n\nBy comparison, 32 per cent of them have positive views of China, up from last year's 23 per cent.\n\nAnd 24 per cent of them say they have confidence in Mr Trump, compared with 53 per cent last year for then-US president Joe Biden.\n\nMr Xi scored a slight improvement: 22 per cent of those in these rich countries say they have confidence in the Chinese president, up from last year's 17 per cent.\n\nHowever, people in Israel have far more favourable views of the US than of China: 83 per cent of Israelis like the US, compared with 33 per cent who say they have positive views of China.\n\nSome 69 per cent of Israelis said they have confidence in Mr Trump, while only 9 per cent expressed confidence in Mr Xi.\n\nPew surveyed more than 30,000 people across 25 countries — including the US, which was excluded from the comparison — from January 8 to April 26, 2025.\n\nThe margins of error for each country ranged from plus or minus 2.5 to plus or minus 4.7.\n\nChina's economy grows robustly despite trade war\n\nChina's economy slowed slightly in the last quarter as Mr Trump's trade war escalated, but it still expanded at a robust 5.2 per cent pace, the Chinese government said on Tuesday, local time.\n\nThat compares with 5.4 per cent annual growth in January-March.\n\nChinese authorities said that in quarterly terms, the world's second-largest economy expanded by 1.1 per cent.\n\nIn the first half of the year, the Chinese economy grew at a 5.3 per cent annual pace, the official data show.\n\nHowever, some analysts said actual growth may have been significantly slower.\n\nZichun Huang of Capital Economics noted that investments in fixed assets such as factory equipment rose only 2.8 per cent in the first half of the year, implying 2.9 per cent annual growth in May and a mere 0.5 per cent increase in June.\n\nThe 5.2 per cent growth rate overstates the pace of expansion by about 1.5 percentage points, she said.\n\nCapital Economics' activity proxy shows growth in China's gross domestic product, or GDP, at less than 4 per cent year-on-year in April and May, Dr Huang said, forecasting annual growth of 3.5 per cent for full-year 2025.\n\nDr Huang added, though, that \"political pressure to meet annual growth targets, even if only on paper, means that published GDP growth will be much higher\".\n\nA key factor behind the latest upbeat data was strong exports.\n\nOn Monday, China reported that its exports accelerated in June, rising 5.8 per cent from a year earlier, up from a 4.8 per cent increase in May.\n\nProduction of high-tech products, vehicles and electrical machinery and equipment rose by about 10 per cent or more from a year earlier.\n\nA reprieve on painfully high tariffs on Chinese exports to the US prompted a rush of orders by companies and consumers as the two sides resumed trade talks.\n\nChinese companies also have expanded exports to and offshore manufacturing in other countries such as Vietnam, helping to offset the impact of higher tariffs imposed by the Trump administration.\n\nBut a 0.1 per cent decline in consumer prices in the first half of 2025 showed continuing weakness in domestic demand, a long-term challenge for the ruling communist party as the Chinese population declines and ages.\n\nThose troubles deepened during and after the COVID-19 pandemic.\n\nFalling property prices and slowing retail sales were also of concern, said Lynne Song of ING Economics.\n\nPrice cutting by Chinese manufacturers to help compete in overseas markets is adding to deflationary pressures that ultimately erode their competitiveness, Louise Loo of Oxford Economics said in a report.\n\nChinese leaders have set a growth target of 5 per cent for this year, in line with last year's growth.\n\nA resumption of US tariffs of up to 245 per cent if Washington and Beijing fail to meet an August 12 deadline for a new trade deal could derail the recovery in exports, a major driver of growth and employment.","summary":"Pew Research Centre's latest survey of 24 countries found that opinion towards the US and its president, Donald Trump, had deteriorated, while views of China and its president had improved.","url":"https://www.abc.net.au/news/2025-07-16/pew-research-shows-global-view-of-china-improves-as-us-worsens/105536860","image":"https://live-production.wcms.abc-cdn.net.au/934658ebb5cb1bcc8dbf4e83c0c2940b?impolicy=wcms_crop_resize&cropH=1152&cropW=2048&xPos=0&yPos=175&width=862&height=485","video":null,"publish_date":"2025-07-16 00:56:51","author":"ABC News","authors":["ABC News"],"language":"en","source_country":"AU","sentiment":-0.149},{"id":341969500,"title":"Morning Digest: SCO shouldn’t compromise on terrorism, says Jaishankar; UIDAI urges parents of children between five and seven to update Aadhaar biometrics, and more","text":"UIDAI urges parents of children between five and seven to update Aadhaar biometrics\n\nThe Unique Identification Authority of India (UIDAI) on Tuesday (July 15, 2025) urged parents of children between the age of 5 and 7 to update their kids’ Aadhaar biometrics.\n\nBalasore student death: UGC forms four-member fact finding committee\n\nFollowing the death of a student at the Fakir Mohan (Autonomous) College in Odisha’s Balasore, the University Grants Commission, on Tuesday (July 15, 2025), said that it has formed a fact finding committee to investigate the issue.\n\nGroup Captain Shukla extracted in stable condition from capsule, undergoing post-mission medical evaluation: ISRO\n\nThe Indian Space Research Organisation (ISRO) on Tuesday (July 15, 2025) said that Indian astronaut Group Captain Shubhanshu Shukla was undergoing a structured post-mission medical evaluation and recovery protocol under the supervision of Axiom Space and ISRO flight surgeons.\n\nSCO must have an ‘uncompromising position’ on terrorism, Jaishankar tells Foreign Ministers\n\nThe Pahalgam terrorist attack of April 22 was carried out to hurt the Jammu and Kashmir economy and to “sow a religious divide”, External Affairs Minister S. Jaishankar told the Shanghai Cooperation Organisation’s (SCO) Council of Foreign Ministers (SCO-CFM) meeting in China, where other SCO Ministers — including Pakistan’s Deputy Prime Minister and Foreign Minister Ishaq Dar — were present, and called for support to bring the perpetrators to justice.\n\nAir India to progressively restore international flights stopped after June 12 crash\n\nAir India will partially resume international flights from August 1, after the “safety pause” necessitated by the Directorate General of Civil Aviation’s safety checks on its Boeing 787-8 fleet following the deadly crash of AI-171 on June 12. \n\nPendency of ‘untouchability’ cases in courts remains over 97%, shows government report\n\nThe number of criminal cases registered under the Protection of Civil Rights Act (PCR Act), 1955, for offences related to “untouchability” has seen a decline, with pendency in courts remaining above 97% and nearly all disposed cases resulting in acquittals, according to the Union government’s 2022 annual report on the implementation of the law.\n\nNot demonising Mughal rulers in textbooks: NCERT social science panel head\n\nThe history section of the newly introduced Class 8 social science textbook by the National Council of Educational Research and Training (NCERT) for students in the current 2025-26 academic year portrays Mughal rulers, especially Babur, Akbar, and Aurangzeb, as “intellectuals” who also “plundered” the Indian population.\n\nU.S. military to remove 2,000 National Guard troops from Los Angeles\n\nU.S. Defense Secretary Pete Hegseth has ordered the removal of half of the 4,000 National Guard troops who had been sent to Los Angeles to protect federal property and personnel during a spate of protests last month, the Pentagon said on Tuesday. \n\nTrump says any ‘credible’ Epstein files should be released\n\nDonald Trump said on Tuesday (July 15, 2025) the U.S. Justice Department should release all “credible” information from its probe into notorious sex criminal Jeffrey Epstein as he sought to douse a firestorm of criticism from his supporters over his handling of the case.","summary":"Here is a select list of stories to start the day","url":"https://www.thehindu.com/news/the-hindu-morning-digest-july-16-2025/article69816269.ece","image":"https://th-i.thgim.com/public/incoming/e9rzil/article69816100.ece/alternates/LANDSCAPE_1200/20250715137L.jpg","video":null,"publish_date":"2025-07-16 00:52:46","author":"The Hindu Bureau","authors":["The Hindu Bureau"],"language":"en","source_country":"in","sentiment":-0.133},{"id":341969618,"title":"'Pretty boring stuff': Donald Trump downplays 'fascination' surrounding Epstein files; blames ‘bad people’ for keeping it alive","text":"US President Donald Trump on Tuesday dismissed renewed interest in the Jeffrey Epstein case, calling it “pretty boring stuff” and saying he didn’t understand why many of his own supporters were so focused on it.Speaking to reporters in Pennsylvania after an event, Trump reacted to questions about ongoing uproar within his base following the release of a Justice department and FBI memo last week. The memo said Epstein had no client list and confirmed he died by suicide in his New York jail cell in 2019.“I don’t understand it, why they would be so interested. He’s been dead for a long time. He was never a big factor in terms of life. I don’t understand what the interest and what the fascination is. I really don’t. And the credible information has been given,” Trump said.He added, “I don’t understand why the Jeffrey Epstein case would be of interest to anybody. It’s pretty boring stuff. It’s sordid, but it’s boring. And I don’t understand why it keeps going. I think really only pretty bad people, including fake news, want to keep something like that going.”Despite Trump's remarks, many within the MAGA movement remain unsatisfied with the government’s findings. The absence of a \"client list\" in the memo has fuelled speculation among conspiracy theorists, who have long believed that high-profile Democrats and celebrities were connected to pedophile Epstein’s alleged sex trafficking network.Anger has also been directed at US attorney general Pam Bondi, with people for her removal over what they claim is a lack of transparency around the Epstein files. Bondi had previously said in a February interview that an Epstein client list was “sitting on” her “desk” for review. She has since clarified that she was referring more broadly to files connected to the case.On Tuesday, Trump defended Bondi but said she should move forward with any disclosures that can be verified.“But she’s handled it very well, and it’s going to be up to her whatever she thinks is credible, she should release,” Trump said.In early June, tech billionaire Elon Musk and Trump's former right-hand man reignited controversy by suggesting that the MAGA chief's name appears in the unreleased Epstein files, claiming this was the real reason they had not been made public. Musk first made the allegation on X, saying ,“Time to drop the really big bomb… @realDonaldTrump is in the Epstein files,” before later deleting the post. He has since called on the White House to release all related documents, demanding full transparency.Epstein had faced multiple accusations of trafficking underage girls and was known to associate with powerful figures such as Trump, former US President Bill Clinton, Prince Andrew of Britain, and several wealthy elites. His long-time associate Ghislaine Maxwell was convicted in 2021 for her role in facilitating the abuse. His death is still debated by many, with conspiracy theories claiming he was murdered to protect high-profile individuals. Despite official rulings that he died by suicide in his New York jail cell in 2019, questions around security failures and missing footage have fuelled public suspicion and kept the controversy alive.","summary":"Donald Trump dismissed renewed interest in the Jeffrey Epstein case, deeming it \"pretty boring stuff\" and expressing confusion over his supporters' focus. Despite government findings, many in the MAGA movement remain unsatisfied, fueling conspiracy theories about high-profile figures connected to Epstein's alleged sex trafficking network.","url":"https://timesofindia.indiatimes.com/world/us/pretty-boring-stuff-donald-trump-downplays-fascination-surrounding-epstein-files-blames-bad-people-for-keeping-it-alive/articleshow/122542816.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-122543528/122543528.jpg","video":null,"publish_date":"2025-07-16 00:49:30","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.279},{"id":341966406,"title":"Bantuan kesihatan global merosot ke paras terendah dalam 15 tahun","text":"PARIS: Pemotongan besar-besaran terhadap bantuan asing yang diketuai oleh Amerika Syarikat (AS) dijangka menyebabkan dana kesihatan antarabangsa merosot ke paras terendah dalam tempoh 15 tahun, menurut satu kajian yang memberi amaran dunia kini memasuki era baharu penjimatan kesihatan global.\n\nWang yang digunakan untuk membiayai rawatan kesihatan bagi golongan termiskin dan paling memerlukan di seluruh dunia dipotong secara mendadak tahun ini, dengan pentadbiran Presiden AS, Donald Trump, menjadi peneraju utama langkah itu.\n\nKajian terbaharu yang diterbitkan dalam jurnal perubatan terkemuka The Lancet turut menyatakan bahawa United Kingdom, Perancis dan Jerman juga mengumumkan pemotongan bantuan secara mendadak.\n\nMenurut anggaran pasukan penyelidik yang diketuai AS itu, selepas mencapai paras tertinggi sepanjang masa iaitu AS$80 bilion (RM340.42 bilion) pada tahun 2021 ketika pandemik COVID-19, jumlah keseluruhan bantuan kesihatan global dijangka jatuh kepada hanya AS$39 bilion (RM165.98 bilion) tahun ini.\n\nJumlah itu adalah yang terendah sejak tahun 2009.\n\n\"Perubahan mendadak ini menandakan dunia sedang memasuki satu era baharu penjimatan kesihatan global.\n\n\"Negara-negara di Sub-Sahara Afrika seperti Somalia, Republik Demokratik Congo yang dilanda konflik, serta Malawi dijangka paling terjejas kerana sebahagian besar pembiayaan sistem kesihatan mereka bergantung kepada bantuan antarabangsa,\" menurut penulis kajian.\n\nKajian turut menyatakan pemotongan dana ini akan memberi kesan besar terhadap rawatan dan pencegahan pelbagai penyakit berjangkit termasuk HIV, AIDS, malaria dan tuberkulosis.\n\nAS mengurangkan bantuan kesihatan globalnya sekurang-kurangnya sebanyak 67 peratus bagi tahun 2025 berbanding tahun sebelumnya, manakala UK mengurangkan hampir 40 peratus, diikuti Perancis sebanyak 33 peratus dan Jerman sebanyak 12 peratus.\n\nSementara penyelidik dari Institut Penilaian Metrik dan Kesihatan (IHME) yang berpangkalan di AS menggesa dunia segera meningkatkan semula bantuan kesihatan. \n\nMereka turut memberi amaran bahawa negara-negara penerima perlu mencari sumber pembiayaan alternatif untuk menampung keperluan kesihatan mereka.\n\nSatu lagi kajian berasingan yang turut diterbitkan dalam The Lancet awal bulan ini menganggarkan bahawa pemotongan bantuan asing oleh AS saja boleh mengakibatkan lebih 14 juta kematian yang boleh dielakkan menjelang tahun 2030.\n\nSebagai perbandingan, sekitar 10 juta askar terbunuh semasa Perang Dunia Pertama.","summary":"PARIS: Pemotongan besar-besaran terhadap bantuan asing yang diketuai oleh Amerika Syarikat (AS) dijangka menyebabkan dana kesihatan antarabangsa merosot ke paras terendah dalam tempoh 15 tahun, menurut satu kajian yang memberi amaran dunia kini memasuki era baharu penjimatan kesihatan global.","url":"https://www.bharian.com.my/dunia/lain-lain/2025/07/1420478/bantuan-kesihatan-global-merosot-ke-paras-terendah-dalam-15-tahun","image":"https://assets.bharian.com.my/images/articles/BH16health-o_BHfield_image_listing_featured.var_1752626834.jpg","video":null,"publish_date":"2025-07-16 00:47:20","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":1},{"id":341971268,"title":"Parents’ Rights Groups Ask Trump Admin to Address Alleged COVID-Era Targeting by DOJ","text":"WASHINGTON—Rep. Andy Biggs (R-Ariz.) joined leaders from parental rights groups on Capitol Hill on July 15 to ask President Donald Trump to vindicate parents who say they were targeted by law enforcement after they pushed back against COVID-19 restrictions in schools.\n\n“Parents don’t surrender their rights at the school doors,” Biggs said.","summary":"The groups say parents around the country were targeted as 'extremists' by the FBI and Department of Justice when they pushed back on COVID policies.","url":"https://www.theepochtimes.com/us/parents-rights-groups-ask-trump-admin-to-address-alleged-covid-era-targeting-by-doj-5887808","image":"https://img.theepochtimes.com/assets/uploads/2025/07/15/id5887685-123_1-2-stacy-300x180.jpg","video":null,"publish_date":"2025-07-16 00:46:45","author":"Stacy Robinson","authors":["Stacy Robinson"],"language":"en","source_country":"us","sentiment":-0.895},{"id":341967154,"title":"Top executives depart Tesla after months of turmoil and sales slump","text":"Top executives have recently departed Tesla after months of turmoil caused by CEO Elon Musk’s stint in politics and a sales slump at the electric car company.\n\nTroy Jones, vice president of sales, service and delivery in Tesla’s North American market, left the firm after 15 years,The Wall Street Journal reported Tuesday, citing people familiar with the matter. \n\nSeveral other Tesla higher-ups have left the company in the past year. \n\nMilan Kovac, a vice president of engineering who oversaw Tesla’s development of its humanoid robot Optimus, announced his departure in June. \n\n“This week, I’ve had to make the most difficult decision of my life and will be moving out of my position. I’ve been far away from home for too long, and will need to spend more time with family abroad,” Kovac, who had worked at the company for more than nine years, wrote on X at the time. \n\nHe added: “I want to make it clear that this is the only reason, and has absolutely nothing to do with anything else. My support for @elonmusk and the team is ironclad - Tesla team forever.”\n\nJenna Ferrura, Tesla’s director of human resources for North America, has also left. Bloomberg reported in June, citing people familiar with the matter, Ferrura no longer appeared in the company directory. \n\nOmead Afshar, who oversaw sales and manufacturing operations in North America and Europe, has departed the company as well. \n\nForbes reported in June, citing people familiar with the matter, Afshar was fired by Musk after being promoted to his position in October. Bloomberg called Afshar one of Musk’s “closest confidants,” working at the company since 2017. \n\nThe E-suite shakeups come during a rough few months for Tesla. Musk made waves among a key demographic of EV buyers when he led President Donald Trump’s Department of Government Efficiency. Musk left the White House in late May, and his relationship with Trump quickly soured.\n\nThere have been protests at Tesla dealerships and even some cases of attacks on property at car showrooms and lots, charging stations and involving privately owned Tesla cars. \n\nAgainst this backdrop, Tesla’s global vehicle sales dropped 13.5 percent in the second fiscal quarter of 2025, the Journal reported earlier this month.\n\nThe company reported worse-than-expected Tesla deliveries. There were 384,122 Tesla vehicles delivered in the second quarter, off the 387,000 estimate from analysts, according to FactSet. \n\nTesla’s stock has also significantly decreased over the past six months. The stock was at around $413 per share on January 16, compared to about $308 per share on Tuesday, according to MarketWatch.\n\nThe company has been trying to entice customers with an updated Model Y midsize SUV and a cheaper version of its Cybertruck.\n\nJune was a particularly big month for Tesla as the company unveiled new versions of its Model S and Model X luxury cars and launched a pilot of its robotaxi service in Austin.","summary":"Troy Jones, vice president of sales, service and delivery in Tesla’s North American market, left the firm after 15 years, a new report says","url":"https://www.independent.co.uk/news/world/americas/elon-musk-tesla-executives-leave-sales-slump-b2789749.html","image":"https://static.independent.co.uk/2025/07/15/23/24/GettyImages-2204003073.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/XY1A72ut-OhrQWqOm.mp4","publish_date":"2025-07-16 00:41:59","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"business","source_country":"gb","sentiment":-0.437},{"id":341971076,"title":"Will K-12 students be disadvantaged by DC layoffs? Of course not","text":"WASHINGTON — Who needs the U.S. Department of Education to stay just the way it is?\n\nNot Education Secretary Linda McMahon, who sees it as her mission to be “the last secretary” of a vast bureaucracy known more for its aspirations than its successes.\n\nIn the meantime, McMahon wants to cut the behemoth down to size. So, in keeping with President Donald Trump’s agenda, McMahon ordered nearly 1,400 layoffs. Predictably, the usual suspects protested. The case made it all the way to the U.S. Supreme Court, which issued an unsigned order Monday that allowed the layoffs to proceed, pending further litigation.\n\nThe three justices picked by Democratic presidents dissented. Justice Sonia Sotomayor wrote, “When the Executive publicly announces its intent to break the law, and then executes on that promise, it is the Judiciary’s duty to check that lawlessness, not expedite it.”\n\nLawlessness? It tells you everything when Sotomayor, joined by Justices Elena Kagan and Ketanji Brown Jackson, thinks it’s illegal for a president to cut the bureaucracy. At least without the participation of Congress.\n\nIt’s hard to watch this scrap and not think about how much good will Big Education has squandered in the course of my career, particularly since COVID-19 closures showed work-from-home parents how the sausage was made.\n\nMore than 40 years ago, the then-new federal education bureaucracy was supposed to improve student learning. Yet only 31% of fourth-graders performed as proficient or better at reading in last year’s National Assessment of Educational Progress test; 40% of fourth-graders were below basic.\n\nNo surprise: According to a recent Gallup poll, 73% of adults are dissatisfied with the quality of public education.\n\n“A lot of money gets spent paying people in the bureaucracy” as opposed to the classroom itself, Bill Evers, a senior fellow at the libertarian-leaning Independent Institute, told me. And, Evers reminded me, he’s a former assistant secretary at the Department of Education.\n\nThere’s a lack of rigor in public education, but also, too much politics.\n\nEvers is a veteran of the Math Wars and the Reading Wars of the 1990s that pitted concerned parents against an establishment that wanted to reshape classroom instruction to echo its left-wing politics.\n\nThe education establishment tried to turn math into a political exercise, for which there were no wrong answers, but too many essay questions.\n\nProlonged COVID-19 school closures, supported by teachers unions, kept students out of the schoolhouse. As Evers offered, “Under the supervision of the department, a year and a half of learning was lost, particularly with low-income kids.”\n\nI don’t think that today’s K-12 students are going to be shortchanged because of some D.C. layoffs, at least not the way kids were left out in the cold during COVID-19.\n\nIn her dissent, Sotomayor wrote of her belief that the Department of Education safeguards “equal access to learning.”\n\nBut that’s not how the system really works.\n\nContact Review-Journal Washington columnist Debra J. Saunders at dsaunders@reviewjournal.com. Follow @debrajsaunders on X.","summary":"Who needs the U.S. Department of Education to stay just the way it is?","url":"https://www.ocregister.com/2025/07/15/will-k-12-students-be-disadvantaged-by-dc-layoffs-of-course-not/","image":"https://www.ocregister.com/wp-content/uploads/2025/05/AP25116803296911.jpg?w=1024&h=683","video":null,"publish_date":"2025-07-16 00:39:53","author":"Debra J. Saunders","authors":["Debra J. Saunders"],"language":"en","source_country":"us","sentiment":-0.199},{"id":341964618,"title":"Australia urges economic engagement amid uncertainty","text":"In the face of extreme uncertainty, collaboration will be top of mind as the treasurer prepares to meet with leaders from some of the world's most important economies.\n\nDays before the first parliamentary sitting week of Labor's second term, Treasurer Jim Chalmers is set to head to Durban in South Africa for a gathering of finance ministers and central bank governors from G20 countries.\n\nAs conflict in the Middle East, Eastern Europe and the threat of US tariffs continue to shake global markets, Dr Chalmers said there has never been a more important time to collaborate, noting the international economic environment would shape domestic policy.\n\n\"We are navigating a world where volatility, uncertainty and unpredictability are now the norm, not the exception,\" he said.\n\n\"Subdued global growth, extreme uncertainty and fragmentation demands more engagement, more collaboration and more resilience and that's what guides our strategy.\"\n\nHe has also stressed the importance of free and open markets, and will prioritise strengthening ties and bolstering supply chains in his meetings.\n\nAustralia has not yet received a tariff letter from the US president, but Donald Trump has imposed a baseline 10 per cent tariff on most of its goods and a 50 per cent levy on steel and aluminium.\n\nThe federal government has floated using critical minerals as a bargaining chip to try to carve out a tariff exemption and Dr Chalmers confirmed he would discuss the resource with other countries' leaders at the event.\n\nHe is also expected to meet with his counterparts from Japan, Indonesia, Canada, the UK, South Africa and Germany, many of which will have a higher tariff rate imposed on their goods from August 1.\n\n\"The Australian economy is not immune from global uncertainty but we are well-placed and well-prepared to face the challenges ahead,\" Dr Chalmers said.\n\nAll of this would form the backdrop to Labor's second-term economic agenda, which includes ambitious goals to boost flagging productivity.\n\nThe coalition has signalled a willingness to work with Labor on productivity, but specifically through cuts to red tape and regulation, Liberal senator Jane Hume said.\n\nParliament will resume on Tuesday.","summary":"As volatility and uncertainty become a global norm, the treasurer has stressed the importance of collaboration ahead of his meetings with world leaders.","url":"https://www.perthnow.com.au/news/politics/australia-urges-economic-engagement-amid-uncertainty-c-19371688","image":"https://images.perthnow.com.au/publication/C-19371688/aac8c1d97305aa58e4d5f6eecc2e386dc0385840-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-07-16 00:39:23","author":"Kat Wong,Kat Wongaap","authors":["Kat Wong","Kat Wongaap"],"language":"en","category":"business","source_country":"au","sentiment":0.223},{"id":341967708,"title":"Trump Says Any 'Credible' Epstein Files Should Be Released","text":"President Donald Trump said Tuesday the US Justice Department should release all \"credible\" information from its probe into notorious sex criminal Jeffrey Epstein as he sought to douse a firestorm of criticism from his supporters over his handling of the case.Trump is facing the most serious split of his political career from his famously loyal right-wing base over suspicions that his administration is covering up lurid details of Epstein's crimes to protect rich and powerful figures they say are implicated. \"The attorney general has handled that very well,\" the Republican leader said of Pam Bondi, who leads the Justice Department, when he was asked about the case at the White House.Trump repeated his claim that the Epstein files were \"made up\" by his Democratic predecessors in the White House -- even though he said multiple times during the election campaign that he would \"probably\" release them.\"She's handled it very well, and it's going to be up to her,\" Trump said. \"Whatever she thinks is credible, she should release.\"Trump's latest comments mark a softening of his stance -- he had voiced frustration in the Oval Office and online about his supporters' fixation on Epstein and pleaded with them to move on.\"I don't understand why the Jeffrey Epstein case would be of interest to anybody,\" Trump told reporters Tuesday night, adding: \"It's pretty boring stuff.\"The president's \"Make America Great Again\" (MAGA) movement has long held as an article of faith that \"Deep State\" elites are protecting Epstein's most powerful associates in the Democratic Party and Hollywood.Trump has faced growing outrage since his administration effectively shut down Epstein-related conspiracy theories, which have become MAGA obsessions.The Justice Department and FBI said in a memo made public earlier this month there is no evidence that the disgraced financier kept a \"client list\" or was blackmailing powerful figures.They also dismissed the claim that Epstein was murdered in jail, confirming his death by suicide, and said they would not be releasing any more information on the probe.It marked the first time Trump's officials had publicly refuted the stories -- pushed for years by numerous right-wing figures, notably including the FBI's top two officials, before Trump hired them.Beyond angering supporters, the issue has opened a schism within his administration, sparking a fiery blow-up between Bondi and Deputy FBI Director Dan Bongino, who is said to be considering resigning.Trump's attempts to take the sting out of the controversy have largely failed, with far right influencers continuing to criticize him online.Even his daughter-in-law, Lara Trump, a Fox News host, has called for \"more transparency\" from the administration.Trump's most powerful ally in the US Congress, House Speaker Mike Johnson, pushed Tuesday for the administration to release more information about the case, and his stance has been echoed by multiple Republicans. \"We should put everything out there and let the people decide,\" he told MAGA influencer Benny Johnson's internet show, calling on Bondi to \"come forward and explain\" apparent discrepancies in her statements about the case.Bondi told Fox News in February a list of Epstein clients was on her desk for review, before backtracking and saying that no such list existed. Epstein died by suicide in a New York prison in 2019 after being charged with sex trafficking.Trump -- who has denied visiting the US Virgin Islands home where prosecutors say Epstein sex trafficked underage girls -- said ahead of his election he would have \"no problem\" releasing files related to the case.Asked whether Bondi had told him if his name appeared in a file related to Epstein, Trump said \"no,\" adding that Bondi has \"given us just a very quick briefing.\"","summary":"President Donald Trump said Tuesday the US Justice Department should release all \"credible\" information from its probe into notorious sex criminal Jeffrey Epstein as he sought to douse a firestorm of criticism from his supporters over his handling of the case.","url":"https://www.ibtimes.com/trump-says-any-credible-epstein-files-should-released-3778586","image":"https://d.ibtimes.com/en/full/4611008/us-justice-department-concluded-that-jeffrey-epstein-had-died-suicide.jpg","video":null,"publish_date":"2025-07-16 00:36:07","author":"Frankie Taggart","authors":["Frankie Taggart"],"language":"en","category":"politics","source_country":"US","sentiment":-0.365},{"id":341964164,"title":"Pentagon ends deployment of 2,000 National Guard troops in Los Angeles","text":"The Pentagon said Tuesday it is ending the deployment of 2,000 National Guard troops in Los Angeles, accounting for nearly half of the soldiers sent to the city to deal with protests over the Trump administration's immigration crackdown.\n\nRoughly 4,000 National Guard soldiers and 700 Marines have been in the city since early June. It wasn't immediately clear what prompted the 60-day deployment to end suddenly, nor was it immediately clear how long the rest of the troops would stay in the region.\n\nIn late June, the top military commander in charge of troops deployed to LA had asked Defense Secretary Pete Hegseth for 200 of them to be returned to wildfire fighting duty amid warnings from California Gov. Gavin Newsom that the Guard was understaffed as California entered peak wildfire season.\n\nThe end of the deployment comes a week after federal authorities and National Guard troops arrived at MacArthur Park with guns and horses in an operation that ended abruptly. Although the U.S. Department of Homeland Security wouldn’t explain the purpose of the operation or whether anyone had been arrested, local officials said it seemed designed to sow fear.\n\n“Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,\" Chief Pentagon spokesman Sean Parnell said in a statement in announcing the decision.\n\nOn June 8, thousands of protesters took to the streets in response to Trump’s deployment of the Guard, blocking off a major freeway as law enforcement used tear gas, rubber bullets and flash bangs to control the crowd. Photos captured several Waymo robotaxis set on fire.\n\nA day later, police officers used flash bangs and shot projectiles as they pushed protesters through Little Tokyo, where bystanders and restaurant workers rushed to get out of their way.\n\nMayor Karen Bass set a curfew in place for about a week that she said had successfully protected businesses and helped restore order. Demonstrations in the city and the region in recent weeks have been largely small impromptu protests around arrests.\n\nBass applauded the troops' departure.\n\n“This happened because the people of Los Angeles stood united and stood strong. We organized peaceful protests, we came together at rallies, we took the Trump administration to court — all of this led to today’s retreat,\" she said in a statement, adding that \"We will not stop making our voices heard until this ends, not just here in LA, but throughout our country.”\n\nOn Tuesday afternoon, there was no visible military presence outside the federal complex downtown that had been the center of early protests and where National Guard troops first stood guard before the Marines were assigned to protect federal buildings. Hundreds of the soldiers have been accompanying agents on immigration operations.\n\nPresident Donald Trump ordered the deployment against the wishes of Newsom, who sued to stop it.\n\nNewsom argued that Trump violated the law when he deployed the California National Guard troops despite his opposition. He also argued that the National Guard troops were likely violating the Posse Comitatus Act, which prohibits troops from conducting civilian law enforcement on U.S. soil.\n\nNewsom won an early victory in the case after a federal judge ruled the Guard deployment was illegal and exceeded Trump’s authority. But an appeals court tossed that order, and control of the troops remained with the federal government. The federal court is set to hear arguments next month on whether the troops are violating the Posse Comitatus Act.\n\nThe deployment of National Guard troops was for 60 days, though Defense Secretary Pete Hegseth had the discretion to shorten or extend it “to flexibly respond to the evolving situation on the ground,” the Trump administration’s lawyers wrote in a June 23 filing in the legal case.\n\nFollowing the Pentagon's decision Tuesday, Newsom said in a statement that the National Guard’s deployment to Los Angeles County has pulled troops away from their families and civilian work “to serve as political pawns for the President.”\n\nHe added that the remaining troops “continue without a mission, without direction and without any hopes of returning to help their communities.\"\n\n\"We call on Trump and the Department of Defense to end this theater and send everyone home now,” he said.\n\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"The Pentagon said Tuesday it is ending the deployment of 2,000 National Guard troops in Los Angeles, accounting for nearly half of the soldiers sent to the city…","url":"https://japantoday.com/category/world/pentagon-ends-deployment-of-2-000-national-guard-troops-in-los-angeles","image":"https://media.japantoday.com/img/store/22/57/cf3fa76aeabcc09104efa553c1da623cd7be/download/_w1700.jpeg","video":null,"publish_date":"2025-07-16 00:35:56","author":"Japan Today Editor,Julie Watson","authors":["Japan Today Editor","Julie Watson"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.194},{"id":341966404,"title":"Lebih separuh tentera Pengawal Kebangsaan dari Los Angeles ditarik balik","text":"WASHINGTON: Setiausaha Pertahanan Amerika Syarikat (AS), Pete Hegseth mengarahkan pengunduran separuh daripada 4,000 anggota Pengawal Nasional yang ditempatkan di Los Angeles bagi melindungi harta benda dan kakitangan persekutuan ketika gelombang protes bulan lalu, menurut Pentagon, semalam.\n\nJurucakap Pentagon, Sean Parnell, berkata keputusan dibuat susulan kejayaan misi itu.\n\n\"Terima kasih kepada anggota tentera yang tampil melaksanakan tugas, insiden ketenteraman awam di Los Angeles kini semakin reda.\n\n\"Justeru, Setiausaha Pertahanan mengarahkan 2,000 anggota Pengawal Nasional California berundur daripada misi perlindungan persekutuan,\" katanya.\n\nTerdahulu, Presiden AS, Donald Trump menghantar anggota Pengawal Nasional ke Los Angeles pada Jun lalu, walaupun mendapat tentangan daripada Gabenor Demokrat, Gavin Newsom, bagi meredakan protes yang tercetus selepas serbuan imigresen oleh ejen Agensi Penguatkuasaan Imigresen dan Kastam (ICE).\n\nBeliau turut menghantar sekitar 700 anggota Marin.\n\nWalaupun berdepan cabaran undang-undang, Mahkamah Rayuan AS membenarkan Trump mengekalkan kawalan terhadap Pengawal Nasional California.\n\nNamun, tindakan beliau menghantar tentera ke Los Angeles mencetuskan perdebatan nasional mengenai penggunaan angkatan tentera di tanah air dan menambah ketegangan politik di bandar kedua terpadat di AS. \n\nPentagon mempertahankan tindakan itu dengan menyatakan bahawa perlindungan terhadap ejen ICE penting bagi membolehkan mereka menjalankan tugas.\n\nWalaupun 2,000 anggota ditarik balik, seramai 2,000 lagi anggota Pengawal Nasional dan kira-kira 700 anggota Marin masih kekal di Los Angeles.\n\nMalah ribuan tentera aktif juga dikerahkan ke sempadan dengan Mexico dan Pentagon mewujudkan zon tentera di kawasan sempadan.\n\nZon itu diwujudkan bagi membolehkan pentadbiran Trump menggunakan tentera untuk menahan migran tanpa perlu mengisytiharkan Akta Pemberontakan 1807 yang membolehkan Presiden menggunakan tentera untuk mengekang kekacauan awam.\n\nIni susulan Trump berikrar untuk mengusir berjuta-juta pendatang tanpa izin di negara itu dan menjalankan serbuan di tempat kerja termasuk ladang-ladang pertanian, lokasi yang sebelum ini dikecualikan semasa penggal pertamanya.\n\nPentadbiran beliau kini berdepan puluhan saman di seluruh negara berhubung kaedah penguatkuasaan itu.","summary":"WASHINGTON: Setiausaha Pertahanan Amerika Syarikat (AS), Pete Hegseth mengarahkan pengunduran separuh daripada 4,000 anggota Pengawal Nasional yang ditempatkan di Los Angeles bagi melindungi harta benda dan kakitangan persekutuan ketika gelombang protes bulan lalu, menurut Pentagon, semalam.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1420470/lebih-separuh-tentera-pengawal-kebangsaan-dari-los-angeles-ditarik","image":"https://assets.bharian.com.my/images/articles/BH16remove-o_BHfield_image_listing_featured.var_1752626002.jpg","video":null,"publish_date":"2025-07-16 00:33:28","author":"REUTERS","authors":["REUTERS"],"language":"en","source_country":"my","sentiment":1},{"id":341965778,"title":"Trump announces creation of 'AI economy' during innovation summit","text":"July 15 (UPI) -- Pennsylvanians and the nation will benefit from $100 billion in energy- and artificial intelligence-related investments announced on Tuesday to energize the nation's growing AI economy.\n\nThe investments should create tens of thousands of new jobs for Pennsylvanians in the energy and AI sectors while helping the United States improve its economy and global AI standing, President Donald Trump said during Tuesday's inaugural Pennsylvania Energy and Innovation Summit in Pittsburgh.\n\n\"We're here today because we believe America's destiny is to dominate every industry and be the first in every technology,\" Trump told attendees.\n\n\"That includes being the world's No. 1 superpower in artificial intelligence,\" he added.\n\nThe president said the United States is \"way ahead of China\" in AI development and has many plants under construction.\n\n\"China and other countries are racing to catch up to America having to do with AI,\" Trump said.\n\n\"We're not going to let them do it,\" he said. \"We have the great chips [and] the great everything.\"\n\nTrump said the United States is \"going to be fighting them in a very friendly fashion,\" adding that he and Chinese President Xi Jinping have a \"great relationship.\"\n\n\"Remaining the world's leader in AI will require an enormous increase in energy production,\" Trump told the audience.\n\nHe said \"clean, beautiful coal\" and oil production will be a key element in producing more electrical power to support AI endeavors in the United States and to stay ahead of China in AI development.\n\nMore than $56 billion in new energy infrastructure and $36 billion in new data projects were announced on Tuesday, the president said.\n\nA $15 billion investment by Knighthead Capital Management will create the largest natural gas-fired power generation plant in North America in Homer City, Pa.\n\nGoogle also is investing \"billions and billions\" to revitalize two hydropower facilities in the commonwealth, Trump added.\n\nWestinghouse officials also have announced that the company will build several nuclear power plants throughout the nation to ensure the AI economy has ample energy available.\n\n\"A lot more than that will be announced in the coming weeks and months,\" Trump added.\n\nThe president said 20 \"leading technology and energy companies\" are poised to invest in Pennsylvania to develop an AI economy that utilizes the commonwealth's energy and technology assets, CBS News reported.\n\nMany firms are investing elsewhere in the country, too, in order to support the nation's AI economy, according to the New York Post.\n\nTrump spoke for about 30 minutes during the hour-long Pennsylvania Energy and Innovation Summit, which was organized by Sen Dave McCormick, R-Pa., and held on the campus of Carnegie Mellon University.\n\nPennsylvania's Democratic Gov. Josh Shapiro and others joined Trump and McCormick to discuss energy matters and the growth of AI in the United States.","summary":"Pennsylvanians will benefit from $100 billion in energy- and artificial intelligence-related investments to energize the nation's growing AI economy.","url":"https://www.upi.com/Top_News/US/2025/07/15/ai-economy/8431752624022/","image":"https://cdnph.upi.com/sv/ph/og/upi/8431752624022/2025/1/3b98907fc8c78fa75697a2a49048aca0/v1.5/Trump-announces-creation-of-AI-economy-during-innovation-summit.jpg","video":null,"publish_date":"2025-07-16 00:31:13","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"US","sentiment":0.024},{"id":341963576,"title":"Joe Rogan confronts Gavin Newsom with 'tough' questions on pandemic record","text":"California Democratic Gov. Gavin Newsom was pressed to defend his COVID-19 record by podcast giant Joe Rogan on Monday. The Democratic leader, and likely 2028 presidential candidate, appeared on former U.S. Navy SEAL Shawn Ryan’s podcast for a wide-ranging interview about problems facing California as well as Newsom’s personal life and political career. During the interview, Ryan asked Newsom to respond to a question sent in to him by his friend and fellow podcaster. \"Motherf-----r,\" Newsom exclaimed before saying he was a fan of Rogan, who has been critical of the Democrat. Ryan warned Newsom it was a \"tough\" question before reading it aloud: \"Who will be held accountable for mandating COVID-19 vaccines for children, which were unnecessary and ineffective, and who will take responsibility for the unprecedented increases in myocarditis and cancer cases among them?\" ROGAN MOCKS ‘MY FAVORITE PODCASTER’ GAVIN NEWSOM AS DEMOCRATS ATTEMPT TO RECAPTURE PODCASTING \"Second to that, do you feel any remorse for that draconian decision that was obviously heavily influenced by the pharmaceutical companies’ desire for maximum profit?\" Newsom denied that he caved to the pharmaceutical industry, saying he’s passed \"some of the most progressive laws\" against Big Pharma in the nation. He also defended his record on the pandemic, arguing California worked closely with the Trump administration and moved aggressively to mitigate damage from the virus, \"like many states, red states included.\" \"I mean, Florida shut down their bars and restaurants before California. The question was, when did we start to unwind some of those restrictions? California was more restrictive and we were certainly aggressive at scale,\" he said. The governor claimed his team was compiling an \"objective review\" of the good and bad outcomes of these policies and comparing them to what other states did. Regarding vaccines, Newsom declared they \"save lives\" but that he respected Rogan's question. He explained that he received \"a lot of feedback\" from independent advisors regarding their safety. \"I took their advice, not as a doctor, but as a governor. So, with humility —seriously —humility and grace, I've asked them to have that report done. It's going to be done next month. And it'll be the only state that I know of that is putting out a truly objective review of what went right and what went wrong,\" he added. SOUTH CAROLINA DEMOCRAT SAYS NEWSOM MUST EXPLAIN 'MANY FAILURES IN CALIFORNIA' BEFORE PRESIDENTIAL RUN \"I know everyone’s a Godd--- genius now in hindsight,\" Newsom declared. \"But at the time, none of us knew what we were up against, including the President of the United States, who I worked very closely with.\" Newsom appeared to shift some of the scrutiny of his leadership onto President Donald Trump, claiming he worked closer with Trump than any other Democratic governor during the pandemic. \"And I say that with the kind of humility he deserves as well —grace that he deserves in terms of the decisions he made early on. We were all up against something none of us had any experience on,\" he said. When asked if he had made any mistakes during the pandemic, Newsom named the closures of outdoor spaces like beaches as something he would've done differently. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE The governor went on to argue that California had unfairly become a symbol of failed pandemic policies when states like Florida had taken similar actions during the pandemic early on. \"We weren't the only state doing it, but the state of mind of the 'California Derangement Syndrome.' There's a ‘Trump Derangement Syndrome,’ no question. But there's also ‘California Derangement Syndrome.’ As if California stands unique in some of these interventions and respects. It's true in some but not all,\" he said. CLICK HERE TO GET THE FOX NEWS APP","summary":"California Gov. Gavin Newsom faced challenging questions from podcaster Joe Rogan about California&apos;s pandemic policies in a new interview published Monday.","url":"https://www.foxnews.com/media/joe-rogan-confronts-gavin-newsom-tough-questions-pandemic-record","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/931/523/rogan-newsom.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-16 00:30:35","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","category":"politics","source_country":"US","sentiment":-0.262},{"id":341965088,"title":"\"She’s Done A Good Job\" Trump Defends Pam Bondi, Claims Epstein Files \"Made Up\" By Obama, Biden | 4K","text":"Last Updated:July 16, 2025, 06:00 IST Crux Videos\n\nPresident Donald Trump defended Attorney General Pam Bondi from mounting criticism over her handling of the federal government’s files related to Jeffrey Epstein, attempting to quell Republican infighting over the investigation. “The attorney general has handled that very well. She’s really done a very good job, and I think that when you look at that, you’ll understand it,” Trump said. Trump claimed the files were “made up” by Democrats — including former Presidents Barack Obama and Joe Biden and former FBI Director James Comey. n18oc_world n18oc_crux","summary":"President Donald Trump defended Attorney General Pam Bondi from mounting criticism over her handling of the federal government’s files related to Jeffrey Epstein, attempting to quell Republican infighting over the investigation. “The attorney general has handled that very well. She’s really done a very good job, and I think that when you look at that, you’ll understand it,” Trump said. Trump claimed the files were “made up” by Democrats — including former Presidents Barack Obama and Joe Biden and former FBI Director James Comey. n18oc_world n18oc_crux","url":"https://www.news18.com/videos/world/she-s-done-a-good-job-trump-defends-pam-bondi-claims-epstein-files-made-up-by-obama-biden-4k-9443016.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/1752626042_9394cebe-69ff-4f41-a387-ea377501888c.jpeg","video":null,"publish_date":"2025-07-16 00:30:04","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.169},{"id":341962678,"title":"Whoopi Goldberg denounces people politicizing Texas floods: ‘Nothing to do with Washington’","text":"“The View” co-host Whoopi Goldberg unloaded on those politicizing the devastating Texas floods on Tuesday, calling out individuals who have suggested Texas residents deserved what they got as the state supported President Donald Trump in 2024.\n\n“Agencies are finding that they’re not getting the money, because people are blaming the people who died in the floods, and they’re saying, ‘why should I – you voted for this.’ Let me tell you, let’s be really clear,” Goldberg began. “You know, you can’t blame anybody for these floods. It’s nobody’s fault. I didn’t do it. You didn’t do it. Has nothing to do with Washington. \n\n“This was what happened. This was a natural disaster, and if you are riding on people’s socials where you should be giving, if you’re saying these kinds of things, damn you. Damn you.”\n\nThe flooding on July 4 killed at least 129 people in central Texas. The toll is expected to rise as authorities believe more than 160 people may still be missing in Kerr County.\n\n“People are trying to get their lives together. These floods are no joke. This is not light humor. This is not – this is not how we do in America. We show up for whoever is in trouble,” Goldberg continued.\n\nGoldberg declared that who a person voted for should not matter in the case of a disaster.\n\n“We don’t say, ‘who did you vote for?’ We don’t say, ‘who did you vote with?’ We show up. We show up for children,” she said. “We show up for older folks. We show up for middle-aged folks, and we show up for the young because that’s what we do as Americans when we find out horrible things are happening in the world.”\n\nA former appointee to a Houston city board recently came under fire for claiming that the Texas summer camp devastated in the flooding was “White-only, conservative [and] Christian.”\n\n“But Camp Mystic is a Whites-only girls Christian camp,” said Slade Perkins, a former member of the Houston Food Insecurity Board, in a TikTok video over the weekend. “They don’t even have a token Asian, they don’t have a Token Black person, it is a all White, White-only conservative Christian camp.”\n\nPerkins’ term expired in January.\n\nSeveral other commentators have shared viral responses blasting the victims of the disaster.\n\n“The people in Texas voted for government services controlled by Donald Trump and Greg Abbott,” added left-wing social media personality Ron Filipkowski. “That is exactly what they (sic) getting.”\n\nTexas pediatrician Christina Propst shared a social media post wishing that “MAGA” people affected by the flooding should reap the effects of what they voted for, while expressing hope that “non-MAGA voters and pets be safe and dry.”\n\n“Kerr County MAGA voted to gut FEMA. They deny climate change. May they get what they voted for,” she said, adding, “Bless their hearts.”","summary":"Goldberg argued that a person's political preferences shouldn't matter in a disaster.","url":"https://nypost.com/2025/07/15/media/whoopi-goldberg-denounces-people-politicizing-texas-floods-nothing-to-do-with-washington/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-sagi5tvbc-1752624408461.jpg?quality=75&strip=all&1752610077&w=1024","video":null,"publish_date":"2025-07-16 00:26:23","author":"Donald Trump,Fox News","authors":["Donald Trump","Fox News"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.433},{"id":341966408,"title":"Ukraine 'tidak sepatutnya menyasarkan' Moscow - Trump","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menegaskan Ukraine tidak sepatutnya menyasarkan Moscow dan tidak merancang untuk membekalkan peluru berpandu jarak jauh kepada Kyiv.\n\nIni susulan laporan daripada akhbar Financial Times yang mendakwa beliau pernah berbincang bersama Presiden Ukraine, Volodymyr Zelensky untuk menyerang ibu negara Russia itu dan sekiranya Washington membekalkan senjata jarak jauh.\n\nKetika ditanya di Rumah Putih sama ada Zelensky patut menyasarkan Moscow, Trump menjawab, ia tidak sepatutnya menyerang Moscow dan bekalan peluru berpandu jarak jauh juga bukan sesuatu yang AS pertimbangkan.\n\nMenurut laporan Financial Times yang memetik dua individu yang mengetahui butiran perbualan itu, Trump dikatakan menghubungi Zelensky pada 4 Julai lalu, sehari selepas mengadakan perbualan dengan Presiden Russia, Vladimir Putin.\n\nTrump juga dilaporkan berbincang mengenai kemungkinan menghantar peluru berpandu buatan AS jenis ATACMS kepada Ukraine.\n\nTrump sebelum ini berikrar akan menamatkan perang Ukraine dalam tempoh sehari jika kembali ke Rumah Putih, namun, mengakui 'kecewa' dengan tindakan Putin yang terus melancarkan serangan terhadap Ukraine walaupun sudah berbincang melalui telefon.\n\nSementara itu, Setiausaha Akhbar Rumah Putih, Karoline Leavitt, menepis laporan Financial Times, sambil menyatakan bahawa akhbar itu terkenal kerana sering mengeluarkan kenyataan daripada konteks demi menarik perhatian.\n\n\"Presiden Trump hanya mengemukakan soalan, bukannya menggalakkan lebih banyak pertumpahan darah.\n\n\"Beliau sedang berusaha keras untuk menghentikan pertumpahan darah dan menamatkan perang ini,\" katanya.","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menegaskan Ukraine tidak sepatutnya menyasarkan Moscow dan tidak merancang untuk membekalkan peluru berpandu jarak jauh kepada Kyiv.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1420466/ukraine-tidak-sepatutnya-menyasarkan-moscow-trump","image":"https://assets.bharian.com.my/images/articles/BH16target-o_BHfield_image_listing_featured.var_1752625487.jpg","video":null,"publish_date":"2025-07-16 00:24:53","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.328},{"id":341962764,"title":"World News | White House Security Breach Prompts Brief Lockdown","text":"By Reena Bhardwaj\nWashington, DC [US], July 16 (ANI): The White House was briefly placed under lockdown on Tuesday after a \"phone\" was thrown over the security fence\nAlso Read | India Urges Bangladesh Not to Demolish Satyajit Ray's Ancestral Home; Offers Help to Preserve It.\nThe incident occurred at approximately midday when Secret Service agents responded to reports of an object being hurled over the North Lawn fence.\nPress Secretary Karoline Leavitt confirmed to reporters that \"somebody threw their phone over the fence\", prompting immediate security measures.\nAlso Read | Israel-Hamas War: IDF Strikes in Gaza Kill 93 Palestinians, Including Several Families, Health Officials Say.\nMembers of the press corps, who were waiting to speak with Education Secretary Linda McMahon during her Fox News appearance, were quickly escorted into the James S. Brady Briefing Room as agents secured the area.\nThe Secret Service implemented a full lockdown of the White House grounds and temporarily closed Pennsylvania Avenue to traffic. The security measures were lifted by 11:56 am, allowing journalists to return to the North Lawn.\nBy 12:20 pm, reporters, including ANI, had reassembled in the Palm Room ahead of President Donald Trump's scheduled departure for an event in Pennsylvania.\nThe White House has not yet issued an official statement about the security breach.\nThe incident represents the latest security challenge facing the Secret Service, which has experienced several breaches in recent months.\nIn March, a Secret Service agent was forced to carry a young boy back to his parents after the child managed to breach the White House perimeter.\nThe agency has faced increased scrutiny over security protocols following a series of incidents at the presidential residence.\nPresident Trump's schedule was not affected by Tuesday's lockdown, with his Pennsylvania event proceeding as planned. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  By 12:20 pm, reporters, including ANI, had reassembled in the Palm Room ahead of President Donald Trump's scheduled departure for an event in Pennsylvania.","url":"https://www.latestly.com/agency-news/world-news-white-house-security-breach-prompts-brief-lockdown-6998928.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250715202619.jpg","video":null,"publish_date":"2025-07-16 00:24:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.406},{"id":341962992,"title":"Whether you admire or dislike him, Donald Trump is a truly unique president in history.","text":"Leader of the pack\n\nTrump. Who may go down in history as USAâs one and only. The A-1 Trumper. Not what he says â what he does.\n\nHe once lobbed a metaphorical grenade at Jeb Bush. The family still remembers those slights. He also took a jab at “Little Marco,” so much that he couldn’t stand taller. Now? Secretary of State.\n\nLove him or not, Donald isn’t Millard Fillmore. Forget John Tyler. Dismiss Franklin Pierce. James Buchanan? WHO?! Can you tell me what Rutherford B. Hayes did, aside from contemplating renaming himself?\n\nJames Abram Garfield â Hey, thereâs a biggie everyone talks about. Zachary Taylor â wowie! Did what?! William Henry Harrison â WHO?!\n\nIf you don’t like him, that’s okay. Then don’t like him. But there’s no one — not even Mrs. Biden the ventriloquist — who can guide us through except for the brilliance, toughness, flamboyance, and fearlessness of Donald Trump!\n\nChewing on a few meaty ideas\n\nMega grocer Stew Leonard at the UESâs Beach Cafe for a burger, says about the new concept of government-owned supermarkets: âBring it on. What could go wrong?â That was twixt bites of what couldâve been his own sold meat patty.\n\nPolo Bar, 85-degree heat, Clive Davis in big green winter sweater plus sport coat. Plus sunglasses. He was set for any climate.\n\nSpaghetti inhalers at Due, Third Avenue, between 79th and 80th, talked of the 10 US wealthiest suburbs. No. 1: Scarsdale. SCARSDALE?! No. 2: Rye. Palm Beach schlepped in at No. 11.\n\nAbuzz for fuzz\n\nSouthamptonâs Animal Foundation does its Unconditional Love Gala this Saturday to help house homeless pets.\n\nItâs Christie Brinkley, Chevy Chase, Clint Eastwoodâs daughter Alison. Baker House on Bridgehamptonâs Ocean Road. Please go â 350 are expected. \n\nMayor mayday\n\nFrom a judge: âYou canât fully understand how dangerous a mayor this leftist candidate would be. The NYC GOP must find another charismatic candidate to win in November. Finances, no problem. Jewish people plus mature New Yorkers will vote for the Republican. Nazi young Republicans must stay out of it. Conservative media must lay off the Democrats until after the election.â\n\nMouthing off\n\nListen, everybodyâs getting into politics. Comes eventually the new show âCanceled.â A behind the headlines type shtick.\n\nThey swear itâs âwhere outrage moves faster than factsâ â whatever thatâs supposed to mean. Often uncomfortable conversations. Interpreting how we define guilt, justice, redemption, culture, jumping to judgment, vigilantes, weaponized narratives.\n\nNo tearing into someoneâs home and beating people without the judicial system. So far â nice idea â but more so far is that it has â yet â no network, no outlet.\n\nNew York City. Oy. One big new gridlock traffic sign on Fifth Avenue will soon read: âNo stopping, no standing, no driving, no parking, no letting on or off â no kidding!â\n\nOnly in New York City, kids, only in New York City.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLeader of the pack Trump. Who may go down in history as&#8230;\n\n\nThis Post: Whether you admire or dislike him, Donald Trump is a truly unique president in history. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/whether-you-admire-or-dislike-him-donald-trump-is-a-truly-unique-president-in-history/","image":"https://internewscast.com/wp-content/uploads/2025/07/Love-him-or-hate-him-atheres-never-been-a-president.jpg","video":null,"publish_date":"2025-07-16 00:23:43","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.047},{"id":341966390,"title":"Trump gesa dedah maklumat 'boleh dipercayai' Epstein","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menggesa Jabatan Kehakiman AS untuk mendedahkan semua maklumat 'boleh dipercayai' hasil siasatan terhadap penjenayah seksual terkenal, Jeffrey Epstein, dalam usaha menenangkan kemarahan penyokongnya berhubung cara beliau menangani isu itu.\n\nIni susulan Trump berdepan krisis terbesar dalam kerjaya politiknya, apabila penyokong setia dari sayap kanan mula meragui pentadbirannya yang didakwa cuba melindungi butiran sensitif mengenai jenayah Epstein demi menjaga kepentingan tokoh-tokoh kaya dan berkuasa.\n\n\"Peguam Negara mengendalikan isu ini dengan baik. \n\n\"Keputusan terpulang padanya, apa sahaja yang dia anggap boleh dipercayai, dia patut dedahkan,\" kata Trump, merujuk kepada Pam Bondi yang mengetuai Jabatan Kehakiman, ketika ditanya mengenai perkara itu di Rumah Putih.\n\nSebelum itu, Trump mendakwa fail Epstein adalah 'rekaan' pentadbiran Demokrat terdahulu, walaupun beliau sebelum ini beberapa kali menyatakan semasa kempen pilihan raya bahawa beliau 'mungkin' akan mendedahkannya.\n\nGerakan \"Make America Great Again\" (MAGA) pimpinan Trump sekian lama mempercayai teori bahawa elit 'Deep State' cuba melindungi individu berpengaruh yang mempunyai kaitan dengan Epstein, khususnya dalam kalangan Parti Demokrat dan tokoh Hollywood.\n\nNamun Trump menolak teori-teori konspirasi berkaitan Epstein, kemarahan penyokong semakin memuncak.\n\nSementara itu, Jabatan Kehakiman dan Biro Penyiasatan Persekutuan (FBI) menerusi satu memo yang didedahkan awal bulan ini menyatakan tiada bukti bahawa Epstein menyimpan 'senarai klien' atau memeras ugut mana-mana tokoh berkuasa.\n\nMereka turut menolak dakwaan bahawa Epstein dibunuh dalam penjara, sebaliknya mengesahkan kematiannya berpunca daripada bunuh diri, dan memaklumkan tiada maklumat lanjut mengenai siasatan akan didedahkan.\n\nDilaporkan, Epstein meninggal dunia akibat bunuh diri dalam penjara di New York pada 2019 selepas didakwa atas pertuduhan pemerdagangan seks.\n\nIni adalah kali pertama pegawai pentadbiran Trump secara terbuka menafikan dakwaan-dakwaan yang disebarkan oleh pelbagai tokoh sayap kanan, termasuk dua pegawai tertinggi FBI yang kini berkhidmat di bawah Trump.\n\nIsu ini turut mencetuskan perpecahan dalam pentadbirannya, termasuk pertelagahan antara Bondi dan Timbalan Pengarah FBI, Dan Bongino, yang dilaporkan sedang mempertimbang untuk meletak jawatan.\n\nMalah, menantu perempuannya, Lara Trump yang juga hos di Fox News, turut menyuarakan gesaan agar pentadbiran lebih telus dalam isu ini.\n\nSekutu paling berpengaruh Trump di Kongres, Speaker Dewan Perwakilan, Mike Johnson, turut menggesa lebih banyak maklumat didedahkan dan menyokong desakan supaya Bondi memberi penjelasan mengenai percanggahan kenyataannya berkaitan kes itu.\n\n\"Kita patut dedahkan semuanya dan biar rakyat nilai sendiri,\" kata Johnson dalam satu rancangan internet dikendalikan pengaruh MAGA, Benny Johnson.","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump menggesa Jabatan Kehakiman AS untuk mendedahkan semua maklumat &#039;boleh dipercayai&#039; hasil siasatan terhadap penjenayah seksual terkenal, Jeffrey Epstein, dalam usaha menenangkan kemarahan penyokongnya berhubung cara beliau menangani isu itu.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1420463/trump-gesa-dedah-maklumat-boleh-dipercayai-epstein","image":"https://assets.bharian.com.my/images/articles/BH16file-o_BHfield_image_listing_featured.var_1752625534.jpg","video":null,"publish_date":"2025-07-16 00:16:53","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":0.559},{"id":341962674,"title":"Love him or hate him —there’s never been a president like Donald Trump","text":"Leader of the pack\n\nTrump. Who may go down in history as USA’s one and only. The A-1 Trumper. Not what he says — what he does.\n\nHe once threw a grenade on Jeb Bush. The family still retains those grievances. Once he tinkled on “Little Marco,” who grew so upset that he couldn’t grow bigger. Now? Secretary of State.\n\nLove him, don’t love him. Donald’s not Millard Fillmore. Forget John Tyler. Shove Franklin Pierce. James Buchanan? WHO?! Tell me what Rutherford B. Hayes did besides trying to change his first name.\n\nJames Abram Garfield — Hey, there’s a biggie everyone talks about. Zachary Taylor — wowie! Did what?! William Henry Harrison — WHO?!\n\nYou don’t like him? OK, mazel tov. So don’t like him. But there’s no one — not Mrs. Biden the ventriloquist — not anybody who can get us through — but the smarts, toughness, flamboyance, fearlessness of Donald Trump!\n\nChewing on a few meaty ideas\n\nMega grocer Stew Leonard at the UES’s Beach Cafe for a burger, says about the new concept of government-owned supermarkets: “Bring it on. What could go wrong?” That was twixt bites of what could’ve been his own sold meat patty.\n\nPolo Bar, 85-degree heat, Clive Davis in big green winter sweater plus sport coat. Plus sunglasses. He was set for any climate.\n\nSpaghetti inhalers at Due, Third Avenue, between 79th and 80th, talked of the 10 US wealthiest suburbs. No. 1: Scarsdale. SCARSDALE?! No. 2: Rye. Palm Beach schlepped in at No. 11.\n\nAbuzz for fuzz\n\nSouthampton’s Animal Foundation does its Unconditional Love Gala this Saturday to help house homeless pets.\n\nIt’s Christie Brinkley, Chevy Chase, Clint Eastwood’s daughter Alison. Baker House on Bridgehampton’s Ocean Road. Please go — 350 are expected. \n\nMayor mayday\n\nFrom a judge: “You can’t fully understand how dangerous a mayor this leftist candidate would be. The NYC GOP must find another charismatic candidate to win in November. Finances, no problem. Jewish people plus mature New Yorkers will vote for the Republican. Nazi young Republicans must stay out of it. Conservative media must lay off the Democrats until after the election.”\n\nMouthing off\n\nListen, everybody’s getting into politics. Comes eventually the new show “Canceled.” A behind the headlines type shtick.\n\nThey swear it’s “where outrage moves faster than facts” — whatever that’s supposed to mean. Often uncomfortable conversations. Interpreting how we define guilt, justice, redemption, culture, jumping to judgment, vigilantes, weaponized narratives.\n\nNo tearing into someone’s home and beating people without the judicial system. So far — nice idea — but more so far is that it has — yet — no network, no outlet.\n\nNew York City. Oy. One big new gridlock traffic sign on Fifth Avenue will soon read: “No stopping, no standing, no driving, no parking, no letting on or off — no kidding!”\n\nOnly in New York City, kids, only in New York City.","summary":"Trump. Who may go down in history as USA’s one and only. The A-1 Trumper. Not what he says — what he does.","url":"https://nypost.com/2025/07/15/opinion/love-him-or-hate-him-theres-never-been-a-president-like-donald-trump/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-euz1zhove-1752621565764.jpg?quality=75&strip=all&1752607342&w=1200","video":null,"publish_date":"2025-07-16 00:16:31","author":"Cindy Adams","authors":["Cindy Adams"],"language":"en","category":"politics","source_country":"zm","sentiment":0.034},{"id":341968580,"title":"A giant Elon Musk bust was spotted at a Utah national park with a sign calling out DOGE cuts","text":"A giant bust fit for a Big Tech museum appeared at Arches National Park in Utah over the weekend with a message aimed at the person it was molded after: Elon Musk.The piece was on a trailer that was being pulled by a white pickup truck, according to photos shared with Business Insider. The bust was enclosed in a frame lined with blue stars and also carried a sign fashioned after President Donald Trump's signature style.\"MAKE AMERICA WAIT AGAIN,\" the sign said. \"Now With Longer Lines Thanks To DOGE Cuts!\"Karen Henker, acting public affairs specialist for Arches National Park, confirmed to BI that the Musk bust was spotted in the park over the weekend.Nancy Charmichael, who spotted the head and shared the photos with BI, said it was probably around 10 to 12 feet tall and had a \"self-satisfied smirk.\"Charmichael, who was visiting from Orlando, said she saw the bust a couple times while driving around the park and that she \"appreciated it.\" She said she'd been concerned about recent cuts to the National Park Service.\"It's unfortunate,\" she said. \"But we were just there, they're still beautiful.\"It's unclear who was behind the piece, but it appeared to be in response to cuts made to the National Park Service that were fueled by the White House DOGE office. Musk was the face of government efficiency efforts before he stepped back from his White House work in May.Musk and the White House did not respond to requests for comment from BI.According to the National Parks Conservation Association, a park advocacy group, NPS has lost 24% of its permanent staff since January. \"The park staff who remain are being asked to do more with less, and it's simply not sustainable,\" the group said in a statement this month.The recently passed spending bill, aka the \"Big Beautiful Bill,\" also cut $267 million of funding that had been committed for national parks, which advocates say were already underfunded and understaffed as park visitation reaches all-time highs.Henker, the park spokesperson, said that \"lines to get into Arches are very common and have been for years.\" Arches is among the national parks that have enacted a timed-entry reservation system, which limits how many visitors enter the park at certain times. Henker said there has not been an increase in lines at the park this year compared to prior years.Do you have a story to share about what it's been like at national parks this summer? Are you the person behind the Elon Musk bust? Contact this reporter at kvlamis@businessinsider.com.","summary":"A giant bust of Elon Musk appeared in Arches National Park over the weekend with a sign protesting DOGE cuts.","url":"https://www.businessinsider.com/photos-elon-musk-bust-arches-national-park-utah-doge-cuts-2025-7","image":"https://i.insider.com/6875950d3d5881a51c1d51c6?width=1200&format=jpeg","video":null,"publish_date":"2025-07-16 00:12:08","author":"Kelsey Vlamis","authors":["Kelsey Vlamis"],"language":"en","source_country":"us","sentiment":0.043},{"id":341963360,"title":"Melania Trump's surprising response when asked if she was just with Trump for money","text":"Melania Trump may not be one to seek the spotlight, but the First Lady has always spoken her mind when it comes to opinions about her marriage to President Donald Trump, with whom she tied the knot in 2005.\n\nThe Slovenian native, who shares her 19-year-old son Barron with the politician, has been subject to questions about their connection from the very beginning. She was just 28 years old when they met, while her future husband was 52, sparking conversation around her intentions in the relationship. \n\nSpeaking out\n\nAn ABC News interview from 1999 has resurfaced in recent weeks, taking place shortly after the pair went public with their romance. Correspondent Don Dahler asked about their relationship, prompting Melania to hit back at claims that she was only with Donald for his wealth. \n\n\"You know, the people, they don't know me,\" she said in the interview. \"People who talk like this, they don't know me.\" \n\nThe journalist responded: \"Well, you don't see many 26-year-old supermodels on the arm of a 53-year-old car mechanic.\"\n\nMelania rebutted: \"You know what, you can't sleep or to hug or to talk with beautiful things, with beautiful apartment, beautiful plane, beautiful cars, beautiful houses, you can't do that.\"\n\n\"You could feel very empty,\" she added. \"And if somebody said, 'You're with the man because he's rich and famous,' they don't know me.\"\n\nThe former Celebrity Apprentice host proposed in 2004, six years after their first meeting, and the pair married a year later. They welcomed their son Barron in 2006, adding to Donald's brood of four children from his previous two marriages.\n\nFuture First Lady\n\nInterestingly, Melania was asked in the interview if she could see herself in the role of the First Lady in the future. \"Yes, I would be very traditional like Jackie Kennedy. I will support him, I will do a lot of social obligations,\" she said at the time. \n\n\"I would stand by [my] man,\" she declared, adding that she would end her modeling career for him. \n\nMelania's time in the White House has been full of ups and downs, with the former model garnering criticism for her perceived lack of visibility and involvement in politics. \n\nShe addressed the criticism in a candid interview with Fox & Friends ahead of Donald's 2025 inauguration, sharing that the public's perception of her was false. \n\n\"Maybe some people, they see me as just a wife of the president, but I'm standing on my own two feet, independent,\" she said. \"I have my own thoughts. I have my own yes and no.\"\n\n\"I don't always agree what my husband is saying or doing, and that's okay,\" she continued. \"I give him my advice, and sometimes he listens, sometimes he doesn't, and that's okay.\" \n\n\"I feel I was always me the first time [in the White House] as well,\" she said, adding that the public \"didn't accept\" or \"understand\" her during her husband's first term. \n\nShe explained her plans to expand her \"Be Best\" campaign, which aims to target children's health, particularly regarding physical well-being, online safety and opioid abuse. \n\nTo learn more about Melania's journey to the White House, see below...","summary":"Melania Trump may not be a fan of the spotlight, but the First Lady has always spoken up when it comes to opinions about her marriage to President Donald Trump. See details.","url":"https://www.hellomagazine.com/celebrities/844528/melania-trump-surprising-response-when-asked-if-she-was-just-with-trump-for-money/","image":"https://images.hellomagazine.com/horizon/landscape/a5ea1ee954b7-gettyimages-2219706360.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-07-16 00:10:56","author":"Faye James","authors":["Faye James"],"language":"en","category":"politics","source_country":"gb","sentiment":0.096},{"id":341964622,"title":"Trump sues to oust US public broadcasting board members","text":"Donald Trump's administration has filed a lawsuit against three board members of the Corporation for Public Broadcasting who have not left their posts despite the US president's attempt to fire them.\n\nIn a complaint filed in federal court in Washington, the US Justice Department said Trump lawfully fired the three board members - Laura Ross, Diane Kaplan and Tom Rothman — and requested a court order ousting them.\n\nThe lawsuit is the latest twist in a larger fight between the CPB, which spends more than $US500 million annually on organisations like the Public Broadcasting Service and National Public Radio, and the Trump administration.\n\nThe White House and many Republicans have argued that the government should not provide funding to support programming that they consider too liberal.\n\nThe CPB did not immediately respond to a message seeking comment from the organisation and from the board members.\n\nCreated by the US Congress in 1967, the CPB provides financial support for PBS, NPR, and more than 1500 locally managed public radio and TV stations.\n\nA Trump executive order from May aimed to slash public subsidies to PBS and NPR, which have called the move blatantly unlawful.\n\nThe CPB's directors are nominated by the US president and confirmed by the Senate for six-year terms. The five current members of the board were all nominated by former president Joe Biden.\n\nWhite House Deputy Director of Presidential Personnel Trent Morse sent emails to Rothman, Ross, and Kaplan in April saying they had been terminated from their posts.\n\nThe CPB responded by filing its own lawsuit, saying that \"because the president has no authority over the CPB, he has no authority to terminate its board members as he has purported to do here.\"\n\nUS District Judge Randolph Moss, who is hearing that case, ruled last month that the three board members can keep their seats, even as he denied the CPB an injunction blocking Trump from removing them.","summary":"The US Justice Department has filed a complaint requesting a court order to fire three Corporation for Public Broadcasting board members.","url":"https://www.perthnow.com.au/news/politics/trump-sues-to-oust-us-public-broadcasting-board-members-c-19371472","image":"https://images.perthnow.com.au/publication/C-19371472/c2fe211528466255a24f0d6f499a9c70336b423c-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-07-16 00:10:21","author":"Jan Wolfe","authors":["Jan Wolfe"],"language":"en","source_country":"au","sentiment":-0.419},{"id":341965326,"title":"Pentagon chief downsizes contentious LA troop deployment","text":"WASHINGTON: US Defense Secretary Pete Hegseth has ordered the withdrawal of 2,000 National Guard troops from Los Angeles, roughly halving the contentious deployment in the city, the Pentagon said on Tuesday (Jul 15).\n\nPresident Donald Trump ordered thousands of National Guard and hundreds of Marines into Los Angeles last month in response to protests over federal immigration sweeps - a move opposed by city leaders and California's Democratic Governor Gavin Newsom.\n\n\"Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,\" Pentagon spokesman Sean Parnell said in a statement.\n\n\"As such, the secretary has ordered the release of 2,000 California National Guardsmen (79th IBCT) from the federal protection mission,\" he said.\n\nAs a so-called \"sanctuary city\" with hundreds of thousands of undocumented people, Los Angeles has been in the crosshairs of the Trump administration since the Republican returned to office in January.\n\nAfter immigration enforcement raids spurred unrest and protests last month, Trump, who has repeatedly exaggerated the scale of the unrest, dispatched the National Guard and US Marines to quell the disruption.\n\nIt was the first time since 1965 that a US president deployed the National Guard against the wishes of a state governor. Newsom said the troops were not necessary to address the mostly peaceful protests.","summary":"","url":"https://www.channelnewsasia.com/world/los-angeles-us-national-guard-deployment-troops-withdrawn-protests-5240481","image":"https://dam.mediacorp.sg/image/upload/s--gNLekxw9--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/us_protests_los_angeles_09352.jpg?itok=Ipv95Jsh","video":null,"publish_date":"2025-07-16 00:08:48","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.32},{"id":341971884,"title":"Trump promised to be a ‘peacemaker’ president. He launched nearly as many airstrikes in five months as Biden did in four years","text":"In his inaugural address, Donald Trump said his “proudest legacy” as president will be that of a “peacemaker.”\n\n“Our power will stop all wars and bring a new spirit of unity to a world that has been angry, violent and totally unpredictable,” the president said in his remarks on January 20.\n\nBut six months later, Trump has already launched nearly as many airstrikes on foreign nations as Joe Biden did within four years, with analysts asking whether the president’s plan to end so-called “forever wars” involves overwhelming firepower to stop them from happening in the first place.\n\nSince Trump returned to the White House, the United States has carried out at least 529 bombings in more than 240 locations in Africa, the Middle East and Central Asia, according to Armed Conflict Location & Event Data (ACLED), an international data collection nonprofit. His predecessor’s administration launched 555.\n\n“Trump’s preference for engagement begs the question: Does this contradict his promise to end America’s wars — or are the foreign strikes how he wishes to keep that promise?” ACLED president Clionadh Raleigh said in a statement. “The recent airstrikes on Iran’s nuclear sites have been framed as a major turning point in U.S. foreign policy. But if you take a step back, they don’t stand out — they fit.”\n\nDonald Trump’s administration has carried out more than 500 bombings since taking office in January (REUTERS)\n\n“All of President Trump’s decisive actions have been overwhelmingly popular and resulted in greater peace,” White House deputy press secretary Anna Kelly said in a statement to The Independent.\n\n“Operation Midnight Hammer successfully obliterated Iran’s nuclear capabilities, and [the Department of Defense’s] successful strikes against ISIS and other malign groups killed terrorists want to do harm to Americans,” she added.\n\n“Anyone who sympathizes with evil terrorists and wants them to live should look inward,” she said.\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen in an effort to stop their attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza.\n\nThe administration struck Yemen at least 474 times within three months, ACLED found. The Biden administration launched 294 attacks in Yemen within roughly 12 months.\n\nTrump’s airstrikes in Yemen have reportedly killed as many civilians within the eight-week bombing campaign as in the previous two decades of U.S. attacks targeting militants in the country, according to nonprofit watchdog Airwars. At least 224 civilians were killed during the campaign between March and May, compared to 258 deaths between 2002 and 2024, that report found.\n\nThe administration also launched 44 airstrikes in Somalia to target Islamic State operatives, according to ACLED.\n\nTrump first ordered the airstrikes in February, marking the first attacks in the African nation in his second term.\n\n“The U.S. military is moving faster, hitting harder, and doing so with fewer constraints,” according to Raleigh. “Syria, Iraq, Afghanistan, Yemen, Somalia, and now Iran are all familiar terrain, but this isn’t about geography — it’s about frequency.”\n\nTargeted airstrikes don’t appear to be a last-resort measure under the Trump administration but “the first move,” Raleigh added.\n\n“While Trump has repeatedly promised to end America’s ‘forever wars,’ he has rarely elaborated on how,” Raleigh said. “These early months suggest the plan may be to use overwhelming firepower to end fights before they begin, or before they drag on.”\n\nThroughout his campaign, the president accused Biden and, later, his Democratic rival Kamala Harris of leading the United States into World War III. “These are wars that will never end with him,” Trump said of Biden during a presidential debate in June 2024. “We’re closer to World War III than anybody can imagine.”\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen (pictured) in an effort to stop attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza (Houthi Media Center via Getty Images)\n\nReceiving the endorsement of now-intelligence director Tulsi Gabbard last year, Trump said the pair was “uniting forces to end the endless foreign wars.”\n\n“I am confident that his first task will be to do the work to walk us back from the brink of war,” Gabbard said at the time. “We cannot be prosperous unless we are at peace.”\n\nTrump — vocal about his desire for a Nobel Peace Prize, and nominated for the honor by at least four of his allies — also promised his administration would bring an end to Russia’s war in Ukraine and Israel’s war in Gaza.\n\nOn Monday, the president laid out prospective steps to pressure Russia to end its war, including sending more weapons to Ukraine and threatening economic sanctions in Moscow if there is no peace agreement within 50 days.\n\n“I felt we had a deal about four times,” Trump said. “But it just kept going on and on.”\n\nHis administration has also failed to broker a ceasefire in Gaza as Palestinians face threats of famine and Israeli airstrikes continue to bombard the strip. A tentative Trump-backed plan to force hundreds of thousands of Palestinian civilians into an area controlled by Israel’s military close to the Gaza-Egypt border has also threatened to derail ceasefire talks.\n\nThe Independent has requested comment Department of Defense.","url":"https://uk.news.yahoo.com/trump-promised-peacemaker-president-launched-000130595.html","image":"https://media.zenfs.com/en/the_independent_577/0125c567338d26791034ba92c7282780","video":"","publish_date":"2025-07-16 00:01:30","author":"Alex Woodward And Alicja Hagopian","authors":["Alex Woodward And Alicja Hagopian"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.231},{"id":341961896,"title":"Trump promised to be a ‘peacemaker’ president. He launched nearly as many airstrikes in five months as Biden did in four years","text":"In his inaugural address, Donald Trump said his “proudest legacy” as president will be that of a “peacemaker.”\n\n“Our power will stop all wars and bring a new spirit of unity to a world that has been angry, violent and totally unpredictable,” the president said in his remarks on January 20.\n\nBut six months later, Trump has already launched nearly as many airstrikes on foreign nations as Joe Biden did within four years, with analysts asking whether the president’s plan to end so-called “forever wars” involves overwhelming firepower to stop them from happening in the first place.\n\nSince Trump returned to the White House, the United States has carried out at least 529 bombings in more than 240 locations in Africa, the Middle East and Central Asia, according to Armed Conflict Location & Event Data (ACLED), an international data collection nonprofit. His predecessor’s administration launched 555.\n\n“Trump’s preference for engagement begs the question: Does this contradict his promise to end America’s wars — or are the foreign strikes how he wishes to keep that promise?” ACLED president Clionadh Raleigh said in a statement. “The recent airstrikes on Iran’s nuclear sites have been framed as a major turning point in U.S. foreign policy. But if you take a step back, they don’t stand out — they fit.”\n\n“All of President Trump’s decisive actions have been overwhelmingly popular and resulted in greater peace,” White House deputy press secretary Anna Kelly said in a statement to The Independent.\n\n“Operation Midnight Hammer successfully obliterated Iran’s nuclear capabilities, and [the Department of Defense’s] successful strikes against ISIS and other malign groups killed terrorists want to do harm to Americans,” she added.\n\n“Anyone who sympathizes with evil terrorists and wants them to live should look inward,” she said.\n\nA majority of the U.S. military’s airstrikes thus far have targeted Iran-backed Houthis in Yemen in an effort to stop their attacks on merchant ships in the Red Sea launched in retaliation for Israel’s war in Gaza.\n\nThe administration struck Yemen at least 474 times within three months, ACLED found. The Biden administration launched 294 attacks in Yemen within roughly 12 months.\n\nTrump’s airstrikes in Yemen have reportedly killed as many civilians within the eight-week bombing campaign as in the previous two decades of U.S. attacks targeting militants in the country, according to nonprofit watchdog Airwars. At least 224 civilians were killed during the campaign between March and May, compared to 258 deaths between 2002 and 2024, that report found.\n\nThe administration also launched 44 airstrikes in Somalia to target Islamic State operatives, according to ACLED. \n\nTrump first ordered the airstrikes in February, marking the first attacks in the African nation in his second term.\n\n“The U.S. military is moving faster, hitting harder, and doing so with fewer constraints,” according to Raleigh. “Syria, Iraq, Afghanistan, Yemen, Somalia, and now Iran are all familiar terrain, but this isn’t about geography — it’s about frequency.”\n\nTargeted airstrikes don’t appear to be a last-resort measure under the Trump administration but “the first move,” Raleigh added.\n\n“While Trump has repeatedly promised to end America’s ‘forever wars,’ he has rarely elaborated on how,” Raleigh said. “These early months suggest the plan may be to use overwhelming firepower to end fights before they begin, or before they drag on.”\n\nThroughout his campaign, the president accused Biden and, later, his Democratic rival Kamala Harris of leading the United States into World War III. “These are wars that will never end with him,” Trump said of Biden during a presidential debate in June 2024. “We’re closer to World War III than anybody can imagine.”\n\nReceiving the endorsement of now-intelligence director Tulsi Gabbard last year, Trump said the pair was “uniting forces to end the endless foreign wars.”\n\n“I am confident that his first task will be to do the work to walk us back from the brink of war,” Gabbard said at the time. “We cannot be prosperous unless we are at peace.”\n\nTrump — vocal about his desire for a Nobel Peace Prize, and nominated for the honor by at least four of his allies — also promised his administration would bring an end to Russia’s war in Ukraine and Israel’s war in Gaza.\n\nOn Monday, the president laid out prospective steps to pressure Russia to end its war, including sending more weapons to Ukraine and threatening economic sanctions in Moscow if there is no peace agreement within 50 days.\n\n“I felt we had a deal about four times,” Trump said. “But it just kept going on and on.”\n\nHis administration has also failed to broker a ceasefire in Gaza as Palestinians face threats of famine and Israeli airstrikes continue to bombard the strip. A tentative Trump-backed plan to force hundreds of thousands of Palestinian civilians into an area controlled by Israel’s military close to the Gaza-Egypt border has also threatened to derail ceasefire talks.\n\nThe Independent has requested comment Department of Defense.","summary":"The administration has carried out more than 500 bombings so far, according to analysis from data watchdog","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-airstrikes-bombs-iran-how-many-b2789626.html","image":"https://static.independent.co.uk/2025/07/15/19/03/U-S--President-Trump-holds-a-cabinet-meeting-at-the-White-House-in-Washington-t27j87rp.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/u5TFQoPQ-OhrQWqOm.mp4","publish_date":"2025-07-16 00:01:30","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.209},{"id":341963298,"title":"Charlamagne criticizes Obama's 'mind-boggling' advice to Democrats as too little, too late","text":"Radio host Charlamagne Tha God argued that former President Obama’s viral critique of his fellow Democrats is old news and that their base has been saying for a decade. As the Democratic Party continues to struggle to chart a new course forward, the 44th president offered a tough love message to the members of his party at a fundraiser on Friday on how to find their way out of the political wilderness. \"I think it’s going to require a little bit less navel-gazing and a little less whining and being in fetal positions,\" Obama said during the private event in New Jersey. \"And it’s going to require Democrats to just toughen up.\" \"It's mind-boggling to me when I hear people like President Obama say things that regular everyday people [have] been saying for years,\" the radio host said on his \"Breakfast Club\" radio show. \"We've been saying Democrats were cowards for a decade. We've been saying Democrats need to toughen up. And that cowardice is, you know, why we're in the position that we're in now.\" OBAMA SWIPES AT AFFLUENT LIBERALS DURING RARE PUBLIC REMARKS, SAYS 'ALL OF US ARE GOING TO BE TESTED' He added that he could provide \"countless examples\" of Democratic leaders needing to show some backbone. \"Like, for example, they should have told Biden that he was going to be a one-term president, it wasn't up to him,\" Charlamagne said. \"So, it's just wild to hear President Obama say that now, as if Democrats haven't been cowards for the past decade.\" One of his co-hosts balked at Charlamagne, causing him to double down. \"That’s President Obama’s opinion, too!\" he argued. When asked what \"toughen up\" means in the realm of politics, the radio host offered more examples. \"’Toughen up’ looks like, ‘Hey Biden, you’re going to be a one-term president.' ‘Toughen up’ looks like, ‘Hey, [Ruth Bader Ginsburg], you're going to step down ‘cuz you're too old.’ Like, that's what toughening up looks like,\" Charlamagne said. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE CLICK HERE TO GET THE FOX NEWS APP \"Toughen up looks like, ‘Hey, if Donald Trump is the existential threat that y'all tell us he is, how come y'all aren't going after him that way while y'all are in office?\" he added. \"That's what toughening up looks like.\"","summary":"Radio personality Charlamagne Tha God knocked Obama&apos;s criticism of Democrats as old news, stating everyday people have been calling Democrats cowards for years.","url":"https://www.foxnews.com/media/charlamagne-criticizes-obamas-mind-boggling-advice-democrats-too-little-too-late","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/11/931/523/Charlamagne-Tha-God-1.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-16 00:00:27","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"us","sentiment":-0.101},{"id":341966304,"title":"Will Japan’s anti-immigrant far-right parties win more votes in key election?","text":"As Japan heads into a pivotal upper house election, populist parties on the far-right are seizing on anti-immigrant rhetoric to win over voters, echoing the strategies of US President Donald Trump’s Republicans and hard-right movements across Europe.\nWhile candidates from across the political spectrum in Japan campaign on familiar issues such as inflation, jobs and defence, a surge in anti-immigrant messaging has also reframed the national conversation ahead of the House of Councillors election on Sunday.\nThe shift is being driven by the rise of ultraconservative groups like Sanseito, a party founded in 2020, which is polling fourth in opinion surveys among the 10 parties contesting the election. While Sanseito’s support remains modest – just 5.9 per cent according to a July 11 NHK poll – more than 33 per cent of voters say they are still undecided.\nWith the ruling Liberal Democratic Party (LDP) struggling to rebound from a string of scandals and polling at just 24 per cent, political analysts say the election could produce a hung result, forcing the LDP to negotiate with smaller parties to retain power.\nThat may give hardline groups such as Sanseito or other right-leaning contenders – the Conservative Party of Japan (CPJ), the Japan Innovation Party (Ishin), or the Democratic Party for the People (DPFP) – the leverage to demand a role in government or even a cabinet seat, according to analysts.\nHiromichi Moteki, a conservative historian who lives in Tokyo, used to be a supporter of the LDP but has grown disillusioned by its present leadership, dismissing Prime Minister Shigeru Ishiba as “hopeless”.\n“I’m voting for Sanseito because it is the only party that really shares my conservative principles,” he told This Week in Asia.\n\nMoteki said his decision to switch party allegiance could be traced to the LDP permitting same-sex marriages, which he referred to it as “the LGBTQ problem”, adding that he would not back a woman sitting on the Chrysanthemum Throne and was a firm supporter of a powerful Japanese military and a tougher policy against China – these views also mirror Sanseito’s positions.\nNoting Sanseito’s proposal to ban low-skilled economic immigrants, Moteki said law-abiding foreigners with the skills that could benefit Japan should be allowed to work in Japan.\n“Any foreigner that commits a crime should leave the country. It is true that Japan has a severe labour shortage, but companies need to find better ways to solve that problem other than importing low-skilled labourers. Just bringing in more foreigners does nothing to solve our own productivity problems,” he said.\nForeign people should not be eligible for social security if they are not working, according to Moteki.\nSince March, there were been many posts on social media claiming that one-third of the households in Japan that were receiving welfare support were foreigners, the Asahi newspaper reported on Friday. Figures from the Ministry of Health, Labour and Welfare, however, put the actual figure at less than 3 per cent.\nCrime is another hot topic in online forums, with the media quick to highlight crimes committed by foreigners, such as US troops in Okinawa prefecture or within the ethnic Kurdish community that has congregated in Saitama prefecture, north of Tokyo.\nThe number of foreigners arrested for criminal offences in Japan fell to 9,726 in 2023, from 10,963 in 2000. Over the same period, the proportion of foreigners in Japan’s total population rose to 2.5 percent from 1 per cent.\n\nA justice ministry annual white paper on crime has shown that the ratio of arrested foreigners to the total number of foreign residents decreased to 0.3 per cent in 2023, from 0.8 per cent in 2000.\nNevertheless, smaller right-leaning parties have targeted sentiment against foreigners to win votes. Among them, the DPFP has vowed to “investigate” foreigners obtaining welfare help and to “establish a law to regulate the acquisition of land by foreigners”, while Ishin aims to “formulate a population strategy that includes curbing the rising ratio of foreigners”.\nIn response to the ground sentiment, the LDP and its coalition partner Komeito have unveiled new proposals targeting foreign nationals in Japan. The LDP has introduced new curbs on foreigners having driving licences and is scrapping support payments for foreign PhD students while pledging to step up efforts to achieve “zero illegal foreigners”.\nKomeito, a Buddhist-backed political party, intends to remove all foreigners who have overstayed their visas and introduce new rules to ensure non-Japanese pay for their social security.\nYuichi Kujirai, a 32-year-old from Tokyo who is training to be a doctor, is horrified at the recent rise of right-wing parties, which he said was a result of the lingering political influence of the late former prime minister Shinzo Abe. In contrast, Abe’s successors – Fumio Kishida and the present prime minister, Shigeru Ishiba – were seen as centre-left in their views and this has alienated many LDP voters, according to Kujirai.\n“It is in response to these leaders that parties such as Sanseito and the Japan Conservative Party have grown and shifted the ideology of Abe further to the right,” he told This Week in Asia.\nKujirai, who will be voting on Sunday, said Sanseito’s philosophy was “quite radical” and its support base had “increased abnormally” over a short span of time.\n\nPart of its appeal was its party leader Sohei Kamiya, Kujirai said. Sanseito is trying to divert voters’ attention away from Japan’s core challenges such as economic stagnation and the declining birth rate and focus on foreigners, according to Kujirai.\n“They try to give ordinary people the impression that foreigners living in Japan are only here to claim welfare and scholarships, that foreigners are treated better than Japanese citizens and that they cause most of the crime,” he added.\nOf particular concern to Kujirai is the intention of Sanseito to bring back the constitution during the years of Japan’s expansionism with the emperor ruling over the country and the military in the ascendancy again.\n“There have been reports in recent days of Sanseito lodging complaints with media outlets that question their discrimination against foreigners and clashes with people protesting their views. They are like the followers of a religious cult,” he said.","summary":"As Japan heads into a pivotal upper house election, populist parties on the far-right are seizing on anti-immigrant rhetoric to win over voters, echoing the strategies of US President Donald Trump’s Republicans and hard-right movements across Europe.\nWhile candidates from across the political spectrum in Japan campaign on familiar issues such as inflation, jobs and defence, a surge in anti-immigrant messaging has also reframed the national conversation ahead of the House of Councillors election...","url":"https://www.scmp.com/week-asia/politics/article/3318332/will-japans-anti-immigrant-far-right-parties-win-more-votes-key-election","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/07/15/ae24a6e4-c803-439b-9a22-ad5884232da5_ca21d3c6.jpg","video":null,"publish_date":"2025-07-16 00:00:07","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.21},{"id":341972010,"title":"'Big Fat Bribe': Stephen Colbert Takes on His Employer Over '60 Minutes' Legal Settlement With Trump — Despite 'Axe Dangling' Over His Job","text":"Stephen Colbert has slammed his network's parent company for giving a \"big fat bribe\" to President Donald Trump despite a pending merger threatening his job, RadarOnline.com can reveal. \n\nOn Monday, July 14, the late-night host didn't hold back as he focused his opening monologue on Paramount's $16million settlement with Trump after he alleged 60 Minutes unfairly edited their 2024 interview with then-presidential nominee Kamala Harris.'I'm Offended'Colbert came out swinging as he declared: \"As someone who has always been a proud employee of this network, I'm offended, and I don't know if anything will ever repair my trust in this company.\"\n\nHe then lightened the mood by joking: \"But just taking a stab at it, I'd say $16million would help.\" \n\nBut the funnyman wasn't ready to drop the subject just yet, and continued to call out CBS' parent company.The comedian continued: \"Paramount knows they could have easily fault it because in their own words, the lawsuit was completely meritless.\n\n\"Unlike the payoffs from ABC and Twitter, Paramount's settlement did not include an apology. Instead, the corporation released a statement where they said, 'You may take our money, but you will never take our dignity. You may, however, purchase our dignity for the low, low price of $16million.'\"\n\nHe added: \"I believe this kind of complicated financial settlement with a sitting government official has a technical name in legal circles: it's Big Fat Bribe.\"Colbert explained the timing issue surrounding the settlement: \"This all comes as Paramount's owners are trying to get the Trump administration to approve the sale of our network to a new owner, Skydance.\" \n\nHe also quoted a report, saying: \"Once Skydance gets CBS, the new owner's desire to please Trump could 'put pressure on late night host and frequent Trump critic Stephen Colbert.'\"\n\nColbert quipped, \"Okay. But how are they going to put pressure on Stephen Colbert if they can’t find him?\" as he pointed to his new mustache.As RadarOnline.com reported, the merger could put Colbert's talk show as well as Jon Stewart's The Daily Show at risk, considering their outspoken criticism of Trump and his administration. \n\nCritics raised concerns over what the precedent the settlement could set for networks during the Trump administration, while others speculated about Skydance CEO David Ellison striking a \"side deal\" with the president. \n\nTrump fueled speculation when he gushed about Ellison after the settlement, saying: \"We did a deal for about $16million plus $16million, or maybe more than that, in advertising... It's like 32 to maybe $35million.\"The \"advertising\" in question referenced reporting from Fox Business’ Charlie Gasparino on Ellison's alleged private agreement to run PSAs supporting Trump-backed causes.\n\nTrump additionally praised Ellison's billionaire father, Larry, who founded Oracle, saying he \"thinks he's going to run CBS really well\" before noting his son is \"a fantastic young man.\"","summary":"The late-night host took at swing at his parent company despite his job being at risk with the pending Skydance merger.","url":"https://radaronline.com/p/stephen-colbert-slams-paramount-settlement-donald-trump/","image":"https://media.radaronline.com/brand-img/jvb0WGO5X/0x0/stephen-colbert-brands-paramounts-settlement-with-trump-a-big-fat-bribe-1-1752619183044.png","video":null,"publish_date":"2025-07-16 00:00:00","author":"Haley Gunn","authors":["Haley Gunn"],"language":"en","source_country":"us","sentiment":-0.257},{"id":341963194,"title":"Murderer's 14 last words as he's given lethal injection on Florida's death row","text":"A murderer thanked officials for not letting him spend the rest of his life in prison - before he was executed on death row yesterday. Michael Bernard Bell has spent 30 years behind bars since his conviction of the murders of Jimmy West and Tamecka Smith, whom he shot outside a bar as part of an attempted revenge killing. The number of executions in the US has now already surpassed last year's total with five months remaining of 2025. When the team warden at Florida State Prison near Starke asked Bell, 54, if he had any final words, the killer responded: \"Thank you for not letting me spend the rest of my life in prison.\" He was then given a lethal injection and, within around 10 minutes, was declared dead. Bell, the eighth person to be executed in Florida this year, chose to eat an omelette, bacon, home fries and orange juice as his last meal on Tuesday. He met with a spiritual adviser but did not have any other visitors. The defendant's lawyers argued in their state filing that Bell’s execution should be halted because of newly discovered evidence about witness testimony. Justices unanimously rejected the argument last week and pointed to overwhelming evidence of Bell’s guilt. On his first day back in office, Donald Trump signed a sweeping executive order aimed at urging prosecutors to seek the death penalty and preserving capital punishment in the states. There has been a sharp rise in executions in the months since, particularly in Florida which has a ninth scheduled later this month. John Blume, the director of the Cornell Death Penalty Project, said: \"A number of these people being executed are people that have been in the system for a long time; they’ve been on death row for a long time... The most cynical view would be: It seems to matter to the president, so it matters to them (state governors).\" But only one person was executed in Florida across the whole of 2024. It has now executed more people than any other state, including Texas and South Carolina, this year. Bell was convicted in 1995, nearly two years after shooting Mr West and Ms Smith. In December 1993, Bell spotted what he thought was the car of the man who fatally shot his brother earlier that same year. However, Bell was unaware that the man had sold the car to Mr West, and he, Ms Smith and another woman - innocent parties - were shot after they left a bar and reached the car. Mr West died at the scene, and Ms Smith died on the way to the hospital. The other woman escaped injury. Witnesses said Bell also fired at a crowd of onlookers before fleeing the area. He was eventually arrested the next year. Bell was later convicted of three additional murders — a woman and her toddler son in 1989, and his mother's boyfriend about four months before the attack on Mr West and Ms Smith.","summary":"Michael Bernard Bell, who killed two people outside a bar in Florida more than 30 years ago, became the 26th person to be executed on death row in the US this year","url":"https://www.mirror.co.uk/news/us-news/murderers-14-last-words-hes-35562297","image":"https://i2-prod.mirror.co.uk/article35562303.ece/ALTERNATES/s1200b/1_Syndication-Florida-Times-Union.jpg","video":null,"publish_date":"2025-07-15 23:58:15","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","source_country":"gb","sentiment":-0.23},{"id":341960112,"title":"Trump downplays possibility of sending Ukraine long-range weapons as it struggles to repel Russia","text":"U.S. President Donald Trump on Tuesday (July 15, 2025) downplayed the possibility of sending Ukraine long-range weapons as Kyiv awaits an injection of U.S. weaponry that it hopes will help it beat back an intensifying Russian air offensive. \n\nTrump offered a more cautious tone on what to expect after he threatened Russia a day earlier with steep tariffs if President Vladimir Putin doesn’t act within 50 days to end the three-year conflict. He also on Monday announced plans to bolster Kyiv's stockpile by selling American weapons to NATO allies who would in turn send arms to Ukraine.\n\nProviding Ukraine with more long-range weaponry would give Kyiv the chance to strike further into Russian territory, a move that some in Ukraine and the U.S. have said could help push Putin toward negotiations to end the fighting.\n\nAsked if he intended to supply Ukraine with weapons that could reach deeper into Russian territory, Mr. Trump replied, “We're not looking to do that.” He made the remarks to reporters before departing the White House for an energy investment event in Pittsburgh.\n\nWhile Mr. Trump's threats of weapons, sanctions and tariffs mark the most substantive pressure he’s placed on Mr. Putin since returning to office nearly six months ago, some lawmakers said they remain concerned that the administration, with the 50-day deadline, is giving Mr. Putin time to grab even more Ukrainian territory.\n\nSens. Thom Tillis, a Republican from North Carolina, and Jeanne Shaheen, a Democrat from New Hampshire, said waiting 50 days before imposing sanctions on Russia would give Putin more time to gain an advantage in the war. \n\n“The 50-day delay worries me that Putin would try to use the 50 days to win the war, or to be better positioned to negotiate a peace agreement after having murdered and potentially collected more ground,” said Mr. Tillis, who recently announced he won’t run for reelection.\n\nMr. Tillis and Ms. Shaheen lead the Senate NATO Observer Group, which facilitates work between Congress and NATO, and met on Tuesday with NATO Secretary General Mark Rutte on Capitol Hill.\n\nMr. Trump himself scoffed at the idea that 50 days is giving Mr. Putin too much time. The president suggested he may act more quickly if he does not see signs that Putin is taking steps toward ending the conflict.\n\n“I don’t think 50 days is very long and it could be shorter than that,” he said.\n\nAhead of Mr. Trump's announcement that he would impose a 100% tariff on Russia’s trading partners if Mr. Putin doesn't negotiate an end to the war, bipartisan legislation proscribing even tougher sanctions on Moscow was gaining steam in the Senate.\n\nThe legislation, in part, calls for a 500% tariff on goods imported from countries that continue to buy Russian oil, gas, uranium and other exports. It would have an enormous impact on the economies of Brazil, China and India, which account for the vast majority of Russia’s energy trade.\n\nBut Mr. Trump on Monday said “at a certain point it doesn’t matter” how high the tariff is set and that \"100% is going to serve the same function.” Senate Majority Leader John Thune said he was putting the legislation on hold following Mr. Trump's announcement.\n\nMr. Trump during his campaign described the conflict as a waste of U.S. taxpayer money and vowed to quickly end it on his first day back in office. He deflected when asked by a reporter on Tuesday if his tougher tone on Mr. Putin suggests he's now on Ukraine’s side in the bloody conflict.\n\n“I’m on nobody’s side,” Mr. Trump said, adding this concern was for “humanity.”\n\nU.S. officials say they are still sorting through Ukraine’s wish list of weaponry to determine what can be most quickly replaced after Mr. Trump announced an agreement for Europe to supply Ukraine with defensive munitions from existing stocks.\n\nThe officials, who spoke on condition of anonymity to discuss arms transfers that have not yet been approved or completed, said Ukraine’s requests for military equipment are roughly the same as they have been since the start of Russia’s invasion. Those include air defenses like Patriot missiles and Advanced Precision Kill Weapon Systems, long-range missiles known as ATACMS and short- to medium-range ground-to-air missiles known as NASAMs, and assorted artillery, according to the officials.\n\nUnder the terms of the very rough agreement sketched out by Mr. Trump and Mr. Rutte on Monday, NATO members would ship billions of dollars of these weapons to Ukraine and then purchase replacements for them from the United States.\n\nOne official said some of the larger items — such as Patriots— could take up to five years to produce to deliver to the European donors, while smaller munitions like 155mm artillery shells can be produced on a much shorter timeline.\n\nMr. Trump has lately changed his once friendly tune toward Mr. Putin, whom he has long admired and whom he sided with publicly over his national security team during his first term when asked whether Russia had interfered in the 2016 election. \n\nIn recent weeks, Mr. Trump has chastised Mr. Putin for continuing his brutal assault on Ukrainian cities, even noting that the Russian leader “talks nice and then he bombs everybody.\"\n\nMr. Trump has continued to blame his White House predecessors for Putin's 2022 invasion on neighboring Ukraine — a conflict he says would have never happened if he were reelected in 2020.\n\n“He’s fooled a lot of people,” Mr. Trump said on Monday at the White House. “He fooled Clinton, Bush, Obama, Biden. He didn’t fool me.”\n\nIn February, Mr. Trump expressed confidence that Mr. Putin “will keep his word” on any deal to end the war in Ukraine. But in an interview with the BBC published on Tuesday, when asked whether he trusted Mr. Putin, Mr. Trump paused before answering.\n\n“I trust almost nobody, to be honest with you,” Mr. Trump said. “I’m disappointed in him, but I’m not done with him. But I’m disappointed in him.\"","summary":"U.S. President Donald Trump is downplaying the possibility of sending Ukraine long-range weapons as Kyiv awaits an injection of U.S. weaponry that it hopes will help it beat back an intensifying Russian air offensive","url":"https://www.thehindu.com/news/international/trump-downplays-possibility-of-sending-ukraine-long-range-weapons-as-it-struggles-to-repel-russia/article69816653.ece","image":"https://th-i.thgim.com/public/incoming/njv2ax/article69816654.ece/alternates/LANDSCAPE_1200/Trump_88915.jpg","video":null,"publish_date":"2025-07-15 23:54:00","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.089},{"id":341961894,"title":"Diminished fun in the sun: Americans are spending 25 percent less on summer vacation this year over economic fears","text":"As economic fears grow amid tariff threats, Americans are cutting back on summer travel this year compared to 2024, data shows.\n\nInflation rose and consumer spending slowed in recent weeks as President Donald Trump’s revived tariff threats loomed. He announced fresh levies on 26 countries last week, including a 30 percent tariff on Mexico and the European Union and a 50 percent tariff on Brazil. \n\nEconomic uncertainty in Trump’s second term seems to have factored into summer vacation budgets. Americans, on average, carved out $3,132 for this year’s summer vacation — that’s 25 percent less than the $4,199 they set aside to spend last year, according to a Ipsos-Generali Global Assistance survey.\n\n“The spending slowdown is real,” Diane Swonk, chief economist at KPMG, told the Washington Post. “Consumers are stressed, and this is where we’re seeing it first: in domestic flights, hotels, and a lot of other service-sector spending.”\n\nFewer are planning on traveling at all, according to an SSRS Opinion Panel Omnibus poll. More than half, 56 percent, of Americans said they planned to travel less this summer compared to typical years, the poll found. Finances were the most commonly cited reason for cutting back on travel.\n\nOthers said they were hesitant to travel internationally, due to tensions between the U.S. and other countries. Just under half, 46 percent, of poll respondents said they’re concerned about traveling abroad due to what’s happening in Washington, D.C.\n\nStill, the amount of domestic travel plans this summer seemed consistent with prior years, the poll shows.\n\nOf those planning to vacation this summer, more than half — 53 percent — preferred domestic travel while 25 percent plan to go abroad, the Ipsos-Generali Global Assistance survey found.\n\n“Many are opting for shorter, closer-to-home trips shaped by both economic realities (e.g. inflation, flight prices) and a desire for meaningful, low-stress experiences,” Chris Carnicelli, CEO of Generali Global Assistance, said in a statement.\n\nChelsea Padilla, a 41-year-old Texas middle school teacher, told the Post that she had to be more “thrifty” with her summer vacation plans because her monthly mortgage shot up $200. Rather than planning a trip for her family of five, Padilla and just her 16-year-old daughter flew to Florida using credit card points. \n\nThey opted for a simple property close to the beach that offered a free breakfast — a far cry from the hotel suite they booked last summer. This year to cut back, they nibbled on grocery store purchases, namely fruit and snacks, for lunch and split an entree for dinner.\n\n“It’s become a real balance between the pressures of rising costs and still being able to enjoy our lives,” Padilla told the outlet. “We’re being as thrifty as we can.”","summary":"Americans’ wallets seem to be feeling the impacts of the president’s tariff threats","url":"https://www.independent.co.uk/news/world/americas/americans-spending-less-summer-vacation-b2789747.html","image":"https://static.independent.co.uk/2025/07/15/08/10164207-74d4bd90-6f0e-41d3-9a45-77bd280eba5b.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/aQst83x9-OhrQWqOm.mp4","publish_date":"2025-07-15 23:45:38","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","category":"politics","source_country":"gb","sentiment":0.125},{"id":341962222,"title":"‘Jewish students don’t feel safe’: GOP slams university response to antisemitism","text":"It was the ninth time in 18 months that the House Education and the Workforce Committee has convened a hearing on antisemitism, revisiting familiar flashpoints now focused on how universities have responded to pro-Palestinian protests sparked by the war in Gaza.\n\nProtesters repeatedly interrupted the hearing, shouting “There’s blood on your hands” and “Free Palestine!” After the fourth outburst, Rep. Randy Fine (R-FL) shouted, “Shut up and get out of here!” He turned to the university leaders and said, “I hold you all responsible for this. It is the attitude you’ve allowed on your campuses that makes people think this is okay.”\n\nFine, who is Jewish, added: “Jewish students do not feel safe on your campus today, and you all should be ashamed.”\n\nFor over three hours, Georgetown interim president Robert Groves, CUNY Chancellor Félix V. Matos Rodríguez, and Berkeley Chancellor Rich Lyons largely avoided the missteps that doomed other university leaders in previous high-profile hearings.\n\nIn a December 2023 hearing, the presidents of Harvard and the University of Pennsylvania came under fire after Rep. Elise Stefanik (R-NY) asked whether students calling for the genocide of Jews would face discipline. Their contextual responses sparked backlash that led to their resignations.\n\nThis time, university leaders affirmed their commitment to combating antisemitism while defending the importance of free expression. They outlined steps taken since last year’s protests, including stricter protest policies, expanded antisemitism training, and initiatives to support Jewish students.\n\nRodríguez described how CUNY responded after protesters attempted to take over an administrative building during an encampment earlier this year. “We learned from that experience,” he said. “We now have a zero-tolerance policy against encampments.”\n\nAt Berkeley, a three-week tent protest ended after administrators agreed to review university investments. The school has since imposed limits on encampments and mask-wearing. Georgetown, meanwhile, avoided similar occupations, as students opted to join a demonstration at nearby George Washington University.\n\nRepublicans zeroed in on Qatari influence, especially at Georgetown, which maintains a campus in Doha. Fine accused the school of allowing events that “prop up antisemitism with foreign dollars,” citing a 2023 event featuring armed resistance imagery in solidarity with Palestine. Groves said he was unaware of the event.\n\nStefanik warned that foreign governments such as Qatar and China are funding antisemitic and anti-American narratives through United States universities.\n\n“We cannot let foreign nations prop up antisemitism. We cannot let foreign nations prop up anti-Americanism, which has proven to be the case in many of these institutions, whether it’s Qatari money flowing into Middle Eastern Studies programs, or whether it’s money from the Communist Chinese party propping up Confucius Institutes,” Stefanik said, speaking to reporters following the hearing.\n\nGroves also addressed Georgetown professor Jonathan Brown, who sparked backlash last month for a tweet calling for a “symbolic strike” by Iran on a U.S. military base. Brown has been placed on leave and removed as department chair.\n\n“Within minutes of our learning of that tweet, the dean contacted Professor Brown. The tweet was removed. We issued a statement condemning the tweet. Professor Brown is no longer Chair of his department, and he’s on leave, and we’re beginning a process of reviewing the case,” Groves told lawmakers.\n\nCUNY faced further scrutiny over a now-removed Hunter College job posting in Palestinian studies. The posting sought scholars with a “critical lens” on topics including “settler colonialism” and “apartheid.” Rodríguez said the listing was “entirely inappropriate” and was taken down after New York Gov. Kathy Hochul (D) intervened.\n\nRep. Virginia Foxx (R-NC) challenged Rodríguez over the pro-boycott stance of CUNY’s faculty union president. Rodríguez emphasized the union does not speak for the university, but Foxx pressed him: “You obviously don’t think it’s problematic.”\n\nDuring her questioning, Rep. Stefanik called for disciplinary action against CUNY law professor Ramzi Kassem, criticizing him for representing Mahmoud Khalil, a U.S. permanent resident detained under the Trump administration, which is still pursuing his deportation. She pointed to a separate incident involving a swastika found on a university building, accusing administrators of delaying its removal. Rodríguez said the symbol was preserved briefly for police investigation, and emphasized, “Antisemitism has no place at CUNY.”\n\nRepublican criticisms have closely mirrored President Donald Trump’s messaging, as he has moved to strip top universities of federal funding over their handling of antisemitism. A federal task force has launched investigations into several campuses, and international students involved in pro-Palestinian activism, including Khalil, have faced detention.\n\nDemocrats on the committee pushed back, accusing Republicans of weaponizing Jewish concerns to justify censorship and defunding. “I’m extremely disappointed in the majority for exploiting my community’s legitimate fears,” said Rep. Suzanne Bonamici (D-OR). “Jewish Americans and the American people deserve better.”\n\nRep. Robert Scott (D-VA), the panel’s top Democrat, criticized Republicans for what he described as a narrow approach to antisemitism that ignored broader topics of discrimination and hate.\n\n“Since this committee’s first antisemitism hearing in December 2023, we’ve not held a single hearing addressing racism, xenophobia, sexism, Islamophobia, or other challenges affecting other student groups on American college campuses,” Scott said.","summary":"Republican lawmakers on Tuesday accused university leaders of enabling antisemitism through weak enforcement, ideological bias, and foreign funding, charges educators forcefully rejected in a heated House hearing that exposed deep divisions over campus speech and Jewish student safety. The hearing featured tense exchanges with leaders from Georgetown University, the City University of New York (CUNY), [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3472287/house-gop-slams-university-response-antisemitism/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/AP25196546905657.webp","video":null,"publish_date":"2025-07-15 23:45:08","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.239},{"id":341962748,"title":"World News | Pentagon Ends Deployment of 2,000 National Guard Troops in Los Angeles","text":"Los Angeles, Jul 16 (AP) The Pentagon has said it is ending the deployment of 2,000 National Guard troops in Los Angeles, accounting for nearly half of the soldiers sent to the city to deal with protests over the Trump administration's immigration crackdown. Roughly 4,000 National Guard soldiers and 700 Marines have been in the city since early June. It wasn't immediately clear what prompted the 60-day deployment to end suddenly, nor was it immediately clear how long the rest of the troops would stay in the region. Also Read | India Urges Bangladesh Not to Demolish Satyajit Ray's Ancestral Home; Offers Help to Preserve It. In late June, the top military commander in charge of troops deployed to LA had asked Defense Secretary Pete Hegseth for 200 of them to be returned to wildfire fighting duty amid warnings from Newsom that the Guard was understaffed as California entered peak wildfire season. The end of the deployment comes a week after federal authorities and National Guard troops arrived at MacArthur Park with guns and horses in an operation that ended abruptly. Although the US Department of Homeland Security wouldn't explain the purpose of the operation or whether anyone had been arrested, local officials said it seemed designed to sow fear. Also Read | Israel-Hamas War: IDF Strikes in Gaza Kill 93 Palestinians, Including Several Families, Health Officials Say. \"Thanks to our troops who stepped up to answer the call, the lawlessness in Los Angeles is subsiding,\" Chief Pentagon spokesman Sean Parnell said in a statement in announcing the decision on Tuesday. On June 8, thousands of protesters took to the streets in response to Trump's deployment of the Guard, blocking off a major freeway as law enforcement used tear gas, rubber bullets and flash bangs to control the crowd. Photos captured several Waymo robotaxis set on fire. A day later, police officers used flash bangs and shot projectiles as they pushed protesters through Little Tokyo, where bystanders and restaurant workers rushed to get out of their way. Mayor Karen Bass set a curfew in place for about a week that she said had successfully protected businesses and helped restore order. Demonstrations in the city and the region in recent weeks have been largely small impromptu protests around arrests. The Marines are primarily assigned to protect federal buildings while hundreds of the National Guard troops have been accompanying agents on immigration operations. President Donald Trump ordered the deployment against the wishes of Gov. Gavin Newsom, who sued to stop it. Newsom sued to block Trump's command of the California National Guard, arguing that Trump violated the law when he deployed the troops despite his opposition. He also argued that the National Guard troops were likely violating the Posse Comitatus Act, which prohibits troops from conducting civilian law enforcement on US soil. Newsom won an early victory in the case after a federal judge ruled the Guard deployment was illegal and exceeded Trump's authority. But an appeals court tossed that order, and control of the troops remained with the federal government. The federal court is set to hear arguments next month on whether the troops are violating the Posse Comitatus Act. The deployment of National Guard troops was for 60 days, though Defense Secretary Pete Hegseth had the discretion to shorten or extend it \"to flexibly respond to the evolving situation on the ground\", the Trump administration's lawyers wrote in a June 23 filing in the legal case. Following the Pentagon's decision Tuesday, Newsom said in a statement that the National Guard's deployment to Los Angeles County has pulled troops away from their families and civilian work \"to serve as political pawns for the President\". He added that the remaining troops \"continue without a mission, without direction and without any hopes of returning to help their communities\". \"We call on Trump and the Department of Defense to end this theatre and send everyone home now,\" he said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The Pentagon has said it is ending the deployment of 2,000 National Guard troops in Los Angeles, accounting for nearly half of the soldiers sent to the city to deal with protests over the Trump administration's immigration crackdown.","url":"https://www.latestly.com/agency-news/world-news-pentagon-ends-deployment-of-2000-national-guard-troops-in-los-angeles-6998906.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-15 23:42:08","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.259},{"id":341962670,"title":"Donald Trump Jr. and Bettina Anderson’s marriage plans reportedly revealed: ‘Sooner than later’","text":"Wedding bells might be in Donald Trump Jr. and Bettina Anderson’s future. \n\n“She 100 percent would say yes if he asked her to marry him and his friends think that will happen sooner than later,” an insider told Us Weekly Tuesday.\n\n“She would love to have kids one day and sees what a good father he is.”\n\nThe source gushed over Trump Jr. 47, and Anderson’s relationship, adding, “[they] are really cute and loving around each other.”\n\n“He is very much a gentleman and pulls her chair out, lets her order first and treats her so well,” the insider continued.\n\nThe couple is also reportedly “so affectionate” with each other while out with their friends, but not “over the top” with their PDA.\n\n“They hold hands and always sneak in little kisses,” the insider claimed. “He tells her how smart and gorgeous she is all the time.” \n\nThe source described Anderson, 38, and Trump Jr.’s vibe as “very in love” and comfortable with each other, saying how the latter can “get glammed up and look amazing, go fishing and golfing with [her beau], or get sweaty and be laid back.”\n\n“She is more shy but funny and Don appreciates how she lets him talk to people and be around his guy friends,” the insider added, explaining that the socialite can “hold her own conversations and enjoy herself.”\n\nAnderson’s also reportedly enjoys spending time with the businessman’s children: Kai, 18, Donald III, 16, Tristan, 13, Spencer, 12, and Chloe, 11.\n\nTrump Jr. shares his five kids with his ex-wife, Vanessa Trump, to whom he was married from 2005 to 2018.\n\nReps for the couple weren’t immediately available to Page Six for comment.\n\nIn December 2024, Page Six confirmed that Trump Jr. and Anderson quietly started dating that summer, and the following month, we learned they “essentially” moved in together.\n\nEver since then, the duo has been inseparable and were most recently photographed getting handsy at the Teterboro Airport in New Jersey on Sunday. \n\nVanessa, meanwhile, has moved on with golf pro Tiger Woods.","summary":"Page Six broke the news that the socialite and businessman were dating last December.","url":"https://pagesix.com/2025/07/15/celebrity-news/donald-trump-jr-and-bettina-andersons-marriage-plans-reportedly-revealed-sooner-than-later/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/07/108211272.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-15 23:40:50","author":"mliss1578,Vanessa Serna","authors":["mliss1578","Vanessa Serna"],"language":"en","category":"politics","source_country":"zm","sentiment":0.829},{"id":341970226,"title":"Last Call for the $7,500 EV Tax Credit: It Expires in September","text":"Car dealers are always advertising that now is the best time to buy, but if you're in the market for an electric vehicle, now might actually be the best time to buy.\n\nThe reason: Congress voted to pull the plug early on a massive tax incentive that could save buyers up to $7,500 on new EVs. Instead of expiring in 2032, the tax break now ends Sept. 30 of this year. An EV you buy in October or later won't qualify.\n\nThe move by congressional Republicans and signed by President Donald Trump was designed to help pay for the continuation of tax cuts from Trump's first term, which some say are most helpful for the wealthiest taxpayers. Congress gutted a host of clean-energy tax breaks in the bill Trump signed on July 4, essentially repealing much of the Inflation Reduction Act passed under President Joe Biden.\n\nWith the EV credit expiring mid-year, it sets up a weird 2025 for an auto industry that also faces potential challenges from Trump's tariff policy. Thanks to international supply chains for parts and materials, this is likely to increase the cost of cars and trucks even if they're assembled in the US.\n\nIf you're in the market for an EV, that means you might want to think a little more closely about your buying schedule. \"My ordinary advice for everyone all the time is don't be in a big hurry, take your time and make a careful decision,\" Sean Tucker, lead editor at Kelley Blue Book, told me. \"This is the one circumstance where you might want to be in a big hurry.\"\n\nIt makes sense that EV sales are at a record pace through the first six months of the year, according to KBB data, and the end of the tax credit could lead to a third-quarter boom, with the bottom falling out in the fourth quarter.\n\nWhat is the EV tax credit?\n\nRight now, the federal government provides a credit of up to $7,500 for a new electric vehicle, plug-in hybrid or fuel cell electric vehicle. The credit is split into two equal parts, with a $3,750 credit each if the vehicle meets requirements for the sourcing of materials for the battery components and critical materials. Because of those requirements, only a handful of vehicles qualify. You do need to meet some income limits -- you can't have taxable income above $150,000 if you file individually, $300,000 if you're married filing jointly or $225,000 if you file as head of household.\n\nThere's also a credit for used EVs equivalent to 30% of the sales price up to $4,000. The list of qualifying vehicles here is more extensive, but the used EV market is also a lot smaller than the new EV market. Although that has been changing -- more than 100,000 used EVs were sold in the US in the second quarter of the year, compared with more than 300,000 new EVs, according to KBB data.\n\nTo get the credit, you can either claim it on your tax return the following year or you can transfer the credit to the dealer so they can apply it to your purchase cost. That second option has become more popular since it's easier and reduces your up-front cost.\n\nYou can also get the credit on leased vehicles. Dealerships are very familiar with applying credits toward leased EVs, Tucker said.\n\nShould I buy an EV now before the credit ends?\n\nThe most important part of deciding whether to buy a car is to buy one when you're ready to. Don't rush into a big purchase just because a tax credit is ending. The fact is that EVs are coming down in price and are often similar, when you consider the total cost of ownership, to the price of a gasoline-powered car. You should also consider that not every EV qualifies for this credit anyway -- the one you're eyeing might not see any change in pricing, at least not due to the credit expiring. (Tariffs are another issue.)\n\nBut the end of the credit does mean dealers will likely be looking to reduce their stock of electric cars by the end of September. That means if you're in the market and you're eyeing one of the qualifying vehicles, you may want to move to make a purchase before October, Tucker said.\n\nThere could be more strategy at play. Tucker suggested looking at dealers that have significant stocks of EVs, which may offer steeper discounts to get them off the lots before the prices go up. The best time to buy might be mid- or late September, right before the credit ends, to get the best deal possible.\n\n\"If I tell you it's your last chance to save $7,500 on something, that's a sentence you don't hear very often,\" Tucker said.\n\nDon't let this moment overwhelm other good car-buying advice, though. Tucker advises that one of the best ways to get a good deal is to buy a vehicle that's right for you most of the time, even if it doesn't necessarily meet every possible scenario you can think of. Do you really need a third row of seating if you'll only use it when company is in town? Do you need a big pickup truck if you're mostly just hauling yourself to the office?\n\nCNET's auto expert, Antuan Goodwin, suggests reevaluating your car-buying goals to save money. For example, Goodwin says, instead of a top-tier model, consider a mid-trim level with only the features you truly need. You can also consider low-mileage, pre-owned cars or leasing as alternatives to buying new. \n\n\"If going electric would stretch your budget, exploring combustion alternatives like plug-in or traditional hybrids are good compromises,\" Goodwin said. \"That's mostly because I don't want to dissuade anyone who's 'set on going electric' from doing so, but for someone on the fence, alternatives exist.\"","summary":"It's not often that a deal that could save you thousands of dollars on a car has an expiration date. But be careful with your car buying decisions, experts say.","url":"https://www.cnet.com/roadshow/news/last-call-for-the-7500-ev-tax-credit-it-expires-in-september/","image":"https://www.cnet.com/a/img/resize/0b2548bb1edf28fa569fb2760c9657cc630ac8a7/hub/2025/07/15/254ce8bd-468b-42d5-9fe8-bb237f9f2f08/gettyimages-2215956745.jpg?auto=webp&fit=crop&height=675&width=1200","video":null,"publish_date":"2025-07-15 23:40:26","author":"Jon Reed","authors":["Jon Reed"],"language":"en","source_country":"US","sentiment":-0.183},{"id":341972736,"title":"Republicans declared it ‘crypto’ week in the House. It’s not going as planned - AP News","text":"WASHINGTON (AP) — A trio of cryptocurrency bills that had been expected to pass the House this week stalled on Tuesday after a bloc of Republicans unexpectedly joined with Democrats to prevent the legislation from coming up for debate and votes. \n\nThe procedural snafu brought the House’s so-called “crypto week” to a standstill — and dealt a blow to President Donald Trump, who had strongly urged Republicans to pass the bills as part of his push to make the U.S. the “ crypto capital of the world.”\n\nA group of 13 Republicans joined all Democrats in opposition to a procedural vote needed to bring the crypto bills to the floor. Speaker Mike Johnson told reporters it was just part of “legislative process” and that negotiations were underway between the House, Senate and White House. He suggested they could try again Tuesday evening.\n\n“We expected there might be some ‘no’ votes, but we thought it was important to put it on the floor to advance it because time’s of the essence on this,” Johnson said. “So stay tuned. We’ll have lots of discussions over the next few hours.”\n\nBut just hours later, House leadership canceled votes for the remainder of the day, potentially throwing the crypto bills into limbo. \n\nThe stalled legislation includes a Senate-passed bill to regulate a form of cryptocurrency known as stablecoins, along with far more sweeping measures aiming to address cryptocurrency market structure. Another bill would prohibit the Federal Reserve from issuing a central bank digital currency. \n\nThe disagreement blocking the bills from advancing centers on how the three bills would be passed. Johnson explained that “some of these guys insist that it needs to be all in one package.” Packaging the bills would require them to be sent back to the Senate, since the chamber has only taken up one of the three bills so far. \n\nRep. Glenn Thompson of Pennsylvania, a Republican co-sponsor of one of the cryptocurrency bills, told reporters that some of the Republicans wanted to package the bills together due to them “not having a lot of faith in the Senate moving our legislation.”\n\nTrump and Republican leaders have called on the House to pass the bills individually, so that the stablecoin legislation can get to Trump’s desk for his signature before an August recess. The stablecoin legislation took the Senate nearly a month and half to pass, and the more sweeping market structure legislation is expected to take even longer. \n\nIn a post Tuesday morning on social media, Trump called on Republicans to advance the crypto bills that afternoon, saying that “all Republicans should vote ‘yes.’” Asked Tuesday evening about the stalled legislation, Trump told reporters that Republicans who voted against it wanted it to be “stronger.” \n\nTrump has pushed hard for the passage of the stablecoin legislation, with him and his family standing to profit from a boost to stablecoins. They hold a significant stake in World Liberty Financial, a crypto project that recently launched its own stablecoin, USD1.\n\nThe stablecoin legislation passed by the Senate includes a provision that bars members of Congress and their families from profiting off stablecoins. But notably, that prohibition does not apply to the president or his family, even as Trump builds what some are calling a crypto empire from the White House.\n\nThe cryptocurrency industry hopes the bills as a whole will aid in their push for legitimacy and increasing consumer trust. And road bumps like those seen Tuesday may not have been expected after spending heavily in the 2024 election to elect a large number of crypto-friendly lawmakers. \n\nFaryar Shirzad, chief policy officer of Coinbase, the nation’s largest cryptocurrency exchange, said in a statement after the failed procedural vote that “every few steps forward there’s inevitably a step back.”\n\n“It’s in these moments we’ll see who is trying to get pro-crypto legislation done and who is not,” Shirzad said on social media. \n\nPassage of the bills could have implications on the 2026 midterm races. Fairshake, a crypto super political action committee, said that it and its affiliated organizations already have more than $140 million in the bank ready to spend on midterm races.\n\n“The voters last year were clear — Congress needs to stop playing politics with crypto and finally pass responsible regulation,” said Josh Vlasto, spokesperson for Fairshake. “We are building an aggressive, targeted strategy for next year to ensure that pro-crypto voices are heard in key races across the country.”\n\nAssociated Press writer Lisa Mascaro contributed to this report.","summary":"Republicans declared it ‘crypto’ week in the House. It’s not going as planned  AP News","url":"https://apnews.com/article/cryptocurrency-trump-house-c5615ca72cd77b5895bafac9d4cf1d79","image":"https://dims.apnews.com/dims4/default/5c380e9/2147483647/strip/true/crop/5000x2813+0+261/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F8f%2F0562bec3648f5e264d582c266ee0%2Fa86c092aa664456497cd1a2fcf436784","video":null,"publish_date":"2025-07-15 23:39:00","author":"Lisa Mascaro","authors":["Lisa Mascaro"],"language":"en","category":"politics","source_country":"us","sentiment":-0.37}]}