{
	"offset": 0,
	"number": 50,
	"available": 7358,
	"news": [
		{
			"id": 251758728,
			"title": "Media kept bias on full display after Trump assassination attempt",
			"text": "The assassination attempt on former president Donald Trump that played out live on national television should have resulted in the kind of objective, unbiased coverage the country deserved at such a terrifying moment. Some outlets, however, failed the test miserably. Take these headlines, for example, in the immediate aftermath: CNN: “Secret Service Rushes Trump Off Stage After He Falls at Rally” Associated Press: “Donald Trump Has Been Escorted Off The Stage During A Rally After Loud Noises Ring Out In The Crowd” The New York Times: “Trump Hurt, But Safe, After A Shooting” Forbes: “Will Surviving Gunfire Be Donald Trump’s Next Appeal To Black Voters?” Politico: “In wake of the rally shooting, GOP officials have been quick to blame Democrats for demonizing Trump” There’s more, but you get the idea. Needless to say, it was abundantly clear that Trump had been shot once he was brought to his feet by Secret Service agents about one minute after being hit. Shots could be heard before he crouched down to take cover. His visibly injured ear had splashed bright red blood across his face that was clear to see, even at a distance. Yet we had CNN initially reporting he had fallen? How about the Times and Politico calling this “a shooting” instead of an assassination attempt? How about Forbes wondering, just hours after the attack, if it would make Trump more appealing to black voters? And Politico, scolding Republicans for seizing and pouncing on Democrats, angry that they and their allies in the media have referred to Trump as Hitler for eight years? Margaret Brennan of CBS News, the former home of Walter Cronkite, even managed to victim-blame Trump for nearly getting killed, after reading a statement from the former president thanking the Secret Service and describing what had happened. “I did notice there was no call for lowering the temperature, condemning all political violence, and really trying to signal to his supporters as well, not to retaliate or to have any kind of escalation here,” was Brennan’s immediate reaction. There are no words. It somehow got worse over on ABC News Sunday morning during a conversation between George Stephanopoulos and Martha Raddatz, who fancy themselves as serious journalists. “President Trump and his supporters have contributed to this violent rhetoric as well,” Stephanopoulos, Bill Clinton’s former attack dog, argued. “Absolutely, George,” Raddatz concurred. “And let’s remember Jan. 6,” she added. Many of us will recall forever the iconic moment when a bloodied Trump, surrounded by his Secret Service detail, pumped his fist at the crowd and urged them to “Fight. Fight. Fight.” It was emblematic of Trump’s toughness and determination and defiance, even after taking a bullet to the ear just one minute earlier. But on CNN, this was seen as a big no-no, even as the horrific scene was unfolding. “That’s not the message that we want to being sending right now,” CNN’s Jamie Gangel chided the wounded candidate. “We want to tamp it down.” Yes: The network that has endlessly attacked Trump as a racist, fascist demagogue seeking to destroy democracy was lecturing him just seconds after he was a millimeter away from being murdered. For these outlets, there’s no coming back from this. Their rhetoric has been building for years without any accountability. Media figures’ most hyperbolic and personal and dishonest attacks on Trump have not only cost them no consequences, but have probably brought them raises and promotions with each new contract. As for President Biden and his speechwriters, they have helped foment this deadly environment. Here’s what the president said on July 8: “We’re done talking about the debate, it’s time to put Trump in a bullseye.” Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and ‘fear not’ after shooting Gunman behind attempted assassination on Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date on updates with the Post’s live blog on the assassination attempt on Trump Last year, Rep. Dan Goldman (D-NY) expressed a similar sentiment when he spoke to Jen Paski on MSNBC. “That man [Trump] cannot see public office again,” Goldman said. “He has to be eliminated.” Psaki — Biden’s former press secretary — offered no pushback. Any questions? A former president, likely to be the next president, was shot on Saturday. It’s a miracle he survived the attempt. What won’t survive is any last shred of credibility many in our media ever had. Joe Concha is a Fox News contributor and bestselling author.",
			"summary": "Terrified viewers deserved objective, unbiased coverage, but some outlets failed the test miserably.",
			"url": "https://nypost.com/2024/07/14/opinion/lefty-media-kept-bias-on-full-display-after-trump-was-shot/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-cyghpt4xy-1720998650761.jpg?quality=75&strip=all&1720984301&w=1200",
			"video": null,
			"publish_date": "2024-07-14 23:32:57",
			"author": "Joe Concha",
			"authors": ["Joe Concha"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.43
		},
		{
			"id": 251758774,
			"title": "WATCH LIVE: Biden addresses nation after apparent assassination attempt on Trump",
			"text": "President Joe Biden is speaking to the nation after presumptive Republican presidential candidate Donald Trump was shot during one of his rallies on Saturday. Biden has announced an independent investigation after Trump was shot in the ear during a rally in Butler, Pennsylvania. The former president is said to be “fine” after the shooting, but a rallygoer was killed, and two others were critically injured. Biden spoke with his chief political rival, Trump, on Saturday night, and the current president remarked about the conversation: “I’m just really grateful that he’s doing well and recovering. We had a short but good conversation, and we’re keeping him and his family in our prayers.” “As I said last night, there is no place in America for this kind of violence or any violence for that matter,” Biden added. “The assassination attempt is contrary to everything we stand for as a nation. It’s not who we are, and we cannot allow this to happen.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Sunday’s address is likely to be a major moment in the 2024 election race as Biden has come under intense scrutiny following the first presidential debate and the apparent attempted assassination of Trump has only further rallied his supporters around his cause. Biden’s address will take place at 8 p.m. Eastern. The Republican National Convention is being held this week from Monday to Thursday in Milwaukee, and Trump, following Saturday’s shooting, has already arrived in Wisconsin.",
			"summary": "President Joe Biden is speaking to the nation after presumptive Republican presidential candidate Donald Trump was shot during one of his rallies on Saturday. Biden has announced an independent investigation after Trump was shot in the ear during a rally in Butler, Pennsylvania. The former president is said to be &#8220;fine&#8221; after the shooting, but [&#8230;]",
			"url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082053/watch-live-biden-addresses-nation-trump-shot/",
			"image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/07/biden-address-to-nation-scaled.webp",
			"video": null,
			"publish_date": "2024-07-14 23:31:34",
			"author": "Conrad Hoyt",
			"authors": ["Conrad Hoyt"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.145
		},
		{
			"id": 251758708,
			"title": "‘A significant security failure’ Bill Bratton says as questions fly about Trump assassination attempt",
			"text": "Considering the feverish state of political tensions in the country, the United States and the former president both narrowly survived a gunman’s bullet on Saturday evening, according to a security expert. Speaking with the Herald Sunday, former New York City and Boston Police Commissioner Bill Bratton said that the apparent attempted assassination of former President Donald Trump could have pushed political tempers high enough to boil over into the streets of American cities, and that it’s only luck that spared the 45th President and the U.S. itself from a massive security failure and potential doom. “There was a significant security failure at this event. Mr. Trump and the country both dodged a fatal bullet. If, God forbid, he had been killed, there would have been absolute chaos,” Bratton said. Trump, who according to his own social media postings is doing well after he was apparently struck in the ear by a rifle round fired by the deceased 20-year-old would-be assassin, is already under heightened Secret Service protection, Bratton said. It’s a wonder then, the former law enforcement official said, that the roof from which the shooter is said to have fired his shots was not occupied by a member of the Secret Service or a local law enforcement officer. “I think its becoming very clear that security for this event was deficient. The fact there was a near-successful attempt on the former president’s life, it’s going to raise all kinds of questions going forward,” he said. In the meantime, there is going to be a “fog of confusion” surrounding Saturday’s shooting, which will only resolve through the course of an investigation, Bratton said. “The first story is never the last story,” he said. Even the best laid security plans are fallible, Bratton said, and the Secret Service deserves praise for how quickly they neutralized the danger to the former President, but they’ll still need to answer for their lapse leading up to the event, he said. It’s possible a threat, or “signal” from the shooting suspect was missed by some law enforcement agency somewhere, Bratton said. “It was a great response after the fact — but how did it get to the fact?” Bratton said. President Joe Biden, speaking from the White House alongside Attorney General Merrick Garland, said that the FBI will lead the investigation into the shooting and that the Secret Service has been instructed to consider additional precautions around the Republican National Convention, which starts on Monday. The President asked the public not to rush to assumptions and to let law enforcement officials do their work. “We don’t yet have any information about the motive of the shooter. We know who he is. I urge everyone — everyone, please, don’t make assumptions about his motives or his affiliations,” he said. “I’ve instructed that this investigation be thorough and swift. And the investigators will have every resource they need to get this done.” Biden, who said he spoke with Trump by phone shortly after the shooting, also said he’s ordered an “independent review” of what occurred Saturday, and promised to release the results of the inquiry to the public. In a statement Sunday, the FBI said that “this remains an active and ongoing investigation, and anyone with information that may assist with the investigation is encouraged to submit photos or videos online at fbi.gov/butler or call 1-800-CALL-FBI.” Law enforcement officials have already received thousands of tips, and FBI Deputy Director Paul Abbate said that online rhetoric has “ticked up” since the shooting. The Bureau has identified Bethel Park, Pennsylvania resident Thomas Matthew Crooks, 20, “as the subject involved in the assassination attempt of former President Donald Trump on July 13, in Butler, Pennsylvania.” Early indications are that the shooter acted alone, according to the FBI. U.S. Rep. Mike Turner, a Republican from Ohio who chairs the House Intelligence Committee, called the shooting an “unthinkable” and “unfathomable” sort of “security failure.” “How is it that someone could get on a roof with a superior position, with a weapon, and attempt to assassinate former President Donald Trump?” he asked. Bratton said that if he were advising the former President on matters of security he would be encouraged to stop holding outdoor events for now. “Open events are a nightmare, they are a nightmare to try and secure,” he said. Part of the problem with security on Saturday may be attributed to staffing at the agency tasked with protecting Presidents and former Presidents, Bratton said. With both Trump and Biden campaigning across the country in the lead up to November’s general election, the Secret Service is undoubtedly “spread a little thin,” he said, and that means they have to rely more and more on local law enforcement, who may not have the staffing or funding to secure a national security level event. People should view this event as a “wake up call,” the former police commissioner said. “This is a tragic event. It reminds people just how divided a country we are and the lengths that some people will go to vent their anger, their frustration, their hostility. The idea that a 20-year-old man would attempt to assassinate a potential future president reflects where we are,” Bratton said. “Let’s all take a step back and try to calm down,” he said.",
			"summary": "“There was a significant security failure at this event. Mr. Trump and the country both dodged a fatal bullet. If, God forbid, he had been killed, there would have been absolute chaos,” former Boston and New York City police commissioner Bill Bratton said.",
			"url": "https://www.bostonherald.com/2024/07/14/a-significant-security-failure-bill-bratton-says-as-questions-fly-about-trump-assassination-attempt/",
			"image": "https://www.bostonherald.com/wp-content/uploads/2024/07/AP24196243004323-1.jpg?w=1024",
			"video": null,
			"publish_date": "2024-07-14 23:27:57",
			"author": "Matthew Medsger",
			"authors": ["Matthew Medsger"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.293
		},
		{
			"id": 251758612,
			"title": "Blind BBC Reporter Recounts Moment of Taking Cover During Donald Trump Assassination Attempt",
			"text": "A BBC reporter has described the moment he had to take cover on the ground after ‘half a dozen’ shots were fired during Donald Trump’s assassination attempt last night. Gary O’Donoghue, 55, was filmed lying on a grass bank behind his car just after 10 minutes into the former president’s speech when he heard gunshots. As members of the public ran down the street behind him, the political correspondent said: ‘While we were just about to go live on the BBC World Service, we heard some shots fired probably a few hundred metres from where we were standing’. Recalling the terrifying experience, he said he heard around ‘half a dozen’ gunshots as well as a woman shouting that someone had been shooting. ‘A guy came by and said he thought there had been a couple of snipers but he wasn’t sure,’ O’Donoghue added. Crouched on the ground in front of a group of billboards the reporter explained he and his team were waiting to see if things had cleared while hiding behind their ‘not ideal’ shelter of their vehicle. The speech had ended, and the blind journalist revealed he could no longer hear Trump speaking as he attempted to ascertain what had happened at the scene. On Saturday evening at 6:15pm, former US President Donald Trump was the target of an assassination attempt while he delivered a speech at a rally in Butler, Pennsylvania. The gunman has since been revealed as 20-year-old registered Republican Thomas Matthew Crooks, from Bethel Park, Pennsylvania. It has since emerged through federal campaign finance records that the gunman was a registered Republican who had previously made a $15 donation to the liberal ActBlue political action committee on January 20, 2021 – Biden’s Inauguration Day. From a rooftop located around 150 yards from Trump’s stage, Crooks fired at least eight shots before the former president was seen clutching his bloody ear. Footage of the moment shows Trump being immediately ushered away by the US Secret Service as the crowd descended into chaos. But in a show of strength, Trump emerged from the cover of the suited agents and raised a fist, shouting: ‘Fight, fight, fight’, before he was rushed to hospital. Crooks had killed a member of the crowd and critically injured two others before he was gunned down by the Secret Service. The shooter was killed after he fired from an ‘elevated position’ outside the outdoor rally venue, according to the Secret Service. Images show at least four members of law enforcement surrounding the bloody gunman and the AR-15-type semiautomatic rifle he used on the roof, while they point their guns towards his body. During the attack, Crooks appeared to be wearing merchandise promoting one of YouTube’s most popular channels devoted to firearms – Demolition Ranch – NBC News reported. According to Pennsylvania’s public court records, Crooks had no criminal history and officials claimed they are still working towards identifying a motive behind the shooting. His father, Matthew Crooks told CNN late on Saturday night that he was trying to figure out ‘what the hell is going on’ but would ‘wait until I talk to law enforcement’ before speaking about his son. Officials have released no additional information about the shooter. ‘This remains an active and ongoing investigation,’ the FBI said in a statement early Sunday. Last night a bomb squad and agents from the Bureau of Alcohol, Tobacco, Firearms and Explosives were at an address registered to Crooks as cops stood guard in front of yellow police caution tape. Trump flew back to New Jersey ahead of his spending the night at his golf resort in Bedminster. In a post to his Truth Social network, Trump thanked the Secret Service and other law enforcement ‘for their rapid response’. ‘I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,’ he said on social media. ‘Much bleeding took place, so I realised then what was happening. ‘I want to thank The United States Secret Service, and all of law enforcement, for their rapid response,’ Trump added. ‘Most importantly, I want to extend my condolences to the family of the person at the rally who was killed, and also to the family of another person that was badly injured. ‘It is incredible that such an act can take place in our country. ‘GOD BLESS AMERICA!’ The shooter appeared to have graduated in 2022 from Bethel Park High School, and received a $500 ‘star award’ that year from the National Math and Science Initiative, a report from The Tribune-Review in western Pennsylvania. In an online recording of the 2022 graduation ceremony, he can be seen crossing the stage as the crowd applauds him, before briefly posing with a school official and accepting his diploma.",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nA BBC reporter has described the moment he had to take cover&#8230;\n\n\nThis Post: Blind BBC Reporter Recounts Moment of Taking Cover During Donald Trump Assassination Attempt first appeared on Internewscast Journal",
			"url": "https://internewscast.com/politics/blind-bbc-reporter-recounts-moment-of-taking-cover-during-donald-trump-assassination-attempt/",
			"image": "https://i.dailymail.co.uk/1s/2024/07/14/12/87312845-0-image-m-9_1720955461702.jpg",
			"video": null,
			"publish_date": "2024-07-14 23:27:05",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.588
		},
		{
			"id": 251758608,
			"title": "Historian discusses previous presidential assassinations and attempts",
			"text": "Historian discusses previous presidential assassinations and attempts Four U.S. presidents and one presidential candidate have been assassinated throughout the country's history. Several presidents have also survived assassination attempts. Presidential historian Douglas Brinkley helps put the attempt on former President Donald Trump's life in context.",
			"summary": "Four U.S. presidents and one presidential candidate have been assassinated throughout the country's history. Several presidents have also survived assassination attempts. Presidential historian Douglas Brinkley helps put the attempt on former President Donald Trump's life in context.",
			"url": "https://www.cbsnews.com/video/historian-discusses-previous-presidential-assassinations-and-attempts/",
			"image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/14/4b8a44f7-1107-4f60-9cbb-9b1df0f0c7c4/thumbnail/1200x630/a3b59a6bd981139b8a7187d28957b4a9/0714-en-historian.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 23:25:00",
			"author": null,
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.264
		},
		{
			"id": 251758582,
			"title": "Congress moves quickly to investigate shooting at Trump rally",
			"text": "Lawmakers in the House and Senate said Sunday they would investigate the apparent assassination attempt on former president Donald Trump, demanding documents and testimony from the U.S. Secret Service, while others moved to enhance the security provided to presidential candidates. At the center of the maelstrom on Capitol Hill are questions posed by Republicans and Democrats alike about the agency charged with safeguarding Trump and top U.S. leaders — and how a gunman managed to open fire on someone under its protection.",
			"summary": "Republicans and Democrats in Congress said they will scrutinize the Secret Service after a gunman opened fire at former president Donald Trump’s rally in Butler, Pa.",
			"url": "https://www.washingtonpost.com/nation/2024/07/14/trump-shooting-congress-investigations/",
			"image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HUT4LPPVVDZKSTWXADMQXGHORI.JPG&w=1440",
			"video": null,
			"publish_date": "2024-07-14 23:21:39",
			"author": "Jacqueline Alemany,Marianna Sotomayor",
			"authors": ["Jacqueline Alemany", "Marianna Sotomayor"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.362
		},
		{
			"id": 251758418,
			"title": "I was yards from the stage during the attempted Trump assassination — this is what it was like to witness history",
			"text": "BUTLER, Pa. — I crammed myself up onto the stairs leading to the risers for the press just yards from the stage as former President Donald Trump arrived at the Butler Farm Show fairgrounds around 6 p.m. Saturday. Equipped with only my cell phone as I anticipated Trump’s signature entrance to Lee Greenwood’s “God Bless the USA,” I snapped a selfie with hundreds of rallygoers on the ground behind me. The photo was meant for posterity, simply documenting my campaign travels. Little did I know how signifcant the night would be. Fewer than 30 minutes after taking that photo, I heard three shots ring out somewhere to my left. We now know shots were fired by 20-year-old Thomas Matthew Crooks of nearby Bethel Park from a rooftop with a clear sight to the stage. Trump’s right ear was grazed by a bullet, while an attendee in the line of fire was killed. A sense of dazed chaos is the only way I can describe what followed. Some rally-goers hugged and wept. Others stood in stunned silence, showing surprisingly little urgency to run for cover. Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and ‘fear not’ after shooting Gunman behind attempted assassination on Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date on updates with the Post’s live blog on the assassination attempt on Trump A small group of men turned their grief toward reporters on the risers, blaming the media for encouraging rhetoric they believed had caused a would-be assassin to take his shot. One even grumbled about the start of a “civil war,” as it was still unclear how badly Trump was hurt. Moments before being shot, Trump said he really did not need to be running for president and that maybe he should retire somewhere with a great view of the ocean. But here he was, a New York real-estate titan in rural Pennsylvania just two days before the Republican National Convention — an event that will almost certainly nominate him for president a third straight time. After the shooting, Trump was treated at Butler Memorial Hospital, and I and other reporters descended on the facility before sunset. No one was allowed on hospital grounds, and rooftop snipers kept a watchful eye on all of us in a gravel parking lot across the street. A lone woman on the sidewalk near the hospital entrance held a distasteful sign reading, “Wishing Trump a long, terrible recovery!” Positive news would come from Trump’s campaign and the Secret Service, which issued respective statements saying he was “fine” and “safe.” Around 9 p.m., I recorded a large helicopter leaving the hospital. Pennsylvania Gov. Josh Shapiro would later confirm that Trump was gone from the area. The next day, on Sunday morning, the scene inside Butler Farm Show fairgrounds was unexpectedly relaxed. Just before 8 a.m., a Pennsylvania State Police trooper blocked the entrance to the fairgrounds, so several reporters gathered along the side of Meridian Road, located directly east of the rally site. Another entrance to the fairgrounds, to its south from Buttercup Lane, was much less restricted, allowing me to gain entry a short time later. In the large grassy area used for parking by rally attendees, I saw trash and a handful of cars littering the landscape. Fewer reporters were in this area, though some white utility trucks were seen going in and out of a gated area closer to the rally site. Looking west from the gates, a makeshift helipad used to evacuate those injured during the shooting was still intact. Dozens of small airport-hangar-style buildings with rooftops such as the one used by Crooks are present on the site — a fact that has and will likely continue to prompt concerns about the safety of the venue chosen for such an event. Speaking with a colleague, I talked about how I had just witnessed history. It was one of those, “Where were you when…” moments — and I happened to be there.",
			"summary": "Little did I know how signifcant the night would be.",
			"url": "https://nypost.com/2024/07/14/us-news/i-was-yards-from-the-stage-during-the-attempted-trump-assassination-this-is-what-it-was-like-to-witness-history/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/carson-swick-pov-donald-trump-85476067.jpg?quality=75&strip=all&w=1200",
			"video": "https://cdn.jwplayer.com/videos/4OZeFluG-RyIcpnTz.mp4",
			"publish_date": "2024-07-14 23:21:12",
			"author": "Carson Swick",
			"authors": ["Carson Swick"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.459
		},
		{
			"id": 251758222,
			"title": "Failed Trump assassination puts spotlight on security for the Republican National Convention",
			"text": "Failed Trump assassination puts spotlight on security for the Republican National Convention After Saturday's failed assassination attempt on former President Donald Trump, the focus now turns to security at the Republican National Convention, which starts Monday in Milwaukee. Caitlin Huey-Burns takes a look at what changes are being made and Secret Service efforts to avoid another failure.",
			"summary": "After Saturday's failed assassination attempt on former President Donald Trump, the focus now turns to security at the Republican National Convention, which starts Monday in Milwaukee. Caitlin Huey-Burns takes a look at what changes are being made and Secret Service efforts to avoid another failure.",
			"url": "https://www.cbsnews.com/video/failed-trump-assassination-puts-spotlight-on-security-for-the-republican-national-convention/",
			"image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/14/63f6b5f8-993b-451b-9ad1-0680408926fe/thumbnail/1200x630/6248c7b8d308e4c738810c1e9e255a81/0714-en-rnc.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 23:17:00",
			"author": null,
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.897
		},
		{
			"id": 251758234,
			"title": "Trump fundraises off assassination attempt as Biden suspends campaign ads in aftermath of rally shooting",
			"text": "Donald Trump’s campaign has begun soliciting donations in the wake of his attempted assassination even as Joe Biden’s campaign halted all TV ads while the nation reels from the attack at a rally in rural Pennsylvania. One day after a bullet grazed Trump’s ear in the shooting that left one spectator dead, his campaign sent at least two text message-based fundraising appeals which contain links to WinRed, the GOP-affiliated fundraising platform run by the ex-president’s allies. The page contains an image of Trump raising his fist while wearing one of his signature campaign hats, an American flag flying above. It appears deliberately meant to echo the now-famous photograph, of the bloodied ex-president striking a defiant pose as he was rushed off by his Secret Service detail, taken by Associated Press photographer Evan Vucci moments after the shooting. The Independent reviewed two separate texts sent out by the Trump campaign using its texting “short code,” 88022. One of the messages read: “From Trump: FEAR NOT ... It is more important than ever that we stand UNITED,” while the other bore the message “NEVER SURRENDER.” Both contained links to Trump’s WinRed page. A third text, sent at 5.24pm (Eastern Time) on Sunday, repeated the “fear not” message and reported that Trump would be speaking as planned at the Republican National Convention this week. It also included a link to the same campaign fundraising page. At the same time, the Biden re-election effort has “paused all outbound communications” in the aftermath of the shooting, and is “working to pull down our television ads as quickly as possible,” a campaign official told Reuters. Trump was shot at a Pennsylvania campaign rally on Saturday by Thomas Matthew Crooks, a 20-year-old who lived in the Pittsburgh suburbs. He squeezed off a number of rounds from an AR-15 assault-style rifle that authorities say was purchased legally by his father, a licensed behavioral counselor. However, investigators said they were not yet sure if Crooks’ dad knew he had taken the gun, or if he took it without permission. Crooks, who was not attending the Trump rally, posted up on a nearby rooftop, which was just outside the secure perimeter set up by the Secret Service. Still, the building was “within the area of vulnerabilities, so a lot of questions remain unanswered,” former Secret Service Special Agent Jonathan Wackrow told The Independent. One of the rounds grazed Trump’s right ear; the former president was not seriously injured. Still, the rally descended into chaos as terrified attendees hit the deck and a bloodied Trump was hustled offstage by his Secret Service detail. Secret Service snipers quickly “neutralized” Crooks, whose body could be seen on bystander video, lying prone on the roof from which he fired at least eight shots. Crooks was dressed in gray camouflage and had explosives in his car, according to the FBI, which is heading up the investigation. Trump was taken to a local medical center and quickly released, then flew to New Jersey in advance of the RNC, which kicks off in Milwaukee on Monday. The shooting was emblamatic of “a security breakdown from start to finish,” former FBI Assistant Director Chris Swecker said in an appearance on Fox News. Moments after being shot, Trump pumped his fist to the crowd and mouthed the words, “Fight! Fight! Fight!” This, Swecker argued, never should have happened. “[H]e should have been off that stage, in that car, and out of there in seconds,” he said. “And it was a lifetime. If there had been a second shooter, they would have taken him out… it was almost a kill-shot as it was… So this breaks every rule of the Secret Service’s protocol, and just executive protection in general.” One rally attendee was killed in the shooting, and two others suffered critical injuries, Secret Service spokesman Anthony Guglielmi said. A day after the violent episode, retired FBI Supervisory Special Agent Dennis Franks told The Independent he was still trying to wrap his head around what went down at the rally. “How did this happen? How did they let it happen?” he asked. “It’s usually something [the Secret Service] has under control.”",
			"summary": "‘NEVER SURRENDER’ reads one Trump campaign emails sent to potential donors a day after the former president was shot in the ear",
			"url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-assassination-attempt-shooting-biden-b2579703.html",
			"image": "https://static.independent.co.uk/2024/07/14/18/13-c1d27d61de2e457d975b47a815696406.jpg?width=1200",
			"video": "https://cdn.jwplayer.com/videos/ALMufbsP-4VHSaSK0.mp4",
			"publish_date": "2024-07-14 23:15:05",
			"author": "Andrew Feinberg",
			"authors": ["Andrew Feinberg"],
			"language": "en",
			"catgory": "politics",
			"source_country": "gb",
			"sentiment": 0.015
		},
		{
			"id": 251758472,
			"title": "Donald Trump arrives in Milwaukee for RNC after assassination attempt heightens security fears",
			"text": "Donald Trump arrives in Milwaukee for RNC after assassination attempt heightens security fears The tail section of former President Trump's airplane is seen on arrival to the Milwaukee Mitchell International Airport where former President Trump will arrive ahead of the 2024 Republican National Convention, Sunday, July 14, 2024, in Milwaukee. (AP Photo/Alex Brandon) By The Associated Press Posted July 14, 2024 7:14 pm. Last Updated July 14, 2024 7:26 pm. MILWAUKEE (AP) — Former President Donald Trump has arrived in Milwaukee for the Republican National Convention a day after he was targeted in an attempted assassination at a campaign event. Trump’s airplane touched down Sunday, the day before the four-day event kicks off with thousands of Republicans coming together to formally elect him as their 2024 presidential nominee. The shocking scenes of violence at his Saturday campaign rally that injured his right ear, killed a spectator and injured another set a dark backdrop for the convention, which is typically four days of party pageantry, political speeches, policy platforms and the presidential nominee’s keynote address. The attack on Trump has put a heightened focus on safety and security of the event. The former president said in a social media post earlier Sunday that he was going to delay his trip by two days because of the attempted assassination “but have just decided that I cannot allow a ‘shooter,’ or potential assassin, to force change to scheduling, or anything else.” Trump is not expected to speak at the RNC until Thursday night. The Associated Press Submit a Correction Accessibility Feedback Top Stories LCBO scraps plan to reopen certain stores in favour of supporting online orders, businesses As a strike by LCBO workers continues, a statement issued by the agency said staff were being redeployed to help fill hospitality orders. 2h ago Woman wanted after Toronto police allege young child assaulted while out for walk Toronto police officers said the incident happened near Brock Avenue and Bloor Street West at around 5 p.m. on July 10. 1h ago Pedestrian struck, killed by train in Toronto's east end One person is dead after being struck by a train in the city's east end. Police said they were called to the Danforth GO Train station near Main Street and Danforth Avenue around 10:30 a.m. Paramedics... 2h ago Heat warning in effect for Toronto, GTHA as humidex values reach into the 40s Toronto and the GTHA are set to experience a heat event for the next several days starting Sunday. Environment Canada has issued a heat warning for most of southern Ontario with temperatures expected... 5h ago Top Stories LCBO scraps plan to reopen certain stores in favour of supporting online orders, businesses As a strike by LCBO workers continues, a statement issued by the agency said staff were being redeployed to help fill hospitality orders. 2h ago Woman wanted after Toronto police allege young child assaulted while out for walk Toronto police officers said the incident happened near Brock Avenue and Bloor Street West at around 5 p.m. on July 10. 1h ago Pedestrian struck, killed by train in Toronto's east end One person is dead after being struck by a train in the city's east end. Police said they were called to the Danforth GO Train station near Main Street and Danforth Avenue around 10:30 a.m. Paramedics... 2h ago Heat warning in effect for Toronto, GTHA as humidex values reach into the 40s Toronto and the GTHA are set to experience a heat event for the next several days starting Sunday. Environment Canada has issued a heat warning for most of southern Ontario with temperatures expected... 5h ago",
			"summary": "MILWAUKEE (AP) — Former President Donald Trump has arrived in Milwaukee for the Republican National Convention a day after he was targeted in an attempted assassination at a campaign event. Trump&#8217;s airplane touched down Sunday, the day before the four-day event kicks off with thousands of Republicans coming together to formally elect him as their [&#8230;]",
			"url": "https://toronto.citynews.ca/2024/07/14/donald-trump-arrives-in-milwaukee-for-rnc-after-assassination-attempt-heightens-security-fears/",
			"image": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/07/b567e9bd-0255-40d9-a4dc-b33c6c79a161.jpg",
			"video": null,
			"publish_date": "2024-07-14 23:14:38",
			"author": "News Staff,The Associated Press",
			"authors": ["News Staff", "The Associated Press"],
			"language": "en",
			"catgory": "politics",
			"source_country": "ca",
			"sentiment": -0.272
		},
		{
			"id": 251758048,
			"title": "Trump shared this two-word message moments after Biden’s remarks on assassination attempt",
			"text": "Former President Donald Trump shared a succinct call for unity on his social media platform Sunday, just moments after President Biden addressed the nation about the assassination attempt on his Republican rival. “UNITE AMERICA!” Trump, 78, wrote on Truth Social. The presumptive 2024 Republican presidential nominee’s message echoed Biden’s remarks from the White House urging Americans to “unite as one nation.” Biden, 81, said he was “grateful” that Trump was doing “well” after he said a bullet pierced the upper part of his right ear when a gunman — identified as 20-year-old Thomas Matthew Crooks — opened fire from a rooftop near his Pennsylvania campaign rally Saturday. “An assassination attempt is contrary to everything we stand for as a nation,” Biden told reporters. “It’s not who we are as a nation. It’s not American. And we cannot allow this to happen,” he said. “Unity is the most elusive goal of all, but nothing is more important than that right now.” The president called for a “thorough and swift” independent review of how such an attack could have taken place — and urged the nation not to make assumptions about the gunman’s motives. He also said he had directed the US Secret Service to provide his predecessor with every “resource,” and to monitor security at the Republican National Convention, which begins Monday in Milwaukee and which Trump is set to attend. Biden said he and Trump had a “short but good conversation” in the aftermath of the afternoon attack at the rally in Butler, Pa. The president also gave brief remarks in the hours after the shooting, condemning it as “sick.” Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and ‘fear not’ after shooting Gunman behind attempted assassination on Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date on updates with the Post’s live blog on the assassination attempt on Trump Biden was set to deliver a primetime formal address to the nation from the Oval Office at 8 p.m. Sunday. “I’ll be speaking more about this more tonight at greater length from the Oval Office,” Biden said. “We must unite as one nation, we must unite as one nation to demonstrate who we are.” Secret Service shot Crooks, of Bethel Park, Pa. A rallygoer, former fire chief Corey Comperatore, was killed, and two other men were critically injured. With Post wires",
			"summary": "Former President Donald Trump shared a succinct call for unity on his social media platform Sunday, just moments after President Biden addressed the nation about the assassination attempt on his Republican rival.",
			"url": "https://nypost.com/2024/07/14/us-news/trump-shared-this-two-word-message-moments-after-bidens-remarks-on-assassination-attempt/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/donald-trump-shared-two-word-85477442.jpg?quality=75&strip=all&w=1200",
			"video": "https://cdn.jwplayer.com/videos/VboBF0r8-RyIcpnTz.mp4",
			"publish_date": "2024-07-14 23:12:28",
			"author": "Tamar Lapin",
			"authors": ["Tamar Lapin"],
			"language": "en",
			"source_country": "us",
			"sentiment": 0.03
		},
		{
			"id": 251758074,
			"title": "Shawn Steel: What to expect at the Republican National Convention",
			"text": "Donald J. Trump’s triumph over a cowardly assassination attempt has inspired the country. The Republican National Convention is no longer a political event. Rather, it is a moment for national unity in the face of despicable violence. Republicans kickoff the 2024 Republican National Convention in Milwaukee on July 15th more energized and enthusiastic than at any political convention in American history. Never before in American history has a former President entered a political convention with a literal target on his back. Republicans are rallying behind our strong and brave once and future Commander-in-Chief. In the face of direct imminent danger, President Donald J. Trump stood tall and demanded that America, “Fight. Fight. Fight.” Republicans are excited, united, and ready for President Trump’s historic comeback victory in November. Here’s what to expect from the 2024 Republican National Convention: 1. Trademark Trump High-Energy & Showstopper Acceptance Speech No one can silence President Trump. Not even a deranged leftist assassin. Donald J. Trump will bring his trademark high-energy to the Fiserv Forum and deliver a showstopper acceptance speech Thursday night. He’s an exceptional, natural speaker who thrives from the energy and enthusiasm of a friendly crowd. RNC Chairman Michael Whatley and Co-Chair Lara Trump also made the savvy decision to enlist Ultimate Fighting Championship CEO Dana White, known for rallying a large crowd, as Trump’s warmup act. 2. Republicans Energized, Enthusiastic and United In contrast to the divided Democrats, there’s no division within the Grand Ole Party. This is Trump’s convention through and through. The RNC Platform Committee overwhelmingly approved an updated and more concise party platform that focuses on the singular mission of “Making America Great Again.” Republican delegates of every ideological persuasion understand that the party’s trimmed-down platform is the most effective way to highlight the core failures of the Biden-Harris administration. 3. Building Suspense with Trump’s Vice Presidential Pick President Trump knows how to build suspense, and he’s done so again with the mystery surrounding his Vice-Presidential pick. In recent interviews, President Trump has teased that his Veep selection could come at any time, including as late as Wednesday night, when the Vice Presidential nominee is slated to address delegates. Whether he picks Ohio Senator J.D. Vance; North Dakota Gov. Doug Burgum, South Carolina Senator Tim Scott, New York Congresswoman Elise Stefanik, or another surprise candidate, expect RNC delegates to be salivating for the VP debate against Vice President Kamala Harris scheduled for Lafayette College. 4. Spotlight on 5 Key States: Wisconsin, Michigan, Pennsylvania, Georgia, and Arizona Before Biden’s implosion, the 2024 Biden-Trump rematch was projected to come down to 71 electoral votes in five key states: Wisconsin, Michigan, Pennsylvania, Georgia, and Arizona. Biden won each of these five states in 2020 by less than 3 percent of the vote. President Trump can return to the White House by adding any three of these five states to his electoral coalition. The Trump campaign is focusing on these five battleground states and, under Chris LaCivita’s leadership, has deployed its top operatives to ensure the most effective ground operation capable of a historic Get Out The Vote campaign. Expect state delegations from these states to receive prominent placement and attention in Milwaukee. 5. Economy, Crime & Immigration It’s about the economy. It’s about crime. It’s about the border. The convention will spotlight the tragic human suffering caused by the dangerous policies of President Joe Biden from family members of those killed by violent gang members that have entered the country illegally through our southern border. As RNC Sergeant at Arms, Shawn Steel will oversee security at the 2024 Republican National Convention in Milwaukee, Wisconsin. He serves as California’s representative on the Republican National Committee.",
			"summary": "Donald J. Trump's triumph over a cowardly assassination attempt has inspired the country.",
			"url": "https://www.ocregister.com/2024/07/14/shawn-steel-what-to-expect-at-the-republican-national-convention/",
			"image": "https://www.ocregister.com/wp-content/uploads/2024/07/OCR-Z-TRUMP-0714-01-2.jpg?w=1024",
			"video": null,
			"publish_date": "2024-07-14 23:12:20",
			"author": "Shawn Steel",
			"authors": ["Shawn Steel"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": 0.423
		},
		{
			"id": 251758080,
			"title": "A Simple Guide to the History of Presidential Assassinations and Attempts in the United States",
			"text": "WASHINGTON (AP) — Before Saturday’s attempted assassination of former President Donald Trump, there have been multiple instances of political violence targeting U.S. presidents, former presidents and major party presidential candidates. A look at some of the assassinations and attempted assassinations that have occurred over the decades: ABRAHAM LINCOLN, the 16th president Lincoln was the first president to be assassinated, shot by John Wilkes Booth on April 14, 1865, as he and his wife, Mary Todd Lincoln, attended a special performance of the comedy “Our American Cousin” at Ford’s Theatre in Washington. Lincoln was taken to a house across the street from the theater for medical treatment after he was shot in the back of the head. He died the next morning. His support for Black rights has been cited as a motive behind his killing. Two years before the assassination, during the Civil War, which was fought over slavery, Lincoln issued the Emancipation Proclamation granting freedom to slaves within the Confederacy. Lincoln was succeeded by Vice President Andrew Johnson. Booth was shot and killed on April 26, 1865, after he was found hiding in a barn near Bowling Green, Virginia. JAMES GARFIELD, the 20th president Garfield was the second president to be assassinated, six months after taking office. He was walking through a train station in Washington on July 2, 1881, to catch a train to New England when he was shot by Charles Guiteau. Alexander Graham Bell, the telephone inventor, tried unsuccessfully to find the bullet lodged in Garfield’s chest using a device he designed specifically for the president. The mortally wounded president lay at the White House for several weeks but died in September after he was taken to the New Jersey shore. He had held office for six months. Garfield was succeeded by Vice President Chester Arthur. Guiteau was found guilty and executed in June 1882. WILLIAM McKINLEY, the 25th president McKinley was shot after giving a speech in Buffalo, New York, on Sept. 6, 1901. He was shaking hands with people passing through a receiving line when a man fired two shots into his chest at point-blank range. Doctors had expected McKinley to recover but gangrene then set in around the bullet wounds. McKinley died on Sept. 14, 1901, six months after opening his second term. He was succeeded by Vice President Theodore Roosevelt. Leon F. Czolgosz, an unemployed, 28-year-old Detroit resident, admitted to the shooting. Czolgosz was found guilty at trial and put to death in the electric chair on Oct. 29, 1901. FRANKLIN D. ROOSEVELT, the 32nd president Roosevelt, at the time the president-elect, had just given a speech in Miami from the back of an open car when gunshots rang out. Roosevelt was not injured in the February 1933 shooting that killed Chicago Mayor Anton Cermak. Guiseppe Zangara was convicted in the shooting and sentenced to death. HARRY S. TRUMAN, the 33rd president Truman was staying at Blair House, across the street from the White House, in November 1950 when two gunmen broke in. Truman was not injured, but a White House policeman and one of the assailants were killed in an exchange of gunfire. Two other White House policemen were wounded. Oscar Callazo was arrested and sentenced to death. In 1952, Truman commuted the sentence to life in prison. He was released from prison in 1979 by President Jimmy Carter. JOHN F. KENNEDY, the 35th president Kennedy was fatally shot by a hidden assassin armed with a high-powered rifle as he visited Dallas in November 1963 with first lady Jacqueline Kennedy. Shots rang out as the president’s motorcade rolled through Dealey Plaza in downtown Dallas. Kennedy was rushed to Parkland Memorial Hospital, where he died soon after. He was succeeded by Vice President Lyndon B. Johnson, who was sworn into office in a conference room aboard Air Force One. He is the only president to take the oath of office on an airplane. Hours after the assassination, police arrested Lee Harvey Oswald after finding a sniper’s perch in a nearby building, the Texas School Book Depository. Two days later, Oswald was being taken from police headquarters to the county jail when Dallas nightclub owner Jack Ruby rushed forward and fatally shot Oswald. GERALD FORD, the 38th president Ford faced two assassination attempts within weeks in 1975 and was not hurt in either incident. In the first attempt, Ford was on his way to a meeting with California’s governor in Sacramento when Charles Manson disciple Lynette “Squeaky” Fromme pushed through a crowd on the street, drew a semi-automatic pistol and pointed it at Ford. The gun wasn’t fired. Fromme was sentenced to prison and released in 2009. It was 17 days later when another woman, Sara Jane Moore, confronted Ford outside a hotel in San Francisco. Moore fired one shot and missed. A bystander grabbed her arm as a second shot was attempted. Moore was sent to prison and released in 2007. RONALD REAGAN, the 40th president Reagan was leaving a speech in Washington, D.C., and walking to his motorcade when he was shot by John Hinckley Jr., who was in the crowd. Reagan recovered from the March 1981 shooting. Three other people were shot, including his press secretary, James Brady, who was partially paralyzed as a result. Hinckley was arrested and confined to a mental hospital after a jury found him not guilty by reason of insanity in shooting Reagan. In 2022, Hinckley was freed from court oversight after a judge determined he was “no longer a danger to himself or others.” GEORGE W. BUSH, the 43rd president Bush was attending a rally in Tbilisi in 2005 with Georgian President Mikhail Saakashvili when a hand grenade was thrown toward him. Both men were behind a bulletproof barrier when the grenade, wrapped in cloth, landed about 100 feet away. The grenade did not explode, and no one was hurt. Vladimir Arutyunian was convicted and sentenced to life in prison. THEODORE ROOSEVELT, presidential candidate The former president was shot in Milwaukee in 1912 while campaigning to return to the White House. Roosevelt had previously served two terms as president and was running again as a third-party candidate. Folded papers and a metal glasses case in Roosevelt’s pocket apparently blunted the bullet’s impact and he was not seriously hurt. John Schrank was arrested and spent the remainder of his life in mental hospitals. ROBERT F. KENNEDY, presidential candidate Kennedy was seeking the Democratic presidential nomination when he was killed at a Los Angeles hotel — moments after giving his victory speech for winning the 1968 California primary. Kennedy was a U.S. senator from New York and the brother of President John F. Kennedy, who was assassinated five years earlier. Five other people were wounded in the shooting. Sirhan Sirhan was convicted of first-degree murder and sentenced to death. That was commuted to life in prison, where Sirhan remains after his latest petition for release was denied last year. GEORGE C. WALLACE, presidential candidate Wallace was seeking the Democratic presidential nomination when he was shot during a campaign stop in Maryland in 1972, an incident that left him paralyzed from the waist down. Wallace, the governor of Alabama, was known for his segregationist views, which he later renounced. Arthur Bremer was convicted in the shooting and sentenced to prison. He was released in 2007.",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON (AP) — Before Saturday’s attempted assassination of former President Donald Trump, there have&#8230;\n\n\nThis Post: A Simple Guide to the History of Presidential Assassinations and Attempts in the United States first appeared on Internewscast Journal",
			"url": "https://internewscast.com/local-news/a-simple-guide-to-the-history-of-presidential-assassinations-and-attempts-in-the-united-states/",
			"image": "https://www.nxsttv.com/nmw/wp-content/uploads/sites/107/2024/07/AP24196057403881-edited.jpg",
			"video": null,
			"publish_date": "2024-07-14 23:11:01",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": 0.018
		},
		{
			"id": 251757926,
			"title": "Former press secretary Jen Psaki faces criticism for urging Republicans to adjust their language and communication style or risk facing backlash following a shooting incident during Trump’s presidency.",
			"text": "Former Biden press secretary Jen Psaki was criticized after she demanded Republicans tone down their ‘rhetoric’ after Donald Trump was shot at Saturday. Thomas Matthew Crooks, 20, grazed Trump’s ear, killed one spectator and injured two more before a Secret Service counter assault agent killed him. Donald Trump’s family and supporters have slammed the liberal media for downplaying Saturday evening’s assassination attempt – and for running tone-deaf opinion pieces in the wake of the atrocity. On Sunday, Psaki appeared on Meet the Press and angered Republicans further by putting the onus on them to stop the rage. ‘One thing for all of us to remember is it may not feel paused tomorrow or Tuesday. And part of that is because the convention is starting and unless the programming changes, the rhetoric and how the programming is set up is not actually calming the tone or restoring civility,’ she said. ‘We’ll see if that programming changes but if it stays the same, that is escalating it. It is not a civil approach to a convention,’ the former press secretary added. Psaki was immediately criticized by social media, similar to how Trump’s family went after the press earlier this weekend. One user on X wrote: ‘Jen Psaki said the Repubs have created a ‘tone,’ but it is Biden & Dems who have called Trump a Nazi, a rapist, a felon, a terrorist. They have called MAGA supporters domestic terrorists & cult members. Biden promised unity but instead incited violence & division. GO TO HELL.’ ‘Stop lying and fueling the fire and you wouldn’t be scared,’ added another. She then centered herself and her media colleagues in her call for a cease to the angry rhetoric. ‘For anyone out there who has a platform who thinks the moment right now is to be political and attack the other party — you are feeding into the danger. You are making it more likely there’s retaliation. I’m incredibly scared. I’m scared for journalists. I’m scared for people who have public platforms of all parties,’ she said. Right-wing commentator Stephen Miller said: ‘She just all lives mattered an assassination attempt on the Republican nominee.’ ‘Probably should have thought about that before you started treating basic norms and journalistic objectivity like a piñata,’ said another user on X. CNN, The New York Times and NBC have been lambasted by Republicans online for their reactions to one of the worst cases of violence ever seen in American political history. Publishers were blasted for describing gunshots as ‘loud popping noises’ and for describing Trump as ‘falling’ from the stage without reference to the assassination attempt. The New York Times was also criticized for running an opinion piece called ‘Donald Trump Is Unfit To Lead’ which encouraged voters to ‘reject him in November’ on the morning after the shooting. Printed against an ominous, backlit silhouette of Trump’s side profile, the title page also reads: ‘He failed the tests of leadership and betrayed America.’ The president’s son Donald Trump Jr led the criticism on X, calling CNN ‘vile’ and ‘a disgrace’ for their coverage of the Butler, Pennsylvania campaign event incident. He shared a 30-second clip from CNN where correspondent Jamie Gangel pointed out that Trump got up and said ‘fight, fight, fight’ in the seconds after he was shot. ‘What we’re hearing from people is that’s not the message that we want to be sending right now, we want to tamp it down,’ Gangel said of the reaction. In a fiery response to the tweet, Trump Jr said: ‘Someone attempted to assassinate my father tonight and this is what CNN is focused on. These people are vile.’ The broadcaster has also been widely slammed for running a headline saying ‘Secret Service rushes Trump off stage after he falls at rally’ without mention of a shooting. Meanwhile, critics have slammed The New York Times for their Sunday morning paper headline, reading: ‘Trump Hurt, But Safe, After A Shooting’, presenting the atrocity in the mildest possible way. Critics also pointed out the newspaper trimmed out the American flag which was flying above Trump in the image of him raising a fist with blood across his face moments after a bullet struck him in the right ear. NBC was criticized for describing the former president ‘clutching his ear’ after ‘popping noises were heard’ at the campaign rally. Gunman Thomas Matthew Crooks, 20, from Bethel Park, PA, fired several rounds from a rooftop including one bullet which struck Trump in the ear. It came just days before the former president was to accept the Republican nomination for 2024. Crooks – a registered Republican who donated $15 to the liberal ActBlue political action committee on Biden’s Inauguration Day in 2021 – killed former fire chief Corey Comperatore, and injured two more people before cops gunned him down. The Biden administration rushed the president back to the White House from his home in Rehoboth Beach, Delaware in the immediate aftermath, and he condemned the shooting on X.",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nFormer Biden press secretary Jen Psaki was criticized after she demanded Republicans&#8230;\n\n\nThis Post: Former press secretary Jen Psaki faces criticism for urging Republicans to adjust their language and communication style or risk facing backlash following a shooting incident during Trump&#8217;s presidency. first appeared on Internewscast Journal",
			"url": "https://internewscast.com/news/us/former-press-secretary-jen-psaki-faces-criticism-for-urging-republicans-to-adjust-their-language-and-communication-style-or-risk-facing-backlash-following-a-shooting-incident-during-trumps-presidenc/",
			"image": "https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Bidens-former-press-secretary-Jen-Psaki-is.jpg",
			"video": null,
			"publish_date": "2024-07-14 23:09:03",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.364
		},
		{
			"id": 251757888,
			"title": "The GOP convention just took a huge turn — and Dems have nothing to say",
			"text": "Donald Trump announced Sunday that he won’t be delaying his trip to Milwaukee for the Republican National Convention, having “decided that I cannot allow a ‘shooter,’ or potential assassin, to force change to scheduling, or anything else.” Good for him, but the RNC will proceed differently: It has to. Oh, it’ll still stick to planned nightly themes: Make America Wealthy (Mon.) /Safe (Tues.) / Strong (Weds.) / Great (Thu.) Once Again — but the tone will be more restrained and sober, with calls for national unity and political sanity far more pronounced. Expect to hear a lot of echoes of former First Lady Melania Trump’s heartfelt letter Sunday morning about the “monster” who saw “my husband as an inhuman political machine.” And: “Let us not forget that differing opinions, policy, and political games are inferior to love. Our personal, structural, and life commitment — until death — is at serious risk. Political concepts are simple when compared to us, human beings.” More: “Ascend above the hate, the vitriol, and the simple-minded ideas that ignite violence. We all want a world where respect is paramount, family is first, and love transcends. We can realize this world again. Each of us must demand to get it back. We must insist that respect fills the cornerstone of our relationships again.” All the planned speakers are reworking their remarks, and note that Trump’s last GOP rival standing, Nikki Haley, was added to the list on Sunday. The convention will still feature plenty of tough talk, but it was already going to focus on policy — because that’s the center of Trump’s case to replace President Joe Biden. It’s Biden’s economic policies that have working Americans losing ground, his party’s approach to crime that’s produced carnage in our cities, his foreign policies that have wars ablaze in Europe and the Middle East and threatening in the Pacific. Trump’s own speech Thursday night was already going to be different from his past convention addresses: His time in “exile” has left him more sober and disciplined — more focused on getting his core message out to all Americans, not just his core fans and Republican-leaners. That focus was clearly on display in the Trump-Biden debate — and Biden’s disastrous performance there was already pushing the race firmly Trump’s way, whether or not Democrats dump Joe. America knows the Democratic elite (including any Biden replacement) colluded to cover up Biden’s mental decline, and the former president is looking at a potential Electoral College landslide and possible Republican gains in the House and Senate that will make it far easier to deliver on the Trump agenda. Getting there already meant a convention and a campaign appealing to reluctant swing voters. The fact that the Democrats’ scorched-earth “dictator” rhetoric has now inspired a would-be assassin only increases the stakes. Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and ‘fear not’ after shooting Gunman behind attempted assassination on Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date on updates with the Post’s live blog on the assassination attempt on Trump And of course leaves voters wanting milder rhetoric on both sides of the aisle. Fact is, we’re no longer sure what Democrats will have to say at their convention next month, unless they spend the whole time switching their nominee. The Biden campaign is already taking down its old ads, and will have to retool everything: Ruthlessly, and insincerely, demonizing their opponent just doesn’t play very well now. Let us emphasize the “insincerely” there: Dems’ leaders have never acted like they believe Trump and his MAGA movement pose an existential threat to the Republic. They’ve routinely intervened in GOP primaries to push the “Trumpiest” candidates, figuring it makes it more likely a Democrat will wind up winning and accepting the obvious fact that it would help Trump’s movement grow. All the “Hitler” fearmongering was a cynical ploy because they can’t win on the issues. That’s why they’ve recently seized on the Heritage Foundation’s (year-old!) Project 2025 as Trump’s “real” agenda, utterly ignoring the actual Republican platform and what Trump himself is saying. And never mind that their entire approach — from the lawfare that aims to jail Trump or at least bankrupt him, to rigging the Democratic primaries to produce a Biden coronation while concealing his decline, to all the conspiring to oust Biden now that the nation’s seen his true state — is itself profoundly anti-democratic. So much so, again, that it inspired an assassin (actually, a third one, following the mass shooter who nearly killed Rep. Steve Scalise and two others and the poor soul who turned back outside the home of Justice Brett Kavanaugh). Biden is reacting to Saturday by calling for “national unity.” We welcome the change of attitude, but: If he meant it, he’d start by apologizing for his September 2022 “Dark Brandon” speech that declared, “Donald Trump and the MAGA Republicans represent an extremism that threatens the very foundations of our Republic.” If you want national unity, reject the cynical dividers.",
			"summary": "Donald Trump announced Sunday that he won’t be delaying his trip to Milwaukee for the Republican National Convention, having “decided that I cannot allow a ‘shooter,’ or potential assassin, to force change to scheduling, or anything else.”",
			"url": "https://nypost.com/2024/07/14/opinion/the-gop-convention-just-took-a-huge-turn-and-dems-have-nothing-to-say/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/Election_2024_RNC_Reax_47002-342b2-e1720998258755.jpg?quality=75&strip=all&w=1200",
			"video": null,
			"publish_date": "2024-07-14 23:08:11",
			"author": "Post Editorial Board",
			"authors": ["Post Editorial Board"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.156
		},
		{
			"id": 251757948,
			"title": "1 killed, 2 others wounded in failed Trump assassination",
			"text": "1 killed, 2 others wounded in failed Trump assassination Three men other than Donald Trump were shot during the failed assassination attempt on the former president. One, a former firefighter, was killed. Meg Oliver has more on the three victims.",
			"summary": "Three men other than Donald Trump were shot during the failed assassination attempt on the former president. One, a former firefighter, was killed. Meg Oliver has more on the three victims.",
			"url": "https://www.cbsnews.com/video/1-killed-2-others-wounded-in-failed-trump-assassination/",
			"image": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/14/3a69d3cd-2ae0-4913-b300-cc019c151bc6/thumbnail/1200x630/0965c201c7a849bb2a55297366821cd6/0714-en-oliver.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 23:07:00",
			"author": null,
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -1
		},
		{
			"id": 251757886,
			"title": "GOP convention choice Milwaukee was scene of assassination try on 1912 prez hopeful",
			"text": "MILWAUKEE — The Republican National Convention will descend this week on Wisconsin’s largest city — whose colorful history includes an assassination attempt on presidential hopeful Teddy Roosevelt in 1912.At the time, the former president was running a doomed re-election campaign under a third party after splitting off from the GOP. The attempted assassination occurred 112 years before current GOP presidential hopeful and former Commander in Chief Donald Trump was nearly killed by a shooter at a rally in Pennsylvania on Saturday. Trump, 78, headed to Milwaukee on Sunday for his expected coronation as the party’s presidential nominee. Roosevelt was shot by a would-be assassin from New York City outside the Gilpatrick Hotel, now the site of the Hyatt Regency Milwaukee, moments before a campaign speech. His 50-page speech manuscript in his pocket saved his life by stopping the bullet from killing him. He went on to give an 84-minute speech without being treated for the wound. After Trump’s near-assassination, he announced he would not be changing his plans or delaying his trip to the Badger State for the convention. Security was already being increased around the convention site in the hours after the Pennsylvania shooting, but a former FBI agent and 25-year veteran of the Milwaukee Police Department told The Post on Sunday that most of the plans would stay intact. “They’re certainly going to be more alert. They are going to extend their perimeters, but they shouldn’t change their plan,’’ the source said. “They are going to encourage [Trump] to limit his public appearances, which is typical protocol for dignitary protection. Whether the protectee takes that advice is another matter.” The swing state’s coveted 10 electoral votes no doubt contributed to its appeal for the RNC this year. “I love Milwaukee!” Trump told a cheering crowd in Racine, Wisc., last month. “I was the one who picked Milwaukee.” But he had already gotten into trouble for supposedly calling it a “horrible city’’ earlier behind closed doors with GOP leaders, although he denied the claim. Trump’s history with Wisconsin and Milwaukee is complicated. He flipped the state red by less than 1 percentage point in 2016 after it spent the previous seven presidential elections in the Democrats’ column. “Four of the last six presidential elections in Wisconsin were decided by less than 1 percentage point,’’ Charles Franklin, director of Wisconsin’s Marquette Law School Poll, told The Post. “Trump won in 2016 by 0.8 points, and Biden won in 2020 by 0.6 points, in both cases by less than 25,000 votes. “In Marquette Law School polls since November, we have had Trump up once, Biden up once and two ties. So it certainly is in line with past very close elections,’’ Franklin said. Former Wisconsin congressman, House speaker and veep candidate Paul Ryan said last year he would not attend the RNC in his home state if Trump was the nominee. More recently, he said he thinks it is “quite possible” Trump will challenge the election again if he loses, as he did in Wisconsin in 2020. Emotions are running high in the city as the convention is about to begin, with the latest episode involving workers who are setting up for the convention covering a street sign called “Herb Kohl Way” with a sign saying “Donald J. Trump Way.” Kohl was a longtime Wisconsin senator and the owner of the city’s beloved NBA team, the Milwaukee Bucks. The sign was quickly removed, but the damage was done as state Democrats and Republicans fought on Twitter over the incident. The city’s questionable handling of the 140 registered protesters has also come under fire, as the RNC, the Secret Service and the city fought over security perimeters and protest parade routes for the convention. Adding to the anxiety is the fact that the state’s concealed and open carry laws will allow guns within the security perimeter, though not inside the federal perimeter around the convention center. Trump seeks to gain a historic percentage of the black vote, which has traditionally gone for Democrats. The city has the largest percentage of the black population in the state, at 29% and elected its first black mayor only two years ago. “As a native Wisconsinite, I am beyond excited not only for the world to come to Milwaukee but for Milwaukee to be brought to the world during the 2024 Republican National Convention,” Rachel Reisner, an RNC rep, told The Post. “This historic television production will highlight our party’s America First agenda; put Milwaukee on the map; and undoubtedly create a significant, positive, and lasting economic impact on my hometown.’’ Four years ago, Milwaukee was getting ready to welcome the Democratic National Convention, a move state Republicans tied to the socialist history of the state, with Bernie Sanders and AOC making headlines for the party. Then the DNC pulled out over COVID concerns, leaving the city in a lurch but with an infrastructure to host an event the size of a national party convention. Claire Koenig at Visit Milwaukee said that the city has been working together to prepare for the Republican convention since it received the proposal request in September 2021. “Milwaukee resonated with the RNC as an out-of-the-box destination from an event-planning perspective,” Koenig told The Post. Fiserv Forum, where the Milwaukee Bucks play and the RNC will be held from Monday to Thursday, is in what’s known to locals as the “Deer District,” a 30-acre destination hub that was built for events like the RNC. “Economically, it’s a city for everybody,” said former Republican state Assemblyman Dale Kooyenga.",
			"summary": "The Republican National Convention will descend this week on Wisconsin’s largest city — whose colorful history includes an assassination attempt on presidential hopeful Teddy Roosevelt in 1912.",
			"url": "https://nypost.com/2024/07/14/us-news/gop-convention-choice-milwaukee-was-scene-of-assassination-try-on-1912-prez-hopeful/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/85449466-1.jpg?quality=75&strip=all&w=1200",
			"video": null,
			"publish_date": "2024-07-14 23:05:56",
			"author": "Amy Sikma",
			"authors": ["Amy Sikma"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.452
		},
		{
			"id": 251757530,
			"title": "Trump Rally Victim Was A Firefighter, Died Shiedling His Family",
			"text": "The spectator who died in the shooting that targeted Donald Trump at a Pennsylvania rally has been identified as Corey Comperatore, a 50-year-old firefighter and father of two. \"We lost a fellow Pennsylvanian last night, Corey Comperatore,\" the state's governor, Josh Shapiro, told reporters. \"I just spoke to his wife and his two daughters.\" He said the victim was a churchgoing firefighter and an enthusiastic Trump supporter who \"loved his community and most especially...his family.\" Josh Shapiro called Saturday's shooting, in which two other spectators were wounded, \"shocking, for this Commonwealth (state) and the country.\" The other victims have yet to be identified, though NPR news affiliate WESA quoted hospital officials in Pittsburgh as saying both were local men and both remained in critical condition. The shooter, identified as 20-year-old Thomas Matthew Crooks of nearby Bethel Park, was killed by a Secret Service sniper. One of Corey Comperatore's daughters, Allyson, described her father in a Facebook post as \"the best dad a girl could ever ask for,\" someone always ready to help and quick to \"make friends with anyone.\" \"The media will not tell you that he died a real-life super hero,\" she said. \"He threw my mom and I to the ground... (and) shielded my body from the bullet that came at us.\" Josh Shapiro also described Corey Comperatore as \"a hero\" who died protecting his family. He said state flags would be flown at half-staff to honor the victim. \"Corey was an avid supporter of the former president,\" Josh Shapiro added, \"and was so excited to be there last night.\" A GoFundMe page created to raise money for the Comperatore family had received donations of nearly $330,000 as of 3:00 pm. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
			"summary": "The spectator who died in the shooting that targeted Donald Trump at a Pennsylvania rally has been identified as Corey Comperatore, a 50-year-old firefighter and father of two.",
			"url": "https://nation.lk/online/trump-rally-victim-was-a-firefighter-died-shiedling-his-family-270789.html",
			"image": "https://c.ndtvimg.com/2024-07/b5q03l7g_corey-comperatore_625x300_15_July_24.jpeg",
			"video": null,
			"publish_date": "2024-07-14 23:00:26",
			"author": "Bethel Park",
			"authors": ["Bethel Park"],
			"language": "en",
			"catgory": "politics",
			"source_country": "lk",
			"sentiment": -0.313
		},
		{
			"id": 251757716,
			"title": "Pennsylvania State Police identify victims shot during attempted assassination of former President Trump",
			"text": "The Pennsylvania State Police released the names of the three attendees shot during the attempted assassination of former President Trump at Saturday’s rally in Butler County. The deceased victim was identified as Corey Comperatore, 50, of Sarver, Pennsylvania. The second victim was identified as 57-year-old David Dutch of New Kensington, Pennsylvania, who is listed in stable condition. The third victim was identified as 74-year-old James Copenhaver of Moon Township, Pennsylvania; he is also listed in stable condition. \"I am sure everyone has seen the news and are appalled at how divided we have become. Well, it has finally hit home to the League. It is with great sadness that I report that one of the civilians shot at the rally was one of our own,\" Matt Popovich, District 8 vice commandant of the Marine Corps League of Pennsylvania Inc. wrote in a post on Facebook. TRUMP’S SURVIVAL WAS ‘MIRACULOUS’ GIVEN BULLET’S PROXIMITY TO HIS BRAIN, DOCTOR SAYS \"Commandant David Dutch of Westmoreland County is in critical condition. He was shot in the liver and chest. He has had one surgery and is undergoing another this morning. He is currently in an induced coma. Please keep him and his family in your prayers,\" Popovich continued. TRUMP RALLY VICTIM IDENTIFIED AS COREY COMPERATORE, 'HERO' SHIELDED WIFE AND GIRLS FROM BULLETS When Fox News Digital reached out to the Marine Corps League of Pennsylvania Inc., they declined to comment. \"These victims and their families are certainly in our thoughts today,\" said Col. Christopher Paris, Pennsylvania State Police commissioner. \"The Pennsylvania State Police continue to work tirelessly alongside our federal, state and local partners as this investigation continues.\" WHO WAS THOMAS MATTHEW CROOKS? WHAT WE KNOW ABOUT TRUMP’S ATTEMPTED ASSASSIN Pennsylvania Gov. Josh Shapiro ordered U.S. and state flags on all state facilities, public buildings and grounds to fly at half-staff in Comperatore's honor. Comperatore, 50, was a former fire chief for Buffalo Township, a volunteer fire service, local news station WPXI reported. Shapiro said on Sunday he spoke with Comperatore's wife, who noted that he was a man of faith. \"We lost a fellow Pennsylvanian last night,\" Shapiro said at a news conference. \"Corey Comperatore was a girl dad. Corey was a firefighter. Corey went to church every Sunday. Corey loved his community, and most especially, Corey loved his family. Corey was an avid supporter of the former president and was so excited to be there last night with him in the community.\" During Sunday's press conference, Shapiro called on Americans to come together in prayer and to retreat from hate and malice. CLICK HERE TO GET THE FOX NEWS APP \"This is a moment where all of us have a responsibility to take down the temperature, rise above the hateful rhetoric that exists, and search for a better, brighter future for this nation. I ask that you join Lori and me in prayer for the two Pennsylvanians still in critical condition, for the family of Corey Comperatore, and for former President Donald Trump,\" Shapiro said. The FBI is investigating the shooting as an assassination attempt. Fox News Digital's Michael Dorgan and Chris Pandolfo contributed to this report.",
			"summary": "On Sunday, the Pennsylvania State Police released the names of the three attendees shot during the attempted assassination of former President Trump at Saturday&apos;s rally in Butler County.",
			"url": "https://www.foxnews.com/us/pennsylvania-state-police-identify-victims-shot-during-attempted-assassination-former-president-trump",
			"image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Donald-Trump-Butler-PA-Shooting-Day-2_11.jpg?ve=1&tl=1",
			"video": null,
			"publish_date": "2024-07-14 22:59:00",
			"author": "Stepheny Price",
			"authors": ["Stepheny Price"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.336
		},
		{
			"id": 251757582,
			"title": "Ex-US President Trump is sure to win American presidential election, says Medvedev",
			"text": "MOSCOW, July 15. /TASS/. Former US President Donald Trump has won in advance at the upcoming presidential election in the United States, Deputy Chairman of Russia’s Security Council Dmitry Medvedev said on Monday. \"He has certainly won. Only if he is not assassinated,\" Medvedev wrote in his X social network account and attached a picture of Trump, when he was formally arrested in August 2023. On July 13, Trump survived an assassination attempt during his campaign rally in Pennsylvania. The Republican was wounded. According to recent reports, he is safe, he received a minor injury - the bullet pierced his right ear. The shooting left one person killed and two injured. The shooter was killed by officers of the US Secret Service, which is responsible, in particular, for protecting the top officials of the state. The FBI are investigating the shooting at Trump’s rally as a possible domestic terrorism attack and assassination.",
			"summary": "The Deputy Chairman of Russia’s Security Council wrote his opinion in his X social network account and attached a picture of Donald Trump, when he was formally arrested in August 2023",
			"url": "https://tass.com/politics/1816901",
			"image": "https://tass.com/img/blocks/common/tass_logo_share_ru.png",
			"video": null,
			"publish_date": "2024-07-14 22:56:15",
			"author": "Tass",
			"authors": ["Tass"],
			"language": "en",
			"catgory": "politics",
			"source_country": "RU",
			"sentiment": -0.323
		},
		{
			"id": 251757428,
			"title": "Trump’s courage stands out, Dem strategist’s vile reaction and more commentary",
			"text": "Conservative: Trump’s Courage Stands Out “The United States can’t be led by a coward or by someone who looks like one under fire,” argues The American Conservative’s Daniel McCarthy, so Donald Trump’s raised firt bare minutes after getting shot was “what a leader had to do in that situation”: “Morale is a nation’s blood. Trump refused to let the assassin shed it, even as his own wounds bled.” RFK Jr. rapidly “called for peace and prayer for Trump,” and Bernie Sanders soon did much the same. “The exception to this rapid response was President Biden, who put out an anodyne comment at 7:58 p.m. He then gave a press conference in which he declined to say whether this was an attempted assassination.” That is: “At a time when the country needed reassurance from figures of authority,” Biden “was conspicuous only by his absence. He might as well have been off reading My Pet Goat.” Reporter: Dem Strategist’s Vile Reaction “The top political adviser to Democratic mega-donor Reid Hoffman suggested that the attack on Donald Trump could have been ‘staged,’ ” reports Semafor’s Kadia Goba. Hoffman last week publicly wished he had made Trump “an actual martyr,” Goba notes; then Saturday night adviser Dmitri Mehlhorn, in an email he now regrets, said “one possibility — which feels horrific and alien and absurd in America, but is quite common globally — is that this ‘shooting’ was encouraged and maybe even staged so Trump could get the photos and benefit from the backlash.” He admitted it could be “some crazy anti-Trumper,” but wrote that the false-flag op “is a classic Putin play and given the facts seems more plausible. From the right: Joe’s Age Isn’t Dems’ Big Problem If Democrats think Joe Biden’s decline is their only or even biggest problem, they’re “as confused” as he is, snarks The Wall Street Journal’s Kimberley A. Strassel. They’re avoiding “any discussion of the root problem” — that their “sharp move to the left” is “deeply unpopular with the electorate.” Even the contenders to replace Biden are “unrepentant progressives, promising to double down” on Dems’ far-left agenda. “Biden’s age is a problem,” but “not the cause of striking demographic shifts — under way for years — that show the working class, including minority voters, fleeing the party. Progressive policies will be on the ballot this fall as much as any one person’s name.” If Dems care about their future, they’d be “having that debate.” Eye on Albany: NY Health-Care Pay-to-Play New York health-care capital grants have “been used to build new facilities and renovate old ones,” but some “have been used not for anything new, but for paying off old loans,” grumbles the Empire Center’s Bill Hammond. E.g., the Health Department allocated “$25 million in grants to finance a pair of medical office buildings being developed by Crystal Run Healthcare, a company tied to $400,000 in contributions to [Andrew] Cuomo’s campaign.” Yet “the buildings were already under construction before the grants were awarded.” Two more grants went to groups tied to “Somos Community Care, whose leaders have made millions in campaign contributions” to Cuomo and Gov. Hochul. Liberal: Biden Just Doesn’t Get It “Never underestimate the destructive power of a stubborn old narcissist with something to prove,” snarks Mark Leibovich at The Atlantic. “President Joe Biden, 81, is acting like one of history’s most negligent and pigheaded leaders at a crucial moment, and right now, we are all pedestrians.” “The spectacle has been endlessly depressing, unless you’re Donald Trump or want him back in the White House — in which case you’re relishing this slowly unfolding, self-owning, party-destroying wreck.” The “Republican National Convention is shaping up to be a week-long Mardi Gras of MAGA in Milwaukee.” “Clearly the White House has no serious answer for people’s widespread and legitimate doubts about the president’s capacity to serve, let alone for another four-year term.” — Compiled by The Post Editorial Board",
			"summary": "“The top political adviser to Democratic mega-donor Reid Hoffman suggested that the attack on Donald Trump could have been ‘staged,’ ” reports Semafor’s Kadia Goba.",
			"url": "https://nypost.com/2024/07/14/opinion/trumps-courage-stands-out-dem-strategists-vile-reaction-and-more-commentary/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-ihx3z0h8v-1720997504597.jpg?quality=75&strip=all&1720983183&w=1200",
			"video": null,
			"publish_date": "2024-07-14 22:55:56",
			"author": "Post Editorial Board",
			"authors": ["Post Editorial Board"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.391
		},
		{
			"id": 251757980,
			"title": "It is Too Late To Replace Joe Biden",
			"text": "By Kalyani Shankar U.S. President Joe Biden’s underwhelming performance in the 2024 presidential debate last week raised concerns due to his apparent fatigue, forgetfulness, and confusion. This has caused uncertainty among supporters despite Biden’s attempts to reassure them in the post-debate period. Even last week, during a speech in Madison, Wisconsin, he initially said he would “beat Donald Trump again in 2020” before correcting himself to “2024,” which added to the uncertainty. According to the Spanish newspaper El Pais, Biden has defended himself about three things. First, his support stayed pretty much the same after the debate. Secondly, most party voters want him to continue. The last point is that other options are not better. President Biden has demonstrated resilience in the face of pressure to step down. He confidently declared at a rally in Madison that he would run and win again, which cheered his supporters and reassured some doubters within the party. President Biden’s improved performance in his public appearances post-debate has the potential to significantly reshape his chances in the upcoming election and the prospects of the Democratic Party. This shift in dynamics could bring a sense of hope and anticipation to the party. Next month, the Democratic Party will nominate President Biden as its 2024 Presidential candidate in a virtual convention. This event will officially confirm Biden’s candidacy and establish the party’s campaign strategy. If Biden stays in the race, it will be tough for any other candidate to win the Democratic nomination. This is because the party rules give Biden a big advantage. These rules include specific guidelines for delegate allocation and influence. of super delegates. If Biden were to resign, who would take his place? With only four months before the 2024 election, finding the right person takes a lot of work. This shows how serious the situation is. Kamala Harris, the current Vice President and Joe Biden’s running mate, is the top contender for the upcoming presidential election. Many believe that she has the advantage. However, her lack of popularity could be a significant challenge, as 49% of Americans disapprove of her according to polling averages. Republicans hope Harris will become the Democratic presidential nominee, believing it will benefit Trump’s campaign. The Trump campaign has launched an ad with the slogan: “This November, vote Republican. Stop Kamala.” A recent poll by Reuters/Ipsos showed that Michelle Obama could win against Trump in November. However, Michelle has repeatedly said she does not aspire to be President, so it’s doubtful she will run. Several names are being floated to replace President Biden. This includes at least six governors: Gavin Newsom from California, Gretchen Whitmer from Michigan, Josh Shapiro from Pennsylvania, J. B. Pritzker from Illinois, and Ro Khanna, a representative from California. Each of these potential candidates has their strengths and weaknesses. For instance, Gavin Newsom is the favourite. Their potential to run for office would have different effects on the Democratic Party and the upcoming election. After the debate, polls from CNN, The New York Times, and The Wall Street Journal showed that Biden is six points behind Trump in the country. Biden is also trailing in the most crucial states he won in 2020 elections.. Furthermore, other states he won—Minnesota, New Hampshire, New Mexico, and Virginia—now seem uncertain. In 2020, four months before the election, Biden was 9 points ahead in the polls. However, he eventually won the election with 51.25% of the popular vote, compared to Trump’s 46.8%. This data suggests Biden may face a more challenging race in 2024 than 2020. When asked whether he could run the country for another term, he told ABC in a recent interview. “I believe so; I wouldn’t be running ‘ if I didn’t think I did. Look, I’m running’ again because I believe I understand best what has to be done to take this nation to a completely new level. We’re on our way.” Polls reveal that voters are more concerned about whether the 81-year-old President could manage another four years in the White House than his 78-year-old rival.. Biden needs to be more competent to win in November. Biden was confident when he said, “If the Lord Almighty came down and said, ‘Joe, get out of the race,’ I’d get out of the race,” but added, “The Lord Almighty’s not coming down.” So, it is up to God Almighty to go down and ask him to keep out of the race. Trump quietly observes Biden’s challenging position. India has had a good rapport with both Trump and Biden. There is also bipartisan support. Therefore, it is unlikely that their South Asia and India policies will change, given the growing economic influence of India. Prime Minister Narendra Modi also has a good rapport with both of them. Biden is facing challenges as he moves toward November. 5. Trump has raised a lot of money and still has support from his party despite some court decisions going against him. Both candidates are trying to harm each other’s reputation. Elections are unpredictable, especially with four months to go. Anything can happen. (IPA )",
			"summary": "By Kalyani Shankar U.S. President Joe Biden&#8217;s underwhelming performance in the 2024 presidential debate last week raised concerns due to his apparent fatigue, forgetfulness, and confusion. This has caused uncertainty among supporters despite Biden&#8217;s attempts to reassure them in the post-debate period. Even last week, during a speech in Madison, Wisconsin, he initially said he would &#8220;beat Donald Trump again in 2020&#8221; before correcting himself to &#8220;2024,&#8221; which added to the uncertainty. According to the Spanish newspaper El Pais, Biden [&#8230;]\n\n\nThe post It is Too Late To Replace Joe Biden appeared first on Daily Excelsior.",
			"url": "https://www.dailyexcelsior.com/it-is-too-late-to-replace-joe-biden/",
			"image": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2024/07/bedin.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:55:11",
			"author": "Daily Excelsior",
			"authors": ["Daily Excelsior"],
			"language": "en",
			"catgory": "politics",
			"source_country": "in",
			"sentiment": 0.008
		},
		{
			"id": 251757720,
			"title": "Trump: ‘potential assassin’ won’t derail Republican National Convention",
			"text": "The Republican National Convention will go forward as planned, former President Donald Trump said less than 24 hours before its start and less than half a day after he was spared by mere inches from an apparent assassin’s bullet. Trump said he considered delaying the party’s nominating convention in light of his near brush with death Saturday evening in Butler County, Pennsylvania, but said he would not be chased off the campaign trail. “Based on yesterday’s terrible events, I was going to delay my trip to Wisconsin, and The Republican National Convention, by two days, but have just decided that I cannot allow a ‘shooter,’ or potential assassin, to force change to scheduling, or anything else. Therefore, I will be leaving for Milwaukee, as scheduled, at 3:30 P.M. TODAY. Thank you,” the presumptive Republican nominee wrote on his Truth Social media platform. “UNITE AMERICA!” he declared soon after, capitalization his. In a joint statement issued by Republican National Committee Chairman Michael Whatley and Co-Chairman Lara Trump, the RNC said Trump is doing well and that the party looked forward to nominating him in the coming days. “President Trump looks forward to joining you all in Milwaukee as we proceed with our convention to nominate him to serve as the 47th President of the United States. As our party’s nominee, President Trump will continue to share his vision to Make America Great Again,” they wrote. Still in question — and nearly forgotten amid so many unanswered questions surrounding the lapse in security that let a 20-year-old shoot at a former U.S. President — is who Trump might pick to serve as his Vice President. Short-listed number-two candidates like U.S. Sens. Marco Rubio, Tim Scott, and J.D. Vance, and North Dakota Gov. Doug Burgum, are all scheduled to speak, according to the RNC. Also scheduled to appear during the nominating convention, according to the party, are Donald Jr. and Eric Trump, former Fox News host Tucker Carlson, Teamsters President Sean O’Brien, Ultimate Fighting Championship CEO Dana White, former Republican presidential candidates Florida Gov. Ron DeSantis, Vivek Ramaswamy, Nikki Haley, and Perry Johnson, and former Trump administration officials ex-Secretary of State Mike Pompeo and former Small Business Administration chief Linda McMahon. The Republican National Convention begins Monday runs through Thursday. The Democratic National Convention is scheduled for August 19 to 22 in Chicago, Illinois.",
			"summary": "Trump said he considered delaying the party’s nominating convention in light of his near brush with death Saturday evening in Butler County, Pennsylvania, but said he would not be chased off the campaign trail.",
			"url": "https://www.bostonherald.com/2024/07/14/trump-potential-assassin-wont-derail-republican-national-convention/",
			"image": "https://www.bostonherald.com/wp-content/uploads/2024/07/AP24196792106197.jpg?w=1024",
			"video": null,
			"publish_date": "2024-07-14 22:54:31",
			"author": "Matthew Medsger",
			"authors": ["Matthew Medsger"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.056
		},
		{
			"id": 251757456,
			"title": "The Democratic campaign to replace Joe Biden has concluded, but not for the reasons you may expect",
			"text": "With Donald Trump having narrowly escaped death at the hands of a would-be assassin on Saturday, the state of the presidential race has never been more chaotic. In the weeks prior, all eyes were on Joe Biden and his severe mental and physical decline, with many high-level Democrats desperately trying to organize a way to force him out of the race. Yet, after the attempt on Trump’s life, the rush to replace Biden as the Democratic Party nominee has essentially ended, and not for the reason one might think. According to NBC News, the replacement campaign has lost steam not because Democrats think the president can seize a moment of unity, but because they think the race is now over. Why the Replace Biden campaign likely came to an end last night: they no longer believe it even matters. pic.twitter.com/vgaRGG4Bbj— John Ekdahl (@JohnEkdahl) July 14, 2024 “The presidential contest ended last night,” said a veteran Democratic consultant, who spoke on the condition of anonymity to give a candid assessment of his own party’s standing less than four months before the election.“Now it’s time to focus on keeping the Senate and trying to pick up the House,” he said. “The only positive thing to come out of last night for Democrats is we are no longer talking about Joe Biden’s age today.”A Biden campaign spokesperson did not respond to NBC News’ request for comment on how the attempted assassination of Trump might affect the dynamics of their rematch. A White House spokesperson declined to comment. Is the presidential campaign truly over? Being a natural cynic about politics means I’ll never believe that before all the votes are tallied. Still, it’s very telling that Democrats are throwing their hands up and retreating to rear fortifications. Perhaps they don’t want to waste the career of anyone on their bench, but the bigger question is what this means for the money. Reports of fundraising drying up for Biden have been prevalent since his disastrous debate performance. If that situation gets even worse, it could starve the president’s campaign regardless of whatever path to victory might exist on paper. SEE: Major Dem Donors Freeze $90 Million in Donations to Biden On the other hand, I’m not sure the idea of trying to keep the Senate and retake the House is much of a backup plan. The Senate map is brutal for Democrats, and unlike 2022, the list of candidates in various swing states is strong with few exceptions. As odd as it may sound, trying to help Biden pull off a miracle by infusing his campaign with cash may be the best of a lot of bad options. What’s certain, though, is that Democrats are in a bad spot. If they try to push too hard going forward against Trump and Republicans with more “threat to democracy” nonsense, they could further alienate swing voters. If they lay low, then they risk losing any initiative that might be for the taking. I guess that’s one of the downsides of having an ideological ally try to murder your political opponent. Here’s the Democrats’ biggest problem, though. Whether the race ended or not on Saturday evening, they were already deep in the hole before that. This isn’t a case of one event sinking them. It’s a case of an avalanche of events, including Biden being exposed as senile, piling on. That makes any possible comeback all the more unlikely. Of course, the normal disclaimer applies. This is politics, and anything can happen.",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nWith Donald Trump having narrowly escaped death at the hands of a&#8230;\n\n\nThis Post: The Democratic campaign to replace Joe Biden has concluded, but not for the reasons you may expect first appeared on Internewscast Journal",
			"url": "https://internewscast.com/news/us/the-democratic-campaign-to-replace-joe-biden-has-concluded-but-not-for-the-reasons-you-may-expect/",
			"image": "https://media.townhall.com/cdn/hodl/2024/195/4572e2d9-e771-4577-afea-7b2b22670f05.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:54:17",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.695
		},
		{
			"id": 251757448,
			"title": "Details emerge as investigation into Trump shooter continues",
			"text": "Details emerge as investigation into Trump shooter continues Investigators on Sunday searched a home connected to the 20-year-old would-be assassin who fired at former President Donald Trump while he was speaking at a rally Saturday. The shooter, from Bethel Park, Pennsylvania, was killed by Secret Service agents. Charlie De Mar reports.",
			"summary": "Investigators on Sunday searched a home connected to the 20-year-old would-be assassin who fired at former President Donald Trump while he was speaking at a rally Saturday. The shooter, from Bethel Park, Pennsylvania, was killed by Secret Service agents. Charlie De Mar reports.",
			"url": "https://www.cbsnews.com/video/details-emerge-as-investigation-into-trump-shooter-continues/",
			"image": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/07/14/038e6b23-febe-44ce-ba32-3b1dc10ca26f/thumbnail/1200x630/c92b4d716f1b014649763a06167bd091/0714-en-dema.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 22:52:20",
			"author": null,
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.593
		},
		{
			"id": 251757646,
			"title": "VIDEO: The moment a gunman shot Donald Trump",
			"text": "Video Chevron icon It indicates an expandable section or menu, or sometimes previous / next navigation options. News VIDEO: The moment a gunman shot Donald Trump Share icon An curved arrow pointing right. Twitter icon A stylized bird with an open mouth, tweeting. Twitter LinkedIn icon LinkedIn Link icon An image of a chain link. It symobilizes a website link url. Copy Link Facebook Icon The letter F. Email icon An envelope. It indicates the ability to send an email. Barbara Corbellini Duarte 2024-07-14T22:51:35Z Share icon An curved arrow pointing right. Twitter icon A stylized bird with an open mouth, tweeting. Twitter LinkedIn icon LinkedIn Link icon An image of a chain link. It symobilizes a website link url. Copy Link Facebook Icon The letter F. Email icon An envelope. It indicates the ability to send an email. Description Angle down icon An icon in the shape of an angle pointing down.",
			"summary": "Video shows the moment a bullet struck former President Donald Trump at a campaign rally in Butler, Pennsylvania.",
			"url": "https://www.businessinsider.com/video-the-moment-a-gunman-shot-donald-trump-2024-7",
			"image": "https://i.insider.com/669452ab8893442a51567792?width=1136&format=jpeg",
			"video": null,
			"publish_date": "2024-07-14 22:51:35",
			"author": "Barbara Corbellini Duarte",
			"authors": ["Barbara Corbellini Duarte"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": 0.181
		},
		{
			"id": 251757368,
			"title": "No changes made to RNC security plan after Trump assassination attempt, Secret Service says",
			"text": "MILWAUKEE -- There are no known threats to the 2024 Republican National Convention, officials said, in the aftermath of the assassination attempt against former President Donald Trump at a rally in Pennsylvania Saturday. The FBI special agent in charge of the Wisconsin Field Office said there was an uptick in threats that the FBI has seen online. ABC7 Chicago is now streaming 24/7. Click here to watch The RNC Secret Service Coordinator Audrey Gibson-Cicchino said they've made no change to their security plan and officials remain confident in the plan they've put forth. \"This event is designated as a national special security event, which is the highest level of security for an event that can be designated by the government. So this is a whole of government approach. We've had an extensive planning process, to include many organizations,\" Gibson-Cicchino said. \"There have been no changes to our current operational security plans for this event,\" she said. Gibson-Cicchino said there have been no plans to extend the perimeter of the convention and did not know about the request from Wisconsin Gov. Tony Evers to ban guns in the outer perimeter. SEE ALSO | New details emerge about alleged Trump rally shooter | Live Updates \"We are confident in the security plans in place for this event and we're ready to go. It's been an 18-month process,\" Gibson continued, adding, \"We've worked together to develop operational security plans for any and all access of security.\" The Secret Service did not answer any questions about the assassination attempt on Trump in Pennsylvania on Saturday. The Milwaukee police chief said they won't tolerate any illegal activity and they will move to quickly stop anything from getting out-of-hand. Republicans are now ready for their convention, but with a lot more on their minds after after the horrific moment Saturday. \"I was actually watching it live. I saw it happen and I was just like everyone else just shocked,\" said RNC Co-chair Demetra Demonte. On Sunday afternoon, the security was evident at the venue where the delegate welcome party would soon be getting underway. FBI and homeland security agents were on scene as were as were mounted police along with snipers on rooftops. READ MORE | Republican Convention 2024: Speakers include potential VP picks Marco Rubio, JD Vance, Doug Burgum \"I think a lot of people are going to be more self-aware of where they're at and what's going on around them because of this attempt on President Trump. There are some of our delegation that has some concerns regarding safety,\" said Republican Committeeman Aaron Del Mar. But even before Saturday's events, dozens of law enforcement agencies have spent months planning security for both the RNC and next month's Democratic National Convention in Chicago. \"It was already going to be super super secure, and now, I guess it's going to be on steroids in terms of security, and you know, that's obviously as it should be,\" said Illinois GOP Chairman Don Tracy. Last week, a federal judge ruled that protesters cannot march through the RNC security zone. They will be kept blocks from the main convention site. And the Chicago Police Department issued a statement following the attempted assassination, saying, \"The Chicago Police Department continues to monitor the situation that unfolded in Butler, Pennsylvania as we prepare for the upcoming Democratic National Convention. We have been planning for the convention for more than a year to prepare for anything and everything. As always, CPD will assess and adjust resources as necessary in real-time, based on intelligence and what we are seeing on the ground to protect the entire city. We also remain in constant contact with our federal partners, who we are working closely with, to ensure dignitaries and areas around the convention footprint are secured. We want to remind everyone to please be aware of their surroundings in large gatherings, at work, places of worship, critical facilities and online. If you see something, say something by calling 9-1-1 to report suspicious activity.\" Meanwhile, the assassination attempt on Trump has only served to cement GOP support for the presumptive Republican nominee. \"I mean, look, there was a lot of excitement for President Trump in the first instance. I think, if anything now there's an emotional excitement around this too. I think there's a strong sense of resolve and steadiness,\" said Republican National Committeeman Richard Porter. \"I came to the realization after thinking about this that our President Donald Trump is the bravest most resilient man in the world,\" Demonte added. And as the investigation into Saturday's shooting continues, Republicans have been uniting and calling for a de-escalation of the political rhetoric. \"I certainly feel more somber, but it's also a sense of resolve of seriousness of purpose of what we're doing and and seeing seeing that happen, and recognizing how important it is and also encouraging people to ratchet back on the Trump hate,\" Porter said. ABC7 Political Reporter Craig Wall will have live reports from the RNC in Milwaukee starting Sunday night at 5 p.m. ABC News contributed to this report.",
			"summary": "There are no known threats to the 2024 Republican National Convention, officials said, in the aftermath of the assassination attempt against former President Donald Trump.",
			"url": "https://abc7news.com/post/donald-trump-rally-shooting-authorities-reexamining-2024-rnc/15058117/",
			"image": "https://cdn.abcotvs.com/dip/images/15059116_071424-wls-rnc-clean-img.jpg?w=1600",
			"video": "https://vcl.abcotv.net/video/wls/071424-wls-craig-rnc-preps-5p-vid.mp4",
			"publish_date": "2024-07-14 22:50:59",
			"author": "Abc7 Chicago Digital Team,Craig Wall,WLS",
			"authors": ["Abc7 Chicago Digital Team", "Craig Wall", "WLS"],
			"language": "en",
			"source_country": "US",
			"sentiment": -0.13
		},
		{
			"id": 251757450,
			"title": "President Biden responds to attempted to Trump assassination",
			"text": "President Biden responds to attempted Trump assassination President Biden urged Americans not to draw conclusions about former President Donald Trump's would-be assassin until the FBI can complete a thorough investigation. Mr. Biden is set to address the nation Sunday night from the Oval Office. Nancy Cordes reports.",
			"summary": "President Biden urged Americans not to draw conclusions about former President Donald Trump's would-be assassin until the FBI can complete a thorough investigation. Mr. Biden is set to address the nation Sunday night from the Oval Office. Nancy Cordes reports.",
			"url": "https://www.cbsnews.com/video/president-biden-responds-to-attempted-to-trump-assassination/",
			"image": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/07/14/6a2d796e-2fd4-47a5-91b1-0abf35e3225a/thumbnail/1200x630/6420e406de6023d5403dd57c3178ff9b/0714-en-cordes.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 22:50:00",
			"author": null,
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -1
		},
		{
			"id": 251757452,
			"title": "Trump camp looks to ease tensions after failed assassination attempt",
			"text": "Trump camp looks to ease tensions after failed assassination attempt Those working closely with former President Donald Trump on his reelection bid are hoping to cool things off following Saturday's failed assassination attempt. Several key Trump allies, including his wife Melania, have issued statements and Trump's own camp sent out a memo saying it would not tolerate dangerous rhetoric. Robert Costa has more.",
			"summary": "Those working closely with former President Donald Trump on his reelection bid are hoping to cool things off following Saturday's failed assassination attempt. Several key Trump allies, including his wife Melania, have issued statements and Trump's own camp sent out a memo saying it would not tolerate dangerous rhetoric. Robert Costa has more.",
			"url": "https://www.cbsnews.com/video/trump-camp-looks-to-ease-tensions-after-failed-assassination-attempt/",
			"image": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/14/c0109e07-090c-4f86-bacf-4fd687b455cf/thumbnail/1200x630/51de848f9b6a7f8f483408c383f6a454/0714-en-costa.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": null,
			"publish_date": "2024-07-14 22:49:00",
			"author": null,
			"language": "en",
			"source_country": "US",
			"sentiment": -0.925
		},
		{
			"id": 251758216,
			"title": "Vatican speaks out on assassination attempt against Trump",
			"text": "Valentina di Giorgio and Tim Daniel (ZENIT News / Vatican City-Washington, 07.14.2024).- A day after the attack on former President Donald Trump, the Holy See Press Office issued a statement regarding the incident: “The Holy See expresses its concern over last night’s violence, which harms people and democracy, causing suffering and death. It joins the prayers of the US bishops for America, for the victims, and for peace in the country, so that the motives of the violent may never prevail.» Pope Francis has not personally commented, unlike virtually all other world leaders from different countries, who, even without sharing Trump’s political views, have condemned the attack. In contrast, the leader of the U.S. bishops, Archbishop Timothy Broglio of the Archdiocese for the Military Services, USA, and president of the United States Conference of Catholic Bishops (USCCB) stated: “Together with my brother bishops, we condemn political violence, and we offer our prayers for President Trump, and those who were killed or injured. We also pray for our country and for an end to political violence, which is never a solution to political disagreements. We ask all people of goodwill to join us in praying for peace in our country. Mary, Mother of God and Patroness of the Americas, pray for us.” Earlier this summer, the USCCB issued a statement on political violence, urging all Christians and people of good will to abstain from political violence, and instead, ‘pursue what leads to peace and building up one another’ through dialogue, seeking justice. Thank you for reading our content. If you would like to receive ZENIT’s daily e-mail news, you can subscribe for free through this link.",
			"summary": "Vatican Press Room issues statement\n\n\nThe post Vatican speaks out on assassination attempt against Trump appeared first on ZENIT - English.",
			"url": "https://zenit.org/2024/07/14/vatican-speaks-out-on-assassination-attempt-against-trump/",
			"image": "https://zenit.org/wp-content/uploads/2024/07/atentado-contra-el-ex-presidente-donald-trump-01.png",
			"video": null,
			"publish_date": "2024-07-14 22:48:41",
			"author": "ZENIT Staff",
			"authors": ["ZENIT Staff"],
			"language": "en",
			"source_country": "it",
			"sentiment": 0.19
		},
		{
			"id": 251757718,
			"title": "Trump 'extremely lucky' to have survived assassination attempt, former special forces soldiers say",
			"text": "Former President Trump is \"extremely lucky\" to be alive after a deadly assassination attempt at a rally in Pennsylvania on Saturday, according to two special forces soldiers. \"He is extremely lucky to be alive,\" James Pechi, a Marine veteran who later served as a Green Beret, said of the former president in an interview with Fox News Digital. \"I was trying to look at this, trying to figure out what was the shot, what was going on,\" he added. \"It sounded like he shot five times, and then it looked like he grazed [Trump's] ear or something. … It obviously did some damage.\" Pechi – who took part in the Special Operations Target Interdiction Course (SOTIC), now known as the Special Forces Sniper Course, during his tenure in the military – insisted \"there's no ifs, ands or buts about\" the fact that Trump could have lost his life at the rally if the bullet had come into closer contact. SENATE HOMELAND SECURITY COMMITTEE TO INVESTIGATE TRUMP ASSASSINATION ATTEMPT AND SECURITY FAILURE Echoing Pechi, Gary Seideman, a former Green Beret chief warrant officer, said Trump was the beneficiary of \"good fortune\" after surviving the shooter's attempt to take his life. \"The biggest thing is the way he turned, the way it hit his ear and everything, it was just good fortune, and that's all it was,\" Seideman said. \"It's unfortunate the other person was killed there.\" \"So basically, how Trump was [positioned], if it was at a different angle ... Trump's head would have exploded,\" he added. PHOTO GALLERY: ASSASSINATION ATTEMPT ON FORMER PRESIDENT DONALD TRUMP Regarding the shooter – identified by the FBI as Thomas Matthew Crooks, a 20-year-old man from western Pennsylvania – Pechi said, \"This was someone that has, obviously, some serious mental health issues.\" Crooks reportedly shot at Trump from a rooftop perch some 130 yards away during a rally in the small town, striking the upper part of Trump’s right ear while the former president was speaking to rallygoers ahead of this week’s Republican National Convention in Milwaukee. One attendee was killed and two others were injured during the incident, the agency said, and Crooks was shot dead. The Pennsylvania State Police identified the victims on Sunday: 50-year-old Corey Comperatore, who was killed; 57-year-old David Dutch, who is in stable condition; and 74-year-old James Copenhaver, who is also in stable condition. \"Regardless of what anyone says, how mentally unhealthy they are, you would never shoot into a group of people like that and not expect to kill someone,\" Pechi said. \"It almost sounded like it was a .22 style instead of a .223, 5.56, almost like a range gun,\" Pechi added, speculating about the type of weapon that Crooks may have used. \"But with the audio and everything else going on there, you know, it could have been bigger.\" Crooks was from Bethel Park, which is a Pittsburgh suburb about an hour south from where the assassination attempt took place. CLICK HERE TO GET THE FOX NEWS APP Crooks graduated from Bethel Park High School in 2022. He was one of nearly two dozen students from the school to earn a $500 \"star award\" from the National Math and Science Initiative. An online recording of his graduation ceremony shows him walking the stage to minimal applause and briefly posing with a school official, the New York Times reported. Fox News' Andrea Vacchiano and Scott McDonald contributed to this report.",
			"summary": "Former President Trump is “extremely lucky&quot; to be alive after a deadly assassination attempt at a rally in Pennsylvania on Saturday, according to two special forces soldiers.",
			"url": "https://www.foxnews.com/politics/trump-extremely-lucky-have-survived-assassination-attempt-former-special-forces-soldiers-say",
			"image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Donald-Trump-Butler-PA-Shooting_07.jpg?ve=1&tl=1",
			"video": null,
			"publish_date": "2024-07-14 22:48:13",
			"author": "Kyle Morris",
			"authors": ["Kyle Morris"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.509
		},
		{
			"id": 251757454,
			"title": "Trump shot at rally in failed assassination attempt. Here's what we know.",
			"text": "Former President Donald Trump was shot and injured in an assassination attempt on Saturday night that also killed a spectator and critically injured two others. Snipers killed the shooter, a 20-year-old man, after he fired eight rounds at the rally in Butler, Pennsylvania.The former president could be seen touching his ear as the shooting unfolded before he was shielded by Secret Service and whisked offstage — with blood on his face — and into an SUV to safety. Trump said in a social media post that a bullet pierced the upper part of his right ear.\"I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,\" he said. \"Much bleeding took place, so I realized then what was happening.\"The Secret Service later said Trump was safe, and that he went to a local hospital and left hours later. The gunman was fatally shot by a Secret Service sniper, authorities said. Who shot Donald Trump?The FBI identified the shooter early Sunday as 20-year-old Thomas Matthew Crooks, of Bethel Park, Pennsylvania. The town in Allegheny County, just outside Pittsburgh, is home to about 30,000 people.Law enforcement officials say he was armed with a semiautomatic AR-style rifle. Two law enforcement sources say the gun was legally purchased by and registered to the shooter's father, Matthew Crooks. Crooks was a 2022 graduate of Bethel Park High School School officials pledged to work with law enforcement investigating the shooting, and offered condolences to those affected by the attack.Former classmate Jameson Myers, a member of the school's varsity rifle team, told CBS News that Crooks had tried out for the team freshman year but did not make the junior varsity roster and did not return to try out for the team in subsequent years. He called Crooks a \"nice kid who never talked poorly of anyone,\" adding, \"I never have thought him capable of anything I've seen him do in the last few days.\" Another classmate, Jason Koehler, had a somewhat different view, telling KDKA's Megan Schiller that Crooks was a loner who was bullied for his appearance and wore camo/hunting outfits in class. He said Crooks would often sit in the cafeteria alone before class. He also said Crooks was very COVID-conscious and wore a surgical mask long after they were required. But Mark Sigafoos, who graduated with Crooks and had two classes with him senior year, said he never saw him bullied. He described Crooks as super smart and approachable, engaged in class and always volunteering answers. \"This is one of the things that is being misconstrued — he was not some type of loner trenchcoat wearer. And I will say he was definitely nerdy, for sure, but he never gave off that he was creepy or like a school shooter,\" Sigafoos said. \"He seemed like he wouldn't hurt a fly.\"Crooks' political leanings were not immediately clear. Records show he was registered as a Republican voter in Pennsylvania but previously made a $15 donation to a Democratic-aligned group.There was no indication that Crooks had a connection to any military branch, officials confirmed to CBS News. A law enforcement official said early Sunday that the Secret Service and the FBI are investigating the suspect's background and speaking with his family. The FBI has secured his home and federal law enforcement is searching his family's residence in suburban Pittsburgh, the law enforcement official said. His family is cooperating with investigators, an FBI official said.Law enforcement sources told CBS News on Sunday that suspicious devices were found in the gunman's vehicle. The gunman also had with him a piece of commercially available equipment that appeared capable of initiating the devices. Bomb technicians called to the scene were involved in securing and investigating the devices.Do we know the motive for the assassination attempt?In a news conference late Saturday night, Kevin Rojek, special agent in charge of the FBI Pittsburgh office, refused to speculate on a possible motive, but said authorities are investigating the shooting as an \"attempted assassination.\" \"Right now, we're tracking down all leads, and doing all interviews, and tracking anything that we can regarding suspicious locations, vehicles ... that's all related to this event, but I can't confirm or deny anything beyond that,\" Rojek said. A law enforcement official said early Sunday that no foreign terrorism ties were known and the suspect was not on the radar of law enforcement, although they were still running his name down.The FBI says investigators are combing through his social media postings and emails, but that so far they have found nothing to lead them to a motive. They said are not seeing anything threatening in his postings so far. Investigators also have his cellphone, which was sent to the FBI lab in Quantico, Virginia, for analysis.The FBI is leading the investigation, with assistance from the Secret Service and state and local agencies. How is Trump now?The Trump campaign said in a statement Saturday that the former president was 'fine.\" He was taken to a local hospital and left a few hours later.In a post on Truth Social Saturday night, Trump described his injuries: \"I was shot with a bullet that pierced the upper part of my right ear. I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin. Much bleeding took place, so I realized then what was happening. GOD BLESS AMERICA!\"He thanked the Secret Service and other law enforcement agencies for their rapid response, and extended condolences to the family of the man who was killed.He posted on Truth Social early Sunday that Americans need to \"remain resilient in our Faith and Defiant in the face of Wickedness.\"\"In this moment, it is more important than ever that we stand United, and show our True Character as Americans, remaining Strong and Determined, and not allowing Evil to Win,\" Trump wrote. \"I truly love our Country, and love you all, and look forward to speaking to our Great Nation this week from Wisconsin,\" where the Republican National Convention begins Monday.Video posted by a Trump aide to social media early Sunday morning showed him walking down the steps of his plane unaided after landing at Newark Liberty International Airport in New Jersey. Where was the Trump rally and how far away was the shooter?The rally on Saturday was in Butler, Pennsylvania, which is north of Pittsburgh and is the county seat of Butler County.The gunman was on the roof of a shed, outside the rally's security perimeter set up by the Secret Service, and opened fire from about 400 feet away from the stage where Trump was speaking, law enforcement sources said. Two law enforcement sources told CBS News that the shooter was spotted outside the security perimeter as people were filing into the rally, and he was reported by a bystander to the Butler County Sheriff's Office. He was identified as a suspicious person by police, the sources said. An armed municipal officer with Butler Township encountered the gunman before the shooting, Butler County Sheriff Michael Sloupe confirmed to CBS News. The officer and others had been previously alerted to a suspicious person and began searching for him right away, Sloupe told CBS Pittsburgh reporter Jen Borrasso.At some point, the officer was hoisted by another officer onto the roof of the building where the shooter was in position. The shooter focused his rifle towards the officer, who let go and fell off the roof. Then the shooter began firing into the crowd, according to Sloupe.The gunman fired 6 to 8 rounds using a semiautomatic AR-style rifle from his position approximately 400 feet from the podium, before he was shot and killed by a Secret Service sniper team.Rojek, with the FBI, called it \"surprising\" that the gunman was able to fire multiple shots. \"It is incredibly difficult to have a venue open to the public, and to secure that against any possible threat, against a very determined attacker,\" Pennsylvania State Police Lt. Col. George Bivens said of the Secret Service. \"That's a huge lift to try and do it.\" Who was the rally victim who was fatally shot?The spectator who was killed has been identified as Corey Comperatore, a 50-year-old man who was shot while attempting to shield his family from the gunfire, Pennsylvania Gov. Josh Shapiro said at a news conference Sunday.\"Corey was the very best of us,\" Shapiro said. \"Corey died a hero. Corey dove on his family to protect them last night. Corey was a 'girl dad.' Corey was a firefighter. Corey went to church every Sunday. Corey loved his community.\"Pennsylvania State Rep. Marci Mustello called Comperatore \"a devoted public servant, having served as the fire chief for Buffalo Township Fire Company, and he was a cherished member of our community in Butler County.\"\"His commitment to his wife and two daughters, and his unwavering dedication to his role as a fire chief exemplified his remarkable character,\" Mustello said. \"My heart breaks for his loved ones during this incredibly difficult time, and I join the community in mourning his loss. A true American hero, Corey sacrificed his life to protect his family.\"\"May Corey Comperatore's memory be a blessing and a reminder of the selfless service he provided to us all.\"The two spectators who were wounded have been identified as 57-year-old David Dutch, of New Kensington, Pennsylvania, and James Copenhaver, 74, of Moon Township, Pennsylvania. Both were listed in critical but stable condition Sunday.What did Biden say about the shooting?President Biden first responded to the shooting in a statement saying he was grateful to hear that Trump was safe and doing well. \"Jill and I are grateful to the Secret Service for getting him to safety,\" he said. \"There's no place for this kind of violence in America. We must unite as one nation to condemn it.\"He then addressed the nation shortly after 8 p.m. ET Saturday, saying \"there is no place for this kind of violence in America.\"\"It's sick. It's sick,\" Mr. Biden said. \"It's one of the reasons why we have to unite this country. We cannot allow for this to be happening. We cannot be like this. We cannot condone this.\"On Sunday, Biden made brief remarks at the White House, saying he was \"sincerely grateful\" that Trump is doing well, adding that he spoke with the former president on Saturday night. He characterized the call as a \"short, good\" conversation, and said he would address the nation from the Oval Office at 8 p.m. Sunday.He has been getting briefed by top officials and said he has ordered an independent review of the security and events at the Pennsylvania rally to determine what went wrong. Mr. Biden also called for unity in the wake of the assassination attempt and denounced political violence.\"There's no place in America for this kind of violence, or any violence for that matter,\" the president said. \"An assassination attempt is contrary to everything we stand for as a nation. It's not who we are as a nation.\"The president said unity is the \"most elusive goal of all\" and added that \"nothing is more important than that right now. Unity.\"A Biden campaign official said Saturday that the campaign was pausing all outbound communications and working to take down their television ads as quickly as possible.Robert Costa, Pat Milton, Andy Triay, Arden Farhi, Fin Gomez, Aaron Navarro, Sara Cook and other CBS News staff contributed reporting.",
			"summary": "Former President Donald Trump was shot​ in an assassination attempt at the campaign rally and said a bullet pierced the upper part of his right ear.",
			"url": "https://www.cbsnews.com/news/trump-shot-rally-assassination-attempt/",
			"image": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/07/14/84612200-de96-4f5f-b870-7ce33580c8be/thumbnail/1200x630/b94dd948bc2d25b17747d5690a33cbac/gettyimages-2161356329.jpg?v=bc37a4cad39dacb7e4b48f11b71f691b",
			"video": "https://www.cbsnews.com/live/",
			"publish_date": "2024-07-14 22:48:00",
			"author": "Jacob Rosen,Nicole Sganga,Olivia Rinaldi,Scott Macfarlane",
			"authors": ["Jacob Rosen", "Nicole Sganga", "Olivia Rinaldi", "Scott Macfarlane"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.318
		},
		{
			"id": 251757318,
			"title": "No changes made to RNC security plan after Trump assassination attempt, Secret Service says",
			"text": "MILWAUKEE -- There are no known threats to the 2024 Republican National Convention, officials said, in the aftermath of the assassination attempt against former President Donald Trump at a rally in Pennsylvania Saturday. The FBI special agent in charge of the Wisconsin Field Office said there was an uptick in threats that the FBI has seen online. ABC7 Chicago is now streaming 24/7. Click here to watch The RNC Secret Service Coordinator Audrey Gibson-Cicchino said they've made no change to their security plan and officials remain confident in the plan they've put forth. \"This event is designated as a national special security event, which is the highest level of security for an event that can be designated by the government. So this is a whole of government approach. We've had an extensive planning process, to include many organizations,\" Gibson-Cicchino said. \"There have been no changes to our current operational security plans for this event,\" she said. Gibson-Cicchino said there have been no plans to extend the perimeter of the convention and did not know about the request from Wisconsin Gov. Tony Evers to ban guns in the outer perimeter. SEE ALSO | New details emerge about alleged Trump rally shooter | Live Updates \"We are confident in the security plans in place for this event and we're ready to go. It's been an 18-month process,\" Gibson continued, adding, \"We've worked together to develop operational security plans for any and all access of security.\" The Secret Service did not answer any questions about the assassination attempt on Trump in Pennsylvania on Saturday. The Milwaukee police chief said they won't tolerate any illegal activity and they will move to quickly stop anything from getting out-of-hand. Republicans are now ready for their convention, but with a lot more on their minds after after the horrific moment Saturday. \"I was actually watching it live. I saw it happen and I was just like everyone else just shocked,\" said RNC Co-chair Demetra Demonte. On Sunday afternoon, the security was evident at the venue where the delegate welcome party would soon be getting underway. FBI and homeland security agents were on scene as were as were mounted police along with snipers on rooftops. READ MORE | Republican Convention 2024: Speakers include potential VP picks Marco Rubio, JD Vance, Doug Burgum \"I think a lot of people are going to be more self-aware of where they're at and what's going on around them because of this attempt on President Trump. There are some of our delegation that has some concerns regarding safety,\" said Republican Committeeman Aaron Del Mar. But even before Saturday's events, dozens of law enforcement agencies have spent months planning security for both the RNC and next month's Democratic National Convention in Chicago. \"It was already going to be super super secure, and now, I guess it's going to be on steroids in terms of security, and you know, that's obviously as it should be,\" said Illinois GOP Chairman Don Tracy. Last week, a federal judge ruled that protesters cannot march through the RNC security zone. They will be kept blocks from the main convention site. And the Chicago Police Department issued a statement following the attempted assassination, saying, \"The Chicago Police Department continues to monitor the situation that unfolded in Butler, Pennsylvania as we prepare for the upcoming Democratic National Convention. We have been planning for the convention for more than a year to prepare for anything and everything. As always, CPD will assess and adjust resources as necessary in real-time, based on intelligence and what we are seeing on the ground to protect the entire city. We also remain in constant contact with our federal partners, who we are working closely with, to ensure dignitaries and areas around the convention footprint are secured. We want to remind everyone to please be aware of their surroundings in large gatherings, at work, places of worship, critical facilities and online. If you see something, say something by calling 9-1-1 to report suspicious activity.\" Meanwhile, the assassination attempt on Trump has only served to cement GOP support for the presumptive Republican nominee. \"I mean, look, there was a lot of excitement for President Trump in the first instance. I think, if anything now there's an emotional excitement around this too. I think there's a strong sense of resolve and steadiness,\" said Republican National Committeeman Richard Porter. \"I came to the realization after thinking about this that our President Donald Trump is the bravest most resilient man in the world,\" Demonte added. And as the investigation into Saturday's shooting continues, Republicans have been uniting and calling for a de-escalation of the political rhetoric. \"I certainly feel more somber, but it's also a sense of resolve of seriousness of purpose of what we're doing and and seeing seeing that happen, and recognizing how important it is and also encouraging people to ratchet back on the Trump hate,\" Porter said. ABC7 Political Reporter Craig Wall will have live reports from the RNC in Milwaukee starting Sunday night at 5 p.m. ABC News contributed to this report.",
			"summary": "There are no known threats to the 2024 Republican National Convention, officials said, in the aftermath of the assassination attempt against former President Donald Trump.",
			"url": "https://abc13.com/post/donald-trump-rally-shooting-authorities-reexamining-2024-rnc/15058117/",
			"image": "https://cdn.abcotvs.com/dip/images/15059116_071424-wls-rnc-clean-img.jpg?w=1600",
			"video": "https://vcl.abcotv.net/video/wls/071424-wls-craig-rnc-preps-5p-vid.mp4",
			"publish_date": "2024-07-14 22:47:10",
			"author": "Abc7 Chicago Digital Team,Craig Wall,WLS",
			"authors": ["Abc7 Chicago Digital Team", "Craig Wall", "WLS"],
			"language": "en",
			"source_country": "US",
			"sentiment": -0.13
		},
		{
			"id": 251757332,
			"title": "Responses of Global Leaders to Trump’s Assassination Attempt at a Rally",
			"text": "WASHINGTON — Global leaders expressed concern Sunday over an apparent assassination attempt targeting former U.S. President Donald Trump at a rally in Pennsylvania that left one attendee dead and critically injured two others. Trump’s campaign said the presumptive Republican nominee was doing “fine” after being whisked off the stage though the shooting pierced the upper part of his right ear. The Secret Service said it killed the suspected shooter who attacked from an elevated position outside the rally venue. U.S. authorities are still investigating the shooting. Argentina’s President Javier Milei said Trump was the “victim of a cowardly assassination attempt that put his life and that of hundreds of people at risk.” In a post on X, Milei also said the apparent assassination attempt highlighted the “desperation of the international left” and its “willingness to destabilize democracies and promote violence to screw itself into power.” Australian Prime Minister Anthony Albanese condemned the “inexcusable attack” on the United States and Australia’s shared democratic values. “In Australia, as in the United States, the essence and the purpose of our democracies is that we can express our views, debate our disagreements and resolve our differences peacefully,” Albanese told reporters in the Australian Parliament House. Brazil’s president, Luiz Inácio Lula da Silva, called the incident unacceptable on X and said the attack must be “strongly repudiated” by all democracy defenders. His predecessor, Jair Bolsonaro, who is a close Trump ally, relayed his solidarity with “the world’s greatest leader of the moment.” Bolsonaro was stabbed in the abdomen at a campaign event ahead of the 2018 presidential election, which he went on to win. Trump, he told reporters, was saved by a matter of a few centimeters. “This — to understand — is something that comes from above,” he added. Canadian Prime Minister Justin Trudeau said he was sickened by the shooting and his thoughts were with Trump, those at the event and all Americans. “It cannot be overstated — political violence is never acceptable,” he wrote on X. The Chinese Foreign Ministry said in a statement that China is concerned about the attack and President Xi Jinping has already extended his sympathies to Trump. Egyptian President Abdelfattah El Sissi stressed his country’s condemnation of the attack in a statement and wished for the U.S. election campaigns to resume peacefully. French President Emmanuel Macron sent his wishes to Trump for a prompt recovery. “It is a drama for our democracies. France shares the indignation of the American people,” he posted on X. German Chancellor Olaf Scholz posted on X saying the attack was “despicable” and such violent acts threaten democracy. “My compassionate thoughts are also with the other people who were hurt in the attack,” he said. Hungarian Prime Minister Viktor Orban said his thoughts and prayers were with Trump “in these dark hours” on X. India’s prime minister, Narendra Modi, said he was deeply concerned by “the attack on my friend.” “Strongly condemn the incident. Violence has no place in politics and democracies,” he wrote on X. Masrour Barzani, the prime minister of the Kurdistan region of Iraq, condemned the attack “in the strongest terms,” saying on X his thoughts are with the victims of “this senseless act of terrorism.” At the start of the weekly Cabinet meeting in Jerusalem, Prime Minister Benjamin Netanyahu said he watched “in horror,” adding that the attack was also an “assassination attempt on American democracy.” He said everyone in Israel was sending Trump wishes for “a quick recovery and return to full strength.” Italian President Sergio Mattarella said in a statement the attack was a cause for serious alarm and “a disconcerting symptom of the deterioration of the civil fabric and of the dangerous refusal of confrontation, dialogue and respect for democratic life.” Meanwhile, Premier Giorgia Meloni wished Trump a quick recovery. “We must stand firm against any form of violence that challenges democracy,” Japanese Prime Minister Fumio Kishida said on X. Mexico’s president, Andrés Manuel López Obrador, denounced the attack on X and said “violence is irrational and inhumane.” Pakistani Prime Minister Shehbaz Sharif called the shooting a “shocking development.” He said he condemned all violence in politics and wished the former president a swift recovery and good health. And imprisoned Pakistani opposition leader and former prime minister Imran Khan, who was shot and injured at a rally in November 2022, wished Trump a full recovery. “Political violence is a tool of cowards and has no place in a democracy,” he said on X. Russian President Vladimir Putin has no plans at present to call Trump, according to Kremlin spokesman Dmitry Peskov. “We do not at all think or believe that the attempt to eliminate presidential candidate Trump was organized by the current government, but the atmosphere that this administration created during the political struggle, the atmosphere around candidate Trump provoked what America is faced with today,” he added. Maria Zakharova, spokeswoman for the Russian foreign ministry, said earlier Sunday on her Telegram channel that American lawmakers should employ the money they use to supply weapons to Ukraine “to finance the American police and other services which should ensure law and order within the United States.” South African President Cyril Ramaphosa wrote on X that the attempted assassination of Trump “is a stark reminder of the dangers of political extremism and intolerance.” Ramaphosa also voiced his hope that “the citizens and leaders of America will have the fortitude and sagacity to reject violence and seek peaceful solutions.” Slovak Prime Minister Robert Fico, who survived an assassination attempt in May, condemned the shooting in a Facebook post. He drew direct parallels between the two incidents, suggesting the attack on Trump was the result of a campaign by his political opponents. Taiwan’s president, Lai Ching-te, said on X his thoughts and prayers are with Trump, adding that political violence of any form is never acceptable “in our democracies.” Turkish President Recep Tayyip Erdogan condemned the shooting on X, offering his good wishes to Trump, his family and supporters. He said he believed “the investigation into the attack will be conducted effectively” so as not to undermine the US elections. European Commission President Ursula von der Leyen said on X she was deeply shocked by the shooting, adding that political violence has no place in democracy. Also on X, Ukrainian President Volodymyr Zelenskyy said he was appalled to learn about the shooting, saying such violence has no justification. He added he was relieved to learn that Trump is safe. Zelenskyy extended his wishes for strength to everyone who was horrified by the event. The UAE’s Ministry of Foreign Affairs condemned the attack on Trump, describing it as “a criminal and extremist act.” U.K. Prime Minister Keir Starmer said on X that he was appalled by the “shocking scenes,” and sent his best wishes to Trump and his family. “Political violence in any form has no place in our societies,” he said. British lawmaker Nigel Farage, a friend of Trump’s, sought to pin much of the blame on the “mainstream media” that he claimed opposed the former president. He told the BBC that it was a “horrendous” incident but somehow he was not shocked by it. In a statement, the Vatican expressed its concern over “last night’s episode of violence, which hurts people and democracy, causing suffering and death.” Pope Francis didn’t mention the apparent assassination attempt in his weekly prayers earlier. Venezuelan President Nicolás Maduro condemned the attack during a campaign event in the town of Guacara. “We have been adversaries, but I wish President Trump health and long life, and I repudiate the attack,” Maduro added. Associated Press journalists around the world contributed to this report.",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nThe Secret Service said it killed the suspected shooter who attacked from&#8230;\n\n\nThis Post: Responses of Global Leaders to Trump&#8217;s Assassination Attempt at a Rally first appeared on Internewscast Journal",
			"url": "https://internewscast.com/news/responses-of-global-leaders-to-trumps-assassination-attempt-at-a-rally/",
			"image": "https://media.tegna-media.com/assets/CCT/images/b2438ebe-3dd5-4185-af04-c37db8e6b921/20240714T125937/b2438ebe-3dd5-4185-af04-c37db8e6b921_750x422.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:46:50",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.154
		},
		{
			"id": 251757320,
			"title": "Disgraced ex- Illinois Gov. Blagojevich now a ‘Trump-o-crat’ with praise for his ‘his new Republican Party’",
			"text": "Disgraced ex-Democratic Illinois Gov. Rod Blagojevich said he’s a proud turncoat who backs former Republican President Donald Trump’s comeback for the White House. “I call myself a ‘Trump-o-crat’ … His new Republican Party is the party that now stands for and fights for the average working person in America,” Blagojevich, a convicted felon, said during an interview Sunday on 770 WABC’s “The Cats Roundtable.” But Blagojevich — known in political circles as “Blago” — said he’s also personally returning the favor to Trump, who in February 2020 commuted his 14 year sentence for political corruption — fingered for selling the Senate seat Barack Obama vacated after he was elected president in 2008 to the highest bidder. He maintained what he did was not criminal, and President Obama refused to commute his sentence. Trump, who had Blagojevich on his “Apprentice Show” before running for president, set him free. “Who would have thought? A Republican president, Donald Trump, God bless him, would reach in to rescue me, a Democrat governor — restore my freedom and reunite me with my two daughters and my wife, Patti,” Blagojevich said. Looking back on his past legal woes, he said he was the first governor in the US to endorse Obama. “He and I came up in politics in Chicago at the same time, the mid 1990s … I became governor. He became senator two years later,” he said. “Then he became president-elect. He sent an emissary to me, a union boss who was friendly to both of us … to talk about a political deal in exchange for the appointment of a Senate candidate [Obama] wanted. There was nothing illegal on Obama‘s part. And there was nothing illegal on my part. But he went to the White House for eight years. And I went to the big house for eight years.” He joked that it was “way better” being governor than “inmate #40892424.” “I fought back. What they did to me was the beginning of what they’re doing to President Trump … They learned from what they did [to me] and what they got away with: weaponizing prosecutors, criminalizing things that are legal and routine in politics,” Blagojevich said. He urged Americans to “vote in this election to stop this weaponization of prosecutions. They’re destroying the rule of law and the constitution. This is the politics of Russia and the Soviet Union and banana republics. This is not the politics of what Abraham Lincoln said was ‘The last best hope on Earth’ – the right of the people to choose their [leaders] in open elections that are free and fair,” Blago said. Meanwhile, Blagojevich said there’s no question that Obama is using his vast influence in the Democratic Party to try to force the 81-year-old Biden, his vice president for eight years, off the ticket instead of running for re-election. “President Obama is working behind the scenes, using his influence, which is very substantial and significant in the Democratic Party, with constituency groups in the Democratic Party that have a tremendous amount of influence like movie stars. People like George Clooney,” he said. “He’s [Obama] doing what he can to encourage President Biden to get out of the race because the Democrats are very afraid that Trump is going to beat Biden; and they feel like they have a better chance of winning if Biden isn’t there … Harry Truman used to say – one of the great Democrat presidents – ‘If you want a friend in Washington, get a dog.’ This is just another example of how cut-throat politics is, and how backstabbing is oftentimes the rule, not the exception.”",
			"summary": "Disgraced ex-Democratic Illinois Gov. Rod Blagojevich said he's a proud turncoat who backs former Republican President Donald Trump's comeback for the White House.",
			"url": "https://nypost.com/2024/07/14/us-news/disgraced-ex-illinois-gov-blagojevich-now-a-trump-o-crat-with-praise-for-his-his-new-republican-party/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-uod6y4mq3-1720996154869.jpg?quality=75&strip=all&1720981836&w=1200",
			"video": "https://cdn.jwplayer.com/videos/376vuexT-RyIcpnTz.mp4",
			"publish_date": "2024-07-14 22:44:39",
			"author": "Carl Campanile",
			"authors": ["Carl Campanile"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": 0.005
		},
		{
			"id": 251757168,
			"title": "Shannon Bream from Fox News Shares Experience Anchoring During Intense Moments of Trump Rally Shooting: “Striving to Remain Calm was my Priority.”",
			"text": "Fox News was carrying Donald Trump‘s rally in Butler, PA, live at 6:11 p.m. ET when suddenly, chaos ensued as the former president grabbed his ear, then plunged to the ground and Secret Service pounced on top of him for protection. Shannon Bream, the host of Fox News Sunday and legal correspondent, had been in Milwaukee, anchoring in the lead up to the rally, and was still in the chair as she watched on a monitor what was unfolding. “We had just tossed to the live rally, and we all stayed in place just to be ready for any kind of coverage wrapping out of the rally, and very quickly, as I was sitting there just maybe five, six minutes into the speech, I heard some popping,” Bream told Deadline in an interview today. “I saw the president go behind the podium. I heard screaming, and just motioned to all of us who were still there in coverage mode, ‘Wait a minute, what’s happening? What’s happening?’ Because we had all kind of taken just a little bit of a breather.” Producers were telling her in her earpiece, ‘We got to take this live.” At about 6:12 p.m. ET, forty-four seconds after the first popping sounds were heard, Bream came on the air and told viewers, “OK, we are watching live at a rally in Butler, PA, where former President Trump was speaking on stage. There has been some kind of disturbance that clearly sent law enforcement and Secret Service into motion, immediately jumping around the former president in a protective mode.” At that point, Trump was still on the ground and shielded by Secret Service agents. Bream then told viewers, “This does not look good. I’m going to be honest with you, from what we can see right here, it looks like they are attempting to movie him out, that he may have been injured.” Trump then got up and raised his fist in the air before he was ushered into an SUV and whisked away. Bream soon after went to Alexis McAdams, the Fox News correspondent who was at the rally. “You just try to be as measured as possible, because you see things happen very quickly,” Bream told Deadline of the moment. She said that when the chaotic situation started to unfold, her “first thought was, ‘Just try to stay calm. I mean, my heart was pounding out of my chest, it felt like in those first few moments, but I knew we couldn’t rely on our emotions or what we had seen just very quickly. We needed to give it time to settle, to find out what his condition was, to rewatch that video and have another look with a few minutes of calming down. So the thought was, ‘Let’s just say what we know. Let’s keep the tone calm.’ This is shocking for everybody who is watching it. It’s a shock to the country, and let’s just take a breath.” Bream said that only a little bit later, when they got a couple of witnesses on the phone, including a firearms owner, could they say that it appeared that shots were heard. “At the beginning, we have to assume we don’t know what we don’t know,” she said. “It’s telling people what we have seen, what we can verify, and as we play that tape back, and sticking to that. It’s very easy when your heart is pounding, when you are emotional, to want to try to figure out what’s happening and describe it as quickly as you can, but keeping your head about you is the most important thing.” She said that as she was watching what was happening, she was particularly struck by the still photographers at the base of the rally stage, holding up their cameras and trying to get pictures, “knowing they probably weren’t sure what they were going to capture at that moment. …I remember thinking it was very gutsy of them to be doing their jobs and capturing this moment in history. And we’re always worried about all of the crews who are in the middle of these potentially dangerous situations.” Bill Hemmer joined Bream on the air. Only when she got off the air about four hours later did she see that she had dozens of texts from friends and family saying, “We’re praying for you. Just stay calm, and I really attribute their prayers to helping me be able to just be steady.” Security in Milwaukee, the site of the Republican convention, already was tight, but “definitely went to another level today,” Bream said. She added, “I think everybody is more than willing to put up with the delays in the additional screenings because that’s just the moment we are at in history. This place was blanketed before, but we have new barriers up today, and I would assume that will continue to increase every day until we get to the big speeches of the vice presidential nominee Wednesday, the former president being on stage on Thursday, and so we just have to go with the flow.”",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nFox News was carrying Donald Trump‘s rally in Butler, PA, live at&#8230;\n\n\nThis Post: Shannon Bream from Fox News Shares Experience Anchoring During Intense Moments of Trump Rally Shooting: &#8220;Striving to Remain Calm was my Priority.&#8221; first appeared on Internewscast Journal",
			"url": "https://internewscast.com/news/shannon-bream-from-fox-news-shares-experience-anchoring-during-intense-moments-of-trump-rally-shooting-striving-to-remain-calm-was-my-priority/",
			"image": "https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Fox-News-Shannon-Bream-Talks-About-Anchoring.png",
			"video": null,
			"publish_date": "2024-07-14 22:42:55",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"source_country": "us",
			"sentiment": -0.496
		},
		{
			"id": 251757508,
			"title": "Firefighter killed at Trump rally is remembered by his uncle, ex-Menifee Councilman Tom Fuhrman",
			"text": "On any given Sunday, former fire chief Corey Comperatore could be found at his parents’ Pennsylvania home with his two Doberman Pinschers. “Corey was there every week doing yard work, climbing ladders, cleaning out their gutters. He was always helping others,” says former Menifee city Councilman Tom Fuhrman, Comperatore’s uncle. Fuhrman was shocked to hear that Comperatore, a former fire chief at the Buffalo Township Volunteer Fire Company in Pennsylvania, was shot and killed at Donald Trump’s rally in Butler, Pennsylvania on Saturday evening. Comperatore, the stepson of Fuhrman’s brother, was shielding his wife and two daughters with his body when the gunfire rang out at the rally. “He was a father. He was protecting his family from the bullets that were being fired,” President Biden later said in a speech, extending his condolences to Comperatore’s family. Pennsylvania Gov. Josh Shapiro said Comperatore “died a hero.” Fuhrman said half a dozen of his family members had been attending the rally. After he saw news of the attempted assassination on television, he called around, anxiously awaiting updates. At 10 p.m. on Saturday, Fuhrman’s daughter called him to tell him that Comperatore was identified as the man who was killed. The shooting “claimed the life of my brother,” Dawn Comperatore Schafer wrote in a Facebook post. “The hatred for one man took the life of the one man we loved the most.” Her brother had just turned 50 and had “so much life left to experience. This feels like a terrible nightmare but we know it is our painful reality,” she wrote. “Everyone is emotionally affected and feeling the pain,” Fuhrman said of his family. “I know what it’s like to lose a son, so my heart goes out to my brother and his family. “You think about them every day, and they stay with you forever.”",
			"summary": "“Everyone is ... feeling the pain,” Fuhrman said of his family about losing Corey Comperatore.",
			"url": "https://www.ocregister.com/2024/07/14/firefighter-killed-at-trump-rally-is-remembered-by-his-uncle-ex-menifee-councilman-tom-fuhrman/",
			"image": "https://www.ocregister.com/wp-content/uploads/2024/07/81409847_1720966855763817_r-1-1.jpg?w=1024",
			"video": null,
			"publish_date": "2024-07-14 22:40:40",
			"author": "Micaela Ricaforte",
			"authors": ["Micaela Ricaforte"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.186
		},
		{
			"id": 251758464,
			"title": "Wisconsin Gov. Evers asking for guns to be banned near RNC convention after Trump shooting",
			"text": "Gov. Tony Evers (D-WI) is asking the Secret Service to reconsider its decision to allow firearms within the “soft perimeter” of the Republican National Committee’s convention in Milwaukee following the shooting of former President Donald Trump on Saturday. The Democratic governor believes it is “exceedingly important that additional steps be taken to keep convention participants and attendees, law enforcement and the local community safe,” a source with knowledge of the discussion told the Milwaukee Journal Sentinel. The convention will begin on Monday and last until Thursday at Fiserv Forum in Wisconsin’s largest city. Security measures have come under the microscope after the presumptive Republican presidential nominee was shockingly shot on Saturday during a rally in Pennsylvania. Trump was shot in the ear and later described as “fine” after being attended to by doctors; one rallygoer was killed in the shooting and two others were injured. While the Secret Service has been scrutinized for the shooting, the agency has maintained that there will be “no change” to its planned protocol for the RNC convention this week. Evers’s request for no firearms in the area will reportedly be relayed to the Secret Service. The FBI has identified 20-year-old Thomas Matthew Crooks as the shooter. The shooting is being investigated as a possible assassination attempt of the former president, as well as a possible domestic terrorist attack. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER President Joe Biden has condemned the shooting and called for an independent investigation. He also said he asked the Secret Service to “review all security measures” for the RNC in Milwaukee. Evers had previously issued an executive order allowing city, state, and federal officials to compile resources before the convention to react to potential emergencies and large-scale events.",
			"summary": "Gov. Tony Evers (D-WI) is asking the Secret Service to reconsider its decision to allow firearms within the &#8220;soft perimeter&#8221; of the Republican National Committee&#8217;s convention in Milwaukee following the shooting of former President Donald Trump on Saturday. The Democratic governor believes it is &#8220;exceedingly important that additional steps be taken to keep convention participants [&#8230;]",
			"url": "https://www.washingtonexaminer.com/news/campaigns/3082055/evers-asking-guns-banned-near-rnc-convention-trump-shooting/",
			"image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Tony-Evers-RNC.webp",
			"video": null,
			"publish_date": "2024-07-14 22:40:15",
			"author": "Conrad Hoyt",
			"authors": ["Conrad Hoyt"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.342
		},
		{
			"id": 251757464,
			"title": "U.S. Secret Service faces scrutiny after Trump shooting",
			"text": "WASHINGTON >> The U.S. Secret Service was under intense scrutiny on Sunday after a gunman managed to evade its agents and open fire on former President Donald Trump at a political rally, with Republican leaders vowing swift investigations and President Joe Biden calling for an independent review. The gunman, a 20-year-old Pennsylvania man, injured Trump and killed a rally attendee from a rooftop perch around 150 yards (140 m) from the stage where the former president was speaking in Butler, Pennsylvania, near Pittsburgh, officials said. Trump, 78, who like other former presidents has lifetime protection by the Secret Service, was swarmed by agents who then rushed him away. Agents killed the shooter, identified by the FBI as Thomas Matthew Crooks of Bethel Park, Pennsylvania, and an AR-15-style semiautomatic was recovered near his body, officials said. Trump says a bullet hit his upper right ear but that he is otherwise doing well and would travel to the Republican National Convention in Milwaukee, where he will receive his party’s presidential nomination. Mike Johnson, speaker of the Republican-controlled U.S. House of Representatives, said panels in the chamber will call officials from the Secret Service, the Department of Homeland Security and the FBI for hearings. “The American people deserve to know the truth,” Johnson said. The House oversight panel called Secret Service Director Kimberly Cheatle to testify on July 22. The Secret Service, tasked with protecting current and former presidents, is part of the Department of Homeland Security. The department’s Office of the Inspector General is responsible for conducting oversight of Secret Service operations. A spokesman for the inspector general’s office did not respond to questions about whether it would launch its own inquiry. The FBI said in a statement following the shooting that it would be the lead federal law enforcement agency in the investigation into the shooting. In a statement, Secret Service spokesman Anthony Guglielmi said the agency had “added protective resources (and) technology (and) capabilities as part of the increased campaign travel tempo.” Guglielmi denied accusations that the agency had rebuffed requests for more security resources from Trump’s team. In televised remarks, Biden, 81, said that Trump, as a former president who is the Republicans’ nominee for president in the Nov. 5 election, already receives a heightened level of security. “I’ve been consistent in my direction of the Secret Service to provide him with every resource, capability and protective measure necessary to ensure his continued safety,” Biden, a Democrat, said. He said he had “directed an independent review of the national security at yesterday’s rally to assess exactly what happened,” the results of which will be shared with the public. On Sunday, Democratic Congressman Ritchie Torres said that he and Republican Congressman Mike Lawler are planning to introduce a bill that would call for enhanced security for all presidential candidates. ‘FULL RIFLE KIT’ Paul Eckloff, a former Secret Service agent who retired in 2020, said agents would have surveyed all the rooftops with a line of sight ahead of time. “This person either concealed themselves until they became a threat, or were not a threat until they revealed their weapons,” said Eckloff. In the moments after Trump was injured, the former president was quickly surrounded by Secret Service personnel who formed a human shield, while heavily armed agents in body armor and toting rifles also took to the stage and appeared to scan the area for threats. Trump was whisked by the agents to a black SUV, and taken to a local hospital, according to the campaign. Trump supporters blasted the Secret Service as having failed to protect the former president. Billionaire Elon Musk called for the agency’s leadership to resign. “How was a sniper with a full rifle kit allowed to bear crawl onto the closest roof to a presidential nominee,” asked conservative activist Jack Posobiec on social media. “There will be an intensive review” of the incident and “there’s going to be a massive realignment,” said Joseph LaSorsa, a former Secret Service agent who served on the presidential detail. “This cannot happen.” SECURING TRUMP RALLIES During most of Trump’s campaign stops, local police aid the Secret Service in securing the venue. Agents from other agencies within the Department of Homeland Security, such as the Transportation Security Administration, occasionally help. Many Trump rallies feature thousands of audience members, take place in the open air and last for hours. Before the event, agents scan the venue for bombs or other threats, and Trump invariably arrives in a fortified motorcade. Law enforcement officials typically put up barriers as a perimeter, and require all attendees to go through a metal detector to enter the venue. Armed protective agents search all attendees’ bags and even wallets. Many rallygoers are patted down by hand.",
			"summary": "WASHINGTON >> The U.S. Secret Service was under intense scrutiny on Sunday after a gunman managed to evade its agents and open fire on former President Donald Trump at a political rally, with Republican leaders vowing swift investigations and President Joe Biden calling for an independent review.",
			"url": "https://www.staradvertiser.com/2024/07/14/breaking-news/u-s-secret-service-faces-scrutiny-after-trump-shooting/",
			"image": "https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_2024-07-14T113245Z_1554995645_RC2MU8AMR781_RTRMADP_3_USA-ELECTION-TRUMP-UPHEAVAL.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:35:00",
			"author": "Reuters",
			"authors": ["Reuters"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": 0.006
		},
		{
			"id": 251757076,
			"title": "Rally Held by Supporters of Donald Trump in Chicago Day After Assassination Attempt",
			"text": "CHICAGO (WLS) — In Chicago Sunday, Donald Trump supporters held a rally in Columbus Park a day after the assassination attempt on the former president. They called for a change in rhetoric surrounding the 2024 presidential election. ABC7 Chicago is now streaming 24/7. Click here to watch There is no denying tensions are running high all over the country Sunday, and that includes Chicago, where despite calls to tone down the rhetoric that led to Saturday’s assassination attempt, a Trump rally on the West Side was interrupted by opponents. The rally hosted by Trump supporters in the Austin neighborhood was briefly interrupted after a verbal altercation with those who did not welcome their presence led to a person pulling a weapon. Police, who were monitoring the rally nearby, responded immediately and the situation was diffused. The whole thing unfolding just moments after organizers, still shaken by the apparent attempt on the former president’s life, called for a de-escalation in the rhetoric that has divided the nation. “We want to bring people together and hopefully people right now see us in an area where some people may like Trump, some people may not, but we’re hoping to have the conversations and bring people together,” Trump supporter Osiris Sumler said. “Because it’s too much. I don’t hate democrats. I don’t want them to hate us.” The rally was a small one, bringing together around 20 Trump supporters. Silvia Sainz was seated behind the former President during his rally last month in Racine. The shooting made her think twice about coming out, but she said it was Trump’s response, moments after he was injured, that spurred her on. “When I saw the picture circulating of him saying, ‘fight, fight, fight,’ I felt the need I had to be here,” Sainz said. It is that display of strength that some political scientists now believe will help Trump politically in the months to come, especially as the Republican National Convention gets underway Monday in Milwaukee. READ MORE | No changes made to RNC security plan after Trump assassination attempt, Secret Service says “For Biden and the Democrats, this is immobilizing,” DePaul University Professor Wayne Steger said. “This absolutely freezes it. How do you critique Trump? Even during the convention, when he’s been so victimized.” Beyond the politics, however, is the very real concern that Saturday’s assassination attempt could lead those who blame Democrats and the President to carry out further acts of violence. “It is an escalation that continued political violence is certainly not out of the question, and tit-for-tat retaliations,: Steger said. “That is a scary prospect.” The Chicago Police Department issued a statement following the attempted assassination: “The Chicago Police Department continues to monitor the situation that unfolded in Butler, Pennsylvania as we prepare for the upcoming Democratic National Convention. We have been planning for the convention for more than a year to prepare for anything and everything. As always, CPD will assess and adjust resources as necessary in real-time, based on intelligence and what we are seeing on the ground to protect the entire city. We also remain in constant contact with our federal partners, who we are working closely with, to ensure dignitaries and areas around the convention footprint are secured. We want to remind everyone to please be aware of their surroundings in large gatherings, at work, places of worship, critical facilities and online. If you see something, say something by calling 9-1-1 to report suspicious activity.”",
			"summary": "Internewscast Journal\n\nInternewscast\n\n\nCHICAGO (WLS) &#8212; In Chicago Sunday, Donald Trump supporters held a rally&#8230;\n\n\nThis Post: Rally Held by Supporters of Donald Trump in Chicago Day After Assassination Attempt first appeared on Internewscast Journal",
			"url": "https://internewscast.com/news/us/rally-held-by-supporters-of-donald-trump-in-chicago-day-after-assassination-attempt/",
			"image": "https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Donald-Trump-shooting-Supporters-hold-rally-on.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:34:54",
			"author": "Internewscast",
			"authors": ["Internewscast"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.355
		},
		{
			"id": 251757058,
			"title": "Trump Rally Victim Was A Firefighter, Died Shiedling His Family",
			"text": "The spectator who died in the shooting that targeted Donald Trump at a Pennsylvania rally has been identified as Corey Comperatore, a 50-year-old firefighter and father of two. \"We lost a fellow Pennsylvanian last night, Corey Comperatore,\" the state's governor, Josh Shapiro, told reporters. \"I just spoke to his wife and his two daughters.\" He said the victim was a churchgoing firefighter and an enthusiastic Trump supporter who \"loved his community and most especially...his family.\" Josh Shapiro called Saturday's shooting, in which two other spectators were wounded, \"shocking, for this Commonwealth (state) and the country.\" The other victims have yet to be identified, though NPR news affiliate WESA quoted hospital officials in Pittsburgh as saying both were local men and both remained in critical condition. The shooter, identified as 20-year-old Thomas Matthew Crooks of nearby Bethel Park, was killed by a Secret Service sniper. One of Corey Comperatore's daughters, Allyson, described her father in a Facebook post as \"the best dad a girl could ever ask for,\" someone always ready to help and quick to \"make friends with anyone.\" \"The media will not tell you that he died a real-life super hero,\" she said. \"He threw my mom and I to the ground... (and) shielded my body from the bullet that came at us.\" Josh Shapiro also described Corey Comperatore as \"a hero\" who died protecting his family. He said state flags would be flown at half-staff to honor the victim. \"Corey was an avid supporter of the former president,\" Josh Shapiro added, \"and was so excited to be there last night.\" A GoFundMe page created to raise money for the Comperatore family had received donations of nearly $330,000 as of 3:00 pm. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
			"summary": "The spectator who died in the shooting that targeted Donald Trump at a Pennsylvania rally has been identified as Corey Comperatore, a 50-year-old firefighter and father of two.",
			"url": "https://www.ndtv.com/world-news/trump-rally-victim-corey-comperatore-was-a-firefighter-father-of-2-died-shiedling-his-family-6106855",
			"image": "https://c.ndtvimg.com/2024-07/b7o3uiu_corey-comperatore_625x300_15_July_24.jpeg?ver-20240615.100",
			"video": null,
			"publish_date": "2024-07-14 22:32:07",
			"author": "Bethel Park",
			"authors": ["Bethel Park"],
			"language": "en",
			"catgory": "politics",
			"source_country": "in",
			"sentiment": -0.313
		},
		{
			"id": 251757132,
			"title": "Melania Trump's call to 'ascend above the hate' should be rallying cry for all Americans",
			"text": "Two days before the opening of the Republican National Convention in Milwaukee, an assassination attempt on former President Donald J. Trump shocked the nation. The picture of a bloodied Trump pumping his fist in the air as Secret Service agents rush him off the stage will be indelibly burned into American minds for a very long time. President Trump’s comments on Truth Social the evening of the shooting were calm and thoughtful, thanking the Secret Service and law enforcement, and extending condolences to the families of a rally attendee who was killed and the others who were seriously injured. In a chilling account he wrote, \"I was shot with a bullet that pierced the upper part of my right ear. I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin.\" He had nothing else to say except for a heartfelt, \"GOD BLESS AMERICA!\" BIDEN VOWS SECRET SERVICE WILL PROVIDE TRUMP WITH 'EVERY RESOURCE' TO ENSURE 'CONTINUED SAFETY' I spoke to President Trump on the phone on Sunday, and he told me that bringing the country together was a big part of the message he wanted to deliver now. He mentioned throwing out \"a tough speech on Democrats,\" reworking it to fit his new intention. The last time we faced such a terrifying picture was in 1981, when a gunman tried to assassinate President Reagan. Jerry Parr, the Secret Service agent who shoved Reagan into the car to get him out of danger before he even knew he was injured, once said that being president is dangerous. That would include former presidents. But does it have to be that way? What do we do with our sense of horror? A lesson about that comes from our former first lady Melania Trump. By way of comparison with Mrs. Trump, I couldn’t help thinking about Jackie Kennedy in her blood-soaked pink suit the day JFK was assassinated some 60 years ago. Various people, including Lyndon Johnson, encouraged her to change into clean clothes, but she refused. She said, \"Let them see what they’ve done!\" That anger and desire for retribution is a natural response, but I was struck by the way Mrs. Trump set a tone that was both deeply personal and healing for the nation. MELANIA TRUMP CALLS FOR COUNTRY TO 'REUNITE' FOLLOWING NEAR-ASSASSINATION She began with a moving account of her horror and sorrow. \"When I watched that violent bullet strike my husband, Donald, I realized my life, and Barron's life were on the brink of devastating change. I am grateful to the brave Secret Service agents and law enforcement officials who risked their own lives to protect my husband… \"A monster who recognized my husband as an inhuman political machine attempted to ring out Donald's passion—his laughter, ingenuity, love of music, and inspiration. The core facets of my husband's life—his human side—were buried below the political machine. Donald, the generous and caring man who I have been with through the best of times and the worst of times.\" But then Mrs. Trump pivoted to what we shared as human beings and as a people—and our joint obligation to rise above our political differences. \"Let us not forget that differing opinions, policy, and political games are inferior to love. Our personal, structural, and life commitment - until death - is at serious risk. Political concepts are simple when compared to us, human beings… \"This morning, ascend above the hate, the vitriol, and the simple-minded ideas that ignite violence. We all want a world where respect is paramount, family is first, and love transcends. We can realize this world again. Each of us must demand to get it back. We must insist that respect fills the cornerstone of our relationships, again.\" TRUMP ASSASSINATION ATTEMPT STIRS MEMORIES OF SIMILAR ATTACK ON REAGAN I applaud Mrs. Trump’s dignity and her sense of public responsibility. Many others from both sides of the political frontier have expressed a similar desire. In a Saturday evening editorial, even as the assassination attempt was fresh and emotions were still raw, the Wall Street Journal posed the possibility that the incident could be \"a redemptive political moment.\" While commending President Trump for his \"fortitude,\" the Journal urged him to use the moment as a time to call for unity. DEMS NEED TO STOP WITH 'EXISTENTIAL THREAT' RHETORIC ABOUT TRUMP: FORMER AG BARR \"His opportunity now is to present himself as someone who can rise above the attack on his life and unite the country,\" the Journal wrote. The editors also warned both parties to stop describing the stakes of the election in apocalyptic terms. \"Democracy won’t end if one or the other candidate is elected. Fascism is not aborning if Mr. Trump wins, unless you have little faith in American institutions.\" This point was also expressed by former Attorney General Bill Barr who called upon Democrats to stop referring to President Trump as an existential threat to democracy—a claim he called \"grossly irresponsible.\" It was like a hard jolt to our public consciousness—a wakeup call that asked, \"What are we doing here?\" CLICK HERE FOR MORE FOX NEWS OPINION There has been so much vitriol and demonization in our public debate, and we may have reached a tipping point, when people are finally willing to rein it in. Many voices from both sides of the aisle are echoing that plea. Speaking Saturday night, President Biden called the attack \"sick,\" and stated, \"There’s no place in America for this kind of violence.\" He repeated that message Sunday afternoon, emphasizing, \"Unity is the most elusive goal of all, but nothing is as important as that right now…We’ll debate and we’ll disagree, but we’re not going to lose sight of who we are as Americans.\" President Trump sent a message on Truth Social after Biden’s comments, saying simply, \"UNITE AMERICA.\" Republican Senate Minority Leader Mitch McConnell called the shooting \"a despicable attack on a peaceful rally,\" also stressing, \"Violence has no place in our politics.\" These calls for unity echo what I hear every week on my \"Common Ground\" podcast as I host public officials from both sides of the aisle respectfully debating their differences. But now we are all facing together the question: What would it mean to back up these calls for unity with real action—to make them more than a post-trauma response that pays lip service to the need to come together? CLICK HERE TO GET THE FOX NEWS APP Is there a way to restore civility even as we fiercely debate different positions on the issues? This is a critical moment when we have the choice to do that. As we move into the political convention period with the opening of the Republican Convention on Monday, we can all use that strong reality check from Melania Trump and heed her call to \"ascend above the hate.\" CLICK HERE FOR MORE FROM BRET BAIER",
			"summary": "I applaud first lady Melania Trump’s dignity and her sense of public responsibility following the assassination attempt on her husband Saturday.",
			"url": "https://www.foxnews.com/opinion/melania-trumps-call-ascend-above-hate-should-rallying-cry-all-americans",
			"image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/931/523/Melania-trump.jpg?ve=1&tl=1",
			"video": null,
			"publish_date": "2024-07-14 22:31:27",
			"author": "Bret Baier",
			"authors": ["Bret Baier"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.181
		},
		{
			"id": 251751960,
			"title": "FBI investigating Trump rally attack as potential act of domestic terrorism",
			"text": "BUTLER, Pa. (AP) — Former President Donald Trump called for unity and resilience Sunday after an attempt on his life added fresh uncertainty to an already tumultuous presidential campaign and raised sharp questions about how a gunman was able to open fire from a rooftop near a Pennsylvania campaign rally. A full day after the shooting, the gunman’s motive was still a mystery, and investigators said they believe he acted alone before being fatally shot by Secret Service agents. President Joe Biden ordered an independent security review of the attack, which killed a bystander and critically wounded two others. The FBI was investigating the shooting as a potential act of domestic terrorism. The attack shook the firmament of the American political system, causing a reassessment and a detente — at least temporarily — of the heated 2024 presidential campaign that has grown increasingly vicious. Trump, the presumptive Republican presidential nominee, said the upper part of his right ear was pierced by a bullet. His aides said he was in “great spirits” and doing well, and he headed to Milwaukee to the Republican National Convention that begins Monday. “I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,” he wrote on his social media site. “Much bleeding took place.” In a subsequent social post Sunday, Trump said: “In this moment, it is more important than ever that we stand United, and show our True Character as Americans, remaining Strong and Determined, and not allowing Evil to Win.” The rallygoer who was killed was identified as Corey Comperatore, a former fire chief from the area, according to Pennsylvania Gov. Josh Shapiro, who added that Comperatore “died a hero.” “His wife shared with me that he dove on his family to protect them,” Shapiro said. The two other bystanders who were wounded were listed in stable condition. Biden spoke briefly with Trump and was to address the nation Sunday evening. The president said the country would continue to debate and disagree, but stressed: “We must unite as one nation to demonstrate who we are.” FBI investigates shooting as possible domestic terrorism The FBI identified the gunman as Thomas Matthew Crooks, 20, of Bethel Park, Pennsylvania, which is about 50 miles (80 kilometers) from the scene of the shooting. The gunman had his father’s AR-style rifle and was perched atop a nearby roof when some rallygoers pointed him out to local law enforcement, said two law enforcement officials who spoke to The Associated Press on condition of anonymity to discuss an ongoing criminal probe. A local law enforcement officer climbed to the roof and found Crooks, who pointed the rifle at the officer. The officer then retreated down the ladder, and the gunman quickly fired toward Trump, the officials said. That’s when U.S. Secret Service gunmen shot him, the officials said. Questions abounded about how the gunman could have gotten so close in the first place. Kevin Rojek, the agent in charge of the FBI’s Pittsburgh field office, said “it is surprising” that the gunman was able to open fire on the stage before the Secret Service killed him. Bomb-making materials were found inside both Crooks’ vehicle and at his home. The FBI described the devices as “rudimentary.” His motive remained unclear. Crooks wasn’t on the FBI’s radar, and he was believed to have acted alone. Investigators combed through his social media feeds and his home but found no immediate threatening writing or posts. His family was cooperating. Crooks’ relatives did not return multiple messages seeking comment from the AP. Crooks’ political leanings were also not clear. Records show Crooks was registered as a Republican voter in Pennsylvania, but federal campaign finance reports also show he gave $15 to a progressive political action committee on Jan. 20, 2021, the day President Joe Biden was sworn in as president. The absence of a clear ideological motive added to the deepening questions about the shooting, denying the public any swift or tidy conclusions about the shocking crime. Biden urged Americans to stay patient. “I urge everyone — everyone, please, don’t make assumptions about his motives or his affiliations,” he said. Most serious assassination attempt since 1981 The attack was the most serious attempt to kill a president or presidential candidate since Ronald Reagan was shot in 1981. It drew new attention to concerns about political violence in a deeply polarized U.S. less than four months before the presidential election. FBI Deputy Director Paul Abbate said agents have seen increasingly violent rhetoric online since the rally, along with people posing online as the dead shooter. “We’re also focused on the continuing efforts — which were already substantial, given that they’re national security special events — to conventions in Chicago, in Milwaukee,” he said. Biden on Sunday ordered a security review of operations for the Republican National Convention, which is proceeding as planned. The Secret Service said it was “confident” in the security plan for the RNC, and no additional changes were planned. Biden, who is running against Trump, said the two men had a “short but good” conversation Saturday night. Biden returned to Washington from his Delaware beach home where he met with leaders in the Situation Room about the attack. He said during an address Sunday afternoon that “there is no place in America for this kind of violence.” “We cannot allow this to happen,” Biden said. Yet many Republicans quickly blamed the violence on Biden and his allies, arguing that sustained attacks on Trump as a threat to democracy have created a toxic environment. It’s not clear yet whether Biden will be forced to recalibrate a campaign that’s largely focused on Trump as a threat to democracy. It is a situation the U.S. has not seen since Teddy Roosevelt was shot a month before the election in 1912 while campaigning to regain the White House as a third-party candidate. A rally disrupted by gunfire Trump was showing off a chart of border crossing numbers when the gunfire began after 6:10 p.m. Saturday. As the first pop rang out, Trump said “Oh” and raised his hand to his right ear and looked at it, before quickly crouching to the ground behind his lectern. The people in the stands behind him also crouched as screams rang through the crowd. Someone could be heard near the microphone saying, “Get down, get down, get down, get down!” as agents rushed to the stage. They piled atop the former president to shield him with their bodies as other agents took up positions on stage to search for the threat. Afterward, voices were heard saying, “Shooter’s down” several times, before someone asked, “Are we good to move?” and “Are we clear?” Then someone ordered, “Let’s move.” Trump got to his feet moments later and could be seen reaching with his right hand toward his face, which was streaked with blood. He then pumped his fist in the air and appeared to mouth the word “fight” twice to his crowd of supporters, prompting loud cheers and then chants of “USA. USA. USA.” His motorcade left the venue moments later. Video showed Trump turning back to the crowd and raising a fist right before he was put into a vehicle. Witnesses heard multiple gunshots and ducked for cover When the firing began, “everybody went to their knees or their prone position, because we all knew. Everyone becoming aware of the fact this was gunfire,” said Dave McCormick, the Republican candidate for U.S. Senate in Pennsylvania, who was sitting to Trump’s right on stage. As he saw Trump raise his fist, McCormick said, he looked over his shoulder and noticed someone had been hit while sitting in the bleachers behind the stage. Eventually, first responders were able to carry the wounded person out of a large crowd so he could get medical care, McCormick said. Reporters at the rally heard five or six shots, and many ducked for cover, hiding under tables. After the first two or three bangs, people in the crowd looked startled, but not panicked. An AP reporter at the scene reported the noise sounded like firecrackers at first or perhaps a car backfiring. When it was clear the situation had been contained and Trump would not return to speak, attendees started filing out of the venue. Police soon told everyone to leave the venue, and Secret Service agents described the site as “a live crime scene.” Republican Rep. Mike Kelly, who represents the area where the shooting occurred, attended the rally with his wife and grandchildren and was just behind Trump when he was wounded. Kelly said he was “in a state of bewilderment of how and what has happened to the United States of America.” “I just wish people — tone it down,” he said. “Quit trying to find, to blame somebody. The blame lies somewhere in the psyche of America.” ___ Colvin, Balsamo and Price reported from New York. Long reported from Washington. Tucker reported from Westport, Connecticut. Associated Press writers Will Weissert, Michael Biesecker, Alanna Durkin Richer, Lisa Mascaro and Tara Copp in Washington, and Marc Levy in Harrisburg, Pennsylvania, contributed to this report. (Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)",
			"summary": "BUTLER, Pa. (AP) — Former President Donald Trump called for unity and resilience Sunday after an attempt on his life added fresh uncertainty to an...",
			"url": "https://whdh.com/news/fbi-investigating-trump-rally-attack-as-potential-act-of-domestic-terrorism/",
			"image": "https://whdh.com/wp-content/uploads/sites/3/2024/07/trump.jpg?quality=60&strip=color",
			"video": null,
			"publish_date": "2024-07-14 22:31:14",
			"author": "Associated Press,Owen Boss",
			"authors": ["Associated Press", "Owen Boss"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.087
		},
		{
			"id": 251751830,
			"title": "Trump: Why I Chanted 'Fight, Fight, Fight' after Shooting",
			"text": "Even amidst bloody chaos at his campaign rally on Saturday, Donald Trump felt it was necessary to urge his followers to “fight, fight, fight” as a way to remind them of the MAGA mission that propelled Trump to the White House in 2020 and may return him there in November. In an interview with CNBC’s Joe Kernan, co-host of Squawk Box, Trump on Sunday spoke for the first time about his iconic fist-pumping moment following the shooting rampage “He thought it was essential to get out the message at that moment to continue to fight to make America great,” Kernen posted on X after his interview.",
			"summary": "Jabin Botsford/The Washington Post via Getty ImagesEven amidst bloody chaos at his campaign rally on Saturday, Donald Trump felt it was necessary to urge his followers to “fight, fight, fight” as a way to remind them of the MAGA...",
			"url": "https://nation.lk/online/trump-why-i-chanted-fight-fight-fight-after-shooting-270788.html",
			"image": "https://nation.lk/online/site/assets/img/broken.gif",
			"video": null,
			"publish_date": "2024-07-14 22:30:03",
			"author": null,
			"language": "en",
			"source_country": "lk",
			"sentiment": 0.057
		},
		{
			"id": 251751878,
			"title": "What We Know About The Attempted Assassination Of Donald Trump",
			"text": "Share to Facebook Share to Twitter Share to Linkedin Topline An assassination attempt on former President Donald Trump has led to increased calls for protection of presidential candidates, demands to investigate the Secret Service’s handling of the incident and pleas from leaders on both sides of the aisle to abandon vicious rhetoric and decry political violence, as questions remain about the shooter’s motive and the impact the historic event will have on the 2024 presidential race. Republican presidential candidate Donald Trump speaks during a campaign rally in Butler, Pa on ... [+] Saturday, July 13, 2024. The Washington Post via Getty Images Key Facts Trump, 78, was shot shortly after 6 p.m. Saturday when a lone gunman fired several shots from the roof of a building outside his campaign rally, grazing the former president, killing a supporter and seriously injuring two other rally attendees before the shooter was killed by Secret Service agents. Get Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here. How Badly Injured Was Donald Trump? A bullet \"pierced\" the top of Trump’s right ear, he said late Saturday, and photos showed the top of his ear bloodied with streaks of blood on the right side of his face. Secret Service spokesperson Anthony Guglielmi was quick to confirm the former president was “safe” after the shooting. Trump was taken to Butler Memorial Hospital for evaluation and was released before flying to New Jersey overnight. Donald Trump Jr. shortly after the shooting said his father was \"doing fine.\" Trump's former White House doctor, Rep. Ronny Jackson, R-Texas, flew to New Jersey on Sunday morning and told The New York Times that Trump “wasn’t the least bit flustered.” Who Was Thomas Matthew Crooks, The Apparent Shooter? Crooks, 20, was a registered Republican with no criminal history, according to The New York Times. He graduated from Bethel Park High School, about an hour from the rally site in Butler, Pennsylvania, in 2022 and worked as a dietary aid for a local nursing and rehabilitation center. No motive has been identified by law enforcement officials, and President Joe Biden on Sunday asked the public to “not make assumptions.” The FBI on Sunday said Crooks is believed to have acted alone, and is treating the matter as a potential case of domestic terrorism. Who Was Corey Comperatore, The Man Killed At The Trump Rally? Comperatore, a father and husband, was shot and killed at Trump's rally Sunday. He was a 50-year-old former volunteer fire chief and father of two daughters whose family said he died while shielding his wife and daughter from the gunfire. Dawn Comperatore Schafer, Comperatore's sister, told The New York Times his family found out about his death through the news. He was remembered as a \"family man\" who loved to fish and was hailed by Gov. Josh Shapiro of Pennsylvania, a Democrat, as \"the very best of us.\" What Do We Know About The Others Injured At The Rally? The two people who were seriously injured were in critical but stable condition as of Sunday afternoon. They were identified by local police as David Dutch, 57, of New Kensington, Pennsylvania, and James Copenhaver, 74, of Moon Township, Pennsylvania. They are being treated at Allegheny General Hospital in Pittsburgh. Jackson tweeted Saturday that his nephew was among those with minor injuries and told Fox News a bullet grazed his nephew’s neck at the rally. Jackson said his nephew is doing well. How Could The Trump Shooting Have Happened? The Secret Service shot Crooks on top of a manufacturing plant north of the Butler Farm Show grounds, where the rally was held. The roof was fewer than 200 yards from where Trump was speaking, the Associated Press reported, and calls for an investigation into how a gunman could have gotten so close have been echoed from both sides. The Secret Service has not commented on the circumstances of the shooting other than to say it is investigating the incident. Anthony Guglielmi, spokesperson for the Secret Service, said the agency added \"protective resources, technology and capabilities\" to the Trump campaign ahead of the shooting. Secret Service Director Kimberly Cheatle has been called to testify before the House Oversight Committee on July 22. The Secret Service has an operating budget of $3 billion. What False Information Has Been Spreading Online? Videos were posted on TikTok, X, Instagram, Facebook, YouTube and other social media platforms Sunday of a person falsely claiming to be the Trump shooting suspect and speculating on his motives, which Biden on Sunday said are still unclear. BBC Verify, which combats misinformation online, has said the man in the videos and photos is not the shooter. Other false posts, including one said to be written by a Secret Service agent who was ordered not to fire on Crooks, have also been circulating since the shooting. There is no evidence an actual Secret Service agent penned the post. Conspiracy theories and other unverified claims spread quickly in the wake of Trump's assassinaton attempt, including those blaming the so-called deep state for the attack. What Has Trump Said About The Shooting? Trump took to Truth Social on Saturday night and again Sunday morning to thank the Secret Service for its response and express condolences to the victims and the family of the man killed. He called on his supporters to \"remain resilient in our Faith and Defiant in the face of Wickedness\" and confirmed he would be appearing and speaking as scheduled at this week's Republican National Convention. His latest post, which went up at around 3 p.m., said \"UNITE AMERICA!\" What Has Biden Said About The Shooting? The president first addressed the nation Saturday night, calling the attack “sick” and saying, “There's no place in America for this kind of violence.” He echoed those comments in a short speech from the White House on Sunday afternoon in which he said “there is no place in America for this kind of violence or any violence for that matter. An assassination attempt is against everything we stand for as a nation… We cannot allow this to happen.” Biden ordered an independent review of the shooting to determine how it was possible for a lone gunman to fire shots at a presidential candidate. He said the results of that investigation will be released to the public. Biden will speak again from the Oval Office at 8 p.m. ET on Sunday. What Does The Trump Assassination Attempt Mean For The Republican National Convention? The convention, set to start Monday in Wisconsin, is expected to proceed as scheduled. Trump on Sunday said he’d considered delaying his trip to Milwaukee by two days but ultimately stuck to the original schedule and left at 3:30 p.m. ET on Sunday. Trump is expected to formally accept the Republican nomination for president at the convention and announce his vice presidential pick. Other speakers for the convention include former Fox News host Tucker Carlson, Donald Trump Jr., South Dakota Gov. Kristi Noem, Sen. J.D. Vance, R-Ohio, Sen. Marco Rubio, R-Fla., Sen. Tim Scott, R-S.C., and North Dakota Gov. Doug Burgum. Vance, Rubio, Scott and Burgum are considered the top contenders for Trump’s running mate pick. Biden said he’s directed the head of the Secret Service to review “all security measures” for the convention. The Democratic National Convention is scheduled for mid August. Further Reading ForbesTrump Assassination Attempt: Biden Says 'No Information' On Motive, Calls For Independent Investigation Into Rally Shooting (Live Updates)By ForbesExplosive Materials Found In Car Of Suspected Trump ShooterBy ForbesFake Videos Purporting To Be Dead Trump Shooter Are Spreading On Social MediaBy ForbesThe Secret Service Has Access To More Money Than EverBy ForbesTrump Assassination Attempt: Former President Calls For Unity And Suggests He'll Still Speak At GOP ConventionBy Follow me on Twitter. Send me a secure tip. Mary Whitfill Roeloffs Following Editorial Standards Print Reprints & Permissions",
			"summary": "Two people remain in critical condition as investigators dive into how a lone gunman was able to shoot at a former president during a campaign stop in Butler, Pennsylvania.",
			"url": "https://www.forbes.com/sites/maryroeloffs/2024/07/14/what-we-know-about-the-attempted-assassination-of-donald-trump/",
			"image": "https://imageio.forbes.com/specials-images/imageserve/66944d51478306d3155aa5c0/0x0.jpg?format=jpg&crop=2999,1686,x0,y306,safe&height=900&width=1600&fit=bounds",
			"video": null,
			"publish_date": "2024-07-14 22:29:14",
			"author": "Forbes Staff,Mary Whitfill Roeloffs",
			"authors": ["Forbes Staff", "Mary Whitfill Roeloffs"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.191
		},
		{
			"id": 251757038,
			"title": "Volunteer firefighter killed at Trump rally died shielding wife and daughter from gunfire",
			"text": "The 50-year-old volunteer firefighter killed at the Trump rally died shielding his family from gunfire, according to officials. Corey Comperatore was attending the rally with his wife and two daughters when the attempted assassination of former president Donald Trump unfolded. His daughter Allyson and wife Helen both posted to social media following the event, saying their father and husband died \"the hero he always was\". \"He shielded my body from the bullet that came at us,\" Allyson Comperatore wrote on Facebook. \"He loved his family. He truly loved us enough to take a real bullet for us.\" The family had been eager to attend the event, Mr Trump's final campaign stop before the Republican National Convention. The evening's excitement quickly \"turned into a nightmare\", according to Helen Comperatore, as shots rang out and Mr Comperatore was hit. An emergency room physician at the event said other members of the audience rushed to help Mr Comperatore, lifting him onto a bench to receive CPR. Someone else put pressure on the injury above his ear, but they were unable to find a pulse. \"I want nothing more than to cry on him and tell him thank you,\" Allyson Comperatore wrote online. Mr Comperatore had served as fire chief in the Buffalo Township Volunteer Fire Department. According to local media, word spread quickly about his death. His gear will remain permanently on display at the fire station as a memorial. Fellow firefighter Randy Reamer told the Pittsburgh Tribune-Review: \"He was a great guy. You could learn anything from him. \"There's no-one [else] I would have went into a fire with. He was just great.\" Pennsylvania Governor Josh Shapiro said during a news conference following the shooting that he had spoken to Mr Comperatore's family. \"Corey was the very best of us,\" Mr Shapiro said, describing him as a \"girl dad\" who died protecting his family. \"The Comperatore family … has some very challenging times ahead of them. \"They will have an empty seat at the dinner table for the rest of their lives. We need to make sure that Corey's memory is forever a blessing.\" A GoFundMe created on behalf of Allyson Comperatore has already raised more than $US520,000 ($767,374) in donations. Two other people, identified by state police as David Dutch, 57, and James Copenhaver, 74, were critically injured in the shooting. The two men, both from Pennsylvania, are now in a stable condition and are being treated at Pittsburgh's Allegheny General Hospital. Pennsylvania State Police Commissioner Colonel Christopher Paris said: \"These victims and their families are certainly in our thoughts today.\" The investigation into the shooting is ongoing.",
			"summary": "Corey Comperatore, 50, is dead and two other men are in critical condition following the attempted assassination of Donald Trump. ",
			"url": "https://www.abc.net.au/news/2024-07-15/corey-comperatore-killed-during-trump-rally-shooting/104097448",
			"image": "https://live-production.wcms.abc-cdn.net.au/cecde377795d1c99af5913f2f25eff81?impolicy=wcms_crop_resize&cropH=608&cropW=1080&xPos=0&yPos=0&width=862&height=485",
			"video": null,
			"publish_date": "2024-07-14 22:28:27",
			"author": "Brianna Morris-Grant",
			"authors": ["Brianna Morris-Grant"],
			"language": "en",
			"catgory": "politics",
			"source_country": "AU",
			"sentiment": -0.163
		},
		{
			"id": 251757164,
			"title": "Is Trump Hitler or not?",
			"text": "During a political rally in Butler, Pennsylvania, former President Donald Trump was injured in an assassination attempt that left at least one audience member dead and others critically injured. Trump was seen raising his fist in defiance as he was escorted from the stage amid the chaos, blood dripping from his right ear after he came within just a few inches of joining the list of murdered political figures in U.S. history. While prayers, shock, and outrage exploded across the country, figures on the Left rushed to condemn the attack. Democrat after Democrat released statements rejecting political violence and celebrating Trump’s survival. Rep. Nancy Pelosi (D-CA) thanked God that Trump was safe, Rep. Alexandria Ocasio-Cortez (D-NY) denounced the “horrific incident” as “absolutely unacceptable,” and two hours after the attack President Joe Biden eventually described the act as “sick,” saying that there is “no place in America for this kind of violence.” This is a weird way to talk about a man who is no different than Adolf Hitler, at least according to Democrats. Do they truly believe we are stupid enough to forget their rhetoric after Trump had the audacity to beat Hillary Clinton? Biden, the Democratic Party, and the legacy media have spent years spewing endless propaganda with one goal: to smear Trump and anyone who dares to consider voting for him as Nazis, white supremacists, fascists, deplorables, and even villains from the pages of The Handmaid’s Tale. And while they squeeze out incessant crocodile tears over the nonexistent incitement of violence by Republicans, Democrats have leveraged violent speech in pursuit of power. Specifically, they have painted Trump as a 21st century version of Hitler to win votes. And the media happily played along. “The reich stuff — what does Trump really have in common with Hitler?” the Guardian asked in June. “Trump’s Hitler Fascination Is An Ominous Echo of the 1930s,” Bloomberg warned in April. And just a week ago, a New Republic cover featured Trump adorned with a Hitler mustache under the headline “American Fascism.” But if Trump truly is the reincarnation of one of the most infamous genocidal maniacs in human history, as Democrats have warned for years, why are they suddenly upset that someone failed to protect us from Hitler 2.0? Either they are pro-Hitler, which opens its own can of worms, or it turns out that Trump is not Hitler and they’ve been lying for years for cheap political gain and are only now facing the embarrassing and deadly reality that words can have consequences. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER Neither of these options is good. The gaslighting must end. The hypocrisy must end. The violent rhetoric must end. As for Biden and his team of degenerates, they must explain either why they are sending Hitler their best wishes or why they spent years labeling Trump as the face of American fascism that must be stopped by any means necessary. Ian Haworth is a columnist, speaker, and podcast host. You can find him on Substack and follow him on X at @ighaworth.",
			"summary": "During a political rally in Butler, Pennsylvania, former President Donald Trump was injured in an assassination attempt that left at least one audience member dead and others critically injured. Trump was seen raising his fist in defiance as he was escorted from the stage amid the chaos, blood dripping from his right ear after he [&#8230;]",
			"url": "https://www.washingtonexaminer.com/opinion/3081484/is-trump-hitler-or-not/",
			"image": "https://www.washingtonexaminer.com/wp-content/uploads/2024/07/AP24196753715814-scaled.webp",
			"video": null,
			"publish_date": "2024-07-14 22:27:04",
			"author": "Ian Haworth",
			"authors": ["Ian Haworth"],
			"language": "en",
			"catgory": "politics",
			"source_country": "US",
			"sentiment": -0.503
		},
		{
			"id": 251754030,
			"title": "Marine veteran David Dutch ID’d as one of the 2 men injured in Trump rally shooting",
			"text": "A US Marine veteran was identified as one of the two spectators injured by the sniper who shot and wounded former President Donald Trump at campaign rally in Pennsylvania. David Dutch, 57, of New Kensington, was shot twice when Thomas Matthew Crooks, 20, fired at Trump and his supporters on Saturday, according to the Marine Corps League’s (MCL) Department of Pennsylvania. MCL District 8 vice commandant Matt Popovich broke the news to his fellow Marines on Sunday afternoon as Pennsylvania State Police identified Dutch and 74-year-old James Copenhaver as the two injured rallygoers. “I’m sure everyone has seen the news and are appalled at how divided we have become, Popovich wrote in a Facebook post Sunday. “Well, it has finally hit home to the League.” “It is with great sadness that I report that one of the civilians shot at the rally was one of our own,” he added. “Commandant David Dutch of Westmorland County he is in critical condition shot in the liver and chest. “He has had one surgery and undergoing another this morning,” Popovich continued. “He is currently in an induced coma.” Dutch had been installed as the commandant of the Westmoreland County Marines Corps League Detachment No. 1416 last year, according to local outlet TribLIVE. Pennsylvania State Police Col. Christopher Paris told reporters Sunday afternoon that both Dutch and Copenhaver were listed in stable condition. Follow The Post’s latest stories on the assassination attempt against former President Donald Trump: Trump says he ‘felt the bullet ripping through my skin’ in first statement since assassination attempt Donald Trump urges the nation to not let ‘evil win’ and ‘fear not’ after shooting Gunman behind attempted assassination on Trump had head blown off by Secret Service, sources say; rally-goer killed Trump shooter Thomas Matthew Crooks was loner ‘relentlessly’ bullied in high school: classmate How Trump’s split-second head turn may have saved his life from assassin’s bullet Ex-volunteer fire chief Corey Comperatore ID’d as Trump sniper victim, shielded his daughter from assassin’s bullets Search for Trump shooter’s motive delayed by explosives found in home and car: sources Keep up to date on updates with the Post’s live blog on the assassination attempt on Trump “These victims and their families are certainly in our thoughts today,” Paris said, echoing Popovich’s call for the community to unite in prayers for the injured veteran. Along with the two injured spectators, officials identified Corey Comperatore, 50, as the Trump supporter killed by Crooks on Saturday. Comperatore, a father-of-two and former chief for the Buffalo Township Volunteer Fire Company, died while protecting his wife and daughter from the gunfire, according to his family.",
			"summary": "Marine veteran David Dutch, 57, of New Kensington, was shot twice when Thomas Matthew Crooks, 20, fired at Trump and his supporters on Saturday.",
			"url": "https://nypost.com/2024/07/14/us-news/marine-veteran-david-dutch-idd-as-one-of-the-men-injured-in-trump-rally-shooting/",
			"image": "https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-aw08lobb4-1720995435467.jpg?quality=75&strip=all&1720981074&w=1200",
			"video": "https://cdn.jwplayer.com/videos/YhC6zzj1-RyIcpnTz.mp4",
			"publish_date": "2024-07-14 22:26:42",
			"author": "Ronny Reyes",
			"authors": ["Ronny Reyes"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.265
		},
		{
			"id": 251751880,
			"title": "A Song About The Trump Shooting Is Already Rising On iTunes",
			"text": "Share to Facebook Share to Twitter Share to Linkedin US Republican candidate Donald Trump is seen with blood on his face surrounded by secret service ... [+] agents as he is taken off the stage at a campaign event at Butler Farm Show Inc. in Butler, Pennsylvania, on July 13, 2024. Trump was hit in the ear in an apparent assassination attempt by a gunman at a campaign rally on Saturday, in a chaotic and shocking incident that will fuel fears of instability ahead of the 2024 US presidential election. The 78-year-old former president was rushed off stage with blood smeared across his face after the shooting in Butler, Pennsylvania, while the gunman and a bystander were killed and two spectators critically injured. Musician Tom MacDonald released a song about the event about a day after the attempt called “You Missed,” which bolted toward the top of iTunes. (Photo by Rebecca DROKE / AFP) / QUALITY REPEAT (Photo by REBECCA DROKE/AFP via Getty Images) AFP via Getty Images It’s only been about a day since presidential candidate and former President Donald Trump was shot at a rally, but there’s already a song about the event. Not only has one musician shared his thoughts on the subject in a new tune, but Americans are making it a hit. Tom MacDonald’s just-released song “You Missed” is quickly rocketing up the iTunes chart in America. As of the timing of writing, the track sits at No. 3 after debuting earlier in the day. At the moment, “You Missed” doesn’t have much further to climb before it becomes the bestselling song in America on what is usually considered the most important platform for purchasing individual tunes. Shaboozey leads with “A Bar Song (Tipsy),” which also sits at No. 1 on the Hot 100 at the moment. Eminem’s new collaboration with Jelly Roll, “Somebody Save Me,” is comfortable at No. 2. “You Missed” sees MacDonald venting about his frustrations about the shooting, putting much of the blame for the violence–and what’s wrong with this country, in his eyes–on “the left.” His new song features lines like, “Bitch you missed / Thank God the left can’t aim” and “They don’t want an election, they got so offended by freedom that they just tried killin' the president,” among others. The tune also discusses other politically-charged topics, with MacDonald’s right-leaning bias clearly on display. He raps about transgender rights (“They want men to pretend that they’re feminine”), immigration (“Borders are open to people with felonies / Biden can’t stop ‘em, he don’t have the energy”), and even the validity of scientific facts (“Told us trust the science, but it never made sense to me / Why would we put all our trust in the enemy?”). MacDonald uses language that many would find offensive, but clearly, a large enough population either agrees with or doesn’t mind his comments. The song is rising on the iTunes chart quickly, and if it keeps up its momentum, it could soon replace Shaboozey at No. 1. MORE FOR YOU The Perseid Meteor Shower Begins Today: When To See It At Its Best FBI Believes Trump Rally Shooter Acted Alone: What We Know About Thomas Matthew Crooks Trump Assassination Attempt: Here’s What We Know For years now, MacDonald has found commercial success by releasing songs that touch on hot-button political ideas. His fan base is seemingly almost exclusively conservative and right-wing listeners, and they regularly propel his latest releases to the Billboard charts in momentary bursts of sales activity. He’s sent several songs to the Hot 100 throughout his career, and all are politically-focused. Tunes like “Snowflakes,” “Fake Woke,” and earlier this year, “Facts” with conservative talking head Ben Shapiro have all charted for a short period of time. He’s also earned a number of additional hits on more specific lists, like the Rap Digital Song Sales ranking, as his releases are almost always powered exclusively by purchases. ForbesAnother Pro-Trump Song Hits The Top 10 On The Billboard ChartsBy Hugh McIntyre Following Editorial Standards Print Reprints & Permissions",
			"summary": "Tom MacDonald's new song \"You Missed\" quickly climbed the iTunes chart in America following an apparent assassination attempt on presidential candidate Donald Trump.",
			"url": "https://www.forbes.com/sites/hughmcintyre/2024/07/14/a-song-about-the-trump-shooting-is-already-rising-on-itunes/",
			"image": "https://imageio.forbes.com/specials-images/imageserve/66944f8e3852735e0a3749d1/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
			"video": null,
			"publish_date": "2024-07-14 22:24:43",
			"author": "Hugh McIntyre,Senior Contributor",
			"authors": ["Hugh McIntyre", "Senior Contributor"],
			"language": "en",
			"source_country": "US",
			"sentiment": -0.261
		},
		{
			"id": 251757206,
			"title": "The Assassination Attempt Against Trump",
			"text": "Here’s a timeline of what happened at the shooting that led to the death of one rally-goer, with two more sustaining serious injuries.6:02 p.m. —Trump Takes the StageFormer President Trump takes to the stage to the tune of “God Bless the USA,” waving to the crowd under the scorching sun. Republican presidential candidate and former President Donald Trump arrives for a campaign rally at Butler Farm Show Inc. in Butler, Penn., on July 13, 2024. (Jeff Swensen/Getty Images) 6:11:18 p.m. —Trump SpeaksIn the final moments before the shooting, President Trump talks about illegal immigration, referencing stats displayed on two jumbotrons that show it was lower during his tenure.6:11:32 p.m. —Shots FiredFormer President Trump continues speaking about illegal immigration, and begins to say, “If you wanna see something really sad, look what happened over ...” Just milliseconds before, the former president had cocked his head slightly to the right.6:11:33 p.m. —Trump Grabs EarImmediately after the shot rings out, former President Trump stops speaking and quickly grabs at his right ear. Footage shows the moment when shots were fired at former President Donald Trump during the rally. (NTD) Moments later, a Secret Service agent can be heard shouting, “Get down, get down!”6:11:36 p.m. —Secret Service Comes OnstageFormer President Trump’s personal escort of Secret Service agents immediately bounds onstage as soon as it became obvious that something is wrong. “What’re we doing, what’re we doing?” one female agent can be heard saying. “Where are we going?”6:12:32 p.m. —Trump Gets Up Premium PicksIn Photos: Shooting at Trump RallyBiden Says He’s Directed an Independent Review of Security at Trump RallyMan Killed in Trump Assassination Attempt Identified as Corey Comperatore, Governor Says U.S. Secret Service agents rush to protect former President Donald Trump after shots were fired at him. As the former president stands up, he raises his fist to the crowd, and appears to mouth, “Fight, fight, fight!” (Evan Vucci/AP Photo, Jeff Swensen/Getty Images) 6:12:47 p.m. —‘Wait, Wait, Wait’As former President Trump stands up, he can be heard telling agents, “Let me get my shoes.” The former president at this point raises his fist to the crowd and appears to mouth, “Fight, fight, fight!”6:12:55 p.m. —Trump Escorted OutWith most of his body still shielded by agents, former President Trump is carefully escorted off stage, continuing to pump his fist for the crowd. Former President Donald Trump, whose right ear was pierced by one of the bullets, is rushed offstage by U.S. Secret Service agents and escorted into a nearby vehicle. (Anna Moneymaker/Getty Images) 6:14 p.m. —Trump’s Motorcade LeavesThe former president’s motorcade departs the rally venue.6:42 p.m. —Secret Service Confirms ‘Incident’ at Trump RallySecret Service spokesman Anthony Guglielmi writes on X that “an incident” has happened at the rally and that former President Trump “is safe.”6:51 p.m. —Trump Said to Be at Medical FacilityThe Trump campaign says the former president “is fine and is being checked out at a local medical facility.”7:49 p.m. —Secret Service Confirms Shooter DeadSecret Service spokesman Anthony Guglielmi releases a statement saying that the suspected shooter had fired multiple shots from an elevated position outside the rally venue. Secret Service agents had “neutralized the shooter,” who was now deceased. The statement also says that one spectator was killed and two spectators seriously injured. (Top Left) Pennsylvania state police officers tend to a person in the crowd who is injured by the shots. (Top Right) Police snipers return fire at the shooter after former President Donald Trump was injured. (Bottom Left) The building, where a witness says they saw a man with a rifle climbing up to the roof, is near the site of the rally. (Bottom Right) People watch the shooting being broadcast on television in a bar in Milwaukee on July 13, 2024. (Rebecca Droke/AFP via Getty Images, Gene J. Puskar/AP Photo, Rachel Wang/The Epoch Times, Angela Weiss/AFP via Getty Images) 8:13 p.m. —Biden Condemns ShootingPresident Joe Biden speaks on camera from Rehoboth Beach, Delaware, saying that he had been “thoroughly briefed by all the agencies in the federal government” on the shooting. President Joe Biden speaks at the Rehoboth Beach Police Department, in Rehoboth Beach, Del., in the wake of the assassination attempt against his presidential rival on July 13, 2024. (Samuel Corum/Afp via Getty Images) 8:42 p.m. —Trump’s Ear WoundedFormer President Trump confirms that a bullet pierced his right ear, in a statement on his social media platform Truth Social. He also thanks the Secret Service, and all of law enforcement “for their rapid response to the shooting” and expresses condolences to the family of the person who was fatally shot and another he had heard had been seriously injured.9:40 p.m. —Trump Will Attend Republican National ConventionThe Trump Campaign and the Republican National Convention confirm in a statement that the former president is “doing well” and will appear in person at the Republican National Convention, set to kick off in two days in Milwaukee, on Monday, July 15. Workers prepare the stage for the Republican National Convention (RNC) at the Fiserv Forum in Milwaukee on July 13, 2024. The RNC will be held in Milwaukee from July 15–18. (Leon Neal/Getty Images) 10:30 p.m. —Biden Speaks With TrumpThe White House confirms that President Biden has spoken with former President Donald Trump.11:45 p.m. —FBI Calls Shooting an Assassination AttemptKevin Rojek, special agent in charge at the FBI’s Pittsburgh Field Office, holds a news conference calling the shooting an assassination attempt. He also says that investigators are working to identify a motive for the attempted assassination. The FBI confirms that two adult men are in critical condition, while a third has died.12:37 a.m. —Trump Lands in New JerseyPresident Trump’s private jet lands at Newark Liberty International Airport. A video shared by his deputy director of communications, Margo Martin, shows the former president walking unassisted down the airstair of his plane. “Strong and resilient. He will never stop fighting for America,” Ms. Martin writes on X.1:35 a.m. —FBI Names GunmanThe FBI identifies 20-year-old Thomas Matthew Crooks of Bethel Park, Pennsylvania, as the subject involved in the assassination attempt on former President Trump. People look at the American flag as it is placed into position at the campaign event in Butler, Penn., on July 13, 2024. (Rebecca Droke/AFP via Getty Images)",
			"summary": "A detailed look at how events unfolded when a shooter tried to assassinate former President Donald Trump at a Pennsylvania rally.",
			"url": "https://www.theepochtimes.com/article/the-assassination-attempt-against-trump-5685975",
			"image": "https://img.theepochtimes.com/assets/uploads/2024/07/14/id5686215-map3-300x180.jpg",
			"video": null,
			"publish_date": "2024-07-14 22:22:54",
			"author": "Eva Fu,Frank Fang,Joseph Lord",
			"authors": ["Eva Fu", "Frank Fang", "Joseph Lord"],
			"language": "en",
			"catgory": "politics",
			"source_country": "us",
			"sentiment": -0.444
		}
	]
}
