{"offset":0,"number":50,"available":9477,"news":[{"id":252729610,"title":"RFK Jr. critical of Biden for \"refusing to let go of power\"","text":"RFK Jr. critical of Biden for \"refusing to let go of power\" In an interview with CBS News' Major Garrett, independent presidential candidate Robert F. Kennedy Jr. claimed that President Biden \"tarred\" his \"reputation and that career over the past year by refusing to let go of power.\" He also addressed his meeting with former President Donald Trump at the Republican National Convention.","summary":"In an interview with CBS News' Major Garrett, independent presidential candidate Robert F. Kennedy Jr. claimed that President Biden \"tarred\" his \"reputation and that career over the past year by refusing to let go of power.\" He also addressed his meeting with former President Donald Trump at the Republican National Convention.","url":"https://www.cbsnews.com/video/rfk-jr-critical-of-biden-for-refusing-to-let-go-of-power/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/07/27/efb690eb-63da-4ad1-87ed-e3e7808c4991/thumbnail/1200x630/92b8ab1d056520fb11caa8558e3cf572/cbsn-fusion-rfk-jr-critical-of-biden-for-refusing-to-let-go-of-power-thumbnail.jpg?v=5501038cbc281520ff9fdc308faa","video":null,"publish_date":"2024-07-27 00:10:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.422},{"id":252729238,"title":"Justice Dept. Settles Lawsuit With Former F.B.I. Officials Targeted by Trump","text":"The Justice Department on Friday settled a lawsuit with two former F.B.I. officials who had accused the Trump administration of violating their privacy by sharing their texts disparaging former President Donald J. Trump with the news media, according to court documents. As part of the settlement, the government agreed to pay the former officials, Peter Strzok and Lisa Page, concluding at least some of the litigation. The amount was not disclosed in court filings, but Mr. Strzok’s law firm said he received $1.2 million. Their texts incited a political firestorm after the Justice Department in December 2017 invited reporters to review them at night before handing them over to Congress. Then a senior F.B.I. counterintelligence agent who helped oversee the bureau’s investigation into the Trump campaign’s possible ties to Russia in 2016, Mr. Strzok exchanged inflammatory messages with Ms. Page, a bureau lawyer involved in the inquiry. Republicans seized on the texts to try to discredit the investigation. The agreement is likely to anger Mr. Trump, who has railed against the pair for years and leveled baseless accusations that the investigation was a “witch hunt” intended to damage his campaign. Mr. Strzok drafted the memo opening the investigation, which was approved by his superiors.","summary":"Peter Strzok, a former F.B.I. agent, and Lisa Page, a former lawyer for the bureau, accused the Trump administration of violating their privacy after it provided explosive texts to the news media.","url":"https://www.nytimes.com/2024/07/26/us/politics/fbi-texts-strzok-page-trump.html","image":"https://static01.nyt.com/images/2024/07/26/multimedia/00dc-fbi-sub-qhcw/00dc-fbi-sub-qhcw-facebookJumbo.jpg","video":null,"publish_date":"2024-07-27 00:02:16","author":"Adam Goldman","authors":["Adam Goldman"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.399},{"id":252729408,"title":"Trump Plans to Hold Rally in Pennsylvania Town of Failed Assassination Attempt","text":"Former President Donald Trump is planning a grand return to the western Pennsylvania town where he survived an assassination attempt. In a July 26 post on his Truth Social platform, the 45th president said he will come back to Butler County for a rally to honor Corey Comperatore—a firefighter who was killed at the July 13 campaign rally as he reportedly dove in front of his wife and daughter to protect them—as well as two rallygoers who were critically injured. “I will be going back to Butler, Pennsylvania, for a big and beautiful rally, honoring the soul of our beloved firefighting hero, Corey, and those brave patriots injured two weeks ago,” wrote the nation’s top Republican. “What a day it will be—fight, fight, fight! Stay tuned for details,” he added. Former President Trump did not attend the funeral but paid tribute to Mr. Comperatore during a speech at the Milwaukee convention on July 18. Displaying Mr. Comperatore’s fire helmet and jacket, former President Trump called Mr. Comperatore “a fine man” and said, “There is no greater love than to lay down one’s life for others.” Mr. Comperatore, who celebrated his 50th birthday not too long ago, was a 10-year veteran of the U.S. Army Reserves. He served in the early 2000s as the chief of the Buffalo Township Volunteer Fire Company in Sarver, Pennsylvania, and remained a member until his death. At the July 13 Trump rally in Butler, about 13 miles from his home, Mr. Comperatore used his body as a shield for his wife and daughter against the bullets fired at former President Trump in an assassination attempt from the top of a nearby building, according to Pennsylvania Gov. Josh Shapiro citing Mr. Comperatore’s wife. The would-be assassin was killed by a Secret Service sniper almost immediately after. Former President Trump’s ear was pierced by one of the bullets. A surviving victim, 57-year-old David Dutch, has been discharged from hospital after a 11-day stay, while a second wounded rallygoer, 74-year-old James Copenhaver, remains hospitalized. Almost two weeks after the attack, details have continually emerged on how the shooter’s assassination plan was hatched. Testifying before the House Judiciary Committee on July 24, FBI director Christopher Wray said investigators have found that on July 6, a week before the assassination attempt, the shooter used his laptop to search on Google, “how far away was Oswald from Kennedy?” That’s a reference to the 1963 assassination of President John F. Kennedy by Lee Harvey Oswald. Mr. Wray added that FBI investigators also determined two explosive devices were found in the shooter’s vehicle, calling those devices “relatively crude” but still could have been detonated remotely. A transmitter was found on his body. The gunman also operated a drone roughly 200 yards from the stage, which might have broadcast a livestream roughly two hours before former President Trump took the stage. The investigators say they have not found any suggestion he was helped by anyone or had any accomplices on the day of the shooting. They also “do not yet have a clear picture of his motive,” according to Mr. Wray. “We’re not seeing [details on a motive] but we’re digging in hard because this is one of the central questions for us,” he said.","summary":"The former president will return to the town where he was shot two weeks ago and honor the victims.","url":"https://www.theepochtimes.com/us/trump-plans-to-hold-rally-in-pennsylvania-town-of-failed-assassination-attempt-5694470","image":"https://img.theepochtimes.com/assets/uploads/2024/07/19/id5689652-GettyImages-2161990304-300x180.jpg","video":null,"publish_date":"2024-07-26 23:58:08","author":"Bill Pan","authors":["Bill Pan"],"language":"en","source_country":"us","sentiment":-0.139},{"id":252728614,"title":"Watch ‘The Boys’ Season 4 Blooper Reel As Homelander Gets Goofy","text":"Share to Facebook Share to Twitter Share to Linkedin Antony Starr and Claudia Doumit in \"The Boys\" Season 4. Prime Video/Jan Thijs The Boys Season 4—which ends on a very serious note—is getting some welcome laughs with the release of a blooper reel from the show this year. The fourth season of the hit Prime Video series ended on July 18 and came with an episode that had to be retitled Season 4 Finale after producers and the streamers changed it from Assassination Run following the attempted assassination of former President Donald Trump on July 13. In the episode, both of the show’s major political figures—President-elect Robert Singer (Jim Beaver) and Vice President-elect Victoria Neuman (Claudia Doumit)—were targets of assassination. ForbesThe Boys Season 4, Episode 8 Recap: Homelander's New World OrderBy Tim Lammers However, when Billy Butcher (Karl Urban) uses his Temp V-acquired superpowers to kill Neuman and Singer is implicated in the crime, it allows the Speaker of the House Calhoun (David Andrews) to rise to the presidency and declare martial law on the country. Worse yet, Calhoun deputized hundreds of superheroes and put Homelander in command, allowing the villainous Supe to start apprehending anyone who disagrees with the country’s rule of law. Now, just over a week after the heavy-duty conclusion to The Boys Season 4, Prime Video is lightening the atmosphere with the release of a blooper reel featuring the cast members goofing around on set and messing up takes. MORE FOR YOU Apple iPhone 16 Pro: New Leak Reveals Powerful Design Upgrade Incoming, Report Says Leak Reveals A ‘Big’ Fed Earthquake Could Suddenly Smash The Price Of Bitcoin, Ethereum, XRP And Crypto Lady Gaga And Céline Dion Perform At Olympics Opening Ceremony—No ‘La Vie En Rose’ Duet Forbes'The Boys' Role That Victoria Neuman Actor Initially Auditioned ForBy Tim Lammers Even Jensen Ackles—whose Supe Soldier Boy didn’t appear until the end credits of the finale while lying in a comatose state—mugs for the camera. Virtually every cast member shows up in the blooper reel, from Erin Moriarty, Jack Quaid, Laz Alonso, Susan Heyward and Valorie Curry to Karen Fukuhara, Jessie T. Usher, Colby Minifie, Nathan Mitchell and Chace Crawford. The blooper reel also features Giancarlo Esposito, who returned in a guest capacity as former Vought CEO Stan Edgar in Episode 5 this season. Prime Video posted the blooper reel Friday on its X account. Click to watch it below. ‘The Boys’ Season 4 Draws Big Viewership According to Variety, Prime Video announced Thursday that The Boys Season 4 attracted more than 55 million viewers from the season’s launch on June 13 to July 21, which marked the first three days after the finale premiered. As such, the streamer said, the audience has grown in global viewership for three years straight. Forbes'The Boys': Black Noir Actor First Auditioned To Play Different SupeBy Tim Lammers In addition, Prime Video noted, the viewership for The Boys Season 4 makes it the fourth most-viewed show in the streamer’s history behind Lord of the Rings: Rings of Power Season 1, Fallout Season 1 and Reacher Season 2. Meanwhile, The Lord of the Rings: Rings of Power Season 2 premieres on Prime Video on August 28. The Boys' fifth and final season, per Deadline, isn’t expected to premiere on Prime Video until 2026. Forbes'The Boys' Season 4: Meet Stars Who Play Sister Sage And FirecrackerBy Tim Lammers Follow me on Twitter or LinkedIn. Check out my website. Tim Lammers Following Editorial Standards Print Reprints & Permissions","summary":"“The Boys” Season 4—which ends on a very serious note—gets some welcome laughs with the release of a blooper reel from the show this year. Click in to watch the goofiness.","url":"https://www.forbes.com/sites/timlammers/2024/07/26/watch-the-boys-season-4-blooper-reel-as-homelander-gets-goofy/","image":"https://imageio.forbes.com/specials-images/imageserve/66a43287f4cd05c3566f984e/0x0.jpg?format=jpg&crop=3000,1687,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-26 23:53:05","author":"Contributor,Tim Lammers","authors":["Contributor","Tim Lammers"],"language":"en","source_country":"US","sentiment":-0.022},{"id":252728694,"title":"Kamala Harris gains momentum in key states in latest poll against Donald Trump","text":"Kamala Harris has tightened the presidential race against Donald Trump in key battleground states that Joe Biden was on track to lose, new polls show. The vice president is tied with Trump in Michigan and Pennsylvania, up by six per cent in Minnesota, and down by one per cent in Wisconsin. Harris has erased the lead Trump was building in Michigan, Pennsylvania, and Wisconsin before Biden dropped out of the race on Sunday. Voters said their top issue was the economy – by a big margin – with immigration and abortion about even as second and third, and other topics well below them. The poll by Beacon Research and Shaw & Company Research conducted on July 22 to 24 for Fox News added to other polls showing the race tightening. Harris and Trump had 49 per cent of the vote each in Michigan and Pennsylvania, while Trump had 50 per cent to Harris’ 49 per cent in Wisconsin. Minnesota, a usually blue state that was increasingly in play, is back to looking out of Trump’s reach as he has 46 per cent to Harris’ 52 per cent. However, the races were head-to-head and did not take into account the effect of third-party candidates like independent Robert F Kennedy Jr. When the additional candidates are included, Harris is up by two per cent (45 to 43) in Pennsylvania and six per cent in Minnesota (47 to 41). Trump is ahead by two per cent in Michigan (45 to 43) and Wisconsin is tied at 46 per cent each. Polls before Biden dropped out had the president down between two and nine per cent in Pennsylvania, one to seven in Michigan, and about three in Wisconsin. The Fox News poll did not survey voters nationally, but others by the New York Times and a few more pollsters had Harris or Trump up by only one per cent. Harris must win Pennsylvania to have a chance of beating Trump, and likely needs Michigan and Wisconsin as well. Losing Minnesota would be a shock and mean the Democrats were in danger of suffering a landslide defeat. Twice as many voters said they cared more about the economy than any other issue, with immigration and abortion the other two key topics. Thirty-seven per cent of Wisconsin voters had the economy on top, with 15 per cent each for immigration and abortion, and in Michigan it was 35 per cent economy, 17 per cent immigration, and 16 per cent abortion. Economy was top issue for 39 per cent of Pennsylvanian voters with immigration at 16 per cent and abortion at 15 per cent. Other notable issues included healthcare, election integrity, climate change, foreign policy, crime, and guns – but all were in the mid to low single digits. Trump polls better among voters caring the most about the economy and immigration, and Harris is far better on abortion. Economy and immigration voters in Pennsylvania back Trump by 31 and 86 points respectively, while abortion voters back Harris by 67 points. Answers for Michigan were roughly the same. In Wisconsin, those prioritizing the economy and immigration backed Trump by 38 and 81 points respectively, while those putting abortion as their top issue prefer Harris by 78 points. About as many voters said they were ‘falling behind’ or ‘holding steady’ financially, both in the low 40s, and about 15 per cent were ‘getting ahead’. About three-quarters of Democrats want Harris to be the nominee with Biden gone, with Pennsylvania Governor Josh Shapiro the next most popular but only getting 14 per cent of his own state to favor him. Michigan Governor Gretchen Whitmer got 20 per cent in her home state, but her support was far lower elsewhere. Voters overwhelmingly approve of Biden’s decision to drop out and about two-thirds want him to remain president until his term ends in January. More to come.","summary":"Internewscast Journal\n\nInternewscast\n\n\nKamala Harris has tightened the presidential race against Donald Trump in key&#8230;\n\n\nThis Post: Kamala Harris gains momentum in key states in latest poll against Donald Trump first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/kamala-harris-gains-momentum-in-key-states-in-latest-poll-against-donald-trump/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Kamala-Harris-continues-incredible-surge-in-battleground.jpg","video":null,"publish_date":"2024-07-26 23:51:54","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.092},{"id":252728710,"title":"A 59-year-old widow has been forced to use a breathing tube and skyrocketing demand for wood pellets in the EU might be to blame","text":"Dobbins feels her life — and health — were better before 2016, when United Kingdom energy giant Drax opened a facility able to compress 450,000 tons of wood chips annually in the majority Black town of Gloster, Mississippi. To her, it’s no coincidence federal regulators find residents are exposed to unwanted air particles and they experience asthma more than most of the country. Her asthma and diabetes were once under control, but since a 2017 diagnosis of heart and lung disease, Dobbins has frequently lived at the end of a breathing tube connected to an oxygen cannister. “Something is going on. And it’s all around the plant,” said the 59-year-old widow who raised two children here. “Nobody asked us could they bring that plant there.” Wood pellet production skyrocketed across the U.S. South. It helped feed demand in the European Union for renewable energy, as those coutries sought to replace fossil fuels such as coal. But many residents near plants — often African Americans in poor, rural swaths — find the process left their air dustier and people sicker. Billions of dollars are available for these projects under President Joe Biden’s signature law combating climate change. The administration is weighing whether to open up tax credits for companies to burn wood pellets for energy. As producers expand west, environmentalists want the government to stop incentivizing what they call a misguided attempt to curb carbon emissions that pollute communities of color while presently warming the atmosphere. Despite hefty pollution fines against industry players and one major producer’s recent bankruptcy, supporters say the multibillion-dollar market is experiencing growing pains. In wood pellets, they see an innovative long-term solution to the climate crisis that brings revenue necessary for forest owners to maintain plantations. Biomass boom After the European Union classified biomass as renewable energy in 2009, the Southeast’s annual wood pellet capacity increased from about 300,000 tons to more than 7.3 million tons by 2017, according to research led by a University of Missouri team. Federal energy statistics show about three dozen southern wood pellet manufacturing facilities account for nearly 80% of annual U.S. capacity. Most pellets are used for commercial-scale energy overseas. The market brought hope for revitalization to small, disadvantaged communities. But interviews with residents of towns with large Black populations, from Gaston, North Carolina, to Uniontown, Alabama, surfaced complaints of truck traffic, air pollution and noise from pellet plants. Gloster has become the poster child for such tensions. In 2020, Mississippi’s environmental agency fined Drax $2.5 million for violating air emissions limits. Gloster is exposed to more particulate matter than much of the U.S. and adults have higher asthma rates than 80% of the country, according to an Environmental Protection Agency mapping tool. Median household income is about $22,000; the poverty rate is triple the national level. Spokesperson Michelli Martin said Drax in 2021 installed pollution controls, including incinerators to decrease carbon emissions. An environmental consulting firm found “no adverse effects to human health” and that “no modeled pollutant from the facility exceeded” acceptable levels, Martin said. The company recently committed to annual town halls and announced a $250,000 Gloster Community Fund to “improve quality of life.” But critics aren’t swayed by showings of corporate goodwill they say don’t account for poor air. Krystal Martin, of the Greater Greener Gloster Project, returned to her hometown after her 75-year-old mother was diagnosed with lung and heart problems. “You don’t really know you’re dealing with air pollution until most people have breathed and inhaled it for so long that they end up sick,” she said. Brown University assistant epidemiology professor Erica Walker is studying health impacts of industrial pollutants on Gloster residents. Walker said fine particulate matter can travel deep into lungs and reach the bloodstream. “It can also circulate to other parts of our body, leading to body-wide inflammation,” she said. Subsidies for an upstart industry Environmentalists are calling on Biden to stop aiding an industry they believe runs counter to his green energy goals. At the annual United Nations climate conference, The Dogwood Alliance urged attendees to phase out wood pellets. Enviva — the world’s largest wood pellet producer — had already received subsidies through the 2018 farm bill signed by former President Donald Trump, according to Sheila Korth, a former policy analyst with nonpartisan watchdog Taxpayers for Common Sense. But Korth said the Biden-era Inflation Reduction Act made tax credits available to companies that create pellets for countries in Europe and Asia. Elizabeth Woodworth, interim executive director of the US Industrial Pellet Association, said the money is a small part of lRA allocations and noted emerging technologies require government subsidies. The industry argues that replanting of trees will eventually absorb carbon produced by burning pellets. “We need every single technology we can get our hands on to mitigate climate change,” Woodworth said. “Bioenergy is a part of that.” Scientific studies have found firing wood pellets puts more carbon immediately into the atmosphere than coal. Pollution from biomass-based facilities is nearly three times higher than that of other energy sectors, according to a 2023 paper in the journal Renewable Energy. In a 2018 letter, hundreds of scientists warned the EU that the “additional carbon load” from burning wood pellets means “permanent damages” including glacial melting. Expansion plans and more burning? Drax — with plants operating in Alabama, Arkansas, Louisiana and Mississippi — is heading west. The corporation signed an agreement in February with Golden State Natural Resources to identify biomass from California’s forests. The public-private venture hopes to build two plants by year’s end and produce up to 1 million tons of wood pellets annually. Another Drax project in Washington would produce 500,000 tons a year. The Natural Resources Defense Council’s Rita Frost, who fought plants in the South, said the deal will endanger California’s low-income Latino communities much like she says the industry threatened Black southern towns. “It’s an environmental justice problem that should not be repeated in California,” Frost said. Biomass, including wood pellets, accounted for less than 5% of U.S. primary energy consumption in 2022, according to the U.S. Energy Information Administration. But a key federal decision could draw more companies into pellet combustion — not just production. The White House is looking into whether biomass facilities should receive tax credits meant for zero-emission electricity generators. The Treasury Department is weighing whether biomass’ potential long-term carbon neutrality is sufficient even if its production increases emissions in the short term. Spokesperson Michael Martinez said they are “carefully considering public comments” and “working to issue final rules that will increase energy security and clean energy supply as effectively as possible.” Some environmentalists doubt the energy alternative is ultimately carbon neutral. The Southern Environmental Law Center fears the credits could be the incentive needed for the U.S. to join Europe in scaling up the burning of pellets. “The threat here is really the growth of biomass energy production in the U.S. itself,” said senior attorney Heather Hillaker. “Which obviously will add to the total carbon and climate harms of this industry globally.” ___ Pollard reported from Columbia, South Carolina. Watson reported from San Diego. Contributing were video journalist Terry Chea from San Francisco and reporter Matthew Daly from Washington, D.C.","summary":"Wood pellet production is feeding demand for renewable energy in the EU, but it's taking a toll on Americans' health.","url":"https://fortune.com/2024/07/26/drax-wood-pellets-renewable-eu-pollution/","image":"https://fortune.com/img-assets/wp-content/uploads/2024/07/AP24203458704789-e1722037661269.jpg","video":null,"publish_date":"2024-07-26 23:51:09","author":"James Pollard,Julie Watson,Stephen Smith,The Associated Press","authors":["James Pollard","Julie Watson","Stephen Smith","The Associated Press"],"language":"en","source_country":"US","sentiment":-0.035},{"id":252728806,"title":"Dallas megachurch faces new questions as disgraced founder’s son announces abrupt departure","text":"The son and daughter-in-law of a disgraced Texas megachurch pastor who departed in shame last month over allegations of sexually abusing a pre-teee have also stepped down from their leadership positions at the congregation. James and Bridgette Morris, the executive senior pastor and executive pastor of ministry experience, communication, and women’s ministry at Gateway Church in Southlake, Texas, met this week with church elders and, after having been “diligent in prayer” about the situation, “collectively made the decision” to resign, according to a statement issued by Gateway officials late Thursday. “We as Elders affirm and believe that God has placed a desire in both Pastors James and Bridgette’s hearts to serve as senior pastors of a church at some point in the future,” the statement said. Pastor Robert Morris, who founded the 100,000-strong congregation nearly a quarter-century ago and also served as a religious adviser for former president Donald Trump, resigned on June 18, after an Oklahoma woman accused him of having lured her into a five-year sexual relationship beginning when she was just 12-years-old and Morris, now 62, was in his early 20s. The abuse began on Dec. 25, 1982, when Morris was evangelizing across the nation as a traveling preacher, Cindy Clemishire, now 54, revealed in bombshell allegations published June 14 on a Christian watchdog blog. Morris admitted to the congregation that he had been “involved in inappropriate sexual behavior with a young lady,” but did not specify that the “lady” was, in fact, a little girl. In 2007, Clemishire hired a lawyer and threatened to sue Morris over what she said he had done to her 25 years earlier. Morris’ lawyer responded by blaming Clemishire for having been the one to initiate the abuse, as a child, by being “flirtatious.” According to Clemishire, she was still wearing pink pajamas to bed and playing with Barbie dolls at the time of the alleged abuse. Morris, who had become friendly with Clemishire’s parents, and his family were staying at their home while he put on a youth revival event in town. On Christmas, Morris asked Clemishire to “visit” him in his room that night. There, according to Clemishire, he molested her for the first time. The abuse would continue until March 1987, according to Clemishire. Her father continued to donate to Morris’ ministry throughout, unaware of what the trusted family friend was doing to his daughter. When he finally learned what had been happening, Clemishire’s dad reported it to church elders, and Morris stepped down for two years before returning to the pulpit. Morris later founded Gateway Church in 2000, and grew it into one of the largest evangelical churches in the country. The church said on social media earlier this week that the board of elders had “a few important updates they will be sharing during services this weekend.”","summary":"The church said on social media earlier this week that the board of elders had “a few important updates they will be sharing during services this weekend.”","url":"https://www.independent.co.uk/news/world/americas/dallas-gateway-church-robert-morris-son-b2586782.html","image":"https://static.independent.co.uk/2024/06/24/18/newFile-2.jpg?width=1200","video":null,"publish_date":"2024-07-26 23:49:42","author":"Justin Rohrlich","authors":["Justin Rohrlich"],"language":"en","source_country":"gb","sentiment":-0.019},{"id":252728482,"title":"How Dems staged coup after coup — skirting democracy to hold power","text":"In March 2020, all the major Democratic primary candidates abruptly, mysteriously and in near unison withdrew from the presidential race, ceding the nomination to Joe Biden. Yet Biden had lost the first three races in Iowa, New Hampshire and Nevada — and only won his first victory in South Carolina. Suddenly, on the eve of the Super Tuesday mega-primaries, the candidacies of front-runner Bernie Sanders, Pete Buttigieg, Elizabeth Warren and others simply evaporated. The fear of a frontrunner Sanders’ socialist victory and nomination — and thus an enviable landslide loss to incumbent Donald Trump in the general election — had prompted the donor class and shadowy political insiders to act. And they did so by choosing a perceived moderate, old Joe Biden from Scranton. That required the coerced departures of all his far-left rivals, who had hitherto performed much better than Biden in the primaries. Biden still displayed obvious symptoms of serious cognitive decline that had only seemed to mount through the 2020 campaign. And his dementia continued to accelerate during his first three years as president. Biden had deceitfully promised to conduct a healing campaign and a unifying presidency. But once in the White House, his extreme agendas proved the most divisive and far-left in nearly a century. Rumors of that prior March 2020 Faustian bargain emerged. The Bidens got to serve as useful moderate veneers. So, they enjoyed the ceremonial functions of the presidency while outsourcing the real operations to former Obama officials, consultants and advisers. Indeed, Barack Obama did not, as most ex-presidents do, exit Washington upon leaving the White House. Instead, he bought a mansion and stayed close by. Democrats demonized anyone critical of Biden’s obvious mental decline. Their smearing crested during Biden’s now-aborted 2024 reelection bid, even as Biden could no longer display even a veneer of mental and physical engagement. Polls revealed an impending Trump landslide victory in November — and a massive Democratic loss of Congress. So suddenly on a Sunday, July 21 — on the eve of the Democratic convention — party bosses, mega-donors and Obama puppeteers went into action for yet a third time. They reportedly threatened candidate Biden with a complete loss of any further campaign funding and raised the specter of invoking the 25th Amendment to end his presidency — should he not suddenly withdraw from the race and endorse Vice President Kamala Harris as his surrogate on the ticket. In one moment, the choices of nearly 15 million Biden primary voters were vitiated. No delegates were consulted. No other alternative Democrat candidates were even considered. Biden was dethroned; Harris was coronated — without much public input or even knowledge of how or why. Democratic grandees stopped smearing Biden’s conservative critics, who had worried over his dementia. Instead, they now trumped opposition criticism of Biden’s decline. Yet Biden most certainly did not resign his presidency. Instead, he promised to serve out his remaining six months in office. So Democratic insiders not only removed their leading candidate, who in the prior six months had won all the 2024 primaries and almost all the delegates, but insisted that Biden keep Democrats and himself in power — but only if he agreed to quit the race. In sum, at the 11th hour of a two-year reelection effort, a cabal arbitrarily decided that Biden might well lose the Democrats the White House and the Congress. So they reversed course, now claiming his dementia was so acute as to destroy their November prospects. But, mysteriously, his decline was not severe enough to imperil the American people, whom Biden must continue to lead until January 20, 2025. Furthermore, the bosses’ replacement choice, Harris, had entered no primary. She never won a single delegate. Harris also never captured a single delegate in her first and only presidential run back in 2020. She dropped out of the race even before the first Iowa and New Hampshire balloting. We have now witnessed three left-wing veritable coups. In 2020, covert actors decided to ossify the Democratic primary races. Next, they conferred the nomination on a clearly cognitively challenged Biden. He was now tasked with serving as a useful moderate vessel for a virtual, even more radical, Obama third term. The same operators next assumed virtual control of Biden’s presidential agenda, given his accelerating cognitive decline. When that charade could no longer be sustained, for a third time, they circumvented the normal transparent democratic process. So, they removed the once-useful, but now a liability, Biden — while insisting that he was still fit enough to keep the left in power — until the anticipated Harris victory in November. And all of this was the shadowwork of those who sanctimoniously lectured America that “democracy dies in darkness.”","summary":"In March 2020, all the major Democratic primary candidates abruptly, mysteriously and in near unison withdrew from the presidential race, ceding the nomination to Joe Biden.","url":"https://nypost.com/2024/07/26/opinion/how-dems-staged-coup-after-coup-skirting-democracy-to-hold-power/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-7g8bbsak4-1722034375001.jpg?quality=75&strip=all&1722020023&w=1200","video":null,"publish_date":"2024-07-26 23:46:35","author":"Victor Davis Hanson","authors":["Victor Davis Hanson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.106},{"id":252728598,"title":"Minnesota DFL sees surge of volunteers and cash after Kamala Harris announces presidential run","text":"Minnesota’s Democrats are seeing an influx of new volunteers and cash following the announcement that Vice President Kamala Harris will run for president this year. The DFL raised over $200,000 in the two days after Harris threw her hat in the ring when President Joe Biden withdrew from the race earlier this month. The Harris campaign raised $126 million nationally in three days. The increased cash was also accompanied by a record-breaking 600 new volunteers, something that is directly tied to Harris’ name on the ticket, according to DFL Chair Ken Martin. “The energy not only is palpable, it’s just off the charts,” Martin said. The fresh batch of volunteers is largely comprised of people new to campaigning who want to elect the first woman president, Martin said. “With just 100 days left (until the election), it’s just a remarkable difference, to be honest with you, on where we were just a week ago,” he said. The excitement Democrats have over Harris as their nominee is especially intensified in Minnesota, where speculation over Gov. Tim Walz as a potential vice presidential candidate has been the talk of the town. While Walz has largely acted as a surrogate for a Harris presidency run, he did tell Minnesota Public Radio News that he is open to the idea of being her running mate. However, a spokesperson for the Walz administration said that his focus is on his current job. “The governor is excited that Minnesota is receiving national attention for passing a historic legislative agenda. While he plans to do everything he can to defeat Donald Trump in November, he remains focused on his job as governor,” the spokesperson said. Walz has garnered some support for a potential run as vice president, most notably from U.S. Rep. Angie Craig, who endorsed him on the social media site X on Wednesday. A Harris-Walz ticket would draw a good comparison to the Republican ticket, Martin said, adding that this year is an existential election and Harris represents “the future of not only the Democratic Party, but the future of America.” Former President Donald Trump and Sen. J.D. Vance, R-Ohio, became the Republican nominees just before Biden decided to drop out of the race. While the Harris campaign has requested vetting material from Walz, they have also asked for material from several other possible picks who either have a higher national presence, like Arizona Sen. Mark Kelly, or from governors in states considered more at risk to flip Republican, like Pennsylvania Gov. Josh Shapiro. At this point, who Harris will pick to join her ticket is speculation, but Democrats are likely to hold a virtual call to select a presidential nominee next week, which would likely follow with an endorsement for vice president. The fact that polls in Minnesota have shown a tight race means that Harris will have to find a way to shore up those votes in a state that has not voted for a Republican since 1972, says Paul Gazelka, a longtime Republican legislator who was the Senate majority leader from 2017 to 2021. “You have a lot of folks in Minnesota in the middle,” he said. “They’re just common folks that want their government to work and they don’t like extremes. Not extreme left, not extreme right.” Some of the decisions Walz has made as governor, like how he handled the George Floyd uprising in 2020, or the millions of dollars in fraud with government programs under his watch, may be liabilities for him as a national candidate, Gazelka said. “I would definitely be somebody to point out some of his weaknesses, but from Harris’ vantage point, I’m not so sure she would consider some of those (to be) weaknesses,” he said. Martin listed marks in Walz’s favor as a VP running mate, including Walz’s prior military service and work as a teacher, coach, 12-year congressional member and two-term governor. “Most importantly … is the fact that he has gotten a lot done for Minnesota in his time as governor, and I think he’s got a great record of success to share with the American people of how he’s governed the state,” Martin said. Walz has received praise from supporters, both in the state and nationally, for more progressive legislation passed in the state, which includes free breakfast and lunches for school children and solidifying the right to an abortion in the state. “I think (Walz) can talk about these things in a very folksy way in terms of his populist agenda,” Martin said.","summary":"The DFL raised over $200,000 in the two days after Harris threw her hat in the ring when President Joe Biden withdrew from the race.","url":"https://www.twincities.com/2024/07/26/minnesota-dfl-sees-surge-of-volunteers-and-cash-after-kamala-harris-announces-presidential-run/","image":"https://www.twincities.com/wp-content/uploads/2024/07/US-NEWS-TRUMP-HARRIS-FEC-COMPLAINT-GET.jpg?w=1024","video":null,"publish_date":"2024-07-26 23:42:05","author":"Mark Wasson","authors":["Mark Wasson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.08},{"id":252729404,"title":"Justice Will Not Recuse Himself From Trump Case Over Encounter With Lawyer","text":"New York Supreme Court Justice Arthur Engoron on July 26 denied a motion to recuse himself from former President Donald Trump’s civil fraud case after allegations that his final judgment, which included a $454 million fine, was influenced by a third party attorney. The justice also denied a motion to hold an evidentiary hearing about his encounter with the lawyer. Recusal on the basis of alleged bias and prejudice is left up to the justice’s discretion. Mr. Bailey has litigated many cases in New York’s midlevel trial court and was a commentator for several media outlets’ ongoing coverage of former President Trump’s trial. On Feb. 16, Justice Engoron issued his verdict in the trial, finding the former president liable for fraud. Justice Engoron wrote that prior to the “90-second incident” in the hallway, he had considered Mr. Bailey “a professional acquaintance and distant friend,” but he was surprised by the “vehement speech” and approach. “I did not initiate, welcome, encourage, engage in, or learn from, much less enjoy, Bailey’s tirade. I did not base any part of any of my rulings on it, as Bailey has outlandishly, mistakenly, and defamatorily claimed,” Justice Engoron wrote. He added that he had researched the statute used in the case for three and a half years and had issued several rulings on it. Justice Engoron said that since the highly publicized trial, he is often recognized and stopped by strangers. “Sometimes their unsolicited words are complimentary. Sometimes they are derogatory. Never do they affect my rulings,” he wrote. The justice further doubted the good faith basis of the motion to recuse, writing that the “irony” was that Mr. Bailey’s position is the same as the defense’s, yet the defense is citing it as a basis for recusal. “This suggests that defendants are not motivated by ethical concerns but, rather, seek an opportunity to reverse the trajectory and outcome of this case,” the justice wrote. Former President Trump has maintained he did nothing wrong and is appealing the ruling, which includes a $454 million disgorgement and a years-long ban on doing business in New York.","summary":"Recusal on the basis of alleged bias and prejudice is left up to the justice's discretion.","url":"https://www.theepochtimes.com/us/justice-will-not-recuse-himself-from-trump-case-over-encounter-with-lawyer-5694302","image":"https://img.theepochtimes.com/assets/uploads/2024/06/27/id5676442-AP23276644189592KO-300x180.jpg","video":null,"publish_date":"2024-07-26 23:41:13","author":"Catherine Yang","authors":["Catherine Yang"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.289},{"id":252728698,"title":"FBI confirms: Trump hit by bullet in assassination plot","text":"WASHINGTON – Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the agency said in a statement. The statement from the FBI marked the most definitive law enforcement account of Trump’s injuries and followed ambiguous comments earlier in the week from Director Christopher Wray that appeared to cast doubt on whether Trump had actually been hit by a bullet. The comment drew fury from Trump and his allies and further stoked conspiracy theories that have flourished on both sides of the political aisle amid a dearth of information following the July 13 attack. Up until now, federal law enforcement agents involved in the investigation, including the FBI and Secret Service, had repeatedly refused to provide information about what caused Trump’s injuries. Trump’s campaign has also declined to release medical records from the hospital where he was first treated or to make the doctors there available for questions. Updates have instead come either from Trump himself or from Trump’s former White House doctor, Ronny Jackson, a staunch ally who who now represents Texas in Congress. Though Jackson has been treating Trump since the night of the attack, he has come under considerable scrutiny and is not Trump’s primary care physician. The FBI’s apparent reluctance to immediately vouch for the former president’s version of events — along with the ire he and some supporters have directed at the bureau in the shooting’s aftermath — has also raised fresh tension between the Republican nominee and the nation’s premier federal law enforcement agency, which he could soon exert control over once again. Trump and his supporters have repeatedly accused federal law enforcement of being weaponized against him. Questions about the extent and nature of Trump’s wound began immediately after the attack, as his campaign and law enforcement officials declined to answer questions about his condition or the treatment he received after Trump narrowly escaped death in an attempted assassination by a gunman with a high-powered rifle. Those questions have persisted despite photos showing the trace of a projectile speeding past Trump’s head, photographs that show Trump’s teleprompter glass intact after the shooting, and the account Trump himself gave in a Truth Social post within hours of the shooting saying he had been “shot with a bullet that pierced the upper part of my right ear.” “I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,” he wrote. Days later, in a speech accepting the nomination at the Republican National Convention in Milwaukee, Trump described the horrific scene in detail, while wearing a large, white, gauze bandage over his right ear. “I heard a loud whizzing sound and felt something hit me really, really hard, on my right ear. I said to myself, ‘Wow, what was that? It can only be a bullet,’” he said. “If I had not moved my head at that very last instant,” Trump said, “the assassin’s bullet would have perfectly hit its mark, and I would not be here tonight.” But the first medical account of Trump’s condition didn’t come until a full week after the shooting, when Jackson released his first letter last Saturday evening. In that letter, he said the bullet that struck Trump had “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear.” He also revealed that Trump had received a CT scan at the hospital. But federal law enforcement involved in the investigation, including the FBI and Secret Service, had declined to confirm that account. And Wray’s testimony offered apparently conflicting answers on the issue. “There’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray testified, before he seemed to suggest it was indeed a bullet. “I don’t know whether that bullet, in addition to causing the grazing, could have also landed somewhere else,” he said. The following day, the FBI sought to clarify matters with a statement affirming that the shooting was an “attempted assassination of former President Trump which resulted in his injury, as well as the death of a heroic father and the injuries of several other victims.” The FBI also said Thursday that its Shooting Reconstruction Team continues to examine bullet fragments and other evidence from the scene. Jackson, who has been treating the former president since the night of the July 13 shooting, told The Associated Press on Thursday that any suggestion Trump’s ear was bloodied by anything other than a bullet was reckless. “It was a bullet wound,” said Jackson. “You can’t make statements like that. It leads to all these conspiracy theories.” In his letter Friday, Jackson insisted “there is absolutely no evidence” Trump was struck by anything other than a bullet and said it was “wrong and inappropriate to suggest anything else.” He wrote that at Butler Memorial Hospital, where the GOP nominee was rushed after the shooting, he was evaluated and treated for a “Gunshot Wound to the Right Ear.” “Having served as an Emergency Medicine physician for over 20 years in the United States Navy, including as a combat physician on the battlefield in Iraq,” he wrote, “I have treated many gunshot wounds in my career. Based on my direct observations of the injury, my relevant clinical background, and my significant experience evaluating and treating patients with similar wounds, I completely concur with the initial assessment and treatment provided by the doctors at nurses at Butler Memorial Hospital on the day of the shooting.” The FBI declined to comment on the Jackson letters. Asked if the campaign would release those hospital records, or allow the doctors who treated him there to speak, Trump campaign spokesperson Steven Cheung blasted the media for asking. In emails last week, he told the AP that “medical readouts” had already been provided. “It’s sad some people still don’t believe a shooting happened,” Cheung said, “even after one person was killed and others were injured.” Anyone who believes the conspiracies, he added, “is either mentally deficient or willfully peddling falsehoods for political reasons.” Sen. Lindsey Graham, R-S.C., a close Trump ally, also urged Wray to correct his testimony in a letter Friday to the FBI director, saying the fact Trump had been hit by a bullet “was made clear in briefings my office received and should not be a point of contention.” “As head of the FBI, you should not be creating confusion about such matters, as it further undercuts the agency’s credibility with millions of Americans,” he wrote. Trump also lashed out at Wray in a post on his Truth Social network, saying it was “No wonder the once storied FBI has lost the confidence of America!” “No, it was, unfortunately, a bullet that hit my ear, and hit it hard. There was no glass, there was no shrapnel,” he wrote. On Friday, he called Wray’s comments “so damaging to the Great People that work in the FBI.” Jackson has faced significant scrutiny over the years. After administering a physical to Trump in 2018, he drew headlines for suggesting that “if he had a healthier diet over the last 20 years, he might live to be 200 years old.” He was reportedly demoted by the Navy after the Department of Defense inspector general released a scathing report on his conduct as a top White House physician that found Jackson had made “sexual and denigrating” comments about a female subordinates and took prescription-strength sleeping medication that prompted worries from his colleagues about his ability to provide proper medical care. Trump appointed Wray in 2017 to replace the fired James Comey as director of the FBI. But the then-president swiftly soured on his hire as the bureau continued its investigation into the Russian election interference. Trump flirted openly with the idea of firing Wray as his term drew to a close, and he lashed out anew after the FBI executed a search warrant at his Mar-a-Lago estate in Florida to recover boxes of classified documents from his presidency. ___ Colvin reported from New York.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON – Nearly two weeks after Donald Trump’s near assassination, the FBI&#8230;\n\n\nThis Post: FBI confirms: Trump hit by bullet in assassination plot first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/fbi-confirms-trump-hit-by-bullet-in-assassination-plot/","image":"https://www.clickorlando.com/resizer/wK-DpIFVuFGJpGOWPjyM5jxdUqI=/cloudfront-us-east-1.images.arcpublishing.com/gmg/PREDKSE4JRHTNI3RUMFS2KNOTU.jpg","video":null,"publish_date":"2024-07-26 23:39:30","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.379},{"id":252728700,"title":"“FBI Confirms Bullet Hit President Trump’s Ear in Assassination Attempt”","text":"The FBI said Friday evening a bullet struck former President Donald Trump’s ear during his assassination attempt on July 13. The update to their investigation came after Trump lashed out against FBI Director Christopher Wray for testifying earlier this week that it was still unclear whether Trump was hit with a bullet — or something else — at his Pennsylvania rally. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the FBI said in its statement. Trump took to Truth Social Thursday calling out Wray for his testimony a day earlier in Congress where he briefed them on the investigation into the shooting that left one rallygoer dead and two others wounded. “FBI Director Christopher Wray told Congress yesterday that he wasn’t sure if I was hit by shrapnel, glass, or a bullet (the FBI never even checked!) … ” Trump posted in part Thursday night on his Truth Social account. Trump was reacting to Wray telling House lawmakers on Wednesday that the bureau still hasn’t reached a determination as to whether Trump’s ear was hit by an actual bullet. “I think with respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray said in response to a question from House Judiciary Committee Chairman Jim Jordan asking whether the FBI has accounted for all bullets fired by the shooter. “It’s conceivable — although as I sit here right now I don’t know whether that bullet, in addition to causing the grazing could have also landed somewhere else,” Wray said. As he indicated, the FBI is still examining bullet fragments found at the rally site in Butler, Pennsylvania, according to a source familiar with the investigation, to determine what actually hit the former president. On Friday, Texas Rep. Ronny Jackson, a former White House physician who served while Trump was president, disputed Wray’s testimony in a letter on his congressional letterhead. “There was no evidence it was anything other than a bullet,” Jackson wrote in the letter posted to X by Trump’s adviser Jason Miller. “Congress should correct the record as confirmed by both the hospital and myself. Director Wray is wrong and inappropriate to suggest anything else.” Jackson writes that he has been treating Trump in the aftermath of the assassination attempt and concurs with the assessment made by the doctors at the Butler Memorial Hospital the day of the shooting. The hospital has not released any medical reports about Trump’s injury, the cause or any treatment Trump received. Nor is there an official account yet from the state or federal government or the Trump campaign, other than two letters from Jackson, an outspoken supporter. A statement released by the FBI on Thursday said the attempted assassination resulted in Trump’s injury, but the exact manner how is still under investigation. “The FBI’s Shooting Reconstruction Team continues to examine evidence from the scene, including bullet fragments, and the investigation remains ongoing.” In his post on Truth Social, Trump insisted it was a bullet that struck him. “No, it was, unfortunately, a bullet that hit my ear, and hit it hard,” Trump wrote. “There was no glass, there was no shrapnel. The hospital called it a ‘bullet wound to the ear,’ and that is what it was.” At his campaign rallies, Trump now says he “took a bullet for democracy.” In the same social media post on Thursday, Trump also said Wray “knows nothing” and has promised to fire him if he wins a second term. ABC News’ Lalee Ibssa, Kelsey Walsh and Ivan Pereira contributed to this report.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe FBI said Friday evening a bullet struck former President Donald Trump&#8217;s&#8230;\n\n\nThis Post: &#8220;FBI Confirms Bullet Hit President Trump&#8217;s Ear in Assassination Attempt&#8221; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/fbi-confirms-bullet-hit-president-trumps-ear-in-assassination-attempt/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2024-07-26 23:33:30","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.804},{"id":252728196,"title":"FBI confirms Trump hit by bullet ‘whole or fragmented’ after GOP urges correction","text":"The FBI released a statement seemingly course-correcting after Republicans and former President Donald Trump himself disagreed with part of FBI Director Christopher Wray’s testimony before Congress on Wednesday. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the statement read. Wray testified about the investigation into the assassination attempt on Trump but created some confusion about what it was that struck the former president. “I think with respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray said. Sen. Lindsey Graham (R-SC), ranking member of the Senate Judiciary Committee, called on Wray earlier in the day to correct his statement that Trump may have actually been hit by shrapnel, not a bullet, at his rally in Butler, Pennsylvania. “I believe it is very important for you to correct your testimony before Congress on Wednesday when you indicated it is uncertain whether President Donald J. Trump was hit by a bullet, glass, or shrapnel,” Graham wrote. “It is clear to everyone that President Trump survived an assassination attempt by millimeters, as the attempted assassin’s bullet ripped the upper part of his ear.” “This was made clear in briefings my office received and should not be a point of contention. Therefore, I urge you to immediately correct your statement and acknowledge that President Trump was hit by a bullet rather than glass or shrapnel,” Graham continued. “As head of the FBI, you should not be creating confusion about such matters, as it further undercuts the agency’s credibility with millions of Americans. Please correct this statement immediately.” Trump also voiced his disagreement with the director’s assessment, posting on Truth Social to confirm he had suffered a gunshot wound. “No, it was, unfortunately, a bullet that hit my ear, and hit it hard,” Trump wrote. “There was no glass, there was no shrapnel. The hospital called it a ‘bullet wound to the ear,’ and that is what it was.” The hospital that treated Trump had not released any medical reports, leaving the internet to speculate about what caused the injury. However, a report by Trump’s former White House physician, Rep. Ronny Jackson (R-TX), who said he treated Trump’s wounds, and an analysis by the New York Times both support that Trump was hit by a bullet.","summary":"The FBI released a statement seemingly course-correcting after Republicans and former President Donald Trump himself disagreed with part of FBI Director Christopher Wray&#8217;s testimony before Congress on Wednesday. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,&#8221; the statement read. [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3101262/fbi-confirms-trump-hit-by-bullet-whole-fragmented/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Trump-assassination-attempt-scaled.webp","video":null,"publish_date":"2024-07-26 23:32:34","author":"Elaine Mallon","authors":["Elaine Mallon"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.196},{"id":252728176,"title":"Why Trump VP pick J.D. Vance is dogged by couch sex memes – and struggling in general","text":"Nearly two weeks after former US president Donald Trump selected J.D. Vance to be his running mate, it is safe to say the Ohio senator is struggling. His polling is the worst of any non-incumbent vice presidential nominee in decades. His years-old comments about “childless cat ladies” have drawn widespread disgust. Some in Trump’s orbit worry they have made the wrong choice. In recent days, he has been the target of a baseless rumour that he once had sex with a couch. It was always clear that Vance brought little to the table, strictly electorally speaking. He does not represent a swing state, he does not diversify the ticket, and the selection of a MAGA true believer does not reassure more Trump-sceptic voters. He was the choice of a campaign that was brimming with confidence. US President Joe Biden had not yet dropped out of the race, and Trump’s team probably made the choice with the idea that they did not need the boost that other vice-presidential contenders could have brought to the ticket, choosing instead to select an heir to the Make America Great Again movement. What was less predictable was the significant headwinds that Vance is now encountering as the Republican Party’s vice-presidential candidate, which have been driven by the way he has talked about certain policies and enabled by the simple fact that most Americans are just now learning who he is. Did the Associated Press retract its fact-check article denying JD Vance had sex with a couch? pic.twitter.com/P4nI6mqd4o — Jacob Shamsian ⚖️ (@JayShams) July 25, 2024 According to an AP-NORC poll conducted in the days before Vance was selected, 60 per cent of Americans said they did not know enough about the Ohio senator to have an opinion about him. Twenty-two per cent had an unfavourable opinion, while just 17 per cent had a favourable opinion. That lack of familiarity is a key reason that the memes about Vance having sex with a couch have taken off. To be clear, there is no evidence that ever happened. The meme began with a single X user joking that the Ohio senator wrote about it on pages 179 to 181 of his 2016 autobiography Hillbilly Elegy, which is patently and verifiably false. But then, Associated Press decided to fact-check the claim before deleting their story, amplifying it further. By Thursday, social media was awash with memes riffing on the notion that Trump’s vice-presidential nominee had once fornicated with a couch. One Democratic congressman even referenced it during a CNN interview that evening. When voters don’t know much about a candidate, stories like this initially appear plausible. Even after they are debunked, they can persist. In Vance’s case, the meme seems to be an ironic stand-in for other issues that voters may have with the Ohio senator, even if they know he probably did not have sex with a couch. A lesser-known candidate is also an easier target for their political opponents, especially if they come armed with all of the most controversial things that the candidate said in the past. In a way, Vance is running into the same problem that Blake Masters – a former US Senate candidate who is ideologically aligned with the Ohio senator – encountered in his 2022 race in Arizona: people are being alienated by what he has to say. This week, it’s his comments about childless people. Next week, it could be something else: Trump’s VP has an extensive online footprint. In this instance, Vance is taking aim at childlessness because he subscribes to a more idiosyncratic, nationalist vision of conservatism than most other Republican politicians, and he is interested in ways to encourage the growth of families. He has suggested incentivising that growth by allocating additional votes to parents based on the number of children they have, or by taxing childless adults at a higher rate than parents – a policy that is somewhat similar to a child tax credit. But those ideas, and that framing, are somewhat alien to the broader public. Then, you throw in the disparaging way that he talked about certain Democratic politicians – including US Vice-President Kamala Harris – as “childless cat ladies” in a 2021 interview with Tucker Carlson. JD Vance responds to the backlash to his “childless cat ladies” comment by apologizing to cats and then doubling down on attacking women: “I’m sorry, it’s true” pic.twitter.com/JZjqZJOp5y — Kamala HQ (@KamalaHQ) July 26, 2024 Vance made that comment shortly after he launched his Senate campaign, where he was working to distinguish himself in a crowded field of Republicans. In short, his audience was not the general public, but Republican primary voters. Yet that sort of flippant comment makes an already unknown candidate really easy to define in the context of a national campaign. During an interview on Megyn Kelly’s radio show on Friday, Vance insisted that he was referring solely to those politicians, not to Americans who are unable to have children. But the damage had already been done. “Obviously, it was a sarcastic comment. I’ve got nothing against cats, I’ve got nothing against dogs,” Vance said. “People are focusing so much on the sarcasm, and not on the substance of what I actually said. And the substance of what I said Megyn, I’m sorry, it’s true.” Originally published on Business Insider","summary":"The Ohio senator and Hillbilly Elegy author faces the worst polling of any non-incumbent US vice-presidential nominee in decades.","url":"https://www.scmp.com/news/world/united-states-canada/article/3272102/why-trump-vp-pick-jd-vance-dogged-couch-sex-memes-and-struggling-general","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/27/a0b2bf9b-bdbf-49bd-b4e9-6eea5ed08a4f_7cd83134.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/18/web%20video2.mp4","publish_date":"2024-07-26 23:30:31","author":"Business Insider","authors":["Business Insider"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.443},{"id":252727808,"title":"Ben Shapiro Bets Donald Trump Regrets Picking J.D. Vance","text":"In the wake of Democratic presidential nominee Kamala Harris’ record-breaking fundraising numbers, Ben Shapiro has an answer for anyone wondering if Donald Trump would pick J.D. Vance as his running mate again: “I doubt it.” “I think he probably would have picked somebody like Glenn Youngkin from Virginia in an attempt to broaden out his base,” Shapiro said on the latest episode of his self-titled show, according to Media Matters. “Instead, he went with J.D. Vance feeling, because he was right that at the time, he had a very solid advantage in the race against Joe Biden.” Shapiro was referring to President Joe Biden’s murmuring debate performance two weeks before the Republican National Convention in Milwaukee last week. That performance was the catalyst for Biden quitting the race and why Trump felt comfortable choosing a running mate who defies the traditions of picking a candidate that shores up support with the party’s larger base.","summary":"Anna Moneymaker/Getty ImagesIn the wake of Democratic presidential nominee Kamala Harris’ record-breaking fundraising numbers, Ben Shapiro has an answer for anyone wondering if Donald Trump would pick J.D. Vance as his running mate again: “I doubt it.”“I think he...","url":"https://nation.lk/online/ben-shapiro-bets-donald-trump-regrets-picking-j-d-vance-271994.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-07-26 23:30:04","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.398},{"id":252727730,"title":"Ex-Mueller investigator Peter Strzok reaches settlement with DOJ over anti-Trump texts","text":"July 26 (UPI) -- The Justice Department on Friday settled a lawsuit with former FBI agent Peter Strzok, who was fired from the bureau in 2018 over what he claimed was a violation of his privacy. Strzok, an FBI veteran who aided in the investigation of possible Russian interference in the 2016 presidential election, was fired over text messages he exchanged with former FBI attorney Lisa Page disparaging former President Donald Trump. His lawyers on Friday said the U.S. government agreed to pay Strzok $1.2 million. Strzok sued the FBI and Justice Department in 2019 alleging they unlawfully disclosed his private text messages. When the texts came to light, FBI special counsel Robert Mueller removed Strzok from the special counsel's office to a lower-level human resources position before his eventual firing. \"The FBI fired Special Agent Strzok because of his protected political speech in violation of his rights under the First Amendment to the Constitution of the United States,\" the lawsuit argued. In his texts, Strzok said he was \"scared for our organization\" if Trump were to take office. As president, Trump repeatedly criticized the FBI, including its director Christopher Wray, whom he appointed. Trump and other Republicans have since seized on the texts in an effort to discredit the investigation. The former president has made Strzok a frequent target on social media while denouncing the Russia investigation as a \"witch hunt.\" Strzok still has an ongoing lawsuit with the Justice Department on two other counts, claiming that the department also violated his constitutional rights and that his firing was politically motivated. He is seeking to be reinstated to the FBI so he can retire with full benefits. Page, who left the bureau in 2018, also settled a lawsuit with Justice Department alleging it violated her privacy. Her lawyer did not disclose the amount she was awarded, but said it was less than Strzok's payout. Former FBI Director James Comey and Deputy Director Andrew McCabe were also fired after Trump took office. The Justice Department in 2021 settled a lawsuit from McCabe alleging he was fired for political reasons. The department reinstated McCabe so he could retire with full benefits and collect about $200,000 in missed pension payments.","summary":"The Justice Department on Friday settled a lawsuit with former FBI agent Peter Strzok who was fired from the bureau in 2018 over what he claimed was a violation of his privacy.","url":"https://www.upi.com/Top_News/US/2024/07/26/peter-stzrok-justice-department-lawsuit-settlement/1731722032727/","image":"https://cdnph.upi.com/ph/st/th/1731722032727/2024/upi/1fc95effcc0994abfec00266a32aa842/v1.2/Ex-Mueller-investigator-Peter-Strzok-reaches-settlement-with-DOJ-over-anti-Trump-texts.jpg","video":null,"publish_date":"2024-07-26 23:28:10","author":"Ehren Wynder","authors":["Ehren Wynder"],"language":"en","source_country":"US","sentiment":-0.449},{"id":252728194,"title":"Dan Crenshaw joins chorus questioning Trump VP pick, saying he was ‘surprised’ by Vance","text":"Rep. Dan Crenshaw (R-TX) indicated he doesn’t hold a high opinion of former President Donald Trump’s choice of a running mate during an interview with a top Democratic strategist. Sen. J.D. Vance (R-OH) has faced a chorus of criticism since he was tapped to be Trump’s running mate. During an interview with David Axelrod released Thursday, Crenshaw voiced his own rebuke to the vice presidential candidate. Crenshaw questioned whether someone who once called Trump Hitler should be the GOP leader’s vice president. The comment was in reference to a 2016 text Vance sent to a friend that read, “I go back and forth between thinking Trump is a cynical a**hole like Nixon who wouldn’t be that bad (and might even prove useful) or that he’s America’s Hitler.” Vance has since clarified that he’s changed his mind. “It’s an interesting choice,” Crenshaw began before he referenced Vance’s controversial comment. “You know, Trump almost got assassinated recently, as we all know. I think it’s logical to say that rhetoric can lead to making crazy people even crazier. And calling Trump Hitler? What do you do with Hitler? You should kill him,” the Texan said on the Axe Files with David Axelrod. “Wait a second; J.D. Vance calls him that,” Axelrod interrupted. “That’s my point,” Crenshaw retorted. “I don’t understand it because I think he meant it at the time. So I think that’s concerning.” After the former president survived an assassination attempt, some Republicans speculated that Trump-Hitler comparisons from public figures such as Vice President Kamala Harris, Gov. Gavin Newsom (D-CA), comedian Kathy Griffin, and actor Robert DeNiro fueled the political violence. “Democrats and liberals in the media have called Trump a fascist. They’ve compared him to Hitler,” Sen. Rick Scott (R-FL) said in a post to X following the assassination attempt. “This isn’t some unfortunate incident. This was an assassination attempt by a madman inspired by the rhetoric of the radical left.” Some Republicans have also voiced concerns over Trump’s selection of Vance since he doesn’t provide much electoral benefit or balance to the ticket. “He was the worst choice of all the options. It was so bad I didn’t even think it was possible,” one House Republican told the Hill. “Anti-Ukraine, more of a populist. He adds nothing to the Trump ticket. He energizes the same people that love Trump.” Conservative commentator Tomi Lahren also called the pick a “bad move,” warning that his past comments, particularly calling some in the Democratic Party “childless cat ladies,” will alienate suburban women. Trump and other Republicans, however, have remained steadfast in their support of Vance on the ticket. When asked if he would pick Vance again now that Harris has become the likely Democratic nominee, Trump said “No, I would do the same thing. He’s doing really well. He’s really caught on.”","summary":"Rep. Dan Crenshaw (R-TX) indicated he doesn’t hold a high opinion of former President Donald Trump’s choice of a running mate during an interview with a top Democratic strategist. Sen. J.D. Vance (R-OH) has faced a chorus of criticism since he was tapped to be Trump’s running mate. During an interview with David Axelrod released [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3101473/dan-crenshaw-joins-chorus-questioning-trump-vp-pick/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/05/AP23005515860966.jpg","video":null,"publish_date":"2024-07-26 23:27:17","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.229},{"id":252728192,"title":"WATCH LIVE: Trump speaks at Turning Point USA Believers’ Summit","text":"Former President Donald Trump is addressing religious conservatives at Turning Point USA’s Faith Believers’ Summit in West Palm Beach, Florida. Trump is set to deliver the keynote address for the summit on Friday at 8 p.m. Eastern. According to the summit website, the event is aimed at helping Christians “live out their faith boldly and counteract the prevailing ‘woke’ narratives” during “a pivotal moment in history.” In a statement announcing the summit, TPUSA founder Charlie Kirk said Trump survived a recent assassination attempt only “by the Grace of Almighty God.” Trump has used similar language to describe his brush with death. As he accepted his party’s nomination last week, Trump said, “I’m not supposed to be here tonight. I stand before you in this arena only by the grace of Almighty God. And watching the reports over the last few days, many people say it was a providential moment. Probably was.”","summary":"Former President Donald Trump is addressing religious conservatives at Turning Point USA’s Faith Believers’ Summit in West Palm Beach, Florida.&#160;&#160; Trump is set to deliver the keynote address for the summit on Friday at 8 p.m. Eastern. According to the summit website, the event is aimed at helping Christians &#8220;live out their faith boldly and [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3101516/watch-live-trump-turning-point-usa/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Trump-and-Kirk.webp","video":null,"publish_date":"2024-07-26 23:25:46","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"US","sentiment":-0.057},{"id":252727854,"title":"J.D. Vance Says He Won’t Apologize to Childless Women over ‘Cat Ladies’ Comment But Has ‘Nothing Against Cats’","text":"Sen. J.D. Vance, former President Donald Trump’s running mate, defended his 2021 comments accusing Democratic leaders - including Vice President Kamala Harris - of being “childless cat ladies” who “want to make the rest of the country miserable.” Vance, 39, made the comments in a July 2021 interview with then-Fox News host Tucker Carlson. It resurfaced on social media after Trump chose the Ohio Republican as his vice presidential running mate. On Friday, July 26, Vance told Megyn Kelly he stands by the comments he made while he was running to represent Ohio in the U.S. Senate. “Obviously, it was a sarcastic comment. I’ve got nothing against cats,” Vance said on The Megyn Kelly Show on Sirius XM. “I know the media wants to attack me and wants me to back down, Megyn, but the simple point that I made is that having children — becoming a father, becoming a mother — I really do think it changes your perspective in a pretty profound way.” Vance went on to claim that Democrats have “become anti-family” over the past five to 10 years. “It’s built into their policies, it’s built into the way they talk about parents and children, and it’s time that we called that out,” Vance told Kelly, 53. “It’s not a criticism of people who don’t have children. I explicitly said in my remarks,” Vance continued. “This is not about criticizing people who for various reasons don’t have kids. This is about criticizing the Democratic party for becoming anti-family and anti-child.” \"What I was basically saying is that we're effectively run in this country — via the Democrats, via our corporate oligarchs — by a bunch of childless cat ladies who are miserable at their own lives in the choices that they've made and so they want to make the rest of the country miserable too,\" Vance told Carlson in 2021, referencing a speech he made earlier in that year. \"It's just a basic fact — you look at Kamala Harris, Pete Buttigieg, AOC — the entire future of the Democrats is controlled by people without children,\" Vance continued. \"And how does it make any sense that we've turned our country over to people who don't really have a direct stake in it?\" Never miss a story — sign up for PEOPLE's free daily newsletter to stay up to date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. The comments drew widespread criticism, particularly as Harris is stepmother to her husband Doug Emhoff’s two children, son Cole, 29, and daughter Ella, 25. Jennifer Aniston criticized Vance's comments, as did Ella, who shared a supportive statement from her mother, Emhoff's ex-wife Kerstin. \"How can you be 'childless' when you have cutie pie kids like cole and I,\" Ella wrote on her Instagram Stories Thursday. \"I love my three parents.\"","summary":"Vance told Megyn Kelly it was &#34;obviously a sarcastic comment&#34;","url":"https://people.com/j-d-vance-says-he-wont-apologize-to-childless-women-over-cat-ladies-comment-8684740","image":"https://people.com/thmb/Ft_sihnBZjS4UbrzchWJ84H1aNc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1022x290:1024x292)/JD-Vance-RNC-071724-1-3b5f7e6e6829404a946f7c4fabaecfaa.jpg","video":null,"publish_date":"2024-07-26 23:25:31","author":"Daniel S. Levine","authors":["Daniel S. Levine"],"language":"en","source_country":"US","sentiment":0.133},{"id":252728182,"title":"FBI says bullet struck Trump's ear during assassination attempt","text":"The FBI said Friday evening a bullet struck former President Donald Trump's ear during his assassination attempt on July 13. The update to their investigation came after Trump lashed out against FBI Director Christopher Wray for testifying earlier this week that it was still unclear whether Trump was hit with a bullet -- or something else -- at his Pennsylvania rally. \"What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject's rifle,\" the FBI said in its statement. Trump took to Truth Social Thursday calling out Wray for his testimony a day earlier in Congress where he briefed them on the investigation into the shooting that left one rallygoer dead and two others wounded. \"FBI Director Christopher Wray told Congress yesterday that he wasn't sure if I was hit by shrapnel, glass, or a bullet (the FBI never even checked!) ... \" Trump posted in part Thursday night on his Truth Social account. Trump was reacting to Wray telling House lawmakers on Wednesday that the bureau still hasn't reached a determination as to whether Trump's ear was hit by an actual bullet. \"I think with respect to former President Trump, there's some question about whether or not it's a bullet or shrapnel that hit his ear,\" Wray said in response to a question from House Judiciary Committee Chairman Jim Jordan asking whether the FBI has accounted for all bullets fired by the shooter. \"It's conceivable -- although as I sit here right now I don't know whether that bullet, in addition to causing the grazing could have also landed somewhere else,\" Wray said. As he indicated, the FBI is still examining bullet fragments found at the rally site in Butler, Pennsylvania, according to a source familiar with the investigation, to determine what actually hit the former president. On Friday, Texas Rep. Ronny Jackson, a former White House physician who served while Trump was president, disputed Wray's testimony in a letter on his congressional letterhead. \"There was no evidence it was anything other than a bullet,\" Jackson wrote in the letter posted to X by Trump's adviser Jason Miller. \"Congress should correct the record as confirmed by both the hospital and myself. Director Wray is wrong and inappropriate to suggest anything else.\" Jackson writes that he has been treating Trump in the aftermath of the assassination attempt and concurs with the assessment made by the doctors at the Butler Memorial Hospital the day of the shooting. The hospital has not released any medical reports about Trump's injury, the cause or any treatment Trump received. Nor is there an official account yet from the state or federal government or the Trump campaign, other than two letters from Jackson, an outspoken supporter. A statement released by the FBI on Thursday said the attempted assassination resulted in Trump's injury, but the exact manner how is still under investigation. \"The FBI's Shooting Reconstruction Team continues to examine evidence from the scene, including bullet fragments, and the investigation remains ongoing.\" In his post on Truth Social, Trump insisted it was a bullet that struck him. \"No, it was, unfortunately, a bullet that hit my ear, and hit it hard,\" Trump wrote. \"There was no glass, there was no shrapnel. The hospital called it a 'bullet wound to the ear,' and that is what it was.\" At his campaign rallies, Trump now says he \"took a bullet for democracy.\" In the same social media post on Thursday, Trump also said Wray \"knows nothing\" and has promised to fire him if he wins a second term. ABC News' Lalee Ibssa, Kelsey Walsh and Ivan Pereira contributed to this report.","summary":"The FBI said Friday evening a bullet struck former President Donald Trump's ear during his assassination attempt on July 13.","url":"https://abc13.com/post/fbi-says-bullet-struck-trumps-ear-during-assassination/15101407/","image":"https://cdn.abcotvs.com/dip/images/15079245_AP24201729143456.jpg?w=1600","video":null,"publish_date":"2024-07-26 23:24:58","author":"ABCNews,Luke Barr And Soo Rin Kim","authors":["ABCNews","Luke Barr And Soo Rin Kim"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.806},{"id":252727798,"title":"FBI says bullet struck Trump's ear during assassination attempt","text":"The FBI said Friday evening a bullet struck former President Donald Trump's ear during his assassination attempt on July 13. The update to their investigation came after Trump lashed out against FBI Director Christopher Wray for testifying earlier this week that it was still unclear whether Trump was hit with a bullet -- or something else -- at his Pennsylvania rally. \"What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject's rifle,\" the FBI said in its statement. Trump took to Truth Social Thursday calling out Wray for his testimony a day earlier in Congress where he briefed them on the investigation into the shooting that left one rallygoer dead and two others wounded. \"FBI Director Christopher Wray told Congress yesterday that he wasn't sure if I was hit by shrapnel, glass, or a bullet (the FBI never even checked!) ... \" Trump posted in part Thursday night on his Truth Social account. Trump was reacting to Wray telling House lawmakers on Wednesday that the bureau still hasn't reached a determination as to whether Trump's ear was hit by an actual bullet. \"I think with respect to former President Trump, there's some question about whether or not it's a bullet or shrapnel that hit his ear,\" Wray said in response to a question from House Judiciary Committee Chairman Jim Jordan asking whether the FBI has accounted for all bullets fired by the shooter. \"It's conceivable -- although as I sit here right now I don't know whether that bullet, in addition to causing the grazing could have also landed somewhere else,\" Wray said. As he indicated, the FBI is still examining bullet fragments found at the rally site in Butler, Pennsylvania, according to a source familiar with the investigation, to determine what actually hit the former president. On Friday, Texas Rep. Ronny Jackson, a former White House physician who served while Trump was president, disputed Wray's testimony in a letter on his congressional letterhead. \"There was no evidence it was anything other than a bullet,\" Jackson wrote in the letter posted to X by Trump's adviser Jason Miller. \"Congress should correct the record as confirmed by both the hospital and myself. Director Wray is wrong and inappropriate to suggest anything else.\" Jackson writes that he has been treating Trump in the aftermath of the assassination attempt and concurs with the assessment made by the doctors at the Butler Memorial Hospital the day of the shooting. The hospital has not released any medical reports about Trump's injury, the cause or any treatment Trump received. Nor is there an official account yet from the state or federal government or the Trump campaign, other than two letters from Jackson, an outspoken supporter. A statement released by the FBI on Thursday said the attempted assassination resulted in Trump's injury, but the exact manner how is still under investigation. \"The FBI's Shooting Reconstruction Team continues to examine evidence from the scene, including bullet fragments, and the investigation remains ongoing.\" In his post on Truth Social, Trump insisted it was a bullet that struck him. \"No, it was, unfortunately, a bullet that hit my ear, and hit it hard,\" Trump wrote. \"There was no glass, there was no shrapnel. The hospital called it a 'bullet wound to the ear,' and that is what it was.\" At his campaign rallies, Trump now says he \"took a bullet for democracy.\" In the same social media post on Thursday, Trump also said Wray \"knows nothing\" and has promised to fire him if he wins a second term. ABC News' Lalee Ibssa, Kelsey Walsh and Ivan Pereira contributed to this report.","summary":"The FBI said Friday evening a bullet struck former President Donald Trump's ear during his assassination attempt on July 13.","url":"https://abc7news.com/post/fbi-says-bullet-struck-trumps-ear-during-assassination/15101407/","image":"https://cdn.abcotvs.com/dip/images/15079245_AP24201729143456.jpg?w=1600","video":null,"publish_date":"2024-07-26 23:24:58","author":"ABCNews,Luke Barr And Soo Rin Kim","authors":["ABCNews","Luke Barr And Soo Rin Kim"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.806},{"id":252728464,"title":"For Gov. J.B. Pritzker, an earlier Joe Biden exit could have been just the ticket","text":"Sneed on Sunday … It would makes quite a political movie script. “A Clear and Present Danger” drama. Sneed is told an aging President Joe Biden was actually warned a year and a half ago by a top top Dem pollster that his re-election was in the doghouse with young voters. His age was going to be a killer. The handwriting was on the wall. Stunning in-house Dem polling was raising alarms within the party hierarchy. “Joe” was old and in trouble with Gen Z; the Millennials; and ostensibly those approaching voting age. The only American president produced during the “Silent Generation: 1941-1945,” (Bill Clinton and George W. Bush were born in 1946) Joe Biden was listening, but resisting this Clarion call. And powerful Dem kingpins were praying he’d pull out in advance of the primaries to allow the selection of someone new to showcase, said a top Dem Sneed source. Enter popular Illinois Gov. J.B. Pritzker, a major Biden backer well aware of Biden’s falling polling numbers, a powerful pol with megabucks who long harbored a desire to seek the presidency himself. And he was being urged by powerful supporters to run in a primary in case the elderly Biden pulled the plug. Ka-ching: Pritzker knew he would have an advantage over most opponents because he had the $3.5 billion fortune to fund a major primary campaign in the blink of an eye. But Biden did not pull out until it was this/close — and too late. And when Biden finally pulled out of the 2024 presidential sweepstakes last Sunday, Vice President Kamala Harris suddenly stoked such powerful political thunder it was akin to the wind of a Zephyr on the Dakota prairie. Instrumental last year in snagging Chicago as the site of Democratic National Convention, Pritzker saw his POTUS podium gone with the wind. Still a Dem powerhouse, Pritzker is now on board big time to support Harris — and is a member of the veep sweepstakes hoping to make the cut as her running mate. If Harris, 59, loses her POTUS bid, Pritzker, 59. has four years to wait to run for president. If Harris wins in November, Pritzker could have an eight-year wait to run for the nation’s top job. Patience. The Tangerine Man Cometh … It’s no secret Donald “I’m not going to be nice” Trump has vowed to prosecute and/or persecute his “enemies” to the hilt if he wins back the White House. So I pose this question. Will Biden opt to dial back his “NO” response to a press query weeks ago about whether he would “pardon” his son, Hunter Biden, found guilty earlier this summer on felony gun charges ... if Trump wins the presidency? It’s no secret Trump pardoned pals and political allies when he had the chance. Will Joe? The Maw of the Claw … Social media memes may be killing Trump’s veep pick JD Vance since he declared “childless cat ladies force their misery on the rest of the country … because they don’t have kids,” but cats do rule! The Meow Pow! YouTube videos online starring felines have accounted for more than 26 million views and have been found to relieve stress and be morale boosters. Hey! Hey! This one tugs at the heart! Miss “Addison Clark” Carroll, 8, who was named after the two streets on the perimeter of the Chicago Cubs ballpark at Wrigley Field — and who was born in 2016 when the Cubbies won the World Series — and whose dad, Ryan Carroll, is a huge Cubs fan (natch!) ... just flew in from her home in Texas to attend her first Cubs game. And “Addie” held up a huge sign at the Cubs vs Diamondbacks game last Saturday to let everyone know! Check out the pix! Sneedlings … All in the family: Margaret Cullerton Hooper, daughter of former Illinois Senate President John Cullerton and mother of two, is running for a seat on Chicago’s elected school board in November. Saturday birthdays: singer Maureen McGovern, 75; actor Betty Thomas, 77; comedian Maya Rudolph, 52; actor Jonathan Rhys Meyers, 47 … Sunday birthdays: former U.S. Sen. Bill Bradley, 81; legendary Chicago TV newsman Walter Jacobson, 87 … actor Jon Michael Hill, 39; Rapper Soulja Boy, 34 … and an early birthday shoutout next week to blues legend Buddy Guy, who will be 88.","url":"https://chicago.suntimes.com/columnists/2024/07/26/sneed-jb-pritzker-joe-biden-kamala-harris-trump-polls-age-young-vice-president","image":"https://cst.brightspotcdn.com/dims4/default/e8892b6/2147483647/strip/true/crop/5319x3036+0+255/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Ff2%2F19%2F338004474baaa01965ee2c96381b%2Fbide","video":null,"publish_date":"2024-07-26 23:22:17","author":"Michael Sneed","authors":["Michael Sneed"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.18},{"id":252727748,"title":"US: Donald Trump Meets Benjamin Netanyahu At Mar-A-Lago After Urging Israel To Quickly End Gaza Conflict; VIDEO","text":"Former US President Donald Trump met Israeli Prime Minister Benjamin Netanyahu at Mar-a-Lago, Florida, amidst Trump's call for Israel to end its conflict with Hamas swiftly. The meeting follows Trump's recent criticism and ongoing efforts to strengthen his ties with Israel during the current Gaza war.","summary":"","url":"https://www.freepressjournal.in/world/us-donald-trump-meets-benjamin-netanyahu-at-mar-a-lago-after-urging-israel-to-quickly-end-gaza-conflict","image":"https://media.assettype.com/freepressjournal/2024-07/3237731f-dc74-4617-b222-f8065970e90d/FotoJet (73).jpg","video":null,"publish_date":"2024-07-26 23:20:47","author":"ANI","authors":["ANI"],"language":"en","catgory":"politics","source_country":"IN","sentiment":0.036},{"id":252728910,"title":"FBI says Donald Trump WAS hit in the ear by bullet in screeching U-turn after chief cast doubt over shooting","text":"DONALD Trump WAS hit in the ear by a bullet, the FBI has confirmed - just days after its director suggested he wasn't. Bureau boss Christopher Wray said Wednesday there was \"some question\" about whether or not it was \"a bullet or shrapnel\" that hit the former president during an assassination attempt in Butler, Pennsylvania, on July 13. Trump furiously hit back at the suggestion Thursday night, insisting he was hit in the ear and \"hit hard.\" In a statement on Friday evening, the FBI said \"what struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle.\" It comes two days after FBI Director Wray said before Congress that it wasn't clear if Trump's injuries were caused by a bullet or shrapnel. He told the House Judiciary Committee on Wednesday that it was \"conceivable\" the bullet fired at the former President \"in addition to causing the grazing, could have also landed somewhere else.\" Trump has vividly described his injury, saying that he came within \"a quarter inch\" of death. He also vowed to return to Butler, Pennsylvania, where Thomas Crooks, 20, opened fire at his campaign rally, hitting Trump and killing Corey Comperatore, who attended the event with his family. Trump wrote on his social media platform, Truth Social that he would host a \"big and beautiful rally honoring the soul of our beloved firefighting hero, Corey, and those brave patriots injured two weeks ago. \"What a day it will be - fight, fight fight! Stay tuned for details.\" HORRIFIC SHOOTING Trump was addressing his supporters at the campaign rally when Crooks opened fire from a nearby rooftop. Cameras were rolling as the former President took cover as shots rang out, grabbing onto his ear in pain. Crooks was killed by Secret Service counter snipers just moments later but the shooting is still under investigation. While speaking to the committee, FBI Director Wray said, \"With respect to former President Trump, there's some question about whether or not it was a bullet or shrapnel that hit his ear.\" However, Texas Representative Ronny Jackson, who once served as the White House physician under then-President Trump disputed Wray's testimony. \"There was no evidence it was anything other than a bullet,\" Jackson wrote in a letter posted to X. \"Congress should correct the record as confirmed by both the hospital and myself. Director Wray is wrong and inappropriate to suggest anything else.\" Jackson added that he has been treating Trump following the attack and agrees with the assessment made by doctors at Butler Memorial Hospital on the day of the shooting. Medical records about Trump's injury haven't been released and there are no official accounts from the state or federal government. The FBI said in a statement that the shooting is still under investigation. \"The FBI's Shooting Reconstruction Team continues to examine evidence from the scene, including bullet fragments, and the investigation remains ongoing.\" More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thescottishsun.co.uk/news/13230599/donald-trump-fbi-confirms-bullet-ear-injury/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2024/07/KS-trump-ear-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-26 23:18:38","author":"Cheyenne R. Ubiera","authors":["Cheyenne R. Ubiera"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.378},{"id":252727888,"title":"FBI says Donald Trump WAS hit in the ear by bullet in screeching U-turn after chief cast doubt over shooting","text":"A BULLET hit former President Donald Trump in his right ear during an assassination attempt on July 13. After weeks of confusion, the FBI confirmed the injury to dispel misinformation. In a statement on Friday evening, the FBI said \"what struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle.\" It comes two days after FBI Director Christopher Wray said before Congress that it wasn't clear if Trump's injuries were caused by a bullet or shrapnel. He told the House Judiciary Committee on Wednesday that it was \"conceivable\" the bullet fired at the former President \"in addition to causing the grazing, could have also landed somewhere else.\" Trump has vividly described his injury, saying that he came within \"a quarter inch\" of death. He slammed Wray, insisting that a bullet had hit his ear and \"hit it hard.\" Trump also vowed to return to Butler, Pennsylvania, where Thomas Crooks, 20, opened fire at his campaign rally, hitting Trump and killing Corey Comperatore, who attended the event with his family. Trump wrote on his social media platform, Truth Social that he would host a \"big and beautiful rally honoring the soul of our beloved firefighting hero, Corey, and those brave patriots injured two weeks ago. \"What a day it will be - fight, fight fight! Stay tuned for details.\" HORRIFIC SHOOTING Trump was addressing his supporters at the campaign rally when Crooks opened fire from a nearby rooftop. Cameras were rolling as the former President took cover as shots rang out, grabbing onto his ear in pain. Crooks was killed by Secret Service counter snipers just moments later but the shooting is still under investigation. While speaking to the committee, FBI Director Wray said, \"With respect to former President Trump, there's some question about whether or not it was a bullet or shrapnel that hit his ear. \"So it is conceivable, as I sit here right now, I don't know whether that bullet, in addition to causing the grazing, could have also landed somewhere else.\" More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thesun.co.uk/news/29508079/donald-trump-fbi-confirms-bullet-ear-injury/","image":"https://www.thesun.co.uk/wp-content/uploads/2024/07/KS-trump-ear-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-26 23:18:38","author":"Cheyenne R. Ubiera","authors":["Cheyenne R. Ubiera"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.394},{"id":252727964,"title":"FBI says Donald Trump WAS hit in the ear by bullet in screeching U-turn after chief cast doubt over shooting","text":"A BULLET hit former President Donald Trump in his right ear during an assassination attempt on July 13. After weeks of confusion, the FBI confirmed the injury to dispel misinformation. In a statement on Friday evening, the FBI said \"what struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle.\" It comes two days after FBI Director Christopher Wray said before Congress that it wasn't clear if Trump's injuries were caused by a bullet or shrapnel. He told the House Judiciary Committee on Wednesday that it was \"conceivable\" the bullet fired at the former President \"in addition to causing the grazing, could have also landed somewhere else.\" Trump has vividly described his injury, saying that he came within \"a quarter inch\" of death. He slammed Wray, insisting that a bullet had hit his ear and \"hit it hard.\" Trump also vowed to return to Butler, Pennsylvania, where Thomas Crooks, 20, opened fire at his campaign rally, hitting Trump and killing Corey Comperatore, who attended the event with his family. Trump wrote on his social media platform, Truth Social that he would host a \"big and beautiful rally honoring the soul of our beloved firefighting hero, Corey, and those brave patriots injured two weeks ago. \"What a day it will be - fight, fight fight! Stay tuned for details.\" HORRIFIC SHOOTING Trump was addressing his supporters at the campaign rally when Crooks opened fire from a nearby rooftop. Cameras were rolling as the former President took cover as shots rang out, grabbing onto his ear in pain. Crooks was killed by Secret Service counter snipers just moments later but the shooting is still under investigation. While speaking to the committee, FBI Director Wray said, \"With respect to former President Trump, there's some question about whether or not it was a bullet or shrapnel that hit his ear. \"So it is conceivable, as I sit here right now, I don't know whether that bullet, in addition to causing the grazing, could have also landed somewhere else.\" More to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos Like us on Facebook at TheSunUS and follow us on X at @TheUSSun","summary":"","url":"https://www.thesun.ie/news/13488515/donald-trump-fbi-confirms-bullet-ear-injury/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2024/07/KS-trump-ear-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-07-26 23:18:38","author":"Cheyenne R. Ubiera","authors":["Cheyenne R. Ubiera"],"language":"en","catgory":"politics","source_country":"ie","sentiment":-0.394},{"id":252727868,"title":"FBI says Trump was indeed struck by bullet during assassination attempt","text":"Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the agency said in a statement. The statement from the FBI marked the most definitive law enforcement account of Trump’s injuries and followed ambiguous comments earlier in the week from Director Christopher Wray that appeared to cast doubt on whether Trump had actually been hit by a bullet. The comment drew fury from Trump and his allies and further stoked conspiracy theories that have flourished on both sides of the political aisle amid a dearth of information following the July 13 attack. Up until now, federal law enforcement agents involved in the investigation, including the FBI and Secret Service, had repeatedly refused to provide information about what caused Trump’s injuries. Trump’s campaign has also declined to release medical records from the hospital where he was first treated or to make the doctors there available for questions. Updates have instead come either from Trump himself or from Trump’s former White House doctor, Ronny Jackson, a staunch ally who who now represents Texas in Congress. Though Jackson has been treating Trump since the night of the attack, he has come under considerable scrutiny and is not Trump’s primary care physician. The FBI’s apparent reluctance to immediately vouch for the former president’s version of events — along with the ire he and some supporters have directed at the bureau in the shooting’s aftermath — has also raised fresh tension between the Republican nominee and the nation’s premier federal law enforcement agency, which he could soon exert control over once again. Trump and his supporters have repeatedly accused federal law enforcement of being weaponized against him. Questions about the extent and nature of Trump’s wound began immediately after the attack, as his campaign and law enforcement officials declined to answer questions about his condition or the treatment he received after Trump narrowly escaped death in an attempted assassination by a gunman with a high-powered rifle. Those questions have persisted despite photos showing the trace of a projectile speeding past Trump’s head, photographs that show Trump’s teleprompter glass intact after the shooting, and the account Trump himself gave in a Truth Social post within hours of the shooting saying he had been “shot with a bullet that pierced the upper part of my right ear.” “I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,” he wrote. Days later, in a speech accepting the nomination at the Republican National Convention in Milwaukee, Trump described the horrific scene in detail, while wearing a large, white, gauze bandage over his right ear. “I heard a loud whizzing sound and felt something hit me really, really hard, on my right ear. I said to myself, ‘Wow, what was that? It can only be a bullet,’” he said. “If I had not moved my head at that very last instant,” Trump said, “the assassin’s bullet would have perfectly hit its mark, and I would not be here tonight.” But the first medical account of Trump’s condition didn’t come until a full week after the shooting, when Jackson released his first letter last Saturday evening. In that letter, he said the bullet that struck Trump had “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear.” He also revealed that Trump had received a CT scan at the hospital. But federal law enforcement involved in the investigation, including the FBI and Secret Service, had declined to confirm that account. And Wray’s testimony offered apparently conflicting answers on the issue. “There’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray testified, before he seemed to suggest it was indeed a bullet. “I don’t know whether that bullet, in addition to causing the grazing, could have also landed somewhere else,” he said. The following day, the FBI sought to clarify matters with a statement affirming that the shooting was an “attempted assassination of former President Trump which resulted in his injury, as well as the death of a heroic father and the injuries of several other victims.” The FBI also said Thursday that its Shooting Reconstruction Team continues to examine bullet fragments and other evidence from the scene. Jackson, who has been treating the former president since the night of the July 13 shooting, told The Associated Press on Thursday that any suggestion Trump’s ear was bloodied by anything other than a bullet was reckless. “It was a bullet wound,” said Jackson. “You can’t make statements like that. It leads to all these conspiracy theories.” In his letter Friday, Jackson insisted “there is absolutely no evidence” Trump was struck by anything other than a bullet and said it was “wrong and inappropriate to suggest anything else.” He wrote that at Butler Memorial Hospital, where the GOP nominee was rushed after the shooting, he was evaluated and treated for a “Gunshot Wound to the Right Ear.” “Having served as an Emergency Medicine physician for over 20 years in the United States Navy, including as a combat physician on the battlefield in Iraq,” he wrote, “I have treated many gunshot wounds in my career. Based on my direct observations of the injury, my relevant clinical background, and my significant experience evaluating and treating patients with similar wounds, I completely concur with the initial assessment and treatment provided by the doctors at nurses at Butler Memorial Hospital on the day of the shooting.” The FBI declined to comment on the Jackson letters. Asked if the campaign would release those hospital records, or allow the doctors who treated him there to speak, Trump campaign spokesperson Steven Cheung blasted the media for asking. “The media has no shame in engaging in disgusting conspiracy theories,” he said. “The facts are the facts, and to question an abhorrent assassination attempt that ultimately cost a life and injured two others is beyond the pale.” In emails last week, he told the AP that “medical readouts” had already been provided. “It’s sad some people still don’t believe a shooting happened,” Cheung said, “even after one person was killed and others were injured.” Anyone who believes the conspiracies, he added, “is either mentally deficient or willfully peddling falsehoods for political reasons.” Sen. Lindsey Graham, R-S.C., a close Trump ally, also urged Wray to correct his testimony in a letter Friday to the FBI director, saying the fact Trump had been hit by a bullet “was made clear in briefings my office received and should not be a point of contention.” “As head of the FBI, you should not be creating confusion about such matters, as it further undercuts the agency’s credibility with millions of Americans,” he wrote. Trump also lashed out at Wray in a post on his Truth Social network, saying it was “No wonder the once storied FBI has lost the confidence of America!” “No, it was, unfortunately, a bullet that hit my ear, and hit it hard. There was no glass, there was no shrapnel,” he wrote. On Friday, he called Wray’s comments “so damaging to the Great People that work in the FBI.” Jackson has faced significant scrutiny over the years. After administering a physical to Trump in 2018, he drew headlines for suggesting that “if he had a healthier diet over the last 20 years, he might live to be 200 years old.” He was reportedly demoted by the Navy after the Department of Defense inspector general released a scathing report on his conduct as a top White House physician that found Jackson had made “sexual and denigrating” comments about a female subordinates and took prescription-strength sleeping medication that prompted worries from his colleagues about his ability to provide proper medical care. Trump appointed Wray in 2017 to replace the fired James Comey as director of the FBI. But the then-president swiftly soured on his hire as the bureau continued its investigation into the Russian election interference. Trump flirted openly with the idea of firing Wray as his term drew to a close, and he lashed out anew after the FBI executed a search warrant at his Mar-a-Lago estate in Florida to recover boxes of classified documents from his presidency. ___ Colvin reported from New York.","summary":"The FBI says former President Donald Trump was struck in the ear by a bullet during an assassination attempt on July 13, as the agency moved Friday to clarify what happened after nearly two weeks of confusion and conflicting accounts","url":"https://www.independent.co.uk/news/world/americas/donald-trump-ap-ronny-jackson-fbi-christopher-wray-b2586781.html","image":"https://static.independent.co.uk/2024/07/27/00/Election_2024_Trump_95580.jpg?width=1200","video":null,"publish_date":"2024-07-26 23:17:57","author":"Bernard Condon and Jim Mustian,Eric Tucker,Jill Colvin","authors":["Bernard Condon and Jim Mustian","Eric Tucker","Jill Colvin"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.386},{"id":252727510,"title":"Gerald Ford's Eerie 1989 Prediction: The Almost-Spot-On Path to America's First Female President","text":"In 1989, former U.S. President Gerald Ford made a bold prediction about how America would get its first female president. His words, captured on video, have recently resurfaced due to their eerie similarity to current events. Ford was speaking to students at a conference in Iowa about the role of former presidents. A young student asked him what advice he'd give a girl who wanted to become president. Ford's response was both surprising and specific. \"I hope we do have a young lady at some point become President of the United States,\" Ford began. He then outlined how he thought it would happen: \"Either the Republican or Democrat political party will nominate a man for President and a woman for Vice President, and the woman and man will win. So you'll end up with a President, a male, and a Vice President, a female,\" as per The News. This part of Ford's prediction came true in 2021 as Joe Biden became president and Kamala Harris became the first female vice president. But Ford didn't stop there. He continued: \"And in that term of office of the President, the President will die. And the woman will become President under the law or Constitution.\" President Biden didn't die but he recently dropped out of the 2024 presidential race. He said it was because of health concerns and the need for fresh younger voices. This surprise move might mean Vice President Harris could be the next Democratic nominee. Ford's prediction gets even more intriguing. He added, \"And once that barrier is broken, from then on, men better be careful, because they'll have a hard, hard time ever even getting a nomination in the future,\" as per The Boing Boing. Ford’s path to the presidency was kind of unique too. He never actually won a general election for president or vice president. He became vice president in 1973 after Spiro Agnew resigned. Then when President Richard Nixon resigned, Ford stepped up and became president. Ford's prediction didn't come true as quickly as he thought. He told the students it would happen \"in the next four or eight years.\" It's been 35 years, and America still hasn't had a female president. The old video of Ford predicting the future has got people talking about how American politics has changed. He might have gotten the timing wrong, but his idea about the path to America's first female president could still come true. Vice President Harris is now set to possibly become the first woman president but unlike Ford's prediction, she has to win an election for it. Harris has got enough Democratic delegates to win her party's nomination but it still needs to be made official. She's going to face Republican nominee Donald Trump in the November election.","summary":"&#34;I hope we do have a young lady at some point become President of the United States,&#34; Ford began. He then outlined how he thought it would happen.","url":"https://www.inquisitr.com/gerald-fords-eerie-1989-prediction-the-almost-spot-on-path-to-americas-first-female-president","image":"https://dab57h0r8ahff.cloudfront.net/707436/uploads/d1ffe6d0-4b3a-11ef-a055-5fe4a0eb2515_1200_630.jpeg","video":null,"publish_date":"2024-07-26 23:16:03","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","source_country":"US","sentiment":-0.091},{"id":252727768,"title":"What does the future of U.S. foreign policy look like?","text":"What does the future of U.S. foreign policy look like? Republican presidential nominee Donald Trump met with Israeli Prime Minister Benjamin Netanyahu on Friday in Florida. The meeting took place just one day after the Israeli leader met with President Biden and Vice President Kamala Harris separately at the White House. Jon Alterman, senior vice president and director of the Middle East Program at the Center for Strategic and International Studies, joins to examine how the high-stakes talks could shape American foreign policy in the Middle East.","summary":"Republican presidential nominee Donald Trump met with Israeli Prime Minister Benjamin Netanyahu on Friday in Florida. The meeting took place just one day after the Israeli leader met with President Biden and Vice President Kamala Harris separately at the White House. Jon Alterman, senior vice president and director of the Middle East Program at the Center for Strategic and International Studies, joins to examine how the high-stakes talks could shape American foreign policy in the Middle East.","url":"https://www.cbsnews.com/video/what-does-future-us-foreign-policy-look-like/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/26/f1d0e0fc-1ce4-4d4a-96bc-1df3ff9c46f9/thumbnail/1200x630/3998acaddc024b49a5fc8f51f1f16349/cbsn-fusion-what-does-future-us-foreign-policy-look-like-thumbnail.jpg?v=5501038cbc281520ff9fdc308faab7dc","video":null,"publish_date":"2024-07-26 23:14:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.149},{"id":252727038,"title":"Doug Emhoff says his ex-wife is ‘in the fight’ for current wife and candidate Kamala Harris","text":"It’s all hands on deck for Vice President’s Kamala Harris’ rushed bid for the White House. And, yes, that even includes her husband, Doug Emhoff’s, ex-wife, Kerstin. On Thursday, the second gentleman was a guest of honor on a “Black Gay and Queer Men for Harris” call, where he vowed to do, “everything in my power to make sure we win this election.” “They’re throwing the kitchen sink at you. My ex-wife is in the fight. Everyone’s in the fight. We have to protect [Harris], pray for her and make sure she wins,” he said. Doug’s ex has already come out defending Harris against what she called “baseless attacks” from Donald Trump’s VP pick, JD Vance. Kerstin, who shares son, Cole, 29, and daughter Ella, 25, with Doug, released a statement slamming Vance’s 2021 comments branding Harris and several other female public figures as, “a bunch of childless cat ladies who are miserable at their own lives.” “These are baseless attacks. For over 10 years, since Cole and Ella were teenagers, Kamala has been a co-parent with Doug and I,” Kerstin fired back in a statement to CNN. “She is loving, nurturing, fiercely protective, and always present. I love our blended family and am grateful to have her in it,” she said. “Friends” star, Jennifer Aniston, 55, also weighed in on the comment, telling Vance, “I pray that your daughter is fortunate enough to bear children of her own one day. I hope she will not need to turn to IVF as a second option. Because you are trying to take that away from her, too.” Vance addressed his cat lady comment in an interview with Megyn Kelly on Friday. He told the conservative host the message was for the “childless left.” “I know the media wants to attack me and wants me to back down on this, Megyn, but the simple point I made is that having children, becoming a father, becoming a mother… I really do think it changes your perspective in a pretty profound way,” he said. A “White Women for Harris” call this week that brought in 100,000 people — including Maria Shriver, Pink and Connie Britton — crashed Zoom. An earlier “Black Women for Harris” Zoom session inspired the subsequent calls, which also included “A Black Men for Harris” virtual fundraiser. Don Lemon attended, and he also spoke at the Black Gay and Queer Men for Harris call, which was organized by Emil Wilbekin, Alphonso David, and Rashad Robinson. The calls have raised millions for Harris’ campaign, and Michael Skolnik is organizing a “White Dudes for Harris” call on Monday. “We up next,” he wrote on X. Meanwhile, Doug wants Harris to get some rest. He ended his call by telling the men, “I’m going to go upstairs, give her a big hug, and say, ‘Go get some rest honey, because we got about 102-ish days left to save our country!”","summary":"The second gentleman was a guest of honor at a \"Black Gay and Queer Men for Harris\" virtual meeting.","url":"https://pagesix.com/2024/07/26/gossip/doug-emhoffs-ex-wife-kerstin-is-in-the-fight-with-kamala-harris-he-says/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/07/86071490.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-26 23:08:32","author":"Carlos Greer","authors":["Carlos Greer"],"language":"en","source_country":"us","sentiment":0.08},{"id":252726966,"title":"Ben Shapiro Bets Donald Trump Regrets Picking J.D. Vance","text":"In the wake of Democratic presidential nominee Kamala Harris’ record-breaking fundraising numbers, Ben Shapiro has an answer for anyone wondering if Donald Trump would pick J.D. Vance as his running mate again: “I doubt it.” “I think he probably would have picked somebody like Glenn Youngkin from Virginia in an attempt to broaden out his base,” Shapiro said on the latest episode of his self-titled show, according to Media Matters. “Instead, he went with J.D. Vance feeling, because he was right that at the time, he had a very solid advantage in the race against Joe Biden.” Shapiro was referring to President Joe Biden’s murmuring debate performance two weeks before the Republican National Convention in Milwaukee last week. That performance was the catalyst for Biden quitting the race and why Trump felt comfortable choosing a running mate who defies the traditions of picking a candidate that shores up support with the party’s larger base. But Donald Trump does not have a “time machine” and can’t pick a new candidate to help him beat Harris, as Shapiro acknowledged. Instead, much like his new boss, Vance has a very brief resume on the political stage nationally, but it’s long enough that Democrats can cherry-pick and exploit his worst past comments. Shapiro dog piled onto the criticism of Vance for calling Harris one of the “childless cat ladies” running the nation and lamented that Democrats will take the Ohio senator’s characterization and use it as a cudgel in the “gender gap” among voters. Vance doubled down on his cat lady comments on Friday, telling listeners of the The Megyn Kelly Show that it was a “sarcastic” comment. “I’ve got nothing against cats,” Vance added.","summary":"Anna Moneymaker/Getty ImagesIn the wake of Democratic presidential nominee Kamala Harris’ record-breaking fundraising numbers, Ben Shapiro has an answer for anyone wondering if Donald Trump would pick J.D. Vance as his running mate again: “I doubt it.”\n\n“I think he probably would have picked somebody like Glenn Youngkin from Virginia in an attempt to broaden out his base,” Shapiro said on the latest episode of his self-titled show, according to Media Matters. “Instead, he went with J.D. Vance feeling, because he was right that at the time, he had a very solid advantage in the race against Joe Biden.”\n\nShapiro was referring to President Joe Biden’s murmuring debate performance two weeks before the Republican National Convention in Milwaukee last week. That performance was the catalyst for Biden quitting the race and why Trump felt comfortable choosing a running mate who defies the traditions of picking a candidate that shores up support with the party’s larger base.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/ben-shapiro-bets-donald-trump-regrets-picking-jd-vance","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1722028125/MixCollage-26-Jul-2024-05-08-PM-6733_gtcyot","video":null,"publish_date":"2024-07-26 23:04:33","author":"Josephine Walker","authors":["Josephine Walker"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.321},{"id":252727994,"title":"FBI says Trump was indeed struck by bullet during assassination attempt","text":"WASHINGTON (AP) — Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the agency said in a statement. The statement from the FBI marked the most definitive law enforcement account of Trump’s injuries and followed ambiguous comments earlier in the week from Director Christopher Wray that appeared to cast doubt on whether Trump had actually been hit by a bullet. The comment drew fury from Trump and his allies and further stoked conspiracy theories that have flourished on both sides of the political aisle amid a dearth of information following the July 13 attack. Up until now, federal law enforcement agents involved in the investigation, including the FBI and Secret Service, had repeatedly refused to provide information about what caused Trump’s injuries. Trump’s campaign has also declined to release medical records from the hospital where he was first treated or to make the doctors there available for questions. Updates have instead come either from Trump himself or from Trump’s former White House doctor, Ronny Jackson, a staunch ally who who now represents Texas in Congress. Though Jackson has been treating Trump since the night of the attack, he has come under considerable scrutiny and is not Trump’s primary care physician. The FBI’s apparent reluctance to immediately vouch for the former president’s version of events — along with the ire he and some supporters have directed at the bureau in the shooting’s aftermath — has also raised fresh tension between the Republican nominee and the nation’s premier federal law enforcement agency, which he could soon exert control over once again. Trump and his supporters have repeatedly accused federal law enforcement of being weaponized against him. Questions about the extent and nature of Trump’s wound began immediately after the attack, as his campaign and law enforcement officials declined to answer questions about his condition or the treatment he received after Trump narrowly escaped death in an attempted assassination by a gunman with a high-powered rifle. Those questions have persisted despite photos showing the trace of a projectile speeding past Trump’s head, photographs that show Trump’s teleprompter glass intact after the shooting, and the account Trump himself gave in a Truth Social post within hours of the shooting saying he had been “shot with a bullet that pierced the upper part of my right ear.” “I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,” he wrote. Days later, in a speech accepting the nomination at the Republican National Convention in Milwaukee, Trump described the horrific scene in detail, while wearing a large, white, gauze bandage over his right ear. “I heard a loud whizzing sound and felt something hit me really, really hard, on my right ear. I said to myself, ‘Wow, what was that? It can only be a bullet,’” he said. “If I had not moved my head at that very last instant,” Trump said, “the assassin’s bullet would have perfectly hit its mark, and I would not be here tonight.” But the first medical account of Trump’s condition didn’t come until a full week after the shooting, when Jackson released his first letter last Saturday evening. In that letter, he said the bullet that struck Trump had “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear.” He also revealed that Trump had received a CT scan at the hospital. But federal law enforcement involved in the investigation, including the FBI and Secret Service, had declined to confirm that account. And Wray’s testimony offered apparently conflicting answers on the issue. “There’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray testified, before he seemed to suggest it was indeed a bullet. “I don’t know whether that bullet, in addition to causing the grazing, could have also landed somewhere else,” he said. The following day, the FBI sought to clarify matters with a statement affirming that the shooting was an “attempted assassination of former President Trump which resulted in his injury, as well as the death of a heroic father and the injuries of several other victims.” The FBI also said Thursday that its Shooting Reconstruction Team continues to examine bullet fragments and other evidence from the scene. Jackson, who has been treating the former president since the night of the July 13 shooting, told The Associated Press on Thursday that any suggestion Trump’s ear was bloodied by anything other than a bullet was reckless. “It was a bullet wound,” said Jackson. “You can’t make statements like that. It leads to all these conspiracy theories.” In his letter Friday, Jackson insisted “there is absolutely no evidence” Trump was struck by anything other than a bullet and said it was “wrong and inappropriate to suggest anything else.” He wrote that at Butler Memorial Hospital, where the GOP nominee was rushed after the shooting, he was evaluated and treated for a “Gunshot Wound to the Right Ear.” “Having served as an Emergency Medicine physician for over 20 years in the United States Navy, including as a combat physician on the battlefield in Iraq,” he wrote, “I have treated many gunshot wounds in my career. Based on my direct observations of the injury, my relevant clinical background, and my significant experience evaluating and treating patients with similar wounds, I completely concur with the initial assessment and treatment provided by the doctors at nurses at Butler Memorial Hospital on the day of the shooting.” The FBI declined to comment on the Jackson letters. Asked if the campaign would release those hospital records, or allow the doctors who treated him there to speak, Trump campaign spokesperson Steven Cheung blasted the media for asking. “The media has no shame in engaging in disgusting conspiracy theories,” he said. “The facts are the facts, and to question an abhorrent assassination attempt that ultimately cost a life and injured two others is beyond the pale.” In emails last week, he told the AP that “medical readouts” had already been provided. “It’s sad some people still don’t believe a shooting happened,” Cheung said, “even after one person was killed and others were injured.” Anyone who believes the conspiracies, he added, “is either mentally deficient or willfully peddling falsehoods for political reasons.” Sen. Lindsey Graham, R-S.C., a close Trump ally, also urged Wray to correct his testimony in a letter Friday to the FBI director, saying the fact Trump had been hit by a bullet “was made clear in briefings my office received and should not be a point of contention.” “As head of the FBI, you should not be creating confusion about such matters, as it further undercuts the agency’s credibility with millions of Americans,” he wrote. Trump also lashed out at Wray in a post on his Truth Social network, saying it was “No wonder the once storied FBI has lost the confidence of America!” “No, it was, unfortunately, a bullet that hit my ear, and hit it hard. There was no glass, there was no shrapnel,” he wrote. On Friday, he called Wray’s comments “so damaging to the Great People that work in the FBI.” Jackson has faced significant scrutiny over the years. After administering a physical to Trump in 2018, he drew headlines for suggesting that “if he had a healthier diet over the last 20 years, he might live to be 200 years old.” He was reportedly demoted by the Navy after the Department of Defense inspector general released a scathing report on his conduct as a top White House physician that found Jackson had made “sexual and denigrating” comments about a female subordinates and took prescription-strength sleeping medication that prompted worries from his colleagues about his ability to provide proper medical care. Trump appointed Wray in 2017 to replace the fired James Comey as director of the FBI. But the then-president swiftly soured on his hire as the bureau continued its investigation into the Russian election interference. Trump flirted openly with the idea of firing Wray as his term drew to a close, and he lashed out anew after the FBI executed a search warrant at his Mar-a-Lago estate in Florida to recover boxes of classified documents from his presidency. ___ Colvin reported from New York. Jill Colvin, Eric Tucker, Bernard Condon And Jim Mustian, The Associated Press","summary":"WASHINGTON (AP) — Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally. “What struck former President Trump in [&#8230;]","url":"https://toronto.citynews.ca/2024/07/26/fbi-says-trump-was-indeed-struck-by-bullet-during-assassination-attempt/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/07/4ae952e619fa7f3b4490f7ada227ee8cb6072d505d6a42cae317cbbfe8c7920d.jpg","video":null,"publish_date":"2024-07-26 23:01:09","author":"Jill Colvin,News Staff","authors":["Jill Colvin","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.379},{"id":252727564,"title":"FBI says Trump was indeed struck by bullet during assassination attempt","text":"By JILL COLVIN, ERIC TUCKER, BERNARD CONDON and JIM MUSTIAN WASHINGTON (AP) — Nearly two weeks after Donald Trump’s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president’s ear, moving to clear up conflicting accounts about what caused the former president’s injuries after a gunman opened fire at a Pennsylvania rally. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the agency said in a statement. The statement from the FBI marked the most definitive law enforcement account of Trump’s injuries and followed ambiguous comments earlier in the week from Director Christopher Wray that appeared to cast doubt on whether Trump had actually been hit by a bullet. The comment drew fury from Trump and his allies and further stoked conspiracy theories that have flourished on both sides of the political aisle amid a dearth of information following the July 13 attack. Up until now, federal law enforcement agents involved in the investigation, including the FBI and Secret Service, had repeatedly refused to provide information about what caused Trump’s injuries. Trump’s campaign has also declined to release medical records from the hospital where he was first treated or to make the doctors there available for questions. Updates have instead come either from Trump himself or from Trump’s former White House doctor, Ronny Jackson, a staunch ally who who now represents Texas in Congress. Though Jackson has been treating Trump since the night of the attack, he has come under considerable scrutiny and is not Trump’s primary care physician. The FBI’s apparent reluctance to immediately vouch for the former president’s version of events — along with the ire he and some supporters have directed at the bureau in the shooting’s aftermath — has also raised fresh tension between the Republican nominee and the nation’s premier federal law enforcement agency, which he could soon exert control over once again. Trump and his supporters have repeatedly accused federal law enforcement of being weaponized against him. Questions about the extent and nature of Trump’s wound began immediately after the attack, as his campaign and law enforcement officials declined to answer questions about his condition or the treatment he received after Trump narrowly escaped death in an attempted assassination by a gunman with a high-powered rifle. Those questions have persisted despite photos showing the trace of a projectile speeding past Trump’s head, photographs that show Trump’s teleprompter glass intact after the shooting, and the account Trump himself gave in a Truth Social post within hours of the shooting saying he had been “shot with a bullet that pierced the upper part of my right ear.” “I knew immediately that something was wrong in that I heard a whizzing sound, shots, and immediately felt the bullet ripping through the skin,” he wrote. Days later, in a speech accepting the nomination at the Republican National Convention in Milwaukee, Trump described the horrific scene in detail, while wearing a large, white, gauze bandage over his right ear. “I heard a loud whizzing sound and felt something hit me really, really hard, on my right ear. I said to myself, ‘Wow, what was that? It can only be a bullet,’” he said. “If I had not moved my head at that very last instant,” Trump said, “the assassin’s bullet would have perfectly hit its mark, and I would not be here tonight.” But the first medical account of Trump’s condition didn’t come until a full week after the shooting, when Jackson released his first letter last Saturday evening. In that letter, he said the bullet that struck Trump had “produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear.” He also revealed that Trump had received a CT scan at the hospital. But federal law enforcement involved in the investigation, including the FBI and Secret Service, had declined to confirm that account. And Wray’s testimony offered apparently conflicting answers on the issue. “There’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray testified, before he seemed to suggest it was indeed a bullet. “I don’t know whether that bullet, in addition to causing the grazing, could have also landed somewhere else,” he said. The following day, the FBI sought to clarify matters with a statement affirming that the shooting was an “attempted assassination of former President Trump which resulted in his injury, as well as the death of a heroic father and the injuries of several other victims.” The FBI also said Thursday that its Shooting Reconstruction Team continues to examine bullet fragments and other evidence from the scene. Jackson, who has been treating the former president since the night of the July 13 shooting, told The Associated Press on Thursday that any suggestion Trump’s ear was bloodied by anything other than a bullet was reckless. “It was a bullet wound,” said Jackson. “You can’t make statements like that. It leads to all these conspiracy theories.” In his letter Friday, Jackson insisted “there is absolutely no evidence” Trump was struck by anything other than a bullet and said it was “wrong and inappropriate to suggest anything else.” He wrote that at Butler Memorial Hospital, where the GOP nominee was rushed after the shooting, he was evaluated and treated for a “Gunshot Wound to the Right Ear.” “Having served as an Emergency Medicine physician for over 20 years in the United States Navy, including as a combat physician on the battlefield in Iraq,” he wrote, “I have treated many gunshot wounds in my career. Based on my direct observations of the injury, my relevant clinical background, and my significant experience evaluating and treating patients with similar wounds, I completely concur with the initial assessment and treatment provided by the doctors at nurses at Butler Memorial Hospital on the day of the shooting.” The FBI declined to comment on the Jackson letters. Asked if the campaign would release those hospital records, or allow the doctors who treated him there to speak, Trump campaign spokesperson Steven Cheung blasted the media for asking. “The media has no shame in engaging in disgusting conspiracy theories,” he said. “The facts are the facts, and to question an abhorrent assassination attempt that ultimately cost a life and injured two others is beyond the pale.” In emails last week, he told the AP that “medical readouts” had already been provided. “It’s sad some people still don’t believe a shooting happened,” Cheung said, “even after one person was killed and others were injured.” Anyone who believes the conspiracies, he added, “is either mentally deficient or willfully peddling falsehoods for political reasons.” Sen. Lindsey Graham, R-S.C., a close Trump ally, also urged Wray to correct his testimony in a letter Friday to the FBI director, saying the fact Trump had been hit by a bullet “was made clear in briefings my office received and should not be a point of contention.” “As head of the FBI, you should not be creating confusion about such matters, as it further undercuts the agency’s credibility with millions of Americans,” he wrote. Trump also lashed out at Wray in a post on his Truth Social network, saying it was “No wonder the once storied FBI has lost the confidence of America!” “No, it was, unfortunately, a bullet that hit my ear, and hit it hard. There was no glass, there was no shrapnel,” he wrote. On Friday, he called Wray’s comments “so damaging to the Great People that work in the FBI.” Jackson has faced significant scrutiny over the years. After administering a physical to Trump in 2018, he drew headlines for suggesting that “if he had a healthier diet over the last 20 years, he might live to be 200 years old.” He was reportedly demoted by the Navy after the Department of Defense inspector general released a scathing report on his conduct as a top White House physician that found Jackson had made “sexual and denigrating” comments about a female subordinates and took prescription-strength sleeping medication that prompted worries from his colleagues about his ability to provide proper medical care. Trump appointed Wray in 2017 to replace the fired James Comey as director of the FBI. But the then-president swiftly soured on his hire as the bureau continued its investigation into the Russian election interference. Trump flirted openly with the idea of firing Wray as his term drew to a close, and he lashed out anew after the FBI executed a search warrant at his Mar-a-Lago estate in Florida to recover boxes of classified documents from his presidency. ___ Colvin reported from New York.","summary":"By JILL COLVIN, ERIC TUCKER, BERNARD CONDON and JIM MUSTIAN WASHINGTON (AP) &#8212; Nearly two weeks after Donald Trump&#8217;s near assassination, the FBI confirmed Friday that it was indeed a bullet that struck the former president&#8217;s ear, moving to clear up conflicting accounts about what caused the former president&#8217;s injuries after a gunman opened fire [&#8230;]","url":"https://www.bostonherald.com/2024/07/26/fbi-says-trump-was-indeed-struck-by-bullet-during-assassination-attempt-2/","image":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","video":null,"publish_date":"2024-07-26 23:00:23","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.412},{"id":252726782,"title":"Chris Wray’s attempt to cast doubt on Trump assassination attempt is all politics","text":"FBI Director Christopher Wray chose to fan the flames of conspiracy in his House Judiciary Committee testimony Wednesday. Discussing the July 13 assassination attempt on Donald Trump, he declared: “With respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear.” Huh? In the hours right afterward, a few outlets raised doubts — but that pretty well was laid to rest by the jaw-dropping picture of a bullet whizzing by Trump’s head. And it should mean something that Trump, the owner of the ear in question, has firmly stated it was a bullet that clipped him, as has his physician. And if Wray really wanted to cover his butt, all he needed to say is: Our investigation is still in its early stages; we haven’t tracked the trajectory of every bullet yet. As FBI director, Wray should be letting the evidence speak for itself, not coyly slinging snark and encouraging the tinfoil-hat crowd. As a veteran of many a hearing, he knew exactly what he was doing. The Trump camp is furious, at rightly so: This is yet more weaponization of federal law enforcement against the GOP nominee. Wray just earned his way out the door (deservedly) if Trump wins in November.","summary":"Discussing the July 13 assassination attempt on Donald Trump, FBI Director Christopher Wray declared: \"With respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear.\"","url":"https://nypost.com/2024/07/26/opinion/christopher-wrays-comments-on-donald-trump-assassination-attempt/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-ljgs5td62-1722031497797.jpg?quality=75&strip=all&1722017153&w=1200","video":null,"publish_date":"2024-07-26 23:00:04","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.026},{"id":252727170,"title":"Trump was hit by a bullet in the ear during rally shooting, FBI confirms","text":"Former president Donald Trump was clipped in the ear by a gunman’s bullet 13 days ago at a Pennsylvania rally — not a piece of shrapnel or debris kicked up by a round, the FBI announced Friday afternoon. “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the bureau said in a statement. Trump quickly replied in a post on his Twitter clone, Truth Social, writing, “I assume that’s the best apology that we’ll get from Director Wray, but it is fully accepted!” On Thursday, FBI Director Christopher Wray — who Trump appointed during his single term as president — testified before Congress about the July 13 attempt on Trump’s life at a campaign stop near Pittsburgh. “I think with respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear,” Wray told members of the House Judiciary Committee. “There’s a whole lot of work underway and still a lot of work to do.” That evening, an enraged Trump then lashed out at Wray online, posting an angry screed on Truth Social, claiming, disingenuously, that the FBI’s top cop is focused “only” on “destroying J6 Patriots, Raiding Mar-a-Lago, and saving Radical Left Lunatics, like the ones now in D.C. burning American flags and spray painting over our great National Monuments — with zero retribution. No, it was, unfortunately, a bullet that hit my ear, and hit it hard.” Trump, who has since made copious political hay of the shooting, appeared fixated on Wray’s testimony deep into Friday. He “re-truthed” a letter posted by Ronny Jackson, his former personal physician-turned-Republican congressman, which argued that Trump had been shot by a bullet, shared another letter from Sen. Lindsey Graham (R-S.C.) who insisted Wray “correct [his] testimony” to specify that Trump was injured by a bullet, and posted an apparent quote from former Fox News personality Tucker Carlson, saying, “Chris Wray is a liar and a criminal and I hope he’s reading this.” He continued the harangue in another post, ​​claiming Wray’s testimony was “so damaging to the Great People that work in the FBI.” “Nobody ever called, even out of curiosity, from the Federal Bureau of Insurrection,” Trump seethed. Neither Trump nor his campaign have issued an official statement detailing his injuries. They also have publicly released any medical records pertaining to the shooting and have not permitted any of the medical staff who treated him to talk to the media.","summary":"In congressional testimony on Thursday, FBI Director Christopher Wray said investigators still had “some question about whether or not it’s a bullet or shrapnel that hit [the former president’s] ear.”","url":"https://www.independent.co.uk/news/world/americas/trump-shooting-rally-fbi-bullet-b2586770.html","image":"https://static.independent.co.uk/2024/07/23/16/2161435888.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/qp7QGVes-4VHSaSK0.mp4","publish_date":"2024-07-26 22:59:01","author":"Justin Rohrlich","authors":["Justin Rohrlich"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.251},{"id":252726758,"title":"Jen Psaki apologizes to Afghanistan Gold Star families in congressional interview","text":"Former White House press secretary Jen Psaki extended an apology to the families of the 13 Gold Star military service members who died in the U.S. withdrawal from Afghanistan in 2021 on Friday. During a transcribed interview, Foreign Affairs Committee Chairman Michael McCaul (R-TX) asked Psaki about her comments that she wrote in her book, Say More, that stated President Joe Biden never looked at his watch during a ceremony in late August 2021 honoring soldiers killed in Afghanistan returning home. “The chairman asked Ms. Psaki about her comments regarding President Biden looking at his watch while at Dover [Air Force Base] and asked her if she had anything she wanted to say to the families on the record,” Leslie Shedd, Foreign Affairs Committee majority spokeswoman, said in a statement to the Washington Examiner. “After pressing her multiple times if she had something she wanted to say to them, Ms. Psaki asked the chairman to pass along her apology to the families and to express her regret for the pain she caused them. He has done that.” Biden’s demeanor during the return of the service members killed in Afghanistan has been used by Republicans and former President Donald Trump as evidence to claim that Biden is an unempathetic leader. Psaki’s statement that the incident of checking his watch never occurred contrasted with several photographs taken of the day by news agencies, including the Associated Press. Mark Schmitz, the father of Marine Lance Cpl. Jared Schmitz, told Congress in August 2023 that “while I stood there on the tarmac watching you check your watch over and over again, all I wanted to do was shout out, ‘It’s 2 f***ing 30, ass****.'” The day after the ceremony, Shana Chappell, the mother of Marine Lance Cpl. Kareem Nikoui, wrote, “I watched you disrespect us all 5 different times by checking your watch!!! What the f*** was so important that you had to keep looking at your watch????” in a post on Facebook. Rep. Mike Waltz (R-FL), the first U.S. Army Green Beret to be elected to Congress, spoke to Psaki’s apology in a post to X on Friday afternoon. “Just left the House Foreign Affairs interview with Jen Psaki,” Waltz said. “She agreed to apologize to the 13 Afghanistan Gold Star families whom she falsely contradicted in her book when she said Biden didn’t look at his watch.” “This isn’t a partisan or gotcha moment,” Waltz continued. “This is the right thing to do as fellow Americans and I pray she follows through.” Psaki’s transcribed interview began at 11 a.m. on Friday and is expected to go on for a few more hours as of 5:30 p.m., per a source familiar.","summary":"Former White House press secretary Jen Psaki extended an apology to the families of the 13 Gold Star military service members who died in the U.S. withdrawal from Afghanistan in 2021 on Friday. During a transcribed interview, Foreign Affairs Committee Chairman Michael McCaul (R-TX) asked Psaki about her comments that she wrote in her book, [&#8230;]","url":"https://www.washingtonexaminer.com/news/house/3101403/jen-psaki-apology-afghanistan-gold-star-families/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Jen-Psaki.webp","video":null,"publish_date":"2024-07-26 22:57:03","author":"Rachel Schilke","authors":["Rachel Schilke"],"language":"en","source_country":"US","sentiment":-0.472},{"id":252726742,"title":"Top Democratic super PAC launches massive $50M ad spend for Harris leading up to DNC","text":"A top Democratic super PAC has launched a massive ad buy across several battleground states to boost Vice President Kamala Harris’ presidential candidacy leading up to the Democratic Party’s convention in Chicago next month. Future Forward, the largest Democratic-leaning super PAC, announced this week it will spend $50 million supporting Harris in six states in the next three weeks ahead of the convention in Chicago, The Washington Post reported. Additionally, the outlet reported that the second-largest independent supporter of Democrats, American Bridge 21st Century, will start placing ads Friday in the key swing state of Michigan. On top of that, Women Vote, part of the Emily’s List network, announced Thursday it was spending $2 million to target younger women in four battleground states. HARRIS WON'T SAY IF SHE'S PUSHING HAMAS TO AGREE TO A CEASE-FIRE AFTER PUBLICLY PRESSURING NETANYAHU \"We’re ready to hit the ground running to make sure voters know that Kamala Harris will be a president that fights for them,\" Future Forward President Chauncey McLean told The Washington Post Thursday. \"She is focused on improving the lives of all Americans, while Donald Trump is only focused on himself.\" TAKE IT FROM ME, REPUBLICANS: KAMALA HARRIS IS A STRONG CANDIDATE. DON'T UNDERESTIMATE HER David Axelrod, a former top adviser to former President Obama, called the move a \"big development.\" \"Pro-Harris SuperPAC to launch major buy in the battleground states, with an initial spot to highlight her battles as a DA, attorney general and VP,\" Axelrod posted on X. CLICK HERE TO GET THE FOX NEWS APP \"Essential air cover, especially as the Trump forces spend to define her negatively.\" One of the ads will describe Harris as \"the district attorney who protected children from sexual predators\" and \"the attorney general who stood up to the big banks to protect homeowners and won.\" The Washington Post reported that MAGA Inc. is also planning to spend $32 million going after Harris before Labor Day, which will bring its total spending during that period to $72 million. Fox News Digital reached out to the Trump campaign for comment but did not immediately receive a response. A new survey compiled after Biden dropped out of the race reveals Trump and Harris are tied in the crucial swing state of Michigan despite the former president's previous lead by nearly double digits. National polls have sent mixed signals, with some showing a tie and some showing a slight lead for either candidate. The New York Times/Siena College released a new survey this week that found Trump leads Harris by only one percentage point among likely voters, 48% to 47%. Among registered voters, Trump led Harris by two percentage points. Fox News Digital's Aubrie Spady contributed to this report","summary":"Democratic super PACs launched a massive spending campaign for Kamala Harris this week as she approaches the Democratic National Convention in Chicago next month.","url":"https://www.foxnews.com/politics/top-democratic-super-pac-launches-massive-50-million-ad-spend-for-harris-leading-up-to-dnc","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Harris-Trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-26 22:54:16","author":"Andrew Miller","authors":["Andrew Miller"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.29},{"id":252726738,"title":"Former FBI official Peter Strzok reaches $1.2 million settlement with DOJ","text":"Former FBI special agent Peter Strzok reached a $1.2 million settlement with the Justice Department over claims that the department violated his privacy and the Privacy Act when it released text messages between him and former FBI employee Lisa Page that criticized former President Donald Trump. One of Strzok's lawyers, Aitan D. Goelman, of Zuckerman Spaeder, said in a statement that it was a \"critical step forward in addressing the government's unfair and highly politicized treatment of Pete,\" and said the settlement \"also vindicates the privacy interests of all government employees.\" Former FBI special agent Peter Strzok is suing the FBI and Justice Department, claiming his firing in 2018 violated his rights to due process and free speech and was only carried out because of political pressure. The settlement resolves his privacy allegations, but the claims of unlawful termination are still being litigated. For that claim, he is seeking back pay and other payment for his employment.The Justice Department did not immediately respond to a request for comment.Strzok worked on then-special counsel Robert Mueller's team for a time and became a frequent target of President Trump after he wrote text messages criticizing Trump while he was a presidential candidate. Strzok, who filed the suit in the U.S. District Court for the District of Columbia, is trying to get his job with the FBI back. Strzok was removed from the Mueller probe after the messages were discovered and moved to a different office still within the FBI. His actions were scrutinized in a June 2018 Justice Department Inspector General report, and was escorted from the building later that summer. He also worked on the Hillary Clinton email investigation and on special counsel Robert Mueller's probe into Russian election meddling and any ties to Trump associates. Strzok testified before Congress in 2018 that he was \"deeply regretful\" of sending the anti-Trump texts to Page, but said he had done so with the expectation of privacy. \"I had no idea that this was going to happen,\" he said at the time.","summary":"Former FBI special agent Peter Strzok reached a $1.2 million settlement with DOJ over claims that it violated his privacy in releasing text messages with another former employee regarding Donald Trump.","url":"https://www.cbsnews.com/news/fbi-official-peter-strzok-trump-texts-1-2-million-settlement-doj/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/26/b0e93eca-906f-457e-af39-5ba748757e40/thumbnail/1200x630g2/96db705ada222ca5317a3c954ec1edb1/gettyimages-997223756.jpg?v=5501038cbc281520ff9fdc308faab7dc","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/2024/07/26/2358557251561/3079789_hls/master.m3u8","publish_date":"2024-07-26 22:52:09","author":"Robert Legare","authors":["Robert Legare"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.601},{"id":252726676,"title":"Two former FBI officials settle lawsuits with Justice Department over leaked text messages","text":"WASHINGTON (AP) — Two former FBI officials settled lawsuits with the Justice Department on Friday, resolving claims that their privacy was violated when the department leaked to the news media text messages that they had sent one another that disparaged former President Donald Trump. Peter Strzok, a former top counterintelligence agent who played a crucial role in the investigation into Russian election interference in 2016, settled his case for $1.2 million. Attorneys for Lisa Page, an FBI lawyer who exchanged text messages with Strzok, also confirmed that she had settled but did not disclose an amount. The two had sued the Justice Department over a 2017 episode in which officials shared copies with reporters of text messages they had sent each other, including ones that described Trump as an “idiot” and a ”loathsome human” and that called the prospect of a Trump victory “terrifying.” Strzok, who also investigated former Secretary of State Hillary Clinton’s use of a private email server, was fired after the text messages came to light. Page resigned. “This outcome is a critical step forward in addressing the government’s unfair and highly politicized treatment of Pete,” Strzok’s lawyer, Aitan Goelman, said in a statement Friday announcing the settlement. “As important as it is for him, it also vindicates the privacy interests of all government employees. We will continue to litigate Pete’s constitutional claims to ensure that, in the future, public servants are protected from adverse employment actions motivated by partisan politics,” he added. A spokesman for the Justice Department did not have an immediate comment Friday, Strzok also sued the department over his termination, alleging that the FBI caved to “unrelenting pressure” from Trump when it fired him and that his First Amendment rights were violated. Those constitutional claims have not been resolved by the tentative settlement. “While I have been vindicated by this result, my fervent hope remains that our institutions of justice will never again play politics with the lives of their employees,” Page said in a statement. Her attorneys said that “the evidence was overwhelming that the release of text messages to the press in December 2017 was for partisan political purposes and was against the law. ” Eric Tucker, The Associated Press","summary":"WASHINGTON (AP) — Two former FBI officials settled lawsuits with the Justice Department on Friday, resolving claims that their privacy was violated when the department leaked to the news media text messages that they had sent one another that disparaged former President Donald Trump. Peter Strzok, a former top counterintelligence agent who played a crucial [&#8230;]","url":"https://toronto.citynews.ca/2024/07/26/two-former-fbi-officials-settle-lawsuits-with-justice-department-over-leaked-text-messages/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/07/8391683aff2e8354b08e21943d2b3ae08f86b70c1e5acf339b052030425b0c26.jpg","video":null,"publish_date":"2024-07-26 22:51:56","author":"Eric Tucker,News Staff","authors":["Eric Tucker","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.483},{"id":252727474,"title":"OSV News Showcase | July 26, 2024","text":"Last week most of the OSV News team was at the National Eucharistic Congress: The general consensus I’ve heard from them is that it was a powerful, life-changing event and the Holy Spirit is at work. But if you’re like me and stayed home, how do you know what happened? If you’re short on time, here’s an overview of the entire week to start with. Below is a roundup of our coverage of the week in chronological order — we still have a few more pieces in the works that share even more of how God is moving the hearts, minds and hands of Catholics and what’s next for this Year of Mission. And if you haven’t already heard: next year there will be another Eucharistic pilgrimage crossing the United States, and another Eucharistic congress is being planned to happen in less than 10 years time. We’ll be sure to report on that when the time comes. Other news we’ve covered since the start of the National Eucharistic Congress includes the assassination attempt on former President Donald Trump, his choice of JD Vance as his VP running mate, President Joe Biden dropping out of the 2024 presidential race and his Oval Office address to the nation; prominent U.S. figures asking the pope not to further restrict the Latin Mass; accusations of abuse against the iconic French priest Abbé Pierre; Hurricane Beryl affecting the church in Grenada; the Knights of Columbus covering up mosaics in the St. John Paul II National Shrine created by artist Father Marko Rupnik, who is accused of abuse of several people; NFP Week; and more. Be sure to keep an eye on our social media (@OSVNews) for even more stories. Megan Marley Digital Editor P.S.: Enjoy reading this roundup? Sign up to receive our emails here. July 17 Excitement, expectation build ahead of National Eucharistic Congress’ opening revival night The streets outside Lucas Oil Stadium and the Indiana Convention Center in Indianapolis were abuzz with excitement July 17 as Catholics of all ages and walks of life gathered for the 10th National Eucharistic Congress, the first such congress in 83 years. Video: “Pre-Congress excitement!“ Video: “Team blessing from Indianapolis’ archbishop“ ‘Jesus, I trust in you’: National Eucharistic Congress opens with a powerful holy hour | ‘Jesús, en ti confío’: El Congreso Eucarístico Nacional empieza con una poderosa hora santa REVIVAL: Absolute silence filled Lucas Oil Stadium as tens of thousands of people dropped to their knees to adore Jesus Christ in the Blessed Sacrament as the long-anticipated National Eucharistic Congress officially got underway on the evening of July 17 in Indianapolis. Video: “JESUS HAS ARRIVED!“ July 18 National congress delves into the Eucharist as ‘the greatest love story ever told’ | El Congreso Nacional profundiza en la eucaristía como la historia de amor más grande, jamás contada DAILY RECAP: Hundreds of priests, around 100 bishops and several cardinals concelebrated the morning Mass in Lucas Oil Stadium July 18 – a liturgy that kicked off the first full day of the National Eucharistic Congress. Video: “First morning Mass for the first Eucharistic congress in the U.S. in 83 years“ Video: “Nico Cabrera y Kairy Márquez dirigen a los católicos al cantar alabando a Dios“ El amor de Jesús en la Eucaristía se derrama y se vuelve el centro de nuestras vidas Después de la Misa con el cardenal de Boston, Seán P. O’Malley, que fue concelebrada por varios obispos y muchos sacerdotes, cientos de católicos latinos participaron en el Encuentro — una de las sesiones de impacto del Congreso, la cual fue ofrecida en español. National congress’s second night of Eucharistic revival: ‘Only love can make a saint’ | Segunda noche de avivamiento eucarístico en el congreso nacional: ‘Solo el amor puede hacer un santo’ REVIVAL: While Father Mike Schmitz and Mother Mary Olga of the Sacred Heart moved participants with their inspiring keynote exhortations — the last word was given to the Eucharistic Lord. Video: “Adoration with polyphony by “Floriani”“ Here are 5 ways Father Mike Schmitz says Catholics can be better evangelizers | Las 5 maneras en las que los católicos pueden ser mejores evangelizadores, según el padre Mike Schmitz The college campus ministry chaplain from the Diocese of Duluth, Minn., is internationally renowned for his “Bible in a Year” and “Catechism in a Year” podcasts, provided through Catholic publisher Ascension, that have topped the podcasting charts in recent years. “Archbishop Cordileone: ‘Ten ingredients’ make for ‘recipe of Eucharistic revival’ “Ten ingredients” make for a “recipe of Eucharistic revival,” including greater focus on preparing for and participating in Mass, as well as integrating prayer and evangelization into daily life, said Archbishop Salvatore J. Cordileone of San Francisco during the July 18 celebration of a votive Mass according to the 1962 Roman Missal. Expert: God is ‘strongly connected’ to disability community, access to Eucharist is essential Charleen Katra, executive director of the National Catholic Partnership on Disability, shared her thoughts in a presentation titled “The Eucharist: Ensuring Access for All,” focused specifically on sacramental preparation and reception of the Eucharist. Seminarian seeks to support Catholic artists with display at congress, directory Sacred art is not only “a piece of us and our culture,” but also “something we pray with; it’s in our homes,” said Hunter Dickens, a seminarian of the Diocese of Owensboro, who designed an art display for the July 17-21 National Eucharistic Congress in Indianapolis and created the Catholic Artists Directory. July 19 Broglio encourages young people to repent, reconcile and extend mercy at Eucharistic congress | ‘La Eucaristía es semilla de comunión y sanación’, dice arzobispo en congreso eucarístico At the Mass for youth at the National Eucharistic Congress July 19, Archbishop Timothy P. Broglio of the U.S. Archdiocese for the Military Services, and president of the U.S. Conference of Catholic Bishops, spoke to young people about the importance of acknowledging sins and repenting for them. Congress’s Day 3 invites Catholics to find God’s healing in the Eucharist, share it with others | En su tercer día, el Congreso Eucarístico invita a los católicos a encontrar sanación en la Eucaristía, compartirlo con los demás DAILY RECAP: The third day of the national congress, held July 17-21 in Indianapolis, had as its theme “Into Gethsemane” — and it saw wide encouragement for congress-goers to experience healing in the Eucharist and then to bring Jesus’ healing to others. Video: “Are you AWAKE?“ Video: “He granted me a blessing of coming here“ Congress holds special revival night of Eucharistic adoration for healing hearts | Congreso celebra noche especial de avivamiento con adoración eucarística para sanar corazones REVIVAL: “Tonight, I am begging you on behalf of Jesus Christ: Healing begins with repentance,” Sister Josephine said, urging everyone to repent “in joy and confidence.” Umaña: ‘Corre hacia Jesús’ En la tercera noche de avivamiento del Congreso Eucarístico en Indianápolis, Paula Umaña caminó despacio en el escenario y, antes de dar su testimonio, levantó una pelota de tenis e hizo repetir al público una frase que aprendió de su madre y de su abuela: “Corre hacia Jesús”. Umaña fue una galardona tenista, que ocupó el primer puesto en el ranking de su país y de Centroamérica y el 280º del mundo. Las cosas tomaron un giro diferente tras dar a luz a su quinto hijo cuando ella enfermó de un trastorno del sistema nervioso que la dejó tetrapléjica en cama. Power of Eucharist draws people closer to Christ; ‘It means everything to me,’ says congress-goer Bob Willoughby has the kind of smile and sense of humor that draws people in easily — which is evident when he laughed and said that he didn’t want his photo taken but that “you can find my picture on the wall of the post office.” Yet his face changed from mirth and mischief to reverence and a touch of awe when he was asked about the impact of the Eucharist in his life. Sculptures at National Eucharistic Congress ‘crystallize a moment,’ sculptor says “I think artwork can crystallize a moment, and that’s what I think the two pieces that I have outside (the church) truly have done in terms of the National Eucharistic Congress — one with the idea of the pilgrim, and the other with the spirituality that happens in the Eucharist,” said Catholic sculptor Timothy Schmalz. July 20 Day 4 of national congress begins with historic liturgy, casts vision for church’s future | El cuarto día del Congreso Eucarístico Nacional comienza con una liturgia histórica, que lanza una visión del futuro de la Iglesia DAILY RECAP: At Lucas Oil Stadium, Day 4 of the National Eucharistic Congress, began with a liturgy — and a story — from the church that St. Thomas the Apostle planted in India. Video: “The Hillbilly Thomists’ fave Eucharistic hymn” Tens of thousands flood Indianapolis streets for largest U.S. Eucharistic procession in decades | Cientos de miles inundan las calles de Indianápolis en la procesión eucarística más grande en Estados Unidos en las últimas décadas PROCESSION: Tens of thousands of Catholics walked through the streets of downtown Indianapolis July 20 for what Bishop Andrew H. Cozzens said “might be the largest Eucharistic procession in the country in decades.” Video: “On-the-ground with the Eucharistic procession“ Final revival night energizes thousands at Eucharistic congress to be ‘alive again’ in Christ | La última noche de avivamiento renueva a miles en el Congreso Eucarístico para estar ‘vivos otra vez’ en Cristo REVIVAL: From the first moments of the final nighttime revival session at Lucas Oil Stadium July 20, an electricity coursed through the air with an intensity surpassing all the prior events of the National Eucharistic Congress. The Eucharist helps overcome polarization, live out the social mission, say congress speakers | La Eucaristía ayuda a superar la polarización y a vivir la misión social, dicen ponentes en el congreso Speaking on “The Eucharist in a Time of Polarization” at the National Eucharistic Congress July 20, Paulist Father Ricky Manolo provided practical suggestions like that one amid his assessment of the country’s political divisions and how to navigate this landscape with love and respect for one another. Exclusive: Cardinal Tagle on the congress, the Eucharist and what comes next | Entrevista con el cardenal Tagle, enviado papal, sobre el congreso, la Eucaristía y lo que está por venir Pope Francis’ special envoy to the congress, Cardinal Luis Antonio Tagle, a native of the Philippines and pro-prefect of the Dicastery for Evangelization’s Section for First Evangelization and New Particular Churches, gave an exclusive interview to OSV News. Video: “Cardinal Tagle on the congress, the Eucharist and what comes next” Thousands discover ‘beautiful diversity’ around the Eucharist at congress’s Eastern liturgies Thousands of pilgrims at the 10th National Eucharistic Congress experienced the “Eastern flavor” of Catholic liturgy, as they were exhorted to draw strength from the body and blood of Christ to become missionary disciples, bringing the Gospel to a world in need. July 21 National congress concludes, beginning a new era of Eucharistic ‘missionary conversion’ | Concluye el congreso nacional y comienza una nueva era de conversión misionera eucarística DAILY RECAP: The five days of the 10th National Eucharistic Congress in Indianapolis could not have ended in a more fitting way — with the celebration of the Eucharist with more than 50,000 people gathered. Video: “Eucharistic Karaoke“ Eucharistic pilgrimage planned for 2025, next congress before 2033 | Peregrinación eucarística prevista para 2025, próximo congreso para antes de 2033 A Eucharistic pilgrimage from Indianapolis to Los Angeles is being planned for spring 2025, Bishop Andrew H. Cozzens of Crookston, Minnesota, announced July 21 at the end of the 10th National Eucharistic Congress’ closing Mass. Congress organizers had also been considering holding an 11th National Eucharistic Congress in 2033, the “Year of Redemption,” 2,000 years after Jesus’ death and resurrection, but they’re now discerning organizing an event sooner. Congress calls on Catholics to ‘Walk with One,’ evangelize through ‘spiritual companionship’ YEAR OF MISSION: “What you received as a gift, you must give as a gift,” said Bishop Cozzens. “This year we’ve invited you to ‘walk’ with one person. What would happen if each of you thought of one person you know who’s currently away from the faith; and you decided to pray for them and befriend them and then invite them to take one step closer to Jesus and his church? Congress attendees ‘ready for everyone in the church to get on fire’ Even before the July 21 announcement that National Eucharistic Congress organizers are considering holding another congress in just a few years, 9-year-old Thomas Gangestad had prayed for it. Newlyweds volunteer at National Eucharistic Congress as ‘co-workers in the vineyard’ Shaughn and Claire Phillips did not register to attend the National Eucharistic Congress July 17-20 in Indianapolis. There simply wasn’t enough time as they planned for their June 22 wedding. Yet here they were, signed up for the entirety of the congress — donning the yellow shirts of volunteers. After the Congress Christ at the center in Indianapolis COLUMN: “Lord, we wanted to give you the first words of our National Eucharistic Congress,” Bishop Cozzens prayed. And it paid off, big time. Because when Christ is at the center, grace abounds. National congress sends forth Catholics to ignite new Pentecost as Eucharistic missionaries OVERVIEW OF THE WEEK: As five days of the National Eucharistic Congress concluded with one final revival and a beautiful solemn Mass in Lucas Oil Stadium — Bishop Andrew H. Cozzens of Crookston, Minnesota, board chairman of the National Eucharistic Congress Inc., stood in Lucas Oil Stadium. “I have a question for you,” he told the crowd. “This is the 10th National Eucharistic Congress — do you think we should do an 11th one?”","summary":"Last week most of the OSV News team was at the National Eucharistic Congress: The general consensus I&#8217;ve heard from them is that it was a powerful, life-changing event and the Holy Spirit is at work. But if you&#8217;re like me and stayed home, how do you know what happened? If you&#8217;re short on time, [&#8230;]\n\n\nThe post OSV News Showcase | July 26, 2024 first appeared on OSV News.","url":"https://www.osvnews.com/2024/07/26/osv-news-showcase-july-26-2024/","image":"https://www.osvnews.com/wp-content/uploads/2024/07/20240724T0800-NEC24-DAY1-OPENING-REVIVAL-1779856-1-1024x576.jpg","video":null,"publish_date":"2024-07-26 22:50:00","author":"Karla Fierro,Megan Marley","authors":["Karla Fierro","Megan Marley"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.426},{"id":252726610,"title":"Strictly Come Dancing's Giovanni Pernice is 'given a huge boost in his BBC bulling case' following Amanda Abbington claims he is blocking '50 hours of rehearsal footage'","text":"Home News Royals U.S. Sport Showbiz Femail Health Science Money Travel Podcasts Shopping Best Buys My Profile Logout Login Discounts TUI Booking.com ASOS Just Eat Deliveroo boohoo Very Nike Virgin Media Uber Eats Boots B&Q Amazon John Lewis My Profile Logout Login Headlines Showbiz Kim Kardashian Victoria Beckham Harry Styles Amanda Holden Britain's Got Talent My Profile Logout Login Privacy Policy Feedback Friday, Jul 26th 2024 1AM 16°C 4AM 16°C 5-Day Forecast Advertisement Forget the River Seine wash-out, naked Smurf, upside down flag and Lady Gaga's ostrich act... Paris triumphs to end opening ceremony with amazing spectacle of a FLYING Olympic cauldron and extraordinarily powerful return performance by Celine Dion Wet a mistake! Washout Paris opening ceremony descends into farce as Olympic flag is raised UPSIDE DOWN in front of the world's dignitaries under the Eiffel Tower after storms lashed the event, leaving stars soggy and spectators racing for cover Où est Wally? France's 5ft 7in president Emmanuel Macron is nearly impossible to see as he poses alongside world leaders in Paris for the Olympic Games Blue are you?! Most unusual star of Paris Olympics Opening Ceremony who appeared naked painted blue and served on a platter of fruit is revealed as beloved actor and singer Are they in-Seine?!! Viewers beg 'Stop the boats' as interminable Opening Ceremony down rain-soaked Paris river (complete with 'naked Smurf' and Minions) leaves public scratching their têtes Celine Dion fans left IN TEARS as star closes Olympics Opening Ceremony in front of Eiffel Tower with her 'timeless' voice after tragic battle with Stiff Person Syndrome Lady Gaga fans are left unimpressed as she performs Mon Truc en Plumes during Olympics 2024 Opening Ceremony as they claim she sang in 'French adjacent' How Celine Dion fought every day to be fit to open the Olympics: Star endured gruelling therapy for crippling and incurable Stiff Person Syndrome that 'feels like someone is strangling you' Cancel your holidays! British families are urged to stay at home after Heathrow flights cancelled, Eurostar plunged into chaos and 3.2million cars set to hit the roads on 'Frantic Friday' Kamala the 'soul-destroying bully': Former staff expose shock details of decades-long 'toxic' behavior, degrading tirades that left people in TEARS and quitting at unprecedented levels KENNEDY: Dumpy couch-potato J.D. Vance is deflating like a West Wing whoopee cushion! Trump must bitterly regret picking this lacklustre, sexist sofa-surfer BORIS JOHNSON: Ignore the gloomsters, the Olympics will be a triumph - and a rebuke to Labour's war on aspiration and achievements I found the last image of my missing son myself and had to search for him with my bare hands alone after police constantly fobbed me off. One mother's heartbreaking story... Chief Constable of Manchester Police releases tone deaf statement on airport fracas claiming 'some communities' were upset by 'stamping' video and blames investigation for not being able to release bodycam footage The most complained about shows so far this year - is YOUR favourite telly moment on the list? From bums to tums: the tell-tale signs someone you know is on Ozempic... and how to avoid them if you are Trump's doctor releases an update on his recovery from the shooting and responds to FBI investigating if he was really hit by a bullet Prince Philip and the showgirls: How a secret file contains the truth about the Duke and the Profumo affair - and why the Government refuses to let anyone see it After a night out drinking, I laughed off my 'blackout sex'. Only later did I realise I'd been raped - by two men REVEALED: All the evidence Trump WAS hit by a bullet and why he was RIGHT to be furious at FBI director for suggesting it was shrapnel Doctor weighs in on Trump's miraculous ear recovery How 'normal kids' are sucked into London's deadly postcode gang wars: The grooming tricks used to recruit children into marauding mobs that overwhelm police and fight turf wars that left one 15-year-old dead this week Ted Baker is at 'risk of shutting all its stores for good' amid claims staff have been given 'three weeks' notice that they'll be losing their jobs' Sicknote Britain: Economic inactivity due to ill health has soared 6-FOLD in parts of country since pre-Covid... so how bad is the crisis in YOUR area? Previous Next Strictly Come Dancing's Giovanni Pernice is 'given a huge boost in his BBC bulling case' following Amanda Abbington claims he is blocking '50 hours of rehearsal footage' Have YOU got a story? Email tips@dailymail.com By Chloe Louise For Mailonline Published:23:30 BST, 26 July 2024 |Updated:23:48 BST, 26 July 2024 e-mail 24 shares View comments Strictly Come Dancing's Giovanni Pernice has reportedly been given a huge boost in his BBC bulling case. The professional dancer, 33, has been at the center of a complaint feud in recent weeks after Amanda Abbington lodged a complaint with the BBC over Giovanni's behaviour. And following Amanda's complaints, other stars, such as Laura Whitmore and Ranvir Singh, are set to step forward and join her. But according to the Mirror, sources have said that the only formal allegations put to Giovanni after the BBC investigation involved Amanda. This reportedly suggested the BBC have ruled that the star doesn't have a case to answer for in relation to the other celebs, or that they didn't lodge a formal complaint in the first place. Strictly Come Dancing's Giovanni Pernice has reportedly been given a huge boost in his BBC bulling case (pictured in 2023) The professional dancer, 33, has been at the center of a complaint feud in recent weeks after Amanda Abbington (pictured) lodged a complaint with the BBC over Giovanni's behaviour But Amanda has previously suggested there are 'five or six' people affected by Giovanni's behaviour. A BBC source told the publication: 'The narrative - certainly from Amanda - is that there has been a tsunami of complainants to the BBC. 'But the truth of the matter is that Giovanni has only been asked for his response to Amanda's claims. 'This would suggest two things. One they haven't made a formal complaint in the first place or, two, the BBC felt it wasn't serious enough to warrant inclusion in their evidence dossier to put to Giovanni for response.' MailOnline has contacted Giovanni's representatives for a comment. The report comes just days after Strictly Come was plunged into further crisis on Wednesday after Amanda claimed that Giovanni was trying to block the release of up to 50 hours of 'toxic' footage'. In an emotionally charged interview, the actress, 50, compared the dance show to 'the trenches' telling Channel 4 News that BBC producers had been left 'horrified' by clips that also allegedly exhibited 'humiliating behaviour of a sexual nature'. The Sherlock star sensationally quit the dance competition last year citing 'personal reasons' before reports surfaced that she had demanded footage of her rehearsals after the experience with the show and her dance partner left her with PTSD. But, according the Mirror, sources have said that the only formal allegations put to Giovanni after the BBC investigation involved Amanda This reportedly suggested the BBC have ruled that the star doesn't have a case to answer for in relation to the other celebs or that they didn't lodge a formal complaint in the first place But Amanda has previously suggested there are 'five or six' people affected by Giovanni's behaviour Giovanni, who has strongly denied any threatening or abusive behaviour, was later suspended, with the BBC later launching a probe over claims of off-camera misconduct made by Amanda as well as other celebrities. Yet in a dramatic twist in the Strictly saga, the actress has claimed Giovanni tried to stop her legal team from accessing the video 'evidence' after producers were forced to put cameras in the dance studio after Amanda raised concerns. 'There's 50 hours of footage that's being blocked. You know, 50 hours is a lot of footage, and a lot of time spent in a room that was toxic,' she told presenter Krishnan Guru-Murthy. Read More Strictly's Amanda Abbington sends thinly-veiled message to Giovanni Pernice following 'mad woman' 'It's out there. There is evidence out there of what happened in that room and I'm not the one who's blocking it. I've said anyone can watch it, but he (Giovanni) doesn't want anyone to see it, which is quite telling if he's got nothing to hide.' A spokesperson for Giovanni told MailOnline at the time: 'We would urge people to wait for the review's conclusion and not to pay heed to these very serious and defamatory allegations that have no evidence in support of them.' The actress said that cameras were installed into her and Giovanni's rehearsal studio after she raised concerns after the first week of practice with producers wanting to review the footage each week to assess what was 'going on' between the pair. Giovanni had claimed he had asked for the cameras, which Amanda says is untrue. 'So in the first week, I raised my concerns to the producers,' the actress explained, as she fought back tears. 'Giovanni said that he asked for the cameras, he didn't ask for the cameras, I know that he didn't ask for the cameras, because the producers came to me and said, 'we're going to put in cameras so we can view the footage at the end of the week and make an assessment and see what's going on'. Read More Strictly cover-up hell for Amanda Abbington as she claims there is up to 50 HOURS of 'toxic' footage 'And then every Friday, after the next sort of five weeks, I would get the producer saying, on the Friday, 'we just watched the footage back, we are shocked and horrified, we're so sorry'. 'That was to my face on the Friday when we would go in and do the camera rehearsal.' Throughout the interview, Guru-Murthy, who also starred on the 2023 series, asked whether it was correct that Amanda had experienced 'humiliating behaviour of a sexual nature', with the actress holding back tears as she nodded in agreement. 'Yeah. I mean, you know, one of the many things,' she said, clarifying it was not harassment. Ever since the claims first emerged Giovanni has denied all of the allegations, claiming to have provided a dossier of evidence to the Beeb investigators and 'remains fully confident in clearing his name'. Disputing Amanda's claims once again following tonight's interview, a spokesperson for the Italian dancer said: 'The BBC has shared the allegations they have been able to substantiate with us. The report comes just days after Strictly Come was plunged into further crisis on Wednesday after Amanda claimed that Giovanni was trying to block the release of up to 50 hours of 'toxic' footage' In an emotionally charged interview, the actress, 50, compared the dance show to 'the trenches' telling Channel 4 News that BBC producers had been left 'horrified' by clips that also allegedly exhibited 'humiliating behaviour of a sexual nature' Channel 4 presenter Krishnan Guru-Murthy, who interview Amanda, also starred on the 2023 series of Strictly Come Dancing Amanda and Krishnan Guru-Murthy pictured following her interview 'They do not resemble Amanda's latest allegations, given to Channel 4, in any shape or form. Giovanni refutes any claim of threatening or abusive behaviour.' After the fallout, Amanda said she did not hear from any one at the BBC again, claiming: 'I haven't spoken to anyone from the BBC since Strictly. 'No one from the BBC has reached out to me since Strictly, either through me or my lawyer.' In a message to those in charge of the BBC show that has been running since 2004 she added: 'Just be aware of what's going on and when you know it's going on, nip it in the bud. Don't allow it to continue.' Amanda went on to claim that she has faced a number of violent threats from both Strictly fans and 'Giovanni fans' who have asked her 'how can you destroy something like Strictly'. She revealed the extent of the alleged harassment she has received in recent months from trolls, telling Channel 4 that 'It has been brutal and relentless and unforgiving'. 'The aftermath has been something I was not expecting. The death threats and the rape threats not only to myself but to my daughter. The threats of death to my son,' she added. 'When you get one or two of the those you can [shrug it off],' she added. 'But when it's dozens of people saying 'just go kill yourself', 'go die of cancer', 'just kill yourself, your kids will be better off without you as a mother'. Amanda detailed other horrific messages she allegedly received. Others included 'I hope your daughter gets raped, I hope your son is stabbed', 'you don't deserve any good things you have done', 'you're a snowflake, you're stupid, you're an idiot'. The bombshell interview comes as the flagship BBC One show continues to be rocked by a string of allegations, which saw Giovanni as well as professional dancer Graziano Di Prima step down. Giovanni was accused of bullying by Amanda as well as two other, unnamed contestants. Graziano was axed from the show last week after allegations emerged that he kicked, hit and spat at reality TV star Zasra McDermott during rehearsals last year. And earlier this week, Paralympian Will Bayley became the latest star to speak about his time on the show. The 36-year-old, who was paired with Janette Manrara in 2019, said he was left with life-changing injuries after being made to redo a jump in a routine as he criticised the show's duty of care. Amanda and Giovanni pictured during the show last year 'If the BBC are brilliant enough to get people with disabilities in, they have to really support those people and make them safe,' he told BBC Breakfast. 'And it's not like I've brought this up now... I've brought this up many times. It's just because the other stories have come out that mine has actually got listened to. Read More EXCLUSIVE Amanda Abbington is 'encouraging others to rake up dirt on Strictly', BBC insiders claim 'If someone gets an injury like mine, it will affect them for the rest of their life. I'll never get over this knee injury, I have to deal with that.' Amanda echoed Will's calls in the interview with Channel 4 calling for a more open environment where celebrity contestants can voice concerns without fear of retribution. The BBC said: 'We have longstanding protocols for dealing with injuries if they occur and that includes contestants receiving all necessary treatment and support as required.' When talking about what could be improved on the show she said: 'Allowing people to go and complain that's the other thing. Being able to voice your concerns if you feel like you are being bullied. 'If the situation you are in feels toxic or unsafe, having the courage to go and say something is important and we are not cultivating that environment. 'We are making out that women that voice their concerns about a situations, are trolled through the press, sent rape threats, death threats and are not taken seriously.' Amanda has not publicly given any examples of Giovanni's behaviour during rehearsals, however, branded him 'abusive, cruel and mean'. Throughout the interview she also claimed that former partners of Giovanni's contacted her once it was revealed they would be paired together on the phone. The actress said she received messages that said 'I am so sorry, it's going to be quite tough'. Amanda quit the BBC series last year due to 'personal reasons' before reports surfaced saying she had demanded footage of her rehearsals after the experience left her with PTSD (pictured on the show with Giovanni) Abbington was pictured emotionally struggling with the rehearsals during the show Giovanni has constantly refuted the allegations and denied any accusations of threatening or abusive behaviour. A spokesperson for the dancer said he had provided a dossier of evidence to the investigators and 'remains fully confident in clearing his name'. Read More Celebrity agent Melanie Blake claims Strictly pro dancer 'put her hand on his crotch' But hitting back at those who questioned Amanda's alleged experience, the actress said in her latest interview: 'What happened in that room happened because it happened to me. 'I am not a sensational person, I am not hysterical, I do not make things out to be bigger than they are. I know what happened in that room was not acceptable. 'I complained about it and have not been taken seriously.; She explained that 'three other women' had also made complaints with 'more potentially coming forward'. 'We have to cultivate an environment when women or men - because it happens to men as well - can come forward and say I'm finding this uncomfortable and something needs to be done about it. And then something be done about it - that's all. 'We need to be brave and I want to stand up for any woman who does not have a voice. I will be there for her championing her.' Amanda insisted throughout the interview that she did not want to 'bring down' the show and 'envies' those who spoke highly of their experiences. 'I love Strictly, I would love to have had a beautiful experience on it. I really would,' she said. I'm envious of the people who had a wonderful experience on that show, I'm so glad they did, and I feel really sad that I didn't get to fulfil my journey.' The Channel 4 interview came as BBC chiefs are said to be furious about the Strictly investigation Amanda's initial complaint triggered. One BBC insider told MailOnline: 'Amanda seems to be stopping at nothing to make sure that a dark cloud is left over Strictly. 'She seems to have a real issue with the show. She has been open about not enjoying her time, but why spoil it for everyone else? 'It's not looking like there is a smoking gun in her complaint about Giovanni, so now she is getting others to come forward and then later it appears in the Press so the row keeps going and going.' On Tuesday, the BBC's director-general Tim Davie warned that the 'line should never be crossed' said: 'I'm very sorry that anyone has had an experience on Strictly that hasn't been wholly positive. 'I think that is something we do reflect on, and I'm sorry about that. If someone feels there was something wrong or they wanted to talk about their experience, then, of course, we want them to raise that with us and be in no doubt, we will take it seriously.' Mr Davie added: 'Of course, alongside the fun and entertainment, there will be a degree of competitiveness, hard work, and a will to do well. That's part of what makes this show. 'But there are limits and the line should never be crossed. We will never tolerate unacceptable behaviour of any kind.' Amanda said she was 'glad' that Mr Davie had apologised to celebrities but added that no producers had been in touch since she made a complaint. She told Channel 4: 'I got several messages afterwards from some of the producers, just checking in to see how I was. 'But then when all the fallout happened, and then everybody started piling on and the death threats came in, and they were reported in the press - and all the misinformation went out there - I didn't really hear from anybody again.' Asked if there was any aftercare provided, she replied: 'No, it would have been nice I suppose.' Rehearsals for the new series began on Monday, and today professionals including Johannes Radebe, Amy Dowden and Dianne Buswell were all smiles as they arrived to practise at a London dance studio. Fellow Italian dancer Graziano Di Prima was suspended from the programme after he was accused of kicking and spitting at former Love Island star Zara McDermott (pictured together during last year's competition) Addressing his exit from the show, a 'devastated' Di Prima wrote on Instagram: 'I deeply regret the events that led to my departure from Strictly' In response to Amanda's latest interview, a spokesperson for the BBC said: 'Anyone involved in a complaint has a right to confidentiality and fair process and therefore it would be inappropriate to comment further on individuals.' 'As we have said before, we would urge people not to indulge in speculation. More generally, the BBC and BBC Studios takes duty of care extremely seriously. 'Our processes on Strictly Come Dancing are updated every year, they are kept under constant review and last week we announced additional steps to further strengthen welfare and support on the show. The BBC continued: 'The BBC and BBC Studios takes duty of care extremely seriously…last week we announced additional steps to further strengthen welfare and support on the show.' Channel 4Giovanni PerniceStrictly Come Dancing Share or comment on this article: Strictly Come Dancing's Giovanni Pernice is 'given a huge boost in his BBC bulling case' following Amanda Abbington claims he is blocking '50 hours of rehearsal footage' e-mail 24 shares Add comment Bing Site Web Enter search term: Search Advertisement DON'T MISS Celine Dion fans left IN TEARS as star closes Olympics Opening Ceremony with her 'timeless' voice after tragic battle with Stiff Person Syndrome EXCLUSIVEBring your daughter... to the altar! Ronnie Wood's son Tyrone ties the knot with daughter of Iron Maiden guitarist at star-studded ceremony BREAKING NEWSLady Gaga fans are left unimpressed as she suffers sound issues while performing Mon Truc en Plumes during Olympics 2024 Opening Ceremony EXCLUSIVEI've put her through the wringer... Matt and Emma Willis reveal how their romance survived the perils of fame Leggy Chrissy Teigen joins fellow A-Listers Ariana Grande and Lady Gaga as they brave the prospect of rain at the Olympics in Paris What would YOU tell your younger self? The 50 top pearls of wisdom women would go back and tell themselves - but how many do you agree with? Ad Feature Graziano Di Prima 'is under medical supervision and being monitored hourly' after Strictly axe following Zara McDermott abuse allegations EXCLUSIVEGiovanni's fury at Amanda Abbington's sex claims as he insists he has 'bombshell' evidence that 'proves Amanda is a liar', his friends reveal How Celine Dion fought every day to be fit to open the Olympics: Star endured gruelling therapy for crippling and incurable Stiff Person Syndrome Succulent burgers, fabulous fish and tasty chicken skewers: Here's how to barbecue the British way Ad Feature EXCLUSIVEEmma Roberts gets a piggyback ride from fiancé Cody John as Ashley Benson shows lean postpartum figure in a bikini in St. Tropez Strictly Come Dancing's Giovanni Pernice is 'given a huge boost in his BBC bulling case' following Amanda Abbington claims he is blocking '50 hours of rehearsal footage' EXCLUSIVEMiley Cyrus' dad Billy Ray, 62, is 'DEAD to his daughter' after branding her a 'devil' and a 'SKANK' in shocking audio tirade amid bitter rift over his marriage to Firerose, 37 Love Island couple in 'shock SPLIT... and star has already moved on with Strictly dancer's ex' From chaos to calm: Get prepped now for sending your children back to school this September Ad Feature Olympian Sir Ben Ainslie and his wife to sell off their stunning £3.5m nine-bedroom Isle of Wight home as focus turns to America's Cup, writes RICHARD EDEN Ariana Grande and Cynthia Erivo look glamorous as they embody their Wicked characters at the Olympics Opening Ceremony in Paris Celine Dion puts on an animated display as fans swarm outside her hotel in Paris amid rumours she will perform at the 2024 Olympic Games A-Listers team up at celebrity party ahead of the Olympics opening ceremony in Paris... and tennis appears to be on the agenda Desperate for sunshine? It's not too late to go and find it! Here's our pick of the best last-minute summer deals Ad Feature Love Island SPOILER: The villa is thrown into chaos as OG islanders including Uma, Harriett, Jess and Ronnie make a shock return Chris Pratt jokes he thought Hugh Jackman 'would be taller' as he Photoshops actor's face onto his son Jack, 11, in snap with Ryan Reynolds Amanda Holden, 53, flaunts her jaw-dropping figure in a tiny pink bikini while daughter Lexi, 18, looks like her doppelganger in yellow two-piece Emmerdale star Lucy Pargeter is 'engaged' to her secret boyfriend of three years as she flashes huge diamond ring Achieve home harmony! From prams to passing your driving test, here are top 10 tips for your family this season Ad Feature Steve Harvey accused of 'cheating' on Celebrity Family Feud by outraged contestant - years after game show host admitted he was 'scared' of her EXCLUSIVESongwriter reveals what happened when he said 'f**k you' to Madonna as he divulges the unique way she fires employees Blake Lively praises Gigi Hadid for being her date to Deadpool & Wolverine premiere and to sister Robyn Lively for also attending Emily Ratajkowski puts her toned abs on display in a bra and unbuttoned shirt as her slacks almost fall OFF her hips in NYC Do you own a business? Here's how to reach millions of potential customers with ads you can TRUST Ad Feature Laura Woods is seen for the first time since announcing her pregnancy with Adam Collard as she returns to TV to cover the Olympics Katy Perry channels the 90s as she rocks double denim upon leaving her hotel in London - amid 'crisis talks' following her comeback flop Vincent Cassel, 57, and girlfriend Narah Baptista, 27, put on a loved-up display as they arrive at the Opening Ceremony of the Olympics in Paris Travis Scott's raucous Milan show with 80,000 jumping fans sparks EARTHQUAKE fears - three years after Astroworld tragedy killed 10 people Lady Gaga stuns in a skimpy black bodysuit while rehearsing ahead of her 'duet' with Celine Dion at Olympics opening Ceremony in Paris Inside Danni Menzies' stunning Mykonos holiday as A Place in the Sun host shows off jaw-dropping figure in a bikini while cooling off in the sea Laila Rouass joins the cast of EastEnders - after it emerged she was left 'in tears' when pro Strictly partner Anton Du Beke said she 'looked like a P***' Justin Timberlake will be RE-ARRAIGNED on DUI charges amid Euro tour next week as attorney claims singer was NOT drunk during arrest Jennifer Lopez leaves her NYC hotel with her wedding rings on... after celebrating her 55th birthday in the Hamptons without Ben Affleck Jennifer Lopez looked happy as she left her hotel in New York City Friday morning. The Atlas star wore a blue-grey blazer that accentuated her trim waist with a white t-shirt underneath. Are you the office 'vibe lifter'? The rise of the personality hire and how to navigate a contemporary workplace Advertising Pregnant The Traitors star Charlotte Chilton shares insight into what unborn baby with Conor Maynard could look like with the help of AI Jennifer Lopez, 55, wows in a plunging swimsuit while day drinking at $68M LA mansion she's selling with 'estranged' husband Ben Affleck Justin Timberlake's lawyer says star was NOT intoxicated on night of DWI arrest and claims police made 'significant errors' - as singer is absent from court hearing Mick Jagger's girlfriend Melanie Hamrick, 37, shares sweet tribute to the singer on his 81st birthday in family snaps with son Deveraux, 8 Selling out fast! QVC shoppers race to bag hanging egg chair that's now £107 cheaper in summer clearance sale: 'Like sitting in a hug!' SHOPPING Bethenny Frankel and German artist Niclas Castello fuel romance rumors as they flirt up a storm and make each other laugh at the beach in Saint Tropez Denise Richards, 53, looks youthful in a swimsuit as she announces shooting has begun on her reality TV show with OnlyFans daughter Sami Sheen Scout Willis grew up with multi-millionaire parents Demi Moore and Bruce Willis but seems to get a thrill from picking up deals at Target in LA Christina Hall's ex-husband Ant Anstead surfaces in rare sighting... after she broke her silence on divorce from 'insecure' Josh Hall Hate shaving and waxing? This at-home hair removal device is 'life-changing' for summer smooth hair-free skin - AND it's on sale with £50 off for a limited time SHOPPING Cheryl Burke claims Billy Ray Cyrus 'donkey kicked' a crew member during Dancing With The Stars rehearsals as his messy divorce from Firerose rages on Pharrell Williams is confronted by animal rights protestors who accuse him of 'killing animals for fashion' at Louis Vuitton event in Paris Nina Dobrev sports a knee brace and walks with a cane as she heads for lunch in Paris with Olympian boyfriend Shaun White after bike crash Halsey is nearly nude in her Lucky video which is inspired by Britney Spears' 2000 tune, directed by Gia Coppola and costars Simon Rex Hailey Bieber reveals huge Rhode beauty announcement which is set to send UK fans into frenzy Sandra Bullock 'doing okay' and focusing on her children as she turns 60 - one year after partner Bryan Randall's death aged 57 from ALS Jennifer Garner makes very cheeky joke about ex-husband Ben Affleck as she reprises her Elektra role in Deadpool & Wolverine Brad Pitt looks pensive at Formula One practice in Belgium amid ongoing drama with his estranged wife Angelina Jolie Megan Fox confuses fans as she appears pregnant then holds a BABY in Machine Gun Kelly and Jelly Roll's new music video for Lonely Road Love Island SPOILER: The villa is rocked by brutal dumping that will see one couple leave just DAYS before the final Tammy Hembrow shows off her figure in slinky black gown at Petal and Pup launch in Brisbane - after revealing she's shredding for her wedding Rachael Leigh Cook, 44, and Freddie Prinze Jr, 48, have a She's All That reunion... 25 years after the hit teen film was released EXCLUSIVEZara McDermott breaks her silence on what she REALLY thinks of friend Pete Wicks signing up to Strictly after she was abused on show Alison Hammond looks sensational in black and white dress as she continues to showcase her weight loss on This Morning Blake Lively and Ryan Reynolds' daughter Inez, 7, has a cameo as Kidpool in Deadpool & Wolverine Jennifer Aniston, 55, glows as she meets the cast of Oh Mary! in NYC... after slamming J.D. Vance's viral comments about 'childless cat ladies' Naomi Isted flaunts her incredible figure in a bikini as she models a slew of beach looks on lavish Turkish trip Emma Roberts, 5ft2in, packs on the PDA with 6ft fiancé Cody John as they queue for ice cream in Saint Tropez Larsa Pippen flaunts her toned abs in a tiny bikini and matching sarong after confirming split from Marcus Jordan Dawn French reveals VERY awkward encounter with Princess Margaret and the comment she made that 'reduced me to a heap' Katy Perry jokes about THOSE naked snaps of Orlando Bloom as she gives an insight into family life with their daughter Daisy, 3 EXCLUSIVEThe secret FIRST husband of Billy Ray Cyrus's Aussie wife is revealed - as her parents break their silence over their huge rift with their daughter Rebel Wilson sports a casual look in a black Balmain T-shirt as she steps out in Paris ahead of Olympic opening ceremony EXCLUSIVEFearne Cotton looks in high spirits as she joins son Rex and husband Jesse Wood at the star-studded wedding of brother-in-law Tyrone All the royals who dare to bare their tattoos: From Princess Eugenie to Lady Amelia Windsor... as King Frederik shows off his body art on the beach Cat Deeley, 47, shows off her incredible figure in a black bikini as she hits the beach in St Tropez with her shirtless husband Patrick Kielty Eva Longoria puts on a leggy display in tiny tennis dress as she soaks up the sun with her husband Jose Boston in Malaga Rita Ora flaunts her toned figure in silver bra and fuchsia mini shorts as she takes to the stage in Lithuania The videos that hint at trouble behind the scenes of Strictly: Thrown chairs, screaming matches and training regimes have cast a new light Katie Price breaks silence as her former dressage trainer Andrew Gould is called up to Paris Olympics as she continues to deny affair rumours Bienvenue à Paris! Princess Charlene and Prince Albert of Monaco join King Felipe of Spain and Danish monarchs amid other European royals at Elysee Palace John Cleese says Fawlty Towers stage show auditions were 'so awful' in playful interview after admitting he agreed to West End revival for pay cheque 'I've got stretch marks on my breasts but I'm happier than ever': Rhian Sugden shows off her curves in a black bodysuit in empowering postpartum post Susan Sarandon's daughter Eva Amurri ignores trolls as she poses in a skimpy swimsuit - after backlash over her low-cut wedding gown Taylor Swift fans celebrate one year anniversary of Travis Kelce shooting his shot at pop star on 'New Heights' podcast Richard Ayoade defends Graham Linehan as a 'man of great principle' over his trans views - after The IT Crowd creator praised star's 'bravery' Stevie Nicks, 76, reveals she was rushed to hospital with a mystery infection that forced her to cancel gigs EXCLUSIVEJessie James Decker launches her new eyewear campaign... after dropping weight following the birth of her 4th child Lily Allen puts on a leggy display in off-white dress as she joins dapper husband David Harbour at Marvel Boss Kevin Feige's Walk Of Fame ceremony A much-needed couple's getaway! Queen Mary of Denmark, 52, appears tense as she joins King Frederik on the beach in Sardinia Holly Ramsay gushes over 'best partner' Adam Peaty and says it was a 'privilege' to watch him prepare for Paris Olympics - as swimmer is tipped to win gold Emmerdale icon 'quits soap after two years to spread their wings' and is being lined up for a dramatic exit Pregnant Sophie Cachia reveals her son Bobby and daughter Florence's hysterical reactions to finding out the gender of her third child Homes Under The Hammer star Martin Roberts wins bid to open his own pub - after taking 'financial gamble' on a whim without telling his wife Strictly's Amy Dowden beams beside Dianne Buswell and Michelle Tsiakkas as they join fellow dancers in making upbeat arrivals at rehearsals Former Strictly star Camilla Sacre-Dallerup says chaperones for celebrity contestants are 'necessary' in the wake of show's misconduct scandal: 'Steps need to be taken Pregnant Megan McKenna shares a sweet update after getting 3D ultrasound scan as she counts down to her due date Lady Gaga gushed over Celine Dion and praised her for being 'one of few supportive women' ahead of their duet at the Olympics opening ceremony Bobby Davro emotionally reflects on the 'extremely painful death' of late fiancée Vicky Wright and admits 'I miss her more now' a year after her passing Snoop Dogg carries Olympic torch ahead of opening ceremony in Paris... As chiefs rush to finish up last-minute preparations for ambitious show Pregnant Jenna Coleman sports a chic bob as she chats to boyfriend Jamie Childs while filming for second season of The Sandman Hugh Jackman and Ryan Reynolds hilariously hijack the Aussie actor's best friend Gus Worland's radio show The sweet secrets behind Adele and Rich Paul's romantic proposal as she prepares to 'move back to the UK' Inside Adele's life in UK as she prepares to move back across the Atlantic with her new fiance Rich Paul...but will she settle into £11m Kensington mews? Deadpool & Wolverine branded 'incredible' by fans who hail the movie 'Marvel's comeback' following box office bombs Inside Celine Dion's battle with illness threatening to 'turn her into a statue': Canadian singer, 56, disappeared from the spotlight after revealing stiff person syndrome diagnosis The royal ink! King Frederik of Denmark, 56, shows off his edgy tattoos on Sardinia beach break with Queen Mary - and the body art runs in the family... Radio star Sami Lukis reveals the surprising household item she always takes travelling Susan Sarandon's daughter Eva Amurri defends Olivia Culpo's wedding dress -after actress received backlash over her gown and 'droopy boobs' Bella Thorne puts on a leggy display in tiny sequined pink strapless dress as she cosies up to fiancé Mark Emms at Fandom's Seventh Annual Party Serena Williams teases a glimpse of her black lingerie beneath a plunging suit at Louis Vuitton's star-studded Prelude To The Olympics party in Paris RICHARD EDEN: 'Insincere' Meghan was sending out warning signs from the start, only now do royal sources admit they missed them Vanessa Feltz's ex-fiancé Ben Ofoedu in formal talks to run for Tory mayoral candidate for London Inside Lauryn Goodman's incredible Teddy Bear's Picnic themed first birthday for baby daughter with a pancake cart, cake and horse box photobooth Married At First Sight 2025 SPOILER: Jono McCullough's ex looks every inch the blushing bride as she meets her handsome groom Kanye West's wife Bianca Censori is BACK with her breasts on display at Chateau Marmont in a tiny bikini top despite business casual dress code Myleene Klass looks incredible in sizzling bikini snaps as she soaks up the sun on family holiday Nothing compares to her! Sinéad O'Connor fans blast 'awful' waxwork of the late singer unveiled in a Dublin museum as an 'insult to her memory' Madonna, 65, sets pulses racing in a black bustier and fishnets in risqué behind-the-scenes snaps from her Deadpool & Wolverine premiere appearance Adele and Rich Paul are finally 'engaged' despite months of speculation they are already married - as she flashes huge ring on night out in London 'I'm too Dutch!' King Willem-Alexander of the Netherlands pokes fun at himself after arriving at Paris Olympics reception 10 minutes early Katy Perry leaves little to the imagination in a sheer lace skirt and skimpy bodysuit for TV appearance in London - amid 'crisis talks' following comeback flop Emily In Paris star Kate Walsh cuts a stylish figure as she makes a low key arrival at Sydney Airport after settling into new life in Western Australia Inside Zara McDermott and Pete Wicks' close friendship as TOWIE star 'signs up for Strictly' after she was abused Graziano Di Prima on show Emma Corrin puts on a leggy display in a leather mini dress as they promote Deadpool & Wolverine at San Diego Comic-Con Jennifer Garner stuns in a red off-the-shoulder mini dress as she larks around with Ryan Reynolds and Hugh Jackman at Deadpool & Wolverine panel Susan Sarandon's daughter Eva Amurri admits she was reduced to tears after nasty trolls called her breasts 'droopy' in low-cut wedding dress Pregnant Sophia Cachia shows off her growing baby bump in a glamorous video as she teases gender reveal Zendaya takes gold! Euphoria star wins the battle for best dressed as she joins Charlize Theron, Elizabeth Banks and Cindy Bruna at Louis Vuitton party Agent Jude! Bellingham and Trent Alexander-Arnold are seen together in LA AGAIN Sophia Bush puts on loved-up display with girlfriend Ashlyn Harris as they go for gold in coordinating shimmery looks for the Prelude To The Olympics in Paris Strictly's Zara McDermott 'secretly performed with a fractured LEG in the dance-off after suffering the nasty injury during her training sessions Celine Dion looks in high spirits in Paris ahead of making her grand return to the stage at the Olympics Opening Ceremony Carrie Bradshaw has good taste! Sarah Jessica Parker models popular Aussie designer while filming the third season of And Just Like That in New York Sir Mick Jagger, 80, puts on an animated display as he joins partner Melanie Hamrick, 37, at Louis Vuitton's Prelude To The Olympics 2024 EXCLUSIVEWhat Scott Disick really thinks about Kourtney Kardashian's rift with son Mason - as insiders reveal what sparked 'deep divide' Lady Gaga looks chic as she heads out for dinner in Paris amid reports she's set to perform with Celine Dion at the Olympics Opening Ceremony Blake Lively shares hilarious reaction to pal Taylor Swift calling Ryan Reynolds her 'godkids' sperm donor' Jennifer Lopez goes from white onesie to business casual look for NYC return after celebrating 55th birthday without Ben Affleck Heartwarming moment Jodi Benson tears up with pride as she watches her daughter perform her iconic role as Ariel the Mermaid Billy Joel, 75, performs with daughters Della, 8, and Remy, 6, during final show of his 10-year residency at Madison Square Garden Ryan and Hugh hit San Diego! Ryan Reynolds and Hugh Jackman take over San Diego Comic-Con as Deadpool & Wolverine eyes $40M preview Jennifer Lawrence shows off her chic summer style as she embraces mum duty with son Cy, two, on a relaxing stroll in NYC EDEN CONFIDENTIAL: King Charles's former right-hand man Michael Fawcett makes £800,000 profit on sale of his London 'palace' Ioan Gruffudd and Bianca Wallace stay at $77-a-night hotel during trip to America - after his ex-wife Alice Evans accused him of leaving her poor Roxy Jacenko reveals the health issue causing bruising on her leg as she poses in a bikini during luxury European holiday ALISON BOSHOFF: Meghan Markle is promoting a new make-up range by her friend Victoria Jackson She is preparing to launch a new lifestyle brand Hugh Jackman's surprise gift to the Marvel boss who made him a global superstar Elizabeth Banks cuts a classic Hollywood look in black minidress at Louis Vuitton's Prelude to the Olympics party in Paris Ice Spice calls Taylor Swift her 'closest celebrity friend' and addresses 'rude' claims of a fake friendship Real Housewives Of Orange County: Gina Kirschenheiter accuses Jennifer Pedranti of 'squatting' during heated argument after flag football game Strictly Come Dancing's 'famous curse could finally be killed off after bosses shared plans to introduce chaperones in training amid scandal' Chris Hemsworth returns to San Diego Comic-Con alongside Brian Tyree Henry and Keegan Michael Key to reveal the new trailer for Transformers One EXCLUSIVERevealed: The scandals which could end Strictly and the ones that are just sob stories from snowflakes: KATIE HIND'S insider verdict Charlize Theron turns heads in white minidress with dramatic one-shoulder sleeve at Louis Vuitton's Prelude to the Olympics star-studded soiree in Paris 'Thanks for telling me this now': Josh Hartnett reveals the 'unhelpful' advice he received from Oppenheimer co-star Matt Damon Pink cuts a casual figure in leggings and tank top while stepping out ahead of her concert in Stockholm, Sweden Strictly pro Pasha Kovalev wades in on misconduct scandal and says a lot of people don't believe the accusations Christine McGuinness reveals she's certain she'll 'find love again' after her split from husband Paddy as she insists she's 'happily single' ALISON BOSHOFF: Sharon Stone pledges to leave USA if Donald Trump is elected US President in November Politics is showbusiness for ugly people EXCLUSIVECeline Dion WILL sing at the 2024 Paris Olympics - in French - as the eye-watering sum she will be paid for the gig is revealed David and Victoria Beckham live it up on their £16MILLION yacht in Italy - and Posh glams up in a formal black number Royals at the Olympics: Princess Anne competed in Montreal in 1976, her daughter Zara won silver in 2012 and Prince Albert of Monaco was a bobsledder Zoe Kravitz takes fiance Channing Tatum on fun date night to see campy Broadway show - after his rare remarks about their romance Taylor Swift's heartfelt note to 'best friend' Hugh Jackman that will make you cry... as star admits it 'killed' him Zendaya shares a joke with director Spike Lee as she lets her hair down with friends at Louis Vuitton's Prelude To The Olympics 2024 in Paris 'I was a little bit hurt': Bette Midler reveals Bette Davis was 'not pleased' to learn she was named after her Rosalia wows in a pale gold dress as she joins her The Bear star boyfriend Jeremy Allen White at Louis Vuitton's star-studded Prelude To The Olympics party Oprah Winfrey and Gayle King break silence on THOSE lesbian lover rumors Shut down the longstanding rumour Love Island fans ridicule the Islanders for 'manufactured' conversations of exclusivity just four days before the final EPHRAIM HARDCASTLE: Is King Charles thinking of opening part of Buckingham Palace as a luxury B&B? Christina Hall BREAKS her silence on divorce from Josh Hall as she calls ex an 'insecure man'... after claiming he transferred $35k from her account Ant And Dec hilariously push each other off paddle-boards as they hit the beach for new promotional video Funny Nina Dobrev exudes glamour beside three-time gold medalist boyfriend Shaun White ahead of the Paris Olympics opening ceremony The Kardashians renewed for 20 more episodes on Hulu... just one day after the Season 5 finale Popular show Russell Crowe 'is forced to flee his show at London's Shepherd's Bush Empire as a fight breaks out between his team and overzealous fans' Drew Barrymore gives rare glimpse at her eclectic bedroom - including wallpaper on the CEILING - as she packs for upcoming trip to Australia Teen Mom: The Next Chapter: Cheyenne Floyd seeks outside guidance after six-year-old daughter Ryder gets called racial slur Tish Cyrus says she 'would be so scared' to trade lives with Britney Spears - but stays silent on THOSE Billy Ray Cyrus tirades calling her a 'skank' and 'scum' Deadpool & Wolverine review: Ryan Reynolds and Hugh Jackman have the biggest laugh in this multiverse caper, writes BRIAN VINER Penny Lancaster, 53, looks incredible in tiny red bikini as she enjoys trip on £50million yacht with her husband Rod, 79, and their blended family in Sardinia Amanda Abbington reveals she knew her Strictly 'bullying' ordeal was going wrong just THREE DAYS into rehearsals More claims TOWIE star Pete Wicks 'signs up for Strictly Come Dancing days after it emerged his close pal Zara McDermott was abused by her partner Actor James Dreyfus reveals he was in talks to do Strictly last year and asked BBC to look out for Amanda Abbington after hearing she had been signed Alec Baldwin, 66, looks weary with wife Hilaria, 40, for dinner date in the Hamptons... nearly two weeks after shock end to Rust shooting trial Aging rapist Harvey Weinstein transferred to hospital with 'myriad of health conditions' including Covid and double pneumonia Home and Away star Ada Nicodemou reveals why her relationship with her co-star James Stewart is better off-screen: 'It's really lovely' Princess Anne leads European royals stepping out in Paris to support their nation's teams at the Olympics Special event Jennifer Aniston wishes Courteney Cox's longtime boyfriend Johnny McDaid a happy 48th birthday on Instagram Ice Spice flashes her tummy after admitting she STILL listens to Matty Healy's music despite his racially insensitive comments about her Katy Perry reveals the sweet way her daughter Daisy, 3, inspired her new single Lifetimes after critics savaged her 'abysmal' comeback track Women's World Gemma Collins shows off her weight loss in a white T-shirt and shimmering green skirt as she attends Baileys event in London Alicia Vikander reveals she secretly welcomed 2nd child with Michael Fassbender: 'Second time was harder for me' New addition Laura Dern claims she was forced to drop out of UCLA after landing Blue Velvet role - and now the college teaches the David Lynch film Elon Musk's trans daughter Vivian breaks silence after dad claims she was born 'gay' and 'slightly autistic' Posted on X's arch vial site Threads Miranda Cosgrove and Pierson Fode reunite for new Netflix movie The Wrong Paris... more than a decade after their iCarly episode together 'F*** that man': Kesha boos J.D. Vance for viral 'childless cat ladies' comments and throws her support behind Kamala Harris Blur: Live at Wembley Stadium review: A Triumphant comeback, writes ADRIAN THRILLS A candid documentary is in cinemas now Sydney Sweeney puts on a busty display in a black corset while posing by the Eiffel Tower during a luxurious trip to Paris Kanye West and braless wife Bianca Censori look confused as they get locked out of their Tesla Cybertruck following cinema date A King's ransom! How Charles is expected to earn millions from Great British Energy's deal with the Crown Estate Advertisement Follow DailyMail Subscribe Daily Mail Follow @dailymail Follow DailyMail Follow MailOnline Follow Daily Mail MORE DON'T MISS Khloe Kardashian, 40, is left SHOCKED to find out her 'biological age' after confessing to bad eating habits Stunned Candice Swanepoel, 35, stuns in lavender lingerie for Victoria's Secret... 17 years after she first started working for the brand Amy Winehouse £730,000 auction battle launched by late star's father claims evidence of 'suspicious circumstances' over sale of her items Emily Ratajkowski flashes her toned abs and black bra while leaving her shirt completely unbuttoned during dog walk in NYC Katie McGlynn flashes her abs in a skimpy black bikini as she kisses boyfriend Ricky Rayment during PDA-filled beach day in Greece Brandi Glanville blames Bravo for being 'miserable and depressed' as she shares shocking swollen face selfie: 'Stress will kill you' Love Island SPOILER: Joey Essex attempts to clear the air with Josh after heated row following brutal talent show jibe EXCLUSIVEAmanda Abbington's fiancé hits out at trolls who branded Strictly star 'unstable' and vows 'the truth will come out' Jennie Garth looks downcast in black while heading into The View to discuss the passing of her Beverly Hills, 90210 costar Shannen Doherty Ronda Rousey announces she's pregnant with UFC legend and husband Travis Browne expecting their second child Maya Jama looks incredible in a figure-hugging white dress as she hits the town and parties until 3.30am after her split from Stormzy Gisele Bundchen shows off killer bikini body on the beach just as it's revealed ex-husband Tom Brady is now dating a Sports Illustrated model Heidi Montag and Spencer Pratt still look very much in love after 16 years of marriage when attending a record release party for Brooke Candy in LA Pedro Pascal shares first ever cast selfie with Fantastic Four co-stars Vanessa Kirby, Ebon Moss-Bachrach and Joseph Quinn Phaedra Parks' ex-husband Apollo Nida is 'arrested for assaulting his 2nd wife'... as the Bravo vet 'negotiates' Real Housewives Of Atlanta return Jenny Powell, 56, shows off her age-defying figure in an animal print bikini on girls' trip to Ibiza with her lookalike daughters Kim Kardashian reveals 'light-bulb moment' in therapy after realizing she has been living in 'fight or flight mode' Lala Kent covers up her baby bump with a busy 'diner' shirt and a gingham maxi skirt in Los Angeles... after sharing a NUDE selfie Lindsay Lohan is seen on the set of Freaky Friday 2 as co-star Jamie Lee Curtis pumps her fist in the air while in a convertible Bronco Russell Crowe admits he became a 'f***ing sl**' after divorce from Danielle Spencer as he discusses 'ridiculous' antics with 'significantly younger' woman Jennifer Lopez flashes her toned body under a sheer dress as she continues to celebrate 55th birthday without husband Ben Affleck Strictly's Robin Windsor 'just wanted to be loved' and 'struggled with his love life' before his death aged 44 Katy Perry puts on a leggy display in TINY red shorts as she goes shopping at Harrods with husband Orlando Bloom Tom Hardy looks almost unrecognisable in effortlessly edgy outfit before he is mobbed by fans outside London restaurant That's one way to take the heat off the Strictly scandal! Shirtless Gorka Marquez strips off to a just a pair of trousers Julia Bradbury shares hilarious clip of herself getting stuck in her wetsuit after a trip to the seaside as her pals have to pull her out of it The Cyrus family 'turn on Billy Ray' as the star brood put aside feud to unite against dad: Noah puts on a brave face after his shocking audio Ewan McGregor's daughter Clara stuns in a sheer bralet and pinstriped shorts suit as she poses at Net-a-Porter event in NYC Lady Gaga blows kisses to her fans as she stands through the sunroof of her car in Paris ahead of her rumoured Olympic performance Olivia Culpo breaks silence on wedding dress backlash and furore over Christian McCaffrey finding her 'most beautiful when she is covered' Emmerdale star Natalie Anderson sends temperatures soaring in a skimpy bikini as she hits the beach during a lavish family holiday James Bond star, 84, announces 'difficult decision' to retire from acting as 'getting older has taken its toll' Katie Price's former dressage trainer who was forced to deny having an affair with her gets Paris Olympics call-up after Charlotte Dujardin was suspended Wayne Brady announces he secretly welcomed a son with his ex Tina - as he hopes his little boy will never think: 'My dad didn't want me' Shifty Shellshock, lead singer of Crazy Town, will be remembered at 'grand' celebration of life service - following accidental overdose Jennifer Lopez accidentally reveals she STILL has a framed wedding photo with Ben Affleck in Hamptons house during birthday post... amid split claims Amanda Abbington reveals she told Strictly bosses 'this is awful, Giovanni hates me' in first week - but insists she doesn't want show to end Camilla's interior designer sister, 75, is no longer on Prince William's Duchy of Cornwall payroll after two decades Kate Phillips is pregnant! Peaky Blinders star reveals she is expecting her second child as she debuts blossoming baby bump in London Taylor Swift's best friend Abigail Anderson, 34, announces she is PREGNANT using one of the popstar's songs Vanessa Williams, 61, reveals she has STOPPED getting Botox and will not go under the knife or use fillers to appear younger: 'I want to look like myself' Prince William wants to 'put his own stamp' on the Duchy of Cornwall estate and explore more modern styles, expert says Patsy Palmer is spotted near the EastEnders set as she sparks rumours she is set to return to the BBC soap after brief appearance this year Behati Prinsloo shows off her figure in lingerie as she returns to Victoria's Secret in 'Dream' ad with Candice Swanepoel and Taylor Hill Ex-Spandau Ballet star Ross William Wild, 36, is found guilty of rape, sexual assault and voyeurism - but cleared of controlling and coercive behaviour Joey Fatone, 47, of NSYNC stars in hilarious campaign with mini-me daughter Kloey, 14, as he tries to understand her Gen Z slang Strictly Come Dancing 2024 cast 'will be announced NEXT WEEK' amid claims the current crisis 'hasn't affected any celebs signing up' Coleen Rooney sports stylish cat-eye sunglasses as she leaves her gym in a new £48K BYD Seal electric car Coronation Street star Sue Devaney looks radiant in a red gown in first pictures from her secret wedding to BBC journalist Jim O'Farrell Amanda Abbington tried to hide pain behind 'polite bravado' but facial winces showed her true anger over Strictly scandal, body language expert reveals Kerry Katona is in a cheeky mood as she pulls down her bikini top and gives fiancé Ryan Mahoney a STEAMY kiss during romantic trip in Spain Miriam Margolyes leaves BBC Breakfast presenter Charlie Stayt red faced during cheeky interview Nothing to see here! Strictly pro dancers appear in good spirits as they head to rehearsals amid show's misconduct scandal The frightening moment Queen Mary is hit by a scooter and thrown to the ground during a meet and greet with fans: 'Horrifying' EXCLUSIVELove Island winner Ekin-Su Cülcülolu to mix with Hollywood A-listers at Emmy Awards after landing shock nomination MAFS star Ella Morgan turns heads in a daring cut out PVC dress as she joins glam Love Island star Demi Jones at the St. Moriz summer party Ryan Reynolds pokes fun at co-star Hugh Jackman's divorce from Deborra-Lee Furness as the pair guest host Jimmy Kimmel Live! Katy Perry covers up in a quirky black ensemble as she heads to radio studios - after filming THAT very racy new music video amid comeback flop Iggy Azalea puts ex Playboi Carti on blast for not co-parenting their son Onyx: 'I'm very much a single mother' Deadpool & Wolverine divides critics as Ryan Reynolds and Hugh Jackman's chemistry is praised while others blast it as 'awful' The five biggest bombshells from Amanda Abbington's Lorraine interview: Star said Giovanni 'hated' her on day THREE and death threats Ryan Reynolds leaves Hugh Jackman stunned as he beats him in maths challenge despite revealing he was two years behind at school Barbara Windsor's widower Scott Mitchell reveals soap star asked him if he was her father in the lead up to her 'cruel' death with Alzheimer's disease Blac Chyna shows off her natural beauty as she steps out in daring gold top and white trousers in LA - a year after undergoing extreme make-under Full list of Mercury Prize 2024 nominations: From Charli xcx to The Last Dinner Party, here's all the acts up for the £25,000 Album of the Year prize Kate Ferdinand shares a rare photo of her eldest stepson Lorenz as she celebrates his 18th birthday Screen legend Hayley Mills arrives on the red carpet at Trap world premiere with her rarely-seen pop star son... do YOU know who he is? Roman Abramovich's ex-wife Dasha Zhukova is radiant in a black summer dress as she touches her stomach while strolling with billionaire husband The top 30 true crime documentaries to stream now: From serial killers to romance fraudsters, our critics sift through hundreds of options MasterChef Australia star Poh Ling Yeow reveals shock response after ex-husband moved on with best friend Bikini-clad Ferne McCann cosies up to shirtless fiancé Lorri Haines as they pack on the PDA during sun-soaked holiday to St Tropez Taylor Swift fans convinced pop star is 'secretly engaged' to Travis Kelce after playing 'cryptic' surprise song at the Eras Tour in Germany Strictly head judge Shirley Ballas shares very cryptic Instagram post amid Amanda Abbington's bombshell interviews about Giovanni Pernice EXCLUSIVEMarried At First Sight 2025 gets off to a disastrous start as bride and groom realise they ALREADY know each other as they meet at the altar Helen Flanagan wears a plunging corset summer dress as she arrives at the Celebs Go Dating agency Diddy is named 77 times in Tupac Shakur murder documents after gangster Duane 'Keefe D' Davis accused him of paying $1million for the hit Rosie Huntington-Whiteley puts on a leggy display in TINY black shorts as she enjoys outing in LA 'A bombshell just entered the villa': Kim Kardashian turns up the heat in a skimpy black bikini and teases about joining Love Island Amanda Abbington emerges for the FIRST time since bombshell Channel 4 interview after comparing Strictly Come Dancing to 'the trenches' Pip Edwards shows off her incredible figure in ab-flashing P.E Nation activewear during relaxing Southern Highlands retreat EXCLUSIVEKaty Perry films a VERY racy stunt with a hunky partner for her new music video - after ploughing forward with her comeback despite single flop Leonardo DiCaprio's eco-business venture suffers $3.5m loss after actor was accused of exhibiting hypocrisy with his lavish lifestyle Strictly star Giovanni Pernice breaks silence after Amanda Abbington's interview as he urges fans to ignore her claims and 'wait for BBC's review' Kate Garraway is replaced on Good Morning Britain once more after her father was 'rushed to hospital following a stroke and heart attack' Jules Robinson gives birth! MAFS star welcomes her second child with her husband Cameron Merchant Kourtney Kardashian's rarely-seen son Mason makes shock return to reality TV amid secret family heartbreak Kourtney's oldest child is 14 Jennifer Lopez channels Queen Charlotte for lavish Bridgerton-themed 55th birthday soirée... but husband Ben Affleck was absent Lady Gaga blows a kiss to her fans as she arrives back at hotel following a night out in Paris Suki Waterhouse shows off her toned body in tiny black bikini - months after giving birth to her daughter with Robert Pattinson Sarah Michelle Gellar, 47, looks ageless in a white lace mini dress at the world premiere of her husband Freddie Prinze Jr.'s film The Girl in the Pool Ryan Reynolds and Hugh Jackman team up to co-host Jimmy Kimmel Live together and get interrupted by 'prank' call from Blake Lively Meghan Markle unlikely to join Prince Harry for 'olive branch trip' to reconnect with his family because she has 'too much on her plate' Celine Dion looks in good spirits as she arrives back to her Paris hotel at 1.30am 'after rehearsing for the Olympics opening ceremony' EXCLUSIVESPOILER ALERT! Married At First Sight 2025 newlyweds look very happy with their match as they pack on the PDA during amorous nuptials Madeline Holtznagel shows off her lavish sense of style as she drips in almost $3,000 worth of Chanel while stepping out for lunch down Bondi RICHARD EDEN: Kate Beckinsale opens up about the 'difficult' time she's going through with her mother's cancer Bianca Censori exposes her breasts AGAIN in shocking sheer top at the cinema with Kanye West - as somber couple leave theatre early Amanda Abbington is flooded with supportive messages after interview in which emotional actress compared Strictly to 'the trenches' Alec Baldwin hailed as 'the kindest actor' by mother of child actors in film Rust... after star's case is dismissed in fatal shooting of cinematographer EXCLUSIVEMarried At First Sight 2025: Neighbours actor is the latest addition to the Channel Nine dating show as he is spotted filming his wedding Jennifer Lopez thanks fans for 'caring' about her on 55th birthday - after Ben Affleck snubbed lavish Bridgerton party amid marriage turmoil Mindy Cohn was 'devastated' after 'greedy b****' in the Facts of Life cast halted reboot: 'It was an ouch' Jennifer Aniston slams Donald Trump's running mate J.D. Vancefor his viral comments about 'childless cat ladies' and vows to 'pray' for his daughter Amanda Abbington sobs as she claims former dance partners of Giovanni Pernice texted her 'I'm so sorry' when their pairing was announced Josh Hartnett and wife Tamsin Egerton share a steamy kiss on the red carpet as they attend the world premiere of his new movie Trap in New York Billy Ray Cyrus, 62, ADMITS to shock tirade against wife Firerose, 37, as he offers furious explanation to expletive-filled rant caught on audio Jelena Dokic shows off her body transformation in a pretty summer dress during European holiday after losing 20kg Machine Gun Kelly hosts surprise 15th birthday bash for his daughter Casie Colson Baker: 'The world spins but when I look at you it stops' Gina Carano is 'moved to tears' after judge REJECTS Disney's motion to dismiss her lawsuit over Mandalorian firing The Kardashians Season 5 finale trailer finds Kim claiming momager Kris Jenner is 'lazy' while Khloe bashes Kourtney's 'disgusting' diet Emma Corrin and Rami Malek look effortlessly stylish as they step out in tinted sunglasses for a stroll through New York Megan Barton-Hanson puts on an effortlessly stunning display in a gold minidress as she attends the Garnier Pride Party at Sushi Samba Janet Jackson talks about dealing with the loss of brother Michael15 years after his death: 'It's still emotional listening to him every night' Gigi Hadid is effortlessly stylish in a sheer dress as she grabs ice cream with a friend in NY... amid claims Bradley Cooper is ready to propose Taylor Swift follows in Naomi Campbell's footsteps as an exhibition exhibition of her iconic outfits is launched at the V&A London The Kardashians find out their biological age... and not everyone is happy including Kim and Kris Kylie shows off mansion... but not Timothee: Billionaire calls in Nobu chefs for huge family dinner inside $36M mansion Celine Dion in 'final stages' of negotiating Resorts World Las Vegas residency... amid ongoing battle with stiff person syndrome Who is it? Kim Kardashian CENSORS the name of ex boyfriend she DUMPED after he questioned her lifestyle choices... and fan theories go wild RICHARD EDEN: Eldest daughter of F1 star Eddie Jordan divorces husband after 14 years of marriage All over EPHRAIM HARDCASTLE: King Charles snored whilst at school and his fellow pupils recorded him sending up the Zs Emma Corrin shows off their quirky sense of style in a silver embellished dress and red tights as they arrive at Jimmy Kimmel Live! Selena Gomez slips into sexy yellow swimsuit beside boyfriend Benny Blanco as she thanks him for 'sharing your life with me' in sweet post Miley Cyrus shares photo embracing mom Tish in apparent show of support after estranged dad Billy Ray called her a 'skank' and 'scum of the earth' Kourtney or Kris? Kourtney Kardashian can't hide her outrage after baby Tatum mistakes her for Kris Jenner despite 23-year age difference Geordie Shore star Faith Mullen reveals she's quit fame to get a 'normal job' after being brutally axed from the MTV show Nick Knowles, 61, 'joins the Strictly lineup after months of talks with bosses as the scandal-hit show continues to battle abuse claims' EastEnders star Natalie Cassidy admits she still calls herself 'ugly' despite her weight loss - after being cruelly bullied as a child Australian singer Firerose makes a huge move following split from Billy Ray Cyrus - after shocking audio of him verbally abusing her in expletive-ridden rant emerges Rebel Wilson reveals the shocking reason she did not have her first relationship until she was 35 Nineties pop star has barely aged as she performs in Glasgow... 30 years after finding fame with her iconic number one hit EXCLUSIVEBradley Cooper's MARRIAGE plans for Gigi Hadid revealed - as insiders lift the lid on the couple's 'blended functional family' Jonathan Ross' daughter Honey, 27, opts for a fun tartan miniskirt as she joins h","summary":"The professional dancer, 33, has been at the center of a complaint feud in recent weeks after Amanda Abbington lodged a complaint with the BBC over Giovanni's behaviour.","url":"https://www.dailymail.co.uk/tvshowbiz/article-13677305/Strictly-Come-Dancing-Giovanni-Pernice-boost-BBC-bulling-case.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/07/26/21/87823847-0-image-m-16_1722024059267.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/07/24/1590743924478030025/1024x576_MP4_1590743924478030025.mp4","publish_date":"2024-07-26 22:48:48","author":"Chloe Louise,Editor","authors":["Chloe Louise","Editor"],"language":"en","source_country":"gb","sentiment":0.224},{"id":252727506,"title":"FBI Director Doubts Trump Was Struck by Bullet During Rally, Trump-Campaign Says 'Conspiracy Bulls–t'","text":"FBI Director, Christopher Wray asserted on Wednesday, July 24, that perhaps former President Donald Trump may not have acquired the ear injury by a rifle bullet. The Director told the House Judiciary Committee in a hearing that the cause of Trump's injury was not clear as of now. \"With respect to former President Trump, there’s some question about whether or not it’s a bullet or shrapnel that hit his ear,\" Wray said responding to House Judiciary Committee Chairman Jim Jordan (R-Ohio) as reported by Daily Beast. The Chairman inquired about the eight shots fired during the rally in Butler, Pennsylvania on July 13 by asking, \"We obviously know that Mr. Comperatore lost his life, two other rally-goers were injured, and then the one that hit President Trump. Where did all eight bullets go?\" Meanwhile, Trump's Trump spokesperson Steven Cheung responded to the assertion by saying, \"Anyone who believes this conspiracy bulls–t is either mentally deficient or willfully peddling falsehoods for political reasons. We have seen there is no depth low enough for the Biden-Harris Administration. So it’s not surprising they are doing this now,\" according to the NY Post. The comment by Wray opposes the narrative that the businessman-turned-politician had shared, calling it a near-death experience. In an interview with the NY Post, Trump explained, \"The doctor at the hospital said he never saw anything like this, he called it a miracle. I’m not supposed to be here, I’m supposed to be dead.\" Adding on the Republican presidential nominee said, \"I just wanted to keep speaking, but I just got shot.\" In a statement shared after the attempted assassination by former White House physician and current Congressman Ronny Jackson, he declared, \"As reported and witnessed by the entire world, he sustained a gunshot wound to the right ear from a high-powered rifle used by the would-be assassin,\" about the ex-President's injury. In the public statement, he further stated, \"The bullet track produced a 2 cm wide wound that extended down to the cartilaginous surface of the ear. There was initially significant bleeding, followed by marked swelling of the entire upper ear,\" confirming a bullet injury. Commenting on Wray after his controversial statement during the hearing, Trump took to Truth Social and wrote, \"FBI Director Christopher Wray told Congress yesterday that he wasn’t sure if I was hit by shrapnel, glass, or a bullet (the FBI never even checked!), but he was sure that Crooked Joe Biden was physically and cognitively “uneventful” - Wrong! That’s why he knows nothing about the terrorists and other criminals pouring into our Country at record levels.\" Detesting the statement he said, \"His only focus is destroying J6 Patriots, Raiding Mar-a-Lago, and saving Radical Left Lunatics, like the ones now in D.C. burning American flags and spray painting over our great National Monuments - with zero retribution. No, it was, unfortunately, a bullet that hit my ear, and hit it hard. There was no glass, there was no shrapnel. The hospital called it a “bullet wound to the ear,” and that is what it was. No wonder the once-storied FBI has lost the confidence of America!\"","summary":"The House Judiciary Committee Chairman inquired about the eight shots fired during the rally in Butler, Pennsylvania on July 13.","url":"https://www.inquisitr.com/fbi-director-doubts-trump-was-struck-by-bullet-during-rally-trump-campaign-says-conspiracy-bullst","image":"https://dab57h0r8ahff.cloudfront.net/707346/uploads/8e8c83d0-4b13-11ef-9732-abc1ba4f68c9_1200_630.jpeg","video":null,"publish_date":"2024-07-26 22:46:03","author":"INQUISITR,Tavishi","authors":["INQUISITR","Tavishi"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.646},{"id":252726062,"title":"FBI Says Trump Was Struck by Bullet or Its Fragment—as He Crows","text":"The FBI has reportedly confirmed former President Donald Trump was indeed shot by a bullet, ending speculation about what exactly bloodied Trump’s ear. The agency told Fox News reporter Jacqui Heinrich in a statement on Friday afternoon, “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the statement read. The statement was also posted by Fox’s Bret Baier. The FBI did not immediately respond to a request for comment from The Daily Beast.","summary":"Brendan McDermid/ReutersThe FBI has reportedly confirmed former President Donald Trump was indeed shot by a bullet, ending speculation about what exactly bloodied Trump’s ear.The agency told Fox News reporter Jacqui Heinrich in a statement on Friday afternoon, “What struck...","url":"https://nation.lk/online/fbi-says-trump-was-struck-by-bullet-or-its-fragment-as-he-crows-271989.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-07-26 22:30:05","author":null,"language":"en","catgory":"politics","source_country":"lk","sentiment":-0.577},{"id":252725746,"title":"After failed assassination attempt, Trump to hold another rally in Butler, Pa.","text":"July 26 (UPI) -- Donald Trump on Friday vowed to return to Butler, Pa., to hold a rally in the same town where an assassin's bullet nearly ended his life two weeks ago. The former president posted on Truth Social that the rally would honor firefighter Corey Comperatore, who was killed in the July 13 shooting, along with those who were injured. \"WHAT A DAY IT WILL BE -- FIGHT, FIGHT, FIGHT!,\" the post read. Trump did not announce a specific location nor a date for the rally, just telling his supporters to \"stay tuned for details.\" Trump is scheduled to host a rally in Harrisburg on Wednesday, which will mark his first time in the Keystone State since the assassination attempt. The U.S. Secret Service has advised the Trump campaign to stop hosting outdoor rallies, according to reporting from the Washington Post. Trump's would-be killer, Thomas Crooks, got off multiple shots at the Butler rally, one of which possibly grazed the former president's ear, before law enforcement shot and killed him. The incident led to widespread scrutiny over security failures at the event. Secret Service Director Kimberly Cheatle said Tuesday she would step down after numerous calls for her resignation. The House of Representatives on Wednesday voted unanimously to establish a bipartisan task force to investigate the attempt on Trump's life.","summary":"Donald Trump on Friday vowed to return to Butler, Pa., to hold a rally in the same town where an assassin's bullet nearly ended his life two weeks ago.","url":"https://www.upi.com/Top_News/US/2024/07/26/donald-trump-rally-butler-pennsylvania/7461722029417/","image":"https://cdnph.upi.com/ph/st/th/7461722029417/2024/upi_com/f850027635efde9b895c339cbc77b006/v1.2/After-failed-assassination-attempt-Trump-to-hold-another-rally-in-Butler-Pa.jpg","video":null,"publish_date":"2024-07-26 22:29:57","author":"Ehren Wynder","authors":["Ehren Wynder"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.177},{"id":252725744,"title":"Kamala Harris Dealt Triple Swing State Polling Blow in One Week","text":"Vice President Kamala Harris lags behind former president Donald Trump in several recent polls taken in swing states.Harris launched her presidential campaign shortly after President Joe Biden announced he was withdrawing from the race on Sunday. Biden then announced that he was endorsing Harris as the Democratic nominee for president.Harris is not yet the official Democratic candidate for president, but a survey of delegates conducted by The Associated Press has found that the vice president has enough support to secure the nomination.However, three recent polls show that Trump continues to outperform Harris in several swing states which will be pivotal to winning the election. The poll results come despite several big Democratic names putting their support behind Harris, including former president Barack Obama.Newsweek reached out to Harris' and Trump's campaigns by email for comment.Polling company Redfield and Wilton Strategies released their results from a recent poll of 6,927 swing state voters on Friday. The poll was conducted between July 22 and 24, shortly after Biden dropped out of the race. Results show that Trump leads Harris in seven of the nine swing states polled, including Arizona, Florida, Georgia, Michigan, Nevada, North Carolina, and Pennsylvania. Harris leads Trump 44 percent to 41 percent in Minnesota. The two candidates are tied at 44 percent in Wisconsin.Emerson College Polling/The Hill polled five swing states from July 22 to 23 and found similar results. Harris trailed Trump in four states: Arizona, Georgia, Michigan and Pennsylvania. The polling also found that the two candidates were tied in Wisconsin, at 47 percent each.Clean and Prosperous America PAC surveyed voters in four battleground states from July 17 to 20, before Biden announced his withdrawal. Trump outperformed Biden in all four states—Arizona, Michigan, North Carolina and Pennsylvania—as well as Harris.However, when compared to prior polling, the Redfield and Wilton Strategies survey found that Trump's lead over Harris in Arizona, Nevada and North Carolina had narrowed when compared to his lead over Biden last week. Despite the slight improvement to the Democratic ticket in those swing states, Trump's lead over Harris had widened when compared to his performance against Biden in Florida and Michigan. His lead remained unchanged in Georgia, Pennsylvania and Wisconsin, the poll found.The polls come only days after an On Point Politics/SoCal Research poll and a Morning Consult poll released Sunday after Biden's announcement and Monday respectively also found Harris losing to Trump.Despite the concerning polls, Harris is taking action to bolster her campaign, including by raising millions of dollars in less than 24 hours after Biden stepped down and holding her first campaign rally in Milwaukee on Tuesday.","summary":"Harris launched her presidential campaign after President Joe Biden withdrew from the race and endorsed her.","url":"https://www.newsweek.com/kamala-harris-dealt-triple-swing-state-polling-blow-against-donald-trump-1931000","image":"https://d.newsweek.com/en/full/2437697/kamala-harris-dealt-triple-swing-state-polling.jpg","video":null,"publish_date":"2024-07-26 22:27:41","author":"Anna Skinner","authors":["Anna Skinner"],"language":"en","source_country":"US","sentiment":-0.366},{"id":252726078,"title":"DNC Renaissance: Stars backing Harris could make Chicago the ‘party of the year’","text":"Hollywood celebrities have long flocked to the Democratic Party‘s top campaign events in modern history. But with Vice President Kamala Harris likely to be the Democratic presidential nominee after President Joe Biden exited the race, the Democratic National Convention next month is sure to be one of the hottest places to spot several A-listers. The excitement of a possible Harris presidency, which would make her the nation’s first woman president, has inspired Democrats of the highest caliber to fundraise millions of dollars and, in one case, even lend the vice president a song to feature in her first campaign ad. “It’s great to have celebrity endorsers,” said Louis Perron, political scientist and consultant. “It’s always a question of how you use them strategically, what you want to try to accomplish with them. How do they fit into the overall campaign plan?” Beyonce appears to have given support to Harris by allowing her to use the song “Freedom,” from her 2016 Lemonade album, in the first campaign ad Harris made reintroducing herself to the public as a 2024 presidential candidate. Before that, Beyonce gave Harris tickets to her Renaissance tour last summer, as was revealed on financial disclosure reports, in another example of the friendship between the two women. It would not be surprising if Beyonce performed or appeared at the DNC in Chicago next month. During Hillary Clinton’s 2016 presidential campaign, the megacelebrity performed a campaign concert in Cleveland, Ohio. Beyonce’s publicist did not respond to a Washington Examiner request for comment. “I think the Democratic convention, this time, is going to be the party of the year,” said Eugene Robinson, a Washington Post columnist, on Friday’s Morning Joe. “They’ll do a whole lot better than Hulk Hogan and Kid Rock let me put it that way. I can imagine the stars who will come out.” Robinson was referencing last week’s Republican National Convention, which featured a performance from Kid Rock and speeches from professional wrestler Hulk Hogan and Ultimate Fighting Championship CEO Dana White. In contrast to the RNC, celebrities popular with Gen Z, such as Charli XCX, who said Harris is “brat,” have embraced the vice president’s nascent campaign. The Harris campaign used Charli XCX’s signature “brat” green color as the background inspiration for its X account. Soccer celebrity and Olympic gold medalist Megan Rapinoe, actress Connie Britton, and musician Pink joined the “White Women Answer the Call 2024” Zoom call in support of Harris on Thursday. The meeting raised $8.5 million, in another indication of the wide-array of stars that the campaign could tap for the convention. As a California native, Harris has ties to some of the biggest stars in Hollywood, including actor George Clooney, actress Jamie Lee Curtis, and screenwriter Shonda Rhimes. Chicago is also the political home for former President Barack Obama and his wife, former first lady Michelle Obama, who will likely play a role at the convention after endorsing Harris on Friday. DNC organizers have less than a month to switch from an event where Biden would have been the headliner to a more energized convention now that a Harris campaign has rejuvenated a party beset by a previous lackluster enthusiasm over Biden, 81, and his poor debate performance against former President Donald Trump in late June. Celebrity publicists said they’re being inundated with requests from clients to help out the White House now that Biden stepped aside. “Usually I’m asking my clients,” one publicist told CNN. “Nobody had to ask. People were like, ‘What do I do, and how do I help?’” “Joe Biden’s selfless act, combined with the kind of change and optimism and turning of the page that Kamala represents has reengaged so many people I know in this election,” producer Greg Berlanti told CNN. “And they are ready to fight for so many of the values that VP Harris has been fighting for her whole career.” The Harris campaign pointed the Washington Examiner to the DNC team when asked about what celebrities would perform at the national gathering. The DNC declined to reveal the celebrity lineup, but Emily Soong, a spokeswoman, said, “Democrats will offer a positive, forward-looking vision for our country that will stand in stark contrast to the backward-looking extremism that defined Donald Trump’s convention.” Perron cautioned that while celebrities will be a major part of the DNC it shouldn’t be the main theme. “At a convention, you have the unique attention, so you want to use this to score political points and to communicate your message to swing voters,” he said. “Because I think swing voters will ultimately decide the election. I think the youth (vote) is fine and celebrities are fine, but ultimately I think the election will be decided by swing voters. So I would orchestrate the convention to please swing voters and communicate to swing voters.” CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER If past conventions are any indication, celebrities are sure to descend on Chicago for the convention on Aug. 19-22. During the 2020 virtual convention, actresses such as Eva Longoria, Kerry Washington, and Julia Louis-Dreyfus addressed viewers. The 2016 convention, which was held in person, featured performances from Boyz II Men, Demi Lovato, and Alicia Keys. In 2008, during Barack Obama’s history-making run as the nation’s first black president, actresses Jennifer Lopez, Angela Bassett, and Anne Hathaway, as well as actor Spike Lee and singers John Legend, Dave Matthews, and Sheryl Crow, were all spotted at the convention and related events.","summary":"Hollywood celebrities have long flocked to the Democratic Party&#8216;s top campaign events in modern history. But with Vice President Kamala Harris likely to be the Democratic presidential nominee after President Joe Biden exited the race, the Democratic National Convention next month is sure to be one of the hottest places to spot several A-listers. The [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3100600/stars-harris-dnc-convention-chicago-party/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/Harris_Beyonce_Entertainment_55.webp","video":null,"publish_date":"2024-07-26 22:21:43","author":"Mabinty Quarshie","authors":["Mabinty Quarshie"],"language":"en","source_country":"US","sentiment":0.436},{"id":252725782,"title":"Fox News Poll: Close races in battleground states show voters locked in","text":"Most voters in four battleground states approve of President Joe Biden getting out of the presidential race and two-thirds want him to complete his term, according to Fox News statewide surveys in Michigan, Minnesota, Pennsylvania, and Wisconsin. The polls include over 1,000 registered voters in each state and were conducted July 22-24 (after Biden dropped out and endorsed Vice President Kamala Harris). The surveys find the horserace between Harris and former President Donald Trump looks a lot like the Biden-Trump race did in April -- extremely close. Harris and Trump are tied in two states (Michigan and Pennsylvania), Trump is ahead by 1 point in Wisconsin, and Harris is up by 6 in Minnesota. Plus, in each of the four state surveys: TRUMP'S FORMER DOCTOR GIVES HEALTH UPDATE AFTER SHOOTING, CALLS OUT WRAY FOR DOUBT ABOUT BULLET – Most Democrats want Harris to replace Biden as their party’s presidential nominee. – Trump is meeting or exceeding his 2020 vote share in the two-way race against Harris. – Support for Harris in the horserace exceeds Biden’s support in April surveys.* – Between 93-96% of Democrats back Harris in the head-to-head matchup, and between 92-95% of Republicans support Trump. – Fewer than one voter in five feels they are \"getting ahead\" financially, as the largest number say they are \"falling behind.\" – The economy is the top issue to twice as many voters as the next highest issues, immigration and abortion. All other issues lag those three. – Trump is preferred over Harris by wide margins among voters prioritizing the economy and immigration. Harris is favored among those saying abortion is their top issue. – Harris has a higher favorable rating than Trump, except in Michigan where they are tied. – Biden’s favorable ratings are a bit worse than in April and well below both Harris and Trump.* – Democratic candidates for the U.S. Senate outperform Harris’ vote share in the horserace. – Support for third-party candidate Robert F. Kennedy Jr. is lower than it was in April.* – Three-quarters or more approve of Biden’s decision to end his re-election bid. – Two-thirds want Biden to finish his term rather than resign. *No trend comparison available in Minnesota. CLICK HERE TO GET THE FOX NEWS APP See results from the individual state surveys: Michigan here, Minnesota here, Pennsylvania here and Wisconsin here. The Fox News Poll is conducted under the joint direction of Beacon Research (D) and Shaw & Company Research (R). The battleground surveys were conducted July 22-24, 2024, among registered voters randomly selected from a statewide voter file in Michigan (1,012), Minnesota (1,071), Pennsylvania (1,034), and Wisconsin (1,046). Respondents spoke with live interviewers on landlines and cellphones or completed the survey online after receiving a text. Results based on the full sample in each state have a margin of sampling error of ±3 percentage points. The sampling error is higher among subgroups. In addition to sampling error, question wording and order can influence results. Weights are generally applied to age, race, education, and area variables to ensure the demographics are representative of the registered voter population. Fox News’ Victoria Balara contributed to this report.","summary":"Swing state polls show tightening between Trump and Harris after Biden dropped out and the vice president has become the presumed Democratic nominee.","url":"https://www.foxnews.com/official-polls/fox-news-poll-close-races-battleground-states-show-voters-locked","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/05/931/523/Donald-Trump-RNC-retreat-Palm-Beach-FL-May-4-2024.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-26 22:17:35","author":"Dana Blanton","authors":["Dana Blanton"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.315},{"id":252727196,"title":"Democrats prepare for ‘Harris Honeymoon’ to wear off","text":"Vice President Kamala Harris could not have asked for a better rollout week. President Joe Biden endorsed her. Most labor unions got behind her quickly, she’s raised a trove of cash and on Friday, she secured the endorsement of former president Barack Obama. Polling shows she’s performing better in some swing states than Biden did. “So this is, and long has been, a vibes election, it is not a list-making election,” Jon Reinish, a Democratic strategist, told The Independent. “It's not just Kamala Harris and the campaign that she is quickly building and or has inherited. It's down ballot. But, I mean, it's also that, it's in the White House, on the government side, on the policy side.” The Harris campaign has also hit the Trump campaign for the former president pulling out of the second debate. In the same token, on Thursday evening, a Zoom call titled White Women for Harris featured tons of would-be donors and celebrities such as actress Connie Britton and athletes like soccer legend Megan Rapinoe and retired WNBA superstar Sue Bird all joined it, as did gun control activist Shannon Watts and Michigan state senator Mallory McMorrowsuch raising a trove of cash for the vice president, generating jokes on social media about it being “Karens for Kamala.” Felicity Pereya, a former data director for the Democratic National Committee, was on the White Women for Harris call and a separate Latinas for Harris Zoom call. “You can't manufacture this, this is all organic,” Pereya told The Independent. “This is all real. And again, like she can her campaign can harness this.” By the same token, Republicans have been forced to recalibrate. As Inside Washington reported earlier this week, Donald Trump’s campaign is labeling Harris’s jump in the polls as the “Harris Honeymoon.” And indeed, Republicans seem to have found two weak spots where they can attack her: crime and immigration. On Thursday, House Republicans distracted from the fact they have been utterly unable to pass the necessary spending bills by introducing a resolution condemning Biden and Harris specifically in her capacity as “border czar.” Republicans harping about the influx of immigration at the US-Mexico border is not news; they’ve done that since Biden took office. What is new is that six Democrats--including three who represent districts that voted for Donald Trump--voted to condemn her. Down ballot, Republicans are trying to tie Democrats who immediately backed her to some of Harris’s more left-wing policies to thereby position vulnerable incumbents as radicals. Harmeet Dhillon, a member of the Republican National Committee for California, told The Independent that she planned on hitting Harris for her work on crime going back to the days when Harris was a district attorney for San Francisco. “I actually voted for her because she ran on a tough-on-crime platform, and then, you know, four months in, she betrays her voters,” she told The Independent, noting how even Democrats like then-senators Barbara Boxer and Dianne Feinstein criticized her for not pursuing the death penalty for the killer of slain police officer Isaac Espinoza in 2004. “You can go out there and laugh and change the subject and talk about your race and whatever, and dance and be goofy,” she said. “ But ultimately, this is the you know, sweepstakes here, running for president, the leader of the free world, and she is not going to get a free pass. Maybe from the fawning media.” When Harris ran for president in 2019, she received criticism for being too tough on crime, creating the meme that “Kamala Harris is a Cop,” at a time when many progressives began to mistrust police. “Both things can be true,” Dhillon said. “So you can rack up your numbers by imprisoning people for relatively low-level offenses. That's what she did, all right? So that's what pisses people off.” But both Harris and her opponents will have to act fast because the campaign has slightly more than 100 days left. “She's been in politics in the biggest state in the country, as vice president, of course, but she's still not the 100 percent well-known figure with deeply baked-in opinions that Donald Trump is,” Reinish told The Independent. “They have an opportunity to potentially move a lot of folks once they start telling her story, communicating the record, communicating the vision, it,” Pereya said. That means that Harris will need to have a spring to the finish line, from the convention to potentially debating Trump to get-out-the-vote efforts. “I think her next big thing is picking a vice president that definitely balances out her, while also kind of building on that momentum and enthusiasm behind her,” Atima Omara, a Democratic strategist in Virginia who is a member of the Democratic National Committee, told The Independent. Pereya said that the veepstakes gives Democrats an opportunity to engage with voters. “’Is it going to be Senator Kelly? Is it going to be Pete Buttigieg? Like, who is it’ to sort of keep people tuned in there all the way through until the convention, announce it at the convention,” Pereya said. “They should probably do, you know, do some sort of effort to get people engaged with the campaign and, like, sign up for text messages.” Ultimately, though, Pereya said the big challenge will be keeping voters engaged and feel like they have a voice in the campaign. “So when they harness this right, like harness this natural, organic energy, they have to harness it by deputizing all of these people that are coming out of the woodwork to essentially be deputy organizers for the campaign,” she said. “That’s how they win.”","summary":"‘You can’t manufacture this, this is all organic,’ one Democratic strategist tells The Independent","url":"https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-honeymoon-campaign-trump-b2586728.html","image":"https://static.independent.co.uk/2024/07/26/22/GettyImages-2162560198.jpg?width=1200","video":null,"publish_date":"2024-07-26 22:17:24","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.291},{"id":252725174,"title":"Who will Vice President Kamala Harris choose as running mate? 2 popular Democrats are being considered","text":"(WSVN) - Vice President Kamala Harris is less than two weeks away from naming her own running mate. There is a list of possible picks who are making headlines. As Harris moves closer to clinching the Democratic nomination for president, who will the current vice president pick as her running mate? The top two names that are reportedly being vetted are Mark Kelly, a U.S. senator from Arizona, and North Carolina Gov. Roy Cooper. “This is about the future of this country,” Kelly said. “You know, whether, whether we want to take this country back to 2016 and 2020 when this – the world was a much more dangerous place and Donald Trump as president of the United States. The damage he did to our alliances is – we’re still recovering.” “I endorse Kamala Harris 100% for this job as president,” Cooper said. “I’ve known her a number of years. We served as attorneys general together. She has to win.” Kelly and Cooper are among the first to throw their support behind the vice president. Both of them are popular Democrats from critical swings states, which could deliver the White House to Harris. Sen. Kelly is 60 years old, a retired Navy pilot and a NASA astronaut who has clocked in 50 days in space. His first publicly held office was after a special election to replace the seat left vacant after the late Sen. John McCain’s death. He’s married to former Congresswoman Gabby Giffords, a victim of gun violence. Considered a moderate, he’s worked to advocate for universal background checks and has been a critical voice of the border issue. Kelly has also voiced criticism of Arizona’s strict abortion laws. Gov. Cooper is 67 years old and is the leader of a state who last went blue in 2008 for former President Barack Obama. His decades in public service began when he was elected to the North Carolina House of Representatives in 1986. Since then, he’s served as the state’s attorney general starting in 2000, until he was elected governor in 2016. Cooper’s record includes vetoing versions of a bill that ordered North Carolina sheriffs to comply with federal immigration requests, pledging to protect abortion rights his state, and he has vetoed bills aimed at banning gender-affirming health care for minors. There are reports that Harris would like to name the number two no later than Aug. 7. Copyright 2024 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"Vice President Kamala Harris is less than two weeks away from naming her own running mate. There is a list of possible picks who are...","url":"https://wsvn.com/news/politics/who-will-vice-president-kamala-harris-choose-as-running-mate-2-popular-democrats-are-being-considered/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/07/24726_Kelly_Cooper_possible_vice_presidential_candidates.jpg?quality=60&strip=color","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/808ce514-560b-4dec-a96d-fa07404c2788/169c20c0-a159-443f-92a4-b5cee82b4e23/main.mp4?fastly_token=NjZhNDc4YTdfMTZmYWE0ZWMxZDJlNWM2YWQzNjk1YTc4YTVmOWQyNDVlN","publish_date":"2024-07-26 22:15:52","author":"Julian Quintana","authors":["Julian Quintana"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.274},{"id":252725920,"title":"FBI Says Trump Was Struck by Bullet or Its Fragment—as He Crows","text":"The FBI has reportedly confirmed former President Donald Trump was indeed shot by a bullet, ending speculation about what exactly bloodied Trump’s ear. The agency told Fox News reporter Jacqui Heinrich in a statement on Friday afternoon, “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the statement read. The statement was also posted by Fox’s Bret Baier. The FBI did not immediately respond to a request for comment from The Daily Beast. The controversy began on Wednesday when FBI director Christopher Wray told Congress that, “There is some question about whether or not it was a bullet or shrapnel that hit his ear.” Wray testified: “So, it is conceivable, as I sit here right now, I don’t know whether that bullet, in addition to causing the grazing, could have also landed somewhere else.” The former president posted on his Truth social account moments after the Fox report Friday. “I assume that’s the best apology that we’ll get from Director Wray, but it is fully accepted,” the former president wrote, alongside an image of the statement attached. The announcement comes after Trump was spotted for the first time without his signature ear bandage during his meeting with Israeli Prime Minister Benjamin Netanyahu earlier on Friday.","summary":"Brendan McDermid/ReutersThe FBI has reportedly confirmed former President Donald Trump was indeed shot by a bullet, ending speculation about what exactly bloodied Trump’s ear.\n\nThe agency told Fox News reporter Jacqui Heinrich in a statement on Friday afternoon, “What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” the statement read. The statement was also posted by Fox’s Bret Baier.\n\nThe FBI did not immediately respond to a request for comment from The Daily Beast.\n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/fbi-says-trump-was-struck-by-bullet-or-its-fragment-as-he-crows","image":"https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1699,w_3021,x_0,y_61/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1722031742/2024-07-23T150150Z_502061391_RC2MU8ACHVD2_RTRMADP_3_USA-ELECTION-TRUMP-CHEATLE_hciwis","video":null,"publish_date":"2024-07-26 22:15:29","author":"Owen Lavine","authors":["Owen Lavine"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.443}]}