{"offset":0,"number":50,"available":10878,"news":[{"id":338041390,"title":"CNBC Daily Open: Rely on the official U.S. jobs report, but consider what ADP is saying","text":"The U.S. economy added more jobs in June than expected. Nonfarm payrolls increased a seasonally adjusted 147,000 for the month, higher than the estimate for 110,000. The unemployment rate also ticked down to 4.1% from 4.2% in May.\n\nThe S&P 500 and Nasdaq Composite notch new records. Both indexes rose Thursday to extend their streak of new closing highs. Yield on the 10-year U.S. Treasury jumped. The Stoxx Europe 600 added 0.47%, pushing itself out of a loss.\n\nApple's iPhone sales in China grow. The figure jumped 8% year on year in the second quarter of 2025. That's the first time in two years Apple has recorded an increase in sales in China, according to Counterpoint Research.\n\nTrump's massive bill passed by U.S. government. On Thursday, the House of Representatives voted in favor of the tax-and-spending bill, with a finally vote tally of 218-214. The passage of the bill is a major political victory for U.S. President Donald Trump.\n\n[PRO] A relief to European renewable energy firms. Amendments in Trump's bill gave renewable stocks a boost and could mean the \"worst-case scenario\" for the sector might not come to pass, an analyst said.","summary":"The huge divergence between the ADP and BLS reports could point to a growing schism in the U.S. labor market.","url":"https://www.cnbc.com/2025/07/04/cnbc-daily-open-rely-on-official-us-jobs-report-but-consider-the-adp.html","image":"https://image.cnbcfm.com/api/v1/image/108167871-1751591444278-gettyimages-2222164545-l1056050_ls5thuhz.jpeg?v=1751591490","video":null,"publish_date":"2025-07-04 01:15:52","author":"Yeo Boon Ping","authors":["Yeo Boon Ping"],"language":"en","category":"politics","source_country":"us","sentiment":-0.111},{"id":338040068,"title":"Japan plans ‘world first’ deep-sea mineral extraction","text":"TOKYO: Japan will from January attempt to extract rare earth minerals from the ocean floor in the deepest trial of its kind, the director of a government innovation programme said Thursday.\n\nEarlier this week the country pledged to work with the United States, India and Australia to ensure a stable supply of critical minerals, as concern grows over China’s dominance in resources vital to new technologies.\n\nRare earths — 17 metals difficult to extract from the Earth’s crust — are used in everything from electric vehicles to hard drives, wind turbines and missiles.\n\nChina accounts for almost two-thirds of rare earth mining production and 92 percent of global refined output, according to the International Energy Agency.\n\nA Japanese deep-sea scientific drilling boat called the Chikyu will from January conduct a “test cruise” to retrieve ocean floor sediments that contain rare earth elements, said Shoichi Ishii, director of Japan’s Cross-ministerial Strategic Innovation Promotion Programme.\n\n“The test to retrieve the sediments from 5,500 metres (3.4 miles) water depth is the first in the world,” he told AFP.\n\n“Our goal... of this cruise is to test the function of all mining equipment,” so the amount of sediment extracted “doesn’t matter at all”, Ishii added.\n\nThe Chikyu will drill in Japanese economic waters around the remote island of Minami Torishima in the Pacific — the easternmost point of Japan, also used as a military base.\n\nJapan’s Nikkei business daily reported that the mission aims to extract 35 tonnes of mud from the sea floor over around three weeks.\n\nEach tonne is expected to contain around two kilograms (4.4 pounds) of rare earth minerals, which are often used to make magnets that are essential in modern electronics.\n\nDeep-sea mining has become a geopolitical flashpoint, with anxiety growing over a push by US President Donald Trump to fast-track the practice in international waters. Beijing has since April required licences to export rare earths from China, a move seen as retaliation for US curbs on the import of Chinese goods.","summary":"TOKYO: Japan will from January attempt to extract rare earth minerals from the ocean floor in the deepest trial of its kind, the director of a government innovation programme said Thursday.\n\n\n\nEarlier this week the country pledged to work with the United States, India and Australia to ensure a stable supply of critical minerals, as concern grows over China’s dominance in resources vital to new technologies.\n\n\n\nRare earths — 17 metals difficult to extract from the Earth’s crust — are used in everything from electric vehicles to hard drives, wind turbines and missiles.\n\n\n\nChina accounts for almost two-thirds of rare earth mining production and 92 percent of global refined output, according to the International Energy Agency.\n\n\n\nA Japanese deep-sea scientific drilling boat called the Chikyu will from January conduct a “test cruise” to retrieve ocean floor sediments that contain rare earth elements, said Shoichi Ishii, director of Japan’s Cross-ministerial Strategic Innovation Promotion Programme.\n\n\n\n“The test to","url":"https://www.brecorder.com/news/40371070/japan-plans-world-first-deep-sea-mineral-extraction","image":"https://i.brecorder.com/large/2025/07/68670c130ee11.jpg","video":null,"publish_date":"2025-07-04 01:02:48","author":"AFP,Us President Donald","authors":["AFP","Us President Donald"],"language":"en","source_country":"pk","sentiment":-0.123},{"id":338040062,"title":"Thailand gets third leader this week as new cabinet sworn in","text":"BANGKOK: Thailand saw its third person helming the prime minister’s office in a week on Thursday, as the king swore in a new cabinet after a court decision plunged the nation’s top office into turmoil. The prime minister’s office was upheaved on Tuesday when the Constitutional Court suspended Prime Minister Paetongtarn Shinawatra pending an ethics probe which could take months. Power passed to transport minister and deputy prime minister Suriya Jungrungreangkit who took office for only one full day, as the bombshell was dropped in an awkward interim ahead of the reshuffle.\n\nFormer defence minister Phumtham Wechayachai was sworn in as interior minister by the king on Thursday morning, taking on a deputy prime minister role outranking Suriya’s — thus becoming the acting premier.\n\nThe Thai government said in a statement on social media that the new cabinet approved Phumtham’s role as acting prime minister at its first meeting.\n\nBefore Paetongtarn was ousted she assigned herself the role of culture minister in the new cabinet, meaning she has kept a perch in the upper echelons of power.\n\nThe revolving door of leadership comes as the kingdom is battling to revive a spluttering economy and secure a US trade deal averting President Donald Trump’s looming threat of a 36 percent tariff.\n\nPhumtham is considered a loyal lieutenant to the suspended Paetongtarn and her father Thaksin Shinawatra, the powerful patriarch of a dynasty which has dominated Thai 21st-century politics.\n\nThaksin-linked parties have been jousting with the pro-military, pro-conservative establishment since the early 2000s, but analysts say the family’s political brand has now entered decline.","summary":"BANGKOK: Thailand saw its third person helming the prime minister’s office in a week on Thursday, as the king swore in a new cabinet after a court decision plunged the nation’s top office into turmoil. The prime minister’s office was upheaved on Tuesday when the Constitutional Court suspended Prime Minister Paetongtarn Shinawatra pending an ethics probe which could take months. Power passed to transport minister and deputy prime minister Suriya Jungrungreangkit who took office for only one full day, as the bombshell was dropped in an awkward interim ahead of the reshuffle.\n\n\n\nFormer defence minister Phumtham Wechayachai was sworn in as interior minister by the king on Thursday morning, taking on a deputy prime minister role outranking Suriya’s — thus becoming the acting premier.\n\n\n\nThe Thai government said in a statement on social media that the new cabinet approved Phumtham’s role as acting prime minister at its first meeting.\n\n\n\nBefore Paetongtarn was ousted she assigned herself the role of culture minister","url":"https://www.brecorder.com/news/40371013/thailand-gets-third-leader-this-week-as-new-cabinet-sworn-in","image":"https://i.brecorder.com/large/2025/07/6867072b5cf83.jpg","video":null,"publish_date":"2025-07-04 01:02:48","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":0.252},{"id":338040400,"title":"Dollar holds firm against euro, yen as US trade pressure mounts","text":"TOKYO :The dollar held gains on Friday after President Donald Trump got his signature tax cut bill across the final hurdle and pressure mounted on countries to secure trade deals with the United States.\n\nThe greenback rallied from multi-year lows against the euro and British pound hit earlier in the week after stronger than expected U.S. jobs data pushed out the timing for potential rate cuts by the Federal Reserve.\n\nNew Zealand's kiwi dollar, a common proxy for risk appetite, rose 0.2 per cent to $0.608 after U.S. stocks climbed to new record levels. \n\nThe Republican-controlled House of Representatives narrowly passed Trump's \"One, Big, Beautiful Bill\" of spending and tax cuts that is estimated to add $3.4 trillion to the nation's $36.2 trillion debt. \n\nWith the U.S. closed for Independence Day, attention turns to Trump's July 9 deadline when sweeping tariffs take effect on countries like Japan that have not yet secured trade agreements.\n\n\"The dynamic is raising questions about fiscal sustainability and bond market stability,\" said Kyle Rodda, senior financial markets analyst at Capital.com, referring to the bill's passage. \n\n\"However, for now, those risks are being looked through as the markets embrace signs of labour market resilience and hopes for further U.S. trade deals.\"\n\nThe dollar index, which tracks the greenback against major peers, had its worst first half since 1973 as Trump's chaotic roll-out of sweeping tariffs stoked concerns about the U.S. economy and the safety of Treasuries.\n\nTrump said the U.S. will start sending letters to countries on Friday specifying what tariff rates they will face, a shift from earlier pledges to ink individual deals. \n\nAgainst the yen the dollar was traded at 144.69 yen, down 0.2 per cent from late in the U.S. trading day when it surged 0.8 per cent. The euro added 0.1 per cent to $1.1769, while sterling traded at $1.3668, up 0.1 per cent.\n\nThe Australian dollar fetched $0.6577, up 0.1 per cent in early trade.\n\nU.S. Labor Department's closely watch employment report on Thursday showed that nonfarm payrolls increased by 147,000 jobs in June, well ahead of economists' forecast in a Reuters poll for a rise of 110,000. \n\nMarket expectations that the Fed will leave rates unchanged at its July meeting rose to a 95.3 per cent probability, up from 76.2 per cent previously, according to the CME's Fedwatch tool.\n\nEconomists continue to expect the Fed would not start cutting rates again until September or even later.","summary":"","url":"https://www.channelnewsasia.com/business/dollar-holds-firm-against-euro-yen-us-trade-pressure-mounts-5219836","image":"https://dam.mediacorp.sg/image/upload/s--CzDdC1Kq--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-07-04t010219z_1_lynxmpel6300o_rtroptp_3_usa-trump-tariffs-indonesia","video":null,"publish_date":"2025-07-04 01:02:19","author":null,"language":"en","source_country":"sg","sentiment":-0.135},{"id":338040768,"title":"Kebakaran besar berlaku di California, 300 bomba dikerah padam kebakaran","text":"LOS ANGELES: Lebih 300 anggota bomba dikerah semalam untuk memadamkan kebakaran besar di California, ketika negeri itu berdepan kebimbangan kebakaran hutan ketika musim panas. \n\nKebakaran yang dinamakan \"Madre Fire\" itu mula tercetus kelmarin di San Luis Obispo iaitu sebuah daerah luar bandar yang terletak di tengah-tengah negeri berkenaan. \n\nKira-kira 200 penduduk diarahkan berpindah, manakala puluhan bangunan dilaporkan terancam akibat api yang sedang marak. \n\nIa kini menjadi kebakaran terbesar setakat tahun ini di California yang sebelum ini pernah musnah teruk akibat kebakaran hutan sehingga memusnahkan kawasan luas di Los Angeles pada awal tahun ini.\n\nKebakaran itu merebak dengan pantas apabila dalam tempoh kurang 24 jam, lebih 35,000 ekar (14,160 hektar) kawasan sudah hangus dijilat api, menurut Jabatan Bomba Negeri, Cal Fire.\n\nGambar daripada sistem amaran negeri turut memaparkan kepulan asap hitam tebal menyelubungi kawasan pergunungan di wilayah berbukit dan terpencil itu.\n\nGabenor California, Gavin Newsom berkata, kerajaan negeri akan sentiasa turun padang melindungi semua komuniti, tidak kira di mana kebakaran bermula,\" katanya menerusi catatan di X, sambil mengumumkan penghantaran pasukan tambahan. \n\nKebakaran \"Madre Fire\" berlaku selepas beberapa siri kebakaran lain, sekali gus menimbulkan kebimbangan musim panas yang lebih mencabar buat negeri itu yang masih trauma dengan tragedi kebakaran hutan yang mengorbankan 30 nyawa pada Januari lalu.\n\nMusim sejuk dan musim bunga di selatan California juga dilaporkan lebih kering daripada kebiasaan, menyebabkan tumbuh-tumbuhan di kawasan itu semakin mudah terbakar, menurut Pakar Peristiwa Iklim Ekstrem UCLA, Daniel Swain menerusi catatan blognya.\n\n\"Dengan jangkaan suhu lebih panas dan merebak lebih meluas pada musim panas ini, tempoh tambahan sebulan dua untuk tumbuh-tumbuhan menjadi lebih kering akan banyak mempengaruhi keadaan kebakaran nanti,\" katanya.\n\nIni adalah musim panas pertama sejak Presiden Amerika Syarikat (AS) Donald Trump mengarahkan pemotongan peruntukan dan tenaga kerja di Perkhidmatan Perhutanan, Pentadbiran Lautan dan Atmosfera Kebangsaan (NOAA) serta FEMA, iaitu agensi persekutuan yang menyelaras tindak balas bencana.\n\nKelmarin, Newsom menuduh Trump gagal menyediakan peruntukan mencukupi bagi projek pencegahan kebakaran hutan.\n\n\"Kita perlukan komitmen sumber yang setara, bukan sekadar retorik,\" katanya dalam sidang media, sambil mengingatkan bahawa sebanyak 57 peratus daripada tanah di negeri itu kini berada di bawah bidang kuasa kerajaan persekutuan.","summary":"LOS ANGELES: Lebih 300 anggota bomba dikerah semalam untuk memadamkan kebakaran besar di California, ketika negeri itu berdepan kebimbangan kebakaran hutan ketika musim panas.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1415580/kebakaran-besar-berlaku-di-california-300-bomba-dikerah-padam","image":"https://assets.bharian.com.my/images/articles/BH4fire-o_BHfield_image_listing_featured.var_1751590707.jpg","video":null,"publish_date":"2025-07-04 00:58:33","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":0.16},{"id":338041512,"title":"Pakistan air force chief in US to strengthen defence cooperation","text":"ISLAMABAD: Pakistan's chief of air staff Zaheer Ahmed Baber Sidhu paid an official visit to the US to further enhance bilateral defence cooperation after army chief Field Marshal Asim Munir recently undertook a similar tour. This was the first visit by a serving Pakistan air force (PAF) chief in over a decade, an indication of stepping up military engagements between Pakistan and the US.A PAF statement said on Wednesday: \"This high-level visit is a strategic milestone in the Pak-US defence partnership. The visit will play a significant role in addressing key regional and global security issues as well as building institutional ties.\" It further said Sidhu held several important meetings with the top military and political leadership of the country during the visit to the US.At the Pentagon, he met US secretary of the air force for international affairs Kelly L Seybolt and air force chief of staff General David W Elon, where the two sides agreed to forge new avenues for bilateral military cooperation, mutual affairs, joint training and technology exchange. The PAF chief highlighted the historical and multi-faceted relations between Pakistan and the US, particularly in the defence sector.Sidhu reiterated Pakistan's commitment to further strengthening the existing relations between the air forces of the two countries in the areas of military cooperation and training. During the detailed discussions, the two sides also agreed to establish high-level military relations in the future.They reiterated their commitment to forge new avenues for cooperation between the two countries in various fields, including joint training, operational exercises and exchange programmes, and to intensify efforts for this purpose, the statement said.During his visit to the US state department, Sidhu met Brown L Stanley of the bureau of political and military affairs and Eric Meyer of the bureau of South and Central Asian affairs. The meetings highlighted Pakistan's constructive role in promoting regional stability, the statement said. During his visit to Capitol Hill, Sidhu held meetings with members of the US Congress, including Mike Turner, Rich McCormick, and Bill Heizenga. The visit comes weeks after President Donald Trump hosted Munir for lunch, followed by a detailed meeting between the two.","summary":"Air Chief Marshal Zaheer Ahmed Baber Sidhu's US visit marks a significant step in bolstering Pakistan-US defence cooperation, following a similar tour by the army chief. Discussions with US military and political leaders focused on enhancing bilateral military ties, joint training, and technology exchange.","url":"https://timesofindia.indiatimes.com/world/pakistan/pakistan-air-force-chief-in-us-to-strengthen-defence-cooperation/articleshow/122238304.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-122238311/122238311.jpg","video":null,"publish_date":"2025-07-04 00:58:02","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.177},{"id":338040406,"title":"California battles biggest wildfire of the year","text":"LOS ANGELES: More than 300 firefighters battled on Thursday (Jul 3) a massive blaze in California, which is dreading summer wildfires at a time when President Donald Trump is gutting federal agencies tasked with fighting climate disaster.\n\nThe \"Madre Fire\" broke out on Wednesday in San Luis Obispo, a rural county in the heart of the US state. Around 200 people were ordered to evacuate, with dozens of buildings threatened by the flames.\n\nIt is the largest blaze so far this year in California, which was scarred by wildfires that destroyed swaths of Los Angeles at the start of the year.\n\nThe fire has spread quickly. In 24 hours, it has ravaged over 52,000 acres, according to the state's fire service Cal Fire. \n\nImages from the state warning system showed thick columns of black smoke overhanging mountains in the hilly, remote region.\n\n\"The state will always show up to protect all communities - no matter where a fire begins,\" California Governor Gavin Newsom said on X, announcing the deployment of reinforcements.\n\nThe \"Madre Fire\" comes on the heels of several other blazes, raising fears of a difficult summer ahead for the state already traumatised by the wildfires that killed 30 people in January.\n\nIt was an unusually dry winter and spring in southern California, and vegetation is already parched, noted UCLA extreme climate events specialist Daniel Swain in a blog post.\n\n\"Given the expectation of even more intense and widespread heat later this summer, that extra month or two of vegetation drying will heavily factor into burning conditions later this season,\" said Swain.","summary":"","url":"https://www.channelnewsasia.com/world/us-california-firefighters-battle-biggest-summer-wildlife-2025-5219816","image":"https://dam.mediacorp.sg/image/upload/s--bxFGOIkO--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/california_wildfires_78767.jpg?itok=z7OEeqsA","video":null,"publish_date":"2025-07-04 00:58:00","author":null,"language":"en","source_country":"sg","sentiment":-0.173},{"id":338040762,"title":"Trump umum akan hantar surat nyatakan kadar tarif import bermula","text":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, mengesahkan bahawa pentadbirannya akan mula menghantar surat kepada negara-negara asing bermula Jumaat depan, bagi memaklumkan kadar tarif yang akan dikenakan terhadap barangan import ke AS.\n\nLangkah ini dilihat sebagai sebahagian daripada pendekatan tegas pentadbiran Trump terhadap dasar perdagangan global, selepas rundingan dengan lebih 150 negara gagal diselesaikan menjelang tarikh akhir yang ditetapkan.\n\n\"Saya akan hantar surat, itu penamat rundingan perdagangan,\" kata Trump kepada media sebelum berlepas ke Iowa.\n\n\"Tuan Jepun yang dihormati, inilah ceritanya. Anda akan dikenakan tarif 25 peratus ke atas kereta anda,\" tambahnya secara berseloroh.\n\nTrump menjelaskan bahawa surat-surat tersebut akan dihantar oleh Setiausaha Perbendaharaan Scott Bessent dan Setiausaha Perdagangan Howard Lutnick, dan kadar tarif yang dikenakan akan \"sangat adil\" bergantung kepada defisit perdagangan dan hubungan diplomatik dengan negara terbabit.\n\nBeliau turut menyatakan bahawa negara-negara yang tidak bersetuju dengan kadar tarif boleh memilih untuk menghasilkan produk mereka di AS:\n\n\"Jika mereka mengadu, jika mereka mahu kadar tarif sifar, maka bina produk anda di sini, di AS,\" katanya dalam wawancara bersama Fox News.\n\nPentadbiran Trump sebelum ini telah mengenakan tarif asas sebanyak 10 peratus ke atas semua import, dan tarif \"timbal balik\" sehingga 50 peratus terhadap lebih 60 negara.\n\nPenangguhan sementara terhadap tarif terbabit dijadualkan tamat pada 9 Julai, dan surat itu dijangka menjadi penanda kepada fasa baharu dasar perdagangan AS.\n\nPenganalisis perdagangan memberi amaran bahawa pendekatan unilateral ini boleh meningkatkan ketidaktentuan pasaran dan menjejaskan hubungan ekonomi antarabangsa, terutamanya jika surat tersebut dihantar tanpa rundingan lanjut. - AGENSI","summary":"WASHINGTON: Presiden Amerika Syarikat (AS), Donald Trump, mengesahkan bahawa pentadbirannya akan mula menghantar surat kepada negara-negara asing bermula Jumaat depan, bagi memaklumkan kadar tarif yang akan dikenakan terhadap barangan import ke AS.","url":"https://www.bharian.com.my/dunia/amerika/2025/07/1415574/trump-umum-akan-hantar-surat-nyatakan-kadar-tarif-import-bermula","image":"https://assets.bharian.com.my/images/articles/BH4trumpet-o_BHfield_image_listing_featured.var_1751590246.jpg","video":null,"publish_date":"2025-07-04 00:50:52","author":null,"language":"en","category":"politics","source_country":"my","sentiment":0.338},{"id":338038294,"title":"Congressman gropes colleague on House floor during tense vote on Trump's Big Beautiful Bill","text":"A member of Congress was seen on camera firmly grabbing the backside of a colleague during the tense, late night debate and votes on Donald Trump's 'Big, Beautiful Bill.'\n\nThe House of Representatives went into the wee hours of the morning with constant debate, votes over amendments and hours-long filibustering by Democrat leader Hakeem Jeffries. \n\nAt one point, during those late hours and with time expired on an amendment vote that had failed, the camera feed over the House caught two members of Congress speaking to one another.\n\nAs they engage in discussion, a third member is seen walking onto the floor and taking a big grab out of the posterior of the mystery congressman, who is only seen from the back. \n\nThe grabby representative turns and then gives a chuckle and a wave to the member, who was clearly jolted by the move. \n\nNo member of Congress has addressed the clip since it made it to social media, on either the giving or receiving side of the grab. \n\nIn the subreddit that unearthed the video, various commenters had humorous takes on what happened. \n\n'So they are playing grab-a** AND taking away all our healthcare and rights. Got it,' wrote one against the bill.\n\nOne comment joked that it resembled how athletes congratulate one another after a sporting event, writing: 'Good game.'\n\n'Ugh. Immature. The standard is so low for American politicians,' bemoaned another.\n\nOne Redditor was more philosophical: 'Of the things to be mad about, this probably isn’t it. My guess is that they are probably friends and he’s messing with him. How about paying attention to what they are voting on instead.' \n\nCongress passed President Donald Trump's 'Big, Beautiful Bill,' a landmark piece of tax cuts and spending legislation containing many of the Republican's campaign promises. \n\nThe president is set to sign the bill into law to celebrate the Fourth of July on Friday. \n\nDubbed the One Big Beautiful Bill Act, the $3.3 trillion measure took an all-encompassing, multi-year effort from Republicans in Congress to pass. \n\n'I think I have more power now,' Trump said following the bill's passage. 'More gravitas, more power.'\n\n'Biggest tax cut in history, great for security, great on the southern border...It's the biggest bill ever signed of its kind,' Trump continued. \n\nHe also made a point to heap praise on Speaker Mike Johnson and Senate Majority Leader John Thune for shepherding the measure through Congress despite nagging GOP pushback from conservatives and moderates. \n\nAfter passing the House after hours of high-pressure negotiations with hold-out members, it will now head to the White House for Trump's signature. \n\nThe president will hold a signing ceremony for his bill on Independence Day between military flyovers, including the B-2 bombers recently deployed to Iran, Press Secretary Karoline Leavitt told reporters Thursday. \n\nThe behemoth, nearly 900-page legislative package extends the president's 2017 tax cuts and further eliminates taxes on tips and overtime - a marquee promise that the president pledged repeatedly on the campaign trail. \n\nIt doubles the child tax credit and includes a popular $1,000 'Trump investment account' - formerly known as MAGA accounts - for newborn babies.\n\nAlso included in the measure are steep cuts to Medicaid, the Supplemental Nutrition Assistance Program (SNAP) and renewable energy programs expanded by former President Joe Biden. \n\nThe tax cuts alone will cost $4.5 trillion over the next ten years, according to projections from the Congressional Budget Office. To offset the massive price tag Republicans included $1.2 trillion in spending cuts, mainly trimming Medicaid, the health care program for the poor and disabled.\n\nHowever, the measure stirred much controversy within GOP ranks and even drew the ire of billionaire Elon Musk for its massive spending, which he likened to 'political suicide.' \n\nThough that did not sway Trump and the White House from celebrating the measure.\n\n'President Trump’s One Big, Beautiful Bill delivers on the commonsense agenda that nearly 80 million Americans voted for – the largest middle-class tax cut in history, permanent border security, massive military funding, and restoring fiscal sanity,' Leavitt said in a statement following the successful vote.\n\n'The pro-growth policies within this historic legislation are going to fuel an economic boom like we’ve never seen before. President Trump looks forward to signing the One Big, Beautiful Bill into law to officially usher in the Golden Age of America.'\n\nTrump wrote on Truth Social before the vote: 'The USA is on track to break every record on growth. Go Republicans, beat the Crooked Democrats tonight! Pro-growth tax cuts never fail.'\n\n'We had great conversations all day, and the Republican House Majority is united, for the good of our country, delivering the biggest tax cuts in history and massive growth.","summary":"At one point, during the late hours and with time expired on an amendment vote that had failed, the camera feed over the House catches two members of Congress speaking to one another.","url":"https://www.dailymail.co.uk/news/article-14873791/congressman-gropes-colleague-vote-donald-trump-big-beautiful-bill.html","image":"https://i.dailymail.co.uk/1s/2025/07/04/00/99989315-0-image-m-9_1751585956692.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/07/03/108825787544390781/1024x576_MP4_108825787544390781.mp4","publish_date":"2025-07-04 00:50:47","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.334},{"id":338038296,"title":"Trump deploys Marines to Florida as AOC goes into meltdown over new deportation powers: 'This is exploding'","text":"President Donald Trump is sending 200 Marines to Florida to help ICE officials on the ground as leading Democrat Alexandria Ocasio-Cortez warns voters 'it is an explosion.'\n\nTrump's mobilization of the Marines came after a request from the Department of Homeland Security in May for military assistance.\n\nLast month, he deployed 700 Marines to Los Angeles to contend with unruly anti-immigration protestors, sparking a furious response from California Governor Gavin Newsom.\n\n'These Marines are the first wave of U.S. Northern Command's support of this ICE mission,' the Northern Command said in a statement.\n\nOther deployments are expected to be made to Louisiana and Texas, officials said.\n\nThe service members who are called to duty in Florida will 'perform strictly non law enforcement duties within ICE facilities.'\n\nThis will include administrative and logistical tasks, freeing up ICE agents to dedicate their working hours to conducting arrests and tracking down illegal criminals.\n\n'They are specifically prohibited from direct contact with individuals in ICE custody or involvement in any aspect of the custody chain,' the statement added.\n\nAssistant Secretary of Homeland Security Tricia McLaughlin told CBS that the Marines 'will be trained and ready to assist with immigration processing at locations across the state of Florida.'\n\nShe said this would be 'consistent with the whole-of-government approach to deliver on President Trump's mandate from the American people to remove public safety threats from American communities.' \n\nIt comes after Trump's Big, Beautiful Bill finally passed through Congress, paving the way for him to sign it into law on Friday July 4 - Independence Day.\n\nThe landmark tax cuts and spending legislation contains many of the Republican's campaign promises, totaling $3.3 trillion.\n\nThe tax cuts alone will cost $4.5 trillion over the next ten years, according to projections from the Congressional Budget Office. To offset the massive price tag Republicans included $1.2 trillion in spending cuts, mainly trimming Medicaid, the health care program for the poor and disabled.\n\nBorder security efforts will also be getting a major cash infusion estimated to be around $150 billion for increased immigration enforcement. \n\nIt includes $46 billion for Customs and Border Patrol to build border wall and enhanced security measures and around $30 billion for Immigration and Customs Enforcement. \n\nThe passage of the bill sparked a furious response from leading Democrat Ocasio-Cortez, who warned: 'I don't think anyone is prepared for what they just did w/ ICE.'\n\n'This is not a simple budget increase. It is an explosion - making ICE bigger than the FBI, US Bureau of Prisons, DEA and others combined,' she wrote on Bluesky.\n\n'It is setting up to make what's happening now look like child's play.'\n\nIn a chilling warning to the public, Ocasio-Cortez warned: 'People are disappearing.'\n\nThe measure also stirred controversy within GOP ranks and even drew the ire of billionaire Elon Musk for its massive spending, which he likened to 'political suicide.'\n\nTrump has committed to embarking on the largest mass deportation scheme in American history as part of his mission to secure US borders. \n\nLast month, Secretary of Defense Pete Hegseth greenlit up to 700 military personnel helping ICE agents across Florida, Louisiana and Texas.\n\nAt least 8,500 other service members have been deployed to the US-Mexico border for border enforcement and to help build the wall.\n\nAnd in Florida, Trump has proudly touted his 'Alligator Alcatraz' detention facility, which will be manned by just under 70 Florida National Guard troops.\n\nTrump on Tuesday toured the new immigration detention center surrounded by alligator-filled swamps in the Florida Everglades, suggesting it could be a model for future lockups nationwide as his administration races to expand the infrastructure necessary for increasing deportations.\n\nTrump said he'd like to see similar facilities in 'really, many states' and raised the prospect of also deporting US citizens.\n\n'Pretty soon, this facility will handle the most menacing migrants, some of the most vicious people on the planet,' Trump said of Alligator Alcatraz.\n\nThe president said the moniker is 'very appropriate because I looked outside and that's not a place I want to go hiking anytime soon.'\n\n'The only way out, really, is deportation.","summary":"Last month, he deployed 700 Marines to Los Angeles to contend with unruly anti-immigration protestors, sparking a furious response from California Governor Gavin Newsom .","url":"https://www.dailymail.co.uk/news/article-14874019/trump-deploys-marines-florida-Los-angeles-riots.html","image":"https://i.dailymail.co.uk/1s/2025/07/04/01/99992913-0-image-a-22_1751588455853.jpg","video":null,"publish_date":"2025-07-04 00:47:21","author":"Brittany Chain,Editor","authors":["Brittany Chain","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.095},{"id":338037798,"title":"World News | PM Modi Welcomed with Bhojpuri Chautaal in Trinidad and Tobago, Meets Indian Community","text":"Port of Spain [Trinidad and Tobago], July 4 (ANI): Prime Minister Narendra Modi was welcomed with a traditional performance of Bhojpuri Chautaal upon his arrival in Trinidad and Tobago, where he also met members of the Indian community and praised their contributions to the country's development during his first official visit to the Caribbean nation.\nSharing a video of the cultural performance on his official X account, PM Modi wrote: \"Bhojpuri Chautaal echoes in Trinidad & Tobago!\"\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nhttps://x.com/narendramodi_in/status/1940888326426579271\nDuring his visit, PM Modi also met members of the Indian community in Trinidad and Tobago and praised their contributions to the country's development. He noted that the diaspora had not only achieved success in various fields but also remained deeply connected to Indian culture.\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\n\"Many people from India made their way to Trinidad & Tobago years ago. Over the years, they distinguished themselves in several fields and are enriching Trinidad & Tobago's development journey. At the same time, they have retained a connection with India and are also passionate about Indian culture. Grateful to the local Indian community for an unforgettable welcome in Port of Spain.\" PM wrote on X. https://x.com/narendramodi/status/1940893660939223312\nPM also shared about his meeting with Shankar Ramjattan, Nicholas Maraj and Vince Mahato, who won the Bharat Ko Janiye (Know India) Quiz in Trinidad & Tobago.\n\"Met youngsters Shankar Ramjattan, Nicholas Maraj and Vince Mahato, who are winners of the Bharat Ko Janiye (Know India) Quiz in Trinidad & Tobago. This Quiz has generated widespread participation across the world and deepened the connect of our diaspora with India,\" PM Modi said. https://x.com/narendramodi/status/1940894657518637069\nThis is PM Modi's first visit to the country as Prime Minister and the first bilateral visit by an Indian Prime Minister to the Caribbean nation since 1999. The visit comes at the invitation of Trinidad and Tobago's Prime Minister Kamla Persad-Bissessar.\nPM Modi was received by Prime Minister Kamla Persad-Bissessar along with 38 ministers and four Members of Parliament of the Caribbean nation. He was given a ceremonial Guard of Honour at Piarco International Airport. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi was greeted with the performance of Bhojpuri Chautaal upon his arrival in Trinidad and Tobago.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-welcomed-with-bhojpuri-chautaal-in-trinidad-and-tobago-meets-indian-community-6971785.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703225945.jpg","video":null,"publish_date":"2025-07-04 00:46:19","author":null,"language":"en","source_country":"in","sentiment":0.39},{"id":338041364,"title":"El Salvador President Bukele denies beating and torture of Kilmar Abrego Garcia in prison","text":"El Salvador President Nayib Bukele cast aside allegations that Kilmar Abrego Garcia was beaten and subject to psychological torture in a Salvadoran prison on Thursday.\n\nIn a post on the social media platform X, Bukele wrote that Abrego Garcia “wasn’t tortured, nor did he lose weight.” In the post, Bukele included pictures and video of Abrego Garcia in a detention cell.\n\n“If he’d been tortured, sleep-deprived, and starved, why does he look so well in every picture?” Bukele wrote.\n\nIt comes after Abrego Garcia said he suffered severe beatings, severe sleep deprivation and psychological torture in the notorious El Salvador prison the Trump administration had mistakenly deported him to in March, according to court documents filed on Wednesday.\n\nHe said he was kicked and hit so often after arrival that by the following day, he had visible bruises and lumps all over his body. He said he and 20 others were forced to kneel all night long and guards hit anyone who fell.\n\nIn the new court documents, Abrego Garcia said detainees at CECOT “were confined to metal bunks with no mattresses in an overcrowded cell with no windows, bright lights that remained on 24 hours a day, and minimal access to sanitation.”\n\nAbrego Garcia’s description falls in line with accounts from other Salvadorans who were detained under Bukele's state of emergency, where the government has detained more than 1% of the Central American nation’s population in its war on the country's gangs.\n\nHundreds of people people have died in the prisons, according to human rights groups, which have also documented cases of torture and deteriorated conditions.\n\nAbrego Garcia was living in Maryland when he was mistakenly deported and became a flashpoint in U.S. President Donald Trump’s immigration crackdown. The new details of Abrego Garcia’s incarceration in El Salvador were added to a lawsuit against the Trump administration that Abrego Garcia’s wife filed in Maryland federal court after he was deported.\n\nThe Trump administration has asked a federal judge in Maryland to dismiss the lawsuit, arguing that it is now moot because the government returned him to the United States as ordered by the court.","summary":"El Salvador President Nayib Bukele has cast aside allegations that Kilmar Abrego Garcia was beaten and subject to psychological torture in a Salvadoran prison","url":"https://www.independent.co.uk/news/nayib-bukele-mexico-city-el-salvador-donald-trump-maryland-b2782383.html","image":"https://static.independent.co.uk/2025/07/04/01/El_Salvador_Bukele_Abrego_Garcia_24200.jpg?width=1200","video":null,"publish_date":"2025-07-04 00:40:27","author":"Via AP news wire","authors":["Via AP news wire"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.365},{"id":338037808,"title":"World News | PM Modi Receives Ceremonial Welcome in Trinidad and Tobago, Interacts with Indian Diaspora","text":"Port of Spain [Trinidad and Tobago], July 4 (ANI): Prime Minister Narendra Modi was given a ceremonial welcome upon his arrival in Port of Spain, as he began his first official visit to Trinidad and Tobago.\nThe people of Trinidad and Tobago greeted PM Modi with enthusiasm, dancing to the beat of drums and showcasing traditional music and performances that reflected a blend of local and Indian culture.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nModi also interacted with members of the Indian diaspora who had gathered at Piarco International Airport to welcome him. Many had been eagerly waiting to catch a glimpse of the Indian Prime Minister.\nThis is Modi's first visit to Trinidad and Tobago as Prime Minister. He was received at the airport by Prime Minister Kamla Persad-Bissessar, along with 38 ministers and four Members of Parliament. The visit is taking place at the invitation of Prime Minister Persad-Bissessar.\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nDuring his two-day stay from July 3 to 4, PM Modi is scheduled to hold talks with President Christine Carla Kangaloo and Prime Minister Persad-Bissessar to strengthen bilateral relations between the two countries.\nThe High Commission in Port of Spain welcomed him with a post on X: \"Welcome to Trinidad & Tobago, Prime Minister Shri Narendra Modi Ji!!\"\nEarlier, Former Permanent Secretary at Trinidad and Tobago's Ministry of Agriculture, Dev Duggal expressed enthusiasm on PM Modi's visit, saying he's \"proud\" that the Indian PM is visiting Trinidad and Tobago.\n\"We are very proud that PM Modi is visiting Trinidad and Tobago. This visit has been anticipated for a long time... I was in the Ministry of Agriculture in the Government of Trinidad and Tobago, and then I served as the advisor to the minister... PM Modi's previous visit was 22 years ago when he came to attend the World Hindu Conference, not as the PM of India. This visit carries a different stature,\" Dev Duggal told ANI.\nDuggal also expressed happiness over the Trinidad and Tobago government's decision to honour PM Modi withthe Order of the Republic of Trinidad and Tobago (ORTT), their highest honour. \"I am very happy that Trinidad and Tobago has decided to award PM Modi with the highest award. It is done after a lot of consideration... This award will bring both countries together. Both countries respect each other. 50% of the population of Trinidad and Tobago is of Indian origin... This visit is beneficial for both countries,\" he said. PM Modi's visit to Trinidad and Tobago is part of a broader five-nation tour taking place from July 2 to July 9. His stop in Trinidad and Tobago is expected to boost bilateral relations, with a focus on areas such as digital finance, renewable energy, health, and IT. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi was given ceremonial welcome upon his arrival at Port of Spain in Trinidad and Tobago.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-receives-ceremonial-welcome-in-trinidad-and-tobago-interacts-with-indian-diaspora-6971781.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703214219.jpg","video":null,"publish_date":"2025-07-04 00:40:19","author":null,"language":"en","source_country":"in","sentiment":0.491},{"id":338037672,"title":"Trump Meets with Recently Released American Hostage, Edan Alexander","text":"WASHINGTON () President Donald Trump welcomed Edan Alexander, an American held hostage by Hamas militants for 584 days in Gaza, to the Oval Office on Thursday afternoon. Trump who played an instrumental role in securing Alexander’s release has vowed to keep significant pressure on Hamas to release all the hostages. \n\nThe White House, in a post on X, said Trump kept his promise to bring Alexander home. \n\n“We’re very proud to have helped you,” Trump told Alexander during the 30-minute meeting, adding that, at one point, the U.S. feared he might have been killed. \n\nAlexander, a 21-year-old dual U.S.-Israeli citizen, grew up in Tenafly, New Jersey, and was serving in the Israel Defense Forces near Gaza at the time of his capture Oct. 7. He was released by Hamas in May in a gesture of goodwill to the Trump administration.   \n\n“I came to thank the person who is responsible for saving my life,” Alexander said in a statement following his meeting with Trump. “I was deeply moved to be in the White House the same place where my parents had been many times during their fight for my release, but this time together with them.” \n\nAlexander added: “I told the most powerful man in the world what I went through, what my friends there are going through, and asked him to continue doing everything in his power. … I hope he can achieve another historic breakthrough a comprehensive deal to free them all, all 50 hostages.” \n\nFirst lady Melania Trump, Secretary of Defense Pete Hegseth, Secretary of State Marco Rubio and Special Envoy to the Middle East Steve Witkoff were among those who greeted Alexander alongside the president in the Oval Office. \n\nNow, as the dust settles on a U.S.-brokered armistice between Israel and Iran, Trump is making a fresh push for peace in Gaza. Trump said on Truth Social Tuesday that Israel “has agreed to the necessary conditions to finalize” a 60-day ceasefire in Gaza. The president, without providing details, said he hopes Hamas will also accept the deal for the “good of the Middle East.” \n\nThe militant group has so far given no definitive response to the purported deal. \n\nIt’s been 635 days since Hamas launched its Oct. 7 surprise attack, which left about 1,200 people dead. A further 250, mostly civilians, were taken hostage by the militant group. Since then, Israel’s 21 months of fierce retaliation have killed at least 57,000 people in the enclave, according to the Gazan Health Ministry, which does not distinguish between civilian and combatant deaths. \n\nThe entire population of Gaza is on the brink of famine, the United Nations warned in May. \n\nTrump is expected to meet with Prime Minister Benjamin Netanyahu at the White House on Monday, in what will be the Israeli leader’s third visit to Washington in less than six months.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWASHINGTON () President Donald Trump welcomed Edan Alexander, an American held hostage&#8230;\n\n\nThis Post: Trump Meets with Recently Released American Hostage, Edan Alexander first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/trump-meets-with-recently-released-american-hostage-edan-alexander/","image":"https://internewscast.com/wp-content/uploads/2025/07/rewrite-this-title-Trump-meets-Edan-Alexander-freed-American-hostage.png","video":null,"publish_date":"2025-07-04 00:39:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.075},{"id":338041366,"title":"Trump’s bill could relocate a Smithsonian space shuttle","text":"A provision in President Donald Trump’s tax bill, passed by House Republicans, allocates $85 million to transport the Discovery space shuttle from the Smithsonian’s Air and Space Museum to Space Center Houston. \n\nThe Smithsonian criticized the plan, estimating the true cost could exceed $300 million and warning of significant damage risk due to the complexity of the transfer. \n\nFormer astronaut Garrett Reisman also opposed the move, deeming it “ludicrous and unnecessary” and suggesting the funds should instead be invested in NASA's science program. \n\nThe provision was backed by Texas Senators Ted Cruz and John Cornyn, with Cornyn's spokesperson disputing the Smithsonian's cost estimate and suggesting a much lower figure of $5-8 million. \n\nCruz stated the move would honor Houston's historical significance in America's human spaceflight program.","summary":"","url":"https://www.independent.co.uk/bulletin/news/space-shuttle-trump-bill-smithsonian-houston-b2782382.html","image":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/01/16/19/pg-36-bigger-bin-3-rex.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/TTiz9PwT-LkahLqdO.mp4","publish_date":"2025-07-04 00:34:46","author":"Rachel Dobkin","authors":["Rachel Dobkin"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.66},{"id":338037820,"title":"World News | PM Modi Receives Ceremonial Welcome in Trinidad and Tobago, Interacts with Diaspora","text":"Port of Spain [Trinidad and Tobago], July 4 (ANI): Prime Minister Narendra Modi was given a ceremonial welcome upon his arrival in Port of Spain, as he began his first official visit to Trinidad and Tobago.\nThe people of Trinidad and Tobago greeted PM Modi with enthusiasm, dancing to the beat of drums and showcasing traditional music and performances that reflected a blend of local and Indian culture.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nModi also interacted with members of the Indian diaspora who had gathered at Piarco International Airport to welcome him. Many had been eagerly waiting to catch a glimpse of the Indian Prime Minister.\nThis is Modi's first visit to Trinidad and Tobago as Prime Minister. He was received at the airport by Prime Minister Kamla Persad-Bissessar, along with 38 ministers and four Members of Parliament. The visit is taking place at the invitation of Prime Minister Persad-Bissessar.\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nDuring his two-day stay from July 3 to 4, PM Modi is scheduled to hold talks with President Christine Carla Kangaloo and Prime Minister Persad-Bissessar to strengthen bilateral relations between the two countries.\nThe High Commission in Port of Spain welcomed him with a post on X: \"Welcome to Trinidad & Tobago, Prime Minister Shri Narendra Modi Ji!!\"\nEarlier, Former Permanent Secretary at Trinidad and Tobago's Ministry of Agriculture, Dev Duggal expressed enthusiasm on PM Modi's visit, saying he's \"proud\" that the Indian PM is visiting Trinidad and Tobago.\n\"We are very proud that PM Modi is visiting Trinidad and Tobago. This visit has been anticipated for a long time... I was in the Ministry of Agriculture in the Government of Trinidad and Tobago, and then I served as the advisor to the minister... PM Modi's previous visit was 22 years ago when he came to attend the World Hindu Conference, not as the PM of India. This visit carries a different stature,\" Dev Duggal told ANI.\nDuggal also expressed happiness over the Trinidad and Tobago government's decision to honour PM Modi withthe Order of the Republic of Trinidad and Tobago (ORTT), their highest honour. \"I am very happy that Trinidad and Tobago has decided to award PM Modi with the highest award. It is done after a lot of consideration... This award will bring both countries together. Both countries respect each other. 50% of the population of Trinidad and Tobago is of Indian origin... This visit is beneficial for both countries,\" he said. PM Modi's visit to Trinidad and Tobago is part of a broader five-nation tour taking place from July 2 to July 9. His stop in Trinidad and Tobago is expected to boost bilateral relations, with a focus on areas such as digital finance, renewable energy, health, and IT. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi was given ceremonial welcome upon his arrival at Port of Spain in Trinidad and Tobago.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-receives-ceremonial-welcome-in-trinidad-and-tobago-interacts-with-diaspora-6971775.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703214219.jpg","video":null,"publish_date":"2025-07-04 00:34:19","author":null,"language":"en","source_country":"in","sentiment":0.491},{"id":338038602,"title":"Mexican boxer Julio César Chávez Jr. arrested by ICE for deportation, federal officials say (World)","text":"Famed Mexican boxer Julio César Chávez Jr. has been arrested for overstaying his visa and lying on a green card application and will be deported to Mexico, where he faces organized crime charges, U.S. federal officials said Thursday.\n\nThe arrest came only days after the former middleweight champion lost a match against influencer-turned-boxer Jake Paul in Anaheim, California. The Department of Homeland Security said officials determined Chávez should be arrested on June 27, a day before the fight. It was unclear why they waited to act for days after the high-profile event.\n\nThe boxer was riding a scooter when agents detained him\n\nThe 39-year-old boxer, according to his attorney Michael Goldstein, was picked up Wednesday by a large number of federal agents while he was riding a scooter in front of a home where he resides in the upscale Los Angeles neighborhood of Studio City near Hollywood.\n\n“The current allegations are outrageous and simply another headline to terrorize the community,” Goldstein said.\n\nMany people across Southern California are on edge as immigration arrests have ramped up, prompting protests and the federal deployment of National Guard troops and U.S. Marines to downtown Los Angeles.\n\nGoldstein did not know where Chávez was being detained as of Thursday morning, but said he and his client were due in court Monday in connection with prior gun possession charges.\n\nBefore his recent bout, Chavez fought once since 2021\n\nBefore his bout with Paul on Saturday, Chávez had fought just once since 2021, having fallen to innumerable lows during a lengthy boxing career conducted in the shadow of his father, Julio César Chávez, one of the most beloved athletes in Mexican history and a member of the International Boxing Hall of Fame who won championships in several weight classes.\n\nThe son, who has battled drug addiction for much of his career, has been arrested repeatedly. In 2012, he was convicted of drunk driving in Los Angeles and sentenced to 13 days in jail and in January 2024 he was arrested on gun charges. Police said he possessed two AR-style ghost rifles. He was later freed on a $50,000 bond and on condition he went to a residential drug treatment facility. The case is still pending, with Chávez reporting his progress regularly.\n\nHe split his time between both countries. Immigration and Customs Enforcement officers detained Chávez for overstaying a tourist visa that he entered the U.S. with in August 2023 and expired in February 2024, the Department of Homeland Security said.\n\nThe agency also said Chávez submitted multiple fraudulent statements when he applied for permanent residency on April 2, 2024, based on his marriage to a U.S. citizen, Frida Muñoz. She is the mother of a granddaughter of imprisoned Sinaloa cartel kingpin Joaquin “El Chapo” Guzman.\n\nU.S. officials said he is believed to be an affiliate of the powerful Sinaloa Cartel that is blamed for a significant portion of Mexico’s drug violence.\n\nFederal officials called Chavez a public safety threat\n\nU.S. Citizenship and Immigration Services flagged Immigration and Customs Enforcement about Chávez on Dec. 17, saying he “is an egregious public safety threat,” and yet he was allowed back into the country without a visa on Jan. 4 under the Biden administration, the agency said.\n\nMexico’s Attorney General’s Office said that an arrest warrant against “Julio “C was issued in Mexico in March 2023 in an investigation of organized crime and arms trafficking allegations and that Mexico on Thursday initiated extradition proceedings.\n\nA federal agent who spoke on condition of anonymity because he was not authorized to speak publicly on the matter confirmed to The Associated Press that “Julio C” is Chávez. The agent declined to explain why Chávez was not arrested earlier in Mexico despite going back and forth between the two countries multiple times.\n\nIn Mexico, mixed feelings followed the arrest\n\nIn Mexico, word of U.S. agents arresting a well-known athlete prompted mixed feelings.\n\nMartín Sandoval Peñaloza, a newspaper seller in Mexico City, said he believes President Donald Trump wanted to make him an example.\n\n“I think that the U.S. government - in this case, Trump – is up to something,” he said, adding that it was “to attract media attention.”\n\nOscar Tienda, a Mexico City storekeeper, said he wasn’t surprised given the boxer’s troubles.\n\n“I think it was predictable because he has had a lifetime of drug use,” he said.\n\nDespite widely being criticized for his intermittent dedication to the sport, Chávez still rose to its heights. He won the WBC middleweight title in 2011 and defended it three times. Chávez shared the ring with generational greats Canelo Álvarez and Sergio Martinez, losing to both.\n\nChávez claimed to be clean for the Paul fight. He looked in his best shape in years while preparing for the match.\n\nChávez said in an interview with the Los Angeles Times ahead of his fight with Paul that he and his trainers were shaken by the immigration arrests.\n\n“There are a lot of good people, and you’re giving the community an example of violence,” Chávez said. “After everything that’s happened, I wouldn’t want to be deported.”","summary":"Famed Mexican boxer Julio C&eacute;sar Ch&aacute;vez Jr. has been arrested for overstaying his visa and lying on a green card application and will be deported to Mexico, where he faces organized crime charges, U.S. federal officials said Thursday.\n\nThe arrest came only days after the former middle...","url":"https://www.castanet.net/news/World/559784/Mexican-boxer-Julio-C-sar-Ch-vez-Jr-arrested-by-ICE-for-deportation-federal-officials-say","image":"https://www.castanet.net/content/2025/7/download._p4217657.jpg","video":null,"publish_date":"2025-07-04 00:34:00","author":"Jaimie Ding","authors":["Jaimie Ding"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.254},{"id":338037826,"title":"World News | PM Modi Receives Guard of Honour in Trinidad and Tobago, Welcomed by Caribbean Nation's PM, 38 Ministers and 4 MPs","text":"Port of Spain [Trinidad and Tobago], July 4 (ANI): Prime Minister Narendra Modi began his first official visit to Trinidad and Tobago on Thursday (local time) with a ceremonial Guard of Honour at Piarco International Airport, where he was received by Prime Minister Kamla Persad-Bissessar along with 38 ministers and four Members of Parliament of the caribean nation.\nThis is PM Modi's first visit to the country as Prime Minister and the first bilateral visit by an Indian Prime Minister to the Caribbean nation since 1999. The visit comes at the invitation of Trinidad and Tobago's Prime Minister Kamla Persad-Bissessar.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nDuring his two-day stay from July 3 to 4, Modi will hold meetings with President Christine Carla Kangaloo and Prime Minister Kamla Persad-Bissessar to strengthen ties between the two countries.\nThe High Commission in Port of Spain welcomed him with a post on X: \"Welcome to Trinidad & Tobago Prime Minister Shri Narendra Modi Ji!!\"\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nEarlier, ahead of the PM's visit, India's High Commissioner to Trinidad and Tobago, Pradeep Singh Rajpurohit, said there was a strong desire among both the people and the government of Trinidad and Tobago for deeper cooperation with India.\n\"There is a lot of enthusiasm and excitement among the people... Everyone is looking forward to this visit... There is already an intense desire in Trinidad and Tobago for greater engagement and collaboration in a range of areas, and in this context, people and the government both are highly desirous of getting into a longstanding partnership, a broad-based partnership between India and Trinidad and Tobago...\" Rajpurohit told ANI.\nHe highlighted the deep cultural and emotional ties between the two nations, stating that about half of Trinidad and Tobago's population is of Indian origin.\n\"There is a sizable population, about half of the population of this country of Indian origin... They have been here for the last 180 years. Many of them are in their 5th and 6th generation,\" he said.\nSpeaking about the Indian diaspora in the country, he added, \"There is great excitement among the diaspora. They very regularly follow developments taking place in India,\" noting their efforts to preserve Indian heritage over generations.\nThe High Commissioner also said that discussions during PM Modi's visit would build on the foundation laid during his visit to Guyana last year for the Second India-CARICOM Summit.\n\"Prime Minister Modi had visited Guyana last year for the Second India-CARICOM Summit, and a number of areas were discussed, and our Prime Minister made several announcements. Many of those areas, including agriculture, information technology, health and pharmaceuticals, renewable energy... These are the areas likely to be discussed between the two sides, and we expect some tangible outcomes out of the Prime Minister's visit...\" he said.\nRajpurohit also emphasised the importance of the visit in the context of Trinidad and Tobago's newly formed government, noting that several cabinet ministers are of Indian origin.\n\"The Government of Trinidad and Tobago is a new government; several ministers in the cabinet are of Indian origin. There is great enthusiasm among them that they bring in all the benefits of India's growth journey,\" he said.\n\"They are the first country in the Caribbean region in the CARICOM region to adopt India's flagship UPI platform, and they are in the process of its implementation,\" he added.\nPM Modi's visit to Trinidad and Tobago is part of a broader five-nation tour taking place from July 2 to July 9. His stop in Trinidad and Tobago is expected to boost bilateral relations, with a focus on areas such as digital finance, renewable energy, health, and IT. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Prime Minister Narendra Modi began his first official visit to Trinidad and Tobago on Thursday (local time) with a ceremonial Guard of Honour at Piarco International Airport, where he was received by Prime Minister Kamla Persad-Bissessar along with 38 ministers and four Members of Parliament of the caribean nation.","url":"https://www.latestly.com/agency-news/world-news-pm-modi-receives-guard-of-honour-in-trinidad-and-tobago-welcomed-by-caribbean-nations-pm-38-ministers-and-4-mps-6971771.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703205755.jpg","video":null,"publish_date":"2025-07-04 00:30:21","author":null,"language":"en","source_country":"in","sentiment":0.571},{"id":338034240,"title":"U.S. Republicans muscle Trump's tax-cut and spending bill through Congress","text":"WASHINGTON - U.S. President Donald Trump's tax-cut package cleared its final hurdle in Congress on Thursday, as the Republican-controlled House of Representatives narrowly approved the massive bill and sent it to him to sign into law.The 218-214 vote amounts to a significant victory for the Republican president that will fund his immigration crackdown, make his 2017 tax cuts permanent and deliver new tax breaks that he promised during his 2024 campaign.It also cuts health and food safety net programs and zeroes out dozens of green energy incentives. It would add $3.4 trillion to the nation's $36.2 trillion debt, according to the nonpartisan Congressional Budget Office.","summary":"The 218-214 vote is a significant victory for U.S. President Donald Trump that will fund his immigration crackdown, make his 2017 tax cuts permanent and deliver new tax breaks.","url":"https://www.japantimes.co.jp/news/2025/07/04/world/politics/trump-big-beautiful-bill-pass/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/07/04/479144.JPG?v=3.1","video":null,"publish_date":"2025-07-04 00:29:00","author":"Andy Sullivan,Bo Erickson,David Morgan,Richard Cowan,Web Master","authors":["Andy Sullivan","Bo Erickson","David Morgan","Richard Cowan","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.293},{"id":338034654,"title":"LIVE | Trump kicks off fiery ‘Salute to America’ event in Iowa ahead of 250th I-Day Anniversary","text":"U.S. President Donald Trump delivers a ‘Salute to America’ speech at the Iowa State Fairgrounds, for a kickoff event for yearlong festivities leading up to the 250th anniversary of the signing of the Declaration of Independence.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-trump-kicks-off-fiery-salute-to-america-event-in-iowa-ahead-of-250th-i-day-anniversary/videoshow/122237954.cms","image":"https://img.etimg.com/thumb/msid-122237954,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-122237954,imgsize-52222.cms","publish_date":"2025-07-04 00:25:37","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.016},{"id":338033172,"title":"Vietnam wary of Trump's 40% tariff on transshipping","text":"HANOI -- The U.S.-Vietnam tariff deal that was reached on Wednesday received a mixed reaction from companies in Vietnam, given the lack of details announced.\n\nAlthough the 20% tariff on all goods exported to the U.S. -- which was announced through a social media post by President Donald Trump -- is lower than the previously proposed 46%, it still poses an obstacle to many Vietnamese companies' exports.","url":"https://asia.nikkei.com/Economy/Trade-war/Trump-tariffs/Vietnam-wary-of-Trump-s-40-tariff-on-transshipping","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F6%2F1%2F7%2F7%2F49767716-5-eng-GB%2FCropped-1751526467IMG_3341.JPG?width=1200&fit=cover&gravi","video":null,"publish_date":"2025-07-04 00:24:52","author":"Mai Nguyen","authors":["Mai Nguyen"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.102},{"id":338039612,"title":"Red Sox Players Make A Stop At The White House, Visit With President Trump","text":"On Thursday, the Boston Red Sox took a lively detour during their Washington trip, swinging by the White House for a cheerful visit with President Donald Trump. Red Sox players, including Justin Wilson, Romy Gonzalez, Greg Weissert, Garrett Whitlock, Brennan Bernardino, Rob Refsnyder, and more, appeared on video, in the Oval Office, meeting with President Trump during the team’s trip to Washington to face the Nationals. White House Communications Advisor Margo Martin shared a video of Trump greeting the delighted Red Sox players. The Red Sox team previously visited in 2019 after winning the 2018 World Series. RELATED: The Boston Red Sox Have Been A Dumpster Fire Since Trading Rafael Devers For A Ham Sandwich Following a triumphant week for Trump, which included facilitating peace deals and passing his Big Beautiful Bill, he might offer the Red Sox some advice on getting the job done. \"When was the last time the World Series champs visited the White House BEFORE they won?\" one ardent fan remarked. The Red Sox’s White House visit raised some questions, such as why a sub-.500 team would make a champion-style trip to meet the Commander-in-Chief. This trip will be a lasting memory for these players, even if they never visit the White House as champions. Send us your thoughts: alejandro.avila@outkick.com / Follow along on X: @alejandroaveela","summary":"On Thursday, the Boston Red Sox took a lively detour during their Washington trip, swinging by the White House for a cheerful visit with President Donald Trump.","url":"https://www.outkick.com/sports/media-upset-over-boston-red-sox-players-visit-white-house-meeting-president-trump","image":"https://static.outkick.com/www.outkick.com/content/uploads/2025/07/gettyimages-2222691441-594x594-1.jpg","video":null,"publish_date":"2025-07-04 00:23:59","author":"Alejandro Avila","authors":["Alejandro Avila"],"language":"en","category":"politics","source_country":"us","sentiment":0.335},{"id":338038702,"title":"Watch Live: Donald Trump Holds Salute to America Celebration","text":"President Donald Trump holds a Salute to America celebration at the Iowa State Fair on Thursday, July 3.\n\nThe celebration comes after the House passed Trump’s signature Big Beautiful Bill earlier in the day and ahead of the nation’s July 4, Indepenence Day celebrations.\n\nDemocrat House Leader Hakeem Jeffries tried to delay the inevitable once Republicans had built enough support around passing the bill, to no effect.","summary":"President Donald Trump holds a Salute to America celebration at the Iowa State Fair on Thursday, July 3.\n\n\nThe post Watch Live: Donald Trump Holds Salute to America Celebration appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/07/03/watch-live-donald-trump-holds-salute-to-america-celebration/","image":"https://media.breitbart.com/media/2025/07/trump-salute-maga-flickr-640x335.png","video":null,"publish_date":"2025-07-04 00:23:45","author":"Breitbart News","authors":["Breitbart News"],"language":"en","category":"politics","source_country":"US","sentiment":0.002},{"id":338039926,"title":"Pentagon Spokesperson: U.S. Airstrikes Set Back Iran's Nuclear Program by Two Years","text":"TEMPO.CO, Jakarta - Iran's nuclear program has been set back for up to two years due to U.S. airstrikes, said Pentagon Spokesperson Sean Parnell on Wednesday, July 2. \"We have degraded their program by one to two years, at least intel assessments inside the department assess that,\" Parnell told reporters, as quoted from Euronews.The U.S. assessment of the damage to three key Iranian nuclear facilities remains \"unchanged,\" Parnell said. He added that those locations have been \"totally obliterated. \"We believe that Iran's nuclear capability has been severely degraded, perhaps even their ambition to build a bomb,\" said Parnell, citing Anadolu.He also mentioned that further assessments are ongoing.The U.S. dropped six bunker-buster bombs on the Fordow nuclear facility on June 22 and launched dozens of submarine-based cruise missiles at two other locations in Natanz and Isfahan as part of the campaign against Iran's nuclear program.The sixth round of talks between the U.S. and Iran was scheduled for June 15, but Israel launched an airstrike on Iran's military, nuclear, and civilian sites on June 13.The 12-day conflict between Israel and Iran ended with a U.S.-brokered ceasefire that came into effect on June 24.\"The Department of Defense will support the diplomatic mission to continue that peace by ensuring that we maintain capability across the Middle East,\" Parnell stated.President Donald Trump and Defense Secretary Pete Hegseth have various military options available to protect citizens, troops, and U.S. forces in the region, he said. \"We don't have any force posture updates at this time in the CENTCOM AOR (area of responsibility),\" he added.When asked if Washington plans to continue reducing its presence in Syria, Parnell answered that the U.S. still has around 1,500 troops in Syria.Editor’s Choice: U.S. Airstrike Causes Serious Damage to Iran's Nuclear Facility, Says MinisterClick here to get the latest news updates from Tempo on Google News","summary":"Pentagon Spokesperson, Sean Parnell, stated that Iran's nuclear program has been set back for one to two years due to U.S. airstrikes.","url":"https://en.tempo.co/read/2024392/pentagon-spokesperson-u-s-airstrikes-set-back-irans-nuclear-program-by-two-years","image":"https://statik.tempo.co/data/2025/06/26/id_1408484/1408484_720.jpg","video":null,"publish_date":"2025-07-04 00:23:12","author":"Antara","authors":["Antara"],"language":"en","category":"politics","source_country":"id","sentiment":-0.382},{"id":338035736,"title":"Red Sox’s visit to President Trump at White House has fans perplexed","text":"The president of the United States invites the World Series champions to the White House every year. However, President Donald Trump welcomed a team to the White House that did not make the playoffs and is looking to get back on track this season in the Boston Red Sox.\nBefore their series against the Washington Nationals, Garrett Whitlock, Romy Gonzalez, and other Boston players took advantage of the off day manager Alex Cora gave them.\nGonzalez, Whitlock, and other players were captured on video shaking hands with President Trump by Margo Martin, his Communications Advisor.\n\nPresident @realDonaldTrump welcomes the Boston Red Sox to the Oval Office 🇺🇸 pic.twitter.com/GbYGcXiwmU\n— Margo Martin (@MargoMartin47) July 3, 2025\n\nThe post confused fans wondering why President Trump invited Boston’s players into the White House. Before he began his political career, President Trump oversaw multiple businesses in New York City. His close relationship with the leaders of the New York Yankees organization and his affinity towards the team made Thursday’s meet and greet even more confounding.\nFans took to social media to react to the viral video, offering their thoughts.\n“I really love the Bo Sox , but why are they there? Are random sports teams just showing up now? 🤣” one fan asked.\n“why is a team that is 43-45 at the White House?” commented another.\n“we just letting anyone in the White House?” questioned one fan.\n“lots of similarities between potus and alex cora when you think about it,” said another.\n“The Red Sox and the government are both dysfunctional. Game recognizes game,” commented one fan, calling out both entities.\nWhile Whitlock, Gonzalez, and a few of their teammates took advantage of the opportunity to meet President Trump, Cora hopes his team is ready for Friday’s game. Boston enters their series against the Nationals with a lot on the line.\nThe Red Sox sit more than five games behind the leaders in the American League East. After Cora and the front office decided to trade Rafael Devers to the San Francisco Giants, the pressure has been on. A good showing against Washington would help them keep pace in one of the tightest divisions in Major League baseball.","summary":"The president of the United States invites the World Series champions to the White House every year. However, President Donald Trump welcomed a team to the White House that did not make the playoffs and is looking to get back on track this season in the Boston Red Sox. Before their series against the Washington [&#8230;]\n\n\nThe post Red Sox&#8217;s visit to President Trump at White House has fans perplexed appeared first on ClutchPoints.","url":"https://clutchpoints.com/mlb/boston-red-sox/red-sox-news-bostons-visit-president-trump-white-house-has-fans-perplexed","image":"https://wp.clutchpoints.com/wp-content/uploads/2025/07/Boston-Red-Sox-manager-Alex-Cora-1.jpg","video":null,"publish_date":"2025-07-04 00:22:39","author":"Zachary Howell","authors":["Zachary Howell"],"language":"en","category":"politics","source_country":"us","sentiment":0.218},{"id":338037804,"title":"World News | UAE: Dubai Silicon Oasis to Host Middle East Edition of Cyprus-born 'Doers Summit'","text":"Dubai [UAE], July 4 (ANI/WAM): Dubai Silicon Oasis, a specialised economic zone for knowledge and innovation, and a member of the Dubai Integrated Economic Zones Authority (DIEZ), signed an agreement with The Doers Company to host the first Middle East edition of its Doers Summit -- formerly Reflect Festival, one of Europe's leading startup and tech events.\nHeld annually in Athens, Limassol, the 'Doers Summit' attracts thousands of attendees and stands as one of the largest platforms in Europe, connecting innovative startups, venture capital funds, investors, and enterprises from Central and Eastern Europe, Africa, and the Middle East. The Dubai edition aims to connect over 3,000 participants including hundreds of startups with venture capital funds and ecosystem leaders from across the region, catalysing cross-boarder collaboration and access to capital.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nThe signing was witnessed by Dr. Mohammed Al Zarooni, Executive Chairman of DIEZ, and Demetris Skourides, Chief Scientist for Research, Innovation & Technology at the Government of the Republic of Cyprus. The agreement was signed by Badr Buhannad, Deputy Director General of Dubai Silicon Oasis, Stylianos Lambrou, co-founder of The Doers Company and Doers Summit, and Dusan Duffek, co-founder of The Doers Company & Managing Partner at Zero One Hundred venture capital fund at DIEZ headquarters.\nCommenting on this partnership, Badr Buhannad, said: \"Dubai Silicon Oasis was envisioned as a smart and future-ready urban hub designed to foster innovation, talent, and entrepreneurship. Hosting this renowned Summit in collaboration with The Doers Company at DSO reinforces our commitment to enabling knowledge-based industries and aligns with the objectives of Dubai's Economic Agenda D33 to position Dubai among the top global cities for economic and digital leadership.\"\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nHe added: \"The 'Doers Summit' supports our mandate to attract future-focused ventures and build a thriving entrepreneurial ecosystem. By connecting European and Middle Eastern innovators, we are accelerating cross-border collaboration and driving progress towards the UAE's national goals of economic diversification, digital economy growth, and global competitiveness.\"\nSince its inception in 2018, the 'Doers Summit' (formerly Reflect Festival) has facilitated hundreds of partnerships between founders, investors, and corporations from three continents. \"Limassol has always been a symbolic location bridging Europe, Africa, and the Middle East,\" said Stylianos Lambrou. \"In recent years, we've seen growing momentum from the Middle East -- more venture capital funds, more founders, and stronger support for innovation. Launching in Dubai was the natural next step.\"\nUnlike traditional expos, the 'Doers Summit' delivers an experience-led format designed to build meaningful, long-term business connections. The event intentionally brings together founders, investors, creatives, corporates, and policymakers in a dynamic and culturally rich environment. With a storytelling-driven agenda, curated matchmaking, and a highly selected audience, the Summit prioritizes venture building, knowledge exchange, and cross-border collaboration.\nThe 2025 edition in Cyprus drew a record-breaking 10,000 attendees and over 250 speakers across five stages, highlighting its rapid growth and impact. \"We're excited to bring this momentum to Dubai,\" said Dusan Duffek. \"After eight years of building a vibrant ecosystem across Central, Eastern, and Southern Europe, we're launching the Dubai edition with strong foundations. Even in its first year, it will deliver the scale, quality, and connectivity needed to unite two of the world's most innovative regions.\"\nThe Dubai edition will also feature dedicated zones for informal networking, side events, and curated programming. Purpose-built lounges and community areas will foster interaction in smaller groups, encouraging collaboration in a relaxed and high-impact setting. (ANI/WAM) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Dubai Silicon Oasis, a specialised economic zone for knowledge and innovation, and a member of the Dubai Integrated Economic Zones Authority (DIEZ), signed an agreement with The Doers Company to host the first Middle East edition of its Doers Summit -- formerly Reflect Festival, one of Europe's leading startup and tech events.","url":"https://www.latestly.com/agency-news/world-news-uae-dubai-silicon-oasis-to-host-middle-east-edition-of-cyprus-born-doers-summit-6971764.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703204435.jpg","video":null,"publish_date":"2025-07-04 00:22:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.494},{"id":338037802,"title":"World News | US House Passes Trump's Ambitious 'Big Beautiful Bill,' Massive Legislative Win for President","text":"Washington DC [US], July 4 (ANI): US President Donald Trump scored a massive legislative win on Thursday (local time) as Congress passed his ambitious 'One Big Beautiful Bill' with a narrow margin. The bill was passed with a final vote of 218-214, with two Republicans, Representative Thomas Massie and Brian Fitzpatrick, voting against it, The Hill reported.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nThe landmark bill, which includes tax cuts and funding boosts for the Pentagon and border security, will now head to President Donald Trump's desk to be signed into law. Donald Trump is expected to sign the bill in a \"big, beautiful signing ceremony\" on Friday evening, CNN reported, quoting White House press secretary Karoline Leavitt. Also Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\n\"The one 'big, beautiful bill' has passed the House of Representatives and will be at the president's desk for signature at a big, beautiful signing ceremony tomorrow at 5 p.m. on the Fourth of July, just as the president always said and hoped it would be,\" Leavitt announced on a press call shortly after the bill's passage.\nFollowing the passing of the bill, Vice President JD Vance admitted that sometimes he \"doubted\" that the bill would pass by July 4. \"Congrats to everyone. At times, I even doubted we'd get it done by July 4! But now we've delivered big tax cuts and the resources necessary to secure the border. Promises made, promises kept!\" Vance said on X.\nThe bill was passed in the US Senate on Tuesday, with a 51-50 vote, with Vice-President JD Vance casting the tie-breaking vote. The Hill, in its report, added. The final 51-50 vote followed intense negotiations as lawmakers worked through the weekend before launching a 27-hour marathon of amendment votes on the floor, during which Republican leaders sought to win the support of holdouts, the report said.\nAs per The Hill, the massive Republican bill, which includes significant tax cuts, deep reductions to federal aid programmes, and major shifts in energy and immigration policy, was passed in the senate despite unified Democratic opposition and defections from three Republican senators: Thom Tillis, Rand Paul, and Susan Collins. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  US President Donald Trump scored a massive legislative win on Thursday (local time) as Congress passed his ambitious 'One Big Beautiful Bill' with a narrow margin.","url":"https://www.latestly.com/agency-news/world-news-us-house-passes-trumps-ambitious-big-beautiful-bill-massive-legislative-win-for-president-6971762.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703195235.jpg","video":null,"publish_date":"2025-07-04 00:20:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.102},{"id":338035520,"title":"Trump Likely To Inform Countries Of US Tariffs Today","text":"Access Denied\n\nYou don't have permission to access \"http://www.ndtv.com/world-news/donald-trump-likely-to-inform-countries-of-us-tariffs-today-8822104\" on this server.\nReference #18.1c6e1002.1751589847.56a0d01\nhttps://errors.edgesuite.net/18.1c6e1002.1751589847.56a0d01","summary":"President Donald Trump said he plans to start sending letters informing trading partners of their tariff rates as soon as Friday, as negotiations to avoid higher US levies enter the final stretch.","url":"https://www.ndtv.com/world-news/donald-trump-likely-to-inform-countries-of-us-tariffs-today-8822104","image":null,"video":null,"publish_date":"2025-07-04 00:19:05","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-1},{"id":338034580,"title":"Lee says trade deal with US remains unclear ahead of Trump’s deadline","text":"South Korean President Lee Jae Myung said that it remained unclear whether Seoul and Washington could conclude their tariff negotiations by the deadline set by President Donald Trump for next week, noting yesterday that both nations were still working to clarify their positions and identify areas of agreement.\n\nSpeaking at his first news conference since taking office last month, Lee also reiterated his intentions to improve badly frayed ties with North Korea, though he acknowledged that mutual distrust between the Koreas is too deep to heal anytime soon.\n\nTrump’s tariff hikes and other “America First” policies are major challenges for Lee’s month-old government, as are North Korea’s advancing nuclear program and domestic economic woes. Lee, a liberal, came to power after winning a snap presidential election caused by the ouster of conservative President Yoon Suk Yeol over his ill-fated imposition of martial law in December.\n\nTariff talks with US ‘clearly not easy’\n\nLee said the tariff negotiations with the U.S. have been “clearly not easy” and stressed that the countries must reach mutually beneficial outcomes.\n\n“It’s difficult to say with certainty whether we will be able to reach a conclusion by July 8. We are now doing our best,” Lee said. “What we need is a truly reciprocal outcome that benefits both sides and works for everyone, but so far, both sides are still trying to define exactly what they want.”\n\nTrump’s 90-day pause in global reciprocal tariffs is set to expire on July 9, potentially exposing South Korean products to 25% tax rates.\n\nWashington has separately been seeking higher duties on specific products such as automobiles and semiconductors, which are key exports for South Korea’s trade-dependent economy. There are growing concerns in Seoul that Trump may also demand a broader deal requiring South Korea to pay significantly more for the 28,000 U.S. troops stationed in the country to deter North Korean threats.\n\nLee has consistently urged patience on tariffs, arguing that rushing to secure an early deal would not serve the national interest. His trade minister, Yeo Han-koo, was reportedly arranging a visit to Washington for possible meetings with U.S. Trade Representative Jamieson Greer and Commerce Secretary Howard Lutnick.\n\nLee pushes to revive talks with North\n\nOn North Korea, Lee said he would seek to restore long-dormant talks with Pyongyang, whose expanding military cooperation with Russia pose major security concerns to their neighbors.\n\n“I think we should improve relations with North Korea based on a reliable coordination and consultation between South Korea and the U.S.,” Lee said. “But I expect that won’t be easy as mutual antagonism and distrust are too serious.”\n\nLee previously faced criticism that he was tilting toward North Korea and China and away from the U.S. and Japan. But during his campaign, Lee promised to pursue pragmatic diplomacy, saying he would bolster the alliance with the U.S. while also seeking to repair ties with North Korea, China and Russia. Some critics say it’s too difficult to satisfy all parties.\n\nLee added that he had proposed resuming more frequent summits with Japan.\n\nLee’s government has made proactive efforts to build trust with North Korea, halting frontline anti-Pyongyang propaganda broadcasts and taking steps to ban activists from flying balloons carrying propaganda leaflets across the border.\n\nTrump has also expressed intent to resume diplomacy with North Korean leader Kim Jong Un. Lee has said he would support Trump’s push.\n\nNorth Korea hasn’t publicly responded to the conciliatory gestures by Trump and Lee. But officials said North Korean propaganda broadcasts are no longer being heard in South Korean border towns. KIM TONG-HYUNG & HYUNG-JIN KIM, SEOUL, MDT/AP","summary":"South Korean President Lee Jae Myung said that it remained unclear whether Seoul and Washington could conclude their tariff negotiations by the deadline set by President Donald Trump for next week, noting yesterday that both nations were still working to clarify their positions and identify areas of agreement. Speaking at his first news conference since [&#8230;]\n\n\nThe post Lee says trade deal with US remains unclear ahead of Trump’s deadline appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/lee-says-trade-deal-with-us-remains-unclear-ahead-of-trumps-deadline.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/07/AP25184144089772.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-07-04 00:18:25","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.017},{"id":338034570,"title":"Trump announces trade deal with Hanoi, duty-free exports","text":"U.S. President Donald Trump announced a trade deal with Vietnam yesterday [Macau time] that would allow U.S. goods to enter the country duty-free.\n\nVietnamese exports to the United States, by contrast, would face a 20% levy.\n\nOn his Truth Social platform, Trump declared the pact “a Great Deal of Cooperation between our two Countries.’’\n\nIn April, Trump announced a 46% tax on Vietnamese imports — one of his so-called reciprocal tariffs targeting dozens of countries with which the United States runs trade deficits. Trump promptly suspended the reciprocal tariffs for 90 days to allow for negotiations like the one with Vietnam. The pause expires Tuesday, but so far the Trump administration has reached a trade agreement with only one of those countries — the United Kingdom. (Trump has also reached a “framework’’ agreement with China in a separate trade dispute.)\n\n“Vietnam has been very keen to get out from under this,’’ said Mary Lovely, senior fellow at the Peterson Institute for International Economics. “This is forcing a smaller country to eat it, basically. We can do that. It’s the big countries that everybody’s keeping their eyes on.’’ She doubts that Trump will be able to impose such a lopsided agreement on big trading partners such as the European Union and Japan.\n\nThe United States last year ran a $122 billion trade deficit with Vietnam. That was the third-biggest U.S. trade gap — the difference between the goods and services it buys from other countries and those it sells them — behind the ones with China and Mexico.\n\nIn addition to the 20% tariffs, Trump said the U.S. would impose a 40% tax on “transshipping’’ — goods from another country that stop in Vietnam on their way to the United States. Washington complains that Chinese goods have been dodging higher U.S. tariffs by transiting through Vietnam.\n\nWilliam Reinsch, a former U.S. trade official now with the Center for Strategic and International Studies, said the significance of the transshipment crackdown will depend on “how the term is defined and enforced. Some transshipment is outright fraud – simply changing the label; some is a legitimate substantial transformation in Vietnam into a new product; and there is a lot in between. Enforcement is always complicated.’’\n\nA February study in the Harvard Business Review found that there was “much less rerouting than previously believed.’’\n\nIn May, Vietnam approved a $1.5 billion project by the Trump Organization and a local partner to build a massive golf resort complex near Hanoi, covering an area roughly the size of 336 football fields.\n\nVietnam was a beneficiary of American efforts to counter China’s influence. Companies looking to diversify their supply chains away from China flocked to Vietnam.\n\nIn 2023, it became the only country to host both President Joe Biden and Chinese leader Xi Jinping on state visits. That year, the U.S. upgraded Vietnam to its highest diplomatic status—comprehensive strategic partner—placing it on par with China and Russia. MDT/AP","summary":"U.S. President Donald Trump announced a trade deal with Vietnam yesterday [Macau time] that would allow U.S. goods to enter the country duty-free. Vietnamese exports to the United States, by contrast, would face a 20% levy. On his Truth Social platform, Trump declared the pact “a Great Deal of Cooperation between our two Countries.’’ In [&#8230;]\n\n\nThe post Trump announces trade deal with Hanoi, duty-free exports appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/trump-announces-trade-deal-with-hanoi-duty-free-exports.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/07/AP25183039737581.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-07-04 00:16:23","author":null,"language":"en","source_country":"mo","sentiment":0.118},{"id":338034584,"title":"How Ukraine can cope with the US pause on crucial battlefield weapons","text":"The decision by the United States to pause some weapons shipments to Ukraine has come at a tough time for Kyiv: Russia’s bigger army is making a concerted push on parts of the roughly 1,000-kilometer front line and is intensifying long-range drone and missile attacks that increasingly hammer civilians in Ukrainian cities.\n\nWashington has been Ukraine’s biggest military backer since Russia launched a full-scale invasion of its neighbor on Feb. 24, 2022. But the Trump administration has been disengaging from the war, and no end to the fighting is in sight, despite recent direct peace talks.\n\nHere’s a look at Ukraine’s options following the U.S. pause of some arms deliveries:\n\nSpecific weapons needed from US\n\nAmid recurring concerns in Kyiv about how much military support its allies can supply and how quickly, Ukraine has raced to build up its domestic defense industry.\n\nThe country’s output has gradually grown, especially in the production of more and increasingly sophisticated drones, but Ukraine needs to speedily scale up production.\n\nCrucially, some high-tech U.S. weapons are irreplaceable. They include Patriot air defense missiles, which are needed to fend off Russia’s frequent ballistic missile attacks, but which cost $4 million each. That vital system is included in the pause, and many cities in Ukraine, including Kyiv, could become increasingly vulnerable.\n\nA senior Ukrainian official said yesterday that Patriot systems are “critically necessary” for Ukraine, but U.S.-made HIMARS precision-guided missiles, also paused, are in less urgent need as other countries produce similar assets.\n\n“Other countries that have these (Patriot) systems can only transfer them with U.S. approval. The real question now is how far the United States is willing to go in its reluctance to support Ukraine,” he told The Associated Press on condition of anonymity because of sensitivity of the subject.\n\nThe official said that Patriot missiles exist in sufficient numbers globally, and he said that accessing them requires political resolve.\n\n“There are enough missiles out there,” he said, without providing evidence.\n\nHe also stated that Ukraine has already scaled up its domestic production of 155 mm artillery shells, which were once critically short, and is now capable of producing more than is currently contracted. “Supplies from abroad have also become more available than before,” he said.\n\nBackup plan\n\nAmid at times fraught relations with U.S. President Donald Trump, Ukrainian President Volodymyr Zelenskyy has been enlisting greater European help for his country’s arms manufacturing plans.\n\nEuropean countries don’t have the production levels, military stockpiles or the technology to pick up all the slack left by the U.S. pause, but Zelenskyy is recruiting their help for ambitious joint investment projects.\n\nDraft legislation to help Ukrainian defense manufacturers scale up and modernize production, including building new facilities at home and abroad, will be put to a vote in the Ukrainian parliament later this month, Defense Minister Rustem Umerov announced this week.\n\nZelenskyy said last month that major investments will go to the production of drones and artillery shells.\n\n“The volume of support this year is the largest since the start of the full-scale war,” he said about commitments from foreign countries.\n\nUnder Trump, there have been no new announcements of U.S. military or weapons aid to Ukraine. Between March and April, the United States allocated no new help at all, according to Germany’s Kiel Institute, which tracks such support.\n\nFor the first time since June 2022, four months after Russia’s full-scale invasion, European countries have surpassed the U.S. in total military aid, totaling 72 billion euros ($85 billion) compared with 65 billion euros ($77 billion) from the U.S., the institute said last month.\n\nBig battlefield problem\n\nWithout Patriot missiles, as well as the AIM-7 Sparrow air-to-air missile and shorter-range Stinger missiles that are also included in the pause, Ukrainian cities likely will take a bashing as more Russian missiles pierce air defenses.\n\nOn the front line, Ukrainian troops haven’t recently voiced complaints about ammunition shortages, as they have in the past. They have always said that during the war, they have never had as much ammunition to as their disposal as Russian forces.\n\nThe army faces a different problem: It’s desperately short-handed. It’s turning to drones to compensate for its manpower shortage, and analysts say the front isn’t about to collapse.\n\nAsked about the timing of the U.S. pause, the Ukrainian official emphasized the need for stable, reliable supply lines.\n\n“This is war — and in war, steady deliveries are always crucial,” he said. HANNA ARHIROVA & BARRY HATTON, KYIV, MDT/AP","summary":"The decision by the United States to pause some weapons shipments to Ukraine has come at a tough time for Kyiv: Russia’s bigger army is making a concerted push on parts of the roughly 1,000-kilometer front line and is intensifying long-range drone and missile attacks that increasingly hammer civilians in Ukrainian cities. Washington has been [&#8230;]\n\n\nThe post How Ukraine can cope with the US pause on crucial battlefield weapons appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/how-ukraine-can-cope-with-the-us-pause-on-crucial-battlefield-weapons.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/07/AP25184385183811.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-07-04 00:14:21","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":0.033},{"id":338037806,"title":"World News | UAE: MOCCAE Collaborates with Tadweer Group to Launch Pilot Project for Managing Targeted Product Waste","text":"Dubai [UAE], July 4 (ANI/WAM): The Ministry of Climate Change and Environment (MOCCAE) has signed a Memorandum of Understanding (MoU) with Tadweer Group to implement a pilot project for managing targeted product waste under the UAE's Extended Producer Responsibility (EPR) initiative. The EPR is one of the key initiatives within the UAE Integrated Waste Management Agenda 2023-2026.\nThe signing took place during an event in Dubai, attended by Dr. Amna bint Abdullah Al Dahak, Minister of Climate Change and Environment; and Engineer Ali Al Dhaheri, Managing Director and CEO of Tadweer Group. Several senior officials from both entities were also present.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\nThe MoU forms part of the UAE's broader efforts to advance environmental sustainability, strengthen integrated waste management, address pressing environmental challenges, and support the transition towards a circular economy and sustainable economic growth.\nMOCCAE and Tadweer Group are collaborating on a pilot project to manage targeted product waste, specifically electrical and electronic equipment, batteries, and packaging. This project will be temporarily implemented and operated as a pilot in Abu Dhabi and Dubai, with Tadweer Group as the Producer Responsibility Organisation (PRO).\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nAmna bint Abdullah Al Dahak highlighted the UAE's partnership-driven approach to achieving the UN Sustainable Development Goals. This approach is reflected in the implementation of strategic initiatives designed to deliver sustainable environmental solutions, particularly in waste management. It ensures the safe, long-term disposal of waste and protects the right of future generations to live in a clean, pollution-free environment.\nAl Dahak added \"We are pleased to continue our collaboration with Tadweer Group to support our goals for integrated management and safe disposal of waste, while also ensuring waste is reused optimally within the UAE's advanced circular economy framework. The EPR initiative constitutes a key pillar of this framework, engaging all stakeholders, including manufacturers, suppliers, and consumers, in the waste management process in line with international best practices.\"\nAli Al Dhaheri, Managing Director and CEO of Tadweer Group, said: \"Tadweer Group is proud to work closely with the Ministry on this important initiative. This will play a key role in the waste journey, by holding manufacturers accountable for their role in waste creation. By piloting an EPR model, we are laying the foundation for a more accountable and resource-efficient waste management system. In addition, we will explore invaluable learnings that will inform future strategies focused on EPR, ensuring a seamless transition to a model that benefits the environment, businesses, and our community.\"\nThe MoU includes measures to boost regulatory readiness by improving understanding of the requirements for implementing EPR monitoring, its key influencing factors, and documenting the lessons learned and challenges encountered during the pilot phase.\nAdditionally, the MoU supports the objectives of the circular economy by promoting private sector participation and investment in sustainable waste management, developing a roadmap for policy development and implementation mechanisms, and assessing the effectiveness of the EPR initiative.\nThe MoU stipulates that both parties will jointly manage and operate the project on a pilot basis in Abu Dhabi and Dubai. The pilot will be conducted in coordination with the producers of the targeted products and the signatories of the EPR Pilot Project Pledge. The parties will also lead efforts to raise public awareness and promote community engagement to ensure active participation in the pilot project.\nThe roles and responsibilities of producers and suppliers are identified in Cabinet Resolution No.39 of 2021 regarding the executive regulations of Federal Law No.12 of 2018 concerning integrated waste management.\nAt the event, 26 companies spanning diverse sectors - including retail, production, and waste management services - formally signed the EPR Pledge, marking a significant milestone for the pilot EPR project. This powerfully demonstrates the UAE private sector's deep commitment to environmental sustainability and responsible waste management. (ANI/WAM) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  The Ministry of Climate Change and Environment (MOCCAE) has signed a Memorandum of Understanding (MoU) with Tadweer Group to implement a pilot project for managing targeted product waste under the UAE's Extended Producer Responsibility (EPR) initiative. The EPR is one of the key initiatives within the UAE Integrated Waste Management Agenda 2023-2026.","url":"https://www.latestly.com/agency-news/world-news-uae-moccae-collaborates-with-tadweer-group-to-launch-pilot-project-for-managing-targeted-product-waste-6971758.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703201215.jpg","video":null,"publish_date":"2025-07-04 00:14:20","author":null,"language":"en","source_country":"in","sentiment":0.377},{"id":338039844,"title":"Kyodo News Digest: July 4, 2025","text":"TOKYO - The following is the latest list of selected news summaries by Kyodo News.\n\nJapan's household spending in May up 4.7% on year\n\nTOKYO - Japan's household spending rose a real 4.7 percent in May from a year earlier, government data showed Friday.\n\nHouseholds of two or more people spent an average of 316,085 yen ($2,200) in the reporting month, the Ministry of Internal Affairs and Communications said.\n\nTrump likely to start sending new tariff rate letters on Friday\n\nWASHINGTON - U.S. President Donald Trump said his administration would likely begin sending letters informing some countries of their new tariff rates on Friday.\n\n\"It's just much easier. We have far more than 170 countries,\" Trump told reporters on Thursday. \"I'd rather send out a letter saying this is what you're going to pay to do business in the United States.\"\n\nNovelist Otani becomes Japan's 1st to win British crime writing award\n\nLONDON - A Japanese novelist on Thursday became her country's first to win a major British award for crime and mystery writing, highlighting a boom in the popularity of translated Japanese fiction.\n\nAkira Otani was given the best translated crime novel prize at the Dagger Awards for \"The Night of Baba Yaga,\" beating out five shortlisted competitors including fellow Japanese author Asako Yuzuki.\n\nTOKYO - The Japanese government wants to send its chief tariff negotiator to the United States for an eighth round of ministerial-level talks early next week, a source close to the matter said Thursday.\n\nTokyo is believed to have sounded out the administration of President Donald Trump for another round of negotiations ahead of next Wednesday's deadline for its 90-day pause on country-specific tariffs.\n\nTOKYO - An earthquake with a magnitude of 5.5 hit off small islands in southwestern Japan on Thursday, following over 1,000 felt temblors in the area in nearly two weeks, the weather agency said.\n\nThe quake, which struck around 4:13 p.m. off the Tokara island chain in Kagoshima Prefecture, measured a lower 6 on the Japanese seismic intensity scale of 7 on Akuseki Island, part of the village of Toshima, the Japan Meteorological Agency said. No tsunami warning was issued.\n\nOSAKA - A Michael Jackson impersonator in Osaka is using his popularity on social media to help address issues such as overcrowding and littering caused by overtourism.\n\nThe moonwalking performer, who calls himself \"Michael Jackton\" and has amassed nearly 13 million followers on video platform TikTok, frequently turns heads in Osaka's bustling Dotombori entertainment district and elsewhere in the western Japan city.\n\nCampaigning for Japan upper house election begins, inflation tests PM\n\nTOKYO - Official campaigning began in Japan on Thursday for the July 20 House of Councillors election, a crucial test for Prime Minister Shigeru Ishiba and his minority government as voters struggle with the rising cost of living.\n\nIshiba has set a goal for the ruling coalition of his Liberal Democratic Party and the Komeito party to retain its majority in the 248-member upper house, meaning it will need to win at least 50 seats in the upcoming race in which 125 seats are up for grabs.\n\nBasketball: Japan, Denmark play to stalemate in women's friendly\n\nTOKYO - The Japanese women's national basketball team made too many mistakes but \"learned a lot\" from Thursday's 65-65 tie with Denmark, head coach Corey Gaines said.\n\nAkatsuki Japan trailed early before fighting its way back into the exhibition game at Ariake Arena, which ended without an overtime period.\n\nVideo: Popular mascots parade on Osaka Expo-designated Japan Day","summary":"The following is the latest list of selected news summaries by Kyodo News.----------Japan&#39;s household spending in May up 4.7% \n\nRead full story here","url":"https://english.kyodonews.net/articles/-/56669","image":"https://english-kyodo.ismcdn.jp/mwimgs/8/6/1200x/img_869d0ee0c60421b70889dae986b2a2b81243283.jpg","video":null,"publish_date":"2025-07-04 00:01:00","author":null,"language":"en","source_country":"JP","sentiment":-0.065},{"id":338037818,"title":"World News | Bangladesh Pursuing Extradition of Sheikh Hasina, Says Interim Govt Advisor","text":"Dhaka [Bangladesh], July 4 (ANI): Foreign Affairs Advisor to Bangladesh's Interim Government, Md Towhid Hossain, on Thursday, indicated that the country's interim government is actively pursuing the extradition of former Prime Minister Sheikh Hasina from India, a year after her ousting from the country.\nResponding to questions about the lack of progress on the extradition process and whether the current interim government had any regrets about not being able to bring Hasina back to the country, Hossain stated that they had sent a letter to India requesting the same and noted that necessary follow-ups would also be made.\nAlso Read | Donald Trump 'Big Beautiful' Bill Passed: House Gives Final Approval To Big Tax Bill, Sends It To Him To Sign.\n\"We have sent a letter. We will follow up if necessary,\" he stated.\nSheikh Hasina was ousted on August 5 last year, after a student-led uprising. She is now living in India in self-imposed exile.\nAlso Read | 'Campaign Against Ukraine Will Continue Till Objectives Achieved': Vladimir Putin Declines Donald Trump's Call for Ukraine Truce, Says Kremlin Official.\nAfter Sheikh Hasina's fall, an interim government was formed under the leadership of Nobel Laureate Muhammad Yunus.\nEarlier on Wednesday, the International Crimes Tribunal (ICT), a Bangladesh court designated for the trial of international crimes, sentenced Hasina to six months in prison in a contempt of court case.\nA three-member tribunal led by Justice Md. Golam Mortuza Majumder gave this order.\nEarlier, AY Moshiuzzaman, a senior lawyer, was appointed as amicus curiae (friend of the court) by the ICT for a full hearing of the contempt of court case.\nThe Chief Prosecutor filed a contempt of court complaint against Sheikh Hasina and Awami League leader Shakil Alam Bulbul on April 30, in light of their statements regarding the case related to the July mass uprising incident.\nThe formal charges stated that Prime Minister Sheikh Hasina was the mastermind behind the inhumane acts, such as crimes against humanity, murders, and the burning of bodies across the country during the movement to overthrow the government in 2024. These crimes were organised on her orders.\n\"There are 227 cases against me, so I have a licence to kill 227 people,\" Sheikh Hasina said in an alleged audio clip that went viral a few months ago.\nLater, the Criminal Investigation Department (CID) of the police conducted a forensic examination of the conversation and found its authenticity. After that, a contempt of court application was filed with the tribunal.\nThe prosecution said that Sheikh Hasina did not appear in person or provide an explanation through a lawyer even after the notice was published in the newspaper. In this situation, the tribunal can now punish those involved by the law.\nEarlier in the day, anti-national and anti-independence forces had staged a mock trial against Sheikh Hasina in a kangaroo court formed to implement their political objectives in Bangladesh, the Awami League said in a statement. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Foreign Affairs Advisor to Bangladesh's Interim Government, Md Towhid Hossain, on Thursday, indicated that the country's interim government is actively pursuing the extradition of former Prime Minister Sheikh Hasina from India, a year after her ousting from the country.","url":"https://www.latestly.com/agency-news/world-news-bangladesh-pursuing-extradition-of-sheikh-hasina-says-interim-govt-advisor-6971747.html","image":"https://st1.latestly.com/wp-content/uploads/2025/07/ANI-20250703184435.jpg","video":null,"publish_date":"2025-07-04 00:00:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.189},{"id":338037542,"title":"One of world's most beautiful countries is begging tourists to come","text":"One of the world's most striking and least visited countries is bucking the anti-tourism trend. Greenland is extending an open invitation to globetrotters and sharing a warm message with eager adventurers across the globe: We're all set for your arrival. \"Come visit Greenland ,\" invites Nukartaa Andreassen, an employee at a water taxi service in Nuuk. \"Learn about it, learn about us. We love to have you. We love to tell our stories and our culture.\" This island, rich in minerals and nestled in the Arctic, is embracing tourism with open arms. From whale-spotting odysseys to treks to the famed puffin island and guided tours of distant hamlets, Greenland is eager to exhibit its charms, hoping to shift focus away from past political squabbles, notably with Donald Trump. \"Our goal and mission is to present and be the ambassadors of Greenland,\" declares Casper Frank Møller, CEO of Raw Arctic, a Nuuk-based tour operation. \"and to show what beauty you can experience while you're here.\" Following the initiation of a newfangled flight path between Nuuk and Newark, New Jersey, expectations are high for a surge in tourist interest this year. The first-ever direct link from the United States to Greenland via an American carrier launched with fanfare on June 14. Previously, U.S. voyagers had to stopover in Iceland or Denmark before continuing their journey to Greenland. This development has simplified travel significantly, much to the delight of travellers like Doug Jenzen, who was among the inaugural passengers on the United Airlines flight departing from New Jersey. \"I arrived with the intention of exploring some of the natural wonders on the world's largest island, aiming to promote ecotourism and sustainable travel while bolstering the local economy,\" stated Jenzen. Cruise ships are already able to dock on the island, but they contribute less to businesses catering to tourists as passengers typically eat and sleep onboard. In 2024, Greenland welcomed around 150,000 tourists, according to Naaja Nathanielsen, Greenland's business minister. \"We're keen to expand the tourism sector. It's a great fit for many in Greenland,\" added Nathanielsen. \"Tourism is about good vibes. It's about sharing culture, history. It's about storytelling. And as Inuit, that's very much part of our heritage.\" Earlier this year, Greenland found itself in the global spotlight when Trump announced his desire to gain control of the semi-autonomous Danish territory, either through purchase or potentially by force. Denmark, a NATO ally, along with Greenland, have firmly stated that the island is not for sale and have condemned reports of the U.S. gathering intelligence there. Despite the diplomatic strain, Frank Møller of Raw Arctic sees a silver lining. \"It has kind of put Greenland on the world map. And it's definitely a situation that Raw Arctic has used to our advantage,\" he said. However, he emphasised that any expansion of the tourism industry should occur at a pace that respects the voices and comfort levels of the approximately 56,000 residents on the island. Andreassen, from Nuuk Water Taxi, agreed. \"It's very important for me to tell my own story. Because I always feel like when I meet new people, I always introduce a whole Greenland,\" she remarked. \"It's important for me to show our own culture, our own nature. Not by television, not by other people from other countries.\" During a boat trip in June, Pinar Saatci, a 59-year-old holidaymaker from Turkey, was thrilled to observe several whales leaping out of the sea. \"It's very exciting to be here, at the other part of the world, so far away from home,\" she exclaimed. \"It's a very exciting and unforgettable moment.\" Risskov Rejser has been organising jaunts to Greenland for Danish globetrotters via her travel agency. Nevertheless, she harbours concerns over the effects of a deluge of tourists. \"For me, the worst thing would be if mass tourism starts and people come here, and sort of look upon the Greenland people as if they were a living museum,\" she stated. \"It has to be done in a respectful way and you have to consider what the consequences are.\"","summary":"The mineral-rich Arctic island is open for tourism. Whale-watching tours, excursions to the iconic puffin island and guided charters through remote settlements are just the beginning of what Greenland has to offer visitors.","url":"https://www.mirror.co.uk/travel/europe/one-worlds-most-beautiful-countries-35479382","image":"https://i2-prod.mirror.co.uk/article35479381.ece/ALTERNATES/s1200b/0_Greenland-Upernavik.jpg","video":null,"publish_date":"2025-07-04 00:00:00","author":"Kwiyeon Ha","authors":["Kwiyeon Ha"],"language":"en","source_country":"GB","sentiment":0.515},{"id":338036508,"title":"How Palantir Stock Soared 80% in the First Half of 2025 to Become the Best S&P 500 Stock -- and Why the Next Big Move Could Come in August","text":"Palantir Technologies (PLTR 1.62%) stock soared 80.3% in the first half of 2025, which ended on Monday, June 30. That performance made the operator of artificial intelligence (AI)-powered data analytics platforms the best performer in the S&P 500 index.\n\nFor context, in the year's first half, the S&P 500 returned 6.2% and the tech-heavy Nasdaq Composite index returned 5.9%.\n\nPalantir stock entered 2025 with strong momentum gaining 10.7% through Feb. 3\n\nPalantir stock had a fantastic year in 2024. It was last year's best-performing stock in the S&P 500 index, skyrocketing an incredible 341%. (Yep, it even beat superstar Nvidia stock, which gained 171%.) The index returned 25% last year.\n\nPalantir stock entered 2025 with momentum stemming from the company's great performance last year, and likely also got a boost from Donald Trump's election as president late last year. (Some influential people with links to Palantir were known to strongly support him.) It gained nearly 11% in early 2025 before the company's release of its Q4 2024 report on Feb. 3. By comparison, the S&P 500 index rose 1.9% over this period.\n\nPalantir stock rocketed 24% on Feb. 4 following the Q4 2024 earnings release\n\nOn Feb. 3, Palantir released its report for the fourth quarter of 2024. Shares soared 24% on the following day. The catalysts: the quarter's revenue and earnings along with 2025 guidance were significantly better than Wall Street had been expecting.\n\nIn the quarter, Palantir's revenue grew 36% year over year, beating the 28% analysts had been projecting. Adjusted earnings per share (EPS) surged 75%, crushing the 36% consensus estimate. The company's profits have been growing faster than its revenue, reflecting an increasing profit margin.\n\nInvestors were also likely buoyed by the U.S. commercial business' terrific revenue growth of 64% year over year. Many investors wanted to see greater diversification away from the company's reliance on governmental business. (For context, in its most recently reported quarter, Q1 2025, Palantir's government/commercial revenue breakdown was 55%/45%.)\n\nMoreover, management guided for 2025 revenue growth of 31% year over year, topping the 26% growth Wall Street was projecting.\n\nPalantir stock dropped on May 6 following the Q1 2025 earnings release, but quickly recouped the decline\n\nOn May 6, Palantir stock dropped 12.1% following the company's release on the prior afternoon of its first quarter 2025 report. Within one week, however, shares had more than recouped this decline and closed out May with a gain.\n\nAs I wrote in my Q1 earnings article, \"It's safe to assume the main reason for the stock's decline was that the quarter's earnings \"only\" met Wall Street's consensus estimate. Granted, earnings growth was great, but simply meeting analysts' expectations is not usually good enough to prevent a post-earnings decline for a stock with a sky-high valuation.\"\n\nIn Q1, Palantir's revenue jumped 39% year over year, exceeding Wall Street's expectation of 36% growth. Adjusted EPS surged 63%, which was in line with the analyst consensus estimate. As with the prior quarter, the company's profit increased much more than its revenue, reflecting its expanding profit margin.\n\nIn addition, management raised its 2025 guidance for several key metrics, including revenue growth, which it increased to 36% from 31%. (Palantir doesn't provide guidance for earnings.)\n\nIn June, Palantir stock edged up 3.5% to close out the first half of 2025 with its 80.3% gain.\n\nCatalyst ahead: Earnings release likely coming in early August\n\nPalantir hasn't yet announced a date for the release of its results for the second quarter. However, investors can probably expect a date in early August.\n\nFor Q2, management guided for revenue of $934 million to $938 million. This equates to growth of about 38% year over year. It also guided for adjusted income from operations of $401 million to $405 million, or growth of 58% to 60% year over year.\n\nWall Street is currently modeling for Q2 revenue of $939.3 million, or 39% growth year over year. Analysts also project adjusted EPS of $0.14, or 56% growth.\n\nThere are no guarantees, but I'm expecting Palantir to continue its track record of surpassing Wall Street's estimates.","summary":"Palantir stock's stellar performance is being driven by strong demand for the company's AI-powered software platforms for data analytics.","url":"https://www.fool.com/investing/2025/07/03/best-stocks-2025-pltr-stock-ai-stocks/","image":"https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F823472%2Fpltr-stock-best-ai-stocks.jpg&amp;op=resize&amp;w=1200&amp;h=630","video":null,"publish_date":"2025-07-04 00:00:00","author":"Beth McKenna","authors":["Beth McKenna"],"language":"en","source_country":"us","sentiment":-0.149},{"id":338040752,"title":"Hamas mahu jaminan jelas mengenai gencatan senjata akan tamatkan perang","text":"GAZA: Pejuang Hamas mahu jaminan jelas bahawa cadangan gencatan senjata baharu yang disokong Amerika Syarikat (AS) untuk Gaza akan membawa kepada penamatan perang, menurut sumber rapat kumpulan berkenaan semalam. \n\nTentera Israel pula memaklumkan bahawa prospek untuk mencapai perjanjian gencatan senjata dan pembebasan tebusan kini dilihat semakin cerah, selepas hampir 21 bulan sejak konflik antara Israel dan Palestin tercetus.\n\nUsaha ke arah gencatan senjata di Gaza semakin giat dilakukan selepas AS berjaya memeterai gencatan senjata bagi menamatkan konflik udara selama 12 hari antara Israel dan Iran. \n\nNamun, di Gaza, serangan udara Israel terus dipertingkatkan tanpa henti dengan sekurang-kurangnya 59 orang terkorban semalam, menurut pihak berkuasa kesihatan di wilayah itu. \n\nSelasa lalu, Presiden AS, Donald Trump, berkata Israel bersetuju dengan syarat-syarat yang diperlukan untuk memuktamadkan gencatan senjata selama 60 hari dengan pejuang Hamas, di mana sepanjang tempoh itu, kedua-dua pihak akan berusaha menamatkan perang.\n\nHamas kini mahukan jaminan kukuh bahawa gencatan senjata berkenaan benar-benar akan membawa kepada penamatan konflik, kata sumber rapat dengan kumpulan itu. \n\nDua pegawai Israel memaklumkan bahawa perincian lanjut mengenainya masih dirundingkan.\n\nDalam satu kenyataan awal pagi hari ini, Hamas memaklumkan pihaknya sedang berbincang dengan beberapa puak Palestin lain mengenai cadangan gencatan senjata terbabit dan akan menyerahkan maklum balas kepada pihak pengantara sebaik rundingan itu selesai.\n\nSumber keselamatan Mesir berkata, pengantara Mesir dan Qatar sedang berusaha mendapatkan jaminan daripada AS dan masyarakat antarabangsa supaya rundingan penamatan perang dapat diteruskan sebagai usaha meyakinkan Hamas menerima cadangan gencatan senjata selama dua bulan.\n\nSeorang pegawai kanan Israel yang rapat dengan Perdana Menteri Benjamin Netanyahu pula berkata, persiapan sudah dilakukan untuk meluluskan perjanjian gencatan senjata itu. \n\nSumber lain yang mengetahui perkembangan itu memaklumkan bahawa Israel menjangkakan maklum balas pejuang itu selewat-lewatnya hari ini dan sekiranya positif, delegasi Israel akan menyertai rundingan tidak langsung bagi memuktamadkan perjanjian.\n\nCadangan itu turut merangkumi pembebasan berperingkat 10 tebusan Israel yang masih hidup serta pemulangan 18 mayat lagi sebagai pertukaran kepada pembebasan tahanan Palestin di penjara Israel, kata seorang pegawai yang terbabit dalam rundingan semalam. \n\nDaripada 50 tebusan yang masih berada di Gaza, 20 dipercayai masih hidup.\n\nBantuan kemanusiaan akan mula memasuki Gaza dengan segera, manakala tentera Israel akan berundur secara berperingkat dari beberapa bahagian wilayah itu, menurut cadangan berkenaan. \n\nRundingan untuk gencatan senjata kekal juga akan dimulakan sebaik sahaja perjanjian dipersetujui.\n\n\"Kami berharap ia dapat dimuktamadkan, tetapi semua bergantung kepada apa yang sanggup diterima oleh Hamas,\" kata Duta AS ke Israel, Mike Huckabee, kepada Saluran 12 Israel pada Khamis. \n\n\"Satu perkara jelas: Presiden mahu ia berakhir. Perdana Menteri mahu ia berakhir. Rakyat AS dan m Israel juga mahukan ia berakhir,\" katanya. \n\nHuckabee turut memaklumkan bahawa beliau akan terbabit dalam rundingan di Rumah Putih minggu depan ketika Netanyahu dijadual bertemu Trump.","summary":"GAZA: Pejuang Hamas mahu jaminan jelas bahawa cadangan gencatan senjata baharu yang disokong Amerika Syarikat (AS) untuk Gaza akan membawa kepada penamatan perang, menurut sumber rapat kumpulan berkenaan semalam.","url":"https://www.bharian.com.my/dunia/asia/2025/07/1415555/hamas-mahu-jaminan-jelas-mengenai-gencatan-senjata-akan-tamatkan-perang","image":"https://assets.bharian.com.my/images/articles/BH4hamas-o_BHfield_image_listing_featured.var_1751587168.jpg","video":null,"publish_date":"2025-07-03 23:59:35","author":"REUTERS","authors":["REUTERS"],"language":"en","category":"politics","source_country":"my","sentiment":1},{"id":338033732,"title":"Todd Chrisley reveals his ‘sole intent’ in prison was to make employees miserable","text":"Todd Chrisley knows best when it comes to the prison system.\n\nIn May, the reality star, 56, and his wife, Julie Chrisley, 52, were pardoned by President Donald Trump after being convicted of fraud and tax evasion in 2022. \n\nTodd and Julie began their prison sentences in 2023 and served a little over two years before gaining their freedom.\n\nSince their release, the couple has been vocal about their time behind bars, even sitting down with their daughter Savannah Chrisley on her “Unlocked” podcast on Tuesday.\n\n“I was surrounded by miserable human beings,” Todd reflected about his time at the Federal Prison Camp in Pensacola, Florida. “Every day, I got up and it was my sole intent to make their life even more miserable because they were there to make our lives miserable.”\n\nJulie agreed with her husband of 29 years, stating that the correctional officers are “miserable human beings.”\n\nAs Todd put it, “They are not your friends. It’s us against them.”\n\nThe “Chrisley Knows Best” alum went on to describe his mindset behind bars.\n\n“I think for me, I was always free. In my head, I was still free,” he explained. “I did not take up residence there. I was in prison. Prison was not in me.”\n\nTodd made the most out of his time in the facility, sharing with listeners that he “made great friends.”\n\n“I stayed in faith. I prayed. I read my Bible. I worked out,” the patriarch continued. “I walked. And I wreaked havoc on anyone who was mistreating somebody else.”\n\nOne person in particular was Rick Singer, the mastermind behind the 2019 “Varsity Blues” college admissions scandal that left more than 50 coaches, parents and associates of Singer’s behind bars.\n\nThe disgraced college admissions coach pleaded guilty in 2019 to racketeering, money laundering, conspiracy to defraud the federal government and obstruction of justice, and is serving out the rest of his 42-month sentence in Pensacola.\n\n“He was talking smack, saying that he didn’t wear a wire. He never told on anyone. The Feds set him up and this, that and the other,” Todd detailed.\n\nWith his remarks already rubbing the former USA Network star the wrong way, months later, Singer came back and made a comment about Savannah.\n\n“So, I walked up to him and I said, ‘I’m going to say this one more time,” Todd noted. “I’m already in prison. I will rip your head off and s–t your neck if you talk about my child again.’ And I meant what I said.”\n\nSinger said he wasn’t scared of Todd, to which the entrepreneur replied, “I don’t need you to be afraid of me. Just be aware that if my daughter’s name comes out of your mouth again, I will rip your head off and s–t down your neck.”\n\nAlthough Todd made the most of his days, his reality still hit him hard at times.\n\n“I was angry at God,” he admitted during the ABC News special “The Chrisleys: Life After Lockup” last week. “And when I went to bed that night and the lights went out, I cried myself to sleep and I said, ‘God, why are you allowing this?’”\n\n“You don’t realize the things that you took for granted until you don’t have it,” he shared. “So your freedom, your ability to go to church, your ability to go out to eat, you know, to stay in your bed all day, those things are taken from you, so when you have them back, it’s a blessing.”\n\nJulie, meanwhile, spoke out about what she missed the most while serving her sentence. \n\n“My children and my husband, you know, I missed birthdays and holidays and graduations and things that I can never get back.”\n\nThe duo also reflected on coming home. When it came to Todd’s first shower back in Nashville, the media personality joked to host Juju Chang that “it was almost like your first sexual encounter.“\n\nAs for his first meal, Todd opted for Pizza Hut, while Julie chose the fast-food chain Zaxby’s.\n\nIn 2019, the two were indicted, with federal prosecutors accusing them of submitting fake documents to banks in order to garner more than $30 million in loans. They denied the allegations.\n\nTodd was sentenced to 12 years, while Julie received a seven-year sentence.\n\nThey had not been allowed to see or talk to one another since reporting for prison in January 2023 until their release in May.\n\nNow, Todd and Julie are set to make their reality television comeback, with Savannah, 27, telling reporters outside her father’s prison, “We have a new show coming out on Lifetime, and it will document all of these things.”","summary":"When it came to those who worked in the prison, the star said it was \"us against them.\"","url":"https://nypost.com/2025/07/03/entertainment/todd-chrisley-sole-intent-in-prison-was-to-make-staff-miserable/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/107555948.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-07-03 23:57:43","author":"Alexandra Bellusci","authors":["Alexandra Bellusci"],"language":"en","source_country":"us","sentiment":-0.272},{"id":338035046,"title":"Tiffany Trump reveals first look at newborn son – see the adorable photos","text":"Donald Trump's daughter Tiffany Trump shared the first photos of her newborn son to social media, and looked so loved-up with baby Alexander in the sweet snaps. The 31-year-old took to Instagram to post several shots of herself holding her son, showcasing his shock of brown hair and bright blue eyes. \n\nIn another photo, Alexander was sleeping in an adorable teddy bear outfit, while in a third snap, Tiffany looked on lovingly as her husband, Michael Boulos, cradled his son in his arms. \n\nNew beginnings\n\n\"The love of our lives, ATB,\" the new mom wrote in the caption, alongside a teddy bear emoji. The couple welcomed their son in May, just over two years after they tied the knot at Donald's Mar-a-Lago estate in Florida. They had met in 2018 while on vacation in Greece. \n\nThe President made a speech at the wedding reception, wishing them a happy marriage and urging Michael to \"take care of her\".\n\n\"No doubt, you are a special person and you are way beyond your years,\" he said of his son-in-law. \"You are just two spectacular people and this was a beautiful day.\"\n\nThey announced Alexander's birth in May with a sweet social media post featuring a black-and-white photo of his tiny foot. \n\n\"Welcome to the world our sweet baby boy, Alexander Trump Boulos. We love you beyond words! Thank you for coming into our lives!\" Tiffany wrote in the caption.\n\nIn the comment section, Michael added, \"He's a blessing!\" while her mother, Marla Maples, exclaimed, \"No greater joy in the world. Michael and Tiffany this Gran Mar Mar loves you all so much!! You rocked it, my girl!\"\n\nA grandparent's love\n\nMarla, who was married to Donald from 1993 to 1999, is soaking up the experience of being a first-time grandmother and has been spending as much time as possible with Alexander. \n\n\"The best days of all are spent with tiny feet and tiny toes…Love you my little Grandson Alexander…Time with you is Heaven on Earth,\" she wrote in June, alongside a photo of herself pushing her grandson in a pram. \n\nAlexander is Donald's 11th grandchild; his son Donald Jr. has five kids, his second son Eric has two, and his daughter Ivanka has three. \n\nThe former Celebrity Apprentice host is particularly close with his eldest grandchild, Kai, who is the daughter of Donald Jr. and his ex-wife Vanessa Trump.\n\nKai and Donald share a passion for golfing, and the 18-year-old announced that she would be joining the team at the University of Miami. \n\n\"I am beyond excited to announce my verbal commitment to the University of Miami,\" she said in an Instagram statement. \n\n\"I would like to thank my mom, Vanessa, and my dad, Don, for always supporting me through my journey.\"\n\nShe continued: \"I would also like to thank my great team for getting me to this point. I would like to thank my Grandpa for giving me access to great courses and tremendous support. I would also like to thank my Mormor for always believing in me.\"\n\n\"Last but not least, I would love to thank Coach Janice and Coach Jim for giving me this opportunity. I am super excited to be a cane and represent the University of Miami. Gooo Canes!\"\n\nTo learn more about Donald's family, watch below...","summary":"Donald Trump's daughter Tiffany Trump shared the first photos of her newborn son to social media, and looked so loved-up with baby Alexander in the sweet snaps. See details.","url":"https://www.hellomagazine.com/celebrities/842072/tiffany-trump-reveals-first-look-at-newborn-son-see-the-adorable-photos/","image":"https://images.hellomagazine.com/horizon/landscape/6f42e64d1cd4-gettyimages-1228202751.jpg?tx=c_fill,w_1200","video":null,"publish_date":"2025-07-03 23:56:56","author":"Faye James","authors":["Faye James"],"language":"en","source_country":"gb","sentiment":0.78},{"id":338033544,"title":"One ‘big, beautiful’ flip-flop: Trump’s budget turns the Freedom Caucus back into the Fealty Caucus","text":"Hardline conservatives in the House Freedom Caucus looked more like members of the Fealty Caucus on Thursday after a rebellion among the party’s spending hawks melted away in the final hours and the House passed the legislation known as the “One Big, Beautiful Bill Act” on Thursday.\n\nPresident Donald Trump wins, while just about every wing of the GOP congressional caucuses suffered an embarrassment in some form or another (except maybe the leadership).\n\nThe Freedom Caucus was the last faction to face down its foe and blink. The group’s members circulated a three-page memo to members of the GOP caucus over Wednesday decrying the Senate-passed version of “One Big, Beautiful Bill” as a betrayal of the framework Speaker Mike Johnson had agreed to.\n\nIt was an all-encompassing retreat. Rep. Ralph Norman left the White House this week with a three-point plan he said GOP leaders could implement to get his vote to a “yes”. He received none of those concessions — no one did, as the House passed the version of the bill sent back from the Senate. Amending the bill in any way would have sent it back to the Senate before it reached Trump’s desk, endangering the July 4 deadline that members in both chambers blasted as arbitrary.\n\n“I can't vote yes just because everybody says we got to get it done by July 4th,” Rep. Chip Roy said in an interview this week. He then did so, explaining in a Twitter post that he received “assurances” from the White House that the administration was preventing Medicaid fraud.\n\nAnother far-right Republican, Rep. Derrick Van Orden, grew irate this week when questioned whether the caucus was just following Trump’s marching orders.\n\n“The president of the United States didn’t give us an assignment. We’re not a bunch of little bitches around here, okay?” he barked at a reporter. He’d later go on to snipe at The Independent for a “bulls***” question about a vote being held open for hours while Trump and the leadership brought the holdouts into line.\n\nThey aren’t the only ones who folded, to be clear. Sen. Lisa Murkowski was a potential “no” vote in the Senate, who sharply criticized the legislation and fretted about the real world effects that new work requirements would have on SNAP and Medicaid recipients, in multiple comments to reporters after passage of the bill on Tuesday.\n\nMurkowski told reporters, after voting for the bill, that she hoped the House would amend the legislation and send it back to the Senate for more work, suggesting that Republicans blow past the president’s deadline. But it was her very refusal to hold out for those changes that guaranteed they were kept out of the bill when Speaker Mike Johnson called everyone’s bluff at once. \n\nInstead, Murkowski (and others) secured a $50bn fund aiming to prevent rural hospitals from closure, and some Alaska-specific carve outs that earned her the label “cheap date” from one senior Democratic congressman.\n\nIn the end, Republicans folded. They know they folded. And they are none too happy to have that fact pointed out.\n\nRoy spent the afternoon after the House vote retweeting his defenders, who insisted that the Freedom Caucus had not “caved”. “Constantly threatening to vote against bills and then voting for them makes Roy/Freedom Caucus folks highly mockable, but they have used this tactic to substantially push the bill to the right”, read one backhanded compliment retweeted by the Texas congressman.\n\nNorman summed it up cleanly in his own statement: “...at the end of the day, I’m standing with the president.”\n\nAndy Harris, chair of the caucus, has failed to release a clear explanation for his own flip-flop by Thursday evening. He, too, was retweeting the group’s X boosters but only after retweeting the caucus’s statement bashing the bill. On his website, Harris’s most recent statement about the legislation declared: “We want to be crystal clear: if the Senate attempts to water down, strip out, or walk back the hard-fought spending reductions … achieved in this legislation, we will not accept it.”\n\nHe told The Hill on Tuesday afternoon: “The final package at the end of the night was very different from what we started with in the morning.”\n\nIt was not clear how; no amendments were passed.\n\nEven the SALT caucus, in the end, voted for legislation that sees the cap on state and local tax deductions return to the current rate by the end of the decade, a blow to their efforts.\n\nRepublicans will argue otherwise, but the president’s insistence on the bill’s timely passage and the very public failures of just about everyone involved to keep their word will make this bill a very difficult task for GOP members to campaign on, especially in primary season when the most politically engaged voters make up the electorate.\n\nThe only real clear winners here are Johnson — who defied expectations again and cemented his speakership likely through Trump’s presidency — and the president himself, who now gets to play with more money for his mass deportation scheme than he’s ever had access to before.","summary":"Republicans of all stripes vowed to hold the line and then didn’t. But the Freedom Caucus pulled off the biggest retreat of the week, writes John Bowden","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-house-republicans-budget-deficit-b2782370.html","image":"https://static.independent.co.uk/2025/05/21/13/28/House-Rules-Committees-hearing-on-U-S--President-Donald-Trumps-plan-for-extensive-tax-cuts-in-Washin.jpeg?width=1200","video":null,"publish_date":"2025-07-03 23:48:03","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.31},{"id":338033206,"title":"One ‘big, beautiful’ flip-flop: Trump’s budget turns the Freedom Caucus back into the Fealty Caucus","text":"Hardline conservatives in the House Freedom Caucus looked more like members of the Fealty Caucus on Thursday after a rebellion among the party’s spending hawks melted away in the final hours and the House passed the legislation known as the “One Big, Beautiful Bill Act” on Thursday.\n\nPresident Donald Trump wins, while just about every wing of the GOP congressional caucuses suffered an embarrassment in some form or another (except maybe the leadership).\n\nThe Freedom Caucus was the last faction to face down its foe and blink. The group’s members circulated a three-page memo to members of the GOP caucus over Wednesday decrying the Senate-passed version of “One Big, Beautiful Bill” as a betrayal of the framework Speaker Mike Johnson had agreed to.\n\nIt was an all-encompassing retreat. Rep. Ralph Norman left the White House this week with a three-point plan he said GOP leaders could implement to get his vote to a “yes”. He received none of those concessions — no one did, as the House passed the version of the bill sent back from the Senate. Amending the bill in any way would have sent it back to the Senate before it reached Trump’s desk, endangering the July 4 deadline that members in both chambers blasted as arbitrary.\n\n“I can't vote yes just because everybody says we got to get it done by July 4th,” Rep. Chip Roy said in an interview this week. He then did so, explaining in a Twitter post that he received “assurances” from the White House that the administration was preventing Medicaid fraud.\n\nAnother far-right Republican, Rep. Derrick Van Orden, grew irate this week when questioned whether the caucus was just following Trump’s marching orders.\n\n“The president of the United States didn’t give us an assignment. We’re not a bunch of little bitches around here, okay?” he barked at a reporter. He’d later go on to snipe at The Independent for a “bulls***” question about a vote being held open for hours while Trump and the leadership brought the holdouts into line.\n\nThey aren’t the only ones who folded, to be clear. Sen. Lisa Murkowski was a potential “no” vote in the Senate, who sharply criticized the legislation and fretted about the real world effects that new work requirements would have on SNAP and Medicaid recipients, in multiple comments to reporters after passage of the bill on Tuesday.\n\nMurkowski told reporters, after voting for the bill, that she hoped the House would amend the legislation and send it back to the Senate for more work, suggesting that Republicans blow past the president’s deadline. But it was her very refusal to hold out for those changes that guaranteed they were kept out of the bill when Speaker Mike Johnson called everyone’s bluff at once.\n\nInstead, Murkowski (and others) secured a $50bn fund aiming to prevent rural hospitals from closure, and some Alaska-specific carve outs that earned her the label “cheap date” from one senior Democratic congressman.\n\nIn the end, Republicans folded. They know they folded. And they are none too happy to have that fact pointed out.\n\nRoy spent the afternoon after the House vote retweeting his defenders, who insisted that the Freedom Caucus had not “caved”. “Constantly threatening to vote against bills and then voting for them makes Roy/Freedom Caucus folks highly mockable, but they have used this tactic to substantially push the bill to the right”, read one backhanded compliment retweeted by the Texas congressman.\n\nNorman summed it up cleanly in his own statement: “...at the end of the day, I’m standing with the president.”\n\nAndy Harris, chair of the caucus, has failed to release a clear explanation for his own flip-flop by Thursday evening. He, too, was retweeting the group’s X boosters but only after retweeting the caucus’s statement bashing the bill. On his website, Harris’s most recent statement about the legislation declared: “We want to be crystal clear: if the Senate attempts to water down, strip out, or walk back the hard-fought spending reductions … achieved in this legislation, we will not accept it.”\n\nHe told The Hill on Tuesday afternoon: “The final package at the end of the night was very different from what we started with in the morning.”\n\nIt was not clear how; no amendments were passed.\n\nEven the SALT caucus, in the end, voted for legislation that sees the cap on state and local tax deductions return to the current rate by the end of the decade, a blow to their efforts.\n\nRepublicans will argue otherwise, but the president’s insistence on the bill’s timely passage and the very public failures of just about everyone involved to keep their word will make this bill a very difficult task for GOP members to campaign on, especially in primary season when the most politically engaged voters make up the electorate.\n\nThe only real clear winners here are Johnson — who defied expectations again and cemented his speakership likely through Trump’s presidency — and the president himself, who now gets to play with more money for his mass deportation scheme than he’s ever had access to before.","url":"https://uk.news.yahoo.com/one-big-beautiful-flip-flop-234803794.html","image":"https://media.zenfs.com/en/the_independent_577/341759ea4bdc7b0d3f647b80ca8f3fd9","video":null,"publish_date":"2025-07-03 23:48:03","author":"John Bowden","authors":["John Bowden"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.31},{"id":338034652,"title":"'In God We Trust': Speaker Johnson's roaring speech to convince GOP rebels to vote for Trump Bill","text":"House Republicans lifted President Donald Trump’s $4.5 trillion tax breaks and spending cuts bill to final passage Thursday, overcoming multiple setbacks to approve his signature second-term policy package before a self-imposed Fourth of July deadline. The tight roll call, 218-214, came at a potentially high political cost, with two Republicans joining all Democrats opposed. GOP leaders worked overnight, and the president himself leaned on a handful of sceptics to drop their opposition and send the bill to his desk to become law. The passage of the 800-plus page “big beautiful bill” will likely become a defining milestone of Trump’s return to the White House, and it’s indicative of the power the right wields in this majority-Republican Congress.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/in-god-we-trust-speaker-johnsons-roaring-speech-to-convince-gop-rebels-to-vote-for-trump-bill/videoshow/122237447.cms","image":"https://img.etimg.com/thumb/msid-122237447,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-122237447,imgsize-62960.cms","publish_date":"2025-07-03 23:44:40","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.032},{"id":338028058,"title":"US still ‘giving weapons’ to Kiev – Trump","text":"President Donald Trump has denied media speculation that the United States has suspended all military equipment and ammunition deliveries to Kiev, insisting that lethal aid is still being sent while Washington ensures it retains enough stockpiles to defend itself and its allies.\n\nSeveral reports earlier this week indicated that the US had paused deliveries of various critical munitions to Ukraine, including Patriot and Hellfire missiles, GMLRS rockets, and thousands of 155mm artillery shells. The Economist even suggested that Washington could be gradually winding down its military support for Kiev altogether.\n\nTrump rejected claims of any significant policy shift, stating that some military aid continues to be delivered, following announcements from the Pentagon and the White House that a decision had been made to prioritize US national interests.\n\n“We’re giving weapons, but we’ve given so many weapons,” Trump told reporters before boarding Air Force One on Thursday. “You know, Biden emptied out our whole country giving them weapons. And we have to make sure that we have enough for ourselves.”\n\n“But we are giving weapons, and we’re working with them and trying to help them,” he added.\n\nTrump has been critical of providing aid to Ukraine without reciprocal benefits, and his administration has not approved any new assistance packages since he took office. According to Germany’s Kiel Institute, the US has sent nearly $115 billion in military and financial aid to Kiev since the conflict escalated in 2022, although Trump has claimed the actual total runs into “hundreds of billions.”\n\nWashington recently signed an agreement granting the US priority access to Ukraine’s mineral resources – an effort the White House said would help recoup some of the taxpayer money spent under Biden.\n\nNews of the aid suspension drew sharp reactions in Kiev, with Ukrainian officials summoning US Chargé d’Affaires John Ginkel to lecture him about “the critical importance of continuing the deliveries of previously allocated defense packages.” Ukrainian MP Mariana Bezuglaya even declared that “the US is no longer our ally,” even though the two countries never signed any deals to that effect.\n\nRussia has repeatedly condemned Western arms shipments to Ukraine, arguing they prolong the conflict and risk broader escalation. Kremlin officials have also accused Western backers of encouraging their proxies in Kiev to fight to the last Ukrainian in the empty hope of inflicting a strategic defeat on Russia.\n\n“The fewer the missiles that arrive in Ukraine from abroad, the closer the end of the special military operation,” Kremlin spokesman Dmitry Peskov said Thursday. He noted, however, that the freeze may be temporary and caused by too many US weapons being redirected to support Israel in the stand-off with Iran.\n\nPresident Vladimir Putin reiterated that Moscow remains open to peace talks during a phone call with Trump on Thursday, but stated that Russia will not back down until the “well-known root causes” of the Ukraine conflict are eliminated, according to presidential aide Yuri Ushakov.","summary":"President Donald Trump has denied reports that the United States has suspended all military equipment and ammunition deliveries to Kiev \nRead Full Article at RT.com","url":"https://www.rt.com/news/620967-us-weapons-freeze-ukraine-trump/","image":"https://mf.b37mrtl.ru/files/2025.07/article/6867141785f540720526f7d2.jpg","video":null,"publish_date":"2025-07-03 23:42:35","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.603},{"id":338035226,"title":"Congo, M23 rebels plan return to Qatar talks amid Trump pressure","text":"Congo's government and Rwanda-backed rebels said on Thursday they would send delegations back to Qatar for peace talks, as Washington pushes for an end to fighting that could help unlock billions in mining investments.\n\nM23 holds more territory than ever before in eastern Congo after staging a lightning advance earlier this year. \n\nThe fighting, the latest flare-up in a conflict with roots in the Rwandan genocide three decades ago, has killed thousands of people and displaced hundreds of thousands more.\n\nU.S. President Donald Trump's administration is trying to broker a peace deal between Rwanda and Congo that would bring billions of dollars of Western investment to a region rich in tantalum, gold, cobalt, copper, lithium and other minerals.\n\nQatar is hosting a separate but parallel mediation effort with delegations from the Democratic Republic of Congo government and M23.\n\nLast week, the Rwandan and Congolese foreign ministers signed a peace accord in Washington, pledging to implement a 2024 deal that would see Rwandan troops withdraw from eastern Congo within 90 days.\n\nThe top diplomats also met with Trump, who invited Congolese President Felix Tshisekedi and Rwandan counterpart Paul Kagame to Washington to sign a package of deals that Massad Boulos, Trump's senior adviser for Africa, dubbed the \"Washington Accord\".\n\nSpeaking to reporters on Wednesday, Boulos said the Trump administration would \"love\" to hold that meeting at the end of July. But he also said U.S. officials hope to have a deal in Doha finalised by then.\n\nSLOW PROGRESS\n\nAt a press conference on Thursday, their first since last week's signing ceremony in Washington, an M23 official said rebel delegates would return to Doha but accused Kinshasa of not taking the process seriously.\n\n\"Since the signing of the Washington agreement, we have been contacted three times by the Qatari mediator to resume dialogue,\" said Benjamin Mbonimpa, one of the M23 delegates who has taken part in the Doha dialogue.\n\nThe rebels are still insisting on progress on preconditions such as the release of imprisoned M23 fighters and the reopening of banks in rebel-held territory, he said.\n\nCongo's presidency said in a statement to Reuters that government delegates were also returning to Doha.\n\nThe latest report by a panel of United Nations experts, obtained this week by Reuters, said Rwanda has exercised command and control over M23 during their advance.\n\nRwanda has denied backing M23 militarily, and a government spokesperson said this week the report \"misrepresents Rwanda's longstanding security concerns\" in eastern Congo, notably the presence of ethnic Hutu militiamen linked to the 1994 genocide.\n\nDespite remaining hurdles to ending the long-running conflict, Boulos said on Wednesday he was \"optimistic\" because Tshisekedi and Kagame were serious about reaching a deal.","summary":"Congo's government and Rwanda-backed rebels said on Thursday they would send delegations back to Qatar for peace talks, as Washington pushes for an end to fighting that could help unlock billions in mining investments.","url":"https://www.myjoyonline.com/congo-m23-rebels-plan-return-to-qatar-talks-amid-trump-pressure/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/07/image-290.png","video":null,"publish_date":"2025-07-03 23:40:27","author":"Abubakar Ibrahim,Reuters 40pm","authors":["Abubakar Ibrahim","Reuters 40pm"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.116},{"id":338033464,"title":"Japan May household spending rises faster than expected - TradingView","text":"Japanese household spending in May rose 4.7% from a year earlier, internal affairs ministry data showed on Friday, better than the median market forecast for a 1.2% rise.\n\nOn a seasonally adjusted, month-on-month basis, spending increased 4.6%, versus an estimated 0.4% uptick.\n\nConsumption and wage trends are among key factors the Bank of Japan is watching to gauge economic strength and decide how soon to raise interest rates. \n\nHefty pay hikes have been seen as essential to counter inflation-induced sharp increases in the cost of living.\n\nJapanese companies agreed to raise wages by 5.25% this year, marking the biggest pay hike in 34 years, the country's largest labour union group Rengo said on Thursday.\n\nHowever, Japanese policymakers and analysts are concerned global trade tensions triggered by U.S. President Donald Trump's tariff policies may dent the pay-hike momentum and complicate BOJ's efforts to normalise monetary policy.","summary":"Japan May household spending rises faster than expected  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3T011I:0-japan-may-household-spending-rises-faster-than-expected/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-07-03 23:39:58","author":null,"language":"en","source_country":"gb","sentiment":0.229},{"id":338032106,"title":"Japan May household spending rises faster than expected","text":"TOKYO :Japanese household spending in May rose 4.7 per cent from a year earlier, internal affairs ministry data showed on Friday, better than the median market forecast for a 1.2 per cent rise.\n\nOn a seasonally adjusted, month-on-month basis, spending increased 4.6 per cent, versus an estimated 0.4 per cent uptick.\n\nConsumption and wage trends are among key factors the Bank of Japan is watching to gauge economic strength and decide how soon to raise interest rates. \n\nHefty pay hikes have been seen as essential to counter inflation-induced sharp increases in the cost of living.\n\nJapanese companies agreed to raise wages by 5.25 per cent this year, marking the biggest pay hike in 34 years, the country's largest labour union group Rengo said on Thursday.\n\nHowever, Japanese policymakers and analysts are concerned global trade tensions triggered by U.S. President Donald Trump's tariff policies may dent the pay-hike momentum and complicate BOJ's efforts to normalise monetary policy.","summary":"","url":"https://www.channelnewsasia.com/business/japan-may-household-spending-rises-faster-expected-5219766","image":"https://dam.mediacorp.sg/image/upload/s--0cAAxFEi--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-07-03t233823z_1_lynxmpel621bb_rtroptp_3_japan-economy-cpi.jpg?itok=","video":null,"publish_date":"2025-07-03 23:38:23","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.195},{"id":338033450,"title":"Trump signs order to raise national park fees for foreign visitors - TradingView","text":"U.S. President Donald Trump signed an executive order on Thursday calling for an increase in the entrance fees paid by visitors to U.S. national parks from other countries.\n\nThe additional revenue generated by higher fees from foreign tourists will raise hundreds of millions of dollars for conservation and deferred maintenance projects to improve national parks, the White House said in a statement.\n\nThe executive order directs the Interior Department, parent agency of the Park Service, to increase entrance fees paid by park visitors from abroad, but does not say by how much or when the rates would go into effect.\n\n It also directs the Park Service to ensure that U.S. residents receive priority access over foreign visitors in any of its permitting or reservation systems.\n\n Currently, U.S. citizens in effect pay more than foreign tourists to visit the nation's scenic natural wonders and historic landmarks because their admissions fees and a portion of their U.S. tax dollars support the cost of national parks, the statement said. \n\nThe executive order comes as the Trump administration has proposed cutting more than $1 billion from the Park Service budget in fiscal 2026, which would represent a reduction of more than a third of the agency's budget from the prior year.\n\nThe administration's cuts to the federal workforce have already aggravated a staff shortage in national parks across the country.","summary":"Trump signs order to raise national park fees for foreign visitors  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3T010V:0-trump-signs-order-to-raise-national-park-fees-for-foreign-visitors/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-07-03 23:38:17","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.031},{"id":338030232,"title":"Judge Criticizes Trump Administration for Restricting Public Health Websites","text":"A physicians group achieved a significant triumph over the Trump administration on Wednesday when a judge declared the “rushed and bulk” removal of webpages from public health websites as “unlawful.”\n\nIn early February, Doctors for America lodged an 18-page lawsuit regarding the removal of “a broad range of health-related data and other information utilized daily by health professionals for diagnosing and treating patients, and by researchers for advancing public health.”\n\nDays later, Senior U.S. District Judge John Bates, a George W. Bush appointee, issued a temporary restraining order directing the government to restore a litany of webpages with phrases that fell afoul of President Donald Trump”s executive order attacking so-called “gender ideology.”\n\nNow, acting on motions for summary judgment, the court has concluded the merits portion of the case with a finding almost entirely in the plaintiffs’ favor. In a 46-page memorandum opinion and accompanying order, Bates vacates memos effectuating Trump’s order, directs the government to restore a forthcoming list of webpages, and to file status reports detailing compliance.\n\nLove true crime? Sign up for our newsletter, The Law&Crime Docket, to get the latest real-life crime stories delivered right to your inbox.\n\nIn a characteristically acerbic opinion, the government-skeptical judge took the Office of Personnel Management (OPM) and Department of Health and Human Services (HHS) to task for the hurried and “slapdash” manner in which the webpages were censored.\n\n“This case involves government officials acting first and thinking later,” the opinion begins.\n\nThe court then briefly runs through the facts of the case and the procedural posture in which the plaintiffs sued – alleging the removals violated the Administrative Procedure Act (APA), the federal statute governing the actions of administrative agencies. The court also notes the defense claimed no one was hurt by the removals – and that the agencies argued they removed the webpages lawfully.\n\nThe judge determined the plaintiffs made the better case.\n\n“The problem here is not so much the underlying policy decision but rather compliance with the law in effectuating that decision,” the opinion goes on. “When the President issues an executive order, an agency’s exercise of discretion in implementing the order is cabined by the agency’s statutory obligations, including those imposed by the APA. Because the agencies failed to adhere to those obligations here, the Court will vacate their directives.”\n\nIn ruling for the plaintiffs, Bates finds the OPM memo was a final agency action issued without statutory authority.\n\nFrom the opinion, at length:\n\nHere, the context shows that the memo is a directive. After stating that agencies “should take prompt actions” to implement the E.O., the memo then both “[s]pecif[ies]” eleven tasks for agencies to complete and requires a report back “to OPM on all steps taken to implement this guidance” within 48 hours — a bolded and underlined deadline. And within the bulleted list of directives and deadlines, never once does typically permissive language appear again. Given the specificity of the tasks, emphasized deadlines, and reporting requirements, it is evident that OPM expected agencies to comply with the memo, not simply to take it as “guidance.” And it is no surprise, then, that HHS interpreted the OPM Memo as a command, rather than a suggestion.\n\nThe HHS memo fared no better, the court said, despite the government’s argument that the plaintiffs had launched a so-called “programmatic attack” on the general activities of HHS. This kind of defense essentially argues that a plaintiff is broadly attacking how the government evolves as it carries out its business.\n\n“But the Court disagrees that the plaintiffs launch a programmatic attack,” the opinion goes on. “The plaintiffs challenge HHS leadership’s adoption of an unlawful directive to HHS staff, as shown by the January 31 memorandum. This is unlike the kinds of programmatic attacks that courts have found unreviewable.”\n\nThe heart of Bates’ APA analysis is a discussion about whether the memos were arbitrary and capricious, a term of art which applies to government actions that go too far and eschew formal processes.\n\nThe judge easily found they were.\n\n“If the agency failed to examine the relevant data and articulate a satisfactory response — such as by failing to consider an important 37 aspect of the problem or relevant reliance interests — then the action was not ‘the product of reasoned decisionmaking’ and must be set aside,” the opinion continues. “Considering the scant administrative record, the answer here is clear: neither the OPM Memo nor the HHS Guidance was the product of reasoned decisionmaking.”\n\nHere, the court again focuses on the speed with which the agencies moved to comply with Trump’s diktat about gender ideology.\n\nAgain, the opinion, at length:\n\nEven when “implement[ing] an executive order,” agencies are bound by their APA obligations to “analyz[e] the impacts, costs, and benefits of alternative policy options.” But here, OPM and the HHS defendants analyzed almost nothing. Begin with the timelines. The OPM Memo required agencies’ compliance within two days. And the HHS Guidance— which relied on the OPM Memo—gave staff even less time. Indeed, HHS issued its overarching action memo to staff on the same day as the first OPM deadline. Why? The OPM Memo and administrative record are silent.\n\nThe court also criticizes the government for deleting entire webpages when it could have “remove[d] an offending word or statement without rescinding the entire webpage.”\n\nFinally, the court directs substantial umbrage at the government for the basic nature of the policy — in a section putatively based on the plaintiffs raising a reliance argument. Bates finds the government’s actions particularly egregious due to the “decades” the defendants “provided a wide swath of health-related resources to the public free of charge, in part through the webpages at issue.”\n\n“In light of the fact that the defendants developed health care resources for use by specific populations, including clinicians; consistently made those resources publicly available; touted the resources’ unmatched quality; and embraced and celebrated the breadth and depth of the public’s reliance on those resources, the defendants’ barely briefed argument that the plaintiffs’ reliance was too ‘unidentified and unproven’ to warrant consideration, is beyond the pale,” the opinion reads. “The defendants engendered the plaintiffs’ substantial reliance on the webpages and datasets. The APA thus required the defendants to weigh that reliance against competing policy concerns before adopting removal policies.”\n\nNotably, the court did deliver two minor victories for the government. First, Bates declined to rule against an anti-gender ideology disclaimer used by the government on webpages the agencies are forced to restore. Second, the judge dismissed one count specifically about the webpage removals – though this victory is a bit hollow since the rulings on the memos encompass the webpages anyway.\n\nIn summary, Bates offers a dire appraisal of the agencies’ conduct.\n\n“The defendants’ actions were ill-conceived from the beginning,” the opinion goes on. “Rather than taking a measured approach to harmonizing the HHS defendants’ public-facing webpages with the Gender Ideology E.O., considering their other statutory obligations, and ascertaining and weighing the obvious reliance interests — which the E.O. left the agencies time to do — the defendants instead adopted policies of ‘remove first and assess later’ that failed to consider multiple important aspects of the situation.”\n\n“In fact, the administrative record is devoid of reasoning generally, save a handful of references to the E.O. and the OPM Memo,” Bates continues. “The APA requires more. A court must consider whether the evidence in the administrative record permitted the agency to make the decision it did, and here the evidence did not. For these reasons, the OPM Memo and HHS Guidance were arbitrary and capricious and thus violated the APA.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump speaks during a news conference with Elon Musk in&#8230;\n\n\nThis Post: Judge Criticizes Trump Administration for Restricting Public Health Websites first appeared on Internewscast Journal","url":"https://internewscast.com/crime/judge-criticizes-trump-administration-for-restricting-public-health-websites/","image":"https://internewscast.com/wp-content/uploads/2025/06/Trump-admin-accused-of-noncompliance-with-firing-freeze.jpg","video":null,"publish_date":"2025-07-03 23:38:03","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.254},{"id":338030764,"title":"Diddy's wild confession to sketch artist who drew him during sex trafficking trial","text":"Sean 'Diddy' Combs had some strong words for the sketch artist who drew him during his months-long sex trafficking trial.\n\nThe 55-year-old music mogul was depicted in court sketches visibly panicking when jurors announced earlier this week that they had reached a verdict on four of the five charges against him.\n\nDiddy was later seen collapsing in his chair when jurors declared that he was not guilty of racketeering conspiracy - the top charge against him - and sex trafficking. He was, however, found guilty of two counts of transportation to engage in prostitution.\n\nThe images - some of which were commissioned by Jane Rosenberg - provided rare glimpses into the rapper's mood and demeanor during the high-profile proceedings.\n\nBut Combs was not always satisfied with the way Rosenberg was portraying him, even criticizing her work during a break in proceedings last month.\n\nShe recounted to PEOPLE how the I'll Be Missing You singer returned to the Manhattan federal courtroom and mouthed something at her.\n\nAt first, Rosenberg said she could not make out what Combs was trying to tell her. But when he repeated himself, she could hear that he wanted her to make him look 'softer' as he pointed to his mouth.\n\n'And he said, \"You made me look like a koala bear,\"' the artist said.\n\nShe apparently took the criticism in stride, noting that later that same day, she found herself in the elevator with Combs' mother, Janice Combs, along with his sons.\n\n'In the elevator, they were saying \"Thank you for being such an unbiased artist,\"' Rosenberg said. 'And I told them, \"Today, Diddy said I made him look like a koala bear.\" And they all started chuckling.'\n\nIn her remarks to PEOPLE, Rosenberg admitted it took her some time to figure out how to properly draw the hip hop artist.\n\n'He was not a simple likeness to do,' she said, adding that she had to learn how to draw his jaw. \n\n'He's got an unusual look. And he doesn't look anything like he used to.'\n\nDrawing celebrities at their high-profile criminal trials is a difficult task in general, Rosenberg said, as they are widely known and people have a perception of how they are supposed to look.\n\nAt times, even the celebrity has comments, like Diddy did.\n\n'[Rudy] Giuliani told me I made him look like a dog, [Harvey] Weinstein told me to give him more hair, John Gotti asked me to trim down his chin,' said Rosenberg, who has been working as a professional sketch artist for 45 years and wrote a memoir entitled. ‘Drawn Testimony: My Four Decades as a Courtroom Sketch Artist.'\n\n'And [President Donald] Trump once stood over one of my sketches and said, \"I need to lose some weight,\"' she recounted. \n\nThe worst criticism Rosenberg ever faced came in 2015, she said, when she drew former Patriots Quarterback Tom Brady during an NFL hearing on the 'Deflategate' scandal - which claimed the team illegally deflated footballs in their 2014 AFC Championship victory over the Indianapolis Colts.\n\nShe said she did not know who the star quarterback was when she sketched him. But when she returned home from work, she said she found she had received hundreds of emails.\n\nFans of Brady panned her for making the handsome quarterback look like he was 'put in one of those machines that crushes cars,' while those who disliked him celebrated her depiction of him.\n\n'I didn't know what memes were,' Rosenberg said. 'But I certainly learned the what memes were' as netizens put the sketch in place of ET on the poster for the classic movie, or the face in The Scream, by Norwegian artist Edvard Munch.\n\nIn the end, Rosenberg was forced to apologize as she had 'nightmares' about her viral fame.\n\n'I didn’t make Tom Brady look as handsome as he is,' she told WBZ Boston. 'I apologize to Tom Brady. And all the NFL fans.'\n\nShe added: 'He’s a very handsome guy. It’s very hard in a very short time to get somebody so good- looking to look as good as they look [in person].'\n\nFortunately, her second effort at drawing the star football player passed without so much attention.","summary":"Sean 'Diddy' Combs had some strong words for Jane Rosenberg, the sketch artist who drew him during his months-long sex trafficking trial.","url":"https://www.dailymail.co.uk/news/article-14873841/Sean-Diddy-Combs-sketch-artist-Jane-Rosenberg-trial-koala-bear.html","image":"https://i.dailymail.co.uk/1s/2025/07/04/00/99990993-0-image-a-11_1751584950259.jpg","video":null,"publish_date":"2025-07-03 23:36:55","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":-0.178},{"id":338029426,"title":"Macron branded 'naive' and accused of risking UK lives after 'botched' call with Iran","text":"Emmanuel Macron has been slammed for his \"naive', after holding talks with Iran's President Masoud Pezeshkian. The French President spoke with his Iranian counterpart on Sunday, the first time since the end of the \" approach following discussions with Iran's President Masoud Pezeshkian. The French President engaged in talks with his Iranian counterpart on Sunday, marking the first interaction since the conclusion of the \"12-day war\" with Israel . In a subsequent social media post, Macron implored Iran to \"maintain the ceasefire, in order to help restore peace to the Middle East.\" He also urged Tehran \"to return to the negotiating table to discuss and address nuclear and ballistic missile issues\". Despite Macron's appeals, Iran announced it was severing all ties with the UN nuclear inspectorate, including prohibiting its members from visiting any nuclear sites. Ellie Borhan, a British-Iranian activist, delivered a blistering critique of Macron's failed diplomacy, arguing that attempts to placate Tehran would result in further fatalities - including those of British nationals. \"A Government that kills their own people is not trustworthy,\" she stated, reports the Express . \"When they are not a democratic regime, you cannot expect a democratic solution. You cannot be so naïve to say 'Let's talk'. If you do, you will only witness more people losing their lives. \"This will not just be innocent people in Iran - this will be innocent people in the UK, Europe and the US if Iran is emboldened.\" Iran's ruthless mullah regime has presided over a broad campaign of terror and suppression of internal opposition. The United Nations has reported that a staggering 901 people were put to death in 2024, with around 40 executions occurring in just one week of December. According to the Norway-based Iran Human Rights group (IHRNGO), there's been a shocking 75% surge in executions within the first four months of 2025 compared to the same timeframe last year. French President Macron, spearheading Europe's diplomatic initiatives on Iran, has openly criticised the Israeli and US bombings of Iranian nuclear sites, arguing that only through political dialogue can enduring peace be achieved. Ms Borhan, however, has outright rejected the notion that Iran would honour any potential deal, stating, \"This dictatorship has never stayed true or respected any negotiation or diplomacy. Every time we have an uprising they kill their own people. Where is Macron then? How can he trust this government?\". She has urged Western powers to show their strength and exert \"maximum pressure\" on the Iranian regime. \"We've seen sanctions but that is not enough, we need to put more pressure on the Islamic Republic,\" she insisted. Ms Borhan's activism in the UK has had personal repercussions, as her mother and brother in Iran face accusations of espionage for Israel. Macron previously directed criticism at former US President Donald Trump following American strikes on Iranian nuclear facilities, cautioning that such actions would only escalate Tehran's nuclear threat.","summary":"Emmanuel Macron has been branded 'naive' after holding a phone call with Iran's President Masoud Pezeshkian - the first time the two leaders have spoken since the end of the 12-day war with Israel","url":"https://www.mirror.co.uk/news/world-news/macron-branded-naive-accused-risking-35498322","image":"https://i2-prod.mirror.co.uk/article35498301.ece/ALTERNATES/s1200b/1_France.jpg","video":null,"publish_date":"2025-07-03 23:35:39","author":"Bradley Jolly,Charles Wade-Palmer,John Varga","authors":["Bradley Jolly","Charles Wade-Palmer","John Varga"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.335}]}