{"offset":0,"number":50,"available":11160,"news":[{"id":360520000,"title":"Britain 'looking at' Trump-endorsed plan to slap more tariffs on China in bid to end war in Ukraine","text":"Britain is open to Donald Trump's call to slap extra tariffs on China in a bid to end the war in Ukraine, the Business Secretary signalled yesterday.\n\nAhead of the US President's State visit to the UK this week, Peter Kyle said he was 'looking at ways' to support Kyiv 'assertively' and 'imaginatively'.\n\nIt comes after Mr Trump this weekend suggested Nato countries impose 50 to 100 per cent tariffs on China for buying Russian petroleum.\n\nThe US President said he was ready to impose sanctions on Moscow if all Nato countries stopped buying oil from Russia – and the transatlantic alliance also placed tariffs on China.\n\nMr Kyle said the UK was 'open to those conversations and we're looking at ways that we can support Ukraine very creatively, very assertively and very imaginatively in this time'.\n\nHe told Sky News: 'That means working with America. We have suggestions, America has suggestions. And I can tell you, having been there this week myself in the White House, in the West Wing, they are very constructive conversations.'\n\nTariff threats seem at odds with Labour's cosying up to China as it seeks investment for a flagging economy.\n\nThe Prime Minister is said to be looking at a trip to Beijing in the coming months, following on from visits by the likes of Rachel Reeves and David Lammy.\n\nHis comments came as Downing Street said the so-called 'special relationship' between Britain and the US would 'reach new heights' during President Trump's visit.\n\nThe political centrepiece is a technology deal that will involve US giants such as Nvidia and OpenAI agreeing to invest billions in the UK.\n\nThe deal was championed by former ambassador Peter Mandelson, who has urged Sir Keir Starmer to partner with the US tech industry. \n\nBehind the scenes, ministers and officials are scrambling to gloss over last week's dramatic sacking of Lord Mandelson, which is said to have caused irritation in both the White House and Buckingham Palace.\n\nA British delegation has been despatched to Washington to finalise preparations for the visit, which ministers hope will cement Sir Keir's unlikely bond with the President.\n\nAhead of his arrival, the UK and US have also signed a deal to make it quicker for companies to build nuclear power stations in both countries.\n\nIn a move that could halve the time it takes for nuclear projects to get a licence to two years, if a reactor has already passed rigorous safety checks in one country, they will be able to be used by the other to support its assessment.\n\nSir Keir said the 'major commitments' would set the UK 'well on course to a golden age of nuclear that will drive down household bills in the long run, while delivering thousands of good jobs in the short term'.","summary":"Ahead of the US President's State visit to the UK this week, Business Secretary Peter Kyle said he was 'looking at ways' to support Kyiv 'assertively' and 'imaginatively'.","url":"https://www.dailymail.co.uk/news/article-15098457/Britain-plan-tariffs-China-bid-end-war-Ukraine.html","image":"https://i.dailymail.co.uk/1s/2025/09/15/01/102134697-0-image-m-127_1757895354365.jpg","video":null,"publish_date":"2025-09-15 00:28:46","author":"Editor,Harriet Line,Jason Groves","authors":["Editor","Harriet Line","Jason Groves"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.089},{"id":360516206,"title":"China launches probes targeting US semiconductors ahead of Madrid trade talks","text":"China launched two probes targeting the U.S. semiconductor sector over the weekend ahead of talks between the two nations in Spain this week on trade, national security and the ownership of social media platform TikTok.\n\nChina’s Ministry of Commerce announced an anti-dumping investigation into certain analog IC chips imported from the U.S. The investigation will target some commodity interface IC chips and gate driver IC chips, which are commonly made by U.S. companies such as Texas Instruments and ON Semiconductor.\n\nThe ministry separately announced an anti-discrimination probe into U.S. measures against China’s chip sector.\n\nU.S. Treasury Secretary Scott Bessent is set to meet Chinese Vice Premier He Lifeng in Madrid between Sunday and Wednesday, He’s office said.\n\nU.S. measures such as export curbs and tariffs “constitute the containment and suppression of China’s development of high-tech industries” such as advanced computer chips and artificial intelligence, a Chinese commerce ministry spokesperson said.\n\nThe announcements of the probes follow the U.S. on Friday adding 23 Chinese companies to an “entity list” of businesses that will face restrictions for allegedly acting against U.S. national security and foreign policy interests. The list includes two Chinese companies accused of acquiring chipmaking equipment for major Chinese chipmaker SMIC.\n\nThe meetings between Bessent and He in Madrid will be the latest in a series of negotiations aimed at reducing trade tensions and postponing the enactment of higher tariffs on each other’s goods.\n\nU.S. and Chinese counterparts previously held discussions in Geneva in May, London in June and Stockholm in July. The two governments have agreed to several 90-day pauses on a series of increasing reciprocal tariffs, staving off an all-out trade war.\n\nBessent described the talks during the last round in Stockholm as “very fulsome.”\n\n“We just need to de-risk with certain, strategic industries, whether it’s the rare earths, semiconductors, medicines, and we talked about what we could do together to get into balance within the relationship,” Bessent said at the time.\n\nU.S. President Donald Trump and former President Joe Biden placed curbs on China’s access to advanced semiconductors including restrictions on the sale of chipmaking equipment to the country. While Washington cites national security concerns, China argues the curbs are part of a U.S. strategy to contain its growth. SIMINA MISTREANU, TAIPEI, MDT/AP","summary":"China launched two probes targeting the U.S. semiconductor sector over the weekend ahead of talks between the two nations in Spain this week on trade, national security and the ownership of social media platform TikTok. China’s Ministry of Commerce announced an anti-dumping investigation into certain analog IC chips imported from the U.S. The investigation will [&#8230;]\n\n\nThe post China launches probes targeting US semiconductors ahead of Madrid trade talks appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/china-launches-probes-targeting-us-semiconductors-ahead-of-madrid-trade-talks-2.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/09/AP25257137912286-1.webp?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-09-15 00:26:18","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":0.241},{"id":360516214,"title":"Trump threatens 50% to 100% tariffs on China","text":"President Donald Trump said yesterday [Macau time] he believes the Russia-Ukraine war would end if all NATO countries stopped buying oil from Russia and placed tariffs on China of 50% to 100% for its purchases of Russian petroleum.\n\nTrump posted on his social media site that NATO’S commitment to winning the war “has been far less than 100%” and the purchase of Russian oil by some members of the alliance is “shocking.” As if speaking with NATO members, he said: “It greatly weakens your negotiating position, and bargaining power, over Russia.”\n\nSince 2023, NATO member Turkey has been the third largest buyer of Russian oil, after China and India. according to the Centre for Research on Energy and Clean Air. Other members of the 32-state alliance involved in purchasing Russian oil include Hungary and Slovakia. It’s unclear whether Trump would want to directly confront Turkish President Recep Tayyip Erdogan or Hungarian Prime Minister Viktor Orbán. That leaves uncertain whether the threats might actually lead to new tariffs or a ban on Russian oil purchases.\n\nTrump’s post arrives after the Wednesday flight of multiple Russian drones into Poland, an escalatory move by Russia as it was entering the airspace of a NATO ally. Poland shot down the drones, yet Trump played down the severity of the incursion and Russia’s motives by saying it “could have been a mistake.”\n\nU.S. Secretary of State Marco Rubio said Saturday that the drone incursion was “unacceptable and unfortunate and dangerous” as he judged NATO’s response so far to be appropriate. Still, Rubio said it was unclear if the drones were intentionally sent to Poland.\n\n“The question is whether the drones were targeted to go into Poland specifically,” Rubio said. “If that’s the case, that the evidence leads us there, then obviously that would be a highly escalatory move.”\n\nWhile Trump as a candidate promised to end the war quickly, he has yet to hit the pressure points needed to end the violence and has at times been seen as reluctant to confront Russian President Vladimir Putin. Congress is currently trying to get the U.S. president to back a bill toughening sanctions, after Trump last month hosted Putin in Alaska for talks that failed to deliver on progress toward peace.\n\nThe U.S. and its allies are seeking to show a firmer degree of resolve against Russia. At an emergency U.N. Security Council meeting Friday, acting U.S. Ambassador Dorothy Shea said America “will defend every inch of NATO territory” and that the drones entering Poland “intentionally or otherwise show immense disrespect for good-faith U.S. efforts to bring an end to this conflict.”\n\nBritain on Friday also took steps to penalize the trading of Russian oil, including a ban on 70 vessels allegedly used in its transportation. The United Kingdom also sanctioned 30 individuals and companies, included businesses based in China and Turkey, that have supplied Russia with electronics, chemicals, explosives and other weapons components.\n\nTrump in his post Saturday said a NATO ban on Russian oil plus tariffs on China would “also be of great help in ENDING this deadly, but RIDICULOUS, WAR.”\n\nThe president said that NATO members should put the 50% to 100% tariffs on China and withdraw them if the war that launched with Russia’s 2022 invasion of Ukraine ends.\n\n“China has a strong control, and even grip, over Russia,” he posted, and powerful tariffs “will break that grip.”\n\nThe U.S. president has already imposed a 25% import tax on goods from India, specifically for its buying of Russian energy products. He has placed in total a 50% tariff on India, though Trump has indicated that negotiations with Indian Prime Minister Narendra Modi could help settle differences.\n\nThe prospect of further import tax hikes on China and its retaliation could carry collateral damage for the U.S. and European economies.\n\nEarlier this year, Trump hit Chinese goods with new tariffs totaling 145%, prompting China to respond with 125% import taxes on American goods. Taxes at that level were essentially a blockade on commerce between the world’s two largest economies, causing worries about global growth that led to negotiations that ratcheted down the tariffs being levied by both nations.\n\nSo that trade talks could proceed, America lowered its tariffs against China to a still-high 30%, while China took its rate to 10%.\n\nIn his post, the Republican president said responsibility for the war fell on his predecessor, Democrat Joe Biden, and Ukrainian President Volodymyr Zelenskyy. He did not include in that list Putin, who launched the invasion. MDT/AP","summary":"President Donald Trump said yesterday [Macau time] he believes the Russia-Ukraine war would end if all NATO countries stopped buying oil from Russia and placed tariffs on China of 50% to 100% for its purchases of Russian petroleum. Trump posted on his social media site that NATO’S commitment to winning the war “has been far [&#8230;]\n\n\nThe post Trump threatens 50% to 100% tariffs on China appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/trump-threatens-50-to-100-tariffs-on-china.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/09/AP25254532747776.webp?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-09-15 00:24:22","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.198},{"id":360519548,"title":"Stephen Colbert Brings Headshot and Resumé with Him to Present at Emmys 2025: 'Is Anybody Hiring?'","text":"Stephen Colbert is speaking out nearly two months after The Late Show with Stephen Colbert was canceled.\n\n The late night host, 61, addressed the end of his popular show at the Emmy Awards 2025 on Sept. 14, after he was welcomed onstage to present the award for Outstanding Actor in a Comedy Series with a standing ovation by the crowd.\n\n \"While I have your attention, is anyone hiring? Because I've got 200 very well-qualified candidates with me here tonight who will be available in June,\" Colbert said right off the bat, earning himself another standing ovation.\n\n He then pulled out a piece of paper and joked that he \"brought my own resumé here\" in order to campaign for his next job after The Late Show ends in June.\n\n \"I haven't had a chance to update my headshot in a bit, but I think it still works,\" he said as he held up a photo of his teenage self. \"I'm in there somewhere — after I get back from Istanbul, I'm sure.\"\n\n Colbert then joked that he only has one copy of his resumé, before running it over to Harrison Ford.\n\n \"Could you get this to [Steven] Spielberg? Would you?\" he asked, and Ford, 83 — a first-time nominee — enthusiastically took the paper from Colbert. The comedian then ran back to the stage and did a fingers-crossed motion before announcing the nominees.\n\n Colbert’s comments come after he announced in July that The Late Show with Stephen Colbert would be ending after 10 seasons \n\n \"Before we start the show, I want you to know something that I found out just last night,\" said Colbert revealed on the July 17 episode of The Late Show. \"Next year will be our last season. The network will be ending the Late Show in May.\"\n\n CBS addressed the cancellation in a statement with PEOPLE at time, the network said, \"This is purely a financial decision against a challenging backdrop in late night. It is not related in any way to the show’s performance, content or other matters happening at Paramount.\"\n\n The announcement was made shortly after the television host blasted Paramount, the parent company of CBS, during the July 14 episode for its $16 million settlement with President Donald Trump on July 3.\n\n The settlement occurred while Paramount was in the midst of a merger with the entertainment company Skydance, a business move that required approval from Trump's administration. That merger was completed on Aug. 7.\n\n In the aftermath of the cancellation, the late night hosts have supported Colbert.\n\n Jon Stewart fired back at Paramount over the cancellation on the July 21 episode of The Daily Show.\n\n “I understand the corporate fear,\" he shared. \"I understand the fear that you and your advertisers have with $8 billion at stake, but understand this, truly, the shows that you now seek to cancel, censor and control, a not insignificant portion of that $8 billion value came from those f------ shows. That’s what made you that money.\"\n\n The host also spoke the role politics plays in late night television, adding, “Shows that say something, shows that take a stand, shows that are unafraid. “Believe me, this is not a ‘We speak truth to power’. We don’t; we speak opinions to television cameras, but we try. We f------ try every night. If you believe as corporations or as networks, you can make yourselves so innocuous that you can serve a gruel so flavorless that you will never again be on the boy king’s radar, [firstly] why will anyone watch you and you are f------ wrong.”\n\n Jimmy Kimmel posted on his Instagram Story, sharing, \"Love you Stephen. F--- you and all your Sheldons CBS.\" He also put up a billboard ad in L.A. to encourage Emmy voters to vote for Colbert in the Outstanding Talk Series category.\n\n Stewart, The Tonight Show's Jimmy Fallon, Late Night's Seth Meyers, and Last Week Tonight's John Oliver all made unannounced cameos on The Late Show following the news in support of Colbert.\n\n However, Trump repeatedly attacked the most prominent late-night hosts while also celebrating Late Show With Stephen Colbert coming to an end.\n\n Trump posted on his Truth Social platform that high-profile terminations were coming at ABC and NBC, which led to confusion about whether Trump has any influence on major network decisions.\n\n \"The word is, and it’s a strong word at that, Jimmy Kimmel is NEXT to go in the untalented Late Night Sweepstakes and, shortly thereafter, [Jimmy] Fallon will be gone,\" Trump, 79, claimed in the post.\n\n \"These are people with absolutely NO TALENT, who were paid Millions of Dollars for, in all cases, destroying what used to be GREAT Television,\" the president continued. \"It’s really good to see them go, and I hope I played a major part in it!\"\n\n On the Sept. 2 of his late night show, Kimmel took aim at the President, from his viral health rumors to his controversial White House renovations, in an unfiltered monologue.\n\n The host responded directly to Trump's threats that Jimmy Kimmel Live would be the next late-night show to be canceled.\n\n \"Oh, you delicate, chubby little teacup,\" Kimmel said. \"Did we hurt your feelings? You want us to be canceled because we make jokes about you?\"\n\n \"I thought you were against cancel culture?\" he continued. \"I thought that was, like, their whole thing? When did you become so woke?\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \n\n See PEOPLE's full coverage of the 77th annual Primetime Emmy Awards as they're broadcasting live on CBS and Paramount+ from the Peacock Theater in Los Angeles.","summary":"The comedian's hilarious bit came following the July announcement that 'The Late Show with Stephen Colbert' would be coming to an end after 10 seasons","url":"https://people.com/stephen-colbert-brings-headshot-and-resume-with-him-to-present-at-emmys-2025-11808627","image":"https://people.com/thmb/wnv-UvoSSupsgytlRhA3wPnVsc8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(758x236:760x238)/stephen-colbert-headshot-emmys-2025-091425-79970970bd6b43559f88d4b1f8a3399d.jpg","video":null,"publish_date":"2025-09-15 00:22:42","author":"Stephanie Wenger","authors":["Stephanie Wenger"],"language":"en","source_country":"US","sentiment":-0.06},{"id":360520054,"title":"Chicago area residents mourn immigrant fatally shot by ICE agent during arrest attempt - Reuters","text":"SummaryMourners gathered on Saturday in Chicago suburb where ICE officer shot manICE said Silverio Villegas-Gonzalez resisted arrestIncident sparks fears among Chicago's Latino communityMexican Independence Day celebrations move ahead\n\nFRANKLIN PARK, Illinois, Sept 14 (Reuters) - Rudy Repa, a 27-year-old resident of Franklin Park, Illinois, placed a single marigold at a makeshift memorial near the spot where a U.S. Immigration and Customs Enforcement officer fatally shot a man from Mexico during an attempted arrest in the Chicago suburb.\n\nThe U.S. Department of Homeland Security said an officer shot Silverio Villegas-Gonzalez, 38, during a traffic stop on Friday in Franklin Park. In a statement, the agency said Villegas-Gonzalez was in the country illegally and had attempted to flee in his car, dragging and injuring the officer.\n\nAdvertisement · Scroll to continue\n\nAn ICE spokesperson said the agent, who they did not name, had been released from the hospital after suffering back injuries, lacerations to the hand, and knee tears.\n\nThe death of Villegas-Gonzalez has angered community members like Repa and heightened safety fears among the region's Latino residents.\n\nOn Saturday, about 100 people, including Repa, turned out for a vigil for Villegas-Gonzalez in Franklin Park, a community in which around half of the residents are Hispanic or Latino.\n\n\"I'm incredibly mad and I want justice for our community,\" said Repa.\n\nDHS on September 8 launched a deportation crackdown in Illinois that it said was targeting criminals among immigrants in the U.S. without legal status. The department said the operation was necessary because of city and state \"sanctuary\" laws that limit cooperation with federal immigration authorities.\n\nAdvertisement · Scroll to continue\n\nIllinois Governor J.B. Pritzker and Chicago Mayor Brandon Johnson have called for an accounting of the incident involving Villegas-Gonzalez. On Saturday, Johnson said on X it was an \"avoidable tragedy.\"\n\nU.S. Representative Delia Ramirez said at a press conference Villegas-Gonzalez was shot immediately after dropping off his children at a nearby school.\n\nICE declined to provide more details on the incident over the weekend. It referred to a press release that said Villegas-Gonzalez had a history of reckless driving and the ICE agent fired his weapon because he feared for his life.\n\nAlexandra Calleja, 34, teared up as she spoke at Saturday's vigil about the killing.\n\n\"I think he might have gotten scared,\" she said. \"He might have wanted to leave because it crossed his mind that, 'If I get taken away I'll never see my kids again'.\"\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV2036300756 \nAbout ConnatixV2036300756 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nMany residents attending the vigil on Saturday were also immigrants, born in places like Guatemala and Chile.\n\nPritzker said last month he thought President Donald Trump's administration was timing ICE operations to coincide with celebrations for Mexican Independence Day, which falls on September 16 and is a major event in Chicago's large Mexican-American community.\n\nA large Mexican Independence Day parade in Chicago's Little Village neighborhood on Sunday still drew thousands of attendees to enjoy music, singing and dancing. There were anti-ICE signs along the route and volunteers on the lookout for federal agents.\n\nMarco Villalobos, 46, who was part of the parade, said he did not bring his three children because he worried ICE agents might be there.\n\n\"It's a terrible thing; they're trying to hunt people down,\" he said of Villegas-Gonzalez's death.\n\nReporting by Renee Hickman and Heather Schlitz in Chicago; Editing by Chris Reese\n\nPurchase Licensing Rights\n\nHeather SchlitzThomson ReutersChicago-based reporter covering commodity markets and agriculture.","summary":"Chicago area residents mourn immigrant fatally shot by ICE agent during arrest attempt  Reuters","url":"https://www.reuters.com/world/us/chicago-area-residents-mourn-immigrant-fatally-shot-by-ice-agent-during-arrest-2025-09-14/","image":"https://www.reuters.com/resizer/v2/EJCZO7W33FPKDFS5BFV4U7PAIM.jpg?auth=3706e5d22aa0f87b551a93bd37c27b36cd98edadae0d73fd051f0ab9f4a2525f&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-09-15 00:19:00","author":"Heather Schlitz,Renee Hickman","authors":["Heather Schlitz","Renee Hickman"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.647},{"id":360516208,"title":"Families in crisis after massive immigration raid at Hyundai plant in Georgia","text":"Ever since a massive immigration raid on a Hyundai manufacturing site swept up nearly 500 workers in southeast Georgia, Rosie Harrison said her organization’s phones have been ringing nonstop with panicked families in need of help.\n\n“We have individuals returning calls every day, but the list doesn’t end,” Harrison said. She runs an apolitical non-profit called Grow Initiative that connects low-income families — immigrant and non-immigrant alike — with food, housing and educational resources.\n\nSince the raid, Harrison said, “families are experiencing a new level of crisis.”\n\nA majority of the 475 people who were detained in the workplace raid — which U.S. officials have called the largest in two decades — were Korean and have returned to South Korea. But lawyers and social workers say many of the non-Korean immigrants ensnared in the crackdown remain in legal limbo or are otherwise unaccounted for.\n\nAs the raid began the morning of Sept. 4, workers almost immediately started calling Migrant Equity Southeast, a local nonprofit that connects immigrants with legal and financial resources. The small organization of approximately 15 employees fielded calls regarding people from Mexico, Guatemala, Colombia, Chile, Ecuador and Venezuela, spokesperson Vanessa Contreras said.\n\nThroughout the day, people described federal agents taking cellphones from workers and putting them in long lines, Contreras said. Some workers hid for hours to avoid capture, in air ducts or remote areas of the sprawling property. The Department of Justice said some hid in a nearby sewage pond.\n\nPeople off-site called the organization frantically seeking the whereabouts of loved ones who worked at the plant and were suddenly unreachable.\n\nLike many of the Koreans who were working at the plant, advocates and lawyers representing the non-Korean workers caught up in the raid say that some who were detained had legal authorization to work in the United States.\n\nNeither the Department of Homeland Security nor Immigration and Customs Enforcement responded to emailed requests for comment Friday. It is not clear how many people detained during the raid remain in custody.\n\nAtlanta-based attorney Charles Kuck, who represents both Korean and non-Korean workers who were detained, said two of his clients were legally working under the Deferred Action for Childhood Arrivals program, which was created by former President Barack Obama. One had been released and “should have never been arrested,” he said, while the other was still being held because he was recently charged with driving under the influence.\n\nAnother of Kuck’s clients was in the process of seeking asylum, he said, and had the same documents and job as her husband who was not arrested.\n\nSome even had valid Georgia driver’s licenses, which aren’t available to people in the country illegally, said Rosario Palacios, who has been assisting Migrant Equity Southeast. Some families who called the organization were left without access to transportation because the person who had been detained was the only one who could drive.\n\n“It’s hard to say how they chose who they were going to release and who they were going to take into custody,” Palacios said, adding that some who were arrested didn’t have an alien identification number and were still unaccounted for.\n\nKuck said the raid is an indication of how far-reaching the crackdown by President Donald Trump’s administration is, despite assurances that they are targeting criminals.\n\n“The redefinition of the word ‘criminal’ to include everybody who is not a citizen, and even some that are, is the problem here,” Kuck said. MDT/AP","summary":"Ever since a massive immigration raid on a Hyundai manufacturing site swept up nearly 500 workers in southeast Georgia, Rosie Harrison said her organization’s phones have been ringing nonstop with panicked families in need of help. “We have individuals returning calls every day, but the list doesn’t end,” Harrison said. She runs an apolitical non-profit [&#8230;]\n\n\nThe post Families in crisis after massive immigration raid at Hyundai plant in Georgia appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/families-in-crisis-after-massive-immigration-raid-at-hyundai-plant-in-georgia.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/09/AP25249755386170.webp?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-09-15 00:18:44","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.297},{"id":360516210,"title":"Trump’s travel ban keeps applicants from coming to the US for college","text":"With the Taliban barring women from college in her native Afghanistan, Bahara Saghari set her sights on pursuing higher education in the United States.\n\nSaghari, 21, practiced English up to eight hours per day for several years, eventually winning an offer to study business administration at a private liberal arts college in Illinois. She was hoping to arrive this fall, but her plans were derailed again, this time by President Donald Trump’s travel ban.\n\n“You think that finally you are going to your dream, and then something came up and like, everything’s just gone,” Saghari said.\n\nThousands of students are among the people affected by the Trump administration’s travel ban and restrictions on citizens from 19 countries, including many who now feel stranded after investing considerable time and money to come to the U.S.\n\nSome would-be international students are not showing up on American campuses this fall despite offers of admission because of logjams with visa applications, which the Trump administration slowed this summer while it rolled out additional vetting. Others have had second thoughts because of the administration’s wider immigration crackdown and the abrupt termination of some students’ legal status.\n\nBut none face bigger obstacles than the students hit with travel bans. Last year, the State Department issued more than 5,700 F-1 and J-1 visas — which are used by foreign students and researchers — to people in the 19 travel ban-affected countries between May and September. Citizens of Iran and Myanmar were issued more than half of the approved visas.\n\nThe US is still the first choice for many\n\nPouya Karami, a 17-year-old student from Shiraz, Iran, focused his college search entirely on the U.S. No other country offers the same research opportunities in science, he said. He was planning to study polymer chemistry this fall at Pittsburg State University in Kansas, but he had to shelve those plans because of the travel ban.\n\nKarami deferred admission until next year and is holding out hope. He is still preparing for his embassy interview and reaching out to U.S. politicians to reconsider the travel ban’s restrictions on students.\n\n“I’m doing everything I can about it,” he said.\n\nThe full travel ban affects citizens from 12 countries spanning Africa, Asia, the Middle East and the Caribbean. It blocks most people from obtaining new visas, although some citizens from the banned countries are exempt, such as green card holders, dual citizens and some athletes. Seven other countries have tighter restrictions that also apply to student visas.\n\nWhen Trump announced the travel ban in June, he cited high visa overstay rates and national security threats from unstable or adversarial foreign governments as reasons for putting countries on the list. He has called some of the countries’ screening processes “deficient” and said he plans to keep the ban in place until “identified inadequacies” are addressed.\n\nHopes of extended families ride on students\n\nIn Myanmar, the family of one 18-year-old student made his education their top priority, saving paychecks for him to go abroad for college. They risked their stability so he could have the chance to live a better life, said the student, who asked to be identified by only his nickname, Gu Gu, because he is worried about being targeted by the Myanmar or U.S. government for expressing criticism.\n\nWhen he shared a screenshot of his acceptance letter to the University of South Florida in a family group chat, it exploded with celebratory emojis, Gu Gu said. He had been waiting for visa appointments to be announced when one night, his mother woke him to ask about news of a U.S. travel ban. In an instant, his plans to study at USF this fall were ruined.\n\nMany students his age in Myanmar have been drafted into the military or joined resistance groups since the military ousted the elected civilian government in 2021. While a civil war rages, he had been looking forward to simple freedoms in the U.S. like walking to school by himself or playing sports again.\n\n“I was all in for U.S., so this kind of breaks my heart,” said Gu Gu, who was unable to defer his acceptance.\n\nStudents are looking elsewhere\n\nSaghari, the Afghani student, postponed her July visa interview appointment in Pakistan to August after learning of the travel ban, but ultimately canceled it. Knox College denied her request to defer her admission.\n\nShe later applied to schools in Europe but encountered issues with the admissions process. A German university told Saghari she would need to take another English proficiency test because an earlier score had expired, but taking the test the first time was already a challenge in Afghanistan’s political climate.\n\nShe has been accepted to a Polish university on the condition she pay her tuition up front. She said her application is under review as the school validates her high school degree.\n\nAmir, a 28-year-old Iranian graduate who declined to provide his last name for fear of being targeted, wasn’t able to travel to the U.S. to take a position as a visiting scholar. Instead, he has continued to work as a researcher in Tehran, saying it was difficult to focus after missing out on a fully funded opportunity to conduct research at the University of Pennsylvania.\n\nHis professor at Penn postponed his research appointment until next year, but Amir said it feels like “a shot in the dark.”\n\nHe’s been looking at research opportunities in Europe, which would require more time spent on applications and potentially learning a new language. He still would prefer to be in U.S., he said, but he isn’t optimistic that the country’s foreign policy is going to change.\n\n“You lose this idealistic view of the world. Like you think, if I work hard, if I’m talented, if I contribute, I have a place somewhere else, basically somewhere you want to be,” he said. “And then you learn that, no, maybe people don’t want you there. That’s kind of hard to deal with it.” MAKIYA SEMINERA, MDT/AP","summary":"With the Taliban barring women from college in her native Afghanistan, Bahara Saghari set her sights on pursuing higher education in the United States. Saghari, 21, practiced English up to eight hours per day for several years, eventually winning an offer to study business administration at a private liberal arts college in Illinois. She was [&#8230;]\n\n\nThe post Trump’s travel ban keeps applicants from coming to the US for college appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/trumps-travel-ban-keeps-applicants-from-coming-to-the-us-for-college.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2025/09/AP25251606084077.webp?resize=150%2C150&ssl=1","video":null,"publish_date":"2025-09-15 00:16:42","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.13},{"id":360517796,"title":"Kirk shooting suspect not co-operating with authorities","text":"The man arrested in the killing of right-wing activist Charlie Kirk is not co-operating with authorities, but investigators are working to establish a motive for the shooting by talking to his friends and family, Utah Governor Spencer Cox says.\n\nCox said accused gunman Tyler Robinson, 22, would be formally charged on Tuesday. He remains in custody in Utah.\n\nInvestigators are yet to piece together why Robinson allegedly scaled a rooftop at Utah Valley University during an outdoor event and shot Kirk in the neck at long range on Wednesday.\n\nKirk, a staunch ally of President Donald Trump and co-founder of the conservative student group Turning Point USA, was killed by a single rifle shot during the event attended by 3000 people in Orem, about 65km south of Salt Lake City.\n\nThe killing ushered in newfound fears of a spike in political violence in the United States and an ever-deepening divide between the left and the right.\n\nRobinson has not confessed to investigators, Cox told the ABC program This Week.\n\n\"He is not co-operating, but all the people around him were co-operating, and I think that's very important,\" the Republican governor said.\n\nOne person who is apparently talking to investigators is Robinson's roommate, who was also a romantic partner, Cox said, citing the FBI. Cox described the roommate as \"a male transitioning to female\" and said the roommate has been \"incredibly co-operative\".\n\nReuters has not been able to locate the roommate, or representatives for the roommate, to seek comment. Reuters could not determine who is serving as Robinson's legal representative.\n\nAsked on CNN's State of the Union program whether the roommate's gender identity is relevant to the investigation, Cox said that is what they are trying to figure out.\n\nInvestigators found messages engraved into four bullet casings, which included references to memes and video game in-jokes.\n\nOne of the inscriptions, according to an affidavit filed by authorities, read: \"hey fascist! CATCH!\" followed by a combination of directional arrows, an apparent reference to a sequence of button presses that unleashes a bomb in a popular video game.\n\nAnother casing, according to the affidavit, read, \"If you read This, you are GAY Lmao,\" short for \"laughing my ass off\".\n\nKirk's charged rhetoric, which often involved anti-LGBTQI and anti-immigrant comments, attracted legions of conservatives but also engendered strong feelings from liberals and drew widespread criticism.\n\nRobinson, a third-year student in the electrical apprenticeship program at Dixie Technical College, part of Utah's public university system, was taken into custody at his parents' house, about 420km southwest of the crime scene after a 33-hour manhunt.\n\nRelatives and a family friend alerted authorities that he had implicated himself in the crime, Cox said previously.\n\nWhile Robinson was raised by religious parents in a deeply conservative region of the state \"his ideology was very different than his family\", Cox said on Sunday on NBC's Meet the Press program, without going into specifics.\n\nState records show Robinson was a registered voter but not affiliated with any political party. A relative told investigators that Robinson had grown more political in recent years and had once discussed with another family member their dislike for Kirk and his viewpoints, according to the arrest warrant affidavit.\n\nRobinson was \"not a fan\" of Kirk's, Cox said on Sunday.\n\nThe killing has stirred outrage among Kirk's supporters and condemnation of political violence from some across the ideological spectrum.\n\nMany Republicans, including Trump, have been quick to lash out at the political left, accusing liberals of fomenting anti-conservative vitriol that would encourage violence - even as the president and his allies have often invoked violent imagery against their opponents.\n\n\"The problem is on the left,\" Trump told reporters on Sunday. \"A lot of people that you would traditionally say are on the left ... (are) already under investigation.\"\n\nMike Johnson, the Republican speaker of the US House of Representatives, criticised Democrats but also urged calm.\n\n\"There's this recognition that people have got to stop framing simple policy disagreements in terms of existential threats to our democracy,\" he said on the Fox News Sunday program.\n\nOn Meet the Press, Cox assigned some blame to social media, saying it has \"played a direct role in every single assassination and assassination attempt that we have seen over the last five, six years\".\n\nTrump has credited Kirk with driving young voters to conservatism. His Turning Point movement says it has more than 800 chapters across college campuses. Kirk's widow on Friday said the movement's efforts would go forward.\n\nA memorial event for Kirk will be held on September 21 in Glendale, Arizona, his organisation said.","summary":"Investigators continue working to establish a motive for the killing of conservative Charlie Kirk as the suspect refuses to co-operate with authorities.","url":"https://thewest.com.au/news/crime/kirk-shooting-suspect-not-co-operating-with-authorities-c-20021836","image":"https://images.thewest.com.au/publication/C-20021836/4af10af59026989a2d3b7a9b6ce46fb57436c3c2-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-09-15 00:14:48","author":"James Oliphant","authors":["James Oliphant"],"language":"en","source_country":"au","sentiment":-0.075},{"id":360516850,"title":"The budget, bail and other bills: Five things to watch for as Parliament returns","text":"Members of Parliament are gearing up for their return to the House of Commons in what's expected to be a busy fall.\n\nHere is a look at some of the things to watch for as Parliament gets underway this week.\n\nThe Liberal government took some heat in the spring when it decided to delay the introduction of the federal budget, which is typically done in March or April, until this fall.\n\nFinance Minister François-Philippe Champagne said his fiscal plan is set to be released in October.\n\nThat's when Canadians will learn how big the deficit is, how much more is being spent on national defence, and how much is being cut from government departments and agencies that have been told they need to slash spending.\n\nThe last time the federal government gave a fiscal update was in December, when it said the 2025-26 deficit had grown to $42.2 billion. The Liberal election platform suggested adding its new spending promises and the impact of U.S. tariffs would push that to $60 billion.\n\nPrime Minister Mark Carney said Sunday that the deficit recorded in the budget will be bigger than it was last year, though he did not offer a specific number.\n\nCarney has also said his version of the budget will also look different: he plans to split the document into capital spending and operational spending, with a pledge to balance the operational side within three years.\n\nDeal or no deal? \n\nCarney is most certainly going to be pressed in the House of Commons on his inability to get a deal with the United States on trade and tariffs.\n\nThe summer came and went with no apparent movement despite deadlines set by both sides.\n\nU.S. President Donald Trump's trade war has plunged Canada into a recession, according to a July report from Oxford Economics, and many experts believe the effects are just beginning to be felt.\n\nCarney likes to remind the nation that \"Canada has the best deal of any U.S. trading partner,\" but the steel, aluminum, softwood lumber and auto industries are being hit hard.\n\nCarney and Trump are in close contact, the Prime Minister's Office says, and most recently Canada agreed to remove a set of counter-tariffs that had been in place since March to help those talks along.\n\nOn top of that, recent expansions of the trade dispute with China have both canola farmers in the Prairies and lobster fishers on the East Coast worried for the future.\n\nCarney's parliamentary secretary, Kody Blois, recently travelled to China with Saskatchewan Premier Scott Moe.\n\nPoilievre vs. Carney\n\nConservative MPs will be happy to see their leader, Pierre Poilievre, return to his seat in the House of Commons for the first time in 2025.\n\nAfter losing his seat in Carleton in the April election, the Tory leader donned a cowboy hat and spent his summer on the hustings in rural Alberta, where he swept to a convincing victory in a byelection in Battle River—Crowfoot.\n\nWith that settled, expect a return to form for the Opposition leader when he takes the floor for his first question period opposite Carney.\n\nThe matchup was hotly anticipated among politicos back in April, when the pair squared off for a pair of debates in both official languages, but anyone hoping for a knockout punch from the typically feisty Tory leader was met instead with a mostly reserved performance.\n\nPoilievre has pledged that the Conservatives are bringing a new spirit of co-operation to the Hill, and has said his party will support changes that improve the status quo while proposing solutions of their own.\n\nDuelling bail bills\n\nThe Conservatives have been applying pressure on the Carney government over what they call rampant, out-of-control crime in Canadian communities.\n\nCrime was a key theme of Pierre Poilievre's election campaign in the spring, and he's promised to introduce legislation this fall that will make it harder for people with past convictions and those accused of serious crimes to get bail.\n\nCarney's Liberal government has similarly promised bail reform, targeting violent crime and organized crime.\n\nIt's a minority government, so either party will have to court support from the Bloc Québécois, the NDP or the Greens if they want the bill to pass.\n\nPoilievre has already said he does not expect any other opposition party will support the Tory legislation.\n\nThe Liberals are also aiming to bring in legislation to create safe zones around places of worship.\n\nMinority rule continues\n\nApril's election resulted in Canada's third-straight minority Liberal government, setting the stage for another busy fall for House leaders from all parties as they navigate cross-partisan negotiations.\n\nThe Conservatives helped speed passage of the One Canadian Economy Act in the spring, but Poilievre had harsh words for Carney as his caucus met on Sunday, saying that in the six months since he took office \"everything is worse.\"\n\nThe New Democrats, who had spent more than two years propping up the former Trudeau government with a supply-and-confidence deal, were reduced to just seven members and no official party status in the spring.\n\nInterim leader Don Davies quickly ruled out the possibility of another formal agreement with the government. The party's small caucus is now fully engaged in the search for their new leader, who is set to be chosen at a convention in March.\n\nBloc Québécois Leader Yves-François Blanchet said in the spring that he and the other 21 Bloc MPs were willing to give the Carney government some time to settle in.\n\nBut Blanchet was also highly critical last week of the Liberals' fiscal management, and he was coy when asked whether the Bloc wants to try to make a deal with the government.\n\nThe Liberals will seek to make up the required number of votes on a case-by-case basis for bills they put forward.\n\nThey survived their first test of confidence in the spring with the passage of the throne speech, which was delivered by King Charles, and will have another when the budget comes to a vote.","summary":"Members of Parliament are gearing up for their return to the House of Commons in what's expected to be a busy fall.\n\nHere is a look at some of the things to watch for as Parliament gets underway this week.\n\nThe budget\n\nThe Liberal government took some heat in the spring when it decided to dela...","url":"https://www.castanet.net/news/Canada/572316/The-budget-bail-and-other-bills-Five-things-to-watch-for-as-Parliament-returns","image":"https://www.castanet.net/content/2025/9/1f24f2d675d6224451b7bfbe17c71286dbcb8484a3f9d1584f9cf57d9501effd.jpg","video":null,"publish_date":"2025-09-15 00:14:00","author":"Sarah Ritchie,The Canadian Press","authors":["Sarah Ritchie","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":0.071},{"id":360516050,"title":"Charlie Kirk shooting suspect held leftist ideology, not co-operating, Utah governor says","text":"“There clearly was a leftist ideology,” Cox told NBC’s Meet the Press on Sunday, citing interviews with Robinson’s relatives and acquaintances.\n\n“Friends have confirmed that there was kind of that deep, dark internet, the Reddit culture, and these other dark places of the internet where this person was going deep.”\n\nCox said Robinson would be formally charged on Tuesday (Wednesday AEST). He remains in custody in Utah.\n\nKirk, a staunch ally of President Donald Trump and co-founder of the conservative student group Turning Point USA, was killed by a single rifle shot during the event attended by 3000 people in Orem, about 65 kilometres from Salt Lake City.","summary":"While the suspect is not talking to the FBI, Tyler Robinson’s transgender roommate – who was also a romantic partner – is helping with the investigation, Spencer Cox tells US media.","url":"https://www.brisbanetimes.com.au/world/north-america/charlie-kirk-shooting-suspect-not-cooperating-with-authorities-utah-governor-says-20250915-p5mv02.html","image":"https://static.ffx.io/images/$zoom_0.7592%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1%2C$y_0/t_crop_custom/q_86%2Cf_auto/17d60a901363422ecb3c33336c0f6ae8b90a1603","video":null,"publish_date":"2025-09-15 00:01:31","author":"Bo Erickson,James Oliphant","authors":["Bo Erickson","James Oliphant"],"language":"en","category":"politics","source_country":"au","sentiment":-0.599},{"id":360517408,"title":"Trump Expected to Extend TikTok Divestment Deadline Again: Report","text":"President Donald Trump's administration is expected to extend the September 17 deadline for China's ByteDance to divest TikTok's U.S. assets or shut down the popular short-video app, according to a Reuters report citing a source familiar with the matter.This would mark the fourth extension granted by Trump since retaking office in January, following previous delays that moved the original congressional deadline to April, then May, June, and now potentially beyond September.Newsweek has reached out to the White House via email on Saturday for comment.Why It MattersThe president's stance on TikTok has evolved. During his first term, he signed executive orders to ban the app, which were later blocked by courts. His change in position followed meetings with American investors and public acknowledgment of TikTok's role in his political outreach to young voters during last year's election.Despite congressional mandates requiring ByteDance to sell its U.S. operations or face a ban, the continued delays signal the Trump administration's reluctance to shut down an app used by approximately 170 million Americans.The administration's August launch of an official White House TikTok account further underscores the platform's strategic importance for political communication.What To KnowTikTok's uncertain status stems from longstanding concerns about Beijing's potential ability to use the platform for surveillance, blackmail, or censorship of Americans. The app faces a federal sell-or-ban law enacted by Congress that originally required ByteDance to divest U.S. operations by January 2025.Any potential sale faces significant technical and political hurdles, particularly regarding TikTok's proprietary algorithm, which would require Beijing's approval to share with U.S. buyers.A previous deal framework would have created a new U.S.-based company majority-owned by American investors, but progress stalled after China indicated it would not approve the arrangement following Trump's tariff announcements.The expected extension comes as U.S. Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer engage in trade talks with Chinese Vice Premier He Lifeng in Spain where TikTok has been included as an official agenda item for the first time in bilateral negotiations, Reuters reported. The meeting in Spain follows previous rounds in Geneva, London, and Stockholm where the app was not discussed.This development provides the Trump administration with political cover for another extension, sources told Reuters.What People Are SayingPresident Donald Trump wrote in June on Truth Social: \"I've just signed the executive order extending the deadline for the TikTok closing by 90 days (September 17, 2025). Thank you for your attention to this matter!\"White House press secretary Karoline Leavitt said in an August statement: \"The Trump administration is committed to communicating the historic successes President Trump has delivered to the American people with as many audiences and platforms as possible.\"Trump's then-national security adviser Mike Waltz said in January: \"...President Trump has been very clear: Number one, TikTok is a great platform that many Americans use and has been great for his campaign and getting his message out. But number two, he's going to protect their data.\"What Happens Next?The administration faces mounting pressure to either finalize a divestment arrangement or provide a clear justification for indefinite delays.","summary":"The administration would grant ByteDance its fourth reprieve since January as the app remains entangled in broader U.S.-China negotiations.","url":"https://www.newsweek.com/trump-expected-extend-tiktok-divestment-deadline-again-2129751","image":"https://d.newsweek.com/en/full/2722240/tiktok.jpg?w=1600&h=900&q=88&f=9b1eeb9d0aa8951fd9880ea893e7bf7e","video":null,"publish_date":"2025-09-14 23:58:25","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","source_country":"US","sentiment":0.074},{"id":360520746,"title":"Charlie Kirk Vigil at Kennedy Center: Mourning, Hope -- and Joy","text":"WASHINGTON, DC — “Charlie Kirk gave his life defending our civili liberties to engage in free and open debate.”\n\nSo declared State Senator Jake Hoffman of Arizona, a friend of Kirk’s, on opening the vigil for slain youth leader Charlie Kirk at the Kennedy Center for the Performing Arts in Washington, DC, Sunday night.\n\nThe evening began on a somber note, with the entire hall rising for prayer. But the mood quickly became energized, almost festive, as speaker after speaker celebrated Kirk’s life, achievements, and example.\n\nSpeaker of the House Mike Johnson (R-LA) noted that Kirk would want his supporters to take up the principles he fought for, “to save this great Republic” — adding that Kirk did not merely want “just to save a country, but to save souls” as well. He led a prayer that was offered “in sadness, but also with grateful hearts.”\n\nA star-studded lineup continued with praise for Kirk. “President Trump’s win in November was fueled, in no small part, by Charlie [and] by Turning Point,” White House Press Secretary Karoline Leavitt observed.\n\nDirector of National Intelligence Tulsi Gabbard spoke about attending campus debates with Kirk. She said that he believed in hearing everyone’s point of view, even those who were booed, because “No matter how horrible another person’s speech might be their ideas must be defeated by better ideas, not by violence.”\n\nSecretary of Health and Human Services Robert F. Kennedy, Jr., drew a sustained standing ovation, and cheers of “U-S-A!” as he approached the stage. He recalled bonding with Kirk after their first meeting, when he appeared on Kirk’s podcast in 2021, and called Kirk “the primary architect” of his agreement with President Donald Trump to unify their presidential campaigns in 2024. He added that faith and free speech were intertwined for Kirk, who “led the resistance” to censorship.. He saw dialogue as the only way to overcome the growing polarization in America that, he said, was driven by algorithms in social media.\n\nThen Kennedy added a personal note about his own losses — referring to his brother, but alluding, implicitly, to his father, Robert F. Kennedy, who was assassinated in 1968. He said that the hole of a loss never grows smaller, but that our duty is to grow bigger around it — to tap into the virtues of the person who is gone, and lessen the pain, proportionally, over time.\n\nKennedy noted that the other half of America — the half that had driven the hatred of Charlike Kirk had little idea of how intolerant they had become — and that the rest of America had to preserve the civil liberties and principles of the Constitution “until they wake up.”\n\nIt was up to Charlie Kirk’s supporters and admirers — “he is no longer there to lead us — to rush in and fill the breach, and to win this battle — for our country, for God, and for our families,” Kennedy concluded.\n\nKari Lake spoke next, and recalled the assassination itsel. “How does a 22-year-old become so filled with hate?” she wondered. She referenced rumors that the assassin had once been a Trump supporter, but had “been sent off to be brainwashed” at college. (The suspect, Tyler Robinson, 22, dropped out of college.)\n\n“This is a battle between good and evil,” she said. “I wish we could compromise. You can’t compromise between good and evil.” Rep. Anna Paulina Luna (R-FL) spoke about the ways in which Kirk had changed her life by promoting her views, hiring her for Turning Point USA, and ultimately backing her political career.\n\nShe described touring with him on campus: “Charlie Kirk didn’t need college; college needed Charlie Kirk.”\n\nHe had grown, she noted, from a young man tabling at college campuses, to an international leader.\n\n“Charlie Kirk will go down in history as one of the greatest political minds and activists of our lifetime.”\n\nRep. Andy Biggs (R-AZ) said: “This week, were were reminded how real evil is.” Headded: “Healing in the name of Jesus Christ is also real.” The grief, he said, would be short; the mission to save America would be the cure.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Zionist Conspiracy Wants You, now available on Amazon. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.","summary":"WASHINGTON, DC &#8212; &#8220;Charlie Kirk gave his life defending our civili liberties to engage in free and open debate.&#8221; So declared State Senator Jake Hoffman of Arizona, a friend of Kirk&#8217;s, on opening the vigil for slain youth leader Charlie Kirk\n\n\nThe post Charlie Kirk Vigil at Kennedy Center: Mourning, Hope &#8212; and Joy appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/09/14/charlie-kirk-vigil-at-kennedy-center-mourning-hope-and-joy/","image":"https://media.breitbart.com/media/2025/09/IMG_6611-640x335.jpg","video":null,"publish_date":"2025-09-14 23:56:52","author":"Joel B. Pollak,Turning Point","authors":["Joel B. Pollak","Turning Point"],"language":"en","source_country":"US","sentiment":0.079},{"id":360520066,"title":"Charlie Kirk shooting suspect not cooperating with authorities, Utah governor says - Reuters","text":"SummaryGovernor Cox says investigators seeking to learn motiveCox says suspect's ideology differed from his upbringingConservative influencer was slain at Utah college event\n\nWASHINGTON, Sept 14 (Reuters) - The man arrested in the killing of right-wing activist Charlie Kirk is not cooperating with authorities, but investigators are working to establish a motive for the shooting by talking to his friends and family, Utah Governor Spencer Cox said on Sunday.\n\nCox said the accused gunman, Tyler Robinson, 22, would be formally charged on Tuesday. He remains in custody in Utah.\n\nInvestigators have yet to piece together why Robinson allegedly scaled a rooftop at Utah Valley University during an outdoor event and shot Kirk in the neck at long range on Wednesday.\n\nAdvertisement · Scroll to continue\n\nKirk, a staunch ally of President Donald Trump and co-founder of the conservative student group Turning Point USA, was killed by a single rifle shot during the event attended by 3,000 people in Orem, about 40 miles south (65 km) of Salt Lake City.\n\nThe killing ushered in newfound fears of a spike in political violence in the United States and an ever-deepening divide between the left and the right.\n\nRobinson has not confessed to investigators, Cox told the ABC program \"This Week.\"\n\n\"He is not cooperating, but all the people around him were cooperating, and I think that's very important,\" the Republican governor said.\n\nAdvertisement · Scroll to continue\n\nOne person who is apparently talking to investigators is Robinson's roommate, who was also a romantic partner, Cox said, citing the FBI. Cox described the roommate as \"a male transitioning to female,\" and said the roommate has been \"incredibly cooperative.\"\n\nReuters has not been able to locate the roommate, or representatives for the roommate, to seek comment. Reuters could not determine who is serving as Robinson's legal representative.\n\nAsked on CNN's \"State of the Union\" program whether the roommate's gender identity is relevant to the investigation, Cox said, \"That's what we're trying to figure out right now ... It's easy to draw conclusions from that, and so we've got the shell casings, other forensic evidence that is coming in - and trying to piece all of those things together.\"\n\nInvestigators found messages engraved into four bullet casings, which included references to memes and video game in-jokes. An affidavit filed by authorities in the case described these messages. One of the inscriptions, according to the affidavit, read: \"hey fascist! CATCH!\" followed by a combination of directional arrows, an apparent reference to a sequence of button presses that unleashes a bomb in a popular video game.\n\nAnother casing, according to the affidavit, read, \"If you read This, you are GAY Lmao,\" short for \"laughing my ass off.\"\n\nKirk's charged rhetoric, which often involved anti-LGBT and anti-immigrant comments, attracted legions of conservatives, but also engendered strong feelings from liberals and drew widespread criticism.\n\nRobinson, a third-year student in the electrical apprenticeship program at Dixie Technical College, part of Utah's public university system, was taken into custody at his parents' house, about 260 miles (420 km) southwest of the crime scene after a 33-hour manhunt.\n\nINVESTIGATORS SEARCH FOR MOTIVE\n\nRelatives and a family friend alerted authorities that he had implicated himself in the crime, Cox said previously.\n\nWhile Robinson was raised by religious parents in a deeply conservative region of the state, \"his ideology was very different than his family,\" Cox said on Sunday on NBC's \"Meet the Press\" program, without going into specifics.\n\nState records show Robinson was a registered voter but not affiliated with any political party. A relative told investigators that Robinson had grown more political in recent years and had once discussed with another family member their dislike for Kirk and his viewpoints, according to the arrest warrant affidavit.\n\nRobinson was \"not a fan\" of Kirk's, Cox said on Sunday.\n\nThe killing has stirred outrage among Kirk's supporters and condemnation of political violence from some across the ideological spectrum.\n\nMany Republicans, including Trump, have been quick to lash out at the political left, accusing liberals of fomenting anti-conservative vitriol that would encourage violence - even as the president and his allies have often invoked violent imagery against their opponents.\n\n\"The problem is on the left,\" Trump told reporters on Sunday. \"A lot of people that you would traditionally say are on the left ... (are) already under investigation.\"\n\nMike Johnson, the Republican speaker of the U.S. House of Representatives, criticized Democrats but also urged calm.\n\n\"There's this recognition that people have got to stop framing simple policy disagreements in terms of existential threats to our democracy,\" he said on the \"Fox News Sunday\" program.\n\nOn \"Meet the Press,\" Cox assigned some blame to social media, saying it has \"played a direct role in every single assassination and assassination attempt that we have seen over the last five, six years.\"\n\nTrump has credited Kirk with driving young voters to conservatism. His Turning Point movement says it has more than 800 chapters across college campuses. Kirk's widow on Friday said the movement's efforts would go forward.\n\nA memorial event for Kirk will be held on September 21 in Glendale, Arizona, his organization said.\n\nReporting by James Oliphant and Bo Erickson; Additional reporting by Jarrett Renshaw, Nandita Bose, Andy Sullivan, David Ljunggren and Richard Cowan; Editing by Don Durfee, Will Dunham and Lincoln Feast.\n\nPurchase Licensing Rights","summary":"Charlie Kirk shooting suspect not cooperating with authorities, Utah governor says  Reuters","url":"https://www.reuters.com/world/us/charlie-kirk-shooting-suspect-not-cooperating-with-authorities-utah-governor-2025-09-14/","image":"https://www.reuters.com/resizer/v2/QV2METN6IBK3XA4W4JYGHNN4XA.jpg?auth=c879a319f5710644a4c763a6628798b205d723547b0a3943400a24f1616bfba2&height=1005&width=1920&quality=80&smart=true","video":"https://ajo.prod.reuters.tv/v3/playlist/702234/master.m3u8","publish_date":"2025-09-14 23:35:32","author":"Bo Erickson,James Oliphant","authors":["Bo Erickson","James Oliphant"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.236},{"id":360519244,"title":"EU blasts ‘reckless’ Russian drone incursion into Romania","text":"Now, as Romania has summoned the Russian ambassador to Bucharest over the incident, multiple EU officials signaled on Sunday that action would be taken to “protect” its member countries.\n\n“Russia’s incursion into Romanian airspace is once again a blatant violation of EU sovereignty and a serious threat to regional security. We are working closely with Romania and all Member States to protect the EU territory,” European Commission President Ursula von der Leyen said in a statement.\n\nKaja Kallas, the EU’s foreign policy chief, echoed those remarks in a statement of her own addressing the incursion.\n\n“The violation of Romanian airspace by Russian drones is yet another unacceptable breach of an EU Member State’s sovereignty. This continued reckless escalation threatens regional security. We stand in solidarity with Romania. I am in close contact with the Romanian government,” Kallas said.\n\nThe drone incursion into Romanian airspace now makes it the second such incident to affect a NATO country this week.\n\nLast Tuesday, Russian drones “repeatedly” violated Poland’s airspace, leading to the country deploying aircraft to shoot them down.\n\nMultiple European countries called that incursion a “deliberate and coordinated strike constituting an unprecedented provocation and escalation of tension.”\n\nU.S. President Donald Trump, meanwhile, speculated that it “could’ve been a mistake.”\n\nPOLAND SCRAMBLES AIRCRAFT TO DESTROY RUSSIAN DRONES VIOLATING ITS AIRSPACE\n\n“Could’ve been a mistake, but regardless, I’m not happy about anything having to do with that whole situation, but hopefully it’s gonna come to an end,” Trump said.\n\nTrump is mediating a potential peace deal between Russia and Ukraine, negotiations of which have stalled as fighting between the two countries continues.","summary":"The European Union castigated Russia for its recent drone incursion into Romania earlier this weekend, calling it a &#8220;reckless escalation.&#8221; The Romanian military scrambled two F-16s on Saturday after a Russian drone on its way to Ukraine was detected in its airspace. The drone circled a remote area of the country for nearly an hour [&#8230;]","url":"https://www.washingtonexaminer.com/news/world/3807254/eu-blasts-russian-drone-incursion-romania/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/eu-blasts-russian-drone-incursion-romania.jpg?w=696","video":null,"publish_date":"2025-09-14 23:35:10","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","category":"politics","source_country":"US","sentiment":-0.259},{"id":360512558,"title":"Trump to again push deadline on TikTok sale or divestment","text":"The Trump administration is expected to again extend a September 17 deadline for China’s ByteDance to divest the U.S. assets of short-video app TikTok or shut it down, a source familiar with the matter told Reuters.\n\nIt would be the fourth reprieve granted by President Donald Trump from federal enforcement of a law that originally gave ByteDance until January 2025 to sell or shutdown the popular social media platform.\n\nLast month, Trump said he had U.S. buyers lined up for the app and could further extend the deadline.\n\nThe White House did not immediately respond to a request for comment. But an extension, if granted, would suggest a reluctance to shut down an app used by 170 million Americans.\n\nWhile China hawks in Washington have long feared Beijing could harness TikTok to spy on, blackmail or censor Americans, Trump has said he wants to save the app, which helped him woo young voters in the 2024 presidential election.\n\nProgress on a deal has been slow, with any sharing of TikTok’s prized algorithm with a U.S. buyer requiring approval from Beijing.\n\nA deal had been in the works in the spring. It would have spun off TikTok’s U.S. operations into a new U.S.-based firm, majority-owned and operated by U.S. investors, but was put on hold after China indicated it would not approve it following Trump’s announcements of steep tariffs on Chinese goods.\n\nU.S. Treasury Secretary Scott Bessent and U.S. Trade Representative Jamieson Greer began trade talks with Chinese Vice Premier He Lifeng and China’s top trade negotiator, Li Chenggang, in Spain on Sunday that will touch on TikTok. But a deal is not expected before September 17, the source said.\n\nTikTok was not discussed in previous rounds of U.S.-China trade talks in Geneva, London and Stockholm. The source said TikTok’s public inclusion as an agenda item when the Treasury announced the latest talks gives the Trump administration political cover for another extension, which may annoy both Republicans and Democrats in Congress who mandated TikTok’s sale.\n\nTrump began his second term as president on January 20 and opted not to enforce the law requiring TikTok’s U.S. asset sale or shut down. He first extended the deadline to early April, then from May to June, and a third time to September.","summary":"The Trump administration is expected to again extend a September 17 deadline for China&#8217;s ByteDance to divest the U.S. assets of short-video app TikTok or shut it down, a source familiar with the matter told Reuters. It would be the fourth reprieve granted by President Donald Trump from federal enforcement of a law that originally [&#8230;]","url":"https://www.fbcnews.com.fj/world/trump-to-again-push-deadline-on-tiktok-sale-or-divestment/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2025/09/Teenagers-pose-for-a-photo-while-holding-smartphones-in-front-of-a-TikTok-logo-in-this-illustration-taken-September-11-2025..jpg","video":null,"publish_date":"2025-09-14 23:22:36","author":"President Donald Trump,Timoci Batibasaga","authors":["President Donald Trump","Timoci Batibasaga"],"language":"en","source_country":"fj","sentiment":-0.143},{"id":360518442,"title":"Starmer faces challenging week amid Mandelson fallout and frustrated MPs","text":"Sir Keir Starmer is facing a challenging week amid the fallout from the sacking of Lord Mandelson and frustrations from MPs while he navigates Donald Trump’s state visit.\n\nThe Prime Minister is still facing questions over when he and No 10 knew the details of emails published last week that showed the Labour grandee sent supportive messages to paedophile financier Jeffrey Epstein even as he faced jail for sex offences.\n\nAnd Angela Rayner’s resignation over her tax affairs still looms large as the race to replace her as deputy Labour Party leader takes off.\n\nIt comes as the US President is set to arrive for a state visit that Downing Street said would see the “unbreakable friendship” between the UK and US “reach new heights”.\n\nSir Keir hailed a “landmark” partnership as the two countries announced a deal to boost the building of nuclear plants to be signed during the visit.\n\nHe could get some positive news on his efforts to tackle small boat crossings as the first deportations of migrants under the “one in, one out” deal with France are expected to take place this week.\n\nThe first are due to be sent back on a commercial Air France flight on Monday, barring any last-minute legal challenges, The Times reported.\n\nBut he will also face further questions about Lord Mandelson.\n\nBusiness Secretary Peter Kyle’s efforts to lay out what had happened when he spoke to broadcasters on Sunday left many questions unanswered.\n\nHe also defended the choice to appoint Lord Mandelson in the first place, saying his “singular talents” meant he was deemed “worth the risk”.\n\nThe Conservatives have written to Sir Keir asking him to explain the sequence of events leading to Lord Mandelson’s sacking and publish documents relating to his vetting and correspondence with the Downing Street operation last week.\n\nThe party will be pushing for information next week and will use “every mechanism that is available to us to force the truth to come out”, shadow education secretary Laura Trott told the BBC.\n\nHe is also facing disquiet among his own MPs, with one backbencher saying he is “supping in the last-chance saloon”.\n\nBlackley and Middleton MP Graham Stringer also said “it is a given” among Labour MPs that the Prime Minister is “making mistakes and doing poorly at the job”, in comments to Times Radio.\n\nDulwich and West Norwood MP Helen Hayes said there will need to be “questions about the nature of the leadership” if Labour fare badly in elections in May 2026.\n\n“We have really important elections in May… If those elections don’t go well, then that will be the time to ask questions… Questions about the nature of the leadership and whether things can continue as they are, but we’re not at that point now,” she told BBC Radio 4’s Westminster Hour.\n\nMeanwhile, speculation is rife that Manchester Mayor Andy Burnham could seek a return to Westminster.\n\nBut an ally of Mr Burnham rejected that he is laying the foundations for a future leadership bid, calling the rumours “pure speculation with no substance”.\n\nCabinet minister Mr Kyle said it would be “a shame for Manchester to lose him” when asked about the reports Mr Burnham could seek to return to the Commons after standing down as an MP in 2017.\n\nEducation Secretary Bridget Phillipson sought to appeal to members as she launched her leadership bid on Sunday, saying she would use her position if picked to give members a “strong voice” at the Cabinet table.\n\nShe also said she wanted to “unite” the party and beat Reform UK to secure a second term for Labour.\n\nMs Phillipson told members: “You can use this contest to look backward, to pass judgment on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election.”\n\nBut the deputy leadership contest could serve to further expose the party’s divisions.\n\nLucy Powell, who is in the running after being sacked as Commons leader in the reshuffle, called for a “change of culture” at Downing Street, in comments to The Guardian last week.\n\nShe then told the Manchester Evening News the Government should not shy away from talking about what is not working.\n\n“It’s not my intention to fill the airwaves with a running commentary on the government or to develop what looks like an alternative programme for government,” she said. “That’s not the role.\n\n“But equally, I don’t think we should shy away from having this conversation right now because clearly there are things that aren’t working.”","summary":"It comes as US President Donald Trump is set to arrive for a state visit.","url":"https://www.standard.co.uk/news/politics/keir-starmer-prime-minister-donald-trump-andy-burnham-mps-b1247720.html","image":"https://static.standard.co.uk/2025/09/15/00/e963208ce795a28f9e2f3e00f8ecf8ffY29udGVudHNlYXJjaGFwaSwxNzU3OTc2OTk2-2.81542631.jpg?width=1200","video":null,"publish_date":"2025-09-14 23:18:22","author":"Helen Corbett","authors":["Helen Corbett"],"language":"en","source_country":"gb","sentiment":-0.177},{"id":360521694,"title":"Seth Rogen and Jean Smart are among the early winners at 2025 Emmy Awards","text":"By ANDREW DALTON, AP Entertainment Writer\n\nLOS ANGELES (AP) — Seth Rogen won best actor in a comedy series Sunday for “The Studio,” and Britt Lower and Tramell Tillman took trophies for “Severance,” kicking off the 77th Primetime Emmy Awards on what could be a very big night for the two Apple TV+ series.\n\n“I could not wrap my head around this happening,” said Rogen, who is up for three more Emmys during the show. “I’ve never won anything in my life.”\n\nLower won best actress in a drama for “Severance” and Tillman won best supporting actor in a drama.\n\n“My first acting coach was tough, y’all,” Tillman, wearing an all-white tuxedo, said from the stage. “But all great mothers are.”\n\nHe looked out to his mother in the audience and told her, “You were there for me where no one else was, and no one else would show up.”\n\nHis win had been widely expected but Lower’s was a surprise in a category where Kathy Bates was considered a heavy favorite, for “Matlock.”\n\nJean Smart won best actress in a comedy for “Hacks” for the fourth time, at 73 extending her own record for the oldest woman ever to win the category.\n\nHer castmate and constant scene partner Hannah Einbinder, who had also been nominated for all four seasons but unlike Smart had never won, took best supporting actress in a comedy.\n\nShe said she had become committed to a bit where “it was cooler to lose”\n\n“But this is cool too!” she shouted, then ended her speech by cursing the U.S. Immigration and Customs Enforcement agency and saying “Free Palestine!”\n\nHow the 2025 Emmys opened\n\nStephen Colbert was the first person to take the stage to present the award during the CBS telecast at the Peacock Theater in Los Angeles despite the recent controversial cancellation of his show by the network. He was greeted by a rousing and lengthy standing ovation.\n\n“While I have your attention, is anyone hiring?” Colbert said.\n\nIn an unusual show order, host Nate Bargatze delivered his opening monologue only after the first award was handed out.\n\nKatherine LaNasa won best supporting actress in a drama for “The Pitt,” a surprise in a category where most expected one of the three nominees from “The White Lotus” to win.\n\n“I am so proud and honored,” LaNasa, looking emotional and shocked, said.\n\nThe show opened with a sketch where “Saturday Night Live” stars Mikey Day, Bowen Yang and James Austin Johnson joined Bargatze, who played television inventor Philo T. Farnsworth opining on what the future of TV will be like.\n\nBargatze-as-Farnsworth mentions that there will be a Black Entertainment Television. When asked if there will be a network for white people, he replied, “Why, CBS of course.”\n\nApple TV+ is poised to have a breakout Emmy year with the two most nominated shows, “Severance” and “The Studio,” which are the favorites to win the two biggest awards.\n\nWhat to expect from the 2025 Emmy Awards\n\n“The Studio,” with co-creator Rogen starring as the new head of a movie studio, came into the evening with blockbuster buzz for its breakout first season.\n\nIt tied a record for a comedy with 23 nominations, and with nine Emmys already won at last weekend’s Creative Arts ceremony. It would be a major surprise if it did not break the record of 11 Emmy wins in a season by a comedy.\n\n“Severance,” the Orwellian office drama about people who surgically split their psyches into workplace “innies” and home “outies,” was the top overall nominee with 27 nominations for its second season. It won six at the Creative Arts ceremony.\n\nAlong with best drama — which would be a first for Apple — it’s nominated in all four dramatic acting categories, with stars Adam Scott and Britt Lower each looking for their first Emmys.\n\nIts top competition for best drama could be “The Pitt,” HBO’s acclaimed drama about one shift in the life of an emergency room.\n\nIts star Noah Wyle could be both the sentimental favorite and the actual favorite for best actor. He was nominated five times without a win for playing a young doctor on “ER” in the 1990s, and now could finally take his trophy for what is in many ways a reprise of the role.\n\nLater in the show, could give “The Late Show With Stephen Colbert” the Emmy for best talk series for the first time as a sort of protest vote and tribute to its host.\n\nMany perceived the end of the show as punishment of Colbert and placation of President Donald Trump after Colbert was harshly critical of a legal settlement between the president and Paramount, which needed administration approval for a sale to Skydance Media. Executives called the decision strictly financial.\n\nHow to watch and stream the Emmys and its red carpet\n\nThe Emmys are airing live on CBS at 8 p.m. Eastern and 5 p.m. Pacific time.\n\nParamount+ with Showtime subscribers may stream the show live. Standard Paramount+ subscribers can stream it Monday through Sept. 21.","summary":"Plus, two 'Severance' stars also took trophies.","url":"https://www.twincities.com/2025/09/14/emmy-awards-2025/","image":"https://www.twincities.com/wp-content/uploads/2025/09/AP25258008237671.jpg?w=1024&h=682","video":null,"publish_date":"2025-09-14 23:16:33","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.294},{"id":360517764,"title":"Nate Bargatze opens the 2025 Emmy Awards, where ‘The Studio’ and ‘Severance’ are favorites","text":"By ANDREW DALTON, AP Entertainment Writer\n\nLOS ANGELES (AP) — Seth Rogen won best actor in a comedy series Sunday night for “The Studio,” kicking off the 77th Primetime Emmy Awards with what could be a record-breaking number of wins for the Apple TV+ Hollywood satire.\n\n“I could not wrap my head around this happening,” said Rogen, who is up for three more Emmys during the show. “I’ve never won anything in my life.”\n\nStephen Colbert was the first person to take the stage to present the award during the CBS telecast at the Peacock Theater in Los Angeles despite the recent controversial cancellation of his show by the network. He was greeted by a rousing and lengthy standing ovation.\n\n“While I have your attention, is anyone hiring?” Colbert said.\n\nIn an unusual show order, comic Nate Bargatze delivered his opening monologue only after the first award was handed out.\n\nThe show opened with a sketch where “Saturday Night Live” stars Mikey Day, Bowen Yang and James Austin Johnson joined Bargatze, who played television inventor Philo T. Farnsworth opining on what the future of TV will be like.\n\nBargatze-as-Farnsworth mentions that there will be a Black Entertainment Television. When asked if there will be a network for white people, he replied, “Why, CBS of course.”\n\nApple TV+ is poised to have a breakout Emmy year with the two most nominated shows, “Severance” and “The Studio,” which are the favorites to win the two biggest awards.\n\nWhat to expect from the 2025 Emmy Awards\n\n“The Studio,” with co-creator Seth Rogen starring as the new head of a movie studio, comes into the evening with blockbuster buzz for its breakout first season.\n\nIt tied a record for a comedy with 23 nominations, and with nine Emmys already won at last weekend’s Creative Arts ceremony. It would be a major surprise if it did not break the record of 11 Emmy wins in a season by a comedy.\n\nIt could win as many as 15, and Rogen himself could win four times, as an actor, a writer a director and an executive producer.\n\n“The Bear” and “Hacks” which have dominated the comedy Emmys in recent years, are both again up for best comedy series but suddenly find themselves underdogs.\n\n“Severance,” the Orwellian office drama about people who surgically split their psyches into workplace “innies” and home “outies,” was the top overall nominee with 27 nominations for its second season. It won six at the Creative Arts ceremony.\n\nAlong with best drama — which would be a first for Apple — it’s nominated in all four dramatic acting categories, with stars Adam Scott and Britt Lower each looking for their first Emmys.\n\nIts top competition for best drama could be “The Pitt,” HBO’s acclaimed drama about one shift in the life of an emergency room.\n\nIts star Noah Wyle could be both the sentimental favorite and the actual favorite for best actor. He was nominated five times without a win for playing a young doctor on “ER” in the 1990s, and now could finally take his trophy for what is in many ways a reprise of the role.\n\nIt could also be an unprecedented night of Hollywood recognition for older women in an industry known for discarding female actors.\n\nOscar-winner Kathy Bates at 78 could become the oldest winner ever in the best actress in a drama category for playing the title role in CBS’ “Matlock.” She’d be the first woman from a network series to win the award in a decade.\n\nAnd Jean Smart at 73 could extend her own record for oldest winner of best actress in a comedy if she wins for “Hacks” as she has for all three previous seasons of the show.\n\nLater in the show, could give “The Late Show With Stephen Colbert” the Emmy for best talk series for the first time as a sort of protest vote and tribute to its host.\n\nMany perceived the end of the show as punishment of Colbert and placation of President Donald Trump after Colbert was harshly critical of a legal settlement between the president and Paramount, which needed administration approval for a sale to Skydance Media. Executives called the decision strictly financial.\n\nHow to watch and stream the Emmys and its red carpet\n\nThe Emmys are airing live on CBS at 8 p.m. Eastern and 5 p.m. Pacific time.\n\nParamount+ with Showtime subscribers may stream the show live. Standard Paramount+ subscribers can stream it Monday through Sept. 21.","summary":"Seth Rogen won best actor in a comedy series for 'The Studio.'","url":"https://www.denverpost.com/2025/09/14/emmy-awards-2025/","image":"https://www.denverpost.com/wp-content/uploads/2025/09/AP25258008237671.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-14 23:16:33","author":"Gqlshare,The Associated Press","authors":["Gqlshare","The Associated Press"],"language":"en","category":"entertainment","source_country":"US","sentiment":0.223},{"id":360515618,"title":"Emmys arrive with ‘The Studio’ and ‘Severance’ vying for top honors","text":"By ANDREW DALTON, AP Entertainment Writer\n\nLOS ANGELES (AP) — “The Studio” looks like a runaway hit, the innies and outies of “Severance” could solidify a spot among the prestige TV elite, and Noah Wyle could finally have his big awards moment as the 77th Primetime Emmy Awards arrive.\n\nComic Nate Bargatze will be a first-time host Sunday night when the ceremony at the Peacock Theater in Los Angeles airs on CBS Sunday night.\n\nApple TV+ is poised to have a breakout Emmy year with the two most nominated shows, “Severance” and “The Studio,” which are the favorites to win the two biggest awards.\n\nThe Emmys air live on CBS at 8 p.m. Eastern and 5 p.m. Pacific time. Paramount+ with Showtime subscribers may stream the show live. Standard Paramount+ subscribers can stream it Monday through Sept. 21.\n\nHow the competition is shaping up at Sunday’s Emmys\n\n“The Studio,” with co-creator Seth Rogen starring as the new head of a movie studio, comes into the evening with blockbuster buzz for its breakout first season.\n\nIt tied a record for a comedy with 23 nominations, and with nine Emmys already won at last weekend’s Creative Arts ceremony. It would be a major surprise if it did not break the record of 11 Emmy wins in a season by a comedy.\n\nIt could win as many as 15, and Rogen himself could win four times, as an actor, a writer a director and an executive producer.\n\n“The Bear” and “Hacks” which have dominated the comedy Emmys in recent years, are both again up for best comedy series but suddenly find themselves underdogs.\n\n“Severance,” the Orwellian office drama about people who surgically split their psyches into workplace “innies” and home “outies,” was the top overall nominee with 27 nominations for its second season. It won six at the Creative Arts ceremony.\n\nAlong with best drama — which would be a first for Apple — it’s nominated in all four dramatic acting categories, with stars Adam Scott and Britt Lower each looking for their first Emmys.\n\nIts top competition for best drama could be “The Pitt,” HBO’s acclaimed drama about one shift in the life of an emergency room.\n\nIts star Noah Wyle could be both the sentimental favorite and the actual favorite for best actor. He was nominated five times without a win for playing a young doctor on “ER” in the 1990s, and now could finally take his trophy for what is in many ways a reprise of the role.\n\nHBO’s prestige resort soap “The White Lotus” could also be in the mix for best drama its Thailand-set third season and has three nominees apiece in each of the drama supporting acting categories.\n\nOlder women could shine in actress categories\n\nIt could be an unprecedented night of Hollywood recognition for older women in an industry known for discarding female actors.\n\nOscar-winner Kathy Bates at 78 could become the oldest winner ever in the best actress in a drama category for playing the title role in CBS’ “Matlock.” She’d be the first woman from a network series to win the award in a decade.\n\nAnd Jean Smart at 73 could extend her own record for oldest winner of best actress in a comedy if she wins for “Hacks” as she has for all three previous seasons of the show.\n\n‘Adolescence’ and ‘The Penguin’ headline limited series\n\nNetflix’s “Adolescence,” the story of a 13-year-old in Britain accused of a killing whose four episodes each take place in one continuous shot, may be the year’s most acclaimed show and is the consensus favorite for best limited series. Fifteen-year-old Owen Cooper could become the youngest Emmy winner in more than 40 years for playing the accused.\n\nBut HBO’s dark Batman universe show “The Penguin” got the biggest number of limited series nominations and won eight times at the Creative Arts ceremony.\n\nColin Farrell is nominated for lead actor playing the title character, and Cristin Milioti is nominated for actress for playing his nemesis. Both are considered strong contenders.\n\nA send-off for Stephen Colbert\n\nNot all of the CBS attention Sunday night may be positive.\n\nVoters could give “The Late Show With Stephen Colbert” the Emmy for best talk series for the first time as a sort of protest vote and tribute to its host, weeks after its cancellation by the network.\n\nMany perceived the end of the show as punishment of Colbert and placation of President Donald Trump after Colbert was harshly critical of a legal settlement between the president and Paramount, which needed administration approval for a sale to Skydance Media. Executives called the decision strictly financial.","summary":"Apple TV+ is poised to have a breakout year with the two most nominated shows.","url":"https://www.sandiegouniontribune.com/2025/09/14/emmy-awards-2025/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/09/AP25257821612634.jpg?w=150&strip=all","video":null,"publish_date":"2025-09-14 23:16:33","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","source_country":"us","sentiment":0.325},{"id":360510142,"title":"Armed response vehicles, baton guns and ballistic helmets: Inside the police operation for Trump’s UK visit","text":"A major policing operation is set to get underway for Donald Trump’s state visit as officers prepare to respond to a potential high-threat incident in Windsor.\n\nThe King is to host the US president and his wife, first lady Melania Trump, at Windsor Castle from Wednesday to Friday, where they will be feted with a ceremonial welcome and state banquet.\n\nArmed response vehicles (ARVs), baton guns and ballistic helmets are among the resources being deployed for the 24-hour-a-day policing operation set to be in place in the Berkshire town during the event, with a temporary order restricting the airspace from Tuesday – when the rehearsal is to take place – until Thursday.\n\nArmed officers will be patrolling the streets with the vehicles ready to respond in case of increased threat, Thames Valley Police said last week during a media briefing at the force’s training centre in Sulhamstead, Berkshire.\n\n“We have considered anything from a low to a hight-threat incident, and it’s a very comprehensive security operation as a result,” police sergeant and operational firearms commander Daniel Hatfield said.\n\n“Every single state visit or policing operation of this nature comes with its own merits, and every operation or plan is constructed individually.”\n\nSergeant Hatfield added: “It’s not the first time a president of the United States has visited Windsor and relationships with our American colleagues are well forged, well practised, so it makes planning a security operation like this a lot easier.”\n\nOfficers will have access to a wide range of equipment and weapons, including Tasers, baton guns which propel rubber bullets, Glock 17 sidearms, Lewis Machine & Tool rifles, and shotguns, which are used on dangerous animals.\n\nAdditionally, police officers will have access to overalls, gloves, respirators and ballistic helmets “for anything that is CBRN-related – chemical, biological, radiological and nuclear,” Sergeant Hatfield said.\n\n“That is something which hopefully is very unlikely to happen, but if there was ever to be a firearms threat as well as CBRN, this is what we would deploy with our weapons system,” Sergeant Hatfield added.\n\nThe equipment will be kept in ARV vans, alongside a first-aid kit and ballistic protection shields, police said.\n\nThe trip next week will be Mr Trump’s second state visit to the UK – an unprecedented gesture towards a US president. He was previously feted with a state visit in 2019.\n\nHis first state visit to the UK saw thousands of people turn out on the streets in London in opposition, and protests are also expected to take place next week.\n\nThe Stop Trump Coalition are to stage a mass demonstration in central London on the first day of the trip, with a further protest planned near Windsor Castle.","url":"https://uk.news.yahoo.com/armed-response-vehicles-baton-guns-231454576.html","image":"https://s.yimg.com/ny/api/res/1.2/CvF_Du7poCgHmx3.Y3fWhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/f5b8ae7064c4bae35ace234671359af0","video":null,"publish_date":"2025-09-14 23:14:54","author":"Tara Cobham","authors":["Tara Cobham"],"language":"en","category":"politics","source_country":"gb","sentiment":0.196},{"id":360517934,"title":"China, AS adakan pusingan baharu rundingan tarif di Sepanyol","text":"ANKARA: Amerika Syarikat (AS) dan China memulakan pusingan baharu rundingan perdagangan di Madrid pada Ahad, di tengah-tengah desakan Washington supaya sekutu Eropahnya mengenakan tarif terhadap Beijing berhubung pembelian minyak Rusia, lapor Anadolu Ajansi (AA).\n\nNaib Perdana Menteri China He Lifeng dan Setiausaha Perbendaharaan AS Scott Bessent mengetuai delegasi masing-masing dalam rundingan penting itu, dengan gencatan tarif ke atas import China dilanjutkan sehingga November. Rundingan akan berlangsung selama empat hari sehingga Rabu.\n\nMenteri Luar Sepanyol Jose Manuel Albares menyambut kedua-dua delegasi di Kementerian Luar, di Madrid, tempat rundingan perdagangan baharu itu diadakan.\n\n\"Dasar luar Sepanyol berteraskan dialog dan persetujuan. Berbesar hati atas kepercayaan kedua-dua pihak memilih Madrid,\" kata Albares menerusi platform media sosial X.\n\nRundingan itu, yang merupakan kali keempat dalam tempoh empat bulan, bermula beberapa jam selepas kedua-dua delegasi tiba di ibu negara pada Ahad, dalam satu lagi usaha untuk mengelakkan hubungan dagang AS-China yang tegang daripada terus runtuh akibat perang tarif yang dicetuskan Presiden Donald Trump.\n\nMenurut Jabatan Perbendaharaan AS, rundingan akan merangkumi \"isu utama keselamatan negara, ekonomi dan perdagangan yang menjadi kepentingan bersama, termasuk TikTok serta kerjasama memerangi rangkaian pengubahan wang haram yang mengancam kedua-dua negara.\"\n\nTikTok berdepan larangan menyeluruh di AS atas alasan keselamatan negara.\n\nKongres AS meluluskan undang-undang dwipartisan pada 2024 yang mewajibkan ByteDance, syarikat induk China bagi TikTok, melepaskan operasi di AS atau berdepan larangan menyeluruh berhubung kebimbangan keselamatan negara mengenai potensi perkongsian data dengan Beijing.\n\nNamun, menerusi perintah eksekutif pada Jun, Trump melanjutkan tarikh akhir penguatkuasaan terhadap TikTok selama 90 hari sehingga 17 Sept – kelewatan ketiga ke atas potensi larangan itu.\n\nJurucakap Kementerian Perdagangan China pada minggu lepas menggesa AS menangani isu berkenaan melalui dialog berasaskan prinsip saling menghormati dan rundingan, serta menyediakan \"persekitaran perniagaan yang terbuka, adil, saksama dan tidak berdiskriminasi\" bagi syarikat China yang beroperasi di AS.\n\nPada awal Ogos, Trump menandatangani perintah eksekutif yang melanjutkan penggantungan tarif terhadap China selama 90 hari lagi sehingga 10 Nov.\n\nNamun, tarif timbal balik 10 peratus masih berkuat kuasa sepanjang tempoh penggantungan itu.\n\nDua ekonomi terbesar dunia itu terlibat dalam perang tarif yang dicetuskan Trump sehingga mengganggu pasaran global sebelum kedua-dua pihak bersetuju melaksanakan pengurangan bersama tarif secara besar-besaran.\n\nTrump telah mencapai perjanjian dengan United Kingdom, Korea Selatan, Jepun dan Kesatuan Eropah, selain terus mengadakan rundingan dengan beberapa negara lain.\n\nRundingan terbaharu antara Beijing dan Washington ini berlangsung ketika harapan meningkat bahawa pemimpin China dan AS dapat bertemu bulan depan di luar sidang kemuncak Kerjasama Ekonomi Asia-Pasifik (APEC) di Korea Selatan.","summary":"ANKARA: Amerika Syarikat (AS) dan China memulakan pusingan baharu rundingan perdagangan di Madrid pada Ahad, di tengah-tengah desakan Washington supaya sekutu Eropahnya mengenakan tarif terhadap Beijing berhubung pembelian minyak Rusia, lapor Anadolu Ajansi (AA).","url":"https://www.bharian.com.my/dunia/asia/2025/09/1446246/china-adakan-pusingan-baharu-rundingan-tarif-di-sepanyol","image":"https://assets.bharian.com.my/images/articles/BH15TARIF-O_BHfield_image_listing_featured.var_1757893434.jpg","video":null,"publish_date":"2025-09-14 23:08:43","author":"BERNAMA-ANADOLU","authors":["BERNAMA-ANADOLU"],"language":"en","source_country":"my","sentiment":-0.152},{"id":360518574,"title":"Inside operation for Donald Trump’s visit with restricted airspace and 7ft fences","text":"A complex security operation is underway for Trump’s state visit next week, with armed police to be deployed in Windsor for the president’s visit (Picture: AFP)\n\nA complex security operation has been drawn up ahead of Donald Trump’s state visit this week.\n\nThousands of extra police have been drafted in to ensure the US president’s visit goes without a hitch.\n\nPresident Trump, and his wife Melania, are set to arrive in Britain on September 17, when they will be hosted by King Charles and Queen Camilla at Windsor Castle.\n\nTall fences measuring 7ft have been erected around the Windsor estate and temporary airspace restrictions will be in place from September 16, when a rehearsal is expected to go ahead.\n\n Trump standing next to Queen Elizabeth II during his first state visit in 2019 (Picture: PA)\n\nA 24-hour policing operation will kick into action for the duration of the president’s stay, with armed officers patrolling the streets with Armed Response Vehicles (ARVs).\n\nArmed officers will have a plethora of weapons at their disposal, including Tasers, baton guns propelling rubber bullets, Glock 17 sidearms, Lewis Machine & Tool rifles, and shotguns.\n\nPolice sergeant and operational firearms commander Daniel Hatfield said authorities had considered all potential eventualities for Trump’s visit, from low to high risk.\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nBut he added the task was made much easier by records of previous presidential visits to Windsor as well as ‘well forged’ relationships with US forces.\n\nHe said that forces would be prepared for all types of attack, including equipment including chemical, biological, radiological and nuclear with overalls, gloves, respirators and ballistic helmets all on hand.\n\n A US Marine Corps helicopter typically used to fly the president seen over Windsor Castle on Friday (Picture: Getty Images)\n\nSargent Hatfield said: ‘That is something which hopefully is very unlikely to happen, but if there was ever to be a firearms threat as well as CBRN, this is what we would deploy with our weapons system.’\n\nThe visit will mark an unprecedented second state occasion held for Trump, who was previously given the honour in 2019.\n\nTrump’s first UK state visit saw thousands take to the street in London in protest.\n\nSimilar demonstrations expected in the capital and Windsor throughout next week, with the Stop Trump Coalition expected to stage protests in central London and near Windsor Castle.\n\nActivists are also planning to launch the infamous Trump baby balloon, which features the president in a nappy holding a mobile phone.\n\n The Trump baby balloon being flown during the president’s first state visit, flanked by ‘babysitters’ in red boiler suits (Picture: PA)\n\nThe six-metre inflatable was flown in the skies during Trump’s last state visit, when it was flanked by campaigners in red flying suits dubbed ‘Trump’s babysitters’.\n\nThe original blimp was since purchased by the Museum of London, but campaign organisers say they are plotting a way of getting it or a replacement up again.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"The US president will arrive in the UK with his wife Melania within days.","url":"https://metro.co.uk/2025/09/15/inside-operation-donald-trumps-visit-restricted-airspace-7ft-fences-24161085/","image":"https://metro.co.uk/wp-content/uploads/2025/09/SEI_265735340-19ae.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-14 23:01:00","author":"Ryan Prosser","authors":["Ryan Prosser"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.109},{"id":360513670,"title":"Toby Tarrant admits ‘I would eat my wife by midnight on first day of the apocalypse’","text":"It’s always great to meet a fan – but I did wonder what Toby Tarrant saw in us. He’s well-known for going through the Daily Star every day, picking out stories to share with the listeners on his Radio X lunchtime show. And then I see him on Zoom and it all becomes clear. This man is one of us. He might have grown up showbiz royalt y, the son of legendary broadcaster Chris Tarrant , but his heart is pure Daily Star journalist. Which means he’s obviously given some intense thought to the issues facing modern society. “I reckon about four o’clock in the afternoon on the first day of the apocalypse, I’d be looking at my wife, drooling and picturing her as a chicken drumstick,” he says. “I’d be useless. I would be eating my wife by midnight on the first day.” But does Toby think his wife, respected Heart producer Pippa Taylor, would put up with that? He considers this. “Well, she did a lot of kickboxing when she was younger. She’d be eating me for breakfast, lunch and dinner, I wouldn’t stand a chance. “She’s a very attractive, lovely woman. I’m sure she could meet somebody else in the apocalypse.” The pair have been together since 2017, when they both worked on Radio X’s Chris Moyles Show. Toby, 33, says they had to hide the romance at first, to avoid probing questions from their famously nosy ex-boss. But it’s his famous dad who’s got him considering the end of the world. Given the state of international politics, with Donald Trump in the White House and wars in the Ukraine and Middle East, it does feel like a frightening time to be alive. “I asked my dad just two weeks ago,” he says. “‘The world’s pretty scary at the moment. There’s lots of big egos and powerful men whose mums clearly didn’t hug them enough in charge. Was the Cold War ten times worse than this?’ “And dad said ‘oh no, this is way scarier than the Cold War ever was. The Cold War was this hypothetical threat that never really went anywhere. This stuff’s going places.’” And at 78 years old, the former host of Who Wants To Be A Millionaire has been around long enough to know what he’s talking about. Which brings us back to Toby’s love affair with the Daily Star. When he first worked at Radio X in 2016, he started each day by going through a stack of papers, looking for “anything silly, anything weird, anything stupid to talk about” on his show. “Over years I realised that the only one I needed was the Daily Star, because it amalgamated all the weird and silly stories into one convenient package,” he explains. And in times like these, he believes that’s more important than ever. “I grew up in a household where the mentality was very much, when things are sad and heavy, make a joke out of it. Because it’s the only way to get through it. “If you let it get you down, we’d all just be sitting in the corner, rocking back and forth, chuntering to ourselves and crying. “I always remember that my grandpa’s funeral was the saddest day of my life. But whenever I look back – we laughed so much, because my family’s approach was to sit around and make jokes.” It’s an attitude that’s served Toby well during his radio career, which has put him through some fairly gruelling trials. When he attempted Pete Doherty’s Mega Breakfast Challenge in 2023, he was visibly suffering. Then there was the time last October he spent five straight days in the Thames on a unicorn pedalo. The stunt raised £300,000 for Radio X’s charity Make Some Noise, but it didn’t exactly look easy. “It was one of the worst weeks of my life,” he admits. “When we got to the final day, the swell got a bit dicey and I thought ‘this is how I go. What an embarrassing, bleak way to die.’” And there we have to disagree. We’ve all got to go somehow – and a unicorn pedalo incident sounds as good a way as any. If you’re reading this Toby, you’re part of the Daily Star family now. We won’t necessarily be there to fish you out of a river. But we’re certainly happy to make jokes about it. Listen to Radio X with Toby Tarrant weekdays from 10:00-13:00 across the UK and on Global Player.","summary":"Radio X presenter Toby Tarrant is famously keen on the Daily Star – and the feeling is mutual. We sit down for a chat to mark the station’s 10th anniversary","url":"https://www.dailystar.co.uk/showbiz/toby-tarrant-admits-i-would-35895618","image":"https://i2-prod.dailystar.co.uk/article35900903.ece/ALTERNATES/s1200b/1_Toby-Tarrant-1.jpg","video":null,"publish_date":"2025-09-14 23:01:00","author":"Meg Jorsh","authors":["Meg Jorsh"],"language":"en","source_country":"gb","sentiment":0.031},{"id":360508508,"title":"Officers prepared for high-threat incident ahead of Trump visit, police say","text":"Police have said officers will be ready to respond to a potential high-threat incident in Windsor ahead of Donald Trump’s state visit.\n\nThe King is to host the US president and his wife, first lady Melania Trump, at Windsor Castle from September 17 to 19, where they will be feted with a ceremonial welcome and state banquet.\n\nA 24-hour-a-day policing operation will be in place in the Berkshire town during the event, with a temporary order restricting the airspace from September 16 – when the state visit rehearsal is to take place – until September 18.\n\nArmed officers will be patrolling the streets with Armed Response Vehicles (ARVs) ready to respond in case of increased threat, Thames Valley Police said last week during a media briefing at the force’s training centre in Sulhamstead, Berkshire.\n\n“We have considered anything from a low to a hight-threat incident, and it’s a very comprehensive security operation as a result,” police sergeant and operational firearms commander Daniel Hatfield said.\n\n“Every single state visit or policing operation of this nature comes with its own merits, and every operation or plan is constructed individually.”\n\nSergeant Hatfield added: “It’s not the first time a president of the United States has visited Windsor and relationships with our American colleagues are well forged, well practised, so it makes planning a security operation like this a lot easier.”\n\nOfficers will have access to a wide range of equipment and weapons, including Tasers, baton guns which propel rubber bullets, Glock 17 sidearms, Lewis Machine & Tool rifles, and shotguns, which are used on dangerous animals.\n\nAdditionally, police officers will have access to overalls, gloves, respirators and ballistic helmets “for anything that is CBRN-related – chemical, biological, radiological and nuclear,” Sergeant Hatfield said.\n\n“That is something which hopefully is very unlikely to happen, but if there was ever to be a firearms threat as well as CBRN, this is what we would deploy with our weapons system,” Sergeant Hatfield added.\n\nThe equipment will be kept in ARV vans, alongside a first-aid kit and ballistic protection shields, police said.\n\nThe trip next week will be Mr Trump’s second state visit to the UK – an unprecedented gesture towards a US president. He was previously feted with a state visit in 2019.\n\nHis first state visit to the UK saw thousands of people turn out on the streets in London in opposition, and protests are also expected to take place next week.\n\nThe Stop Trump Coalition are to stage a mass demonstration in central London on the first day of the trip, with a further protest planned near Windsor Castle.","summary":"A 24-hour-a-day policing operation will be in place in the Berkshire town during the state visit, Thames Valley Police said.","url":"https://www.standard.co.uk/news/uk/thames-valley-police-police-melania-trump-trump-berkshire-b1247709.html","image":"https://static.standard.co.uk/2025/09/15/00/6139cbfcc6702e10c564c78da0f627d4Y29udGVudHNlYXJjaGFwaSwxNzU3NDk3ODUz-2.81296613.jpg?width=1200","video":null,"publish_date":"2025-09-14 23:01:00","author":"Mathilde Grandjean","authors":["Mathilde Grandjean"],"language":"en","category":"politics","source_country":"gb","sentiment":0.1},{"id":360508498,"title":"UK and US agree deal to speed up building of nuclear plants","text":"The UK and US have agreed a deal to boost the building of nuclear plants in both countries to be signed during Donald Trump’s state visit this week.\n\nDowning Street said the week would see a “step change” in the UK-US relationship as Sir Keir and Mr Trump are expected to also sign a tech partnership and deepen cultural ties.\n\nThe “unbreakable friendship” is set to “reach new heights” during the state visit, No 10 said.\n\nThe Atlantic Partnership for Advanced Nuclear Energy is expected to be signed during the president’s visit and will enable deals between US and UK companies.\n\nThis should make it quicker for companies to build nuclear power stations by cutting red tape and workloads to speed up the time for projects to get a licence from around three or four years to roughly two.\n\nThis will clear the way for a major expansion of nuclear projects in Britain as part of the Government’s drive to produce clean energy.\n\nSir Keir said: “This landmark UK-US nuclear partnership is not just about powering our homes, it’s about powering our economy, our communities, and our ambition.\n\n“These major commitments set us well on course to a golden age of nuclear that will drive down household bills in the long run, while delivering thousands of good jobs in the short term.”\n\nUnder the civil nuclear deal, both countries will fast-track reactor design checks.\n\nThis will mean that if rigorous safety checks have been passed in one country, that can be used to speed up assessment in the other.\n\nThis aims to speed up approvals for nuclear to around two years for advanced designs like the Rolls-Royce small modular reactor.\n\nThe two countries will also share the workload of site licensing for new projects to get them approved more quickly.\n\nCommercial deals set to be announced this week include:\n\n– X-Energy and Centrica plan to build up to 12 advanced modular reactors in Hartlepool, which is expected to generate power for up to 1.5 million homes and created up to 2,500 jobs\n\n– Holtec, EDF and Tritax plan to develop advanced data centres at the former Cottam coal-fired power station in Nottinghamshire. They will be powered by small modular reactors\n\n– Last Energy and DP World plan to set up a micro-modular nuclear power plant backed by £80 million in private investment, which will provide a clean power supply for the expansion of DP World’s London Gateway port\n\n– Urenco and Radiant are signing a deal worth 4 million dollars to supply advanced HALEU fuel to the US market\n\n– TerraPower and KBR plan to conduct studies and evaluate sites in the UK for Natrium advanced reactor technology\n\nThe Prime Minister’s official spokesman said the special relationship between the UK and US has become one of the “most enduring alliances in modern history”.\n\n“Our special relationship has evolved into one of the most enduring alliances in modern history, rooted in shared values, friendship, mutual trust and a belief in the rule of law, democracy and open markets, and that unbreakable friendship will reach new heights at the state visit this week,” he said.\n\nThe two nations already have more than £1.2 trillion invested in each other’s economies, he noted.\n\n“And this week, we are delivering a step change in that relationship with leaders expected to sign a world-leading tech partnership that will genuinely change the lives of British and American people, and we will go further in powering Britain and delivering energy security with a major civil nuclear deal.\n\n“We will deepen our cultural ties too, ensuring grassroots American sport such as basketball is accessible in communities across the UK, and we will develop partnerships between some of our finest heritage and art institutions to ensure our shared history is part of our future too.”\n\nAndrew Bowie, shadow minister of state for energy, said: “All these announcements are simply building on the strong legacy left by the previous Conservative government who kick-started the nuclear revolution in the UK. However we would have gone bigger and quicker.”\n\nSam Richards, CEO of pro-growth campaign group Britain Remade, said: “If the new ‘golden age’ for nuclear power is to mean anything, we need to slash the time it takes to get reactors from the drawing board to spades in the ground so that Britain’s industrial heartlands can once again thrive.”","summary":"The Atlantic Partnership for Advanced Nuclear Energy is expected to be signed later this week.","url":"https://www.standard.co.uk/news/politics/sir-keir-downing-street-centrica-nottinghamshire-edf-b1247700.html","image":"https://static.standard.co.uk/2025/09/15/00/776bee4ba6405f8be20ae22a58fc4ee8Y29udGVudHNlYXJjaGFwaSwxNzU3OTY4MjA2-2.81558478.jpg?width=1200","video":null,"publish_date":"2025-09-14 23:01:00","author":"Helen Corbett","authors":["Helen Corbett"],"language":"en","category":"politics","source_country":"gb","sentiment":0.297},{"id":360520694,"title":"The new Great Depression is more than economic","text":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics.\n\nHave we entered a new age of American malaise?\n\nNew data from Gallup finds that just over 18% of American adults have or are being treated for depression, meaning that an estimated 48 million adults are depressed. Not only does that mark the third year in a row with a share around 18%, but also all three of those years are starkly higher than the average of 12.8% who reported being depressed between 2015 and 2020.\n\nWhile those date ranges largely sort into pre- and post-pandemic timeframes, the potential causes are a lot messier the more you dig into the data.\n\nThe biggest increases in rates of depression were among adults ages 18 to 29 and adults whose household income was less than $24,000 a year. Each saw around a 13-percentage-point increase in depression since 2017. As Gallup notes, younger and lower-income Americans’ financial struggles no doubt contribute to their higher depression rates After all, the pandemic rattled the job and housing markets, which haven't stabilized since then.\n\nThe trouble is, the Trump administration is trying its hardest to make these problems worse.\n\nIn July, President Donald Trump signed his tax legislation, which primarily transfers wealth from the poorest Americans to the richest. It does this by gutting Medicaid and federal food assistance, costing the poorest Americans roughly $1,200 every year, according to the nonpartisan Congressional Budget Office. Meanwhile, the richest Americans will see their incomes increase by nearly $14,000 a year.\n\nAlthough the Trump administration may soon declare a national housing emergency—and it is an emergency—it surely won't use this proclamation to build more affordable housing or increase population density. After all, it’s hard to think of things that the right hates more than cities and public housing.\n\n“In fact, Trump’s non-housing policies will discourage home construction,” Nobel Prize-winning economist Paul Krugman wrote on his Substack in early September. “Nothing says ‘make housing cheaper’ like imposing a 35% tariff on imports of Canadian lumber and deporting many of the immigrant workers crucial to the U.S. construction industry.”\n\nBut it's not just housing and employment sectors that feel hopeless. The last time a majority of registered voters thought the economy was getting better was in February 2018. Sixty-four percent of Americans see racism against Black people as widespread in the country, and that number has been increasing since at least 2009. For the past four years, around 40% of American parents fear for their children's safety at school—the highest rates since the years immediately following the Columbine High School massacre, in 1999. High-profile acts of political violence appear to be on the rise, like Wednesday’s assassination of bigoted right-wing activist Charlie Kirk. Things aren’t looking great.\n\nIn fact, earlier this year, Gallup found that Americans are less satisfied with 26 of 28 national issues than they were in 2017, at the start of Trump's first term. Their falling satisfaction spans issues from the size and influence of major corporations (down 14 points from 2017) to the national quality of public education (down 13 points). But the issue with the largest drop in satisfaction since 2017? “The overall quality of life,” which plummeted 18 points.\n\nIn its writeup of the depression-focused survey, Gallup notes that the share of Americans who report feeling lonely (21%) is the highest it has been since March 2021, while the COVID-19 pandemic still raged. And conservatism's goals have long been for people to not see themselves as part of a large collective.\n\n“There's no such thing as society,” said conservative icon Margaret Thatcher, who was then the prime minister of the United Kingdom, in 1987. “There are individual men and women and there are families. And no government can do anything except through people, and people must look after themselves first. It is our duty to look after ourselves and then, also, to look after our neighbors.”\n\nBut Trump and the modern right seek to stratify society even more, to pit neighbor against neighbor, to eliminate the collective. Look at the response to COVID-19 alone: Conservatives went frothy at the mouth over the idea of getting vaccinated to help, if not themselves, then their immunocompromised neighbors. Or look at climate change, and how the conservative movement is repulsed by the prospect of people banding together to fight an existential threat. After all, this is the crowd that greets anyone even slightly to their left with \"Fuck your feelings.”\n\nSince the COVID-19 pandemic, perhaps the most important question facing America is: How do you have a functioning society when so many neighbors hate each other, when so few are satisfied with the quality of life, and the government seems unable or unwilling to fix things?\n\nYeah, that is pretty depressing.\n\nAny updates?\n\n Trump wants more war, or at least things to be named \"war,\" because the word “war” is cool and manly, or something. But his move to rebrand the Department of Defense as \"the Department of War” faces a chilly public reception, to say the least. Just 21% of Americans support the rebrand, while 59% oppose it, according to a new survey from YouGov.\n\n Late last month, Trump tried to fire Federal Reserve Governor Lisa Cook, a move she is disputing and suing over, as he seeks to put the national banking system under his control and further hobble the American economy. Unsurprisingly, Americans widely oppose Trump's actions, with 70% saying he should not be able to can members of the Federal Reserve Board if they don't share his opinions, per a new YouGov poll for CBS News. What's more, 68% of Americans want the Federal Reserve to act independently from Trump, thereby revealing that his authoritarian project lacks a public mandate.\n\n Amid Trump and the right’s assault on the nation’s schools, especially its universities, Americans’ perception of the importance of higher education is at a new low. Gallup finds that just 35% of Americans think that going to college is “very important.” Forty percent say college is “fairly important,” while 24% say college is “not too important.”\n\nOn Wednesday, shortly after Kirk’s murder, YouGov asked Americans whether violence could ever be justified to reach political goals. Eleven percent of Americans say it can be, and that includes 14% of Democrats, 13% of independents, and 6% of Republicans. But these responses are no doubt tempered by the assassination of a right-wing figure, changing how acceptable partisans say violence is or isn’t. \n\nAfter all, polling not conducted immediately following an assassination has found Republicans more supportive than Democrats of political violence. For instance, a poll fielded last June by the Public Religion Research Institute found that 27% of Republicans agreed that “true American patriots may have to resort to violence in order to save our country”—while only 8% of Democrats did.\n\nHowever, it’s very likely these polls overstate Americans’ appetite for violence. \n\nA 2022 study published in the esteemed scientific journal PNAS finds that past research tended to vastly overrepresent the public’s support for political violence. This was primarily due to “random responding by disengaged respondents” and “a reliance on hypothetical questions about violence in general instead of questions on specific acts of political violence,” according to the study’s authors.\n\nThe study controlled for respondents’ engagement and asked them more specific questions—and support for political violence was far, far smaller. When asked whether a politically motivated shooter should be charged with a crime—notice the specificity there—96% or more of engaged respondents said “yes,” regardless of the party affiliations of the shooter and the victim.\n\n“A small share of Americans support political violence, but most of this support comes from a troubling segment of the public who support violence in general. Even among this group, support is further contingent on the severity of the violent act and is generally limited to relatively minor crimes,” the study’s authors wrote. “Mainstream Americans of both parties have little appetite for violence—political or not.”","summary":"Survey Says is a weekly series rounding up the most important polling trends or data points you need to know about, plus a vibe check on a trend that’s driving politics.\n\n\n\n\nHave we entered a new age of American malaise?\n\n\n\nNew data from Gallup finds that just over 18% of American adults have or are being treated for depression, meaning that an estimated 48 million adults are depressed. Not only does that mark the third year in a row with a share around 18%, but also all three of those years are starkly higher than the average of 12.8% who reported being depressed between 2015 and 2020.\n\n\n\n\n\nx\nDatawrapper Content\n\n\nWhile those date ranges largely sort into pre- and post-pandemic timeframes, the potential causes are a lot messier the more you dig into the data.\n\n\n\nThe biggest increases in rates of depression were among adults ages 18 to 29 and adults whose household income was less than $24,000 a year. Each saw around a 13-percentage-point increase in depression since 2017. As Gallup notes, younger and lower-i","url":"https://www.dailykos.com/story/2025/9/14/2342794/-The-new-Great-Depression-is-more-than-economic?pm_campaign=blog&pm_medium=rss&pm_source=","image":"https://cdn.prod.dailykos.com/images/1477455/story_image/Survey.png?1757693063","video":null,"publish_date":"2025-09-14 23:00:06","author":"Andrew Mangan","authors":["Andrew Mangan"],"language":"en","source_country":"US","sentiment":0.089},{"id":360519058,"title":"Canadian veteran journalist and CTV News anchor Beverly Thomson dead at 61 (Entertainment)","text":"Canadian journalist and longtime CTV News anchor Beverly Thomson has died.\n\nThomson, who is best known for her high-profile interviews with politicians and celebrities, died on Sunday morning surrounded by her family after a long battle with cancer, CTV News reported. She was 61.\n\nThomson joined CTV News Toronto as a reporter, where she most recently worked as a CTV News Channel anchor.\n\nHer career spanned over 30 years and included coverage of the 2016 U.S. presidential election and featured interviews with Celine Dion, Shania Twain, Donald Trump and Canadian astronaut Chris Hadfield.\n\nLast October, Thomson was awarded the lifetime achievement award by the Radio Television Digital News Association of Canada.\n\nWhen presented the award, then-RTDNA Canada president Lis Travers called Thomson “one of Canada’s most respected news personalities.”\n\nVice-president of News at Bell Media Richard Gray said Thomson was a \"trusted voice and a valued teammate to all of us at CTV News\" in a statement on Sunday.\n\n“Bev's natural on-air style created an immediate connection with viewers. For decades, she also made a significant impact across the country with her vocal support and advocacy for cancer charities,\" Gray wrote.\n\n\"Bev will be dearly missed by all of us at CTV News. We extend our deepest condolences to her family and loved ones.”","summary":"Canadian journalist and longtime CTV News anchor Beverly Thomson has died. Thomson, who is best known for her high-profile interviews with politicians and celebrities, died on Sunday morning surrounded by her family after a long battle with cancer, CTV News reported. She was 61. Thomson joined CTV N...","url":"https://www.castanet.net/news/Entertainment/572299/Canadian-veteran-journalist-and-CTV-News-anchor-Beverly-Thomson-dead-at-61","image":"https://www.castanet.net/content/2025/9/c4578dae3b6427155219e3c8e750783407712a93a07d6b39df45592d48c97db6.jpg","video":null,"publish_date":"2025-09-14 22:54:00","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":0.425},{"id":360520058,"title":"Trump says he is willing to impose sanctions on Russia - TradingView","text":"President Donald Trump said on Sunday he is willing to impose sanctions on Russia but Europe has to act in a way that is commensurate with the United States.\n\n\"Europe is buying oil from Russia. I don't want them to buy oil,\" Trump told reporters on Sunday. \"And the sanctions ... that they're putting on are not tough enough, and I'm willing to do sanctions, but they're going to have to toughen up their sanctions commensurate with what I'm doing.\"","summary":"Trump says he is willing to impose sanctions on Russia  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3V1060:0-trump-says-he-is-willing-to-impose-sanctions-on-russia/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-09-14 22:45:47","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.778},{"id":360512006,"title":"Canadian veteran journalist and CTV News anchor Beverly Thomson dead at 61","text":"Thomson joined CTV News Toronto as a reporter, where she most recently worked as a CTV News Channel anchor.\n\nHer career spanned over 30 years and included coverage of the 2016 U.S. presidential election and featured interviews with Celine Dion, Shania Twain, Donald Trump and Canadian astronaut Chris Hadfield.\n\nLast October, Thomson was awarded the lifetime achievement award by the Radio Television Digital News Association of Canada.\n\nWhen presented the award, then-RTDNA Canada president Lis Travers called Thomson “one of Canada’s most respected news personalities.”\n\nVice-president of News at Bell Media Richard Gray said Thomson was a “trusted voice and a valued teammate to all of us at CTV News” in a statement on Sunday.\n\n“Bev’s natural on-air style created an immediate connection with viewers. For decades, she also made a significant impact across the country with her vocal support and advocacy for cancer charities,” Gray wrote.\n\n“Bev will be dearly missed by all of us at CTV News. We extend our deepest condolences to her family and loved ones.”","summary":"TORONTO &#8212; Canadian journalist and longtime CTV News anchor Beverly Thomson has died. Thomson, who is best known for her high-profile interviews with politicians and celebrities, died on Sunday morning surrounded by her family after a long battle with cancer, CTV News reported. She was 61. Thomson joined CTV News Toronto as a reporter, where [&#8230;]","url":"https://torontosun.com/entertainment/television/canadian-veteran-journalist-and-ctv-news-anchor-beverly-thomson-dead-at-61","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2025/09/12180554_49655490-e1757889710902.jpg?quality=100&strip=all","video":null,"publish_date":"2025-09-14 22:42:25","author":"Canadian Press","authors":["Canadian Press"],"language":"en","source_country":"ca","sentiment":0.577},{"id":360512562,"title":"Israel intensifies Gaza City bombing as Rubio arrives","text":"Israeli forces destroyed at least 30 residential buildings in Gaza City and forced thousands of people from their homes, Palestinian officials said, as U.S. Secretary of State Marco Rubio arrived on Sunday to discuss the future of the conflict.\n\nIsrael has said it plans to seize the city, where about a million Palestinians have been sheltering, as part of its declared aim of eliminating the militant group Hamas, and has intensified attacks on what it has called the last bastion of the militant Palestinian group.\n\nHamas’ political leadership, which has engaged in on-and-off negotiations on a possible ceasefire and hostage release deal, was targeted by Israel in an airstrike in Doha on Tuesday in an attack that drew widespread condemnation.\n\nQatar will host an emergency Arab-Islamic summit on Monday to discuss the next moves. Rubio said Washington wanted to talk about how to free the 48 hostages still held by Hamas in the Gaza Strip and rebuild the coastal strip. Only 20 are believed to be alive.\n\nOnce there, Rubio visited the Western Wall Jewish prayer site in Jerusalem. He was expected to hold talks with Prime Minister Benjamin Netanyahu.\n\nThe Western Wall visit was “reaffirming America’s recognition of Jerusalem as Israel’s eternal capital,” according to a statement from the State Department.\n\nIn late 2017, during his first term as president, Donald Trump formally recognized Jerusalem as the capital of Israel and subsequently moved the U.S. embassy there from Tel Aviv.\n\nPhilippe Lazzarini, commissioner-general of the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), said in a post on X on Sunday that the agency had stopped services at the Beach camp clinic, which he said is the only health care available in the enclave north of Wadi Gaza.\n\nWater and sanitation services are now at half capacity, Lazzarini said, adding that 10 UNRWA buildings have been struck in Gaza City in the past four days.","summary":"Israeli forces destroyed at least 30 residential buildings in Gaza City and forced thousands of people from their homes, Palestinian officials said, as U.S. Secretary of State Marco Rubio arrived on Sunday to discuss the future of the conflict. Israel has said it plans to seize the city, where about a million Palestinians have been [&#8230;]","url":"https://www.fbcnews.com.fj/world/israel-intensifies-gaza-city-bombing-as-rubio-arrives/","image":"https://www.fbcnews.com.fj/wp-content/uploads/2025/09/U.S.-Secretary-of-State-Marco-Rubio-and-Israeli-Prime-Minister-Benjamin-Netanyahu-visit-the-Western-Wall-Judaisms-holiest-prayer-site-in-Jerusalems-Old-City.jpg","video":null,"publish_date":"2025-09-14 22:40:54","author":"Reuters],Timoci Batibasaga","authors":["Reuters]","Timoci Batibasaga"],"language":"en","category":"politics","source_country":"fj","sentiment":-0.126},{"id":360511346,"title":"Fashion code Melania Trump must follow on her Royal visit... and the rule she absolutely CANNOT break to make trip the jewel in her First Lady crown","text":"This week, Melania Trump is set to accompany her husband, President Donald Trump, on a three-day official state visit to the UK - and many eyes will be on her.\n\nAlthough she often keeps a low-profile, rarely joining him on White House engagements, Melania will make an exception.\n\nKing Charles III and Queen Camilla will host the First Couple at Windsor Castle, as Buckingham Palace - usually where state visits take place - is under renovation. \n\nTrump and Melania - who are set to arrive in the UK on Tuesday - crossed the pond in 2019 for a similar three-day state visit during his first term. But that time, they met with the late Queen Elizabeth II and attended multiple events, including a dinner with the royal family at Winfield House in London. This visit includes a grand state banquet.\n\nDuring the 2019 trip, Melania stunned in her outfits, some of which were made by British designers. One of her Gucci dresses even featured a playful nod to the country with prints of beloved London landmarks including Big Ben, Tower Bridge, double-decker buses and the Houses of Parliament.\n\nLocal designers included Burberry and Irish-born milliner Philip Treacy. \n\nShe supplemented those with other outfits from Italian luxury fashion house Dolce & Gabbana, and American designers Michael Kors and Ralph Lauren, one of her favorites. \n\nMelania mostly chose muted tones, wearing a lot of navy blue, khaki and white. But she pulled out a bright red, beaded cape dress by Givenchy for dinner at the US Ambassador's residence.\n\nAccording to both royal experts and stylists, there are some particular fashion rules Melania will want to follow this time around. \n\nDavid Loranger, PhD and associate professor of fashion marketing and merchandising at Sacred Heart University, told the Daily Mail exclusively about what the First Lady needs to wear in order to avoid a public gaffe.\n\n'During a state visit, it's generally a faux pas to wear anything that might compete with your host. In other words, if she tried to load up on jewelry (such as a tiara) to compete with the Royals, it could be considered bad form.\n\n'She's also had issues wearing items that contain messaging, such as the \"don't care\" jacket which, whether she intended it or not, sent a message. So that should be avoided.'\n\nHe also said any type of UK-specific dress item or pattern, like the plaid tartan, 'might be viewed as appropriation' and should be 'edited out' of stylists' selects.\n\nLoranger stressed that Melania needs to be extra careful with her outfits, especially because 'anything she wears could be misconstrued due to increased tensions related to the US's relatively antagonistic stance towards the UK in recent months.'\n\nHe recommended that the First Lady stick to classic looks on this particular trip. \n\nAnd, in a shift from tradition, the professor revealed that he thinks Melania should not wear a British designer during the visit.\n\n'She's there as a representative of the American People, therefore, she should fulfill that role by wearing an American designer.\n\n'I think it enhances the festivity of the occasion by displaying an American perspective on fashion and style. \n\n'She also should consider perceptions back home in the US. The administration has been dogged about \"Made in America\" and they should walk the walk, or ironically risk being viewed as unauthentic.'\n\nUK police are set to launch one of the largest drone operations in British history to counter any threats during Trump and Melania's trip. \n\nPilots from Thames Valley and other forces including Hampshire Constabulary will fly the devices above a ring of steel on the ground surrounding Windsor Castle.\n\nThe policing operation will be the largest since the King’s coronation in 2023, and the scale of resources deployed will be similar to that of Queen Elizabeth II's funeral, sources told the Daily Mail.","summary":"An expert has revealed the clothing protocol that Melania Trump must follow during her UK state visit this week.","url":"https://www.dailymail.co.uk/femail/article-15081203/melania-trump-avoid-royal-fashion-rules-uk-state-visit.html","image":"https://i.dailymail.co.uk/1s/2025/09/10/15/101980751-0-image-m-109_1757516102951.jpg","video":"https://videos.dailymail.co.uk/video/mol/2019/12/03/8404457070489653051/1024x576_MP4_8404457070489653051.mp4","publish_date":"2025-09-14 22:40:23","author":"Editor,Jane Herz","authors":["Editor","Jane Herz"],"language":"en","source_country":"GB","sentiment":0.312},{"id":360511504,"title":"U.S. immigration authorities detain 73-year-old Sikh woman in California; family calls for her release","text":"A 73-year-old Sikh woman has been detained by immigration authorities in California after she went for a routine check-in with the U.S. agency, sparking protests and concerns among her family and members of the community.\n\nHarjit Kaur, who has lived in the East Bay in Northern California for more than 30 years, was detained by Immigration and Customs Enforcement (ICE) officials during a routine check-in earlier this week, a report in Berkeleyside, a non-profit news portal, said.\n\nThe report added that her family, along with hundreds of members from the community, organised a protest Friday (September 12, 2025), calling for the immediate release of Kaur, who was detained on Monday (September 8, 2025) after ICE asked her to come to the San Francisco office to turn in additional paperwork.\n\n “She was taken to a detention centre in Bakersfield,” the report said.\n\nHarjit Kaur was undocumented, according to a report in ABC7 News. She came to the United States in 1992 from India as a single mother with two sons. Her asylum case was denied in 2012, but since then she has “faithfully reported” to ICE in San Francisco every six months for more than 13 years, her daughter-in-law Manji Kaur said.\n\nTheBerkeleyside report said that “ICE assured her she could remain in the United States under supervision with work permits until they could receive her travel documents.”\n\nThe protest on Friday (September 12, 2025) was organised by Kaur’s family, Indivisible West Contra Costa County and the Sikh Centre. Members of U.S. Rep. John Garamendi’s staff, local elected officials and other political leaders also attended, the report said.\n\nKTVU Fox 2 news portal quoted Congressman Garamendi as saying that his office has sent an inquiry to ICE requesting that Kaur be reunited with her family.\n\nIn a statement, Mr. Garamendi said, “President (Donald) Trump initially promised to go after the ‘worst of the worst’ in his immigration policy. Yet this administration’s decision to detain a 73-year-old woman — a respected member of the community with no criminal record who has faithfully reported to ICE every six months for more than 13 years — is one more example of the misplaced priorities of Trump’s immigration enforcement.” \n\n“Our office will do everything possible to support her case and her family,” he said. Local Council member Dilli Bhattarai said, according to The Berkeleyside report, that he is looking into how his city can put pressure on the federal government to release Kaur.\n\n“She is not doing any harm to the community. She is an abiding [constituent] just like us,” Bhattarai said. “She has all the rights to be here as a community member and we should all support her immediate release.” \n\nKaur, who has two grandsons and three granddaughters, among other relatives, had worked for over two decades at a local Indian clothing store, the report said.\n\nHer granddaughter Sukhdeep Kaur described Kaur as an “independent, selfless, hard-working” person and termed her as a “mother figure” [to the community].\n\n“We are all just in a state of shock,” Sukhdeep Kaur said.\n\nHer family voiced concern over her health, claiming that being detained at her age with serious health issues such as thyroid disease, migraine, knee pain, and anxiety, her life could be at risk, the report added.","summary":"Harjit Kaur, who has lived in the East Bay in Northern California for more than 30 years, was detained by Immigration and Customs Enforcement officials during a routine check-in earlier this week","url":"https://www.thehindu.com/news/international/us-immigration-authorities-detain-73-year-old-sikh-woman-in-california-family-calls-for-her-release/article70050471.ece","image":"https://th-i.thgim.com/public/incoming/58j2kw/article70050472.ece/alternates/LANDSCAPE_1200/iStock-121586241%201.jpg","video":null,"publish_date":"2025-09-14 22:35:53","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.081},{"id":360518614,"title":"The Federal Reserve is about to have an extremely awkward meeting","text":"The Federal Open Market Committee’s two-day meeting will start on Tuesday. On Wednesday afternoon, it will announce its policy decision. According to CME’s FedWatch tool, markets are pricing in 96.4% odds for a quarter-point cut and 3.6% odds for a half-point cut. The benchmark rate is currently 4.25%-4.5%.\n\nThe rate announcement will also be accompanied by a so-called “dot plot” of fresh forecasts on rates, inflation and GDP growth from Fed officials. Chairman Jerome Powell will hold a press briefing soon afterward.\n\nWhile there is little doubt about the outcome of the Fed meeting, there are still questions over who exactly will be voting—setting up some very awkward dynamics.\n\nStephen Miran: why not both?\n\nSenate Republicans hope to confirm Stephen Miran as a Fed governor on Monday so that he can participate when the meeting starts on Tuesday. \n\nHis decision not to resign from his White House economic adviser role while he serves on the Fed board and instead take a leave of absence is unprecedented, with critics saying it leaves him too vulnerable to pressure from President Donald Trump—who is already trying to fire Fed Governor Lisa Cook.\n\nMiran has also previously criticized the Fed’s consensus-based approach and accused it of “groupthink.” Before joining the administration, he proposed reforms that would weaken Fed independence and argued that monetary policy would be better served with some arguments. \n\nWill he tear into his new coworkers on his very first day?\n\nEither way, get ready for more contested votes rather than the typical unanimous decisions. In a note on Friday, JPMorgan chief U.S. economist Michael Feroli said he expects the upcoming meeting to feature two or three dissents for a larger cut.\n\nAt the Fed’s last meeting Fed governors Christopher Waller and Michelle Bowman broke from other policymakers by calling for a quarter-point cut. It’s possible they could dissent again by voting for a half-point cut, Feroli said, with Miran expected to “dutifully dissent for a larger cut” as well.\n\nIt remains to be seen how long Miran’s Fed tenure will be. But in a note last month, JPMorgan said his appointment to the Fed “fuels an existential threat as the administration looks likely to take aim at the Federal Reserve Act to permanently alter U.S. monetary and regulatory authority.”\n\nLisa Cook: ‘Fed independence would be over’\n\nThe other question mark is whether Cook will be at the FOMC meeting. After Trump took the unprecedented step of firing her, claiming mortgage fraud, she sued to stay in her post. Cook denied the accusations and said Trump’s attempt to oust her is illegal. \n\nIn addition to Trump, Cook’s lawsuit also named the Fed’s board of governors, including Powell, as defendants. While her Fed colleagues weren’t involved in her dismissal, Powell was named in the suit “to the extent that he has any ability to take any action to effectuate President Trump’s purported termination of Governor Cook.” \n\nA federal court sided with Cook, saying she can serve while litigation plays out, and new evidence has emerged that undercuts Trump’s accusations against her. But the Trump administration is fighting the decision in an appeals court. \n\nOver the weekend, lawyers for both sides filed fresh arguments. The administration said it seeks to ensure “the integrity of the Federal Reserve.” Cook’s team said Trump has not shown sufficient cause and that a ruling in his favor would mean he could fire other governors on “similarly flimsy pretexts.”\n\n“The era of Fed independence would be over. The risks to the nation’s economy could be dire,” the filing said.\n\nIf Cook is cleared to take part in the FOMC meeting, it may be awkward to discuss monetary policy with people she is also suing. But as central bankers prioritizing the Fed’s dual mandate, they are likely to consider it business and not personal.","summary":"While there is little doubt about the outcome of the Fed meeting, there are still questions over who exactly will be voting.","url":"https://fortune.com/2025/09/14/fed-meeting-preview-fomc-stephen-miran-lisa-cook-jerome-powell-trump/","image":"https://fortune.com/img-assets/wp-content/uploads/2025/09/GettyImages-2225581564-e1757882072149.jpg","video":null,"publish_date":"2025-09-14 22:33:09","author":"Jason Ma","authors":["Jason Ma"],"language":"en","category":"politics","source_country":"US","sentiment":-0.034},{"id":360510680,"title":"Is there any prospect of ending Russia’s war in Ukraine?","text":"United States President Donald Trump pledged numerous times before returning to office that he would end Russia’s war on Ukraine within a day.\n\nBut last week, he admitted that the war had proved far more difficult to resolve than other conflicts.\n\nMeanwhile, the fighting continues, with swarms of drones launched by both sides hitting targets in Russia and Ukraine.\n\nThe battle for territory grinds on slowly but brutally in eastern Ukraine – both above and below ground.\n\nThere is also anxiety in Europe after Russian drones entered the airspace of two NATO members.\n\nThere is anxiety, too, at the level of support the US might offer in any confrontation.\n\nSo, a month after his face-to-face meetings with the leaders of Russia and Ukraine, what is Trump’s thinking about the war?\n\nAnd what is the strategy inside the Kremlin – and in Ukraine, and of its European allies?\n\nIs there any prospect of ending this war?\n\nPresenter: Adrian Finighan\n\nPavel Felgenhauer, analyst on defence and Russian foreign policy\n\nSteven Erlanger, chief diplomatic correspondent in Europe for The New York Times.\n\nNiall Stanage, White House columnist at The Hill newspaper","summary":"Can Trump fulfil his promise of ending the war, or is the conflict proving more complex than expected?","url":"https://www.aljazeera.com/video/inside-story/2025/9/14/is-there-any-prospect-of-ending-russias-war-in-ukraine?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/09/image-1757885893.jpg?resize=1920%2C1080&quality=80","video":null,"publish_date":"2025-09-14 22:33:03","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.177},{"id":360510686,"title":"Israel flattens more Gaza towers as strikes kill 53 and famine toll rises","text":"Israeli forces have intensified their bombardment of Gaza City, levelling three residential blocks and killing at least 53 Palestinians, including 35 in Gaza City, as families continue to flee under the threat of new forced evacuation orders.\n\nThe Israeli army marked the al-Kawthar tower in Gaza’s southern Remal neighbourhood as a target before destroying the building on Sunday with a series of missile strikes less than two hours later.\n\nAl Jazeera’s Hani Mahmoud, reporting from Gaza City, said: “It was another sleepless night for those in Gaza City, with the sounds of drones, the constant hum of machines of war, and the explosive remotely detonated robots across the city.”\n\nGaza’s Government Media Office slammed Israel’s “systematic bombing of towers, residential buildings, schools and civilian institutions with the aim of extermination and forced displacement”.\n\nIn a statement, it argued that while Israel claimed to be targeting armed groups, “the field realities prove beyond doubt that the occupation deliberately and according to a clear methodology bombs schools, mosques, hospitals and medical centres, destroys towers and residential buildings, destroys displaced persons’ tents, and targets the headquarters of various institutions, including international institutions working in the humanitarian field.”\n\n‘Nowhere in Gaza is safe’\n\nAs bombardments intensified, families were once again forced to flee south towards al-Mawasi, an area Israel has designated as a “safe zone” despite repeatedly attacking it.\n\nAhmed Awad told Al Jazeera that he had escaped northern Gaza on Saturday as “mortar shells rained down”. He described arriving at midnight to find “no water, no toilets, nothing. Families are sleeping in the open. The situation is extremely dire”.\n\nAnother displaced Palestinian, AbedAllah Aram, said his family faced a “severe shortage” of clean water. “Food is scarce, and inside these tents, people are hungry and malnourished. Winter is approaching, and we urgently need new tents. On top of that, this area cannot handle more displaced families,” he said.\n\nFrom al-Mawasi, UNICEF spokesperson Tess Ingram told Al Jazeera that conditions are worsening daily. “Nowhere in Gaza is safe, including in this so-called humanitarian zone,” she said. “The camp is becoming more and more crowded by the day.”\n\nShe recalled meeting a woman, Seera, who had been ordered to evacuate Gaza City while pregnant. “She went into labour in Sheikh Radwan and gave birth on the side of the road while trying to find help, whilst evacuation orders were being issued for that area,” Ingram said. “She is one of so many examples of families who have come here and now are struggling to access the basics they need to survive.”\n\nAl Jazeera’s Hind Khoudary, reporting from al-Mawasi, said displaced Palestinians there are facing an unbearable uncertainty. One man told her he had been searching for shelter for nearly a week.\n\n“I have a large family, including my children, mother and grandmother. Not only are missiles raining down on us, but famine is devouring us too. My family has been on a constant journey of displacement for two years. We can no longer endure the ongoing genocidal war or hunger,” he said. “Above all, we have no source of income to feed our starving children. Displacement is as painful as eviscerating one’s soul out of the body.”\n\nThe enclave’s Ministry of Health reported two more deaths from malnutrition in the past 24 hours, bringing the official famine toll to 422, including 145 children.\n\nSince the United Nations-backed Integrated Food Security Phase Classification formally declared a famine last month, 144 Palestinians, among them 30 children, have died of hunger.\n\nDoha summit condemns ‘barbaric’ Israel\n\nMeanwhile, the political fallout from Israel’s strike on Hamas negotiators in Qatar last week, which killed five Hamas members and a Qatari security officer, has continued.\n\nIzzat al-Rashq, a member of Hamas’s political bureau, said the “war criminal Netanyahu is attempting to shift the battle to the region, seeking to redraw the Middle East and dominate it in pursuit of mythical fantasies related to ‘Greater Israel’, which places the entire region on the brink of explosion due to his extremism and recklessness.”\n\nHe said the attack on Qatari soil was meant to “destroy the negotiation process and undermine the role of our sister state, Qatar”.\n\nAt a preparatory meeting ahead of a summit on Monday in Doha, Arab and Islamic leaders discussed ways to respond.\n\nReuters reported that a draft resolution seen at the meeting condemned Israel’s “genocide, ethnic cleansing, starvation, siege, and colonising activities”, warning that such actions threatened peace in the region and undermined efforts to normalise ties with Arab states.\n\nQatari Prime Minister Sheikh Mohammed bin Abdulrahman bin Jassim Al Thani called Israel’s attack on Doha on September 9 “barbaric” and urged fierce and firm measures in response.\n\nSheikh Mohammed said that Arab nations supported “lawful measures” to protect Doha’s sovereignty and called on the international community to abandon “double standards” in dealing with Israel.\n\nArab League Secretary-General Ahmed Aboul Gheit said that “silence and inaction” had emboldened Israel to carry out crimes “with impunity”. He called on Arab and Islamic nations to hold Israel accountable for “evidenced war crimes”, including “killing civilians, starving the population and driving an entire population homeless”.\n\nAdnan Hayajneh, a professor of international relations at Qatar University, told Al Jazeera that the regional mood had shifted. “The US has to wake up to the fact that you’ve got 2 billion Muslims around the world insulted, and it’s only the beginning. It’s not only the attack on Qatar, it is a continuation of destabilisation of the whole region,” he said.\n\nUS-Israeli relations remain strong\n\nIsraeli Prime Minister Benjamin Netanyahu has insisted that ties with the United States remained strong, despite Washington’s unease over the strike in Qatar. Hosting US Secretary of State Marco Rubio in Jerusalem, Netanyahu said that relations were “as strong and durable as the stones in the Western Wall”.\n\nRubio claimed that US President Donald Trump was “not happy” about the Israeli attack in Doha, but maintained that US-Israeli relations remained “very strong”.\n\nAl Jazeera’s Hamdah Salhut, reporting from Amman, Jordan, said that Washington was trying to manage the fallout. “The US is surely going to do some damage control, saying that the strikes on Doha are not going to change the relationship with Israel, but some conversations will need to be had,” she said.\n\nMeanwhile, Israeli ministers have pledged to continue pursuing Hamas leaders abroad. Minister of Energy Eli Cohen declared, “Hamas cannot sleep peacefully anywhere in the world,” including in NATO member state Turkiye.\n\nAnother minister, Ze’ev Elkin, said: “We will pursue them and settle accounts with them, wherever they are.”\n\nIsraeli media later reported that Mossad chief David Barnea had opposed the Qatar strike, fearing it would derail ceasefire negotiations. A columnist in the Israeli newspaper Maariv wrote that Barnea believed Hamas leaders “can be eliminated at any given moment”, but had warned that attacking Doha risked torpedoing a deal to release captives Hamas had taken from Israel during its attack on October 7, 2023.\n\nSince Israel began its war on Gaza after the Hamas attack, at least 64,871 Palestinians have been killed and 164,610 injured, according to the enclave’s Health Ministry.\n\nSeparately, the Israeli newspaper Haaretz reported that Israel’s Ministry of Defence is treating about 20,000 wounded soldiers, with more than half suffering from psychological trauma and estimates suggesting that by 2028, the figure could rise to 50,000.","summary":"&#039;Another sleepless night&#039; in Gaza City as Israel intensifies assault, and Doha summit condemns Israel for Qatar strike","url":"https://www.aljazeera.com/news/2025/9/14/israel-flattens-more-gaza-towers-as-strikes-kill-fifty-three-and-famine-toll-rises?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/09/AA-20250914-39111312-39111303-ISRAELI_ATTACKS_ON_GAZA_CONTINUE-1757856891.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-09-14 22:22:53","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.295},{"id":360506426,"title":"Anthony Albanese's big promise ahead of potential meeting with Donald Trump","text":"Prime Minister Anthony Albanese could meet US President Donald Trump later this month on the sidelines of the United Nations General Assembly meeting and will likely seek assurances about the future of the AUKUS trilateral defence agreement.\n\nThe government has announced that the nuclear-powered submarines Australia will gain under the deal would dock at the Henderson Defence Precinct outside Perth, which has received a $12 billion cash injection.\n\nThe US could also choose to have its submarines undergo maintenance at the facility.\n\nThe AUKUS alliance is under review in the US and the Trump administration has urged allies to increase defence spending to 3.5 per cent of gross domestic product.\n\nAustralia's spend currently sits at about two per cent.\n\nDefence Minister Richard Marles has described the $12 billion funding as the 'biggest peacetime increase in Australia's defence spending' in history, with total expenditure of $25 billion.\n\n'I'm sure this will be welcomed by the US, but fundamentally it's a really important decision for Australia,' Mr Marles told Seven's Sunrise program on Monday.\n\n'It does provide the US with an opportunity to operate from HMAS Sterling south of Perth.\n\n'That's really important in terms of getting more of our allied submarines into the water, more sea days and this is exactly what America wants.'\n\nMr Marles would not say if or when Mr Albanese and Mr Trump will meet, but did add that he was sure that 'at some point in the not-too-distant future there will be a meeting between our two leaders'.\n\nFormer Australian Ambassador to the United States Arthur Sinodinos noted the significance of announcing the boost ahead of a possible meeting with Trump.\n\n'The timing would be, I think, pitched to lay the groundwork and have something to put on the table with the president,' he told AAP.\n\nIn return, Mr Albanese would be seeking assurances from the president about his support for AUKUS, Mr Sinodinos said.\n\n'While we had indications of support from others in the administration, it's important for the prime minister to hear it directly from the president,' he said.\n\nIt also makes Australia a much more valuable ally, according to the Australian Strategic Policy Institute defence strategy director, Mike Hughes.\n\n'It's making up for almost a complete lack of investment in Australia's ability to build, maintain, sustain and repair vessels, particularly naval military vessels,' he said.\n\n'With the international geopolitical environment deteriorating in the way it is, Australia needs to invest in these sovereign capabilities, given we've spent decades essentially free riding off of others.'\n\nOpposition defence spokesman Angus Taylor said the additional spending was overdue but didn't go far enough to support the rotation of US and UK submarines until late into the 2030s.","summary":"Prime Minister Anthony Albanese could meet US President Donald Trump later this month on the sidelines of the United Nations General Assembly meeting and will likely seek assurances about the future of the AUKUS trilateral defence agreement.","url":"https://www.dailymail.co.uk/news/article-15098233/Anthony-Albaneses-big-promise-ahead-potential-meeting-Donald-Trump.html","image":"https://i.dailymail.co.uk/1s/2025/09/14/23/102131847-0-image-a-7_1757887753888.jpg","video":null,"publish_date":"2025-09-14 22:18:36","author":"Editor","authors":["Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.145},{"id":360503090,"title":"Top Stories You Might Have Missed This Weekend","text":"Senator Lindsey Graham, R-S.C., expressed on NBC News’ “Meet the Press” his efforts to repeal Section 230 of the Communications Decency Act, which protects internet companies from being liable for user-posted content.\n\n“If you’re mad at social media companies that radicalize our nation, you should be mad,” Graham said.\n\nSection 230 has been heavily criticized, particularly by social media critics who believe the provision enables tech companies to evade responsibility for harmful messages spread on their platforms, especially highlighted in light of Charlie Kirk’s assassination.\n\nAlso appearing on “Meet the Press,” Sen. Mark Kelly, D-Ariz., said Kirk’s shooting brought him back to when he received a phone call informing him that his wife, then-Rep. Gabrielle Giffords, was shot at a political event in 2011. Giffords ultimately survived.\n\n“I immediately thought back to the day in 2011 when I got that phone call. And I know Erika, his wife, got a similar call,” Kelly said of Kirk’s wife. “And it is like a punch in the gut like I’ve never experienced before.”\n\nTrump says the new White House ballroom will be ‘a little bigger’ than initially planned\n\nPresident Donald Trump said the new ballroom he’s adding to the White House campus will be larger than first described, with a capacity of 900 people. The number is nearly a 40% increase from a July statement, which showed the room would seat up to 650.\n\nIn a telephone interview with NBC News, the president said: “We’re making it a little bigger. It will be top of the line, as good as it can get anywhere in the world.”\n\nThe White House has estimated the cost at $200 million. Trump reiterated he will personally help pay for the addition and private donors are also expected to chip in.\n\nThe construction represents the biggest change to the White House exterior since the East Wing was expanded under Franklin D. Roosevelt in 1942.\n\nPolitics in brief\n\nEarly notice: Sen. Bernie Sanders might be done touring the country for now, but he’s still making his mark on the Democratic Party by backing progressive candidates earlier than ever.\nMcCaul-ing it a day: Rep. Michael McCaul, R-Texas, announced that he does not plan to seek re-election in 2026 after serving in Congress for two decades.\nGovernment (not) by the people: A growing number of Republican-led states are moving forward with efforts to make it more difficult for citizen-led ballot initiatives to succeed.\nGrappling with tariffs: American small businesses that rely on goods from India are feeling the strain after Trump imposed 50% tariffs on imports from the nation.\n\nPreviewing the 77th Emmy Awards\n\nHollywood will celebrate television royalty during Sunday night’s Emmy Awards, hosted in Los Angeles by comedian Nate Bargatze. \n\nAll eyes are on Apple TV+’s “Severance,” which already picked up six awards during last weekend’s Creative Arts Emmys and leads with 27 nominations. Seth Rogen’s “The Studio” also snagged nine early wins, and is expected to dominate the comedy categories. \n\nOther top picks include HBO’s “The White Lotus,” up for 23 awards, first time nominee and hospital drama “The Pitt,” and Disney+ series “Andor.”\n\nNBC News is covering all the best moments, winners and more.\n\nJoe Burrow suffers another injury setback\n\nCincinnati quarterback Joe Burrow was helped off the field with a left toe injury during the first half of the Bengals’ game against the Jacksonville Jaguars. The team later announced he was ruled out of the matchup.\n\nIn the middle of the second quarter, Burrow was attempting to pass when he was sacked by Jaguars defensive end Arik Armstead. After initially trying to stand up, Burrow stayed on the field and waited for medical attention.\n\nBurrow, 28, was the first overall pick in the 2020 NFL draft. He has struggled with injuries in his career, missing the final six games of his rookie season after tearing his ACL. He also missed seven games in 2023 because of a torn ligament in his wrist.\n\nVikings-Falcons on ‘Sunday Night Football’: Second-year quarterbacks J.J. McCarthy and Michael Penix Jr. face each other for the first time in the NFL since they squared off in the 2024 College Football Playoff. NBC News is covering all the action.\n\nNotable quote\n\nAs Texas public schools begin hanging posters of the Ten Commandments in compliance with a new law, some teachers are finding creative alternatives to sidestep or dodge the legislation.\n\nIn case you missed it\n\nElon Musk urged more than 100,000 protesters at a far-right rally in London to “fight back or die,” joining the “Unite the Kingdom” event — one of the country’s largest far-right rallies in decades — via video link.\nSecretary of State Marco Rubio is in Jerusalem seeking answers from Prime Minister Benjamin Netanyahu after Israel’s unprecedented attack on Hamas leaders inside Qatar, another key U.S. partner in the Middle East.\nFox News Channel host Brian Kilmeade apologized for advocating for the execution of mentally ill homeless people in a discussion on the network last week, saying his remark was “extremely callous.”\nMötley Crue singer Vince Neil revealed that he suffered a stroke the day after Christmas that made him lose control of his “whole left side.”\nBritish boxer Ricky Hatton, a former two-division world champion, died at 46, the World Boxing Association said.\nThe mother of a 15-year-old boy who died by suicide is suing Roblox and Discord over his death, alleging her son was groomed and coerced to send explicit images on the apps.\nA 20-year-old California man was sentenced to 14 years in federal prison after admitting to using Discord to sexually exploit minor girls.\nBobby Hart, a key part of the Monkees’ multimedia empire who teamed with Tommy Boyce on such hits as “Last Train to Clarksville” and “I’m Not Your Steppin’ Stone,” died at 86.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUtah Governor Spencer Cox on Sunday provided updates regarding the investigation into&#8230;\n\n\nThis Post: Top Stories You Might Have Missed This Weekend first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/top-stories-you-might-have-missed-this-weekend/","image":"https://internewscast.com/wp-content/uploads/2025/09/1757888118_Here039s-the-biggest-news-you-missed-this-weekend.jpg","video":null,"publish_date":"2025-09-14 22:16:23","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.038},{"id":360518480,"title":"Israel intensifies Gaza City bombing as Rubio arrives","text":"CAIRO/JERUSALEM, (Reuters) – Israeli forces destroyed at least 30 residential buildings in Gaza City and forced thousands of people from their homes, Palestinian officials said, as U.S. Secretary of State Marco Rubio arrived today to discuss the future of the conflict.\n\nIsrael has said it plans to seize the city, where about a million Palestinians have been sheltering, as part of its declared aim of eliminating the militant group Hamas, and has intensified attacks on what it has called the last bastion of the militant Palestinian group.\n\nHamas’ political leadership, which has engaged in on-and-off negotiations on a possible ceasefire and hostage release deal, was targeted by Israel in an airstrike in Doha on Tuesday in an attack that drew widespread condemnation.\n\nQatar will host an emergency Arab-Islamic summit on Monday to discuss the next moves. Rubio said Washington wanted to talk about how to free the 48 hostages still held by Hamas in the Gaza Strip and rebuild the coastal strip. Only 20 are believed to be alive.\n\n“What’s happened has happened,” he said. “We’re gonna meet with them (the Israeli leadership). We’re gonna talk about what the future holds,” Rubio said before heading to Israel where he will stay until Tuesday.\n\nOnce there, Rubio visited the Western Wall Jewish prayer site in Jerusalem. He was expected to hold talks with Prime Minister Benjamin Netanyahu.\n\nThe Western Wall visit was “reaffirming America’s recognition of Jerusalem as Israel’s eternal capital,” according to a statement from the State Department.\n\nIn late 2017, during his first term as president, Donald Trump formally recognized Jerusalem as the capital of Israel and subsequently moved the U.S. embassy there from Tel Aviv.\n\nPhilippe Lazzarini, commissioner-general of the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), said in a post on X on Sunday that the agency had stopped services at the Beach camp clinic, which he said is the only health care available in the enclave north of Wadi Gaza.\n\nWater and sanitation services are now at half capacity, Lazzarini said, adding that 10 UNRWA buildings have been struckin Gaza City in the past four days.\n\nABRAHAM ACCORDS AT RISK\n\nU.S. officials described Tuesday’s strike against Hamas members in Qatar, a close U.S. ally, as a unilateral escalation that did not serve U.S. or Israeli interests. Rubio and U.S. President Trump both met Qatar’s Prime Minister Mohammed bin Abdulrahman al-Thani on Friday.\n\nNetanyahu signed an agreement on Thursday to push ahead with a settlement expansion plan that would cut across West Bank land that the Palestinians seek for a state, a move the United Arab Emirates warned would undermine the U.S.-brokered Abraham Accords that normalised the UAE’s relations with Israel.\n\nAid agencies say an Israeli takeover of Gaza City would be catastrophic for a population already facing widespread malnutrition.\n\nTwo more Palestinians have died of malnutrition and starvation in Gaza in the past 24 hours, the territory’s health ministry said on Sunday, raising the death toll from such causes to at least 422 people, including 145 children.\n\nIsrael, which blocked all food from entering Gaza for 11 weeks earlier this year, has been allowing more aid into the enclave since late July to prevent further food shortages, though the U.N. says far more is needed.\n\nIsrael says it wants civilians to leave Gaza City before it sends more ground forces in. Tens of thousands of people are estimated to have left but hundreds of thousands remain in the area. Hamas has urged people to stay.\n\nIsraeli army forces have been operating inside at least four eastern suburbs for weeks, turning most of at least three of them into wastelands. It is closing in on the centre and the western areas of the territory, where most of the displaced people are taking shelter.\n\nMany of those people are reluctant to leave, saying there is not enough space or safety in the south, where Israel has told them to go to what it has designated as a humanitarian zone.\n\nSome say they cannot afford to leave while others say they were hoping the Arab leaders meeting on Monday in Qatar would pressure Israel to scrap its planned offensive.\n\n“The bombardment intensified everywhere and we took down the tents, more than twenty families, we do not know where to go,” said Musbah al-Kafarna, who is among the displaced in Gaza City.\n\nIsrael said it had completed five waves of air strikes on Gaza City over the past week, targeting more than 500 sites, including Hamas reconnaissance and sniper sites, buildings containing tunnel openings and weapons depots.\n\nLocal officials, who do not distinguish between militant and civilian casualties, say at least 45 people were killed by Israeli fire across the enclave on Sunday, most of them in Gaza City.\n\nHamas said Israeli forces have destroyed at least 1,600 residential buildings and 13,000 tents since August 11.\n\nIsrael’s nearly two-year-long campaign against Hamas has killed more than 64,000 people in Gaza, according to local authorities. It was prompted by the group’s October 7, 2023, attack on Israel, in which 1,200 people were killed and 251 others taken hostage, according to Israeli figures.","summary":"CAIRO/JERUSALEM, (Reuters) &#8211; Israeli forces destroyed at least 30 residential buildings in Gaza City and forced thousands of people from their homes, Palestinian officials said, as U.S.\n\n\nThe article Israel intensifies Gaza City bombing as Rubio arrives appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/09/14/news/world/israel-intensifies-gaza-city-bombing-as-rubio-arrives/","image":"https://s1.stabroeknews.com/images/2025/09/IMG_3974.jpeg","video":null,"publish_date":"2025-09-14 22:10:24","author":"Staff Editor","authors":["Staff Editor"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.283},{"id":360504878,"title":"Trump concerned South Korean arrests could ‘frighten’ investors","text":"US President Donald Trump on Sunday said foreign workers sent to the United States are “welcome” and he does not want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, the 79-year-old Republican wrote: “I don’t want to frighten off or disincentivize investment.”\nSome 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory, operated by Hyundai-LG, in the southeastern US state of Georgia on September 4.\nImmigration and Customs Enforcement (ICE) officials alleged South Koreans had overstayed their visas or held permits that did not allow them to perform manual labour.\nThe Georgia raid was the largest single-site operation conducted since Trump launched a sweeping immigration crackdown across the country.\nThough the United States decided against deportation, images of the workers being chained and handcuffed during the raid caused widespread alarm in South Korea.\nSeoul repatriated the workers on Friday.\n\nSouth Korean President Lee Jae Myung called the raid “bewildering” and warned on Thursday that the raid could discourage future investment.\nIn his post, Trump described the circumstances for temporarily allowing foreign experts into the US to build “extremely complex products”.\n“Chips, Semiconductors, Computers, Ships, Trains, and so many other products that we have to learn from others how to make, or, in many cases, relearn because we used to be great at it, but not anymore,” Trump wrote.\n“We welcome them, we welcome their employees, and we are willing to proudly say we will learn from them, and do even better than them at their own ‘game,’ sometime in the not too distant future,” Trump added.\nKorea’s trade unions have called on Trump to issue an official apology.","summary":"US President Donald Trump on Sunday said foreign workers sent to the United States are “welcome” and he does not want to “frighten off” investors, 10 days after hundreds of South Koreans were arrested at a work site in Georgia.\nIn a post on his Truth Social platform, the 79-year-old Republican wrote: “I don’t want to frighten off or disincentivize investment.”\nSome 475 people, mostly South Korean nationals, were arrested at the construction site of an electric vehicle battery factory, operated...","url":"https://www.scmp.com/news/world/united-states-canada/article/3325520/trump-concerned-south-korean-arrests-could-frighten-investors","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/09/15/13bb492d-a74d-4330-a310-875698d883b6_69da746d.jpg","video":null,"publish_date":"2025-09-14 22:09:11","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"cn","sentiment":-0.101},{"id":360519248,"title":"Clemson suspends professor amid nationwide crackdown on Kirk death celebrations","text":"“We understand the frustration, and we share the deep concern over the nature of these posts. However, we will continue to act within the bounds of the law and our University policies to ensure accountability and integrity,” the statement added.\n\nThe university will also continue to “thoroughly review the inappropriate social media content posted by employees in response to the tragic murder of Charlie Kirk.” The Clemson College Republicans group has kept track of a few employees that have published such posts.\n\nAssistant professor Joshua Bregy has since deleted a repost on his Facebook account that suggested Kirk’s assassination was an example of how “karma is sometimes swift and ironic.”\n\n“As Kirk said, ‘play certain games, win certain prizes,’” the post said.\n\nAnother assistant professor, Melvin Earl Villaver Jr., posted on the day of the shooting that it “was one of the most beautiful days ever. The weather was perfect, sunny with a little breeze. This was such a beautiful day.”\n\nIn another post, Villaver responded to someone writing that Kirk was “an old looking 31,” the age Kirk was when he was killed.\n\n“Racism and White Supremacy age you,” Villaver wrote in response.\n\nVillaver has since deleted his X account, but screenshots of his posts continue to circulate online.\n\nClemson’s asbestos program manager, Robin Newberry, was also among those who commented on Kirk’s death. \n\n“In a world of Charlie Kirks and Brian Thompsons, be a Tyler Robinson, or a Luigi Mangione,” Newberry wrote, referencing both the suspect in Kirk’s assassination and the suspect in the earlier murder of a UnitedHealthcare CEO.\n\nPresident Donald Trump brought the matter to national attention when he shared a post about these employees on Truth Social.\n\nThat led to three South Carolina lawmakers jumping into the conversation.\n\n“Even the President, Donald Trump, is aware of how egregious Clemson’s behavior is. Only 1 of 3 Clemson professors ‘suspended’ after allegedly celebrating Charlie Kirk’s death. Not enough,” Rep. Nancy Mace (R-SC) said.\n\n“Your First Amendment rights do not include a right to a job! Clemson’s professors were completely inappropriate,” Sen. Tim Scott (R-SC) said. “The vile and disgusting celebration of a murder must compel the university to take clear and immediate action.”\n\n“As the mother of a Clemson student and your Lt. Governor, I am horrified and disgusted by these posts. No one should celebrate, mock, or minimize the death of another human being,” Lt. Gov. Pamela Evette said.\n\nMSNBC ANALYST MATTHEW DOWD FIRED AFTER ‘INSENSITIVE’ CHARLIE KIRK SHOOTING REMARKS\n\n“I’ve spoken with [Clemson University] President Clements and expressed that this individual, and anyone who espouses these types of statements, should never be in a position to shape the minds or hearts of our children and S.C. students,” Evette added.\n\nThe Washington Examiner has reached out to Clemson University for comment.","summary":"Clemson University suspended one employee on Saturday over what the university called “inappropriate” social media posts about Charlie Kirk&#8216;s assassination. “This action reflects the seriousness with which Clemson approaches violations of its standards and values. As this is a personnel matter, no further details will be disclosed at this time,” Clemson wrote in a statement.&#160; [&#8230;]","url":"https://www.washingtonexaminer.com/policy/education/3807206/clemson-suspends-professor-amid-crackdown-kirk-death-celebrations/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/09/charlie-kirk-clemson-unversity-professor-suspended.jpg?w=696","video":null,"publish_date":"2025-09-14 22:08:37","author":"Jenny Goldsberry","authors":["Jenny Goldsberry"],"language":"en","source_country":"US","sentiment":0.048},{"id":360512656,"title":"Canadian veteran journalist Beverly Thomson dead at 61","text":"After 23 years battling with cancer, Canadian journalist Beverly Thomson has died on Sunday. She was 61.\n\nBorn and raised in the Toronto area, Thomson started her journalism career at a small radio station in Newmarket. She also worked at what is now known as CityNews 680.\n\nAfter that, she went on to work as an on-air reporter with CTV.\n\nShe also worked at Global News and then returned to CTV as co-host of Canada AM, before continuing her work on CTV News Channel.\n\nAccording to an article posted by CTV News, Thomson passed away on Sunday morning. She was first diagnosed with breast cancer in 2002, and became active in breast cancer awareness.\n\nIn October 2024 Thomson received a lifetime achievement award by the Radio Television Digital News Association of Canada (RTDNA Canada).\n\nThomson is known for her high-profile interviews with politicians and celebrities. \n\nSome of her work include coverage of the 2016 U.S. election, and one-on-one interviews with high stakes guests like Donald Trump, Shania Twain, and even Chris Hadfield as he was aboard the International Space Station.\n\nShe always had my back: Leslie Roberts\n\nCanadian TV personality, Leslie Roberts wrote a post on social media, remembering his time co-anchoring with Thomson on Global News.\n\n“As my first Toronto co-anchor, she always had my back.” he wrote.\n\nVice-president of News at Bell Media Richard Gray said Thomson was a “trusted voice and a valued teammate to all of us at CTV News” in a statement on Sunday.\n\n“Bev’s natural on-air style created an immediate connection with viewers. For decades, she also made a significant impact across the country with her vocal support and advocacy for cancer charities,” Gray wrote.\n\n“Bev will be dearly missed by all of us at CTV News. We extend our deepest condolences to her family and loved ones.”\n\n-With files from The Canadian Press","summary":"After 23 years battling with cancer, Canadian journalist Beverly Thomson has died on Sunday. She was 61. Born and raised in the Toronto area, Thomson started her journalism career at a small radio station in Newmarket. She also worked at what is now known as CityNews 680. After that, she went on to work as [&#8230;]","url":"https://toronto.citynews.ca/2025/09/14/veteran-journalist-beverly-thomson-dies-at-61-after-long-cancer-battle/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2025/09/14/thomson.jpg","video":null,"publish_date":"2025-09-14 22:04:19","author":"Joseph Ryan","authors":["Joseph Ryan"],"language":"en","source_country":"ca","sentiment":0.082},{"id":360518584,"title":"Nala’s Baby director ‘steps down’ after fan fury over Charlie Kirk posts","text":"Sasha Ellese Gilbert founded Nala’s Baby with then-boyfriend Casyo ‘Krept’ Johnson in 2020 (Picture: David M. Benett/Dave Benett/Getty Images)\n\nSasha Ellese Gilbert, a director of skin and haircare brand Nala’s Baby, has confirmed that she’s stepped down, which has been fuelling speculation online over the weekend.\n\nThe influencer founded the company in 2020 with her then-boyfriend and rapper Casyo ‘Krept’ Johnson, who is part of the hip hop duo Krept & Konan. \n\nGilbert was pregnant with their daughter, Nala, at the time, and while the couple are no longer together, they still co-parent and own 75% of the business between them. The other 25% has gone to investors.\n\nThe baby brand has grown astronomically over the last five years, launching in 400 Boots stores in 2022, gaining the backing of celebrities, and now valuing itself at around £20million.\n\nHowever, questions began to arise relating to the personal beliefs of co-founder Gilbert due to her online activity. \n\nSocial media users noticed in recent days that Gilbert looked to have either resigned or been terminated as a co-director of Nala’s Baby, as per Companies House. Documents show her date of termination as September 12, 2025.\n\n The skin and haircare brand is now worth around £20million (Picture: David M. Benett/Dave Benett/Getty Images)\n\nSince Gilbert was no longer affiliated with the company, this left people to assume Johnson is now its sole executive CEO.\n\nIt comes after Gilbert publicly shared tributes to American right-wing activist Charlie Kirk, who was shot and killed in what authorities declared a political assassination on Wednesday.\n\nHowever, Gilbert took to her page on Sunday night to explain the reasons for her departure, writing: ‘In light of the recent news of me stepping down from my position within Nalasbaby, I just wanted to put some rumours to rest.\n\n‘I made the decision to step down at the beginning of this year, I wasn’t terminated by the company, everything was done professionally, respectfully and in good faith.\n\n‘I left knowing that all within the company will continue to work tirelessly to continue to build on the legacy me and Casyo started and they’re doing a wonderful job.’\n\nShe concluded by acknowledging that this is probably the ‘fun news story’ people wanted, but it’s ‘the truth’.\n\n The director has stepped down, as confirmed in a statement (Picture: Instagram)\n\nIn a follow-up Story post, Gilbert shared a screenshot of her Notes app, which showed her writing about stepping down from the brand in February this year.\n\nMeanwhile, there has been plenty of talk across social media after Gilbert took to her Instagram Story and reposted the message: ‘CHARLIE KIRK will be the greatest martyr that ever lived in our generation and his death will be the flame that burns in the heart of every clarion voice. His death will definitely not be in vain.’\n\nShe added in her own text: ‘It is not in vain’.\n\nGilbert also reshared an announcement of Kirk’s death, alongside a photo of him with his wife and kids, as well as a photo of him on Snapchat.\n\nThe post quickly prompted backlash, with commenters declaring that they didn’t hesitate to ‘unfollow’ Gilbert, with some calling it ‘shocking’ and others believing her reputation was ‘finished’.\n\n‘I can’t believe her, he spewed so much hatred towards women especially black women. He was not Christian like at all’, wrote @luxejo. Gilbert is a Christian, as was Kirk.\n\n Gilbert has been criticised for sharing tributes to Charlie Kirk (Picture: Instagram)\n\n The businesswoman took to social media after his death (Picture: Instagram)\n\n‘She’s so uneducated’, commented @royaltyragx, while @geneivah called her actions ’embarrassing’.\n\nGiven that Gilbert is a Black woman, followers were all the more confused about her apparent grief for Kirk, whose beliefs were certainly polarising.\n\nFor example, the 31-year-old said on The Charlie Kirk Show in 2023: ‘Happening all the time in urban America, prowling Blacks go around for fun to go target white people; that’s a fact. It’s happening more and more.’\n\nThe following year, he said: ‘The American Democrat party hates this country. They wanna see it collapse. They love it when America becomes less white.’\n\nFurthermore, Kirk openly expressed Islamophobic beliefs. Johnson, the father of Gilbert’s child, converted to Islam at the age of 15 and often mentions his faith in his music.\n\nKirk said on his show in April this year: ‘America has freedom of religion, of course, but we should be frank: large, dedicated Islamic areas are a threat to America.’\n\n Social media commenters said they unfollowed the director sharpish after becoming aware of her posts (Picture: David M. Benett/Dave Benett/Getty Images for Primark)\n\nHe also claimed that ‘Islam is not compatible with Western civilisation’ and, on September 8, just days before his death, called Islam ‘the sword the left is using to slit the throat of America’.\n\nThe public figure was long accused of inciting violence with his speeches, having also held views against abortion, immigration, and homosexuality and strongly for access to firearms.\n\nCurrently, following a high-profile search, Tyler Robinson, 22, is detained as a suspect in Kirk’s shooting. It has been claimed that his own father turned him in.\n\nRepublican leader Donald Trump vowed to crack down on ‘political violence’ as he honoured Kirk.\n\nAs for Gilbert, this is not the first time she has caught the wrong kind of attention from fans for her posts.\n\n A suspect is currently in custody on suspicion of fatally shooting Kirk (Picture: Reuters)\n\n To view this video please enable JavaScript, and consider upgrading to a web\n browser that\n supports HTML5\n video\n\n Up Next\n\n Previous Page\n\n Next Page\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nIn July, she took to Snapchat with a post that called Mohammed a ‘false prophet’, adding: ‘I will never respect a false God who is sending people to hell, I respect the people who believe enough to let you know the God you serve is false, many Muslims are living righteous lives and have a heart for God. But it’s the wrong one. If you don’t agree, just ignore my post, I’m not debating anyone’.\n\nAfter backlash, she penned a follow-up statement in which she denied being Islamophobic, calling such claims ‘silly’.\n\n‘But I’m also not going to be forced to make an apology for standing boldly on what I believe.’\n\nReps for Sasha Ellese Gilbert and Casyo ‘Krept’ Johnson have been contacted for comment.\n\nGot a story?\n\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.","summary":"She founded the business in 2020 with her then-boyfriend and rapper Casyo 'Krept' Johnson.","url":"https://metro.co.uk/2025/09/14/nalas-baby-director-steps-down-fan-fury-charlie-kirk-posts-24154929/","image":"https://metro.co.uk/wp-content/uploads/2025/09/SEI_265866936-b781.jpg?quality=90&strip=all","video":null,"publish_date":"2025-09-14 22:02:12","author":"Emily Bashforth","authors":["Emily Bashforth"],"language":"en","source_country":"gb","sentiment":0.125},{"id":360506442,"title":"Truth about America's murder hotspots... as map reveals surprising cities Trump may send National Guard","text":"Donald Trump has made violent crime in America's cities - and his promise to crack down on 'out-of-control' lawlessness - central to his presidency.\n\nBut a new study paints a far more complex picture of the nation's homicide epidemic and suggests the cities where Trump has deployed the National Guard are not the most murderous.\n\nA USA Facts analysis of fatality data from the Centers for Disease Control and Prevention (CDC) shows that New Orleans tops the national list with 46 homicides per 100,000 residents.\n\nMemphis, Tennessee, comes in second with 41 homicides, followed by St Louis (38) and Baltimore (36).\n\nOnly then does Washington, DC - one of Trump's targets - appear on the list with a homicide rate of 36 per 100,000 residents.\n\nHe also sent troops to Los Angeles, which doesn't even break into the top 30, recording just seven homicides per 100,000 people.\n\nThe findings raise tough questions about Trump's strategy. As critics accuse him of playing politics with public safety, his supporters insist his high-profile deployments have brought order to lawless streets.\n\nThe debate comes amid national outrage over the shocking killing of Ukrainian refugee Iryna Zarutska, who was allegedly stabbed to death by a schizophrenic man while riding a train in Charlotte, North Carolina.\n\nCharlotte's homicide rate stands at eight per 100,000 - far below that of the country's murder capitals.\n\nStill, the case has become a rallying cry for Trump loyalists who say Charlotte and other Democrat-run cities are failing to protect ordinary Americans and law-abiding migrants alike.\n\nTrump has boasted repeatedly about his record on crime, pointing to DC, where he placed the Metropolitan Police Department under federal control and flooded the city with National Guard troops.\n\n'Washington is now a crime-free zone,' Trump told reporters Tuesday night, insisting his actions have transformed the capital from a city in fear to one where people now stroll, dine and attend cultural events without worry.\n\n'I'm standing here in the middle of the street,' he said. 'I wouldn't have done this three months ago, four months ago, certainly not a year ago.'\n\nThe Justice Department, however, notes that violent crime in DC had already fallen to a 30-year low in early 2024, long before Trump's crackdown.\n\nPolls show his move was deeply unpopular with the capital's residents, though Trump insists 'friends' tell him the city has never felt safer.\n\nThe president has also teased that another city will soon see National Guard boots on the ground.\n\n'We're going to be announcing another city very shortly,' he told reporters. 'We're working it out with the governor of a certain state who would love us to be there, and the mayor of a certain city in the same state that would love us to be there.'\n\nTrump has long threatened to send forces into Chicago, which he has called 'the most dangerous city' in the world.\n\nWith a homicide rate of 16 per 100,000, Chicago is far from the worst. And its Democratic leaders, Governor JB Pritzker and Mayor Brandon Johnson, have fiercely resisted Trump's threats of military intervention.\n\nInstead, the president has hinted at New Orleans - where Republican Governor Jeff Landry has openly welcomed federal assistance - Baltimore and Portland, Oregon.\n\nOn Tuesday night, Trump lavished praise on Landry, calling him a 'great governor' who 'wants us to come in and straighten out a very nice section of this country that's become… quite tough. Quite bad.'\n\nWithin hours, Landry took to X to affirm that Louisiana 'would welcome help.'\n\nWith a homicide rate that dwarfs most other US cities', the numbers show why Trump may see New Orleans as his next high-profile battleground.\n\nBut his critics say the president is cherry-picking cities where Republican governors are eager to play ball, rather than focusing on the true hotspots of violent crime.\n\nHundreds of protesters took to the streets of New Orleans on Tuesday night, chanting 'No troops in our city' and accusing Trump of exploiting their pain for political gain.\n\nThe CDC homicide statistics offer perhaps the clearest picture yet of America's urban violence problem, since the agency compiles its data from death certificates typically filled out by coroners and medical examiners.\n\nBy contrast, FBI crime data relies on voluntary reporting from local police departments, leaving large gaps and making national comparisons difficult.\n\nThe numbers show that while America's homicide rate remains high by global standards, it is not uniformly bad across all cities.\n\nAnd despite political rhetoric, the broader trend is one of declining crime. \n\nA new report from the Council on Criminal Justice found that across 30 major cities, homicides fell 17 percent in the first half of 2025 compared with the same period last year.\n\nGun assaults and carjackings also dropped, though five cities - including Milwaukee and Little Rock - bucked the trend with significant spikes in murder.\n\nFor Trump, though, crime is about more than numbers. It is about image, perception and a political brand that casts him as America's defender-in-chief.\n\nHis focus on nationwide 'danger' has coincided with uncomfortable questions about his administration's handling of Jeffrey Epstein–related documents, an issue that briefly overshadowed his crime-fighting message this summer.\n\nNow, as he toys with the idea of sending troops into another US city, the stakes are higher than ever.\n\nFor some Americans, Trump's deployments have restored faith in public order. For others, they represent creeping authoritarianism and a dangerous politicization of law enforcement.","summary":"The debate comes amid outrage over the killing of Ukrainian refugee Iryna Zarutska, who was allegedly stabbed to death by a schizophrenic man while on a train in Charlotte, North Carolina.","url":"https://www.dailymail.co.uk/news/article-15085827/Americas-murder-surprise-city-National-Guard.html","image":"https://i.dailymail.co.uk/1s/2025/09/10/21/102019667-0-image-a-18_1757537000616.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/09/2468516959614121473/1024x576_MP4_2468516959614121473.mp4","publish_date":"2025-09-14 22:00:28","author":"Editor,James Reinl","authors":["Editor","James Reinl"],"language":"en","source_country":"gb","sentiment":-0.032},{"id":360519290,"title":"Zheng Yongnian on why China must look beyond the West to build a better AI","text":"Zheng Yongnian is a leading political scientist and government adviser in China. His academic work is mainly about contemporary politics, the country’s transformation and external relations. In his second in-depth interview with the Post, Zheng discusses AI governance and how China can consolidate its narrative amid growing geopolitical risks. This interview first appeared in SCMP Plus. For other interviews in the Open Questions series, click here.\nFor many years, you have called for the rebuilding of China’s own knowledge system. Recently, you have also voiced concerns about “intellectual colonialism” in the artificial intelligence era. Can you elaborate?\nThe concerns mainly refer to challenges in China’s social sciences which originated from the West.\nReligions, ideology, values – as Samuel Huntington explained in his book The Clash of Civilisations – are important for any nation. And the meaning of society and technology is determined by the humanities and social sciences.\nChinese researchers learned and adopted theories of Western social sciences, but these are based on Western methods that summarise Western practices and experiences, and are then used to explain Western society.\nThose theories have failed to explain Confucian civilisation, the Islamic world and Indian society. We should fully embrace our secular civilisation, and thereby play a proper role in the international order.\n\nIn the AI era, knowledge production and distribution have picked up pace. But the logic of using AI during the process remains unchanged: the feeding in of information and its distillation.\nChina’s DeepSeek is a success but how it produces knowledge is no different from OpenAI’s ChatGPT and other models.\nIn the era of AI, knowledge production has become more a process of convergence instead of divergence, which puts us at greater risk of relying on the Western knowledge system.\nDoes this mean that China’s academic and strategic communities need to be especially cautious when using AI tools? Where should we begin such a massive task as building a governance philosophy and knowledge system tailored to China’s needs? How do we learn from the West while avoiding dependence on Western frameworks?\nIt is very dangerous that many people are using tools like ChatGPT without any awareness of the problems. The issue lies in the “feeding” of the model.\nIn the natural sciences, since modern times, all the best papers have been published in foreign languages, especially English. Even Chinese scientists and engineers publish their best work in English, as the top journals recognised by Chinese scholars are predominantly Western. The same is true in the social sciences.\nIt is now very hard to avoid a process of colonisation if you want to use ChatGPT, DeepSeek or similar tools to build a knowledge system. We need to look at the source and reshape the feeding aspect.\nChina’s thousands of years-long uninterrupted civilisation offers vast practical experience and historical records unmatched by others. But transforming those into modern social science requires dedicated effort.\nChina has gone through massive transformations in modern times, not to mention 40 years of reform and opening up. Those efforts spanning generations should be harnessed to prepare the feed.\n\nOtherwise, it remains one-way, with only Western inputs and none from China. If we built equally strong Chinese feeds, it would be more balanced.\nI am not rejecting the West. The problem is that the social sciences lack genuine Chinese “stories”. Even when we do tell a Chinese story, the theoretical framework is still Western. China merely provides evidence – and often the corroboration is incorrect, because the proposition itself is flawed.\nEven more dangerous is the short-sightedness of many Chinese scholars. Many universities and research institutes claim to have already built an “independent knowledge system”. But they are talking to themselves.\nSome economics books simply replace “Western” in the title with “Chinese” – this is not an independent knowledge system.\nWe need to stay grounded and take a truth-seeking approach. It will be impossible to accomplish the work in one or two years, or with one or two persons.\nYou mentioned that building an independent Chinese knowledge system should start from practice. Which of China’s own practices do you think deserves particular attention?\nThe Sinicisation of Marxism during Mao Zedong’s era is an example – it was grounded in practice.\nAt that time, European revolutionary theory emphasised urban struggle. Some failed experiences led Mao to re-examine orthodox Marxism and innovate. He raised “encircling the cities from the countryside”, which started a revolution in rural areas.\nDeng Xiaoping was also innovative, with examples such as the “socialist market economy” and the “cat theory”.\n\nWe have many innovative practices today but they have not been developed into conceptual theories. Instead, we often use Western theories to interpret our own practices, but that does not work. They are fundamentally different things.\nThere are also many practices worthy of attention in society, such as the bottom-up stories behind Shenzhen’s development.\nJustin Lin Yifu proposed new structural economics, highlighting a well-functioning government and an efficient market. I think both ideas already exist in Western economics. What’s missing, in my view, is a third element: an “active society”.\n“Civil society” is a Western concept which implies opposition to the state. But Chinese society has never been like that.\nFrom state to society, there is no clear boundary – it’s a continuum. Our market and state are not strictly separate either. We don’t have the Western concepts of absolute private or absolute public ownership.\nAncient Chinese were already experimenting with the well-field system two millennia ago, showing that our ancients sought to combine public and private ownership, which cannot be appreciated through the Western framework.\nYou also said it was important to break the West’s intellectual monopoly. In today’s tense China-US climate, some may see this as a move by China to compete for global leadership and narrative power. How do you view it?\nThat is about viewing things through an ideological lens. But ideology is not something scholars can control – we can only feel helpless about it.\nI have always advocated that we are not rejecting the West at all. We need to learn from Western methodologies, which are very important. But the concepts and theories generated by those tools often do not fit China’s reality.\n\nChina should take their methods, while setting aside their theoretical constructs, to re-examine China’s own practices and develop its own concepts and theories, just as each Western country has its own distinct social science characteristics.\nIf Chinese scholars can build a Chinese social science, it would be a tremendous contribution to global social sciences – but it would not be an act of confrontation.\nSome so-called China experts are distorting things, but those who see the issue from an ideological perspective are a minority, in my view.\nThe mainstream has seen the reality of China’s development and transformation but cannot explain it with Western frameworks. They are waiting for an answer. If we do not provide it, who will?\nThat is not about shutting ourselves off and opposing everything Western. A pile of self-talk will not work – nobody would understand or accept it.\nBuilding a knowledge system is about communication. We accepted Western theories not because they were forcibly imposed but because we found their logic convincing. China should create something that can work in the same way.\nHow do you expect the rebuilding of China’s knowledge system in the age of AI to feature in the 15th five-year plan?\nI think the effort to build a Chinese knowledge system will accelerate, since the urgency is already here.\nWe often say the West does not understand us, misunderstands us or even demonises us. It is now our responsibility to interpret ourselves to the West. With China’s role on the global stage becoming increasingly significant, we cannot keep others waiting for us to do so.\n\nWe also should be more open. The Western knowledge system was built through openness and we must do the same. A genuine knowledge system must be intelligible to everyone.\nMeanwhile, we often pretend to have understood the West, but effectively we only grasp the surface. We truly need to cultivate a large pool of talent who are proficient in various civilisations.\nI think the current situation is more challenging than during the Republican era.\nWhy was Fei Xiaodong able to write Peasant Life in China? He used Western methodologies to interpret Chinese phenomena brilliantly, which can be seen as an element of China’s independent knowledge system.\nChinese studies and Western studies are now separated, whereas during the Republican era, they were integrated.\nCurrent academic training focuses heavily on the quantifiable and measurable – the very things ChatGPT can do – but the truly valuable aspects of the social sciences and humanities are those which cannot be measured.\nStill, China also enjoys a major advantage: our rich practical experience.\nIn your latest book Reconstructing Chinese Knowledge in the AI Era, you raise the need to avoid an excessive focus on “political correctness” and “ideology” in social science research. How can that be achieved? Why have you called for a “de-witching” of the intellectual community, your term for a witch-hunting mindset?\nMany humanities scholars today are more like secular priests, chasing popularity by producing endless “chicken soup for the soul” content which has been rampant in China. That is of little use to society and is truly not good.\nIf, while the West uses an ideological perspective to demonise China, Chinese scholars also engage in using ideology to demonise the West, that is not building a knowledge system, it is just tit-for-tat name-calling.\nThat adds no value and is fake scholarship, which may be catchy but will leave nothing lasting. We need to be self-aware. We must return to basic facts, to science and to rationality.\n\nHow can China’s think tanks be developed to respond effectively to international opinion and increase their influence? You have spoken positively about the Rand Corporation in the US. What lessons could Chinese institutions learn from it?\nThe US has the most developed think tanks in the West and, in terms of serving national interests, I think the Rand Corporation does the best job.\nChinese think tanks can be roughly divided into two categories: the “justification” type – that just approves of whatever the government asks it to look at – and the purely critical, that says everything the government does is wrong. Both inevitably have their place.\nEvery government needs someone to assess whether a policy is scientifically sound. But if you can never say it is not, that is not really a think tank. Likewise, if it simply claims every government action is no good, that is not a think tank either.\nA true think tank should serve national interests. All leaders are also meant to serve national interests. For example, if a Hong Kong think tank served the chief executive personally, that could be problematic. If it served the interests of Hong Kong, that would be good.\nThat brings to mind the issue of soft power. How can China build a knowledge system that is both independent and universally applicable?\nI think there are four conditions when it comes to building soft power.\nFirst, what you write must be read by someone. If no one wants to read it, it will not work. Second, people must be able to understand it. Third, after understanding it, people accept it. Fourth, not only do people accept it, they also spread it to others.\nWe currently have problems in all four stages. The West, however, has succeeded in some of those areas.\nAI is freeing humans from intellectual labour, which means many people may become unable to think\nZheng Yongnian\nOur teachers have been spreading Western knowledge, but when will we be able to write books that reach Western classrooms? We are still far from that. It may be happening in the science and engineering fields, but what about the social sciences?\nTake China’s experience of lifting 800 million people out of poverty in four decades – which is also recognised in the West as a miracle in global economic history. How do we tell the story of poverty alleviation?\nI think we should use academic language. If we only emphasise ideological correctness, that certainly will not show the full picture. Telling the story in political or ideological language also bars others from learning from us.\nBeyond its influence on social structures, do you expect AI to further deepen the gaps and tensions between nations? Could that have an impact on international relations?\n\nBoth domestic and international political-economic orders need a base, just as in the previous three industrial revolutions. In the AI era, artificial intelligence is becoming the base, and both domestic and international orders will be different.\nI am somewhat pessimistic.\nThe first three industrial revolutions liberated humans from physical labour. But AI is freeing humans from intellectual labour, which means many people may become unable to think. That leads to what I call “artificial ignorance”, a self-inflicted intellectual harm.\nThere is a convergence trend between China and the US in AI development and, especially under open-source conditions, content will look increasingly similar in the future.\n\nWhen it comes to AI, given the American tech right, the US is following a development-oriented model, with no current regulatory framework at the federal level.\nMeanwhile, the EU is over-regulating, which has stifled innovation – a very sad story.\nSome European leaders have called for deregulation to boost indigenous AI companies, but that will lead to a dilemma, since simultaneously strengthening regulations on US firms will be a mission impossible with the EU commitment to consistency in rules.\nChina now sits somewhere between the US and the EU, with some overregulation. This was reflected by the recent relocation of Wuhan’s AI start-up Manus to Singapore.\nOne particularly important aspect of US President Donald Trump’s reforms has been deregulating business – the technological accelerationism advocated by the tech right.\nIf the US deregulates while the EU, China and India do not, emerging technologies within our country that cannot be adopted on the ground due to excessive regulation at home are likely to flow to the US – a phenomenon which has already been happening for years.\nChina should ensure proper regulation on environmental protection and labour rights, but in terms of getting technologies into application, I think regulations should be relaxed.\nOtherwise, the much-discussed “new productive forces” will not be able to materialise and transform into real economic activities, keeping China in intense “involution”. If new economic activity were more abundant, there would be less involution.\nWhat changes in the Ukraine war can we expect after the Putin-Trump Alaska summit and how will they affect China? Also, given the tensions between India and Washington, is there a possible tilt in the balance of the US-China-India triangle?\nThe prospects for resolving the Ukraine war are full of uncertainties. Neither side has shown signals of compromise. Europe won’t accept a land-for-peace swap plan, which it might deem a nightmare.\nChina is indeed the outsider. It has been held hostage by the war, yet is completely shut out when efforts are needed to work out a solution to end the war.\nDespite signs of decline, the US is still the global hegemony\nZheng Yongnian\nThere are two images of China’s strength. One is measurable – such as GDP and defence progress – when China moves towards the centre of the global stage.\nOn the other hand – and this brings us back to the matter of an indigenous and independent knowledge system – it is about how we identify ourselves and how others recognise us. It is not only about strategic thinking, it is also a philosophical issue.\nThere has never been a fixed triangle relationship, regardless of the major ones between the US, China and Russia, or US-China-India ties. Despite signs of decline, the US is still the global hegemony.\nIndia is taking an opportunistic approach. Despite recent tensions with Trump, India and the US have moved closer, but India will never be a true ally for the US. India is also pursuing regional hegemony, in particular, it has tried to set up its own Global South group to exclude China.\nWe still have not fully understood or grasped the Western language of international relations – or the multilateralism and alliances of the Western narrative. In China, what we call a partnership or strategic partnership is different from what the US terms an alliance, for example.\nNeighbourhood diplomacy matters as well. China’s rise in the world cannot be realised without its rise in Asia. As Mao Zedong said, it is very important to identify who is friend and who is enemy. Treating everyone as a friend often means having no genuine friends.\nTensions between Beijing and Manila have been rising. The Philippines has also tightened security with the US and its allies. You have said Beijing needs to maintain strategic patience in the South China Sea. Does the recent collision between Chinese vessels during a confrontation with the Philippines near Scarborough Shoal mean it is time for a different approach?\nThe interests of the US are deeply embedded globally, such as in Europe, the Middle East and Asia. But we need to accept the fact that the US cannot be driven away, nor can it successfully or completely retreat from those regions.\nThe prerequisite to resolving the South China Sea disputes is to acknowledge the US presence in the region, and we should also be aware that the ultimate goal is not to expel its influence from the Western Pacific.\nIf both sides deemed the removal of the US from the Western Pacific was the final goal, that might be the worst scenario\nZheng Yongnian\nWhen the US withdraws from a region, chaos often follows – as we have witnessed in the Middle East and Ukraine. The affected countries often end up asking the US to return.\nWe may need to think out of the box and break with orthodox thinking. China is a strong advocate for globalisation and it might not be in line with our push to overemphasise external forces. Do we need to go to Latin America? Do we need a European market? Of course – we are all intertwined.\nOur perception of facts depends on our mindset. In my view, the South China Sea dispute is not a big headache. What matters more is how we understand the issue. Without a proper perception, it will be hard to build mutual trust.\nIf both sides deemed the removal of the US out of the Western Pacific was the final goal, that might be the worst scenario.\nJust as we used to allow US warships to make port calls in Hong Kong, we could consider the possibility of opening certain infrastructure on islands in the South China Sea to American vessels as an international public good.\nThat might allow more opportunities to solve the issue fundamentally.\n\nThe South China Sea disputes are increasingly complicated by the Taiwan issue. How can the situation be managed to avoid miscalculation and mitigate risks?\nWe still need strategic patience.\nDeng Xiaoping raised the strategy of “hiding capabilities and biding time” – which many in the West interpret as waiting to take revenge. That is not the meaning. It refers to seeking a rational, better solution while exercising patience. As Premier Li Qiang once said, there are more solutions than problems.\nWe need to seek truth from facts and learn from history – such as West Germany, which offered citizenship to East Germans, offered exchange rate parity between the two currencies and levied a 5.5 per cent unity tax on West Germans.\nWe won’t drop the use of the military as a last resort and we should prevent any attempt at independence. But there is much room for us on social and economic fronts to move towards reunification and attract Taiwanese people.\nWe have talked a lot about the political will of reunification and the issues from ideological perspectives, but we seldom think about how to achieve it in concrete moves. It is time to think.\nIs China’s new K visa for STEM professionals likely to be effective in attracting foreign talent to China?\nVisa policy matters. The K visa is only the first step. From a policy standpoint, it may be China’s first visa specifically designed for talent. Look at the US – it has various visa categories for different types of talent.\nBut once someone gets a K visa, you still have to consider other issues, such as how to arrange things for the person’s family. Attracting talent is not just about a visa or money. It is about the ecosystem, on which China still has a lot of work to do.\nWe really need an active society. If you rely solely on a government-commissioned institution to tell China’s stories, it will certainly not succeed\nZheng Yongnian\nIt is moving in the right direction. China will definitely become more open in education and talent attraction.\nThere is likely to be a series of new measures in the higher education area – including in relation to the operation of foreign universities in China – rolled out during the 15th five-year plan period.\nChina is a large country and different social groups have varying views on certain issues. Advancing step by step has its advantages, but the direction must be maintained. We should continue moving steadily forward.\nDoes the growing international popularity of Chinese dramas, games and toys suggest that relaxing regulations could also help to tell China’s stories well?\nYes. China’s stories can take many forms, including written forms and those you just mentioned. And the relaxation of regulations is needed.\nWe cannot see the West as homogeneous. It is made up of diverse social groups with different needs. That means we need more people, using different ways, to tell China’s stories.\nWe really need an active society. If you rely solely on a government-commissioned institution to tell China’s stories, it will certainly not succeed.","summary":"Zheng Yongnian is a leading political scientist and government adviser in China. His academic work is mainly about contemporary politics, the country’s transformation and external relations. In his second in-depth interview with the Post, Zheng discusses AI governance and how China can consolidate its narrative amid growing geopolitical risks. This interview first appeared in SCMP Plus. For other interviews in the Open Questions series, click here.\nFor many years, you have called for the...","url":"https://www.scmp.com/news/china/diplomacy/article/3325111/zheng-yongnian-why-china-must-look-beyond-west-build-better-ai","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/09/11/45b0d066-085e-48cf-adb4-5f3c9cc0caed_65c935b9.jpg","video":null,"publish_date":"2025-09-14 22:00:15","author":"Orange Wang,Wendy Wu","authors":["Orange Wang","Wendy Wu"],"language":"en","source_country":"cn","sentiment":0.295},{"id":360502760,"title":"Alleged Kirk killer had leftist beliefs, says Utah governor","text":"Utah governor Spencer Cox said Tyler Robinson's partner is cooperating with the authorities. (AP pic)\nWASHINGTON: The man arrested over conservative influencer Charlie Kirk's assassination was romantically involved with a transgender roommate and had \"leftist ideology\", Utah's governor said Sunday, confirming details likely to inflame the contentious national debate over the killing.\n\"Yes, I can confirm that,\" governor Spencer Cox told CNN's \"State of the Union\" talk show when asked about suspect Tyler Robinson's reported relationship with a trans partner.\n\"The roommate was a romantic partner, a male transitioning to a female,\" Cox said.\n\"This partner has been incredibly cooperative, had no idea that this was happening, and is working with investigators right now,\" he added.\nCox, who said 22-year-old Robinson is expected to be formally charged Tuesday, went on to stress it was not yet clear whether the partner's transitioning was part of the alleged shooter's mindset to kill Kirk, a close ally of US President Donald Trump.\n\"Again, all of these things – we're trying to figure out,\" he said.\nCox, who earned plaudits this past week for urging Americans to lower the toxic political temperature, made the rounds of US networks Sunday and told NBC talk show \"Meet the Press\" that investigators believed Robinson had embraced leftist beliefs.\n\"There clearly was a leftist ideology with this – with this assassin,\" Cox said.\nHe said such information about Robinson, who has not been cooperating, was told to investigators by \"people around him, from his family members and friends\".\nSeveral US media outlets on Saturday reported Robinson's relationship with a transgender individual, sparking fury from far-right activists for whom gender identity issues have been a key focus in recent years.\nLaura Loomer, a conservative influencer who has Trump's ear, called Saturday \"to designate the trans movement as a terrorist movement,\" while X-owner Elon Musk elevated multiple posts calling for gender treatment bans and denouncing leftist ideology.\nOn Saturday he went further, telling a London march organised by far-right activists that \"the left is the party of murder\".\nCox meanwhile reiterated a call for civility across the political spectrum while attacking social media giants by comparing their addictive algorithms to the deadly drug fentanyl.\n'Trans delusion' \nKirk was shot Wednesday during a speaking event on a Utah university campus. He was the founder of the conservative youth political group Turning Point USA and was a strong critic of the transgender rights movement.\nHe wrote on X about what he called a \"trans delusion death cult\" in August, shortly after two children were killed and nine others wounded at a school church shooting in Minneapolis by an assailant authorities say was a 23-year-old man who claimed to be transgender.\nKirk's provocations have stirred debate. He often invoked his Christian faith and criticised what he and others have called gender ideology.\nIn a video posted in 2023 by Right Wing Watch, Kirk is seen describing individuals being transgender to a church audience as \"a throbbing middle finger to God\".\nWith debate raging over what inspired Kirk's murder, a member of former president Joe Biden's cabinet, Pete Buttigieg, stressed there was \"not a consistent pattern of left versus right among the shooters\" in recent high-profile attacks, noting that Minnesota Democratic lawmaker Melissa Hortman and her husband were killed in June.\n\"We have to reject anyone who would try to exploit political violence,\" Buttigieg told NBC.\n\"The response to this cannot be for the government to crack down on individuals or groups because they challenge the government politically.\"\nTurning Point USA announced that a memorial service for Kirk will take place in a football stadium near Phoenix, Arizona on Sept 21, which Trump is expected to attend.","summary":"Spencer Cox said the suspect was romantically involved with a transgender roommate, a detail likely to intensify debate over the killing.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/09/15/alleged-kirk-killer-had-leftist-beliefs-says-utah-governor","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1603,height=1002/https://media.freemalaysiatoday.com/wp-content/uploads/2025/09/ce5e6b74-spencer-cox-15092025.webp","video":null,"publish_date":"2025-09-14 21:49:22","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.073},{"id":360505192,"title":"Suspect in Charlie Kirk shooting 'not cooperating' with investigators, Utah governor says","text":"Utah governor Spencer Cox on Sunday said the accused gunman, Tyler Robinson, 22, would be formally charged on Tuesday. He remains in custody in Utah. Investigators have yet to piece together why Robinson allegedly scaled a rooftop at Utah Valley University during an outdoor event and shot Kirk in the neck at long range on Wednesday last week. Kirk, a staunch ally of US President Donald Trump and co-founder of the conservative student group Turning Point USA, was killed by a single rifle shot during the event attended by 3,000 people in Orem , about 40km south of Salt Lake City. The killing ushered in newfound fears of a spike in political violence in the US and an ever-deepening divide between the left and the right. Robinson has not confessed to investigators, Cox told the ABC in the US. \"He is not cooperating, but all the people around him were cooperating, and I think that&apos;s very important,\" the Republican governor said. Cox said that Robinson&apos;s roommate, who was also a romantic partner, had been \"incredibly cooperative\" with authorities, citing the Federal Bureau of Investigation. Robinson, a third-year student in the electrical apprenticeship program at Dixie Technical College, part of Utah&apos;s public university system, was taken into custody at his parents&apos; house, about 420km southwest of the crime scene after a 33-hour manhunt. Relatives and a family friend alerted authorities that he had implicated himself in the crime, Cox said previously. While Robinson was raised by religious parents in a deeply conservative region of the state, \"his ideology was very different than his family,\" Cox said on Sunday on an NBC program. State records show Robinson was a registered voter but not affiliated with any political party. A relative told investigators that Robinson had grown more political in recent years and had once discussed with another family member their dislike for Kirk and his viewpoints, according to the arrest warrant affidavit. Robinson was \"not a fan\" of Kirk, Cox said on Sunday. Investigators found messages engraved into four bullet casings , which included references to memes and video game in-jokes. An affidavit filed by authorities in the case described these messages. download our app subscribe to our newsletter</b","summary":"Police investigating Tyler Robinson, the Utah man suspected of shooting right-wing commentator Charlie Kirk, have yet to establish a motive for the killing. Utah's governor said he would be formally charged on Tuesday.","url":"https://www.sbs.com.au/news/article/suspect-in-charlie-kirk-shooting-not-co-operating-with-investigators-utah-governor-says/m2aoqggxg","image":"https://images.sbs.com.au/dims4/default/09d30ca/2147483647/strip/true/crop/2000x1125+0+104/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F17%2Fe0%2F752c0c9947f7ad991e5c85174c04%2Fcomposite-photo-tyler-robinson-is-facing","video":null,"publish_date":"2025-09-14 21:48:15","author":"Getty / Trent Nelson/the Salt Lake Tribune","authors":["Getty / Trent Nelson/the Salt Lake Tribune"],"language":"en","category":"politics","source_country":"au","sentiment":0.075},{"id":360507830,"title":"Senior diplomat expresses regret over raid at Hyundai plant","text":"Sept. 14 (UPI) -- The United States' second-most senior diplomat expressed regret Sunday over the recent immigration raid at a Hyundai car battery plant in Georgia.\n\nU.S. Deputy Secretary of State Christopher Landau met Sunday with First Vice Minister of Foreign Affairs Park Yoon-joo to discuss cooperation in the continued efforts to resolve the diplomatic spat stemming from the raid, South Korea's Foreign Ministry said in a statement.\n\nDuring the meeting, Park highlighted the \"uncomfortable treatment\" faced by hundreds of South Korean nationals who were detained and deported after the raid and the shock felt across the country at the incident.\n\n\"Deputy Secretary Landau expressed deep regret over the incident and proposed using it as a turning point to improve the [visa] system and strengthen the [Republic of Korea-United States] relationship,\" the foreign ministry said. Landau was also said to have recognized the significant contributions and investments made by Korean companies for the \"revitalization of the U.S. economy and manufacturing industry.\"\n\nHe added that President Donald Trump is also \"highly concerned\" about this issue, and that he will ensure that Korean workers who return to the United States will not difficulty with reentering, South Korean officials said.\n\n\"The United States welcomes and encourages foreign investment in our country and therefore logically welcomes and encourages the personnel necessary to get those investments up and running,\" Landau said in a post to social media after the meeting.\n\n\"These are the kind of visitors we want, who are creating American jobs and prosperity right here at home. Korean companies are poised to make massive new investments in our country in shipbuilding among other industries.\"\n\nMore than 300 workers from South Korea were arrested earlier this month during the raid at the factory, which Hyundai Motor Group and LG Energy Solution operate. More than 150 other workers were also detained.\n\nThe raid was announced by the Bureau of Alcohol, Tobacco, Firearms and Explosives and included officers from other agencies, such as Homeland Security Investigations and U.S. Immigration and Customs Enforcement. It marked one of the largest immigrant raids in modern American history.\n\nLast Sunday, a senior South Korean official said that the country will charter a plane for the return of hundreds of workers who were detained.","summary":"The United States' second-most senior diplomat expressed regret Sunday over the immigration raid at a Hyundai car battery plant in Georgia earlier this month.","url":"https://www.upi.com/Top_News/US/2025/09/14/senior-diplomat-expresses-regret-hyundai-immigration-raid/3121757882774/","image":"https://cdnph.upi.com/sv/ph/og/upi_com/3121757882774/2025/1/88b8334baf86ca8e097ea85b88393a7f/v1.5/Senior-diplomat-expresses-regret-over-raid-at-Hyundai-plant.jpg","video":null,"publish_date":"2025-09-14 21:46:23","author":"Adam Schrader","authors":["Adam Schrader"],"language":"en","category":"politics","source_country":"US","sentiment":-0.185},{"id":360520052,"title":"UnitedHealth sought to meet with Trump, WSJ reports - Reuters","text":"CompaniesUnitedHealth Group Inc\n\nSept 14 (Reuters) - UnitedHealth (UNH.N), opens new tab has sought meetings with U.S. President Donald Trump, although it has not secured one yet, the Wall Street Journal reported on Sunday.\n\nThe attempts are part of a bolstered lobbying effort in Washington, D.C., by the top U.S. health insurer at a time it faces numerous regulatory challenges, the paper reported.\n\nUnitedHealth has been grappling with high costs and federal investigations, including a criminal one into its Medicare billing practices, which have pushed its share price down around 30% this year. Stephen Hemsley returned to the CEO role in May, after the ouster of Andrew Witty, and promised to regain investor trust.\n\nAdvertisement · Scroll to continue\n\nHemsley recently met Trump's chief of staff, Susie Wiles, although the criminal investigation was not discussed or brought up by the CEO, a White House official told Reuters.\n\nThe WSJ said the meeting covered discussion on the Medicare health insurance program for seniors and the disabled as well as other issues, also citing a White House official.\n\nHemsley also had dinner with Chris Klomp, the official overseeing Medicare in the summer, and discussed Medicare-plan billing policies and supplemental benefits offered under private Medicare plans, the newspaper said.\n\nIn response to Reuters' request for comment, UnitedHealth said \"public policy shapes healthcare across America, and it's our responsibility to engage with the administration and Congress at all levels to improve patient access and affordability,\" adding that it is especially true now \"as critical decisions are being made.\"\n\nAdvertisement · Scroll to continue\n\nKush Desai, a White House spokesperson, told the WSJ the Trump administration \"routinely meets with insurers to deliver on the President's mandate of improving healthcare and lowering costs for everyday Americans.\"\n\n(This story has been refiled to fix the spelling of the reporter's name in reporting credits)\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV2036300756 \nAbout ConnatixV2036300756 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Chandni Shah and Yazhini MV in Bengaluru; additional reporting by Ananya Palyekar; writing by David French in New York; editing by David Goodman, Paul Simao and Nia Williams\n\nPurchase Licensing Rights","summary":"UnitedHealth sought to meet with Trump, WSJ reports  Reuters","url":"https://www.reuters.com/business/healthcare-pharmaceuticals/unitedhealth-sought-meet-with-trump-wsj-reports-2025-09-14/","image":"https://www.reuters.com/resizer/v2/VA63JBRFB5MNRBIVQLLLK6PQ4M.jpg?auth=53e7bc89d83913728ba348e680ad950276036073a78bda660c9d3fde29355d14&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-09-14 21:45:19","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":360511364,"title":"Emmys host Nate Bargatze says he will NOT make the show political and will avoid talking about Charlie Kirk","text":"Emmys host Nate Bargatze will not make the show political.\n\nThe 46-year-old comedian will present the awards ceremony in Los Angeles on Sunday and explained that he wasn't planning to delve into politics even before the fatal shooting of conservative activist Charlie Kirk earlier this week.\n\nAsked how political these Emmys will be, Nate told Entertainment Weekly: 'Not at all. I know there's heartbreaking stuff that's been happening right now, but I want this night to be an escape and I think that's why I was brought on.\n\n'I think a lot of people are watching, I know they watch my stand-up for that reason, so I just don't wanna break that trust I have in them, and just make the night be a fun night.'\n\nNate explained that there have been no late script changes since the death of Kirk - a close ally of US President Donald Trump - as 'we were never really gonna do anything (political) to begin with'.\n\nThe comic said: 'Everybody has to deal with that stress all day long. So I wanna be just that one escape where they can turn something on and hopefully relax and just have fun.'\n\nBargatze has also promised the same kindly approach to the celebrities in attendance at the ceremony.\n\nHe said: 'We're not trying to just go be mean to everybody. I want it to be a fun, silly night that everybody can have kind of an escape.\n\n'Basically, I don't want to, when I see them afterwards, it to be weird. I want them to be fun and good-natured and them be good sports about it.'\n\nNate revealed that he has sought the advice of experienced awards host Jimmy Kimmel, who spoke of the importance of being able to react to any unexpected events.\n\nThe comedian said of Kimmel: 'He wrote down a lot of stuff for me. One of the big ones was to sit down... \n\n'When you're off camera, go sit down. So that was good advice.'\n\nBargatze added: 'He is like, look, you gotta be ready for when something happens and you gotta be ready to go out there.\n\n'If something weird happens, like as a host, you gotta go out there and address it.\n\n'It's nice to hope nothing like that happens, but I'm very aware of if it does, get out there, handle it.","summary":"'I know there's heartbreaking stuff that's been happening right now, but I want this night to be an escape and I think that's why I was brought on.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-15098139/Emmys-host-Nate-Bargatze-says-NOT-make-political-avoid-talking-Charlie-Kirk.html","image":"https://i.dailymail.co.uk/1s/2025/09/14/22/102026365-0-image-m-50_1757884919619.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/09/14/2350021503568464010/1024x576_MP4_2350021503568464010.mp4","publish_date":"2025-09-14 21:44:50","author":"Editor,Heidi Parker","authors":["Editor","Heidi Parker"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.478},{"id":360510546,"title":"Trump Shifts Tone After ICE Raids on South Korean Workers, Says US Welcomes Foreign Workers to Train Americans","text":"President Donald Trump on Sunday signaled that the United States would welcome foreign specialists to train American workers in high-technology industries, days after hundreds of South Korean laborers were arrested in a raid at an electric vehicle battery plant in Georgia and later repatriated. The comments appeared to place the administration’s economic goals above its immigration enforcement policies, as fallout from the arrests threatened to strain relations with a key American ally and imperil billions of dollars in planned investment. On September 4, Immigration and Customs Enforcement officers raided a Hyundai-LG joint venture site in Georgia, where a battery plant is under construction. Hundreds of South Korean workers were detained and taken to immigration facilities. The incident sparked public outrage in South Korea, prompting officials in Seoul to send a plane to bring the workers home. South Korean President Lee Jae Myung warned that the raid could chill investment in the United States. Hyundai alone has pledged $26 billion to build auto and battery plants in the country. The trade deal between the two nations also covers investments in sectors such as shipbuilding, which American officials have said they hope to revive. Christopher Landau, the deputy secretary of state, travelled to Seoul last week and, according to South Korean media reports, \"conveyed his deep regrets\" over the episode. Earlier, Commerce Secretary Howard Lutnick had placed blame on Hyundai, telling The Axios Show that the company should have contacted him for assistance with visas. In a lengthy post on Truth Social on Sunday, Trump defended the role of foreign workers in transferring knowledge to Americans when companies commit to largescale projects in the United States. \"When Foreign Companies who are building extremely complex products, machines, and various other ‘things,’ come into the United States with massive Investments, I want them to bring their people of expertise for a period of time to teach and train our people how to make these very unique and complex products,\" Trump wrote. \"If we didn’t do this, all of that massive Investment will never come in the first place — Chips, Semiconductors, Computers, Ships, Trains, and so many other products that we have to learn from others how to make, or, in many cases, relearn, because we used to be great at it, but not anymore,\" he added. American officials had dismissed concerns that the Georgia raid might discourage future investment. However, Trump acknowledged the risk on Sunday. \"I don’t want to frighten off or disincentivize Investment into America by outside Countries or Companies,\" he wrote. \"We welcome them, we welcome their employees, and we are willing to proudly say we will learn from them, and do even better than them at their own ‘game,’ sometime into the not too distant future!\" Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"On September 4, ICE officers raided a Hyundai-LG joint site in Georgia and detained hundreds of South Korean workers","url":"https://www.timesnownews.com/world/us/us-news/us-president-donald-trump-foreign-workers-train-americans-south-korea-ice-raids-article-152801904","image":"https://images.timesnownews.com/thumb/msid-152801905,thumbsize-33464,width-1280,height-720,resizemode-75/152801905.jpg","video":null,"publish_date":"2025-09-14 21:42:12","author":"Rounak Bagchi","authors":["Rounak Bagchi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.061}]}