{"offset":0,"number":50,"available":10621,"news":[{"id":273742764,"title":"Nordic-Baltic Security Coalition Meets Amid Heightened European Security Concerns","text":"Leaders of the Joint Expeditionary Force (JEF), a Nordic-Baltic military coalition that can act independently in its own right, are meeting in Tallinn as European security concerns remain heightened due to Russia's war on Ukraine.\n\nThe JEF meeting comes after NATO head Mark Rutte issued a stark warning to alliance members to \"turbo-charge\" defense spending, saying European nations were not prepared for the threat of future war with Russia.\n\nEstonian Prime Minister Kristen Michal is expected to recommend to JEF members to raise the minimum threshold of defense spending to at least 2.5% of GDP during this week’s meeting.\n\nRussia’s nearly three-year war against Ukraine will be one of the main topics discussed at Monday and Tuesday's JEF meeting.\n\n“In addition to the development of our own national defense, we must continue to stand by Ukraine. A victory for Ukraine is a victory for all of us — both Europe and the United States. All NATO states should focus not only on developing their own defense capabilities, but also on winning the war in Europe,\" Michal said ahead of the meeting.\n\nAmong the ideas being discussed is expanding the JEF to include Poland and Ukraine, which could provide a “deterrent presence in Ukraine through frequent exercises and the provision of air support,” according to a recent article by Ian Bond, deputy director of the Centre for European Reform.\n\nThe JEF could also act as a response mechanism for incidents such as suspected sabotage of critical underwater infrastructure.\n\nSeveral instances in recent years have raised suspicions of sabotage by enemy actors. Most recently was the cutting of two undersea data cables on the Baltic Sea floor in November, which occurred immediately after Ukraine used long-range missiles to attack Russia, according to Reuters. \n\nA diminished U.S. commitment to NATO under President-elect Donald Trump could elevate the JEF’s importance for ensuring Europe’s security.\n\nIn his article, Bond called for members to “ensure that the JEF has realistic tasks, is resourced to perform them, and contributes to NATO’s deterrent and defensive activities in the Nordic-Baltic and North Atlantic regions.”\n\nEstablished after Russia annexed Crimea from Ukraine in 2014, JEF is a rapid deployment force to respond to security threats in Europe. The British-led program includes Denmark, Estonia, Latvia, Lithuania, the Netherlands and Norway.\n\nFinland and Sweden joined the JEF in 2017 as non-NATO members and Iceland joined in 2021. \n\nYet despite its potential, critics of JEF say it is slow, underfunded and lacks the participation of Germany and Poland. \n\n“For now, the JEF is well-suited to filling the gap between peace and open conflict — the grey zone in which NATO may struggle to agree how to react to events — and should concentrate on learning to fill it effectively,” Bond wrote.\n\n“The JEF could conceivably become involved in full-scale conflict in its own right. Fighting such wars, however, would require far more resources than the JEF currently has,” he said.","url":"https://www.themoscowtimes.com/2024/12/16/nordic-baltic-security-coalition-meets-amid-heightened-european-security-concerns-a87351","image":"https://static.themoscowtimes.com/image/og/44/87351__4432d76f9ad62f48b53292af68cb814b.jpg","video":null,"publish_date":"2024-12-17 01:15:22","author":"Moscow Times Reporter","authors":["Moscow Times Reporter"],"language":"en","source_country":"ru","sentiment":0.163},{"id":273743036,"title":"Aussie peacekeeper hint in Ukraine answer","text":"The Defence Minister joined Penny Wong for talks with their British counterparts in London on Monday (local time).\n\nAsked at a joint press conference if Australia would contribute to any peacekeeping activity in Ukraine, Mr Marles reiterated Canberra’s longheld support for Kyiv.\n\n“We will stand by Ukraine and continue our support until it can resolve this conflict on its terms,” he told reporters.\n\nHe noted that the Albanese government had recommitted Australian troops to training up Ukrainians in the UK for another year as part of the British-led Operation Interflex.\n\n“We will continue to look at ways in which we can support Ukraine for a long as it takes and we will work really closely with the UK as to what that commitment looks like,” Mr Marles said.\n\nAsked the same question about deploying British troops, UK Defence Secretary John Healey gave a similar response to Mr Marles, saying Russian President Vladimir Putin “cannot prevail, he will not prevail, and Ukraine will have our support for as long as it needs”.\n\n“Our job as allied nations that stand steadfast with Ukraine is to support them in any negotiations, just as we will through any battlefield fighting,” Mr Healey said.\n\nThe election of Donald Trump in the US has sparked questions about where Ukraine would fit into his America first agenda.\n\nThe incoming US president has said he could end the war within 24 hours, raising eyebrows in Ukraine and Western countries, who fear Mr Trump may cut support and try striking a deal with Mr Putin without Kyiv’s input.\n\nThough, NATO members have vowed to continue backing Kyiv, with a growing calls in the alliance’s eastern flank to put troops in Ukraine with a view to deterring Russia’s westward expansion.\n\nRussia’s invasion of Ukraine has killed and wounded hundreds of thousands on both sides and displaced more than 10 million.\n\nWhile Russian forces have continued to make minor advances in Ukraine’s east, it has come at an enormous human cost.\n\nStruggling with the losses, Moscow has started sending North Korean troops to the front lines.\n\nSome 11,500 Ukrainians have found safe haven in Australia.\n\nAustralia has contributed more than $1.5bn-worth of aid to Ukraine’s fight against invading Russian forces, including 49 M1A1 Abrams main battle tanks.\n\nForeign Minister Wong will travel to Brussels on Tuesday (local time) to meet with NATO counterparts and discuss Australia’s future support for Ukraine.","summary":"Richard Marles says Australia will “support Ukraine for as long as it takes”, failing to rule out deploying troops in a peacekeeper capacity.","url":"https://www.news.com.au/national/politics/marles-doesnt-rule-out-australian-peacekeepers-in-ukraine/news-story/d0055b38b98cf1310296121a6b04e7fc?from=rss-basic","image":"https://content.api.news/v3/images/bin/027a08497f0f5be9b0d3efbce83b9018","video":null,"publish_date":"2024-12-17 01:15:22","author":"Joseph Olbrycht","authors":["Joseph Olbrycht"],"language":"en","category":"politics","source_country":"au","sentiment":-0.045},{"id":273742710,"title":"Trump says it was ‘stupid’ for Biden to let Ukraine use US weapons to strike deeper into Russia","text":"PALM BEACH, Fla. (AP) - President-elect Donald Trump on Monday suggested that he may reverse President Joe Biden’s recent decision to allow Ukrainian forces to use American long-range weapons to strike deeper into Russian territory.\n\nTrump called the decision made by Biden last month \"stupid.” He also expressed anger that his incoming administration was not consulted before Biden made the move. With the loosening of the restrictions, Biden gave Ukraine long-sought permission to use the Army Tactical Missile System provided by the U.S. to strike Russian positions hundreds miles from its border.\n\n\"I don't think that should have been allowed, not when there's a possibility - certainly not just weeks before I take over,” Trump said during at a wide-ranging news conference at his Mar-a-Lago resort. “Why would they do that without asking me what I thought? I wouldn't have had him do that. I think it was a big mistake.\"\n\nTrump’s withering criticism of the Biden administration’s move comes as the Democratic administration aims to push every last dollar already designated for Ukraine out the door to help repel Russia’s invasion before Trump takes office on Jan. 20, with future aid uncertain.","url":"https://news.net/news/trump-says-it-was-stupid-for-biden-to-let-ukraine-use-us-weapons-to-strike-deeper-into-russia/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2024/12/17205824/APTOPIX_Trump_39801-scaled.jpg","video":null,"publish_date":"2024-12-17 01:14:24","author":"Colleen Long","authors":["Colleen Long"],"language":"en","category":"politics","source_country":"au","sentiment":-0.672},{"id":273742706,"title":"Nasdaq hits a record as Wall Street drifts ahead of Federal Reserve’s meeting","text":"The question is how much more it will cut rates next year, and Fed officials will release projections for where they see the federal funds rate ending 2025, along with other economic indicators, once their meeting concludes. Fed Chair Jerome Powell will also answer questions in a press conference following the meeting.\n\nFor now, the general expectation among traders is that the Fed may cut a couple more times in 2025, according to data from CME Group. But such expectations have been shrinking following reports suggesting inflation may be tougher to get all the way down to 2% from here. Besides last month's slight acceleration in inflation, another worry is that President-elect Donald Trump's preferences for tariffs and other policies could lead to higher inflation down the line.\n\nGoldman Sachs economist David Mericle has dropped his earlier forecast of a cut by the Fed in January, for example. Beyond the possibility of tariffs, he said Fed officials may also want to slow their cuts because of uncertainty about exactly how low rates need to go so that they no longer press the brakes on the economy.\n\nExpectations for a series of cuts to rates by the Fed have been one of the main reasons the S&P 500 has set an all-time high 57 times so far this year and is heading for one of its best years of the millennium. The economy has held up better than many feared, continuing to grow even after the Fed hiked the federal funds rate to a two-decade high in hopes of grinding down on inflation, which topped 9% two summers ago.\n\nOn Wall Street, MicroStrategy jumped as much as 7% during the day as it continues to benefit from the surging price for bitcoin, which set another all-time high. But its stock ended the day down by les than 0.1% after bitcoin's price pulled back below $106,000 after setting a record above $107,700, according to CoinDesk.","url":"https://news.net/news/nasdaq-hits-a-record-as-wall-street-drifts-ahead-of-federal-reserves-meeting/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2024/05/22222934/Financial_Markets_New_York_13107.jpg","video":null,"publish_date":"2024-12-17 01:14:24","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.098},{"id":273743114,"title":"Judge rejects Trump's bid to dismiss Stormy Daniels hush money conviction","text":"A judge has rejected president-elect Donald Trump's bid to have his \"hush money\" conviction dismissed because of the US Supreme Court's recent ruling on presidential immunity.\n\nManhattan Judge Juan M Merchan's decision on Monday eliminates one potential off-ramp from the case ahead of Trump's return to office next month, but his lawyers have raised other arguments for dismissal.\n\nProsecutors have said there should be some accommodation for his upcoming presidency, but they insist the conviction should stand.\n\nA jury convicted Trump in May of 34 counts of falsifying business records related to a $US130,000 ($204,000) hush money payment to porn actor Stormy Daniels in 2016.\n\nTrump has denied any wrongdoing.\n\nThe allegations involved a scheme to hide the payment during the final days of Trump's 2016 presidential campaign to silence the actor's claims that she and Trump had sex years earlier, which he denied.\n\nA month after the verdict, the Supreme Court ruled that ex-presidents could not be prosecuted for official acts — things they did in the course of running the country — and that prosecutors could not cite those actions to bolster a case centred on purely personal, unofficial conduct.\n\nTrump's lawyers cited the ruling to argue that the hush money jury got some improper evidence, such as Trump's presidential financial disclosure form, testimony from some White House aides and social media posts made while he was in office.\n\nProsecutors disagreed and said the evidence in question was only \"a sliver\" of their case.\n\nThe case's overall future remains unclear.","summary":"A judge has rejected Donald Trump's bid to have his \"hush money\" conviction dismissed on the basis of the US Supreme Court's recent ruling on presidential immunity.","url":"https://www.abc.net.au/news/2024-12-17/judge-rejects-trumps-bid-to-dismiss-hush-money-conviction/104735330","image":"https://live-production.wcms.abc-cdn.net.au/b6759209ef257e2bf8ba52e7d12868dd?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485","video":null,"publish_date":"2024-12-17 01:10:10","author":"ABC News","authors":["ABC News"],"language":"en","category":"politics","source_country":"AU","sentiment":-0.036},{"id":273741524,"title":"Canada finance minister's resignation tests Justin Trudeau","text":"TORONTO (AP) -- Canadian Prime Minister Justin Trudeau faced the biggest test of his political career after Finance Minister Chrystia Freeland, long one of his most powerful and loyal ministers, resigned from the Cabinet on Monday.\n\nThe stunning move raised questions about how much longer the prime minister of nearly 10 years -- whose popularity has plummeted due to concerns about inflation and immigration -- can stay on as his administration scrambles to deal with incoming U.S. President-elect Donald Trump.","url":"https://asia.nikkei.com/Politics/Canada-finance-minister-s-resignation-tests-Justin-Trudeau","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F2%2F4%2F1%2F0%2F48730142-1-eng-GB%2FAP24347008840016.jpg?width=1200&fit=cover&gravity=faces&d","video":null,"publish_date":"2024-12-17 01:06:23","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.041},{"id":273741650,"title":"Bitcoin&apos;s 2024 surge: Bubble warning?","text":"Bitcoin looks like the star of 2024, with a mind-blowing increase in price of 147 per cent for the year. The big question is: what happens next? The buzz is that - with Donald Trump returning to power and pledging support for cryptocurrency - Bitcoin could be poised for a big run. We&apos;ve hit the stage where Uber drivers and home handymen are telling me to get on board. That&apos;s a classic red flag! I don&apos;t hold any crypto, and I&apos;m reminded of financier Joseph P Kennedy&apos;s famous warning: \"You know it&apos;s time to sell when shoeshine boys start giving stock tips.\" You can even find Bitcoin ATMs in many newsagencies now. The best part for small investors? You don&apos;t need to buy an entire coin: you can start with small fractions. We were driving in the country recently, and I was chatting to the owner of a small newsagency agency ... I asked him if anyone used his bitcoin ATM; he said it was extremely busy, especially with the young folks. Then he shared something remarkable. He had bought five bitcoins a few years ago at $10,000 each. Today, his holding is worth nearly three-quarters of a million dollars. When I asked if he planned to sell, he shrugged and said, \"I&apos;ll just let it sit there.\" I&apos;m hearing more and more stories like this: people who bought a couple of bitcoins on a whim a few years back now find themselves sitting on life-changing profits. Yet people&apos;s prevailing attitude seems to be the same: let it ride and see what happens. The price has certainly been volatile. On 22 December 2017, Bitcoin hit a peak of AUD $26,000 before plunging to just AUD $4700 in February 2019. It then surged to AUD $82,800 by 5 November 2021, only to retreat to AUD $25,000 in December 2022. Now, Bitcoin has reached an all-time high of AUD $152,000, representing an incredible 146 per cent increase over the past year. This is not a new phenomenon. In the 1600s, the Dutch found themselves swept up in a frenzy over a simple flower - the tulip. These exotic blooms, brought all the way from the Ottoman Empire, became the must-have item of the day. Demand shot through the roof, and so did prices. Then traders started buying and selling tulip futures - betting on flowers that hadn&apos;t even bloomed yet! It was all going gangbusters until February 1637, when the bottom fell out of the bubble. Buyers vanished, prices crashed, and people who&apos;d gambled everything were left empty-handed. The Poseidon bubble was a wild ride that became the stuff of Aussie legend. In 1969, Poseidon NL was just another little mining company until word got out they&apos;d struck it rich with a nickel discovery in WA. With nickel prices soaring, the share price went from a humble 80 cents to an eye-popping $280. Everyone wanted a piece of the action. But then it all came crashing down like a cyclone blowing through a tin shed. Nickel prices nosedived, doubts crept in, and the shares sank like a stone. It was a fair dinkum reminder: what goes up doesn&apos;t always stay up. Just three years ago a horde of day traders, acting on information from social media site WallStreetBets, joined forces to do battle with American hedge funds who had shorted stocks like GameStop, which had shot up 8720 per cent to $483 in just two months. That stock plunged rapidly, dropping to around $40 by mid-2021. What do these tales all have in common? They are investment bubbles. The item at the core of an investment bubble may have real intrinsic value, but at some point, market sentiment strays well away from that value. From then on, the sky&apos;s one limit, and the other is the bottom of the deep blue sea. A bubble is all about investor sentiment, and when one forms, it will inevitably pop at some point. If you want to gamble on a bubble, by all means do so - as long as you don&apos;t bet more than you can afford to lose. Question: I received 500 Coles Myer shares back in the 1990s at no cost to me. Since then they have transferred to Wesfarmers and Coles shares. I have always used my dividends to buy more shares so now I&apos;m up to about 300 of each. The total holding is $27,000. I am about to apply for the age pension so should I sell them before or after I apply? I have taken early retirement due to looking after my wife and we live on my superannuation. Also how much capital gains tax would I be liable to pay? Answer: Whether you hold the shares or sell them, their value will be an asset for age pension purposes and for the income test. Either the shares or cash will be given a deemed value. If you feel the shares appear to have good long-term value your best strategy might be to hold them for the long term. If you do sell them, CGT should be fairly small because you were using dividend reinvestment which keeps increasing the cost base. I would think a taxable gain of $9000 after 50 per cent discount is a reasonable guess - if so capital gains tax would be calculated by adding $9000 to your taxable income in the year you dispose of them. Question: I have a query regarding splitting your super with your spouse and maximising potential Centrelink benefits. My retired husband is 65 and next financial year we will be selling both our investment houses which are in his name only. He doesn&apos;t want to be bothered with meeting work tests when he&apos;s older than 67 so it&apos;s time to sell. We&apos;ve held the houses since 2009 and 2010. As you have often said if only we&apos;d put the money into shares, we&apos;d be much better off! He has only $60,000 in super. He has about $150,000 of unused concessional contributions from the last five years so he will be making a concessional contribution to his super in both financial years to help offset CGT. With the remaining balance from selling our investment homes, we want to make a non-concessional contribution into my super account as I am a few years younger than him. When he&apos;s being assessed for the Age Pension at 67, I understand Centrelink looks back over the previous five years and will see that he sold two investment properties that were in his name. Will Centrelink treat the super contributions he makes with those sale proceeds to my super account as a \"gift\" and therefore the amount will be included as part of his assets for assessment? Answer: You are on the right track, keep in mind that as well as the catch-up concessional contributions, he can use the $30,000 concessional cap available in the financial year in which you sell the properties. His super balance is under $500,000 so there should be no issue with making catch-up contributions. The good news is that Centrelink disregards all money transferred between partners so there&apos;s no question of this being treated as a gift. Just bear in mind that money in superannuation in your name will not be assessed until age 67 unless you start a pension from that fund.","url":"https://www.canberratimes.com.au/story/8841640/bitcoins-2024-surge-bubble-warning/?cs=14329","image":"/images/transform/v1/crop/frm/XTEauKLdkr5NZXsdBVqeEk/789b9aee-325d-40d2-8ba8-88e24377f1e0.jpg/r51_35_5132_2950_w5184_h2974_fmax.jpg","video":null,"publish_date":"2024-12-17 01:06:23","author":"Noel Whittaker","authors":["Noel Whittaker"],"language":"en","source_country":"au","sentiment":0.078},{"id":273741644,"title":"TikTok asks Supreme Court to step in over US ban","text":"TikTok has asked the US Supreme Court to step in over an emergency basis to block the federal law that would ban the popular platform in the United States unless its China-based parent company agreed to sell it. Lawyers for the company and China-based ByteDance on Monday urged the justices to step in before the law&apos;s January 19 deadline. A similar plea was expected from content creators who rely on the platform for income and some of TikTok&apos;s more than 170 million users in the US \"A modest delay in enforcing the Act will create breathing room for this Court to conduct an orderly review and the new Administration to evaluate this matter — before this vital channel for Americans to communicate with their fellow citizens and the world is closed,\" lawyers for the companies told the Supreme Court. President-elect Donald Trump, who once supported a ban but then pledged during the campaign to \"save TikTok,\" said his administration would take a look at the situation. \"As you know, I have a warm spot in my heart for TikTok,\" Trump said during a news conference at his Mar-a-Lago club in Florida. His campaign saw the platform as a way to reach younger, less politically engaged voters. The companies have said that a shutdown lasting just a month would cause TikTok to lose about a third of its daily users in the US and significant advertising revenue. The case could attract the court&apos;s interest because it pits free speech rights against the government&apos;s stated aims of protecting national security, while raising novel issues about social media platforms. The request first goes to Chief Justice John Roberts, who oversees emergency appeals from courts in the nation&apos;s capital. He almost certainly will seek input from all nine justices. On Friday, a panel of federal judges on the US Court of Appeals for the District of Columbia Circuit denied an emergency plea to block the law, a procedural ruling that allowed the case to move to the Supreme Court. The same panel had earlier unanimously upheld the law over a First Amendment challenge claiming that it violated free speech rights. Without a court-ordered freeze, the law would take effect Jan. 19 and expose app stores that offer TikTok and internet hosting services that support it to potential fines. It would be up to the Justice Department to enforce the law, investigating possible violations and seeking sanctions. But lawyers for TikTok and ByteDance have argued that Trump&apos;s Justice Department might pause enforcement or otherwise seek to mitigate the law&apos;s most severe consequences. Trump takes office a day after the law goes into effect. The Supreme Court could temporarily put the law on hold so that the justices can give fuller consideration to First Amendment and other issues. They also could quickly schedule arguments and try to render a decision by Jan. 19. On the other hand, the high court could reject the emergency appeal, which would allow the law to take effect as scheduled. With that last prospect in mind, the companies&apos; lawyers asked for a ruling on their emergency request by January 6 because they&apos;d need the time \"to coordinate with their service providers to perform the complex task of shutting down the TikTok platform only in the United States\". The case has made a relatively quick trip through the courts once bipartisan majorities in Congress approved the law and President Joe Biden signed it in April. Australian Associated Press","url":"https://www.canberratimes.com.au/story/8848768/tiktok-asks-supreme-court-to-step-in-over-us-ban/?cs=14232","image":"/images/transform/v1/crop/frm/silverstone-feed-data/dec3f106-a453-4d9e-a8f0-aa90b1df3751.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-12-17 01:06:23","author":"Mark Sherman","authors":["Mark Sherman"],"language":"en","category":"politics","source_country":"au","sentiment":-0.434},{"id":273742296,"title":"Judge rejects Trump bid to toss \"hush money\" conviction based on presidential immunity","text":"Judge rejects Trump bid to toss \"hush money\" conviction based on presidential immunity\n A New York judge on Monday rejected President-elect Donald Trump's request to throw out his conviction in the criminal \"hush money\" case. Judge Juan Merchan said in a filing that the Supreme Court's ruling giving presidents immunity from prosecution over official acts does not apply to the case. CBS News investigative reporter Graham Kates has more.","summary":"A New York judge on Monday rejected President-elect Donald Trump's request to throw out his conviction in the criminal \"hush money\" case. Judge Juan Merchan said in a filing that the Supreme Court's ruling giving presidents immunity from prosecution over official acts does not apply to the case. CBS News investigative reporter Graham Kates has more.","url":"https://www.cbsnews.com/video/judge-rejects-trump-bid-toss-hush-money-conviction-immunity/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/12/17/bb347f33-f282-483b-a1e1-e39012dfd5e6/thumbnail/1200x630/8a8b9bdbc83b2d935ec37aebba9a7d80/cbsn-fusion-judge-rejects-trump-bid-toss-hush-money-conviction-immunity-thumbnail.jpg?v=564e83c5974b3893ba1bcac5f","video":null,"publish_date":"2024-12-17 01:05:54","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.033},{"id":273741448,"title":"Trump, Musk on automotive AI, robotaxis","text":"President-elect Donald Trump’s laissez-faire comments on artificial intelligence, combined with a general new-administration deregulatory flavor, have led automotive industry stakeholders to expect a more innovation-friendly environment with broader guardrails on AI.","url":"https://www.autonews.com/technology/mobility/an-ai-policy-under-trump/","image":"https://cloudfront-us-east-1.images.arcpublishing.com/crain/5QTDP4SNI5CYTOWVEMGAKSCVAA.png","video":null,"publish_date":"2024-12-17 01:05:23","author":"Molly Boigon","authors":["Molly Boigon"],"language":"en","source_country":"us","sentiment":-0.012},{"id":273741504,"title":"‘Bag a gold’ shot and injured in Ticky Ticky Manchester","text":"Latest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nLatest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\nShooting scene in Ticky Ticky, Manchester \n\r\n Crime Watch, Latest News, News \r\n\nDecember 16, 2024\r\n\n\r\n\r\n\n\r\n ‘Bag a gold’ shot and injured in Ticky Ticky Manchester \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nMANCHESTER, Jamaica — A Manchester farmer is battling for life at hospital after he was shot multiple times in Ticky Ticky district near Coleyville in north east Manchester on Monday.\n\nResidents told Observer Online that shortly before 3:00 pm the injured man identified by his alias ‘Bag a gold’ was in the community near his residence when gunmen attacked him and opened fire.\n\nHe was rushed to hospital and is to undergo emergency surgery. Up to 6:00 pm Monday police still had the scene cordoned off as detectives combed the area.\n\nShooting scene in Ticky Ticky, Manchester\n\nOfficial figures from the police show 49 murders in Manchester up to December 14, an almost 16 per cent increase over the 42 recorded for the same period last year. The parish has also recorded 44 shootings, almost 19 per cent above last year.\n\n— Kasey Williams\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nTags: Manchester shooting Ticky Ticky \r\n\r\n\n\r\n\r\n\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n0 Comments · Make a comment\n\n\r\n\n\r\n ALSO ON JAMAICA OBSERVER\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, Latest News, News \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n ST CATHERINE, JAMAICA - The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sun... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, Latest News, News \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, Latest News, News \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Environment, Latest News, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.72 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica — The US dollar on Monday, December 16 ended trading at $156.72 down by four cents according to the Bank of Jamaica’s daily exchange... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News, Regional \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Haitian group strongly condemns Trump’s reported plans to invoke national emergency to enable mass deportation \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n SAN DIEGO, United States — A Haitian community group has strongly condemned United States (US) President-elect Donald Trump’s reported plans to declar... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nHOUSE RULES\r\n\n\r\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \r\n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \r\n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \r\n\nPlease do not write in block capitals since this makes your comment hard to read. \r\n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \r\n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \r\n\nLastly, read our Terms and Conditions and Privacy Policy \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBasketball, Sports \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n J’can basketball teams falter at FIBA 3×3 quarter-finals \r\n\n\r\n\r\n\n\r\n Paul A Reid \r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n Both Jamaican teams fell at the quarter-final stages in their respective sections of the fourth FIBA 3x3 AmeriCup 2024 in San Juan, Puerto Rico, on Su... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCareer & Education, Columns \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Tony Hylton is searching for relevance \r\n\n\r\n Export imperative undergirded by action \r\n\n\r\n\r\n\n\r\n\nDecember 15, 2024 \r\n\n\r\n E arly in the second quarter of 2022 I received the first trade numbers from Statistical Institute of Jamaica (Statin), about three months after my ar... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nNews \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Solar tax credit leaves Jamaican households seeking clarity \r\n\n\r\n\r\n\n\r\n BY KARENA BENNETT Senior business reporter bennettk@jamaicaobserver.com \r\n\n\r\n\nDecember 15, 2024 \r\n\n\r\n AS Jamaica races towards its renewable energy future, a residential photovoltaic solar tax credit designed to boost adoption has sparked both exciteme... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n ‘Bag a gold’ shot and injured in Ticky Ticky Manchester \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n MANCHESTER, Jamaica — A Manchester farmer is battling for life at hospital after he was shot multiple times in Ticky Ticky district near Coleyville in... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n ST CATHERINE, JAMAICA - The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sun... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n ‘Bag a gold’ shot and injured in Ticky Ticky Manchester \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n MANCHESTER, Jamaica — A Manchester farmer is battling for life at hospital after he was shot multiple times in Ticky Ticky district near Coleyville in... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n ST CATHERINE, JAMAICA - The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sun... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n \n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n \n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\nFeatured Tags\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nEntertainment\n\n\r\n\nEntertainment\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nJamaica Observer,© All Rights Reserved\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nPrivacy Policy\r\n\r\n\n\r\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2024/12/16/bag-gold-shot-injured-ticky-ticky-manchester/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2024/12/WhatsApp-Image-2024-12-16-at-6.55.26-PM-scaled-1024x576.jpeg","video":null,"publish_date":"2024-12-17 01:05:22","author":null,"language":"en","source_country":"jm","sentiment":-0.012},{"id":273741502,"title":"Conditions in north Gaza hospital &#8216;appalling&#8217;: WHO chief","text":"Latest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nLatest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\nA Palestinian man carries the body of a child , killed in an Israeli strike, during a funeral in Deir el-Balah in the central Gaza Strip on December 15, 2024, as the war continues between Israel and the Palestinian Hamas group. (Photo by Eyad BABA / AFP) \n\r\n International News, Latest News, News \r\n\nDecember 16, 2024\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nGENEVA, Switzerland (AFP) – The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza’s only functioning hospitals at the weekend to deliver fuel, food and medicines, and found “appalling” conditions.\n\nKamal Adwan Hospital is located in Beit Lahia, a city at the centre of an intense Israeli military operation aimed at preventing Hamas from regrouping in northern Gaza.\n\nWHO chief Tedros Adhanom Ghebreyesus said on X that after multiple attempts, the United Nations health agency and partners reached the facility “two days ago, amid hostilities and explosions in the vicinity of the hospital during the mission”.\n\nThe team, he said, had “delivered 5,000 litres of fuel, food and medicines, and transferred three patients and six companions to Al-Shifa”, the Palestinian territory’s main hospital.\n\nKamal Adwan is one of the last operational medical facilities in the north of the war-ravaged territory, with the WHO warning earlier this month that it was operating at a “minimum” level.\n\nThe agency said efforts to deliver desperately needed supplies have been repeatedly hampered.\n\nEarlier this month, it said a mission reached the hospital on November 30 after weeks of unsuccessful attempts, bringing aid and an international emergency team, including surgeons and other specialists.\n\nBut days later, that team was among large numbers who fled the hospital amid heavy hostilities around the facility.\n\n“This has left the hospital without specialised personnel for surgical and maternal care,” Tedros warned, adding that the attacks have resulted in further damage to the facility and its oxygen and electricity supplies.\n\n“The conditions in the hospital are simply appalling,” he said.\n\n“We urge for the protection of health care and for this hell to stop! Ceasefire!”\n\nThe war was sparked by Hamas’s October 7, 2023 attack on Israel that resulted in the deaths of 1,208 people, mostly civilians, according to an AFP tally of Israeli official figures.\n\nSince then, Israel’s retaliatory offensive has killed more than 45,000 people in Gaza, a majority of them civilians, according to figures from the Hamas-run territory’s health ministry that the UN considers reliable.\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nTags: Gaza Hamas Israel \r\n\r\n\n\r\n\r\n\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n0 Comments · Make a comment\n\n\r\n\n\r\n ALSO ON JAMAICA OBSERVER\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Environment, Latest News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.72 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica — The US dollar on Monday, December 16 ended trading at $156.72 down by four cents according to the Bank of Jamaica’s daily exchange... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News, Regional \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Haitian group strongly condemns Trump’s reported plans to invoke national emergency to enable mass deportation \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n SAN DIEGO, United States — A Haitian community group has strongly condemned United States (US) President-elect Donald Trump’s reported plans to declar... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n JFB encourages electrical safety installations in homes and businesses for Christmas \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Jamaica Fire Brigade (JFB) is encouraging homeowners and business operators to install power monitoring devices to ensure elec... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, Latest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Two killed in US school shooting, student suspect also dead \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n WASHINGTON, United States (AFP)— A student opened fire Monday at a school in the northern US state of Wisconsin, killing at least two people and injur... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nHOUSE RULES\r\n\n\r\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \r\n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \r\n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \r\n\nPlease do not write in block capitals since this makes your comment hard to read. \r\n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \r\n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \r\n\nLastly, read our Terms and Conditions and Privacy Policy \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLifestyle, Social \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n More from Mouttet \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 14, 2024 \r\n\n\r\n SATURDAY Social shares more highlights from the Caymanas Park infield — the stretch of lawn encompassed by the inner rail of the racetrack — which las... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nEditorial \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Gunmen and those who fund them must not be allowed to destroy Jamaica \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 15, 2024 \r\n\n\r\n HISTORY is replete with men and women who have committed the most heinous crimes against their fellow human beings. They kill and maim without mercy, ... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Musson Foundation awards 13 scholars at inaugural Nupak Scholarship Awards \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n Kingston, Jamaica – The Musson Foundation celebrated the achievements of 13 exceptional students at the inaugural Nupak Scholarship Awards Ceremony la... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.72 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica — The US dollar on Monday, December 16 ended trading at $156.72 down by four cents according to the Bank of Jamaica’s daily exchange... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.72 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica — The US dollar on Monday, December 16 ended trading at $156.72 down by four cents according to the Bank of Jamaica’s daily exchange... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n \n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n \n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\nFeatured Tags\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nEntertainment\n\n\r\n\nEntertainment\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nJamaica Observer,© All Rights Reserved\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nPrivacy Policy\r\n\r\n\n\r\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2024/12/16/conditions-north-gaza-hospital-appalling-chief/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2024/12/000_36QC6FL.jpg","video":null,"publish_date":"2024-12-17 01:05:22","author":null,"language":"en","source_country":"jm","sentiment":-0.212},{"id":273741498,"title":"Firearm, ammo seized in St Catherine","text":"Latest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nLatest News\n\nNorth & East\n\nEnvironment\n\nInternational\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n Crime Watch, Latest News, News \r\n\nDecember 16, 2024\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nST CATHERINE, JAMAICA – The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sunday.\n\nReports are that about 2:30 am, lawmen observed a man walking along the roadway. He was signalled to stop, but refused and attempted, unsuccessfully, to evade the police.\n\nHe was subsequently caught, searched and one 9mm pistol with a magazine containing seventeen 9mm cartridges was taken from him. \n\nThe man was arrested and taken into custody, however, his identity is being withheld pending further investigation.\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\nTags: Ammunition seizure Firearm seizure St Catherine \r\n\r\n\n\r\n\r\n\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n0 Comments · Make a comment\n\n\r\n\n\r\n ALSO ON JAMAICA OBSERVER\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Environment, Latest News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Forex: J$156.72 to one US dollar \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica — The US dollar on Monday, December 16 ended trading at $156.72 down by four cents according to the Bank of Jamaica’s daily exchange... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nLatest News, Regional \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Haitian group strongly condemns Trump’s reported plans to invoke national emergency to enable mass deportation \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n SAN DIEGO, United States — A Haitian community group has strongly condemned United States (US) President-elect Donald Trump’s reported plans to declar... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, Latest News, News \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n JFB encourages electrical safety installations in homes and businesses for Christmas \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Jamaica Fire Brigade (JFB) is encouraging homeowners and business operators to install power monitoring devices to ensure elec... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\nHOUSE RULES\r\n\n\r\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \r\n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \r\n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \r\n\nPlease do not write in block capitals since this makes your comment hard to read. \r\n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \r\n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \r\n\nLastly, read our Terms and Conditions and Privacy Policy \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Observer readers say yes to egg donation, but at a price \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 15, 2024 \r\n\n\r\n A poll conducted by the Jamaica Observer has revealed a surprising willingness among readers to donate their eggs to help other women conceive or supp... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n 60 years of friendship \r\n\n\r\n Japanese ambassador hails reggae’s role in strong relations with Jamaica \r\n\n\r\n BY HOWARD CAMPBELL Observer senior writer editorial@jamaicaobserver.com \r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n The number 60 has special meaning in Japan. It is known as Kanreki, and people who reach that age are said to experience a rebirth. Jamaica and Japan ... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Headless body probe \r\n\n\r\n Men to be questioned after police arrest 10 on first day of ‘Operation Reassure’ in Trelawny \r\n\n\r\n BY HORACE HINES Observer writer \r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n FALMOUTH, Trelawny — The Trelawny police say that among the 10 individuals arrested during the start of a security operation in the parish last Friday... \r\n\r\n\n\r\n\r\n\r\n\nTelegram \n\r\n {\"xml\":\"xml\"}{\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n ST CATHERINE, JAMAICA - The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sun... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n Recent Posts\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nCrime Watch, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Firearm, ammo seized in St Catherine \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n ST CATHERINE, JAMAICA - The St Catherine North police seized a firearm and several rounds of ammunition in Sligoville, Waugh Hill in the parish on Sun... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nInternational News, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Conditions in north Gaza hospital ‘appalling’: WHO chief \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n GENEVA, Switzerland (AFP) - The World Health Organization said Monday a humanitarian team finally reached one of northern Gaza's only functioning hosp... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nAuto, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Used motor vehicle buyers urged to know rights and responsibilities \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - As the demand for used motor vehicles continues to rise, the Consumer Affairs Commission (CAC) is urging buyers to be better infor... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n IDB and partners invest JA$12 billion in Rio Cobre treatment plant \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - The Inter-American Development Bank (IDB) has provided long-term financing for up to JA$12 billion (US$79 million) to fund the Rio... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\nBusiness, ... \n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n Digicel Jamaica announces key senior leadership appointments \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nDecember 16, 2024 \r\n\n\r\n KINGSTON, Jamaica - Digicel has promoted two Jamaican associates from within its ranks to the highest level in the company’s operations. Bjorn Reynold... \r\n\r\n\n\r\n\r\n\r\n\n\r\n {\"jamaica-observer\":\"Jamaica Observer\"} \r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n \n\n\r\n\n\r\n Archives\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n \n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\nFeatured Tags\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\nEntertainment\n\n\r\n\nEntertainment\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\nJamaica Observer,© All Rights Reserved\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\n\r\nPrivacy Policy\r\n\r\n\n\r\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2024/12/16/firearm-ammo-seized-st-catherine-20241217-0020-469588/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2024/12/Arrest-charged-handcuff-1.jpg","video":null,"publish_date":"2024-12-17 01:05:22","author":null,"language":"en","source_country":"jm","sentiment":0.07},{"id":273741514,"title":"NYC judge spurns Trump effort to scrap hush money conviction based on immunity claim","text":"President-elect Donald Trump’s bid to toss out his conviction in the Manhattan hush money case based on the US Supreme Court’s immunity ruling was rejected by a judge on Monday. \n\nIn his 41-page ruling, Manhattan Supreme Court Justice Juan Merchan effectively upheld the 34-count conviction for now, concluding that it withstands the immunity decision. \n\n“The People’s use of these acts as evidence of the decidedly personal acts of falsifying business records poses no danger of intrusion on the authority and function of the Executive Branch,” Merchan wrote in his opinion. \n\nManhattan District Attorney Alvin Bragg’s office had fought against the effort to nix the conviction, arguing that underlying activity transpired before Trump, 78, first ascended to the Oval Office. \n\n“Today’s decision by deeply conflicted, acting Justice Merchan in the Manhattan DA Witch Hunt is a direct violation of the Supreme Court’s decision on immunity, and other longstanding jurisprudence,” Trump’s communications director Steven Cheung said in a statement. \n\n“This lawless case should have never been brought, and the Constitution demands that it be immediately dismissed, as President Trump must be allowed to continue the Presidential Transition process.”\n\nOver the summer, the US Supreme Court ruled that a president enjoys “absolute” immunity for official acts in office, but neglected to explain how that affected any of the four criminal cases against Trump at the time. \n\nLast month, a judge dismissed the four-count 2020 election subversion case against him and former special counsel Jack Smith moved to withdraw his efforts to revive the 40-count classified document case, which had been thrown out by a judge over the summer. \n\nThat leaves Trump with just the 13-count Georgia election tampering indictment — which is bogged down in appeals — and the Manhattan hush money conviction. \n\nMerchan still has yet to rule on the merit of a separate push by Trump’s team to neutralize the hush money conviction based on the president-elect’s victory last month. \n\nTrump’s team had pointed to a Justice Department policy against indicting a sitting president and contended that keeping the conviction could pose “unconstitutional impediments to President Trump’s ability to govern.”\n\nShould the conviction stand, Trump will be the first felon to ascend into the White House as president. His lawyers have been working to appeal that conviction on multiple fronts. \n\nTrump had been found guilty by a jury in May on allegations that he falsified business records to conceal hush money payments to porn star porn star Stormy Daniels and several others to suppress stories that could be damaging to him during the 2016 campaign. \n\nThat case, which was predicated on novel legal theories, has attracted bipartisan criticism, including recently from Sen. John Fetterman (D-Pa.), who suggested the case was “bulls—” and that a pardon was appropriate. \n\nMerchan, who oversaw the hush money case against Trump when he was on trial earlier this year, argued in his 41-page ruling that there had been “overwhelming evidence of guilt” exhibited during proceedings. \n\nAs Cheung alluded to, Trump’s allies have harped on the work that Merchan’s daughter has done in progressive circles, including for Vice President Kamala Harris and Democrats broadly. \n\nBragg’s team has stood against any efforts to throw out Trump’s conviction. Instead, they’ve suggested that the case could be put on hold while Trump carries out his second term as president. \n\nUnder federal law, Trump cannot be put in jail as president in that case.","summary":"President-elect Donald Trump's bid to toss out his conviction in the Manhattan hush money case based on the US Supreme Court's immunity ruling was rejected by a judge on Monday.","url":"https://nypost.com/2024/12/16/us-news/judge-spurns-donald-trump-effort-to-scrap-hush-money-conviction-based-on-immunity/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-ttdqkdqkg-1734396419700.jpg?quality=75&strip=all&1734378432&w=1200","video":null,"publish_date":"2024-12-17 01:03:03","author":"Ryan King","authors":["Ryan King"],"language":"en","category":"politics","source_country":"us","sentiment":-0.068},{"id":273741006,"title":"Can Trump Privatize The Postal Service? What To Know As President-Elect Says He’s ‘Looking At’ USPS Changes","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nPresident-elect Donald Trump said Monday he’s considering trying to privatize the U.S. Postal Service, confirming recent reporting by The Washington Post, as the president-elect has long eyed making major cuts to the federal agency—that may now be possible in his second term.\n\nPresident-elect Donald Trump, accompanied by Trump's choice for Secretary of Commerce, Howard ... [+] Lutnick, speaks at a news conference at Trump's Mar-a-Lago resort on December 16 in Palm Beach, Florida.\nGetty Images\n\nPrivatizing USPS is “not the worst idea I’ve ever heard,” Trump told reporters at a press conference Monday, saying his team was “looking at it,” after the Post reported Trump had discussed privatizing the agency with Commerce Secretary nominee Howard Lutnick.\n\nMembers of Trump’s “Department of Government Efficiency” run by billionaires Elon Musk and Vivek Ramaswamy had also held “preliminary conversations about major changes” to USPS, the Post reported, and Musk seemingly endorsed privatization on X, formerly known as Twitter, on Monday, responding “yes” to a post that called for privatizing the agency and letting Americans opt out of receiving physical mail.\n\nIt’s still unclear what concrete steps Trump could take to make sweeping changes to USPS, though Reuters previously reported Trump’s transition team is considering canceling the agency’s contracts for a new fleet of electric mail trucks.\n\nUSPS is part of the federal government even though it’s predominantly self-funded, and has a universal service obligation to provide affordable and uniform service everywhere in the country, even in more remote geographic locations.\n\nTrump during his first presidential term threatened to privatize the agency and has long decried it—calling it a “joke”—though his administration ultimately never made any major moves to make USPS private after facing bipartisan opposition.\n\nOther Republicans have also started ramped up criticism of USPS in recent weeks, with Rep. Marjorie Taylor Greene, R-Ga., saying “poor management” of the agency is “costing taxpayers billions” and Rep. James Comer, R-Ky., arguing at a recent House Oversight Committee hearing there are aspects of USPS’ operations “that would be better left to the private sector.”\n\nCrucial Quote\n\nUSPS has not yet responded to a request for comment on Trump’s remarks Monday, but the agency pointed to its recent efforts to decrease costs in a statement to the Post and said it “is already engaged in an initiative to ensure that we can provide our customers with a high level of service to every delivery address in the nation at least 6-days-a-week in an efficient and financially sustainable fashion as required by law.”\n\nHow Could Trump Privatize The U.s. Postal Service?\n\nFully privatizing USPS or ending its universal service obligation would likely take an act of Congress, and it’s unclear if there would be enough support from Republicans to do so. Many GOP lawmakers represent rural districts that rely on the Postal Service’s universal service mandate, though while there was bipartisan opposition to privatization during Trump’s first term, it remains to be seen if enough right-wing lawmakers would still be willing to push back against Trump should he propose it again in the coming months. The incoming president could have wide latitude to force reforms on USPS even without Congress, however, the Post suggested, even if he can’t privatize it entirely. Trump appears poised to exert significant influence over the agency’s board of governors, which oversees USPS and can impose sweeping reforms. Two Trump appointees already serve on the nine-person board, and there are three vacancies on the board that appear unlikely to be filled by the time President Joe Biden leaves office, potentially giving Trump a majority of appointees who could sign off on his vision for the agency. The USPS is also reliant on federal loans from the Treasury Department, which the Post notes Trump could try to withhold unless the agency falls in line with changes he wants it to make.\n\nWhat Would Happen If USPS Gets Privatized?\n\nOverhauling USPS to make it a privatized operation would likely raise prices for mail and packages and could result in decreased service, both critics and proponents of the plan have noted, as putting an emphasis on revenue over universal service could mean cost-cutting moves that result in fewer days of mail deliveries, longer mail delivery timelines or less access to USPS services in sparsely populated rural areas that aren’t as profitable. It could also impact Amazon deliveries, the Post notes, as the e-commerce giant often relies on USPS to provide “last-mile” delivery directly to customers’ homes, as well as e-commerce shipping that relies on USPS and business supply chains more broadly. Proponents of privatization have pointed to the fact that it could help USPS’ long-running financial issues, as it would mean the agency would now be able to accept private capital funds and raise prices, rather than remain reliant on government loans, and could allow the Postal Service to innovate more and implement better technology than when it’s subject to a lower budget and governmental scrutiny.\n\nChief Critics:\n\nDemocrats have already started opposing any efforts to privatize USPS. “Privatizing the Postal Service would have disastrous consequences for the Americans and businesses who rely on USPS every day,” Rep. Gerry Connolly, D-Va., a major USPS advocate in Congress, said on X on Monday. “When you go private, the profit motive is everything.”\n\nTrump’s potential effort to privatize USPS comes even as it would likely hurt many of his own supporters the most, as rural areas that are most reliant on the agency’s universal service obligations went primarily for the president-elect.\n\nBig Number:\n\n$9.5 billion. That’s how much money USPS lost in fiscal year 2024, the agency reported in November, up from a net loss of $6.5 billion in 2023. The agency—which has long struggled financially—attributed those losses to factors like retirement pensions and an increase in compensation for some workers.\n\nSurprising Fact:\n\nPostmaster General Louis DeJoy, who runs USPS, was widely criticized by the left ahead of the 2020 election for being a Trump donor and ally, sparking fears he could affect the election by stymying ballot delivery. The Post reports DeJoy is now “not beloved” among Trump and his team, however, after the postmaster general sparked “significant anger” for boosting mail-in voting.\n\nKey Background:\n\nUSPS’ long history of financial issues have made the Postal Service into a bigger political topic in recent years, between Trump’s frequent attacks on the agency and DeJoy taking control of it in the summer of 2020 and imposing reforms with the aim of fixing the agency’s finances. Democrats became angry at DeJoy ahead of the 2020 election for implementing a series of changes at the agency that slowed down mail delivery, which ultimately resulted in court rulings ordering the changes to be reversed. While mail delivery during the 2020 election ultimately played out without conflict, DeJoy has remained a controversial figure, enacting a cost-cutting plan at USPS that lawmakers from both parties have decried for negatively impacting service. Congress passed legislation in 2022 aimed at combating the agency’s financial issues while also improving service, but DeJoy has pressed on with cost-cutting measures, with the Post reporting in August that USPS was considering a plan to slow down mail delivery in rural areas. Lawmakers from both parties expressed displeasure with DeJoy during congressional hearings in December as they bemoaned his cost-cutting measures resulting in their constituents facing mail delays, with Sen. Josh Hawley, R-Mo., telling DeJoy, “I hate this plan and I’m going to do everything I can to kill it.”\n\nFurther Reading:\n\nTrump eyes privatizing U.S. Postal Service, citing financial losses (Washington Post)\n\nHouse committee piles on criticism of DeJoy’s postal overhaul plans (Government Executive)\n\nFollow me on Twitter. Send me a secure tip. \n\nAlison Durkee\n\nEditorial Standards\n\nForbes Accolades","summary":"The president-elect confirmed reports that he’s eyeing privatizing the federal agency.","url":"https://www.forbes.com/sites/alisondurkee/2024/12/16/can-trump-privatize-the-postal-service-what-to-know-as-president-elect-says-hes-looking-at-usps-changes/","image":"https://imageio.forbes.com/specials-images/imageserve/6760cbe3584da373e08d8639/0x0.jpg?format=jpg&crop=1488,837,x0,y114,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-12-17 01:02:05","author":"Alison Durkee,Forbes Staff","authors":["Alison Durkee","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.327},{"id":273741456,"title":"Marles doesn’t rule out Australian peacekeepers in Ukraine","text":"Richard Marles has not ruled out deploying Australian troops as peacekeepers to Ukraine amid uncertainty swirling around the future of the conflict.\n\nThe Defence Minister joined Penny Wong for talks with their British counterparts in London on Monday (local time).\n\nAsked at a joint press conference if Australia would contribute to any peacekeeping activity in Ukraine, Mr Marles reiterated Canberra’s longheld support for Kyiv.\n\n“We will stand by Ukraine and continue our support until it can resolve this conflict on its terms,” he told reporters.\n\nHe noted that the Albanese government had recommitted Australian troops to training up Ukrainians in the UK for another year as part of the British-led Operation Interflex.\n\n“We will continue to look at ways in which we can support Ukraine for a long as it takes and we will work really closely with the UK as to what that commitment looks like,” Mr Marles said.\n\nAsked the same question about deploying British troops, UK Defence Secretary John Healey gave a similar response to Mr Marles, saying Russian President Vladimir Putin “cannot prevail, he will not prevail, and Ukraine will have our support for as long as it needs”.\n\n“Our job as allied nations that stand steadfast with Ukraine is to support them in any negotiations, just as we will through any battlefield fighting,” Mr Healey said.\n\nThe election of Donald Trump in the US has sparked questions about where Ukraine would fit into his America first agenda.\n\nThe incoming US president has said he could end the war within 24 hours, raising eyebrows in Ukraine and Western countries, who fear Mr Trump may cut support and try striking a deal with Mr Putin without Kyiv’s input.\n\nThough, NATO members have vowed to continue backing Kyiv, with a growing calls in the alliance’s eastern flank to put troops in Ukraine with a view to deterring Russia’s westward expansion.\n\nRussia’s invasion of Ukraine has killed and wounded hundreds of thousands on both sides and displaced more than 10 million.\n\nWhile Russian forces have continued to make minor advances in Ukraine’s east, it has come at an enormous human cost.\n\nStruggling with the losses, Moscow has started sending North Korean troops to the front lines.\n\nSome 11,500 Ukrainians have found safe haven in Australia.\n\nAustralia has contributed more than $1.5bn-worth of aid to Ukraine’s fight against invading Russian forces, including 49 M1A1 Abrams main battle tanks.\n\nForeign Minister Wong will travel to Brussels on Tuesday (local time) to meet with NATO counterparts and discuss Australia’s future support for Ukraine.","summary":"Richard Marles says Australia will “support Ukraine for as long as it takes”, failing to rule out deploying troops in a peacekeeper capacity.","url":"https://thewest.com.au/news/marles-doesnt-rule-out-australian-peacekeepers-in-ukraine-c-17109947","image":"https://images.thewest.com.au/publication/C-17109947/bdfc7e3b35bbed790641391cd6178e19c3ddb295-16x9-x0y790w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2024-12-17 00:59:47","author":"Joseph Olbrycht,Joseph Olbrycht-Palmer","authors":["Joseph Olbrycht","Joseph Olbrycht-Palmer"],"language":"en","category":"politics","source_country":"au","sentiment":0.005},{"id":273740030,"title":"Trump’s tough talk on Hamas hostages delivers America’s righteous fury — at last","text":"If they have any instinct for self-preservation, Iran and Hamas should be monitoring President-elect Donald Trump’s communications very closely these days. \n\nA couple of weeks ago, there was the Truth Social post promising “ALL HELL TO PAY” if Hamas didn’t release its hostages by Trump’s inauguration on Jan. 20. \n\n“Those responsible,” Trump noted, “will be hit harder than anybody has been hit in the long and storied History of the United States of America.”\n\nHe followed up during a press conference Monday.\n\nWhen asked what he meant by his prior threat, Trump left it menacingly vague. “Well,” he said, referring to our adversaries, “they’re going to have to determine what that means, but it means it won’t be pleasant. It’s not going to be pleasant.” \n\nWhat does that mean? Does Trump have something in particular in mind, or is he making it up as he goes along?\n\nIs he bluffing? Or is he dead earnest? \n\nNo one has come up with a Trump Doctrine yet, but a candidate might be: Find out if I’m serious or not at your own risk. \n\nThe most basic thing to note about Trump’s threat, though, is that it is the first time an official of the US government — or a soon-to-be government official — has sounded appropriately outraged and harsh about an ongoing crime perpetrated against our fellow citizens. \n\nTrump’s “hell to pay” is a throwback to Andrew Jackson or Teddy Roosevelt making it clear that we aren’t to be trifled with, and doing it in a clarion tone. \n\nIt’s been shocking how muted the Biden administration has been about the hostages.\n\nWhereas Trump is expressing a righteous indignation in a thunderous tone, the Biden administration has spoken with all the clarity of a deputy secretary of state summarizing the notes of a three-hour-long committee meeting. \n\nThis style of public negotiation comes naturally to Trump, of course.\n\nHis approach doesn’t represent any particular foreign-policy theory. It’s not realist or neo-con or isolationist. It’s less Clausewitz’s “On War” or Thomas Schelling’s “The Strategy of Conflict,” than Trump’s own “Art of the Deal.”\n\nThe famous line is that the Battle of Waterloo was won on the playing fields of Eton; in the same sense, every successful Trump negotiation as president has been won on the playing fields of Manhattan real estate, where Trump first learned his distinctive means of gaining leverage and psychological advantage. \n\nHis willingness to escalate and follow through means no threat can be completely discounted, while his sheer unpredictably adds to the difficulty of any foreign actor trying to calculate his next move.\n\nTo the famous Machiavellian axiom, “It’s better to be feared than to be loved,” Trump adds the proviso, “and it’s best to keep them guessing, either way.”\n\nThis couldn’t be in starker contrast to Joe Biden, who always fears escalation and is predictably conventional to the point of being sodden and dull. \n\nTrump is what they call in poker a “loose aggressive player,” whereas Biden’s style is to play a measured game of bridge over tea and crumpets. \n\nThe president-elect doesn’t like foreign conflict, but he bombed ISIS to smithereens as promised in the 2016 election and killed the top Iranian intelligence official, Qasem Soleimani, without hesitation in 2020.\n\nThe safest default is to take him at his word, even if you only — in Trump’s words about a threat he says he made to Vladimir Putin in his first term — believe him “10%.”\n\nWith an eye to the imminent arrival of Trump, there is a chance that Hamas cuts a deal over the hostages in coming weeks, the same way Iran released the captives from the US embassy in 1980 just as Ronald Reagan was taking office.\n\nRegardless of how it plays out, we are already re-entering a period when enemies of the United States have to be scared or nervous, not knowing how far they can push us, or what will happen if they do.\n\nAnd that’s exactly where Trump wants them. \n\nTwitter: @RichLowry","summary":"About time: Donald Trump is the first official of the US government — or a soon-to-be one — has sounded appropriately outraged and harsh about an ongoing crime perpetrated against our fellow citizens. ","url":"https://nypost.com/2024/12/16/opinion/trumps-tough-talk-on-hamas-hostages-delivers-americas-righteous-fury-at-last/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/former-u-s-president-donald-95475507-e1734396258440.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-12-17 00:57:34","author":"Rich Lowry","authors":["Rich Lowry"],"language":"en","category":"politics","source_country":"us","sentiment":-0.031},{"id":273739980,"title":"You might have been detected and blocked as a crawler bot!  News Corp Australia uses software that manages crawler","text":"You might have been detected and blocked as a crawler bot!\n News Corp Australia uses software that manages crawler bot traffic on our websites. If you receive this message and are not a crawler bot (and are just a reader or subscriber), please try these steps first:\n\n Temporarily disable any AdBlockers / pop-up blockers / script blockers you have enabled\n Add this site in to the allowed list for any AdBlockers / pop-up blockers / script blockers you have enabled\n Ensure your browser supports JavaScript (this can be done via accessing https://www.whatismybrowser.com/detect/is-javascript-enabled in your browser)\n Ensure you are using the latest version of your web browser\n\nIf you still need to be unlocked as a reader, subscriber or crawler bot, please e-mail us at accessissues@news.com.au and provide the IP address and reference number shown here along with why you require access. \n\nYour IP address is: 110.38.243.68 | Your reference number is: 0.6e092017.1734397150.b6d6bef\n\nNews Corp Australia.","url":"https://www.adelaidenow.com.au/news/world/shoot-down-drones-donald-trump-demands/news-story/021f64f4e1a8993d1e1efa0a816cb691?expand_comments=true","image":null,"video":null,"publish_date":"2024-12-17 00:56:23","author":null,"language":"en","source_country":"au","sentiment":-0.673},{"id":273739900,"title":"You might have been detected and blocked as a crawler bot!  News Corp Australia uses software that manages crawler","text":"You might have been detected and blocked as a crawler bot!\n News Corp Australia uses software that manages crawler bot traffic on our websites. If you receive this message and are not a crawler bot (and are just a reader or subscriber), please try these steps first:\n\n Temporarily disable any AdBlockers / pop-up blockers / script blockers you have enabled\n Add this site in to the allowed list for any AdBlockers / pop-up blockers / script blockers you have enabled\n Ensure your browser supports JavaScript (this can be done via accessing https://www.whatismybrowser.com/detect/is-javascript-enabled in your browser)\n Ensure you are using the latest version of your web browser\n\nIf you still need to be unlocked as a reader, subscriber or crawler bot, please e-mail us at accessissues@news.com.au and provide the IP address and reference number shown here along with why you require access. \n\nYour IP address is: 2.190.252.212 | Your reference number is: 0.d687645f.1734397032.18938302\n\nNews Corp Australia.","url":"https://www.adelaidenow.com.au/news/world/shoot-down-drones-donald-trump-demands/news-story/021f64f4e1a8993d1e1efa0a816cb691","image":null,"video":null,"publish_date":"2024-12-17 00:56:23","author":null,"language":"en","source_country":"au","sentiment":-0.673},{"id":273739328,"title":"Judge Refuses To Toss Out Trump's New York Hush-Money Conviction","text":"What's NewA New York judge on Monday refused to toss out President-elect Donald Trump's conviction on 34 felony counts of falsifying business records.Why It MattersThe ruling from Judge Juan Merchan, who sits on New York Supreme Court, centered on the U.S. Supreme Court's decision on presidential immunity.After the Supreme Court issued its immunity ruling earlier this year, Trump's lawyers argued that prosecutors from the Manhattan district attorney's office had introduced evidence during his hush-money trial that was protected by the Supreme Court's immunity ruling.But prosecutors said the high court's decision had \"no bearing\" on the hush-money case since it related to Trump's conduct before he was elected president.Merchan sided with the prosecutors on Monday, writing that the conviction related to Trump's personal conduct and not his actions as president.\"The People's use of these acts as evidence of the decidedly personal acts of falsifying business records poses no danger of intrusion on the authority and function of the Executive Branch,\" Merchan wrote in his Monday opinion.What To KnowTrump was convicted in May on nearly three dozen criminal counts of falsifying business records in connection to a $130,000 hush-money payment to the adult film actress Stormy Daniels that was made shortly before the 2016 U.S. election.The jurors delivered their verdict after deliberating for less than ten hours over two days.This story is breaking and will be updated as more information becomes available.","summary":"Judge Juan Merchan ruled that Trump's conviction in New York related to his personal conduct and not his actions as president.","url":"https://www.newsweek.com/judge-merchan-trump-conviction-new-york-2001827","image":"https://d.newsweek.com/en/full/2545736/donald-trump.jpg","video":null,"publish_date":"2024-12-17 00:55:54","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"us","sentiment":-0.05},{"id":273739272,"title":"Netanyahu kept security cabinet in the dark on Gaza hostage deal","text":"Security cabinet ministers are being kept in the dark about details of a potential Gaza hostage deal, sources told The Jerusalem Post on Sunday.The ministers were supposed to discuss a possible agreement on Sunday at IDF Central Command headquarters, but were never briefed. Several Israeli officials and diplomats familiar with the talks confirmed that “some progress has been made,” but while negotiations are ongoing, details remain vague.In a separate meeting on Sunday of the Knesset Foreign Affairs and Defense Committee, Defense Minister Israel Katz said, “The less we speak, the better. In my opinion, we are closest to a deal since the last hostage exchange, and it will receive a majority in government if it is brought to a vote.”console.log(\"2390 BODY2. CatId is:\"+catID);if(catID==120){ console.log(\"2390 BODY. YES for anyclip script\"); var script = document.createElement('script'); script.src = 'https://player.anyclip.com/anyclip-widget/lre-widget/prod/v1/src/lre.js'; script.setAttribute('pubname','jpostcom'); script.setAttribute('widgetname','0011r00001lcD1i_12258'); document.getElementsByClassName('divAnyClip')[0].appendChild(script); }else if(catID !== 151) { let widgetid = \"60fd6becf6393400049e6535\"; if(catID === 69){ widgetid = \"65c3a2148772803523c6f41b\"; }else if(catID === 161){ widgetid = \"65c3a224fb10822a0a7db2dd\"; } console.log(\"2390 BODY. YES for vidazoo script\"); var script = document.createElement('script'); script.src = 'https://static.vidazoo.com/basev/vwpt.js'; script.setAttribute('data-widget-id', widgetid); document.getElementsByClassName('divVidazoo')[0].appendChild(script);} The proposed dealThe proposed deal reportedly includes the release of women, ailing individuals, and hostages aged over 50. Arab media outlets have suggested that hostages who hold US citizenship, though not meeting these criteria, may also be part of the agreement.US President-elect Donald Trump on Sunday reaffirmed his administration’s commitment to securing their release and warned that “the gates of hell will be opened upon the people who are holding them.” Woman walks past a poster calling for the release of the hostages held by Hamas, in Tel Aviv, December 5, 2024 (credit: REUTERS/STOYAN NENOV)To help effect the deal, Israel is expected to redeploy forces in certain areas of Gaza or withdraw them entirely, depending on interpretations by various officials.The agreement would require the release of Palestinian prisoners held in Israeli jails. A key sticking point remains Hamas’s demand that Israel halt its military operations in Gaza entirely – a demand Jerusalem has firmly opposed. Hamas must also agree to a limited withdrawal from the Philadelphi and Netzarim corridors.Prime Minister Benjamin Netanyahu has reportedly insisted that Hamas increase the number of hostages released in the deal, beyond the terrorist group’s initial proposal.While sources indicate that both Netanyahu and Hamas are keen to finalize an agreement, the challenge lies in reaching a compromise after more than 438 days of captivity. Stay updated with the latest news! Subscribe to The Jerusalem Post Newsletter Subscribe Now Trump said on Monday that he had a “very good talk” with Netanyahu about the status of the war in Gaza, describing it as a “recap call,” ahead of his taking office on January 20.“We had a very good talk. And we discussed what is going to happen, and I’ll be very available on January 20 and we’ll see,” Trump said. “As you know, I gave a warning that if these hostages aren’t back home by that date, all hell is going to break out.”","url":"https://www.jpost.com/israel-news/article-833741","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/636045","video":null,"publish_date":"2024-12-17 00:55:22","author":"Amichai Stein","authors":["Amichai Stein"],"language":"en","category":"politics","source_country":"il","sentiment":-0.088},{"id":273739266,"title":"Judge denies Trump&#x27;s bid to throw out conviction over immunity ruling","text":"A judge on Monday ruled that Donald Trump's conviction for falsifying records to cover up a sex scandal should stand, rejecting the president-elect's argument that a recent Supreme Court ruling nullified the verdict, the New York Times reported. console.log(\"2390 BODY2. CatId is:\"+catID);if(catID==120){ console.log(\"2390 BODY. YES for anyclip script\"); var script = document.createElement('script'); script.src = 'https://player.anyclip.com/anyclip-widget/lre-widget/prod/v1/src/lre.js'; script.setAttribute('pubname','jpostcom'); script.setAttribute('widgetname','0011r00001lcD1i_12258'); document.getElementsByClassName('divAnyClip')[0].appendChild(script); }else if(catID !== 151) { let widgetid = \"60fd6becf6393400049e6535\"; if(catID === 69){ widgetid = \"65c3a2148772803523c6f41b\"; }else if(catID === 161){ widgetid = \"65c3a224fb10822a0a7db2dd\"; } console.log(\"2390 BODY. YES for vidazoo script\"); var script = document.createElement('script'); script.src = 'https://static.vidazoo.com/basev/vwpt.js'; script.setAttribute('data-widget-id', widgetid); document.getElementsByClassName('divVidazoo')[0].appendChild(script);}","url":"https://www.jpost.com/breaking-news/article-833756","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/534687","video":null,"publish_date":"2024-12-17 00:55:22","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":-0.523},{"id":273739268,"title":"Trump picks George Glass as Japan ambassador","text":"US President-elect Donald Trump said on Monday he was picking George Glass to be ambassador to Japan.\"In my First Term, George was the U.S. Ambassador to Portugal. As a former President of an Investment Bank, George will bring his business acumen to the Ambassador’s position,\" Trump said in a post on Truth Social.console.log(\"2390 BODY2. CatId is:\"+catID);if(catID==120){ console.log(\"2390 BODY. YES for anyclip script\"); var script = document.createElement('script'); script.src = 'https://player.anyclip.com/anyclip-widget/lre-widget/prod/v1/src/lre.js'; script.setAttribute('pubname','jpostcom'); script.setAttribute('widgetname','0011r00001lcD1i_12258'); document.getElementsByClassName('divAnyClip')[0].appendChild(script); }else if(catID !== 151) { let widgetid = \"60fd6becf6393400049e6535\"; if(catID === 69){ widgetid = \"65c3a2148772803523c6f41b\"; }else if(catID === 161){ widgetid = \"65c3a224fb10822a0a7db2dd\"; } console.log(\"2390 BODY. YES for vidazoo script\"); var script = document.createElement('script'); script.src = 'https://static.vidazoo.com/basev/vwpt.js'; script.setAttribute('data-widget-id', widgetid); document.getElementsByClassName('divVidazoo')[0].appendChild(script);}","url":"https://www.jpost.com/breaking-news/article-833755","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/534687","video":null,"publish_date":"2024-12-17 00:55:22","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"il","sentiment":-0.135},{"id":273739284,"title":"Iran&#x27;s Khamenei reveals himself to be an irrational dictator","text":"On December 11, Iran’s Supreme Leader Ali Khamenei delivered his first speech following Syrian president Bashar al-Assad’s fall, broadcast as a pre-recorded message.Its significance rested solely on the propaganda spread by his supporters. During the 51-minute ramble, he offered no ideas, messages, or meaningful content. His speech was riddled with delusions – a chaotic and unsettling display.Khamenei’s arguments came across as childish and riddled with lies and contradictions, and his sentences were often incoherent and disjointed. He embodies the traits of a stubborn, fearful, vengeful, and irrational dictator.console.log(\"2390 BODY2. CatId is:\"+catID);if(catID==120){ console.log(\"2390 BODY. YES for anyclip script\"); var script = document.createElement('script'); script.src = 'https://player.anyclip.com/anyclip-widget/lre-widget/prod/v1/src/lre.js'; script.setAttribute('pubname','jpostcom'); script.setAttribute('widgetname','0011r00001lcD1i_12258'); document.getElementsByClassName('divAnyClip')[0].appendChild(script); }else if(catID !== 151) { let widgetid = \"60fd6becf6393400049e6535\"; if(catID === 69){ widgetid = \"65c3a2148772803523c6f41b\"; }else if(catID === 161){ widgetid = \"65c3a224fb10822a0a7db2dd\"; } console.log(\"2390 BODY. YES for vidazoo script\"); var script = document.createElement('script'); script.src = 'https://static.vidazoo.com/basev/vwpt.js'; script.setAttribute('data-widget-id', widgetid); document.getElementsByClassName('divVidazoo')[0].appendChild(script);} After my article in The Jerusalem Post on December 8, I appeared on Iran International TV at the invitation of Mehdi Parpanchi, the perceptive director of news, to discuss Assad’s downfall and the potential domino effect threatening the Islamic Republic. In advance, my friend Dr. Michael Rubin from the American Enterprise Institute (AEI) had written about the possibility of Iran and other regional nations facing collapse after Syria.Khamenei lashed out in his December 11 speech, stating: “That ignorant analyst knows nothing about resistance, thinking it will weaken. Iran remains strong and mighty.” Syrian President Bashar Assad speaks to pro-Kremlin journalist Vladimir Sovolyov, March 2024. (credit: screenshot)I shared excerpts from both analyses on my social media. In 2022, after Khamenei criticized my book Trapped by Events – a dialogue with H. E. Parviz Sabeti, a former SAVAK secret police official—my lawyer (J.S.) advised me to inform the FBI and US Department of Homeland Security, which I did.Desperately, Khamenei revealed how the humiliating defeat of the regime’s “Axis of Evil” in the Middle East, particularly against Israel, has left him disgraced, isolated, and despondent. He resorted to issuing threats. He tacitly acknowledged the misery and failure of the outlaw regime he leads, lamenting that the US and Israel had thwarted his ambitions for domination and continued violence. His frustration was evident as he admitted to Israel’s success in disrupting arms and bomb shipments. For years, he has labeled the entire world as “enemies,” yet paradoxically expects these “enemies” to tolerate his provocations and terrorism.Khamenei’s obstinate and misguided behaviorWhile his fantasies of silencing dissidents persist, his reign of fear and violence can no longer stifle the free flow of information. The regime scrambles to suppress dissent, with the US attorney general swiftly announcing legal action against critics and targeting analysts and commentators in a desperate bid to reactivate dormant terror cells, specifically on US soil.Khamenei’s transnational Shi’ite Islamic terrorist network has crumbled and is no longer capable of spreading chaos across the Middle East: Decades of oppressing the Iranian people and squandering their wealth on ambitions of regional domination have unraveled. The collapse of this network marks not only a strategic defeat for Khamenei but also a turning point for those who have long suffered under his regime’s tyranny. Stay updated with the latest news! Subscribe to The Jerusalem Post Newsletter Subscribe Now Khamenei revealed his inability to accept defeat while expressing deep concern over the regional failures: The loss of Hamas and Hezbollah, leaving only the West Bank, Palestinian Islamic Jihad, the Houthis, and the Popular Mobilization Forces, highlights the disintegration of his once-influential network.The special operations units in Lebanon and Syria within the IRGC have been rendered inactive, as they no longer have any practical capabilities.Khamenei’s attempts to justify the regime’s actions hinge on superstitious Shi’ite narratives manufactured by the religious octopus: Despite his claims of fighting for Shi’ite shrines, even the IRGC’s commanders have admitted to intervening in Syria to save Assad long before ISIS appeared. Khamenei claimed that Iran’s involvement in Syria was to preserve security, but where in the world does an anti-security terrorist seek to protect security? Khamenei repeatedly lied in his speech: For example, he claimed he wanted to help the people of Syria and Lebanon, but this was untrue; he had no intention of sending rice, flour, or oil – his aim was to send weapons.Another lie was his justification for intervention in Syria, where he stated that Syria helped Iran during the eight-year war. However, he failed to mention that even then, supreme leader Ali Ruhollah Khomeini prolonged the war to such an extent that in November 1987, Syria, along with other Arab countries, condemned Iran for delaying the acceptance of Resolution 598 and explicitly expressed “solidarity” with Saddam Hussein – the criminal leader of Iraq.Syria also signed a strongly worded statement from Arab countries in support of Saddam against Iran. In the Kayhan newspaper on Thursday, February 8, 1979, it was reported how Syria had supported Khomeini and his terrorist gang before 1979. Notably, Assad’s fall brought joy to the Iranian people.Another defeat for Khamenei came when Hamas congratulated the anti-Assad armed forces on their victory in Syria. This is reminiscent of the time when Khomeini formed his interim government in front of Yasser Arafat and Muammar Gaddafi’s envoy – both of whom later supported Saddam.One point was glaringly evident: Khamenei is buried under the rubble of defeat, yet he still plots new schemes to create chaos and incite war, despite no longer having the power or energy to carry them out.The stubborn old fool refuses to learn from developments and fails to understand that killing, threats, and suppression will lead him nowhere. This is a path that dictators around the world have trodden, reaching no destination, and he too will remain buried in this sewer.The ruthless tyrant of Iran demonstrated that he still lacks any understanding of reality: He fundamentally fails to comprehend international relations and remains immersed in his own delusions and fantasies. For his own consolation, he delivers long speeches that resemble incoherent rambling. His words lack scientific basis, are not grounded in reality, and have no foundation in reason or logic.All of Iran’s wealth has been squandered on expanding Islamic terrorism, arms trafficking, and financing terrorism. Thanks to Israel, all of his deterrence power, defensive military capabilities, and his so-called axis of evil have been destroyed.Khamenei and his incapable regime failed to launch a third military attack on Israel and know that Donald Trump is on his way to the White House: The Islamic Republic has effectively become weaker, and its survival faces serious danger. In these circumstances, he is merely content with announcing the construction of an atomic bomb, but this will certainly lead to a military strike on nuclear facilities, coordinated by the CIA and Mossad.The powerless, exhausted, and humiliated loser of the Middle East is Khamenei and his regime. These are villains and thugs who lack the support of the Iranian people. Iranian society has no dialogue even with a weak dictator.American and Israeli intelligence agencies also know that without regime change in Iran, there will be no peace, stability, or calm in the Middle East. Seeing the Islamic Republic fall into a downward spiral of weakness and defeat is a pleasing scene for them.They know that the weaker it becomes, the less ability it has to ignite fires and wage war, and it is forced to retreat, surviving only through its repression machine and propaganda. The regime in Tehran is severely lacking in any tools or resources. They know that in the eyes of the people, the Islamic Republic is dead and should be buried. The mafia and military junta regime is on the verge of collapse.He continued his speech with empty promises and hollow slogans, his face crumpled and devastated. He offered no substance in his claims or military displays. His terrorist organizations have collapsed, his imaginary resistance front has been destroyed, and he lacks the ability to rebuild.Like a defeated army in war, he has no possibility of reconstruction. In his mind, the whole world is to blame, and he judges everyone.The mullah’s regime has been rhetorically disarmed and is at an impasse. It is a regime without allies or friends; it is crisis-ridden, impoverished, and politically paralyzed.Khamenei did not even dare to mention the names of Turkey or Russia in his speech: He neither criticized Bashar Assad nor uttered a single word against Vladimir Putin or Recep Tayyip Erdogan. Instead, he threatened the Iranian people, critics, and analysts. He remains committed to continuing the path of rebellion, as his survival depends on it. He is fundamentally unwilling to coexist with the modern world.Amid lies and threats and failing to address consecutive defeats, he promises the appearance of something that doesn’t exist, and the crisis has engulfed all pillars of the corrupt regime.History assures us that the day will come when the Iranian people will no longer hear that trembling, discordant voice. Iranians, well-versed in the poet Ferdowsi’s Shahnameh, (The Book of Kings) know the truth: Tyranny leads to destruction.The writer is a counterterrorism analyst and Middle East studies researcher based in Washington, with a particular focus on Iran and ethnic conflicts in the region. His latest book is The Black Shabbat, published in the US. You can follow him at erfanfard.com and on X @EQFARD.","url":"https://www.jpost.com/opinion/article-833721","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/639486","video":null,"publish_date":"2024-12-17 00:55:22","author":"Eran Fard","authors":["Eran Fard"],"language":"en","source_country":"il","sentiment":-0.133},{"id":273739278,"title":"How Assad&#x27;s downfall contributes to US-Israel ties","text":"The fall of the Assad regime is sending shock waves throughout the Middle East.Its implications for Israel are numerous and are still unfolding. One of the most significant of these, alongside the weakening of Iran’s “Axis of Resistance,” is found outside the Middle East, in the strategic relations between Israel and the United States. With an emphasis on the way the American administration views Israel’s conduct of war.US President Joe Biden’s remarks, upon learning the Assad regime fell, constitute a turning point in this regard. So far, the focus of the administration’s statements – and not only due to concerns about the events’ impact on the presidential elections – has been the need to prevent regionalization of the war, the need for an immediate ceasefire, and concerns about humanitarian relief, alongside a measured call supporting Israel’s limited right to self-defense.console.log(\"2390 BODY2. CatId is:\"+catID);if(catID==120){ console.log(\"2390 BODY. YES for anyclip script\"); var script = document.createElement('script'); script.src = 'https://player.anyclip.com/anyclip-widget/lre-widget/prod/v1/src/lre.js'; script.setAttribute('pubname','jpostcom'); script.setAttribute('widgetname','0011r00001lcD1i_12258'); document.getElementsByClassName('divAnyClip')[0].appendChild(script); }else if(catID !== 151) { let widgetid = \"60fd6becf6393400049e6535\"; if(catID === 69){ widgetid = \"65c3a2148772803523c6f41b\"; }else if(catID === 161){ widgetid = \"65c3a224fb10822a0a7db2dd\"; } console.log(\"2390 BODY. YES for vidazoo script\"); var script = document.createElement('script'); script.src = 'https://static.vidazoo.com/basev/vwpt.js'; script.setAttribute('data-widget-id', widgetid); document.getElementsByClassName('divVidazoo')[0].appendChild(script);} For the first time since the beginning of the war, Israel’s offensive action has been positively described by the president, and it has been credited with a decisive contribution, along with Ukraine, to what is emerging as the most significant tangible achievement in the Biden administration’s foreign policy – the fall of the brutal Assad regime.A historic development that he described as a “fundamental act of justice. A moment of historic opportunity for the long-suffering people of Syria to build a better future for their proud country.” Syrian President Bashar Assad speaks to pro-Kremlin journalist Vladimir Sovolyov, March 2024. (credit: screenshot)For Israel, struggling for its standing among the family of democratic nations while its moral reputation is daily tarnished, being part of this hopeful and inspiring transformation is no small feat.Israelis should be proud of their contribution to the fall of this abhorrent regime, mainly because they were not its main victims, as well as for being mentioned in the same breath as Ukraine, which was a symbol of the struggle for freedom of the free world, especially at the beginning of the war, when it fought the world’s largest nuclear power, using Molotov cocktails and Czech hedgehog. Syria is a crossroads where these two countries met, whose self-defense wars the United States supports, whether resolutely as in Ukraine, or with reservations as in Israel. In the convergence of these conflict arenas, the US administration was able to reap the first fruits of its investment in both wars.In addition, it was able to identify the commonality of the two wars, the moral logic of supporting its two allies, and to reposition Israel ideologically in the place it deserves to be, on the side of the forces fighting fundamentalism.In describing the factors that led to the fall of the Syrian regime, Biden made a direct connection between his support for the struggle waged by Israel and Ukraine against Hezbollah, Iran, and Russia, Bashar al-Assad’s close allies, and this moment of the fall of his regime, and avoided mentioning Turkey, despite its significant role in the overthrow of the regime, due to its support for jihadist elements opposed to Assad, not by weakening his backers. Stay updated with the latest news! Subscribe to The Jerusalem Post Newsletter Subscribe Now Israel's contribution to overthrowal of the Assad regimeIn fact, Israel’s contribution to this was not limited to inflicting massive damage on the Syrian regime’s allies and strategically weakening their ability to come to its aid in suppressing the rebels.The war that Israel waged against them drove a political-ideological wedge between Syria and its Shi’ite backers. Assad was indeed a link in the axis of resistance, but a passive one. Unlike Hezbollah, he did not choose on October 8 to join the conflict in “solidarity with the Palestinians,” to the dismay of those who called for “unity of fronts” against Israel.He was afraid of the possibility that the war would spill over into Syria and that the fate of Damascus would be like that of Gaza or Beirut, and he was deterred from actively joining the “Axis of Resistance,” and his name was almost absent from the story of the war in the 14 months preceded his fall. And this is another reason why he was abandoned by his allies, not only because they could not come to his aid, but also because they did not want to, due to the resentment they felt towards him.This contrasts with Assad’s other ally, Russia, which did come to his aid, but its impact on the survival of his regime was minor, due to its military weakness. In other words, Israel’s indirect contribution to the fall of the regime is even greater than that of Ukraine.IN ANY case, in Biden’s words about his unflagging support for Israel’s war, there is indeed a rewriting of history (the war already has one), or at least a belated recognition of the justice of Israel’s offensive approach – certainly in what is related to the blows it has delivered upon Hezbollah and Iran – but Israel should warmly embrace this change in approach.The US is in effect retroactively adopting Israel’s approach, even though it opposed it in real time, partly due to a lack of imagination regarding possible developments of degrading and defeating Iran and its proxies and focusing only on the possibility of normalization with Saudi Arabia.However, that is less important now, and what is important is that the paradigm shift may have positive implications for the next stages of the Middle East’s transformation.The fact that the American administration takes credit for its active support for Israel’s fight against Iran and its proxies, whose weakening was a decisive factor in the fall of Assad, is evidence of the great importance it attributes to this event. The Obama-Biden administration invested enormous and prolonged efforts in overthrowing the Assad regime during the bloody peak years of the civil war.Toward the end of his second term, president Barack Obama was tormented by his failure to bring relief to the humanitarian crisis, and admitted that the war haunted him relentlessly:“I would say of all the things that have happened during the course of my presidency, the knowledge that you have hundreds of thousands of people who have been killed, millions who have been displaced, [makes me] ask myself what might I have done differently.”Obama’s legacy was severely tarnished when he chose not to respond to the use of chemical weapons in 2013. In 2016, after years of thought and reflection on how past leaders dealt with dilemmas in their darkest hours, he still had not been able to find an answer to how he should have stopped the use of weapons of mass destruction:“I do ask myself, ‘Was there something that we hadn’t thought of? Was there some move that is beyond what was being presented to me that maybe a Churchill could have seen, or an Eisenhower might have figured out?”Ironically, it was a statesman whom Obama valued much less, his successor in the White House, who brought about a resolution to the issue, when a few months later, in April 2017, he sent the US Navy to launch a strike of 59 Tomahawk missiles against Syria in response to a chemical weapons attack that killed dozens of civilians. After this, the dictator did not use weapons of mass panic ever again.In other words, Biden’s competition for credit is not only interstate with Prime Minister Benjamin Netanyahu but mainly intra-party with Obama, to whom he owes his term, although he did not appreciate his VP, refused to endorse his candidacy in 2020 immediately and was apparently the architect of the rebellion against him that led his exit from the 2024 race – but it was Biden who overthrew Assad, and Obama was left with a “redline in the sand” that was savagely crossed.However, optimism is accompanied by reservations. It is important to remember that despite this positive development, it is too early to rejoice completely, not only because it is difficult to imagine the establishment of a peaceful regime that respects human rights being restored in Syria shortly, or even a stable and sovereign regime, despite the moderate tone that characterizes the rebel leader, but mainly because Assad survived, and given asylum in Russia, a country that, despite the withdrawal of its army from Syria, may soon once again play a decisive role in determining its future.The politicization and partisanship of all areas of the US government, including foreign policy, may also affect this issue. A hint of this could be found in President-elect Donald Trump’s remarks on the eve of the fall of the regime that the United States had nothing to do with this: “THIS IS NOT OUR FIGHT. DO NOT GET INVOLVED!”Thus, despite Trump’s good and sincere desire to bring an end to the wars in Ukraine and the Middle East, one of the negotiating cards may be Assad’s return to power, as part of a possible agreement with Russian President Vladimir Putin, like the unwritten one between the two leaders, which ended the war in Syria in 2017.The writer is a PhD candidate in the Department of Middle East Studies at the Ben-Gurion University of the Negev and a member of the researcher’s forum of the Elyashar Center at the Ben-Zvi Institute.","url":"https://www.jpost.com/opinion/article-833722","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/639487","video":null,"publish_date":"2024-12-17 00:55:22","author":"Nimrod Koren","authors":["Nimrod Koren"],"language":"en","source_country":"il","sentiment":0.2},{"id":273739202,"title":"The Federal Reserve takes on Trump—and stubborn inflation","text":"A lot is riding on the numbers after the decimal point. In the argot of investors, inflation in America is back to having a “two-handle” (that is, running above 2% but below 3%). It is a far better position to be in than a couple of years ago, when price rises were threatening to hit double digits. But there is a big difference between inflation decelerating towards 2% in the coming year or getting stuck nearer 3%. Not only would the latter forestall aggressive interest-rate cuts by the Federal Reserve, it would also put the central bank on a collision course with Donald Trump—a double-whammy of monetary hawkishness and political turbulence that would cast a shadow over the global economy.","url":"https://www.economist.com/finance-and-economics/2024/12/12/the-federal-reserve-takes-on-trump-and-stubborn-inflation?itm_source=parsely-api","image":"https://www.economist.com/content-assets/images/20241214_FNP003.jpg","video":null,"publish_date":"2024-12-17 00:55:22","author":"The Economist","authors":["The Economist"],"language":"en","source_country":"gb","sentiment":-0.254},{"id":273741800,"title":"Jill Biden says she is closing the book on teaching at Northern Virginia Community College","text":"WASHINGTON — Jill Biden is closing the book on her teaching career at a Virginia community college.\n\n“Being your first lady has been the honor of my life. But being your colleague has been the work of my life,” she said. “Last Thursday, I taught my last class of the semester and my final class ever at Northern Virginia Community College.”\n\n“I will always love this profession, which is why I continued to teach full time while serving as your first lady,” said Jill Biden, who has taught English and writing at NOVA for 15 years. She was the first woman to continue her professional career outside the White House while serving the United States as first lady.\n\nThe announcement comes as she and President Joe Biden are preparing to leave the White House in a little over five weeks after the Democrat dropped his bid for reelection after he performed poorly in a debate against Republican presidential candidate Donald Trump over the summer.\n\nDemocratic Vice President Kamala Harris succeeded Biden on the ticket, but lost the presidential race to Trump, who is set to be inaugurated to a second term on Jan. 20.\n\nJill Biden started teaching English and writing at Northern Virginia Community College in 2009 after Barack Obama and Joe Biden were elected president and vice president. She continued to teach there after he left office in 2017, riding the train down from their home in Delaware.\n\nShe often said, “teaching isn’t what I do, it’s who I am.”","summary":"The first lady, who has taught in classrooms for 40 years, announced Monday that she had taught her final class ever at Northern Virginia Community College in Alexandria.","url":"https://www.twincities.com/2024/12/16/jill-biden-teaches-final-class/","image":"https://www.twincities.com/wp-content/uploads/2024/12/AP24352006254965-1.jpg?w=1024&h=682","video":null,"publish_date":"2024-12-17 00:49:36","author":"Darlene Superville","authors":["Darlene Superville"],"language":"en","source_country":"us","sentiment":0.018},{"id":273739360,"title":"Jill Biden says she is closing the book on teaching at Northern Virginia Community College","text":"By DARLENE SUPERVILLE\n\nWASHINGTON (AP) — Jill Biden is closing the book on her teaching career at a Virginia community college.\n\n“Being your first lady has been the honor of my life. But being your colleague has been the work of my life,” she said. “Last Thursday, I taught my last class of the semester and my final class ever at Northern Virginia Community College.”\n\n“I will always love this profession, which is why I continued to teach full time while serving as your first lady,” said Jill Biden, who has taught English and writing at NOVA for 15 years. She was the first woman to continue her professional career outside the White House while serving the United States as first lady.\n\nThe announcement comes as she and President Joe Biden are preparing to leave the White House in a little over five weeks after the Democrat dropped his bid for reelection after he performed poorly in a debate against Republican presidential candidate Donald Trump over the summer.\n\nDemocratic Vice President Kamala Harris succeeded Biden on the ticket, but lost the presidential race to Trump, who is set to be inaugurated to a second term on Jan. 20.\n\nJill Biden started teaching English and writing at Northern Virginia Community College in 2009 after Barack Obama and Joe Biden were elected president and vice president. She continued to teach there after he left office in 2017, riding the train down from their home in Delaware.\n\nShe often said, “teaching isn’t what I do, it’s who I am.”","summary":"The first lady, who has taught in classrooms for 40 years, announced Monday that she had taught her final class ever at Northern Virginia Community College in Alexandria.","url":"https://www.mercurynews.com/2024/12/16/jill-biden-teaches-final-class/","image":"https://www.mercurynews.com/wp-content/uploads/2024/12/AP24352006254965.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-17 00:49:36","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.034},{"id":273740664,"title":"Still no answers on drone sightings in New Jersey and other states","text":"Still no answers on drone sightings in New Jersey and other states\n President-elect Donald Trump accused the Biden administration of keeping people in the dark about a recent slew of drone sightings over New Jersey, New York and other states. Officials have said there is no public safety threat, but a lack of definitive answers has some residents feeling uneasy. Tom Hanson reports.","summary":"President-elect Donald Trump accused the Biden administration of keeping people in the dark about a recent slew of drone sightings over New Jersey, New York and other states. Officials have said there is no public safety threat, but a lack of definitive answers has some residents feeling uneasy. Tom Hanson reports.","url":"https://www.cbsnews.com/video/still-no-answers-on-drone-sightings-in-new-jersey-and-other-states/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/12/17/8ae53073-649c-48c6-9446-9d0373764e75/thumbnail/1200x630/da7e9e00e3989e3f5473124ad8e9b39d/1216-en-hanson.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-17 00:49:00","author":null,"language":"en","category":"sports","source_country":"US","sentiment":-0.691},{"id":273740660,"title":"Trump defends tapping Kennedy for Department of Health and Human Services","text":"Trump defends tapping Kennedy for Department of Health and Human Services\n President-elect Donald Trump on Monday held his first news conference since winning the 2024 election. He defended selecting Robert F. Kennedy Jr. to lead the Department of Health and Human Services and also discussed the economy. Caitlin Huey-Burns has more.","summary":"President-elect Donald Trump on Monday held his first news conference since winning the 2024 election. He defended selecting Robert F. Kennedy Jr. to lead the Department of Health and Human Services and also discussed the economy. Caitlin Huey-Burns has more.","url":"https://www.cbsnews.com/video/trump-defends-tapping-kennedy-for-department-of-health-and-human-services/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/17/a7b66b19-dbcf-4ac0-b5a0-660c07cd5f26/thumbnail/1200x630/f513d38dec67fdf97cb6dfe8df978914/1216-en-chb.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-17 00:49:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.225},{"id":273738850,"title":"Trump hush money judge refuses to throw out conviction on presidential ‘immunity’ grounds","text":"The judge overseeing Donald Trump’s hush money trial has refused to dismiss the case and throw out a jury’s verdict after his attorneys argued he has “immunity” from prosecution.\n\nTrump appears likely to enter the White House as a convicted felon, though it remains unclear when, or if, the judge will continue to postpone a sentencing date after a unanimous jury found him guilty of falsifying business records tied to hush money payments to Stormy Daniels.\n\nJudge Merchan has also yet to rule on Trump’s argument that the case should not be able to continue now that he is president-elect.\n\nIn a filing on Monday, New York Justice Juan Merchan argued evidence surrounding Trump’s falsification of business records to cover up hush money payments to an adult film star is not shielded by “immunity” granted to presidents under the Supreme Court’s groundbreaking decision this summer.\n\nEvidence presented to the jury — even if it could be shielded by “immunity” — paled in comparison to “other overwhelming evidence of defendant’s guilt,” according to Merchan.\n\n“If error occurred regarding the introduction of the challenged evidence, such error was harmless in light of the overwhelming evidence of guilt,” he wrote.\n\nEvidence and testimony were “entirely” about “unofficial conduct entitled to no immunity protections,” according to Merchan.\n\nHis actions were “personal acts” that fall outside the so-called “outer perimeter” of official presidential duties, and there is no “danger of intrusion on the authority and function of the Executive Branch” in this case, Merchan wrote.\n\nOn May 30, a jury found Trump guilty of falsifying business records in connection with a scheme to silence Daniels, whose story about having sex with Trump threatened to derail his 2016 presidential campaign.\n\nTrump’s reimbursements to his then-attorney Michael Cohen, who paid off Daniels, were falsely recorded in accounting records as “legal expenses.”\n\nMerchan was scheduled to rule on the “immunity” implications for the case and Trump’s conviction last month, after Trump’s election victory rocketed the case into uncharted territory, despite the jury’s conviction on 34 felony counts arriving more than six months ago.\n\nLast week, Manhattan prosecutors with District Attorney Alvin Bragg’s office asked the judge to maintain the conviction and suggested postponing a sentencing hearing until after Trump’s presidency comes to an end in 2029.\n\nTrump can’t be shielded from criminal prosecution as “president-elect,” because “president-elect immunity does not exist,” prosecutors wrote.\n\nEven after his inauguration, Trump’s “temporary immunity” as the sitting president “will still not justify the extreme remedy of discarding the jury’s unanimous guilty verdict and wiping out the already-completed phases of this criminal proceeding,” they argued.\n\nWeeks after the jury’s verdict, the Supreme Court issued a landmark ruling that granted the office of the presidency absolute immunity for actions tied to official duties, and “presumptive immunity” for actions within the “outer perimeter” of the office.\n\nTrump’s attorneys argued his “overwhelming victory” and his status as a “soon-to-be sitting President” entitles him to a broader shield of immunity, and that the “continued criminal proceedings pose a constitutionally unacceptable risk of diversion” from his upcoming presidency.\n\nFurther delays in his sentencing, and the potential for the case to be frozen for four years or tossed altogether, mean that Trump is expected to enter office having avoided any consequences for the allegations and convictions against him.\n\nSpecial counsel Jack Smith has effectively closed the federal criminal cases against the former president, for now, and an appeals court in Georgia has postponed arguments related to his election interference case in Fulton County.","summary":"Trump is likely to enter White House as first convicted felon president","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-hush-money-stormy-daniels-judge-immunity-b2665452.html","image":"https://static.independent.co.uk/2024/12/17/00/e9c3c91f5b5a48209f48a6d631b9956d.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/qGF1J9ec-4VHSaSK0.mp4","publish_date":"2024-12-17 00:41:07","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.314},{"id":273737772,"title":"Waymo Robotaxis Are Heading To Tokyo For Their First Overseas Road Tests","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nA Waymo robotaxi in San Francisco.\nGado via Getty Images\n\nWaymo, the top U.S. robotaxi company, is looking to expand the business internationally with plans to begin its first overseas tests in Tokyo early next year, while it also continues to expand the service to more U.S. cities.\n\nThe Alphabet Inc. subsidiary will send a fleet of electric Jaguar I-Pace SUVs to Japan early next year to begin mapping some of the densest districts of central Tokyo. To aid that effort, Waymo said it’s partnering with Nihon Kotsu, Japan’s biggest taxi operator, and taxi app operator GO. The company didn’t offer a timeframe for when it expects the driverless vehicles to be in commercial service.\n\nThe news comes on the heels of Waymo’s plan to launch its ride service in Miami next year, along with Austin and Atlanta. Currently, it’s available in Phoenix, San Francisco and Los Angeles, where every week it carries more than 150,000 riders combined. The company doesn’t share financial details for the service, though its annualized revenue is tracking at more than $150 million based on the weekly ridership rate.\n\nLast week, General Motors announced it was pulling the plug on Cruise, its competing robotaxi service and Waymo’s biggest U.S. rival, deciding instead to focus its autonomous driving tech efforts on personal vehicles. Elon Musk’s Tesla aspires to be a leader in robotaxis – something that’s helping boost its stock price in the wake of Donald Trump’s election win – but the company hasn’t demonstrated that it has the ability to do that.\n\nDespite the name, Tesla’s Autopilot and Full Self-Driving features are classified as advanced driver-assist technologies that aren’t capable of operating a vehicle without a human at the wheel, ready to take over. By contrast, Waymo’s robotaxis operate with no human driver, though the company does have staff monitoring them and who can provide some remote backup assistance.\n\nIn November, Waymo said it had raised $5.6 billion in its biggest-ever funding round ahead of major expansion plans. Additionally, it intends to begin sourcing electric vehicles from Hyundai starting next year, which cost about 40% less than the I-Pace model it uses, as it also shifts to lower-cost computing and sensor hardware.\n\nMore From Forbes\nForbesGM Pulls The Plug On Its Multibillion-Dollar Robotaxi BetBy Alan OhnsmanForbesAlphabet’s Waymo Logging 150,000 Robotaxi Rides And 1 Million Miles A WeekBy Alan OhnsmanForbesWaymo Hauls In $5.6 Billion To Boost Its Growing Robotaxi BusinessBy Alan Ohnsman\n\nFollow me on LinkedIn. Check out my website. Send me a secure tip. \n\nAlan Ohnsman\n\nEditorial Standards\n\nForbes Accolades","summary":"The Alphabet Inc. unit is partnering with Japan’s biggest taxi service to test a fleet of electric Jaguar SUVs that will learn how to drive in Japan early next year.","url":"https://www.forbes.com/sites/alanohnsman/2024/12/16/waymo-robotaxis-are-heading-to-tokyo-for-their-first-overseas-road-tests/","image":"https://imageio.forbes.com/specials-images/imageserve/6760a15d03f18471ccabe24c/0x0.jpg?format=jpg&crop=1757,1186,x0,y131,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-12-17 00:38:56","author":"Alan Ohnsman,Forbes Staff","authors":["Alan Ohnsman","Forbes Staff"],"language":"en","source_country":"US","sentiment":-0.101},{"id":273742744,"title":"Trump announces new US ambassadors to Uruguay, Japan, Luxembourg, Austria, and Dominican Republic. Know who they are","text":"US President-elect Donald Trump announced ambassadors for five countries on Tuesday, including Uruguay, Japan, Luxembourg, Austria, and the Dominican Republic. He made the announcement on his 'Truth Social' platform.According to Trump, Lou Rinaldi will serve as the US ambassador to Uruguay, George Edward Glass to Japan, Stacey Feinberg to Luxembourg, Arthur Graham Fisher to Austria, and Leah Francis Campos to the Dominican Republic.Who is Lou Rinaldi? US ambassador to UruguayLou Rinaldi, Trump's nominee for US ambassador to Uruguay, is a successful businessman, entrepreneur, and longtime friend of the president-elect. According to Trump, Rinaldi has an intimate understanding of Uruguay's culture and history. He noted that Lou's expertise and experience make him highly qualified to promote US interests and reinforce the enduring partnership between the United States and Uruguay.\"I am pleased to announce the nomination of Lou Rinaldi to serve as the next United States Ambassador to Uruguay. A successful businessman, entrepreneur, and longtime friend, Lou brings a lifetime of experience and unique perspective to this important role. Lou is a great golfer, and will be in a Country with some terrific courses. Having grown up in Uruguay, he possesses an intimate understanding of the Country’s culture and history. His expertise and background make him exceptionally qualified to advance U.S. interests, and strengthen the longstanding partnership between the United States and Uruguay. Congratulations Lou!,\" Trump posted on Truth Social.— TrumpWarRoom (@TrumpWarRoom) Who is George Edward Glass? US ambassador to JapanGeorge Edward Glass, who will serve as the US ambassador to Japan, is a former president of an investment bank and was previously the ambassador to Portugal during Trump's first presidential term. A graduate of the University of Oregon, Glass served as alumni president and as a member of its board of trustees.\"I am pleased to announce George Edward Glass as our next United States Ambassador to Japan. In my First Term, George was the U.S. Ambassador to Portugal. As a former President of an Investment Bank, George will bring his business acumen to the Ambassador’s position. George graduated from the University of Oregon, served as Alumni President, and on its Board of Trustees. He will always PUT AMERICA FIRST. Congratulations George!\" Trump announced.— TrumpWarRoom (@TrumpWarRoom) Who is Stacey Feinberg? US ambassador to LuxembourgStacey Feinberg, Trump's nominee for US ambassador to Luxembourg, is a producer of Broadway musicals, a motivational speaker, and a board member of the Women Founders Network. A graduate of Northwestern University, Stacey is committed to supporting women in launching their careers. After graduation, she assisted her father at his pioneering sports and entertainment law firm.\"I am pleased to announce Stacey Feinberg will be our next United States Ambassador to Luxembourg. Stacy is a graduate of Northwestern University. After graduating, Stacey assisted her father at his pioneering Sports and Entertainment Law Firm. As a Producer of Broadway musicals, a motivational speaker, and a Board Member of the Women Founders Network, Stacey is committed to supporting women in launching their careers, and scaling their businesses to unprecedented success. Stacy will be GREAT, and make America proud!\" Trump announced.— TrumpWarRoom (@TrumpWarRoom) Who is Arthur Graham Fisher? US Ambassador to AustriaArthur Graham Fisher, Trump's selection for US ambassador to the Republic of Austria, is the president of the real estate firm Fisher Realty, founded in 1977. Fisher has been a staunch supporter of America First policies, according to Trump. According to Trump, Fisher has consistently been ranked as a top broker in the area and the state of North Carolina, representing many of America’s most astute clients. \"I am pleased to announce that I will nominate Arthur Graham Fisher as the next United States Ambassador to the Republic of Austria. Art is President of Fisher Realty, a full service real estate firm founded in 1977, with three offices in the beautiful mountains of North Carolina. He has been consistently ranked as a top broker in the area, and the State of North Carolina, representing many of the most astute clients in America. Art has been a staunch supporter of America First Policies, and will make us proud in Austria!— TrumpWarRoom (@TrumpWarRoom) Who is Leah Francis Campos? US ambassador to the Dominican RepublicLeah Francis Campos, Trump's nominee for US ambassador to the Dominican Republic, served as senior advisor for the Western Hemisphere on the House Foreign Affairs Committee. She previously served as a CIA case officer for the country. Campos is the sister of \"Fox & Friends Weekend\" co-host Rachel Campos-Duffy and the sister-in-law of Sean Duffy, the incoming secretary of transportation.— TrumpWarRoom (@TrumpWarRoom) \"I am pleased to announce that I will nominate Leah Francis Campos as United States Ambassador to the Dominican Republic. Leah served our Country as a CIA Case Officer before becoming Senior Advisor for the Western Hemisphere on the House Foreign Affairs Committee. Leah is a mother to four beautiful children, and comes from a family of Patriots. Her sister, the outstanding Rachel Campos-Duffy, of FoxNews, and brother-in-law Sean Duffy, who will be Secretary of Transportation, are also wonderful Patriots. Leah will take her love of Country, and commitment to our National Security and Prosperity, to her post as U.S. Ambassador to the Dominican Republic. Congratulations Leah!\" Trump wrote.","summary":"President-elect Donald Trump announced his ambassadorial picks for five nations on Truth Social.  Businessman Lou Rinaldi heads to Uruguay, former ambassador George Edward Glass to Japan, Broadway producer Stacey Feinberg to Luxembourg, real estate president Arthur Graham Fisher to Austria, and former CIA officer Leah Francis Campos to the Dominican Republic.","url":"https://timesofindia.indiatimes.com/world/us/trump-announces-new-us-ambassadors-to-uruguay-japan-luxembourg-austria-and-dominican-republic-know-who-they-are/articleshow/116383016.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116383262/116383262.jpg","video":null,"publish_date":"2024-12-17 00:38:35","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":1},{"id":273740048,"title":"Judge Denies Trump’s Bid to Throw Out Conviction Over Immunity Ruling","text":"A judge on Monday rejected Donald J. Trump’s argument that a recent Supreme Court ruling had nullified his criminal case in New York, upholding the former and future president’s felony conviction for falsifying records to cover up a sex scandal.\n\nThe judge’s ruling preserves, at least for now, the stain of Mr. Trump’s criminal conviction. And if the decision withstands an appeal, Mr. Trump could become the first felon to serve as president.\n\nThe ruling, which addressed the Supreme Court’s decision to grant presidents broad immunity for their official actions, thwarted only the first of several legal maneuvers Mr. Trump has concocted to clear his record of 34 felonies before returning to the White House.\n\nProsecutors had argued that the Supreme Court’s decision had “no bearing on this prosecution,” noting that Mr. Trump was convicted of orchestrating a scheme involving a personal and political crisis that predated his presidency.","summary":"Justice Juan M. Merchan thwarted one of several attempts by Donald J. Trump to clear his record of 34 felonies before returning to the White House.","url":"https://www.nytimes.com/2024/12/16/nyregion/trump-immunity-criminal-case.html","image":"https://static01.nyt.com/images/2024/12/16/multimedia/00merchanimmunity-mpzl/00merchanimmunity-mpzl-facebookJumbo.jpg","video":null,"publish_date":"2024-12-17 00:38:32","author":"Ben Protess,Kate Christobek","authors":["Ben Protess","Kate Christobek"],"language":"en","category":"politics","source_country":"us","sentiment":0.143},{"id":273736694,"title":"BREAKING: Judge Merchan Rules on Trump's Bid to Have Case Dismissed Due to Presidential Immunity","text":"We knew the ruling would be coming at some point. Finally, late Monday afternoon, Judge Juan Merchan issued his decision regarding President-elect Donald Trump's bid to have the verdict against him set aside in the Manhattan falsified business records case. \n\nMerchan denied Trump's request — but this ruling only pertains to the issue of presidential immunity. There remains pending the motion to dismiss the case due to Trump's reelection, as well as the ultimate issue of sentencing (if that motion is denied).\n\nThe U.S. Supreme Court ruled on the presidential immunity issue in July. Following that, Trump's legal team moved to have the verdict set aside, asserting that evidence presented in the case should have been inadmissible based on the high court's ruling. \n\nAfter several delays regarding the anticipated ruling, Merchan has now denied Trump's motion.\n\nMerchan wrote that the evidence contested by Trump’s lawyers related “entirely to unofficial conduct” and should receive no immunity protections.“This Court concludes that if error occurred regarding the introduction of the challenged evidence, such error was harmless in light of the overwhelming evidence of guilt,” Merchan wrote. “Even if this Court did find that the disputed evidence constitutes official acts under the auspices of the Trump decision, which it does not, Defendant’s motion is still denied as introduction of the disputed evidence constitutes harmless error and no mode of proceedings error has taken place.”In his decision, Merchan walked through several pieces of testimony that Trump’s lawyers claimed should not have been heard at trial because of the immunity decision, including from Hope Hicks, Madeleine Westerhout and Michael Cohen.Merchan wrote that it was “logical and reasonable to conclude that if the act of falsifying records to cover up the payments so that the public would not be made aware is decidedly an unofficial act, so too should the communications to further that same cover-up be unofficial.”\n\nTrump will now have the ability to appeal this ruling, and one expects that appeal will be filed fairly quickly. \n\nAt this time, there is no indication as to when Merchan may rule on the remaining matters. We will continue to monitor the case and provide updates as they become available.","url":"https://redstate.com/smoosieq/2024/12/16/breaking-judge-merchan-rules-on-trumps-bid-to-have-case-dismissed-due-to-presidential-immunity-n2183296","image":"https://media.townhall.com/cdn/hodl/2024/87/ca368d50-2387-44a3-98bb-c346dfa282e2.jpg","video":null,"publish_date":"2024-12-17 00:38:23","author":"Susie Moore","authors":["Susie Moore"],"language":"en","category":"politics","source_country":"us","sentiment":-0.356},{"id":273736696,"title":"Status and Alpha Males, Why This Matters in Japan, and Why Donald Trump Has It and Joe Biden Doesn't","text":"Those of us here in the United States don't generally give a lot of thought to social status when dealing with our fellow citizens — at least, not to the extent that some other cultures do. Oh, we are aware of some status effects; when we were younger, we treated figures like teachers (at least back when I was in school) and parents as having a higher status than we did. To a degree, that's inevitable — in families, if nowhere else. Until the day he passed, my father never hesitated to remind me that he was the father and I was the son in that relationship.","url":"https://redstate.com/wardclark/2024/12/16/status-alpha-males-why-donald-trump-has-it-and-joe-biden-doesnt-n2183273","image":"https://media.townhall.com/cdn/hodl/2024/337/1ddae7b5-9e30-4b1b-b37c-d50293efe5a5.jpg","video":null,"publish_date":"2024-12-17 00:38:23","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":0.209},{"id":273736692,"title":"Senate Democrats File Bill to Eliminate the Electoral College - They Need to Read the Constitution","text":"We are indeed fortunate to live in the United States, a nation that is governed by what has to be the wisest, most carefully crafted governing document that exists in the world today - the United States Consitution. Every act that the national government is authorized to take on our behalf, every role, and every requirement for every elected official, is documented therein.\n\nThis includes elections, most particularly the method we use to elect the chief executive - the President of the United States. As the country is a constitutional republic consisting of 50 sovereign states, each state holds its own election for a slate of electors, who meet to elect the president. This is colloquially known as the Electoral College. The slate of electors is expected to vote for the presidential candidate who won the state's elections, and by and large, that's what happens, barring the occasional \"faithless elector.\"\n\nOur elected representatives' roles are defined by the Constitution, and they take an oath to uphold that Constitution. That being the case, it would be nice if some of them would read it; then we wouldn't be subjected to egregious stupidity like this:\n\nThere are so many things wrong with this it's hard to know where to begin - so let's begin at the beginning.\n\nFirst, the Constitution, in Article II, Section 1, states in part:\n\nThe executive Power shall be vested in a President of the United States of America. He shall hold his Office during the Term of four Years, and, together with the Vice President, chosen for the same Term, be elected, as followsEach State shall appoint, in such Manner as the Legislature thereof may direct, a Number of Electors, equal to the whole Number of Senators and Representatives to which the State may be entitled in the Congress: but no Senator or Representative, or Person holding an Office of Trust or Profit under the United States, shall be appointed an Elector.The Electors shall meet in their respective States, and vote by Ballot for two Persons, of whom one at least shall not be an Inhabitant of the same State with themselves.\n\nFirst, we hold elections to determine who the electors will be, and they vote for the president. That's not the way it's generally described, but that's how it works. The apportionment of electors is a brilliant system that ensures that every state will have a say in presidential elections; otherwise, every presidential election would be decided in a few major cities. \n\nBut most of all, these \"Senate Democrats\" clearly do not comprehend that they cannot just pass a bill to abolish this system. This would require a constitutional amendment, meaning a two-thirds vote in both the House and Senate, followed by ratification by 3/4 of the 50 states - 33 states. Good luck with that.\n\nSecond, on the claim of \"restoring democracy,\" one cannot restore what has never been the case. The United States was founded as a constitutional republic and remains a constitutional republic to this day. The words \"democrat\" \"democratic\" and \"democracy\" appear nowhere in the Constitution, although Article 4, Section 4 states:\n\nThe United States shall guarantee to every State in this Union a Republican Form of Government, and shall protect each of them against Invasion; and on Application of the Legislature, or of the Executive (when the Legislature cannot be convened) against domestic Violence.\n\nAlso, \"restore\" means \"return to a preceding state.\" The Electors system has been in place since the Constitution was ratified. There's nothing to restore.\n\nSee Related: \n\nCongressional Progressives Never Learn: It's Not the Messaging, It's the Message\n\nFinally, there is no popular vote for president. None. The Constitution does not allow for it. Oh, the \"popular vote\" is oft-quoted as a statistical curiosity, and it can be interpreted as giving an incoming president a mandate - and Donald Trump's 5-million vote lead over Kamala Harris seems to have done.\n\nHave none of the Democrats on the Senate Judiciary Committee ever even seen a copy of the Constitution? The drafting and submission of such a bill, never mind the taking to X to brag about it, is nitwittery of the worst sort. In a sane country with a sane electorate, this kind of stupidity should result in an electoral rousting in the nitwits in question's next election. This sort of ignorance is - or, at least should be - disqualifying.","url":"https://redstate.com/wardclark/2024/12/16/senate-democrats-file-bill-to-eliminate-the-electoral-college-they-need-to-read-the-constitution-n2183292","image":"https://media.townhall.com/cdn/hodl/2018/303/9477089a-9480-437b-8bd1-6faad9844f41.jpg","video":null,"publish_date":"2024-12-17 00:38:23","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"politics","source_country":"us","sentiment":-0.218},{"id":273736556,"title":"Russia-Ukraine War and NATO’s Evolving Role in Global Power","text":"The ongoing Russia-Ukraine war has fundamentally altered the security landscape of Europe and beyond. NATO, as the cornerstone of Western military cooperation, has found its relevance reinvigorated after years of scepticism regarding its utility in the post-Cold War world. The conflict has compelled NATO to revisit its strategic priorities, strengthen its alliances and adapt its posture to address new and emerging threats. How is the war reshaping NATO’s strategies and alliances, and what are its broader implications for European security and global power dynamics?\n\nThe Revival of NATO’s PurposePrior to the Russia-Ukraine conflict, NATO faced significant internal challenges, including doubts about its relevance in the 21st century, disagreements among member states and a lack of consensus on strategic priorities. Former US President Donald Trump’s critique of NATO as “obsolete” and Emmanuel Macron’s characterization of the alliance as experiencing “brain death” highlighted these divisions. However, Russia’s invasion of Ukraine in February 2022 has dramatically reversed this narrative, reinforcing NATO’s importance as a collective defense organization.\n\nThe war has reawakened NATO’s foundational principle of collective defense under Article 5 of the North Atlantic Treaty. Member states have rallied to support Ukraine through military aid, intelligence sharing, and humanitarian assistance, demonstrating unprecedented unity and resolve. NATO’s renewed sense of purpose is evident in its enhanced readiness to deter and defend against potential threats from Russia.\n\nReshaping NATO’s StrategiesStrengthening the Eastern Flank: One of the most immediate responses to the Russia-Ukraine war has been NATO’s bolstering of its eastern flank. The Baltic states (Estonia, Latvia and Lithuania) and Poland, which share borders with Russia or its ally Belarus, have received increased troop deployments and advanced weaponry. NATO’s Enhanced Forward Presence (EFP) has been expanded to deter potential Russian aggression in these vulnerable regions.\n\nEnhanced Defense Spending: The war has prompted a significant increase in defense spending among NATO members. Germany, for instance, announced a historic €100 billion defense fund, breaking away from its long-standing policy of military restraint. Similarly, other member states, including the United Kingdom, France and the United States, have committed additional resources to modernize their militaries and meet the alliance’s 2% GDP defense spending benchmark.\n\nAdopting a Multi-Domain Approach: NATO is also adapting to modern warfare by embracing a multi-domain approach that integrates traditional land, sea and air capabilities with emerging domains such as cyber and space. The war in Ukraine has underscored the importance of cyber resilience, as Russia’s cyberattacks on Ukraine have targeted critical infrastructure and communication networks. NATO’s establishment of the Cyberspace Operations Centre and enhanced coordination on cybersecurity among member states reflect this strategic shift.\n\nAccelerating Membership Expansion: The conflict has accelerated NATO’s enlargement, with Sweden and Finland applying for membership in response to perceived threats from Russia. This expansion underscores a shift in Europe’s security calculus, as traditionally neutral states align themselves with NATO to ensure their defense. Finland’s accession in April 2023 marked a historic moment, doubling NATO’s border with Russia and increasing its strategic depth in the region.\n\nAlliances and PartnershipsStrengthening Transatlantic Unity: The Russia-Ukraine war has rejuvenated transatlantic relations. The United States, as NATO’s leading power, has played a crucial role in galvanizing the alliance’s response to Russian aggression. The Biden administration’s commitment to NATO has contrasted sharply with its predecessor’s skepticism, reinforcing the alliance’s cohesion.\n\nEuropean nations, too, have recognized the importance of US leadership in ensuring their security. The formation of the Ukraine Defense Contact Group and coordinated military aid packages reflect a high degree of transatlantic cooperation. NATO’s unified stance has sent a strong message to Russia and other potential adversaries about the alliance’s enduring strength.\n\nDeepening Ties with Partners: Beyond its core membership, NATO has sought to deepen ties with non-member partners. Japan, South Korea and Australia have been engaged more closely in NATO’s activities, reflecting the alliance’s recognition of global security interdependencies. The war in Ukraine has highlighted the need for NATO to address challenges posed by authoritarian regimes beyond Europe, particularly in the Indo-Pacific region.\n\nAddressing Internal Divergences: While the alliance has demonstrated remarkable unity, internal divergences remain. Differences in threat perceptions between Eastern and Southern European members persist, with the former prioritizing Russian aggression and the latter focusing on issues like migration and instability in the Middle East and North Africa. NATO must navigate these tensions to maintain its cohesion and effectiveness.\n\nImplications for European SecurityA More Militarized Europe: The war has catalyzed a shift towards greater militarization in Europe. Countries are re-evaluating their defense policies and increasing their capabilities to deter future threats. The European Union’s Strategic Compass initiative aims to complement NATO’s efforts by enhancing Europe’s defense autonomy, though questions about duplication and coordination remain.\n\nEnergy Security and Resilience: Russia’s use of energy as a geopolitical weapon has exposed Europe’s vulnerabilities. NATO’s response to the war includes a focus on energy security, with efforts to diversify supplies and protect critical infrastructure. The alliance’s cooperation with the EU on energy resilience has gained importance in light of attacks on pipelines and energy facilities.\n\nLong-Term Deterrence: NATO’s shift from a reactive to a proactive posture involves long-term deterrence measures. The deployment of more permanent forces in Eastern Europe, combined with enhanced training and exercises, reflects the alliance’s commitment to defending its members against any aggression. These measures aim to prevent a repeat of the Ukraine scenario elsewhere in Europe.\n\nGlobal Power DynamicsA Resurgent West: The Russia-Ukraine war has revitalized Western unity and leadership in global affairs. NATO’s robust response contrasts sharply with the disunity observed in previous crises, such as the Syrian conflict. The West’s ability to coordinate sanctions, military aid, and diplomatic efforts has underscored its influence in shaping international norms and responses to aggression.\n\nChallenging Authoritarian Alliances: Russia’s actions in Ukraine have strained its partnerships, including its alliance with China. While Beijing has provided rhetorical support for Moscow, it has avoided direct involvement in the conflict, reflecting concerns about global backlash and economic consequences. NATO’s engagement with Indo-Pacific partners signals a strategic alignment to counterbalance the influence of authoritarian regimes.\n\nShifting Economic and Technological Power: The war’s impact on global power dynamics extends beyond military considerations. Economic sanctions on Russia have reshaped energy markets and trade flows, while the conflict’s emphasis on technology, from drones to cybersecurity, has highlighted the growing importance of innovation in modern warfare. NATO’s focus on technological superiority aims to maintain its competitive edge in this evolving landscape.\n\nChallenges and Future ProspectsDespite its achievements, NATO faces several challenges in adapting to the new security environment. Balancing the diverse priorities of its members, addressing resource constraints and managing relations with non-NATO countries like Ukraine will require careful navigation. Furthermore, the alliance must remain agile to address hybrid threats, climate-related security risks and the rise of emerging technologies such as artificial intelligence.\n\nLooking ahead, NATO’s future will depend on its ability to sustain its momentum, foster innovation and strengthen its partnerships. The war in Ukraine has demonstrated the alliance’s resilience and adaptability, but it has also underscored the complexity of maintaining unity in an increasingly multipolar world.\n\nConclusionThe Russia-Ukraine war has been a watershed moment for NATO, reshaping its strategies, revitalizing its alliances and redefining its role in global security. By strengthening its eastern flank, enhancing defense capabilities and embracing a multi-domain approach, NATO has demonstrated its commitment to collective defense and deterrence. The war’s implications for European security and global power dynamics are profound, highlighting the enduring relevance of NATO in navigating a turbulent and uncertain world. As the alliance continues to adapt to emerging challenges, its ability to maintain unity and innovation will be critical in securing a stable and secure future for its members and partners.\n\nThe writer is a journalist and columnist specializing in international affairs, a PR expert, and a journalism lecturer with a PhD in Journalism and expertise in global diplomacy and foreign policy. Contact: achmondsky@gmail.com","url":"https://www.modernghana.com/news/1366128/russia-ukraine-war-and-natos-evolving-role-in.html","image":"https://cdn.modernghana.com/images/content/1216202491329-osjvm8x442-ukraine-president-zelensky.jpg","video":null,"publish_date":"2024-12-17 00:37:22","author":"Richmond Acheampong","authors":["Richmond Acheampong"],"language":"en","category":"politics","source_country":"gh","sentiment":0.435},{"id":273741142,"title":"Trump unveils picks for his future ambassadors to Japan, Austria and other countries: 'PUT AMERICA FIRST'","text":"President-elect Trump announced his nominations for U.S. ambassadors to five countries on Monday, including Austria and Japan. In a series of Truth Social posts on Monday night, the incoming president detailed his picks for the U.S. ambassadors to Japan, the Dominican Republic, Austria, Luxembourg and Uruguay. Each nominee will need to be confirmed by the U.S. Senate. Trump named George Edward Glass, a former U.S. ambassador to Portugal, to serve as the incoming U.S. ambassador to Japan. \"As a former President of an Investment Bank, George will bring his business acumen to the Ambassador’s position,\" Trump said of Glass. \"George graduated from the University of Oregon, served as Alumni President, and on its Board of Trustees. He will always PUT AMERICA FIRST. Congratulations George!\" TIDE TURNS FOR HEGSETH AS TRUMP'S DEFENSE SECRETARY NOMINEE GOES ON OFFENSE Leah Francis Campos, the sister of \"Fox & Friends Weekend\" co-host Rachel Campos-Duffy and sister-in-law to incoming Secretary of Transportation Sean Duffy, was also picked to be an ambassador. Trump nominated her to serve as U.S. ambassador to the Dominican Republic. \"Leah served our Country as a CIA Case Officer before becoming Senior Advisor for the Western Hemisphere on the House Foreign Affairs Committee,\" the Republican wrote. \"Leah will take her love of Country, and commitment to our National Security and Prosperity, to her post as U.S. Ambassador to the Dominican Republic. Congratulations Leah!\" GET TO KNOW DONALD TRUMP'S CABINET: WHO HAS THE PRESIDENT-ELECT PICKED SO FAR? Trump also announced Arthur Graham Fisher, the president of Fisher Realty, as his pick for U.S. ambassador to Austria. \"He has been consistently ranked as a top broker in the area, and the State of North Carolina, representing many of the most astute clients in America,\" the incoming president wrote. \"Art has been a staunch supporter of America First Policies, and will make us proud in Austria!\" Trump added that Stacey Feinberg and Lou Rinaldi will serve as U.S. ambassadors to Luxembourg and Uruguay, respectively. HEAD HERE FOR THE LATEST FROM FOX NEWS ON THE TRUMP TRANSITION \"As a Producer of Broadway musicals, a motivational speaker, and a Board Member of the Women Founders Network, Stacey is committed to supporting women in launching their careers, and scaling their businesses to unprecedented success,\" Trump wrote of Feinberg. \"Stacy will be GREAT, and make America proud!\" Of Rinaldi, Trump called his nominee a \"successful businessman, entrepreneur, and longtime friend,\" who grew up in Uruguay. CLICK TO GET THE FOX NEWS APP \"Lou is a great golfer, and will be in a Country with some terrific courses. Having grown up in Uruguay, he possesses an intimate understanding of the Country’s culture and history,\" Trump's statement read. \"His expertise and background make him exceptionally qualified to advance U.S. interests, and strengthen the longstanding partnership between the United States and Uruguay.\" Fox News' Deirdre Heavy contributed to this report.","summary":"In a series of Truth Social posts on Monday, President-elect Trump announced his ambassadorial picks to Japan, the Dominican Republic, Austria, Luxembourg and Uruguay.","url":"https://www.foxnews.com/politics/trump-unveils-picks-his-future-ambassadors-japan-austria-other-countries-put-america-first","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/12/931/523/5721e19c-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-17 00:37:15","author":"Andrea Margolis","authors":["Andrea Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":0.795},{"id":273736272,"title":"A House Democrat Is Reportedly Trump's Top Contender to Head FEMA","text":"When it comes to those nominated or selected to serve in President-elect Donald Trump's administration, there's still roles to be filled, including when it comes to who will lead Federal Emergency Management Agency (FEMA). As of Monday, there's been speculation that Rep. Jared Moskowitz (D-FL) is considered Trump's top contender. \n\nSources have told CNN's Steve Contorno about Kristen Holmes about such a pick being considered.\n\nNew: FL Rep. Jared Moskowitz, a Democrat, is a top contender to lead FEMA for Donald Trump, sources tell me and @KristenhCNN. Moskowitz previously served as the director of Emergency Management for Florida Gov. DeSantis, where he helped lead the state’s COVID response.— Steve Contorno (@scontorno) December 16, 2024\n\nIn addition to adding some bipartisanship to the second Trump administration, Moskowitz has had similar experience before, given that he served as the director of Emergency Management for Republican Gov. Ron DeSantis in Florida. He also helped lead the state's COVID response, with Florida being among those states particularly emphasizing freedom. \n\nAs a congressman, Moskowitz has also not been afraid to criticize the Biden-Harris administration for their failures on addressing antisemitism, specifically when it comes to a lack of a proper response from White House Press Secretary Karine Jean-Pierre. He also serves as one of the Democratic members on the task force investigating the assassination attempt against Trump on July 13, and became the first Democrat to join the House DOGE caucus. Bringing it back to COVID, Moskowitz was one of 11 Democrats who voted on February 1, 2023 in favor of a resolution to end the national emergency. \n\nAs POLITICO's Mia McCarthy shared, however, she asked the congressman last week if he would accept such a position, and he \"said he wasn't going to engage,\" though he also added he gave such a response because \"it's a nonpartisan job.\"\n\nI asked Moskowitz last week if he would accept FEMA director under Trump. He said he wasn't going to engage.Then he came back to me to tell me he only says that because it should stay a nonpartisan job: \"A Democrat shouldn't be ruled out for that job it's a nonpartisan job.\" https://t.co/WMo1Je9XcM— Mia Camille McCarthy (@Reporter_Mia) December 16, 2024\n\nThat being said, some unsavory accounts, like Occupy Democrats, are on board with such a pick, while some Republicans, including Robby Starbuck, are not so thrilled. This is especially as, since Starbuck pointed out, there's been speculation that Moskowitz may want to run for governor.\n\nMoskowitz first came to represent Florida's 23rd Congressional District after winning in 2022. He won reelection by less than 5 points last month, and there's also been chatter his seat may not be filled by another Democrat.\n\nNEWSCNN is reporting that Democratic Congressman Jared Moskowitz is a leading contender to become FEMA Director under Trump.Before becoming a member of Congress, Moskowitz served as the director of Florida’s Division of Emergency Management.If Moskowitz gets the job, the… pic.twitter.com/hz2ODwig2e— Yashar Ali 🐘 (@yashar) December 16, 2024\n\nFlorida is already dealing with numerous vacancies, including Republican Rep. Mike Waltz of Florida's 6th Congressional District, who will resign on January 20 to serve as Trump's national security advisor. Former Republican Rep. Matt Gaetz of Florida's 1st Congressional District, who had been nominated last month to serve as Trump's Attorney General before he withdrew, has already resigned. \n\nWhoever is selected for the role is almost certainly to be better than Deanne Criswell, the current director of FEMA, who was actually unanimously confirmed. Last month, she went before multiple House Committee hearings to answer for FEMA's horrific response to Hurricanes Helene and Milton.","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/16/jared-moskowitz-top-contender-for-fema-n2649130","image":"https://media.townhall.com/cdn/hodl/2023/313/49491901-e475-4f16-93a5-f088c02a43f3.jpg","video":null,"publish_date":"2024-12-17 00:36:22","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.289},{"id":273736618,"title":"SoftBank’s $100 Billion Promise To Trump Is More Than Its Entire Market Cap","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nSoftBank announced a $100 billion commitment to U.S. projects over the span of Trump's presidency.\nGetty Images\n\nOn Monday, SoftBank Group CEO Masayoshi Son and President-elect Donald Trump jointly announced a bold commitment: The Japanese tech conglomerate aims to invest $100 billion in U.S. projects over the next four years. It was a glitzy pledge from a global tech leader, teaming up with the incoming president with a promise to create at least 100,000 new American jobs in artificial intelligence and other emerging technologies.\n\nThe announcement eclipses a similar one Son made in 2016 as Trump first took office — a $50 billion pledge and 50,000 jobs. “President Trump is a double down president,” Son said during a press conference at Mar-a-Lago, Trump’s private residence in Palm Beach, Florida. “I’m going to have to double down.”\n\nThere’s just one hitch: SoftBank doesn’t actually have $100 billion at the moment. As of market close on Monday, its entire market cap was $97 billion, and it has $29 billion in cash on hand. It’s unclear how the company would finance its pledge and Son didn’t bother to detail how during its announcement.\n\nThe commitment is over the span of presidency, so SoftBank will have years to make good on its promise. The company did fulfill its 2016 vow of $50 billion, with investments in dozens of companies including Slack and DoorDash. It’s more difficult to determine if it created that number of jobs, and the company did not provide an estimate at the end of Trump’s last term.\n\nSoftBank didn’t respond to a request for comment.\n\nThe company’s most valuable asset is a majority stake in Arm Holdings, the British semiconductor company that went public last year. Arm’s market cap is currently $152.6 billion, with SoftBank’s roughly 90% stake valued at $137.3 billion. If liquidated, it would easily cover the company’s commitment. It’s unlikely, of course, that SoftBank would sell off its entire stake. Offloading large amounts of stock would probably cause the share price to crater. It could use its Arm stock as leverage to take out debt that would finance this commitment; but SoftBank has already taken out $8 billion in margin loans against its Arm stock.\n\nIn reaching into the Arm piggy bank, SoftBank doesn’t want to repeat missteps it took with Alibaba. In 2000, SoftBank invested $20 million in the Chinese ecommerce company, which went public in 2014 in the largest tech IPO ever, raising $25 billion. SoftBank reportedly owned 24% of the company at the time — a stake that dwindled to 7% in 2022, and down to half a percent by last May.\n\nSoftBank’s announcement comes as several tech executives have tried to curry favor with Trump as he returns to power. In the last few days, Facebook parent Meta, Amazon and OpenAI have reportedly promised to donate $1 million each to Trump’s inauguration fund. With key supporters like Tesla CEO Elon Musk and venture capitalist Marc Andreessen, Silicon Valley has struck a different tone from when Trump first took office four years ago. Meta’s Mark Zuckerberg recently made a visit to Mar-a-Lago, and Google CEO Sundar Pichai reportedly has a visit in the works.\n\nSoftBank is best known for its Vision Fund, a $100 million venture fund it announced in 2017 for investing in tech companies worldwide, with half the funds raised from the sovereign wealth funds of Middle East countries like Saudi Arabia and the United Arab Emirates. But the Vision Fund came to be known for misplaced bets, including the ill-fated coworking real estate company WeWork, and Softbank posted an $18 billion loss. In 2020, the activist investor Elliott Management bought a $2.5 billion stake in the Vision Fund and pushed for restructuring and more transparency. By the time Softbank set out to raise more money for a Vision Fund 2, the company had trouble courting investors because of the first fund’s issues.\n\nIn trying to hit the $100 billion mark, the company could potentially count already-announced commitments to its tally. For example, Softbank reportedly invested another $1.5 billion in OpenAI last month through an employee tender offer. In May, the Japanese company said it would commit $9 billion a year to AI investments, though it didn’t specify where it would make its bets.\n\nTrump, who described Son as “one of the most accomplished business leaders of our time,” didn’t seem worried about where the money would come from, and even pushed for more. “I’ve looked at their books and they do have the possibility of doing more,” Trump said Monday. “I’m going to ask them to do a little bit more.”\n\nHe then challenged Son to double his promise again to $200 billion. While remaining noncommittal, Son laughed and said he would “try to make it happen.” “He’s a great negotiator,” he said.\n\nAdditional reporting by Iain Martin.\n\nSend me a secure tip. \n\nRichard Nieva\n\nEditorial Standards\n\nForbes Accolades","summary":"The Japanese tech conglomerate has assets, like a majority stake in British chip company Arm, but hasn’t detailed how it will pony up.","url":"https://www.forbes.com/sites/richardnieva/2024/12/16/softbank-trump-masayoshi-son-100-billion/","image":"https://imageio.forbes.com/specials-images/imageserve/6760c51e01998259abe0d3c1/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-12-17 00:35:35","author":"Forbes Staff,Richard Nieva","authors":["Forbes Staff","Richard Nieva"],"language":"en","category":"politics","source_country":"US","sentiment":-0.4},{"id":273736480,"title":"Republican Issues Ultimatum to GOP House Leadership","text":"What's NewCongresswoman Victoria Spartz, an Indiana Republican, issued an ultimatum to her colleagues on Monday saying she will \"not sit on committees or participate in the caucus\" until she sees GOP leadership \"governing.\"Spartz continued in her post on X, formerly Twitter, \"I do not need to be involved in circuses. I would rather spend more of my time helping @DOGE and @RepThomasMassie to save our Republic, as was mandated by the American people.\"Why It MattersRepublicans have a razor-thin lead over Democrats in the House and any uncertainty could rock pivotal votes away from the GOP and House Speaker Mike Johnson in the upcoming session. Newsweek has reached out to Johnson's office via email and phone Monday night and Spartz's office via online form.Spartz also considered retiring this year but reversed course saying in part, \"The country is too much in trouble.\" Spartz is the first-born Ukrainian lawmaker in Congress and has been a critic of Ukrainian President Volodymyr Zelensky.What to KnowIn an earlier post on X, Spartz said that she supports the House Freedom Caucus and said she backs President-elect Donald Trump's reported immigration plan once in office.Spartz said, \"I fully support @freedomcaucus and @realDonaldTrump's team two-step approach. We need time to deliver on major fiscal policy reforms with proper offsets. I will NOT vote for a rushed slush fund some in @HouseGOP would like to push to appease the swamp. We were elected to govern!\"This is a developing story that will be updated with additional information.","summary":"Representative Spartz said on Monday she does not want to partake in circuses, she wants to see Republican leadership \"governing.\"","url":"https://www.newsweek.com/republican-issues-ultimatum-gop-house-leadership-2001809","image":"https://d.newsweek.com/en/full/2545699/victoria-spartz.jpg","video":null,"publish_date":"2024-12-17 00:35:17","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.191},{"id":273741762,"title":"Trump's Hush Money Conviction Upheld Amid Presidential Immunity Controversy — Alvin Bragg Says 'Overwhelming' Evidence Of Guilt","text":"A New York judge has confirmed the guilty verdict in the hush money case involving President-elect Donald Trump, despite ongoing discussions about presidential immunity.\n\nWhat Happened: Judge Juan Merchan endorsed the jury’s decision on Thursday, marking Trump as a felon. This ruling follows Trump’s recent electoral triumph over Vice President Kamala Harris. The judge has not yet made a decision on Trump’s request to dismiss the case entirely, given his president-elect status, reported The Hill.\n\nTrump’s legal team maintained that the evidence presented during his seven-week trial was shielded by the Supreme Court’s presidential immunity doctrine. This doctrine asserts that former presidents have total immunity from criminal prosecution for exercising core constitutional powers and presumptive immunity for other official acts.\n\nManhattan District Attorney Alvin Bragg refuted these claims, stating that no evidence presented to the jury was protected. He further contended that even if it was, it was inconsequential compared to the “overwhelming evidence of defendant’s guilt.”\n\nTrump was found guilty on 34 counts of falsifying business records related to a $130,000 hush money payment to adult film actress Stormy Daniels before the 2016 presidential election. Prosecutors portrayed this as an attempt to unlawfully influence the election’s outcome.\n\nThe judge’s decision on whether to halt the proceedings during Trump’s term is still pending. Meanwhile, Trump’s other criminal proceedings have not been as successful following his presidential win.\n\nSee Also: Trump Hits 7-Year High In Favorability Ratings: How Republicans, Democrats, Men And Women View President-Elect\n\nWhy It Matters: The Supreme Court had previously ruled that Trump and former presidents are entitled to immunity for acts within their Constitutional authority while in office, but not unofficial acts.\n\nTrump’s attempt to move his hush money criminal case to federal court was denied due to a lack of “good cause”, according to a previous report. The sentencing for Trump’s hush money trial was postponed until after the 2024 presidential election to avoid any potential influence on the election.\n\nImage via Shutterstock\n\nDid You Know?\n\nCongress Is Making Huge Investments. Get Tips On What They Bought And Sold Ahead Of The 2024 Election With Our Easy-to-Use Tool\n\nThis story was generated using Benzinga Neuro and edited by Shivdeep Dhaliwal\n\nMarket News and Data brought to you by Benzinga APIs\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","summary":"On Monday, Dec. 16, 2024. Judge Juan Merchan confirmed Trump's guilty verdict in hush money case despite ongoing presidential immunity debate.\n\n\nread more","url":"https://www.benzinga.com/24/12/42521426/trumps-hush-money-conviction-upheld-amid-presidential-immunity-controversy-alvin-bragg-says-overwhelming-evidence","image":"https://cdn.benzinga.com/files/images/story/2024/12/16/Trump-Proposes-Ending-Birthright-Citizen_0.jpeg?width=1200&height=800&fit=crop","video":null,"publish_date":"2024-12-17 00:32:46","author":"Shivdeep Dhaliwal","authors":["Shivdeep Dhaliwal"],"language":"en","category":"politics","source_country":"us","sentiment":-0.321},{"id":273735922,"title":"Letters: Film incentive | BART’s benefits | Pet sales | End Trump hate | No record","text":"Oakland must release\nfilm incentive funds\n\nWhen a film production receives $1 in financial incentives, it spends $13.66 in the local economy. Let that sink in. That’s a return on investment of more than 1,000%. In Oakland, we have an opportunity to transform a modest investment into a robust economic engine — and we’re hesitating.\n\nWhat if the path to economic recovery is not through backpedaling and austerity, but through targeted strategic investment?\n\nThe City Council unanimously approved an incentive July 16. Now, they need to release the money.\n\nThis film incentive helps Oakland do more with more. It costs less than $600,000 to implement, and there are already signed letters of intent worth tens of millions of dollars spent here … if they receive the incentive.\n\nThis kind of ROI is back-to-basics finance.\n\nPlease reach out to your council member and ask them to release the Film Incentive funds at their Tuesday meeting.\n\nBART benefits riders,\nnon-riders alike\n\nRe: “Don’t tap burdened taxpayers for BART” (Page A6, Dec. 13).\n\nIn his letter to the editor, George Mathews objects to “people who, for the most part, never use the system,” by which he means people who never ride BART, being taxed to pay for it.\n\nBut people around the Bay Area certainly use BART’s benefits when they drive to and from work or are otherwise on the roads. If all travelers drove cars instead of taking BART (or public transit generally) the roads would be far, far more congested than they are now. And they are congested.\n\nFurther, travel by car is subsidized by all, since gas taxes don’t cover the costs of road construction or maintenance. And hybrids and EVs don’t pay as much — or even any — gas taxes.\n\nBART is a public good that benefits all who live in the Bay Area.\n\nPeter Nicoll\n\nState should follow\nN.Y.’s lead on pet sales\n\nRe: “Bay Area pet lovers battle animal overpopulation” (Page B1, Dec. 15).\n\nIn response to the article on pet population, there is some good news out of New York, a new state law banning the sale of dogs, cats and rabbits by pet shops.\n\nThe law will also allow pet stores to charge shelters rent to use their space for adoptions. The new law also aims to stop abusive pet breeders.\n\nOthers should follow suit. Here in California, late February is the deadline for the introduction of new bills.\n\nCoordinator, Action for Animals\n\nKnee-jerk Trump\nhatred should stop now\n\nRe: “Person of the year poor example of president” (Page A8, Dec. 15).\n\nThe Time magazine person of the year is not an award of praise or commendation.\n\nThe title goes to “the person or persons who most affected the news and our lives, for good or ill, and embodied what was important about the year, for better or for worse,” as former Time Managing Editor Walter Isaacson wrote in the 1998 issue. Previous winners include Adolf Hitler (1938), Joseph Stalin (1939 and 1942), Ruhollah Khomeini (1979) and Vladimir Putin (2007) — hardly a list of do-gooders or positive influencers.\n\nI did not vote for Donald Trump, but 77 million of my fellow citizens thought he was the best choice for president at this time. And it is past time to tone down the rhetoric and the hatred.\n\nI have no problem that Steve Lake does not respect the man, but I believe we should all respect the vote and the office that Trump was elected to. I did not vote for him, but I now pray for his success.\n\nCraig Rieger\n\nHarris has little\nto take pride in\n\nRe: “Harris should take pride in her tireless work” (Page A8, Dec. 15).\n\nAlthough Kamala Harris had only 107 days to pitch her candidacy for president, she had some 1,353 days worth of tireless work behind her as the vice president. \n\nThe writer states that the Dec 10 article (“Harris fails to ignite Bay Area,” Page A1) did not acknowledge all that Harris did. The question is what did she do to make life better for Americans? \n\nWhen asked what her weakness is, Harris said her strength is her weakness. How is she strong if that is her weakness? What is one objective piece of information that supports her doing a good job whether as the vice president or in her campaign? She lost all battleground states.","summary":"East Bay Times Letters to the Editor for Dec. 17, 2024","url":"https://www.mercurynews.com/2024/12/16/letters-1968/","image":"https://www.mercurynews.com/wp-content/uploads/2021/11/EBT-L-CLOBASIN-1117-3.jpg?w=1024&h=687","video":null,"publish_date":"2024-12-17 00:30:49","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.051},{"id":273735236,"title":"Explained: How Trump Will Handle BRICS and India","text":"New Delhi (ABC Live): The United States President Elect Donald Trump all set to take charge of country in January 2025 and will run the most powerful country of world for next four years and this report analysis how Trump will keep his relations with BRICS and India during his tenure as president.\n\nThe Past track of Trump confirmed that US international relations will be guided by economic nationalism, trade protectionism, and a focus on bilateralism rather than multilateralism. His relationship with BRICS (Brazil, Russia, India, China, South Africa) and India will follow this pattern, although the context for each relationship differs based on geopolitical and economic factors. By examining economic data, trade statistics, and relevant case law, we can gain a clearer understanding of how Trump might approach these entities.\n\nTrump’s Approach to BRICS: Confrontation and Strategic Rivalry\n\nTrump’s foreign policy underpinned a strong pushback against multilateral organisations and alliances that were perceived as undermining U.S. power. BRICS, with its growing economic influence and its desire to challenge U.S. dominance, particularly in global finance and trade, presented a clear geopolitical and economic challenge for Trump’s administration.\n\nEconomic Competition and Protectionism\n\nBRICS nations, particularly China and Russia, are central to the bloc’s efforts to diminish reliance on the U.S. dollar and challenge the dominance of U.S.-led institutions like the World Bank and International Monetary Fund (IMF). These ambitions, combined with the creation of the New Development Bank (NDB) and a push for de-dollarisation, directly challenged Trump’s goals of maintaining global dominance in finance.\n\nCase Law and Precedents:\n\n1. Sanctions on Russia and China: Trump’s administration implemented a series of sanctions against Russia and China, both BRICS members. For example, the Countering America’s Adversaries Through Sanctions Act (CAATSA), signed into law in 2017, specifically targeted Russian defense and energy sectors. The Act imposed penalties on countries that engaged with Russian defense firms, a move that directly targeted India, which had continued military engagements with Russia. In 2018, India’s purchase of the S-400 missile defense system from Russia was met with U.S. sanctions under CAATSA, despite India being a long-standing strategic partner of the U.S.\n\nLegal Precedent: In 2018, India argued that CAATSA sanctions were unconstitutional as applied to their defense deals with Russia. However, the U.S. government maintained that the law applied universally, regardless of bilateral relations. India’s request for a waiver under CAATSA reflected its need to balance its historical ties with Russia against its growing defense and strategic partnership with the U.S. Although the U.S. did not grant a blanket waiver, the Trump administration showed flexibility in its enforcement of these sanctions, suggesting a transactional approach that would likely persist.\n\n2. Tariffs on China and Steel: Under Trump, the U.S.-China trade war escalated, with China being a primary target for tariffs. The Section 301 tariffs (worth approximately $370 billion) were imposed on Chinese goods, justifying these actions under U.S. national security and intellectual property theft concerns. BRICS particularly China, was affected by this. In response, China looked to increase its trade relations with other BRICS members, including India and Brazil, which reduced U.S. market share in some sectors.\n\nLegal Precedent: Under U.S. trade law, particularly the Trade Expansion Act of 1962 and the Section 301 of the Trade Act of 1974, the president may impose tariffs to protect U.S. interests. Trump’s “America First” policy allowed for unilateral tariffs as tools of economic coercion, bypassing multilateral trade rules such as those enshrined in the World Trade Organization (WTO). This approach aligns with Trump’s general stance against multilateralism, favoring bilateral trade negotiations instead.\n\nGeopolitical Tension: The Role of BRICS in Global Governance\n\nThe increasing geopolitical influence of BRICS under China and Russia is another point of conflict for the Trump administration. BRICS has consistently advocated for reforms in global governance institutions, particularly the UN Security Council and IMF, which are dominated by the U.S. and Western powers. The Trump administration, with its preference for America’s dominance, would resist these efforts, viewing them as a direct challenge to U.S. global leadership.\n\nCase Law: A notable example is China’s inclusion in the WTO. The U.S. Trade Representative (USTR) under Trump had long criticized China’s practices related to intellectual property and trade imbalances but had little recourse in enforcing these through the WTO after China's accession in 2001. In terms of international legal frameworks, the WTO Appellate Body and dispute settlement system were often used by the U.S. to enforce its trade rights. However, Trump withdrew the U.S. from many of these processes, preferring bilateral trade deals.\n\nTrump’s Approach to India: A Pragmatic and Transactional Relationship\n\nTrump's dealings with India are likely to be more complex, as India presents a unique combination of strategic importance, economic growth potential, and trade challenges. India’s rising economic profile and its strategic location in the Indo-Pacific make it a natural partner for the U.S., particularly in countering China. However, Trump’s economic nationalism and protectionist trade policies will complicate the bilateral relationship.\n\nStrategic Cooperation: U.S.-India Security and Defence Partnership\n\nIndia has become an increasingly important security partner for the U.S. in the Indo-Pacific. Trump’s administration focused on deepening military ties between the two countries, with significant arms sales and joint military exercises.\n\nCase Law: Trump’s administration supported the U.S.-India Defense Partnership, evidenced by agreements such as COMCASA (2018) and Lemoa (2016), which were designed to enhance military interoperability. The U.S.-India Civil Nuclear Agreement (2008), under President George W. Bush, stays a foundational element in U.S.-India relations, but Trump's desire to increase defence sales to India and the broader Indo-Pacific Strategy was critical during his tenure.\n\nIndia’s strategic importance became more pronounced as both countries looked to counterbalance China’s influence in the region, particularly in South Asia and the South China Sea. With both nations deeply concerned about China's Belt and Road Initiative (BRI), the Quad alliance (U.S.-India-Australia-Japan) became a cornerstone of the U.S.-India relationship under Trump. This was solidified through the 2019 India-U.S. Comprehensive Global Strategic Partnership, which focused heavily on defence, trade, and counterterrorism cooperation.\n\nTrade and Economic Friction\n\nDespite the shared geostrategic interests, Trump’s economic policies, particularly his “America First” doctrine, created friction between the U.S. and India, especially in trade.\n\n1. Tariffs on Indian Goods: Trump imposed tariffs on Indian steel (25%) and aluminum (10%) in 2018, citing national security concerns. India, which had a trade surplus with the U.S., was displeased, but Trump’s administration sought greater market access for U.S. companies in India. Additionally, India’s refusal to lower its tariffs on agricultural products like almonds, apples, and citrus continued to complicate bilateral trade discussions.\n\nData: India’s trade surplus with the U.S. stood at $30 billion in 2023, with goods like pharmaceuticals, information technology, and textiles being major exports. The U.S. had been pushing India to reduce trade barriers in these areas. While trade agreements were in the works, Trump's tariffs and other protectionist measures impacted India’s export-led growth.\n\nCase Law: India’s WTO challenges to U.S. tariffs, particularly concerning steel and aluminum, show the complex legal environment for trade disputes. In 2018, India challenged U.S. tariffs on steel at the WTO, arguing that these violated Article 21 of the General Agreement on Tariffs and Trade (GATT), which allows trade restrictions on national security grounds. However, under Trump’s administration, such challenges were sidelined in favor of unilateral tariff actions.\n\n2. Intellectual Property (IP) Issues: A significant issue between the U.S. and India under Trump was intellectual property rights. The U.S. Trade Representative repeatedly criticised India’s patent laws, especially related to pharmaceuticals and generic drug production. India’s Indian Patent Act (1970) allows for compulsory licensing, which was seen by the U.S. as a barrier to U.S. pharmaceutical companies.\n\nLegal Precedent: In 2014, the U.S. Chamber of Commerce filed a complaint with the World Trade Organization arguing that India’s patent laws were in violation of TRIPS (Trade-Related Aspects of Intellectual Property Rights). While India defended its IP policies, claiming they were in line with public health needs, Trump’s administration sought to increase pressure on India to adopt stricter IP protections, especially on biotech patents.\n\nDiplomatic Tensions: India’s Neutral Stance on Global Issues\n\nIndia’s continued engagement with Russia, particularly its purchase of S-400 missile systems and Russian oil, puts it at odds with U.S. sanctions and policies aimed at isolating Russia. Trump’s “America First” approach had no tolerance for nations that violated sanctions regimes. While India’s non-alignment policy and neutral stance on issues like the Russia-Ukraine conflict might have been a source of diplomatic tension, Trump’s pragmatism likely led him to focus on the strategic importance of India in the Indo-Pacific rather than diplomatic disagreements over Russia.\n\nConclusion: A Pragmatic but Contentious Relationship\n\nIn conclusion, Trump’s handling of BRICS and India is likely to be a combination of economic confrontation and strategic pragmatism. With BRICS, Trump will prioritize counteracting de-dollarization and undermining the bloc’s influence on global financial systems, particularly through sanctions, tariffs, and unilateral trade policies. On the other hand, with India, Trump will leverage bilateral defense cooperation and strategic partnerships while also pressuring India on trade issues such as tariffs and intellectual property. Given the complexities of India’s foreign policy, Trump will need to balance economic and geopolitical tensions with India’s strategic significance in the Indo-Pacific. The continued success of this relationship will largely depend on how Trump navigates the competing demands of economic protectionism and global security concerns in a rapidly changing geopolitical landscape.","url":"https://cms.abclive.in/home/news_description/2583/Explained-How-Trump-Will-Handle-BRICS-and-India","image":"https://cms.abclive.in/uploads/news_image/","video":null,"publish_date":"2024-12-17 00:26:22","author":null,"language":"en","source_country":"in","sentiment":0.458},{"id":273736640,"title":"Judge in Trump's hush money case denies bid to toss out guilty verdict","text":"The New York judge who presided over Donald Trump’s hush money trial denied the president-elect’s bid to vacate his guilty verdict on presidential immunity grounds. \"Defendant’s motion to dismiss the indictment and verdict is denied,\" Judge Juan Merchan wrote in a ruling Monday. He handed down the decision after also denying Trump's argument that he's already protected by presidential immunity because of his election win. \"This court does not agree,\" the judge wrote. Trump was convicted in May of 34 counts of falsifying business records related to a hush money payment his then-lawyer Michael Cohen paid to porn star Stormy Daniels in the closing days of the 2016 presidential election. Daniels claimed she had a sexual encounter with Trump in 2006, an allegation he’s denied. Trump's attorneys had argued the indictment and verdict should be thrown out in light of a Supreme Court ruling issued weeks later that expanded the scope of presidential immunity. Prosecutors from the Manhattan district attorney's office, they contended, should not have been allowed to present evidence of Trump's “official acts” to jurors, including public statements relating to the case. Prosecutors countered that evidence didn't impact the verdict, which they argued should be kept in place.","summary":"The New York judge who presided over Donald Trump’s hush money trial denied the president-elect’s bid to vacate his guilty verdict on presidential immunity grounds.","url":"https://www.nbcnews.com/politics/donald-trump/judge-trumps-hush-money-case-denies-bid-toss-guilty-verdict-rcna184434","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-05/240528-trump-ch-1054-640b1b.jpg","video":null,"publish_date":"2024-12-17 00:25:04","author":"Adam Reiss,Dareh Gregorian,Laura Jarrett","authors":["Adam Reiss","Dareh Gregorian","Laura Jarrett"],"language":"en","category":"politics","source_country":"us","sentiment":-0.66},{"id":273737666,"title":"Judge rejects Trump’s bid to dismiss hush money conviction because of Supreme Court immunity ruling - The Associated Press","text":"NEW YORK (AP) — A judge Monday rejected President-elect Donald Trump’s bid to have his hush money conviction dismissed because of the U.S. Supreme Court’s recent ruling on presidential immunity. But the case’s overall future remains unclear. \n\nManhattan Judge Juan M. Merchan’s decision eliminates one potential off-ramp from the case ahead of Trump’s return to office next month. His lawyers have raised other arguments for dismissal, however. \n\nProsecutors have said there should be some accommodation for his upcoming presidency, but they insist the conviction should stand. \n\nA jury convicted Trump in May of 34 counts of falsifying business records related to a $130,000 hush money payment to porn actor Stormy Daniels in 2016. Trump denies wrongdoing.\n\nThe allegations involved a scheme to hide the payout to Daniels during the final days of Trump’s 2016 presidential campaign to keep her from publicizing — and keep voters from hearing — her claim of a sexual encounter with the married then-businessman years earlier. He says nothing sexual happened between them. \n\nA month after the verdict, the Supreme Court ruled that ex-presidents can’t be prosecuted for official acts — things they did in the course of running the country — and that prosecutors can’t cite those actions to bolster a case centered on purely personal, unofficial conduct. \n\nTrump’s lawyers then cited the Supreme Court opinion to argue that the hush money jury got some improper evidence, such as Trump’s presidential financial disclosure form, testimony from some White House aides and social media posts made while he was in office.\n\nIn Monday’s ruling, Merchan denied the bulk of Trump’s claims that some of prosecutors’ evidence related to official acts and implicated immunity protections.\n\nThe judge said that even if he found that some evidence related to official conduct, he’d still find that prosecutors’ decision to use “these acts as evidence of the decidedly personal acts of falsifying business records poses no danger of intrusion on the authority and function of the Executive Branch.”\n\nEven if prosecutors had erroneously introduced evidence that could be challenged under an immunity claim, Merchan continued, “such error was harmless in light of the overwhelming evidence of guilt.”\n\nProsecutors had said the evidence in question was only “a sliver” of their case.\n\nTrump communications director Steven Cheung on Monday called Merchan’s decision a “direct violation of the Supreme Court’s decision on immunity, and other longstanding jurisprudence.”\n\n“This lawless case should have never been brought, and the Constitution demands that it be immediately dismissed,” Cheung said in a statement. \n\nThe Manhattan district attorney’s office, which prosecuted the case, declined to comment.\n\nTrump takes office Jan. 20.","summary":"Judge rejects Trump’s bid to dismiss hush money conviction because of Supreme Court immunity ruling  The Associated Press","url":"https://apnews.com/article/trump-hush-money-conviction-stormy-daniels-908465ed0b7f2005c72226b5b2546260","image":"https://dims.apnews.com/dims4/default/c89a6fb/2147483647/strip/true/crop/5186x2917+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2F2f%2F305ea669e17ca20d9638fb44da42%2F38871df356fe4eceba6c2dd3cb88250a","video":null,"publish_date":"2024-12-17 00:24:00","author":"Jake Offenhartz,Jennifer Peltz","authors":["Jake Offenhartz","Jennifer Peltz"],"language":"en","category":"politics","source_country":"us","sentiment":-0.035},{"id":273735428,"title":"Judge rejects Trump’s bid to dismiss hush money conviction because of Supreme Court immunity ruling","text":"NEW YORK (AP) — A judge Monday rejected President-elect Donald Trump’s bid to have his hush money conviction dismissed because of the U.S. Supreme Court’s recent ruling on presidential immunity. But the case’s overall future remains unclear.\n\nManhattan Judge Juan M. Merchan’s decision eliminates one potential off-ramp from the case ahead of Trump’s return to office next month, but his lawyers have raised other arguments for dismissal.\n\nProsecutors have said there should be some accommodation for his upcoming presidency, but they insist the conviction should stand.\n\nA jury convicted Trump in May of 34 counts of falsifying business records related to a $130,000 hush money payment to porn actor Stormy Daniels in 2016. Trump denies wrongdoing.\n\nThe allegations involved a scheme to hide a hush money payment to porn actor Stormy Daniels during the final days of Trump’s 2016 presidential campaign to silence her claims that they’d had sex years earlier, which he denies.\n\nA month after the verdict, the Supreme Court ruled that ex-presidents can’t be prosecuted for official acts — things they did in the course of running the country — and that prosecutors can’t cite those actions to bolster a case centered on purely personal, unofficial conduct.\n\nTrump’s lawyers cited the ruling to argue that the hush money jury got some improper evidence, such as Trump’s presidential financial disclosure form, testimony from some White House aides and social media posts made while he was in office.\n\nProsecutors disagreed and said the evidence in question was only “a sliver” of their case.\n\nTrump takes office Jan. 20.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"NEW YORK (AP) — A judge Monday rejected President-elect Donald Trump’s bid to have his hush money conviction dismissed because of the U.S. Supreme Court&#8217;s...","url":"https://wsvn.com/news/politics/judge-rejects-trumps-bid-to-dismiss-hush-money-conviction-because-of-supreme-court-immunity-ruling/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/05/240501-Trump-in-courtroom-1.png","video":null,"publish_date":"2024-12-17 00:22:52","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","category":"politics","source_country":"us","sentiment":-0.12},{"id":273736888,"title":"Judge rules Trump does not have presidential immunity protections in hush money conviction","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n The Best Gifts To Give Teachers Under $25\n\n The Best Gifts For 10-Year-Old Girls\n\n 15 Amazon Canada Stocking Stuffers Under $10 That Everyone Will Love\n\n The Best Couches For Small Spaces You Can Get In Canada\n\n Our Guide To The Best Soda Makers In Canada In 2024 (And Where To Get Them)\n\n The Good Stuff: Our Favourite Christmas Lights For 2024\n\n 28 Crowd-Pleasing Gifts For The Pickiest People On Your List\n\n 22 Tiny (And Wonderful) Gifts To Stuff Your Stockings With This Year\n\n The Best Gifts For People Who Are Cold All The Time \n\n 14 Hydrating Face Masks That’ll Save Your Skin This December\n\n 12 Budget-Friendly Products To Add To Your Winter Skincare Routine\n\n Our Guide To The Best Self Tanners You Can Get In Canada\n\n 16 Great Gifts You Can Get On Sale Right Now\n\n Don’t Walk, Run! These LEGO Kits Are On Sale And Ready To Gift\n\n Black Friday May Be Over, But You Can Still Take Advantage Of These Amazing Sales On Amazon Canada\n\n CTVNews.ca Top Stories\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n BREAKING | \n\n Feds deliver fall economic statement with $61.9B deficit for 2023-24, amid political turmoil\n\n Amid the news that Chrystia Freeland has resigned from her cabinet position as finance minister, the Department of Finance on Monday unveiled the long-anticipated fall economic statement, which reports a deficit of $61.9-billion for 2023-24.\n\n Finance Minister Chrystia Freeland quits cabinet, Trudeau taps LeBlanc to replace her\n\n In a stunning move, Deputy Prime Minister and Finance Minister Chrystia Freeland announced her resignation from Justin Trudeau's cabinet on Monday, after the prime minister told her he no longer wanted her in the top economic post. After hours of turmoil, Dominic LeBlanc, was sworn-in as her replacement in the finance portfolio.\n\n W5 Investigates \n\n W5 Investigates | \n\n Connecting the dots on a landlord scam: how clues revealed a prolific con artist at work\n\n In part one of a three-part investigation, W5 correspondent Jon Woodward reveals how a convicted con artist bilked dozens of people in a landlord scam.\n\n Wisconsin school shooter who killed teacher, student was 17-year-old female student, police say\n\n A teenage student opened fire Monday at a private Christian school in Wisconsin, killing a teacher and another teen during the final week before Christmas break. The shooter also died, police said.\n\n Canadian hero Terry Fox to appear on next $5 bill, officials announce\n\n The federal government is paying tribute to one of Canada's greatest heroes by adding Terry Fox to the next $5 bill.\n\n Travel risk: Which countries does Canada recommend avoiding?\n\n Canadians planning to travel abroad over the holidays should take precautionary steps to ensure they're not unintentionally putting themselves in harm's way.\n\n Canada Post operations to resume on Tuesday, company says\n\n Mail is set to begin moving again on Tuesday after a month-long strike by Canada Post employees comes to a close.\n\n Search continues for missing person in deadly B.C. landslide; local state of emergency declared\n\n The village of Lions Bay has declared a local state of emergency as the search continues for a missing person, after a house was swept away in a landslide on Saturday.\n\n Canadian hero Terry Fox to appear on next $5 bill, officials announce\n\n The federal government is paying tribute to one of Canada's greatest heroes by adding Terry Fox to the next $5 bill.\n\n B.C. man sentenced for 'execution-style' murder of bystander in drug trade conflict\n\n A B.C. man convicted of the \"intentional and ruthless killing of a bystander\" while acting as an enforcer in the drug trade has been sentenced for a second time in the slaying.\n\n Two dead, four in hospital including child after multi-vehicle crash in Moncton: first responders\n\n The New Brunswick RCMP says two people have died and four others are injured following a multi-vehicle crash in Moncton Sunday night.\n\n B.C. Supreme Court dismisses 'natural person' lawsuit against CRA, TD Bank\n\n A British Columbia man who describes himself as a \"natural person\" who is therefore exempt from paying income taxes has lost his attempt to sue his bank and the federal government for removing the funds from his account.\n\n Jury delivers guilty verdicts for accused in Montreal-area triple homicide trial\n\n The accused in a triple homicide trial south of Montreal has been found guilty.\n\n Search continues for missing person in deadly B.C. landslide; local state of emergency declared\n\n The village of Lions Bay has declared a local state of emergency as the search continues for a missing person, after a house was swept away in a landslide on Saturday.\n\n Wisconsin school shooter who killed teacher, student was 17-year-old female student, police say\n\n A teenage student opened fire Monday at a private Christian school in Wisconsin, killing a teacher and another teen during the final week before Christmas break. The shooter also died, police said.\n\n Judge rules Trump does not have presidential immunity protections in hush money conviction\n\n Judge Juan Merchan wrote Monday that Donald Trump's hush money conviction should not be dismissed because of the Supreme Court's presidential immunity decision, ruling that the evidence presented by the Manhattan district attorney's office was not related to Trump’s official actions as U.S. president.\n\n UN announces initiative to overcome political deadlock in Libya\n\n The top UN official in Libya announced a new initiative Monday to overcome a three-year deadlock and move the North African nation toward a national election.\n\n RFK Jr. meets with senators as questions swirl about Trump's pick to lead health agency\n\n Robert F. Kennedy Jr. swept onto Capitol Hill late Monday, as the anti-vaccine health guru from the famous political family reintroduced himself to senators, this time as President-elect Donald Trump's pick to lead the nation's Health and Human Services Department.\n\n The U.S. Census Bureau is adding refugees to its immigrant count\n\n The U.S. Census Bureau is changing how it counts immigrants in annual estimates by including more people who were admitted for humanitarian reasons.\n\n Palestinian security forces launch a rare crackdown on militants in the West Bank\n\n Palestinian security forces have launched a rare crackdown against local militant groups in the northern West Bank, sending in armored cars and engaging in fierce gunbattles that have killed at least two people in the volatile area.\n\n Liberal caucus meeting, as PM Trudeau faces fresh calls to resign in light of Freeland's departure\n\n The federal Liberal caucus has called an emergency Monday night caucus meeting, as Prime Minister Justin Trudeau is facing renewed calls from some members of his party to resign.\n\n Finance Minister Chrystia Freeland quits cabinet, Trudeau taps LeBlanc to replace her\n\n In a stunning move, Deputy Prime Minister and Finance Minister Chrystia Freeland announced her resignation from Justin Trudeau's cabinet on Monday, after the prime minister told her he no longer wanted her in the top economic post. After hours of turmoil, Dominic LeBlanc, was sworn-in as her replacement in the finance portfolio.\n\n BREAKING | \n\n Feds deliver fall economic statement with $61.9B deficit for 2023-24, amid political turmoil\n\n Amid the news that Chrystia Freeland has resigned from her cabinet position as finance minister, the Department of Finance on Monday unveiled the long-anticipated fall economic statement, which reports a deficit of $61.9-billion for 2023-24.\n\n Use positive reinforcement instead of threats for your child’s misbehaviour, experts say\n\n Experts warn that threats and bribes can backfire, encouraging further misbehaviour and causing stress for young kids, according to Dr. Michelle Janning.\n\n Here's why critics believe hundreds of medically assisted deaths shouldn't have happened\n\n Critics of medical assistance in dying (MAID) say there were more than 600 cases last year where they believe the program shouldn't have been an option at all.\n\n Routine prenatal test revealed her 'hidden cancer.' A study suggests what doctors should watch for\n\n What should have been one of the most joyous times of Dr. Naseem Khorram’s life turned into one of the most terrifying. The Los Angeles-based nephrologist was getting routine bloodwork during her second pregnancy. She was shocked when the test results came back.\n\n Attackers cannibalized victims of an Early Bronze Age community to dehumanize them\n\n Thousands of ancient butchered human bones found in a deep shaft in southwest England have pointed archaeologists to a grim chapter of British prehistory.\n\n Scientists warn of 'unprecedented' risks of research into mirror life\n\n A group of 38 scientists working in nine countries has sounded an alarm about the potential creation of mirror bacteria — synthetic organisms in which the molecular structure found in nature is reversed and could put humans, animals and plants at risk of exposure to dangerous pathogens.\n\n TikTok asks the Supreme Court for an emergency order to block a U.S. ban unless it's sold\n\n TikTok on Monday asked the Supreme Court to step in on an emergency basis to block the federal law that would ban the popular platform in the United States unless its China-based parent company agreed to sell it.\n\n Entertainment \n\n Jay-Z's lawyer says accuser's rape claim is 'provably, demonstrably false'\n\n An attorney defending Jay-Z against the rape allegation brought against him last week by an unnamed woman, outlined a range of evidence Monday that he said showed the accuser’s account to be “provably, demonstrably false.”\n\n Former TV host Carlos Watson gets nearly ten years in prison in case about failed startup Ozy Media\n\n Former talk show host Carlos Watson was sentenced Monday to nearly ten years in prison in the federal financial conspiracy Ozy Media case.\n\n Popeye and Tintin enter the public domain in 2025 along with novels from Faulkner and Hemingway\n\n The classic comic characters of Popeye and Tintin are among the intellectual properties becoming public domain in the United States on Jan. 1, 2025.\n\n Canada Post operations to resume on Tuesday, company says\n\n Mail is set to begin moving again on Tuesday after a month-long strike by Canada Post employees comes to a close.\n\n National home sales continue surging, prices rise amid falling interest rates: CREA\n\n The Canadian Real Estate Association says the number of homes sold in November rose 26 per cent compared with a year ago, marking the second straight month of large year-over-year gains.\n\n BlackBerry selling Cylance AI cybersecurity business to Artic Wolf\n\n BlackBerry Ltd. has signed a deal to sell its Cylance security business to Arctic Wolf.\n\n Lifestyle \n\n British pubs are worried they'll run out of Guinness\n\n At the Sheephaven Bay pub in London, tucked just behind Camden High Street, Guinness accounts for more than 50 per cent of draft beer sales.\n\n As tourists discover Finland's Santa Claus Village, some locals call for rules to control the masses\n\n Shuffling across icy ground on a cold December afternoon, lots of tourist groups poured into Santa Claus Village, a winter-themed amusement park in Finland.\n\n 'Tis the season for roasting chestnuts. But in the U.S., native ones are almost gone\n\n It's been a long time since vendors sold the American chestnut on city sidewalks. It's no longer the variety whose smell some people associate with Christmas.\n\n WNBA to hold first regular-season game outside the U.S. in Vancouver\n\n Vancouver will host the first WNBA regular-season game played outside the United States next year when the Atlanta Dream and the Seattle Storm face off at Rogers Arena.\n\n Making the grade: Canada unveils world junior roster featuring plenty of youth\n\n Canada's team for the upcoming world junior hockey championship is set. The country unveiled its 25-player roster Friday following the conclusion of a selection camp in Ottawa.\n\n Concern for mandatory neck guards after Churchbridge player faces near fatal accident\n\n Discussions around neck guards being mandatory for those on the ice have come to the forefront – after a senior hockey player in east-central Saskatchewan was involved in a near fatal accident.\n\n U.S. to require passenger vehicles to sound alarms if rear passengers don't fasten their seat belts\n\n Starting in September of 2027, all new passenger vehicles in the U.S. will have to sound a warning if rear-seat passengers don't buckle up.\n\n 'Baseball-sized hail': Toronto man owes car rental company $18K after hailstorm\n\n A Toronto man is on the hook for about $18,000 after a car he rented over the summer was pelted by baseball-sized hail.\n\n GM is pulling the plug on its robotaxi efforts\n\n General Motors is pulling the plug on its efforts to develop a fleet of driverless taxis and will focus on driver-assistance features that require a driver to be ready to take control of the car, the company said Tuesday.\n\n Local Spotlight \n\n Son of Ottawa firefighter battling cancer meets his hero Sidney Crosby\n\n The son of an Ottawa firefighter had the chance of a lifetime to meet one of hockey's greatest players.\n\n 'He was done with shopping': Video shows dog laying on horn in B.C. mall parking lot\n\n Malls can be hectic around the holidays, and sometimes you just can't wait to get home – whether you're on two legs or four.\n\n 140-pound dog strolls solo into Giant Tiger store in Stratford, Ont.\n\n A furry, four-legged shopper was spotted in the aisles of a Giant Tiger store in Stratford, Ont. on Sunday morning.\n\n North Pole post: N.S. firefighters collect letters to Santa, return them by hand during postal strike\n\n Fire departments across Nova Scotia are doing their part to ensure children’s letters to Santa make their way to the North Pole while Canada Post workers are on strike.\n\n 'Creatively incredible': Regina raised talent featured in 'Wicked' film\n\n A professional dancer from Saskatchewan was featured in the movie adaptation of Wicked, which has seen significant success at the box office.\n\n Montreal man retiring early after winning half of the $80 million Lotto-Max jackpot\n\n Factor worker Jean Lamontagne, 63, will retire earlier than planned after he won $40 million on Dec. 3 in the Lotto-Max draw.\n\n Man, 99, still at work 7 decades after opening eastern Ontario Christmas tree farm\n\n This weekend is one of the busiest of the year for Christmas tree farms all over the region as the holidays approach and people start looking for a fresh smell of pine in their homes.\n\n Saskatoon honours Bella Brave with birthday celebration\n\n It has been five months since Bella Thompson, widely known as Bella Brave to her millions of TikTok followers, passed away after a long battle with Hirschsprung’s disease and an auto-immune disorder.\n\n Major Manitoba fossil milestones highlight the potential for future discoveries in the province\n\n A trio of fossil finds through the years helped put Manitoba on the mosasaur map, and the milestone of those finds have all been marked in 2024.\n\n Vancouver \n\n Canadian hero Terry Fox to appear on next $5 bill, officials announce\n\n The federal government is paying tribute to one of Canada's greatest heroes by adding Terry Fox to the next $5 bill.\n\n Teachers, parents press B.C. NDP government on Surrey school concerns\n\n Teachers, parents and school support workers are pushing for more action – and more funding – from the NDP government when it comes to Surrey schools.\n\n LIVE @ 6 PT \n\n LIVE @ 6 PT | \n\n How to watch CTV News at Six on Monday\n\n With tonight’s CTV News at Six pre-empted, we are livestreaming a special online edition of our newscast anchored by Mi-Jung Lee.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n BREAKING | \n\n Feds deliver fall economic statement with $61.9B deficit for 2023-24, amid political turmoil\n\n Amid the news that Chrystia Freeland has resigned from her cabinet position as finance minister, the Department of Finance on Monday unveiled the long-anticipated fall economic statement, which reports a deficit of $61.9-billion for 2023-24.\n\n One seriously injured after shooting in Toronto\n\n One person has been seriously injured in a shooting on Monday night in Toronto's north end.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n 12-year-old boy hit by car, Calgary police urge public to step up\n\n Calgary police are urging witnesses to come forward after a young boy was hit by a car in the community of Belmont last week.\n\n Schools in Calgary, elsewhere receive threats; police investigating but believe there's no danger\n\n Multiple threats were made on Tuesday toward Calgary schools, as well as schools elsewhere. Police do not currently believe the threats were legitimate but continue to investigate their origin.\n\n Federal government reviving Kettle Island bridge idea with 'commitment' to new interprovincial crossing\n\n The federal government's fall economic statement says the government is announcing its commitment to building a new bridge over the Ottawa River to connect Ottawa and Gatineau, reviving a controversial proposal that faced major public backlash more than 10 years ago.\n\n Have a look inside Ottawa's new Trillium Line\n\n The countdown is on for the launch of the Ottawa's new north-south LRT line in the new year.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n Jury delivers guilty verdicts for accused in Montreal-area triple homicide trial\n\n The accused in a triple homicide trial south of Montreal has been found guilty.\n\n Montreal Liberal MP Anthony Housefather says Trudeau should resign\n\n Montreal MP Anthony Housefather has joined the number of Liberals who are calling on Prime Minister Justin Trudeau to step aside, saying Monday that he believes the party leader is \"past his shelf life.\"\n\n Trial for slain Montreal artist moving forward despite accused lacking a lawyer\n\n A Quebec Superior Court judge has decided to send a man accused of killing 24-year-old artist Romane Bonnier to trial in February even though the accused said he has not been able to find a lawyer more than three years after the alleged murder.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n Woman arrested after child abuse complaint on flight from Toronto to Edmonton: RCMP\n\n A woman was taken into custody after a possible case of child abuse was reported on a flight bound to Edmonton.\n\n Body found after suspicious fire south of Edmonton: RCMP\n\n The body of a man was found after a house fire in Wetaskiwin over the weekend.\n\n Two dead, four in hospital including child after multi-vehicle crash in Moncton: first responders\n\n The New Brunswick RCMP says two people have died and four others are injured following a multi-vehicle crash in Moncton Sunday night.\n\n Backhoe used to tear the front off Newfoundland bank, four facing charges: RCMP\n\n Four people in eastern Newfoundland are facing charges after a stolen backhoe was used to tear the front off the RBC bank in Holyrood.\n\n Several tents destroyed by fire at Halifax-area homeless encampment\n\n Fire destroyed several tents early in the morning at a Halifax-area encampment for homeless people.\n\n Manitoba deficit hits $1.3 billion\n\n Manitoba is projecting a higher than anticipated deficit for the year.\n\n Weather causing multiple highway closures in Manitoba\n\n Several highways in Manitoba, including one heading to the U.S. border, are closed due to winter weather.\n\n Manitoban thankful for being found after significant early morning crash in October\n\n A Manitoba man still can't believe he was found after being in an early morning crash on a rural Manitoba road at the end of October that left him with significant injuries to both legs.\n\n 'A huge honour': Sask. product headed to roller derby world juniors\n\n Estevan's Cecilia McCaskill has been selected to represent Canada at the highest level of roller derby.\n\n 'A community by choice': Al Ritchie Community Association seeking donations\n\n For many outreach groups, winter can be a particularly difficult season when it comes to keeping up with the demand. It’s a challenge the Al Ritchie Community Association is facing – as it works to keep the community warm and fed during the colder months.\n\n Regina man faces negligence charge in connection to August dog attack\n\n The Regina Police Service (RPS) have charged a suspect in connection to a dog attack that seriously injured a woman back in August.\n\n Kitchener \n\n Finance Minister Chrystia Freeland quits cabinet, Trudeau taps LeBlanc to replace her\n\n In a stunning move, Deputy Prime Minister and Finance Minister Chrystia Freeland announced her resignation from Justin Trudeau's cabinet on Monday, after the prime minister told her he no longer wanted her in the top economic post. After hours of turmoil, Dominic LeBlanc, was sworn-in as her replacement in the finance portfolio.\n\n Mistrial declared in first sexual assault trial of former Woodstock Mayor Trevor Birtch\n\n Inadequate disclosure of evidence by the Crown impacted the ability of 49-year-old former Woodstock Mayor Trevor Birtch to mount a full defense against charges of assault and sexual assault during his first trial earlier this year.\n\n Police searching for missing 13-year-old last seen in Uptown Waterloo last week\n\n Waterloo Regional Police are looking for a teen missing since late last week.\n\n Saskatoon \n\n Saskatoon police say drug decriminalization 'alone is not sufficient'\n\n The Saskatoon Police Service is reaffirming its commitment to approach drug use as a public health issue in a report to the police board this week — but not without reservation.\n\n Sask. government says it has no plans to relocate Fairhaven shelter\n\n The provincial government says there are no plans to relocate the Saskatoon Tribal Council's Emergency Wellness Centre, despite calls from a city councillor to move the facility.\n\n An 89-year-old man reported missing last week has been found dead, the RCMP says\n\n An 89-year-old Saskatchewan man missing since Dec. 11 has been found dead.\n\n Northern Ontario \n\n Security cam footage shows puppies being abandoned in Sudbury\n\n Security cam footage shows five puppies being abandoned in Copper Cliff in Sudbury last week.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n Attack on Sault snow plow driver escalates from a shovel to a firearm\n\n One person is in custody following a violent attack on a snow plow driver last week in Sault Ste. Marie.\n\n London postal workers express disappointment, will return to work this week\n\n Federal Labour Minister Steven MacKinnon's decision to intervene and force an end to the Canada Post strike means mail and parcel service across Canada will resume this week.\n\n Collision on Longwoods Road sends one person to hospital with serious injuries\n\n According to police, one person has been taken to hospital with serious injuries as the result of a collision west of Lambeth.\n\n Staff and students get a sneak preview of London's newest elementary school\n\n The $22.3 million, 507-student school is located in northwest London, near Hyde Park Road and Sunningdale Road and boasts some subtle quality of life improvements for students and staff.\n\n Pickup truck driver killed in head-on crash with dump truck: OPP\n\n One person has died in a collision involving a dump truck south of Beaverton Monday afternoon.\n\n New details emerge in police-involved shooting at Innisfil, Ont. home\n\n New details have emerged following a police-involved shooting at an Innisfil residence in August that left one young man dead and another facing serious charges.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n After a string of fatal collisions in Windsor, how are other cities tackling road safety?\n\n The president of the Ontario Safety League is urging Windsor to speed up the adoption of road safety measures used in other municipalities following a string of fatal collisions across the city in recent weeks.\n\n Essex County girls spreading Christmas spirit\n\n Megan Rose Patrick visited Windsor Regional Hospital's Met Campus this afternoon to drop off pajamas for those spending Christmas in hospital.\n\n LIVE UPDATES \n\n LIVE UPDATES | \n\n Trudeau to appear at Liberal fundraiser tonight\n\n Chrystia Freeland, Canada's finance minister, said in an explosive letter published Monday morning that she will quit cabinet. Follow along for live updates.\n\n Vancouver Island \n\n Fish farm company says 'human error' caused 8,000-litre fuel spill off B.C. coast\n\n Cleanup efforts are underway after up to 8,000 litres of diesel fuel spilled into the water at a salmon farm on northwestern Vancouver Island.\n\n Rainstorm to soak B.C.'s South Coast Tuesday, forecaster says\n\n Heavy rain is in store for parts of B.C.’s South Coast starting Tuesday afternoon, Environment Canada says.\n\n B.C. man sentenced for 'execution-style' murder of bystander in drug trade conflict\n\n A B.C. man convicted of the \"intentional and ruthless killing of a bystander\" while acting as an enforcer in the drug trade has been sentenced for a second time in the slaying.\n\n B.C. man sentenced for 'execution-style' murder of bystander in drug trade conflict\n\n A B.C. man convicted of the \"intentional and ruthless killing of a bystander\" while acting as an enforcer in the drug trade has been sentenced for a second time in the slaying.\n\n Paramedic threatened at knifepoint inside Kelowna ambulance station, union says\n\n The union representing ambulance paramedics in B.C. is calling on the province to beef up security after they say a knife-wielding woman attacked a worker.\n\n Car stolen, fleeing suspect found hiding in basement in Kelowna, B.C.\n\n Mounties have arrested a suspect who allegedly stole a car in Kelowna, B.C., before fleeing on foot and hiding from police in the basement of a home.\n\n Lethbridge \n\n Lethbridge residents react to Canada Post operations resuming\n\n Lethbridge residents will see mail begin moving again, now that Canadian postal workers are heading back to work.\n\n Province provides $150K to help fund programs for newcomer youth\n\n Brooks, Alta., officials with the John Ware Youth Empowerment Program are hoping gto help even more young newcomers thanks to a $150,000 grant from the province.\n\n Hitmen's Howe, Hurricanes' Yager make Team Canada world junior roster\n\n Team Canada announced its 2025 IIHF World Junior Hockey Championship roster on Friday, including three players on southern Alberta WHL teams. Tanner Howe, of the Calgary Hitmen, Brayden Yager, of the Lethbridge Hurricanes, and Gavin McKenna, of the Medicine Hat Tigers, were among the 14 forwards that will be donning the maple leaf later this month.\n\n Sault Ste. Marie \n\n Sault bookkeeper charged with stealing $559K from employer\n\n A 50-year-old who managed the finances for a business in Sault Ste. Marie has been charged with embezzling $559,701.63 from the business in just more than four years.\n\n Apartment fire in Elliot Lake, Ont., caused $6M in damage\n\n A massive apartment fire in Elliot Lake last week caused $6 million in damage, fire officials said Monday.\n\n Attack on Sault snow plow driver escalates from a shovel to a firearm\n\n One person is in custody following a violent attack on a snow plow driver last week in Sault Ste. Marie.\n\n Backhoe used to tear the front off Newfoundland bank, four facing charges: RCMP\n\n Four people in eastern Newfoundland are facing charges after a stolen backhoe was used to tear the front off the RBC bank in Holyrood.\n\n 'Breaking of gridlock' between Quebec, N.L. is the envy of former premiers\n\n Former Newfoundland and Labrador premiers say a draft energy agreement signed Thursday with Quebec marks a historic break in a long-standing political standoff.\n\n Quebec, Newfoundland and Labrador announce energy deal worth billions\n\n Quebec and Newfoundland and Labrador have signed a sweeping new deal to build new energy projects and throw out a decades-old contract that has long been a source of strife and bitterness for Canada's easternmost province.\n\n Stay Connected","summary":"Judge Juan Merchan wrote Monday that Donald Trump's hush money conviction should not be dismissed because of the Supreme Court's presidential immunity decision, ruling that the evidence presented by the Manhattan district attorney's office was not related to Trump’s official actions as U.S. president.","url":"https://www.ctvnews.ca/world/judge-rules-trump-does-not-have-presidential-immunity-protections-in-hush-money-conviction-1.7147798","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/16/donald-trump-immunity-conviction-ruling-1-7147799-1734394680498.jpg","video":null,"publish_date":"2024-12-17 00:22:32","author":"CNN,Kara Scannell, Jeremy Herb And Lauren Del Valle","authors":["CNN","Kara Scannell, Jeremy Herb And Lauren Del Valle"],"language":"en","category":"politics","source_country":"CA","sentiment":0.476},{"id":273735090,"title":"Judge rejects Trump’s bid to dismiss hush money conviction because of Supreme Court immunity ruling","text":"NEW YORK (AP) — A judge Monday rejected President-elect Donald Trump’s bid to have his hush money conviction dismissed because of the U.S. Supreme Court’s recent ruling on presidential immunity. But the case’s overall future remains unclear.\n\nProsecutors have said there should be some accommodation for his upcoming presidency, but they insist the conviction should stand.\n\nA jury convicted Trump in May of 34 counts of falsifying business records related to a $130,000 hush money payment to porn actor Stormy Daniels in 2016. Trump denies wrongdoing.\n\nThe allegations involved a scheme to hide a hush money payment to porn actor Stormy Daniels during the final days of Trump’s 2016 presidential campaign to silence her claims that they’d had sex years earlier, which he denies.\n\nA month after the verdict, the Supreme Court ruled that ex-presidents can’t be prosecuted for official acts — things they did in the course of running the country — and that prosecutors can’t cite those actions to bolster a case centered on purely personal, unofficial conduct.\n\nTrump’s lawyers cited the ruling to argue that the hush money jury got some improper evidence, such as Trump’s presidential financial disclosure form, testimony from some White House aides and social media posts made while he was in office.\n\nProsecutors disagreed and said the evidence in question was only “a sliver” of their case.\n\nTrump takes office Jan. 20.","summary":"Manhattan Judge Juan M. Merchan’s decision eliminates one potential off-ramp from the case ahead of Trump’s return to office next month, but his lawyers have raised other arguments for dismissal.","url":"https://www.mercurynews.com/2024/12/16/judge-hush-money-conviction/","image":"https://www.mercurynews.com/wp-content/uploads/2024/12/Trump_Hush_Money_57687_2de74c.jpg?w=1024&h=682","video":null,"publish_date":"2024-12-17 00:20:33","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.067}]}