{"offset":0,"number":50,"available":10973,"news":[{"id":252557020,"title":"Biden decides to ‘pass the torch to new generation’ as he outlines plan to finish out term in first address since dropping out","text":"WASHINGTON — President Biden addressed the nation Wednesday night about his unprecedented decision to abruptly end his campaign — as he insists he will remain president through January despite broad concern about his mental acuity. “I revere this office, but I love my country more,” the 81-year-old president said. “It’s been the honor of my life to serve as your president, but the defense of democracy – which is at stake – I think is more important than any title.” The president – who has been largely out of the public’s eye since dropping from the race on Sunday, said he did so to “unite” the Democrats, which had become divided over Biden’s apparent mental decline and electability against Republican nominee former President Donald Trump in November. “When you elected me in this office, I promised to always level with you, to tell you the truth,” said Biden, who on Sunday endorsed Vice President Kamala Harris to replace him atop the Democratic ticket. “In recent weeks, it’s become clear to me I need to unite my party … but nothing can come in the way of saving our democracy – and that includes personal ambition.” “So I’ve decided the best way forward is to pass the torch to a new generation,” Biden went on. “That’s the best way to unite our nation. You know, there is a time and a place for long years of experience in public life. There’s also a time and a place for new voices, fresh voices —yes, younger voices. And that time of place is now.” Biden ran down a list of lame-duck priorities, including “speaking out to protect our kids from gun violence, our planet from climate crisis.” “I’m going to call for Supreme Court reform because this is critical to our democracy, Supreme Court reform,” he said. “You know, I will keep working to ensure America remains strong, secure and the leader of the free world.”","summary":"Biden insists he will remain president through January despite broad concern about his mental acuity.","url":"https://nypost.com/2024/07/24/us-news/biden-decides-to-pass-the-torch-to-new-generation-as-he-outlines-plan-to-finish-out-term-in-first-address-since-dropping-out/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/Untitled-1_f67cb8.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-07-25 00:07:50","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","source_country":"us","sentiment":0.205},{"id":252556976,"title":"Joe Biden to Explain Decision to Hand Over Leadership to Younger Generation","text":"Joe Biden will say the “best way forward is to pass the torch to a new generation” in the US president’s first public remarks since he announced he would not seek a second term in office. In a speech to the nation on Wednesday evening, Biden will say: “The defence of democracy is more important than any title. I draw strength, and find joy, in working for the American people,” according to prepared remarks shared by the White House. “But this sacred task of perfecting our union is not about me,” the president will add. “It’s about you.” The rare public address from the Oval Office, coming with just over 100 days to go until November’s presidential election, will be Biden’s first appearance since he announced at the weekend that he was suspending his re-election campaign and endorsing vice-president Kamala Harris to run in his place. Biden has avoided the public eye since he was diagnosed last week with Covid-19 and went to recover at his Delaware holiday home. He returned to the White House on Tuesday but held no public events until his address. The president will make clear that while he was not seeking re-election, he intended to serve out the remainder of his term. “Over the next six months I will be focused on doing my job as president,” Biden will say. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights — from the right to vote — to the right to choose.” “The great thing about America is here, kings and dictators do not rule. The people do,” he will add. “History is in your hands. The power is in your hands. The idea of America — lies in your hands.” Biden will face several foreign policy challenges in his final months in office. He is set to hold a high-stakes meeting at the White House on Thursday with Israeli Prime Minister Benjamin Netanyahu. The Biden administration is pressing to get a Gaza ceasefire deal over the line in what would be a significant foreign policy achievement that would burnish the president’s legacy. Biden’s decision not to run for re-election marks the beginning of the end of a storied career in Washington that has spanned more than half a century. First elected to the US Senate in 1972, he spent more than three decades in the upper chamber of Congress before serving two terms as Barack Obama’s vice-president, from 2009 to 2017. Biden’s departure from the presidential race means Harris is set to face off against Donald Trump at the ballot box. National opinion polls suggest a tight race, with Trump having a slight edge with just over three months to go until election day. Additional reporting by Felicia Schwartz and Steff Chávez in Washington","summary":"Internewscast Journal\n\nInternewscast\n\n\nUnlock the US Election Countdown newsletter for free Joe Biden will say&#8230;\n\n\nThis Post: Joe Biden to Explain Decision to Hand Over Leadership to Younger Generation first appeared on Internewscast Journal","url":"https://internewscast.com/business/joe-biden-to-explain-decision-to-hand-over-leadership-to-younger-generation/","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__origami%2Fservice%2Fimage%2Fv2%2Fimages%2Fraw%2Fhttps%253A%252F%252Fd1e00ek4ebabms.cloudfront.net%252Fproduction%252F4c69afbf-8615-415d-935e-d1c8378d430d.jpg%3Fsource%3D","video":null,"publish_date":"2024-07-25 00:05:48","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.011},{"id":252556980,"title":"Before attacking former President Trump, the shooter looked up information about JFK’s assassination.","text":"JACKSONVILLE, Fla. – The man who shot former President Donald Trump researched details of Lee Harvey Oswald and the JFK assassination before opening fire on Trump at a Pennsylvania rally. This revelation came to light today during a congressional hearing where FBI Director Christopher Wray provided new details about the assassination attempt. Wray revealed that the shooter, Thomas Crooks, had early access to the rally site before Trump took the stage. Newly released video shows the rooftop where Thomas Crooks attempted to assassinate Trump. An unidentified agent can be heard on body camera video. “I believe the sniper that was seen in pictures was inside that building there, so that’s the sniper who sent the original pictures, he’s the guy who saw him near the bike.” an agent said. In the video, law enforcement discusses spotting Crooks before losing sight of him. “Detain those guys, find out what they know. I’m trying to get good information,” an agent said. Wray testified before a congressional committee today that Crooks fired 8 shots within five seconds from his father’s AR-15 rifle. He also said that two hours before the rally, Crooks launched a drone to conduct surveillance of the rally site, approximately 200 yards from the stage. “We have discovered a drone that the shooter used, and it’s being analyzed by the FBI lab,” Wray said. “We think he was livestreaming the event, two hours before the event, yes.” Investigators noted the drone was in the air for approximately 11 minutes, with Crooks watching the live stream on his phone. Wray also revealed that Crooks was prepared for more damage with explosive devices. “We’ve discovered three devices (explosive), two in his vehicle and one at his residence,” Wray said. A search of Crooks’ digital devices showed he researched news stories and images of several prominent political figures, including Trump and President Joe Biden. Wray cautioned that the motive behind the attempted assassination is still not fully understood. News4JAX also spoke with Scott Erickson who is the Director of the Center for Law and Justice at the America First Policy Institute. Erickson has more than 20 years of experience in both state and federal law enforcement. “The Secret Service has a no-fail mission, which means they can’t fail,” Erickson said. “There are no exceptions to that. Clearly, there was a failure, and it was quite catastrophic. If you don’t have sufficient resources, and you know there are gaps, you shouldn’t move forward with the event, or you need to take necessary steps to secure that before proceeding.” Erickson expressed confidence that federal investigators will determine the reasons behind the security failures. Wray also mentioned an Iranian plot to assassinate former President Trump, warning that law enforcement agencies might see more brazen attacks from Iran in the future.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJACKSONVILLE, Fla. – The man who shot former President Donald Trump researched&#8230;\n\n\nThis Post: Before attacking former President Trump, the shooter looked up information about JFK&#8217;s assassination. first appeared on Internewscast Journal","url":"https://internewscast.com/news/before-attacking-former-president-trump-the-shooter-looked-up-information-about-jfks-assassination/","image":"https://www.news4jax.com/resizer/v2/TR7ZCQ747BABDNYJQEXGBGX3M4.jpg?auth=82bf5ee89e06253f287fcdd28619dd65769136ded17b9e46e667cccb133ab2d1","video":null,"publish_date":"2024-07-25 00:03:53","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.313},{"id":252556726,"title":"I ran in Democratic primaries for 25 years — the Kamala Harris coronation is a betrayal","text":"In 1968, I ran as a Democrat in my first primary election, as I sought to become a New York state Assemblyman. I fought four more tough primary races against fellow Democrats David Dinkins and Robert Wagner Jr. as we vied to become Manhattan borough president, and yet another in 1985 against Ken Lipper to become City Council president. In every primary I had to work my butt off to prove myself to my party and my constituents. Those races made me a better public servant and a better man. That’s what the democratic process is for — and what the Democratic Party is all about: testing our candidates through primary contests and giving our voters a voice. This is not happening with Kamala Harris. And it’s one of the reasons the Democratic Party will lose to Donald Trump in November. If they actually wanted to live up to their name, Democratic leaders would insist on an open convention where delegates could freely select a presidential nominee in Joe Biden’s place. Instead, Harris is getting a free ride from the media and from many in her party: Those who failed to pass Biden off as competent are now highly motivated to try to position Harris as someone who’s qualified to be president. The anti-Trump press is ready to deify her, Hollywood donors are poised to fill her coffers, and the left is going all out to maintain their power. Only one problem: Harris is utterly unqualified for the job. Harris was one of the worst vice presidents in history, an abject failure at virtually every task except for casting tie-breaker voters for big spending bills that caused the inflation we’re all suffering through. Her first assignment was to fix the border, but she never did. Instead, she fixed it for the left — letting millions of unauthorized immigrants pour into this country and then backing free healthcare for them all. She has no foreign-policy experience, with a background as a California “prosecutor” and less than a full term in the US Senate. She has not been tested on the national stage in any serious way and got zero votes as a failed presidential candidate. She is turning her back on our democratic ally Israel, even as it faces attacks on three sides from Iranian proxies who are holding Americans hostage. Her stance only gives comfort to Hamas and signals the continuation of weak-kneed pro-Iran policies. This week, in her first speech as a 2024 candidate, she promised massive new spending programs. As a senator, she backed the full $10 trillion Green New Deal. So a vote for Harris is a vote for spending that could kick off another round of inflation, continued open borders costing us billions, higher energy prices and electric vehicle mandates. There isn’t a left-wing idea out there that Harris has not supported, from the transgender agenda to banning private health insurance altogether. Her idea of freedom is joining a union, not fostering American individualism and innovation. Her idea of the future is expanded government handouts for virtually everything. Despite Harris’ trademark cackle, her election would be no laughing matter. All of the flaws and mistakes of the Biden-Harris administration will be magnified if the veep makes it to the Oval Office. She is nothing but the Great Pretender, the sequel. Donald Trump has had to survive false accusations of racism, fines meant to bankrupt him, partisan lawsuits in an attempt to jail him, an assassin’s bullet — and now even a second presidential opponent, after demolishing his first one. Don’t be fooled by all the Harris hype: She is nothing but a new mask for the left, a failed vice president who in nearly four years on the job never did anything to distinguish herself. As an elected Democratic official for 25 years, I could not in good conscience vote for Kamala Harris. I would have to vote for Donald Trump. Andrew Stein, a Democrat, served as New York City Council president,1986-94.","summary":"The Democratic Party is all about testing candidates through primary contests and giving voters a voice, but Kamala Harris is doing an end-run around those principles.","url":"https://nypost.com/2024/07/24/opinion/the-kamala-harris-coronation-betrays-democrats-values/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/07/newspress-collage-b64m8t6zb-1721861517726.jpg?quality=75&strip=all&1721847237&w=1200","video":"https://cdn.jwplayer.com/videos/Po2IN1dl-RyIcpnTz.mp4","publish_date":"2024-07-25 00:00:10","author":"Andrew Stein","authors":["Andrew Stein"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.267},{"id":252556964,"title":"Katie Ledecky speaks out on China swimming doping scandal, hopes for 'clean' Olympics","text":"Twenty-three Chinese swimmers were given the OK to compete in the Tokyo Olympics in 2021 despite testing positive for trimetazidine, a banned substance used as a heart medication. However, the World Anti-Doping Agency said the swimmers' tests had come up positive due to \"inadvertently being exposed to the substance through contamination,\" a claim initially brought by the Chinese Doping Agency. With the Paris Games' opening ceremony later this week, it's the first Olympics since the scandal, and decorated United States swimmer Katie Ledecky is skeptical. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"I hope everyone here is going to be competing clean this week. But what really matters also is, were they training clean?\" Ledecky said Wednesday. \"Hopefully, that's been the case. Hopefully, there's been even testing around the world.\" There is an ongoing U.S. investigation of the suspected doping by the Chinese swimmers, drawing the ire of the International Olympic Committee. While awarding the 2034 Winter Olympics to Salt Lake City Wednesday, the IOC pushed Utah officials to do what they can to stop the FBI probe. \"I think everyone's heard what the athletes think. They want transparency. They want further answers to the questions that still remain. At this point, we're here to race. We're going to race whoever's in the lanes next to us. We're not the ones paid to do the testing, so we hope that the people that are follow their own rules. That applies now and into the future.\" The WADA said there had been \"misleading information\" spreading in the news, which led to its response. It said it had been given a tip by the U.S. Anti-Doping Agency as early as 2020 — before this case arose — about allegations of doping cover-ups in China but that USADA never followed up with evidence. GOD 'STEPPED IN AND SAVED' DONALD TRUMP FROM ASSASSINATION, JAKE PAUL SAYS However, the WADA says it \"reviewed this case thoroughly\" and \"concluded that there was no concrete basis to challenge the asserted contamination.\" The agency says it \"followed all due process and diligently investigated every lead and line of inquiry in this matter.\" The 30-member Chinese swim team won six medals in Tokyo, including three golds. Many of the athletes still compete for China and are expected to swim at the Paris Olympics. CLICK HERE TO GET THE FOX NEWS APP Ledecky is a seven-time gold medalist who will be competing in her fourth Olympic Games. The Associated Press contributed to this report. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"After a doping scandal rocked the swimming world recently, United States gold medalist Katie Ledecky is hoping for fair competition in Paris.","url":"https://www.foxnews.com/sports/katie-ledecky-speaks-out-china-swimming-doping-scandal-hopes-clean-olympics","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Katie-Ledecky2.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-24 23:56:44","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","source_country":"US","sentiment":-0.169},{"id":252556758,"title":"'Keep on cutting': Legal expert skewers Fox News over latest 'grievance'","text":"Former president and CEO of the Leadership Conference on Civil and Human Rights and legal analyst Maya Wiley on Wednesday issued a scathing rebuke of Fox News' and Republicans' latest criticism of Vice President Kamala Harris. Referring to Donald Trump's, his allies' and right-wing media's recent attacks specifically on Harris' race and gender, MSNBC's Nicolle Wallace pointed to a video clip from an Asian American Pacific Islander event the vice president attended in Washington, DC earlier this year, in which she directly addressed those kinds of attacks. \"Here’s the thing about breaking barriers,\" Harris said during her speech. \"Breaking barriers does not mean you start on one side of the barrier, and you end up on the other side. There’s breaking involved, and when you break things, you get cut, and you may bleed, and it is worth it every time. To especially the young people here, I say to you, when you walk in those rooms, being the only one that looks like you, the only one with your background, you walk in those rooms, chin up, shoulders back, be it a meeting room, a boardroom, a courtroom, a hearing room, you walk in those rooms, knowing that we are all in that room with you, applauding you on and expecting certain things from you, including that you will not be silent in those rooms.\" READ MORE: 'Intellectually bottom of the barrel': GOP ignores Johnson’s plea as reps attack 'DEI hire' Harris Quoting her mother’s advice, the VP emphasized, \"We have to know that sometimes people will open the door for you and leave it open, sometimes they won't. And then you need to kick that f---ing door down.\" Referencing Harris' words, Wiley told Wallace, \"We have been cut. We lived that cut as students at Ivy League schools. We lived that cut when we were lawyers standing in front of a judge the said, 'Where's the lawyer?' when you're standing there behind the government table as an assistant United States attorney. We know that cut. I was the only Black attorney in the civil division when I was there. The only one out of 50.\" The former New York City mayoral candidate continued, \"They have been telling us — and I'm talking about a certain group of people — a certain group of people who are victimized by fairness, who are victimized by competition from the competent. And who are upset because they have for so long gotten to be mediocre and rise. Those of us who had to be better than mediocre to get cut are so many. They just attacked Kamala Harris for being in a Black sorority. So I wore my Delta Sigma Theta colors. Joy Reid might wear hers later. The Divine Nine has 4 million Black votes. When you saw that $81 million in 24 hours, that was over 44,000 black women, many of them [a part of] the Divine Nine.\" \"Their fog horn is what is reminding folks that we are not in the America yet that lives up to its ideals,\" Wiley added. \"We haven't been. But we made real progress. And when they are showing us who they are, when they're calling us 'colored' — Fox News — they're talking about colored, [former Trump deputy assistant] Sebastian Gorka called her 'colored'. That's language that nobody uses anymore. And it's not a dog whistle. It's saying we're going to go back to when you were in the back of the bus. And we're going to tell you we're going to put government resources to ensuring that white men get protected.\" READ MORE: GOP congressman steps up attacks — including one McCarthy warned against Wiley emphasized, \"Well, to the extent that there's a grievance, let me tell you what the only grievance is: Anybody who says this country shouldn't be its better angels, and that we shouldn't recognize actual qualification in a woman of color, and that they have come for our vote — yes, and I'm wearing my shirt, because we at the Leadership Conference have a campaign called 'And Still I Vote' because they have been doing everything in their power to make it harder for us to vote, intentionally. So instead of trying to get our votes — which is exactly what should be happening here — instead they are trying to make white people afraid of us. That is what we fought a Civil War over, and had the second Reconstruction over, and this is what's at stake now. And when she says we won't go back, she's saying, 'Keep on cutting 'cause we [are] coming.'\" Watch the video below or at this link. 'Keep on cutting': Legal expert skewers Fox News over latest 'grievance'www.youtube.com","summary":"Former president and CEO of the Leadership Conference on Civil and Human Rights and legal analyst Maya Wiley on Wednesday issued a scathing rebuke of Fox News' and Republicans' latest criticism of Vice President Kamala Harris. \n\n\nReferring to Donald Trump's, his allies' and right-wing media's recent attacks specifically on Harris' race and gender, MSNBC's Nicolle Wallace pointed to a video clip from an Asian American Pacific Islander event the vice president attended in Washington, DC earlier this year, in which she directly addressed those kinds of attacks.\n\n\"Here’s the thing about breaking barriers,\" Harris said during her speech. \"Breaking barriers does not mean you start on one side of the barrier, and you end up on the other side. There’s breaking involved, and when you break things, you get cut, and you may bleed, and it is worth it every time. To especially the young people here, I say to you, when you walk in those rooms, being the only one that looks like you, the only one with your background, you w","url":"https://www.alternet.org/fox-news-colored/","image":"https://www.alternet.org/media-library/image.png?id=52969534&width=1200&height=600&coordinates=0%2C0%2C0%2C86","video":null,"publish_date":"2024-07-24 23:54:36","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","source_country":"US","sentiment":-0.276},{"id":252556544,"title":"Biden to address nation at 8pm: Follow his speech explaining why he dropped out LIVE","text":"By Nikki Schwab, Chief Campaign Correspondent in Washington, D.C. Democrats decided officially on Wednesday that they'll go ahead with a plan to have delegates vote for their presidential nominee virtually ahead of the Chicago convention in mid-August. The Democratic Convention Rules Committee voted 157-3 on a timeline that would kick off electronic voting for presidential candidates as early as August 1, with the plan that it would be wrapped up by August 7, in order to meet every state's balloting deadline. That means that Vice President Kamala Harris - who a majority of Democratic delegates have already pledged to support - would need to name a running mate before August 7. On Wednesday CBS reported that Harris' veepstakes vetting team - led by former Obama Attorney General Eric Holder - is looking at about a dozen candidates. They include a number of swing state and midwestern Democrats: Arizona Sen. Mark Kelly, Pennsylvania Gov. Josh Shapiro, North Carolina Gov. Roy Cooper, Minnesota Gov. Tim Walz, Illinois Gov. J.D. Pritzker, Kentucky Gov. Andy Beshear and Michigan Gov. Gretchen Whitmer. Several Cabinet heads are also being considered - Transportation Secretary Pete Buttigieg - who ran against both Biden and Harris during the 2020 Democratic primary - and Commerce Secretary Gina Raimondo, a former governor of Rhode Island. The team is also reportedly looking outside of government as well. Former President Donald Trump, the GOP nominee, never held elected office before winning his White House bid in 2016. His running mate, Ohio Sen. J.D. Vance, was a best-selling author and businessman before winning his Senate election in 2022.","summary":"DAILYMAIL.COM U.S. POLITICS BLOG: Follow all the developments as President Joe Biden prepares to address the nation on his extraordinary decision to withdraw from the race.","url":"https://www.dailymail.co.uk/news/article-13667555/Biden-81-address-nation-decision-end-2024-bid-polls-Kamala-Harris-Trump-locked-tight-battle.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/07/25/00/87734651-0-image-m-16_1721863138408.jpg","video":null,"publish_date":"2024-07-24 23:52:11","author":"Editor,Emily Goodin,Jon Raasch,Kelly Laco,Morgan Phillips,Nick Allen,Nikki Schwab,Sarah Ewall-Wice,Wills Robinson","authors":["Editor","Emily Goodin","Jon Raasch","Kelly Laco","Morgan Phillips","Nick Allen","Nikki Schwab","Sarah Ewall-Wice","Wills Robinson"],"language":"en","source_country":"gb","sentiment":0.097},{"id":252556988,"title":"Watch: Biden explains his decision to exit presidential race","text":"[The stream is slated to start at 8 p.m. ET. Please refresh the page if you do not see a player above at that time.] President Joe Biden will deliver a speech from the Oval Office to explain his decision to drop out of the presidential race against former President Donald Trump, and to lay out his plan for the remaining months of his term. It is the first time Biden has addressed the nation since exiting the race and endorsing Vice President Kamala Harris to replace him. The president returned to Washington on Tuesday after quarantining at his Delaware beach house with Covid-19. Subscribe to CNBC on YouTube.","summary":"President Biden was isolating with Covid-19 when he announced his decision to drop out of the race against Donald Trump.","url":"https://www.cnbc.com/2024/07/24/watch-biden-oval-office-address-exit-race.html","image":"https://image.cnbcfm.com/api/v1/image/108005874-1721002207103-108005874-17210021222024-07-15t000723z_168186846_rc2av8axmxxj_rtrmadp_0_usa-election-trump-biden.jpg?v=1721002544","video":null,"publish_date":"2024-07-24 23:50:29","author":"Rebecca Picciotto","authors":["Rebecca Picciotto"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.034},{"id":252556442,"title":"Donald Trump shifts focus to ‘radical left extremist’ Kamala Harris at first rally after Biden’s exit","text":"Donald Trump declared victory over Joe Biden on Wednesday evening and promised thousands of adoring fans in North Carolina that there’d be no more Mr Nice Guy as he promised he would make Kamala Harris his next victim. He took a lap of honor at his first rally since Biden dropped out of the race and unveiled his new attack strategy for Harris. And he laughed off reports that he was a changed man after coming within an inch of being assassinated. ‘I was supposed to be nice. They say something happened to me when I got shot,’ he said at a sports arena in Charlotte. ‘I became nice. ‘When you are dealing with these people you can’t afford to be nice. So if you don’t mind I’m not going to be nice.’ This election was meant to be boring: Two old, when men squaring off just like they did in 2020. But Trump has already survived an assassination attempt and now he is adjusting to a new contest. Biden is gone, after sensationally dropping out Sunday, and he must now recalibrate to take on the first black woman (in all likelihood) to be her party’s nominee. ‘As you know three days ago we officially defeated the worst president in the history of our nation,’ he said setting off a deafening roar from more than 10,000 supporters. ‘So now we have a new victim to defeat, lying Kamala Harris.’ He ran down her record as a prosecutor in California, derided her work on immigration and claimed the ‘fake news’ had quickly changed its tune on a vice president that it previously wrote off as ineffective. ‘Everything Kamala touches turns into a total disaster,’ he said. ‘Check out San Francisco: 20 years ago it was the greatest city in our country. Now it is unliveable.’ His supporters think the change of candidate changes little in the race, even as Harris’s campaign reports an avalanche of cash and volunteers. ‘It would be OK if it were just her,’ said Susan Putnam, a retired office worker, as she waited for Trump to appear. ‘But it’s not. She’ll have the deep state behind her.’ The race is likely to be tight. A Reuters/Ipsos poll completed on Tuesday showed Harris with a two-point lead over Trump, 44 percent to 42 percent, although other polls have shown the former president narrowly ahead. North Carolina voted narrowly for Trump in the past two elections. However, Democrats see it as a potential pickup and the state’s term-limited governor, Roy Cooper, is among the possible running mates being considered by Harris. His campaign and allies have pivoted rapidly to attacks on the vice president, tying her to the administration’s struggles to tame inflation and a crisis at the border. A super PAC launched TV ads on Monday, accusing Harris of covering up Biden’s obvious mental decline. ‘But Kamala knew Joe couldn’t do the job, so she did it,’ says the narrator of the ad, funded by MAGA Inc. ‘Look what she got done, a border invasion, runaway inflation, the American Dream dead. They created this mess. They … no, Kamala owns this failed record.’ And on Tuesday, Trump said the switch in candidates held no fear for him. He said her campaign for president imploded in 2020. ‘So if she campaigns that way now and this is only going to be tougher, although she does have a lot of support from the fake news. There’s no question about that,’ he told reporters on a briefing call. ‘But if she campaigns the way she campaigned then, you know, I suspect she won’t be too tough.’ The change in candidate has provided a fillip to Democrats too. The Harris campaign on Wednesday said it has raised $126 million since Sunday, with 64% of donors making their first contribution of the 2024 campaign. Harris held her first rally since becoming the likely nominee a day earlier in Milwaukee, where she warned that Trump would take the nation ‘backward.’ ‘Do we want to live in a country of freedom, compassion and rule of law, or a country of chaos, fear and hate?’ she asked.","summary":"Internewscast Journal\n\nInternewscast\n\n\nDonald Trump declared victory over Joe Biden on Wednesday evening and promised&#8230;\n\n\nThis Post: Donald Trump shifts focus to &#8216;radical left extremist&#8217; Kamala Harris at first rally after Biden&#8217;s exit first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/donald-trump-shifts-focus-to-radical-left-extremist-kamala-harris-at-first-rally-after-bidens-exit/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-Donald-Trump-turns-his-attention-to-radical.jpg","video":null,"publish_date":"2024-07-24 23:48:43","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.255},{"id":252556584,"title":"Harris and Trump launch lines of attack on campaign trail","text":"Harris and Trump launch lines of attack on campaign trail Vice President Kamala Harris and former President Donald Trump were on the trail Wednesday as their respective presidential campaigns shift with the changing political field. CBS News chief election and campaign correspondent Robert Costa has more.","summary":"Vice President Kamala Harris and former President Donald Trump were on the trail Wednesday as their respective presidential campaigns shift with the changing political field. CBS News chief election and campaign correspondent Robert Costa has more.","url":"https://www.cbsnews.com/video/harris-trump-launch-lines-of-attack-on-campaign-trail/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/24/4fba4fd3-c24f-4023-9d44-b6a508bece92/thumbnail/1200x630/543a5b27f0350b085eda2ccc6fe775b6/cbsn-fusion-harris-trump-launch-lines-of-attack-on-campaign-trail-thumbnail.jpg?v=5501038cbc281520ff9fdc308faab7d","video":null,"publish_date":"2024-07-24 23:45:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":0.054},{"id":252556920,"title":"Trump attacks Harris on immigration in first rally since Biden exit","text":"WASHINGTON >> Republican presidential candidate Donald Trump today attacked his new Democratic rival Kamala Harris as the “ultra-liberal driving force” who should be held responsible for the Biden administration’s policies on immigration. “As border czar, Kamala threw open our borders that allowed 20 million illegal aliens to stampede into our country from all over the world,” Trump said at a North Carolina rally, his first since President Joe Biden bowed out of the race at the weekend. Biden put Harris in charge of working with countries in Central America to help stem the tide of migration, but she was not given responsibility for border security nor was she named “border czar.” To the roars of the crowd, the former president described Vice President Harris as the most liberal politician ever elected in American history. “She will destroy our country if she ever gets elected,” the former president said at the event, held in Charlotte, North Carolina, one of a handful of battleground states considered crucial to winning the Nov. 5 presidential election. Harris, the first Black woman and Asian American to serve as vice president, would become the first woman elected president if she prevails on Nov. 5. In the three days since Biden dropped out, she has shaken up a staid race and sparked new energy among Democrats. Trump’s rally began two hours before Biden, 81, is to address the nation from the Oval Office to explain why he dropped out of the race under mounting pressure from fellow Democrats. His decision followed a disastrous June debate with Trump that exacerbated questions about his ability to win the election or to serve another four years if he succeeded. “I have decided the best way forward is to pass the torch to a new generation. That is the best way to unite our nation,” Biden will say, according to excerpts of his planned address released by the White House. Biden plans to say that he intends to focus on his work as president in the six months left in his term. “That means I will continue to lower costs for hard-working families and grow our economy. I will keep defending our personal freedoms and our civil rights – from the right to vote – to the right to choose,” according to his prepared remarks, outlining some themes that Harris is expected to build her campaign around. The president returned to Washington on Tuesday afternoon after isolating with COVID at his home in Delaware, where he made the announcement that he was ending his campaign. Earlier today, the 59-year-old vice president called on a rally of more than 6,000 Black women in Indianapolis to help her revitalize the Democratic campaign. The Democratic National Committee’s rules committee agreed today on a plan to formally nominate Harris as soon as Aug. 1 — before the party’s Aug. 19-22 convention in Chicago — with Harris picking a running mate by Aug. 7. Harris spoke at an event in Indianapolis hosted by the Zeta Phi Beta Sorority, which was founded at Howard University, the historically Black college she attended. She hopes to tap sororities’ multi-generational network of Black women — who played an important role in Biden’s 2020 victory — to deliver strong voter turnout for Democrats again in November. “I thank you. And now, in this moment, our nation needs your leadership once again,” Harris said. Harris and Trump are closely competitive, public opinion polls showed this week. A Reuters/Ipsos poll completed on Tuesday showed Harris with a marginal two-percentage-point lead over Trump, 44% to 42%. A CNN poll conducted by SSRS showed Trump leading Harris, 49% to 46%. Both findings were within the polls’ margins of error. BIDEN TO SPEAK Trump, coming off a triumphant week in which his party unified around his presidential bid after a failed assassination attempt two weekends ago, has had to watch as Biden’s sudden departure from the race shifted the narrative and sparked a surge of attention toward Harris at his expense. Hillary Clinton, the 2016 Democratic nominee who lost to Trump, said in an opinion piece in the New York Times, that she was excited about the Harris candidacy. “She represents a fresh start for American politics. She can offer a hopeful, unifying vision. She is talented, experienced and ready to be president. And I know she can defeat Donald Trump,” Clinton said. Harris campaign chair Jen O’Malley Dillon said in a memo made public today that Democrats would aim to compete in the swing states of Michigan, Wisconsin, Pennsylvania, North Carolina, Georgia, Arizona and Nevada, opening up a map that in the final weeks of Biden’s campaign had appeared to be more focused on the Midwest. “This race is more fluid now – the vice president is well-known but less well-known than both Trump and President Biden, particularly among Dem-leaning constituencies,” O’Malley Dillon wrote. The Harris campaign today said it has raised $126 million since Sunday, with 64% of donors making their first contribution of the 2024 campaign. Additional reporting by Trevor Hunnicutt, Susan Heavey and Jarrett Renshaw.","summary":"WASHINGTON >> Republican presidential candidate Donald Trump today attacked his new Democratic rival Kamala Harris as the &#8220;ultra-liberal driving force&#8221; who should be held responsible for the Biden administration&#8217;s policies on immigration.","url":"https://www.staradvertiser.com/2024/07/24/breaking-news/trump-attacks-harris-on-immigration-in-first-rally-since-biden-exit/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_20240724_brk_tru01.jpg","video":null,"publish_date":"2024-07-24 23:45:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.053},{"id":252556494,"title":"Fixing America: Trump and the Triumph of the Will","text":"Our highways and bridges are falling apartWho’s blessed and who has been cursed?There’s things to be done all over the worldBut let’s rebuild America first. Merle Haggard, “America First“ “Let’s get out of Iraq and get back on the track.” Donald Trump’s vice president pick, Senator JD Vance of Ohio, addressed the Republican Convention last week to one of Haggard’s lesser-known songs, from the Bush years. It was a personal pick of the former venture capitalist and author vying for the right to labour for four years in vice presidential obscurity. The choice was at least three levels of ironic. First was that one of Trump’s longest-running lies is that he opposed the Iraq War. Second is that the day before Vance spoke, Biden administration transportation secretary Pete Buttigieg — who, in a slight change of scenario, might have been the Democratic nominee himself right now — had announced another US$5 billion in ongoing grants for major bridge rebuilds across America, as part of Biden’s 2021 infrastructure law that is investing US$40 billion in crumbling US infrastructure, including around 10,000 bridges. Third, the Trump-dictated Republican platform only mentions infrastructure once, and that was to play tough on protecting “critical infrastructure” from “malicious cyber actors” (hint to the GOP: on malicious cyber actors, the calls are coming from inside the house). Certainly no mention of bridges and highways — but there is an iron dome: the platform commits to “ensure our Military is the most modern, lethal and powerful Force in the World [sic — Trump has an 18th-century tendency to randomly capitalise Words].” “We will invest in cutting-edge research and advanced technologies, including an Iron Dome Missile Defense Shield.” Maybe they can build the missile batteries on bridges. Of course, Trump’s GOP don’t need none of your facts, or your irony, thank you very much. You need to take the man seriously but not literally, his right-wing defenders insist; just because Trump supported the Iraq War and isn’t interested in fixing infrastructure doesn’t mean he isn’t a 1930s-style isolationist Republican who will put America first on every decision made and every dollar spent. But not even Merle Haggard thought things were as simple as a Merle Haggard song. Let’s stick with bridges. Assuming you only have limited funding and tens of thousands of bridges to fix, how do you allocate the money? Do you work with states and therefore their priorities? Do you look at the business case for each project or allow local politicians to pick them? Do you choose projects that deliver economic benefits in terms of better freight corridors, or projects that cut the road toll? Do you spend the money in swing states you need to win the next election? Do you use local materials only, or allow only local bidders, or do you save money by sourcing everything as cheaply as possible, delivering best bang for buck? And, of course, who pays for a new bridge in Peoria, Illinois? Peorians? Illinoians? All Americans? Rich Americans? American corporations? Ugh. Such annoying questions are the stuff of banal but crucial policymaking and implementation, because getting things done well, accountably, with public money, in a democracy, is hard. The world is complicated and people don’t agree and most people don’t really have the national interest at heart, just their own interests. And they vote. We’re not in a strong position to deride Americans, either — we’re too busy wasting tens of billions on jokes like the inland rail, while country people die on shitty local roads. Needless to say, that’s not what Trump and the Republicans are offering. They offer a world in which things can get done not because Trump has some magical ability to deliver complex policy solutions but simply as an act of will. Trump is different because he wants to deliver for (white, male) Americans. The central story of the GOP platform is: For decades, our politicians sold our jobs and livelihoods to the highest bidders overseas with unfair Trade Deals and a blind faith in the siren song of globalism. They insulated themselves from criticism and the consequences of their own bad actions, allowing our Borders to be overrun, our cities to be overtaken by crime, our System of Justice to be weaponized, and our young people to develop a sense of hopelessness and despair. They rejected our History and our Values. Quite simply, they did everything in their power to destroy our Country. In this world view, the bridges never got repaired not because America’s ruling class was preoccupied with the War on Terror, nor because its political system is controlled by businesses and the super-wealthy who have prevented US governments from taxing them enough to fund decent infrastructure and social services, but because America’s leaders were trying to destroy the country. Difficult things weren’t done because there was an elite conspiracy, not because they required difficult decisions and clashed with vested interests. It just requires someone with the will to do these things, and they will be done. As Trump said in 2016, “We’re gonna win so much, you may even get tired of winning.” (Perhaps this is part of the reason why The Lord of the Rings seems to pop up so frequently as an influential book among Trump-supporting tech billionaires and Vance, given it offers a simple black-and-white world, agreeably devoid of women with anything to say and run by benign white male authority figures, fighting evil dark-skinned subhumans, where everything is resolved by destroying an unwanted piece of old, centralising tech.) That this pitch of simple thinking — one of the most repeated phrases in the platform is “common sense” — is a scam isn’t particularly noteworthy. The great American political tradition is of elites (and they don’t come more elite than Donald Trump) devising ways to convince ordinary Americans to vote against their own interests. The Democrats did it for generations after the Civil War with racism, then the Republicans stole that trick in the 1960s and have been making hay with it ever since, adding resentment towards women, LGBTIQA+ people and migrants in recent times. It’s an appeal to a nostalgia for simpler times — a confected nostalgia, for an America that not only didn’t exist 30 or 50 years ago or within the lifetime of any living American, but never existed at all, because America was always beset by the problems of partisanship, of conflicting interests, of race, of colonisation, of immigration, of religious conflict, of elites and masses, of economic and financial disparities. American politics and policy have always been complicated, to the point of mass political violence and civil war. They were complicated when Washington’s cabinet was divided bitterly over national debt and economic policy and relations with revolutionary France, and they only got more difficult as the frontier expanded and America became an empire and then emerged as the dominant global power — let alone basic rights for African Americans and women. At a deeper level, across Western democracies, it’s now a regular theme. Simplicity versus complexity; blaming someone for the problem versus working out a solution; demonising someone versus working with them; blunt assertions of authority versus the messy compromise of democracy. The right has embraced simplicity and ridden it to success across the West, and nowhere more so than in the US. It’s also the reason right-wing governments have proven, time and again, so spectacularly incompetent: when you think problems haven’t been solved because other people want to destroy the country rather than because they’re hard to solve, effective policymaking — as opposed to blaming other people or enriching yourself and your friends — becomes very difficult. Americans lived it under Trump the first time; Britons endured it under a succession of Tory prime ministers who drove the nation into the ground. And if anything, Trump’s message this time is even simpler. Merle had it right: who’s blessed and who has been cursed, indeed.","summary":"Donald Trump offers a confected nostalgia for an America that not only didn't exist within the lifetime of any living American, but never existed at all.\n\n\nThe post Fixing America: Trump and the Triumph of the Will appeared first on Crikey.","url":"https://www.crikey.com.au/2024/07/25/fixing-america-donald-trump-republican-party/","image":"https://www.crikey.com.au/wp-content/uploads/2024/07/20240725170223231225-original-copy.jpg?quality=70","video":null,"publish_date":"2024-07-24 23:43:00","author":"Bernard Keane","authors":["Bernard Keane"],"language":"en","source_country":"au","sentiment":-0.42},{"id":252556266,"title":"Trump calls Kamala Harris ‘radical left lunatic’, says she wants ‘execution’ of babies","text":"Donald Trump launched a volley of attacks against US Vice-President Kamala Harris Wednesday, calling her a “radical left lunatic” in his first rally since she became the de facto Democratic Party nominee for November’s election. In a speech claiming she was in favour of the “execution” of babies due to her stance on abortions, the former US president and Republican nominee said: “She is a radical left lunatic who will destroy our country.” “We’re not going to let that happen,” he told the crowd in North Carolina. Trump’s speech comes as Harris, 59, hits the campaign trail armed with US President Joe Biden’s endorsement – after his historic decision over the weekend not to seek re-election. The 78-year-old Republican repeatedly attacked Biden, 81, over his age but has been forced to pivot as he has now become the oldest nominee in history. Trump called Harris “the ultra liberal driving force behind every single Biden catastrophe”. He claimed that she wanted “abortions in the eighth and ninth month of pregnancy” as well as “right up until birth and even after birth, the execution of a baby”. To the roars of the crowd, Trump described Harris as the most liberal politician ever elected in American history. “She will destroy our country if she ever gets elected [as US president],” he said. “As border tsar, Kamala threw open our borders that allowed 20 million illegal aliens to stampede into our country from all over the world.” Biden put Harris in charge of working with countries in Central America to help stem the tide of migration, but she was not given responsibility for border security nor was she named “border tsar”. Harris, the first black woman and Asian-American to serve as US vice-president, would become the first woman elected president if she prevails on November 5. In the three days since Biden dropped out, she has shaken up a staid race and sparked new energy among Democrats. Trump’s rally began two hours before Biden addresses the nation from the Oval Office to explain why he dropped out of the race under mounting pressure from fellow Democrats. Saying Democratic Party bosses were behind Biden’s decision to step down, the Republican accused Harris of covering up Biden’s “mental unfitness”. Earlier in the day, the White House denied it had covered up any possible decline in Biden’s health before his decision to drop out of the election race. Harris and Trump are closely competitive, public opinion polls showed this week. A Reuters/Ipsos poll completed on Tuesday showed Harris with a marginal two-percentage-point lead over Trump, 44 per cent to 42 per cent. A CNN poll conducted by SSRS showed Trump leading Harris, 49 per cent to 46 per cent. Both findings were within the polls’ margins of error. The Democratic National Committee’s rules committee has agreed on a plan to formally nominate Harris as soon as August 1 – before the party’s August 19-22 convention in Chicago – with Harris picking a running mate by August 7. On Wednesday, Harris called on a rally of more than 6,000 black women in Indianapolis hosted by the Zeta Phi Beta Sorority to help her revitalise the Democratic campaign. She hopes to tap sororities’ multi-generational network of black women – who played an important role in Biden’s 2020 victory – to deliver strong voter turnout for Democrats again in November. “I thank you. And now, in this moment, our nation needs your leadership once again,” Harris said. Additional reporting by Reuters","summary":"The Republican US presidential candidate launched a string of attacks on his Democrat opponent in his first rally since Biden’s exit.","url":"https://www.scmp.com/news/world/united-states-canada/article/3271774/trump-calls-kamala-harris-radical-left-lunatic-says-she-wants-execution-babies","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/07/25/fdb42cf0-73c1-4bd4-a8fe-dafaf419ce97_6ae5b65b.jpg","video":"https://storage.scmp.com/d8/cors_uploads/2024/07/22/web%20video.mp4","publish_date":"2024-07-24 23:40:46","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","catgory":"politics","source_country":"cn","sentiment":-0.215},{"id":252556308,"title":"Massachusetts Democratic Committee votes to endorse Kamala Harris for president","text":"Well that was fast. It took only a few days since President Joe Biden announced he was dropping out for the Massachusetts Democratic State Committee to unanimously endorse Kamala Harris for president. The state Dem committee on Wednesday evening met virtually and voted unanimously to back Harris as the 2024 Democratic nominee against former President Donald Trump. This came after a unanimous vote of endorsement of the Massachusetts delegates to the Democratic convention. “The message is clear: there is resounding support for Vice President Harris from Democrats here in Massachusetts and around the country,” Massachusetts Democratic Party Chair Steve Kerrigan said in a statement. “Our Party is united, energized, and ready to defeat Donald Trump and J.D. Vance this November,” he added. Harris has been endorsed this week by several elected officials in the Bay State, including Gov. Maura Healey, U.S. Sen. Elizabeth Warren, U.S. Sen. Ed Markey, and Members of Congress. State Committee Member Sharon Stout made the motion to endorse Harris. “Let us unite behind Vice President Harris,” said Stout, of Newton. “Let us give her our full endorsement and work tirelessly to ensure her victory. Together, we can make history. Together, we can build a stronger, fairer, more peaceful America for all.” Massachusetts will send 116 delegates to the Democratic convention in Chicago next month. Harris has already secured the support of enough Democratic delegates to become the nominee, according to an Associated Press survey, as top Democrats have rallied to her in the aftermath of Biden’s decision to drop his bid for reelection. Material from the Associated Press was used in this report.","summary":"The Massachusetts Democratic State Committee voted unanimously to back Kamala Harris as the nominee against former President Donald Trump.","url":"https://www.bostonherald.com/2024/07/24/massachusetts-democratic-committee-votes-to-endorse-kamala-harris-for-president/","image":"https://www.bostonherald.com/wp-content/uploads/2024/07/OCR-L-BIDEN-DELEGATES-0722.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:40:39","author":"Rick Sobey","authors":["Rick Sobey"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.029},{"id":252556154,"title":"UFC 304 Fight Card Preview, Odds & Predictions: Aspinall Vs. Blaydes","text":"Share to Facebook Share to Twitter Share to Linkedin LONDON, ENGLAND - JULY 22: (L-R) Curtis Blaydes and Tom Aspinall of England face off during the UFC ... [+] Fight Night ceremonial weigh-in at O2 Arena on July 22, 2022 in London, England. (Photo by Jeff Bottari/Zuffa LLC) Zuffa LLC The UFC’s next fight card, the fast-approaching UFC 304 pay-per-view, takes place on Saturday, July 27, at Co-op Live in Manchester, England. UFC 304 features two title fights at the top of the card. Both of those battles are rematches. In the main event, UFC welterweight champion Leon Edwards puts the 170-pound title on the line against Belal Muhammad. In the UFC 304 co-main event, interim heavyweight champion Tom Aspinall meets Curtis Blaydes. UFC 304 takes place at Co-op Live in Manchester, England. The main card streams on ESPN+ pay-per-view at 10:00 p.m. ET. The ESPN2 prelims begin at 8:00 p.m. ET and follow the ESPN+ streaming early prelims, which start at 6:15 p.m. ET. Before the headlining bout on the UFC 304 fight card happens, Aspinall and Blaydes will fight for Aspinall’s interim crown. Blaydes is the No. 4 ranked fighter in the official UFC heavyweight rankings. Below, we take a deep dive into the Aspinall vs. Blaydes matchup. First Fight: Aspinall vs. Blaydes LONDON, ENGLAND - JULY 23: Tom Aspinall of England reacts after suffering an apparent injury against ... [+] Curtis Blaydes in a heavyweight fight during the UFC Fight Night event at O2 Arena on July 23, 2022 in London, England. (Photo by Jeff Bottari/Zuffa LLC) Zuffa LLC MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out Tom Aspinall and Curtis Blaydes first met in the main event of a UFC Fight Night card at the O2 Arena in London, England in July 2022. At the time, Blaydes was ranked No. 4 in the division and Aspinall was the No. 6 fighter in the division. Aspinall was the -140 betting favorite on fight night, while Blaydes came in as the +120 betting underdog. The fight lasted 15 seconds, coming to an end when Aspinall fell to the mat clutching his right knee. With Aspinall unable to continue, Blaydes was declared the winner by TKO. Careers Tom Aspinall NEW YORK, NEW YORK - NOVEMBER 11: Tom Aspinall of England reacts after his knockout victory against ... [+] Sergei Pavlovich of Russia in the interim UFC heavyweight championship fight during the UFC 295 event at Madison Square Garden on November 11, 2023 in New York City. (Photo by Cooper Neill/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Tom Aspinall (14-3) had a 7-2 professional MMA record when the UFC inked him to a deal in 2020. Aspinall made his promotional debut in July 2020 with a 45-second knockout win over Jake Collier. The win earned the then 27-year-old his first “Performance of the Night” bonus. A knockout win over Alan Baudot followed in October of that year. Aspinall made it three stoppages in a row in February 2021 when he tapped Andrei Arlovski in the second round of their matchup, a card that was headlined by Curtis Blaydes losing to Derrick Lewis by second-round KO. Aspinall’s win over Arlovski broke him into the rankings at No. 13. First-round stoppage wins over Serghei Spivac (TKO) and Alexander Volkov (submission) followed the Arlovski triumph. The Blaydes matchup was next on Aspinall’s schedule. The injury he suffered in that contest kept him out of action until July 2023 when he stepped into the Octagon to face Marcin Tybura. Aspinall showed no hesitation or ill effects from his knee injury, as he dispatched Tybura in 73 seconds, winning the fight by TKO. Then, with UFC heavyweight champion Jon Jones injured and out of his scheduled UFC 295 matchup against Stipe Miocic, the UFC tapped Aspinall and Sergei Pavlovich to face off for the interim heavyweight title at UFC 295. Aspinall won the bout, and the title, with a 69-second knockout. Aspinall has six first-round stoppage wins and one second-round stoppage victory under the UFC banner. He has never gone past 1:09 of the second round in UFC action. Aspinall has earned six “Performance of the Night” bonuses during his UFC run. The only win he has where he failed to pick up a post-fight bonus was his win over Baudot in 2020. Curtis Blaydes MIAMI, FLORIDA - MARCH 09: Curtis Blaydes reacts after his TKO victory against Jailton Almeida of ... [+] Brazil in a heavyweight fight during the UFC 299 event at Kaseya Center on March 09, 2024 in Miami, Florida. (Photo by Chris Unger/Zuffa LLC via Getty Images) Zuffa LLC via Getty Images Curtis Blaydes (18-4-0-1) has been toiling with the UFC since April 2016, when he faced Francis Ngannou on a UFC Fight Night card. When he signed with the UFC, Blaydes had a 5-0 record, with all his wins coming by knockout. Ngannou ended that streak with a TKO (doctor’s stoppage) at the end of the second round when Blaydes could not open his right eye. After wins over Cody East and Adam Milstead (later ruled a no contest when Blaydes tested positive for marijuana), the UFC gave Blaydes a chance to break into the rankings with a fight against the N0. 15 Daniel Omielańczuk. Blaydes won that scrap by decision, and he broke into the top 15. Victories over Aleksei Oleinik (TKO), Mark Hunt (decision), and Alistair Overeem (TKO) followed for Blaydes. That stretch put him at No. 3 in the division and earned him another fight against Ngannou, who was ranked No. 4 at the time. Blaydes was the -240 favorite over Ngannou, who entered as the +190 betting underdog. Ngannou ended that fight by knockout 45 seconds into the affair. The loss dropped Blaydes one spot in the rankings. Following the loss to Ngannou, Blaydes went 4-0, which moved him to No. 2 in the rankings and set him up against Derrick Lewis in February 2021. Lewis won that contest by second-round knockout. The loss dropped Blaydes back to No. 4 in the division. Wins over Jairzinho Rozenstruik, Chris Daukaus, and Aspinall followed, but a TKO loss to Sergei Pavlovich set Blaydes back in April 2023. Blaydes then faced Jailton Almeida in March 2024. Blaydes, badly needing a win to stay in the title fight conversation, survived a very rough first round against Almeida to come back and win the fight in the early moments of the second round with a barrage of strikes as Almeida hung on far too long to a takedown attempt. Blaydes has four Performance of the Night bonuses to his name, with his most recent coming in the Almeida matchup. UFC 304 Betting Odds: Tom Aspinall vs. Curtis Blaydes There has been a lot of line movement on this fight. When the UFC first announced Aspinall vs. Blaydes, the interim champ was a -198 betting favorite over the challenger, who came in at +164. Since then, Aspinall has moved to a whopping -440 favorite over Blaydes, who is listed at +260. Significant Stats No UFC heavyweight lands more significant strikes per minute than Aspinall’s 7.72. Further, his striking differential of plus 4.95 is also the best in the division’s history. Aspinall’s striking accuracy is 66 percent, while he absorbs 2.77 significant strikes per minute with a striking defense of 66 percent. Aspinall averages 3.46 takedowns per 15 minutes with a takedown accuracy of 100 percent. His takedown defense is also 100 percent. Aspinall has the shortest average fight time in the history of the UFC heavyweight division at 2:10. He also is the UFC heavyweight leader in lowest bottom position time (one second) and lowest bottom position percentage (0.1 percent) Blaydes lands 3.53 significant strikes per minute with an accuracy of 50 percent. His striking defense is 59 percent, and he absorbs 1.83 significant strikes per minute. Blaydes picks up 5.72 takedowns per 15 minutes. His takedown accuracy is 53 percent, and his takedown defense is 31 percent. Blaydes holds the UFC record for control time (1:20:15), top position time (1:06:09), and takedowns (62). UFC 304 Prediction and Pick: Tom Aspinall vs. Curtis Blaydes Curtis Blaydes is an excellent heavyweight wrestler. However, he seems to have fallen, at least a little, in love with his striking. Blaydes needs to revert to an all-wrestling and ground control attack if he wants to secure the interim heavyweight crown from Aspinall on Saturday. The longer he stands with Aspinall, the worse his odds of pulling off an upset. Aspinall is a very fast starter. He needs to follow that plan of attack with Blaydes while being aware of time and space. His best bet is to establish range with kicks and then attack with punches when Blaydes is looking for more kicks. He can’t let Blaydes score takedowns and eat up the clock with ground control time. This matchup is a big test for Aspinall. The betting pick is that he passes that test with a knockout win over Curtis Blaydes in the co-main event of UFC 304. Related Stories Trent Reinsmith Following Editorial Standards Print Reprints & Permissions","summary":"Everything you need to know about the upcoming UFC 304 co-main event, the interim heavyweight title fight between Tom Aspinall and Curtis Blaydes.","url":"https://www.forbes.com/sites/trentreinsmith/2024/07/24/ufc-304-fight-card-preview-odds--predictions-aspinall-vs-blaydes/","image":"https://imageio.forbes.com/specials-images/imageserve/66a17e334132ae240100a037/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:39:09","author":"Contributor,Trent Reinsmith","authors":["Contributor","Trent Reinsmith"],"language":"en","catgory":"sports","source_country":"US","sentiment":0.138},{"id":252556324,"title":"What we learned about Trump assassination attempt from FBI testimony","text":"What we learned about Trump assassination attempt from FBI testimony FBI Director Christopher Wray testified on Capitol Hill Wednesday about the investigation into the assassination attempt against former President Donald Trump. While Wray didn't divulge too many details about the investigation, he did offer some new information about the shooter. Anna Schecter, senior coordinating producer for CBS News' crime and public safety unit, has the details.","summary":"FBI Director Christopher Wray testified on Capitol Hill Wednesday about the investigation into the assassination attempt against former President Donald Trump. While Wray didn't divulge too many details about the investigation, he did offer some new information about the shooter. Anna Schecter, senior coordinating producer for CBS News' crime and public safety unit, has the details.","url":"https://www.cbsnews.com/video/what-we-learned-trump-assassination-attempt-fbi-testimony/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/24/5508d3a1-52bd-4635-b56f-576c8eda9a59/thumbnail/1200x630/a45f3609f523a3f3fc92ff3415042c96/cbsn-fusion-what-we-learned-trump-assassination-attempt-fbi-testimony-thumbnail.jpg?v=5501038cbc281520ff9fdc308fa","video":null,"publish_date":"2024-07-24 23:38:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.041},{"id":252556178,"title":"DNC Rules Committee sets up nomination process for Chicago convention","text":"CHICAGO (WLS) — The Rules Committee for the Democratic National Convention met Wednesday to formalize the nomination process for the presidential nominee. All of this comes less than a month from the start of the DNC in Chicago The DNC is set to move forward with a virtual roll call vote, as it pushes ahead to choose a presidential nominee before the party gathers in Chicago next month. Vice President Kamala Harris is overwhelmingly favored to replace President Joe Biden at the top of the ticket. But, there is still time for other candidates to get into the race. Wednesday, members of the DNC Rules Committee took up a proposal on how to move forward. It would mean delegates could begin voting on the party’s presidential nominees as early as next week under a draft plan released by the DNC. The plans are to have it all finalized by Aug. 3, and maybe even sooner. It all depends on whether the Kamala Harris campaign momentum is enough to scare off any potential rivals. Harris gave the keynote speech to the Zeta Phi Beta sorority meeting in Indianapolis Wednesday, campaigning as the presumptive nominee. It comes one day after Harris told supporters at a rally in Milwaukee that she had already secured enough delegate support to win the nomination. Now, Harris is clearly focused on the White House, and not any potential rivals. “And we know, when we organize, mountains move; when we mobilize, nations change; and when we vote, we make history,” she said. The rules committee held a virtual meeting to vote on the formal ground rules for the nomination process. “As a party, we have an obligation to design and implement a fair nomination process for delegates to officially express their preferences through a vote,” said Jaime Harrison, Democratic National Committee chairman. Other interested candidates have until Saturday to declare their intention to seek the nomination. The virtual voting would then begin in early August for qualified candidates. With the momentum Harris has already established, it seems highly unlikely anyone else will run. A new CNN poll, conducted after Biden announced he was ending his reelection campaign and endorsing Harris, shows the vice president trailing Donald Trump 46-to-49%, with the margin of error making it a virtual tie. “So let us continue to fight with optimism, with faith and with hope. Because, when we fight, we win,” Harris said. The virtual nomination process has to be finished in time for the nominee to select a vice presidential running mate and get it certified before Aug. 7. That’s the date needed to qualify to get on the ballot in Ohio.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCHICAGO (WLS) &#8212; The Rules Committee for the Democratic National Convention met&#8230;\n\n\nThis Post: DNC Rules Committee sets up nomination process for Chicago convention first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/dnc-rules-committee-sets-up-nomination-process-for-chicago-convention/","image":"https://internewscast.com/wp-content/uploads/2024/07/rewrite-this-title-DNC-Rules-Committee-formalizes-nomination-process-ahead.jpg","video":null,"publish_date":"2024-07-24 23:37:04","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.181},{"id":252556152,"title":"Seven Multicultural Marketing KPIs Every CMO Should Track","text":"Share to Facebook Share to Twitter Share to Linkedin getty Over the years, the paradigm of multicultural marketing in America has shifted from debating the business opportunity associated with demographic changes in this country to discussing how to effectively implement programs to reach diverse segments and how to measure them properly. In my conversations with CMOs, one common topic is the search for a set of key performance indicators (KPIs) that could guide corporations in managing their multicultural marketing programs. While this is not an easy task and varies according to the industry, in my experience working with more than a hundred brands, I have noticed a few common indicators. These KPIs should be included in a regular (weekly/monthly/quarterly) multicultural performance dashboard and can serve as a support tool for strategic planning and resource allocation discussions. 1 - Sales Sales measurement can vary depending on the type of business. For instance, when it comes to retail, the best practice is to flag stores with a high probability of sales to diverse consumers based on the Census' zip code population density of priority segments (Hispanic, Black, Asian/Pacific Islander, or the sum of all). MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out In this case, marketers would designate stores with a significantly higher local zip code population than the country's average as highly diverse locations and track their performance separately. For example, Hispanic locations may be those where the zip code data shows a population density is higher than the national average of 20% as “Hispanic Stores.” To be clear, this approach has obvious limitations, and it should be treated as a proxy rather than as a perfect sales tracker. For instance, people living in that zip code are different from people shopping in that zip code. Despite its limitations, the population density approach to designating stores has many more advantages than disadvantages. Over time, it creates a solid comparison basis that can significantly support marketers in their analytical processes. Moreover, this approach also allows for further analysis of store format and sub-channels or key accounts analysis, with a very low cost of implementation since Census data on ethnicity by zip code is public. For service companies without physical stores, the industry's benchmark is still the proxy of first name / last name combined with zip codes, which is information that is typically purchased from private databases. These databases tend to flag customers or prospects in the marketer's database with a high probability of being Hispanic or Asian, ethnicities that tend to have unique name/last name formats. This approach also has a few limitations, such as excluding Latinos without a traditional Latino last name (like me, for instance). However, this methodology has an approximately 90% + accuracy rate. I always advocate that marketers take these proxy methodologies directionally, but if your company can get proxy sales data using one of the approaches above (or some other methodology), you can start assessing the percentage of current sales coming from diverse segments. Despite being directional, this is an important KPI because it can indicate how close you may be to fair share. It may also shed light on the percentage of growth coming from diverse segments, ultimately shaping overall strategy creation and resource allocation. 2- Market Share Your market share may vary by ethnic segment. This variation may have several reasons, including perceptions of product/service quality, awareness, value perceptions, distribution footprint, and more. Unfortunately, most marketers assume their market share is similar across diverse segments, a belief that may cause some to miss growth opportunities. I like using market share comparison for different ethnic segments in performance dashboards since it indicates the relative strength of the brand/service, mainly when you compare one segment vs. the total market share. It allows you to assess fair share, i.e., how close or far to the total share your segment is, and by calculating that share gap, you can estimate the size of a sales surplus or deficit. This is vital information when assessing investment levels per segment and overall resource allocation. 3- Household Penetration A very popular KPI among CPG brands, household penetration can vary significantly between diverse segments. Generally, this KPI is calculated by assessing the number of households that have purchased a product or service over a given period (for instance, thirty days, six months, or one year). Comparing household penetration by diverse segments can also yield exciting insights that benefit a business and may yield hypotheses around product or category usage. If the penetration of a product or service is significantly low for a specific diverse segment, a marketer should analyze the drivers of this gap in depth and assess whether it's worth the investment to close the penetration gap. Most of the time, market share and penetration analyses are conducted together. For instance, I love working with my clients on 2x2 matrices where each KPI is on an axis, creating four performance quadrants. 4 – Product/Service Usage How is your product/service used? What's the frequency of usage? What price tier or SKU is used? What kind of bundle service does your customer have? What add-ons to the service does an individual or household have? All these questions and many more should be considered in a side-by-side comparison between diverse segments. An in-depth understanding of how diverse segments consume your product/service can spark new ideas for a marketer's innovation pipeline, including new usages, partnerships, occasions, and more. 5 – Revenue Per User / Average Ticket Assuming marketers can access most of the KPIs mentioned above, they can also start segmenting financial performance per ethnic group, including monthly revenue or average ticket, cost per acquisition, profitability, etc. For example, when I worked at a Telecom, we assessed the Average Revenue Per User (ARPU) for Hispanic and non-Hispanic customers and found that Hispanics' ARPU was significantly higher than non-Hispanics'. That information, combined with the average churn rate by ethnic group, allowed us to estimate a customer profitability profile which supported marketing budget allocation. For example, customers with significantly higher ARPU may enable higher costs per acquisition or investments in retention tools. 6 - Brand and Advertising Awareness Brands must understand the variances of these two well-known KPIs to manage a marketing communications strategy. Unfortunately, most clients don't invest in a robust sample size to have this information at hand which may underestimate gaps in awareness, in particular for segments like Hispanic and Asian American consumers that still comprise a sizable number of immigrants. One common mistake marketers make is assuming that all consumers and segments have the same level of brand awareness of your brand or service, and even if they have, a second common mistake is to confuse brand recognition with the existence of a deeper set of positive brand associations and perceptions. 7 - \"A Brand for People Like Me\" This is one of my favorite KPIs for multicultural marketing and one that is often ignored by marketers. If the premise of multicultural marketing is to connect with consumers authentically and relevantly, this KPI is one of the best tools to assess how much progress a brand is making. One-size-fits-all communication platforms or generic ideas that can be applied to all consumers without distinction tend to fail at this KPI. In sum, there’s no one-size-fits-all KPI to measure multicultural marketing impact, but understanding and acting upon these metrics will ultimately empower brands to create more authentic, inclusive, and impactful marketing campaigns that resonate with all consumers. As the market evolves, staying attuned to these KPIs will help guide strategic decision-making and ensure that companies remain competitive and relevant in a multicultural landscape. Follow me on Twitter or LinkedIn. Check out my website or some of my other work here. Isaac Mizrahi Following Editorial Standards Print Reprints & Permissions","summary":"The paradigm of multicultural marketing has shifted from debating the business opportunity associated with demographic changes in this country to discussing how to effectively implement programs to reach diverse segments and how to measure them properly.","url":"https://www.forbes.com/sites/isaacmizrahi/2024/07/24/seven-multicultural-marketing-kpis-every-cmo-should-track/","image":"https://imageio.forbes.com/specials-images/imageserve/66a18bb4030416063c870d91/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:36:14","author":"Contributor,Isaac Mizrahi","authors":["Contributor","Isaac Mizrahi"],"language":"en","source_country":"US","sentiment":0.162},{"id":252556326,"title":"FBI director testifies on security lapses in Trump rally shooting","text":"FBI director testifies on security lapses in Trump rally shooting FBI Director Christopher Wray gave chilling testimony Wednesday before the House Judiciary Committee about the investigation into the attempted assassination of former President Donald Trump. Wray revealed that on the same day the gunman registered for Trump's rally, he also did a Google search on his laptop for \"how far away was Oswald from Kennedy?\" Nicole Sganga and Jennifer Borrasso report.","summary":"FBI Director Christopher Wray gave chilling testimony Wednesday before the House Judiciary Committee about the investigation into the attempted assassination of former President Donald Trump. Wray revealed that on the same day the gunman registered for Trump's rally, he also did a Google search on his laptop for \"how far away was Oswald from Kennedy?\" Nicole Sganga and Jennifer Borrasso report.","url":"https://www.cbsnews.com/video/fbi-director-testifies-on-security-lapses-in-trump-rally-shooting/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/07/24/594832f2-944a-4c44-8a95-2f5737d55d08/thumbnail/1200x630/a21e000e6c7077d335ae7c06cb1d367a/0724-en-sganga.jpg?v=5501038cbc281520ff9fdc308faab7dc","video":null,"publish_date":"2024-07-24 23:36:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.366},{"id":252556150,"title":"Review: Ultimate Ears EVERBOOM Rugged, Ultraportable Bluetooth Speaker","text":"Share to Facebook Share to Twitter Share to Linkedin If you found the EPICBOOM's black or white options a little dull, you'll love the EVERBOOM's color ... [+] combos. Brad Moon As June wound down, along with updates to its BOOM, WONDERBOOM and MEGABOOM speakers (new colors and USB-C charging), Ultimate Ears also released a brand new ultraportable Bluetooth speaker: the EVERBOOM. I’ve spent the past few weeks putting the EVERBOOM through its paces and can say that Ultimate Ears has yet another winning speaker in its lineup. Here’s how the EVERBOOM performed. Rugged Speaker That’s Waterproof and Floats Ultimate Ears speakers have a well-deserved reputation for being rugged, water resistant and perfectly suited to outdoor activities including camping and going to the beach. The EVERBOOM is no exception. The speaker feels solid as a rock. Its polyester mesh fabric (100% recycled) and 58% post-consumer recycled plastic body are easy to wash off if they get dirty, and Ultimate Ears has certified it to survive a 1m (3.3ft) drop. The EVERBOOM also looks stylish, with most most colorways featuring multiple colors, like my Azure Blue review unit. The EVERBOOM is IP67 waterproof and floats. Brad Moon MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out It’s dust-proof, waterproof and floats in water. And yes, I tested that, throwing the EVERBOOM into our pool and letting it bob around for 10 minutes. Pull it out, shake off the worst of the water and the speaker is none the worse for the plunge. So if you’re looking for the ideal portable speaker to set up by the pool, on the beach, or on a patio where drinks might be spilled, the Ultimate Ears EVERBOOM checks all the boxes. You can plunk it down and basically not worry about it. The speaker is backed by a 2-year hardware warranty. Hands-On With the EVERBOOM Ultimate Ears knows what people want to hear from a portable Bluetooth speaker and in years of testing, I’ve yet to find one that disappoints. The company keeps the winning streaking going with the EVERBOOM. There’s plenty of bass pumping, a crisp high end, and the mid-range is there too–ensuring vocals are loud and clear. This is not studio-tuned, neutral audio that captures all the fine details of a track; it’s best described as high energy. Perfect for blasting the soundtrack to your party, indoors or outdoors. It can put out considerable volume and there’s an Outdoor Boost button to add an extra bit of “oomph” to the output when needed. As is the case with most Ultimate Ears speakers, the audio is pushed out in 360-degrees, so there no fussing about which way to point it. EVERBOOM is very portable and includes a carabiner clip. Brad Moon The big volume buttons make this speaker easy to adjust poolside and you can leave your phone safely away from the water because the EVERBOOM is equipped with a “Magic” button that lets you control functions like skipping tracks directly from the speaker. You could even leave the phone in the house–Bluetooth range is up to 180 feet. If you want to fine-tune the sound, you can do so using the BOOM mobile app, where you’ll find presets plus a custom EQ. In addition, the app allows you to pair two supported BOOM series speakers using the PartyUp feature. Those who want to be heard above the party can take advantage of a new capability: Megaphone lets you broadcast your voice, turning the EVERBOOM into a mobile PA system. Battery life is rated at up to 20 hours. This assumes you keep the volume at around the halfway mark. I used the EVERBOOM primarily outdoors and in my back yard, halfway was plenty of volume. Crank it up and it gets into serious “neighbors are going to be calling” territory. During a three-week test period, I only ended up having to recharge the speaker once, despite some sessions lasting for five or six hours. EVERBOOM Key Specs: 360-degree sound with two 2.2-inch full-range drivers and two 3.4-inch x 1.9-inch passive radiators Maximum sound level 90 dBC (91 dBC in Outdoor mode) Outdoor Boost button, Magic button, LED battery indicator Customizable EQ (via BOOM app) including 4 presets Bluetooth A2DP with 180-foot range and support for two connected devices, NFC pairing Up to 20-hour battery life, recharges via USB-C (cable included) Rugged, dust-proof, IP67 waterproof and floats in water Supports PartyUp multi-speaker connectivity Integrated mic with Megaphone capability Includes metal carabiner clip 2-year limited hardware warranty Available in Charcoal Black, Azure Blue, Raspberry Red and Enchanting Lilac MSRP $249.99 How Does the EVERBOOM Compare to the EPICBOOM? Last year, Ultimate Ears released the EPICBOOM (reviewed here) and the EVERBOOM looks like that speaker’s “Mini-Me.” Same shape, same top-mounted controls, same emphasis on recycled materials, same rugged design, the same over-sized volume buttons on front and both charge using USB-C. So what are the differences between these two Ultimate Ears speakers? EVERBOOM is dwarfed by last year's EPICBOOM, but the speakers share a similar shape. Brad Moon The most obvious difference is size. The EPICBOOM is 9.4 inches tall and weighs nearly 70 ounces. The EVERBOOM is much svelter at 8.1 inches tall and 32 ounces. For easy carrying, EPICBOOM is equipped with an integrated carrying strap, while the EVERBOOM comes with a metal carabiner clip. In terms of battery life, the smaller EVERBOOM goes for up to 20 hours, compared to 17 hours. The new EVERBOOM is also available in several brighter color options, although there’s still a basic black option. EVERBOOM is available in four colors. Ultimate Ears While both speakers offer 360-degree sound, the EPICBOOM is equipped with a pair of mid-high transducers and a 4.6-inch woofer, while the EVERBOOM uses a pair of full-range transducers plus two passive radiators. The EPICBOOM features an adaptive EQ and can also put out music with slightly more volume (95 dBC in Outdoor mode vs. 91dBC in Outdoor mode). Its driver setup means the EPICBOOM has an edge in bass performance and maximum volume, and also can sound better in differing interior placements where its adaptive EQ can tailor sound based on proximity to walls. Then there is the price, which is surprisingly close. The EVERBOOM retails for $249.99 while the larger EPICBOOM now has a $299.99 price tag. So for $50 more, you are getting considerably more speaker with the EPICBOOM. However, if portability is important, the EVERBOOM wins hands down–without giving up much in the way of sound. Recommendation Ultimate Ears EPICBOOM is well worth the $249 price tag. Brad Moon Those looking for a very portable wireless speaker with long battery life, a rugged, waterproof build and energetic sound will find the EVERBOOM to be a very compelling choice. It sounds great, it’s stylish, you’ll get multiple 8-hour days per charge out of its battery, it’s compact enough to easily bring just about anywhere and tough enough to take whatever the great outdoors (or your party) throws at it. If you are willing to sacrifice some of the portability and battery life in the name of even better sound, more muscular bass and a bit more volume, then at just $50 more, there’s the Ultimate Ears EPICBOOM... With the new EVERBOOM joining its expansive lineup of portable Bluetooth speakers, Ultimate Ears has a high performance model for virtually every scenario. Disclosure: Ultimate Ears provided an EVERBOOM for evaluation purposes but had no input into this review. Follow me on Twitter. Brad Moon Following Editorial Standards Print Reprints & Permissions","summary":"The new EVERBOOM is the latest new speaker from Ultimate Ears, a compact and rugged powerhouse that’s the EPICBOOM’s “Mini-Me.”","url":"https://www.forbes.com/sites/bradmoon/2024/07/24/review-ultimate-ears-everboom-rugged-ultraportable-bluetooth-speaker/","image":"https://imageio.forbes.com/specials-images/imageserve/66a18c06030416063c870d95/0x0.jpg?format=jpg&crop=1600,901,x0,y346,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:35:54","author":"Brad Moon,Senior Contributor","authors":["Brad Moon","Senior Contributor"],"language":"en","source_country":"US","sentiment":-0.014},{"id":252556182,"title":"Impact of Kamala Harris as President on Social Security","text":"() — Lawmakers have less than a decade to fix Social Security. Otherwise, millions of Americans will see their benefits slashed, yet both political parties have been reluctant to address the issue. With President Joe Biden out of the 2024 race, the focus has shifted to Vice President Kamala Harris, and many are wondering what a potential Harris presidency could mean for retirees. Both Harris and former President Donald Trump have vowed to protect Social Security but have so far offered few specifics on how they would change the program. As a senator, Harris co-sponsored the Social Security Expansion Act, which would have increased benefits for some and changed how annual cost-of-living adjustments (COLA) are calculated. It also would have required wealthy Americans to pay more into the system. A major Social Security overhaul would require bipartisan cooperation on Capitol Hill, but here’s what a Harris administration may push for: Extend payroll tax to the wealthy The Biden administration has said it will address the solvency issue by asking “the highest-income Americans to pay their fair share.” If Harris takes a similar approach, she’ll likely push for expanding the payroll tax to include higher incomes. Currently, the primary source of income for Social Security is a dedicated payroll tax, which is capped at $168,600 for 2024 — any income above that isn’t subject to the tax. Biden’s reform plan suggested expanding the payroll tax to include earnings above $400,000. The legislation Harris co-sponsored in 2019 would have applied the tax to income above $250,000. Polling suggests eliminating the tax cap would have broad support, with 79% of Republicans and 88% of Democrats in favor of the $400,000 proposal, according to a 2022 survey. Opponents of the idea argue that getting rid of the taxable maximum could weaken the link between the amount individuals pay in Social Security taxes and the amount they receive in retirement benefits, the Peter G. Peterson Foundation noted in an article. There are also concerns such a change would distort labor supply decisions more than the current payroll tax. It’s also worth noting that Biden’s 2020 campaign promise to raise taxes on the wealthy hasn’t happened. Changing the COLA formula Each year, Social Security benefits are reassessed and adjusted for inflation. The annual calculation often results in a cost-of-living adjustment (COLA), which is based on the Consumer Price Index for Urban Wage Earners and Clerical Workers (CPI-W). CPI-W reflects the spending patterns of everyday Americans, but some argue that a different measure would be more accurate for older adults. Earlier this year, Senate Democrats introduced a bill that would change the way the COLA is calculated so it takes into account the Consumer Price Index for Elderly Consumers (CPI-E). The senators said the CPI-E is more reflective of the actual costs incurred by older adults, in part because medical expenses are weighted more heavily. Changing the COLA calculation wouldn’t solve the long-term funding issue, but it could lead to a higher annual benefit increase because it usually grows faster than the CPI-W index. Harris’ 2019 legislation also called for that change, a sign she’s in favor of it. Raising the primary insurance amount The primary insurance amount (PIA) is the money a person receives if they start collecting retirement benefits at their normal retirement age. It’s calculated based on a person’s average indexed monthly earnings, which essentially summarize what you made over your career and adjusts for inflation. If implemented, the Biden-Harris plan from 2020 would have provided a benefit bump up for older beneficiaries. Under that proposal, the benefit would gradually increase between ages 78 and 82, then reach 5% by age 82 and beyond, according to the Penn Wharton Budget Model. Increased benefits for low earners Benefits are primarily based on what workers made over their careers, meaning lower lifetime earnings correspond to lower benefits. For those with extremely low earnings, there’s a floor in place called the “special minimum benefit.” The Biden-Harris 2020 proposal called for an increase to the special minimum benefit of 5% to 50% for long-term low-earners with work histories between 10 and 30 years. The bill Harris co-sponsored in 2019 also called for an increase to the minimum benefit, which would vary depending on how long a person was in the workforce. In 2019, about 32,000 of the 64 million Social Security recipients qualified for the minimum benefit.","summary":"Internewscast Journal\n\nInternewscast\n\n\n() — Lawmakers have less than a decade to fix Social Security.&#8230;\n\n\nThis Post: Impact of Kamala Harris as President on Social Security first appeared on Internewscast Journal","url":"https://internewscast.com/news/impact-of-kamala-harris-as-president-on-social-security/","image":"https://www.newsnationnow.com/wp-content/uploads/sites/108/2024/07/GettyImages-2162466794.jpg?w=900","video":null,"publish_date":"2024-07-24 23:35:13","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.178},{"id":252556186,"title":"Have battlegrounds shifted with Harris at top of ticket?","text":"President Biden’s decision to drop out of the race and Vice President Kamala Harris’ rise to the top of the ticket have thrown the state of the race into question and possibly shifted the battleground strategy. Biden was trailing former President Donald Trump nationally in the Real Clear Politics polling average and the seven major swing states of Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin, but underlying data could reveal what Harris might do to change that. While polls showed Biden holding his own among older, white working-class voters, the president was starting to lose his grasp on Black and Hispanic voters, a key demographic for Democrats. Harris, on the other hand, has recently been outperforming Biden among Black voters, indicating there is room for her to gain ground on Trump in a close election. HARRIS REPEATS DEBUNKED CLAIM TRUMP WANTS TO 'BAN' ABORTION DURING FIRST CAMPAIGN RALLY SINCE BIDEN QUIT RACE According to one Politico/Morning Consult poll conducted last month, Harris held a 67% favorability rating among Black voters, compared to 23% who had an unfavorable view of the vice president. Biden, meanwhile, came in with a 63% favorable rating, compared to 31% who held an unfavorable view of the president. An NBC News poll conducted earlier this month revealed similar results when pitting both Biden and Harris against Trump, with Biden beating Trump 69% to 12% among Black voters, a 57-point lead, while Harris led the former president 78% to 14%, a 64-point advantage. When Biden was still in the race, most of the swing state attention was given to the so-called \"Blue Wall\" states in the upper Midwest of Michigan, Pennsylvania and Wisconsin. However, Harris’ strength among Black voters could lead the vice president to look south towards Georgia and North Carolina as opportunities to close the gap. DEM VOTERS AT MILWAUKEE RALLY SAY THEY'RE FIRED UP FOR HARRIS: 'UNITED AND ENERGIZED' According to 2020 census data, Georgia and North Carolina have a Black population of 31% and 20.5% respectively, far more than the populations of Michigan (13.7%), Pennsylvania (10.9%), and Wisconsin (6.4%). On the other hand, those states in the upper Midwest have a higher share of older White voters, a demographic in which Biden was outperforming Harris. Polling of a matchup between Trump and Harris is so far sparse, especially in battleground states, but there are some early indications that Harris may look south for help. One Landmark Communications poll, which was conducted Tuesday, shows Trump with just a one point lead over Harris in Georgia, a smaller advantage than most of the polling had previously shown the former president enjoyed in a matchup against Biden. CLICK HERE TO GET THE FOX NEWS APP While winning both Georgia and North Carolina would likely not be enough to put Harris over the top, her ability to put them in her column would open up several more viable paths to victory. Without them, Harris would likely need to win all of the other five swing states in order to get to 270 electoral votes. The Harris campaign did not immediately respond to a Fox News request for comment.","summary":"Vice President Harris&apos; emergence as the Democratic nominee could throw the strategy of the campaigns in different directions, with Harris targeting southern swing states.","url":"https://www.foxnews.com/politics/have-battlegrounds-shifted-harris-top-ticket","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/GettyImages-2162564210.jpg?ve=1&tl=1","video":null,"publish_date":"2024-07-24 23:35:07","author":"Michael Lee","authors":["Michael Lee"],"language":"en","source_country":"us","sentiment":-0.165},{"id":252556480,"title":"Top viral moments of Netanyahu’s fiery address to Congress amid protests","text":"Israeli Prime Minister Benjamin Netanyahu used his joint meeting address of Congress to rally support for his ongoing battle against Hamas terrorists in Gaza by laying out his “broader Middle East vision,” which was met with mixed reactions of rousing applause and protests. While he spoke, thousands of pro-Palestinian protesters surrounded the outside of the Capitol in response to his appearance on Capitol Hill. During his address, there were several notable highlights of his speech: NETANYAHU: PROTESTERS ARE ‘IRAN’S USEFUL IDIOTS” Netanyahu called out Iran for “funding and promoting anti-Israel protests in America” and suggested that protests outside the U.S. Capitol building were likely being funded by the regime. The prime minister took on the thousands of pro-Palestinian protesters surrounding the Capitol, calling them “Iran’s useful idiots.” “I have a message for these protesters: when the tyrants of Tehran who hang gays from cranes and murder women for not hiding their hair, are praising and promoting and funding you — you have officially become Iran’s useful idiots,” he declared. REP. RASHIDA TLAIB HOLDS ‘WAR CRIMINAL’ PROTEST SIGN DURING ADDRESS Squad member Rep. Rashida Tlaib (D-MI) sat during his speech while holding a sign that said “War Criminal” on one side and “Guilty of Genocide” on the other. One social media user gave praise to C-Span for its coverage of Tlaib’s appearance at Netanyahu’s address. “Honestly really loving the C-SPAN camera man who, right after Netanyahu shouts ‘useful idiots,’ cuts to Rashida Tlaib,” the social media user quipped. ISRAELI PM: PROTESTERS MIGHT AS WELL ‘HOLD UP SIGNS SAYING ‘CHICKENS FOR KFC’ “Some of these protesters — it’s amazing, absolutely amazing — some of these protesters hold up signs proclaiming ‘Gays for Gaza.’ They might as well hold up signs saying, ‘Chickens for KFC,'” Netanyahu slammed the protesters. Some protesters around Washington, D.C. waved their transgender and Palestinian flags on Wednesday. “They do realize that they would be executed in Gaza, right?!?” musician Chad Prather asked on social media. Netanyahu continued to take digs about the contradictions found among protest rhetoric. “These protesters chant ‘from the river to the sea’, but many don’t have a clue what river and what sea they’re talking about. They’re not only get an ‘F’ in geography. They get an ‘F’ in history,” the prime minister said before Congress. He added, “They called Israel a colonial state. Don’t they know that the land of Israel is where Abraham, Isaac, and Jacob prayed, where Isaiah and Jeremiah preached? And where David and Solomon ruled? For nearly 4,000 years, the land of Israel has been the homeland of the Jewish people. It’s always been our home. It will always be our home.” HE PRAISED THE NORTH CAROLINA FRAT BOYS The prime minister shared that he learned from U.S. intelligence that “Iran is funding and promoting anti-Israel protests in America.” “They want to disrupt America. So these protesters burn American flags even on the Fourth of July. And I wish to salute the fraternal brothers at the University of North Carolina who protected the American flag against these anti-Israel protesters,” he said. Netanyahu’s comments referred to a campus protest in May when a group of fraternity brothers at the University of North Carolina-Chapel Hill defended an American flag on the campus’s quad that protesters were attempting to take down. The video of the college students protecting the flag went viral. Pro-Palestinian demonstrators frequently have been seen taking American flags off of flag poles and replacing them with the Palestinian flag during protest events. On Wednesday outside Union Station in Washington, D.C., protesters were seen taking down the American flag while Netanyahu spoke before Congress. SEN. JOHN FETTERMAN WORE A SUIT Senator John Fetterman (D-PA), known for his hoodies and shorts attire, cleaned up in a black business suit for the prime minister’s address. The Pennsylvania senator has defied the progressive wing in his party over his alliance with Israel. Numerous viral social media posts of Fetterman interacting with pro-Palestinian protesters have shown his unwavering support for the country in the wake of the Oct. 7 attacks despite harsh criticism. Fetterman appearing in a suit has been a rare occasion. He has also been known to arrive in a tuxedo hoodie, as he did to the Washington Press Club’s annual dinner in January. NETANYAHU PRAISES TRUMP During Netanyahu’s address, the prime minister shared his relief that former President Donald Trump survived the “dastardly” assassination attempt, saying, “There is no room for political violence in democracies.” He continued his praise of Trump by thanking him for brokering the historic Abraham Accords, recognizing Israel’s sovereignty over the Golan Heights, and recognizing Jerusalem as their capital by moving the U.S. Embassy there. ELON MUSK ARRIVES AS A SPECIAL GUEST OF NETANYAHU Billionaire Elon Musk was invited as a guest of Netanyahu and sat with the Israeli prime minister’s wife, Sara Netanyahu, and other invited guests, including billionaire casino mogul Sheldon Adelson, rescued hostage Noa Argamani, and author Douglas Murray. Numerous Democrats, including former House Speaker Nancy Pelosi (D-CA), Democratic Whip Jim Clyburn (D-SC), Rep. Steve Cohen (D-TN) and Senate President Pro Tempore Patty Murray (D-WA), decided to not appear in protest of the Israeli prime minister’s speech before Congress. Vice President Kamala Harris, who under the Constitution serves as president of the Senate, declined to preside over the joint meeting and opted to give a keynote address at the historically Black Zeta Phi Beta sorority’s biennial convention in Indianapolis.","summary":"Israeli Prime Minister Benjamin Netanyahu used his joint meeting address of Congress to rally support for his ongoing battle against Hamas terrorists in Gaza by laying out his “broader Middle East vision,” which was met with mixed reactions of rousing applause and protests. While he spoke, thousands of pro-Palestinian protesters surrounded the outside of the [&#8230;]","url":"https://www.washingtonexaminer.com/news/world/3098313/top-viral-moments-netanyahus-fiery-address-congress/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/07/AP24206675831553.webp","video":null,"publish_date":"2024-07-24 23:33:35","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.099},{"id":252556244,"title":"Donald Trump Recycles Nickname for Kamala Harris in Latest Campaign Speech","text":"Trump told the crowd ... \"So now we have a new victim to defeat, Lyin' Kamala Harris.\" He even spelled it out ... \"L-Y-I-N apostrophe.\" Guess Trump didn't want folks thinking he was calling her \"Lion Kamala Harris.\"","summary":"Donald Trump is now going after Kamala Harris as his new would-be opponent come November -- and he's got a new nickname for her too ... even though it's technically old. The ex-Prez is out in Charlotte, NC for a campaign rally ... and he's taking&hellip;","url":"https://www.tmz.com/2024/07/24/trump-recycle-nickname-lyin-kamala-harris-campaign-speech/","image":"https://imagez.tmz.com/image/35/4by3/2024/07/24/355dc2af0555434b93223e8418fb7d10_xl.jpg","video":null,"publish_date":"2024-07-24 23:31:03","author":"TMZ Staff","authors":["TMZ Staff"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.903},{"id":252555906,"title":"Biden to deliver 1st remarks since dropping re-election bid. What to know","text":"U.S. President Joe Biden will deliver his first public remarks Wednesday evening since ending his campaign for a second term, where he is expected to lay out his reasoning and his goals for the rest of his presidency. Biden will speak in a primetime televised address from the Oval Office at 8 p.m. Eastern, delivering highly anticipated remarks that will also lay out his administrative record — a legacy Democrats now hope will be continued by Vice-President Kamala Harris, who Biden endorsed upon dropping out and has become the new presumptive nominee. “The president wants to build on those historical initiatives that he’s been able to get done,” White House press secretary Karine Jean-Pierre said Wednesday in previewing the speech. She pointed to sweeping domestic legislation, renewal of alliances abroad and other accomplishments Biden has achieved despite “a difficult political climate.” Harris, addressing the historically Black sorority Zeta Phi Beta in Indianapolis on Wednesday, previewed Biden’s remarks, saying, “He will talk about not only the work, the extraordinary work, that he has accomplished, but about his work in the next six months.” Biden made the shocking announcement he was ending his re-election bid in a letter posted to social media on Sunday, sending Democrats scrambling to find a new way forward with just over 100 days before the presidential election in November. The party quickly coalesced around Harris, with top lawmakers and a majority of delegates previously pledged to Biden offering their endorsements. The party also raised a record US$81 million in the 24 hours after Harris launched her campaign. That enthusiasm marked a rapid turnaround after three weeks of panic and growing calls for Biden to leave the race after the president’s disastrous debate performance last month, where Biden struggled to finish sentences and mount arguments against his Republican opponent Donald Trump. Over the ensuing 25 days, a growing number of Democratic lawmakers and notable party supporters made the case that Biden was no longer an effective candidate who could beat Trump, urging him to step aside. Donors stopped writing cheques, with some publicly stating they wouldn’t resume contributions until Biden was no longer the nominee. Biden at first remained defiant, including in high-profile interviews and press conferences where he defended his record and said only “the Lord Almighty” would convince him to drop his re-election bid. The campaign also insisted Biden was not leaving, including just hours before Biden issued his letter saying otherwise. Jean-Pierre, in her first briefing with reporters since last week, declined to answer many questions about what led to Biden’s decision, saying she did not want to get ahead of his remarks. She said the president met with “a small group of advisors” and his family on Saturday evening to weigh how to move forward, and let his staff know he was dropping out of the race moments before his written announcement Sunday afternoon. She also pushed back on suggestions Biden’s health led to his decision, and that it would inhibit his ability to serve the last six months of his term or even another four years. “I think it speaks to how honourable this president is, how selfless this president is, that he was able to make this decision and say, ‘This is not about me, this is about the American people, this is about the country,'” she said. “I think that speaks for itself.” Jean-Pierre also wouldn’t say if Harris would be more closely involved in the day-to-day business of running the country as she seeks to take over from Biden in the event she wins in November. “The president and the vice-president speak regularly, they see each other regularly,” she said. “The president is committed to being president and leading this country forward, in the way that he believes Americans want to see this country moving forward. And the vice-president is going to continue to be a critical partner. Nothing’s going to change in that.” Biden’s decision to end his candidacy also buoyed the spirits of congressional Democrats who had been fretting that the incumbent president would drag down their prospects of retaining the Senate and retaking the House of Representatives. Republicans, who currently control the House by a razor-thin majority, have already sought to undo some of the legislative achievements of the Biden administration — signaling they would further threaten Biden’s legacy with full control of Congress and the White House. —With files from the Associated Press","summary":"Biden will deliver a primetime televised address to the United States after dropping out of the 2024 election and endorsing his Vice-President Kamala Harris.","url":"https://globalnews.ca/news/10641276/biden-speech-us-campaign-harris/","image":"https://globalnews.ca/wp-content/uploads/2024/07/20240723110752-669fd1ff60536bd2ab34e72ajpeg_050b06.jpg?quality=85&#038;strip=all","video":null,"publish_date":"2024-07-24 23:30:57","author":"Sean Boynton","authors":["Sean Boynton"],"language":"en","catgory":"politics","source_country":"ca","sentiment":0.07},{"id":252555848,"title":"Letters: Remaking U.S. | Back Harris | White wash | Rhetorical game | Free speech","text":"Republican effort to remake U.S. terrifies If you haven’t seen it, you might want to read the synopsis of Project 2025. Essentially it’s a manifesto for Donald Trump to take over every aspect of American lives, but only to benefit him and his loyalists. They plan to remove government employees and agencies. They have no regard for non-Whites, LGBTQ, abortions, women, foreigners and non-Trumpists. There will be no need for Congress or the Supreme Court because all decisions will come from the demagogue himself and his self-designed army. Was “1984” a primer for Trump? How much surveillance will there be? How many jails and holding camps will they build for all those in opposition? Will they restore a vigorous execution system? They want to end American democracy as we know it. If you’re not concerned about this, then study Germany in 1939. Stuart Shicoff Martinez Back Harris to beat Trump at ballot box Presidents Biden and Obama are the two best presidents I have experienced in my lifetime. I applaud, admire and respect President Biden so much for sacrificing for our good and not focusing on himself. He and his team, including Vice President Harris, pulled us out of an extremely dark time. In November, we have two choices: democracy vs. dictatorship. It’s time to finally put aside gender and race and focus on the issues that matter to us all. If you haven’t yet read Project 2025, please read it. There’s a summary on Wikipedia so you don’t have to read 900 pages. It’s Donald Trump’s blueprint for a dictatorship and police state and covers all of the issues that are important to Americans. Kamala Harris is the most qualified and experienced individual who can beat Trump at the ballot box. It’s a no-brainer. Ramona Krausnick Dublin Democrats’ whitewashing of the coercion of Biden According to Martha Raddatz, ABC News, senior White House sources recently said that Joe Biden was lashing out at any suggestion of dropping out. But with a political tidal wave of Democratic elites knocking over his determination to continue running on the basis that he could not win, and after the final assault by Nancy Pelosi and Chuck Schumer, Biden was finally forced to resign from the race. A New York Times opinion piece calls this “a noble patriotic move; a selfless American giving up power willingly for the good of the country.” Coercion is more like it. This narrative is a Democratic Party line whitewashing reality which we will see repeated ad nauseum. Stephan Pinto Walnut Creek GOP’s dangerous rhetorical game still on Re: “Left is stoking outrage and anger” (Page A9, July 21). Shaun McCutcheon, chairman of the Coolidge Reagan Foundation, advocates for the shooting of protesters: “Rioters don’t riot where they will be shot.” He says that leftist leaders who were soft on protesters were the causes of the Donald Trump assassination attempt. This scary kind of thinking confirms the wisdom of voting for the best Democratic candidate in November. Steve Turnwall Lafayette Upcoming federal case pivots on free speech The case against the Uhuru 3 — Omali Yeshitela, Penny Hess, and Jesse Nevel — is a troubling challenge of our most important constitutional right. Progress in this country has come from its citizens speaking their mind and advocating for change, knowing they are protected by their First Amendment right. The outcome in this trial will be extremely important in securing our right to keep speaking freely and pushing for progress. Eric Swanson Emeryville","summary":"East Bay Times Letters to the Editor for July 25, 2024","url":"https://www.mercurynews.com/2024/07/24/letters-1808/","image":"https://www.mercurynews.com/wp-content/uploads/2024/07/AP24201057195827.jpg?w=1024","video":null,"publish_date":"2024-07-24 23:30:19","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.005},{"id":252556276,"title":"Mexican visits to B.C. fall after Canada adds visa requirement","text":"Canada's decision to require Mexican citizens to have visas in order to enter Canada starting this past Feb. 29 has prompted many Mexicans to stay home, or travel elsewhere, according to new visitor data. Immigration Refugees and Citizenship Minister Marc Miller made the surprising sudden announcement on Feb. 28, throwing a wrench into the works of many Mexicans who had already booked trips to come to Canada. His rationale was that it was a way to curb the number of asylum claims in Canada. Before Miller's one-day notice of the change, Mexicans had only been required to have electronic travel authorizations in order to visit Canada. Miller's announcement came with a ministry statement that \"most existing electronic travel authorizations for Mexican passport holders are being cancelled.\" The only exemptions that allow Mexicans to come to Canada without a visa are those who held a Canadian visitor visa in the last 10 years, or who currently hold a valid U.S. non-immigrant visa. Perhaps because so many Mexicans had already booked flights for March, that month's number of Mexicans coming to Canada via B.C. ports of entry was still up year-over-year, by 6.3 per cent, to 16,458, according to Destination British Columbia's breakdown of Statistics Canada data. That increase, however, was far below the 14.4-per-cent year-over-year increase, to 336,748, for overnight visits by residents of all nations to Canada via B.C. entry points in March. The drop in visits to Canada by Mexicans through B.C. started in earnest in April. Year-over-year overnight visits to Canada through B.C. by residents of all nations in April was up 4.6 per cent, to 338,805. The number of Mexicans in that tally, however, was down 42.2 per cent year-over-year to 10,526. That was the largest percentage drop among nationals of all countries. May data shows that the trend is continuing. B.C. tourism operators were having field days all month in May, as the number of overall overnight foreign visitors to Canada through B.C. entry points soared 17.1 per cent, to 515,073, compared with the same month in 2023. The number of Mexican visitors to Canada through B.C. in May, however, fell by 27 per cent, to 12,624. Once again, that was the largest percentage drop among nationals of all countries. The change to require Mexicans to have visas to enter Canada reverts to what was the case nearly eight years ago. Prime Minister Justin Trudeau had made good on his long-term pledge to allow Mexicans to enter Canada without needing visas starting Dec. 1, 2016. He made the announcement in June of that year, during Mexico's then-president Enrique Peña Nieto’s two-day state visit to Canada, which also saw Mexico agree to lift restrictions on Canadian beef. Airlines loved the news. Aeromexico upped its weekly flight frequencies to Mexico City out of Vancouver International Airport (YVR) to 10 from seven, and started using bigger planes starting as soon as the visa restrictions were dropped. Within a year, Interjet became the seventh airline to fly non-stop flights between YVR and Mexican destinations. Mexican visits to Canada through B.C. entry points soared in 2017. Abbotsford International Airport general manager Parm Sidhu told BIV in late 2017 that his airport was seeing a spike in travel to Mexico. His airport expected three non-stop flights per week to Mexico in the 2017-18 fall and winter versus only one weekly non-stop flight to Mexico the previous year. Former U.S. president Donald Trump's January 2017 inauguration as president came a little more than a month after Canada lifted its visa requirements on Mexicans. Some speculated that Mexicans had soured on visiting the U.S. because of Trump's anti-immigration policies and disparaging language about Mexicans, but the reason was more likely related to the ease in which they could newly come to Canada. The number of Mexican travellers to Canada through B.C. jumped to 13,573 in December 2016, according to Destination British Columbia. That was up 69.1 per cent from the same month in 2015. The number of visits obviously tanked during the COVID-19 pandemic, but Mexicans were quick to return to visiting Canada after pandemic restrictions eased.. The take-away lesson from the surge and decline in Mexican visits to Canada through B.C. is that requiring travellers to get visas in order to visit a country is a good way to deter visits. Fortunately for Canadians, the country's passport is the strongest one in the Americas, with access to 187 of 227 countries, according to passport analytics firm Henley & Partners. Canada ranks below 23 nations for the number of countries where nationals can visit visa-free, and is tied with Czechia, Hungary and Malta. U.S. passport holders can only access 186 of those nations visa-free. The differences between Canada and the U.S. on visa-free access include that Canadians can enter Uzbekistan and Belarus without visas, whereas Americans need visas for those countries. Americans, however, can enter Egypt without a visa, whereas one is required of Canadians, according to Henley & Partners.","summary":"Canada in February gave Mexicans one day's notice that it was reimposing a requirement for them to get visas for entry, with few exemptions","url":"https://www.biv.com/news/hospitality-marketing-tourism/mexican-visits-to-bc-fall-after-canada-adds-visa-requirement-9263705","image":"https://www.vmcdn.ca/f/files/biv/aeromexico-submitted.jpg","video":null,"publish_date":"2024-07-24 23:30:00","author":"Glen Korstrom","authors":["Glen Korstrom"],"language":"en","source_country":"ca","sentiment":-0.574},{"id":252555888,"title":"Rewind Dubrovnik CEO Shares Bourdain-Like Spots Only Reachable By Boat","text":"Share to Facebook Share to Twitter Share to Linkedin A Rewind Dubrovnik boat tour in the Adriatic Sea. Courtesy of Rewind Dubrovnik Dubrovnik is one of my favorite cities in the world. It’s filled with history, medieval eeriness, a vibrant city, amazing food and wine, great people, and the perfect Adriatic Sea at your fingertips. In one day you can stroll around the walled city, visit museums and galleries, eat gelato, and hit a beach club all before sunset. Last summer I randomly ended up on a boat with Lukša Malohodžić, CEO of Rewind Dubrovnik, an anything-but-ordinary boat tour company. A perfect stranger at the moment, I quickly learned that Lukša was more after chasing experiences and life vs. just another tour. “I started Rewind because of my deep love for boats and islands,” says Malohodžić. The idea is to create experiences that you wish to rewind and relive, hence the company’s name. “I wanted to show people that there are so many beautiful coves and amazing gastronomic delights on the islands, where most of the ingredients are sourced locally from the land and waters surrounding these islands,” he says. “Additionally, I wanted to help people escape the crowds and busy streets of Dubrovnik.” Boat tours are a dime a dozen in these parts but Malohodžić’s aim was to stand out and be different. “I wanted to combine great food, the sea, and unique experiences,” he says. “The idea for a wine tour came naturally after meeting Mr. Mato, a wine producer on Šipan Island,” he adds. “Together, we created several memorable experiences.” On the boat, expect lots of laughter, memories, and of course, there’s always a cold beverage within arm’s reach. From hidden wineries to an oyster farms of your dreams, here are five of Malohodžić’s current favorite stops, only reachable by boat: Mr. Mato Goravica chatting with guests on a Rewind Dubrovnik tour. Courtesy of Rewind Dubrovnik Goravica Winery (Šipan Island) Calling all Anthony Bourdain fans, this spot is off-the-beaten-path. In fact, you may never find it without hopping on a boat with Malohodžić. “This Bourdain-style experience offers superb wines with four varieties grown on Šipan Island,” he says. “Guests enjoy an intimate and fun experience at winemaker Mr. Mato Goravica’s house, where they can relax and chat directly with him,” he says — while enjoying a perfect mali plavac summer rosé alongside semi-hard goat cheese soaked in oil and cured meats. It’s so serene you’ll forget where you are. A view of Mandrač Restaurant by boat. Courtesy of Rewind Dubrovnik MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out Mandrač Restaurant (Lopud Island) “If you appreciate slow food and local sweets, Mandrač is a must-visit,” says Malohodžić. “Owner Tilda makes the best carob cake with carob sourced directly from Mr. Mato Goravica's estate on Šipan Island.” It’s a perfect before-noon stop to fuel up on coffee and freshly baked cakes, pies and sweets before island hopping. A waterfront lunch at Restaurant Stara Mlinica. Courtesy of Rewind Dubrovnik Restaurant Stara Mlinica (Šipan Island) A restaurant far removed from the crowds of Dubrovnik and perhaps one of the most delicious and local lunches you’ll have in Croatia. “For lovers of fresh, wild-caught fish grilled over a wooden fire, Stara Mlinica offers a fantastic seaside setting,” says Malohodžić. “The restaurant, built on a 300-year-old olive oil mill, was once the sole mill supplying the Elaphiti Islands.” The restaurant’s terrace sits right on the sea and it’s just one of those meals you’ll never forget. Dancing at sunset on a Rewind Dubrovnik tour. Courtesy of Rewind Dubrovnik Pelješac Peninsula Oyster Farms “It’s an immersive experience in oyster farming with as many fresh oysters as you can eat,” says Malohodžić. Challenge accepted. “Our tour to Pelješac Peninsula, with Mr. Dubo, is unbeatable,” he adds. “Guests learn to open oysters and enjoy them freshly with a squeeze of lemon.” What’s more local than that? BOWA, accessible only by boat. Courtesy of Rewind Dubrovnik BOWA (Šipan Island) BOWA, which stands for “best of what’s around,” is simply this in the form of an ultra chic, private beach with cabanas that’s only accessible by boat. The restaurant’s menu is filled with freshly caught fish and sea snacks, plus a stellar Croatian wine list. “It’s a place where guests can pamper themselves and feel like movie stars,” he says. In the coming months, Malohodžić plans to expand Rewind into the Hvar and Split areas of Croatia, offering the same gastronomic-meets-maritime experiences. Jenn Rice Following Editorial Standards Print Reprints & Permissions","summary":"From oyster farms to a hidden winery, Rewind Dubrovnik CEO Lukša Malohodžić shares his five favorite gastronomy stops only reachable by boat.","url":"https://www.forbes.com/sites/jennrice/2024/07/24/rewind-dubrovnik-ceo-shares-bourdain-like-spots-only-reachable-by-boat/","image":"https://imageio.forbes.com/specials-images/imageserve/66a1878459d2f6ce0a4b05e8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:29:26","author":"Contributor,Jenn Rice","authors":["Contributor","Jenn Rice"],"language":"en","source_country":"US","sentiment":0.801},{"id":252556114,"title":"Trump attacks Harris on immigration in first rally since Biden bowed out","text":"The president returned to Washington on Tuesday afternoon after isolating with COVID-19 at his home in Delaware, where he made the announcement that he was ending his campaign. Earlier on Wednesday, the 59-year-old vice president called on a rally of more than 6,000 Black women in Indianapolis to help her revitalise the Democratic campaign. The Democratic National Committee's rules committee agreed on Wednesday on a plan to formally nominate Harris as soon as Aug 1 - before the party's Aug 19-22 convention in Chicago - with Harris picking a running mate by Aug. 7. Harris spoke at an event in Indianapolis hosted by the Zeta Phi Beta Sorority, which was founded at Howard University, the historically Black college she attended. She hopes to tap sororities' multi-generational network of Black women - who played an important role in Biden's 2020 victory - to deliver strong voter turnout for Democrats again in November. \"I thank you. And now, in this moment, our nation needs your leadership once again,\" Harris said. Harris and Trump are closely competitive, public opinion polls showed this week. A Reuters/Ipsos poll completed on Tuesday showed Harris with a marginal two-percentage-point lead over Trump, 44 per cent to 42 per cent. A CNN poll conducted by SSRS showed Trump leading Harris, 49 per cent to 46 per cent. Both findings were within the polls' margins of error. BIDEN TO SPEAK Trump, coming off a triumphant week in which his party unified around his presidential bid after a failed assassination attempt two weekends ago, has had to watch as Biden's sudden departure from the race shifted the narrative and sparked a surge of attention toward Harris at his expense. Hillary Clinton, the 2016 Democratic nominee who lost to Trump, said in an opinion piece in the New York Times, that she was excited about the Harris candidacy. \"She represents a fresh start for American politics. She can offer a hopeful, unifying vision. She is talented, experienced and ready to be president. And I know she can defeat Donald Trump,\" Clinton said. Harris campaign chair Jen O'Malley Dillon said in a memo made public on Wednesday that Democrats would aim to compete in the swing states of Michigan, Wisconsin, Pennsylvania, North Carolina, Georgia, Arizona and Nevada, opening up a map that in the final weeks of Biden's campaign had appeared to be more focused on the Midwest. \"This race is more fluid now – the vice president is well-known but less well-known than both Trump and President Biden, particularly among Dem-leaning constituencies,\" O'Malley Dillon wrote. The Harris campaign on Wednesday said it has raised US$126 million since Sunday, with 64 per cent of donors making their first contribution of the 2024 campaign.","summary":"","url":"https://www.channelnewsasia.com/world/donald-trump-presidential-campaign-rally-kamala-harris-immigration-policy-4501246","image":"https://onecms-res.cloudinary.com/image/upload/s--6J9wHYmR--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/election_2024_trump_47579.jpg?itok=2q9_-vTE","video":null,"publish_date":"2024-07-24 23:27:51","author":null,"language":"en","catgory":"politics","source_country":"sg","sentiment":-0.107},{"id":252555682,"title":"Civit AI Film Contest, A New AI Feature, Dishwashing Cats, More AI Videos","text":"Share to Facebook Share to Twitter Share to Linkedin Project Odyssey, Civitai's cinematic AI competition, just concluded its submission phase. Categories are 3D animation, music video, narrative, experimental art, and behind-the-scenes. Winners will be announced July 29th. Submissions can be seen on their website. The total purse is $28,000 in cash and credits. Poster for the upcoming AI movie from Pigeon Shrine. Pigeon Shrine Pigeon Shrine, a New AI Movie Company, Out of Stealth With Finished Feature Film, “Where the Robots Go.” The first full-length AI-generated film made by a single studio. Founded by director Tom Paton (Black Site, Redwood, and 400 Bullets), Pigeon Shrine has secured $2 M in funding from investors, including Empire Studios and entrepreneur Steve Mosley, enabling the production of two feature films and the development of an advanced AI content production pipeline. Paton wrote and directed the company's debut film, an 87-minute narrative about a robot in a new world that was redefined by the last human child. The film utilizes a combination of AI and traditional filmmaking tools, including Midjourney, Runway, and DaVinci Resolve. Real actors provided the voices, enhanced through a technique called VoCap, which modifies voices to fit multiple characters. “Dream Club” is a trippy short AI video from Jeff Synthesized. An AI filmmaker based in Los Angeles, has been creating AI-integrated projects (AIIP) for the past year. He says he dedicates about 16 hours a day, six days a week, to his craft, combining his expertise in editing, compositing, and color grading with extensive knowledge of AI tools. Jeff utilizes a range of software, including Runway, Midjourney, HaiperAI, Studio D-ID, Suno, Udio, After Effects, and DaVinci Resolve, to bring his narrative and conceptual projects to life. MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out Metapuppet premieres his AI horror short film \"Mother.\" The Emmy Award-winning editor and award-winning screenwriter, goes by his YouTube handle. “Mother” was brought to life using 22 different AI programs. Initially shot live-action with his wife on a green screen, the scenes were later re-generated using LumaLabs’ Dream Machine, totaling around 998 generations. Key tools included Midjourney and Leonardo for image creation, ElevenLabs for voice modification, and Runway for background removal. Metapuppet’s daughter contributed as the little girl's voice, animated using D-ID. Metapuppet says he thinks that AI expands access to untold stories, offering new tools to enhance storytelling while reducing costs and speeding up production workflows. These dish washing cats are not real. This was created by Tik Tok influencer Pet Pixels Studios using Kling AI. I am a sucker for talking animals, which is why I went bonkers when I saw a whole channel of dishwashing cats on TikTok. Thanks to Fingen for the share. Follow me on Twitter or LinkedIn. Check out my website or some of my other work here. Charlie Fink Following Editorial Standards Print Reprints & Permissions","summary":"Rapid improvements in AI video generation tools, like Runway, Kling, Luma's Dream Machine, and Hapier, are enabling more cinematic and realistic films.","url":"https://www.forbes.com/sites/charliefink/2024/07/24/civit-ai-film-contest-a-new-ai-feature-dishwashing-cats-more-ai-videos/","image":"https://imageio.forbes.com/specials-images/imageserve/66a189df0effa9ecc2b2386e/0x0.jpg?format=jpg&crop=1902,1069,x297,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:27:02","author":"Charlie Fink,Contributor","authors":["Charlie Fink","Contributor"],"language":"en","source_country":"US","sentiment":0.276},{"id":252555680,"title":"Enhancing Brand Awareness Through Innovative Storytelling","text":"Share to Facebook Share to Twitter Share to Linkedin Keanu Reeves stars in the epic \"This Is Precision AI\" marketing campaign from Palo Alto Networks. Image credit Palo Alto Networks Capturing the attention of an increasingly distracted audience is a challenge that requires more than just traditional advertising. It demands storytelling—a creative, engaging, and innovative approach that resonates on a deeper level. Palo Alto Networks' latest global brand campaign, \"This is Precision AI,\" illustrates how effective storytelling can elevate brand awareness and redefine the narrative around complex topics like cybersecurity. The Campaign: Blending Hollywood Magic with Cybersecurity Palo Alto Networks launched its groundbreaking campaign with a series of digital and broadcast ads featuring none other than Keanu Reeves, directed by the acclaimed David Leitch. The campaign aims to highlight the critical role of Precision AI in combating cyber threats in our AI-driven future. The star-studded team behind the campaign includes industry leaders in film and advertising, ensuring a production quality that rivals Hollywood blockbusters. Have you seen the ads? The first time I saw the Precision AI ad, I thought it was a trailer for an upcoming movie. I recognized Keanu Reeves and assumed this was going to be a teaser for a sci-fi blockbuster. MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out The Importance of Storytelling in Marketing Of course, not everyone can afford Keanu Reeves or launch a campaign on par with a Hollywood blockbuster. The good news is that you don’t need all of that as long as you can tell a good story. Effective storytelling is more than just a buzzword; it's a powerful tool that can transform how a brand communicates with its audience. In the crowded marketplace, where consumers are bombarded with countless messages daily, a well-crafted story can cut through the noise and capture attention. By weaving narratives that resonate emotionally, brands can create a deeper connection with their audience, fostering loyalty and trust. Storytelling allows companies to convey their values, mission, and the human side of their operations, making them more relatable and memorable. Furthermore, stories have the power to make complex ideas more accessible and engaging, turning mundane marketing messages into compelling content that inspires action. Ultimately, effective storytelling not only enhances brand perception but also drives consumer engagement and business growth. In the case of Palo Alto Networks, the use of a narrative-driven campaign allows them to present cybersecurity—a typically technical and dry subject—in a compelling and relatable way. This Is Precision AI Featuring a universally recognized and beloved figure like Keanu Reeves immediately grabs attention. His association with iconic roles that embody resilience and fighting against the odds—like Neo in “The Matrix” movies, or the tenacious John Wick—perfectly aligns with the campaign’s message of combating cyber threats. The involvement of top-tier talent in direction, music, visual effects, and production design ensures that the campaign is not only visually stunning but also emotionally impactful. This high production quality helps to elevate the brand and convey a sense of professionalism and seriousness about the subject matter. I spoke with Palo Alto CMO Unnikrishnan KP about the campaign. He explained, “A couple of key things that we're trying to do in marketing is really look at how do we change the typical technical nuts and bolts conversation—which we still need to have, obviously, with the right audience—but also make it more creative and enticing to people, to really connect with us?” By creating a mini-movie style ad, Palo Alto Networks can evoke emotions that a traditional advertisement simply can't. This emotional connection helps to make the message more memorable and impactful, fostering a deeper connection with the audience. Key Takeaways from the Campaign Creative Approach to Complex Topics: The campaign successfully transforms the typically grim and technical field of cybersecurity into an engaging and dynamic narrative, making it accessible to a broader audience. Leveraging Star Power: The choice of Keanu Reeves, combined with high-profile industry experts, adds significant appeal and credibility, helping to draw in viewers who might otherwise overlook cybersecurity content. Precision AI as the Hero: The campaign emphasizes Palo Alto Networks' innovative approach with Precision AI, highlighting its role in providing real-time, automated, and precise cybersecurity solutions. Impactful Metrics: Within the first 30 days of launch, the campaign achieved a 45% increase in website engagement and 7.1 million video views, demonstrating its effectiveness in capturing and retaining audience attention. Sustained Engagement Strategy: Rather than a one-off event, the campaign is part of a longer narrative arc, ensuring continuous engagement and education about cybersecurity threats and solutions. The Future of Marketing Campaigns Palo Alto Networks' \"This is Precision AI\" campaign sets a new standard for how companies can approach marketing complex products and services. By integrating high-quality storytelling, leveraging recognizable talent, and maintaining a continuous engagement strategy, brands can not only raise awareness but also foster a deeper understanding and appreciation of their offerings. “This is a continuous drum beat that we're going to continue through ongoing activities, digital, and more of those brand initiatives coming in sponsorships,” shared Unni. “It's a journey that we're building across the board to really continue the awareness and the brand visibility through these initiatives.” With fierce competition for attention, this campaign exemplifies the value of innovative and engaging marketing strategies. It shows that by thinking outside the box and investing in creative storytelling, brands can not only stand out but also make a lasting impact on their audience. Follow me on LinkedIn. Check out my website. Tony Bradley Following Editorial Standards Print Reprints & Permissions","summary":"Palo Alto Networks sets a high bar for engaging storytelling and innovative marketing with its \"This Is Precision AI\" campaign, starring Keanu Reeves.","url":"https://www.forbes.com/sites/tonybradley/2024/07/24/enhancing-brand-awareness-through-innovative-storytelling/","image":"https://imageio.forbes.com/specials-images/imageserve/66a18d5df804927a13cd34f6/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:26:44","author":"Senior Contributor,Tony Bradley","authors":["Senior Contributor","Tony Bradley"],"language":"en","source_country":"US","sentiment":0.404},{"id":252555902,"title":"Megadonors Send Millions to Trump, Biden Funds in June: Filings","text":"Big money partisan donors and dark money funds rallied behind their chosen candidates in June, according to federal filings. Between July 15 and July 20, every committee registered with the Federal Election Commission issued financial statements covering their recent activity. According to the documents, committees working to aid the Trump campaign cumulatively held about $15.6 million more than those helping the Biden campaign entering July. At the end of June, a group of campaign committees, political action committees, and joint fundraising committees working to boost former President Donald Trump’s candidacy had about $296.8 million in cash on hand. By comparison, a group of campaign committees, PACs, and joint fundraising committees working on behalf of former President Joe Biden reported a total of $281.1 million in cash on hand. On July 21, President Biden dropped out of the presidential race after weeks of intense political pressure. Later the same day, he endorsed Vice President Kamala Harris to take his place and receive the Democratic Party’s nomination for president. On July 22, Ms. Harris secured the support of the necessary number of delegates to make her the likely nominee. Shortly after President Biden’s announcement, all of the committees associated with his run rebranded as Harris for President, Harris Action Fund, and Harris Victory Fund. Nevertheless, there are questions surrounding the legality of Ms. Harris using the money raised for President Biden. The FEC’s bipartisan, six-member commission may ultimately settle the issue. In June, the committee collected three $5 million contributions from previous donors: Robert Bigelow, Linda McMahon, and RAI Services Co. With his gift, Mr. Bigelow, the founder, president, and program manager of Bigelow Aerospace in North Las Vegas, Nevada, brought his total 2024 support for the super PAC to about $14.2 million. Ms. McMahon, administrator of the Small Business Administration during the Trump presidency, increased her total support to $10 million so far this year. The wife of former World Wrestling Entertainment CEO Vince McMahon, she was a significant supporter of former President Trump’s 2020 run. Then, she led the super PAC America First Action Inc. RAI Services is part of British American Tobacco p.l.c. Through June, the group gave $8.5 million to MAGA Inc. According to federal donor records, RAI Services is backing Republican and conservative causes in the 2024 election cycle. Along with those gifts, MAGA Inc. received six $1 million contributions. Two came from former Sen. Kelly Loeffler, who is now chair of the nonprofit Greater Georgia Action Inc., and her husband, Jeff Sprecher, the CEO of Intercontinental Exchange Inc. Both have previously supported Trump-related causes. Another million-dollar check was written by Patricia Duggan, the wife of Summit Therapeutics Chairman and CEO Bob Duggan. In 2020, both were multimillion-dollar supporters of America First Action, according to donor records maintained by watchdog group OpenSecrets. Three business leaders also gave $1 million gifts in June: Thomas Klingenstein, Benjamin Leon Jr., and Roger Penske. Mr. Klingenstein is a principal in the investment firm Cohen Klingenstein LLC. He is also the chairman of the Claremont Institute, a conservative think tank founded in 1979. “[Mr. Klingenstein] believes that we are in a cold civil war and that our enemy—what he calls the ‘Woke regime’—are winning, in large measure, because Republican leaders have yet to engage,” a biography page for him on the Institute’s website said. As a donor, Mr. Klingenstein is a consistent six-figure supporter of the conservative super PAC Club for Growth Action and a regular contributor to Republican causes, according to OpenSecrets records. Born in Cuba, Mr. Leon is the founder and chairman of Miami-area health service provider Leon Medical Centers. In his political giving career, Mr. Leon supported both Republican and Democratic causes and candidates. However, according to OpenSecrets records, his largest gifts typically go to conservatives. Mr. Penske is chairman and CEO of Penske Corp. Inc., a diversified transportation and automobile services company. According to donor records maintained by OpenSecrets, Mr. Penske and his privately owned company are not major political donors, but they typically support Republican and conservative causes. The MAGA Inc. gift is the largest of Mr. Penske’s giving career. According to FEC records, 36 donors gave more than $800,000 to the joint fundraising committee Trump 47 Committee Inc. during the second quarter. Notable contributors included Winklevoss Capital co-founders Tyler Winklevoss and Cameron Winklevoss, Home Depot Inc. founder Bernie Marcus, ABC Supply co-founder Diane Hendricks, Jimmy John’s founder James Liautaud, Miriam Adelson, owner of the Las Vegas Sands Corp., and Jared Kushner, a former senior adviser in the Trump White House, and Kushner Companies founder Charles Kushner. The largest check came from a 501(c)(4) nonprofit that shares a key officer with the hybrid PAC. Future Forward USA Action sent the committee about $15.2 million in June. Those donations brought the total 2024 support of the PAC to about $27.3 million. According to its most recent tax filings, Future Forward Action is led by Chauncey McLean. Mr. McLean is listed as the PAC’s treasurer. The PAC and the nonprofit also share a Capitol Hill address. As a 501 nonprofit, Future Forward is not required to disclose its donors. For that reason, 501s are often called dark money groups. Future Forward PAC also received a $5 million contribution from a fund linked to Open Society Foundations founder George Soros. In June, Democracy PAC sent $5 million to Future Forward, bringing its total 2024 giving to the PAC to $10 million. According to FEC records, Democracy PAC has received repeated donations from Mr. Soros since its inception in 2019. The fund’s largest backer is the 501(c)(4) nonprofit Fund for Policy Reform. George Soros’s son, Alexander Soros, is listed as a director for the Fund in its most recent tax filing. Reid Hoffman, the founder of LinkedIn Corp., sent $3 million to Future Forward in June. According to watchdog group OpenSecrets, Mr. Hoffman is the largest individual supporter of Democratic candidates and causes in the 2024 cycle in terms of total dollars and has now given $10 million to Future Forward in 2024. Another technology figure, ex-Google chief Eric Schmidt, sent $1.6 million to Future Forward in June. Mr. Schmidt is the chair of the technology think tank The Schmidt Special Competitive Studies Project LLC. According to donor records maintained by OpenSecrets, Mr. Schmidt is a limited donor to the Democratic Party and liberal causes. Future Forward also got $1 million in contributions from Amos Hostetter and the Laborers’ International Union of North America. Mr. Hostetter is the chairman of Pilot House Associates LLC and the co-founder of the Barr Foundation. LIUNA is a labor union that’s endorsed President Biden. Two notable donors combined to make a $1 million contribution to Future Forward, too. According to FEC records, James Murdoch, the son of international media titan Rupert Murdoch and ex-head of 21st Century Fox, and his wife, Kathryn Murdoch, both gave $500,000 to the PAC. The Murdochs are co-founders of the Quadrivium Foundation. James Murdoch is also the CEO of Lupa Systems. According to OpenSecrets donor records, Kathryn Murdoch is a consistent, multimillion-dollar supporter of liberal causes. Additionally, the main Biden joint fundraising committee at the time, the Biden Victory Fund, collected 10 donations of more than $800,000. Two heirs of the Simon family fortune, Cynthia Simon Skjodt and Debbie Simon, combined to give about $1.9 million. Jill Glazer, the wife of Tampa Bay Buccaneers and Manchester United owner Avram Glazer, gave about $929,000. Matt Cohler, a general partner at venture capital firm Benchmark, sent about $929,000. Bloomberg LP founder Michael Bloomberg donated about $929,000. Laura Katzenberg, daughter of media mogul Jeffrey Katzenberg, gave about $929,000. Adam Lewis, grandson of Progressive Corp. co-founder Joseph Lewis, and his wife, Melony Lewis, both sent about $929,000. Ellen Bronfman Hauptman, an heir to the Seagram’s beverage fortune built by the Bronfman family and the co-chair of private investment firm Andell Holdings, gave $923,000. Robert Pohlad, a leader of the Pohlad Cos., gave $923,000.","summary":"Loyal Democratic and Republican megadonors and new contributors plowed huge sums into political action committees boosting the 2024 presidential candidates.","url":"https://www.theepochtimes.com/us/megadonors-send-millions-to-trump-biden-funds-in-june-filings-5692993","image":"https://img.theepochtimes.com/assets/uploads/2024/07/19/id5689538-07152024-DSC01322-RNC-2024-Trump-Vance-DonaldsKO-300x180.jpg","video":null,"publish_date":"2024-07-24 23:25:46","author":"Austin Alonzo","authors":["Austin Alonzo"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.061},{"id":252556302,"title":"New video shows body on roof in Trump assassination attempt","text":"Soon after the attempted assassination of Donald Trump, local law enforcement officers and a U.S. Secret Service agent discussed how pictures of the shooter were shared among officers by a sniper who lost sight of him before he opened fire, a newly released video showed. The three-minute video was recorded on the body-worn camera of an officer from the Beaver County Emergency Services Unit who was at the Trump campaign rally on July 13 in the rural western Pennsylvania town of Butler, and released on Tuesday by U.S. Senator Chuck Grassley. The video shows local law enforcement officers and the Secret Service agent on a roof near the shooter’s body about an hour after the attack discussing how photos of the gunman, 20-year-old nursing-home aide Thomas Crooks, were shared among law enforcement officers by a sniper who lost sight of Crooks before the shooting. It was unclear from the video how long before the shooting the pictures of Crooks were circulated. Crooks’ bleeding body can be seen a few steps away from the officers on the roof. One of the officers gestures to a semi-automatic rifle near the body. Crooks was able to crawl across the roof overlooking Trump’s rally and fire eight bullets from a semi-automatic rifle before he was fatally shot by a Secret Service sniper on top of another building, according to law enforcement accounts. Crooks killed one man in the crowd and seriously wounded two others. Trump was wounded in his right ear. Crooks’ motive remains unclear. He registered as a Republican soon after turning 18. Before the attack, his internet search history shows him researching how Lee Harvey Oswald killed President John F. Kennedy in 1963, FBI Director Christopher Wray told a congressional hearing on Wednesday. Secret Service Director Kimberly Cheatle, whose agency is responsible for the safety of U.S. presidents and other senior officials, resigned on Tuesday after her own congressional hearing. Trump, who served as president from 2016 to 2020, is seeking to be returned to the White House in November’s election.","summary":"Soon after the attempted assassination of Donald Trump, local law enforcement officers and a U.S. Secret Service agent discussed how pictures of the shooter were shared among officers by a sniper who lost sight of him before he opened fire, a newly released video showed.","url":"https://www.staradvertiser.com/2024/07/24/breaking-news/new-video-shows-body-on-roof-in-trump-assassination-attempt/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/07/web1_2024-07-24T182409Z_1_LYNXMPEK6N0WU_RTROPTP_3_USA-ELECTION-TRUMP-BODYCAM.JPG","video":null,"publish_date":"2024-07-24 23:25:00","author":"Reuters","authors":["Reuters"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.19},{"id":252556478,"title":"Mark Robinson blasts Democrats for DC anti-Israel protest ahead of Trump rally","text":"North Carolina Lt. Gov. Mark Robinson slammed Democrats after anti-Israel demonstrations erupted in Washington, D.C., and as former President Donald Trump holds a rally in his state on Wednesday. Thousands of pro-Palestinians gathered in the nation’s capital on Wednesday to protest Israeli Prime Minister Benjamin Netanyahu‘s address to Congress. Videos shared on social media showed demonstrators assaulting police near Union Station and reportedly threatening to kill pro-Israel counterprotesters. Robinson, the Republican candidate for governor in North Carolina, took to social media to criticize protesters for pulling down and burning the American flag and lifting a Palestinian flag in its place. He took it a step further by blaming Vice President Kamala Harris and Democratic lawmakers for not attending the prime minister’s address. “These are the radical activists that @kamalaharris & supporters are placating by boycotting the Israeli prime minister’s speech to Congress,” the Republican North Carolinian said in a post to X. His words come as Trump holds a rally in his battleground state. “Josh Stein, Kamala Harris and the Democrats side with Hamas terrorists. The rest of us stand with Israel,” Robinson continued. While Harris did not attend Netanyahu‘s address to Congress on Wednesday, the White House said her support for Israel remains “unwavering.” Robinson is North Carolina’s first black lieutenant governor, and he is challenging Democratic Attorney General Josh Stein in a bid to succeed Gov. Roy Cooper (D-NC). While Stein has largely steered clear of a concrete position on the Israel-Gaza conflict, some critics say that the Harvard graduate has failed to sufficiently condemn antisemitic protests on college campuses. If elected, Stein would be North Carolina’s first Jewish governor. Robinson is a controversial figure for past comments and actions, such as Facebook posts he made in 2017 and 2017 that critics say downplayed the Holocaust. “I am so sick of seeing and hearing people STILL talk about Nazis and Hitler and how evil and manipulative they were. NEWS FLASH PEOPLE, THE NAZIS (National Socialist) ARE GONE! We did away with them,” Robison wrote in 2017. Robison has since backtracked his remarks, saying in October, “There have been some Facebook posts that were poorly worded on my part, did not convey my real sentiments, and I have addressed those issues and moved on from those issues.” The Washington Examiner reached out to the Robinson and Stein campaigns.","summary":"North Carolina Lt. Gov. Mark Robinson slammed Democrats after anti-Israel demonstrations erupted in Washington, D.C., and as former President Donald Trump holds a rally in his state on Wednesday.&#160; Thousands of pro-Palestinians gathered in the nation’s capital on Wednesday to protest Israeli Prime Minister Benjamin Netanyahu‘s address to Congress. Videos shared on social media showed demonstrators [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/state/3098418/mark-robinson-blasts-democrats-dc-anti-israel-protest-trump-rally/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/06/AP24146676655043.jpg","video":null,"publish_date":"2024-07-24 23:24:44","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.512},{"id":252555654,"title":"Obama's inner circle signals 44th president firmly behind Harris despite not saying so publicly","text":"Former President Obama has not yet endorsed Vice President Kamala Harris as the Democratic nominee for president, though allies in the Obama orbit indicate the 44th president is squarely behind Harris’ campaign. President Biden dropped out of the 2024 race Sunday afternoon in a letter posted to his X account, which was shortly followed by him endorsing Harris for president. Democrats nationwide soon united in their calls for Harris to become the party’s nominee as they square up for another election battle against former President Donald Trump. Though Democratic leaders such as Sen. Chuck Schumer and Rep. Hakeem Jeffries, as well as the Clintons and former House Speaker Nancy Pelosi have offered Harris their endorsements, Obama has remained mum. \"Michelle and I just want to express our love and gratitude to Joe and Jill for leading us so ably and courageously during these perilous times — and for their commitment to the ideals of freedom and equality that this country was founded on,\" Obama wrote in his statement following Biden bowing out, which did not including mentioning Harris. GROWING LIST OF OBAMA ALLIES, FORMER ADVISERS LOOK TO SINK BIDEN RE-ELECTION BID Since leaving the Oval Office, Obama has typically held his endorsement card close to his chest. He endorsed former Secretary of State Hillary Clinton in June of 2016, while his endorsement of Biden in 2020 was only made days ahead of the DNC. Obama remained coy for a long while during the 2020 election about whom he would endorse, saying he would not back anyone during the primary. As Democratic contenders such as Pete Buttigieg, Sen. Elizabeth Warren and Sen. Bernie Sanders dropped out of the primary race and cleared a path for Biden, however, Obama finally endorsed his former veep in August of that year. Harris was also a contender in the 2020 race, and had long had a friendship with Obama prior to her 2020 run, sparking media speculation that the 44th president could throw his support behind Harris instead of his VP. OBAMA ALLIES, ADVISERS HELPED LEAD THE CHARGE AMONG DEMS LOOKING TO SINK BIDEN AHEAD OF OFFICIAL ANNOUNCEMENT Harris was among the first elected Democrats in the nation to endorse Obama’s first run for president in the 2008 election, snubbing Hillary Clinton in favor of the then-Illinois senator. \"I’m told that I was the first elected person in California to endorse [Obama] when he decided to run for president,\" Harris said back in 2019 while she was campaigning for president. \"I will remind you, and it is important to know, that early in those days Joe Biden was running against him.\" Harris was in attendance when Obama announced his candidacy for president in 2007, after first meeting him 2004 when he was an Illinois state senator running for the U.S. Senate, the Washington Examiner previously reported. \"Barack Obama will be a president who finally ends the era of fear that has been used to divide and demoralize our country,\" Harris said during California's Democratic convention in 2008. As Harris built her political career from San Francisco district attorney to California attorney general and then senator, Harris was even dubbed \"the female Obama\" by some political analysts. EX-OBAMA ADVISER SAYS BIDEN CAN'T BEAT 'FATHER TIME' AND IS 'NOT WINNING THIS RACE' Fast forward to Harris’ 2020 campaign for the presidency, those in Obama's orbit rallied around Harris’ campaign while the 44th president kept quiet. Public relations executive Michael Kempner and his wife held a fundraiser for Harris in the Hamptons that cycle, after they raised millions for Obama during his 2012 re-election campaign, Politico reported at the time. Eugene Duffy, who served as national finance committee member for Obama in 2008, helped fundraise for Harris that cycle, as did Obama donor and supporter, Jeff Shell, the former CEO of NBCUniversal. Though Obama is again remaining coy with his endorsement in 2024 cycle, powerful advisers and allies in his orbit have joined Harris' campaign. Harris tapped Obama’s former attorney general Eric Holder to lead the vetting process of Harris’ potential running mates, while the campaign also reportedly contacted longtime Obama adviser David Plouffe for a leadership position on the team. Jennifer O'Malley Dillon, who worked as Obama’s 2012 deputy campaign manager and Biden’s 2024 reelection campaign chair, was announced as Harris’ campaign manager. OBAMA SILENT OVER REPORTS HE'S WORKING ‘BEHIND THE SCENES’ TO FORCE BIDEN OUT OF THE 2024 RACE Ahead of Biden dropping out of the race on Sunday afternoon, Obama allies notably helped lead the charge in calling for Biden to exit the race in favor of a candidate they believed was more suitable to take on Trump. Obama's former chief campaign strategist David Axelrod declared earlier this month that Biden is \"not winning this race.\" Actor George Clooney called on Biden to drop out of the race in a bombshell op-ed that was published just weeks after the Hollywood star co-hosted Biden, alongside Obama, for a ritzy campaign event in Los Angeles. Clooney has long had a personal friendship with Obama and former first lady Michelle Obama, including vacationing with the first couple in previous years. OBAMA AGAIN STEPPING INTO ROLE AS JOE'S CLOSER AHEAD OF TRUMP V BIDEN REMATCH Another ally in Obama's orbit, Jon Favreau, who served as former director of speech writing for Obama, also called on Biden to drop out of the race this month, saying he attended the fundraiser in L.A. with Clooney and Obama and witnessed firsthand Biden's state of mental acuity. Favreau, alongside former Obama advisers Jon Lovett and Tommy Vietor — known collectively as the \"Obama Bros\" when they worked in the White House — also dedicated the majority of a podcast episode of \"Pod Save America\" this month to trashing Biden. The \"Obama Bros\" and other former advisers in Obama’s orbit have since taken to social media to celebrate Harris’ run. As momentum builds behind Harris’ candidacy, with the DNC anticipated to certify her as the nominee on Aug. 1, Obama’s statement Sunday follows his history of not expeditiously tipping the political scales in favor of one candidate over another. CLICK HERE TO GET THE FOX NEWS APP ​​\"We will be navigating uncharted waters in the days ahead. I have extraordinary confidence that the leaders of our party will be able to create a process from which an outstanding nominee emerges,\" Obama said in his statement on Sunday. \"I believe that Joe Biden’s vision of a generous, prosperous, and united America that provides opportunity for everyone will be on full display at the Democratic Convention in August. And I expect that every single one of us are prepared to carry that message of hope and progress forward into November and beyond.\" Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Former President Obama&apos;s history of presidential endorsements and supporters rallying around Vice President Harris indicate he supports her run despite not outright endorsing her.","url":"https://www.foxnews.com/politics/obamas-inner-circle-signals-44th-president-firmly-behind-harris-despite-not-saying-so-publicly","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/kamalaobama.png?ve=1&tl=1","video":null,"publish_date":"2024-07-24 23:20:28","author":"Emma Colton","authors":["Emma Colton"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.341},{"id":252555738,"title":"LGBTQ celebrities and lawmakers come out in support of Kamala Harris","text":"More than 1,100 LGBTQ celebrities, lawmakers and leaders signed a letter released Wednesday by national LGBTQ rights groups endorsing Vice President Kamala Harris’ presidential run. The letter includes signatures from actors Matt Bomer, George Takei, Billy Eichner, and Sophia Bush and her partner, Ashlyn Harris, a former U.S. Women’s National Team soccer player. Out elected officials, including Sen. Tammy Baldwin, D-Wisc., and Reps. Ritchie Torres, D-N.Y., Mark Takano, D-Calif., and Becca Balint, D-Vt., also signed, alongside notable figures such as Jim Obergefell, the lead plaintiff in the Supreme Court case that legalized same-sex marriage nationwide in 2015, and Judy Shepard, the mother of Matthew Shepard, who was murdered in Wyoming in 1998. Harris has a two-decade track record of supporting gay rights, which is part of the reason LGBTQ advocacy groups, lawmakers and celebrities have been vocal in backing the presidential hopeful. Some LGBTQ people, however, have taken issue with her record on trans rights and criminal justice issues. During her time as a district attorney in San Francisco, Harris helped make California the first state in the country to ban the so-called gay/trans panic defense, which has allowed those accused of homicide to receive lesser sentences by saying they panicked after having found out a victim’s sexual orientation or gender identity, the letter says. She was also an early supporter of marriage equality. She officiated some of the nation’s first same-sex marriages in 2004. Then, in 2008, when she was California’s attorney general, she refused to defend Proposition 8, a state constitutional amendment that banned same-sex marriage. In 2013, after a court allowed an injunction against Proposition 8 to stand, Harris officiated the first same-sex wedding in the state. The letter notes that the Biden-Harris administration has been “the most pro-LGBTQ+ administration in history” and appointed a record number of LGBTQ people to federal positions, including Transportation Secretary Pete Buttigieg, the first gay Cabinet secretary, and Rachel Levine, assistant secretary for health, the first Senate-confirmed trans appointee and the highest ranking trans official in the federal government. “With these strong LGBTQ+ policies in jeopardy because of Donald Trump, JD Vance, and the anti-LGBTQ+ Project 2025, electing Kamala Harris and defeating Donald Trump again is critical for the cause of equality,” the letter states, adding that the next president will have lasting impact on the country by filling any vacancies on the Supreme Court. The letter was put together by LGBTQ advocacy groups Advocates for Transgender Equality, Alice B Toklas LGBTQ Democratic Club, Equality California, the Human Rights Campaign, LGBTQ Victory Fund, LPAC and the National LGBTQ Task Force. Nonetheless, some LGBTQ people have criticized Harris’ record on trans rights and other social issues. As attorney general, she worked to block a trans woman from receiving gender-affirming surgery in prison in 2015. At an LGBTQ presidential forum in Cedar Rapids Iowa in 2019, Harris said she worked behind the scenes to get the California Department of Corrections to change its policy denying trans inmates such care, The Advocate reported. “I commit to you that always in these systems there are going to be these things that these agencies do. And I will commit myself, as I always have, to dealing with it,” Harris said at the forum. Harris has also faced criticism for supporting FOSTA-SESTA, a 2018 bill package intended to hold websites accountable if they knowingly assist, support or facilitate sex trafficking. The laws led Craigslist to close its personal classified ads section and resulted in a number of other websites cracking down on sex workers who use their platforms to find clients. LGBTQ people, and transgender people in particular, are more likely than the general population to participate in sex work for a variety of reasons. As a result, LGBTQ sex workers have been disproportionately affected by laws like FOSTA-SESTA, which is short for the Fight Online Sex Trafficking Act and the Stop Enabling Sex Traffickers Act. In 2019, when Harris was a senator and running for president, she told The Root that she supported decriminalizing sex work but did not regret supporting FOSTA-SESTA. Since she announced her candidacy Sunday, Harris has also faced backlash for supporting the Biden administration’s policies on the Israel-Hamas war. “Kamala, you will have our votes when you end U.S. support of genocide in Gaza. Simple as that,” drag performer and activist Pattie Gonia wrote Monday on Instagram.","summary":"Matt Bomer, Billy Eichner, Wilson Cruz and dozens of state legislators signed a letter detailing  Kamala Harris' efforts to protect LGBTQ rights.","url":"https://www.nbcnews.com/nbc-out/out-news/lgbtq-celebrities-lawmakers-kamala-harris-rcna163542","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-07/240724-san-francisco-kamala-harris-pride-event-2019-ac-623p-80f5f4.jpg","video":null,"publish_date":"2024-07-24 23:19:42","author":"Jo Yurcaba","authors":["Jo Yurcaba"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.086},{"id":252555540,"title":"Harris’ Past Anti-Fracking Position Seized Upon by GOP","text":"“Kamala Harris is even more extreme than Joe Biden – She wants to ban fracking and kill countless jobs in states like PA for American workers,” Donald Trump Jr. posted on X. A Harris spokesperson didn’t immediately respond to a request for comment, but her campaign released a statement Wednesday highlighting Trump’s entreaties for $1 billion in donations from the oil industry, adding the move threatens to “sacrifice good paying jobs” that are driving an American energy and manufacturing boom. “Under the Biden-Harris administration, America is more energy independent than ever,” said Harris for President spokesperson Joseph Costello. “Trump promises to dismantle all this progress and sell out America’s future for his own personal gain.” During her brief primary run, Harris told a CNN town hall she opposed hydraulic fracturing, which involves pumping water, sand and chemicals underground to free oil and gas from dense rock formations, and has drawn vehement opposition from some green groups and progressive voters. “There’s no question I’m in favor of banning fracking,” Harris said at the 2019 candidate climate forum. As California’s attorney general, Harris also sued the Obama administration over the approvals of fracking off her state’s coast. Harris later moderated her views after being selected as Biden’s running mate, with the campaign emphasizing new restrictions and regulations for the technique instead.","summary":"As a 2019 presidential candidate, Kamala Harris pledged to ban fracking. Now Republicans are betting her opposition to the drilling technique will hurt her at the polls.","url":"https://financialpost.com/pmn/business-pmn/harris-past-anti-fracking-position-seized-upon-by-gop","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/07/776093228.jpg","video":null,"publish_date":"2024-07-24 23:19:08","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","catgory":"politics","source_country":"CA","sentiment":0.14},{"id":252555346,"title":"[Graphic News] Trump vs. Harris: 2024 presidential showdown","text":"The upcoming US presidential election on Nov. 5 has set the stage for a new showdown between former Republican President Donald Trump and current Vice President Kamala Harris, the likely Democratic candidate. According to the Associated Press, recent surveys indicate that Vice President Harris has secured the delegates to be the Democratic nominee, effectively replacing President Joe Biden as the party's candidate.","summary":"The upcoming US presidential election on Nov. 5 has set the stage for a new showdown between former Republican President Donald Trump and current Vice President Kamala Harris, the likely Democratic candidate. According to the Associated Press, recent surveys indicate that Vice President Harris has secured the delegates to be the Democratic nominee, effectively replacing President Joe Biden as the party&#039;s candidate.","url":"https://www.koreaherald.com/view.php?ud=20240724050752","image":"https://res.heraldm.com/content/image/2024/07/24/20240724050773_0.gif","video":null,"publish_date":"2024-07-24 23:18:06","author":"Nam Kyung-Don","authors":["Nam Kyung-Don"],"language":"en","catgory":"politics","source_country":"kr","sentiment":-0.297},{"id":252555706,"title":"Biden to give Oval Office address about his exit from election race","text":"US President Joe Biden is expected to detail his reasons for pulling out of the election race in a prime-time address to the nation shortly. Mr Biden is due to give an Oval Office address at 8pm, local time (10am AEST) — his first extensive public comments since posting an open letter on social media announcing his decision on Sunday. \"He wants to speak directly to the American people tonight,\" White House spokeswoman Karine Jean-Pierre said. \"You don't use the Oval Office often; you use it for incredibly important moments, and that's what you're going to hear tonight.\" Mr Biden was in isolation with COVID when he announced his decision via the X platform, writing: \"While it has been my intention to seek re-election, I believe it is in the best interest of my party and the country for me to stand down and to focus solely on fulfilling my duties as president for the remainder of my term.\" It followed weeks of sustained pressure from a growing number of prominent Democrats who were concerned about his visible signs of aging, and his ability to compete with Republican nominee Donald Trump. Earlier on Wednesday, Mr Biden's likely replacement on the Democratic Party ticket, Vice-President Kamala Harris, made a pitch to thousands of Black women at an event in Indianapolis. \"Our nation, as it always has, is counting on you to energise, to organise and to mobilise,\" she told the convention for a historically Black sorority group, Zeta Phi Beta. Trump held his own event in North Carolina, where he attacked his opponent as a \"radical left lunatic who will destroy our country if she ever gets the chance to get into office\". \"For three-and-a-half years, lyin' Kamala Harris has been the ultra-liberal driving force behind every single Biden catastrophe,\" he said. Mr Biden endorsed Ms Harris half an hour after announcing he would not run for re-election, and she has since won the backing of most top Democrats, including those who had been seen as her potential rivals. On Monday, she announced she had secured the votes of the necessary number of delegates to lock in the nomination. She is yet to announce a vice-presidential running mate.","summary":"US President Joe Biden prepares to detail his reasons for pulling out of the 2024 US presidential election in a prime-time Oval Office address, scheduled to begin shortly.","url":"https://www.abc.net.au/news/2024-07-25/biden-first-address-since-dropping-out-election-race/104138988","image":"https://live-production.wcms.abc-cdn.net.au/8efc667ca63618ddbc4e7fd63799f432?impolicy=wcms_crop_resize&cropH=1142&cropW=2031&xPos=0&yPos=8&width=862&height=485","video":null,"publish_date":"2024-07-24 23:16:46","author":"Brad Ryan","authors":["Brad Ryan"],"language":"en","catgory":"politics","source_country":"AU","sentiment":-0.102},{"id":252555350,"title":"Market Not Kind To Ether ETFs Or Token As Volume Tops $1 Billion","text":"Share to Facebook Share to Twitter Share to Linkedin The ether coin, the native token for the Ethereum blockchain, lies on top of similar golden coins to ... [+] illustrate cybercurrencies. getty It was really only a matter of time. Just seven months after the first spot Bitcoin ETFs hit the market, the Securities and Exchange Commission (SEC) approved for trading on Tuesday nine ETFs that track the Ether cryptocurrency. But the market wasn’t kind to the new products as they all posted significant loss their first two days of trading. Each ETF will track the spot price of Ether, the world’s second-largest cryptocurrency, and the driving force behind the Ethereum blockchain. Total volume for the nine new ETFs crossed $1.08 billion the first day of trading, according to Bloomberg Intelligence. “Bitcoin is regarded as a store of value, and a means to transmit money from one party to another,” said Ric Edelman, the founder of the Digital Assets Council of Financial Professionals. “Ethereum allows you to program the conditions for that transmittal, so that the receiving party doesn’t get your money until they fulfill their obligation – such as sending you the concert tickets you’ve purchased.” The ability to program the conditions for settlement allows Ethereum to operate like an escrow account – but without human intermediaries, continued Edelman. This makes it faster, safer and cheaper, and can be used by virtually every industry in the world. Despite the assumption that the price of Ether would jump the day the ETFs launched, the market wasn’t kind to either the token or the ETFs. Yesterday, Ethereum’s native token declined 1%. Today, Ether plunged 4.4%, plummeting below $3,400 to $3,322.33. MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out The decline might be the cliche buy the rumor sell the news. The anticipated launch appears to have been priced into the market. Short-term investors may have used the day to take profits. Today’s drop might be related to the S&P 500 and the Nasdaq having their worst day since 2022 “This is a positive for the crypto industry in my view — some of it may go against the ethos of decentralized finance that the likes of Bitcoin and Ethereum were founded — but the ETFs don't change anything themselves about the underlying assets or protocols,” said James Seyffart, research analyst at Bloomberg Intelligence. “What these ETFS do is open up bridges between Ethereum and the traditional financial markets.” These bridges are from decentralized finance to more people and more capital that are either restricted from buying actual cryptocurrencies or don’t want to deal with the many-layered process. The ETF structure also brings regulatory clarity and acceptance by federal regulators, such the SEC. “The launch of spot Ether ETFs is yet another step down the path towards greater mainstream adoption of crypto,” said Nate Geraci, president of The ETF Store, a registered investment advisor that only offers ETFs. The Nine ETFs In addition to the new ETFs, Grayscale Investments won SEC approval to convert its Grayscale Ethereum Trust (ETHE) to a spot ETF. By virtue of being open since 2017, ETHE became the largest spot Ether ETF with $9.19 billion in assets under management as of July 23. On Tuesday, it shed 0.6% on the most volume of all the Ether ETFs, $463.2 million. Today, it dropped 2.5% to 28.62. It still charges the same high expense ratio as it did as a legacy trust, 2.5%. The firm also launched a second “low-cost” fund, the Grayscale Ethereum Mini Trust (ETH) with initial seeding consisting of 10% of ETHE's underlying Ethereum, about $1.02 billion. It started the day as the second largest spot Ethereum ETF. On its first day of trading, it inched down 0.9% to $3.27 on volume of $63.8 million. Today, it plunged 3% to $3.17. For the first sixth months of trading, the expense ratio will be 0%. After the six-month period, or when the fund reaches $2.0 billion in assets, the fee will be 0.15%. Blackrock’s iShares Ethereum Trust (ETHA) posted the second highest volume on Tuesday, at $249.1 million. It fell 1.3% on its first day of trading and tumbled 2.8% to $25.50 on its second. ETHA will charge an expense ratio of 0.25%, with a one-year waiver reducing the fee to 0.12% on the first $2.5 billion assets under management. Fidelity Ethereum Fund (FETH) declined 1.1% on volume of $137.3 million its first day of trading. Today, it sank 2.9% to $33.67. FETH will waive the expense ratio for the rest of the year, then charge 0.25%. Bitwise Ethereum ETF (ETHW) dropped 1.3% on volume of $94.3 million yesterday. Wednesday it sank another 2.8% to $24.15. ETHW has a management fee of 0.20%, with the fee set to 0% for the first six months on the first $500 million in assets. VanEck Ethereum ETF (ETHV) gave back 1.8% on volume of $44.8 million yesterday. Today also sank 2.8% to $49.27. The expense ratio will be waived until July 22, 2025, for the first $1.5 billion of the Trust’s assets. After that the fee will be 0.20%. Franklin Ethereum ETF (EZET) slipped 1.1% on volume of $15.9 million yesterday. Today it skidded 2.9% to $25.58. The sponsor will waive the expense ratio until January 31, 2025, for the first $10.0 billion in fund assets. After that it reverts to 0.19%. Invesco Galaxy Ethereum ETF (QETH) moved 1.5% lower on volume of $12.5 million yesterday. Today it dropped 2.9% to $33.64. The expense ratio for this fund is 0.25%, there is no waiver. And with the least amount of volume at $8.6 million yesterday, 21Shares Core Ethereum ETF (CETH) tumbled 2.5% to $17.29. Today it dove 2.8% to $16.80. The fund will waive the entire management fee until Jan. 23, 2025, or until assets reach $500 million, whichever occurs first. Then it reverts to 0.21%. All prices from Yahoo! Finance. All volume numbers from Bloomberg Intelligence Geraci from the ETF store says investors need to focus on five key factors when selecting among the nine ETFs: expense ratio, liquidity (trading spreads & premiums/discounts), assets under management, performance, and the ability of an ETF issuer to provide crypto education. Given that these ETFs all hold the exact same asset in Ether, small differences in items such as fees and performance could tip the scales in favor of one ETF over the others.” “I think it's important to underscore the ETH ETF launch as an inflection point,” said Federico Brokate, 21Shares’s head of the U.S. business. “It represents further comfortability with the asset class from the SEC and serves as further proof of crypto's broader momentum and adoption.” Follow me on Twitter. Lawrence Carrel Following Editorial Standards Print Reprints & Permissions","summary":"Seven months after spot Bitcoin ETFs hit the market, the SEC approved for trading on Tuesday nine ETFs that track the Ether cryptocurrency. They took a two-day tumble.","url":"https://www.forbes.com/sites/lcarrel/2024/07/24/market-not-kind-to-ether-etfs-or-token-as-volume-tops-1-billion/","image":"https://imageio.forbes.com/specials-images/imageserve/66a189eb0d731e3cbfb26389/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:16:30","author":"Contributor,Lawrence Carrel","authors":["Contributor","Lawrence Carrel"],"language":"en","source_country":"US","sentiment":-0.307},{"id":252555348,"title":"Michael Bay Is About To Transform ‘Skibidi Toilet’ Into Cinema","text":"Share to Facebook Share to Twitter Share to Linkedin Skibidi Toilet, created by Alexey Gerasimov DAFUQ!?BOOM!/YOUTUBE Controversial YouTube series Skibidi Toilet is about to go mainstream, with Transformers director Michael Bay looking to develop the viral sensation into a film and TV franchise. Bay and former Paramount president Adam Goodman have high hopes for the series, with Goodman telling Variety that Skibidi Toilet “could be the next Transformers or could be a Marvel universe.” What Is ‘Skibidi Toilet’? Skibidi Toilet is an animated series created by Georgian animator Alexey Gerasimov, who found success after posting an eleven-second YouTube Short featuring a singing head poking out of a toilet. That first short was simple, but striking; a grotesque toilet man, singing remixed lyrics from a Biser King song, sampled from a TikTok meme. At first, Gerasimov was inspired by recurring nightmares of “heads coming out of toilets,” and set out to battle his subconscious in the virtual world, animating his fears using Valve’s Source Filmmaker. MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out Forbes'Skibidi Toilet' Creator Talks Inspiration, Dreams And 'Insane Ending'By Dani Di Placido After his first Skibidi short went viral, Gerasimov developed the concept into a narrative, an all-consuming war between two cyborgian factions, with the two sides desperately constructing more powerful bodies and weapons, often using mechanical body parts of fallen soldiers. Posting each episode on his YouTube channel, DaFuq!?Boom!, Gerasimov’s series features men with speakers, cameras and television screens for faces fighting against the titular singing toilets, with plenty of background clues and easter eggs for fans to dissect. The series has proved surprisingly popular with children, which sparked criticism from many concerned parents, startled by what they see onscreen. The animation even inspired something of a moral panic, with concerns about the videos manifesting into a condition dubbed “Skibidi Toilet syndrome,” which is now considered something of a meme. How Did ‘Skibidi Toilet’ Become So Popular? While the chaotic series appears almost incomprehensible to outsiders, Skibidi Toilet has proved wildly popular with Gen Alpha, with the characters spreading through YouTube and Roblox, as recognizable to children as mainstream Disney icons like Iron Man and Elsa. The widespread appeal of the videos might be attributed to their lack of dialogue, distinctive aesthetic and Gerasimov’s consistent posting schedule, as well as the introduction of YouTube Shorts. Skibidi Toilet now has 76 episodes and has been viewed more than 775 million times on YouTube, while footage of the series has been endlessly remixed and posted on other platforms, and has inspired a deluge of fan art and animations. The series seems steeped in meme culture, with its absurd imagery and catchy, repetitive song, along with inventive fight sequences that sometimes resemble video game footage. As strange as it seems, Skibidi Toilet’s never-ending war is broadly similar to the conflict of Michael Bay’s Transformers films, which Gerasimov cites as a direct inspiration. Now, Bay is looking to turn Gerasimov’s story into a blockbuster franchise. Skibidi Toilet, it seems, has gone full circle. ForbesThe Surreal Horror Of 'Skibidi Toilet,' ExplainedBy Dani Di Placido Follow me on Twitter. Check out my website. Dani Di Placido Following Editorial Standards Print Reprints & Permissions","summary":"The MCU will soon face strange competition, with Transformers director Michael Bay looking to develop viral YouTube series Skibidi Toilet into a film and TV franchise.","url":"https://www.forbes.com/sites/danidiplacido/2024/07/24/michael-bay-is-about-to-transform-skibidi-toilet-into-cinema/","image":"https://imageio.forbes.com/specials-images/imageserve/66a1873f9055c2b2a5c002de/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:15:30","author":"Dani Di Placido,Senior Contributor","authors":["Dani Di Placido","Senior Contributor"],"language":"en","source_country":"US","sentiment":0.213},{"id":252555312,"title":"Cardi B defends Kamala Harris against criticism over Vice President’s dating history","text":"Cardi B has called out the Kamala Harris detractors who have used the Vice President’s dating history as a means to question her qualifications. Since Harris, 59, was endorsed by President Joe Biden to be his replacement in the 2024 presidential race, she has faced increased scrutiny from her conservative opponents. From complaints about her laugh to targeting her race and gender, Harris is now facing attacks from some Donald Trump supporters who have accused her of sleeping her way to the top. “What does Kamala Harris husband or relationships have to do wit [sic] her credentials?” Grammy-winning rapper Cardi B tweeted on Tuesday (July 23). “Do y’all hire people based on who they f***ing??” Before Harris was elected as San Francisco’s district attorney in 2004, she had been in a decade-long relationship with Willie Brown, then-speaker of the California State Assembly, who would go on to become the mayor of San Francisco that same year. “Yes, we dated. It was more than 20 years ago,” Brown, now 90, confirmed in a 2019 article in the San Francisco Chronicle titled: “Sure, I dated Kamala Harris. So what?” Some critics have falsely claimed that Harris had an affair with Brown while he was still married. However, in a fact-checking piece, The Associated Press points out that Harris had been separated from his wife for years – since 1982 – before he and Harris began dating in the Nineties. Harris wrote that he supported Harris’s first race to be San Francisco district attorney – just as he has supported a long list of other California politicians, including former House Speaker Nancy Pelosi, former Senator Dianne Feinstein and Governor Gavin Newsom, The AP reported. Harris’s other exes, including actor and TV host Montel Williams, have also faced scrutiny from Trump supporters. “Here she is ‘dating’ @Montel_Williams in 2001, who appears to be holding hands with more than one woman at the same time on the red carpet,” one person tweeted alongside a video of the moment. Williams responded, clarifying that the other “woman” was his then-teenage daughter, Ashley. Harris has been married to entertainment lawyer Doug Emhoff, 59, since 2014. While she doesn’t have any biological children, Harris is the proud stepmom – dubbed “Momala” – to Emhoff’s two adult children, Cole and Ella. Writing about her stepchildren in a personal 2019 essay for Elle, Harris detailed the moment she met Emhoff’s children for the first time. “Children need consistency; I didn’t want to insert myself into their lives as a temporary fixture because I didn’t want to disappoint them,” she said, calling them “brilliant, talented, funny kids who have grown to be remarkable adults.”","summary":"Harris has been accused of jumpstarting her career by having an affair with former politician Willie Brown","url":"https://www.independent.co.uk/arts-entertainment/music/news/kamala-harris-husband-willie-brown-cardi-b-b2585400.html","image":"https://static.independent.co.uk/2024/07/24/20/Untitled-design.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/TEV2fOz2-4VHSaSK0.mp4","publish_date":"2024-07-24 23:13:41","author":"Inga Parkel","authors":["Inga Parkel"],"language":"en","catgory":"politics","source_country":"gb","sentiment":0.223},{"id":252555286,"title":"Biden’s Exit From 2024 Race ‘Not for Health Reasons,’ White House Says","text":"President Joe Biden did not end his reelection bid due to health concerns, according to White House press secretary Karine Jean-Pierre. The president will state his reasons for ending the campaign in a televised address at 8 p.m. on July 24. The highly anticipated appearance will occur after days of speculation about the president’s health following his testing positive for COVID-19 on July 19 and subsequent retreat to his Rehoboth Beach house in Delaware to recover. There, after consulting with family and close advisers, the president reversed his position after weeks of assuring the public that he would remain the Democratic candidate despite rising pressure from elected Democrats who had come to believe he would not win reelection. Ms. Jean-Pierre addressed that rumor in her remarks. “First of all there’s been no cover-up; want to be very clear about that,” she said. “It is not about his health ... that’s not the reason.” According to Ms. Jean-Pierre, President Biden met with a small group of advisers and family members on July 20 and made his final decision the following day. The president did not state a reason for the decision, saying only that it was made in the best interest of the party and of the country. The announcement ended more than three weeks of intense speculation regarding his candidacy. During a televised debate with former President Donald Trump on June 27, President Biden at times appeared to misspeak and leave sentences unfinished. The debate performance prompted a number of Democratic donors, lawmakers, and celebrities to call on President Biden to end his campaign. The president responded with his intent to stay in the race. In a July 5 interview with ABC News, President Biden joked that he would only consider dropping out if “the Lord Almighty” were to come down and tell him that he cannot beat former President Donald Trump. Earlier this month, during a July 8 interview on MSNBC’s “Morning Joe,” he voiced his frustration toward those who urged him to step aside, particularly party elites, pundits, and donors. On July 17, in an interview on BET News, he said he would reconsider his decision to run only if doctors warned him of a serious medical condition. White House staff consistently rejected rumors of his withdrawal, with one staff member saying on social media platform X: “Incorrect. Keep the faith.” Even while recovering from COVID-19 at his Delaware house last week, President Biden issued a statement saying that he “looked forward to getting back on the campaign trail.” That determination apparently dissipated over the course of a few days, coinciding with the COVID-19 diagnosis. President Biden endorsed his former running mate, Vice President Kamala Harris, as part of his withdrawal statement. “Today I want to offer my full support and endorsement for Kamala to be the nominee of our party this year,” he wrote. President Biden, 81, has stated that he intends to finish his term, which will complete a 52-year career in public service that began with his election to the U.S. Senate in 1972 at the age of 29. “The president has no regrets, has no regrets,” Ms. Jean-Pierre said.","summary":"The July 24 appearance will answer speculation about the state of the president's health and the reason behind a sudden change of mind regarding the campaign.","url":"https://www.theepochtimes.com/us/bidens-exit-from-2024-race-not-for-health-reasons-white-house-says-5693099","image":"https://img.theepochtimes.com/assets/uploads/2024/07/24/id5692668-Biden-GettyImages-2162555758-300x180.jpg","video":null,"publish_date":"2024-07-24 23:11:40","author":"Emel Akan,Lawrence Wilson","authors":["Emel Akan","Lawrence Wilson"],"language":"en","source_country":"us","sentiment":-0.18},{"id":252556546,"title":"Nick Knowles, 61, 'joins the Strictly lineup after months of talks with bosses as the scandal-hit show continues to battle abuse claims'","text":"Home News Royals U.S. Sport Showbiz Femail Health Science Money Travel Podcasts Shopping Best Buys My Profile Logout Login Discounts TUI Booking.com ASOS Just Eat Deliveroo boohoo Very Nike Virgin Media Uber Eats Boots B&Q Amazon John Lewis My Profile Logout Login Headlines Showbiz Kim Kardashian Victoria Beckham Harry Styles Amanda Holden Britain's Got Talent My Profile Logout Login Privacy Policy Feedback Thursday, Jul 25th 2024 1AM 12°C 4AM 11°C 5-Day Forecast Advertisement Chaos in Sainsbury's as customers pile their trolleys high using discount voucher that allows them to get all their shopping for FREE - but the supermarket threatens them with the police Pictured smirking at the inquest - the thug who killed his sister, 11, with a punch to the head... but will NOT be prosecuted for it: Man refuses to explain texts he sent to his girlfriend saying he hit the girl 'in the heat of the moment' JK Rowling attacks Lisa Nandy as 'one of the main reasons I couldn't vote Labour' after new Culture Secretary wades into row over trans athletes competing in women's sports As a women's prison governor I encountered Rose West, Myra Hindley and Beverley Allitt. Here are the very surprising things female killers have in common - and the fate that awaits Lucy Letby DEAR JANE: I'm so jealous of my mother's amazing life that I did something terrible to try and ruin her marriage Meghan unlikely to join Harry for 'olive branch trip' to reconnect with his family because she has 'too much on her plate' and 'fears being heckled in public', says insider Vet technician reveals the list of dog breeds she would NEVER own - as well as the reasons why Being on Strictly was like 'fighting in the trenches', Amanda Abbington sobs as she claims former dance partners of Giovanni Pernice texted her 'I'm so sorry' when their pairing was announced PETER HITCHENS: I wish I wasn't a tourist. I hate the word. If Spanish locals sprayed me with water pistols, I'd see their point A daily dab of testosterone has banished my anxiety and given me a new zest for life - and my husband! BRYONY GORDON Bradley Wiggins reveals his coach sexually abused him 36 times from the age of 12 - and left him wishing he had never taken up cycling Is this the end for our coppers? Brits face paying more for everyday essentials on the high street if Treasury stops producing 1p and 2p coins, business leaders warn The 15 best and worst places to live in the UK to stay healthy, live a long life... and get a GP appointment, revealed by health and data experts. So is your town on the list? Don't even think of trying to dodge inheritance tax on your family home before you read this! Jaw-droppingly bitter family feud behind the sale of this £2.5m seven-bed home that both father and son claim they own... Greggs introduce exciting new summer menu items including a mouth-watering bake BBC Proms conductor Sir John Eliot Gardiner steps down from top orchestra and apologises for 'losing control' after hitting a singer 'I was at my wit's end': Billy Ray Cyrus, 62, ADMITS to shock tirade against wife Firerose, 37, as he offers furious explanation to expletive-filled rant caught on audio Police officer who was filmed kicking a man in the face as he was Tasered during chaotic incident in front of screaming passengers at Manchester Airport is stood down from active duties as new footage emerges - but has NOT been suspended Labour could be forced to hike taxes by £25billion at the Autumn Budget, former Bank of England official warns - as Sir Keir Starmer admits public finances are 'more severe' than first feared Woman who had her drink spiked by rapist turned the tables by drugging him when he tried again, court hears as he is jailed for 12 years Chancellor Rachel Reeves is warned raiding the pension savings of up to six million higher earners could trigger crippling public sector strikes and hit economic growth Princess Anne wishes Team GB's stars 'every bit of success' ahead of Paris Olympics as she visits athletes in French capital after recovering from horse-related injury Firerose breaks her silence after shocking audio of her ex-husband Billy Ray Cyrus belittling her in expletive-ridden rant emerged Tom Tugendhat becomes second MP to announce he will run for the Conservative leadership pledging to 'unite the party and end Tory infighting' Previous Next Nick Knowles, 61, 'joins the Strictly lineup after months of talks with bosses as the scandal-hit show continues to battle abuse claims' Have YOU got a story? Email tips@dailymail.com By Laura Fox For Mailonline Published:00:04 BST, 25 July 2024 |Updated:00:11 BST, 25 July 2024 e-mail 17 shares View comments Nick Knowles has reportedly joined the lineup for the new series of Strictly Come Dancing, as the show continues to battle a growing number of abuse and misconduct claims. The DIY SOS star, 61, signed up after months of talks with show bosses, with sources claiming he's 'willing to give anything a crack.' Nick previously showed off his dance skills while attending a rugby match with pal Ben Shephard, in an Instagram post in March, leading one fan to ask whether a Strictly stint was on the horizon. A source told The Sun: 'Nick has always loved Strictly and he is so excited. 'He's got a great personality, is incredibly driven and competitive and is up for giving anything a crack. Nick Knowles has reportedly joined the lineup for the new series of Strictly Come Dancing, as the show continues to battle a growing number of abuse and misconduct claims The DIY SOS star (pictured with his fiancée Katie Dadzie) signed up after months of talks with show bosses, with sources claiming he's 'willing to give anything a crack' 'He's going on the show to entertain and to win. He'll give it his best shot.' MailOnline has contacted representatives for the BBC and Nick Knowles for comment. Nick previously joined forces with Strictly professionals including Katya Jones and Luba Mushtuk, for a special episode of DIY SOS, where they transformed a performing arts school in North Tyneside. The presenter, who announced his engagement to girlfriend Katie Dadzie last year, previously offered his thoughts on Strictly when fans discussed how CBBC star Molly Rainford was in the bottom two, while footballer Tony Adams avoided elimination. He wrote on Instagram: '@bbcstrictly is an entertainment show not strictly a dancing competition — otherwise those that went to drama college & learned dance would have an unfair advantage. 'It's the one who connects with the audience that wins. It's been previously reported that other names set to take part in the new series will include EastEnders star Jamie Borthwick and social media star Grace Keeling, known as GK Barry. It comes as Strictly was plunged into further crisis after Amanda Abbington claimed that sacked dancer Giovanni Pernice was trying to block the release of up to 50 hours of 'toxic' footage'. Nick previously showed off his dance skills while attending a rugby match with pal Ben Shephard, in an Instagram post in March It comes as Strictly was plunged into further crisis after Amanda Abbington claimed sacked dancer Giovanni Pernice was trying to block the release of up to 50 hours of 'toxic' footage' During a new interview, the actress compared the dance show to 'the trenches' telling Channel 4 News that BBC producers had been left 'horrified' by clips that also allegedly exhibited 'humiliating behaviour of a sexual nature'. Amanda claims Giovanni has tried to stop her legal team from accessing the video 'evidence' after producers were forced to put cameras in the dance studio after Amanda raised concerns. Read More Strictly Come Dancing fans throw their support behind emotional Amanda Abbington A string of professional dancers on the show have been accused of abusive behaviour by former celebrity contestants, with professional Graziano Di Prima sacked by bosses over alleged footage of his treatment of Zara McDermott. 'There's 50 hours of footage that's being blocked. You know, 50 hours is a lot of footage, and a lot of time spent in a room that was toxic,' she told presenter Krishnan Guru-Murthy. 'It's out there. There is evidence out there of what happened in that room and I'm not the one who's blocking it. I've said anyone can watch it, but he (Giovanni) doesn't want anyone to see it, which is quite telling if he's got nothing to hide.' The actress said that cameras were installed into her and Giovanni's rehearsal studio after she raised concerns after the first week of practice with producers wanting to review the footage each week to assess what was 'going on' between the pair. Giovanni had claimed he had asked for the cameras, which Amanda says is untrue. 'So in the first week, I raised my concerns to the producers,' the actress explained, as she fought back tears. 'Giovanni said that he asked for the cameras, he didn't ask for the cameras, I know that he didn't ask for the cameras, because the producers came to me and said, 'we're going to put in cameras so we can view the footage at the end of the week and make an assessment and see what's going on'. 'And then every Friday, after the next sort of five weeks, I would get the producer saying, on the Friday, 'we just watched the footage back, we are shocked and horrified, we're so sorry'. 'That was to my face on the Friday when we would go in and do the camera rehearsal.' Throughout the interview, Guru-Murthy, who also starred on the 2023 series, asked whether it was correct that Amanda had experienced 'humiliating behaviour of a sexual nature', with the actress holding back tears as she nodded in agreement. 'Yeah. I mean, you know, one of the many things,' she said, clarifying it was not harassment. Ever since the claims first emerged Giovanni has denied all of the allegations, claiming to have provided a dossier of evidence to the Beeb investigators and 'remains fully confident in clearing his name'. Disputing Amanda's claims once again following the interview, a spokesperson for the Italian dancer said: 'The BBC has shared the allegations they have been able to substantiate with us. 'They do not resemble Amanda's latest allegations, given to Channel 4, in any shape or form. Giovanni refutes any claim of threatening or abusive behaviour.' After the fallout, Amanda said she did not hear from any one at the BBC again, claiming: 'I haven't spoken to anyone from the BBC since Strictly. 'No one from the BBC has reached out to me since Strictly, either through me or my lawyer.' In a message to those in charge of the BBC show that has been running since 2004 she added: 'Just be aware of what's going on and when you know it's going on, nip it in the bud. Don't allow it to continue.' Fellow Italian dancer Graziano Di Prima was sacked from the programme after he was accused of kicking and spitting at former Love Island star Zara McDermott (pictured on the show) Amanda went on to claim that she has faced a number of violent threats from both Strictly fans and 'Giovanni fans' who have asked her 'how can you destroy something like Strictly' . She revealed the extent of the alleged harassment she has received in recent months from trolls, telling Channel 4 that 'It has been brutal and relentless and unforgiving'. The bombshell interview comes as the flagship BBC One show continues to be rocked by a string of allegations, which saw Giovanni as well as professional dancer Graziano Di Prima step down. Read More Strictly's Amanda Abbington sends thinly-veiled message to Giovanni Pernice following 'mad woman' Giovanni was accused of bullying by Amanda as well as two other, unnamed contestants. Graziano was axed from the show last week after allegations emerged that he kicked, hit and spat at reality TV star Zasra McDermott during rehearsals last year . On Tuesday, Paralympics star Will Bayley became the latest star to speak about his time on the show. The 36-year-old, who was paired with Janette Manrara in 2019, said he was left with life-changing injuries after being made to redo a jump in a routine as he criticised the show's duty of care. 'If the BBC are brilliant enough to get people with disabilities in, they have to really support those people and make them safe,' he told BBC Breakfast. 'And it's not like I've brought this up now... I've brought this up many times. It's just because the other stories have come out that mine has actually got listened to. 'If someone gets an injury like mine, it will affect them for the rest of their life. I'll never get over this knee injury, I have to deal with that.' The Channel 4 interview comes as BBC chiefs are said to be furious about the Strictly investigation Amanda's initial complaint triggered. One BBC insider told MailOnline: 'Amanda seems to be stopping at nothing to make sure that a dark cloud is left over Strictly. 'She seems to have a real issue with the show. She has been open about not enjoying her time, but why spoil it for everyone else? 'It's not looking like there is a smoking gun in her complaint about Giovanni, so now she is getting others to come forward and then later it appears in the Press so the row keeps going and going.' On Tuesday, the BBC's director-general Tim Davie warned that the 'line should never be crossed' said: 'I'm very sorry that anyone has had an experience on Strictly that hasn't been wholly positive . 'I think that is something we do reflect on, and I'm sorry about that. If someone feels there was something wrong or they wanted to talk about their experience, then, of course, we want them to raise that with us and be in no doubt, we will take it seriously.' Mr Davie added: 'Of course, alongside the fun and entertainment, there will be a degree of competitiveness, hard work, and a will to do well. That's part of what makes this show. 'But there are limits and the line should never be crossed. We will never tolerate unacceptable behaviour of any kind.' Share or comment on this article: Nick Knowles, 61, 'joins the Strictly lineup after months of talks with bosses as the scandal-hit show continues to battle abuse claims' e-mail 17 shares Add comment Bing Site Web Enter search term: Search Advertisement DON'T MISS Bianca Censori exposes her breasts AGAIN in shocking sheer top at the cinema with Kanye West - as somber couple leave theatre early Amanda Abbington sobs as she claims former dance partners of Giovanni Pernice texted her 'I'm so sorry' when their pairing was announced EXCLUSIVEBradley Cooper's MARRIAGE plans for Gigi Hadid revealed - as insiders lift the lid on the couple's 'blended functional family' Strictly Come Dancing fans throw their support behind emotional Amanda Abbington as she addresses show scandal Billy Ray Cyrus, 62, ADMITS to shock tirade against wife Firerose, 37, as he offers furious explanation to expletive-filled rant caught on audio What would YOU tell your younger self? The 50 top pearls of wisdom women would go back and tell themselves - but how many do you agree with? Ad Feature Nineties pop star has barely aged as she performs in Glasgow... 30 years after finding fame with her iconic number one hit The top 30 true crime documentaries to stream now: From serial killers to romance fraudsters, our critics sift through hundreds of options He dated Jennifer Aniston and worked with Angelina Jolie but for his new show he looks more like Ben Affleck after losing weight - who is he? Succulent burgers, fabulous fish and tasty chicken skewers: Here's how to barbecue the British way Ad Feature Jonathan Ross' daughter Honey, 27, opts for a fun tartan miniskirt as she joins her famous father, 63, at a screening of Deadpool & Wolverine Emmerdale fans warn abusive Tom King's fate is 'sealed' after he makes a 'huge mistake' in his torment of wife Belle Dingle in dramatic scenes Jennifer Lopez goes for a birthday bike ride in the Hamptons with no sign of Ben Affleck... Kicked off her 55th birthday without her husband Natalie Portman cuts a casual figure as she enjoys some retail therapy with her daughter Amalia, 7, in Los Angeles Desperate for sunshine? It's not too late to go and find it! Here's our pick of the best last-minute summer deals Ad Feature Amanda Holden stuns in a boho summer dress as she unwinds in Greece with lookalike daughters Lexi, 18, and Hollie, 12 Amanda's Strictly hell laid bare: Star says there are 50 HOURS of 'toxic' footage of Giovanni Pernice and 'humiliating behaviour of a sexual nature' EXCLUSIVEBilly Ray Cyrus, 62, is heard belittling wife Firerose, 37, in vicious tirade and slamming his own daughter Miley, 31, as a 'devil' in new audio Former Victoria's Secret model looks unrecognizable as she poses in new photoshoot - so can you guess who it is? Achieve home harmony! From prams to passing your driving test, here are top 10 tips for your family this season Ad Feature Kylie Jenner flashes her taut tummy in a white crop top as she boards a water taxi in Italy with kids Stormi and Aire Princess Anne wishes Team GB's stars 'every bit of success' ahead of Paris Olympics as she visits athletes after recovering from horse-related injury Anne Hathaway slips into a brown swimsuit as she relaxes on a luxurious yacht with her husband Adam Shulman and their sons in Greece Love Island fans fume as Joey Essex asks an unimpressed Josh if he was 'offended' by his talent show rap as they have heated row Do you own a business? Here's how to reach millions of potential customers with ads you can TRUST Ad Feature Who is Billy Ray Cyrus' estranged wife Firerose? Meet the singer-songwriter who had a restraining order against her Jessica Alba, 43, flashes her toned tummy in a bikini as she does the viral dance for Charli XCX's Apple song: 'Heard it's a Brat summer' Lea Michele looks heavily pregnant as she displays her growing baby bump in a form-fitting red dress for an event in NYC Meghan Markle unlikely to join Prince Harry for 'olive branch trip' to reconnect with his family because she has 'too much on her plate' A dermatologist debunks common out-of-date myths about summer skincare (but how many do YOU still believe?) Ad Feature Celine Dion cuts an elegant figure as she steps out in Paris again - amid rumors she will make comeback with Lady Gaga at Olympics opening ceremony Azealia Banks SLAMS Charli XCX for endorsing Kamala Harris amid Brat girl summer craze: 'You are uninformed and thirsty for attention' Leonardo DiCaprio's girlfriend Vittoria Ceretti flaunts her model figure in a tiny pink bikini as she cools off with a dip in the sea during Italian holiday Jennifer Lopez posts a stunning swimsuit selfie on her 55th birthday... after being apart from husband Ben Affleck for almost two months Power in your palm: Top 10 apps to help you level up your everyday - from working out to gardening Ad Feature EXCLUSIVEKyle Walker's ex-mistress Lauryn Goodman hires 'Wagatha Christie' PR guru following paternity scandal Tobey Maguire, 49, chats up a young brunette woman on French vacation... after he was rumored to be dating the MUCH younger model Lily Chee, 20 Katie Piper reveals she formed an 'unexpected' friendship with an American pop legend after they reached out to her on Instagram Demi Lovato reveals she and her fiancé Jordan Lutes have brought home a new puppy with an adorable name Get your best sleep yet with Simba's HUGE Summer Slumber Event! Save 25% off selected bed-in-a-box mattresses - score a double-size mattress for under £600 SHOPPING Justin Timberlake is seen fawning over a Janet Jackson poster years before THAT Super Bowl scandal - as Netflix doc unearths cringe-worthy clip Iggy Azalea claims she is 'the only parent' to the son she shares with ex boyfriend Playboi Carti: 'I am not co-parenting' Coronation Street star Sue Devaney ties the knot with former BBC journalist Jim O'Farrell in secret - three years after they got engaged Stephen Baldwin shares cryptic post after pregnant daughter Hailey Bieber revealed she's 'not super close' with her family anymore EXCLUSIVEDunelm just dropped hundreds of new arrivals from furniture to home decor - and I'm shopping these 14 finds (prices start at just £10) Love Island's Joey Essex 'secretly rushed to medics with nasty injury' caused by ex Grace Jackson Cause for concern Kylie Jenner models a see-through minidress with makeup smeared all over it as she talks up her new 'elixir' that 'looks and feels like skin' Love Island SPOILER: Sean's 'sweet roast' leaves a sour taste in Josh's mouth as they have heated row after brutal talent show jibe Louis Theroux, 54, reveals his alopecia is 'slightly improving' and finally shares a snap of a 'scalp lesion' amid his ongoing battle with the hair loss condition Paris Jackson shares striking before and after photos of her acne struggles - as she details routine that's 'completely changed her skin' Love Island SPOILER: Tensions boil over as the couples clash over THAT ranking challenge - before a surprise text throws the villa into chaos Rob Lowe and son John Owen open up about bonding over their sobriety and starring in Netflix's Unstable together Maya Jama hits back at 'insane' fans after they accuse her of going on the 'rebound' with her pal Chunkz following her split from Stormzy EXCLUSIVEChateau Marmont insider reveals what the hotel REALLY thinks about Bianca Censori's skimpy outfits and whether or not she's welcome Who is Amanda Abbington's fiancé Jonathan Goodwin and does the former Strictly contestant share any children with him? TV star accuses ultra-rich realtor of sexually assaulting her, after he was accused of gang-raping woman with his twin brother RHONJ's Teresa Giudice accuses 'toxic people' of 'attacking our children' in cryptic post - as she alludes to drama behind the scenes of the show Kit Harington shows off his incredibly ripped physique as Slave Play director cheekily shares shirtless snap of him backstage Tara Reid, 48, flashes her tummy in a white top while at Craig's in West Hollywood... after the 25th anniversary of her film American Pie Jade Thirlwall flaunts her incredible figure as she poses topless for Polyester magazine cover shoot after releasing her first solo single Gigi Hadid is 'furious' and has 'fallen out' with pal Suki Waterhouse over Bradley Cooper after Brit supermodel recently called split with actor 'dark and difficult' Olivia Attwood is set to host an explosive ITV reality show filmed in Greece where she attempts to mould bad boyfriends into perfect partners Katie Price's ex-fiancé Carl Woods 'claims model had a drunken affair with sports ace and pal of royalty' during their relationship Shocked Steve Harvey doubles over while cringing at Family Feud contestant's racy answer A player rapidly answered a fantasy question Ellie Goulding shares cryptic post about 'restricting people who dim your light' after splitting with estranged husband Caspar Jopling EXCLUSIVELove Is Blind: UK cast REVEALED as Emma and Matt Willis host Netflix show's first ever series on British soil with 30 singletons looking to find romance Kendall Jenner stuns in a sheer latex outfit while pool-side in striking photos from her Vogue France magazine cover . EXCLUSIVEThe Rolling Stones DROP lyrics from their hit Sympathy For The Devil on the final shows of their US tour after the terrifying Trump shooting Mick Jagger and Eric Clapton lead tributes to John Mayall after his death aged 90 - as Clapton thanks musician for rescuing him from 'oblivion' Tommy Fury gifts fiancée Molly-Mae Hague a bouquet of red roses to mark their first engagement anniversary - after quashing split rumours Matthew McConaughey shows off his bare bottom as bikini-clad wife Camila Alves slathers him with sunscreen: 'Burnt buns are no fun' Christina Hall's ex-husband Tarek El Moussa and his wife Heather Rae say they will 'help' their Flip Off costar during her divorce from Josh Hall Joe Jonas, 34, reveals his 'least favorite hairdo' from his days as a teen pop star almost 20 years ago Bad choices Peter Andre defends former Strictly partner Janette Manrara and 'gentleman' Giovanni Pernice - and insists scandal is 'going too far' Vanessa Williams, 61, drops bombshell news that she very quietly divorced husband Jim Skrip THREE years ago... after tying the knot in 2015 Prince William opts not to declare how much tax he pays on billion-pound Duchy of Cornwall empire - despite King Charles regularly doing so when he was Prince of Wales Miley Cyrus sets pulses racing as she strips down to lacy lingerie as the face of Gucci's new fragrance campaign Rita Ora says she 'forced husband Taika Waititi to put a ring on it' as she discusses marriage to film director in playful chat Timothée Chalamet's Bob Dylan is seen in action for the first time as the actor performs A Hard Rain's A-Gonna Fall in the trailer for the singer's biopic Matt Smith left dripping wet as he jumps into pool fully clothed to film The Death Of Bunny Munro - after Kieran Hayler branded him a 'bully' Upcoming horror film is so terrifying crew members will 'never be the same again' after watching it EXCLUSIVETOWIE's Amber Turner finally moves on from Dan Edgar with new boyfriend who whisked her off on Dubai holiday for her birthday Cher, 78, reveals she is releasing a TWO part memoir that will share her 'true story in intimate detail' while posting a first look at the book cover 'She looks 30!' Jennifer Lopez fans think she's 'aging backwards' as she turns 55 and spends birthday apart from Ben Affleck The Kennedy family feud laid bare: JFK Jr.'s sister Caroline didn't think Carolyn Bessette was 'good enough' for him because of her upbringing Bruce Willis' daughter Tallulah, 30, is 'still exploring' her recent autism diagnosis Former Strictly pros James Jordan and wife Ola put on a united front as unfazed couple emerge for the first time since they were pulled into the bullying row Strictly host Tess Daly shares sizzling swimwear-clad holiday snap as she maintains a stoic silence after show is plagued by abuse and bullying claims Kim Zolciak breaks down in tears over Kroy Biermann divorce during therapy session as she calls herself a 'f***ing basket case' on Surreal Life premiere EXCLUSIVEMaya Jama throws herself into early 30th birthday celebrations as she slips into a black mini dress after announcing split from Stormzy Bethenny Frankel enjoys fun night out with daughter Bryn Hoppy, 14, in Saint-Tropez... before taking a nasty fall that left both her knees bleeding Eamonn Holmes, 64, uses anti-gravity treadmill to aid his mobility amid crippling health battle Country music fans left bitterly divided over Garth Brooks being inducted into Austin City Limits' Hall of Fame Strictly pros Nadiya Bychkova, Amy Dowden and Dianne Buswell flash big grins while heading to rehearsals as show battles growing 'abuse' crisis Ex-Strictly star Laila Rouass is seen for the first time since it emerged she was left 'in tears' when Anton said she 'looked like a P***' in historic row Chloe Madeley puts on a VERY leggy display as she steps out in just an oversized shirt and cowboy boots Neighbours' anger as Paul O'Grady's widower bids to launch holiday let at star's former home Tom Hanks' son Chet Hanks reveals it was a 'mindf***' growing up with famous parents because he felt 'worthless' as he joins Surreal Life Sophie Morgan gets emotional as she hits back at 'offensive' Uber driver who made ableist comments and asked her 'what's wrong with you?' Romeo Beckham looks effortlessly cool in white shirt and tan cargo trousers as he and Will Poulter lead the guests at RHUDE fashion show in Italy Jake and Logan Paul plot HUGE bid for hat Donald Trump was wearing during assassination attempt Have offered a ludicrous amount of cash Roberta Taylor reveals what it's like working with husband Peter Guinness in heartwarming video prior to her tragic death Ellie Goulding shows off her toned physique in skimpy sports gear as she frolics in the ocean at sunset in sexy clip Kieran Hayler feels like he has been 'bullied' by 'mean' Matt Smith amid claims the actor 'requested the former stripper be edited out of TV drama' Could Celine Dion be set to earn a bumper payday to sing one song during comeback performance at the Paris Olympic Games opening ceremony? Former Wheel Of Fortune host Pat Sajak is 'giving Ryan Seacrest the cold shoulder' after 'forced' retirement Not speaking Love Island is hit with hundreds of Ofcom complaints AGAIN as fans fume over Joey Essex and Sean Stone's behaviour in the villa WAG Charlotte Trippier flashes her abs in a skimpy bikini as in Greece after she was slammed for airing marital woes with Kieran during the Euros EastEnders pays a heartbreaking tribute to late soap star Roberta Taylor following her death aged 76 Stacey Solomon fans are left in shock as she discovers 'gold mine worth a whopping £10k' on Sort Your Life Out Strictly misconduct scandal deepens as top celebrity agent Melanie Blake claims pro dancer 'put her hand on his crotch' after making sexual comments Coronation Street star Sean Wilson is spotted back on set for the first time as he reprises his role as Martin Platt for Helen Worth's exit storyline Ryan Reynolds takes brutal dig at newly-single Hugh Jackman after his divorce from wife of 27 years Deborra-Lee Furness These A-listers have the most 'perfect' faces in the world according to the 'golden ratio' - with Anya Taylor Joy crowned the most beautiful Emma Roberts and fiancé Cody John make first public appearance since announcing their engagement at the Summer Gala in St Tropez Oprah Winfrey showcases her 'miracle drug' makeover in tight leggings for gym session after finally admitting to losing weight with medication Jorgie Porter reveals she is suffering from a painful pregnancy condition that 'no one ever talks about' as she gives a health update EXCLUSIVEStormzy given date for trial next year for 'using his mobile phone' while driving his £225,000 Rolls Royce Casualty star Shalisha James-Davis dances in a bikini in a fun clip after marking two years cancer free Jeopardy! viewers left tickled over host Ken Jennings' 'great delivery' of cheeky answer: 'He was trying to keep a straight face!' Victoria Beckham takes a swipe at husband David as she cheekily calls him out for making her look 'ginger' in a loved-up vineyard snap Inside Harry and Meghan's Soho House-inspired royal residence but it's STILL empty as Prince Andrew refuses to live there Katie Price is flogging a 'fully naked' shower video on OnlyFans for £53 as she tries to drum up money after being declared bankrupt for second time The Bachelorette fans' wild theory about contestant Aaron Erb after his shock exit: 'It's so obvious' Bronzed is back! A-listers are making the tanned look popular again with bottled products - but experts warn Gen Z are seeking out sunbeds Rachel Riley steps out after her claims Strictly gave her PTSD and likened it to a 'hostage situation' reemerged amid the show's 'abuse' crisis Sabrina Carpenter fans slam her 2025 tour ticket prices as 'scandalous' and label it unjustified for artist 'with AT MOST four well known songs' Coronation Street star Sally Ann Matthews returns to filming following concerned fans' worries she had been axed from the soap Cindy Crawford looks effortlessly chic in a halterneck navy dress as she departs her hotel in New York Tyson and Paris Fury share sweet family photo with all seven of their children as they enjoy a lavish holiday Strictly's pros 'are furious they've been ''hung out to dry'' by former celebrity partners as the show battles growing crisis Eiza González turns heads in a daring cut out gown as she joins glamorous Camila Cabello at the Summer Gala in Saint-Tropez Kylie Minogue puts on a leggy display in sequinned gown with a thigh-high slit before dazzling onstage in sheer red dress at event in St Tropez Clint Eastwood's partner Christina Sandera's cause of death revealed after sudden passing aged 61 Piers Morgan wades into Strictly row as he says it's 'threatened by the snowflake virus' and offers to take part but ONLY with a 'brutal' partner Jasmine Yarbrough enjoys the perks of her husband Karl Stefanovic's big work trip to the Paris Olympics as she gets a themed manicure Coronation Street legend is RETURNING to the soap ahead of an iconic character's exit - six years after his last appearance Hailey Bieber reveals how she kept her pregnancy a secret for SIX MONTHS and shares her cravings - ahead of birth of first child Dua Lipa, 28, made a whopping £1million a WEEK last year as she chases Adele and Harry Styles as one of the UK's richest celebrities 'She's a future backup dancer!' Young Swiftie goes viral for showing off her incredible moves while receiving the 22 hat from Taylor during Eras Tour in Hamburg Terri Irwin shares an adorable baby picture of her daughter Bindi in sweet post marking her 26th birthday Alessandra Ambrosio, 43, shows off her phenomenal physique in skimpy black string bikini while frolicking on the beach in Brazil Lily Allen cuts a casual figure in denim jacket as she enjoys date night with husband David Harbour at baseball game in NYC Amanda Abbington seems hell bent on killing off Strictly. I think I know why, writes AMANDA PLATELL Ariana Madix goes makeup-free after being hailed by fans as a 'transparent queen' for coming clean on ALL her cosmetic surgery Rihanna flashes her underwear in miniskirt and says she's given up on her goal of having 'a six pack' this summer in cheeky new video Steady on Getting serious? Footy star Ben Silvagni joins his new girlfriend Eve Markoski and her famous parents Sam and Snezana Wood for a big family occasion Dawn French, 66, and her rarely seen daughter Billie Henry, 33, hail a taxi after shopping spree in central London Ventured out in the capital Sophie Cachia is pregnant! Influencer announces she is expecting her third child in adorable post Beth Mead shows off her toned figure as she shares bikini snaps from a girls trip to Ibiza with fellow Lionesses Peter Andre breaks silence on Strictly scandal and says this shouldn't happen 'behind closed doors' as the show battles growing crisis EastEnders and The Bill star Roberta Taylor dies at the age of 76 after an infection caused by a fall - as devastated fans pay tribute Kate Beckinsale, 50, sets pulses racing in a plunging velvet gown as she joins Kylie Minogue and newly-engaged Emma Roberts for glitzy event in St Tropez Karlie Kloss reveals her favorite Taylor Swift songs... six years after their friendship ended Rihanna hides her body under baggy jersey and camouflage cargos in NYC after telling fans she's giving up on her summer weight loss goal Katy Perry's comeback single Woman's World BOMBS on Billboard Chart... after singer held crisis talks to save album Prince William's best moments with 'Super Trooper' Princess Anne: Pictures show the pair's close bond, as she arrives in France for the Olympics Real Housewives Of Dubai: Chanel Ayan jokes that she's 'too expensive' to go swimming during Bali trip amid ongoing drama Ant McPartlin enjoys a stroll with wife Anne-Marie and their baby son Wilder in Portugal - 18 years to the day after his first wedding to his ex Lisa Armstrong Famous reality star reveals he's desperate for a spot on Farmer Wants A Wife: 'Help a bloke out' Bridgerton's Adjoa Andoh claims show has done 'nothing' to help black actors and says she called out bosses for 'failing to light her properly' Love Island viewers are left perplexed by Grace's raunchy yoga moves in the villa talent show and claim she will soon be 'starting an OnlyFans' Vicky Pattison 'is left distraught and crying her eyes out after her £200k engagement ring is stolen' just weeks before wedding to Ercan Ramadan America's Got Talent: Judges and audience set weird world record as season 19 auditions conclude on NBC Kendall Jenner looks flawless in a tiny polka dot bikini on latest Vogue cover as she reveals she 'doesn't read criticism' to protect her mental health Shelley Duvall's longtime partner Dan Gilroy files legal docs over her estate in Texas court after her death at 75 Hollyoaks star Angus Castle-Doughty reveals he battled an eating disorder and body dysmorphia after stripping off for a nude scene in Netflix show Kathy Hilton causes CHAOS on the catwalk as she bumps into a model while hijacking the runway at RHOBH costar Sutton Stracke's fashion show Denise Richards' conservative daughter Lola Sheen, 19, shops in Malibu ahead of starring in E! reality show with her family RICHARD EDEN: I can be saucy at any age! Sharon Stone hits back after being criticised for recreating her iconic Basic Instinct scene SpongeBob SquarePants star Tom Kenny reveals his cartoon alter ego is autistic: 'That's his superpower' RICHARD EDEN: Sarah Ferguson raises €100,000 for charity by offering to entertain super-rich bidder at Royal Lodge she shares with Prince Andrew EPHRAIM HARDCASTLE: Will Meghan Markle embark on a political career is her friend Kamala Harris beats Trump to the White House? Angelina Jolie's dad Jon Voight pours fuel on vicious family feud with daughter as he insults her political view Kylie Jenner's new Khy swimwear collection is roasted after disastrous launch of her previous line: 'Just keeps getting worse' Victoria Beckham relaxes on her family yacht while husband David poses for a cute snap with daughter Harper as they enjoy a sunset in France Blake Lively and Ryan Reynolds are brutally trolled over the unusual baby name of their fourth child Slammed on social media Jennifer Lopez laughs as she bicycles in a bra top, skirt and heels while flashing wedding band from Ben Affleck... day before her 55th birthday Gigi Hadid covers up in a blue trench coat and trucker hat after a photo shoot in NYC - as wild Hugh Jackman dating rumors are debunked Amy Adams joins hunky model Davide Gianni and The Office star Rainn Wilson on a yacht while filming their upcoming drama At the Sea Jennie Garth says deaths of Beverly Hills, 90210 costars Luke Perry and Shannen Doherty have made her 'very fearful' of her mortality Love Island viewers cringe at Joey Essex and his 'problematic' rapping as unimpressed fans slam the villa's 'embarrassing' talent show Katie Holmes shows off her fresh-faced complexion while rocking a nose ring in cute selfies with her cat... after THOSE black eye shots Sam Neill reveals the big name Aussie actor who lent him support during his cancer treatment: 'That's a real friend' Tom Brady linked to Sports Illustrated swimsuit model Brooks Nader in latest rumored fling following Gisele Bundchen divorce Lea Michele shows off baby bump as she shares her quick 'self care routine' with fans - ahead of birth of second child Taylor Swift gives a royal shout-out to self-proclaimed 'King Swiftie' Flavor Flav during her concert in Germany Fans go wild over Elsa Pataky's 'sexy' European accent as she speaks fluent Spanish in heartwarming clip Cost of Royal family engagements over the last year increases by £300,000 to £4.2m despite appearances being scaled back Love Island's Jessy leaves Joey Essex speechless as she reveals she was taught hidden talent by German circus professionals Inside G Flip and Chrishell Stause's wild Western nuptials: Stars open up their wedding album after they tie the knot for a second time Zoe Hardman shows off her toned legs in black polka dot shorts and heels as she arrives at Heart FM studios Caught the eye on Tuesday Alicia Vikander wows in a grey bra and see-through top in a striking shoot for ELLE UK as she opens up on 'physically demanding' childbirth Kate's photography has sparked a scandal - AGAIN! And, says CAROLINE BULLOCK, this time it's all the fault of low-class Americans Controversy Lady Gaga looks sporty in a black cap and satin bomber jacket after dinner in Paris - after release of new Joker: Folie à Deux trailer Vogue Williams flaunts her incredible figure in a TINY leopard print string bikini as she hits the beach during her Spanish getaway Sophie Ellis-Bextor admits Strictly was so 'uncomfortable' for her husband he needed counselling and 'spiralled' when she wouldn't text back James Norton and Olivia Rodrigo's boyfriend Louis Partridge have a brush with the law as they film Netflix drama The House Of Guinness Celine Dion is mobbed by fans during appearance in Paris amid claims she will perform at the 2024 Olympic Games opening ceremony Victoria Beckham wows in a little black dress as she enjoys romantic meal with husband David at a stunning Vineyard in France Emma Corrin shows off their kooky sense of style in a dress with HUGE bow detailing as they leave Good Morning America studios King Charles' wind farm eco drive helps Royal family's land and property holdings double to a record £1.1billion Raking it in Coleen Rooney elevates her activewear with stylish cat-eye sunglasses as she leaves the gym Outside a Cheshire gym on Tuesday Gigi Hadid and Hugh Jackman wild dating rumors DEBUNKED - as model continues to remain quiet on Bradley Cooper romance Michael Jordan serenaded with Chicago Bulls' iconic intro song while on luxurious St. Tropez vacation Currently jetting around Europe this summer Gavin Rossdale, 58, and his girlfriend Xhoana X, 35, don all-black attire to catch a flight out of LAX Airport Leaving Los Angeles It's WhatsApp Wills! How the Prince of Wales runs his vast Duchy of Cornwall estate worth £1bn via mobile phone messages Slash's stepdaughter Lucy-Bleu Knight's autopsy is complete but mystery remains over her cause of death after shock passing aged 25 Josh Allen and Hailee Steinfeld go Instagram-official as the Bills star posts sweet photos of their romantic trip to Paris King Charles trip to Yorkshire by Royal Train pulled by the Flying Scotsman cost British taxpayers £52,000, royal accounts reveal Busty Sofia Vergara shows off her new love Justin Saliman on vacation in Italy - as she brushes off bitter comments from ex Joe Manganiello Sarah Jessica Parker looks chic in a chevron sweater over a hot pink dress on the set of And Just Like That in NYC Back on set Katy Perry shows off custom-designed heart balloon costume for 143 album cover - as she brushes off Woman's World flop and career crisis EXCLUSIVEAriana Madix and Katie Maloney FIRE BACK at ex-chef after being sued as they file opposition and trademark for Something About Her Bebe Rexha sunbathes topless as she displays her curves in sexy monokini during luxurious getaway to Mykonos Anthea Turner opens up on her health battle with bone condition and reveals the 'everyday changes' she has made to her life to manage it Strictly's Amanda Abbington sends thinly-veiled message to Giovanni Pernice following his 'mad woman' dig after she branded him 'cruel' Don Buchwald dead at age 88: Howard Stern's longtime agent passes away from natural causes Died on Monday at his home EXCLUSIVEFamily of England star OIlie Watkins' fiancée Ellie Alderson say their engagement is 'wonderful' and they are a 'beautiful couple' Rita Ora flashes her taut abs in a knitted crop top as she steps out in London - after revealing she 'stopped trying to impress people' Bianca Censori risks outrage once again as she flouts Chateau Marmont's 'business casual' dress code in another micro-bikini at the exclusive LA venue Moving on! Christina Hall is back filming The Flip Off WITHOUT estranged husband Josh Hall just days after filing for divorce Kate and Rio Ferdinand showcase their beach bodies as they put on a loved-up display during sunshine break in Mykonos Mama June wins small victory in bitter custody battle with Anna 'Chickadee' Cardwell's ex over her granddaughter Kaitlyn, 11 Deadpool & Wolverine poised to inject new life into the box office with a projected $170M debut Popular movie EXCLUSIVEKelly Bensimon shows off her physique in black sports bra and neon shorts as she says she found 'clarity' after splitting with fiancé Advertisement Follow DailyMail Subscribe Daily Mail Follow @dailymail Follow DailyMail Follow MailOnline Follow Daily Mail MORE DON'T MISS Salma Hayek waves to fans during the Paris Olympics torch relay in Versailles ahead of the opening ceremony The actress chose an activewear ensemble Joy for former Little Mix star Leigh-Anne Pinnock as her niece is found safe and well nearly 24 hours after she went missing John Mulaney's ex-wife reveals she wrote a SUICIDE note in the wake of him dumping her and starting relationship with Olivia Munn The Repair Shop host Jay Blades announces a surprising new career move - sparking a heartwarming response The TV personality has some big news Jason Aldean's wife Brittany Aldean dredges up Maren Morris feud - calls her 'pro-woman' stance 'bulls***' following transphobia spat Hailey Bieber bares her baby bump as she reveals her pregnancy diet... and why she announced she was expecting at six months along Katie Price flaunts her huge tattoos and the results of 17th boob job in sexy French maid outfit Racy Halsey goes nearly topless in teaser for Lucky music video... after revealing she got Britney Spears' 'blessing' to sample her song of the same name Jersey Shore star Angelina Pivarnick pleads NOT GUILTY for assault and resisting arrest after incident at $1.3M New Jersey mansion Hailey Bieber reveals why she is no longer as close to father Stephen Baldwin and uncle Alec Baldwin as she expects 1st baby with Justin Bieber Bridgerton fans speculate over sexuality of season 4's main character and 'can't wait' for Luke Thompson's glow up As Netflix reveals Benedict will be Bridgerton's next romantic interest... who is Luke Thompson's girlfriend and co-star Harriet Cains? Kristin Cavallari flashes her abs in a black bra and tiny leather shorts while in a dive bar in Nashville to introduce her new jewelry collection EXCLUSIVELook away, Orlando! Katy Perry flaunts her figure as she shares a raunchy kiss with shirtless model while filming new music video Brittany Mahomes gets real about skin struggles while battling 'sickness and exhaustion' amid 'hardest' pregnancy yet She got it from her mama! Gemma Owen displays her incredible figure in a skimpy bikini as she hits the beach in Ibiza with her glamorous mum Louise Lisa Kudrow doubles down on hating studio audience laughter while filming Friends: 'It wasn't an honest response' Candid Long Lost Family viewers are left 'sobbing their hearts out' as woman reunites with her son 55 years after she was forced to give him up for adoption Hailey Bieber claims critics 'don't want to believe' she and husband Justin are happy adding haters have made her 'feel bad about my relationship' Ryan Reynolds gushes over Blake Lively's support on Deadpool & Wolverine - after she rocked sexy outfit inspired by his character to premiere Elizabeth Hurley shows off her jaw-dropping physique in a black see-through crochet dress as she poses for a sizzling video Bethenny Frankel, 53, showcases her fit figure as she and daughter Bryn, 14, enjoy the beach in St Tropez: 'Double the fun' BBC boss Tim Davie breaks silence over 'mistreatment' of contestants on Strictly: Director general says he is 'very sorry' Zendaya and Euphoria creator Sam Levinson allegedly have 'strained relationship' after he turned his attention to The Idol BBC radio journalist Nick Garnett has hilarious response after corporation reveals its top earners' salaries Left his followers chuckling Matt Goss reveals terrifying stalker ordeal: Singer says he has been left 'emotional' after person got 'very, very close' to his home before being arrested Loose Women fans call out Ruth Langsford for 'disrespectfully snubbing' Eamonn Holmes while discussing family on the ITV show EXCLUSIVEKelly Bensimon says she wouldn't get back with ex-fiancé Scott Litner now even if he DID agree to sign a prenup: 'Time kills all deals' Coronation Street film heartbreaking scenes for Paul Foreman's funeral as Billy Mayhew and cast arrive at church Jeff Brazier reveals why he won't sign up for beleaguered show Strictly Come Dancing Strictly stars' secret signs of support for scandal-hit show: Pro dancers share cryptic messages while arriving at rehearsals EXCLUSIVEDays of Our Lives actress Jessica Michel Serfaty accused fiancé Leonardo Del Vecchio of abuse before 'revoking' claims hours later Denise Welch as you've never seen her before! Presenter teases new look on Loose Women Amy Winehouse's tearful father Mitch wraps a comforting arm around mother Janis as they visit her grave on the 13th anniversary of her death Keanu Reeves, 59, talks 'crippling' obsession with dying and reveals why he's 'thinking about death all the time' Carrie Underwood Day declared in Hawaii as the American Idol winner performs in the Aloha state for the first time Glamorous Sharon Stone and Orlando Bloom mingle with Sarah Ferguson at star-studded Knights Of Charity Gala in Cannes Matthew Macfadyen reveals why he HATED playing iconic Pride & Prejudice role: 'I wish I had enjoyed it' Michael Barrymore hints Dancing on Ice could become next TV show embroiled in misconduct scandal after 'witnessing abuse worse than Strictly' Ryan Reynolds reveals cute nickname his kids have given Deadpool & Wolverine costar Hugh Jackman... after sharing name of fourth child Selena Gomez models a necklace with a B for Benny Blanco as he reacts by saying he's got the 'hottest chick in the game wearing my chain' Sydney Sweeney's cellphone taken over by scammers and X account HACKED on SAME day - as cryptic messages emerge on social media Céline Dion is 'set to make comeback performance at 2024 Paris Olympic Games' amid harrowing battle with Stiff Person Syndrome Selena Gomez gushes boyfriend Benny Blanco is the 'love of my life' with sweet snap of him kissing her forehead Ryan Reynolds' Deadpool co-star Karan Soni reveals actor's 'heart has just grown even bigger' since he became a father Ecstatic Tilly Ramsay is joined by her proud parents Gordon and Tana and her sister Holly as she graduates from university with psychology degree Princess Beatrice looks ready for royal duty as she visits London school to promote sun safety in £295 dress from Kate-approved brand ME+EM Confessions of a Shopaholic author Sophie Kinsella, 54, breaks down in tears as she candidly details her harrowing battle with brain cancer Rory Feek ties the knot with his daughter's schoolteacher in rustic Montana wedding - eight years after the passing of his wife and singing partner Joey Strictly pro Aliona Vilani admitted to forcing Matt Baker to dance through sickness during his time on the show in 2010 Strictly bosses rope in 'extra security' at rehearsals as pro dancers fear they are at the centre of 'possible backlash' Bachelor In Paradise stars Ashley Iaconetti and Jared Haibon welcome 2nd child - and reveal Star Wars-inspired name as well as nod to Tom Cruise Joker: Folie à Deux new trailer: Joaquin Phoenix is seen kissing Lady Gaga's Harley Quinn as he 'finds true love' in the R-rated sequel 'Kamala is BRAT': Charli XCX baffles news anchors Rachel Maddow and Jake Tapper with viral Harris declaration BBC boss Tim Davie defends paying Huw Edwards his full annual salary of £479,000 - and raising his pay by £40,000 - despite news anchor being off air Nick Nolte, 83, makes a rare sighting while stocking up on groceries in LA after getting cast in new crime thriller Love Island SPOILER: Tension rises as Ayo tells teary-eyed Jessica his family prefer old flame Mimii Netflix confirm who will be the new romantic lead in Bridgerton season 4 in huge announcement Rory McIlory and Erica Stoll pictured on romantic getaway to Portugal weeks after announcing their divorce is on hold Resurfaced video of a young King Charles showing off his moves on a dancefloor in Rio de Janeiro delights royal fans EXCLUSIVEHow Jennifer Lopez and Ben Affleck have been secretly working to REKINDLE their romance - despite actor missing his wife's birthday lunch Emmerdale star Claire King brands Strictly's Brendan Cole 'really nasty' after he 'ground down her confidence' in a resurfaced interview Celine Dion is in great spirits as she arrives in Paris ahead of the 2024 Olympic Games after chronicling her battle with stiff-person syndrome Kyle Richards had to be 'calmed down' by Kathy Hilton after seeing Mauricio Umansky, 54, kissing new young lover Nikita Kahn, 33 BBC's top earners revealed: Huw Edwards was third highest paid star on £479,999 after 9 per cent pay rise despite time off air following scandal Melissa Gorga, 45, of Real Housewives Of New Jersey reveals the easy rule she follows to stay young looking: 'I don't let any slips happen' BBC shock jock Stephen Nolan remains corporation's fifth highest paid presenter on £450,000 - a year after apologising 'for sharing explicit images of Stephen Bear' Country music star Lainey Wilson suffers very embarrassing wardrobe malfunction on stage: 'You were about to get a REAL show!' Blake Lively shuts down Ryan Reynolds DIVORCE rumors and speculation over their marriage: 'They wish' Speaking out Strictly's Will Bayley claims he was left unable to walk for six months after injuring himself on the show as he calls upon BBC bosses to apologise EXCLUSIVEBBC bosses scramble to save Strictly as now 'victims' form secret support group: Tess Daly and Claudia Winkleman 'to open new show with apology to celebrities' Kim Zolciak reveals which star made her feel 'safe' on Surreal Life as she works with Josie Canseco, OT Genasis and 'great guy' Chet Hanks Blind Barbie backed by British disability campaigner is the latest in Mattel's inclusive range EXCLUSIVEMeghan Markle dons a crisp white £245 shirt and £12,800 Cartier necklace as she steps out with actress Kimberly Williams-Paisley in Montecito Sabrina Carpenter fans claim getting tickets to her 2025 tour is 'HARDER' than Taylor Swift's Eras Tour as users are booted out of Ticketmaster queue Strictly pros brush off the latest drama as they put on a cheerful display for rehearsals amid claims 'entitled' show veterans could be axed Newly-single Nadiya Bychkova arrives for Strictly rehearsals after splitting from co-star Kai Widdrington and complaining to BBC bosses Alex Jones delights fans in rare PDA with husband Charlie Thomson after making 'big decision' to move house for the sake of their children Princess Diana's brother Earl Spencer and his third wife Karen separately share heartbreaking family update on Instagram Swifties hail Travis Kelce's dad after brutal response to Taylor Swift's stalker being arrested Katie Piper admits she's concerned about her children's safety after her daughter was approached by a stranger impersonating a child online Alicia Silverstone shares beautiful topless photo taken during her pregnancy with now-teenage son Bear Crown Princess Elisabeth of Belgium is joined by her proud parents and siblings at her graduation ceremony from the University of Oxford Kerry Katona reveals she hasn't seen her eldest daughter Molly, 22, for a whole YEAR - after breaking down in emotional interview Vick Hope flashes major sideboob in plunging gold dress while cosying up to husband Calvin Harris as she shares slew of summer snaps Who is Meghan Markle's lunch pal? Kimberly Williams-Paisley starred in Father of the Bride alongside Steve Martin and is married to Brad Paisley How Conan O'Brien REALLY felt about Matthew Perry filming Friends with his then girlfriend Lisa Kudrow Little Mix star Leigh-Anne Pinnock issues fresh appeal for help after her niece Faith, 13, vanished without a phone yesterday Keanu Reeves admits he 'didn't write any' of his new novel and reveals he cried with joy after reading the first draft by China Mieville Strictly celebs are 'comparing notes and building cases' about their experiences with pro dancers in a 'secret support group' Who is Ellie Alderson? Meet Euros hero Ollie Watkins' supportive WAG as he proposes to her at Lake Como during romantic getaway Richard Madeley defends Strictly's Ola Jordan amid claims she 'bullied' partner Steve Backshall How Keanu Reeves became the nicest guy in Hollywood! The beloved star's kind gestures after overcoming personal tragedy Brooklyn Beckham and Nicola Peltz celebrate 'throuple' member Selena Gomez's birthday with double date with her boyfriend Benny Blanco Andrew Garfield's 'professional witch' girlfriend Kate Tomas hits back at trolls who have criticised her appearance Meghan Markle could miss Prince Harry's Invictus Games in Birmingham due to security fears after prince lost High Court challenge Hugh Jackman reveals why going to an NFL game with Taylor Swift didn't make him 'feel great' about his career Strictly Come Dancing RECAP: BBC chief apologises to celebrities amid bullying scandal but confirms show WILL go on Pregnant Lala Kent turns heads showing off her baby bump in a risqué sheer jumpsuit as she poses at star-studded Sutton Green fashion show Taylor Swift fans Prince George and Princess Charlotte - and even Grandpa Wales - can't get enough of summer trend for friendship bracelets BBC 'considers axing \"entitled\" Strictly veterans' and entertainment boss 'fights for her job' Olly Murs chokes back tears as he reveals he is feeling overwhelmed after performing in honour of Caroline Flack at a festival in her memory Can you guess who this former X Factor star is? Blonde singer brings back the nostalgia as she performs at music festival Blake Lively stuns in a floral latex mini as she and Gigi Hadid support the actress' husband Ryan Reynolds at after party for his Deadpool X Wolverine premiere Katie Price says 'everything is sorted' with her second bankruptcy after being evicted from her Mucky Mansion Emma Corrin puts on a leggy display in a gold mini dress as they join dapper boyfriend Rami Malek at the Deadpool & Wolverine after party Inside the world of Paul Mescal's new 'love interest' Gracie Abrams: US pop star is pals with Taylor Swift and daughter of a Star Wars filmmaker legend Rosie Huntington-Whiteley looks incredible in a see-through green crochet top as she heads out shopping in West Hollywood Kourtney Kardashian enjoys romantic date night with husband Travis Barker at Eleven Madison Park in New York Morena Baccarin puts on a busty display in plunging leather dress as she's joined by husband Ben McKenzie at premiere of Deadpool & Wolverine Keanu Reeves dramatically demonstrates how he broke his kneecap while filming comedy movie EDEN CONFIDENTIAL: Mishal Husain hits back at Meghan Markle over claim her engagement interview was 'orchestrated' Blake Lively channels Deadpool in sexy outfit alongside Gigi Hadid at star-studded premiere for husband Ryan Reynolds' new movie 16 and Pregnant star Autumn Crittendon dead at 27: Mom-of-three dies suddenly at home after battling recent health issues Natalie Portman, 43, shows off her toned legs in stylish denim shorts as she sips on fizzy root beer during an outing in Los Angeles Ollie Watkins is engaged! England goal hero proposes to girlfriend Ellie Alderson at Lake Como as they holiday in Italy after Euro 2024 heartbreak Sharon Stone signs on to play the villain in Bob Odenkirk's 2025 action sequel Nobody 2 Madonna makes surprise appearance at Deadpool vs Wolverine premiere with twin daughters Estere and Stella, 11 How Prince Andrew's wedding 38 years ago could have been MUCH less glamorous: Sarah Ferguson wanted teddy bear and helicopter symbols on her dress Katie Holmes sports bruised face and eye as she keeps a low profile in NYC - while daughter Suri Cruise prepares to leave home for college Miriam Margoyles, 83, fears she will run out of money to pay carers amid health woes and continues working to 'save cash' Ariana Madix comes clean on ALL the cosmetic surgery tweaks she's had done to her face after triumphant Love Island season Blake Lively and Ryan Reynolds' secret baby name revealed! Deadpool star shares VERY unusual Nordic moniker of their fourth child 16 months after birth Emma Bunton 'in battle with HMRC over whopping £4M Spice Girls reunion tour payday' - five years after taking to the stage Nicole Kidman makes RARE comment about working with ex-husband Tom Cruise on Stanley Kubrick's Eyes Wide Shut - and admits they had to share a trailer to save money What flop? Katy Perry kisses a fan, downs shots and crowd surfs at Barcelona nightclub in - amid MAJOR pop career crisis Kendall Jenner looks red hot in tiny string bikini while enjoying luxury boat ride on lake vacation Pregnant Nina Agdal caresses her burgeoning baby bump while wearing a white bikini as she and her fiancé Logan Paul vacation by the sea Jennifer Lopez hides wedding ring finger under gigantic sleeve as she shows off her Hamptons style in pink sports bra Strictly's 'longest-serving dancers who consider themselves \"untouchable\" could be AXED' as rehearsals begin for latest series Emma Corrin commands attention as they step out in a leggy faux fur trimmed leotard and stilettos for Deadpool & Wolverine world premiere Katya Jones brushes off Strictly Come Dancing chaos as she celebrates being 'back with the gang' for first day of rehearsals ahead of new series Iconic nineties children's show is 'returning after 17 years off air' - with comedian Romesh Ranganathan set to step in as its new host Strictly in 'panic mode' as show's scandals have 'no signs of abating' and are 'getting worse by the day Deadpool & Wolverine a hit with early audiences: Ryan Reynolds and Hugh Jackman hailed as 'the ultimate duo we've all been waiting for!' From Hollyoaks to Hollywood! Soap actress, 6, gets her big break 2 years after a debilitating stroke that left her temporarily paralysed Michelle Keegan stuns in leggy shorts and towering heels before changing into a chic cut-out dress in new photoshoot for Numero Magazine Alison Hammond is left stunned as This Morning airs a clip of her late mother watching presenter on Stars In Their Eyes Lady Gaga surprises fans by blowing kisses from the sunroof of her luxury car in Paris after they waited hours for a glimpse of pop icon leaving her hotel Madonna, 65, enjoys a night out in the West End as leather-clad pop veteran watches controversial (and very raunchy) Slave Play Love Island SPOILER: Joey Essex reunites with sister Frankie and nanny Linda as they say 'mum would be so proud' Robert Irwin's net worth revealed as he 'rakes in the cash' from his lucrative presenting gigs Earning loads of money Lionel Messi and stunning wife Antonela relax with Luis Suarez and family on Miami boat trip after Copa America victory and ankle injury EXCLUSIVEActress, 84, cuts a radiant figure in London in first sighting since 2016 - after debate over sex scene with late Donald Sutherland is reignited Amanda Holden, 53, shows off her incredible figure in a blue strapless bikini while on holiday in Greece Looked toned and trim Eva Longoria, 49, almost suffers ANOTHER wardrobe malfunction as she goes braless while jogging in Marbella Little Mix is hit with claim that Jesy Nelson's vocals on band's final track as a foursome were recorded by an 'impersonator' Ben Affleck looks dapper as he arrives at his LA office after skipping Jennifer Lopez's Bridgerton-themed birthday bash amid their marital woes Tiger Woods' son Charlie struggles during opening round of US Junior Amateur Open as 15-year-old shoots plus-12 under his father's watchful eye Brittany Cartwright is busty in blue swimsuit as she splashes around with son Cruz, three, and brushes off $35k tax troubles Giovanni Pernice shops in Manchester while ex Molly Brown appears downcast as she emerges for the first time since split EXCLUSIVEKevin Costner's ex-wife Christine Baumgartner, 50, moves again to $22,000-a-month rental just two miles from lover's home Robert Irwin wins major award after being slammed for his Gold Logie nomination He has won a major award at the Nickelodeon Kids' Choice Awards. Paul Mescal fuels romance rumours with pop star Gracie Abrams as they are both spotted shopping in Mayfair Sarah Jessica Parker and John Corbett are suited up for a MAJOR event in And Just Like That... as they film scene in all black Steve Backshall complained to the BBC about his Strictly pro Ola Jordan back in 2014 claiming she 'bullied' him - amid fears show is 'fatally tarnished' EXCLUSIVEOwning Manhattan's Jade Shenker lifts the lid on plans for a second season amid wild behind-the-scenes tension Kaya Scodelario and ex-husband Benjamin Walker are 'back on': Exes enjoy a cosy reconciliation at Maldives art gallery five months after split Rita Ora reveals she has 'stopped trying to impress people' as she opens up about married life with director and actor Taika Waititi Emily In Paris season four trailer: Lily Collins' character embraces newly-single life as she tries to steer clear of THAT love triangle... but will she find her way back to Alfie or Gabriel? Susan Sarandon vows to keep speaking out against injustice after being dropped by her agent for saying Jewish people 'are getting a taste of what it feels like to be Muslim' Blake Lively is seen kissing her husband Ryan Reynolds while he is dressed up as Deadpool as fans speculate she plays Lady Deadpool The House Of Guinness FIRST LOOK: James Norton looks every inch the villain as he is seen in character for the first time Zara McDermott admits she would've preferred a different Strictly dance partner than Graziano Di Prima in unearthed interview following emergence of abuse allegations Former Strictly pro Kristina Rihanoff defends show as she claims 'every second' of rehearsals was filmed dur","summary":"The DIY SOS star, 61, signed up after months of talks with show bosses, with sources claiming he's 'willing to give anything a crack.'","url":"https://www.dailymail.co.uk/tvshowbiz/article-13669667/Nick-Knowles-Strictly-Come-Dancing-lineup-abuse-claims.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/07/25/00/87732173-0-image-m-23_1721862152755.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/07/24/1590743924478030025/1024x576_MP4_1590743924478030025.mp4","publish_date":"2024-07-24 23:11:20","author":"Editor,Laura Fox","authors":["Editor","Laura Fox"],"language":"en","source_country":"gb","sentiment":0.084},{"id":252556096,"title":"DOJ Watchdog Attributes Roger Stone’s Reduced Sentence to Poor Leadership","text":"The Justice Department’s in-house watchdog found no evidence of political interference in the reduction of a prison sentence proposed for the longtime Trump ally Roger Stone in 2020, attributing the stunning reversal to “ineffectual” leadership, according to a report released on Wednesday. The report concluded a four-year investigation into the decision by Attorney General William P. Barr in February 2020 to reduce Mr. Stone’s proposed sentence to about three years, after initially recommending seven to nine. The episode incited accusations of political interference and prompted four prosecutors in the case to resign. The decision to seek a lighter sentence was announced after President Donald J. Trump sharply criticized the harsher sentence initially proposed by career prosecutors after Mr. Stone was convicted in 2019 for lying to Congress during its investigation into Mr. Trump’s connections to Russia. He denounced the sentencing recommendation as a “miscarriage of justice.” But the inspector general, Michael E. Horowitz, concluded that Mr. Barr had argued that the more stringent sentence was unreasonably harsh before Mr. Trump expressed those sentiments. Mr. Barr was blindsided by a subordinate who had led him to believe the department would request a lesser prison term, Mr. Horowitz wrote.","summary":"The Justice Department’s in-house watchdog released its report on the reduction of Roger Stone’s sentence in a 2019 case related to the Trump-Russia investigation.","url":"https://www.nytimes.com/2024/07/24/us/politics/doj-watchdog-roger-stone-sentencing.html","image":"https://static01.nyt.com/images/2024/07/24/multimedia/24DC-STONE-wmfb/24DC-STONE-wmfb-facebookJumbo.jpg","video":null,"publish_date":"2024-07-24 23:10:20","author":"Glenn Thrush","authors":["Glenn Thrush"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.096},{"id":252556756,"title":"DNC issues 3-day ultimatum to any potential Harris challengers","text":"The Democratic National Committee (DNC) is telling any would-be challengers to Vice President Kamala Harris to either file their paperwork in the next three days or to wait until 2028. Politico reported Wednesday that the DNC is hoping to close the door on any chances of a fractured party by the end of the week. Delegates who will officially select the party's nominee at next month's Democratic National Convention recently approved rules for the upcoming virtual roll call on July 30. Any candidates aiming to ask delegates to support their bid for the nomination will need to submit their paperwork confirming their candidacy by Saturday at 6 PM Eastern Time. Then, in order for any candidate to qualify for the virtual roll call on August 7, they will need to gather 300 signatures from delegates — with no more than 50 coming from the same state — by Tuesday, July 30. According to Politico, the August 7 deadline is set in stone, given Ohio's ballot access deadlines. READ MORE: Trump 'freaking out' as he's 'caught in a no-win situation' against Harris: report “Failure to certify both nominees in advance of each state’s ballot access deadline opens us up to very real political and litigation risk, both before and after the election,” DNC legal counsel Pat Moore told the publication. “Republicans will use this moment to do what they do: to sue, to try to bar us from the ballot, or to try to disqualify our voters.” Should no potential candidates file paperwork by Saturday, then Harris will be guaranteed the Democratic Party's nomination at the convention next month. However, the convention's nomination will likely be a formality, as Harris has already managed to unite virtually the entire party behind her candidacy since President Joe Biden issued a statement confirming his exit from the 2024 race — and his endorsement of his vice president — on Sunday evening. Since Biden stepped aside, Harris has been accumulating endorsements from popular Democratic governors like Andy Beshear (D-Kentucky), Phil Murphy (D-New Jersey), Gavin Newsom (D-California) and Josh Shapiro (D-Pennsylvania). Earlier this week, House Minority Leader Hakeem Jeffries (D-New York) and Senate Majority Leader Chuck Schumer (D-New York) threw their weight behind Harris' bid. \"Kamala Harris is now the right person to take up the torch, defeat Donald Trump, and succeed Joe Biden as president,\" Transportation Secretary Pete Buttigieg, who ran against Biden and Harris for the 2020 Democratic nomination, told the Wall Street Journal. READ MORE: Schumer and Jeffries gleefully endorse Harris in joint presser after Trump morning meltdown Harris' nomination appeared inevitable almost as soon as Biden endorsed her. In the 24 hours following Biden's announcement, Harris raised a record-setting $81 million in campaign donations. That's almost $30 million more than former President Donald Trump raised following his 34 felony convictions. She raised another $45 million the next day, meaning the vice president has added $126 million to the $240 million war chest she inherited from Biden. Harris' campaign has also signed up roughly 100,000 new volunteers to reach out to voters since her bid for the presidency launched last weekend, according to WBAL journalist Jayne Miller. These volunteers will likely be deputized to turn out voters in major battleground states likely to play a pivotal role in deciding the winner of the 2024 election, like Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin. The Democratic National Convention will kick off in Chicago, Illinois on August 19, and will end on August 22, likely with Harris formally accepting her party's presidential nomination. READ MORE: (Opinion) Why the unity around Harris is good for democracy Click here to read Politico's report in full.","summary":"The Democratic National Committee (DNC) is telling any would-be challengers to Vice President Kamala Harris to either file their paperwork in the next three days or to wait until 2028.\n\nPolitico reported Wednesday that the DNC is hoping to close the door on any chances of a fractured party by the end of the week. Delegates who will officially select the party's nominee at next month's Democratic National Convention recently approved rules for the upcoming virtual roll call on July 30. Any candidates aiming to ask delegates to support their bid for the nomination will need to submit their paperwork confirming their candidacy by Saturday at 6 PM Eastern Time. \n\nThen, in order for any candidate to qualify for the virtual roll call on August 7, they will need to gather 300 signatures from delegates — with no more than 50 coming from the same state — by Tuesday, July 30. According to Politico, the August 7 deadline is set in stone, given Ohio's ballot access deadlines.\n\nREAD MORE: Trump 'freaking out' as he's 'cau","url":"https://www.alternet.org/dnc-harris/","image":"https://www.alternet.org/media-library/image.jpg?id=52253259&width=1200&height=600&coordinates=0%2C560%2C0%2C560","video":null,"publish_date":"2024-07-24 23:10:01","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":-0.285},{"id":252555728,"title":"FBI director discusses the Trump rally shooter’s search history and drone details","text":"FBI director Christopher Wray said on Wednesday that the person who attempted to assassinate former President Donald Trump searched the web for “How far away was Oswald from Kennedy?” one week before the rally shooting, as reported by the The New York Times. Investigators recovered the search from a laptop linked to 20-year-old Thomas Matthew Crooks, which refers to the 1963 assassination of President John F. Kennedy by Lee Harvey Oswald. “That’s a search that’s obviously significant in terms of his state of mind,” Wray said during a hearing before the House Judiciary Committee. “That is the same day that it appears that he registered for the Butler rally.” [Media: https://www.youtube.com/watch?v=cNZZYxDjvBA] As reported by the NYT, Wray said Crooks visited the site of the Butler, Pennslyvania rally two times on the morning of July 13th. During his second visit, the shooter appears to have flown a drone around the showground for about 11 minutes. The drone was made by DJI, according to a report from CNBC. The FBI also broke into the shooter’s phone last week, but his motive remains unclear. “A lot of the usual repositories of information have not yielded, anything notable in terms of motive or ideology,” Wray said.","url":"https://www.theverge.com/2024/7/24/24205527/trump-rally-shooter-search-history-drone-fbi","image":"https://cdn.vox-cdn.com/thumbor/_Nmh513ei1pcO8JPH6S8zPZY9Xk=/0x0:3000x2000/1200x628/filters:focal(1500x1000:1501x1001)/cdn.vox-cdn.com/uploads/chorus_asset/file/25531774/STK175_Trump_Fist_Glitch.jpg","video":null,"publish_date":"2024-07-24 23:09:24","author":"Emma Roth","authors":["Emma Roth"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.308},{"id":252555302,"title":"What American history can teach us about this moment in U.S. politics","text":"What American history can teach us about this moment in U.S. politics In the past two weeks, former President Donald Trump survived an assassination attempt and President Biden ended his reelection campaign. Has there ever been two weeks in American history like this? The answer: Yes and no. CBS News chief Washington correspondent Major Garrett explains.","summary":"In the past two weeks, former President Donald Trump survived an assassination attempt and President Biden ended his reelection campaign. Has there ever been two weeks in American history like this? The answer: Yes and no. CBS News chief Washington correspondent Major Garrett explains.","url":"https://www.cbsnews.com/video/what-american-history-can-teach-us-about-this-moment-in-us-politics/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/24/85f907f3-0cba-4aa5-b0b8-ee5208a3b141/thumbnail/1200x630/3aed9dda77d759166e7fb9cad37c0c91/cbsn-fusion-what-american-history-can-teach-us-about-this-moment-in-us-politics-thumbnail.jpg?v=5501038cbc281520f","video":null,"publish_date":"2024-07-24 23:07:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.693},{"id":252555200,"title":"GPT Has Entered The Chat: Inside Synchron’s BCI-OpenAI Integration","text":"Share to Facebook Share to Twitter Share to Linkedin Last week, Synchron announced an integration with OpenAI’s ChatGPT to incorporate prompt-based interactions with their brain-computer interface. In this application ChatGPT generates inputs by prompting users, whose implanted BCIs enable navigation and selection of responses. As Synchron founder and CEO Dr. Tom Oxley described to Bloomberg, the BCI restores people’s ability to choose how they respond, while AI transforms various inputs into a context-based experience. As per CNBC, Synchron’s user Mark, a person living with ALS, says the feature has saved him time and energy, and reduced pressure by giving him choices of how to communicate through the platform. In addition to restoring “faster response times, natural conversational speeds and interaction with texting” today, this integration enables Synchron to bring sound, image and video to their users for multimodal experiences in the months ahead. I spoke to Oxley about current limits, opportunities and challenges of integrating with large language models (LLM) and what this work means for the BCI field. Mark, a person living with ALS who is using Synchron’s BCI platform. (Photo credit: Synchron) Synchron MORE FOR YOU Google Confirms Bad News For 3 Billion Chrome Users—You Will Still Be Tracked U.S. Dollar ‘Destruction’—Tesla Billionaire Elon Musk Issues $35 Trillion ‘Bankrupt’ Warning As Traders Bet On A Donald Trump Bitcoin Price Boom Trump Vs. Harris 2024 Polls: Trump Narrowly Leads In Most Polls After Biden Drops Out BCI as a Harbor of Choice Synchron’s mission is restoring autonomy to their users. Oxley explained their focus with this integration is restoring the ability to engage with digital environments more naturally for people with severe mobility limitations in their upper limbs. “Generative AI is taking the inputs from the digital world in, generating prompts, and then we’re on the other side. Our deep learning models are making predictions on what the brain wants to do, so the BCI is the harbor of choice, restoring autonomy in decision making.” The BCI use case in the demo involves controlling a platform through navigation and selection of prompts displayed onto an iPad App, built with Apple’s iOS Accessibility features. Oxley says that the GPT-4o announced in May, which works across audio, vision, and text in real time, represents a frontier beyond text. “The reason we did this is because the multimodal ‘4o’ is something different, because it uses inputs from the environment that behave like an extension of the brain of the user. It can see, it can hear, and it can receive text inputs, so when the user goes to start engaging with the prompts, it's got a real time information flow of everything happening in their environment.” Powering a Personal Touch While this integration is currently a feature that can be toggled on or off, Oxley noted “We are now committing substantial resources towards novel interaction methods with generative AI.” He says the text-based feature is just the beginning, with vision, audio, and eventually video in the wings for additional use cases: “As this grows with different inputs, we're going to be building interaction methods that are simple, but which unlock access to technology that we need to use our hands for.” These could range from incorporating conversational context from family members and caregivers to powering calendar integrations and other practical applications, including eventually connecting with other consumer devices. But Oxley says the immediate focus is driven by their users. “A huge problem we're hearing from our patient population is that they're isolated because they can't engage in natural speed conversations. So the goal here is to keep up with a level of conversation, in dialogue with friends and family and caregivers. The AI bridges the gap to help keep up.” Another key piece of this integration is a feature Synchron calls emotional categorization, to provide users with a context-based array of choices. In the demo example, a doctor’s question about back pain generates different prompts spanning various positive, neutral, or negative responses. Prompts based on emotional categorization, to answer a doctor's question about back pain Synchron “When you or I get asked a question or have a conversation, we decide how to respond based on how we’re feeling. For our users, we’ve now also built some proprietary layers on top, including these emotional categorizations for selecting words and verbal prompts.” Strategic Outlook: Clear View, Long Distance Oxley believes multimodal LLM represent the future of BCI interactions. But he takes a pragmatist’s view, pointing to several variables that will determine product roadmap, business partnerships, and other commercial strategy in the coming years. Non-Exclusive This integration does not represent an exclusive partnership between Synchron and OpenAI. “This is such a fast moving field, so we're going to remain agnostic to whatever API we use based upon what is in the best interest of our users at any point in time.” Privacy Paramount Synchron has repeatedly stated that they do not share any brain data with OpenAI. Given the nature of this technology, I asked whether the platform will remember users over time. “That’s the goal, but it raises a bunch of privacy challenges,” he said. Speaking to the technical work required to configure encryption between device, local network, and cloud, he added, “We're working through what that looks like in our first commercial offering. But the product vision is to build that knowledge base of the user locally and protect that. We’re adopting a very, very high bar for privacy.” Long-term Play Oxley “honestly [acknowledged] that we debated internally as to whether we should even do this,” citing costs, time, risks, perceptions and unknowns. Ultimately, GPT’s 4o multimodal capabilities provided the impetus to move forward, to better connect users like Mark to digital systems today, and unlock broader applications across a rapidly evolving consumer technology ecosystem of tomorrow. Synchron's BCI system includes the Stentrode Endovascular Electrode Array (top right) Synchron Reflections and Ripples As a casual user of various popular LLMs, I admitted to Oxley that when I first saw the press release, I shrugged. Despite knowing full well that off-the-shelf GPT I use differs substantially from this application, I still had trouble seeing the significance. Several neurotech executives have expressed similar scrutiny in private. But with early stage technology, it’s good to have more questions than answers. As a skeptical optimist, here are some summary reflections and lingering thoughts about what LLM could represent for user applications in commercial neurotech markets. Burden of Interpretation Communicating normally is something most of us do without thinking, and thus take for granted: Analyzing a question for intent, gathering broader context based on external cues and internal feelings, and factoring that into a reply, all at conversational pace. However, what able-bodied folks like me can’t fathom is how this can represent a hurdle or even a barrier for those living with different forms of impairment, including early BCI users. If you’ve struggled to use a remote control to browse Netflix, just imagine if that was what all communication required. By removing even some burden of interpretation and other friction for users, LLM can substantially improve utility of BCI technology and lead to new use cases. Basic features are a good place to start. I’m excited to see what ideas and features emerge from end users, patient advocacy groups, caregiver circles, registries, and trial participants. Form Factor A common category of question I receive is about minimally invasive versus non-invasive neural interfaces. In this case, the question might be “Why is an implanted device even necessary to incorporate LLM?” Leaving aside various critical distinctions between implanted and non-invasive tools, in this case the question is a good one. Cognixion, Augmental, Synaptrix, and many others are commercializing wearable or non-invasive means to decode user intent into digital signals, in some cases with advantages in upgradability, cost, and safety. So while Synchron’s integration with OpenAI is fairly high profile, the truth is LLM are modality-agnostic. The upshot: Expect several other neurotech players to adopt similar and different approaches to leverage prompt automation and other LLM-enabled features in the months ahead. Towards Social Robotics Thanks to comments by Musk, enough ink has already been spilled on BCI as a portal to transhumanism, a topic Oxley has shrugged off. But a separate area in need of speculation is the role that semi-autonomous AI agents could play in future BCI markets where human privacy and safety can be protected, and LLM reliability ensured. Beyond responsive prompts, there is tremendous value to unlock through small automations for these users (and others). If personalized agents could become capable and, again, reliable, they could help with checking in, communicating with the medical team, collecting patient-reported outcomes, and possibly handling administrative labor, from managing appointments, medications, paying bills, dealing with insurers or disability offices, initiating interpersonal requests to caregivers, say to charge a device or flag other needs, and so on. Those examples are all text-based; the possibilities for incorporating audio, cameras, sensors, wearables, other inputs (e.g. BCI-derived neural data for additional passive sensing) could produce applications that arguably go beyond what we can even imagine today. To be clear, all indications suggest this level of reliability with LLM is likely years away. But, today’s prototype from Synchron, with a laser focus on user privacy and simple, value-add features, opens the door for those possibilities to take shape in the future. Widget vs. Platform Some think a reckoning is due for the frothy implantable BCI space, driven by the hype of Synchron’s main competitor. Just this week, Neuralink’s valuation hit a reported $8b, which represents a larger size than all active US neuromodulation markets segments last year ($6.6b) as per LSI’s recent analysis. The hype factor is real, but this only makes sense if one looks at BCI as an enabling platform technology. Synchron’s integration offers a keyhole view. Think of it this way: if a commercially available API can significantly augment user functionality of a class III medical device - during active clinical trials - then BCI are not simply a point solution, but an enabling technology whose features and functions are up to the market (and not necessarily regulators.) This integration is the latest example of how today’s BCI companies are building in public. What seems like relatively narrow use cases and target markets will expand because they only can, given the speed of innovation across AI, ML, materials science, surgical innovations, consumer technology, and beyond. Follow me on Twitter or LinkedIn. Check out my website. Naveen Rao Following Editorial Standards Print Reprints & Permissions","summary":"How does Synchron's new OpenAI ChatGPT integration impact commercial brain-computer interface (BCI) markets? I spoke with Founder &amp; CEO Tom Oxley to find out.","url":"https://www.forbes.com/sites/naveenrao/2024/07/24/gpt-has-entered-the-chat-inside-synchrons-bci-openai-integration/","image":"https://imageio.forbes.com/specials-images/imageserve/66a04e1e118fe1677d1eef6a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-07-24 23:05:49","author":"Contributor,Naveen Rao","authors":["Contributor","Naveen Rao"],"language":"en","source_country":"US","sentiment":0.132},{"id":252554890,"title":"Passing the baton","text":"AP – Even though United States (US) President Joe Biden won’t be on the ballot this November, voters still will be weighing his legacy. As Vice President Kamala Harris moves to take his place as the Democratic standard-bearer, Biden’s accomplishments remain very much at risk should Republican Donald Trump prevail. How Biden’s single term – and his decision to step aside – are remembered will be intertwined with Harris’ electoral success in November, particularly as the vice president runs tightly on the achievements of the Biden administration. Biden had an opportunity to make a case for his legacy – sweeping domestic legislation, renewal of alliances abroad, defense of democracy – yesterday when he delivered an Oval Office address about his decision to bow out of the race and “what lies ahead”. And no matter how frustrated Biden is at being pushed aside by his party – and he’s plenty upset – he has too much at stake simply to wash his hands of this election. Biden endorsed Harris shortly after he announced on Sunday that he would end his candidacy, effectively giving her a head start over would-be challengers and helping to jumpstart a candidacy focused largely on continuing his own agenda. “If she wins, then it will be confirmation that he did the right thing to fight against the threat that is Trump, and he will be seen as a legend on behalf of democracy,” said executive director of the George Washington Presidential Library at Mount Vernon presidential historian Lindsay Chervinsky. “If she loses, I think there will be questions about, did he step down too late? Would the Democratic Party have been more effective if he had said he was not going to run?” Similar what-ifs play out at the end of every presidency. But Biden’s defiance in the face of questions about his fitness for office and then his late submission to his party’s crisis of confidence heighten the stakes. The last vice president to run for the top job was Democrat Al Gore, who sought to distance himself from President Bill Clinton during the 2000 campaign after the president’s affair with a White House intern and subsequent impeachment. Harris, in contrast, has spent the better part of the last three years praising Biden’s doings – meaning any attempt to now distance herself would be difficult to explain. And she has to rely on the Biden political operation she inherited to win the election with just over 100 days to go before polls close. Speaking to campaign staff on Monday, Harris said Biden’s legacy of accomplishment “just over the last three and a half years is unmatched in modern history”. Trump and his allies, for their part, were eager to tie Harris to Biden’s record even before the president left the race – and not in a good way. One campaign email to supporters declared “Kamala Haris is Joe Biden 2.0 – Kamala Harris owns Joe Biden’s terrible record because it is her record as well”, calling out high inflation and border policies, among other things. Biden this week promised the staffers of his former campaign that he was still “going to be on the road” as he handed off the reins of the organisation to Harris, adding, “I’m not going anywhere”. His advisers said he intends to hold campaign events and fundraisers benefiting Harris, albeit at a far slower pace than had he remained on the ballot himself. Harris advisers will ultimately have to decide how to deploy the president, whose popularity sagged as voters on both sides of the aisle questioned his fitness for office. The president’s allies insist that no matter what, Biden’s place in the history books is intact.","summary":"","url":"https://borneobulletin.com.bn/passing-the-baton/","image":"https://borneobulletin.com.bn/wp-content/uploads/2024/07/page-24-d_25072024.jpg","video":null,"publish_date":"2024-07-24 23:02:53","author":null,"language":"en","source_country":"bn","sentiment":-0.13}]}