{"offset":0,"number":50,"available":21024,"news":[{"id":283658036,"title":"Target is abandoning its diversity targets due to a new administration not supporting DEI efforts","text":"NEW YORK — Discount store chain Target said Friday that it would join rival Walmart and a number of other prominent American brands in scaling back diversity, equity and inclusion initiatives that have come under attack from conservative activists and, as of this week, the White House.\n\nNOTE: The video is from a previous report. \n\nThe Minneapolis-based retailer said the changes to its “Belonging at the Bullseye” strategy would include ending a program it established to help Black employees build meaningful careers, improve the experience of Black shoppers and to promote Black-owned businesses following the police killing of George Floyd in 2020.\n\nTarget, which operates nearly 2,000 stores nationwide and employs more than 400,000 people, said it already had planned to end the racial program this year. The company said Friday that it also would conclude the diversity, equity and inclusion, or DEI, goals it previously set in three-year cycles.\n\nThe goals included hiring and promoting more women and members of racial minority groups, and recruiting more diverse suppliers, including businesses owned by people of color, women, LGBTQ+ people, veterans and people with disabilities.\n\nTarget has long been a fierce corporate advocate for the rights of Black and LGBTQ+ people. In a memo to employees, Kiera Fernandez, Target’s chief community impact and equity officer, described the DEI decisions as a “next chapter” in the company’s decades-long process to create “inclusive work and guest environments that welcome all.”\n\n“Many years of data, insights, listening and learning have been shaping this next chapter in our strategy,” Fernandez wrote in the memo, which Target shared Friday. “And as a retailer that serves millions of consumers every day, we understand the importance of staying in step with the evolving external landscape, now and in the future.”\n\nThere’s no doubt the U.S. civil rights landscape has undergone a massive transformation in the five years since much of corporate America adopted DEI goals in response to the Black Lives Matter protests that followed Floyd’s death in Minneapolis.\n\nA 2023 U.S. Supreme Court decision that outlawed affirmative action in college admissions emboldened conservative groups to bring or threaten lawsuits targeting corporate initiatives such as employee resource groups and hiring practices that prioritize historically marginalized groups.\n\nWalmart, McDonald’s, Ford, Harley-Davison and John Deere are among the well-known consumer brands that reduced or phased out their DEI commitments in recent months.\n\nPresident Donald Trump this week signaled his administration’s agreement with conservatives who argue that policies designed to increase minority representation by considering factors such as race, gender and sexual orientation are unconstitutional.\n\nOn his first day in office, Trump signed an executive order aimed at ending DEI programs across the federal government. The order calls for revoking all DEI mandates, policies, preferences and activities, along with the review and revision of existing employment practices, union contracts, and training policies or programs.\n\nStill, some prominent companies have resisted public pressure to retreat from their diversity plans. On Thursday, Costco shareholders rejected a proposal urging the wholesale club operator to evaluate any risks posed by its diversity, equity and inclusion practices.\n\nAccording to preliminary results shared by Costco executives, more than 98% of shares voted against the proposal submitted by a conservative think tank based in Washington. Costco’s board of directors had recommended a no vote.\n\nApple’s board and the CEO of JPMorgan bank also have expressed a commitment to preserving their companies’ DEI activities.\n\nUnlike some of the companies retooling or retiring their diversity initiatives, Target’s work to build a more inclusive workforce predated 2020, and the company also was long seen as a trailblazer with respect to LGBTQ+ inclusion.\n\nBut the employee memo shared Friday said Target no longer would participate in surveys designed to gauge the effectiveness of its actions, including an annual index compiled by the Human Rights Campaign, a national LGBTQ+ rights organization. Target said it would further evaluate corporate partnerships to ensure they’re connected directly to business objectives, but declined to share details.\n\nGetting corporations to withdraw from the Human Rights Campaign’s Corporate Equality Index and to stop sponsoring Pride activities have been goals of DEI opponents.\n\nSteering clear of a backlash from conservative customers and organizations is something that Target has tried to navigate for a while. As transgender rights became a more prominent issue in 2016, the company declared that “inclusivity is a core belief at Target” and said it supported transgender employees and customers using whichever restroom or fitting room “corresponds with their gender identity.”\n\nBut after some customers threatened to boycott Target stores, the company said that more stores would make available a single-toilet bathroom with a door that could be locked.\n\nIn 2023, Target removed some of its Pride Month merchandise after online complaints and in-store confrontations that the retailer said threatened employees’ well-being. The company decided last year not to stock Pride Month products at every U.S. store.","summary":"Internewscast Journal\n\nInternewscast\n\n\nNEW YORK &#8212; Discount store chain Target said Friday that it would&#8230;\n\n\nThis Post: Target is abandoning its diversity targets due to a new administration not supporting DEI efforts first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/target-is-abandoning-its-diversity-targets-due-to-a-new-administration-not-supporting-dei-efforts/","image":"https://cdn.abcotvs.com/dip/images/15834426_target-file-img.jpg","video":null,"publish_date":"2025-01-25 00:53:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.239},{"id":283658034,"title":"How Trump’s Termination of the Highest-Ranking Woman in the Military Highlights DEI Challenges","text":"President Donald Trump fired Coast Guard commandant, Admiral Linda L. Fagan, almost immediately after taking office, but she did not hear about it until she was at the Commander in Chief Ball that evening.\n\nFagan found out she was fired as she was waiting to have a photo taken with Trump at the ball, according to a military official speaking to the New York Times. Fagan did not respond to a request for comment. \n\nThe Department of Homeland Security sent the bulletin featuring news of her job termination to the Coast Guard leadership the morning after Inauguration Day\n\n‘She served a long and illustrious career, and I thank her for her service to our nation,’ the message read from acting DHS Secretary Benjamine C. Huffman said shortly.\n\nThe department revealed in a statement that Admiral Fagan was removed because of ‘leadership deficiencies, operational failures and inability to advance the strategic objectives of the U.S. Coast Guard’ including a failure to secure the border and stop drugs from entering the United States.\n\nThe statement also accused Fagan of failing to recruit and retain personnel and had an ‘excessive focus’ on DEI programs.\n\nAdmiral Kevin Lunday, Coast Guard’s No. 2 in command, was named acting Coast Guard commandant in her stead.\n\nBiden nominated Fagan as Commandant of the U.S. Coast Guard in April 2022, as her supporters hailed her as the first female admiral in a position of leadership of one of the armed forces branches. \n\nTrump moved quickly on his pledge to end diversity, equity and inclusion policies in the federal government as he is set to lay off all DEI hires within 24 hours. \n\nThe new Trump administration sent a letter to all heads and acting heads of government agencies on Tuesday, informing them all federal employees in DEI roles must be placed on paid leave by 5 pm Wednesday. \n\nAll DEI offices in federal agencies are also being shuttered in the move, which comes after Trump signed an anti-DEI executive order in front of a cheering crowd at his inauguration on Monday. \n\nIn a letter first obtained by CBS News, the agencies were ordered to ‘take prompt actions’ against all departments ‘focusing exclusively on DEI initiatives and programs.’ \n\nThe letter also demands all public DEI focused webpages be taken offline, and orders employees within the departments to report ‘any efforts to disguise these programs by using coded or imprecise language.’ \n\nAny employees that are aware of ‘coded or imprecise language’ intended to keep DEI programs alive but do not report them within 10 days are warned of ‘adverse consequences.’ \n\nTrump’s executive order, titled ‘Ending Radical and Wasteful Government DEI Programs and Preferencing and Initial Rescissions of Harmful Executive Orders and Actions’, directly reverses a DEI executive order enacted by President Biden on his first day in office four years ago. \n\nTuesday’s order concludes: ‘These programs divided Americans by race, wasted taxpayer dollars, and resulted in shameful discrimination.’ \n\nAfter all DEI hires are placed on leave by 5pm Wednesday, agencies are ordered to develop plans to lay off each employee that was hired under DEI policies, with a deadline of next Friday given to develop a list for a ‘reduction in force action.’ \n\nAgencies must then report to the Office of Personnel Management (OPM) on ‘all steps taken’ to remove DEI programs by January 23, including a complete list of all employees that had been in DEI offices as of November 5, 2024. \n\nA written plan for firing all DEI employees must then be submitted to the OPM by January 31, 2025, including a list of all ‘contract descriptions or personnel position descriptions that were changed since November 5, 2024’ to conceal their DEI intentions. \n\nThe executive order slammed the ‘infiltration’ of DEI programs into the federal government, and cited the executive order signed by Biden on the first day of his presidency that aimed to tackle racial inequalities in government. \n\nAnother similar executive order signed by Trump on Tuesday also rolled back affirmative action in federal contracting, reversing a longstanding order first signed by President Lyndon Johnson in 1965. \n\n‘Today, roughly 60 years after the passage of the Civil Rights Act of 1964, critical and influential institutions of American society, including the Federal Government, major corporations, financial institutions, the medical industry, large commercial airlines, law enforcement agencies, and institutions of higher education have adopted and actively use dangerous, demeaning, and immoral race and sex-based preferences under the guise of so-called ‘diversity, equity, and inclusion,’ the memo read. \n\nTrump’s order argued that DEI programs ‘not only violate the text and spirit of our longstanding Federal civil-rights laws, they also undermine our national unity.’ \n\n‘They deny, discredit, and undermine the traditional American values of hard work, excellence, and individual achievement in favor of an unlawful, corrosive, and pernicious identity-based spoils system,’ the memo continued.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump fired Coast Guard commandant, Admiral Linda L. Fagan, almost&#8230;\n\n\nThis Post: How Trump&#8217;s Termination of the Highest-Ranking Woman in the Military Highlights DEI Challenges first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/how-trumps-termination-of-the-highest-ranking-woman-in-the-military-highlights-dei-challenges/","image":"https://i.dailymail.co.uk/1s/2025/01/24/21/94492127-0-image-a-1_1737754971897.jpg","video":null,"publish_date":"2025-01-25 00:45:45","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.191},{"id":283656114,"title":"Paris Bestows Knighthood On Dior&#8217;s British Designer Kim Jones","text":"Friday afternoon in Paris marked a significant milestone for British designer Kim Jones. The artistic director of Dior not only presented his latest menswear collection but also received the prestigious Chevalier de la Légion d’honneur, a rare honor for someone from outside France.\nIn a fashion moment par excellence, the award was presented to Jones by the iconic Anna Wintour, officially making him a knight. Jones has been at Dior for six years, during which he has delved into the brand’s rich archives and explored his personal interests. His latest show continued this trend, drawing inspiration from Christian Dior’s mid-50s Ligne H collection and the 18th-century Italian author Casanova, known for his multiple relationships with women.\nJones played with the concept of Casanova as a “ladies’ man” by incorporating elements of gender fluidity into his designs. The show notes explained that this translated into “a mix of the masculine and the feminine … together with the excesses of the 18th century, found in the idea of the extravagant dresser.” Traditionally feminine tropes such as sparkles, pink, bows, boat necks, and long skirts were worn by men, resulting in an elegant collection with a touch of subversion.\nDior was also in the spotlight beyond Paris this week. Ivanka Trump wore an outfit from the women’s collection, designed by Maria Grazia Chiuri, for the inauguration of her father, Donald Trump. The new first lady, Melania Trump, also wore Dior for a reception over the weekend. LVMH, Dior’s parent company, showed its support for Trump, with CEO Bernard Arnault and his children, Delphine (CEO of Dior) and Alexandre (who works with Tiffany), attending the inauguration.\nIn October, Jones announced that he would be leaving his other role in fashion, designing womenswear and couture at Fendi. His post-show bow at Dior, which included a hug for Delphine Arnault in the front row, has fueled speculation that change might be on the horizon at Dior as well. With the fashion world abuzz with rumors about top positions at luxury houses including Gucci, Burberry, and Margiela, Jones’s name has been mentioned frequently, particularly for Burberry, which has not thrived under its current artistic director, Daniel Lee.\n“Kim Jones would be a perfect fit at Burberry,” an influential fashion insider wrote, “but I doubt if LVMH will let him go easily or if Burberry can even afford him right now.”\nChevalier de la Légion d’honneur, France’s highest honor, has previously been awarded to prominent fashion figures such as Valentino Garavani and Diane von Fürstenberg, as well as Delphine Arnault. Before the ceremony, Jones described receiving the honor as a “life milestone,” though he noted that notoriety was not his goal.\nWith speculation swirling, Jones is likely eager to put the rumors to rest and focus on his work, whatever that may be. As he continues to lead Dior’s menswear collections, his influence on the fashion world remains profound. His ability to merge the past with the present, while challenging traditional gender norms, sets him apart as a visionary designer. The recognition of his contributions with the Chevalier de la Légion d’honneur is a testament to his impact on the industry.\nALSO READ: Anxiety Hits Young Employees Hard: 9 In 10 Under 25 Face Mental Health Challenges","summary":"British designer Kim Jones, artistic director of Dior, received the prestigious Chevalier de la Légion d’honneur in Paris while unveiling his latest menswear collection.","url":"https://www.newsx.com/lifestyle-and-fashion/paris-bestows-knighthood-on-diors-british-designer-kim-jones/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Paris-Bestows-Knighthood-On-Diors-British-Designer-Kim-Jones.webp","video":null,"publish_date":"2025-01-25 00:43:18","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","source_country":"in","sentiment":0.238},{"id":283656108,"title":"Indiana Resident Arrested For TikTok Threats Against President Trump","text":"Douglas Thrams, a 23-year-old man from Goshen, Indiana, has been arrested for allegedly using TikTok to incite attacks on the government and call for the death of US President Donald Trump.\nThrams is currently in custody and awaiting a court appearance on Monday in South Bend federal court. He faces charges of using interstate commerce to make threats. According to FBI agent Taylor Pletz, Thrams made a series of threatening statements in his TikTok videos, including a call for Trump's assassination. In one video, Thrams reportedly said that Trump needed to be killed “and this time don't ... miss,” referencing an assassination attempt on Trump last July in Pennsylvania. Pletz noted that Thrams was visible, audible, and identifiable in all the videos.\nTikTok was initially set to be banned in the US starting Sunday, but President Trump paused the ban for 75 days to allow his new administration time to assess national security risks and explore a potential American buyer for the app. TikTok’s Chinese parent company now has just over two months to find a buyer for its US operations or face a nationwide ban. There is already competition for ownership.\nMeanwhile, TikTok began restoring its services on Sunday, following President-elect Trump's pledge to reinstate the app when he takes office on Monday. “Frankly, we have no choice. We have to save it,” Trump said at a rally ahead of his inauguration, adding that the US would pursue a joint venture to preserve the app, which is used by 170 million Americans. Hours before the rally, TikTok informed users that the app was back in the US as a result of President Trump's efforts. Earlier, users reported that while the TikTok app had begun returning with basic services, it was unavailable for download in US app stores late on Sunday.\nThe arrest of Douglas Thrams highlights the serious legal consequences of making threats against public officials, especially through social media platforms. It also underscores the ongoing concerns about the use of social media for inciting violence and the challenges of regulating such content. The case will likely draw attention to the broader issues of online threats and the responsibilities of social media companies in monitoring and addressing harmful content.\nAs Thrams awaits his court appearance, the legal proceedings will determine the outcome of the charges against him. The case serves as a reminder of the importance of responsible use of social media and the potential repercussions of making threats online. It also raises questions about the balance between free speech and public safety in the digital age.\nALSO READ: Donald Trump Denounces Federal \"Unlimited Abortion\" Rights During March For Life","summary":"Douglas Thrams, a 23-year-old man from Indiana, has been arrested for allegedly using TikTok to incite attacks on the government and call for the death of President Trump.","url":"https://www.newsx.com/world/indiana-resident-arrested-for-tiktok-threats-against-president-trump/","image":"https://www.newsx.com/wp-content/uploads/2025/01/Trump-Inauguration.jpg","video":null,"publish_date":"2025-01-25 00:43:18","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":0.06},{"id":283657532,"title":"Trump re-enacts policy banning aid to groups abroad that discuss or provide abortions","text":"President Donald Trump has issued a memorandum with far-reaching consequences for reproductive rights in other countries.\n\nOn Friday, he reinstated the Mexico City Policy, which cuts off U.S. aid to any group operating in another country that provides abortion services, counsels people about abortion or advocates for abortion rights.\n\nThe name is drawn from a U.N. conference in Mexico City in 1984, when President Ronald Reagan instituted the rule.\n\nBecause the policy prohibits even discussion of abortion with patients, groups that favor abortion rights call it \"the global gag rule.\" It \"silences what organizations can even say about abortion in their own countries,\" says Elizabeth Sully, principal research scientist at the Guttmacher Institute, a research organization that supports abortion rights.\n\nSupporters of the rule say that it encourages healthcare providers in lower resource countries to focus on alternatives to abortion — for example, education on family planning and maternal care during pregnancy.\n\n\"It prioritizes what developing countries actually need, which is real development assistance not the promotion of coercive or controversial agendas,\" says Elyssa Koren, the legal communications director for ADF International, an advocacy group that opposes abortion rights.\n\nThe policy's history\n\nIn the 41 years since the policy was first instituted, every newly elected Democratic president has negated it and every newly elected Republican president has reinstated it. In his first term, Trump brought the policy back on Day 3 of his administration.\n\nThe original policy targeted U.S. foreign aid grants to groups that offer family planning services. In 2017, Trump expanded it, adding a directive to extend the policy \"to global health assistance furnished by all departments or agencies.\" That meant that a wider range of groups would lose their share of the $12 billion of U.S. health assistance if they did not comply – including groups whose main goal was not to provide family planning support, like President's Emergency Plan for AIDS Relief (PEPFAR) and groups that focus on diseases like malaria.\n\nBefore Trump's change, the policy had affected around $600 million of U.S. aid to family planning and reproductive health groups, says Nabeeha Kazi Hutchins president of PAI, Population Action International, a group that supports abortion rights.\n\nGroups that want to continue offering abortion counseling or services have in the past lost their U.S. funding. In 2017, NPR interviewed representatives of MSI, Marie Stopes International, a global charity that offers contraception and abortion services in 36 countries. Their Madagascar director told NPR that the loss of U.S. aid meant the group could no longer offer free contraceptives and had to shut down 21 of its 22 mobile contraceptive clinics in the island nation, which is part of sub-Saharan Africa.\n\nResearchers have looked at the impact of the policy as well.\n\nA 2019 analysis, published in the medical journal The Lancet, examined access to contraception and abortion rates in sub-Saharan Africa across three presidencies: Bill Clinton, George W. Bush and Barack Obama. The policy was in effect during Bush's years in office but was revoked by Clinton and Obama.\n\nThe researchers looked at abortion rates in 26 sub-Saharan African countries during the eight years of the Bush administration, when the funding ban was in place, and the Clinton and Obama administrations, which each lifted the funding ban.\n\nThe analysis suggests that the Mexico City policy has actually increased the rate of abortions by about 40% in the countries studied.\n\nAs NPR wrote at the time: \"Of course, abortion rates could have changed during those two decades for reasons wholly unrelated to U.S. funding policy. But in an effort to factor out that possibility, the researchers divided the 26 countries into two groups: In the first were countries that received the highest amount per person of U.S. family planning aid. In the second group were the countries that received the lowest amount.\n\nThe idea is that countries receiving a large amount of aid per person would likely be more vulnerable to changes in the policies governing U.S. aid. So by comparing what happened to the abortion rates in those more aid-dependent countries with the abortion rates of countries that were otherwise similar but less dependent on U.S. money for family planning, the researchers believed they could better isolate the impact of the funding ban on abortion rates.\n\nIn addition to finding that the ban produced a 40% increase in a country's typical abortion rate during the period when the Mexico City policy was in place, the authors found a 14% decrease in the use of contraception and a 12% increase in pregnancies\".\n\nCo-author Nina Brooks of Boston University told NPR that it seems likely that aid groups unable or unwilling to comply with the abortion restrictions on U.S. funding ended up losing U.S. aid dollars and therefore cut back on their activities, which included distributing contraception.\n\nSpeaking to NPR for coverage of the 2019 study, Connor Semelsberger, then with the Family Research Council which has long supported the Mexico City policy, says he finds the study unconvincing because it did not delve into what he argues are key data points — such as which aid groups were operating in the affected countries and how much the amount of U.S. aid changed during the years studied. \"I was really wanting more information,\" he says.","summary":"The Mexico City Policy cuts off U.S. aid to health groups in other countries that offer abortion services or counseling. As in 2021, Trump has reinstated this policy, which was deactivated by Biden.","url":"https://www.npr.org/sections/goats-and-soda/2025/01/24/g-s1-42914/trump-abortion-re-enacts-policy-cutting-aid-to-groups-abroad-that-discuss-or-provide-abortions","image":"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1668+0+0/resize/2500x1668!/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2F49%2Fdd1143764a1f95bb178096d34705%2Fmexico-city-policy-madagascar.jpg","video":null,"publish_date":"2025-01-25 00:43:16","author":"Rachel Carlson","authors":["Rachel Carlson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.092},{"id":283657856,"title":"Our hopes, fears under Trump – US-based Nigerians","text":"Following the inauguration of Donald Trump as the 47th President of the United States of America on Monday, several Nigerians in America share their hopes and fears with BIODUN BUSARI\n\nAnonymous student – Indiana University\n\nThe American people made their voices heard in the elections, and Monday was the realisation of millions of citizens’ wishes.\n\nAs a Nigerian scientist in the US, I am filled with uncertainties. There will be numerous changes, both in policies and other critical areas, as we saw with the executive orders signed by Trump.\n\nNo one can predict what’s ahead, but we can only hope it all leads to a positive outcome. It’s a 50-50 chance.\n\nKelechukwu Ogu\n\nTrump’s presidency is going to have an impact. His actions will affect how wealthier Western nations can shield vulnerable African countries, like Nigeria, from climate change risks.\n\nBased on his speech and what we expect, petrol prices should fall, and hopefully, Nigeria won’t need to import refined petrol from Europe. This would cut some costs and help maintain low price levels. \n\nObi-West Utchaychukwu – Texas\n\nTrump is a man of his word, always keeping his promises to the American people. He’s empowering those who matter most and preserving the American Dream for those who have the country’s best interests at heart.\n\nHis victory is a testament to the strength of democracy and the will of the American people. This kind of transparency and accountability is exactly what Nigeria needs.\n\nNo more backroom deals or hidden agendas. Trump is truly a leader of the people.\n\nTemitayo Tijani – Maryland\n\nTrump’s victory and inauguration are a good thing for America. As a lawyer, I can tell you there’s no reason to worry. I understand the concerns about immigration, but we’ve been through this before. I assure you, it’s a win-win for everyone.\n\nJacob Adegoke – Texas\n\nTrump is focused on restoring law and order in America. I care less about his speech or his character; what matters to me is what his policies can achieve. There are many missing girls in the U.S., trafficked across the border, but they don’t talk about that. Trump is fighting against this, while his opponents target him.”","summary":"Following the inauguration of Donald Trump as the 47th President of the United States of America on Monday, several Nigerians in America share their hopes and fears with BIODUN BUSARI Anonymous student &#8211; Indiana University The American people made their voices heard in the elections, and Monday was the realisation of millions of citizens’ wishes. \n\n\n \n Read More","url":"https://punchng.com/our-hopes-fears-under-trump-us-based-nigerians/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/13011858/df21c545-b4b8-4d85-ae96-507181573926.sized-1000x1000-1-1000x630.jpg","video":null,"publish_date":"2025-01-25 00:42:43","author":"Our Reporters","authors":["Our Reporters"],"language":"en","source_country":"ng","sentiment":0.297},{"id":283658794,"title":"Judge bans Stewart Rhodes and convicted Oath Keepers from Washington after Trump’s clemency","text":"The federal judge who tried members of the Oath Keepers far-right militia group on seditious conspiracy charges wants to keep them out of Washington, D.C. after Donald Trump commuted their prison sentences.\n\nA single-page order from District Judge Amit Mehta on Friday forbids Oath Keepers founder Stewart Rhodes and seven other members of the group from entering the nation’s capital without a court’s permission.\n\nThe order was issued one day after Rhodes strolled through congressional office buildings, speaking to reporters and meeting with at least one member of Congress following his release from federal custody.\n\nIn 2023, Rhodes was sentenced to 18 years in prison after a jury agreed that he conspired with members of his group to break into halls of Congress in what prosecutors described as an act of terrorism.\n\nTrump commuted his sentence — along with the sentences of 13 other Capitol rioters, including Oath Keepers members who were similarly convicted on charges of seditious conspiracy — to time served. Rhodes was released from prison earlier this week.\n\nEd Martin — acting U.S. Attorney for Washington, D.C — filed a motion to dismiss the judge’s terms, arguing that Trump’s commutations mean that Rhodes and his allies are no longer subject to the court’s supervision.\n\nBefore he was tapped to fill the role as the top prosecutor in Washington, succeeding Matthew Graves, who led the largest federal investigation in Department of Justice history with the prosecution of more than 1,600 people in connection with January 6, Martin had served as a board member with a legal group trying to free those same defendants.\n\nMartin — a prominent “Stop the Steal” activist” — is now tasked with overseeing the office that handled those prosecutions. He is working to dismiss the remaining cases.\n\n“The individuals referenced in our motion have had their sentences commuted — period, end of sentence,” Martin said in a statement Friday.\n\nLast month, with the looming prospect of Trump clemencies for the defendants in his courtroom, Mehta said a potential pardon for Rhodes “is frightening and ought to be frightening to anyone who cares about democracy in this country.”\n\n“You, sir, present an ongoing threat and a peril to this country and its democracy and the very fabric of this country,” Mehta told Rhodes during his sentencing hearing in 2023. “You are smart, you are compelling, and you are charismatic. Frankly, that is what makes you dangerous.”\n\nIn court filings this week responding to requests to toss charges for the remaining defendants, judges are barely hiding their contempt for Trump’s sweeping pardons for virtually every member of the mob — and warning against attempts to rewrite the history of the Capitol attack and downplay the staggering display of violence.\n\nDistrict Judge Tanya Chutkan, who presided over Trump’s federal election interference case brought by special counsel Jack Smith, wrote that Trump’s pardons “cannot whitewash the blood, feces, and terror that the mob left in its wake.”","summary":"The judge who presided over a months-long seditious conspiracy trial ordered the defendants to keep out of D.C.","url":"https://www.independent.co.uk/news/world/americas/us-politics/amit-mehta-stewart-rhodes-oath-keepers-trump-b2686103.html","image":"https://static.independent.co.uk/2025/01/24/23/2195375543.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/yvas5U3p-4VHSaSK0.mp4","publish_date":"2025-01-25 00:41:43","author":"Alex Woodward","authors":["Alex Woodward"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.116},{"id":283657174,"title":"Israel tells UN it's shutting down all UNRWA operations in Jerusalem: 'acute security risks'","text":"Israel’s Ambassador to the United Nations, Danny Danon, has formally notified U.N. Secretary-General Antonio Guterres of Israel’s demand for the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) to cease its operations in Jerusalem and evacuate its premises by January 30, 2025. The directive follows recent legislation passed by the Israeli Knesset, terminating Israel’s agreements with UNRWA and citing national security concerns. In a letter addressed to Guterres, Danon outlined the rationale behind the decision, emphasizing \"the acute national security risks posed by the widespread infiltration of UNRWA’s ranks by Hamas and other terrorist organizations.\" He also accused the agency of failing to address Israel’s long-standing concerns and of compromising its \"fundamental obligation to impartiality and neutrality beyond repair.\" STEFANIK PLANS TO PUSH TRUMP'S 'AMERICA FIRST' AGENDA AT UN, MAKE SURE IT 'SERVES THE INTERESTS' OF US PEOPLE President Donald Trumphas also been a vocal critic of UNRWA, withholding funding for it during his first term as president. The United States had previously been UNRWA’s largest donor, contributing more than $350 million annually. In March, Congress agreed to cut funding to the controversial agency for a year. A spokesperson for the U.N. Secretary-General told Fox News Digital, \"The Secretary-General has been clear in the need to maintain support for UNRWA, which is the backbone of U.N. operations in the occupied Palestinian Territory.\" Danon's letter stated that \"months of good-faith engagement\" with the United Nations had failed to produce results, accusing UNRWA of abusing its immunity to bypass local laws and regulations. He underscored Israel’s legal position, asserting that \"no state is required to assist and cooperate with an entity that undermines its national security.\" Anne Bayefsky, Director of the Touro Institute on Human Rights and the Holocaust and President of Human Rights Voices, told Fox News Digital said Israel's move is a long time coming. \"UNRWA is a cash cow for the United Nations, and also for Palestinian so-called refugees who—in marked contrast to refugees everywhere else in the world—supposedly inherit their refugee status as long as the Jews are still there. UNRWA schools have taught generations of Palestinians to hate the Jews next door and to spend their lives seeking to terminate Israel instead of cohabiting in peace.\" NEW REPORTS CLAIM UNRWA WORKS WITH TERRORISTS, TEACHES HATE AS AGENCY HITS BACK AT CRITICS The legislation passed by the Israeli Knesset includes two complementary bills that sever all ties between Israel and UNRWA, including the termination of diplomatic visas and services provided to the agency. The bills received overwhelming support from both coalition and opposition members of the Knesset. Critics of the legislation, including the Biden administration, have warned that it could create a humanitarian crisis for the millions of Palestinians who rely on UNRWA for education, healthcare, and basic services. During a U.N. press briefing on Friday, a spokesperson responded to questions regarding the situation, stating, \"We are in touch, but we have continued to emphasize the indispensability of UNRWA.\" When asked about contingency plans should the Israeli legislation be implemented, the spokesperson said, \"We will see what the future brings. Obviously, we are doing our utmost and UNRWA will do its utmost to continue to provide aid to the people under our mandate, as much as we can.\" Before the Israeli letter was made public, an UNRWA spokeswoman had previously told Fox News Digital they didn't have a plan in place for ongoing operations once the ban starts. The spokesperson claimed that, \"UNRWA has the most robust systems in place in comparison to other United Nations agencies when it comes to the adherence to the principle of neutrality with regards to our programs that we do and our staff.\" CLICK HERE TO GET THE FOX NEWS APP In August, UNRWA Commissioner-General Philippe Lazzarini confirmed the probable involvement of UNRWA employees in the Oct.7 massacre. He later confirmed that at least nine UNRWA staffers were fired after an internal probe. Danon called on the United Nations to \"put an end to the unprecedented infiltration and abuse of a U.N. organ by terrorist organizations\" to restore the U.N.’s credibility.","summary":"Israel demands UNRWA halt operations in Jerusalem by January 30, citing Hamas ties and security risks. The move follows Knesset legislation severing ties with the agency.","url":"https://www.foxnews.com/world/israel-tells-un-its-shutting-down-all-unrwa-operations-jerusalem-acute-security-risks","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/thumbnail_un-israel-flag.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:31:22","author":"Efrat Lachter","authors":["Efrat Lachter"],"language":"en","category":"politics","source_country":"US","sentiment":-0.069},{"id":283659046,"title":"GOP congresswoman examines impact on Trump visit to North Carolina: People ‘touched his heart’","text":"to top close Video This video is playing in picture-in-picture.\n\nOn Air January 24, 2025 05:36 \n\n GOP congresswoman examines impact on Trump visit to North Carolina: People ‘touched his heart’ \n Rep. Virginia Foxx, R-N.C., joins ‘The Bottom Line’ to dissect President Donald Trump’s visit to North Carolina to see the aftermath of Hurricane Helene.\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags WHAT TO WATCHSHOWSTHE BOTTOM LINE | LATEST EPISODESPOLITICS","summary":"Rep. Virginia Foxx, R-N.C., joins ‘The Bottom Line’ to dissect President Donald Trump’s visit to North Carolina to see the aftermath of Hurricane Helene.","url":"https://www.foxbusiness.com/video/6367709039112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/cc70c4bc-2f32-4a3c-bce2-c83306f9f520/cbf6810d-2659-49e5-8899-404851b8237c/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:29:22","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.254},{"id":283657184,"title":"USC football fills GM spot by hiring Chad Bowden from Notre Dame","text":"Skip to content\n\nAll Sections\n\n \n Subscribe Now \n \n\n Friday, January 24th 2025 \n\ne-Edition \n \n\n \n Home Page\n\nCrime and Public Safety\n\nInvestigative Reporting\n\nBest Reviews\n\nEnvironment\n\nOrange County\n\nGarden Grove\n\nOrange + Villa Park\n\nSeal Beach+ Los Alamitos\n\nWestminster\n\nYorba Linda\n\nFountain Valley\n\nHuntington Beach\n\nLaguna Beach\n\nLaguna Niguel + Aliso Viejo\n\nLaguna Hills\n\nLadera Ranch\n\nLake Forest\n\nLaguna Woods\n\nMission Viejo\n\nNewport Beach\n\nRancho Santa Margarita\n\nSan Clemente\n\nSan Juan Capistrano\n\nHigh School Sports\n\nCollege Sports\n\nUCLA Sports\n\nHorse Racing\n\nThings To Do\n\nThings To Do\n\nRestaurants Food and Drink\n\nMusic + Concerts\n\nAmusement Parks + Disneyland\n\nTheater + Arts\n\nTV and Streaming\n\nHome + Garden\n\nBest of Orange County\n\nOrange County Register Store\n\nNews Obituaries\n\nPlace an Obituary\n\nOpinion Columns\n\nLetters to the Editor\n\nEditorial Board\n\nEndorsements\n\nSCNG Premium\n\nSponsored Content\n\nClose Menu \n\nGet the latest news delivered daily!\n\n Sign Up\n\nCollege Sports | \n\n USC football fills GM spot by hiring Chad… \n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\n Account Settings\n Contact Us\n Log Out\n\n Spoof a user\n\nGet the latest news delivered daily!\n\n Sign Up\n\n Friday, January 24th 2025 \n\ne-Edition \n \n\nCollege Sports \n\nHigh School\n\n Trending: \n\nCollege Sports | \n\n Trump news \n\nCollege Sports | \n\n LA wildfire victims \n\nCollege Sports | \n\n Fixing Haunted Mansion's 'problem' \n\nCollege Sports | \n\n Pop-up skate rink 🛼 \n\nCollege Sports | \n\n James Beard Award semifinalists \n\nCollege SportsNewsNews Based on facts, either observed and verified directly by the reporter, or reported and verified from knowledgeable sources.\n\nSUBSCRIBER ONLY\n\nCollege Sports | \n\n USC football fills GM spot by hiring Chad Bowden from Notre Dame \n\nThe Trojans find their general manager to lead their program of the future as the revenue-sharing era approaches\n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\n USC has hired Notre Dame’s Chad Bowden to be its new general manager. He was Notre Dame’s director of recruiting prior to being promoted to their GM. (Photo courtesy of Notre Dame Athletics)\n\nBy Luca Evans | levans@scng.com\nUPDATED: January 24, 2025 at 4:39 PM PST\n\nThe Trojans find their general manager to lead their program of the future as the revenue-sharing era approaches, poaching a rising star from a longtime rival\n\n Subscribe to continue reading this article.\n\n Already subscribed? To login in, click here.\n\nOriginally Published: January 24, 2025 at 4:27 PM PST\n\nShare this:\n\nClick to share on Facebook (Opens in new window)\nClick to share on Twitter (Opens in new window)\nClick to share on Reddit (Opens in new window)\nClick to print (Opens in new window)\n\nNewsroom Guidelines\n\nReport an Error\n\nMost Popular\nMost Popular\n\nWestminster Councilmember Amy Phan West charged with trying to bribe a city parking officer\nWestminster Councilmember Amy Phan West charged with trying to bribe a city parking officer\n\nCalifornia’s home insurance prices set to soar\nCalifornia’s home insurance prices set to soar\n\n3 OC girls soccer standouts lose eligibility because of in-season trip organized by pro team\n3 OC girls soccer standouts lose eligibility because of in-season trip organized by pro team\n\nJames Beard Award 2025 semifinalists announced, including two OC names\nJames Beard Award 2025 semifinalists announced, including two OC names\n\nPresident Trump’s first week of presidency includes a visit to Southern California\nPresident Trump’s first week of presidency includes a visit to Southern California\n\nCrews extinguish fire in waste-management facility in Irvine\nCrews extinguish fire in waste-management facility in Irvine\n\nReal estate news: Longtime Bella Terra mall owner sells its stake to partner\nReal estate news: Longtime Bella Terra mall owner sells its stake to partner\n\nHow President Trump’s early executive actions will impact Southern California\nHow President Trump’s early executive actions will impact Southern California\n\nFullerton’s ‘Walk on Wilshire’ to permanently close at end of month\nFullerton’s ‘Walk on Wilshire’ to permanently close at end of month\n\nHuntington Beach declares itself a ‘non-sanctuary city’\nHuntington Beach declares itself a ‘non-sanctuary city’\n\nTrending Nationally\n\nEvacuation orders, warnings issued as Otay Mountain area fire reaches 1,000 acres\nJustin Trudeau says Canada will respond to US tariffs as Ontario’s premier says Donald Trump ‘declared war’\nApple gender-discrimination lawsuit that allegedly started with man’s tax form left on printer gets boost from judge\nCan President Trump rename the Gulf of Mexico as ‘the Gulf of America’ and Denali as ‘Mount McKinley?’\nYankees Hall of Famer Mariano Rivera, wife Clara accused of covering up child sex abuse\n\n More in College Sports \n\nSUBSCRIBER ONLY\n\nCollege Sports | \n\n UC Irvine falls to UC Riverside in OT for its first Big West loss \n\nCollege Sports | \n\n Cal State Fullerton can’t catch Cal State Bakersfield in tight loss \n\nCollege Sports | \n\n Long Beach State can’t overcome slow start in loss to CSUN \n\nCollege Sports | \n\n UC Irvine crushes Cal Poly for program-record 20th straight home win \n\nSign Up For Newsletters\n\nBreaking News\n\nMarketplace\n\nLocal Job Board\n\nAbout OC Register\n\nAbout Southern California News Group\n\nMediaNews Group\n\nWork With Us\n\nPrivacy Policy\n\nAccessibility\n\nNews Archive\n\nAdvertising Solutions\n\nGet in Touch with a Marketing Strategist\n\nRequest Media Kit\n\nCreative Services\n\nContent Marketing\n\nCorrections\n\nOC Register Store\n\nReader Rewards\n\nPhoto Reprints\n\nSponsored Access\n\nLive Traffic Map\n\nNewspapers in Education\n\nSponsor a Student\n\n Subscribe Now \n\nTerms of Use\n\nCookie Policy\n\nCookie Preferences\n\nCalifornia Notice at Collection\n\nNotice of Financial Incentive\n\nDo Not Sell/Share My Personal Information\n\nArbitration\n\nPowered by WordPress.com VIP\n\nCopyright © 2025 MediaNews Group","summary":"The Trojans find their general manager to lead their program of the future as the revenue-sharing era approaches, poaching a rising star from a longtime rival","url":"https://www.ocregister.com/2025/01/24/usc-football-fills-gm-spot-by-hiring-chad-bowden-from-notre-dame/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/imageedit_3_89681946-16x9-1.jpg?w=456&h=258","video":null,"publish_date":"2025-01-25 00:27:58","author":"Luca Evans","authors":["Luca Evans"],"language":"en","source_country":"US","sentiment":0.229},{"id":283657166,"title":"'A big relief': NC residents describe meeting with Trump after feeling 'ignored' post-hurricane","text":"North Carolina residents Curtis A. Wright and Amber Wright, who were heavily impacted by Hurricane Helene, met with President Donald Trump during his visit to their state on Friday. Curtis A. Wright argued in an appearance on \"The Will Cain Show,\" that he thinks that North Carolinians have \"been ignored\" in the wake of the hurricane and said that Trump's visit was a \"big relief.\" \"It was a lot of relief. You know, people keep saying, how are you guys doing in Asheville? And, you know, we feel like he's [sic] been forgotten. And I don't think we've been forgotten. I think we've been ignored. So for him [Trump] to come and see us today, that was a big relief. We'd previously had JD Vance come out to our house with Samaritan's Purse and some of the Grahams. And, you know, he told us that they were coming, and we were glad to see them.\" ‘FEMA IS NOT GOOD’: TRUMP ANNOUNCES AGENCY OVERHAUL DURING VISIT TO NORTH CAROLINA Trump visited western North Carolina on Friday to meet with residents still dealing with the aftermath of Hurricane Helene. Amber Wright was asked to describe how they have been living in the wake of the hurricane and said that it has been a \"true nightmare.\" \"We just live day by day, one day at a time, trying to clean up, trying to see what our next steps are, if we're going to be able to rebuild, if we're not going to be able to rebuild. Waiting on, you know, insurance or whatever it may be. So it's been a struggle. It really has,\" she told host Will Cain. North Carolina was struck by Hurricane Helene in late September and caused over 100 deaths in the state, as well as tens of millions in damage. The catastrophic flooding caused by the hurricane was described by FEMA Administrator Deanne Criswell as \"historic.\" FEMA has faced criticism for its relief efforts post-hurricane. During his visit Friday, Trump said, \"FEMA has really let us down. Let the country down. And I don't know if that's Biden's fault or whose fault it is, but we're going to take over.\" Curtis and Amber Wright said that they had lost \"everything they own\" in the storm, including all of their farm equipment, and described what they would need in order to rebuild. CLICK HERE TO GET THE FOX NEWS APP \"What we're needing right now is a fair evaluation from our insurance company in a timely manner to pay out,\" Curtis Wright said. \"Samaritan's Purse has been a blessing to us,They are willing to fill all the gaps that FEMA and our insurance company has not. We actually have the ability to build on higher ground on another piece of property that connects to our current farm. And that's what our hopes are, to get fair payout and just to tear down the home that we have because it's beyond 50% repairable and then start over.\" While in North Carolina, Trump told reporters that he plans to sign an executive order \"fundamentally reforming and overhauling FEMA, or maybe getting rid of FEMA,\" Trump told reporters, saying, \"I think, frankly, FEMA is not good.\" He also promised that his administration would step in to assist the clean-up efforts. \"We're going to fix it, and we're going to fix it as fast as you can,\" Trump said. Only half of the debris recovery from Hurricane Helene is complete, according to the U.S. Army Corp of Engineers, and thousands of families remain in hotels. Fox News' Diana Stacy contributed to this report.","summary":"North Carolina residents Curtis A. Wright and Amber Wright detail their meeting with President Donald Trump who visited western North Carolina on Friday.","url":"https://www.foxnews.com/media/a-big-relief-nc-residents-describe-meeting-trump-after-feeling-ignored-post-hurricane","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/1200/675/thumbnail-1.png?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:26:40","author":"Noah Adamitis","authors":["Noah Adamitis"],"language":"en","category":"politics","source_country":"US","sentiment":-0.427},{"id":283657172,"title":"March for Life attendees react to JD Vance speech: ‘It was amazing’","text":"Vice President JD Vance received a massive welcome from pro-lifer activists at the March for Life this Friday in his first public address since the inauguration. Vance touted President Donald Trump’s recent pardons of several pro-life activists prosecuted by the Biden Department of Justice. He also spoke strongly about the need for pro-family governmental policies, saying, \"I want to see more babies in the United States of America.\" Trump also delivered remarks to the March for Life crowd via a video message. Marchers told Fox News Digital that Vance’s presence showed that the new Trump administration stands in solidarity with the pro-life movement and gives them optimism for the future. \"It was amazing,\" said Amy Lewis, a pro-lifer who came with a group from Dry Fork Christian School in Virginia. \"It was amazing that he was here. We were able to see him and to see that our new administration supports life as much as we do. It just really kind of drives it home that we have an administration that's here to support us and to support our beliefs.\" PRO-LIFE ACTIVIST PROSECUTED BY BIDEN DOJ REACTS TO TRUMP PARDON: 'I WANT TO GIVE HIM A HUG' Sarah Morales Wade, an activist who came with a pro-life youth group from Houston called the Catholic Organization of Life, told Fox News Digital: \"It's so inspiring to see someone so high up in office fighting with us, with the kids and, and that we have people who are supporting us and who will fight for life with us.\" Elizabeth O’Brien, another member of the Houston group, told Fox News Digital that she thought Vance’s speech was \"amazing.\" \"When the vice president comes out, and he's telling us how precious life is, that’s an eye-opener,\" she said. \"It gives us reassurance that the Trump administration is with us.\" GOP IS UNIFIED BEHIND TRUMP'S 'WINNING' AGENDA, SENATE MAJORITY LEADER SAYS Isaac Desrosiers, a student at Franciscan University, a Catholic college in Steubenville, Ohio, Vance’s home state, told Fox News Digital that for him, the vice president’s speech showed that \"he's not just a politician telling tales, trying to get votes.\" \"He’s truly Catholic, he holds Catholic values, and he brings that compassion and that sincere Catholic belief and faith to the table,\" he said. \"He's genuinely concerned about what is going on in the world, what's going on in our country. And he generally wants freedom and equality for babies so that they may have the chance to come into this world and to live an amazing life.\" CLICK HERE TO GET THE FOX NEWS APP Desrosiers said that though he’s \"not sure what to expect\" from the Trump administration regarding the abortion issue, he is \"optimistic.\" \"I'm hoping it means that this country's going to be more pro-life and he's going to pass more pro-life laws,\" he said.","summary":"Vice President JD Vance was one of the key speakers addressing the 2025 March for Life in Washington, capping off a whirlwind first week in office.","url":"https://www.foxnews.com/politics/march-life-attendees-react-jd-vance-speech-it-amazing","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/m4l-1.png?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:25:51","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"US","sentiment":0.309},{"id":283655758,"title":"Vance leads list of speakers at celebratory March for Life in Washington","text":"Jan. 24 (UPI) -- Vice President JD Vance led a list Republican luminaries who voiced strong agreement with the anti-abortion positions of participants at the annual March for Life amid cold and snowy weather Friday in Washington, D.C.\n\nVance, making his first public appearance since his inauguration along with President Donald Trump on Monday, celebrated Trump's victory and told a crowd gathered at the National Mall that \"we march to live out the sacred truth that every single child is a miracle and a gift from God.\"\n\nNoting the \"bitter cold\" temperatures of 32 degrees Fahrenheit, the vice president said, \"here you are outside in an especially frigid January, and I don't think I've ever seen such a joyful crowd out here, particularly during this time of year.\"\n\nVance addressed what called the need for more births in the United States.\n\n\"We need a culture that celebrates life at all stages, one that recognizes and truly believes that the benchmark of national success is not our GDP number or our stock market, but whether people feel that they can raise thriving and healthy families in our country,\" he said.\n\nTrump did not attend in person but sent a video message while he was in North Carolina, criticizing the 1973 Roe v. Wade Supreme Court ruling as an \"unconstitutional decision\" that produced \"50 years of division and anger.\"\n\nHe also repeated a false claim that Democrats are pushing \"for a federal right to unlimited abortion-on-demand, up to the moment of birth and even after birth.\"\n\nHis remarks came a day after he pardoned 23 anti-abortion activists convicted of invading and blockading a Washington, D.C., abortion clinic in 2020.\n\nNeither Trump nor Vance announced any specific proposals to roll back abortion access on Friday, however, disappointing some in the crowd who hope Trump won't repeat his waffling on the issue during last year's presidential run.\n\n\"It was disappointing. It should have already happened. It needs to happen today,\" anti-abortion group leader Lila Rose told Politico. \"There's a ton more that can be done easily by executive order -- that was done in past administrations -- and that's a no brainer.\"\n\nAlso addressing the March for Life was Florida Gov. Ron DeSantis, who touted his state's defeat of a pro-abortion ballot initiative in November.\n\n\"The sanctity of life does not depend on poll results, it doesn't depend on which way the wind is blowing, it's an enduring truth and it represents the foundation of our society,\" DeSantis said.\n\nSpeaker of the House Mike Johnson, R-La., Sen. John Thune, R-N.D., also addressed the attendees, who marched from the Mall to the Capitol after the remarks were delivered.\n\nMarching along with them were dozens of members of the Patriot Front, a white supremacist group that carried U.S. flags, Christian symbols and signs proclaiming support for \"strong families.\"\n\nTheir presence drew criticism from the Jewish Anti-Defamation League.\n\n\"Today, approximately 100 members of the white supremacist Patriot Front are marching at the March for Life anti-abortion rally in D.C. Members are passing out fliers to attendees at the event and holding a large banner the reads, 'Strong Families Make Strong Nations,'\" the group said. \"Patriot Front makes regular appearances at anti-abortion events across the United States.\"\n\nMembers of the group \"believe that their ancestors conquered America and bestowed it to them, and no one else,\" the ADL said, adding that since 2019, \"Patriot Front has been responsible for the vast majority of white supremacist propaganda distributed in the United States, using fliers, posters, stickers, banners and the internet to spread their hateful ideology.\"","summary":"Vice President JD Vance led a list Republican luminaries who voiced strong agreement with the anti-abortion positions of participants at the annual March for Life amid cold and snowy weather Friday in Washington, D.C.","url":"https://www.upi.com/Top_News/US/2025/01/24/Vance-leads-list-speakers-celebratory-March-Life-Washington/2631737760339/","image":"https://cdnph.upi.com/ph/st/th/2631737760339/2025/upi/d86c1fb579d7305f2220c1dcb0bf4f6e/v1.2/Vance-leads-list-of-speakers-at-celebratory-March-for-Life-anti-abortion-event-in-DC.jpg","video":null,"publish_date":"2025-01-25 00:25:33","author":"Don Jacobson","authors":["Don Jacobson"],"language":"en","category":"politics","source_country":"us","sentiment":0.097},{"id":283657168,"title":"President Trump names Australian professional basketball team owner as New Zealand, Samoa ambassador","text":"President Donald Trump announced on Friday that Australian basketball Illawarra Hawks majority owner Jared Novelly will serve as the next U.S. ambassador to New Zealand and the Independent State of Samoa. Trump described Novelly as a \"highly respected philanthropist\" in an announcement on Truth Social. TRUMP NOMINATES PENNY SCHWINN FOR DEPUTY SECRETARY OF US DEPARTMENT OF EDUCATION Novelly serves as chairman of Crest Sports and Entertainment and Crest Management. WHO IS SEAN CURRAN? HEAD OF TRUMP'S PERSONAL DETAIL TO BE NOMINATED FOR SECRET SERVICE DIRECTOR He is also an East Asia Superleague Basketball shareholder, according to his LinkedIn profile. CLICK HERE TO GET THE FOX NEWS APP \"He will fight hard to protect our Nation’s interests in the Indo-Pacific, and always put AMERICA FIRST,\" Trump wrote. \"Congratulations Jared!\"","summary":"President Trump named Jared Novelly, Illawarra Hawks basketball team owner in Australia, as ambassador to New Zealand and the Independent State of Samoa.","url":"https://www.foxnews.com/politics/president-trump-names-professional-australian-basketball-team-owner-new-zealand-samoa-ambassador","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/novely.png?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:23:51","author":"Alexandra Koch","authors":["Alexandra Koch"],"language":"en","source_country":"US","sentiment":0.55},{"id":283654044,"title":"Xuxi, renditet në vendin e katërt në ‘BBVK’","text":"Kuriozitete\n\n Albanian English Serbian Turkish\n\nSelect LanguageAbkhazAcehneseAcholiAfarAfrikaansAlurAmharicArabicArmenianAssameseAvarAwadhiAymaraAzerbaijaniBalineseBaluchiBambaraBaouléBashkirBasqueBatak KaroBatak SimalungunBatak TobaBelarusianBembaBengaliBetawiBhojpuriBikolBosnianBretonBulgarianBuryatCantoneseCatalanCebuanoChamorroChechenChichewaChinese (Simplified)Chinese (Traditional)ChuukeseChuvashCorsicanCrimean Tatar (Cyrillic)Crimean Tatar (Latin)CroatianCzechDanishDariDhivehiDinkaDogriDombeDutchDyulaDzongkhaEnglishEsperantoEstonianEweFaroeseFijianFilipinoFinnishFonFrenchFrench (Canada)FrisianFriulianFulaniGaGalicianGeorgianGermanGreekGuaraniGujaratiHaitian CreoleHakha ChinHausaHawaiianHebrewHiligaynonHindiHmongHungarianHunsrikIbanIcelandicIgboIlocanoIndonesianInuktut (Latin)Inuktut (Syllabics)IrishItalianJamaican PatoisJapaneseJavaneseJingpoKalaallisutKannadaKanuriKapampanganKazakhKhasiKhmerKigaKikongoKinyarwandaKitubaKokborokKomiKonkaniKoreanKrioKurdish (Kurmanji)Kurdish (Sorani)KyrgyzLaoLatgalianLatinLatvianLigurianLimburgishLingalaLithuanianLombardLugandaLuoLuxembourgishMacedonianMadureseMaithiliMakassarMalagasyMalayMalay (Jawi)MalayalamMalteseMamManxMaoriMarathiMarshalleseMarwadiMauritian CreoleMeadow MariMeiteilon (Manipuri)MinangMizoMongolianMyanmar (Burmese)Nahuatl (Eastern Huasteca)NdauNdebele (South)Nepalbhasa (Newari)NepaliNKoNorwegianNuerOccitanOdia (Oriya)OromoOssetianPangasinanPapiamentoPashtoPersianPolishPortuguese (Brazil)Portuguese (Portugal)Punjabi (Gurmukhi)Punjabi (Shahmukhi)QuechuaQʼeqchiʼRomaniRomanianRundiRussianSami (North)SamoanSangoSanskritSantali (Latin)Santali (Ol Chiki)Scots GaelicSepediSerbianSesothoSeychellois CreoleShanShonaSicilianSilesianSindhiSinhalaSlovakSlovenianSomaliSpanishSundaneseSusuSwahiliSwatiSwedishTahitianTajikTamazightTamazight (Tifinagh)TamilTatarTeluguTetumThaiTibetanTigrinyaTivTok PisinTonganTshilubaTsongaTswanaTuluTumbukaTurkishTurkmenTuvanTwiUdmurtUkrainianUrduUyghurUzbekVendaVenetianVietnameseWarayWelshWolofXhosaYakutYiddishYorubaYucatec MayaZapotecZuluPowered by Translate\n\n 75 Mall Live Search\n\n Shpërndaje\n\n Pëlqeje\n\n 01:23 / E Shtunë, 25 Janar 2025 / AR\n\n Xuxi, renditet në vendin e katërt në ‘BBVK’\n\nXuxi ka mbyllur aventurën në vendin e katërt në Big Brother VIP Kosova 3.\n\nAi ishte në garë me Xheneten, Vullnetin dhe Drilonin.Cardiologist: Too Much Belly Fat? Do This Before BedFitnessUndoExplore Lucrative Security Guard Jobs – Start Your Career with Top Employers Today!toptipUndoby Taboolaby Taboola\n\nKujtojmë që Xuxi u bë pjesë e këtij formati nga java e dytë e këtij reality show./Indeksonline/\n\n \n\n Cardiologist: Too Much Belly Fat? Do This Before BedFitness|SponsoredSponsoredUndoGame shows what the world without US military interventions would look likeThis strategy games makes you become a player in the crucial situations of history.History Strategy Game|SponsoredSponsoredUndoWhy Did The VA Keep This Secret From Us?Veterans are snapping up these little known benefits.Veteran Benefits Affairs|SponsoredSponsoredUndoExplore Lucrative Security Guard Jobs – Start Your Career with Top Employers Today!Apply now for high-demand security guard positions. Competitive pay and benefits await!toptip|SponsoredSponsoredUndo2025 SBA Funds Now Available for Your Small BusinessLoan Options From $10k - $2MM. Apply today if you’ve been in business for over 6 months and make over $8k in monthly revenue.Lendio SBA|SponsoredSponsoredUndoCrude, Heating Oil, and Gas Trade select energy futures with 25% intraday margin ratesTradeStation|SponsoredSponsoredUndoIf you have a mouse, this game will keep you awake all night long.PanzerQuest|SponsoredSponsoredUndoInagurimin i Trumpit, Zyberaj: Mashtrimi doli në shesh, u bë e qartë kush ishte vërtet i ftuar dhe kush kishte blerë biletëindeksONLINEUndoArbana Xharra pëson një lëndim të çuditshëmindeksONLINEUndoSeniors Born 1941-1979 Receive 7 Benefits This Month If They AskSenior discounts most seniors haven't heard about yet.NationalPenny|SponsoredSponsoredUndoVA Exposed: Huge Benefits Hidden From VeteransVeterans are snapping up these little known benefits.Veteran Benefits Affairs|SponsoredSponsoredUndoThink all financial advisors are the same? Think again.Don’t gamble with your retirement. See why more people are choosing fiduciary advisors.Bankrate|SponsoredSponsoredUndoMOST POPULARKjo është arsyeja se pse Xheneta është lart në rënditje me votaindeksONLINEUndoMOST POPULAREkskluzive: Finalja e Big Brother, ja kush po prinë me vota aktualishtindeksONLINEUndoSeniors On SS Receive 7 Big Benefits This Month If They AskSenior discounts most seniors haven't heard of yet.NationalPenny|SponsoredSponsoredUndo\n\n Mos i humb\n\n \n\n Një veturë e FSK-së përfshihet në një aksident trafiku në kryeqytet (Foto)\n \n \n\n \n\n “Ndryshoi jetën time”, ushtari i KFOR-it kujton momentin e hyrjes në Kosovë 25 vjet më parë\n \n \n\n \n\n “I ke 30 minuta… Koha po kalon, kanë mbetur dhe 28 minuta”/ Kush është komandanti gjerman, që i dëboi nga Prizreni ushtarët serbë?\n \n \n\n \n\n Shoferi i dehur gjobitet 2 herë, brenda pak minutash, për tejkalim shpejtësie\n \n \n\n \n\n Hajdari: Roli i Avokatit të Popullit të mos involvohet në procedura gjyqësore\n \n \n\n \n\n AKB: Rreth 40 për qind të bizneseve s’e përdorin arkën fiskale në mënyrën e duhur\n \n \n\n 12\n\n Të fundit nga Showbiz\n\n E Shtunë, 25 Janar\n Sara e para që lë shtëpinë në finale\n\n E Shtunë, 25 Janar\n Gresa kthehet në studio, Dini e ngacmon: T’u ka bë padrejtësi ty\n\n E Shtunë, 25 Janar\n Ekskluzive/ Driloni dhe Xheneta në një garë të ngushtë për fitore\n\n E Premte, 24 Janar\n Santiana në lidhje me ishin e këngëtares së njohur?\n\n E Premte, 24 Janar\n Nuk do ta njihni, kështu duket Lela për finalen e BBVK-së (FOTO)\n\n E Premte, 24 Janar\n Xheneta lexon një letrën mbi përjetimet e saja në shtëpi, kishte edhe disa fjalë për Gjesti\n\n Tel: Redaksia: +383 (0) 48 36 36 39 | Marketing: +383 (0) 49 686 666\n Email:info@indeksonline.netmarketing@indeksonline.net \n\n Portali Indeksonline u themelua nga një grup gazetarësh kosovarë në vitin 2010. Përball sfidave të gazetarisë bashkëkohore, të motivuar nga nevoja për lajme të shpejta dhe origjinale, në Kosovë, ndër shqiptarë dhe për shqiptarët – Indeksonline nuk ishte veçse një kërkesë e kohës.\nMaterialet dhe informacionet mund të kopjohen, të shtypen dhe të përdoren por vetëm pas referimit të qartë të burimit të Portalit Indeksonline, në përputhje me kushtet e përdorimit.!!\n\n © 2010 - 2024 Portali Indeksonline. Të gjitha të drejtat janë të rezervuara.\n\nOriginal textRate this translationYour feedback will be used to help improve Google Translate\n\nInagurimin i Trumpit, Zyberaj: Mashtrimi doli në shesh, u bë e qartë kush ishte vërtet i ftuar dhe kush kishte blerë biletëJetlir Zyberaj, ish-shefi i stafit të ish-presidentit Behgjet Pacolli, ka reaguar në lidhje me ftesat për inagurimin e presidentit Donald Trump. Zyberaj, përmes një postimi në facebook u shprehë se disa njerëz pretenduan se kishin marrë ftesa zyrtare, ndërkohë që as nuk i kishin parë me sy. Ndërsa tindeksONLINEUndoArbana Xharra pëson një lëndim të çuditshëmGazetarja, Arbana Xharra, ka pësuar një aksident në shtëpinë e saj, teksa ishte duke luajtur më fëmijet. Ajo thotë se nga ky aksident ka thyer një brinjë dhe lënduar mushërkinë. Xharra në një postim në Facebook, ka shkruar se i vjen keq prej kolegëve në TV në Kosovë dhe Shqipëri që s’ka mundur të iuindeksONLINEUndoArrestohet aktori i mirënjohur shqiptarPolicia ka vënë në pranga aktorin e humorit, Rezart Veleshja. Sipas njoftimit zyrtar të policisë, Veleshnja është arrestuar pasi me anë të mashtrimit, i ka marrë një automjet një personi dhe më pas e ka shitur. “Specialistët për hetimin e krimeve të Komisariatit të Policisë Durrës ndaluan shtetasin indeksONLINEUndoPanik në SHBA! Donald Trump paralajmëron “Luftën e Tretë Botërore”Ish-presidenti Donald Trump paralajmëroi se ofensiva e Ukrainës në Rusi mund të nisë “Luftën e Tretë Botërore”, në atë që gazeta britanike Metro e ka vlerësuar si përpjekjen më të fundit të republikanit për të ndalur rritjen e mbështetjes për Kamala Harris. Trump gjatë fjalimeve në një konferencë tëindeksONLINEUndo\n\nUkraina kryen shpërthim shkatërrues në trenin ushtarak rusNjë shpërthim i fuqishëm ka tronditur një hekurudhë në periferi të kryeqytetit rus, Moskën, duke shkatërruar vagona të trenit të mallrave që përdoren nga Rusia për logjistikë. Sipas zyrtarëve të sigurisë ukrainase, sulmi është pjesë e objektivave të Ukrainës për të goditur infrastrukturën transportuindeksONLINEUndoExplore Lucrative Security Guard Jobs – Start Your Career with Top Employers Today!Apply now for high-demand security guard positions. Competitive pay and benefits await!toptip|SponsoredSponsoredUndoIf you have a mouse, this game will keep you awake all night long.PanzerQuest|SponsoredSponsoredUndoKy është personi që u plagos sonte në DragodanNjë person është plagosur me armë zjarri mbrëmjen e sotme në Dragodan të Prishtinës. Burime të IndeksOnline pohojnë se viktima në fjalë është Fatlum Jetullahu. Për gjendjen e të plagosurit detaje ka dhënë mjeku kujdestar, Avdush Bajgora. “Është duke u trajtuar nga specialistët në intensivë, nuk mundindeksONLINEUndoShpërthim i fuqishëm në veriNjë granatë dore raportohet të jetë hedhur në veri të vendit. Burime të IndeksOnline pohojnë se shpërthimi ka ndodhur në Zveçan, më saktësisht në afërsi të një pompe derivatesh, e hapur së fundmi në atë zonë. IndeksOnline raporton se, si pasojë e shpërthimit, tri vetura kanë pësuar dëmtime. Akoma nuindeksONLINEUndoDalin detaje për shkakun e vdekjes së Kaidanow, NYT shkruan edhe për letrën e Biden drejtuar vëllait të saj -përmendet KosovaGazeta The New York Times ka shkruar rreth vdekjes së Tina Kaidanow, e cila ishte ambasadorja e parë e SHBA-së në Kosovë pas shpalljes së pavarësisë në vitin 2008. Vdekja e saj në media u raportua më 16 tetor, ndërsa NYT shkruan se Kaidanow vdiq më 14 tetor në Uashington, në moshën 59 vjeçare. ShkakindeksONLINEUndoKaderi publikon momente romantike me LumbardhinIsh-banorja e Big Brother VIP Kosova, Kader Kicaj ka publikuar fotografi me të dashurin e saj, fituesin e edicionit të dytë të BBVK-së, Lumbardh Salihun. Ajo në fotografinë e publikuar, e ka konsideruar Lumbardhin si “gjithçka” të saj. “Gjithçka e imja”, ka shkruar Kaderi në postimin e saj.indeksONLINEUndoVuçiq propozon modelin e Tirolit për Kosovën, ndërmjetëse të jetë GjermaniaGjatë një takimi me përfaqësues të ekonomisë zvicerane të organizuar në Zyrih nga revista Weltwoche, presidenti serb Aleksandar Vuçiç foli për Kosovën, tensionet gjeopolitike dhe perspektivat ekonomike të vendit të tij. Vuçiç ka kritikuar ndërhyrjen e NATO-s të viteve 1998/99 dhe ka bërë krahasime mindeksONLINEUndoSeniors Born 1941-1979 Receive 7 Benefits This Month If They AskSenior discounts most seniors haven't heard about yet.NationalPenny|SponsoredSponsoredUndoGame shows what the world without US military interventions would look likeThis strategy games makes you become a player in the crucial situations of history.History Strategy Game|SponsoredSponsoredUndoE dhimbshme/ Ndërron jetë Festina Bujupi-Shala pas komplikimeve pas lindjesMe pikëllim të thellë ju njoftojmë se sot, në orët e para të mëngjesit, ndërroi jetë Festina Bujupi-Shala, pas një komplikimi të rëndë pas lindjes. Megjithë përpjekjet e mjekëve dhe forcën e saj për të luftuar, ajo nuk arriti t’ia dilte. Festina nga Arllati e martuar në Vukovc, ishte një grua e dashindeksONLINEUndoKaq është shuma e pensioneve që do t’i marrin pensionistët nga ky muajKryeministri Albin Kurti ka bërë të ditur se do të rriten pensionet nga muaji tetor për 20 për qind. Në një konferencë bashkë me ministrin Murati, Kurti ka bërë të ditur se rritja e pensioneve do të vlejë nga ky muaj. Pensioni bazik i moshës do të rritet në 120 euro, pensioni kontributpagues për katindeksONLINEUndo","summary":"Xuxi ka mbyllur aventurën në vendin e katërt në Big Brother VIP Kosova 3. Ai ishte në garë me Xheneten, Vullnetin dhe Drilonin. Kujtojmë që Xuxi u bë pjesë e këtij formati nga java e dytë e këtij reality show./Indeksonline/","url":"https://indeksonline.net/xuxi-renditet-ne-vendin-e-katert-ne-bbvk/","image":"https://indeksonline.net/wp-content/uploads/2025/01/IMG_2042.jpeg","video":null,"publish_date":"2025-01-25 00:23:44","author":null,"language":"en","source_country":"xk","sentiment":0.591},{"id":283658790,"title":"Iowa immigration law remains blocked, US appeals court says, but second lawsuit to be dismissed","text":"A federal appeals court on Friday sided with the Biden administration's Department of Justice and kept a temporary block on an Iowa law that makes it a state crime for a person to be in Iowa if they are in the U.S. illegally. \n\nBut a second order from the 8th Circuit U.S. Court of Appeals raises questions on future court proceedings now that President Donald Trump is in the White House.\n\nThe department and an immigrant rights groups sued Iowa in May over the law, which looks similar to Texas and Oklahoma laws that are also on hold while courts consider whether they unconstitutionally usurp federal immigration authority. A district court judge granted the Biden administration and the immigrant rights group a temporary block on the law, and Iowa appealed.\n\nThe federal appeals court said Friday that the temporary block stands, and Iowa cannot enforce the law that would let state and local officials arrest and charge people who have outstanding deportation orders or who previously have been removed from or denied admission to the U.S.\n\nBut the federal appeals court issued a second decision Friday that might complicate the legal battle in Iowa if Trump's administration withdraws the Department of Justice's complaint. \n\nThe federal appeals court said that the lawsuit filed by Iowa Migrant Movement for Justice on behalf of its organization and two individuals should be dismissed by the district court judge — because the U.S. v. Iowa lawsuit makes it moot.\n\n“Right now we're just figuring out what our legal next steps are,” said Veronica Fowler, communications director for the ACLU of Iowa, one of the legal teams representing Iowa Migrant Movement for Justice, \"because obviously we are committed to doing everything we can to strike down this really terrible law.”\n\nThe Department of Justice did not immediately respond to a request for comment on the future of the lawsuit, which would proceed in the lower court.\n\nUnder President Joe Biden, Republican governors and lawmakers across the country accused the president of a failure to enforce federal immigration law and manage the southern border. Most are now lining up to support Trump in his pledge to crack down on illegal immigration and deport many who are living in the U.S. illegally. \n\nA December joint statement from 26 Republican governors, including Iowa Gov. Kim Reynolds, said they “stand ready to utilize every tool at our disposal — whether through state law enforcement or the National Guard — to support President Trump in this vital mission.”\n\nIowa Attorney General Brenna Bird said in a statement Friday that the “battle is far from over.”\n\n“As President Trump works nationally to fix the mess Biden and (Vice President Kamala) Harris created on the southern border, we will continue fighting in Iowa to defend our laws and keep families safe,” Bird said.","summary":"A federal appeals court is siding with the Biden administration’s Department of Justice and keeping a temporary block on an Iowa immigration law","url":"https://www.independent.co.uk/news/joe-biden-ap-iowa-donald-trump-des-moines-b2686110.html","image":"https://static.independent.co.uk/2025/01/25/00/Iowa_Immigration_Law_Lawsuit_83563.jpg?width=1200","video":null,"publish_date":"2025-01-25 00:22:58","author":"Hannah Fingerhut","authors":["Hannah Fingerhut"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.517},{"id":283658792,"title":"Trump’s first foreign call was with ‘fantastic guy’ Prince Mohammed bin Salman about $600 billion deal","text":"President Donald Trump spoke with Saudi Crown Prince Mohammed bin Salman this week about a multi-billion-dollar investment in the United States – which Trump boasted on Thursday he believes he could push to “$1 trillion.”\n\nIn his first foreign phone call as president on Wednesday Trump said he and the crown prince spoke about Saudi Arabia investing $600 billion in the U.S. — though they did not clarify what those investments would be. \n\nOne day later, at the World Economic Forum, Trump called the crown prince “a fantastic guy” and said he plans to ask Saudi Arabia to “round out” its investment to $1 trillion.\n\n“I’ll be asking the crown prince, who is a fantastic guy, to round it out to around one trillion and I think they’ll do it because we’ve been good to them,” Trump said while appearing virtually at the forum.\n\nThe president said he would also ask Saudi Arabia and the Organization of the Petroleum Exporting Countries to bring down the price of oil.\n\n“You got to bring it down, which, frankly, I’m surprised they didn’t do before the election,” he said. “That didn’t show a lot of love by them not doing it. I was a little surprised by that.”\n\nLater, at an executive order signing, Trump told reporters he would “probably” travel to Saudi Arabia if it agreed to buy $450 billion or $500 billion worth of U.S. products. The country was the first Trump traveled to during his first term in the White House.\n\nHe again reiterated that he would urge the crown prince to increase his investment in the U.S.\n\nTrump has maintained close ties to Saudi Arabia even after U.S. intelligence concluded bin Salmon ordered the assassination and dismemberment of Washington Post journalist Jamal Khashoggi in 2018. \n\nAt the time, the president defended the Saudi government and rejected U.S. intelligence findings saying, “We may never know all the facts surrounding the murder.”\n\nFollowing the call between Trump and Prince Mohammed, the Saudi government released a readout echoing the kingdom’s intention to “broaden its investment and trade with the United States over the next four years in the amount of $600 billion and potentially beyond that.”","summary":"Trump hailed the crown prince American intelligence accused of ordering the assassination of a Washington Post journalist, and said he’s going to press Saudia Arabia to invest $1 trillion in the U.S.","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-mohammed-bin-salman-600-billion-deal-b2686082.html","image":"https://static.independent.co.uk/2025/01/24/23/SEI237012582.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/wCvKs8My-4VHSaSK0.mp4","publish_date":"2025-01-25 00:22:23","author":"Ariana Baio","authors":["Ariana Baio"],"language":"en","source_country":"gb","sentiment":-0.301},{"id":283658386,"title":"The Traitors host Claudia Winkleman reveals she's been inundated with messages about Alexander from her friends after announcing he's single","text":"Black Friday\n\nThe Traitors\n\nThe Masked Singer\n\nLove Island All Stars\n\nDancing On Ice\n\nPrivacy Policy\n\nSaturday, Jan 25th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nThe Traitors host Claudia Winkleman reveals she's been inundated with messages about Alexander from her friends after announcing he's single\n\nHave YOU got a story? Email tips@dailymail.com \nBy NIOMI HARRIS FOR MAILONLINE \n Published:00:11 GMT, 25 January 2025 |Updated:00:22 GMT, 25 January 2025 \n\nThe Traitors host Claudia Winkleman has revealed that she been inundated with messages about Alexander Dragonetti from her friends.\nFriday night's nail-biting final Leanne Quigley and Jake Brown emerge victorious, bagging the £94,600 prize after outsmarting the Traitors.\nAnd while some fans have been glued to the ups and downs of the Faithfuls and Traitors, several others were far more interested in the dishy British diplomat, with the 38-year-old steadily earning himself a heartthrob status. \nIndeed, so popular was Alexander, that host Claudia even declared he was single during a recent episode of the BBC show. \nHowever, during Friday's spin-off show The Traitors: Uncloaked, Claudia told how she'd been swamped requests about the hunk's, noting that many of her pals have urged her to 'define how single' he was.\nClaudia then went on to apologise to Alexander for publicly confirming his relationship status amid the huge attention he's received while on the show. \n\nThe Traitors host Claudia Winkleman has revealed that she been inundated with messages about Alexander Dragonetti from her friends\n\nWhile some fans have been glued to the ups and downs of the Faithfuls and Traitors, several others were far more interested in the dishy British diplomat, with the 38-year-old steadily earning himself a heartthrob status\nShe said: 'I'm so sorry that I reported to the group that you were single.\n'I've had more messages about you, you are... you're king!'\nTurning to the cheering audience, she asked: 'He is, right?' \nShe continued: 'More messages from friends of mine who were like \"define single\".'\nFrankie then chipped in, saying: 'All my divorced friends have Whatsapped me like \"Can I have his number?\"'\nIt comes days after TikTok users had 'have found Alexander's dating profile on Hinge' as female fans continued to swoon over the season favourite.\nSome TikTok users posted screenshots from what appears to be Alexander's online dating profile - sparking a frenzy of interest from women in the comments section. \nGrabs from Alexander's alleged Hinge profile included several pictures of The Traitors star as well as responses to three prompts. \n\nDuring Friday's spin-off show The Traitors: Uncloaked, Claudia told how she'd been swamped requests about the hunk's, noting that many of her pals have urged her to 'define how single' he was\n\nClaudia then went on to apologise to Alexander for publicly confirming his relationship status amid the huge attention he's received while on the show.\n\nShe said: 'I'm so sorry that I reported to the group that you were single. I've had more messages about you, you are... you're king!'\n\n Leanne Quigley and Jake Brown win The Traitors as the Faithfuls take home the £94,600 prize money \nAnswering a question about 'my simple pleasures', the Hinge user believed to be Alexander replied: 'I enjoy foreign supermarkets, the graphic that pops up when my email is empty & buying fruit I've never seen before'. \nWhen asked to complete the phrase 'I bet you can't', he replied: 'Beat me in a dancing competition.\n'Prove me wrong,' 'Alexander' dared any prospective matches. \nAccording to the profile, the Hinge user - who fans are convinced is the real Alexander - is 5ft8, attended the University of Oxford, and currently lives in London. \nHe also shared 'two truths and a lie' about himself, including 'I've lived in Palestine, Pakistan, and Nigeria' and 'I am the Secret Garden Party pun champion'.\nElsewhere, Francesca Rowan-Plowden, Leanne, Alexander, Jake and Charlotte Berman were the five remaining contestants going into the tense final. \nBut it was Faithfuls who managed to out smart the Traitors and bag the £94,600 prize money. \n\nIt comes days after TikTok users had 'have found Alexander's dating profile on Hinge' as female fans continued to swoon over the season favourite \n\nGrabs from Alexander's alleged Hinge profile included several pictures of The Traitors star as well as responses to three prompts\n\nIn the most fiery roundtable yet, the Faithfuls banished the final Traitor of the series. But in yet another new twist the 'Welsh' business director didn't reveal her status as she left the castle. \nIt left the four remaining players considering whether there could be a final villain, with suspicions landing on Alexander in particular, who was the next to be banished.\nBut the game didn't end there as the final three also all voted to banish again in an excruciating round of endgame. \nWhile Frankie opted to banish Jake, Leanne and Jake then turned on Frankie as she became the final player to leave the castle, leaving Leanne and Jake victorious. \nAt the beginning of the episode, Frankie discovered Charlotte was a Traitor after she used her powers as the Seer to unveil her identity. \nWhile she suspected the results to confirm Charlotte was a Faithful, viewers obviously knew Frankie would be shocked. \nOpening the letter revealing Charlotte's traitorous identity, Frankie broke down tears as she exclaimed: 'Oh my god. It's quite difficult. It's a shock to my heart.'\n\n Leanne Quigley and Jake Brown have won The Traitors as the Faithfuls took home the £94,600 prize money in an excruciating final on Friday evening\n\nIt was Faithfuls who managed to out smart the Traitors and bag the £94,600 prize money in the tensest final yet \n\n The winners posed with host Claudia Winkleman at the London screening on Friday evening \nCharlotte then replied: 'You realise this doesn't leave this room. The game continues.'\nRealising she was about to be framed, Frankie added: 'Oh my gosh Charlotte. You are going to say that I'm the Traitor aren't you?' \nDuring a tense breakfast the pair were left battling it out as they each accused each other of lying. \nAs Charlotte left the room in tears, the two spent the day trying to prove their innocence to the remaining faithfuls, Jake, Leanne and Alexander. \nIn a heartfelt exchange in the kitchen, Frankie tried to convince Leanne of her faithful status as she said: 'I am a mummy. I know what this means for you and your boys. I know what you have been through. I swear on making my boys proud I am telling the truth.' \nAs things got incredibly heated around the roundtable, Charlotte made a final attempt to throw the scent off her as she exclaimed: 'I would not take her [Frankie] to the endgame. My god.' \nHowever suspicions were then raised over Alexander as the remaining contestants pondered over whether there could still be two Traitors left in the game. \nYet it was game over for Charlotte as all four of the contestants voted for her and she was banished. \n\nIn the most fiery roundtable yet, the Faithfuls banished the final Traitor of the series. But in yet another new twist the 'Welsh' business director didn't reveal her status as she left the cast\n\nWhile Frankie opted to banish Jake, Leanne and Jake then turned on Frankie as she became the final player to leave the castle, leaving Leanne and Jake victorious\n\nIt left the four remaining players considering whether there could be a final villain, with suspicions landing on Alexander in particular, who was the next to be banished\nThe four remaining players then headed outside with Claudia for the ultimate End Game as they each made their choice whether to 'End the game' or 'Banish again' depending on whether they thought there were any remaining Traitors. \nThe game only ends when all the contestants vote to 'End the game,' however all players were on the same page as they all chose to banish again. \nAlexander was then eliminated from the game after Frankie, Leanne and Jake all voted for him. \nHowever the game wasn't over yet, as Leanne and Jake then voted to banish Frankie before the game finally ended. \nClaudia WinklemanTikTok\n\nShare or comment on this article: \nThe Traitors host Claudia Winkleman reveals she's been inundated with messages about Alexander from her friends after announcing he's single\n\nAdd comment\n\nEnter search term:\n\nLeanne Quigley and Jake Brown win The Traitors as the Faithfuls take home the £94,600 prize money in excruciating final\n\nTimothee Chalamet's sister Pauline 'hits out' at Kylie Jenner in scathing post\n\nJude Bellingham 'seen for the first time with new girlfriend Ashlyn Castro - and she's already met his parents'\n\nEXCLUSIVERevealed: Peaches Geldof's widow's new love. He raised two sons alone after her heroin overdose. Now his life has been changed \n\nMiley Cyrus has no 'interest' in reconciling with her father Billy Ray and has no relationship with him\n\nTV host Alex Jones shares the highlights of her family holiday on the Algarve\n\nThe Traitors host Claudia Winkleman reveals she's been inundated with messages about Alexander from friends after announcing he's single\n\nEXCLUSIVETruth about why the Boyzone fallout is STILL toxic: Friends tell KATIE HIND why they 'despise' Louis Walsh for what he did and the rivalry that tore them apart\n\nEXCLUSIVEInside Ryan Reynolds desperate bid to save his image amid wife Blake Lively's $400 million legal battle with Justin Baldoni\n\nBoost your health and happiness: Top 10 brands to kick-start your wellness journey\n\nColeen Nolan discusses heartfelt plans for her sister Linda's funeral and shares details of her final resting place\n\nNeed another Traitors fix? The US version is back... and it's one of our TV experts' picks of the hottest shows and films to watch this weekend\n\nSteven Gerrard and wife Alex share major family news just weeks after daughter Lilly-Ella announces pregnancy\n\nEXCLUSIVEAngelina Jolie and Brad Pitt's son Pax, 21, involved in ANOTHER e-bike crash after riding around with no hands\n\nMum's the word! Here are the top 10 brands for both mother and baby this month\n\nShe's an iconic romcom legend whose voice was once dubbed by Glenn Close... can you guess who?\n\nMartha Stewart takes major swipe at Barbra Streisand while discussing her upcoming bombshell memoir\n\nSarah Jessica Parker, 59, is a wrinkle-free beauty as she promotes her documentary at Sundance\n\nThe Traitors final: Fans slam the Seer twist for 'RUINING' the show as Charlotte and Frankie battle it out to convince players they are Faithfuls\n\nGive your brood a boost! Discover how to enhance your homelife with these top 10 brands for families\n\nBilly Ray Cyrus' son Trace makes thinly-veiled dig at brother Braison for spending time with 'unhealthy' dad\n\nSteph McGovern 'rushed to medics after crashing into a CLIFF on Celebrity Bear Hunt - with host Holly Willoughby close to tears\n\nKate Moss looks chic in a black satin coat and £800 Bvlgari bag as she steps out in Paris for Fashion Week\n\nKerry Katona reveals she's 'cancelled her facelift after children begged her not to go through with it'\n\nLet Europe's beauty unfold before you: Expertly curated coach tours are taking the stress out of travel - just LOOK at these incredible holidays\n\nDrew Barrymore shares what she really thinks about turning 50 this year as she reveals if she is dating again\n\nThe Traitors winner Meryl Williams reveals she's having another boob job after shrinking her 32FF bust -a year after forehead reduction surgery\n\nRobbie Williams makes UK chart history as he achieves record Number 1 after film biopic Better Man flops at box office\n\nAll the clues Freddie IS Francesca's secret son as Traitors fans brace themselves for shocking finale twist\n\nNatalie Dormer looks sensational in a black power suit as she joins her husband and former soap star Kelvin Fletcher at the White Hat Ball\n\nBrad Pitt sports silver beard as he is seen for the first time since finalizing Angelina Jolie divorce\n\nAndie MacDowell admits she is benefitting from 'reverse nepotism'... after opening up about health battle\n\nEXCLUSIVEMarilyn Manson breaks silence after he was cleared in domestic violence and sexual assault cases\n\nThe Traitors' Lisa Coupland shows off her glamorous new look as she arrives at the series finale screening\n\nLove Island winner Molly Smith launches new Move With Molly fitness plans - and you could see results in just six WEEKS (get 45% off now)\n\nThe Traitors star Leanne goes full glam as she is joined by final remaining villain Charlotte as the cast arrive at a London screening of BBC final\n\nTori Spelling gives shocking answer when asked if her home was looted during evacuation from the LA fires\n\nMaybe she's born with it... maybe it's Mounjaro! Gemma Collins debuts new look as she gives update on her weight loss journey \n\nCher, 78, could be mistaken for Kim Kardashian, 44, as she dons a cowgirl hat at New York airport\n\nREVEALED: The best contour wands for defined and lifted cheekbones - and an unmissable beauty deal with 15% off\n\nMarilyn Manson will NOT be charged in domestic violence and sexual assault cases\n\nTroubling reason Michael Jackson biopic's release date has been delayed by six months\n\nScarlett Johansson reveals she has started giving her 10-year-old daughter dating advice\n\nJesy Nelson says she was 'shocked' to discover she was pregnant but was 'instantly happy' as she details her tough twin pregnancy\n\nHUGE mobile phone offer: Save up to £932 on the new Google Pixel 9 Pro XL with Vodafone - but there's a catch\n\nJennifer Aniston speaks out about wild Barack Obama affair rumors in resurfaced video\n\nKatie Price shares update from her hospital bed as she prepares to go under the knife AGAIN in Turkey for 'tweaks' to her £10K facelift \n\nBen Ofoedu and his new girlfriend risk an awkward run in with his ex Precious Muir at the Henley Festival 2025 launch party\n\nEkin-Su Culculoglu leaves Love Island: All Stars contestants CRINGING with her sloppy kisses in racy challenge\n\nBizarre reason Sandra Bullock has been dragged into Ryan Reynolds, Blake Lively and Justin Baldoni drama\n\nMatthew McConaughey's daughter Vida, 15, is her model mother Camila Alves' mini me\n\nBen Affleck admits he was 'disturbed' by Jennifer Lopez's admiration for Kevin Costner in resurfaced interview\n\nPlayboy alum Kendra Wilkinson, 39, refuses to call her weight gain a 'failure'\n\nScarlett Johansson addresses husband Colin Jost's 'vulgar' SNL joke about her body\n\nBeauty lovers say this sculpting gel makes them look 'TEN years younger' - and we have an exclusive 20% off discount code\n\nBilly Ray Cyrus announces new album with son Braison after his other son Trace says star is 'not healthy'\n\nHollyoaks star Jessica Fox looks unrecognisable as she debuts dramatic new haircut\n\nJake Quickenden defiantly insists 'I won't let others ruin my happiness' as he proudly shares snaps of newborn despite vile trolls' attacks on his firstborn's looks\n\nRyan Reynolds' forgotten romance: A look back at the actor's first celebrity flame as his marriage to Blake Lively hits the spotlight\n\nA bottle of this lavender pillow spray is sold every 79 SECONDS with users swearing they 'fall asleep in minutes' (and it's on sale)\n\nMyleene Klass shows off her washboard abs in grey underwear as she reveals incredible Instagram hack\n\nColeen Rooney and husband Wayne surprise son Kit with HUGE darts themed balloon display and cake to celebrate his ninth birthday\n\nI was on Dragons' Den - my legs turned to jelly and my heart sank after moment on set we never prepared for\n\nRiverdale star Lili Reinhart, 28, reveals shock health battle with 'mystery' chronic disease\n\nWhy Prince Harry won't be pocketing as much of his £10million payout as he hoped... and why Donald Trump could be the ultimate winner. Another sensational royal scoop from RICHARD EDEN\n\nAnt McPartlin's ex-wife Lisa Armstrong 'takes their £2.3million five-bed west London mansion off the market' - after slashing £250,000 off the asking price\n\n'Catwoman' Jocelyne Wildenstein's fiancé Lloyd Klein makes his first public appearance since her death at 79 - as he cuts a sombre figure at PFW Dior show\n\nKate Moss showcases her supermodel physique in a satin mini dress as she leads the stars at Dior's Paris Fashion week menswear show\n\nLove Island All Stars SPOILER: Ronnie is left fuming over accusations he called relationship with Harriett a 'showmance'\n\nJessica Alves forced to cancel all US TV appearances over 'fears for her safety' amid President Trump's crackdown on 'gender ideology'\n\nMystery as Kate Beckinsale deletes all her Instagram posts - weeks after being cruelly trolled over her weight\n\nPamela Anderson, 57, is back to wearing bombshell makeup... after being Oscar snubbed for Last Showgirl\n\nSam Thompson larks about with his sister Louise - after he opened up about his 'amazing' support system following his shock split from Zara McDermott\n\nKanye West reveals his eye-watering net worth thanks to his music and ownership of Yeezy brand - two years after losing '$2billion in one day' \n\nNick Knowles' fiancée Katie Dadzie, 34, flaunts her jaw-dropping figure in a skimpy bikini as she packs on the PDA with the shirtless DIY SOS host, 62\n\nClaudia Winkleman showcases her signature sense of style in all-black as she arrives at a London screening of The Traitors final\n\n'Greatest teen drama ever' that shot its cast to fame is finally available to stream for free as fans hail it 'the ultimate nostalgia trip'\n\nEXCLUSIVESavage X Fenty collection is 50% off using this shopping hack - including bras, sets and loungewear pieces\n\nKate Moss kisses pal Gwendoline Christie on the cheek and she puts on an animated display on the FROW at Dior Homme show for Paris Fashion Week\n\nAward-winning BBC comedy 'axed before its time' returning to screens for new series - but there's a problem for diehard fans\n\nKate Moss is reunited with her exes Jefferson Hack and Jamie Hince as she makes a glamorous exit from best friend Rosemary Ferguson's star-studded birthday bash\n\nThe Masked Singer fans 'rumble' Kingfisher as Strictly Come Dancing star - insisting 'the clues all point to him'\n\nLove Island: All Stars Ekin-Su and Curtis hit the rocks as he spends the night on the daybeds after her sloppy smooches with other contestants\n\nRobert Pattinson turns heads with his awkward attempts at a smile before opting for a steely pout at the Dior show amid Paris Fashion Week\n\nBilly Ray Cyrus' ex-wife Firerose trashes the singer after son Trace reveals his dad is 'struggling'\n\nLily Allen reveals a famous rapper slid into her DMs after he split from his TikTok creator ex - amid her break-up from husband David Harbour\n\nLove Island's Jessy Potts puts on a VERY leggy display at You're Cordially Invited screening - after savage swipe at ex Joey Essex\n\nAmanda Holden and Alan Carr reveal the revolting thing they discovered in a bath while transforming a run-down house on their TV show\n\nLove Island's Matilda Draper puts on a loved-up display with boyfriend Roman Hackett as they film TOWIE\n\nBRYONY GORDON: I've got cleavage that has a strange power... one only women will understand\n\nBella Hadid flashes her very toned and SHINY tummy in a crop top after making a splash on Yellowstone\n\nKardashian fans go wild trying to figure out the hidden meaning to a small detail in new poster\n\nDavid and Victoria Beckham join the slew of famous faces at Rosemary Ferguson's star-studded 50th birthday party in London\n\nKate Moss cements her supermodel status as she exudes sensual charm in elegant structured jackets for stunning new Elisabetta Franchi campaign\n\nLisa Snowdon shows off her incredible figure in skimpy bikinis as she celebrates her 53rd birthday in the Caribbean\n\nRobbie Williams set to make UK chart history after film biopic Better Man flops at box office\n\nEXCLUSIVEThe Traitors' Mollie Pearce reveals winner Harry Clark has deceived her AGAIN as she aims to become the first female champion of Dancing On Ice since 2013\n\nWill Ferrell reveal the surprising role he had in the OJ Simpson trial as his co-star Reese Witherspoon opens up about 'changing women's lives' \n\nFerne McCann breaks down in tears live on Lorraine after being ambushed with surprise message ahead of Dancing On Ice performance\n\nEXCLUSIVEKyle Walker's wife Annie Kilner is taking private jet to Italy to be with him in public show of unity when he is unveiled to fans of AC Milan\n\nI'm a Traitors addict. Here are the hidden clues you've missed that have convinced me THIS surprise player is going to win: CLAUDIA CONNELL\n\nBBC drops first look at legendary TV show as it returns to screens after a whopping 25 years off screens - capturing a brand new audience\n\nGladiators star announces exciting baby news in sweet Instagram post as co-stars rush to congratulate\n\nThis Morning's Dermot O'Leary leaves Alison Hammond open-mouthed as he snubs her with unfortunate slip of the tongue just minutes into show\n\nPeter Andre issues heart-wrenching plea to 'call those you love' as he admits 'I'm having a moment' in emotional post amid his mum's battle with Parkinson's and Alzheimer's\n\nKym Marsh, 48, shows her incredible curves in a black gown as she joins lookalike daughter Emilie, 28, at You're Cordially Invited screening\n\nMillie Mackintosh reveals she forgot about her daughter's first nativity at school and admits she 'dropped the ball' as she opens up on alcohol battle\n\nHollywood intimacy coordinator speaks out on THAT Blake Lively and Justin Baldoni video from It Ends With Us set\n\nCraig Revel Horwood announces Strictly tour show is CANCELLED - leaving thousands of fans gutted as Storm Eowyn batters the UK\n\nPregnant Poppy Delevingne reveals her baby bump for first time as she and billionaire boyfriend Archie Keswick arrive at same bash as ex James Cook and lookalike girlfriend\n\nKaty Perry looks glamorous in a leggy mini dress as she tucks into a giant croissant to celebrate her time in Paris\n\nJeremy Kyle announces new memoir as he promises to dish the dirt on his ITV axing - six years after his controversial show was taken off air\n\nGood Morning Britain fans blast ITV for 'unbelievably dangerous' broadcast as weather reporter 'thrown around by wind' during Storm Eowyn\n\nNot so Frost-y anymore:Sadie and ex Darren Strowger look cosy as they are spotted brushing shoulders at second party of the week\n\nMexican movie Emilia Pérez is slapped with brutal reviews as fans brand it 'the worst film ever' after it dominated Oscar nominations with 13 nods\n\nAndie MacDowell, 66, reveals the REAL reason she moved out of LA to a sleepy southern town\n\nWindswept Coleen Rooney heads to the gym after revealing husband Wayne has taken on a 'new job' following Plymouth Argyle axe\n\nAriana Grande reveals what she did to prepare for her Wicked audition - after actress admitted 'she couldn't stop crying' following Oscar nomination\n\nBombshell claims that threaten Ryan Reynolds' image as 'nicest guy in Hollywood': Justin Baldoni's $400M Blake Lively lawsuit takes aim at her husband\n\nJoan Collins, 91, looks sensational as she relaxes in swimwear alongside husband Percy Gibson, 59, in Cancun\n\nGwendoline Christie rocks trendy oversized shades as she steps out in Paris during Fashion Week\n\nBrooklyn Beckham cuts a suave figure as he enjoys romantic date night with wife Nicola Peltz after spending the day helping victims of LA fires\n\nThe Block billionaire Adrian Portelli breaks his silence on the shock axing of Today show star Alex Cullen - as he extends a surprising lifeline to the sacked TV star\n\nWinterwatch leaves viewers blushing with 'rudest chat ever' as Michaela Strachan and Chris Packham lower the tone with 'pure filth' joke live on air\n\nJamie Foxx SPLITS from girlfriend Alyce Huckstepp after making THAT offensive song about dating white women\n\nAriana Grande celebrates first Oscar nomination in $7,100 party dress in London with Wicked co-star and lover Ethan Slater\n\nFinally over Harry? Olivia Wilde cuddles up to actor Dane Diliegro as she is spotted gazing at him during a basketball game - two years after her split from ex Styles\n\nOscar-nominated movies you can enjoy from the comfort of your sofa! All the 2025 contenders that are already available to stream \n\nLiam Payne honoured with plaque on Celvedon Pier in memory of the singer - and it holds a special link to One Direction\n\nLindy Klim stuns in satin jumpsuit as she steps out solo at Australian Open event after split from her husband of six years Adam Ellis\n\nJesy Nelson happily reveals she's 'gone up to maternity pjs now' while showing off her blossoming baby bump - as she prepares to welcome twins \n\nStrictly's Karen Hauer and Neil Jones leave fans in hysterics as they pose for VERY bizarre snaps amid rivalry during show's live tour\n\nTammy Hembrow puts her wedding rings back on as she and Matt Zukowski prove they are still a happy couple at GUESS event on Gold Coast - after public spat at Australian Open\n\nLottie Moss says she was 'bored' during her time in the Costa Rican jungle on Celebrity Bear Hunt because she had 'no one to talk to'\n\nAlan Carr leaves Amanda Holden wheezing with VERY rude joke about her bedroom antics in first look at new BBC renovation series\n\nBrandi Glanville, 52, shows off her age-defying figure in a bright pink bikini as she shares stunning snaps in LA - after facial disfigurement battle\n\nAwkward photo of Camila Cabello performing in near-empty arena goes viral\n\nKim Kardashian's daughter North West, 11, raps in Japanese for shock feature on FKA Twigs new album\n\nMacaulay Culkin and fiancée Brenda Song look loved up on date night at Lakers-Celtics game in Los Angeles\n\nTasha Ghouri's mum drops a HUGE hint about the reason behind the Strictly star's split from boyfriend Andrew Le Page\n\nEXCLUSIVERICHARD EDEN: My Palace sources reveal what Meghan did BEFORE marriage that they describe as 'punch to the solar plexus'\n\nEXCLUSIVECountry icon, 59, looks unrecognisable and much younger without makeup while on the beach with her husband\n\nKim Kardashian loses 150,000 Instagram followers after sharing photo of Melania Trump's inauguration outfit\n\nKatie Price shares health update after undergoing 'checks on her lungs' over vaping concerns - after sparking concern over dramatic weight loss\n\nSelena Gomez congratulates her Emilia Perez costars on Academy Award nominations after being snubbed\n\nKim Kardashian nearly spills out of plunging lingerie as she models SKIMS Valentine's Day collection\n\nSelling Sunset star Nicole Young reveals if she'll return to show amid bitter Chrishell Stause feud\n\nAngelina Jolie left 'devastated' over Oscars snub for Maria biopic as 'Hollywood is Team Brad Pitt'\n\nALISON BOSHOFF: Will anyone dare throw a party at the most controversial Oscars in years?\n\nPamela Anderson responds to her Oscar snub for The Last Showgirl and insists she 'never expected' a nomination\n\nPrince William shares rare insight into family days out as he reveals the trick George, Charlotte and Louis play on bike rides\n\nThe Traitors: Short-lived villain Freddie is banished after making a HUGE slip-up - but fans spot his 'parting gift' as he exposes Charlotte with final vote\n\nPaul Hogan's wayward son Chance has conversation with a bird during a rare public appearance at screening of his famous dad's film Crocodile Dundee \n\nDemi Moore celebrates first Oscar nomination for The Substance over FaceTime with Gwyneth Paltrow and pals\n\nSpencer Pratt and Heidi Montag sue the city of Los Angeles and the Department of Water and Power after fires destroyed their $2.5M home\n\nKatie Price looks happy and healthy after sparking concern over dramatic weight loss as she jets off to Turkey with boyfriend JJ Slater \n\nTimothee Chalamet joins rare Oscar club as youngest two-time Best Actor nominee since a 1950s Hollywood legend\n\nJournalist says Diddy threatened to see her 'dead in a trunk' over approval of photos for magazine spread\n\nNatalie Wood's drowning may have been caused by an unexpected source according to celebrity coroner\n\nHailey Bieber looks unbothered in new selfies after dropping hint about state of her marriage amid split rumors\n\nKaia Gerber is stylishly casual as she treats herself to a spa day in LA amid Austin Butler breakup\n\nALISON BOSHOFF: Laurence Llewelyn-Bowen is set to get his own fly-on-the-wall show at family mansion\n\nBella Hadid looks sporty chic outside sister Gigi's NYC apartment after their childhood home burned in LA fire\n\nThe Traitors villain Charlotte reveals who inspired THAT fake Welsh accent as she makes it to final five\n\nAmerican supermodel Tyra Banks turns heads in very bizarre all-black ensemble at the Australian Open\n\nHolly Willoughby wows in camouflage shorts while leaning out of helicopter as she reveals the 'chase is on' ahead of new Netflix series Celebrity Bear Hunt\n\nSpencer Pratt admits if he were 'rich' he would NOT put his family on social media but he needs the money\n\nThe Traitors' Alexander admits he 'shut off' after feeling 'overwhelmed' by his brother's death as he joins Leanne, Jake and Frankie and villain Charlotte in the final\n\nLove Island: All Stars fans convinced Ronnie and Harriett 'FAKED' their split so they could reunite in the villa and win the show\n\nAriana Grande stuns in an elegant floral dress as she appears on Graham Norton Show hours after landing her first Oscar nomination for Wicked\n\nScott Mills reveals his 'sadness' at taking over the Radio 2 Breakfast Show from friend Zoe Ball\n\nGardeners World's Monty Don admits he was left 'stark b*****k naked' in hilarious garden blunder\n\nBRIAN VINER reviews The Brutalist: Tipped for an Oscar, this movie is full of grandeur and great acting\n\nKim Zolciak accuses ex Kroy Biermann of stealing over $1,500 of her prescription medication in call to cops after Christmas dispute\n\nThe Traitors reveals shock twist as one player is giving the most valuable power ever seen in the game just one day before the finale\n\nJoJo is nearly unrecognizable after new haircut with wispy bangs as she promotes music in NYC\n\nEmmerdale star Sammy Winward's daughter Mia Dunn claims her footballer dad called her a 'w**re' in OnlyFans feud\n\nJosh Brolin goes on wild rant over Dune 2 Oscars snub as he threatens to QUIT acting\n\nThe Night Agent fans praise the long-awaited second season with some giving it '10/10'\n\nADRIAN THRILLS reviews Teddy Swims: I've Tried Everything But Therapy (Part 2) - Get set for soul man to make a big splash\n\nTV legend's daughter strips down to a racy latex bodysuit for sultry Playboy Magazine cover\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"The Traitors host Claudia Winkleman has revealed that she been inundated with messages about Alexander Dragonetti from her friends.","url":"https://www.dailymail.co.uk/tv/article-14323499/The-Traitors-final-Claudia-Winkleman-messages-Alexander-friends-single.html","image":"https://i.dailymail.co.uk/1s/2025/01/25/00/94494969-0-image-m-36_1737763222545.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/24/7188430342824479003/1024x576_MP4_7188430342824479003.mp4","publish_date":"2025-01-25 00:22:03","author":"Editor,Niomi Harris","authors":["Editor","Niomi Harris"],"language":"en","source_country":"gb","sentiment":0.252},{"id":283655072,"title":"Jim Cramer's week ahead: Fed meeting and Big Tech earnings","text":"CNBC's Jim Cramer said next week as Wall Street launches into earnings season, he'll be following the Federal Reserve's meeting and earnings from a few tech giants. Investors should not to make any major moves, he advised.\n\n\"Look it's a sheer hell week. Our heads will be spinning, swivel-like, lazy Susan even, as each day you can expect a flood of earnings and a sound bite from President Trump that upsets whatever order there might be,\" he said. \"Like I always say, don't try to make decisions during this part of earnings season, just listen.\"\n\nOn Monday, Cramer will review earnings from SoFi and AT&T. Cramer said he expects good numbers from the fintech company, even as the stock has been heavily shorted. AT&T should also do well, he added, judging by decent results from its peer Verizon.\n\nTuesday brings a report from General Motors. Cramer said the company is likely to deliver solid results, the stock may decline because the market is focused on Tesla when it comes to the auto industry. Starbucks also reports on Tuesday, and Cramer said he's optimistic about new CEO Brian Niccol's vision for the coffee chain. Niccol was able to transform Chipotle, and Cramer said Starbucks could be worth buying after the CEO lays out his plan.\n\nWednesday is packed. The Fed will reveal its latest decision on interest rates. Cramer said he doesn't expect a cut when employment seems so strong. T-Mobile and ServiceNow will report their fourth quarter earnings. Cramer anticipates T-Mobile heading higher, while ServiceNow might be a buy if it dips after the release. Tech behemoths Microsoft and Meta are also reporting, and Cramer called both companies' quarters wild cards. Plus, there's Tesla earnings. Cramer noted that even when it missed last quarter, the stock still climbed, so he recommended owning it.\n\nCaterpillar reports on Thursday, and Cramer said the company has managed to lean into secular growth instead of just cyclicality. Apple also reports on Thursday. Cramer acknowledged that Wall Street is expecting a miss, but he said it's still a good stock to own long term. He believes the company will be able to fix any problems it might currently be facing. Intel is set to release earnings as well. Cramer said it needs to raise cash and fix its balance sheet before investors should own the stock.\n\nFinally, Friday has reports from Chevron and Exxon Mobil. Cramer said he doesn't want to own the oil giants because they might ramp up drilling now that President Donald Trump has relaxed federal regulations. \n\nThe Labor Department will also release the personal consumption expenditures price index, an important inflation metric for the Fed, on Friday. \"I think it won't be cool enough. Too much spending for that to happen,\" Cramer said.","summary":"CNBC's Jim Cramer highlighted what he's paying attention to next week as Wall Street launches into earnings season.","url":"https://www.cnbc.com/2025/01/24/jim-cramers-week-ahead-fed-meeting-and-big-tech-earnings.html","image":"https://image.cnbcfm.com/api/v1/image/105444612-1536690347185img_2729rrr.jpg?v=1692053569","video":null,"publish_date":"2025-01-25 00:10:34","author":"Julie Coleman","authors":["Julie Coleman"],"language":"en","source_country":"US","sentiment":-0.276},{"id":283652546,"title":"Britain can learn from Trump’s positivity, says Rachel Reeves","text":"Britain needs to be more positive and showing off its strengths, said Rachel Reeves.\n\nThe chancellor travelled to the World Economic Forum in Davos this week to meet global investors in her latest attempt to boost the UK economy after latest figures showed only slight growth.\n\nRecent rises in borrowing costs threaten Ms Reeves’ economic plans, while leaders in the business sector continue to voice concerns over upcoming tax rises in April from her Autumn Budget.\n\nHowever, on Monday, the International Monetary Fund forecast the UK economy would grow by 1.6 per cent in 2025 after a weaker-than-expected 2024.\n\nAnd speaking to The Times, Ms Reeves said the country needed to be more positive.\n\nShe said: “I’ve been in sales mode this week in Davos. We’re all sick of Britain being in the slow lane, whether it’s British CEOs or British investors, and we want to see a revival of those animal spirits so that we can grow the economy and bring investment here.”\n\nWhen asked if the country could learn from US president Donald Trump, she replied: “Yes, I think we do need more positivity. \n\n“I’ve challenged businesses as well and said no one else is going to speak up for Britain apart from us. It hasn’t been a very British thing to say.\n\n“We are absolutely fantastic as a country, we’ve got four of the best universities in the world. We’ve got some of the most amazing entrepreneurs with fantastic ideas. In all the sectors that are growing globally — AI, tech, clean energy — Britain has got unbelievable strengths in those sectors. We shouldn’t apologise for it and we shouldn’t be all polite about it. We should be shouting from the rooftops.”\n\nBut there are some in the business sector who have continued to put challenges at Ms Reeves’ door.\n\nLast week, the boss of Next said the hike in National Insurance rates for employers in April will make it more difficult for people entering the workforce. On Thursday, Sainsbury’s announced it was cutting 3,000 jobs two months after it said Ms Reeves’ Budget would cost it £140m including higher wages.\n\nThere has also been criticism in the farming industry, where family farm owners are worried over changes to rules on inheritance tax from April next year.\n\nRachel Reeves has defended her decision to raise taxes at the Budget, insisting her plan provided the stability needed to secure growth and fix the nation’s services.\n\nWhen asked if she will reverse the tax rises, Ms Reeves told The Times: “It’s not possible to back down on these things.\n\n“The public finances were an absolute mess. I had to make a number of difficult decisions around welfare, on spending and tax, both in July and in the budget. If I start reversing tax increases, that stability that I’ve returned to the public finances would unravel. \n\n“I know that I will come under pressure from different interest groups. I understand why they make the case that they make. I have a duty to make sure the sums add up.”","summary":"With pressure on Rachel Reeves over the state of the UK economy, the chancellor says she is challenging people to be more positive on the UK’s strengths","url":"https://www.independent.co.uk/news/uk/politics/rachel-reeves-trump-uk-chancellor-b2686094.html","image":"https://static.independent.co.uk/2025/01/25/00/SEI237046142.jpg?width=1200","video":null,"publish_date":"2025-01-25 00:10:21","author":"Helen Corbett","authors":["Helen Corbett"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.134},{"id":283652264,"title":"March for Life 2025 Speakers Praise God’s Gift of Life, Stand Firm for the Unborn","text":"A diverse group of speakers, including activists, politicians and individuals sharing personal stories, fired up the crowd on the rally stage ahead of the 52nd-annual National March for Life in Washington, D.C., on Friday.\n\nThe theme of this year's demonstration, “Life: Why We March,” was highlighted as speakers, many of whom are Catholics, explained the reasons for their pro-life convictions.\n\nOutgoing March for Life President Jeanne Mancini, who has led the organization since 2012, introduced the new March for Life president, Jennie Bradley Lichter. Lichter — a Catholic mother of three, a lawyer and a longtime advocate for the sanctity of life — has been active in the pro-life movement since her childhood. \n\n“You know that the wantedness of a human being doesn’t determine our value. You know that it is right and good to stand up for people who are too small to defend themselves … but lately many of the loudest voices have been shouting the lie that women need access to abortion,” Lichter said. \n\n“I will see you all back here next year and every year until every woman and every baby is loved and protected,” she added.\n\nArchbishop Joseph Naumann of the Archdiocese of Kansas City, Kansas, led the crowds in prayer, praying that the pro-lifers in attendance go out in strength to build the culture of life and asking the Lord to bless them with “the fire of your Holy Spirit” so that they “never tire of the crusade for life whose origin is in you.”\n\nFollowing remarks from Sen. John Thune of North Dakota, Speaker of the House Mike Johnson described himself as a “product of an unplanned teen pregnancy,” the first of his parents’ four children, and gave thanks for the fact that his parents chose life. \n\nJohnson went on to highlight Congress’ work defending fundamental freedoms and the new administration’s pro-life actions, including Trump’s pardoning of pro-life activists and his defining life as beginning at conception. \n\n“America is premised on the self-evident truth that every single person is made in the image of our Creator-God, and thus every single person has inestimable dignity and value,” Johnson said.\n\nSpeaking next, Florida Gov. Ron DeSantis encouraged all present to “show courage in defense of the unborn” and recounted how his state defeated a pro-abortion ballot measure in November despite misleading information from the opposition and an estimated $120 million spent by the pro-abortion side. \n\nWith the ballot measure’s defeat Nov. 5, 2024, Florida became the first state to rebuff a pro-abortion ballot initiative since the overturning of Roe v. Wade, along with Nebraska and South Dakota on the same night.\n\nDeSantis argued that standing for the right to life is not bad politics and that he himself is proof of it, pointing to his victory in Florida after the overturning of Roe v. Wade. DeSantis, who is Catholic, signed legislation in April 2023 to prohibit abortion in Florida once the unborn child’s heartbeat can be detected, which occurs at about six weeks into pregnancy.\n\n“The sanctity of life does not depend on poll results, it doesn’t depend on which way the wind is blowing; it’s an enduring truth, and it represents the foundation of our society,” DeSantis said.\n\nTaking the stage next was Republican Rep. Chris Smith of New Jersey, a longtime Catholic lawmaker whose remarks focused on a recommitment to the defense of the weakest and most vulnerable, specifically unborn children. \n\nWhile praising Trump’s actions to protect the unborn, Smith also highlighted the work of pregnancy-care centers and the Born-Alive Abortion Survivors Protection Act, emphasizing that “pro-lifers are a people of persevering faith in God, willing to bear any burden and endure any attack.”\n\nLila Rose, the president of the pro-life group Live Action, fired up the crowd with infectious energy and reminded them ​​that “abolishing abortion is the most important human-rights cause of our time.”\n\nWhile calling for the defunding of Planned Parenthood in favor of pregnancy-resource centers, she emphasized the importance not just of political action but also the responsibility of every pro-life person to try to win over the hearts and minds of other people, helping them to understand how precious life is. \n\n“My friends, this is half the battle: showing up,” Rose said. \n\n“All of you here, all of you have the power to change minds; at the dinner table, on campuses, at soccer games, you can change minds. You are the voice for those who have no voice. Remember, science is on our side. Natural law is on our side. The truth is on our side.”\n\nDr. Catherine Wheeler, a former abortionist who is now a pro-life obstetrician, spoke about how her own unplanned pregnancy in medical school helped her to slowly understand that, in performing abortions, she was “intentionally [disregarding]” one of her patients, namely the unborn child. Wheeler said she has come to know Jesus’ love and now advocates for the pro-life cause after previously performing abortions. \n\n“Life is an incredible, beautiful miracle, and God’s grace is available for each and every one of us,” she said. \n\nBeverly Jacobson, CEO of Mama Bear Care, spoke about the challenges she and her husband faced when their daughter was diagnosed with Trisomy 18, a chromosomal condition also known as Edwards syndrome. Her experience inspired her to assemble an “army of mama bears” to support women going through similar trials, to help them realize that “their baby bears are gifts from God who deserve to be celebrated.”\n\nJosiah Presley, an adoptee who survived a failed abortion, emphasized that every human life is valuable because all are created in God’s image. Presley, who was born in South Korea, was adopted by a family in Oklahoma after he survived the abortion attempt and now serves as a student minister at North Pointe Baptist Church in Edmond, Oklahoma.\n\n“Today I march because when I was unseen and devalued, God had a different plan,” said Presley, who was born with a deformed arm as a result of the attempted abortion. \n\n“And today we march to declare what our Creator has already declared: that all human life is valuable because it’s created in the image of God.”\n\nKeynote speaker Bethany Hamilton, a professional surfer from Hawaii whose life story was immortalized in the film Soul Surfer, is a Christian mother and a dedicated pro-life advocate. She spoke about how she struggled feeling like she couldn’t become a mom, admitting that no one, even people with deep pro-life convictions, is “above” the struggle that comes when the difficult choice to choose life presents itself. \n\nAt the same time, she said, many women are being fed “lies” that they can’t or shouldn’t keep their babies. She emphasized the need for hope and support for women facing unplanned pregnancies and called for men to support women and help combat the lies being told about the value of life. \n\n“Children are true wealth, and they are truly the greatest blessing God has to offer us,” Hamilton said. \n\nFollowing those speeches, President Donald Trump delivered a prerecorded video message to the March for Life, where he promised to end the “weaponization” of law enforcement against pro-life Americans, highlighting his recent pardoning of 23 pro-life activists who had been imprisoned under the Biden administration and adding that under his leadership a reformed Department of Justice would investigate attacks on churches and pregnancy centers.\n\nTrump stated that his administration will stand for families and for life, and he praised the marchers for their dedication to creating a society that protects every child as a gift from God. \n\nRounding out the keynote speeches was Vice President JD Vance, who, appearing in person, emphasized his pro-life convictions as a Catholic father and stated that the Trump administration would continue to uphold pro-life policies. \n\nHe expressed his desire for a society that is pro-family, stating that the true measure of national success is how easy it is to raise a family. To that end, Vance discussed the Trump administration’s proposal to increase the child tax credit and support for the Born-Alive Abortion Survivors Act. \n\n“Let me say very simply: I want more babies in the United States of America,” Vance said to loud cheers.\n\n“I want more happy children in our country. And I want beautiful young men and women who are eager to welcome them into the world and eager to raise them. And it is the task of our government to make it easier for young moms and dads to afford to have kids, to bring them into the world, and to welcome them as the blessings that we know they are here at the March for Life.”\n\nWATCH VIA EWTN","summary":"cna","url":"https://www.ncregister.com/cna/march-for-life-2025-speakers","image":"https://publisher-ncreg.s3.us-east-2.amazonaws.com/pb-ncregister/swp/hv9hms/media/20250124170116_0899ab0ec3d3d68fc9adff74eb93bd8688c377e72e18a0b6f12b033be9e96fc9.png","video":null,"publish_date":"2025-01-25 00:09:25","author":"Jonah McKeown/cna","authors":["Jonah McKeown/cna"],"language":"en","source_country":"US","sentiment":0.052},{"id":283652550,"title":"Trump and Newsom put tensions aside as president arrives in LA to survey extensive wildfires damage","text":"Donald Trump and Gavin Newsom put on a united front on the tarmac of Los Angeles International Airport on Friday, as the president arrived in California for a visit to survey the devastation caused by the wildfires.\n\nDespite previous online acrimony between the men, the California governor smiled as he shook hands with Trump and proceeded to give the First Lady a kiss on the cheek.\n\nIn short remarks to the press at LAX, the president thanked Newsom for meeting him off the plane and promised to do everything he could to get the problems “permanently fixed.”\n\n“I appreciate the governor coming out… we’ll be talking a lot and we want to get it fixed,” he said.\n\nThe surprisingly pleasant exchange comes just hours after Trump appeared to snub Newsom by not including him on his official schedule during the trip, despite arranging a meeting with LA mayor Karen Bass while in the city.\n\nNewsom fulfilled his promise to wait for the president on the tarmac. Speaking to reporters alongside the Governor, Trump remarked that Los Angeles looked “like you got hit by a bomb.”\n\n\"Thank you for being here, it means a great deal a lot to all of us... we’re gonna need your support, we’re gonna need your help,” Newsom replied.\n\n“You were there for us in Covid, I don’t forget that and I have all the expectations that we’ll be able to work together to make this speedy recovery.”\n\n\"We’re gonna get it done,” Trump said. “A tremendous number of lives have been affected and a lot of real estate has been affected… nobody has probably ever seen anything like, you can almost probably say since before the second world war if you think about it.\n\n“We’ll get it permanently fixed so it won’t happen again.\"\n\nTrump and Newsom have a long history of sparring online, with the president consistently referring to the governor as “Gavin Newscum.”\n\nThe president has continued to blame Newsom for the fires in recent weeks, claiming they “could have been put out if they let the water flow but they didn’t let the water flow and they still haven’t, for whatever reason.”","summary":"Despite previous online acrimony between the men, the California governor smiled as he shook hands with Trump","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-wildfires-newsom-damage-california-b2686104.html","image":"https://static.independent.co.uk/2025/01/24/23/GettyImages-2195133939.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/1Q765cpL-4VHSaSK0.mp4","publish_date":"2025-01-25 00:04:58","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","category":"politics","source_country":"gb","sentiment":0.025},{"id":283651652,"title":"Jewel defends RFK Jr. MAHA ball performance, says Trump administration willing to help on mental health crisis","text":"Jewel is defending herself after fans voiced their disappointment over her decision to perform at the MAHA Inaugural Ball for Robert F. Kennedy, Jr. Following her surprise performance of \"Somewhere Over the Rainbow\" for Kennedy and his wife, actress Cheryl Hines, at the ball, many fans took to the comments section of her recent Instagram posts to share that they were upset with her decision to perform at the ball. \"Incredibly disappointed. Jewel is MAGA. Unfollow,\" one fan wrote in the comments section of a post shared by the singer-songwriter on Monday. \"You are a huge disappointment. I was a fan for decades but now will never listen to your music again or pay any money to see you perform live,\" another follower added. In a video posted to her Instagram on Friday, the 50-year-old shared her reasons for choosing to perform at the ball. JEWEL'S ADVICE ON OVERCOMING HEARTBREAK, HARDSHIPS: 'IT'S WHAT WE DO WITH THE PIECES’ \"As many of you know, I am a mental health advocate. If there’s anything that I’ve learned in the past 20 years, it’s that mental health affects everybody’s lives across party lines,\" Jewel said at the start of the video. \"I reached out to the last administration, spoke with the surgeon general about the mental health crisis that’s facing our nation. I don’t know if you guys know the stats, but it is bleak.\" The performer went on to say that she believes there are many things we as a society can do to help, adding, \"I believe I can help, and if I believe I can help, I have to try.\" Jewel has been very vocal about her passion for increasing awareness surrounding the mental health crisis among children and adults in the country and working towards making mental health resources available to everyone who needs them. View this post on Instagram A post shared by Jewel (@jewel) APP USERS CLICK HERE FOR POST Her passion led her to become the co-founder of the Inspiring Children Foundation, a non-profit which helps children at-risk in Las Vegas. Jewel also co-founded Innerworld, a virtual reality-based free wellness center which offers mental health tools. \"If I wait to try until I agree 100% with the people that might be willing to help me, I’d never get off the bench. I don’t think that’s how activism works, waiting until everything’s perfect enough to participate,\" she continued in her video to her fans. \"It’s actually because things are so imperfect that we have to find ways to engage and to participate. And we have to act now. We cannot wait another four years.\" Jewel echoed this sentiment in the caption of her post, where she explained that \"we need people from all walks of life\" to work together when it comes to advocating for a greater emphasis on \"mental health and other critical issues, so we can find a way forward together.\" While Jewel admits she does \"not agree on all the politics,\" she thinks there are those in the new Trump administration who \"are willing to help on this issue.\" \"If I wait to try until I agree 100% with the people that might be willing to help me, I’d never get off the bench. I don’t think that’s how activism works, waiting until everything’s perfect enough to participate.\" \"If I can help shape policy, make sure mental health is in the conversation… If I can help put resources or mental health tools into the hands of the most vulnerable who need it, I’m going to try and I’m going to fight,\" she said. \"And I understand that my words were overly simplistic. Half of our country feels hope right now, and I honor that. And half of our country feels disenfranchised and scared and vulnerable, and that is unacceptable.\" Later in the video, the Grammy-nominated artist apologized to her fans for any pain she may have caused them by performing at the ball, addressing her LGBTQIA fans specifically, telling them that \"you've made my life a better place.\" LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS Jewel further noted that she will \"never stop fighting\" and thinks that \"having hard conversations\" is the only way to create change. She said she hopes that someday \"we can push through our hurt and move toward understanding on both sides.\" \"I want to be a ray of light in this world. I try hard to be a ray of light in your lives,\" Jewel said. \"I know that in times of darkness we must grow light, and so I will wake up again tomorrow and try again. And I will count on each of you to do the same.\" WATCH: JEWEL PERFORMS AT MAHA INAUGURAL BALL ON PRESIDENT DONALD TRUMP'S INAUGURATION CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER House Inhabit founder Jessica Kraus told Fox News Digital that Jewel's performance ewas a surprise to everyone at the ball, including Hines, who became visibly emotional during the song and was seen wiping away a tear from her eye. Hines shared pictures from the evening in an Instagram post on Wednesday. In the series of photos, the \"Curb Your Enthusiasm\" actress can be seen posing alongside her husband in a stunning one-shoulder Romona Kaveza gown and greeting guests. \"Oh what a night! The MAHA ball in DC was sooooo fun!\" the actress captioned the post, also thanking and giving credit to the designers and stylists who contributed to her look. CLICK HERE TO GET THE FOX NEWS APP","summary":"Jewel is responding to comments from her fans who were &quot;disappointed&quot; in her decision to perform at the MAHA Inaugural Ball, explaining she is willing to work with the administration on mental health issues.","url":"https://www.foxnews.com/entertainment/jewel-defends-rfk-jr-maha-ball-performance-trump-administration-willing-mental-health-crisis","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/05/931/523/jewel-50.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-25 00:04:07","author":"Lori Bashian","authors":["Lori Bashian"],"language":"en","category":"politics","source_country":"us","sentiment":0.219},{"id":283652766,"title":"Trump presses pause on parts of the federal goverment","text":"President Donald Trump in his first week in office slowed down parts of the U.S. government in a quest to assert broad control, as heads of federal agencies turned his executive orders into mandates, cutting communication with outside parties, largely halting foreign aid and pausing legal filings.\n\nThe Environmental Protection Agency and the departments of Energy, Defense and Health and Human Services abruptly stopped most external communication. The Justice Department’s Environmental and Natural Resources Division ordered attorneys not to file any new complaints. And the U.S. Agency for International Development on Friday issued an order to stop most foreign aid spending.","summary":"Heads of federal agencies turned Trump’s executive orders into mandates to cut communication with outside parties, halt most foreign aid, and pause legal filings.","url":"https://www.washingtonpost.com/politics/2025/01/24/trump-slows-federal-government/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/75JVCBEDF35U5LWMSNVTQRS6AE.jpg&w=1440","video":null,"publish_date":"2025-01-25 00:03:32","author":"Emily Davies,Maxine Joselow","authors":["Emily Davies","Maxine Joselow"],"language":"en","category":"politics","source_country":"us","sentiment":-0.584},{"id":283650262,"title":"President Trump and Gov. Newsom shake hands, promise to work together on wildfire relief","text":"President Donald Trump and Gov. Gavin Newsom traded their war of words for a few handshakes Friday afternoon.\n\nThe two leaders, both vociferous critics of each other, met on the tarmac at LAX around 3 p.m. Friday as Trump touched down to survey the catastrophic damage caused by the spate of wildfires in Southern California this year.\n\nNewsom, dressed in a casual button-up, was the first to greet a black MAGA hat-wearing Trump as he descended the stairs from this plane. The two clasped hands and exchanged some words — there were no microphones but Newsom often gesticulated at the president — before they and first lady Melania Trump walked over to where reporters and cameras waited.\n\nTrump and Newsom, at least in front of the cameras, were cordial.\n\nTrump didn’t refer to the governor as “Newscum” as he is wont to do on social media. And Newsom didn’t call the president an “idiot” as he has done in the past.\n\n“I appreciate the governor coming out and meeting me,” Trump said, reaching for another handshake. “We’ll be talking in a little bit. We want to get it fixed.”\n\n“Thank you for being here,” Newsom said. “It means a great deal to all of us, not just the folks in the Palisades (but also) the folks in Altadena that were devastated. We’re going to need your support; we’re going to need your help.”\n\n“You were there for us during COVID, I don’t forget that, and I have all the expectations that we’re going to work together to get this speedy recovery,” the governor continued.\n\nEarlier Friday, when Trump was still in western North Carolina, where he stopped first to survey recovery efforts from last year’s Hurricane Helene, the president suggested tying future federal relief aid for California to a voter ID law and changes to water management.\n\n“I want to see two things in Los Angeles. Voter ID, so that the people have a chance to vote, and I want to see the water be released and come down into Los Angeles and throughout the state,” Trump said then.\n\nTrump has long slammed states that don’t have voter ID, a requirement or request during voting that one proves their identity with specific forms of identification. While California does not require such identification, some first-time voters may be asked to show a form of ID when at the polls.\n\nWhen asked about it on the tarmac Friday, Newsom said, “I have all the confidence in the world we’ll work that out.”\n\nTrump, in his brief remarks, compared the devastation that he had yet to see firsthand to a “bomb going off” and World War II. He promised to work with Newsom to get a more “permanent fix” in place to prevent future catastrophic destruction.\n\n“We’re looking to get something completed, and the way you get it completed is to work together,” Trump said. “He’s the governor of this state, and we’re going to get it completed.”\n\n“They’re going to need a lot of federal help — unless you don’t need any,” Trump quipped.\n\n“We’re going to need a lot of federal help,” said Newsom, patting Trump’s shoulder.\n\nThe three — Trump, Newsom and the first lady, who, clad in a khaki jacket, plain dark cap and aviator-style sunglasses, did not speak — walked toward the helicopter.\n\nThe exchange was incredibly cordial, considering the animosity the two men spew at each other, even in the days leading up to the trip. Newsom and Trump have locked horns over how disaster relief, including how the state’s water resources should be allocated.\n\nNewsom had invited Trump, ahead of his inauguration, to come to California to see the destruction, meet with families and thank first responders and firefighters.\n\n“Hundreds of thousands of Americans — displaced from their homes and fearful for the future — deserve to see all of us working in their best interests to ensure a fast recovery and rebuild,” Newsom said in a Jan. 10 letter.\n\nOn Thursday, the governor said he had not been in contact with the White House but planned to be at LAX to welcome the president anyway. By Friday morning, an aide for the governor said Newsom planned to greet Trump, a meeting that was “in coordination with the White House.”\n\nIt’s a balancing act for Newsom, for sure.\n\nOn the one hand, the California Legislature is in the midst of a special session called by the governor to “Trump-proof” the state.\n\n“We will work with the incoming administration, and we want President Trump to succeed in serving all Americans,” Newsom has said. “But when there is overreach, when lives are threatened, when rights and freedoms are targeted, we will take action.”\n\nBut on the other, Newsom knows California desperately needs federal aid — aid that Trump and House Speaker Mike Johnson, a Louisiana Republican, have threatened to withhold or tie conditions to. Newsom was one of only a handful of Democratic governors to order flags to be raised on Monday, Trump’s Inauguration Day. They had been lowered in honor of the late President Jimmy Carter, who died on Dec. 29.\n\nThis was reportedly the first time the two leaders have spoken since Trump left the White House in 2020.\n\nAhead of the airport assemblage, Newsom met with firefighters from CAL FIRE and the Pasadena Fire Department.","summary":"Trump and Newsom set aside their usual bitterness and say they will figure out how to work together on the region's recovery.","url":"https://www.ocregister.com/2025/01/24/president-trump-and-gov-newsom-shake-hands-promise-to-work-together-on-wildfire-relief/","image":"https://www.ocregister.com/wp-content/uploads/2025/01/LDN-L-FIRE-TRUMP-VISIT-0125-15.jpg?w=1024&h=684","video":null,"publish_date":"2025-01-25 00:02:04","author":"Kaitlyn Schallhorn","authors":["Kaitlyn Schallhorn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.172},{"id":283658362,"title":"‘Collaboration and coordination’ with Trump: Friday’s mañanera recapped","text":"United States President Donald Trump and his political agenda continued to be the focus of reporters’ questions for President Claudia Sheinbaum at her Friday morning press conference.\n\nSheinbaum also responded to a question about an apparently baseless accusation that Elon Musk amplified by sharing it with his 214 million followers on X, the social media platform he owns.\n\nLawyers studying potential impact of terrorist designation for cartels \n\nSheinbaum noted that Trump’s executive order on the designation of cartels as foreign terrorist organizations “establishes a period for analysis” about whether in fact criminal organizations — and which — should be designated as such.\n\n“In the case of a … [cartel] being defined as a terrorist organization, what would be the consequences of this definition? We have a team of lawyers doing an analysis on the different implications that might have,” she said.\n\nSheinbaum stressed that her government is already “combating” cartels, and reiterated that what Mexico wants is security “collaboration and coordination” with the United States.\n\n“Unilateral decisions don’t help, what helps is collaboration,” she said.\n\nAfter Trump declared last month that he would designate Mexican cartels as foreign terrorist organizations, Sheinbaum said that Mexico would never accept any interventionist actions, such as the use of the U.S. military on Mexican soil.\n\nNo trade war on the horizon, says Sheinbaum \n\nA reporter noted that World Trade Organization Director-General Ngozi Okonjo-Iweala said Thursday that tit-for-tat trade wars triggered by tariffs Trump has threatened to impose on exports from various countries including Mexico would have a “catastrophic” impact on global economic growth.\n\n“I don’t see a trade war,” Sheinbaum said, even though she indicated late last year that if Trump imposed a 25% tariff on Mexican exports — as he has pledged to do — Mexico would place a reciprocal tariff on U.S. exports.\n\n“Yesterday he spoke in a different way about Mexico,” she said, referring to Trump’s remarks via video-link to the World Economic Forum’s annual meeting in Davos, Switzerland.\n\nResponding to questions after his address, the United States president said that the U.S. is “dealing with Mexico, I think, very well.”\n\n“… We just want to be treated fairly with other nations,” said Trump, who has railed against the large trade deficit the United States has with Mexico.\n\nSheinbaum asserted that Trump uses tariffs (or threatens to use tariffs) for economic reasons and as a negotiating tool — as appeared to be the case in 2019 when he threatened to impose a 5% blanket tariff on Mexican exports to pressure the Mexican government to do more to stem illegal immigration to the United States.\n\nThe U.S. president said Monday that his administration could impose a 25% tariff on Mexican and Canadian exports to the United States on Feb. 1 because Mexico and Canada are allowing “vast numbers of people” and fentanyl to enter the U.S.\n\nTrump previously said that the tariffs would remain in effect “until such time as Drugs, in particular Fentanyl, and all Illegal Aliens stop this Invasion of our Country!”\n\nSheinbaum: Carlos Slim not under investigation for cartel links \n\nA reporter highlighted that Elon Musk shared a post on X that accused Mexico’s richest person, Carlos Slim, of having “significant ties” to Mexican drug cartels.\n\nMusk, the owner of X, Tesla and other companies, shared a post from the Wall Street Mav account. The post said that Slim “is a Mexican billionaire worth over $70 billion” and erroneously claimed that he is “the largest shareholder in publicly traded shares of The New York Times.” (He previously was.)\n\n“He also is known to have significant ties to the drug cartels in Mexico. You don’t become a billionaire in Mexico without being part of the network that is controlled and protected,” the post said.\n\nSheinbaum flatly dismissed the accusation.\n\n“First, it’s false. There is no investigation against the businessman Carlos Slim or his companies. So where do they get that from?” she said.\n\n“Second, Mexico is a magnificent country and we’re not going to allow it to be labeled or associated with drug trafficking, as they’ve done in a lot of the [television] series,” Sheinbaum said.","summary":"When asked about Trump, the president pivoted to her government's plans to prepare and work together with the U.S.\n\n\nThe post &#8216;Collaboration and coordination&#8217; with Trump: Friday&#8217;s mañanera recapped appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/politics/sheinbaum-collaboration-trump-friday-mananera-recap/","image":"https://mexiconewsdaily.com/wp-content/uploads/2025/01/sheinbaum-6.jpg","video":null,"publish_date":"2025-01-25 00:01:12","author":"MND Staff","authors":["MND Staff"],"language":"en","source_country":"mx","sentiment":0.142},{"id":283655780,"title":"Trump tells Canadians why they should want to be the 51st state as he doubles down on expanding the U.S.","text":"Trump tells Canadians why they should want to be the 51st state as he doubles down on expanding the U.S.\n\nREAD MORE: Sign up for DailyMail.com's daily political email \n\nBy GEOFF EARLE, DEPUTY U.S. POLITICAL EDITOR\n\nPublished: 23:59 GMT, 24 January 2025 | Updated: 00:00 GMT, 25 January 2025\n\nPresident Donald Trump returned again to talking about absorbing Canada into the U.S., this time trying out arguments that might persuade citizens north of the border and telling them they'd get better health care and lower taxes.\n\nTrump went on the Canada trek when asked about when tariffs are coming, on a day he toured storm damage in North Carolina and fire damage in Los Angeles. He had threatened to slap tariffs on Canada, Europe, China, and Russia, raising new threats in video remarks to the Davos conference.\n\nTrump didn’t respond directly, but told reporters they are ‘going to make our country rich and you’re going to be a rich, rich country very soon.’\n\nHe allowed that trade imbalances could impact which nations get tariffed, but said inaccurately that ‘we lose $200 billion to Canada every year.’ The trade deficit with Canada is expected to be $45 billion for 2024.\n\nTrump sometimes puts it as high as $250 billion. \n\n‘That's because we allow them to make cars. We allow them to take lumber. We don't need their cars. We don't need their lumber. We don't need their food products because we make the same products right on the other side of the border. It's sort of crazy,’ Trump said.\n\nU.S. manufacturers including General Motors have plans north of the Canadian border, and the two countries are top trading partners.\n\nPresident Donald Trump speaks as he meets with homeowners affected by Hurricane Helene in Swannanoa, N.C., Friday, Jan. 24, 2025. He said Canadians would get a 'tremendous tax cut' if they became a U.S. state\n\nThen Trump returned to his call to make Canada a U.S. state, saying the norther neighbors would get a tax cut and better health coverage. \n\nCanada has a universal health care system that the government pays for. The U.S. has a private-based system that leaves an estimated 26 million uninsured.\n\n‘I would love to see Canada be the 51st state. The Canadian citizens, if that happened, would get a very big tax cut, tremendous tax cut, because they're very highly taxed,' Trump said.\n\nTrump warns 'hardened criminal' migrants they'll be rounded up first\n\nThen he returned to an earlier theme, talking about the security umbrella that the U.S. provides. \n\n'And you wouldn't have to worry about military, you wouldn't have to worry about many of the things. You'd have better health coverage. You'd have much better health coverage. So I think the people of Canada would like it, you know, if it's explained,’ Trump said.\n\nCanadian officials including outgoing PM Justin Trudeau have rejected Trump's idea. \n\nBut his administration has continued to carry out his other proposals signalling U.S. domination.\n\nThe Interior Department announced in a statement Friday that the highest peak in North America will once again be designated Mount McKinley to honor ‘American greatness.'\n\nThe Gulf of Mexico will now be officially called the ‘Gulf of America’, despite the Mexican government ridiculing President Trump’s earlier pronouncements on it. \n\nIf Trump were to slap big tariffs onto Canada and Mexico, it could throw both economies into recession, some economists are warning. \n\nBut making Canada a U.S. state could actually cost Trump by adding likely Democratic Senate seats and padding the House with liberal members. Republicans hold a narrow majority and get boosts from political gerrymandering. \n\nA poll by J.L. Partners shows deep U.S. reservations about the idea. \n\nTrump this week once again referred to Prime Minister Justin Trudeau as 'governor Trudeau' even though he announced he will resign when a new leader is chosen. \n\nCanadaPolitics\n\nShare or comment on this article:\nTrump tells Canadians why they should want to be the 51st state as he doubles down on expanding the U.S.\n\nAdd comment","summary":"The president wouldn't specify when he might slap tariffs on Canada, but he said Canadians would get a 'tremendous' tax cut if they joined the U.S. and would get 'better health coverage.'","url":"https://www.dailymail.co.uk/news/article-14323459/trump-tells-canadians-51st-state-doubles-expanding-us.html","image":"https://i.dailymail.co.uk/1s/2025/01/24/23/94494757-0-image-a-9_1737762122682.jpg","video":null,"publish_date":"2025-01-25 00:00:53","author":"Editor,Geoff Earle","authors":["Editor","Geoff Earle"],"language":"en","source_country":"gb","sentiment":0.012},{"id":283654568,"title":"Military Effort to Scrub Diversity Programs Leads to Dead Websites and Confusion","text":"\"Content not found.\" That was the message Friday on the webpage for the Marine Corps' Culture and Inclusion Branch located in Quantico, Virginia.\n\nThe branch's page previously featured messages such as \"treating each Marine, despite diverse backgrounds, with care and respect are fundamental to cohesion.\" But it was apparently pulled down this week as part of the military's frantic rush to scrub programs and policies that advocate for women, people from racial minority groups and LGBTQ+ troops.\n\nThe Army, Navy, Marine Corps, Air Force and Space Force -- as well as the Department of Veterans Affairs -- were all working this week to comply with President Donald Trump's order Monday to end all federal equality and diversity efforts. But the hurry to eliminate the various programs and policies across the military led to a confusing landscape where seemingly unrelated policies were canceled and it was unclear what programs were still in effect.\n\nRead Next: Inside the Military's Scramble to Move Troops to the Mexico Border\n\nNo service had come forward by Friday with a comprehensive list of what programs and policies have been affected by the order.\n\nThe military has worked for years to improve the service experience for women and people with minority backgrounds -- and most recently, gay and transgender troops -- as the national recruiting pool and general population have become more diverse. But those efforts became a political lightning rod amid attacks by Republicans claiming such \"woke\" policies have weakened the military. After being sworn in Monday, Trump carried out a promise to gut the programs across the federal government, including the military.\n\nThe service branches' communications to the rank and file and public about Trump's order were mixed. The Army and Marine Corps transmitted public messages that served as official guidance to their troops, while the Navy did not. The Air Force and Space Force also do not appear to have offered official guidance, issuing two memos primarily on their service websites.\n\nThose messages echoed memos sent across all federal agencies: All diversity efforts would be shuttered and recipients should report efforts to disguise or obscure such programs. They warned of potential punishment if the attempts were not reported within 10 days.\n\nThey also ordered the removal of websites and documents from public view, as well as the elimination of groups and teams that were working on efforts like improving quality of life for women and minorities.\n\nOn Wednesday, the Army's acting civilian leader issued a memo that called for the service to take down all \"outward-facing media\" that dealt with diversity and inclusion and cancel all related training immediately.\n\nThe next day, the Army removed its sexual harassment and assault prevention policy from the website that houses service rules, meaning the policy was unavailable to be referenced by soldiers and commanders. The regulation governs how to properly document incidents and best practices for victim protection. The service's regulation on command policy, which outlines the expectations of commanders, was also taken down.\n\nWhen Military.com inquired about the removal, several Army officials said that the policies were taken down as part of the Army's scrub of anything that might be \"DEI related.\"\n\nThey were restored several hours after the inquiry was made.\n\nMeanwhile, on Thursday, a Navy official told Military.com that, while the sea service was complying with the order, it didn't have much in the way of public-facing materials to remove owing to the last several congressional policy bills that clamped down on diversity programs across the military.\n\nYet on Friday, a Navy memo was posted to social media from Vice Adm. Nancy Lacore -- the head of the Navy Reserve -- announcing she was canceling six reserve force policies, including those on anti-harassment, fraternization, and safety and occupational health.\n\nThe other three included a diversity policy, an equal employment opportunity policy, and a military equal opportunity policy.\n\nWhen asked about the document, which went out Thursday, the same Navy official confirmed that the memo was real but stressed that the referenced policies were being \"updated to ensure compliance with all directives outlined in executive orders issued by the president.\"\n\nThe Navy official said the service was not ready to formally say whether any civilian employees were placed on leave as a result of Trump's orders. The Army did not comment in time for publication.\n\nThe effect of Trump's order on the Marine Corps also appears to be a series of downed websites that leave questions as to whether those programs are still in effect.\n\nThe moves by the service, including the removal of the Culture and Inclusion Branch webpage, seem to contradict assurances from the Marine Corps' top officer that the branch had no programs that would be scaled back by the new administration.\n\nMilitary.com asked about the status of those who worked in that branch office on Friday. But the service directed the publication to a statement from the Office of the Secretary of Defense, which reiterated the effort to comply with the president's executive orders.\n\nWeb links to other Marine Corps initiatives, such as the Diversity AIMED program, which sought to recruit \"historically underrepresented populations\" into the reserves, also seemed to have disappeared on Thursday. The service did not say when asked whether that program had been canceled.\n\nBetween 2010 and 2020, diversity for enlisted Marines and officers surged, according to a Marine Corps Times article from 2022, which also cited service officials touting the Diversity AIMED program launched that year. As recently as October, the Marine Corps' recruiting command said that \"diversity officer accessions accounted for 35% of all officer accessions\" in 2024, though the command described that population as men and women who bring a \"diversity of background, culture and skill,\" a spokesperson said at the time.\n\nGen. Eric Smith, the service's top military official, rebuffed the idea that the Marine Corps had any diversity, equity and inclusion programs, or DEI -- the term used by the Trump administration -- when asked by reporters at an event last week.\n\n\"As far as DEI, the Marine Corps has not had DEI programs,\" Smith said, citing examples of women who have taken jobs as artillery officers, pilots and astronauts and met the physical and academic standards set out by the service to do so.\n\n\"We don't do DEI in the Marine Corps; we never have. We're a meritocracy-based organization. We always have been,\" he said. \"If you want to apply for a [military occupational specialty], strap on your pack, grab your rifle, and make a run at it.\"\n\nWhen asked whether the commandant had anything to add to his previous statement or in relation to programs now being shut down by the Marine Corps, a spokesperson told Military.com he did not have any further comments.\n\nThe president's order had a more clear and immediate effect on the Air Force and Space Force.\n\nMilitary.com reported Wednesday that Acting Air Force Secretary Gary Ashworth had issued a memo saying all of the Air Force and Space Force's Barrier Analysis Working Groups -- which fought for more progressive policies for women, LGBTQ+ and minority airmen and Guardians -- were being discontinued immediately.\n\nMany of the social media pages for those groups began to disappear or be renamed shortly after that order was made. Some of the website pages for the Department of the Air Force's diversity efforts were no longer loading on Friday or could not be located online, including details about the Air Force Academy's Diversity and Inclusion minor or Air Combat Command's Organizational Culture Office.\n\nTwo memos were posted publicly to the Air Force and Space Force websites: the memo ending the diverse working groups and another asking personnel to \"remove all outward-facing media (websites, social media accounts, etc.) of Diversity, Equity, Inclusion, and Accessibility (DEIA) offices\" as well as \"withdraw any final or pending documents, directives, orders, materials and equity plans\" related to Trump's order.\n\nThat memo also ordered the services to cancel any \"DEIA-related training and terminate any DEIA-related contract.\" The scope of training and policies that may be caught in those orders was still unclear.\n\nAs the military worked to adhere with mixed results, the Department of Veterans Affairs was one of the more aggressive agencies in not only carrying out Trump's order but also being more transparent than most in communicating its effects.\n\nActing VA Secretary Todd Hunter issued a memo announcing the department would close all diversity offices and cancel diversity-related contracts.\n\n\"These programs divided Americans by race, wasted taxpayer dollars, and resulted in shameful discrimination,\" Hunter wrote in the memo.\n\nIn addition to deleting websites, the agency also shuttered all offices focused on diversity initiatives and placed 60 employees whose jobs were solely created to support diversity activities on paid administrative leave, according to VA spokeswoman Morgan Ackley.\n\nAir Force Groups that Advocated for Beard Policies, Better Body Armor Are Gutted by Trump Directive","summary":"The Army, Navy, Marine Corps, Air Force and Space Force -- as well as the Department of Veterans Affairs -- were all working this week to comply with President Donald Trump's order Monday to end all federal equality and diversity efforts.","url":"https://www.military.com/daily-news/2025/01/24/military-effort-scrub-diversity-programs-leads-dead-websites-and-confusion.html","image":"https://images04.military.com/sites/default/files/styles/full/public/2025-01/mil-all-female%20marksmanship-smee-1800.jpg","video":null,"publish_date":"2025-01-25 00:00:38","author":"Konstantin Toropin,Patricia Kime,Steve Beynon,Thomas Novelly","authors":["Konstantin Toropin","Patricia Kime","Steve Beynon","Thomas Novelly"],"language":"en","category":"politics","source_country":"us","sentiment":-0.268},{"id":283651768,"title":"Knoxville Mayor and WWE Hall-of-Famer Glenn Jacobs: I Would “Certainly” Support Sen. Blackburn if She Runs for TN Governor","text":"Today on the Guy Benson Show, guest host Todd Piro was joined by Knoxville Mayor and WWE hall-of-fame wrester Glenn Jacobs (a.k.a. Kane). Jacobs and Piro discussed his journey from the wrestling ring into the lions den of politics. Jacobs discussed his story and why he thinks that America is much better off and feels more hopeful under President Trump. Jacobs also detailed his experience at Trump’s inauguration and showed his support for Tennessee Senator Marsha Blackburn in a potential bid for Tennessee governor. Listen to the full interview below!\n\nListen to the full interview:\n\nListen to the full podcast:\n\nRead the full (automated) interview below:\n\nTodd Piro: His name is Glenn Thomas Jacobs. A pretty, pretty American name, right? Well, you may know by a different name. If you are one of my fraternity brothers from the late 90s, early 2000s, they are Dartmouth College, New Hampshire. You know him as WWE Hall of Famer Kane. He’s also the mayor of Knox County. Since the year 2018. Mr. Jacobs Excuse me. Mayor Jacobs, great to have you on The Guy Benson Show. How are you, sir?\n\nGlenn Jacobs (aka Kane): I’m doing great. Thanks for having me, Todd.\n\nTodd Piro: You’re seven feet tall, is that correct?\n\nGlenn Jacobs (aka Kane): Well, I’m actually about six eight in wrestling boots. I was a little taller, but I’m pretty tall, dude.\n\nTodd Piro: There you go. Nonetheless. Yeah. Six, eight, seven. I mean, we’re. We’re picking nits here. But, you know, I’ve seen you a lot on the channel recently. Haven’t had an opportunity to interview you on my program on the TV, so we’ll do it here on radio. And you have an absolutely fascinating story because, again, I’m not going to sit here and be a poser and say I’m a big WWF, WWE guy, although I do live right down the street from the headquarters in Stamford, Connecticut. But but I did, you know, grow up at a time, especially in my fraternity days, where my brothers used to gather around the TV. I mean, these are Ivy League educated cats, right? And they would sit there and they would watch you. They would watch Stone cold. They would watch all these guys and get into it. It shaped a generation. And now you’re trying to shape a generation as a politician. So how did you make that transition?\n\nGlenn Jacobs (aka Kane): First, you went to Dartmouth, right? Yes, sir, I heard. Yeah. Yeah. My niece actually went to Dartmouth for medical school. She’s not orthopedic surgeon, so she’s really smart. I like to say it’s a good it’s a good school. But yes, for me, the reason I got to politics, it wasn’t like a particular issue or anything like that. I had a fantastic life, great product, The American Dream. I grew up on a small farm in Missouri. My family is great. My mom and dad are hardworking folks, but we didn’t have a whole lot. We weren’t poor. And of course, that’s something to eat and a roof over our head. But nevertheless, that was about it. And from there, I mean, I was able to find something I was good at. Professional wrestling, of all things. Travel the world or fame. People provide a life for my family that I wouldn’t have thought possible. And I think that story is only possible in America. And all too often we take that for granted. I mean, I’ve traveled the world. I’ve seen other places. To me, this is far and above a superior place to live. You know, it’s the legacy in our country of, you know, just freedom and justice for all. That’s a real thing for us. Right. And I just wanted to do what I could to ensure that that go on for my grandkids and my kids. Like President Reagan said, the freedoms never more than a generation away from extinction. And I think that more people and a lot of people are standing up for more people need to stand up and ensure that we’re not the generation allows that to happen.\n\nTodd Piro: You mentioned Reagan. We’re in the era of Trump, and I’m looking at your story. All individuals who didn’t start out as politicians, they came from something else. And in many respects, all three of you came from the entertainment business to varying degrees. But the focus really isn’t on entertainment. It is bringing something else to the table other than the, let’s call it institutional knowledge or institutional bureaucracy of government. Why do you think that has made you successful? Why do you think it made Reagan successful and why do you think it makes Trump successful?\n\nGlenn Jacobs (aka Kane): Well, it is that different perspective and you can absolutely see it in this Trump administration. These first five days have been truly remarkable. They’ve almost been transformational for our country, and it’s been done in a very businesslike way. I mean, I think this time Trump learned from his first term while he was being literally persecuted as a private citizen. I learned from that. And he and his team came in with a game plan this time. And they often hear about presidents in the first hundred days and how important it is and all that stuff. Well, they take it to heart. And I mean, they have just done things that, you know, you wouldn’t have never thought possible before. But it was all strategy and all planning, which is something that you learn in business.\n\nTodd Piro: You mentioned kids and grandkids. Do you think that years from now when history books are written that literally this week will be written about in history books where probably not my kids, my kids are young, but I think, you know, the books are already written. Do you think their kids, my grandkids will read about this week? January of 2025 as the day that America changed.\n\nGlenn Jacobs (aka Kane): For.\n\nTodd Piro: The weak and changed.\n\nGlenn Jacobs (aka Kane): Man it should be. I don’t think there’s any doubt about that. I just, you know, everything from tackling the border and immigration crisis to strengthening American sovereignty, to righting injustices, all these different things that have been done in a way. And it just keeps on getting better. I mean, transparency. You know, how many years have people been begging for the JFK files to be declassified? And it doesn’t happen for decades. And then in the Trump administration, second Trump ministration three days and bam, there it is. And, you know, people think, well, that’s no big deal. It’s a huge deal. You know, it’s a huge deal because government classifies so many documents and, you know, so many of them shouldn’t be classified. It causes a lack of transparency. And that’s been addressed. And right now, it’s kind of a symbolic way. But I think going forward, it it’ll be even more more in that vein. So absolutely, I think. Yeah, it’s going to change the country and I really think that it’s going to get the country back on the right track. When so many of us were very concerned that we were about to go off the rails.\n\nTodd Piro: We’ve addressed the policy of this week, but you are also there attended Trump’s inauguration in D.C.. You know, human to human. What was that like?\n\nGlenn Jacobs (aka Kane): Yeah. There was so much excitement. So many people that had supported the president in many cases from the beginning. And, you know, part of the reason I think that the elitist left hates Trump so badly is because, you know, I consider myself I’m just an average person, man. You know, I was fortunate enough and very blessed to have a great career and do some really cool stuff. But in the end, you know, I’m just a dude. I’m just a guy. And that’s what Trump is, you know? And I think that’s part of the reason that the elites just despise him is because when they look at him, they see us, they see flyover country. You know, he’s not one of those like, rich dudes that that puts on airs or anything like that. You know, he’s just himself. And that gives him, you know, in wrestling and in politics the ability to connect with people. It’s intangible and you can’t teach it, but it’s one of the most important things. In fact, I would argue it is the most important thing for success in both areas. And it’s just something that some folks have and some folks don’t. Trump’s got it and he’s got it in spades. And again, I think that’s why, you know, people keep higher ups in the in the Democrat Party have been trying to figure that out. And they can’t and they never will. But that’s why people understand what that’s why they loved him so much.\n\nTodd Piro: I think you touched upon something really, really interesting. And it’s a general topic that we address a lot, this elites versus non elites. And I think we look at and say, elites look down upon, not elites. But I think you looked at it from a different perspective and that’s important. Elitist, almost celebrate the fact that they’re not regular dudes. And that does two things. It’s almost like a self-fulfilling prophecy. They can never let themselves be around or be comfortable with that concept of just being a dude. And they have to continuously sort of always one up or two up or three up you whether it’s in terms of of knowledge policy or just their approach to the world and what Donald Trump does. We mentioned it earlier in the show, Common sense. It’s all about common sense. Don’t overthink things. You know, there are criminals that are illegally in our country. So what does Trump do? Gets rid of this. We have oil underneath our feet. So what does Trump do? Drills for it. And these are just two examples, but it drives the elites crazy that regular people are succeeding and regular people are voting for this because it almost shatters their view of the world, which I don’t know. I’m not an elite. Glenn, I don’t understand your thoughts.\n\nGlenn Jacobs (aka Kane): Yeah, Yeah. Well, whatever percent agree, I’m not an elite either. But I think a lot of it is just that. Wanting to run everybody’s lives and believing that you are smarter in that kind of paternalistic attitude that you know better and, you know, you’re literally have been put in a position, you know, anointed by God to tell everybody else what to do. And, you know, my my political political philosophy is basically to maximize individual freedom. The people know how to run their lives better than some bureaucrat in Washington, D.C. does. Right. When it comes to the education of our kids, you know, they know better how to what their kids need than some faceless drone at the Department of Education in Washington, D.C.. And, you know, a lot of this obviously goes I think goes back to the progressive era. You know, and experts and technocrats should be running everything that’s not that’s not America. That’s completely un-American. And if nothing else, what has happened this week with with Trump and everything he’s done so far is really a lot of that. And that attitude has been overturned. You know, obviously, you know, sometimes it feels like we’re in a movie and these folks are just going to sit back on the heels of it all happen. At some point, they’ll come back out swinging. But, man, it feels good right now that I mean, seriously, we all keep on saying it, but it feels like America is back in a big way.\n\nTodd Piro: Let’s switch before we let you go from America to specifically the great state of Tennessee. Senator Marsha Blackburn appears to be the clear frontrunner for Tennessee governor, That according to a Trump pollster. You’re the state mayor of Knox County there, which is where Knoxville is located. If my Wikipedia search, I just did while doing the radio hit with you is correct. You agree with that? Is Blackburn. Is this Blackburn’s gubernatorial seat if she wants it?\n\nGlenn Jacobs (aka Kane): Yes. If Senator Blackburn wants to run for governor, I’ll certainly support for and I think that she would be definitely considered the front runner right now. And she’s done great. And she was in the state Senate then with the Congress and obviously is now a U.S. senator, but has done very well at all those levels, represents Tennessee and the people of Tennessee and Tennessee values very well. So I think she’d make a great governor.\n\nTodd Piro: How long are the terms there?\n\nGlenn Jacobs (aka Kane): Four years. And why? Said the term limited, say up to four year terms.\n\nTodd Piro: Okay. So follow me where I’m going here. If memory serves, there have been other WWF, WWE individuals who’ve gone on to the governor’s mansion in their respective state. Is that on the table for Cain? And eight plus years?\n\nGlenn Jacobs (aka Kane): Yeah. You know, I’m not exactly sure. I have two years left as mayor. A little less than that, actually. And I’m term limited as well. You know, for me, it’s not looking at what political office I want to run for next. It’s really just about trying to make a positive difference for the people that I love. And hopefully that radiates out to everybody else as well. So I’m not exactly sure, you know, and I’m not worried about it either. I mean, for whatever reason, you know, God always seems to put me in different places that, you know, that I feel rewarded and I feel that I belong. And I’m sure that’s what’s going to happen in the future. So, you know, it’s one of those things whatever comes, comes, and I’m going to be okay with that.\n\nTodd Piro: Got it. You are listening to Glenn Thomas Jacobs. He’s the mayor of Knox County, Tennessee, since 2018 and came to all those boys that I hung out with when I was in the fraternity watching WWE. This is awesome. Thank you so much for making the time curious and excited to see what the next step in your career is. But I think we’re all excited to see what Donald Trump does in the next four years. Appreciate your time. Have a great weekend.\n\nGlenn Jacobs (aka Kane): Thanks to you, too. I appreciate it.","summary":"Today on the Guy Benson Show, guest host Todd Piro was joined by Knoxville Mayor and WWE hall-of-fame wrester Glenn Jacobs (a.k.a. Kane). Jacobs and Piro discussed his journey from the wrestling ring into the lions den of politics. Jacobs discussed his story and why he thinks that America is much better off and feels more hopeful under President Trump. Jacobs also detailed his experience at Trump&#8217;s inauguration and showed his support for Tennessee Senator Marsha Blackburn in a potential bid for Tennessee governor. Listen to the full interview below! Listen to the full interview: Listen to the full podcast: Read the full (automated) interview below: Todd Piro: His name is Glenn Thomas Jacobs. A pretty, pretty American name, right? Well, you may know by a different name. If you are one of my fraternity brothers from the late 90s, early 2000s, they are Dartmouth College, New Hampshire. You know him as WWE Hall of Famer Kane. He&#8217;s also the mayor of Knox County. Since the year 2018. Mr. Jacobs Excuse m","url":"https://radio.foxnews.com/2025/01/24/glenn-jacobs-kane-tn-govenor/","image":"https://static.foxnews.com/radio.foxnews.com/content/uploads/2025/01/glenn-jacobs-profile.jpg","video":null,"publish_date":"2025-01-25 00:00:37","author":"Dylan Rolfsen,Knoxville Mayor","authors":["Dylan Rolfsen","Knoxville Mayor"],"language":"en","source_country":"us","sentiment":0.033},{"id":283654100,"title":"Letters: Stop traumatizing the homeless with sweeps","text":"Stop traumatizing\nhomeless with sweeps\n\nRe: “Cities vowed to clear camps, but have they?” (Page A1, Jan. 19).\n\nWhere will they go? Sweeps in the past are traumatizing, leaving residents without their belongings and their formed communities, and with nowhere to go except back on the streets.\n\nShelters do not provide a permanent solution as some do not provide social services, counseling and medical help. We should be investing in solutions such as the Victorville Wellness Center. Each person has their own private small space to reside. Their pets are welcome. Social services are provided to help them re-enter the community and support groups help get them back on their feet. When will we treat these people like human beings instead of like cattle being moved from one place to another?\n\nSweeps will only send the homeless to another location to set up a new encampment. Stop these sweeps.\n\nRev. Juanita Cordero\n\nWorking homeless\ndeserve help, not hassle\n\nRe: “City cracks down on RV parking” (Page B1, Jan. 19).\n\nSan Jose and Santa Clara County have had homeless issues for some time. This option addresses those who have jobs, cannot afford housing and are living out of their vehicles. This is roughly a third of the homeless. These people are making a contribution to the economy and deserve a hand up.\n\nRather than hassle them to keep moving their vehicles, it would be prudent to take an open space, like an old drive-in theatre, and provide an area to park overnight, and to have access to water, electricity and portable toilets. A small fee could be required to cover the operating expenses. Everyone wins. For a little more investment, showers could be provided.\n\nBecause they make a contribution to our community, they need to be treated differently than those with mental health and drug issues, or those who refuse any assistance.\n\nBill Beecher\n\nMedia should keep eyes\non Trump’s worst moves\n\nRe: “Trump out to be a name-changer” (Page A1, Jan. 23).\n\nPresident Trump has issued a flurry of executive orders that will change Americans’ lives for the worse, from cutting access to medical coverage and lower prescription prices to rolling back protections for civil rights. So what gets half the front page of the Mercury News? A stupid notion about changing some place names that won’t affect anyone.\n\nPlease stop chasing every shiny distraction he throws out there and focus instead on the meaningful damage he’s doing that will make life harder for millions of people. It shouldn’t be hard to find something substantial, given how many ways he’s trying to undo a century of American progress.\n\nDoug Edwards\n\nCartoonist owes apology\nfor bad comparison\n\nThere was a cartoon in the Jan. 20 paper, the celebration of Martin Luther King Jr.’s birthday, that was so offensive I felt I must write to the paper.\n\n“Mallard Fillmore” is a very political cartoon. Freedom of speech and a differing opinion are foundational rights in our democracy. However, the Jan. 20 strip that compared Donald Trump to Martin Luther King Jr. is such an ill-informed statement.\n\nThe cartoonist should write an apology at the very least.\n\nDonna Thompson\n\nPlenty of reasons to find\nTrump contemptible\n\nHad he only sexually abused women, that would have been enough to be contemptible.\n\nHad he not sexually abused women, but committed felonies and fraud, that would have been enough.\n\nHad he not abused women, not committed felony and fraud, but lied over 30,000 times, including a known, big lie to divide the nation, that would have been enough.\n\nHad he not abused women, not committed felony and fraud, and not lied pathologically, including dividing the nation, but engaged in election interference, that would have been enough.\n\nHad he not abused women, not committed felony and fraud, not lied pathologically, not sowed division, and not attempted to interfere with an election, but dodged the draft and demeaned those who served, that would have been enough.\n\nHad he not committed these transgressions but scapegoated immigrants and failed to show empathy for others, that would be, and is, contemptible.\n\nLarry Ebert\nSan Francisco","summary":"Also: Help, not hassle &#124; Worst moves &#124; Bad comparison &#124; Plenty of reasons. Mercury News reader letters to the editor for Jan. 25, 2025.","url":"https://www.mercurynews.com/2025/01/24/letters-stop-traumatizing-homeless-sweeps/","image":"https://www.mercurynews.com/wp-content/uploads/2025/01/SJM-L-SWEEPS-XX-13_829de6.jpg?w=1024&h=686","video":null,"publish_date":"2025-01-25 00:00:19","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":-0.075},{"id":283650192,"title":"In Asia’s forgotten war, a generation sacrifices its youth defying Myanmar’s brutal junta","text":"For Myanmar’s people, year four under military junta rule has only brought more death, displacement and despair, as their troubled homeland is torn further apart by a seemingly intractable civil war.\nIn capital Naypyidaw, the military – or Tatmadaw – calls all the shots, but after a series of chastening battlefield defeats, the generals increasingly find themselves boxed-in to the country’s central heartlands. Still, few among the anti-junta resistance forces harbour any illusions about an imminent collapse of Min Aung Hlaing’s brutal regime.\n“The Tatmadaw is still very strong, it is an old institution, they have money … they hold the power,” said Maung Saungkha, a 32-year-old rebel commander in Kayin state. “But I believe we will win. I just can’t say when.”\nHope persists among those fighting for a freer Myanmar. The conflict, sparked by the military’s coup on February 1, 2021, has pitted the junta against a mosaic of armed ethnic groups and young pro-democracy fighters. Many of those fighters – students, clerks and factory workers – have been thrust into a war they never sought but now cannot abandon.\n\nOutside of Asia, however, Myanmar has the feeling of a forgotten crisis, with the world’s attention diverted by Russia’s war in Europe, the carnage in the Middle East and the return of Donald Trump as one of the most powerful people on Earth.\nBut in the dense forests of the Irrawaddy River basin, Maung Saungkha leads around 1,000 fighters under the banner of the Bamar People’s Liberation Army (BPLA), armed with rocket-propelled grenade launchers, machine guns and M16 rifles seized from Tatmadaw bases.\nNestled atop hilltops, their camps are concealed beneath a high bamboo canopy. Between their rotations to the front lines, the rebel fighters fill their time with chess and foraging for food in the forest that sustains them.\n“I didn’t want to be a soldier,” Maung Saungkha told This Week in Asia. “But we have to sacrifice for the next generation … We can’t betray the people who have died. We have to keep our dream alive.”\n\nA broken state\nThe junta does not have effective control over much of Myanmar, ceding between 50 and 70 per cent of the country’s territory to rebel groups and losing key areas along its borders after suffering serious defeats in Rakhine and Shan states last year.\nYet Min Aung Hlaing clings to power, planning elections in a bid to add a veneer of legitimacy to his besieged government. Critics dismiss the prospect of credible elections as absurd in a nation where the junta’s reach no longer extends across vast regions – and where the rebels are in no mood to negotiate after years of savage conflict.\nFor Maung Saungkha, once a poet and human rights activist, the transformation from civilian life to guerilla warfare has been stark. Before the war, he was a chemical engineering graduate known for his verses that mocked Myanmar’s political elite, including a lewd poem about then-president Thein Sein that landed him in jail for six months in 2016.\nBack then, he wrote about freedom and defiance. Now, from forest hideouts, his words carry the weight of conflict. “Revolutions are about love,” he told This Week in Asia. “Love and war.”\nRecruiting, training and arming fighters remains a daily challenge for the BPLA, which works alongside larger, better-equipped ethnic armed organisations like the Ta’ang National Liberation Army and Myanmar National Democratic Alliance Army.\nThe fighters are mostly young, idealistic – and driven by a shared dream of freedom.\n\nDeath from above\nDespite losing ground, the military retains key advantages. Armed with weapons from Russia, China, North Korea and Israel, and funded by revenues from plundered jade, rubies, teak – as well as a slice of illicit enterprises, from drugs to scams – the Tatmadaw is far from defeated. It wields air power ruthlessly, escalating air strikes on rebel camps and civilian areas even as its soldiers retreat from the front lines.\nLast Saturday, a junta air strike killed 28 people – including children – at a detention camp in Rakhine state, where the fighting has been most intense. The attack was yet another example of the military’s reliance on air superiority to compensate for its dwindling control on the ground.\nMyanmar’s descent into chaos has forced millions to flee their homes. The United Nations estimates 3.5 million people have been displaced by conflict, an increase of 1.5 million last year alone. More than 5,350 civilians have been killed.\n\nMany young people have faced a harsh choice: join the rebels or risk a perilous escape across the border Thailand or Malaysia to evade mandatory conscription into the army’s depleted ranks.\nThose fleeing illegally are easy prey for human traffickers or corrupt immigration officials, and are often forced to live in the shadows abroad. Yet they remain vital lifelines for families back home, sending remittances to a nation ravaged by war and poverty.\n“A whole generation has been affected, many have left legally or illegally,” said Sai Arkar of human rights advocacy group Fortify Rights. “It’s a huge brain drain for the country and every household with a young person in it is affected.”\n\nA dream deferred\nMyanmar’s current turmoil stands in sharp contrast to the brief optimism that followed the election of Nobel laureate Aung San Suu Kyi’s National League for Democracy in 2015. Under her watch, the economy opened up, free speech began to flourish and foreign investment flowed in through companies staffed by a generation ready to claim a freer, wealthier future that their parents were denied.\nIt appeared that the country might be finally transitioning towards democracy after the decades of corrosive military rule that followed hard on the heels of Myanmar’s independence from Britain in 1948. But the military never really relinquished its grip – and the 2021 coup shattered any illusions of lasting progress.\nNow, Suu Kyi, 79, is back in jail, her influence diminished. Meanwhile, the junta’s propaganda machine continues to churn out a distorted narrative of progress and stability. State media such as the English-language Global New Light of Myanmar touts record harvests, rebuilding efforts against “terrorist forces” and the Southeast Asian nation’s tourism potential, even as the economy contracts and criminal enterprises flourish.\n\nStrict internet controls are back and, in the junta-controlled big cities, paranoia and suspicion abounds. Rolling blackouts and electricity rationing in the commercial capital, Yangon, serves as a daily reminder of an economy stuck in reverse\n“People inside Myanmar now don’t really have any freedoms at all,” Sai Arkar told This Week in Asia. “They have no freedom of expression, they cannot express their views … If you post anything online, you will be arrested. Their very basic rights have been violated.”\nWhile the economy stagnates – the World Bank estimates it will shrink by 1 per cent this year, after clipping along at 6.6 per cent pre-pandemic – corruption and crime thrive. Drug trafficking, arms smuggling and scam operations have turned Myanmar into a hub for illicit activity, further enriching the junta while ordinary citizens struggle to survive.\n\nFreedom flickers\nDiplomatically isolated, Myanmar’s generals remain cloistered in Naypyidaw, the capital built to embody military dominance.\nOnce a staunch ally, even China’s previously rock-solid support appears to be wavering as the junta loses control of border areas that are critical to Beijing’s interests.\nAnd within the Association of Southeast Asian Nations, Myanmar faces unprecedented rebukes, with its generals barred from high-level meetings – a prohibition that was upheld at the Asean foreign ministers’ retreat last weekend.\nMalaysia, which holds the rotating Asean chair for 2025, has urged the junta to prioritise a ceasefire over elections. But Min Aung Hlaing has shown no appetite for compromise, his political – and perhaps personal – survival intertwined with the junta’s fate.\n\nThe embattled generals did appear to extend an olive branch in September, seeking peace talks with rebel groups in what was widely seen as rare acknowledgement of weakness. But this offer was swiftly rejected by a suspicious armed opposition that remains wary of the junta’s true intentions.\nFor Maung Saungkha and the fighters he leads, there is no turning back.\n“I am a poet,” he told This Week in Asia. “But now I need to be at war.”","summary":"For thousands of guerilla fighters, the dream of a free Myanmar still burns bright – even after four years of ruinous civil war.","url":"https://www.scmp.com/week-asia/people/article/3296205/asias-forgotten-war-generation-sacrifices-its-youth-defying-myanmars-brutal-junta","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/24/eccf3bd9-74ae-4213-a4ce-a469d64a745b_5589af9d.jpg","video":null,"publish_date":"2025-01-25 00:00:16","author":"Aidan Jones,Khu Sam","authors":["Aidan Jones","Khu Sam"],"language":"en","source_country":"cn","sentiment":0.035},{"id":283651366,"title":"Video Shows Gavin Newsom and Donald Trump's Exchange on Tarmac","text":"President Donald Trump was greeted by California Governor Gavin Newsom on Friday as Trump prepares to tour areas of the state recently ravaged by wildfires.Why It MattersTrump and Newsom have been enthralled in a contentious back and forth in recent weeks as wildfires raged in Los Angeles County. Trump has pointed the finger at Newsom a Democrat, blaming him for poorly handling the fires.Los Angeles Mayor Karen Bass, a Democrat, has also faced fierce backlash for her management.The deadly Palisades and Eaton fires grew to be the largest, scorching tens of thousands of acres and destroying thousands of buildings.What To KnowAs Trump and first lady Melania Trump departed Air-Force 1 after they landed at Los Angeles International Airport (LAX) on Friday afternoon, Trump stuck out his hand to shake Newsom's.The pair briefly spoke before heading over to chat with reporters. It is immediately unclear to Newsweek what was said between the two.While speaking to reporters, Trump said \"I appreciate the governor coming out and meeting me, Gavin...\" while sticking his hand out again to shake Newsom's.\"We want to get it fixed; we want to get the problem fixed. There will be some ways but it's like you got hit by a bomb, right? Like you got hit by a bomb,\" Trump said to Newsom.Newsom then said, \"Most importantly, thank you for being here, it means a great deal to all of us. Not just the folks in Palisades, the folks in Altadena that were devastated. We're going to need your support, were going to need your help, you were there for us during COVID, I don't forget that, and I have all the expectations that we will be able to work together, to get this speedy recovery.\"Newsweek reached out to Governor Newsom's office and the White House via email for comment on Friday evening.This is a developing story that will be updated with additional information.","summary":"Trump and Newsom greeted one another on the tarmac at LAX on Friday as Trump plans to tour fire damaged areas of the state.","url":"https://www.newsweek.com/video-shows-gavin-newsom-donald-trumps-exchange-tarmac-2020737","image":"https://d.newsweek.com/en/full/2573409/gavin-newsom-donald-trump.jpg","video":null,"publish_date":"2025-01-25 00:00:12","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"us","sentiment":-0.132},{"id":283652732,"title":"Business, Vancouver International Wine Festival could be hit if B.C. bans U.S. alcohol","text":"A B.C. ban on U.S. alcohol sales in the province would hurt small wine-import businesses and potentially the Vancouver International Wine Festival, which is set to launch Feb. 22 with the U.S. as the theme region. \n\nB.C. Premier David Eby earlier this week floated the idea that he could direct the province’s monopoly liquor buyer, the British Columbia Liquor Distribution Branch (BCLDB), to stop purchasing American alcohol if U.S. President Donald Trump follows through on a promise to levy 25-per-cent tariffs on all Canadian imports.\n\nAll B.C. alcohol sellers must buy their products from the BCLDB. That includes restaurants, pubs, government liquor stores and private liquor or beer and wine stores.\n\nThe Canadian government could theoretically ban Canadians from bringing home American alcohol purchased stateside but no official representative has yet floated that idea.\n\n“Our decision not to purchase American alcohol would definitely send a message,” Eby said at a Jan. 21 press conference. “It is one of the things that could be on the table to respond to these tariffs.\n\nA ban on U.S. alcohol sales would particularly hurt B.C.-based wine importers who specialize in bringing U.S. wines to B.C. retail store shelves.\n\nVintage West Wine & Spirits managing partner Matt Thirlwell said a ban on U.S. alcohol sales would cause widespread job losses in his sector.\n\n“It would be devastating for the industry if this has any kind of long term sticking power,” Thirlwell told BIV.\n\nHis 20-employee company generates between 60 and 65 per cent of its revenue from bringing in U.S. wines to sell to retailers via the BCLDB. Government-run liquor stores and private liquor and wine stores carry his products.\n\nSome of his biggest sellers are from California’s Bread and Butter Wines. He generates a cut from all sales, so his revenue goes up when sales volume rises, he explained.\n\n“You absolutely have the potential to put hundreds of people out of work, if not thousands, as well as potentially risking bankrupting companies on the import side of the business,” he said. “I’m not saying that will be true for mine but I’m saying that as a general facto given the weight of the U.S. category.”\n\nBIV crunched numbers to determine that B.C. restaurants, pubs, government stores and private stores bought $128,068,408 worth of U.S. wine in the year ended Sept. 30, which, as of yesterday, was the most recent wholesale data that the BCLDB has released.\n\nThose sales are about 11.65 per cent of the $1,099,417,854 that local wholesale customers spent on all wine in that year.\n\nB.C. is the region that sells the most wine in B.C.: $513,478,964 worth, or 46.7 per cent of all wine wholesales in the province in the year ended Sept. 30.\n\nThirlwell told BIV that he pays to subscribe to get access to other BCLDB data, which separates Vintners Quality Alliance (VQA) wine from what is called cellared in Canada (CIC) wine. VQA wine comes from grapes grown in B.C. while the CIC wine comes from imported and cheaper juice.\n\nThat data shows that about 41.6 per cent of the B.C. wine sold is CIC, while about 58.4 is VQA wine.\n\nBritish Columbians overwhelmingly buy B.C.-made beer already. Local buyers only spent $2,179,702 on U.S. beer wholesales in the year ended Sept. 30. That is about 2.08 per cent of the money B.C. wholesale buyers spent on all beer that year.\n\nIn contrast $780,819,659 was spent on B.C. beer wholesales, or 74.86 per cent of the $1,042,990,372 spent on all beer wholesales in that year.\n\nWholesalers spent much more on American whiskey than that country's beer.\n\nIn the year ended Sept. 30, local buyers spent $12,163,340 on American whiskey and $25,720,500 on bourbon, which has specific requirements and almost always comes from Kentucky. That combines to be $37,883,840, or 14.08 per cent of the $268,957,111 spent on all whiskies wholesale in the year ended Sept. 30.\n\nMarquis Wine Cellars owner John Clerides told BIV that his store has a significant supply of U.S. wines.\n\n“If that runs out, customers will shift to Italian and French and Spanish and Portuguese and Greek and so on,” he said. “We're good for a little while.”\n\nBan on U.S. alcohol could complicate the Vancouver International Wine Festival\n\nOne thing that remains unclear is how the ban could impact the Vancouver International Wine Festival, which runs Feb. 22 through March 2 and has the U.S. as its theme region.\n\nThe festival’s executive director, Harry Hertscheg, was not available for an interview. Neither was U.S. consul general Jim DeHart, whose consulate is involved in the logistics of bringing wine to the festival for events.\n\nBIV asked the wine festival in an email if it had made any contingency plans for the possibility that B.C. would ban U.S. alcohol starting when Trump first made his tariff threats in late November. The wine festival's response did not mention any ways it could pivot. In part the response said that the festival was \"continuing our day-to-day work to ensure that Canada’s premier wine festival will be ready to welcome the wine world to Vancouver.\"\n\nBIV also asked if the wine festival was in contact with the B.C. government to try to get an exemption from any provincial ban on U.S. alcohol. \n\n\"We have begun conversations with our stakeholders and will continue our discussions with them as the situation develops,\" it said.\n\nBIV asked the BCLDB if it might be possible for the wine festival to get an exemption from any ban on U.S. alcohol and it similarly did not make anyone available for an interview. It said in a statement that it would \"be premature to speculate on the potential impacts\" of a B.C. ban on U.S. alcohol \"without first understanding what/if any US tariffs are imposed and what options are available for the province to respond.\"\n\nHertscheg last year told BIV that this is the first year that the U.S. has been his festival’s theme region. California has been a theme region on its own, but never the entire country.\n\nHe noted that there could be wines from New York state and other states that rarely bring wines to B.C. That has changed because no such wineries wound up being willing to come to the festival. As such, all of the U.S. wineries will be from Washington, Oregon and California.\n\nThe festival plans to feature 122 wineries from 15 countries, including 20 wineries from B.C.","summary":"Vancouver International Wine Festival to launch Feb. 22 with U.S. as the theme region.","url":"https://www.biv.com/news/retail-manufacturing/business-vancouver-international-wine-festival-could-be-hit-if-bc-bans-us-alcohol-10129203","image":"https://www.vmcdn.ca/f/files/biv/images/viwf-wine-buyers-gk.jpg","video":null,"publish_date":"2025-01-25 00:00:00","author":"Glen Korstrom","authors":["Glen Korstrom"],"language":"en","source_country":"ca","sentiment":-0.303},{"id":283650922,"title":"March for Life Reacts to Trump Pardoning 23 Pro-Life Activists","text":"Thousands of Americans gathered in Washington for the 52nd annual March for Life on Friday, just one day after President Donald Trump issued pardons for 23 pro-life activists who were prosecuted under the Biden administration for their activism.\n\n“I’m just so delighted,” Jeanne Mancini, president of the March for Life, told The Daily Signal, commenting on a video she had seen of a pro-life activist being released from prison and being reunited with her baby.\n\n“It was so unjust that they’ve been in jail for so long, and I’m just grateful that in [Trump’s] first few days that he would give a reprieve and pardon to those who were wrongly incarcerated,” Mancini said. \n\nDuring the Biden administration, nearly two dozen pro-life activists were charged with violating the Freedom of Access to Clinic Entrances (FACE) Act for actions including praying outside abortion clinics and encouraging women in unplanned pregnancies to choose life. \n\nPro-life leaders and other Americans are heralding Trump’s action as a victory. \n\n“I’m so excited and so happy,” Lauren, a marcher from Pittsburgh who did not give her last name, said of the pardons, adding that she used to protest abortion with one of the individuals who was imprisoned under the FACE Act and who Trump has pardoned. \n\n“I think it’s an important message for free speech,” a marcher from Fargo, North Dakota, said of the pardons. \n\nA pro-life marcher from Maryland told The Daily Signal he was “delighted” to see the activists pardoned, adding, “now, I hope they make an effort to get rid of that law.” \n\nRep. Chip Roy, R-Texas, and Sen. Mike Lee, R-Utah, introduced a bill to repeal the law that was used to charge and imprison the pro-life Americans. Penny Nance, president of Concerned Women for America, said she thinks the FACE Act is unconstitutional and should be repealed.\n\n“It is basically an unconstitutional violation of Americans’ First Amendment rights,” Nance said. “It protects the abortion clinics, but violates our free speech rights and our rights to peacefully assemble.” \n\nStudents for Life President Kristan Hawkins said the FACE Act should “absolutely” be repealed. \n\n“When they were firebombing pregnancy centers after the [Supreme Court’s June 2022 Dobbs v. Jackson Women’s Health Organization decision overturning Roe v. Wade], zero people were put in jail. Zero,” Hawkins said. “They’ve only ever used this to target pro-lifers. This should never have happened in the first place. It was a travesty of justice. FACE needs to go.” \n\nDr. Susan Bane, vice chair of the board of the American Association of Pro-Life Obstetricians and Gynecologists, said the FACE Act convicts had a right to let their voices be heard. \n\n“Individuals are allowed to peacefully protest in America,” the pro-life OBGYN said. \n\nKatie Daniel, director of legal affairs for Susan B. Anthony Pro-Life America, said the FACE Act was supposed to protect both pregnancy resource centers and abortion clinics, but it overwhelmingly has been used to prosecute pro-life protesters. \n\n“This is a law that’s got to go,” she told The Daily Signal. “It’s been used for evil from the very beginning, and certainly nobody did that more than the Biden-Harris administration.” \n\nA female student from Liberty University said she was thrilled Trump had pardoned the pro-lifers. \n\n“Those rescuers and those pro-lifers that were so courageous to stay in jail, away from their families, away from their fiances, their children, their grandchildren, for over two years, it was such a powerful statement for them to make,” the young woman said, “and President Trump pardoning them was such an amazing thing, which he acted on so quickly.”\n\nShe said Congress should repeal the FACE Act “as soon as possible,” adding: “I think that it is a breach of our constitutional rights.”","summary":"Thousands of Americans gathered in Washington for the 52nd annual March for Life on Friday, just one day after President Donald Trump issued pardons for... Read More\n\n\nThe post March for Life Reacts to Trump Pardoning 23 Pro-Life Activists appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/01/24/march-life-reacts-trump-pardoning-23-pro-life-activists/","image":"https://www.dailysignal.com/wp-content/uploads/2025/01/March-for-Life.jpg","video":null,"publish_date":"2025-01-24 23:59:42","author":"Elizabeth Troutman Mitchell","authors":["Elizabeth Troutman Mitchell"],"language":"en","source_country":"us","sentiment":-0.385},{"id":283650776,"title":"Hulk Hogan pulls out of WWE show just weeks after getting booed by fans","text":"Hulk Hogan has pulled out of a WWE event on Saturday night, just weeks after he was booed by fans on Monday Night Raw.\n\nDuring WWE's debut on Netflix, Hogan made an appearance on RAW in front of 17,000-plus fans in Los Angeles primarily to promote his beverage 'Real American Beer'.\n\nWWE announced a multi-year partnership with Hogan's beer the day before RAW and the logo was plastered on the ring mat during the show.\n\nYet, when Hogan came out to speak to the crowd, it didn't take long for them to let him know exactly how they felt.\n\nThe Hulkster, now 71, tried to tell the WWE audience they were the best tag team partner he ever had. Their response was to boo him out of the building.\n\nHogan, a strong supporter of Donald Trump, was chucked out of the WWE in 2015 after a tape surfaced of him making racist remarks, including the use of the n-word. \n\nAnd now he won't be appearing at Saturday Night Main Event due to 'family commitments', according to reports.\n\nMore to follow.","summary":"During WWE's debut on Netflix, Hogan was booed during his appearance on RAW in front of 17,000-plus fans in Los Angeles primarily to promote his beverage 'Real American Beer'.","url":"https://www.dailymail.co.uk/sport/wwe/article-14323501/Hulk-Hogan-WWE-booed-saturday-night-main-event.html","image":"https://i.dailymail.co.uk/1s/2025/01/24/23/94494977-0-image-m-31_1737762714135.jpg","video":null,"publish_date":"2025-01-24 23:56:36","author":"Editor,Max Winters","authors":["Editor","Max Winters"],"language":"en","source_country":"gb","sentiment":0.097},{"id":283655450,"title":"A$AP Rocky Trial: Lawyer Says Rapper Fired ‘Two Warning Shots’ from Starter Pistol to Protect Pal","text":"A$AP Rocky sat in a California courtroom with everything on the line Friday as prosecutors told jurors he fired multiple shots from a 9mm semiautomatic pistol during a fight with former friend A$AP Relli on a Hollywood street corner three years ago. Rocky’s lawyer said the rapper didn’t shoot anyone, calling Relli’s allegation a lie concocted for cash.\n\n In a dramatic rebuttal to prosecutors’ opening statement on the first day of Rocky’s gun assault trial, defense attorney Joseph Tacopina said publicly for the first time that Rocky, born Rakim Mayers, admits he pulled the trigger on the firearm he was carrying that night. He said Mayers fired “two warning shots” from his “starter gun” to break up an alleged scuffle between Relli and A$AP Illz, another member of their A$AP Mob collective whose legal name is Illijah Ulanger.\n\n “Rocky fired that prop gun,” Tacopina told the jury. “He fired twice, hoping the sound would be enough to scare off Relli and protect Illz.” \n\n The defense lawyer said the evidence will show lots of people in Mayers’ inner circle knew he carried a “fake gun” to “scare off attackers” after he was the victim of prior violence and a stalker. Tacopina said the specific gun in Rocky’s hands that night was a starter pistol “prop gun” that came from the set of a music video he filmed months earlier with his superstar girlfriend Rihanna, the mother of his two young sons.\n\n “This case about one mans’ lies, jealousy and greed,” Tacopina said, calling Relli the “source of all the evidence” in the case. “Ladies and gentleman, this case is all about money. The evidence will show it’s nothing more than a money grab,” Tacopina said. “The evidence will make clear Relli is trying to leverage a fabricated story to extract money.”\n\n In the state’s opening statement, prosecutors showed some of their own evidence for the first time. They introduced a 911 call in which a woman said she witnessed the “shooting” and showed a photo of a loaded 9mm gun magazine allegedly recovered from Rocky’s home during a search.\n\n “This is not a complicated case,” Deputy District Attorney Paul Przelomiec told the jury in downtown Los Angeles. He asked the panel of seven women and five men “to not leave your common sense at the door.”\n\n Rocky, 36, is on trial for allegedly shooting Relli, born Terell Ephron, amid a caught-on-camera quarrel not far from the famed intersection of Hollywood and Vine on Nov. 6, 2021. It was during a hearing on Tuesday that Tacopina first claimed in open court that the gun was a starter pistol incapable of firing actual bullets.\n\n Much of Przelomiec’s opening statement covered the video evidence presented during a probable cause hearing in November 2023. He played the 911 call to set the scene and connect Mayers to the alleged shooting by physical description. “There’s been a shooting,” the female caller, who identified herself as a nearby resident, says in the audio played in court. “We watched it. … The guy in the black sweatshirt pulled out a gun.” Przelomiec said the woman later declined to speak with police.\n\n Przelomiec showed grainy video of the alleged incident in which four tiny figures are seen sparring on at the intersection of Selma Ave. and Vista Del Mar Ave. after an initial confrontation near a parking garage outside the W Hotel. The blurry black and white video shows no muzzle flash and had no sound when it was recorded. Unlike when it was played at a preliminary hearing in November 2023, the video played in court Friday was synchronized with the sound of two loud cracking noises that was captured as the audio to a surveillance video recorded by a building around the corner. Przelomiec told jurors they were able to marry the two videos thanks to a security floodlight that activated at one point during the incident.\n\n Przelomiec also said for the first time that when police searched Mayers’ home on April 20, 2022, they found a magazine for a semiautomatic pistol loaded with six 9mm Luger bullets in a box in his bedroom closet. He said there was “no handgun to go with it” but that two expended casings allegedly recovered from the scene by Ephron were 9mm casings.\n\n In his dueling presentation, Tacopina said seven police officers responded to the scene of the alleged shooting and never found any casings. He said surveillance video of Ephron back at the scene a short time later showed him scouring the same area police previously searched with their flashlights. The lawyer also told jurors the brand of bullets in the magazine at Mayers’ house did not match the casings handed over by Ephron. He said a witness is expected to further testify that the magazine belonged to someone other than Mayers. \n\n Mayers’ trial on two counts of assault with a semiautomatic weapon comes at a pivotal time in his life and career. He’s now the father to two children with superstar singer and “life partner” Rihanna. He’s also set to headline the Los Angeles Rolling Loud California festival set for March, and he was tapped to serve as co-chair of the next Met Gala alongside Pharrell Williams and LeBron James in May. Music fans are awaiting the imminent release of his fourth studio album, Don’t Be Dumb. Mayers is due to make his acting debut as one of the main characters in Spike Lee’s upcoming “reinterpretation” of Akira Kurosawa’s 1963 kidnapping drama High and Low. The new film, titled Highest 2 Lowest, was shot last year in New York with co-stars Denzel Washington and fellow rapper Ice Spice. \n\n With so much at stake, it was a telling moment Tuesday when Mayers rejected a last-minute plea deal from prosecutors offering six months in county jail, a 7-year suspended prison sentence and three years of supervised probation. “I respectfully decline, thank you,” Mayers told the court. If convicted as charged, Mayers is facing a maximum sentence of 24 years in prison, though prosecutors said they would recommend between 10 and 12 years. Tacopina has repeatedly said he considers the defense position “strong.” Mayers has been walking in and out of court this week with a distinct air of confidence.\n\n Mayers was first arrested over the case in April 2022. Back then, the incident was described by police as an argument between acquaintances that escalated into gunfire. Rolling Stone was the first to identify the alleged victim after learning Ephron had filed a civil complaint.\n\n At Mayers’ probable cause hearing in November 2023, Ephron testified that he and Mayers were fighting because he believed Mayers had failed to pay for a friend’s funeral. He recalled sending an embittered text on Oct. 28, 2021, because he believed Mayers had become “big-headed.” “You so fucking fake it’s sad,” the text shown on a screen in court read. “Don’t ever forget who introduced you to this life,” Ephron wrote in another text. He told the court he was the one who brought Mayers into the A$AP fold when they were high school students in New York. (Under cross-examination, Ephron said he eventually learned Mayers paid for the entire funeral.)\n\n Describing the night of the alleged assault, Ephron testified that he was staying at a hotel when Mayers suggested they meet face to face. He claimed the meeting turned into an armed ambush, with Mayers brandishing a gun while flanked by Ulanger as well as Jamel Da’Shawn Phillips, also known as A$AP Twelvyy. In his testimony, he said the argument continued down the block. He claimed he taunted Mayers before the rapper allegedly turned around and fired an initial shot that “grazed” the knuckles on his left hand. He claimed he rushed to grab Ulanger to use him “as a shield.” He said Mayers fired two or three more times before everyone fled the scene.\n\n LAPD detective Frank Flores testified at the 2023 hearing that no weapons were ever recovered in the case. He also conceded the video was inconclusive. “[There’s] nothing clear that shows it,” meaning the purported gunfire, he said. The detective claimed that “collectively,” the videos tell a plausible story, but Tacopina pushed back. “I’m not asking for opinion,” Tacopina interrupted, asking again if the video showed a shooting. “Nothing definitively shows,” the detective answered.\n\n Tacopina, an aggressive defense lawyer known for representing high-profile clients including Meek Mill, YG, and Donald Trump, has deflected repeated questions about whether Rihanna would attend the trial. “I know Rocky is very protective of Rihanna and doesn’t want her anywhere near this proceeding. But that’s a family decision they’ll make,” he said Jan. 15.\n\n On Tuesday, Tacopina told Judge Mark Arnold that the “Umbrella” singer likely would make a cameo. “I anticipate at some point, but certainly not every day, and certainly not now,” Tacopina said.\n\n At multiple hearings leading up to trial, Judge Arnold inquired about Rihanna. But he also stated Mayers’ celebrity standing would have no bearing on his oversight of the trial. “You’re not going to get any special treatment. Your status as an entertainer, your status as the significant other of Rihanna, that’s not going to inure to your benefit, and it’s not going to inure to your harm,” he told the artist.\n\n “You are aware that if convicted, you will go into custody and it’s very likely you will get a significant prison sentence?” the judge asked Tuesday.\n\n “Yes, your honor,” Mayers said, “I’m well aware.”","summary":"The rapper's full defense was revealed in opening statements on first day of gun assault trial in Los Angeles","url":"https://www.rollingstone.com/music/music-news/asap-rocky-assualt-trial-gun-asap-relli-1235245317/","image":"https://www.rollingstone.com/wp-content/uploads/2025/01/ASAP-rocky-opening-trial.jpg","video":null,"publish_date":"2025-01-24 23:55:32","author":"Nancy Dillon","authors":["Nancy Dillon"],"language":"en","source_country":"us","sentiment":-0.05},{"id":283658856,"title":"ICE denies claims from Chicago Public Schools that agents showed up to elementary school","text":"The account, which triggered alarms and reports of parents and grandparents pulling their children from school, was quickly challenged by ICE spokesman David Yost, who denied the incident ever took place. Instead, it turns out, it was the U.S. Secret Service that had dispatched agents to the school while conducting a “protective intelligence investigation.”\n\nA spokesperson for the Secret Service said the agency “was investigating a threat to one of our protectees in reference to the recent TikTok ban.”\n\n“That investigation led to a home next to the school,” Anthony Guglielmi told NBC Chicago. “Then after, they went to the school as part of the investigation. They identified themselves as Secret Service and left business cards.” \n\nAlex Pfeiffer, deputy assistant to President Donald Trump and principal deputy communications director, called out several Chicago-based outlets for “fake news”.\n\nGuglielmi’s account differed from what Chicago school leaders told parents, staff, students, and the press following the incident. They claimed immigration agents attempted to enter Hamline Elementary School but were denied entry. \n\n“School staff followed CPS established protocols,” CPS Chief Education Officer Bogdana Chkoumbova said in a news conference Friday afternoon. “They kept ICE agents outside of the school and contacted CPS law department and CPS Office of Safety and Security for further guidance. The ICE agents were not allowed into the school and were not permitted to speak to any students or staff members.”\n\nHamline Principal Natasha Ortega also confirmed the presence of ICE agents and said the school would not cooperate with federal immigration authorities.\n\n‘We will not open our doors for ICE, and we are here to protect our children and make sure they have access to an excellent education,” Ortega said. \n\nFanny Diego Alvarez, chief of family and community engagement for the district, maintained the “ICE agents said they were [Department of Homeland Security].” \n\nThe chaotic incident comes on the heels of a Tuesday announcement by the Trump administration that it would allow federal immigration agencies to make arrests at schools, churches, and hospitals, reversing a policy that had been in effect for 14 years. \n\n“Criminals will no longer be able to hide in America’s schools and churches to avoid arrest,” a statement from the Department of Homeland Security said. \n\nAccording to the Migration Policy Institute, there are an estimated 733,000 school-aged children in the U.S. illegally. \n\nA resolution passed by CPS’ Board of Education in November said schools would not help ICE in enforcing immigration law.\n\n“We’re trying to simplify for our staff, making it clear we’re just not going to interact with ICE,” district CEO Pedro Martinez said. \n\nHe told the Associated Press that he anticipated little fallout from a new Justice Department directive to investigate state or local officials blocking the federal crackdown on immigration. \n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nHe added that if any federal agents turned up at any of Chicago’s 633 public schools they would have to present a valid court order and that even then “they’re going to have to go through my legal department.” \n\nMartinez maintained Friday evening that the agents who came to Hamline “showed credentials to my staff” that indicated they were ICE.","summary":"Chicago Public Schools officials claimed Friday that federal agents from U.S. Immigration and Customs Enforcement showed up at an elementary school in the city&#8217;s South Side but were blocked by staff from entering. The account, which triggered alarms and reports of parents and grandparents pulling their children from school, was quickly challenged by ICE spokesman David Yost, who denied the incident [&#8230;]","url":"https://www.washingtonexaminer.com/policy/immigration/3300385/ice-denies-chicago-school-agents-elementary-school/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/01/ICEOFFICERBADGE.webp","video":null,"publish_date":"2025-01-24 23:54:33","author":"Barnini Chakraborty","authors":["Barnini Chakraborty"],"language":"en","category":"politics","source_country":"US","sentiment":-0.383},{"id":283648450,"title":"Putin wants to ‘manipulate’ Trump on Ukraine – Zelensky","text":"Ukrainian leader, Volodymyr Zelensky, on Friday warned that his Russian counterpart, Vladimir Putin, wanted to “manipulate” Donald Trump, after the Kremlin chief praised the US leader and said he was ready for talks with him.\n\nKyiv earlier warned against any Putin-Trump peace talks on the near three-year war without its and European participation.\n\n“He wants to manipulate the desire of the President of the United States of America to achieve peace,” Zelensky said during a daily evening address on social media. “I am confident that no Russian manipulations will succeed anymore.”\n\nHe said Putin, who launched the full-scale invasion of Ukraine in February 2022, was ready to continue the war and “manipulate the leaders of the world”.\n\nPutin had earlier praised Trump as a “smart” leader who might have prevented the conflict from starting.\n\nThe Russian leader did not say when talks would take place, and the Kremlin said Friday it was still waiting for “signals” from Washington, despite Trump announcing Thursday he was willing to meet Putin “immediately”.\n\n“We have always said, and I want to emphasise this once again, that we are ready for these negotiations on Ukrainian issues,” Putin told a reporter from Russian state TV.\n\nPraising Trump as a “smart” and “pragmatic” man, Putin also repeated the Republican’s unfounded claim that he won the US presidential election against Joe Biden in 2020.\n\n“I cannot but agree with him that if he had been president – if his victory hadn’t been stolen in 2020 – then maybe there would not have been the crisis in Ukraine that emerged in 2022,” Putin said.\n\n– Pressure from Trump –\n\nThe Ukraine conflict has plunged relations between the two nuclear powers to their lowest levels since the Cold War.\n\nTrump, who was inaugurated on Monday, has called the conflict “ridiculous” and threatened Russia with tougher economic sanctions if it does not agree to stop its offensive.\n\n“If they don’t settle this war soon, like almost immediately, I’m going to put massive tariffs on Russia, and massive taxes, and also big sanctions,” the Republican said during a Fox News interview on Thursday.\n\nSpeaking at the World Economic Forum in Davos on the same day, Trump said he would ask Saudi Arabia and OPEC to lower oil prices, claiming: “If the price came down, the Russia-Ukraine war would end immediately.”\n\nPutin pushed back at Trump’s claim that lower oil prices might expedite the end of the conflict.\n\n“I have a hard time imagining there will be decisions taken that are detrimental to the American economy,” Putin said Friday.\n\n– ‘Come back to reality’ –\n\nNeither side has shown signs of de-escalating hostilities since Trump’s inauguration, despite the President claiming he would end the conflict in “24 hours” once in power.\n\nKyiv on Friday warned against being excluded from any talks.\n\n“He (Putin) wants to negotiate the fate of Europe – without Europe. And he wants to talk about Ukraine without Ukraine,” the head of Ukraine’s presidential office Andriy Yermak said.\n\n“This is not going to happen. Putin needs to come back to reality himself, or he will be brought back. This is not how it works in the modern world.”\n\nRussian aerial attacks near Kyiv killed three people and wounded several others, Ukrainian officials said Friday, while Ukraine fired 120 drones at least 12 Russian regions, including the capital Moscow.\n\nThe Kremlin has launched drone or missile attacks at Kyiv almost every day since sending troops into Ukraine in February 2022, ostensibly targeting military and energy facilities.\n\n“Three people were killed in an enemy attack in the Kyiv region,” the emergency services said in a statement on social media.\n\nFragments of a drone had struck a 10-storey residential building after the head of the region said a private home had also been hit, it added.\n\nBlack smoke billowed from a residential building damaged in the strike as rescue workers hauled out the bodies of the victims, official images from the scene showed.\n\nIn Russia, the Ukrainian military said it launched an overnight drone attack striking an oil refinery, power station facilities and an electronics plant.\n\nState media reported that a microelectronics factory had halted work after six Ukrainian drones damaged production and storage facilities in the Bryansk region.","summary":"Ukrainian leader, Volodymyr Zelensky, on Friday warned that his Russian counterpart, Vladimir Putin, wanted to &#8220;manipulate&#8221; Donald Trump, after the Kremlin chief praised the US leader and said he was ready for talks with him. Kyiv earlier warned against any Putin-Trump peace talks on the near three-year war without its and European participation. &#8220;He wants \n\n\n \n Read More","url":"https://punchng.com/putin-wants-to-manipulate-trump-on-ukraine-zelensky/","image":"https://cdn.punchng.com/wp-content/uploads/2024/07/16101245/vladimir-putin-and-volodymyr-zelenskyy-1200x630.jpg","video":null,"publish_date":"2025-01-24 23:51:03","author":"Agency Report","authors":["Agency Report"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.354},{"id":283648422,"title":"US deports hundreds as Trump begins crackdown on illegal immigrants","text":"Hundreds of illegal immigrants have been deported from the United States following a directive from President Donald Trump to crack down on illegal immigration.\n\nTrump had on his first day in office signed a series of executive orders aimed at tackling illegal immigration.\n\nHe also declared the situation at the United States and Mexico border as a national emergency, just as he designated criminal cartels as terrorist organisations. The US president stopped the practice of granting automatic citizenship to children born in the US to undocumented immigrants.\n\nTrump also signed an order suspending the US refugee resettlement programme for four months.\n\nAn enforcement operation began this week.\n\nAccording to White House Press Secretary, Karoline Leavitt, 538 illegal immigrants were arrested in the first round of operations. \n\nShe wrote in a post on her X handle on Thursday, “The Trump administration arrested 538 illegal immigrant criminals, including a suspected terrorist, four members of the Tren de Aragua gang, and several individuals convicted of sex crimes against minors.”\n\nHowever, according to the CBS News on Friday, two deportation flights had arrived overnight in Guatemala.\n\nA Guatemalan migration official confirmed the arrivals, noting that one flight from El Paso carried 80 people, another flight from Tucson brought in 80 more, and a third flight from El Paso carried around 105 individuals.\n\nLeavitt confirmed that the operation was far-reaching, stating, “The Trump Administration has also deported hundreds of illegal immigrant criminals via military aircraft. The largest massive deportation operation in history is well underway.”\n\nThis marked the beginning of an intensified effort to curb illegal immigration as part of Trump’s broader immigration policies.","summary":"Hundreds of illegal immigrants have been deported from the United States following a directive from President Donald Trump to crack down on illegal immigration. Trump had on his first day in office signed a series of executive orders aimed at tackling illegal immigration. He also declared the situation at the United States and Mexico border \n\n\n \n Read More","url":"https://punchng.com/us-deports-hundreds-as-trump-begins-crackdown-on-illegal-immigrants/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/13011858/df21c545-b4b8-4d85-ae96-507181573926.sized-1000x1000-1-1000x630.jpg","video":null,"publish_date":"2025-01-24 23:51:03","author":"Daniel Ayantoye","authors":["Daniel Ayantoye"],"language":"en","category":"politics","source_country":"ng","sentiment":-0.259},{"id":283651362,"title":"California Reservoir Update as Trump Criticizes State Water Supply","text":"As of Friday, most of California's major water supply reservoirs are performing above their historical average for this time of year.Why It MattersThe state's reservoir storage is updated daily and comes as President Donald Trump visits Los Angeles amid the raging wildfires that have left at least 28 people dead and caused thousands to evacuate.Firefighting challenges like Los Angeles fire hydrants running dry earlier this month have spurred more questions about the state of California's water supply, as well as drawn criticism from Trump.What To KnowAs of current reservoir water levels, most major California reservoirs are performing above their historical average. This doesn't mean they're full, though. For example, Lake Shasta, California's largest reservoir, located in the northern part of the state, is at only 76 percent of its total capacity, though this is 124 percent of its historical average for this time of year.Of the 17 reservoirs tracked by the current conditions on the California Department of Water Resources (DWR) website, only four are performing below average. They are Folsom Lake, Castaic Lake, Millerton Lake and Don Pedro Reservoir.Folsom Lake is at 37 percent capacity, which is 84 percent of its historical average. Castaic Lake is at 76 percent capacity, or 97 percent of its historical average. Millerton Lake is at 47 percent capacity, which is 81 percent of its historical average, and Don Pedro Reservoir is at 69 percent capacity, or 98 percent of its historical average.Many California reservoirs reached concerningly low levels in the summer of 2022 after battling years of drought, but an exceptionally wet winter the following year, and an average one last year, has allowed most of them to recover. For example, Lake Shasta and Lake Oroville both neared or reached capacity for the past two summers.Water levels at California reservoirs are expected to begin rising this spring, once snowmelt begins to take place. As of the January snowpack summary, snowpack in the northern Sierra Nevada mountains is 101 percent of average, but snowpack in the central and southern Sierra Nevada mountains is only 64 percent and 53 percent of normal for this time of year.However, Southern California has experienced an exceptionally dry start to the year, a situation that has contributed to the dry fuels consumed by the wildfires. Los Angeles is more than 5 inches behind its average rainfall to date so far this year, which is only 1 percent of normal.What People Are SayingA DWR spokesperson previously told Newsweek: \"The timing as to when reservoirs begin to rise each year is weather dependent and variable...Half of California's annual precipitation falls December through February, making those the key months for water managers.\"Trump, in an executive order directing the Secretary of Commerce and Secretary of the Interior to route more water from the Sacramento-San Joaquin Delta to other parts of the state, wrote: \"The recent deadly and historically destructive wildfires in Southern California underscore why the State of California needs a reliable water supply and sound vegetation management practices in order to provide water desperately needed there, and why this plan must immediately be reimplemented.\"DWR Director Karla Nemeth, in part of a statement responding to the order, said: \"It's important to point out that the Executive Order issued by President Trump does not change anything. Current 2024 policies remain in effect and there is no immediate impact to State Water Project operations.\"What Happens NextRain is supposed to arrive in Southern California beginning on Saturday. The heaviest rain will fall on Sunday. Meteorologists are hoping the wet weather pattern will provide a respite from the dry conditions.","summary":"Most of California's major water supply reservoirs are performing above historical average for this time of year.","url":"https://www.newsweek.com/california-reservoir-update-trump-criticizes-water-supply-2020696","image":"https://d.newsweek.com/en/full/2573353/california-reservoir-update-trump-visits.jpg","video":null,"publish_date":"2025-01-24 23:50:34","author":"Anna Skinner","authors":["Anna Skinner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.392},{"id":283650016,"title":"Pete Hegseth is only the beginning of Trump’s confirmation headaches","text":"The Senate is set for a late-night vote on Friday to confirm Pete Hegseth, Donald Trump’s nominee to lead the Pentagon.\n\nOn Thursday, a metaphorical bomb dropped when Sens. Lisa Murkowski of Alaska and Susan Collins of Maine announced their opposition to Hegseth. For a second, the Senate’s Mod Squad seemed to be the only Republicans who would voice their objections to Hegseth. \n\nSenate Majority Whip John Barrasso told reporters on Friday before the vote that he was not sure and that “we’re continuing to work on it.” That’s not the same as saying that they have a lock on votes. Even though only two Republicans defected when Senate Majority Leader John Thune invoked cloture there could still be additional holdouts.\n\nA Hegseth failure would make him the second nominee to go down after Matt Gaetz did not even make it to his attorney general confirmation hearing and had to be switched out by former Florida attorney general Pam Bondi.\n\nTrump so far has had a difficult go at getting his nominees confirmed at the rate he would want. On inauguration day, the Senate voted unanimously to confirm Marco Rubio, the former Florida senator, to be secretary of state. But that’s a low-ball given the old adage the Senate ends “partisan politics at the water's edge.”\n\n“I think Barack Obama had 12 done and we have two,” Sen. Rick Scott of Florida told The Independent. \n\n“If the Democrats want to make their lives miserable by voting at two in the morning, they can do so, but I believe within 30 days, the entire cabinet will be confirmed,” Sen. Ted Cruz told The Independent. \n\nThere is some hypocrisy; Republicans did the same thing with Democratic nominees throughout the Biden presidency. \n\nAnd Republicans can pass nominees without a filibuster because Democrats invoked the nuclear option on cabinet officials and judges during Barack Obama’s presidency after Republicans blocked those. And Mitch McConnell would not even give Merrick Garland a Supreme Court judicial hearing to keep the seat warm for Justice Neil Gorsuch.\n\nThe Senate is set to confirm South Dakota Gov. Kristi Noem, Trump’s nominee to lead the Department of Homeland Security, as soon as Saturday. The Senate already confirmed John Ratcliffe to lead the CIA in a 74-25 vote. \n\nBut next week will see perhaps Trump’s most controversial nominees up. On Wednesday, the Senate Finance Committee will hold its confirmation hearing for Robert F. Kennedy Jr., the anti-vaccine conspiracy theorist. On Thursday, he will speak before the Health, Education, Labor and Pensions (HELP) Committee. \n\nSen. Bill Cassidy, the chairman of the HELP Committee and a doctor from Louisiana who voted to convict Trump, has criticized those who parrot the debunked lie that vaccines cause autism. But ultimately, the Finance Committee will vote on Kennedy’s nomination. \n\nOn Thursday, the Senate Intelligence Committee will hold its hearing for Tulsi Gabbard, the former Democratic congresswoman who found religion in Trump, whom the president nominated to be his Director of National Intelligence. Gabbard has come under intense scrutiny for meeting with deposed Syrian president Bashar al-Assad. \n\nThe Intelligence Committee is relentlessly bipartisan; it vigorously investigated Russian interference in the 2016 presidential election and it is made up of an equal number of Democrats and Republicans. Expect questions not only about Assad, but also her previous remarks about Russian President Vladimir Putin. \n\nFinally, the Senate Judiciary Committee will hold its hearing for Kash Patel, a Trump loyalist and hardcore partisan, to become FBI director. Patel has called to root out the “deep state” that many in MAGA world believed undermined Trump’s first presidency and has said that China is sending “military-aged males” across the U.S.-Mexico and U.S.-Canada border to prepare for a pre-emptive strike. \n\nAll three hearings will not only do what Trump wants out of the Senate GOP--to bring it to heel--but also give him what he always enjoys: a spectacle. Trump wants to see these nominees fight and clash with a body that regularly served as a roadblock during the first Trump term. Whether it actually leads to hard confirmations is another question.","summary":"Robert F. Kennedy Jr., Tulsi Gabbard and Kash Patel all have their hearings next week, Eric Garcia reports","url":"https://www.independent.co.uk/news/world/americas/us-politics/pete-hegseth-confirmation-rkf-gabbard-b2686069.html","image":"https://static.independent.co.uk/2025/01/19/18/SEI236585039.jpg?width=1200","video":null,"publish_date":"2025-01-24 23:50:22","author":"Eric Garcia","authors":["Eric Garcia"],"language":"en","source_country":"gb","sentiment":-0.475},{"id":283648596,"title":"First illegal immigrant deportation flights take off on military aircraft","text":"Jan. 24 (UPI) -- This week, U.S. military and police forces began the first deportation flights for illegal immigrants under President Donald Trump's hardline immigration crackdown nationwide and particularly at the southern border.\n\nA large military C-17 Globemaster III aircraft assigned to the 60th Air Mobility Wing took off from Fort Bliss, Texas, on Thursday. The airlift was directed by the U.S. Northern Command's U.S. Transportation Command.\n\nA report in Air & Space Forces Magazine said that, while one C-17 took off from Biggs Army Air Field in Texas, another C-17 took off from Tucson, Ariz., on the same evening. The aircraft were headed to Guatemala, officials told the publication.\n\nSimilar flights are to be expected. This week's action at the southern border came as reports also revealed that the Trump administration was considering sending thousands of active-duty troops to the southern border to address illegal immigration issues, according to an internal memo viewed by journalists.\n\nAbout 10,000 troops were being considered for missions at the U.S.-Mexico border, according to one source.\n\nEarlier this week, Acting Secretary of Defense Robert Salesses released a statement on his department's \"Actions Responding to President Trump's Executive Order on Securing our Border.\"\n\nIn it, he said the Defense Department would provide military airlift to \"support DHS deportation flights of more than five thousand illegal aliens from the San Diego, Calif., and El Paso, Texas, sectors detained by Customs and Border Protection.\"\n\nHe said DHS would provide \"inflight\" law enforcement, as well.","summary":"This week, U.S. military and police forces began the first deportation flights for illegal immigrants under President Donald Trump's hardline immigration crackdown nationwide and particularly at the southern border.","url":"https://www.upi.com/Top_News/US/2025/01/24/mexico-immigration-first-deportation-flights/4411737759577/","image":"https://cdnph.upi.com/ph/st/th/4411737759577/2025/upi/a55806f3364265aa2e516c30c192cb00/v1.2/First-illegal-immigrant-deportation-flights-take-off-on-military-aircraft.jpg","video":null,"publish_date":"2025-01-24 23:48:56","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.146},{"id":283649214,"title":"Trump Selects Bozell to Lead Global Media Agency","text":"Last Updated on January 24, 2025\n\nBrent Bozell III, founder of conservative watchdog group Media Research Center, has been tapped by President Donald Trump to lead the U.S. Agency for Global Media (USAGM).\n\nThe USAGM is an independent agency of the United States government that oversees broadcast organizations like Voice of America and Radio Free Europe.\n\nBozell took to X to express his gratitude for the opportunity, on Wednesday. “There is lots of work to be done. I look forward to meeting with Senators ahead of my confirmation hearing to explore how best to ensure the priorities of the President are met,”, Bozell said in the social media post.\n\nBozell’s post included a screenshot of President Trump’s nomination announcement on Truth Social.\n\n“As Founder and President of the Media Research Center for 38 years, few understand the Global Media landscape in print, television, and online better than Brent. He and his family have fought for the American principles of Liberty, Freedom, Equality, and Justice for generations, and he will ensure that message is heard by Freedom-loving people around the World. Brent will bring some much-needed change to the U.S. Agency for Global Media,” wrote President Trump.\n\nThis nomination was not the only good news for the Bozell family – Bozell’s son, Leo Bozell, was a J6 defendant who was pardoned by the President on Tuesday. In May of 2024, Judge John D. Bates sentenced Leo to 4 years for breaking two windows at the Capitol, and assault on an officer – roughly a third of the nearly 12-year sentence originally requested by the government.\n\nIn his ruling, Judge Bates concluded that Mr. Bozell’s actions on January 6 could justify adding a terrorism enhancement to his sentence. However, the judge chose not to apply the enhancement when determining the final penalty, stating that given Leo the label of domestic terrorist would be too harsh.\n\nOn Thursday, WMAL Virginia interviewed Brent Bozell about his son’s involvement in J6, and the pardon that freed him. While his son admitted to breaking windows, and was willing to pay recompense for it, Bozell equates the charge of assault to “legal extortion”. Video of the event in question shows Leo Bozell’s jacket brush against that of a law enforcement officer, an action that appeared unintentional.\n\n“This is a man whose greatest prior legal offense was a traffic ticket; and now they wanted to equate him with Osama Bin Laden”, Bozell passionately stated. “I am so glad it’s over. Thanks to God. Hat tip to Donald Trump”, Bozell said.\n\nIn addition to his work at Media Research Center, Bozell was the founder of Parents Television Council: a media advocacy group that promotes responsible, family-friendly content across all media platforms and calls for advertisers to be held accountable for the content of the television programs they sponsor.\n\nThe CEO position, for which Bozell is nominated, requires Senate confirmation. If confirmed, Bozell will succeed Amanda Bennett, who resigned this week.\n\nView the X post here.\n\nListen to Brent Bozell’s WMAL interview here.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLast Updated on January 24, 2025 Brent Bozell III, founder of conservative&#8230;\n\n\nThis Post: Trump Selects Bozell to Lead Global Media Agency first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-selects-bozell-to-lead-global-media-agency/","image":"https://internewscast.com/wp-content/uploads/2024/01/ic_launcher.png","video":null,"publish_date":"2025-01-24 23:47:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.179},{"id":283652666,"title":"Mexico Denied A U.S. Deportation Flight As Deportees Are Flown Out Of Country By The Hundreds, Report Says","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nMexico refused to accept a U.S. deportation flight Thursday, according to NBC News, doing so after the Trump administration started the “largest deportation operation” in U.S. history and a series of deportation flights.\n\nThe flight was scheduled to take off Thursday night. (AP Photo/Julia Demaree Nikhinson)\nCopyright 2024 The Associated Press. All rights reserved.\n\nA U.S. military plane was blocked from beginning its flight to Mexico on Thursday night, according to NBC News, which cited two unnamed U.S. defense officials and a third person familiar with the matter.\n\nNBC reported it was not immediately clear why the flight was denied, though it did note rising tensions between Mexico and the U.S. as President Donald Trump has threatened to impose lofty tariffs on the neighboring country.\n\nThe flight was blocked after two other planes, Air Force C-17s bound for Guatemala, flew about 160 deportees out of the U.S., NBC reported.\n\nWhite House press secretary Karoline Leavitt said early Friday morning deportation flights had begun, marking the first deportation flights using military aircraft since President Dwight Eisenhower was in office, Reuters reported, citing an unnamed U.S. official.\n\nThe Mexican Embassy and the White House did not immediately respond to Forbes’ request for comment.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\n538. That is how many arrests U.S. Immigration and Customs Enforcement made Thursday.\n\nKey Background\n\nThe Trump administration said this week deportations will ramp up, with cities like Los Angeles, New York, Chicago, Denver, Washington, D.C., and Miami reportedly in its crosshairs. However, ICE and Border Patrol agents have been instructed to immediately focus on people who cross the border without authorization. Trump bolstered his anti-immigration operation with executive orders that will send 1,500 military troops to the border and prohibit advance appointments made by migrants, forcing them to wait in Mexico in the meantime. Trump also signed an executive order ending birthright citizenship in the U.S., though the policy, which automatically gives citizenship to anyone born in the U.S., is in limbo after a federal judge in Washington granted a request from Democratic state attorneys general to block Trump’s order.\n\nFurther Reading\n\nMexico refuses to accept a U.S. deportation flight (NBC News)\n\nDeportations Have Started, White House Says: Everything To Know About Trump’s Plan (Forbes)\n\nJudge Blocks Trump’s Birthright Citizenship Restrictions In Court—For Now: ‘Blatantly Unconstitutional’ (Forbes)\n\nFollow me on Twitter or LinkedIn. Send me a secure tip. \n\nAntonio Pequeño IV\n\nEditorial Standards\n\nForbes Accolades","summary":"The Trump administration began a large deportation operation this week, making 538 arrests Thursday.","url":"https://www.forbes.com/sites/antoniopequenoiv/2025/01/24/mexico-denied-a-us-deportation-flight-as-deportees-are-flown-out-of-country-by-the-hundreds-report-says/","image":"https://imageio.forbes.com/specials-images/imageserve/6794261f484bf94ae6243dc2/0x0.jpg?format=jpg&crop=2105,1402,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-24 23:47:18","author":"Antonio Pequeño IV,Forbes Staff","authors":["Antonio Pequeño IV","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.322},{"id":283655790,"title":"Secrets of why Melania Trump 2.0 is going to do things differently this time... with a vow that may make her more unpredictable than her husband","text":"She was mesmerising and unknowable beneath the brim of that severe Eric Javits boater, and equally enigmatic in her ice-cool take on My Fair Lady at the inaugural White House ball.\n\nWhen her husband, Donald Trump, leaned in close as they danced Melania, 54, seemed to give the new President barely even a flicker of acknowledgement.\n\nBut make no mistake. Behind that glacial exterior, there has been a seismic change in how Melania intends to handle her second stint in the White House.\n\nAs Kate Andersen Brower, author and First Lady historian, says: 'It's going to be Melania 2.0 in the same way it's Trump 2.0.\n\n'She's going to be much more confident in the White House and in her role.'\n\nAnd so, as Trump, 78, begins his second term with a bang, a tougher and more focused Melania is commencing what looks to be an extraordinary turn as FLOTUS.\n\nNot least because she's moving into the White House with a film crew in tow, something which would have been unthinkable for any of her predecessors.\n\nSphinx-like Melania, however, is set to reveal all with a documentary about her life.\n\nThe filming of interviews and general footage began last year in November during the closing stages of the campaign, when she was still at the Trump's Florida base, Mar-a-Lago.\n\nThe film will be released later this year on Amazon Prime, whose boss Jeff Bezos was among the tech titans bending the knee to Trump this week. The streamer has stumped up an astonishing $40million for the rights to the movie.\n\nMuch of that sum is, reportedly, finding its way into Melania's pockets, as she has a 'producer' credit. (Little wonder, perhaps, that Democratic political strategist James Carville, no doubt with a partisan axe to grind, referred to the purchase this week as 'payola' – meaning a corrupt payment in return for promotion.)\n\nWhy Slovenian-born Melania would want to kick off her second tenure as First Lady with such an obvious attempt to both burnish her public profile and enrich herself is an interesting question.\n\nIt's even more interesting because the documentary follows hard on the heels of 'Melania: A Memoir' which came out in October. \n\nCritics said the book was 'full of obfuscations' and didn't reveal much, but it was a number one New York Times bestseller, and one of the best-selling books of the year on Amazon, which will have earned her plenty of money.\n\nThis week she launched her own cryptocurrency. Now she and her husband each have their own.\n\nGiven these lucrative solo projects, observers have been wondering if Melania could be contemplating an end to her marriage when they leave the White House? Or does she just enjoy making money?\n\nMs Brower thinks it's simply down to the latter and said: 'You get no pay as First Lady. There's nothing in the constitution that describes her role.\n\n'Michelle Obama gave up her job and wasn't making money. It's been seen historically as tacky.\n\n'In a way, by monetising that position it diminishes it.\n\n'But Melania has 'Trumpified' the role of First Lady. There's a level of greed we haven't seen before. \n\nShe's recreating the role. We see it in her fashion choices, her cryptocurrency, her book. She's more public than she was but she's going to do it on her terms.'\n\nMs Brower spoke about how Melania has a vested interest in 'White House history' and how she is 'very much in touch with the White House Historical Association and a huge fan of Jackie Kennedy'.\n\nShe added: 'It's not as if she doesn't understand the role, but I believe she's taken the view that she doesn't need to make everyone happy.\n\n'There's a feeling that if anyone's going to make money from her name, it's going to be her…\n\n'There's a feeling they [the Trumps] go after people that are making a penny by writing about them [like former aides Stephanie Winston Wolkoff and Stephanie Grisham] because all of that money should be theirs.'\n\nMs Wolkoff produced a book, Melania and Me in 2020, which was full of quotes directly from Melania as she had secretly recorded their conversations.\n\nShe was hit with a civil suit for breaking a non-disclosure agreement, which was eventually dropped in 2021. \n\nAs for Ms Grisham, she was Melania's Chief of Staff but turned on her boss after the Capitol riots in 2021. \n\nShe testified that she asked Melania in a text if she could 'at least tweet that 'While peaceful protest is the right of every American, there's no place for lawlessness or violence.' \n\nMelania gave a one-word response, 'No.'\n\nAs that single word indicates, the First Lady is as steely as her husband. But unlike her first time as FLOTUS, when Melania was seen as a chilly presence at her husband's side at public events, Ms Brower thinks Melania now realises the importance of shows of unity.\n\n'I think we see them being more affectionate.\n\n'We'll see her standing by him because of the trauma of the assassination attempts. That has really rocked her world, as it would for anyone, and it made her affirm her commitment to him.\n\n'First time around we saw her swatting her husband's hand away. I predict more PDA from the White House, whether people like it or not.'\n\nIndeed, during this term, Melania has already said she'll be moving fully into the White House having made waves staying away from her husband last time.\n\nPreviously, she remained in New York while son Barron, now 18, was in school – quite a statement of her priorities, as even Michelle Obama moved her two young daughters to Washington halfway through their school year when her husband was elected President.\n\nBut Melania stood her ground, insisting Barron's education should not be disrupted, despite the reported costs in flights and security being $125,000 a day. He is now at university.\n\nHer wilfulness continues to burn strongly, however, as Melania told Fox News last week: 'The first time... I just feel that people didn't accept me, maybe. \n\nSome people, they see me as just the wife of the president, but I'm standing on my own two feet, independent. I have my own thoughts.'\n\nThis single-mindedness was further developed, says Mary Jordan – an associate editor at the Washington Post who wrote a biography of Melania called\n\nThe Art of Her Deal – in the embattled final period of her tenure as First Lady.\n\n'People close to Trump's world tell me that part of it is the bunker mentality, that she, her son and her husband have come under intense criticism,' says\n\nMs Jordan. 'He was impeached, twice, and she was upset about that.\n\n'There were embarrassing [criminal] trials, especially to her. She feels that this criticism of him really has brought them closer.'\n\nAnd it's from her husband that she has learnt the most about how to survive as a Trump, and how to protect her own interests.\n\nAs Ms Jordan puts it: 'She has a ringside seat to how he negotiates and if you read his books, when you have leverage [that's] when you move in. When he entered politics all of a sudden she had new leverage.\n\n'She saw her moment and if he wanted her to go to Washington, to do something that she did not sign up for, they needed to renegotiate the prenup.\n\n'I talked to a lawyer who did one of his prenups – not the Melania one, but for Marla Maples, his second wife – and it was incredible how little she got.\n\n'Melania – I didn't get specifics – wanted a more equal share for Barron. I think she's very smart and a good negotiator.' \n\nThere's no denying, that for all this apparent wiliness, Melania's first entry to the East Wing – where the office of the First Lady is located – was naive and ill-prepared.\n\n'In 2017, she was in the midst of a big feud with [her stepdaughter] Ivanka who took some of the [roles of] the First Lady,' says\n\nMs Jordan. 'This time she will be wiser and have better people around her.\n\n'Hopefully people that won't let her wear jackets with rude things on the back [referring to the infamous jacket Melania wore to a migrant child detention centre with 'I don't care' emblazoned it].' \n\nPerhaps it's the memory of this bruising experience that led to Melania enlisting Goldman Sachs bigwig John F.W. Rogers not long after her husband's re-election to advise her on hiring new staff.\n\nMr Rogers is a real fixture in the city's society circles, and with insiders like this behind her, it's clear Melania means business this time around.\n\nSpeaking about Melania's union with Trump, Ms Jordan says: 'It's unlike any political marriage I've ever seen. All couples are different but the amount of time they spend apart is extraordinary.\n\nI know she deeply admires what he's done and is appreciative for all he's done for her. She came from a former Communist country with not much and he knows she makes him look good.'\n\nHer modelling career, apparently, has influenced her approach to politics, says Ms Jordan: 'She's a perfectionist – she has to have every detail crossed and in politics there is no perfection.\n\n'That's why it's hard to be out there in the rough and tumble of politics.'\n\nOne wonders, then, how she will cope with the exposure of an up-close and personal documentary. The idea, Melania claims, was hers alone.\n\nBut why did Melania ask controversial director Brett Ratner to oversee it? Mr Ratner, of the Rush Hour and X Men movies, apparently met Melania via Marc Beckman, the United Agency CEO, who has acted as the First Lady's representative, overseeing her book deal.\n\nMr Beckman facilitated a meeting between the pair at Mar-a-Lago, after Melania indicated she liked Mr Ratner's films. \n\nShe was also, seemingly, well aware that Mr Ratner had been accused of tawdry sexual misbehaviour by female stars, which were published by the Los Angeles Times in 2017.\n\nHis accusers included actress Natasha Henstridge, who claimed he once forced her to give him oral sex, and X Men's Olivia Munn, who accused him of masturbating in front of her, when she was an aspiring actress. \n\n'He walked out,' she said, 'with his belly sticking out, no pants on, shrimp cocktail in one hand and he was furiously masturbating in the other.'\n\nMs Munn said she let out a 'startled scream' and raced out of the trailer. 'It wasn't a shock. It wasn't a surprise,' Ms Munn recalled. 'It was just, 'Ugh, sorry about that.'\n\nMr Ratner – who has been romantically linked to Paris Hilton and Lindsay Lohan – denied the claims, which do not appear to have been pursued legally, but was promptly cancelled by Hollywood.\n\nAt the time of the allegations, his attorney Martin Singer said Mr Ratner 'categorically' disputed the actresses' accounts.\n\nHe said: 'I have represented Mr Ratner for two decades, and no woman has ever made a claim against him for sexual misconduct or sexual harassment.'\n\nHis Melania documentary will be his first project since the accusations were made public in 2017.\n\nHis reputation, then, to put it mildly, is tainted. One wonders why Melania – having endured her husband's 'grab 'em by the p***y' comments – would invite links with such a man.\n\nApparently, Hollywood sources say, she liked the fact that he'd been 'cast aside' by the industry.\n\nTo Ms Jordan, this contrary attitude is entirely in keeping with her overall approach to her role as FLOTUS.\n\n'If you asked her [what she's going to do now], she would say I will do whatever I feel like.'\n\nOne can only wonder, who will be the more unpredictable Trump in the White House this time round: the President, or his wife?","summary":"As Trump, 78, begins his second term with a bang, a tougher and more focused Melania is commencing what looks to be an extraordinary turn as FLOTUS","url":"https://www.dailymail.co.uk/news/article-14323265/melania-trump-vow-different-unpredicable-husband.html","image":"https://i.dailymail.co.uk/1s/2025/01/24/22/94494221-0-image-m-23_1737759573867.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/01/3225134591153454286/1024x576_MP4_3225134591153454286.mp4","publish_date":"2025-01-24 23:46:57","author":"Alison Boshoff,Editor","authors":["Alison Boshoff","Editor"],"language":"en","source_country":"gb","sentiment":0.098},{"id":283653104,"title":"Trump Visits Southern California to Survey Wildfire Devastation, Eyes FEMA Overhaul | Capitol Report","text":"Jan-24-2025\n\nPresident Donald Trump is vowing to drastically reform the Federal Emergency Management Agency (FEMA). The remark came while he was surveying hurricane damage in North Carolina. What’s in his upcoming executive orders, and what has changed during his first 100 hours in office?\n\nCommunities are coming together to cope with Califo...","summary":"President Donald Trump is vowing to drastically reform the Federal Emergency Management Agency (FEMA). The remark came while he was surveying hurricane damage in North Carolina. What’s in his upcoming executive orders, and what has changed during his first 100 hours in office? Communities are coming together to cope with California wildfires and the devastation [&#8230;]","url":"https://www.theepochtimes.com/epochtv/trump-visits-southern-california-to-survey-wildfire-devastation-eyes-fema-overhaul-capitol-report-5798323","image":"https://img.theepochtimes.com/assets/uploads/2025/01/24/id5798608-Captiol_0124_v1.jpg","video":null,"publish_date":"2025-01-24 23:46:49","author":"Steve Lance","authors":["Steve Lance"],"language":"en","source_country":"us","sentiment":-0.145},{"id":283649208,"title":"Commencement of A$AP Rocky’s weapon trial in Los Angeles","text":"The shooting trial against popular rapper A$AP Rocky began Friday with opening statements in Los Angeles.\n\nThe 36-year-old hip-hop rapper, whose real name is Rakim Mayers, is accused of firing a gun at a former friend and bandmate during a heated exchange in 2021 in Hollywood.\n\nMayers has pleaded not guilty to two felony counts of assault with a semiautomatic firearm. Prosecutors say he shot in the direction of fellow rapper Terell Ephron, who went by the name A$AP Relli.\n\nIn their opening statement, prosecutors painted Mayers as an aggressive attacker who set in motion a plan to shoot his childhood friend over an argument.\n\nProsecutor Paul Bradley Przelomiec told jurors that Mayers and other members of his A$AP rap collective were walking down the street when he pulled a semi-automatic pistol from his waistband and pointed it toward Ephron while saying, “I’m going to kill you.”\n\nThe two were supposed to have been meeting to settle their grievances from a dispute the night before. But things took a turn for the worse after the gun was drawn.\n\n“If you brought a gun, then you should shoot,” Ephron told Mayers, according to Przelomiec, adding that moments later, Mayers fired his weapon grazing Ephron’s knuckles.\n\nEphron also told authorities shortly after the shooting that he believed one of the bullets grazed his left hand.\n\nMayers was dressed in a grey suit with his hair braided and kept a straight face, at times reclining back in his chair during the opening of the trial.\n\nDefense attorneys laid out the story of a bitter friend envious of Mayers’ success in the entertainment industry in their opening statement.\n\n“This case is about one man’s jealousy, which lies in green,” defense attorney Joe Tacopina said. “This case is all about money, a clear attempt at extortion. Period, end of story.”\n\nTacopina accused Ephron of assaulting Mayers twice on the night of the alleged shooting, fueled by anger and allegations that Mayers didn’t pay for the funeral of a fellow member in their rap group.\n\n“He embarked on a dangerous course of action,” the defense lawyer said.\n\nJury selection in the trial began Tuesday in Los Angeles County Superior Court. Mayers faces up to 24 years in prison if convicted.\n\nFormer L.A. County District Attorney George Gascón said in 2022 that the shooting could have ended in tragedy.\n\n“Discharging a gun in a public place is a serious offense that could have ended with tragic consequences not only for the person targeted but also for innocent bystanders visiting Hollywood,” Gascón said in a statement.\n\nRocky, a Grammy-nominated artist, is the partner of singer Rihanna, with whom he shares two children.\n\nIn 2019, he was found guilty of assault in a Swedish court after he and two members of his entourage got into a street brawl.\n\nAlthough he avoided a long jail sentence, his case attracted widespread attention from President Donald Trump, reality TV star Kim Kardashian and singer Rod Stewart, who all called on Swedish authorities to release him, claiming he had been treated unfairly.\n\nWhile A$AP Rocky had early success with his rap albums in 2013 and 2015, he hasn’t released much music since. But he has managed to remain in the spotlight and will star alongside Denzel Washington in movie director Spike Lee’s “Highest 2 Lowest” later this year.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe shooting trial against popular rapper A$AP Rocky began Friday with opening&#8230;\n\n\nThis Post: Commencement of A$AP Rocky&#8217;s weapon trial in Los Angeles first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/commencement-of-aap-rockys-weapon-trial-in-los-angeles/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-AAP-Rocky-gun-trial-to-begin-in.jpg","video":null,"publish_date":"2025-01-24 23:46:17","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.24},{"id":283652014,"title":"Trump and Vance join March for Life anti-abortion activists in celebrating the movement’s gains","text":"WASHINGTON (AP) — President Donald Trump vowed to support anti-abortion-rights protesters in his second term as tens of thousands of demonstrators rallied in Washington on Friday for the annual March for Life.\n\n“We will again stand proudly for families and for life,” Trump declared in a prerecorded video address.\n\nProtesters had come to the capital for decades to call for the repeal of Roe v. Wade, which affirmed a constitutional right to an abortion. Now, with the repeal of Roe in 2022, they are now on the inside rather than the outside. With Trump’s return to the White House and Republicans in control of Congress, the activists want to build on their victories.\n\n“Our country faces the return of the most pro-family, most pro-life American president of our lifetimes,” Vice President JD Vance told the crowd in his in-person speech.\n\nVance hailed Trump’s previous actions on abortion, saying the president “delivered on his promise of ending Roe” and appointed hundreds of anti-abortion judges.\n\nAbortion was largely absent from the stack of dozens of executive actions in Trump’s first days of office. But he has already made quieter moves on abortion, including pardoning several right to life activists and using wording related to fetal personhood in an executive order rolling back protections for transgender people.\n\nDespite frigid weather, a festive atmosphere surrounded the event as activists showed up with multicolored hats and signs declaring “Life is our revolution” and “MAGA: Make Abortion Gone Again.”\n\n“This is a significant moment in history,” said Marjorie Dannenfelser, president of the Susan B. Anthony Pro-Life America group. “Yes, we have a march every year but this one is pretty special…There is a trifecta of pro-life Republicans in the White House and the House and the Senate.”\n\nKristen Cooper, 21, was among several thousand Students for Life America members attending. She said she was especially excited to be at the march with anti-abortion Republicans in the White House.\n\nShe said this march was her fourth but the first with a Republican administration. “It’s surreal, actually.”\n\nAnna Henderson, a teacher at a Catholic high school near Jackson, Michigan, was also attending her fourth march with a busload of her students.\n\n“Just because we have the backing of the administration doesn’t mean the fight is over,” she said. “We still need to change people’s hearts.”\n\nKristan Hawkins, president of Students for Life of America, said there is still work to be done, including calling on Trump to defund Planned Parenthood and offer resources such as paid family leave to women with unplanned pregnancies.\n\n“The march now ends on the backside of the U.S. Capitol to remind our representatives that abortion is not only a state issue, but also a local issue and also a federal issue,” she said.\n\nAngela Vasquez-Giroux, vice president of communications at Planned Parenthood Action Fund, which supports abortion rights, said: “We know exactly what is at risk and we know the hate and lies they will spew at the March for Life.”\n\nThe battle over abortion since the 2022 decision, has been in state courts and at the ballot box where voters in seven states approved ballot measures for constitutional amendments on reproductive freedom in November. Legislatures have been fighting back already with proposals that could make such measures more difficult to get passed.\n\nFlorida Gov. Ron DeSantis celebrated the 2024 defeat of an abortion rights amendment on the March for Life stage and boasted about his role in the state-funded campaign against the measure. Voters there supported a state constitutional amendment overturning a six-week abortion ban but Florida requires 60% to pass constitutional amendments in the state. Most states require a simple majority.\n\n“Most elected officials will say ‘Look, what’s on the ballot is not their issue — the people can decide,'” DeSantis told the crowd. “And they wash their hands of it and walk away.”\n\nSupporters of abortion rights spoke up, too.\n\n“No matter what they said on the campaign trail to win an election, this shows their intentions to continue to attack abortion access,” Ryan Stitzlein, vice president of political and government relations for the national abortion rights organization Reproductive Freedom for All, said of abortion-rights opponents.\n\n“Each time one of these has taken place since the Dobbs decision, it’s been a day to reflect on how much damage that’s been caused by that decision and the crisis we continue to live in.”\n\nEllie Smeal, president and founder of the Feminist Majority Foundation, said her group would counterprotest.\n\n“We want to remind people of the popularity of abortion rights and the importance of this issue, that women and men are supportive of people making their own reproductive health decisions,” she said.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump vowed to support anti-abortion-rights protesters in his second term as tens of thousands of demonstrators rallied in Washington on...","url":"https://wsvn.com/news/politics/trump-and-vance-join-march-for-life-anti-abortion-activists-in-celebrating-the-movements-gains/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/01/012425-Abortion-Pro-Life-March-For-Life.png","video":"https://house-fastly-signed-us-east-1-prod.brightcovecdn.com/media/v1/pmp4/static/clear/4368278029001/7926571c-c19b-4c43-b243-b7e01660c6a2/74801bb0-44ac-4207-9032-6b1704772790/main.mp4?fastly_token=Njc5NDdlMmJfNDkwNjhhNjVmZTg2OWQxOTE0YmRhMmI4ZDliNDY3MGI1N","publish_date":"2025-01-24 23:45:42","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.166},{"id":283648908,"title":"'So Sorry': Jewel Begs for Forgiveness After Singer Gets Hit With Brutal Backlash Following Decision to Perform at RFK Jr. Party","text":"Jewel wants her fans to know she's \"so sorry\" for deciding to perform at Robert F. Kennedy Jr.'s inauguration day ball.\n\nThe 50-year-old took to Instagram to explain the reasoning behind her decision, claiming it was to shed some light on the mental health crisis in this country, RadarOnline.com can reveal.\"As many of you know, I am a mental health advocate. If there’s anything that I’ve learned in the past 20 years, it’s that mental health affects everybody’s lives across party lines,” Jewel – who performed Somewhere Over the Rainbow at the \"Make America Healthy Again\" event – said.\n\nShe continued: \"I reached out to the last administration, spoke with the surgeon general about the mental health crisis that’s facing our nation. I don’t know if you guys know the stats, but it is bleak.”\n\nThe Foolish Games hitmaker explained she couldn't afford waiting to work with people she only agrees with politically.“If I wait to try until I agree 100% with the people that might be willing to help me, I’d never get off the bench,\" Jewel said in the video. \n\nShe added: \"I don’t think that’s how activism works, waiting until everything’s perfect enough to participate. It’s actually… because things are so imperfect that we have to find ways to engage and to participate. And we have to act now. We cannot wait another four years.”\n\nJewel said she believes there are certain people in Donald Trump's administration “that are willing to help on this issue,” even though “I do not agree on all the politics.”Jewel continued: \"If I can help shape policy, make sure mental health is in the conversation... If I can help put resources or mental health tools into the hands of the most vulnerable who need it, I’m going to try and I’m going to fight. \n\n\"And I understand that my words were overly simplistic. Half of our country feels hope right now, and I honor that. And half of our country feels disenfranchised and scared and vulnerable, and that is unacceptable.”\n\nThe performer then apologized to her fans, and praised them for their support: \"You’ve made my life a better place. And I will not stop fighting. None of us can afford to stop fighting, and I really believe that the only way we can change is in relationship.\"\"It isn't in isolation or by isolating, it's by being in relationship, by reaching out, by having hard conversations, and I really hope that we can push through our hurt and move toward understanding on both sides,\" she added.\n\nAfter performing at RFK Jr.s party, fans were quick to bash Jewel, as one person claimed: \"She better get her jobs from MAGA because she is canceled.\"\n\nAnother added: \"Reviving a faded career seems to be a popular theme with Trump supporters,\" as one user reacted, \"What is it about MAGA that attracts all the washed up celebrities looking for attention and relevance?\"Jewel has had a couple last months as she's also been moving on after parting ways from Kevin Costner – the pair is said to have dated in 2024 before their split.\n\nDespite the breakup, the Yellowstone alum is said to still be hung up on Jewel, according to an insider.\n\n\"He really had high hopes of settling down with her but nothing he does seems to work. His friends think it's pathetic, but after he has a drink or two, he seems to think anything is possible,\" the source claimed.The insider added: \"... No one would blame him for feeling down and wanting to call Jewel late at night, drink in hand, but he's really not doing himself any favors.\"","summary":"Jewel posted an apology video on her Instagram, explaining why she decided to perform at RFK Jr.'s inauguration day ball.","url":"https://radaronline.com/p/jewel-apologizes-forgiveness-singer-decision-performs-rfk-jr-inauguration-ball/","image":"https://media.radaronline.com/brand-img/zjvnyyOok/0x0/jewel-apologizes-forgiveness-singer-decision-performs-rfk-jr-inauguration-ball-pp-1737756414377.jpg","video":null,"publish_date":"2025-01-24 23:45:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.319},{"id":283658858,"title":"Uniswap's $35M UNI AirDrop Makes Waves Following Jupiter's $630M Token Distribution","text":"NEW YORK, Jan. 25, 2025 /PRNewswire/ -- Uniswap, the world's leading decentralized exchange in the DeFi ecosystem, has unveiled its latest 2025 initiative: a $35M UNI AirDrop. As the news begins to ripple across the crypto community on the 24th, Friday, 2025, this landmark announcement sets the stage for Uniswap's next chapter of decentralized financial empowerment. Launching in the wake of Jupiter's record-breaking $630M JUP token distribution, this AirDrop is poised to capture the spotlight and redefine reward campaigns in the blockchain space. Uniswapâs $35M UNI AirDrop Makes Waves Following Jupiterâs $630M Token Distribution A Strategic Response to Airdrop Momentum Uniswap's AirDrop comes at a pivotal time for decentralized finance, following the tremendous success of Jupiter's Solana-based $630M JUP distribution. Jupiter's campaign not only propelled its market cap by 87% to $3.5B but also reinforced the power of airdrops as a key tool for driving user engagement and adoption. By launching its $35M UNI AirDrop so soon after, Uniswap is positioning itself to lead the next wave of innovation in DeFi rewards. \"We're excited to continue rewarding our users while driving adoption across the DeFi ecosystem,\" said Hari Sevugan, a spokesperson from Uniswap Labs. \"The success of airdrops like Jupiter's shows just how powerful community engagement can be, and with Uniswap's $35M AirDrop, we aim to take that impact to the next level V4 will bring to the blockchain realm.\" Aligned with Uniswap V4 and the Future of DeFi The $35M AirDrop also coincides with the highly anticipated rollout of Uniswap Version 4, which officially begins deployments this week. This latest iteration introduces a series of game-changing features designed to enhance efficiency, scalability, and user experience, further solidifying Uniswap's leadership in the decentralized finance space. Uniswap's decision to launch the AirDrop at this time reflects its broader strategy to drive growth and innovation while giving back to the community that helped the platform achieve a remarkable 102% year-over-year growth in 2024. The Broader Context: Trump's Vision for Blockchain Leadership The announcement also arrives amid a transformative moment for the cryptocurrency space. Former U.S. President Donald Trump has outlined bold plans to make the United States the global capital of blockchain and cryptocurrency. This vision has reinvigorated the crypto market, driving a wave of optimism and strategic initiatives from key players like Uniswap. With Trump's call for blockchain leadership setting the tone, Uniswap's $35M UNI AirDrop is more than just a user reward campaignâit's a signal of intent to maintain a leading role in shaping the future of decentralized finance. How to Participate Eligible participants can now claim their share of the $35M UNI AirDrop by visiting the official Uniswap website, where full eligibility requirements are outlined. The process is simple, secure, and designed to ensure fair access for Uniswap's loyal user base. The timing of this AirDrop reflects Uniswap's strategic awareness of the industry's momentum. With Jupiter setting a new benchmark for token distribution and Trump's bold vision sparking global crypto interest, Uniswap is leveraging this moment to further strengthen its community and reinforce its leadership. This is not just about distributing $UNI tokensâit's about driving engagement, enhancing liquidity, and positioning Uniswap as the go-to platform for decentralized finance. Together with its newly announced Uniswap V4 rollout, this AirDrop represents a comprehensive strategy to capitalize on the opportunities of 2025. Airdrop Buzz Across the Ecosystem The broader crypto space has been abuzz with activity. Jupiter's massive $630M JUP token distribution demonstrated the power of well-timed reward campaigns to boost engagement and market cap. Meanwhile, whale investors have reportedly begun accumulating $UNI in response to Uniswap's latest announcements, signaling strong confidence in the platform's long-term vision. Looking Ahead Uniswap's $35M AirDrop underscores its commitment to fostering financial inclusion and empowering its global user base. As decentralized finance continues to expand, initiatives like this serve as a reminder of the transformative power of blockchain technology. Uniswap invites all eligible participants to act quickly and secure their share of the $35M UNI AirDrop. Visit the official Uniswap website to learn more about the eligibility requirements and join the DeFi movement. About Uniswap Uniswap is the leading decentralized exchange (DEX) in the DeFi ecosystem, offering users seamless access to cryptocurrency trading, liquidity provision, and innovative financial tools. Dedicated to decentralization and user empowerment, Uniswap is shaping the future of finance. Contact: Matthew Eldermediapress@uniswap.org","summary":"NEW YORK  Jan  25  2025  PRNewswire  -- Uniswap  the world s leading decentralized exchange in the DeFi ecosystem  has unveiled its latest 2025 initiative  a  35M UNI AirDrop  As the news begins to ri   ...","url":"https://kalkinemedia.com/news/prnews/uniswaps-35m-uni-airdrop-makes-waves-following-jupiters-630m-token-distribution","image":"https://kalkinemedia.com/storage/uploads/large/1695367561_650d4189d32c8_1692951951_64e8658fe70f4_breaking_news_600.png","video":null,"publish_date":"2025-01-24 23:43:00","author":"Cision","authors":["Cision"],"language":"en","source_country":"au","sentiment":0.543}]}