{"offset":0,"number":50,"available":15461,"news":[{"id":300868274,"title":"Russia seeks NATO exclusion in Ukraine's peace treaty","text":"Russia will seek guarantees that NATO countries will exclude Ukraine from membership and Ukraine will remain neutral in any peace deal.\n\n\"We will demand that ironclad security guarantees become part of this agreement,\" Deputy Foreign Minister Alexander Grushko told the Russian media outlet Izvestia in remarks published on Monday.\n\n\"Part of these guarantees should be the neutral status of Ukraine, the refusal of NATO countries to accept it into the alliance.\"\n\nUS President Donald Trump is expected to speak to Russian President Vladimir Putin this week as military chiefs prepare to discuss peacekeeping plans in London.\n\nThe call, announced by US special envoy Steve Witkoff, comes as Putin continues to resist a US-backed proposal for a 30-day ceasefire in Ukraine.\n\nAlthough Ukrainian president Volodymyr Zelenskiy has accepted the proposed unconditional ceasefire, the Russian president has said Ukraine must agree to give up its ambitions of joining NATO and cede territory to Russia before any pause in hostilities.\n\nUK Prime Minister Keir Starmer has accused Putin of seeking to delay a ceasefire, while French president Emmanuel Macron has said the Russian president \"does not seem to be sincerely seeking peace\".\n\nBut on Sunday, Witkoff insisted that Putin was making \"a constructive effort\" and that the upcoming call with Trump showed there was \"positive momentum\".\n\nMeanwhile, military chiefs from the \"coalition of the willing\" convened by Starmer and Macron will meet in London on Thursday to discuss plans for a Western peacekeeping force to be deployed to Ukraine in the event of a ceasefire.\n\nSpeaking to French media ahead of the online summit that the UK hosted on Saturday, Macron said the French-British blueprint doesn't aim to deploy a \"mass\" of soldiers in Ukraine and instead envisages stationing troop contingents in key locations.\n\nAccording to La Dépêche du Midi and Le Parisien, the French president spoke of participating nations each deploying several thousand troops to \"key points\" in Ukraine.\n\nTheir missions could include providing training and supporting Ukrainian defences, to demonstrate long-term support for Kyiv.\n\nFollowing the virtual meeting on Saturday with the leaders of 26 other nations, plus representatives from the EU and NATO, Starmer said there had been \"new commitments\" offered and planning would now move into an \"operational phase\".\n\nBut it remains unclear which nations have committed troops to a peacekeeping operation, while several have suggested such talks are premature given the lack of a ceasefire.\n\nPutin is also likely to object to any agreement that involves European or NATO troops being stationed in Ukraine, although Zelenskiy sees this as essential to deterring future Russian aggression.\n\nMeanwhile, the fighting continues, with Ukraine said to be under increasing pressure in the eastern Donetsk region, part of which has been under Russian control since 2014.\n\nUkrainian troops are also reported to be in retreat in the Kursk region of Russia, which they seized in a surprise raid in August in an attempt to secure a bargaining chip for future negotiations.","summary":"Military chiefs from the \"coalition of the willing\" will meet in London this week to discuss plans for a Western peacekeeping force to be deployed to Ukraine.","url":"https://thewest.com.au/news/conflict/russia-seeks-nato-exclusion-in-ukraines-peace-treaty-c-18064490","image":"https://images.thewest.com.au/publication/C-18064490/5abcd6fcf09e9cf43236eab0a4a49da603898aee-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-03-17 01:09:55","author":"Staff Writers","authors":["Staff Writers"],"language":"en","category":"politics","source_country":"au","sentiment":-0.151},{"id":300867914,"title":"Musk floats drastic action against judge who blocked Trump's deportation of Venezuelan gang","text":"Elon Musk has voiced his support to impeach a federal judge who blocked President Donald Trump's deportation of Venezuelan gang members.\n\nThe president had sought to invoke the Alien Enemies Act of 1798 on Saturday in an effort to accelerate the deportation of alleged members of the notorious Tren de Aragua.\n\nHe declared that the US was facing an 'invasion' from a criminal organization that has been linked to kidnapping, extortion, organized crime and contract killings. \n\nBut just hours later, Judge James Boasberg issued a ruling blocking the suspected gang members' deportations for 14 days and ordered planes carrying the Venezuelans back to their home country return to the United States. \n\nOne plane was able to land, however, following an agreement between Salvadoran President Nayib Bukele and Secretary of State Marco Rubio to hold the suspected gang members at the country's notorious Terrorism Confinement Center.\n\nAmid the uproar over the ruling, Republican Congressman Brandon Gill vowed to file Articles of Impeachment against Boasberg - an Obama appointee.\n\n'Necessary,' Musk wrote as he shared the post on X.\n\nThe Trump administration is already appealing Boasberg's order to the DC Circuit Court of Appeals.\n\nUnder Trump's directive, all Venezuelan citizens 14 years of age or older who are determined to be members of the gang, are within the United States and are not naturalized or lawful permanent residents of the country are 'liable to be apprehended, restrained, secured, and removed as Alien Enemies.'\n\nHe claimed that gang members were 'conducting irregular warfare and undertaking hostile actions against the United States' with the goal of destabilizing the nation. \n\n'Over the years, Venezuelan national and local authorities have ceded ever-greater control over their territories to transnational criminal organizations, including TdA,' the president explained.\n\n'The result is a hybrid criminal state that is perpetrating an invasion of and predatory incursion into the United States, and which poses a substantial danger to the United States.'\n\nTrump then went on to argue that invoking the 18th century law is justified because he contends the Tren de Aragua gang has ties to the regime of Venezuelan President Nicolas Maduro. \n\nSaturday's directive also said that Tren de Aragua 'has engaged in and continues to engage in mass illegal migration to the United States to further its objectives of harming United States citizens.'\n\nDailyMail.com was the first news organization in the US to report on TdA arriving in America over a year ago, however, the gang became a household name after video of them storming an apartment near Denver surfaced in August.\n\nThe Trump administration has since designated Tren de Aragua, the Sinaloa Cartel and six other criminal groups as global terrorist organizations.\n\nBut Democrats and civil rights groups were quick to criticize Trump's use of the Alien Enemies Act to fuel mass deportations.\n\nIt has only ever been used three times before, all during wars.\n\nMost recently, the act was invoked during World War II, when it was used to incarcerate Germans and Italians as well as for the mass internment of around 120,000 Japanese and Japanese-American civilians.\n\nIt was also used during World War I and the War of 1812. \n\n'This proclamation is as lawless as anything the Trump administration has done,' Lee Gelernt, a lawyer with the American Civil Liberties Union, who argued in favor of an injunction at a hearing on Saturday said in an interview.\n\n'We are on very dangerous ground when the administration is going to try to use wartime authority, when we're at peace, for immigration purposes or any other non-military purpose.'\n\nBoasberg ultimately agreed.\n\nHe ruled that the Alien Enemies Act 'does not provide a basis for the president's proclamation given that the terms invasion, predatory incursion really relate to hostile acts perpetrated by any nation and commensurate to war.'\n\nBoasberg also claimed he needed to issue his order immediately because the federal government was already flying migrants it claimed were newly deportable under Trump's proclamation to be incarcerated in El Salvador and Honduras.\n\n'I do not believe I can wait any longer and am required to act,' he said during the Saturday evening hearing in a lawsuit brought by the ACLU and Democracy Forward.\n\n'A brief delay in their removal does not cause the government any harm,' Boasberg added, noting how the five remain in government custody but ordering that any planes in the air be turned around back to the US. \n\nUnder an agreement between Salvadoran President Nayib Bukele and Secretary of State Marco Rubio, though, the alleged gang members are being held at the country's Terrorism Confinement Center where they will spend 23 and a half hours each day locked in their overcrowded cells, with just 30 minutes to stretch - chained in the middle of the hallway.\n\nThe Trump administration hit out at the ruling, with Deputy Assistant Attorney General Drew Ensign contending that the president has broad latitude to identify threats to the country and act under the 1798 law.\n\nHe noted the U.S. Supreme Court allowed President Harry Truman to continue to hold a German citizen in 1948, three years after World War II ended, under the measure.\n\n'This would cut very deeply into the prerogatives of the president,' Ensign said of an injunction.\n\nAttorney General Pam Bondi also said Boasberg 'had supported Tren de Aragua terrorists over the safety of Americans' in his ruling. \n\n'This order disregards well-established authority regarding President Trump's power, and it puts the public and law enforcement at risk,' she said in a statement.\n\nStill, this is not the first time Musk has called for a judge to be impeached, arguing last month that US District Judge Paul Engelmeyer should similarly be ousted after the judge blocked the Department of Government Efficiency from accessing Treasury systems.\n\n'A corrupt judge protecting corruption,' Musk posted on X following the ruling. 'He needs to be impeached NOW.'\n\nMusk's call for Boasberg's removal from the bench also came just days after another federal judge ruled that thousands of 'probationary' employees who were fired as part of DOGE's efforts must be reinstated.\n\nU.S. District Judge William Alsup, a Bill Clinton nominee, called the large scale firings across government a 'sham' in a fiery decision, days after ruling that a government directive for the firings was 'unlawful.'\n\nThe ruling by the San Francisco based judge takes immediate effect, and applies to the Pentagon, the Department of Veterans Affairs, Department of Agriculture, Department of Energy, Department of Interior and the Treasury Department.","summary":"Elon Musk has voiced his support to take drastic action against US Judge James Boasberg, after he blocked President Donald Trump's deportation of Venezuelan gang members.","url":"https://www.dailymail.co.uk/news/article-14505437/Musk-impeach-judge-James-Boasberg-block-deportation-Tren-Aragua.html","image":"https://i.dailymail.co.uk/1s/2025/03/17/00/96256945-0-image-m-21_1742171610235.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/08/29/8352342017037845877/1024x576_MP4_8352342017037845877.mp4","publish_date":"2025-03-17 01:06:21","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.093},{"id":300866838,"title":"Malcolm Turnbull says Donald Trump will like ‘terrible’ AUKUS submarine deal","text":"Mr Turnbull, the architect of Australia’s original submarine deal with the French that was torpedoed by Scott Morrison in favour of the new deal with the US and Britain, has warned it could end up leaving Australia empty-handed.\n\n“AUKUS is a terrible deal. It is so unfair to Australia,’’ he told reporters in Canberra.\n\n“And the reason it is unfair is we are spending $3 billion US dollars to support the US submarine industrial base, but we have no guarantee we will ever get any submarines.\n\n“So the most likely outcome of AUKUS is that we will end up with no submarines of our own.\n\n“There will be Australian soldiers serving on US submarines and we will provide them with a base in Western Australia.\n\n“So we will have lost both sovereignty and security and a lot of money as well.\n\n“So people say, will Donald Trump like it? Well, of course he’d like it. It’s such a bad deal for us. His only thing at the back of his mind, he’ll be thinking: ‘who are these dumb guys that agreed to this deal?’”\n\nMORE:‘Hate’: Ivanka lifts lid on leaving Donald Trump\n\nThe AUKUS deal involves a trilateral security pact between Australia, the UK, and the US, with a focus on Australia acquiring nuclear-powered submarines, including both US-built Virginia-class submarines.\n\nMr Turnbull has previously suggested that Australia has been “mugged by reality” over the AUKUS submarine deal after the US announced it will halve the number of submarines it will build next year, raising fresh fears about the Australian end of the deal.\n\nThe Pentagon budget draft request includes construction of just one Virginia-class nuclear submarine for 2025.\n\nMORE:Inside the private homes of Aussie prime ministers\n\nAustralia at the “mercy” of the United States\n\nBut Mr Turnbull, an architect of the French submarine deal which was unceremoniously dumped by the Morrison government in favour of the AUKUS deal, said Australia was now at the mercy of the United States for a key part of its defence strategy.\n\nEarlier, Mr Turnbull told ABC Radio Sydney that the whole affair was “a fiasco.”\n\n“The fundamental problem is that we are very, very likely, I would say, almost certain, never to get any Virginia class submarines,’’ he said.\n\n“The Virginia class submarines are very good submarines, for sure. But the nature of the deal is that the Americans have no obligation to transfer them to us unless they conclude that their navy doesn’t need them and their Navy does need them and will need them.\n\n“We’re sending billions of dollars to the Americans to support their submarine industrial base. And the high likelihood is that, you know, by the early 2030s we will, in effect, have no submarines at all. And that’s a catastrophe.”\n\nPeter Dutton has “pulled the wrong rein”\n\nMr Turnbull also criticised Liberal leader Peter Dutton’s reluctance to support Australia joining a future peacekeeping force in Ukraine.\n\n“I think Dutton has pulled the wrong rein here actually. He should have thought about it more carefully. \n\n“Look, as Albanese has said, the peacekeepers only go in if there is peace. And what that means is that both sides to the conflict, in this case, Ukraine and Russia, agree for the peacekeepers to go in, and the peacekeepers are not there to fight anyone. \n\n“They’re basically there to monitor that the terms of the ceasefire are being complied with. So, you know, yes, of course, it’s dangerous, but, I mean, but there’s this, not as though they’re being sent in to fight with the Russians, right? \n\n“So they would only go in with Russian consent. Russian consent, at the moment, would not be given. \n\n“But the mistake I think that Dutton has made is that Australia should be lining up as being a supporter and a friend and with solidarity with the countries that are supporting Ukraine.\n\n“Now, you know that Albanese has done that. And that enables him to differentiate from Trump. Without saying anything critical of Trump, and it, it doesn’t decide. It plays into that idea that Dutton is too close to Trump.”","summary":"Former prime minister Malcolm Turnbull says Donald Trump will back the AUKUS defence pact because it’s actually “so unfair to Australia”.","url":"https://www.news.com.au/national/politics/malcolm-turnbull-says-donald-trump-will-like-terrible-aukus-submarine-deal/news-story/ac07a372ca8327939125e8ff08491e4f?from=rss-basic","image":"https://content.api.news/v3/images/bin/ba75f1491bafe4f3457e72fa212896b7","video":null,"publish_date":"2025-03-17 01:00:18","author":"Samantha Maiden","authors":["Samantha Maiden"],"language":"en","category":"politics","source_country":"au","sentiment":-0.52},{"id":300866840,"title":"Turnbull delivers savage AUKUS take-down","text":"Speaking at Parliament House in an impromptu doorstop interview, the former Liberal leader gave a savage critique of AUKUS.\n\n“People say: ‘Does Donald Trump like it?’ Well, of course he’d like it. It’s such a bad deal for us,” he said.\n\n“At the back at his mind, he’ll be thinking: ‘Who are these dumb guys that agreed to this deal?’” \n\nThe AUKUS pact, minted by his predecessor Scott Morrison and supported by the Albanese government, will result in Australia buying three to five Virginia-class submarines from the US. \n\nThe deal is estimated to cost up to $368bn, and receipt of the subs will depend on the US being able to sustain its navy capabilities. \n\nThe new arrangements with the United States also led to Australia abandoning the Turnbull-era deals with France, resulting in its President Emmanuel Macron accusing Mr Morrison of lying. \n\nMr Turnbull said the “most likely outcome” of Pillar 1 of the deal would be that Australia “(would) end up with no submarines of our own,” while suffering a loss of both “sovereignty and security and a lot of money as well”. \n\n“AUKUS is a terrible deal. It is so unfair to Australia, and the reason it is unfair is that we are paying US$3bn to the Americans to support their submarine industrial base, but we have no guarantee that we will ever get any submarines,” he said. \n\n“The US legislation and the terms of the deal state that before any submarine is transferred to Australia, the US president has to certify, among other things, that the transfer of the submarine would not degrade the undersea capabilities of the US Navy.\n\n“Right now, those submarines are the most valuable asset the US Navy has, and they’re nearly 20 short of the number they want.” \n\nJim Chalmers reiterated the government’s commitment to AUKUS, and said Mr Turnbull’s comments were consistent with his long-held views. \n\n“We see (AUKUS) as in our strategic interests, with big industrial benefits as well,” the Treasurer said. \n\n“It’s a long-term agreement which will survive changes of government on both sides of all sides of the equation, or three sides of the equation, but it’s in our interest, and we support it for all the reasons that we’ve outlined before.”\n\nIn February, Australia made its first US$500m instalment to the US, with US Secretary of Defence Pete Hegseth telling media Mr Trump was “very aware, (and) supportive of AUKUS”. \n\n“This is not a mission, in the Indo-Pacific, that America can undertake by itself. It has to be (done by) robust allies and partners,” he said at the time.\n\n“Technology sharing and subs are a huge part of it. He’s aware and appreciative for his support and leadership on that topic.”","summary":"Asked about whether Donald Trump will follow through with the US’ nuclear-submarine pact with Australia, the former prime minister did not mince his words.","url":"https://www.news.com.au/national/politics/former-prime-minister-malcolm-turnbull-says-aukus-deal-unfair-to-australia/news-story/6c3dcce602bb751fece0f8e4ef856054?from=rss-basic","image":"https://content.api.news/v3/images/bin/554c1d29581f0e0fe1bef8334a55d536","video":null,"publish_date":"2025-03-17 01:00:18","author":"Jessica Wang","authors":["Jessica Wang"],"language":"en","source_country":"au","sentiment":0.147},{"id":300865260,"title":"Are US tariffs bringing manufacturing back to Canada?","text":"A Canadian government report from last year found that there had \"not been signs of either large-scale or any notable increased reshoring by businesses\", but things could now be changing.\n\nRay Brougham has been trying to make inroads into the Canadian car manufacturing sector since establishing his company Rainhouse Manufacturing Canada in 2001. Based in British Columbia, it manufactures parts for a number of industries.\n\nThe North American car industry's integrated supply chains can see parts crossing the borders between the US, Mexico, and Canada multiple times before a vehicle is finally assembled.\n\nUS President Donald Trump said he would temporarily spare US carmakers from a new 25% import tax imposed on Canada and Mexico, just a day after the tariffs came into effect in March.\n\nBut in the shadow of a trade war, Mr Brougham says he has had \"good communications\" with a large Canadian auto parts company for the first time ever. \"All of a sudden they are interested in working closer with other Canadian companies.\"\n\nFor Mr Brougham and others, the benefits of reshoring are clear. From giving a leg up to small companies that have struggled to compete with manufacturers overseas, to ensuring fair wages, and the environmental benefits of importing and exporting fewer goods.","url":"https://www.bbc.com/news/articles/cn7vjlv7pzdo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/068e/live/b2322450-ffec-11ef-89b8-6f8a578323da.jpg","video":null,"publish_date":"2025-03-17 00:47:52","author":"Sam Gruet","authors":["Sam Gruet"],"language":"en","category":"business","source_country":"gb","sentiment":0.028},{"id":300868218,"title":"Respect for the law is essential, even when dealing with the deportation of criminal gang members, Elon Musk.","text":"Elon Musk has taken an interest in supporting a move to impeach federal Judge James Boasberg, who recently halted deportation flights for illegal-migrant gang members.\n\nThe notion of these flights is promising: Criminal organizations like Tren de Aragua and MS-13 have operated with impunity for too long, and current initiatives to crack down on them are a necessary response to the lax enforcement during the Biden administration.\n\nFormer President Donald Trump’s executive orders categorizing several gangs as terrorist groups are based on the violent and destructive activities these gangs engage in. They exhibit extreme brutality in their efforts to expand their territories across the United States, from Long Island to Colorado and other regions.\n\nSimply deporting them hasn’t proved enough — multiple members have slipped back in multiple times, and while Trump has stopped the mass illegal border-jumping of the Biden years, the gangs have the resources and sophistication to keep getting their people through.\n\nAnd, once here, they can not only hide among the 10 million illegal migrants admitted these last four years; they’re shielded by the left’s “sanctuary” laws and immigration-advocacy networks.\n\nBut the rule of law must hold: As legal authority for its actions, Team Trump is citing the 18th-century Alien Enemies Act, a law written to cover wartime situations that in the past has only been invoked during wars declared by Congress.\n\nThe “war” here is simply Trump’s presidential declaration that TdA is invading the country; challenging that in court is perfectly kosher, as is the judge ordering a holdoff on new flights until he can hear arguments in the case.\n\nNote that the administration did not defy Boasberg by letting the first two flights land in Honduras and El Salvador: While the judge made comments in court about calling the planes back, his final written order left that out.\n\nAnd however Boasberg ultimately rules, the case seems destined to go all the way to the Supreme Court. Can the feds simply declare anyone a TdA member before putting him on a plane off to an El Salvadoran prison?\n\nWhich makes it just plain silly for Musk to tweet “necessary” of a Texas rep’s plan to file to impeach the judge: It’s nothing of the kind, and cheering it only makes Musk look reckless — a reputation he doesn’t need when many DOGE actions also face court challenge.\n\nLook: The Biden crew took years to get the nation fully into this mess (and built on Obama-era and earlier mistakes, too); the Trump team can’t possibly fix everything overnight.\n\nThe country needs the courts to sort out a host of legal questions about everything from what advocates insist are illegal migrants’ rights to local obligations to cooperate with federal law enforcement.\n\nTrump stopped the bleeding at the border in his first weeks in office; undoing all the Biden-era damage will take a lot longer.\n\nAnd doing it with full regard for the rule of law truly is necessary.","summary":"Internewscast Journal\n\nInternewscast\n\n\nElon Musk has taken an interest in supporting a move to impeach&#8230;\n\n\nThis Post: Respect for the law is essential, even when dealing with the deportation of criminal gang members, Elon Musk. first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/respect-for-the-law-is-essential-even-when-dealing-with-the-deportation-of-criminal-gang-members-elon-musk/","image":"https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F03%2Fnewspress-collage-klbgyfj80-1742165838547.jpg?quality%3D90%26strip%3Dall%261742151549","video":null,"publish_date":"2025-03-17 00:45:53","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.348},{"id":300868212,"title":"'Back before long': Elon Musk all hearts as stranded Nasa astronauts expressed gratitude for rescue mission","text":"Elon Musk on Sunday reacted to a video showing long stranded Nasa astronauts Sunita Williams and Butch Wilmore expressing their gratitude towards US president Donald Trump and him. The clip, originally posted by the Daily Mail on March 6, has since gone viral.In the video, Williams reassured viewers about their return, saying, \"We are coming back before long, so don’t make all those plans without me. You know, we will be back before too long.\"Musk responded to the post with heart and rocket emojis, the reaction which has garnered over 4.6 million views over the platform.Butch Wilmore, meanwhile, expressed respect for Musk and US President Donald Trump, saying, \"All of us have the utmost respect for Mr Musk and honestly, respect and admiration for our president of the United States, Donald Trump. We appreciate them, we appreciate all they do for us, for human spaceflight, for our nation, and we are thankful that they are in the positions they are in.\"— elonmusk (@elonmusk) The video comes as Nasa’s two stranded astronauts finally prepare to return to Earth after spending over nine months in orbit. The SpaceX crew capsule successfully docked at the International Space Station (ISS) on Sunday, bringing four new astronauts from the United States, Japan, and Russia to replace Wilmore and Williams. The incoming crew will spend the next few days familiarising themselves with the station under the guidance of the outgoing astronauts.With their replacements now aboard, Wilmore and Williams are set to return home alongside two other astronauts aboard SpaceX’s Crew Dragon capsule. If weather conditions permit, the capsule is expected to undock no earlier than Wednesday, followed by a splashdown landing off the coast of Florida.","summary":"Elon Musk expressed his appreciation for NASA astronauts Sunita Williams and Butch Wilmore, who are set to return to Earth after over nine months in orbit. The SpaceX Crew Dragon capsule has docked at the ISS, and the astronauts will soon return with their replacements aboard.","url":"https://timesofindia.indiatimes.com/world/us/back-before-long-elon-musk-all-hearts-as-stranded-nasa-astronauts-expressed-gratitude-for-rescue-mission/articleshow/119093540.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-119093727/119093727.jpg","video":null,"publish_date":"2025-03-17 00:44:35","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":-0.195},{"id":300868282,"title":"AUKUS 'such a bad deal' for Australia: ex-Liberal PM","text":"Former prime minister Malcolm Turnbull has trashed the AUKUS partnership as a \"bad deal\" for Australia, amid concerns over the future of the trilateral security alliance.\n\nSpeaking at Parliament House, Mr Turnbull argued that Australia had \"no guarantee\" it would get any new US nuclear-powered submarines because everything depended on the American navy maintaining its own needs first.\n\n\"The most likely outcome of the AUKUS pillar one is that we will end up with no submarines of our own,\" the ex-Liberal leader told reporters on Monday.\n\n\"There will be Australian sailors serving on US submarines, and we'll provide them with a base in Western Australia.\n\n\"We will have lost both sovereignty and security and a lot of money as well. That's why I say it is a really bad deal.\"\n\nThe US Navy already has fewer submarines than it wants.\n\nAsked about reports that US President Donald Trump supported the AUKUS partnership, Mr Turnbull said \"of course he'd like it\".\n\n\"It's such a bad deal for us ... (Mr Trump) might be thinking, 'who are these dumb guys that agreed to this deal'?\"\n\nUS Defence Secretary Pete Hegseth last month said the president was supportive of the $368 billion deal after Australia made a $800 million down payment for the plan to acquire nuclear-powered submarines.\n\nUnder the agreement, Australia has been promised at least three Virginia class submarines from the US in the early 2030s, before a new fleet of boats is built for delivery from the 2040s.\n\nUS military officers have previously described the partnership as \"ironclad\".\n\nBut Mr Trump's pick for defence policy under-secretary, China hawk Elbridge Colby, has previously questioned selling submarines to Australia because it could leave the US Navy \"vulnerable\" if there was military conflict.\n\nA grassroots anti-AUKUS movement called \"Labor Against War\" has written to federal Labor MPs and candidates urging them to jump ship \"given the tremendous upheaval in US-Australian relations in recent days and weeks\".\n\nFormer Labor senator and campaign patron Doug Cameron said persisting with AUKUS would detract from the \"many achievements of Labor in office and strengthen those who would profit at the expense of peace and diplomacy\".\n\n\"The first few weeks of Trump's presidency demonstrates he is belligerent, untrustworthy and dangerous,\" he said.\n\n\"There are other more realistic and cost-effective strategies to protect our territorial integrity without subjugating ourselves to a dangerous, unpredictable and unworthy Trump administration.\"\n\nAUKUS is a three-nation security partnership involving Australia, the UK and the US.","summary":"Federal Labor has been urged to rethink the AUKUS partnership, as former Liberal prime minister Malcolm Turnbull continues to label it a \"bad deal\".","url":"https://thewest.com.au/politics/defence/aukus-such-a-bad-deal-for-australia-ex-liberal-pm-c-18064224","image":"https://images.thewest.com.au/publication/C-18064224/5c77419030115b57ef4c814dbe09352a30474ba3-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-03-17 00:43:46","author":"Tess Ikonomou,Tess Ikonomouaap","authors":["Tess Ikonomou","Tess Ikonomouaap"],"language":"en","source_country":"au","sentiment":-0.306},{"id":300865490,"title":"What the papers say – March 17","text":"A war of words over Labour’s proposed cuts to disability benefits leads Monday’s headlines.\n\nThe Guardian reports Prime Minister Sir Keir Starmer will “defy growing fury” and introduce welfare cuts that could see more than 600,000 claimants lose an average of £675 per month.\n\nThe Times reveals the overhaul, which includes stricter eligibility criteria, is likely to face opposition from both Labour MPs and cabinet ministers. The Labour mayor of Greater Manchester tells the newspaper people may become “trapped in poverty”.\n\nMetro splashes on comments from Health Secretary West Streeting, who said doctors write off too many people who should be working by “overdiagnosing” them.\n\nMeanwhile, the i Paper writes MPs have warned: “Anger is much stronger than No 10 realises.”\n\nAnd the Daily Mail says one in four young people have considered quitting the workforce entirely.\n\nIn the Daily Telegraph, the Education Secretary faces criticism from former Ofsted chief Amanda Spielman, who has accused the Government of yielding to “union demands”.\n\nThe Daily Express headlines the potential arrival of a “miracle drug” for cystic fibrosis, which could be available on the NHS by late August.\n\nThe Independent features a “special dispatch” from Ukraine, where medics on the ground say “no ceasefire will work”.\n\nThe Daily Mirror leads with an interview featuring Lady Sarra, wife of Olympian Sir Chris Hoy, who says that her husband’s terminal cancer diagnosis “can’t define us”.\n\nThe UK is set to be the warmest spot in Europe, with temperatures rising to 19C from St Patrick’s Day onward, according to the Daily Star.\n\nIn economic news, the Financial Times reports US shoppers are cutting back on spending amid uncertainty around president Donald Trump’s tariffs and market volatility.\n\nLastly, The Sun‘s front page splashes on a story about McFly’s Danny Jones and wife Laura.","summary":"Debate over Sir Keir Starmer’s planned welfare cuts dominate Monday’s front pages.","url":"https://www.standard.co.uk/news/uk/keir-starmer-anger-labour-debate-ukraine-b1217054.html","image":"https://static.standard.co.uk/2025/03/17/00/6f539b059fd30d6d2a5b0e35becf3c4cY29udGVudHNlYXJjaGFwaSwxNzQyMjU2NzM2-2.33243399.jpg?width=1200","video":null,"publish_date":"2025-03-17 00:43:12","author":"Jessica Coates","authors":["Jessica Coates"],"language":"en","source_country":"GB","sentiment":0.116},{"id":300864940,"title":"Oil Advances After China Lays Out Steps to Boost Consumption","text":"Crude has fallen by more than $10 a barrel from this year’s high in January, as US President Donald Trump’s escalating trade war, an OPEC+ decision to increase supply and a possible end to the war in Ukraine all weigh on prices. Trump may speak to Russian leader Vladimir Putin this week, as the US pushes for a deal to end the fighting in the three-year conflict.\n\nThe dour outlook led Goldman Sachs Group Inc. to lower its Brent crude forecasts, analysts including Daan Struyven said in a note on Sunday. The Wall Street giant also said oil demand growth would be lower than previous estimates as tariffs endanger global growth.\n\n“While the $10 a barrel sellof since mid-January is larger than the change in our base case fundamentals, we reduce by $5 our December 2025 forecast for Brent to $71,” the analysts said. “The medium-term risks to our forecast remain to the downside given potential further tariff escalation and potentially longer OPEC+ production increases.”\n\nMeanwhile, US military strikes on Yemen’s Houthi militants will be “unrelenting” until the group stops targeting civilian and military vessels in the Red Sea, Pentagon chief Pete Hegseth said on Sunday. That follows an order a day earlier from President Trump to attack sites in Yemen controlled by the Iran-backed Houthis.\n\nTo get Bloomberg’s Energy Daily newsletter in your inbox, click here.","summary":"Oil rose for a second day after China, the world’s biggest importer, said it would take steps to revive consumption by boosting incomes.","url":"https://financialpost.com/pmn/business-pmn/oil-advances-after-china-lays-out-steps-to-boost-consumption","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/03/oil-rises-after-china-lays-out-steps-to-boost-economy-beiji.jpg","video":null,"publish_date":"2025-03-17 00:41:48","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","source_country":"CA","sentiment":-0.008},{"id":300867910,"title":"Greens leader makes extraordinary AUKUS demand as he takes a swipe at Donald Trump: 'It puts Australia at risk'","text":"Greens leader makes extraordinary AUKUS demand as he takes a swipe at Donald Trump: 'It puts Australia at risk'\n\nAdam Bandt called for AUKUS to be scrapped\n\nREAD MORE: AUKUS question stumps Donald Trump \n\nPODCAST: Former White House Press Secretary Sean Spicer on Karoline Leavitt and the biggest myth about Trump. Listen to Welcome to MAGAland here\n\nBy ASHLEY NICKEL FOR DAILY MAIL AUSTRALIA\n\nPublished: 00:37 GMT, 17 March 2025 | Updated: 00:38 GMT, 17 March 2025\n\nGreens leader Adam Bandt has called for the Albanese government to ditch the AUKUS pact with the UK and US because of Donald Trump.\n\nMr Bandt fronted ABC's Insiders on Sunday to label the US President a 'very dangerous man' and claimed the pact, which offers increased security in the Indo-Pacific, put a 'Trump-shaped target' on Australia.\n\nAs part of the $368billion deal, Australia would buy several nuclear-powered submarines - a major upgrade to its ageing Collins-class submarines. \n\n'We should get out of AUKUS,' Mr Bandt said.\n\n'Now is not the time to be hitching Australia's wagon to Donald Trump. It puts Australia at risk.\n\n'It is billions of dollars that is being spent on submarines that might never arrive.' \n\nCommander Jeffrey Cornielle, the commanding officer of the USS Minnesota, addressed accusations the submarine deal would falter.\n\nDuring exercises showing off the Americans' advanced submarines on the West Australian coast, Commander Cornielle said Australia would 'operate a nuclear-powered, conventionally armed warship'.\n\nGreens leader Adam Bandt (pictured) called for Australia to pull out of the AUKUS agreement\n\nMr Bandt claimed Donald Trump's (pictured)p presidency put Australia at risk, all while the US seemed slow on submarine production\n\n'The role of the fast attack submarine, the submarine that I operate and I command, is so dynamic that everything changes on a dime, anything from weather, operations, things that are happening around the world - and we can answer at a moment's notice,' he said.\n\n'The things that this brings to our navy and to every navy that has nuclear-powered warships is significant and allows us to operate with essentially unlimited endurance, just limited by food.' \n\nMr Bandt's accusations come just weeks after a fleet of Chinese warships were spotted on Australia's east coast as part of an unannounced trip. \n\nThe Greens leader claimed if Australia were to be involved in a conflict, it was unlikely the US would come to its aid.\n\n'Thinking that Donald Trump will ride to our rescue if there's any security threat is now absolutely wishful thinking,' MR Bandt said.\n\nWith the federal election looming, Mr Bandt could soon play a bigger role in government decisions.\n\nAlthough his party dwindles in comparison to the two major parties, Labor is unlikely to form a majority government.\n\nThe results could see the party reach an agreement with the Greens to form a minority government. \n\nAs part of the deal, Australia is set to buy several nuclear-powered submarines - a major upgrade to its ageing Collins-class submarines\n\n'One commentator said that there's a 98 per cent chance of a minority government at this election,' Mr Bandt said.\n\n'After the next election we can get Labor to act on the crises facing this country, including the crisis in our public schools.'\n\nPrime Minister Anthony Albanese has denied his party will reach a deal with the Greens.\n\nHowever, Labor would require its support in the event of a hung parliament. \n\nMr Bandt said a Labor-Greens coalition was 'very unlikely' but he aims to form a 'stable, progressive and effective' relationship.\n\nDonald Trump\n\nShare or comment on this article:\nGreens leader makes extraordinary AUKUS demand as he takes a swipe at Donald Trump: 'It puts Australia at risk'\n\nAdd comment","summary":"Greens leader Adam Bandt has weighed in on the $368billion AUKUS pact.","url":"https://www.dailymail.co.uk/news/article-14505237/Adam-Bandt-AUKUS-Donald-Trump-submarines.html","image":"https://i.dailymail.co.uk/1s/2025/03/16/23/96256781-0-image-a-7_1742167426730.jpg","video":null,"publish_date":"2025-03-17 00:38:02","author":"Ashley Nickel,Editor","authors":["Ashley Nickel","Editor"],"language":"en","source_country":"gb","sentiment":-0.065},{"id":300867908,"title":"Karoline Leavitt eviscerates AP reporter's 'insulting' question just days after heated exchange","text":"White House Press Secretary Karoline Leavitt has slammed her testy interaction with an Associated Press reporter over tariffs.\n\nDuring a press briefing on March 11, reporter Josh Boak argued with Leavitt about whether President Donald Trump's tariffs are tax hikes or tax cuts.\n\nThe 27-year-old took the position that tariffs are 'a tax cut for the American people' and said Boak's question was 'insulting' because according to her, he was 'trying to test' her knowledge of economics. \n\nLeavitt joined Maria Bartiromo on her Fox News show 'Sunday Morning Futures' when she doubled down on her fiery response, adding that Boak 'clearly fails to see President Trump's long-term economic strategy.'\n\nShe said Trump's tariffs will 'bring in so much revenue' and 'so much wealth into our country' that the Republican party will be able to make good on its promise to pursue additional tax cuts.\n\n'[Boak] clearly didn't understand that very simple idea,' Leavitt said, before accusing the Associated Press and rest of the mainstream media of chasing viral moments instead of asking 'tough questions with honest integrity.'\n\nLeavitt's comments come as the AP was banned from 'pooled' Oval Office visits and Air Force One trips after the news wire service refused to adopt Trump's renaming of the Gulf of Mexico to the Gulf of America.\n\nBoak's interaction with Leavitt did nothing to mend the relationship between the White House and the nearly 180-year-old news outlet.\n\nBoak had asked Leavitt about an upcoming Trump speech to the Business Roundtable on that day, where he would later say his tariffs are 'having a tremendously positive impact.'\n\n'He's going there today as he's proposing tax hikes in the form of tariffs. And I'm curious he's not for why he's prioritizing that over the tax cuts,' the reporter asked, echoing business criticism that has crept into the discourse amid market jitters.\n\n'Not true - he's not doing that,' Leavitt interrupted the question.\n\n'Tariffs are a tax hike on foreign countries that, again, have been ripping us off. Tariffs are a tax cut for the American people, and the President is a staunch advocate of tax cuts,' Leavitt told him.\n\n'I'm sorry. Have you ever paid a tariff? Because I have,' the AP reporter tried to needle her. 'They don't get charged on foreign companies. They get charged on the importers.'\n\nLeavitt started off her response by talking policy.\n\n'Ultimately, when we have fair and balanced trade, which the American people have not seen in decades. As I said at the beginning, revenues will stay here, wages will go up, and our country will be made wealthy again,' said Leavitt.\n\nSome economists have argued there could be downside risks, like higher inflation, slower growth, an escalating trade war, or even a recession.\n\n'And I think it's insulting that you're trying to test my knowledge of economics and the decisions that this President has made. I now regret giving a question to the Associated Press,' she said.\n\nAfter twice delaying 25 percent tariffs on Canada and Mexico, once in February and once in March, Trump plans to resume the import taxes on April 2. \n\nHe has already hit China with first a 10 percent tariff, which he then doubled, bringing it to 20 percent.\n\nAs Trump's frustration with the media heightens, his administration has sought to tighten who is let in to key press briefings. \n\nIn late February, Leavitt also announced that the White House itself would be choosing which outlets would be represented in the press pool. \n\nThis broke over 100 years of precedent, since the White House Correspondents' Association, a group of journalists who cover the president, has been determining which reporters are given access since its inception in 1914.","summary":"Karoline Leavitt went on Fox News this Sunday to condemn a question she received from an Associated Press reporter this week that she deemed 'insulting.'","url":"https://www.dailymail.co.uk/news/article-14505439/Karoline-Leavitt-AP-reporter-insulting-question.html","image":"https://i.dailymail.co.uk/1s/2025/03/17/00/96257515-0-image-a-22_1742170237058.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/11/8971629910549839787/1024x576_MP4_8971629910549839787.mp4","publish_date":"2025-03-17 00:36:31","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","source_country":"gb","sentiment":-0.393},{"id":300865144,"title":"Canadians in several cities join 'Tesla Takedown' protests against Musk, Trump (Canada)","text":"Canadians in several cities have joined a series of \"Tesla Takedown\" protests happening across the United States and parts of Europe.\n\nProtesters say they have been moved to act by Tesla CEO Elon Musk's \"interfering\" in politics and his role advising U.S. President Donald Trump, who has in recent weeks slapped steep tariffs on Canadian goods, sparking an ongoing trade war, and repeatedly suggested Canada would be better off as the 51st state.\n\nAbout two dozen Metro Vancouver residents gathered outside a Tesla dealership in Surrey, B.C., on Sunday, holding signs with messages including \"elbows up\" and \"Elon be-gone.\"\n\nDual Canadian-American citizen Jen Gagnon helped organize the event and says following U.S. politics has \"felt like watching (her) childhood home burn down\" since Trump's election last fall.\n\nGagnon says she has been avoiding buying American products when possible, but she felt compelled to do more to push back against Trump, Musk and \"creeping\" fascism in Canada.\n\nAnother demonstrator, Juan Alperin, attended the protest with his 12-year-old son, saying he had been looking to take actions that ensure his son's future is \"as bright as the one that can be.\"\n\nAlperin is a professor in the faculty of communication, art and technology at Simon Fraser University, and says he's worried that deliberative democracy is declining while authoritarianism is rising.\n\n\"All of the platforms in which we communicate and talk to one another are controlled more and more by the tech oligarchy,\" he said, referring to platforms such as X, which is owned by Musk.\n\n\"We're seeing that the press is being owned by billionaires, the social media we use is owned by the same billionaires, and the alignment that is happening in the United States ... is just a more overt version of the same kind of thing that's happening in Canada.\"\n\nMusk is a self-described \"free speech absolutist\" who has faced criticism from hate-speech watchdogs for allowing extremist, dangerous and antisemitic comments to flourish on X.\n\nHe is also the world's richest person and runs his businesses as he advises Trump on ways to overhaul the federal government through the newly created Department of Government Efficiency.\n\nVancouver resident Andrew Balakshin was at Sunday's protest in Surrey and said he believed billionaires were \"interfering\" with politics in North America and Europe in ways they shouldn't be.\n\nBalakshin said he disagreed with a post Musk recently shared from another user on X saying \"Stalin, Mao and Hitler didn't murder millions of people. Their public sector workers did.\"\n\n\"I'm also against the attacks on Canadian sovereignty ... by saying Canada is not a country and that our prime minister is a governor,\" Balakshin said, referring to quips by Musk earlier this year.\n\nSunday's protest outside the Surrey Tesla dealership inspired a steady stream of honks of support from passing drivers.\n\nAn employee inside the Surrey Tesla dealership said they were not authorized to speak in response to the protests, and directed The Canadian Press to contact the company's media relations team.\n\nThe Tesla media team did not immediately respond to a request for comment on the protests.\n\nTesla has been a target for protests and vandalism since Musk became a key figure in Trump's administration.\n\nGunshots were fired at a Tesla dealership in Oregon this month, while four Cybertrucks were destroyed in a blaze in Seattle, but investigators have not said if the flames were sparked on purpose.\n\nThe \"Tesla Takedown\" protest events are posted on a website called Action Network, which individuals and community groups use to promote what the site describes as \"progressive causes.\"\n\nThe site shows dozens of protests scheduled across the United States through the rest of this month and into early April.\n\nThere were protests outside Tesla dealerships in Ottawa and Vancouver on Saturday, with another planned in Kitchener, Ont., later in March.\n\nGagnon, who moved to Canada from the United States about a decade ago, says the protests are partly aimed at encouraging people not to buy Teslas in hopes of reducing Musk's wealth.\n\nThe protests come a few days after British Columbia's Crown utility, BC Hydro, announced it was removing Tesla products from its electric vehicle rebate program.\n\nThe move is in line with B.C.'s efforts to prioritize Canadian goods and exclude American products from rebates when practical as the trade dispute between the two countries wears on.\n\n— With files from The Associated Press","summary":"Canadians in several cities have joined a series of &amp;quot;Tesla Takedown&amp;quot; protests happening across the United States and parts of Europe. Protesters say they have been moved to act by Tesla CEO Elon Musk&amp;#39;s &amp;quot;interfering&amp;quot; in politics and his role advising U.S. President Donald Trum...","url":"https://www.castanet.net/news/Canada/538937/Canadians-in-several-cities-join-Tesla-Takedown-protests-against-Musk-Trump","image":"https://www.castanet.net/content/2025/3/bef0d24609b37c0d163a462c15213412c335086aec1c35650506c63693acae75_p4164488.jpg","video":null,"publish_date":"2025-03-17 00:34:00","author":"Tesla Ceo Elon,The Canadian Press","authors":["Tesla Ceo Elon","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.222},{"id":300866566,"title":"Trump administration deports more than 200 Venezuelans as judge orders them returned","text":"WASHINGTON, (Reuters) The Trump administration has deported over 200 Venezuelans from the United States to a sprawling prison in El Salvador, even as a federal judge ordered their return to the U.S.\n\nThe White House said in a statement that it wasn’t defying the court but at the same time argued that it was perfectly within its rights to ignore the judge’s ruling.\n\n“A single judge in a single city cannot direct the movements of an aircraft carrier full of foreign alien terrorists who were physically expelled from U.S. soil,” White House press secretary Karoline Leavitt said in a statement.\n\nA federal judge in Washington, D.C., had earlier blocked President Donald Trump’s application of the Alien Enemies Act, an 18th century law best known for its use in rounding up U.S. residents of Japanese descent and placing them in internment camps without trial during World War II.\n\nTrump had sought to use the Act’s seldom-used wartime powers to rapidly deport alleged members of Tren de Aragua, a Venezuelan gang that has been linked to kidnapping, extortion and contract killings.\n\nIn a Saturday evening hearing, U.S. District Judge James Boasberg blocked the use of the law for 14 days, saying the statute refers to “hostile acts” perpetrated by another country that are “commensurate to war.”\n\nDuring the hearing, Boasberg said that any flights carrying migrants processed under the law should return to the U.S. His written notice hit the case docket at 7:25 p.m. ET (23:25 GMT).\n\nReuters could not immediately determine when the plane or planes carrying the deported Venezuelans landed in El Salvador, but footage published by the Salvadoran government showed men being hustled off a plane in the dark of night amid a massive security presence.\n\n“Oopsie… Too late,” El Salvador’s President Nayib Bukele posted to the social media site X above a headline, “Fed judge orders deportation flights carrying alleged Venezuelan gangbangers to return to the US.”\n\nBukele followed the comment by a laughing-so-hard-I’m-crying emoji. His statement was reposted by U.S. Secretary of State Marco Rubio, who later thanked Bukele for his “assistance and friendship.”\n\nIn a court filing on Sunday, the Trump administration said that “some” of the Venezuelans had already been removed from the United States prior to the judge’s order, but did not provide any further detail or comment. It was not clear how many people that it represented or under what circumstances they had been deported.\n\nThe American Civil Liberties Union, which challenged Trump’s use of the act, has asked the administration to ensure that it has not removed any migrants in violation of the order, lead ACLU attorney Lee Gelernt told Reuters.\n\n“If anyone was turned over to a foreign government after the court’s order, then we would hope that the United States government would work with that foreign government to get the individuals back,” Gelernt said.\n\nThe U.S. Department of Homeland Security, the State Department and the Salvadoran government did not respond to requests for comment.\n\nThe 238 men – alleged members of the Venezuelan gang – were being transferred to the Terrorism Confinement Center – a mega-prison that can hold up to 40,000 inmates – for a one-year period that could be renewed, Bukele said.","summary":"WASHINGTON, (Reuters) The Trump administration has deported over 200 Venezuelans from the United States to a sprawling prison in El Salvador, even as a federal judge ordered their return to the U.S.\n\n\nThe article Trump administration deports more than 200 Venezuelans as judge orders them returned appeared first on Stabroek News.","url":"https://www.stabroeknews.com/2025/03/16/news/world/trump-administration-deports-more-than-200-venezuelans-as-judge-orders-them-returned/","image":"https://s1.stabroeknews.com/images/2025/03/IMG_3727.webp","video":null,"publish_date":"2025-03-17 00:33:18","author":"Staff Editor","authors":["Staff Editor"],"language":"en","category":"politics","source_country":"gy","sentiment":-0.319},{"id":300866712,"title":"Polls predict pay rises for Hong Kong professionals, with some hitting 5%","text":"Surveys of hiring managers and companies have found that most professionals in Hong Kong can expect pay rises this year, with more than a third predicted to receive up to 2.4 per cent and others as much as 5 per cent.\nAt the lower end, the rate is above the latest official forecast of 1.8 per cent growth in headline inflation this year, while civil servants are facing a pay freeze amid the government’s efforts to tackle its HK$87.2 billion (US$11.2 billion) deficit.\nInternational recruitment agency Hays, which surveyed hiring managers from Hong Kong and five other jurisdictions late last year, said 77 per cent of professionals in the city could expect a raise this year.\n“The outlook in Hong Kong has improved from 2024, with organisations looking to provide increments to more working professionals this year,” the company said.\nIt surveyed 3,670 hiring managers and 8,790 professionals in Hong Kong, mainland China, Japan, Malaysia, Singapore and Thailand. They included 304 hiring managers and 746 professionals in the city.\nOnly a fifth of the organisations polled did not expect to adjust salaries, and 3 per cent said they would be making pay cuts.\nThe president of the Hong Kong Institute of Human Resource Management, Lawrence Hung Yu-Yun, said its pay trend survey last year projected a salary increase of 3 to 3.5 per cent for local employees in 2025.\n“Some industries with a high demand for talent, such as IT, private banking and insurance, may be willing to offer more, particularly through performance bonuses, to provide incentives and rewards for their staff,” he said.\nFrom the survey, the top three factors employers considered in pay reviews were company and business performance, individual staff performance and the economic situation.\n“We recognise that several macroeconomic factors and emerging developments will also influence the local pay trend this year, including the latest US tariffs on imports, interest rates in Hong Kong, domestic consumption and cross-border tourism,” Hung said.\nHe added the civil service pay freeze was likely to have a “relatively mild effect” on the private sector, which had mostly increased wages when the cost-saving measure was adopted, according to past surveys.\nThe Hays poll found that more than a third of professionals can expect to receive salary increases of up to 2.4 per cent, and almost a third were set to receive increments of between 2.5 and 5 per cent.\nOther industry surveys predicted pay rises of as much as 5 per cent.\nRecruitment agency Randstad’s survey of about 50 employers found over a third projected average increments of 3 to 5 per cent in their firms.\nThe findings come against the backdrop of Hong Kong’s sluggish economy, with growth slowing to 2.5 per cent last year from 3.2 per cent in 2023. Retail sales also declined for 11 consecutive months as of January, falling by 3.2 per cent year on year that month.\n\nIn his latest budget speech, Financial Secretary Paul Chan Mo-po said the government would record a deficit of HK$87.2 billion for 2024-25, largely owing to disappointing land sales revenue.\nAs part of measures to narrow the deficit, he announced the civil service pay freeze and said 10,000 positions would be cut by April 2027.\nArmstrong Lee Hon-cheung, managing director of recruitment agency Worldwide Consulting Group, said the various survey results matched his observations, and he expected most employees would receive pay rises of between 1.5 and 4 per cent.\nBut he was less optimistic about the prospects for next year, saying: “The economy is very uncertain, especially now that there are a lot of things affecting our economic development in the less than three months since [US President] Donald Trump entered office.”\nHe was also concerned about the impact of the pay freeze, saying it did not only affect civil servants, but also organisations supported by government subsidies and those that referred to authorities’ adjustments to determine salary changes for their own staff.\nLee advised employees in such organisations to prepare for a possible pay freeze too, although he urged employers to take time to observe the situation before making decisions.\nIn the past 25 financial years, civil servants often had salary raises, except for nine wage reductions or freezes, many happening during the 2000s.\nFor example, the last wage cut in 2009-10 took place after the financial crisis, which reduced the salaries of senior employees while keeping the rest of the workforce’s pay unchanged, saving HK$867 million.\nA 3 per cent across-the-board salary rise in 2024-25 resulted in an additional expense of HK$3.9 billion for the civil service.\nCivil servant salaries account for a significant portion of government spending. For 2023-24, staff-related costs soared to HK$156.2 billion, making up 25.98 per cent of the government’s operating expenditure. About HK$94.54 billion, or 60.5 per cent, was used to pay salaries and allowances.","summary":"Despite civil service pay freeze and uncertainty over Trump policies, managers polled see rewards for workers.","url":"https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3302598/polls-predict-pay-rises-hong-kong-professionals-some-hitting-5","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/17/103967b9-2fb7-4a7d-a370-ece86484402a_f3242295.jpg","video":null,"publish_date":"2025-03-17 00:30:18","author":"Harvey Kong","authors":["Harvey Kong"],"language":"en","source_country":"cn","sentiment":-0.134},{"id":300868928,"title":"Exporters take wind out of shippers’ sails","text":"A number of exporters in sectors like electronics, gems and jewellery, apparel and footwear are airlifting their consignments to the United States in a bid to deliver products ahead of April 2, when reciprocal tariffs announced by President Donald Trump are due to come into force, industry officials said.Spooked by the uncertainty induced by the US stance, these companies are braving a slew of logistical challenges to hasten delivery by air instead of the traditional mode of shipping their consignments. Exporters are doubling down on sending their consignments by air, Ajay Sahai, Director General of the Federation of Indian Export Organisations (FIEO) told ET. But this is only possible for limited varieties of products like smartphones and electronics, gems and jewellery, some footwear like sports shoes and some apparel. The uncertainty around tariffs has concerned exporters and is causing pressure, according to Sahai who pointed out that while “the orderbook is very strong, we are seeing that despatches (by shipping)are low.”Also Read: India's electronics manufacturing sector grapples with uncertainty over Trump's tariff threatTypically, companies looking to ship one hundred containers would split it as 50 containers over two months. But now, they are now taking it slow as buyers are asking them to send 25 containers in the first month and 25 containers each in subsequent three months, he added.India’s goods exports shrank for the third straight month, declining 2.38% on-year to $36.43 billion in January. Merchandise trade deficit widened to a two-month high of $22.99 billion from $16.56 billion a year ago and $21.94 billion in December 2024. This comes at a time when India aims to clock $800 billion in goods and services exports this fiscal year.ET reported on March 11 that India is considering incentives for exporters to arrest a decline in outbound shipments and mitigate potential impact of reciprocal tariff plans by the Trump administration.These incentives could be part of the Export Promotion Mission announced in the budget and are likely to be notified in a month. Though the government is yet to firm up the incentive structure for exporters, the Rs 2,250 crore Export Promotion Mission announced in the budget has room for flexibility in giving more incentives as the schemes are yet to be notified, an official had said at the time.Temporary MoveA top official at a grouping of exporters termed the rush to airlift consignments as an 'aberration' induced by the uncertainty of tariffs. More so, as only a fraction of the consignment can be transported by air compared to shipping of goods. We have limited flights, limited belly capacity and even limited freighters, he explained. And many bookings are generally done in advance, so it leaves very limited space for additional capacity. It is possible for smaller consignments and for certain high value shipments like electronics and gems and jewellery but even for those scurrying to make the April 2 deadline, it may not be adequate owing to these logistical challenges, the person added.However, container shipping associations point to the slow pace at which exporters are signing annual contracts with shipping lines, with some exportersdragging their feet. While the hesitancy on the part of some of the exporters on signing of their new annual contracts with the lines, which normally happen around this time of the year, is understandable, it would be in their (exporters’) own interest to sign up to secure rates and space for themselves, as spot rates are generally higher, with no guarantees on space, Sunil Vaswani, Executive Director at Container Shipping Lines Association (India) said.He added that with shipping line services having moved over the Cape of Good Hope instead of the Suez Canal/Red Sea, the space, cost and timely deliveries are only more critical, underscoring the increased importance of service contracts.Exporters optimisticDespite the uncertainty, several exporters are optimistic about a resolution to the tariff impasse. The prospect of India-US Bilateral Trade Agreement (BTA) is proving to be very reassuring for some.“Our customers are not panicking. India and the US are negotiating a BTA, and efforts are ongoing to balance the trade. There are no concerns on sending the goods via sea, Rafeeque Ahmed, chairman of the Farida Group, one of India’s largest shoe manufacturers and exporters said.A representative of the cotton textile industry said, “both sides ( US and India) have decided that the BTA will focus on Indian labour-intensive exports and India has been reducing tariffs on American imports. This is likely to continue and lower the impact of reciprocal tariffs. We are confident that the impact on Indian exports will be lower than other countries,” this person said.","summary":"Worried by the uncertainty from the US' incoming tariffs, exporters in sectors like electronics, gems, jewellery, apparel, and footwear are facing various logistical challenges to speed up deliveries by air, instead of using their usual shipping methods.","url":"https://economictimes.indiatimes.com/tech/technology/exporters-take-wind-out-of-shippers-sails/articleshow/119084542.cms","image":"https://img.etimg.com/thumb/msid-119084900,resizemode-4,width-1200,height-900,imgsize-131092,overlay-ettech/articleshow.jpg","video":null,"publish_date":"2025-03-17 00:30:00","author":"Dia Rekhi And Kirtika Suneja","authors":["Dia Rekhi And Kirtika Suneja"],"language":"en","category":"politics","source_country":"in","sentiment":-0.17},{"id":300865616,"title":"There are ‘no guarantees’ there will not be a US recession: Bessent","text":"WASHINGTON: There are “no guarantees” there will not be a recession in the United States, although there could be an adjustment, Treasury Secretary Scott Bessent said in an interview that aired on Sunday.\n\nBut Bessent, speaking to NBC’s “Meet the Press,” ruled out the chance of a financial crisis.\n\nUS stock markets closed down sharply last week amid mounting uncertainties arising from President Donald Trump’s frequently shifting policies, including tariff threats against the biggest US trading partners.\n\nAsked whether he could guarantee there would be no recession while Trump was in power, Bessent replied: “There are no guarantees. Who would have predicted COVID?”\n\nBessent said he was putting in robust policies that would be durable, saying the country needs to be weaned off what he called massive government spending.\n\nAsked whether an adjustment could lead to a recession, Bessent said, “There is no reason that it has to.”\n\nBessent dismissed concerns about recent stock market falls, saying corrections were healthy and that markets “will do great” if the administration puts into place good tax policy, deregulation and energy security.\n\n“We are going to have a transition, and we are not going to have a crisis,” he said.","summary":"WASHINGTON: There are “no guarantees” there will not be a recession in the United States, although there could be an adjustment, Treasury Secretary Scott Bessent said in an interview that aired on Sunday.\n\n\nBut Bessent, speaking to NBC’s “Meet the Press,” ruled out the chance of a financial crisis.\n\n\nUS stock markets closed down sharply last week amid mounting uncertainties arising from President Donald Trump’s frequently shifting policies, including tariff threats against the biggest US trading partners.\n\n\nAsked whether he could guarantee there would be no recession while Trump was in power, Bessent replied: “There are no guarantees. Who would have predicted COVID?”\n\n\nBessent said he was putting in robust policies that would be durable, saying the country needs to be weaned off what he called massive government spending.\n\n\nAsked whether an adjustment could lead to a recession, Bessent said, “There is no reason that it has to.”\n\n\nBessent dismissed concerns about recent stock market falls, saying corrections w","url":"https://www.brecorder.com/news/40353266/there-are-no-guarantees-there-will-not-be-a-us-recession-bessent","image":"https://i.brecorder.com/large/2025/03/170423367f1001a.jpg?r=042353","video":null,"publish_date":"2025-03-17 00:29:53","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.127},{"id":300865586,"title":"Fed likely to keep rates steady","text":"WASHINGTON: The US Federal Reserve is widely expected to keep interest rates unchanged at its policy meeting this week, treading carefully amid uncertainty over President Donald Trump’s economic policies, which include spending cuts and sweeping tariffs.\n\nSince January, Trump has imposed levies on major trading partners Canada, Mexico and China, and on steel and aluminum imports, roiling financial markets and fanning fears that his plans could tip the world’s biggest economy into a recession.\n\nThe Trump administration has also embarked on unprecedented cost-cutting efforts that target staff and spending, while the president has promised tax reductions and deregulation down the road.\n\nBut Fed Chair Jerome Powell emphasized this month that it is the “net effect” of policy changes that will matter for both the economy and monetary policy.\n\nAnalysts widely expect the central bank to hold the benchmark lending rate steady at 4.25 percent to 4.50 percent, after similarly doing so in January.\n\n“Recent Fed commentary has reinforced a wait-and-see approach, with officials signaling little urgency to adjust policy as they assess the economic impact of recent policy shifts,” said EY chief economist Gregory Daco.\n\nPowell himself has said that policymakers are focused on separating signal from noise as the outlook evolves.\n\n“We do not need to be in a hurry, and we are well positioned to wait for greater clarity,” the Fed chief added in a recent speech in New York.\n\nEconomist Michael Pearce at Oxford Economics said he expects the Fed will not want to “overreact” to early signs that inflation may pick up, or to indications that the economy is weakening more quickly than anticipated.\n\nThe Fed has previously kept rates elevated to tamp down inflation. Cutting rates, conversely, typically stimulates economic activity, providing a boost to growth.\n\n“It’s a bit of a dilemma for the Fed,” Pearce said, as there could be conflicting signals.\n\nING analysts expect the Fed to signal its base case remains two 25 basis point cuts this year, noting “there is no pressing need for additional rate cuts given that unemployment is low and inflation is still tracking hot.”\n\nIn February, government data showed that the unemployment rate was a relatively low 4.1 percent, with the labor market remaining stable.\n\nThe consumer price index — a gauge of inflation — came in at 2.8 percent for February as well, cooler than expected but still some distance from officials’ two percent target.\n\nThis boosts expectations that the Fed would proceed cautiously as it seeks to lower inflation sustainably.\n\nInflation is “likely to remain above target through the rest of the year given the impetus from tariffs,” ING analysts expect.\n\nThey warned in a recent note that the use of levies could “escalate significantly” as Trump seeks to bring manufacturing back to US shores, potentially triggering price hikes.\n\nPearce of Oxford Economics expects that the economy is strong enough to weather a downturn from tariffs — meaning the Fed will unlikely be forced to respond to weakening conditions.\n\nBut there remains a risk that more weakness comes through, he said, and that the Fed “will react to a growth scare and loosen policy sooner.”\n\nDaco of EY said Powell “will have to tap dance around policy uncertainty and its cousin market volatility” in a press conference after the Fed’s rate decision is announced Wednesday.\n\nPrivate sector activity is slowing as policy uncertainty remains elevated, while stocks have pulled back notably, he said.\n\nGDP growth is also likely to stall in the first quarter in part due to weaker consumer spending.\n\n“Powell may find it difficult to reaffirm that the economy is ‘holding up just fine,’ and that it ‘doesn’t need us to do anything,’” Daco added in a note.\n\nLooking ahead, he warned that the Fed’s policy stance could shift rapidly with economic conditions.\n\n“A reactionary monetary policy stance means policy direction could rapidly turn more dovish on weaker economic and labor market data, just like it could turn hawkish with hotter inflation readings,” he said.","summary":"WASHINGTON: The US Federal Reserve is widely expected to keep interest rates unchanged at its policy meeting this week, treading carefully amid uncertainty over President Donald Trump’s economic policies, which include spending cuts and sweeping tariffs.\n\n\n\nSince January, Trump has imposed levies on major trading partners Canada, Mexico and China, and on steel and aluminum imports, roiling financial markets and fanning fears that his plans could tip the world’s biggest economy into a recession.\n\n\n\nThe Trump administration has also embarked on unprecedented cost-cutting efforts that target staff and spending, while the president has promised tax reductions and deregulation down the road.\n\n\n\nBut Fed Chair Jerome Powell emphasized this month that it is the “net effect” of policy changes that will matter for both the economy and monetary policy.\n\n\n\nAnalysts widely expect the central bank to hold the benchmark lending rate steady at 4.25 percent to 4.50 percent, after similarly doing so in January.\n\n\n\n“Recent Fed ","url":"https://www.brecorder.com/news/40353273/fed-likely-to-keep-rates-steady","image":"https://i.brecorder.com/large/2025/03/17035611e0072bf.jpg?r=035632","video":null,"publish_date":"2025-03-17 00:29:53","author":"AFP","authors":["AFP"],"language":"en","source_country":"pk","sentiment":0.005},{"id":300865578,"title":"US says ‘multiple’ leaders of Houthi dead in Yemen strikes","text":"SANAA: A White House official on Sunday said a wave of United States air strikes on Yemen killed senior Houthi rebel leaders and sent a message to their Iranian backers.\n\nAttacks on the rebel-held capital Sanaa as well as Saada, Al-Bayda and Radaa killed at least 31 people and wounded 101, “most of whom were children and women”, Huthi health ministry spokesperson Anis al-Asbahi said.\n\nUS President Donald Trump said he had ordered Saturday night’s strikes and threatened more if the rebels kept up their attacks on Red Sea and Gulf of Aden shipping.\n\nThe rebels have carried out no attacks in the waterways since January 19, when a ceasefire began in the Gaza Strip, but on Tuesday said they would resume attacks on Israeli shipping.\n\nUS National Security Advisor Michael Waltz told ABC News the strikes “targeted multiple Huthi leaders and took them out.”\n\nHe told Fox News: “We just hit them with overwhelming force and put Iran on notice that enough is enough.”\n\nThe Huthis, who have fought for years in their country, vowed a response.\n\nWitnesses to the bombing said on Sunday they were taken aback by its intensity.\n\nFootage on Huthi media showed children, including a dazed girl with blackened legs wrapped in bandages, and a woman being treated in hospital.\n\nOne father of two, who gave his name as Ahmed, told AFP his “house shook, the windows shattered, and my family and I were terrified”.\n\n“I’ve been living in Sanaa for 10 years, hearing shelling throughout the war. By God, I’ve never experienced anything like this before,” he said. Trump, posting on social media, vowed to “use overwhelming lethal force” to end the Huthi attacks, which the rebels say are in solidarity with Palestinians during the Gaza war.","summary":"SANAA: A White House official on Sunday said a wave of United States air strikes on Yemen killed senior Houthi rebel leaders and sent a message to their Iranian backers.\n\n\nAttacks on the rebel-held capital Sanaa as well as Saada, Al-Bayda and Radaa killed at least 31 people and wounded 101, “most of whom were children and women”, Huthi health ministry spokesperson Anis al-Asbahi said.\n\n\nUS President Donald Trump said he had ordered Saturday night’s strikes and threatened more if the rebels kept up their attacks on Red Sea and Gulf of Aden shipping.\n\n\nThe rebels have carried out no attacks in the waterways since January 19, when a ceasefire began in the Gaza Strip, but on Tuesday said they would resume attacks on Israeli shipping.\n\n\nUS National Security Advisor Michael Waltz told ABC News the strikes “targeted multiple Huthi leaders and took them out.”\n\n\nHe told Fox News: “We just hit them with overwhelming force and put Iran on notice that enough is enough.”\n\n\nThe Huthis, who have fought for years in their co","url":"https://www.brecorder.com/news/40353269/us-says-multiple-leaders-of-houthi-dead-in-yemen-strikes","image":"https://i.brecorder.com/large/2025/03/170410586b66949.jpg?r=041126","video":null,"publish_date":"2025-03-17 00:29:53","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":0.105},{"id":300865584,"title":"Decision on formation of anti-govt alliance after Eid: Fazl","text":"ISLAMABAD: Calling the government and the parliament puppets, Jamiat Ulema-e-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman on Sunday said that the party would convene its meeting after Eidul Fitr to decide on launching an anti-government movement.\n\nTalking to reporters in Islamabad, he said a policy-making meeting would decide the JUI-F’s alliance with the PTI.\n\nHe further said the present government was not elected. “The state is in danger,” he said, adding, “When we in the opposition are concerned about the country’s fragile situation, why is not the government?”\n\nFazl said that Prime Minister Shehbaz Sharif invited political leaders to Iftar parties, but not to discuss the country’s situation. \n\n“Employees are being fired from PWD, Postal Services and other departments because they are incompetent,” the JUI-F chief said, adding, “If they are incompetent, how could you call yourself competent?”\n\nHe told newsmen that relations between the JUI-F and the PTI were no longer as bitter as they used to be in the past. “Even if PTI leaders make statements against the JUI-F, this will not dent the likely alliance between the two parties.”\n\nHowever, Fazl said, if any PTI leader made a statement against him, the party leadership should take notice of it. \n\nHe added that the rulers begged him to join the government. “Nawaz Sharif can play a vital role in the present situation,” the JUI-F chief said, adding, “If Nawaz thinks that good governance in one province is sufficient, then why about the rest of the country.”\n\nHe recalled that when Donald Trump became the US president, there was jubilation in the opposition camp. “But after the government handed over a militant to the USA, the opposition was in a state of gloom while the government was ecstatic.”\n\nFazl warned that if the government continued to make unilateral decisions, the stronger the reaction would be from the political parties.\n\nHe lamented that the establishment called the shots in the country. “The establishment says that politicians are incapable of running the country. I want to tell them that they should better go to their barracks and let the civilians take over.”\n\nThe country, he went on to say, did not belong to the establishment alone, but to the entire nation.\n\nThe JUI-F chief wondered that if there could be talks with India and Iran, then why not with Afghanistan. “I can think to play my role in defusing tensions with Afghanistan if asked by the establishment.”\n\n“Elections were not merely rigged. Mandates were stolen from the political parties. And we are a witness to that,” he added.\n\nHe made it clear he did not believe in the ‘minus one formula’. “Those at the helm of affairs do not like politicians to become extremely popular,” he remarked.","summary":"ISLAMABAD: Calling the government and the parliament puppets, Jamiat Ulema-e-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman on Sunday said that the party would convene its meeting after Eidul Fitr to decide on launching an anti-government movement.\n\n\n\nTalking to reporters in Islamabad, he said a policy-making meeting would decide the JUI-F’s alliance with the PTI.\n\n\n\nHe further said the present government was not elected. “The state is in danger,” he said, adding, “When we in the opposition are concerned about the country’s fragile situation, why is not the government?”\n\n\n\nFazl said that Prime Minister Shehbaz Sharif invited political leaders to Iftar parties, but not to discuss the country’s situation. \n\n\n\n“Employees are being fired from PWD, Postal Services and other departments because they are incompetent,” the JUI-F chief said, adding, “If they are incompetent, how could you call yourself competent?”\n\n\n\nHe told newsmen that relations between the JUI-F and the PTI were no longer as bitter as they used to ","url":"https://www.brecorder.com/news/40353205/decision-on-formation-of-anti-govt-alliance-after-eid-fazl","image":"https://i.brecorder.com/large/2025/03/1701371472b1406.jpg?r=013718","video":null,"publish_date":"2025-03-17 00:29:52","author":"NNI","authors":["NNI"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.405},{"id":300865774,"title":"World News | US Airstrikes on Yemen's Houthis Kill at Least 53; UN Calls for Restraint","text":"Washington DC [US], March 17 (ANI): The United States' airstrikes on Yemen's Houthi rebels have killed atleast 53 people, including five women and two children, and injured nearly 100 others, The Hill reported, quoting the Houthi-run Health Ministry. The airstrikes targeted Yemen's capital, Sanaa, as well as other provinces, including Saada, the rebels' stronghold near the border with Saudi Arabia.\nAlso Read | NSA Ajit Doval, US Director of National Intelligence Tulsi Gabbard Discuss India-US Ties.\nIn response to the strikes, the Houthis' political bureau has vowed to \"meet escalation with escalation.\" The rebels have also claimed that they targeted the USS Harry S. Truman carrier strike group with missiles and a drone, but two U.S. officials told The Associated Press they were not tracking anything, as reported by The Hill. Also Read | PM Narendra Modi Praises Donald Trump's Resilience, Draws Parallels Between 'India First' and 'America First' Ideologies in Podcast With Lex Fridman.\nMeanwhile, United Nations Secretary-General Antonio Guterres in a statement called for \"utmost restraint and a cessation of all military activities,\" while warning of the \"grave risks\" to the dire humanitarian situation in Yemen, the Arab world's poorest nation. On Saturday, Trump announced a \"decisive and powerful\" military against Houthis, accusing them of piracy, violence and terrorism targeting Americans. \"Today, I have ordered the United States Military to launch decisive and powerful Military action against the Houthi terrorists in Yemen. They have waged an unrelenting campaign of piracy, violence, and terrorism against American and other ships, aircraft, and drones,\" Trump wrote on his Truth Social media platform. Trump said the US would use \"overwhelming lethal force\" against the Houthis while accusing them of 'choking' transportation through the Suez Canal, the Red Sea and the Gulf of Aden, which have affected the trade and commerce and \"attacked\" the principle of Freedom of Navigation.\n\"The Houthi attack on American vessels will not be tolerated. We will use overwhelming lethal force until we have achieved our objective. The Houthis have choked off shipping in one of the most important Waterways of the World, grinding vast swaths of Global Commerce to a halt, and attacking the core principle of Freedom of Navigation upon which International Trade and Commerce depend,\" Trump said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  In response to the strikes, the Houthis' political bureau has vowed to &quot;meet escalation with escalation.&quot;","url":"https://www.latestly.com/agency-news/world-news-us-airstrikes-on-yemens-houthis-kill-at-least-53-un-calls-for-restraint-6713911.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250316231713.jpg","video":null,"publish_date":"2025-03-17 00:28:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.098},{"id":300864650,"title":"Sorry, Elon: Even deporting illegal gangbangers must heed the rule of law","text":"Elon Musk is way out of his lane in cheering a bid to impeach federal Judge James Boasberg, who’s put a temporary hold on deportation flights of illegal-migrant gangbangers.\n\nWe like the idea of the flights: The brutes of Tren de Aragua and MS-13 have had it too easy for far too long, and current efforts to get tough are a necessary correction to Biden-era denial.\n\nPresident Donald Trump’s executive orders declaring multiple gangs to be terrorist outfits are rooted in the gangs’ tactics and goals: They’re utterly vicious in their attempts to take turf inside our country, from Long Island to Colorado and beyond.\n\nSimply deporting them hasn’t proved enough — multiple members have slipped back in multiple times, and while Trump has stopped the mass illegal border-jumping of the Biden years, the gangs have the resources and sophistication to keep getting their people through.\n\nAnd, once here, they can not only hide among the 10 million illegal migrants admitted these last four years; they’re shielded by the left’s “sanctuary” laws and immigration-advocacy networks.\n\nBut the rule of law must hold: As legal authority for its actions, Team Trump is citing the 18th-century Alien Enemies Act, a law written to cover wartime situations that in the past has only been invoked during wars declared by Congress.\n\nThe “war” here is simply Trump’s presidential declaration that TdA is invading the country; challenging that in court is perfectly kosher, as is the judge ordering a holdoff on new flights until he can hear arguments in the case.\n\nNote that the administration did not defy Boasberg by letting the first two flights land in Honduras and El Salvador: While the judge made comments in court about calling the planes back, his final written order left that out.\n\nAnd however Boasberg ultimately rules, the case seems destined to go all the way to the Supreme Court. Can the feds simply declare anyone a TdA member before putting him on a plane off to an El Salvadoran prison?\n\nWhich makes it just plain silly for Musk to tweet “necessary” of a Texas rep’s plan to file to impeach the judge: It’s nothing of the kind, and cheering it only makes Musk look reckless — a reputation he doesn’t need when many DOGE actions also face court challenge.\n\nLook: The Biden crew took years to get the nation fully into this mess (and built on Obama-era and earlier mistakes, too); the Trump team can’t possibly fix everything overnight.\n\nThe country needs the courts to sort out a host of legal questions about everything from what advocates insist are illegal migrants’ rights to local obligations to cooperate with federal law enforcement.\n\nTrump stopped the bleeding at the border in his first weeks in office; undoing all the Biden-era damage will take a lot longer.\n\nAnd doing it with full regard for the rule of law truly is necessary.","summary":"Elon Musk is way out of his lane in cheering a bid to impeach federal Judge James Boasberg, who’s put a temporary hold on deportation flights of illegal-migrant gangbangers.","url":"https://nypost.com/2025/03/16/opinion/sorry-elon-even-deporting-illegal-gangbangers-must-heed-the-rule-of-law/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/newspress-collage-klbgyfj80-1742165838547.jpg?quality=75&strip=all&1742151549&w=1200","video":null,"publish_date":"2025-03-17 00:21:54","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.276},{"id":300866564,"title":"‘The Reality on the Ground’ – Waltz Insists That Ukraine Will Need to Cede Territory for Security Guarantees","text":"US National Security Advisor Mike Waltz said on Sunday that, as part of preliminary peace talks with Russia, the White House will propose that Ukraine would receive unspecified security guarantees in exchange for unspecified territorial concessions.\n\nIn an interview with ABC News, the top security adviser to President Donald Trump said that because of the “reality of the situation on the ground” there would need to be territory ceded to Russia in negotiations, using language that closely resembled Kremlin talking points about the balance of power on the battlefield.\n\nRussian strongman Vladimir Putin and other members of Kremlin leadership have consistently demanded that Ukraine surrender the entirety of Donetsk, Luhansk, Zaporizhzhia, and Kherson regions, “including areas that Russian forces do not already occupy,” according to analysts from the Institute for the Study of War (ISW) and they have repeated these claims in recent weeks.\n\nPutin insists that “Novorossiya” (“New Russia”) is an integral part of its own boundaries: Kremlin Spokesperson Dmitry Peskov defined the area as all of eastern and southern Ukraine including Kharkiv, Dnipropetrovsk, Odesa, and Mykolaiv regions.\n\nAccording to the most recent ISW assessments, Russia currently occupies a small portion of the Kharkiv region and the Kinburn Spit in the Mykolaiv region, and “Russian forces are advancing towards the Dnipropetrovsk Oblast administrative border. Continued Kremlin statements demanding that Ukraine cede unoccupied Ukrainian territory indicate that the Kremlin and Putin remain committed to these territorial goals despite ongoing negotiations.”\n\nPresident Volodymyr Zelensky on Saturday said that the build-up of Russian troops along the eastern Sumy region suggests that the Kremlin has very little appetite for signing a lasting peace.\n\n“This indicates an intention to attack,” Zelensky wrote in social media over the weekend. “We are aware of this, and will counter it. I would like all partners to understand exactly what Putin is planning, what he is preparing for and what he will be ignoring.”","summary":"Repeating Kremlin talking points, top US security adviser hints that much of ‘Novorossiya’ would go to Russians in any deal, while Zelensky says Putin is just “prolonging” the war.","url":"https://www.kyivpost.com/post/49020","image":"https://static.kyivpost.com/storage/2025/02/21/d86c1c8d921fb6ca0a4f7d261f60a98e.jpg?w=1200&q=90&f=jpg","video":null,"publish_date":"2025-03-17 00:20:05","author":"John Moretti","authors":["John Moretti"],"language":"en","source_country":"ua","sentiment":-0.007},{"id":300862544,"title":"Russia and Ukraine are 'much closer' to agreeing a ceasefire as their differences have 'narrowed', US says","text":"Russia and Ukraine are 'much closer' to agreeing a ceasefire as their differences have 'narrowed', US says\n\nPODCAST: Former White House Press Secretary Sean Spicer on Karoline Leavitt and the biggest myth about Trump. Listen to Welcome to MAGAland here\n\nBy CHRIS POLLARD\n\nPublished: 23:46 GMT, 16 March 2025 | Updated: 00:19 GMT, 17 March 2025\n\nRussia and Ukraine are 'much closer' to agreeing a ceasefire as their differences have 'narrowed', the US said last night.\n\nThe claim came with Donald Trump poised to discuss a peace deal with President Putin this week.\n\nThe US President's special envoy Steve Witkoff, who visited the Kremlin last week, said: 'The two sides are today much closer.\n\n'I would describe my conversation with Putin as positive. We've narrowed the differences between them. Now we're discussing how to narrow them even further.\n\n'Nobody expected progress this fast. Lots of things that remain to be discussed, but I think the two presidents are going to have a really good and positive discussion this week.'\n\nHe added that Putin 'accepts the philosophy of President Trump', who wants the fighting to end.\n\nMeanwhile, a former UK national security adviser has warned British peacekeeping troops will be at 'considerable risk' in Ukraine unless Donald Trump agrees to back them.\n\nLord Ricketts said any 'reassurance force' sent to Kyiv must be prepared to fight because Putin is 'bound' to attack them.\n\nLord Ricketts said any 'reassurance force' sent to Kyiv must be prepared to fight because Putin is 'bound' to attack them\n\nBritain's Prime Minister Keir Starmer sits alongside Chief of the Defence Staff, Admiral Tony Radakin (L) and Vice-Chief of the Defence Staff, General Sharon Nesmith\n\nThe claim came with Donald Trump poised to discuss a peace deal with President Putin this week\n\nTrump makes prediction ahead of high-stakes call with Putin... after revealing doomsday fears\n\nThe Russian leader was 'playing for time', he added, so his army can continue gaining ground in Ukraine.\n\n'He's avoiding saying 'no' to Trump, but he's stringing it out,' he said. Sending a European peacekeeping force into Ukraine, including British soldiers, would be 'very risky', he added.\n\n'To be credible, a deterrent force has to be willing to fight.\n\n'The only way to avoid [fighting the Russians] is to have a cast-iron American guarantee that if the force got into trouble, the Americans would come and support them.\n\nTrump's brand is to pull Americans out of military conflict, so I don't think he will give a credible guarantee that if a European force got into real trouble, he would come to the rescue and take on the Russians directly.'\n\nLord Ricketts added that Putin's army is 'bound to take on the force in some way, either with conflict directly or dark arts, deniable operations, sabotage – it would be a very risky situation'.\n\nEuropean military chiefs will meet in London on Thursday to formulate 'robust' plans for ensuring Ukraine's security. Ukrainian president Volodymyr Zelensky has said he would be willing to agree to an unconditional 30-day ceasefire with Russia.\n\nIt is understood that Russia is demanding four conditions (Pictured: Russia's President Vladimir Putin) \n\nUkrainian president Volodymyr Zelensky has said he would be willing to agree to an unconditional 30-day ceasefire with Russia\n\nHowever, it is understood that Russia is demanding four conditions: international recognition that Russia gets to keep all Ukrainian territory it has already seized; limits on Ukraine's ability to mobilise its military; a halt to Western military aid in Ukraine; and total surrender in Russia's Kursk region, where Ukraine launched an incursion last year.\n\nLast night, Ukraine was still clinging on in Kursk after its forces were ousted from Sudzha, the biggest town it had seized in the region. Moscow said it had moved 371 civilians to safety.\n\nMr Zelensky said Russia continued to pound Ukraine with artillery fire.\n\nWriting on Telegram he said: 'This is definitely not what those who want the war to end as soon as possible do.'\n\nIn other developments, a Russian air strike on Kherson hit a residential area on Saturday, killing a 43-year-old man. Pictures showed his mother and sister mourning amid the rubble.\n\nAnd Mr Zelensky yesterday appointed Andrii Hnatov as the new chief of Ukraine's armed forces, as the country looks to further strengthen its military.\n\nRussiaUkraineDonald Trump\n\nShare or comment on this article:\nRussia and Ukraine are 'much closer' to agreeing a ceasefire as their differences have 'narrowed', US says\n\nAdd comment","summary":"Former UK national security adviser Lord Ricketts has warned UK peacekeeping troops will be at 'considerable risk' in Ukraine unless Donald Trump agrees to back them.","url":"https://www.dailymail.co.uk/news/article-14505523/Russia-Ukraine-ceasefire-US.html","image":"https://i.dailymail.co.uk/1s/2025/03/16/23/96257327-0-image-m-98_1742168642654.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/16/6174415993201184713/1024x576_MP4_6174415993201184713.mp4","publish_date":"2025-03-17 00:19:22","author":"Chris Pollard,Editor","authors":["Chris Pollard","Editor"],"language":"en","source_country":"gb","sentiment":0.047},{"id":300865754,"title":"World News | US Deports Hundreds of Venezuelan Gang Members to El Salvador Under Alien Enemies Act","text":"Washington DC [US], March 17 (ANI): The United States on Sunday (local time) deported hundreds of alleged Venezuelan gang members from Tren de Aragua to El Salvador after President Donald Trump invoked the 18th-century Aliens Enemies Act to expedite their deportation, CNN reported. This came just before a federal judge issued a 14-day halt on the Trump administration's ability to use the act, ordering any planes in the air carrying the deportees to return back to the US. Also Read | NSA Ajit Doval, US Director of National Intelligence Tulsi Gabbard Discuss India-US Ties.\nThe judge said the temporary restraining order would remain in effect for 14 days \"or until further order of the court.\" One person familiar with the matter said the planes were already in the air at the time of the judge's ruling, as reported by CNN. \"Particularly given the plaintiffs' information, unrebutted by the government, that flights are actively departing and planning to depart, I do not believe that I'm able to wait any longer,\" said US District Judge James Boasberg during the hearing. \"Any plane containing these folks that is going to take off or is in the air needs to be returned to the United States.\" Also Read | PM Narendra Modi Praises Donald Trump's Resilience, Draws Parallels Between 'India First' and 'America First' Ideologies in Podcast With Lex Fridman.\nUS Secretary of State Marco Rubio announced that \"hundreds of violent criminals were sent out of our country\" after Trump invoked the Alien Enemies Act on Saturday. White House Press Secretary Karoline Leavitt later said that the Department of Homeland Security had arrested nearly 300 members of Tren de Aragua over the weekend, CNN reported. Meanwhile, El Salvador's President Nayib Bukele offered to imprison the alleged gang members in exchange for the return of two leaders of the MS-13 gang, as well as 21 other Salvadorans to \"face justice in their homeland.\" The US will also pay USD 6 million to El Salvador to house the deportees. The El Salvador President said the money will help sustain the penitentiary system, which currently costs $200 million annually. Bukele also said the action will help law enforcement gather intelligence and apprehend MS-13 members. Rubio thanked the Bukele and said in a post on X that the US \"sent two dangerous top MS-13 leaders plus 21 of its most wanted back to face justice in El Salvador. Also, as promised by @POTUS, we sent over 250 alien enemy members of Tren de Aragua, which El Salvador has agreed to hold in their very good jails at a fair price that will also save our taxpayer dollars.\"\nThe White House has designated the Venezuelan gang as a foreign terrorist organization and said in a presidential proclamation that many of them have \"unlawfully infiltrated the United States and are conducting irregular warfare and undertaking hostile actions against the United States.\" (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  This came just before a federal judge issued a 14-day halt on the Trump administration's ability to use the act, ordering any planes in the air carrying the deportees to return back to the US.","url":"https://www.latestly.com/agency-news/world-news-us-deports-hundreds-of-venezuelan-gang-members-to-el-salvador-under-alien-enemies-act-6713903.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250316205742.jpg","video":null,"publish_date":"2025-03-17 00:18:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.209},{"id":300861620,"title":"Australian chef Pete Evans claims he met with Donald Trump, Elon Musk at Mar-a-Lago","text":"The former My Kitchen Rules host, who became embroiled in controversy in 2020 for peddling unfounded anti-vaccination views on social media, took to his Instagram account Sunday with a photo of the American flag at Mr Trump’s lavish Florida resort, saying he had a “beautiful evening” rubbing shoulders with the president and his team.\n\n“Beautiful evening at @themaralagoclub with some wonderful friends, Dave and Melissa who invited me for dinner,” Evans wrote.\n\n“Got to meet and shake hands with the legendary DJ that was spinning the tracks all night for his guests, the President @realdonaldtrump as well as @elonmusk and @jamesokeefeiii.”\n\nEvans, who has had an association with vaccine sceptic, and newly minted United States Secretary of Health and Human Services Robert F. Kennedy Jr. for several years, has been promoting his involvement with the Make America Healthy Again campaign, a plan devised by Kennedy to tackle poor diet and health in the US.\n\nMore recently, Evans, 52, and Kennedy, 71, teamed up on the former Channel 7 star’s latest cookbook, Healthy Food for Healthy Kids, which hit stands in January.\n\nTalking about his links with the Make America Healthy Again movement, Evans sat down for a televised interview with US broadcaster Ed Henry on Newsmax earlier this month, where he said he had been cancelled by his home country for questioning vaccinate mandates during the Covid-19 pandemic.\n\n“I used to host Australia’s number one commercial TV show for many, many years,” Evans said.\n\n“And when Covid came around, I was very sceptical about the whole mandate … especially to do with the shots and social distancing and mask wearing and everything. And I voiced my opinion, and it didn’t go down too well in this country.”\n\nSpeaking to his partnership with Kennedy, whom he referred to as ‘Bobby’, Evans praised the health secretary for promoting healthy eating as the US grapples with what Mr Trump has described as a “chronic disease epidemic”.\n\n“It’s such an honour to be able to work with Children’s Health Defense and Bobby’s team, and Bobby is one of the most miraculous, brave, beautiful individuals that I’ve had the pleasure of meeting and speaking with over the last four or five years, and he inspires me daily, as he, no doubt, inspires a lot of people,” he said.\n\n“And I just want to congratulate him for the tenacity and the determination and for what he is about to about to change, I believe, and bring to the fore … often times health is sort of pushed to the side.”\n\nKennedy has repeatedly made false claims about vaccinations over the years, including that vaccines cause “autism”, which he doubled down on in a 2023 interview with Fox News.\n\nEvans, for his part, parted ways with Channel 7 in 2020, and went on to share increasingly bizarre posts on social media.\n\nNotably, he appeared to promote the idea Covid was a conspiracy, with a story posted on Instagram detailing a list of things people need to “look out for” – certain code words and implying “mass trials” and “executions” were happening behind closed doors.\n\nHe also shared a detailed graph showing links between a “Great Awakening”, a “Great Solar Flash”, “Secret Space Program”, and “machine elves”.","summary":"The ousted Aussie chef claims to have met with president Donald Trump and Elon Musk at Mar-a-Lago as he sets his sights on a new career in the US.","url":"https://www.news.com.au/entertainment/celebrity-life/australian-chef-pete-evans-claims-he-met-with-donald-trump-elon-musk-at-maralago/news-story/a2193f6e85fb816f2b81b381d8e1803b?from=rss-basic","image":"https://content.api.news/v3/images/bin/4068435338b1a99f0fc925c034194d45","video":null,"publish_date":"2025-03-17 00:14:21","author":"Lexie Cartwright","authors":["Lexie Cartwright"],"language":"en","category":"politics","source_country":"au","sentiment":0.307},{"id":300864640,"title":"Chuck Schumer did right by America AND the Democratic Party in keeping gov’t open","text":"Sen. Chuck Schumer did what he thought right for the country and his party in avoiding a government shutdown last week; naturally, the selfish showboaters are slamming him for it.\n\nHe quite rightly saw it would be a triple loss for the Democratic Party, had Senate Democrats used the filibuster to stop the bill to fund the government through September.\n\nPeople would get hurt, as they do in any shutdown.\n\nMost voters would blame the Democrats.\n\nAnd a shutdown would’ve further empowered President Donald Trump’s drive to close agencies and fire federal workers, an effort that Schumer’s progressive critics join in despising.\n\nThe left’s course was wrong on tactics, strategy and its own principles; all it would have “won” was a chance to wallow in supposed moral purity — which it still gets to do now by denouncing Schumer. \n\nLook: The latest polling for Newsweek and CNN shows Democrats with their lowest public approval in decades, well under 30%; less than one American in 10 strongly approves of the party.\n\nPlaying exclusively to that 10% can only dig Dems a deeper hole with everyone else.\n\nSchumer sees that; his critics either won’t admit it, or just don’t care.","summary":"Sen. Chuck Schumer did what he thought right for the country and his party in avoiding a government shutdown last week; naturally, the selfish showboaters are slamming him for it.","url":"https://nypost.com/2025/03/16/opinion/chuck-schumer-did-right-by-america-and-the-democratic-party-in-keeping-govt-open/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/senate-democratic-leader-chuck-schumer-100480198-e1742165890958.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-17 00:12:48","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.579},{"id":300863158,"title":"British Chagos Islanders set to sue UK government as they demand territory is not given to Mauritius","text":"Two British women born on the Chagos Islands are set to bring legal action against the UK Government, saying the territory should remain in UK hands and not be given over to Mauritius.\n\nBernadette Dugasse and Bertrice Pompe, who were both born on Diego Garcia, have launched legal action against the Foreign Office, contesting the proposed transfer agreement.\n\nCentral to their case is the right to return to their birthplace. Chagossians were forcibly removed from the islands by 1973 to make way for a US-UK military base, and there is currently restricted access to the islands, with permits required for travel.\n\nThe proposed agreement includes a lease-back arrangement for the base on Diego Garcia, funded by British taxpayers.\n\nWhile seemingly endorsed by US President Donald Trump, the deal faces resistance from the Conservative party. \n\nLawyers representing the two women have sent a pre-action letter to the Foreign, Commonwealth and Development Office (FCDO), asserting that the Chagossian people have shut out of the conversation about the future of the islands, despite being the native inhabitants.\n\nThey also say that they do not trust Mauritius to treat the Chagossians fairly, and that they would face “severe obstacles” as British citizens who do not hold Mauritian nationality, including possible racial discrimination and the loss of the possibility of returning.\n\nMs Pompe said: “Chagossians were removed from their place of birth, without their consultation, and have been treated badly for 60 years. \n\n“Since then we have been struggling to understand why we have been treated so poorly by the British government. \n\n“Our human rights have been stripped away.\n\n“Today the British government is repeating the same mistakes which it made 60 years ago.”\n\nShe added: “All our suffering and cries to be heard have been falling on deaf ears… I want to stay British and I also want the right to return to the Chagos Islands.”\n\nMs Dugasse described the proposed deal as bad for Chagossians.\n\nShe continued: “This deal will forbid me from returning to Diego Garcia where I was born, and serves only to extend the suffering of the indigenous Chagossians.\n\n“I am a British citizen and I cannot understand why we are being treated in this horrible way.”\n\nBarrister Michael Polak, representing Ms Pompe and Ms Dugasse, added: “The Government’s attempt to give away the Chagossian’s homeland whilst failing to hold a formal consultation with the Chagossian people is a continuation of their terrible treatment by the authorities in the past.\n\n“They remain the people with the closest connection to the islands, but their needs and wishes are being ignored.”\n\nThe FCDO was asked to respond to the legal letter by March 25.\n\nAn FCDO spokesperson said: “We do not comment on potential legal challenges.\n\n“The negotiations were between the UK and Mauritius with our priority being to secure the full operation of the base on Diego Garcia.\n\n“However, we have worked to ensure this agreement reflects the importance of the islands to Chagossians.”","summary":"The women say their human rights have been ‘stripped away’","url":"https://www.independent.co.uk/news/uk/politics/chagos-islands-court-mauritius-diego-garcia-b2716064.html","image":"https://static.independent.co.uk/2025/03/16/12/05/01JPEZ9XJHAJW3FWFM2PS9PMJY.jpeg?trim=441,0,407,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/hCJwMLAT-OhrQWqOm.mp4","publish_date":"2025-03-17 00:09:29","author":"Jess Glass","authors":["Jess Glass"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.536},{"id":300865082,"title":"Trump and Putin expected to speak this week as US pushes for Russia-Ukraine ceasefire","text":"US President Donald Trump is expected to speak with his Russian counterpart Vladimir Putin this week on ways to end the three-year war in Ukraine, US envoy Steve Witkoff told CNN on Sunday (Mar 16) after returning from what he described as a \"positive\" meeting with Putin in Moscow.\n\n\"I expect that there will be a call with both presidents this week, and we're also continuing to engage and have conversation with the Ukrainians,\" said Witkoff, who met with Putin on Thursday night, adding that he thought the talk between Trump and Putin would be \"really good and positive\".\n\nTrump is trying to win Putin's support for a 30-day ceasefire proposal that Ukraine accepted last week, as both sides continued trading heavy aerial strikes through the weekend.\n\nRussia moved closer to ejecting Ukrainian forces from their months-old foothold in the western Russian region of Kursk.\n\nTrump said in a social media post on Friday that there was \"a very good chance that this horrible, bloody war can finally come to an end\".\n\nHe also said he had \"strongly requested\" that Putin not kill the thousands of Ukrainian troops that Russia is pushing out of Kursk.\n\nPutin said he would honor Trump's request to spare the lives of the Ukrainian troops if they surrendered.\n\nThe Kremlin also said on Friday that Putin had sent Trump a message about his ceasefire plan via Witkoff, expressing \"cautious optimism\" that a deal could be reached to end the conflict.","summary":"","url":"https://www.channelnewsasia.com/world/russia-ukraine-war-trump-putin-speak-ceasefire-5004156","image":"https://dam.mediacorp.sg/image/upload/s--hBFC9jgL--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-03-14t164558z_1_lynxmpel2d0va_rtroptp_3_g20-summit.jpg?itok=vIfVgmn","video":null,"publish_date":"2025-03-17 00:09:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.248},{"id":300867394,"title":"Over 36 people killed in devastating natural calamity in US, says President Trump","text":"WASHINGTON, March 17. /TASS/. The death toll that was caused by a powerful storm in the United States has increased to 36 people, US President Donald Trump said.\n\n\"We are actively monitoring the severe tornadoes and storms that have impacted many States across the South and Midwest - 36 innocent lives have been lost, and many more devastated,\" Trump stated on his Truth Social network page.\n\n\"The National Guard have been deployed to Arkansas, and my Administration is ready to assist State and Local Officials, as they help their communities to try and recover from the damage,\" he added.\n\nAccording to US media outlets, the natural calamity struck residents of the states of Alabama, Arkansas, Missouri, Kansas, Mississippi, Oklahoma and Texas.\n\nAccording to earlier reports from the Associated Press, a sprawling storm system that crossed the United States, resulted in tornadoes, dust storms and more than 100 wildfires, encompassing the territory, which is home to more than 100 million people.","summary":"According to US media outlets, the natural calamity struck residents of the states of Alabama, Arkansas, Missouri, Kansas, Mississippi, Oklahoma and Texas","url":"https://tass.com/emergencies/1929003","image":"https://cdn-media.tass.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20250317/1440875.jpg","video":null,"publish_date":"2025-03-17 00:07:59","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.119},{"id":300863162,"title":"Interest rates set to stay put amid ‘fog of uncertainty’ over Trump tariffs","text":"The Bank of England is widely predicted to maintain its current interest rate amidst uncertainty surrounding US President Donald Trump’s trade tariffs and impending UK tax increases. \n\nExperts anticipate the Monetary Policy Committee (MPC) will hold rates at 4.5 per cent on Thursday, continuing the gradual easing of borrowing costs initiated in August 2024. \n\nThis policy has provided some relief to borrowers through lower mortgage rates.\n\nHowever, Bank of England Governor Andrew Bailey has emphasised a cautious approach to further rate reductions, citing the need to closely monitor both domestic and global economic shifts. \n\nA key concern is the recent resurgence of UK inflation, driven primarily by rising energy prices, water bills, and bus fares.\n\nSandra Horsfield, an analyst at Investec Economics, described recent economic data as \"bittersweet\". \n\nWhile positive in some respects, the rise in the Consumer Prices Index (CPI) inflation rate to 3 per cent in January presents a challenge for policymakers, she said.\n\n“But the 0.2 percentage points downside surprise in the services inflation rate, the stickiness of which has presented the main concern for the MPC even as overall inflation has fallen, will have been met with some relief,” she said.\n\nPolicymakers will also be considering the inflation impact of possible spending cuts in the Government’s spring statement, which will be unveiled at the end of this month, as well as new US tariffs on UK steel and aluminium.\n\n“There will also be evidence soon, rather than merely forecasts, of how firms are handling the rises in employer national insurance contributions and the minimum wage,” Ms Horsfield added.\n\n“Murky as the picture looks now, some things will become a lot clearer soon,” she said, adding: “The fog of uncertainty is an unavoidable constant in economic forecasting.”\n\nAndrew Goodwin, chief UK economist at Oxford Economics, said the “most obvious threat” to the path of interest rate cuts “will be evidence of the impact of April’s increases in regulated prices, employers’ national insurance contributions, and the national living wage”.\n\nThe Bank has previously said the extra costs for businesses could risk putting more people out of work, or add to inflation if retailers raise prices for customers.\n\nMr Goodwin is also expecting the MPC to keep interest rates at 4.5 per cent on Thursday amid heightened uncertainty.\n\nRobert Wood and Elliott Jordan-Doak, economists at Pantheon Macroeconomics, said the MPC will “have to consider US President Trump’s actions” which have been “driving an equity market sell-off and skyrocketing uncertainty” and therefore fuelling concerns over the outlook for global economic growth.\n\nBut they added that the MPC is “as unable as anyone else to predict Mr Trump’s next move”.\n\nThe committee last month insisted that it is not yet known how tariffs – which have been placed on China, Canada and Mexico – will impact the UK economy.\n\nThe Pantheon economists predict interest rates will be kept on hold this month – but that two more cuts will come in May and November this year.","summary":"‘Murky as the picture looks now, some things will become a lot clearer soon’","url":"https://www.independent.co.uk/news/business/interest-rate-bank-of-england-trump-tariffs-b2716040.html","image":"https://static.independent.co.uk/2025/03/13/13/f58f2526f61f9afc2830892e1c032f15Y29udGVudHNlYXJjaGFwaSwxNzQxOTU3MzI1-2.79371524.jpg?width=1200&auto=webp&quality=75","video":"https://cdn.jwplayer.com/videos/IMUFUPfm-4VHSaSK0.mp4","publish_date":"2025-03-17 00:06:48","author":"Anna Wise","authors":["Anna Wise"],"language":"en","source_country":"gb","sentiment":-0.105},{"id":300865764,"title":"World News | Pakistan, Afghanistan, and Russia Among 43 Countries Likely to Face Trump's New Travel Ban","text":"Washington DC [US], March 17 (ANI): The Donald Trump administration is considering imposing a new travel ban that could affect citizens from as many as 43 countries, including Pakistan, Afghanistan, and Russia, The New York Times reported, quoting anonymous officials. A draft list of recommendations by security officials proposes categorising countries into three groups--Red, Orange, and Yellow--to restrict travel. Being placed on the Red List would mean a complete ban on entering the United States. Also Read | NSA Ajit Doval, US Director of National Intelligence Tulsi Gabbard Discuss India-US Ties.\nPakistan and Russia are included in the \"Orange List,\" which consists of 10 countries facing restricted travel rather than an outright ban. Affluent business travelers might be allowed to enter, but immigrant and tourist visa applicants would face restrictions. Citizens on that list would also be subjected to mandatory in-person interviews in order to receive a visa, as reported by The New York Times. Other countries in the \"Orange List\" include Myanmar, Belarus, Haiti, Laos, Eritrea, Sierra Leone, South Sudan, and Turkmenistan. Also Read | PM Narendra Modi Praises Donald Trump's Resilience, Draws Parallels Between 'India First' and 'America First' Ideologies in Podcast With Lex Fridman.\nThe draft also places 10 countries, including Afghanistan and Bhutan, on the Red List, meaning their citizens could face a full visa suspension. The other countries on the Red List are Cuba, Iran, Libya, North Korea, Somalia, Sudan, Syria, Venezuela and Yemen, The New York Times reported. The proposal also includes a draft \"yellow\" list of 22 countries that would be given 60 days to clear up perceived deficiencies, with the threat of being moved onto one of the other lists if they did not comply.\nAs reported by The New York Times, the issues could include failing to share with the United States information about incoming travelers, purportedly inadequate security practices for issuing passports, or the selling of citizenship to people from banned countries, which could serve as a loophole around the restrictions.\nThat list includes Angola, Antigua and Barbuda, Benin, Burkina Faso, Cambodia, Cameroon, Cape Verde, Chad, the Republic of Congo, the Democratic Republic of Congo, Dominica, Equatorial Guinea, Gambia, Liberia, Malawi, Mali, Mauritania, St. Kitts and Nevis, St. Lucia, Sao Tome and Principe, Vanuatu and Zimbabwe.\nNotably, this will be the second time that Donald Trump would impose a travel ban, after having done so in his first term when he restricted the citizens from seven Muslim-majority nations, a policy that went through several iterations before it was upheld by the Supreme Court in 2018. That ban targeted citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen, Al Jazeera reported. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  A draft list of recommendations by security officials proposes categorising countries into three groups--Red, Orange, and Yellow--to restrict travel. Being placed on the Red List would mean a complete ban on entering the United States.","url":"https://www.latestly.com/agency-news/world-news-pakistan-afghanistan-and-russia-among-43-countries-likely-to-face-trumps-new-travel-ban-6713893.html","image":"https://st1.latestly.com/wp-content/uploads/2025/03/ANI-20250316192449.jpg","video":null,"publish_date":"2025-03-17 00:06:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.194},{"id":300866116,"title":"Trump to speak to Putin as Ukraine peacekeeping plans progress","text":"Donald Trump is expected to speak to Vladimir Putin this week as military chiefs prepare to discuss peacekeeping plans in London.\n\nThe call, announced by US special envoy Steve Witkoff, comes as Mr Putin continues to resist a US-backed proposal for a 30-day ceasefire in Ukraine.\n\nAlthough Ukrainian president Volodymyr Zelensky has accepted the proposed unconditional ceasefire, the Russian president has said Ukraine must agree to give up its ambitions of joining Nato and cede territory to Russia before any pause in hostilities.\n\nSir Keir Starmer has accused Mr Putin of seeking to “delay” a ceasefire, while French president Emmanuel Macron has said the Russian president “does not seem to be sincerely seeking peace.\n\nBut on Sunday, Mr Witkoff insisted that Mr Putin was making “a constructive effort” and that the upcoming call with Mr Trump showed there was “positive momentum”.\n\nMeanwhile, military chiefs from the “coalition of the willing” convened by Sir Keir and Mr Macron will meet in London on Thursday to discuss plans for a Western peacekeeping force to be deployed to Ukraine in the event of a ceasefire.\n\nFollowing a virtual meeting on Saturday with the leaders of 26 other nations, plus representatives from the EU and Nato, the Prime Minister said there had been “new commitments” offered and planning would now move into an “operational phase”.\n\nBut it remains unclear which nations have committed troops to a peacekeeping operation, while several have suggested such talks are premature given the lack of a ceasefire.\n\nMr Putin is also likely to object to any agreement that involves European or Nato troops being stationed in Ukraine, although Mr Zelensky sees this as essential to deterring future Russian aggression.\n\nMeanwhile, the fighting continues, with Ukraine said to be under increasing pressure in the eastern Donetsk region, part of which has been under Russian control since 2014.\n\nUkrainian troops are also reported to be in retreat in the Kursk region of Russia, which they seized in a surprise raid in August in an attempt to secure a bargaining chip for future negotiations.","summary":"Donald Trump is expected to speak to Vladimir Putin this week as military chiefs prepare to discuss peacekeeping plans in London. The call, announced by US special envoy Steve Witkoff, comes as Mr Putin continues to resist a US-backed proposal for a 30-day ceasefire in Ukraine. Although Ukrainian president Volodymyr Zelensky has accepted the proposed [&#8230;]\n\n\nThe post Trump to speak to Putin as Ukraine peacekeeping plans progress appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/17/trump-to-speak-to-putin-as-ukraine-peacekeeping-plans-progress/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/5a69e4cf3a5f4b4693163e51cdf32c80-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-17 00:01:54","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.189},{"id":300863594,"title":"Trump to speak to Putin as Ukraine peacekeeping plans progress","text":"Donald Trump is expected to speak to Vladimir Putin this week as military chiefs prepare to discuss peacekeeping plans in London.\n\nThe call, announced by US special envoy Steve Witkoff, comes as Mr Putin continues to resist a US-backed proposal for a 30-day ceasefire in Ukraine.\n\nAlthough Ukrainian president Volodymyr Zelensky has accepted the proposed unconditional ceasefire, the Russian president has said Ukraine must agree to give up its ambitions of joining Nato and cede territory to Russia before any pause in hostilities.\n\nSir Keir Starmer has accused Mr Putin of seeking to “delay” a ceasefire, while French president Emmanuel Macron has said the Russian president “does not seem to be sincerely seeking peace.\n\nBut on Sunday, Mr Witkoff insisted that Mr Putin was making “a constructive effort” and that the upcoming call with Mr Trump showed there was “positive momentum”.\n\nMeanwhile, military chiefs from the “coalition of the willing” convened by Sir Keir and Mr Macron will meet in London on Thursday to discuss plans for a Western peacekeeping force to be deployed to Ukraine in the event of a ceasefire.\n\nFollowing a virtual meeting on Saturday with the leaders of 26 other nations, plus representatives from the EU and Nato, the Prime Minister said there had been “new commitments” offered and planning would now move into an “operational phase”.\n\nBut it remains unclear which nations have committed troops to a peacekeeping operation, while several have suggested such talks are premature given the lack of a ceasefire.\n\nMr Putin is also likely to object to any agreement that involves European or Nato troops being stationed in Ukraine, although Mr Zelensky sees this as essential to deterring future Russian aggression.\n\nMeanwhile, the fighting continues, with Ukraine said to be under increasing pressure in the eastern Donetsk region, part of which has been under Russian control since 2014.\n\nUkrainian troops are also reported to be in retreat in the Kursk region of Russia, which they seized in a surprise raid in August in an attempt to secure a bargaining chip for future negotiations.","summary":"Military chiefs will meet in London later in the week to discuss plans for a Western peacekeeping operation in Ukraine.","url":"https://www.standard.co.uk/news/politics/vladimir-putin-ukraine-donald-trump-volodymyr-zelensky-keir-starmer-b1217035.html","image":"https://static.standard.co.uk/2025/03/12/19/12-5a69e4cf3a5f4b4693163e51cdf32c80.jpg?width=1200","video":null,"publish_date":"2025-03-17 00:01:54","author":"Christopher McKeon","authors":["Christopher McKeon"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.189},{"id":300860430,"title":"Lying In Wait On The Ground, Russia’s Best Attack Drones Devastate Ukrainian Convoys","text":"A Russian drone about to strike a Ukrainian vehicle.\nRussian defense ministry capture\n\nOn Feb. 25, an elite Russian drone group—the Rubicon Center of Advanced Unmanned Systems—launched a devastating wave of attacks on the main supply line supporting the Ukrainian garrison in Sudzha, the center of the Ukrainian-held salient in western Russia’s Kursk Oblast.\n\nTwo weeks later on March 10 or 11, the Ukrainians evacuated Kursk and repositioned on the Ukrainian side of the border. They weren’t surrounded, as U.S. President Donald Trump falsely claimed—but they were beaten and forced out of Kursk after occupying part of the oblast for six months.\n\nThe Rubicon drone group was key to the Russian victory. And the group’s “advanced drone tactics,” as analyst Andrew Perpetua described them, were central to Rubicon’s efforts. Now we have video evidence of those tactics.\n\nOn or before March 12, a Russian first-person-view drone—clutching a warhead and feeding video back to its operators, likely via radio but possibly also via fiber-optic cable—flew over a road frequently traveled by Ukrainian supply trucks. That the road was dangerous was obvious: the wrecks of several vehicles dotted the road.\n\nRather than hovering over the road, its operator hoping a viable target passed by before the drone drained its battery, the drone settled onto the ground near the road—and waited. Resting rather than flying, the unmanned aerial vehicle preserved its precious battery life.\n\nA Ukrainian fiber-optic drone.\nSERHII FLASH CAPTURE\n\nPatiently waiting\n\nIn time, a Ukrainian convoy passed by. The drone lifted off, chased down the convoy—and barreled toward a pickup truck whose bed was heavy with supplies. The drone’s video feed cut out, so it’s unclear whether it struck the target. In any event, it at least got very close.\n\nIt’s not a new tactic. The best Ukrainians operators have been landing their drones in the target zone for months now. But it’s a tactic that requires skill and careful planning. Land a radio-controlled drone in the wrong spot and the operator might lose their connection. Land a fiber-optic drone in the wrong spot and its millimeters-thick, through which the drone sends and receives signals, could get tangled.\n\nRubicon’s operators clearly possess the skill and experience necessary to land a drone as part of a complex aerial ambush. And that’s not all. “They also set traps by landing drones on roads and detonating them under passing vehicles, functioning like anti-tank mines—likely using upward-facing shaped charges,” Perpetua noted.\n\nFollow me on Twitter. Check out my website or some of my other work. Send me a secure tip.\nEditorial StandardsForbes Accolades","summary":"Advanced drone tactics drove Ukrainian troops out of Kursk.","url":"https://www.forbes.com/sites/davidaxe/2025/03/16/lying-in-wait-on-the-ground-russias-best-attack-drones-devastate-ukrainian-convoys/","image":"https://imageio.forbes.com/specials-images/imageserve/67d7657069bcf5145a828d68/0x0.jpg?format=jpg&crop=1165,656,x120,y138,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-03-17 00:01:08","author":"David Axe,Forbes Staff","authors":["David Axe","Forbes Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.411},{"id":300865494,"title":"Interest rates set to stay at 4.5% as Bank of England faces ‘fog of uncertainty’","text":"The Bank of England is expected to keep interest rates on hold as policymakers face a “fog of uncertainty” over US President Donald Trump’s developing tariff policy and upcoming UK tax rises.\n\nExperts widely think that the Bank’s Monetary Policy Committee (MPC) will hold rates at 4.5% on Thursday.\n\nThe MPC has been gradually cutting borrowing costs since August last year, easing pressure on some borrowers who have seen lower mortgage rates enter the market.\n\nBut the Bank’s governor and member of the committee Andrew Bailey has been keen to stress that they want to take a “gradual and careful approach” to reducing rates while monitoring changes in the UK and global economy.\n\nIn particular, UK inflation has risen again in recent months, mainly thanks to energy prices, water bills and bus fares.\n\nSandra Horsfield, an analyst for Investec Economics, said the latest official data had been “bittersweet”, as the increase in the Consumer Prices Index (CPI) inflation rate to 3% in January “will not have been welcomed”.\n\n“But the 0.2 percentage points downside surprise in the services inflation rate, the stickiness of which has presented the main concern for the MPC even as overall inflation has fallen, will have been met with some relief,” she said.\n\nPolicymakers will also be considering the inflation impact of possible spending cuts in the Government’s spring statement, which will be unveiled at the end of this month, as well as new US tariffs on UK steel and aluminium.\n\n“There will also be evidence soon, rather than merely forecasts, of how firms are handling the rises in employer national insurance contributions and the minimum wage,” Ms Horsfield added.\n\n“Murky as the picture looks now, some things will become a lot clearer soon,” she said, adding: “The fog of uncertainty is an unavoidable constant in economic forecasting.”\n\nAndrew Goodwin, chief UK economist at Oxford Economics, said the “most obvious threat” to the path of interest rate cuts “will be evidence of the impact of April’s increases in regulated prices, employers’ national insurance contributions, and the national living wage”.\n\nThe Bank has previously said the extra costs for businesses could risk putting more people out of work, or add to inflation if retailers raise prices for customers.\n\nMr Goodwin is also expecting the MPC to keep interest rates at 4.5% on Thursday amid heightened uncertainty.\n\nFurthermore, Robert Wood and Elliott Jordan-Doak, economists at Pantheon Macroeconomics, said the MPC will “have to consider US President Trump’s actions” which have been “driving an equity market sell-off and skyrocketing uncertainty” and therefore fuelling concerns over the outlook for global economic growth.\n\nBut they added that the MPC is “as unable as anyone else to predict Mr Trump’s next move”.\n\nThe committee last month insisted that it is not yet known how tariffs – which have been placed on China, Canada and Mexico – will impact the UK economy.\n\nThe Pantheon economists predict interest rates will be kept on hold this month – but that two more cuts will come in May and November this year.","summary":"The Bank’s Monetary Policy Committee has been gradually cutting borrowing costs since August last year.","url":"https://www.standard.co.uk/business/business-news/interest-rates-set-to-stay-at-4-5-as-bank-of-england-faces-fog-of-uncertainty-b1217026.html","image":"https://static.standard.co.uk/2025/03/17/00/96b2f210cd52055fedb74ff71972d236Y29udGVudHNlYXJjaGFwaSwxNzQyMDQ1NTUw-2.75350512.jpg?width=1200","video":null,"publish_date":"2025-03-17 00:01:00","author":"Anna Wise","authors":["Anna Wise"],"language":"en","source_country":"GB","sentiment":-0.019},{"id":300863588,"title":"British Chagos Islanders set to sue UK Government over proposed deal","text":"Two British women born on the Chagos Islands are set to bring legal action against the UK Government, saying the territory should remain in UK hands and not be given over to Mauritius.\n\nBernadette Dugasse and Bertrice Pompe, who were both born on Diego Garcia, have begun a bid to take the Foreign Office to court over the proposed deal to cede sovereignty of the Chagos Islands to Mauritius.\n\nThe agreement, which includes a plan to lease back the strategically important US-UK military base on Diego Garcia at British taxpayers’ expense, appears to have been backed by US President Donald Trump, but is opposed by the Conservatives.\n\nMs Dugasse and Ms Pompe say the islands should remain under British control, and both want the right to return to live where they were born after Chagossians were forced to leave the central Indian Ocean territory by 1973 to make way for the base.\n\nAccess to the Chagos Islands is restricted, with permits required ahead of travel.\n\nLawyers for the two women have sent a pre-action letter to the Foreign, Commonwealth and Development Office (FCDO), claiming that the Chagossian people have unlawfully not been given a say in the future of the islands, despite being the native inhabitants.\n\nThey also say that they do not trust Mauritius to treat the Chagossians fairly, and that they would face “severe obstacles” as British citizens who do not hold Mauritian nationality, including possible racial discrimination and the loss of the possibility of returning.\n\nMs Pompe said: “Chagossians were removed from their place of birth, without their consultation, and have been treated badly for 60 years.\n\n“Since then we have been struggling to understand why we have been treated so poorly by the British government.\n\n“Our human rights have been stripped away.\n\n“Today the British government is repeating the same mistakes which it made 60 years ago.”\n\nShe added: “All our suffering and cries to be heard have been falling on deaf ears… I want to stay British and I also want the right to return to the Chagos Islands.”\n\nMs Dugasse described the proposed deal as bad for Chagossians.\n\nShe continued: “This deal will forbid me from returning to Diego Gracia where I was born, and serves only to extend the suffering of the indigenous Chagossians.\n\n“I am a British citizen and I cannot understand why we are being treated in this horrible way.”\n\nBarrister Michael Polak, representing Ms Pompe and Ms Dugasse, added: “The Government’s attempt to give away the Chagossian’s homeland whilst failing to hold a formal consultation with the Chagossian people is a continuation of their terrible treatment by the authorities in the past.\n\n“They remain the people with the closest connection to the islands, but their needs and wishes are being ignored.”\n\nThe FCDO was asked to respond to the legal letter by March 25.\n\nAn FCDO spokesperson said: “We do not comment on potential legal challenges.\n\n“The negotiations were between the UK and Mauritius with our priority being to secure the full operation of the base on Diego Garcia.\n\n“However, we have worked to ensure this agreement reflects the importance of the islands to Chagossians.”","summary":"Two British women born on Diego Garcia are prepared to bring legal action over the plans to cede sovereignty over the islands to Mauritius.","url":"https://www.standard.co.uk/news/politics/government-british-mauritius-uk-government-donald-trump-b1217049.html","image":"https://static.standard.co.uk/2025/03/17/00/f4138b1123bc80a5e0eb506f1234e179Y29udGVudHNlYXJjaGFwaSwxNzQyMTUzNjUw-2.78913499.jpg?width=1200","video":null,"publish_date":"2025-03-17 00:01:00","author":"Jess Glass","authors":["Jess Glass"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.646},{"id":300863764,"title":"Chagos Islanders launch bid to sue UK government and block ‘horrible’ handover deal","text":"Bernadette Dugasse, left, and Bertrice Pompe, who are planning to take the UK government to court (Picture: Bernadette Dugasse/Bertrice Pompe/PA Wire)\n\nA pair of British women who were born on the Chagos Islands are preparing to sue the UK government in a bid to stop the territory being handed over to Mauritius.\n\nBernadette Dugasse and Bertrice Pompe, who were both born on Diego Garcia, believe the current deal will prevent them ever returning home.\n\nTheir lawyers have sent a pre-action letter to the Foreign Office, arguing the Chagossians have unlawfully been left without a voice in the negotiation process.\n\nThe government’s deal, announced by Foreign Secretary David Lammy last October, would mean sovereignty over the Indian Ocean archipelago would be transferred from the UK to Mauritius.\n\nHowever, control over the strategically important air base on the island of Diego Garcia would remain with the UK and US as it is leased back at the British taxpayer’s expense.\n\nWhile the Conservatives and Reform have been stridently opposed to the deal, it looks likely to go ahead as US President Donald Trump has signalled his approval.\n\nNative Chagossians like Bernadette and Bertrice were told to leave their home by 1973 to make room for the air base.\n\nAccess back to the islands is heavily restricted and permits are required ahead of travel.\n\n Foreign Secretary David Lammy announced the deal last autumn (Picture: Andrej Ivanov/Getty Images)\n\nBertrice said her fellow islanders have been ‘treated badly for 60 years’.\n\nShe continued: ‘All our suffering and cries to be heard have been falling on deaf ears… I want to stay British and I also want the right to return to the Chagos Islands.’\n\nBernadette added: ‘This deal will forbid me from returning to Diego Gracia where I was born, and serves only to extend the suffering of the indigenous Chagossians.\n\n‘I am a British citizen and I cannot understand why we are being treated in this horrible way.’\n\nThe lawyers’ letter said the two women do not trust Mauritius to treat the islanders fairly, and they believe they would face ‘severe obstacles’ as British citizens who do not hold Mauritian nationality.\n\n The Chagos Islands are in the centre of the Indian Ocean, a strategically important location\n\nA Foreign Office spokesperson said: ‘We do not comment on potential legal challenges.\n\n‘The negotiations were between the UK and Mauritius with our priority being to secure the full operation of the base on Diego Garcia.\n\n‘However, we have worked to ensure this agreement reflects the importance of the islands to Chagossians.’\n\nThe government department was asked to respond to the legal letter by March 25.\n\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\n\nFor more stories like this, check our news page.","summary":"Bernadette Dugasse and Bertrice Pompe say the deal will not allow them to return home to Diego Garcia.","url":"https://metro.co.uk/2025/03/17/chagos-islanders-launch-bid-sue-uk-government-block-horrible-handover-deal-22735709/","image":"https://metro.co.uk/wp-content/uploads/2025/03/SEI_244098029-e1742138794663.jpg?quality=90&strip=all","video":null,"publish_date":"2025-03-17 00:01:00","author":"Craig Munro","authors":["Craig Munro"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.406},{"id":300865246,"title":"As Trump's tariff threats loom large, exporters take wind out of shippers' sails","text":"Chennai|New Delhi: A number of exporters in sectors such as electronics, gems and jewellery, apparel and footwear are airlifting consignments to the US to deliver products ahead of April 2, when reciprocal tariffs are due to come into force, industry officials said. Exporters are doubling down on sending consignments by air, Ajay Sahai, director general of the Federation of Indian Export Organisations told ET. But this is only possible for limited varieties of products like smartphones and electronics, gems and jewellery, some footwear like sports shoes and some apparel. Typically, companies looking to ship a hundred containers would split it in half over two months. But now, they are now taking it slow as buyers are asking them to send 25 containers in the first month and 25 containers each over subsequent three months, he added.Limited productsBut now, they are now taking it slow as buyers are asking them to “send 25 containers in the first month and 25 containers each over the subsequent three months,” Ajay Sahai, director general of the Federation of Indian Export Organisations (FIEO), told ET.Generally, air freight is seven to eight times higher than sea freight. 119085703However, spooked by the US tariff uncertainty, some companies are braving a slew of logistical challenges to hasten delivery by air, instead of the traditional mode of shipping.“Exporters are doubling down on sending their consignments by air,” said Sahai. But this is only possible for limited varieties of products like smartphones and electronics, gems and jewellery, some footwear like sports shoes and some apparel. The uncertainty around tariffs has concerned exporters and is causing pressure, he said, pointing out that while “the orderbook is very strong, we are seeing that despatches (by shipping) are low.”India’s goods exports shrank for the third straight month in January, declining 2.38% on-year to $36.43 billion. The merchandise trade deficit widened to a two-month high of $22.99 billion, from $16.56 billion a year ago and $21.94 billion in December 2024. India aims to clock $800 billion in goods and services exports this fiscal year.ET reported on March 11 that India is considering incentives for exporters to arrest the decline in outbound shipments and mitigate potential impact of reciprocal tariff plans by the Donald Trump administration.These incentives could be part of the Export Promotion Mission announced in the budget and are likely to be notified in a month. Though the government is yet to firm up the structure, the Rs 2,250-crore mission has room for flexibility in giving more incentives as the schemes are yet to be notified, an official had said earlier.Temporary moveFIEO's Ajay Sahai termed the rush to airlift consignments an “aberration” induced by the uncertainty of tariffs, more so, as only a fraction of the consignment can be transported by air“We have limited flights, limited belly capacity and even limited freighters, he explained. And many bookings are generally done in advance, so it leaves very limited space for additional capacity. It is possible for smaller consignments and for certain high-value shipments like electronics and gems and jewellery, but even for those scurrying to make the April 2 deadline, it may not be adequate owing to these logistical challenges.” However, container shipping associations pointed to exporters dragging their feet in signing annual contracts. While the hesitancy on the part of some of the exporters on signing of their new annual contracts with the lines, which normally happen around this time of the year, is understandable, it would be in their (exporters’) own interest to sign up to secure rates and space for themselves, as spot rates are generally higher, with no guarantees on space, said Sunil Vaswani, executive director at Container Shipping Lines Association (India).He added that with shipping services having moved over to the Cape of Good Hope, instead of the Suez Canal/Red Sea, space, cost and timely deliveries have become only more critical, underscoring the increased importance of service contracts.Exporters optimistic Several exporters, however, remain optimistic about a resolution to the tariff impasse, especially via the India-US Bilateral Trade Agreement (BTA).“Our customers are not panicking. India and the US are negotiating a BTA, and efforts are ongoing to balance the trade. There are no concerns on sending the goods via sea, said Rafeeque Ahmed, chairman of the Farida Group, one of India’s largest shoe manufacturers and exporters.","summary":"Exporters in sectors like electronics, gems and jewellery, apparel, and footwear are airlifting goods to the US to avoid reciprocal tariffs starting April 2. This method is mainly viable for specific products due to time constraints. Exporters are adjusting shipment volumes to accommodate buyer requests, spreading deliveries over several months.","url":"https://economictimes.indiatimes.com/news/economy/foreign-trade/exporters-take-wind-out-of-shippers-sails/articleshow/119085299.cms","image":"https://img.etimg.com/thumb/msid-119085577,resizemode-4,width-1200,height-900,imgsize-96280,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-17 00:00:00","author":"Dia Rekhi And Kirtika Suneja","authors":["Dia Rekhi And Kirtika Suneja"],"language":"en","category":"politics","source_country":"in","sentiment":-0.279},{"id":300864654,"title":"Democratic insiders complain Kamala Harris is ‘MIA’ after election: ‘Not the leadership the world needs’","text":"It’s a game of political hide and seek.\n\nDemocratic insiders are still stinging from losing the election to Donald Trump — and view Kamala Harris as a political “Where’s Waldo” who’s gone “MIA,” they say.\n\n“She’s MIA!” groused one Democratic insider to Page Six of Harris. \n\nThe political source added Harris’ husband “Doug [Emhoff] is telling people she’s the leader of the party, but there is a clear lack of leadership.”\n\n“The person you just spent $2 billion on trying to elect? I’m glad she’s having a good time going to a musical, and being repped by CAA,” said the insider, but, “this whole strategy of ‘do not do anything, or say anything,’ that’s not the kind of leadership the world needs right now.”\n\nLast month Harris signed with CAA, and saw “A Wonderful World” and “Gypsy” on Broadway.\n\n(Another source told us of Harris, and Joe Biden who’s also repped by the Hollywood power agency, “I don’t think bookings for them are through the roof.”)\n\nThe first source said they’re not a fan of California Gov. Gavin Newsom, who just launched a podcast, but, “at least he’s out there doing stuff.” With Harris, “It shows how kind of old the thinking is. Like, ‘Well I’m not going to run [for governor] for a year and a half, so I’ll go away.”\n\nThe source said, “One of her problems is that she’s the most risk-averse person on the planet. That’s one of the reasons she lost,” including too few interviews. “There was nothing to peel the onion back for people.”\n\nA new Telegraph opinion piece said of the election, “Another failure was Kamala Harris’ avoidance of new media forms,” and, a donor groused to the San Francisco Standard, “This was such a gut punch of an election for so many Democratic donors — not to mention an expensive gut punch. A number of the people I’ve talked to were just like, ‘What the f–k did I burn all that money for?’”\n\nBut a source familiar with the veep points out she appeared at the NAACP Image Awards, is fund-raising for the DNC and talking to federal and state leaders.\n\n“She’s talking to folks, not running around trying to get press,” said the insider, adding that followers are “eager to support her and they’re giving her space” to make her next move.","summary":"“The person you just spent $2 billion on trying to elect? I’m glad she’s having a good time going to a musical, and being repped by CAA,” said a source.","url":"https://pagesix.com/2025/03/16/society/democratic-insiders-complain-kamala-harris-is-mia-after-election-not-the-leadership-the-world-needs/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/03/100604220.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-03-16 23:55:42","author":"Ian Mohr","authors":["Ian Mohr"],"language":"en","category":"politics","source_country":"us","sentiment":-0.206},{"id":300864708,"title":"Cuba reconnects electrical grid, restores power to much of Havana after island-wide outage","text":"Cuba reconnected its national electrical grid and restored power to most of the capital Havana late on Sunday, energy officials said, nearly two days after an island-wide outage knocked out power to 10 million people.\nHavana’s electric company said late on Sunday that around two-thirds of its clients in the city had seen power restored and said that number would increase overnight.\nCheers could be heard in neighbourhoods across the city as the lights flickered on after two days without electricity.\nCuba blames the country’s mounting energy crisis on a Cold War-era US trade embargo and fresh restrictions from US President Donald Trump, who recently tightened sanctions on the Communist-run government and vowed to restore a “tough” policy towards the long-time US foe.\nThe government is pushing to develop large solar farms with help from China in a bid to reduce dependence on antiquated oil-fired generation.\nCuba’s grid collapsed on Friday evening after a transmission line at a substation in Havana shorted, beginning a chain reaction that completely shut down power generation across the island.\nMost of Havana – densely populated and a major tourism centre – had gone without power since then, paralysing commerce, closing most restaurants and blacking out street and traffic lights across the city of two million people.\nThe grid operator said the country’s two largest oil-fired power plants, Felton and Antonio Guiteras, were back online and generating electricity by late on Sunday, a major benchmark for restoring power across the island.\n\nElectricity had also arrived in the country’s westernmost Pinar del Rio province, the last to see power restored, just before dark on Sunday, officials said.\nFriday’s grid collapse marked the Caribbean island’s fourth nationwide blackout since October.\nCuba’s oil-fired power plants, already obsolete and struggling to keep the lights on, reached a full crisis last year as oil imports from Venezuela, Russia and Mexico dwindled.\nEven before Friday’s grid collapse, many across the island had already been experiencing daily blackouts that reached 20 hours or more.\nThough Cuba had made progress restoring electricity on Sunday, officials said they were generating just one-third of typical daily demand, leaving many residents still in the dark.\nSchools in Pinar del Río, Artemisa and Mayabeque provinces in western Cuba would remain closed until Tuesday to assure adequate conditions for students, the education ministry said.","summary":"Cuban government is pushing to develop solar farms with help from China in bid to reduce dependence on outdated oil-fired generation.","url":"https://www.scmp.com/news/world/americas/article/3302607/cuba-reconnects-electrical-grid-restores-power-much-havana-after-island-wide-outage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/17/f6b09457-e934-4888-9c06-679d569b20a5_c32abdd3.jpg","video":null,"publish_date":"2025-03-16 23:53:24","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.165},{"id":300861690,"title":"Trump’s EPA would roll back new limits on mercury emissions that Iron Range mining interests opposed","text":"The Trump administration will consider rolling back newly set limits on mercury emissions from the Iron Range’s taconite plants.\n\nThe mercury limits, finalized a year ago under the Biden administration but in the works for several decades, were included in a list of regulations targeted by the U.S. Environmental Protection Agency as part of what the agency called “the greatest and most consequential day of deregulation in the history of the United States.”\n\nThe finalized limits seek to reduce the industry’s mercury emissions by 33% and would also reduce the industry’s hydrofluoric acid and hydrochloric acid emissions.\n\nCleveland-Cliffs and U.S. Steel, which operate all six of Minnesota’s iron ore mines and pellet plants (Cliffs also runs the country’s only such facility outside Minnesota: Tilden Mine in Michigan), have previously challenged the rule, arguing the regulations would be too costly, burdensome and require unproven technology.\n\nBut environmental groups have vowed to fight back.\n\nJim Pew, the director of federal clean air practice for Earthjustice, said the decades-long effort to set mercury emission limits on taconite plants clearly demonstrated the law requires such limits.\n\nIn 1990, Congress amended the Clean Air Act to direct the EPA to set mercury emission standards by 2000, but the agency did not meet that deadline. The EPA also didn’t set a mercury limit in its 2003 required hazardous air pollutant rule for taconite processing facilities. Then, in 2005, the Circuit Court of Appeals required the EPA to establish mercury emissions limits.\n\nHowever, by 2019 and 2020, when the EPA released its proposed and final “National Emission Standards for Hazardous Air Pollutants: Taconite Iron Ore Processing Residual Risk and Technology Review,” mercury standards were again missing.\n\nIn 2020, the Minnesota Pollution Control Agency called on the EPA to set standards on mercury, and the EPA released a draft of the rule in 2023, which was finalized in March 2024.\n\n“And now the Trump administration thinks it’s going to take that away? Well, it’s not,” Pew told the Duluth News Tribune. “We’re going to see to that.”\n\nBecause the final mercury rule was published a year ago, any rollback would require the EPA to start the rulemaking process again for any rule modification or elimination. That includes publishing drafts of the rule and accepting public comment.\n\n“It will receive some very simple comments pointing out that that’s going to break the law,” Pew said, “and that it will be sued in court if it tries to finalize the proposal.”\n\nMercury, a potent neurotoxin that can harm human health even in small amounts, is found naturally in taconite and is released into the atmosphere through stack emissions as the taconite pellets are fired, or hardened, in the pelletization process.\n\nThe marble-sized pellets are made after the relatively low-grade iron ore is mined, crushed and concentrated. The process allows companies to ship the pellets to blast furnaces further down the Great Lakes where they are made into steel.\n\nOnce in the atmosphere, the mercury can then return to Earth, converting to toxic methylmercury as it enters the food chain. Humans consume it primarily through fish.\n\nThe MPCA maintains that activated carbon injection and high-efficiency wet scrubbers can reduce mercury emissions by up to 85%.\n\nBut an EPA economic impact analysis for the rule, released under former President Joe Biden, estimated compliance would cost the industry more than $500 million over a decade. President Donald Trump’s EPA cited that figure in its fact sheet on all of its proposed deregulation.\n\nIn 2009, the industry and MPCA agreed that each facility would reduce mercury emissions by 72% by 2025, a goal that was not met, putting the state’s overall mercury reduction goal out of reach as well. As most other industries, most notably coal-fired power plants, have reduced their mercury emissions, the taconite industry has remained relatively unchanged.\n\n“We remain committed to clean air, land, water and climate and the health of Minnesotans and the environment,” the agency said in a statement to the News Tribune.\n\nU.S. Steel praised the potential rollback.\n\n“We welcome the historic EPA actions by Administrator Zeldin and President Trump,” U.S. Steel spokesperson Andrew Fulton said in an email Thursday. “From our Minnesota iron mines to our Pennsylvania and Indiana steel mills, this commonsense approach protects the environment and will help keep steel like ours mined, melted and made in the USA.”\n\nCliffs did not respond to the News Tribune’s request for comment.\n\nThe Fond du Lac band of Lake Superior Chippewa, which did not respond to the News Tribune’s request for comment Thursday, has argued continued mercury emission from taconite plants would threaten its treaty rights by making the fish they have the right to catch, sell and consume unsafe to eat.\n\nIn a news release Wednesday, U.S. Rep. Pete Stauber, R-Minn., celebrated the EPA’s announcement and said he was “pleased to see this administration take historic action to roll back these burdensome regulations that raised the cost of living for every American family.”\n\nStauber said the air regulations “would have jeopardized the future of taconite mining in northern Minnesota.”","summary":"Environmental groups have vowed to fight back.","url":"https://www.twincities.com/2025/03/16/trumps-epa-would-roll-back-new-limits-on-mercury-emissions-that-iron-range-mining-interests-opposed/","image":"https://www.twincities.com/wp-content/uploads/2023/11/NewRange_Mine_21919.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-16 23:43:32","author":"Jimmy Lovrien","authors":["Jimmy Lovrien"],"language":"en","source_country":"us","sentiment":-0.428},{"id":300858954,"title":"US military shoots down Houthi drones as Trump’s strikes against terrorist group continue","text":"US warships have shot down roughly a dozen Houthi drones since President Donald Trump launched airstrikes against the terrorist organization on Saturday, Fox News has learned.\n\nA senior defense official told Fox News of the developments on Sunday.\n\nThe drones were aimed at the US Navy’s Truman Carrier Strike Group, and were shot down “well before” they posed a serious threat, the official added.\n\nThe latest military action came after nearly a year and a half of attacks from Houthis, both on commercial merchant vessels and US military ships.\n\nIn a Truth Social post on Saturday, Trump wrote that he had “ordered the United States Military to launch decisive and powerful Military action against the Houthi terrorists in Yemen.”\n\n“It has been over a year since a US-flagged commercial ship safely sailed through the Suez Canal, the Red Sea, or the Gulf of Aden,” Trump continued. “The last American Warship to go through the Red Sea, four months ago, was attacked by the Houthis over a dozen times.”\n\nTrump wrote that the “relentless assaults have cost the US and World Economy many BILLIONS of Dollars while, at the same time, putting innocent lives at risk.”\n\n“To all Houthi terrorists, YOUR TIME IS UP, AND YOUR ATTACKS MUST STOP, STARTING TODAY. IF THEY DON’T, HELL WILL RAIN DOWN UPON YOU LIKE NOTHING YOU HAVE EVER SEEN BEFORE!” his post concluded.\n\nTrump re-designated the Houthis as a foreign terrorist organization (FTO) in January. His first administration had named the Houthis as an FTO, but the Biden administration later reversed the move.\n\nOn Sunday, the White House released photos of Trump, Secretary of State Marco Rubio and National Security Adviser Mike Waltz monitoring the strikes.\n\n“President Trump is taking action against the Houthis to defend US shipping assets and deter terrorist threats,” the White House wrote on X. “For too long American economic & national threats have been under assault by the Houthis. Not under this presidency.” \n\nFox News Digital’s Danielle Wallace contributed to this report.","summary":"US warships have shot down roughly a dozen Houthi drones since President Donald Trump launched airstrikes against the terrorist organization on Saturday, according to a report.","url":"https://nypost.com/2025/03/16/us-news/us-military-shoots-down-houthi-drones-as-trumps-strikes-against-terrorist-group-continue/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/newspress-collage-vwcs26i88-1742166996115.jpg?quality=75&strip=all&1742152660&w=1200","video":"https://cdn.jwplayer.com/videos/OAubWYQe-RyIcpnTz.mp4","publish_date":"2025-03-16 23:38:43","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":-0.376},{"id":300859598,"title":"French Lawmaker Demands US Return Statue of Liberty","text":"Raphael Glucksmann, a member of the center-left Place Publique party in France, demanded on Sunday that the United States return the Statue of Liberty, accusing it of siding with \"tyrants.\"Newsweek reached out to the White House for comment by email on Sunday evening.The ContextEurope has negatively responded to President Donald Trump's approach to Ukraine and Russia amid their ongoing war, with many accusing Trump of siding with Russian President Vladimir Putin against Ukraine in ceasefire negotiations. Initial talks excluded Ukraine, with Trump insisting that Kyiv had \"no cards\" to play in negotiations.Matters came to a head when Trump and Ukrainian President Volodymyr Zelensky had an explosive argument in front of reporters during an Oval Office press gaggle on February 28, which resulted in the U.S. temporarily withdrawing military aid and intelligence from Ukraine.Russia has long been viewed by Republicans and Democrats as an adversary of the U.S. whereas Ukraine is an ally. U.S. allies in Europe have also raised alarms over Trump's stance toward Ukraine and Russia.What To KnowGlucksmann, a staunch defender of Ukraine, spoke at a party convention and took time to scold the U.S. for what he viewed as a shifting position on values.\"Give us back the Statue of Liberty,\" he said, according to the Agence France-Presse (AFP). \"We're going to say to the Americans who have chosen to side with the tyrants, to the Americans who fired researchers for demanding scientific freedom: 'Give us back the Statue of Liberty.'\"He added: \"We gave it to you as a gift, but apparently you despise it. So, it will be just fine here at home.\"France presented the U.S. with the Statue of Liberty in 1884 as a gift to commemorate the alliance between the two countries. The statue was disassembled and shipped aboard the French Navy vessel Isère and it arrived in 1885 where it was \"met with great fanfare,\" according to the National Parks Service. The entire structure was finished in 1886.The statue, which is in New York, has since become an icon of freedom and of the United States.\"The second thing we're going to say to the Americans is: 'If you want to fire your best researchers, if you want to fire all the people who, through their freedom and their sense of innovation, their taste for doubt and research, have made your country the world's leading power, then we're going to welcome them,'\" Glucksmann said Sunday.The slam against the U.S. was part of a wider attack on far-right leaders, particularly those in France, accusing them of being a \"fan club\" for Trump and his billionaire ally Elon Musk.Musk has led efforts to reduce the scope and spending of the federal government through the Department of Government Efficiency (DOGE), an unofficial agency created through executive order. Glucksmann took issue with this, accusing Musk of hitting hundreds of workers related to health and climate research.Meanwhile, Trump also withdrew from the Paris Climate Agreement mere hours after taking office again in January through executive order. The move is part of Trump's wider effort to create energy dominance and self-sufficiency in the U.S.What People Are SayingPresident Donald Trump on Saturday posted on Truth Social: \"I am pleased to inform you that General Keith Kellogg has been appointed Special Envoy to Ukraine. General Kellogg, a Highly Respected Military Expert, will deal directly with President Zelenskyy, and Ukrainian leadership. He knows them well, and they have a very good working relationship together. Congratulations to General Kellogg!\"Ukrainian President Volodymyr Zelensky wrote in part on X, formerly Twitter, on Saturday: \"After the talks in Jeddah and the American proposal for a ceasefire on the frontline, Russia stole almost another week – a week of war that only Russia wants.\"He added: \"We will do everything to further intensify diplomacy. We will do everything to make diplomacy effective. But every day now is about defending our independence, our state, and our people. We must remember – it is the support of our army, all our defense and security forces, and our state that determines everything.\"Kremlin spokesman Dmitry Peskov on Friday, per Russian news agency Tass: \"You must have heard the important statement that President Putin made yesterday. He said in response to questions from reporters that he backed Trump's position on the settlement. This is why, even though there is still a lot to be done, the president sided with Mr. Trump's stance.\"What Happens Next?Trump and Putin reportedly will look to speak this week, while the administration continues to ponder the contours of a deal with Ukraine that will create economic security guarantees by granting the U.S. access to vital rare earth minerals within the country.","summary":"Center-left French lawmaker Raphael Glucksmann accused the U.S. of abandoning the values that made it a strong ally to Europe.","url":"https://www.newsweek.com/french-lawmaker-demands-return-statue-liberty-2045670","image":"https://d.newsweek.com/en/full/2608353/statue-liberty-new-york.jpg","video":null,"publish_date":"2025-03-16 23:36:19","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":0.13},{"id":300857146,"title":"The lights are back on in Cuba after two-day blackout","text":"Cuba has reconnected its national electrical grid and restored power to the majority of the capital Havana, nearly two days after an island-wide outage knocked out power to 10 million people.\n\nHavana's electric company said late on Sunday that approximately two-thirds of its clients in the city had their power restored and said that number would increase overnight.\n\nCheers could be heard in neighbourhoods across the city as the lights flickered on after two days without electricity.\n\nCuba's grid collapsed on Friday evening after a transmission line at a substation in Havana shorted, beginning a chain reaction that completely shut down power generation across the island.\n\nMost of Havana - densely populated and a major tourism centre - had gone without power since then, paralysing commerce, shutting down most restaurants and blacking out street and stoplights across the city of two million people.\n\nThe grid operator said the country's two largest oil-fired power plants, Felton and Antonio Guiteras, were back online and generating electricity late on Sunday, a major benchmark for restoring power across the island.\n\nElectricity had also arrived in the country's westernmost Pinar del Rio province, the last to see power restored, just before dark on Sunday, officials said.\n\nFriday's grid collapse marked the Caribbean island's fourth nationwide blackout since October.\n\nCuba's oil-fired power plants, already obsolete and struggling to keep the lights on, reached a full crisis last year as oil imports from Venezuela, Russia and Mexico dwindled.\n\nEven before Friday's grid collapse, many across the island had already been experiencing daily blackouts that reached 20 hours or more.\n\nThough Cuba had made progress restoring electricity on Sunday, officials said they were generating just one-third of typical daily demand, leaving many residents still in the dark.\n\nCuba blames the country's mounting energy crisis on a Cold War-era US trade embargo and fresh restrictions from US President Donald Trump, who recently tightened sanctions on the communist-run government and vowed to restore a \"tough\" policy toward the long-time US foe.","summary":"Power has been mostly restored in Cuba, two days after the national grid collapsed leaving 10 million people in the dark.","url":"https://thewest.com.au/news/disaster-and-emergency/the-lights-are-back-on-in-cuba-after-two-day-blackout-c-18063689","image":"https://images.thewest.com.au/publication/C-18063689/11eed01c4f362eb3280f93a9bcd9cfecff0e782d-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-03-16 23:31:32","author":"Dave Sherwood,Dave Sherwoodreu","authors":["Dave Sherwood","Dave Sherwoodreu"],"language":"en","category":"sports","source_country":"au","sentiment":-0.228},{"id":300864944,"title":"UK Poised for Trade Talks With Philippines After Beef Ban Lifted","text":"The rapprochement comes after the Philippines agreed to drop its import ban on UK beef, which was prompted by the discovery on a British farm last year of Bovine Spongiform Encephalopathy — also known as mad cow disease. Along with a decision to lift its ban on poultry imports due to a case of bird flu, the move is estimated to be worth £80 million to the UK’s meat industry over five years.\n\n“Today’s talks signify an important new chapter in our trading relationship with the Philippines, one of Asia’s fastest-growing economies,” Alexander said in the statement. “Showing that the UK is open for business in Asia is vital” for this government’s efforts to spur economic growth, he said.\n\nThe dialog is the latest in a series of talks started up by the trade department since Labour swept to power last July. While the US remains the UK’s largest single-country trading partner, protectionist tariffs levied by President Donald Trump have forced Keir Starmer’s government to look at broadening relationships further afield with the likes of China, South Korea and Malaysia. \n\nBritain is also pursuing a post-Brexit reset with the European Union, and is in talks with Trump’s administration to agree a “new economic deal.”\n\nAlexander and Gepty will also discuss proposals for up to £5 billion of financing from UK Export Finance — a government body which helps British exporters — to help supply sustainable public infrastructure in the Philippines.","summary":"The UK is set to begin trade talks with the Philippines after the Asian nation agreed to lift an import ban on British beef and poultry products.","url":"https://financialpost.com/pmn/business-pmn/uk-poised-for-trade-talks-with-philippines-after-beef-ban-lifted","image":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/03/775669929.jpg","video":null,"publish_date":"2025-03-16 23:30:38","author":"Bloomberg News","authors":["Bloomberg News"],"language":"en","category":"politics","source_country":"CA","sentiment":0.092},{"id":300859244,"title":"Trump’s tariffs to reshape global trade with key role for Hong Kong: StanChart chairman","text":"US President Donald Trump is unlikely to impose “super tariffs” on China, although his trade policies could create new trade links and business opportunities in Asia, the Middle East and Africa, according to the outgoing group chairman of Standard Chartered.\nWhile Trump’s imposition of higher tariffs on Canada, China and Mexico have led to tit-for-tat responses and clouded the outlook for global growth, Jose Vinals played down the fears of a prolonged and debilitating trade war.\n“Tariffs are negative for global growth and global trade, but my hope, and also my guess, is that we are not going to have a ‘super tariff’ on China,” Vinals told a media briefing on Tuesday in Hong Kong, where the bank’s international advisory council hosted a meeting.\nHe believed the tariffs on China were unlikely to reach 60 per cent as feared by the market, as these tariffs would be modified after negotiations.\n\nTrump this month imposed tariffs of as much as 25 per cent tariffs on certain goods from mainland China, Canada and Mexico.\nVinals said a 10 per cent tariff could reduce China’s gross domestic product (GDP) by about 1 to 1.5 percentage points.\n“This is something that can be countered by domestic policy measures,” he said. “China already has quite a diversified supply chain, which limits the impact of the tariffs.”\nAs for Mexico, Canada and Europe, he said they would find new trading partners to counter the levy.\n“There will be less trade between the rest of the world and the US, and more trade between the rest of the world,” he said. “I can see more trade between Asia and the Middle East, between Asia and Africa, and [between] Asia and Latin America as a result of the tariffs.”\nThe London-based emerging-markets focused lender, which has operations in more than 100 markets in Asia, the Middle East and Africa, was in a good position to help clients develop new cross-border trade relationships, Vinals said.\nHong Kong would be Standard Chartered’s leading market to capture international trade and wealth management business, he added, pointing to the city’s role as a “superconnector” between China and the world.\nStandard Chartered reported a 19 per cent increase in underlying pre-tax profit to US$6.8 billion for 2024. Of this, 34 per cent came from Hong Kong, its biggest market.\nVinals pointed out that during his visit to the city, he noted a stark difference between now and the Covid-19 pandemic: Hong Kong International Airport was buzzing and the traffic on the roads meant that the city had fully recovered from the pandemic-led slowdown.\n\n“This is very good for all of us who are so committed to supporting Hong Kong as an international financial centre,” he said. “We continue seeing formidable opportunities in Hong Kong and in mainland China.”\nVinals will step down as chairman after nine years in the post – the maximum permitted in the UK – at the bank’s annual general meeting on May 8. He will pass the baton to Maria Ramos, a veteran banker.\nBefore his appointment in 2016, Vinals held positions at the International Monetary Fund, where he was the chief spokesman on financial matters.\nVinals said he has had a successful tenure at the bank, achieving the desired results in three key areas: leading the management team to focus on wealth management and cross-border banking, enhancing capital strength and risk management, and improving corporate governance.\nOne of the first things on his agenda after stepping down is to travel with his wife along Spain’s Mediterranean coast.\n“I do hope to keep coming back to this part of the world, particularly to Hong Kong and China, because I have developed a tremendous attachment,” he said. “I have always enjoyed all my visits here enormously.”","summary":"Jose Vinals to bid adieu at the bank’s annual general meeting in May after nine years at the helm.","url":"https://www.scmp.com/business/banking-finance/article/3302468/trumps-tariffs-reshape-global-trade-key-role-hong-kong-stanchart-chairman","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/14/19890f4b-f784-4338-9e7d-48db9e7ff574_fa594c1c.jpg","video":null,"publish_date":"2025-03-16 23:30:11","author":"Enoch Yiu","authors":["Enoch Yiu"],"language":"en","source_country":"cn","sentiment":0.144},{"id":300857618,"title":"Anderson Cooper criticizes Trump for purchasing Tesla in front of White House","text":"Anderson Cooper accused president Donald Trump of turning the White House south lawn into a Tesla showroom for his largest donor, Elon Musk.\n\nThe CNN anchor went on a blistering rant against the president, comparing him to a car’s salesman after Trump held an advertising event for Tesla on Tuesday.\n\n‘For about 36 minutes today, the south lawn of the White House was transformed into a Tesla showroom – a live advertisement featuring the president and the man he told Congress last week headed the Department of Government Efficiency, Elon Musk,’ Cooper said.\n\n‘This was, as the president described it, meant to be a boost to Musk and Tesla – specifically, encouraging people to but those cars… they are having sales issues right now, and the president was wanting to help his largest donor.’\n\nCooper noted the financial markets were plummeting over tariffs uncertainty as Trump was checking out the Teslas at the White House.\n\n‘The president spent little time discussing any of that publicly today. He had Teslas to sell,’ Cooper added, before he shared footage of president Trump promoting the electric cars.\n\nTesla’s share price has plummeted by a third over the last month. The electric vehicle maker was beloved by liberal environmentalists, many of whom are now appalled by Musk’s closeness to Trump and frequent right-wing pronouncements.\n\nTrump’s endorsement of the brand is likely to win any of them back. The Republican president has previously slammed electric vehicles and polling from 2024 showed 71% of conservatives have no interest in buying an EV. \n\n‘What is this one, Elon?’ Trump asked as he pointed to the red $76,000 model he ended up buying.\n\n‘I want to make a good deal here… you know, they have one which is $35,000, which is pretty low. What is that all about?\n\nThe model Trump bought, which he said his staff at the White House would use, has a starting price of $76,880.\n\nHe and Musk sat in the car. Trump started the engine and Musk showed him the features. Alas, the president didn’t take it for a test drive, saying the Secret Service wouldn’t let him.\n\nHe added he would pay by personal check. \n\n‘I don’t want a discount,’ he said.\n\nMusk said he would accept a personal check from the president.\n\n‘His credit’s good,’ Musk joked. He had his young son X with him on the South Lawn.\n\nTrump also used the photo opportunity to slam his predecessor Joe Biden.\n\n‘You think Biden could get into that car? I don’t think so,’ he said.\n\nTrump spoke for about 30 minutes as he checked out the vehicles.\n\nHe said of Musk: ‘I think he’s been treated very unfairly by a very small group of people. And I just want people to know that he can’t be penalized for being a patriot.’\n\nHe also shrugged off the declining stock market: ‘Markets are going to go up and they’re going to go down but, you know what, we have to rebuild our country.’\n\nTrump was making good on a his promise to purchase one of the pricey electric cars to support Musk, who is leading his Department of Government Efficiency efforts to cut back the size and scope of the federal government.\n\nBut Trump and Musk’s bond has caused the car manufacturer problems. About 350 demonstrators protested outside a Tesla electric vehicle dealership in Portland, Oregon, last week, while nine people were arrested during a raucous demonstration outside a New York City Tesla dealership earlier in March.\n\nThere have also been recent reports of vandalism on Tesla vehicles and showrooms that are under investigation.\n\nWhile speaking out in defense of the world’s richest man, he announced his plans to levy harsh penalties on anyone who went after his most famous company after he was asked if the violence against them should be labeled ‘domestic terrorism.’\n\n‘I will do that,’ he said. ‘I’m gonna stop ’em if we catch anybody doing it because they’re harming a great American company.’\n\nHe pointed out that he’d done ‘very big favors’ for other American companies like the National Football League.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAnderson Cooper accused president  Donald Trump of turning the White House south&#8230;\n\n\nThis Post: Anderson Cooper criticizes Trump for purchasing Tesla in front of White House first appeared on Internewscast Journal","url":"https://internewscast.com/world-news/anderson-cooper-criticizes-trump-for-purchasing-tesla-in-front-of-white-house/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Anderson-Cooper-slams-Trump-for-buying-Tesla.jpg","video":null,"publish_date":"2025-03-16 23:29:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.232},{"id":300857616,"title":"Authorities ‘informed’ about footage of individual damaging Cybertruck","text":"Over the weekend, a video went viral online showing a person wearing a mask approaching a Tesla CyberTruck and scratching it with a key.\n\nThe incident took place in a parking lot at the Colorado Mills Mall, prompting the police in Lakewood to initiate an investigation. While the authorities confirmed the ongoing investigation, they refrained from divulging any specific details at this moment.\n\nThe police categorized the actions captured in the video as “criminal mischief” and urged anyone with relevant information or who can identify the individual in the footage to contact Jeffcom 911 at 303-980-7300. However, no still images from the video have been shared by the authorities yet.\n\nProtests of Tesla due to its CEO, billionaire Elon Musk, have grown increasingly common in the weeks since the presidential inauguration and President Donald Trump naming Musk the head of the new Department of Government Efficiency. On Saturday, the “Tesla Takedown” movement held a series of demonstrations across the country to encourage divestment from the company with a goal of hurting Musk’s wallet.\n\nIn Loveland, a 24-year-old Fort Collins resident was arrested by police in connection to an incident at the Loveland Tesla dealership on March 7. Police said an incendiary device was ignited and thrown at the Tesla building that day, ultimately landing between two vehicles.\n\nOn March 7, Loveland police told FOX31’s Kasia Kerridge that in five weeks since late January, there had been five incidents of vandalism, incendiary devices, spray painting and arson.\n\nIt was the second arrest for vandalism and criminal mischief at the dealership, which resulted in a 40-year-old suspect facing charges for allegedly vandalizing vehicles at the dealership in January “with graffiti, some of which were offensive and hateful in nature.” An incendiary device was also allegedly recovered from the scene.\n\nOn Friday, The Associated Press reported that gunshots were fired at a Tesla dealership in Oregon on Thursday for the second time in a week; and that on Sunday, four Cybertrucks were destroyed in a blaze in Seattle. But investigators have not said if the fire, or fires, were intentionally set.","summary":"Internewscast Journal\n\nInternewscast\n\n\nOver the weekend, a video went viral online showing a person wearing&#8230;\n\n\nThis Post: Authorities &#8216;informed&#8217; about footage of individual damaging Cybertruck first appeared on Internewscast Journal","url":"https://internewscast.com/news/authorities-informed-about-footage-of-individual-damaging-cybertruck/","image":"https://www.newsnationnow.com/wp-content/uploads/sites/108/2025/03/tesla-vandalism-e1740668026733.jpg?w=800","video":null,"publish_date":"2025-03-16 23:26:49","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.289},{"id":300859636,"title":"Death toll in US strikes on Yemen exceeds 50, up to 100 wounded — health official","text":"DUBAI, March 17. /TASS/. The death toll in US strikes on the territory of Yemen, which is controlled by the rebel movement Ansar Allah, increased to 53, while at least 98 people were reported to be wounded, Houthi-run Health Ministry spokesperson Anees Alsbahi said on Monday.\n\n\"As a result of the strikes on civilians carried out by the American enemy on March 15, 53 people were killed and 98 more were wounded,\" Alsbahi said on his X social network account.\n\nOn March 15, the Al Masirah TV channel, controlled by the Houthis from the Ansar Allah movement, reported that Yemen’s capital, Sanaa, had come under airstrikes. Later, US President Donald Trump announced that he had ordered military operations against Ansar Allah.\n\nAccording to the Al Hadath TV channel, the strikes targeted the headquarters of the Houthis' Supreme Political Council, as well as weapons warehouses and rebel command centers in Sanaa. The United States also carried out strikes on Yemeni rebel targets in the Saada, Dhamar, and Al Bayda governorates.","summary":"According to the Al Hadath TV channel, the strikes targeted the headquarters of the Houthis' Supreme Political Council","url":"https://tass.com/world/1929001","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-03-16 23:25:16","author":"Tass","authors":["Tass"],"language":"en","source_country":"ru","sentiment":-0.129}]}