{"offset":0,"number":50,"available":18888,"news":[{"id":281772926,"title":"‘Pathway to peace’: Wong’s call on Trump","text":"The guns fell silent in Gaza for the first time in 15 months on Sunday (local time) after the first phase of a ceasefire-for-hostages deal between Israel and Hamas came into force.\n\nSenator Wong said the breakthrough was a “potential pathway to peace”. \n\n“Of course, it’s difficult,” she told reporters from Washington.\n\n“We’ve seen that because there have been so many false starts in terms of the ceasefire discussions, but we welcome the release of some hostages.\n\n“There is the opportunity in the Middle East now for the Trump administration to take forward an agenda around greater stability and normalising, particularly given the weakened position of Iran, and that is a good thing for security in the region.”\n\nSenator Wong is in the US capital for Mr Trump’s inauguration on Monday (local time).\n\nLast week, she downplayed remarks she made in 2021 saying Mr Trump “was prepared to trash alliances and partnerships for personal political interest”.\n\nAlthough, she did not directly say whether her view of the incoming US president had changed.\n\nHamas released three Israeli hostages on Sunday under the US and Qatari-brokered ceasefire.\n\nIn exchange, Israel is set to release 90 Palestinian prisoners.\n\nThe Albanese government has long been a vocal advocate for an end to the fighting in Gaza, largely due to the conflict’s high civilian death toll.\n\nAnthony Albanese on Monday welcomed the release of the hostages.\n\n“Of course, hostages should never have been taken in the first place, and the fact they’ve been kept for 15 months has prolonged the conflict in the region,” the Prime Minister told the ABC.\n\n“Our thoughts are also with the remaining hostages … We must now see their full release and the ceasefire deal implemented in full, including increased aid into Gaza, where people have suffered enormously, innocent people.”","summary":"Australia’s foreign minister Penny Wong has signalled high hopes for Donald Trump’s second presidency ahead of his inauguration in Washington DC.","url":"https://www.news.com.au/national/politics/donald-trump-has-opportunity-to-stabilise-middle-east-penny-wong-says/news-story/57a13ac0f82fb6f4f69e3f997bfc0b84?from=rss-basic","image":"https://content.api.news/v3/images/bin/74445fcd6ac4964b4637c9b9d4e8130f","video":null,"publish_date":"2025-01-20 01:02:32","author":"Joseph Olbrycht","authors":["Joseph Olbrycht"],"language":"en","category":"politics","source_country":"au","sentiment":-0.213},{"id":281772628,"title":"Immigrants in Chicago and other US cities brace for expected Trump deportation arrests","text":"CHICAGO (AP) — The Rev. Homero Sanchez said he didn’t realize the depth of fear in the Chicago immigrant community he serves until someone asked him to handle the sale of their family’s home and other finances if they are picked up this week when President-elect Donald Trump takes office.\n\nImmigrants in large cities have been preparing for mass arrests since Trump won election in November, but reports that his initial push would be in the Chicago area has brought a new sense of urgency and fear.\n\n“They feel they have been targeted for who they are. They feel like they’re reviving this fear they had eight years ago,” said Sanchez of St. Rita of Cascia Parish on Chicago’s South Side. “They’re feeling like something is going to happen. This is not their city because of the threat.”\n\nSanchez, whose congregation has consisted mostly of people of Mexican descent since the 1980s, devoted Sunday Mass “to solidarity with our immigrant brothers and sisters.”\n\nSome immigrants in the country without legal status have been designating power of attorney to trusted friends, making plans for childcare in case of separations and installing security cameras on their doors in case immigration agents come. Others have left voluntarily, as Trump aides have encouraged them to do.\n\nPlans for deportation arrests are in flux, but federal immigration officers will target more than 300 people with histories of egregious, violent crimes after Trump takes office Monday, one official said Saturday, speaking on condition of anonymity because the plans have not been made public.\n\nThe operation will be concentrated in the Chicago area and continue all week, subject to potential weather delays, the official said. Temperatures in Chicago dipped to 6 degrees Fahrenheit (-14.4 degrees Celsius) with cold temperatures forecast throughout the week.\n\nU.S. Immigration and Customs Enforcement arrests a fraction of its targets in such operations, though Trump is expected to cast a wider net than President Joe Biden, whose focus on picking up people away from the border was largely limited to those with serious criminal histories or who pose a risk to national security. Biden’s administration also ended the practice of mass worksite arrests, which were common under Trump, including a 2019 operation targeting Mississippi chicken plants.\n\nTrump aides have said they will arrest others, such as spouses or roommates, who are not targets but happen to be in the country illegally.\n\nTrump told NBC News on Saturday that mass deportations remain a top priority. He didn’t give an exact date or city where they’ll start, but he said they would begin soon.\n\n“It’ll begin very early, very quickly,” he said, adding: “I can’t say which cities because things are evolving. And I don’t think we want to say what city. You’ll see it firsthand.”\n\nSanctuary cities, which limit how local police can cooperate with federal immigration agents, have been one of Trump’s favorite targets — especially Chicago.\n\nThe nation’s third-largest city became a so-called sanctuary city in the 1980s and has beefed up its policies multiple times since, including after Trump first took office in 2017. Last week, the City Council heartily rejected a longshot plan calling for exceptions allowing local police to work with ICE agents on deportation cases for people accused or convicted of crimes.\n\nTrump’s incoming so-called “border czar” Tom Homan blasted top Democratic leaders in the state during a visit to the Chicago area last month where he indicated enforcement would start there. But in recent days he told media outlets that plans were evolving.\n\nHoman said on the Fox News program “America’s Newsroom” on Sunday that Chicago was still on the table but that the new administration was “reconsidering when and how we do it.”\n\nAn ICE spokesperson referred questions Sunday to the Trump transition team, which did not immediately respond to a request for comment. The plan was reported earlier by The Wall Street Journal, which said the operation is expected to begin Tuesday.\n\nCommunity and religious leaders in Chicago said they were disappointed with the potential operation, but ready.\n\nChicago Mayor Brandon Johnson said Sunday on X that his “commitment to protecting and supporting this city remains unwavering.”\n\nCardinal Blase Cupich, who leads the Archdiocese of Chicago, spoke out as well.\n\n“The reports being circulated of planned mass deportations targeting the Chicago area are not only profoundly disturbing but also wound us deeply,” Cupich said Sunday during a visit to Mexico City, according to a copy of his prepared remarks. “We are proud of our legacy of immigration that continues in our day to renew the city we love.”\n\nImmigrant rights advocates in Chicago rallied Saturday, including Democratic U.S. Reps. Jesus “Chuy” Garcia and Delia Ramirez. They urged immigrants in Chicago to remain calm and exercise their rights, particularly to remain silent and refuse to allow officers into their homes without warrants. Some advocacy groups have planned legal workshops anticipating mass arrests next week.\n\nRamirez planned to skip Monday’s inauguration to post flyers in immigrant-heavy Chicago neighborhoods with information on what to do in case of an encounter with immigration agents.\n\n“We won’t let our guard down in Chicago,” Garcia wrote on X.\n\nCarlos, an immigrant from Mexico, has lived in the Chicago area for decades. The 56-year-old doesn’t have legal status to stay in the country but has work authorization in construction and welding. He declined to give his last name and discuss details of his immigration status for fear of being targeted for deportation.\n\nHe has three children who have legal status to stay in the country through the Obama-era Deferred Action for Childhood Arrivals, or DACA, which remains in legal limbo.\n\nCarlos said the family’s contingency planning for deportation includes finding someone to manage their bank accounts, home and car. They’ve also installed a camera on their suburban Chicago home and plan to screen all visitors.\n\n“If people come to the house, don’t open the door,” he explained. “Ask who it is. Don’t open it unless they have an order.”\n\nAssociated Press writer Elliot Spagat contributed to this report from San Diego.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"CHICAGO (AP) — The Rev. Homero Sanchez said he didn&#8217;t realize the depth of fear in the Chicago immigrant community he serves until someone asked...","url":"https://whdh.com/news/immigrants-in-chicago-and-other-us-cities-brace-for-expected-trump-deportation-arrests/","image":"https://whdh.com/wp-content/uploads/sites/3/2021/10/handcuff-gb6c6e303c_1920-e1683397016632.jpg?quality=60&strip=color","video":null,"publish_date":"2025-01-20 00:54:05","author":"Owen Boss","authors":["Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":0.021},{"id":281771730,"title":"Trump looks to remake America with sweeping second act","text":"Every new president begins a fresh chapter in American history. And when Donald Trump is inaugurated in a frigid Washington DC on Monday, he will be hoping to usher in a new era for this country.\n\nThe ceremony in the rotunda of the US Capitol, moved indoors for the first time in decades due to the bitter cold, will also mark the moment he starts being judged on action and not promises. \n\nAnd he has promised seismic change as well as action on day one. At a raucous rally in the city on Sunday, Trump said he would sign a flurry of executive orders within moments of being inaugurated, covering issues ranging from immigration and deportations to the environment and transgender rights.\n\n“You’re going to have a lot of fun watching television tomorrow,” he told the crowd here.\n\nBut even if his presidency begins with a serious bang, there are still questions about what Trump’s second act will look like.\n\nWill we feel the tectonic plates of power shift beneath our feet as he re-enters the White House? Can he deliver his pledged sweeping reforms? Will it be as apocalyptic as his opponents suggest?\n\nListening to some of his detractors, you would be forgiven for thinking the skies will darken and the birds will flee Washington as soon as he takes the oath of office.\n\nMany worry he will try to rule as an autocrat and undermine American democracy. His predecessor, Joe Biden, pointedly used his final Oval Office address to warn of a dangerous oligarchy of unaccountable billionaires forming around Trump that threatens the basic rights and freedoms of Americans.\n\nBut no one can deny Trump, 78, has a clear mandate after his decisive election victory in November. He won the popular vote and the electoral college. He won a clean sweep of swing states. His agenda has the green light from voters.","summary":"Getty Images Every new president begins a fresh chapter in American history. And when Donald Trump is inaugurated in a frigid Washington DC on Monday, he will be hoping to usher in a new era for this country. The ceremony in the rotunda of the US Capitol, moved indoors for the first time in decades &#8230;\n\n\nThe post Trump looks to remake America with sweeping second act appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/trump-looks-to-remake-america-with-sweeping-second-act/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/d235/live/4f5767a0-d521-11ef-94cb-5f844ceb9e30.jpg","video":null,"publish_date":"2025-01-20 00:50:26","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.267},{"id":281770730,"title":"Obama spotted without Michelle at DC hotspot for inauguration weekend amid divorce rumors","text":"Former President Barack Obama was seen enjoying a meal at a Washington DC hotspot over the weekend, without his wife Michelle - amid rumors they may be getting a divorce. \n\nThe 44th President of the United States appeared very happy as he attended a dinner party at Osteria Mozza on Saturday night with a small group of Washington insiders, including President Joe Biden's Chief of Staff, Jeff Zients, sources told Page Six.\n\nOne such source said Obama, 63, was 'very nice' but 'didn't take photos with people.' \n\nJessica Sidman, the food editor for Washingtonian, though, posted a photo through the window of the restaurant, showing Obama posing with other diners.\n\n'Barack Obama dined at Osteria Mozza tonight, where I hear he was greeted by applause before heading to a private room,' she wrote on social media.\n\nBut Michelle, 61, has eaten at the swanky 'California-style Italian' restaurant before.\n\nShe hosted a 10-person holiday dinner for her team back in November, just two weeks after the restaurant opened in Washington DC's Georgetown neighborhood, according to Page Six.\n\nA source had overheard the restaurant's staff even telling the former first lady she was the first person to book a private room, to which she reportedly replied: 'Well. let's christen it.' \n\nYet those close to Michelle said she 'checked out' of DC politics after she and her husband left the White House in 2017.\n\nIn recent weeks, she skipped out on former President Jimmy Carter's memorial service over a reported 'scheduling conflict' and declined to attend President-elect Donald Trump's inauguration\n\n'She’s always been very deliberate about where and how she shows up,' an insider told Page Six.\n\n'She showed up reluctantly for the election. They were united, but she doesn’t have to unify around [Trump]. Her absence speaks volumes.'\n\nStill, Michelle's absences has fueled 'nonstop chatter that Michelle is fed up with the political circus and pretending everything is OK with Barack all the time,' one insider said.\n\n'I'm told she was furious at seeing her husband yukking it up with Trump at the Carter funeral' the source added. \n\nA source who worked with the couple also admitted: 'They don’t pretend that they have this Camelot relationship. They’re not trying to present that they’re this magical couple.'\n\nSome have even speculated that the couple may be splitting up.\n\nBut Obama tried to quell those rumors by posting a gushing tribute to his wife, who he described as the 'love of his life'. \n\n'Happy birthday to the love of my life, @MichelleObama,' he wrote, alongside a snap that showed them holding hands while enjoying dinner.\n\n'You fill every room with warmth, wisdom, humor, and grace – and you look good doing it. I’m so lucky to be able to take on life's adventures with you. Love you.'\n\nThe couple have previously spoken candidly about their martial struggles, with Michelle previously describing the 'resentment' she had over having to put her career on hold to be a mother while Barack's continued to flourish.\n\nTensions only grew during their time in the White House - thanks to the immense 'pressure' that came with 'needing to get everything right and be \"on\" at every moment,' as well as Barack's focus on his work rather than his family.\n\nBut even at their worst, Barack explained to The Breakfast Club that they never let their arguments turn too ugly - and that they always 'respected' one another. \n\nAnd he made it clear that even when they would fight, he never considered a divorce.\n\n'We were pretty good even when things were tough, we never loss basic respect for the other person,' he shared.\n\n'We never thought that person was a bad person. We never said things that would make it seem that you completely disrespect me.\n\n'It was more, \"I love you, Barack, but this is driving me crazy,\" or, \"I respect you, but...\" I think that's what kept us 'cause we never doubted each other's intentions.\n\n'Michelle is a remarkable woman. Even if she drives me crazy sometimes, I never thought that there was anybody who I would rather be with.","summary":"Former President Barack Obama was seen enjoying a meal at Washington DC's Osteria Mozza on Saturday night without his wife Michelle - amid rumors they may be getting a divorce.","url":"https://www.dailymail.co.uk/news/article-14303039/Obama-dinner-without-Michelle-inauguration-weekend.html","image":"https://i.dailymail.co.uk/1s/2025/01/20/00/94277597-0-image-a-8_1737333025385.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/01/09/5221688015063136076/1024x576_MP4_5221688015063136076.mp4","publish_date":"2025-01-20 00:43:37","author":"Editor,Melissa Koenig","authors":["Editor","Melissa Koenig"],"language":"en","source_country":"gb","sentiment":0.136},{"id":281772548,"title":"MAGA moment: Donald Trump declares 'brand-new day' for US, says curtain closes on American 'decline'","text":"On the day before his inauguration, US President-elect Donald Trump addressed a jubilant crowd, highlighting his electoral triumph and expressing confidence about the nation's future, despite existing political rifts. \"Tomorrow, at noon, the curtain closes on four long years of American decline, and we begin a brand-new day of American strength and prosperity, dignity and pride,\" Trump declared to his supporters, adding, \"We not only won a mandate, but we built a new American majority that will lead our country to success for generations to come.\"The Capital One Arena, with its 20,000-plus capacity, was nearly full as Kid Rock performed \"All Summer Long\", despite a cold mix of rain and snow falling outside.— realDonaldTrump (@realDonaldTrump) Lee Greenwood performed his signature song \"God Bless the USA\", which had become synonymous with Trump's re-election campaign.Actor Jon Voight addressed the gathering, saying, \"Our hero. A man who never gave up on the American people, and we the people never gave up on him.\"Stephen Miller, the incoming deputy chief of staff, promised significant changes, emphasising the administration's commitment to stringent immigration policies.Trump's agenda included signing several executive orders, particularly regarding US-Mexico border policies.His first complete day back in Washington included a private breakfast with Republican senators at Blair House, followed by a photograph with ten Republican female senators and his incoming chief-of-staff, Susie Wiles.Unlike the Capitol attack in 2021 following Trump's loss to Biden, authorities anticipated a peaceful transition. Supporters celebrated Trump's second term and MAGA's influence within the Republican Party.Attendees travelled from across the country, dressed formally, including some in fur coats.Trump supporters gathered at various Washington venues for celebrations. The phrase \"MAGA\" was frequently heard as both a chant and greeting amongst attendees.The positive atmosphere contrasted sharply with four years prior, when Trump departed Washington in controversy, avoiding Biden's inauguration.","summary":"President-elect Trump addressed supporters, highlighting his electoral victory and expressing optimism about America's future despite political divisions. He emphasized new government policies, including strict immigration reforms, while acknowledging a peaceful transition. Celebrations included performances by Kid Rock and Lee Greenwood, with Trump's supporters gathered in formal attire.","url":"https://timesofindia.indiatimes.com/world/us/maga-moment-donald-trump-declares-brand-new-day-for-us-says-curtain-closes-on-american-decline/articleshow/117382043.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117382132/117382132.jpg","video":null,"publish_date":"2025-01-20 00:42:30","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.581},{"id":281769768,"title":"Blinken overruled America’s top general on Ukraine peace talks – NYT","text":"Outgoing US State Secretary Antony Blinken urged Ukraine to continue its military efforts against Russia rather than pursue peace negotiations in 2022, the New York Times reported on Saturday.\n\nIn late 2022, Chairman of the Joint Chiefs of Staff Mark Milley advised Kiev to capitalize on its battlefield successes by seeking peace talks with Moscow. However, Blinken insisted that Ukraine should press on with its military campaign, the newspaper wrote.\n\n“Less a peacemaker than a war strategist,” the US diplomat frequently argued against more “risk-averse Pentagon officials,” lobbying for advanced American weaponry to be sent to Ukraine, NYT wrote.\n\nWashington has spent “approximately $100 billion” on Ukraine since the conflict escalated in February 2022, while allies and partners have contributed an additional $150 billion, Blinken said during a January appearance at the Council on Foreign Relations.\n\nThe outgoing Biden administration has expedited arms deliveries to Kiev ahead of the inauguration of US President-elect Donald Trump, who has indicated that he might reduce military aid to Ukraine in favor of addressing domestic priorities.\n\nThe Biden administration had been covertly arming Ukraine months before the conflict intensified, Blinken admitted in a January interview with the NYT. “Starting in September and then again in December, we quietly got a lot of weapons to Ukraine to make sure that they had in hand what they needed to defend themselves – things like Stingers, Javelins that they could use,” he said.\n\nRussia and Ukraine initially engaged in peace negotiations in early 2022 in Istanbul. Both sides provisionally agreed to a truce under which Kiev would renounce its NATO membership ambitions, adopt neutrality, and limit its military size in exchange for international security guarantees. However, Ukraine later withdrew from the talks at the urging of then-UK Prime Minister Boris Johnson, according to David Arakhamia, a Zelensky-allied MP and chief negotiator for Kiev.\n\nLast month, Swiss diplomat Jean-Daniel Ruch similarly accused the US and UK of derailing peace talks between Kiev and Moscow. Speaking to the French-language media outlet Anti-Thèse, Ruch claimed that Johnson acted “on duty for the Americans.”\n\nMoscow has reiterated its willingness to resume peace negotiations, provided they are based on the Istanbul draft agreements and reflect the “new territorial realities,” including the accession of four former Ukrainian regions to Russia and recent battlefield developments.","summary":"US State Secretary Antony Blinken insisted Ukraine keep fighting instead of pursuing peace talks in 2022, the NYT has said \nRead Full Article at RT.com","url":"https://www.rt.com/news/611268-blinken-opposed-ukraine-truce/","image":"https://mf.b37mrtl.ru/files/2025.01/article/678d942c203027096366ee08.jpg","video":null,"publish_date":"2025-01-20 00:38:21","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.164},{"id":281772624,"title":"Rubio will meet with peers from India, Japan, Australia after expected confirmation, officials say","text":"WASHINGTON (AP) — The Trump administration would begin formal international engagements this week when Marco Rubio — expected to be confirmed soon as secretary of state — meets with the foreign ministers of India, Japan and Australia, U.S. officials say.\n\nThe so-called Quad grouping is a main component of the U.S. strategy to blunt increasing Chinese influence and aggression in the Indo-Pacific, an initiative that Trump had championed during his first term in office but was elevated to the leaders’ level by outgoing President Joe Biden.\n\nRubio is expected to be confirmed by the Senate to the post of America’s top diplomat on Monday, just hours after President-elect Donald Trump is sworn in for his second term.\n\nRubio’s meetings, together and separately, on Tuesday with Australian Foreign Minister Penny Wong, Indian Foreign Minister S. Jaishankar and Japanese Foreign Minister Iwaya Takeshi, will be his first as secretary of state, the current and incoming officials said. The three ministers will all be attending Trump’s inauguration.\n\nThe officials spoke on condition of anonymity because Rubio has not yet been confirmed as secretary of state.\n\nBiden and his outgoing Secretary of State Antony Blinken have touted their work to rebuild ties with allies abroad after taking over from Trump in 2021. Trump has been skeptical of alliances, including NATO and defense partnerships in the Asia-Pacific.\n\n“When we came in, we inherited partnerships and alliances that were seriously frayed,” Blinken told The Associated Press on Friday.\n\nThe leaders of the Quad countries met with Biden near the U.S. president’s hometown of Wilmington, Delaware, in September. They agreed to expand the partnership among the four nations’ coast guards to improve interoperability and capabilities, with Indian, Japanese and Australian personnel sailing on U.S. ships in the region.\n\nAll the countries are worried about China’s increasing assertiveness in the Indo-Pacific, and the U.S.-China rivalry is set to intensify after Trump takes office. Beijing has sent Vice President Han Zheng to Trump’s inauguration after the U.S. president-elect invited Chinese leader Xi Jinping, but tariffs imposed on Chinese products in Trump’s first term were a hallmark of his trade policy, and he has signaled that he will increase and expand them in his second term.\n\nTrump and Chinese leader Xi Jinping spoke by phone Friday on trade fentanyl and TikTok. Trump said on social media that they agreed to “do everything possible to make the World more peaceful and safe!”\n\nMeanwhile, several of Trump’s nominees for key Cabinet positions are known China hawks, including Rubio. Rubio called China “the most potent, dangerous and near-peer adversary this nation has ever confronted” during his confirmation hearing Wednesday.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — The Trump administration would begin formal international engagements this week when Marco Rubio —&#160;expected to be confirmed soon as secretary of state&#160;—...","url":"https://whdh.com/news/rubio-will-meet-with-peers-from-india-japan-australia-after-expected-confirmation-officials-say/","image":"https://whdh.com/wp-content/uploads/sites/3/2020/11/201002-marco-rubio.jpg?quality=60&strip=color","video":null,"publish_date":"2025-01-20 00:38:03","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":-0.033},{"id":281772344,"title":"LIVE | US President-elect Donald Trump addresses victory rally in Washington on eve of inauguration","text":"Donald Trump told thousands of roaring supporters he would impose severe limits on immigration on his first day in office, vowing to swiftly fulfil the central promise of his presidential campaign at a rally on Sunday inside a packed Washington arena a day before he returns to power. \"By the time the sun sets tomorrow, the invasion of our country will have come to a halt,\" he said to cheers at a \"Make America Great Again Victory Rally\" at the Capital One Arena.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/live-us-president-elect-donald-trump-addresses-victory-rally-in-washington-on-eve-of-inauguration/videoshow/117382092.cms","image":"https://img.etimg.com/thumb/msid-117382092,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-117382092,imgsize-46668.cms","publish_date":"2025-01-20 00:32:01","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":0.099},{"id":281771202,"title":"Trump to take more than 200 executive actions on first day in office — to clean up ‘failed, corrupt political establishment’","text":"President-elect Donald Trump will begin cleaning up the country’s “failed and corrupt political establishment” by taking more than 200 executive actions when he assumes office Monday, aides say.\n\nThe actions include 50 executive orders, which are legally binding, with some involving border security and domestic energy production, while others are designed to ensure that federal workers are hired based on merit, according to Fox News Digital. \n\nTrump plans to start signing the orders immediately after he is inaugurated, said Jason Miller, a senior adviser for the incoming administration. Many of the moves will be part of “omnibus” directives.\n\nThe incoming president previously indicated he would sign at least 25 orders on his first day in office, the outlet said.\n\n“This is a massive, record-setting, unmatched first wave,” an official told the outlet. “This is the most extensive list of executive actions in American history, all guided by a relentless commitment to deliver on the campaign promise.” \n\nAs part of the orders, Trump will declare a national border emergency that will effectively close the southern US border. It is unclear whether the country’s northern border will have any immediate action taken against it.\n\nSome of his more extensive Day One plans have already leaked, including his mass deportation plan slated to begin in Chicago immediately after his inauguration.\n\nThe crackdown would be on top of a potential citizenship order that would end automatic citizenship to children of illegal migrants born in the United States.\n\n“On Day One of my new term in office, I will sign an executive order making clear to federal agencies that under the correct interpretation of the law, going forward, the future children of illegal aliens will not receive automatic US citizenship,” Trump said in a video posted in May of 2023.\n\nThis order would violate the 14th Amendment and likely be challenged in the courts.\n\nTrump also has vowed to suspend the security clearances of 51 national security officials involved in the Hunter Biden laptop scandal ahead of the presidential election in 2020.\n\nIn addition, he will put government offshore-wind leases on hold, end the Biden administration’s electric-vehicle mandates for auto manufacturers and withdraw from the Paris Climate Accord, Fox said.\n\n“I want to be a dictator for one day because I’m gonna get going with, ‘Drill, baby, drill,’” Trump said on the campaign trail, referring to domestic oil production. “After that, I’ll never be a dictator.”\n\nTrump also will institute federal workforce policies warning employees they can get the boot if they don’t comply with his directives, that people will be hired based on merit and that workers will have to get back in the office as opposed to toiling remotely.\n\n“There is a massive federal workforce that has been moving its objectives at expense of the American people — and President Trump is taking command, saying, ‘You will serve the American people and only American people,’ ” the official told Fox. “This is about stopping corrupt, abusive behavior and re-focusing the government on its fundamental duties to the American people.” \n\nBeyond that, Trump also plans on granting sweeping pardons to every person arrested in connection to the Jan. 6 attack on the US Capitol. \n\nMore than 1,625 people across all 50 states have been charged for a variety of criminal and federal crimes, with over 465 in prison, according to the US Attorney’s Office.\n\nTrump even plans to rename the Gulf of Mexico the Gulf of America, Fox said.\n\nTrump even scored a major victory the day before being sworn in.\n\nTikTok went offline overnight, claiming it needed to comply with a congressional mandate that banned it starting Sunday. Trump took to social media early Sunday claiming he had a plan to “save” it — and its owner put it back online.","summary":"The actions include 50 executive orders, which are legally binding, with some involving border security and domestic energy production, while others are designed to ensure that federal workers are hired based on merit, according to Fox News Digital. ","url":"https://nypost.com/2025/01/19/us-news/trump-to-take-more-than-200-executive-actions-on-first-day-in-office-to-clean-up-failed-corrupt-political-establishment/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/newspress-collage-ylq7vjygs-1737332929853.jpg?quality=75&strip=all&1737315045&w=1200","video":"https://cdn.jwplayer.com/videos/wlKFMb1s-RyIcpnTz.mp4","publish_date":"2025-01-20 00:32:00","author":"Caitlin McCormack","authors":["Caitlin McCormack"],"language":"en","category":"politics","source_country":"us","sentiment":-0.128},{"id":281771726,"title":"Newspaper headlines: ‘Gaza hostages out’ and ‘world readies’ for Trump","text":"The release of three hostages from Gaza as a ceasefire deal between Israel and Hamas came into force yesterday dominates Monday’s front pages. Several of the papers carry images of Emily Damari, a British-Israeli citizen who was taken by Hamas from her home on 7 October, reuniting with her mother. Crowds of television cameras surrounded Emily, Doron Steinbrecher, 31, and Romi Gonen, 24, as they were handed over by Hamas to Red Cross officials, the Times reports. “Home at last,” is the Metro’s headline, as the paper reports of “chaotic scenes” in the lead up to Emily, Doron and Romi’s release. Hundreds of aid trucks queued to enter Gaza as the ceasefire came into force, bringing supplies to its 2.3 million residents, the Guardian says. As the hostages were released, Red Cross officials were working in Israel’s Ofer prison to process the release of Palestinian prisoners, the paper adds. “Thank you for bringing Emily home,” was Mrs Damari’s message to the world after her daughter’s release, according to the Daily Mail. The paper says Emily “smiled defiantly” as she was freed after 471 days in captivity. An image of Emily reuniting with her mother Mandy features on the front page of the Mirror. “Every hostage must be released,” the paper quotes Mrs Damari as saying. Images of Emily’s release also feature on the front page of the Daily Express. The paper says the 28-year-old is free after “15 months of hell”. The i says the hostage release comes as the world prepares for President-elect Donald Trump to enter the White House on Monday. Trump has claimed a key role in bringing Israel and Hamas to agree to a ceasefire, the paper reports. Meanwhile, Sir Keir Starmer has stepped up efforts to secure a trade deal with Trump as the president-elect takes office today, the Telegraph says. The prime minister has set up a “mini-cabinet” of senior ministers tasked with drawing up ways to persuade Trump to reach an agreement. And lastly, the Daily Star reveals that one in ten people “go against the Full English orthodoxy” by putting gravy on their fry-up instead of brown sauce, branding them “absolute wrong ‘uns”.","summary":"The release of three hostages from Gaza as a ceasefire deal between Israel and Hamas came into force yesterday dominates Monday&#8217;s front pages. Several of the papers carry images of Emily Damari, a British-Israeli citizen who was taken by Hamas from her home on 7 October, reuniting with her mother. Crowds of television cameras surrounded &#8230;\n\n\nThe post Newspaper headlines: &#8216;Gaza hostages out&#8217; and &#8216;world readies&#8217; for Trump appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/newspaper-headlines-gaza-hostages-out-and-world-readies-for-trump/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/b126/live/9b2e6ea0-d6b9-11ef-9fd6-0be88a764111.png","video":null,"publish_date":"2025-01-20 00:29:32","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.033},{"id":281773388,"title":"Trump illegal migrant arrests to start on day one","text":"Raids to detain and deport migrants living in the US without permission are set to begin on the first full day of President-elect Donald Trump’s new administration, sources have told the BBC’s US partner CBS.\n\nIt is unclear where the operations – threatened by Trump’s “border tsar” Tom Homan – could begin.\n\nEarlier reports indicated deportations would start in Chicago, a city with a large migrant population, as early as Tuesday.\n\nBut Homan told the Washington Post on Saturday that the Trump administration is reconsidering after the location was leaked.\n\nTrump has vowed to oversee the largest deportation programme in US history, and Homan has said criminals and gang members will be prioritised in such raids.\n\nHoman told the Post that the administration’s enforcement goals are broader than just Chicago.\n\n“ICE will start arresting public safety threats and national security threats on day one,” he said. “We’ll be arresting people across the country, uninhibited by any prior administration guidelines. Why Chicago was mentioned specifically, I don’t know.”\n\nIn an interview with Fox News this week, the border tsar promised a “big raid” across the country. He has previously said Chicago will be “ground zero” for the mass deportations.\n\nHoman expanded on the administration’s plans on Fox News over the weekend,saying the deportations will not be “raids”, but “targeted enforcement operations”.\n\nHe described these efforts as “well planned”.\n\n“When ICE goes out, they’re going to know exactly who they’re looking for and pretty much where they’ll find them,” Homan said.\n\nHe said he expects deportation flights to leave in the first week of Trump’s presidency and anticipates daily lawsuits for deportation efforts from organisations like the American Civil Liberties Union.\n\n“I’m sure we’ll be sued, but bring it,” he said.\n\nTrump, a Republican, also promised mass deportations ahead of his first presidential term back in 2017 – though he ended up removing about half the number of immigrants that President Barack Obama, a Democrat, did in his first four years.\n\nThe 47th president is coming into office with widespread support for his border policies. A New York Times and Ipsos poll published on Saturday found 55% of Americans either strongly or somewhat support such mass deportations.\n\nThe Immigration and Customs Enforcement (ICE) agency deports illegal migrants all the time.\n\nHowever, the operation to be launched after Trump’s inauguration on Monday is expected to target so-called “sanctuary” cities that limit co-operation with federal immigration officials, two sources familiar with the plans told CBS.\n\nICE officials in the Chicago area recently asked agents to join this week’s planned raids without notifying heads of the agency in Washington DC, according to CBS.\n\nNew York, Los Angeles, Denver and Miami are also due to be targeted with raids, the Wall Street Journal reported, citing unnamed sources familiar with the plans.\n\nSome reports suggest that Trump could do away with a longstanding policy that has made churches off-limits for ICE arrests.\n\nAt a church in a mostly Latino neighbourhood of Chicago, worshippers shared their concerns with the BBC.\n\n“I’m scared, but I can’t imagine what people without papers are feeling,” said D Camacho, a 21-year-old legal immigrant from Mexico who was in the congregation at Lincoln United Methodist Church in the Pilsen area last Sunday.\n\nReverend Emma Lozano said: “If someone with five children gets taken, who will take the children in? Will they go to social services? Will the family be divided?”\n\nThe rules under Democratic President Joe Biden were that ICE was generally to prioritise the arrest of illegal migrants who were serious criminals, had crossed the border recently or posed a national security threat.\n\nWhile Trump’s team has signalled that it will begin with migrants who had committed crimes, all illegal migrants – including those who have lived and worked in the US for many years and have no criminal history – may be more likely to be arrested and deported.\n\nImmigration raids at construction sites where undocumented migrants are often employed are also expected to resume, after being discontinued by the Biden administration, according to CBS.\n\nHowever, the operation could pose difficulties for officials – with limited custody space to hold detainees.\n\nAt the same time, the Laken Riley Act – named after a college student who was murdered last year in Georgia by a Venezuelan illegal migrant who was previously arrested for shoplifting – is expected to be passed by Congress next week.\n\nThe proposed legislation will require the federal government to detain migrants living in the US illegally who are suspected of criminal activity.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"Raids to detain and deport migrants living in the US without permission are set to begin on the first full day of President-elect Donald Trump&#8217;s new administration, sources have told the BBC&#8217;s US partner CBS. It is unclear where the operations &#8211; threatened by Trump&#8217;s &#8220;border tsar&#8221; Tom Homan &#8211; could begin. Earlier reports indicated [&#8230;]\n\n\nThe post Trump illegal migrant arrests to start on day one appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/01/20/trump-illegal-migrant-arrests-to-start-on-day-one/","image":"https://www.ghanamma.com/wp-content/uploads/2025/01/Deportation-1068x601.jpg","video":null,"publish_date":"2025-01-20 00:29:06","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.001},{"id":281769048,"title":"World Leaders to Attend Trump’s Inauguration for the First Time in American History","text":"WASHINGTON — President-elect Donald Trump’s second inauguration will include a guest list featuring some of the world’s richest men, notable U.S. politicians, foreign leaders and celebrities who have embraced Trump. \n\nWith Trump now taking the oath of office inside the U.S. Capitol Rotunda, only a few hundred people will be able to see the ceremony in person. It’s not yet known which notable guests will make the cut, so here’s a look at key figures set to attend the inauguration events and balls. \n\nPresident Joe Biden and Vice President Kamala Harris will attend the inauguration, reviving the tradition of defeated presidential candidates sharing the stage with the election winners. The only losing candidate in recent memory not to attend his successor’s inauguration was Donald Trump four years ago. \n\nFormer Presidents Barack Obama, Bill Clinton and George W. Bush will also be in attendance. It’s set to be the first presidential inauguration featuring all of the living men who also held that office since President Obama’s first inauguration in 2009. \n\nMembers of Congress will be among those allowed in the Capitol Rotunda to view the ceremony. \n\nFor the first time in U.S. history, a president-elect will welcome foreign leaders for one of the most American political traditions — the peaceful transfer of power.\n\nArgentine President Javier Milei and Italian Premier Giorgia Meloni are expected to be in Washington, but Chinese President Xi Jinping is sending his vice president as his representative. No heads of state have previously made an official visit to the U.S. for the inauguration.\n\nGeorgia President Salome Zourabichvili, Ecuadorean President Daniel Noboa and Paraguayan President Santiago Peña say they also will attend while French President Emmanuel Macron announced he won’t be there. \n\nThe world’s three richest men were poised to sit on the dais as Trump is sworn in for a second term: Elon Musk, Amazon founder Jeff Bezos and Meta CEO Mark Zuckerberg. \n\nThe three men are worth nearly $1 trillion combined and will be joined at the inauguration by the chief executive officers of OpenAI and the social media platform TikTok. Meta, Amazon and OpenAI CEO Sam Altman donated $1 million to Trump’s inauguration fund.\n\nOther tech executives who’ll reportedly be in attendance are Sundar Pichai, the CEO of Google; Tim Cook, the CEO of Apple; and Dara Khosrowshahi, the CEO of Uber.\n\nAccording to TMZ, other confirmed celebrity guests on the Trump inauguration list include Logan and Jake Paul, podcaster Theo Von, UFC founder Dana White, Amber Rose, Caitlyn Jenner, New York Jets running back Bryce Hall and Megyn Kelly. \n\nThere’s also a handful of celebrities who’ll be performing at Trump’s inauguration, his weekend rally and inaugural balls. Country singer Carrie Underwood will perform “America the Beautiful” at the inauguration. \n\nThe lineup of performers for the inaugural balls include Rascal Flatts, Gavin DeGraw, Jason Aldean, The Village People and Nelly. Rapper Snoop Dogg performed at a pre-inaugural “Crypto Ball” on Friday night. \n\nFormer House Speaker Nancy Pelosi and former first lady Michelle Obama are among those planning to skip the inauguration events. Neither of their offices offered explanations for their absences. Michelle Obama also missed former president Jimmy Carter’s state funeral in Washington this month. \n\nWhile dozens of Democratic members of Congress boycotted Trump’s inauguration in 2017, according to the Washington Post only 20 Democrats in Congress have confirmed they won’t be attending Monday’s swearing-in.","summary":"Internewscast Journal\n\nInternewscast\n\n\nWith Trump now taking the oath of office inside the U.S. Capitol&#8230;\n\n\nThis Post: World Leaders to Attend Trump&#8217;s Inauguration for the First Time in American History first appeared on Internewscast Journal","url":"https://internewscast.com/news/world-leaders-to-attend-trumps-inauguration-for-the-first-time-in-american-history/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Foreign-leaders-will-attend-Trumps-inauguration-for.jpg","video":null,"publish_date":"2025-01-20 00:24:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.439},{"id":281770202,"title":"Former Trudeau ally Freeland enters race to be Canada PM","text":"Canada's former deputy prime minister Chrystia Freeland launched her campaign Sunday to replace Justin Trudeau as Liberal Party leader and prime minister, pitching herself as the best option to oppose incoming U.S. President Donald Trump.\n\nFreeland had been one of Trudeau's closest allies in government since the Liberals swept into office in 2015, also serving four years as finance minister until her dramatic resignation last month.\n\nIn a scathing resignation letter, she accused Trudeau of putting his own political interest above the urgent need to prepare Canada for the potential threats of the incoming Trump administration, including a possible trade war.\n\nFreeland's departure was seen as a devastating blow that pushed Trudeau to announce his plans to leave office.\n\nTrudeau has said he will stay on as a caretaker prime minister until the Liberals choose a new leader, which is expected on March 9.\n\nAt an event officially launching her leadership bid, Freeland said \"Donald Trump doesn't like me for one simple reason: I have been fierce, resolute and effective in defending Canada.\"\n\nTrump, who retakes power on Monday, has threatened to impose a 25 percent tariff on all Canadian imports until Canada addresses what he calls the flow of undocumented migrants and the drug fentanyl into the United States.\n\nTrump called Freeland \"totally toxic\" following her December resignation.\n\nFreeland was a lead negotiator at talks to revise North American free trade agreements during Trump's first term.\n\nFreeland on Sunday promised a \"dollar for dollar retaliation\" in response to any Trump tariffs.\n\n\"If you force our hand, we will inflict the biggest trade blow that the United States has ever endured,\" she said.\n\nShe blasted Trump's proposed tariffs as \"illegal and unjustified.\"\n\nIn entering the race, Freeland immediately becomes a front-runner to replace Trudeau along with Mark Carney, who previously led the Bank of Canada and the Bank of England.\n\nCarney has positioned himself as an outsider not tainted by the unpopular Trudeau.\n\nThe Liberals are trailing the Conservatives badly in polls.\n\nThat means the winner of the Liberal leadership contest may not serve as prime minister for long, as opposition parties have pledged to bring down the government after parliament returns on March 24, triggering a general election.","summary":"Canada's former deputy prime minister Chrystia Freeland launched her campaign Sunday to replace Justin Trudeau as Liberal Party leader and prime minister, pitching herself as the best option…","url":"https://japantoday.com/category/world/former-trudeau-ally-freeland-enters-race-to-be-canada-pm","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/4c/04/4b007ede35d4a3352ed56aaaec3f6110d071/4c044b007ede35d4a3352ed56aaaec3f6110d071_1/_w1700.jpg","video":null,"publish_date":"2025-01-20 00:19:34","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","source_country":"jp","sentiment":-0.057},{"id":281773612,"title":"Trump vows to repeal Biden’s ‘foolish executive orders’ on his first day in White House","text":"WASHINGTON, January 20. /TASS/. US President-elect Donald Trump vowed to repeal all \"radical and foolish\" executive orders, signed by incumbent US President Joe Biden within hours of taking oath on January 20.\n\n\"Every radical and foolish executive order of the Biden Administration will be repealed within hours of when I take the oath of office,\" he said, speaking during a rally at the Capital One arena in Washington.\n\n\"Somebody said yesterday, ‘Sir, don’t sign so may in one day. Let’s do it over a period of weeks.’ I said: ‘Like hell we’re going to do it over weeks’,\" Trump underscored. \"No, we are doing them tomorrow.\".","summary":"\"Every radical and foolish executive order of the Biden Administration will be repealed within hours of when I take the oath of office,\" US president-elect said","url":"https://tass.com/world/1901483","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-20 00:19:04","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.381},{"id":281771900,"title":"‘We thank President Trump’: TikTok on process of restoring service in US","text":"Washington, January 20 (IANS) Chinese social media app TikTok has expressed gratitude to President-elect Donald Trump for “providing the necessary clarity and assurance” after it confirmed that it was in the process of restoring service in the US.\n\nThis development comes after Trump pledged to restore access to TikTok, which had stopped functioning in the US on Saturday night to comply with the Biden dispensation’s ban order.\n\nIn a post on X on Sunday, TikTok said, “In agreement with our service providers, TikTok is in the process of restoring service. We thank President Trump for providing the necessary clarity and assurance to our service providers that they will face no penalties providing TikTok to over 170 million Americans and allowing over 7 million small businesses to thrive.”\n\n“It’s a strong stand for the First Amendment and against arbitrary censorship. We will work with President Trump on a long-term solution that keeps TikTok in the United States,” the post added.\n\nTrump announced on Truth Social that he plans to issue an executive order on Monday to delay the enforcement of the TikTok ban for 90 days.\n\n“I’m asking companies not to let TikTok stay dark! I will issue an executive order on Monday to extend the period of time before the law’s prohibitions take effect so that we can make a deal to protect our national security,” he said.\n\n“The order will also confirm that there will be no liability for any company that helped keep TikTok from going dark before my order. Americans deserve to see our exciting Inauguration on Monday, as well as other events and conversations,” he added.\n\nHe further, outlined a proposal for the US to hold a 50 per cent ownership stake in a joint venture involving TikTok.\n\n“I would like the US to have a 50 per cent ownership position in a joint venture. By doing this, we save TikTok, keep it in good hands and allow it to say up. Without US approval, there is no TikTok. With our approval, it is worth hundreds of billions of dollars – maybe trillions,” he said.\n\n“Therefore, my initial thought is a joint venture between the current owners and/or new owners whereby the US gets a 50 per cent ownership in a joint venture set up between the US and whichever purchase we so choose,” he added.\n\nTikTok went offline in the US on Saturday night (local time), just hours before a law banning the app was set to take effect, CNN reported.\n\nThe users who tried to access the platform were met with a message stating, “Sorry, TikTok isn’t available right now. A law banning TikTok has been enacted in the US.\n\nUnfortunately, that means you can’t use TikTok for now.”\n\nThe ban follows a Supreme Court ruling on Friday that upheld a law passed with bipartisan support in Congress and signed by US President Joe Biden in April.","summary":"Washington, January 20 (IANS) Chinese social media app TikTok has expressed gratitude to President-elect Donald Trump for &#8220;providing the necessary clarity and assurance&#8221; after it confirmed that it was in the process of restoring service in the US. This development comes after Trump pledged to restore access to TikTok, which had stopped functioning in the [&#8230;]","url":"https://bhaskarlive.in/we-thank-president-trump-tiktok-on-process-of-restoring-service-in-us/","image":"https://i2.wp.com/iansportalimages.s3.amazonaws.com/thumbnails/202501203305118.jpg?ssl=1","video":null,"publish_date":"2025-01-20 00:17:57","author":"IANS,Us President Joe","authors":["IANS","Us President Joe"],"language":"en","category":"politics","source_country":"in","sentiment":-0.142},{"id":281769082,"title":"SOS: The Dire Need To Fill Energy-Efficiency Jobs In America","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nYou have likely heard of organizations worldwide working to reduce their carbon emissions. There is a two-pronged reason for this: climate change and inflation. The Department of Energy has established that the average American household uses 30% more energy than is required due to inefficient systems in the home, which is an average of $60/month per home in unnecessary utility bills. According to the U.S. Energy Information Administration, the United States contains about 4% of the world's population. Yet, we consume about 16% of the world's energy. This issue affects everyone regardless of belief in these topics, political affiliation, race, religion, or creed. The energy-efficiency industry, which has been around for decades, has more recently been tasked to help reduce carbon emissions and help homes and businesses save on ever-rising energy costs that come with inefficient systems and installations. However, it is extremely understaffed. Individuals choosing a career in this sector will contribute to a more sustainable and economically sound future for everyone using the U.S.'s energy sources. It is in everyone's best interest to find willing workers to staff these essential jobs and that they are welcomed from all backgrounds, vocations, and classes to assist in this important mission.\n\nEnergy Efficiency Jobs in America\n\nAccording to a report by the Building Performance Association, the energy efficiency industry has nearly 2.3 million workers in energy efficiency. To put that into perspective, two of every five jobs in the U.S. energy sector are specifically in the energy efficiency industry. Another key fact according to BPA is that energy efficiency employs 2.1 times as many workers in the U.S. as the entire fossil fuel industry.\n\nNearly 2.3 million workers are needed to fill the energy efficiency job opening in the United ... [+] States.\nImage source: Building Performance Association.\n\nThis industry is not just about saving energy and money but also about creating jobs.\n\nWith climate change and high inflation among many Americans’ concerns, federal investments have been made in recent years to help fund “solutions” to tackle inefficient energy use. The Department of Energy reports that buildings account for 40% of the total energy use in the United States. Given these pressing issues, the need for workers in the energy efficiency industry is not just important, it's urgent. We need workers ASAP. SOS! The energy efficiency industry offers significant job opportunities. With the right skills and training, many individuals could be part of this growing field, making a crucial difference in our collective future.\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nWorkforce Development\n\nThere is such a significant demand for workers that many organizations hold free or low-cost training programs to help individuals get industry-recognized credentials to join the workforce and help tackle the problem in an accelerated timeline. Many of these organizations are responding to the need for a better-trained workforce. The Department of Energy’s Better Building Initiative states that although the main hiring challenge cited by employers was competition and a small applicant pool, insufficient skills and qualifications and lack of experience were also top responses.\n\nBecause of this, there are many opportunities to find a track of reputable training programs that can assist with the lack of skilled workers. In addition to employer demand for well-trained, efficient workers, there is a significant enough consumer demand to have involved state and federal funding opportunities for workforce development.\n\nAlthough the term “workforce development” includes helping individuals new to the industry enter the business and start a fulfilling career, it also means \"upskilling\" individuals in the industry so that they can take their current jobs to the next level.\n\nEnergy Efficiency is not Just About Climate Change\n\nPresenting these facts is an attempt to show readers that energy efficiency is about more than just climate change. According to the American Council for an Energy-Efficient Economy, \"Energy efficiency [also helps] create jobs in multiple ways. Efficiency workers make, sell, and install efficient products (such as ENERGY STAR® appliances), build well-insulated buildings, and offer energy-saving services like weatherization. In addition, efficiency creates supporting jobs, such as those in the supply chains that provide parts and materials for efficient products. Lastly, efficiency supports other jobs by reducing energy use and thus energy bills, leaving customers free to spend or invest that money elsewhere in the economy.”\n\nFuel source variety and choice have always been important to the people of the United States, as are jobs and economic health. The energy efficiency industry, with its diverse range of jobs and its significant contribution to economic health, is a testament to this. Understanding this industry's far-reaching benefits can also support individuals seeking a path to this rewarding career, offering a wide range of opportunities and a strong economic foundation.\n\nFor individuals interested in joining this mission, the path is clear. Seek out training and jobs in energy efficiency. This is not just a career choice, it's a mission, and your contribution is crucial. Look forward to a long and prosperous career, filled with the satisfaction of knowing you're making a real difference.\n\nFollow me on LinkedIn. \n\nBrynn Cooksey\n\nEditorial Standards\n\nForbes Accolades","summary":"You have likely heard of organizations worldwide working to reduce their carbon emissions.","url":"https://www.forbes.com/sites/brynncooksey/2025/01/19/sos-the-dire-need-to-fill-energy-efficiency-jobs-in-america/","image":"https://imageio.forbes.com/specials-images/imageserve/678a79fb7ec37d1b37de564a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-20 00:17:56","author":"Brynn Cooksey,Contributor","authors":["Brynn Cooksey","Contributor"],"language":"en","source_country":"US","sentiment":0.073},{"id":281769036,"title":"Liberal Concerns Prompt Doctor Visits and Unusual Stockpiling in Anticipation of Trump Presidency","text":"Liberals fearful of Donald Trump’s return to the White House are furiously stockpiling essentials and more unusual items including Plan B and machetes.\n\nAmericans have been prepping for decades but reasons for hoarding non-perishable foods, water and other supplies have changed drastically over time.\n\nIn the Cold War-era, some Americans built underground bunkers that they could live in for years in case of a nuclear strike from the Soviet Union. \n\nPreppers have since become somewhat of a stereotype, with many thinking of them as quite conservative and conspiracy-minded.\n\nRight-wing personalities like Alex Jones and televangelist Jim Bakker have warned their audiences for years of an impending government collapse and have urged them to prepare. Their clarion calls were the loudest during Barack Obama’s presidency.\n\nThough Jones’ platform is still tied up in bankruptcy auctioning, both men have been extraordinarily successful at selling their listeners things like storable food, radios, camping gear and water filtration systems.\n\nBut now that Democrats have been swept out of power, liberals are expressing their own fears about a GOP trifecta with Trump at the very top. Possible efforts to further roll back things like abortion and contraception are at the top of their minds.\n\nThat’s why Juli Gittinger, a religious-studies professor at Georgia College, has stocked up on Plan B pills.\n\nGittinger began prepping after Trump was elected president the first time in 2016, she told The Atlantic.\n\nShe said she has enough water in her house to last 30 days and enough food to last her 100 days. She also has iodine pills to protect herself from radiation and a machete in the event she has to cut her way through the bushes of rural Georgia to make an escape. \n\nInterestingly, the Plan B pills she bought aren’t for herself, she said. Rather they’re for young women who might need it in case elected Republicans at the state and federal level decide to restrict access to birth control.\n\nSo far, Republicans haven’t come out and said they want to ban birth control but they did block a Democrat bill last summer that would have codified a right to contraception.\n\nGittinger isn’t the only liberal-minded prepper grabbing Plan B for others. \n\nBuying supplies not just yourself and your family but for the surrounding community is a common sentiment among the more than 4,500 members of the Leftist Preppers subreddit.\n\nIn a post made to the subreddit days after Trump won the presidency, someone asked what items are on the top of people’s prepper lists.\n\n‘My plan is to prep not just for myself but others. I’m buying Plan B. We’re looking into what other kinds of birth control you can buy in bulk. This is not necessary for my family but if it ceases to exist we want to have it available for others,’ one person replied.\n\nAnother person wrote: ‘I loaded up on plan b. Not for myself, I am beyond those concerns, but for the young women in my life that might need it.’\n\nOther things on people’s lists were over-the-counter medicines, soil, seeds and bug repellant.\n\nSome recommended people make sure their passport is up to date in case they feel its necessary to leave the country. \n\nThere was also talk about buying fluoride toothpaste and getting all their necessary immunizations for themselves and their kids.\n\nRobert F. Kennedy Jr., Trump’s pick to lead the Department of Health and Human Services, has cast doubt on putting fluoride in drinking water to keep people’s teeth healthy and the effectiveness of various vaccines including the covid jab.\n\nZoe Higgins, one of the moderators of the subreddit, told The Atlantic that she has a month’s worth of freeze-dried spaghetti, beef stroganoff, chicken alfredo, and other meals.\n\nIf that’s not enough, she also has flashlights, headlamps, waterproof matches, fire starters, water-purification tablets, camping stoves and propane tanks.\n\nGenevra Hsu, another subreddit moderator, said she actually began prepping in 2013 after learning survivalist techniques from her father.\n\nNow living in Virginia, Hsu has six months of meals stowed away and does her own pressure-canning, dehydrating, and freezing. Her social media profiles show her dehydrating and freezing powdered eggs in case of a bird flu epidemic.\n\nOn TikTok, Higgins goes by ‘Leftist Prepper’ and she made her own guide on what she believes it takes to truly be prepared for a Trump presidency.\n\nHiggins said it’s important to be personally prepared with your own stockpile. For her, that’s especially true because she lives in New Orleans, a city that is often in the path of hurricanes, most notably Katrina in 2005. \n\nBut like many of her fellow Redditors have said, she suggested that survival in a disaster scenario is much more likely when you connect with people in your town or neighborhood.\n\nShe recommended people join a mutual aid group wherever they live and said if their neighborhood doesn’t have one, ‘I would be starting one.’\n\nNafeez Ahmed, an author who has written about global crises, told the Guardian in 2016 that surviving after society collapses isn’t as simple as living off cans of beans.\n\n‘There’s a survivalist response which is “I’m going to hide away all by myself,”‘ Ahmed said. ‘You’re probably not going to survive like that – you have to cooperate with other people.’\n\n‘The more people who band together, the more likely you are to be able to rebuild something like a society. So I’d say share those baked beans,’ he added.\n\nMichael Mills, a senior lecturer at Anglia Ruskin University in the United Kingdom, studies doomsday prepping and estimated that about 15 percent of preppers in the US are liberals. \n\nHe added that there are likely millions of preppers all with a range of different political beliefs.\n\nThe thing that drives all preppers, left or right, to conserve resources and have backup plans is a lack of trust in government, according to Mills.\n\n‘There’s this common thread that I think unites preppers of all political persuasions, which is a lack of faith in political progress as a whole and a skepticism towards political leadership,’ he said.\n\nAmericans on both sides of the political aisle have record low trust in Congress, big business and the presidency. What liberal and conservative preppers appear disagree on are what the true threats to society are.\n\nLiberals are worried about climate change causing more natural disasters, while conservatives are more often fretting about the left running amok.\n\nMikhail Merkurieff, a prepper who’s made a living selling survival gear he invents told Business Insider in 2019: ‘We kind of joke, like, man, we have to get a Democrat back in the White House and sales will go back up.’\n\nThe most concrete worries prep-happy liberals have about Trump are economic in nature and largely center on his plans to dramatically increase tariffs.\n\nTrump has proposed a widespread 10 percent tariff on global imports to raise government revenue and has threatened China with tariffs as high as 60 percent if they don’t do more to reduce the amount of fentanyl flowing into the United States through Mexico.\n\nSince tariffs increase the price of imports, many have rushed to buy consumer goods that typically come from outside the country or have components that are assembled or sourced in foreign countries. \n\nThese include vehicles, auto parts, technology and appliances. Higgins said she recently bought a new car out of an abundance of caution.\n\nA December survey of 2000 Americans from creditcards.com found that a third of people were buying more because they feared tariffs.\n\n‘Welcome to MAGAland: Trump’s Second 100 Days’ is the new politics podcast bringing you the latest news and gossip from Trump insiders. New episodes every Monday, Wednesday and Friday. Follow wherever you get your podcasts now.","summary":"Internewscast Journal\n\nInternewscast\n\n\nLiberals fearful of Donald Trump&#8217;s return to the White House are furiously stockpiling essentials and more&#8230;\n\n\nThis Post: Liberal Concerns Prompt Doctor Visits and Unusual Stockpiling in Anticipation of Trump Presidency first appeared on Internewscast Journal","url":"https://internewscast.com/news/liberal-concerns-prompt-doctor-visits-and-unusual-stockpiling-in-anticipation-of-trump-presidency/","image":"https://i.dailymail.co.uk/1s/2025/01/15/17/94129683-14287833-image-a-1_1736962912179.jpg","video":null,"publish_date":"2025-01-20 00:17:54","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.146},{"id":281770216,"title":"How Mexico is preparing for Trump’s promises of mass deportations","text":"Mexican President Claudia Sheinbaum is pulling out all the stops to support the roughly 5 million undocumented Mexicans living in the U.S. Her administration has launched a panic app for those detained, lined up more than 2,600 lawyers and nearly 2,200 consulate workers, and her foreign minister has met with officials in every border state.\n\nThe moves are meant to secure aid for migrants who are facing U.S. President-elect Donald Trump’s promise to carry out “the largest deportation operation” in the nation’s history. Sheinbaum’s efforts have taken off in the days and weeks since Trump threatened to impose economically debilitating tariffs on his southern neighbor — the flow of migrants being a bargaining chip, in addition to illegal drugs.","summary":"Mexican President Claudia Sheinbaum is pulling out all the stops to support the roughly 5 million undocumented Mexicans living in the U.S.","url":"https://www.oregonlive.com/nation/2025/01/how-mexico-is-preparing-for-trumps-promises-of-mass-deportations.html","image":"https://www.oregonlive.com/resizer/v2/YUTO2AXRHVAUDECDKYYI2XZ64I.jpg?auth=0f6be0840718debd1509ea781df763a0747adffdc7ba786506b0c8faae982bf7&width=1280&quality=90","video":null,"publish_date":"2025-01-20 00:16:03","author":"Alex Vasquez,Bloomberg News","authors":["Alex Vasquez","Bloomberg News"],"language":"en","category":"politics","source_country":"us","sentiment":0.074},{"id":281769090,"title":"Billionaire Wealth Surged By $2 Trillion Last Year, Report Shows","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nOxfam found that 204 new billionaires were minted in 2024.\nAFP via Getty Images\n\nThe combined wealth of the world’s richest individuals surged by $2 trillion last year—three times faster than in 2023—according to a new report published on the eve of the World Economic Forum, an annual meeting of billionaires, hosted in the Swiss Alps.\n\nThe report by Oxfam, an organization working to alleviate poverty and inequality around the world, found that 204 new billionaires were minted in 2024. In the U.S. alone—where wealth concentration is particularly high—the net worth of billionaires billowed by about $3.9 billion on average each day last year and 74 new billionaires emerged.\n\n“The capture of our global economy by a privileged few has reached heights once considered unimaginable,” said Oxfam International Executive Director Amitabh Behar. “The failure to stop billionaires is now spawning soon-to-be trillionaires. Not only has the rate of billionaire wealth accumulation accelerated—by three times—but so too has their power,” he added.\n\nOxfam noted that the power of billionaires will be on particular display not just at the Davos WEF this week but also in Washington D.C, where Donald Trump will on Monday begin his second presidential term.\n\nAccording to Oxfam, Trump’s team will be the richest ever to run the U.S. government, worth more than an estimated $450 billion. So far, at least 13 billionaires have been appointed to jobs in his administration, Oxfam concluded, and even excluding Elon Musk, who reportedly spent over a quarter of a billion dollars to help Trump win November's election, the cabinet would be the richest in history.\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nMusk, currently has an estimated net worth of around $427 billion, making him the richest individual on the planet, followed by Amazon founder and executive chairman Jeff Bezos, at around $237 billion, and Meta chief executive Mark Zuckerberg, at around $211 billion. All three are expected to attend Trump’s inauguration.\n\nAccording to Forbes, Trump’s net worth grew from about $2.5 billion to an estimated $6.1 billion during the course of 2024, thanks in part to his majority stake in Truth Social’s parent company.\n\n“We present this report as a stark wake up-call that ordinary people the world over are being crushed by the enormous wealth of a tiny few,” Behar said.\n\nOxfam’s research also found that more than a third of billionaire wealth is now inherited. Last year, a report by investment bank UBS about the super-rich, found that over the previous decade, multigenerational billionaires had inherited a total of $1.3 trillion.\n\n“The ultra-rich like to tell us that getting rich takes skill, grit and hard work. But the truth is most wealth is taken, not made,” said Behar. “So many of the so-called ‘self-made’ are actually heirs to vast fortunes, handed down through generations of unearned privilege.”\n\nA Growing Global Concern\n\nEarlier this month, a major survey conducted across 36 nations showed that economic inequality is now a grave public concern around the world, with many people particularly worried about the influence that the super-rich are having on policies and business decisions that exacerbate the wealth gap.\n\nThe survey of more than 40,000 adults, done by the Pew Research Center last year and published in early January, found that a median of 54% of respondents across the countries said that they thought the chasm between the rich and poor was a very big problem in their nation. A further 30% said that they thought it was a moderately big problem. A median of 60%, meanwhile, said that the political influence enjoyed by the wealthiest individuals was a major contributor to economic inequality.\n\nThese views, Pew found, were particularly common among respondents identifying as being on the ideological left, though many of those who identified as being on the right agreed too. Ideological divisions, the research showed, were especially large in the U.S.\n\nThe WEF meeting this year takes place from Jan. 20 to Jan. 24. This year’s theme is “Collaboration for the Intelligent Age.” The annual Davos meetings were first launched in 1971 to champion stakeholder capitalism but over the decades they’ve become a punching bag for social justice advocates, largely because of the extreme wealth of many of the attendees.\n\nThis year—with many wars raging around the world—armed conflict is likely to top the agenda and dominate conversations during the four days in the Alpine town. Donald Trump is expected to address the meeting on Jan. 23.\n\nFollow me on Twitter. \n\nEditorial Standards\n\nForbes Accolades","summary":"Oxfam's latest report shows billionaire wealth surged by $2 trillion in 2024, with new billionaires minted daily. Discover how wealth inequality is widening globally.","url":"https://www.forbes.com/sites/josiecox/2025/01/19/billionaire-wealth-surged-by-2-trillion-last-year-report-shows/","image":"https://imageio.forbes.com/specials-images/imageserve/67892786fa210aa481e377cf/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-20 00:15:00","author":"Contributor,Josie Cox","authors":["Contributor","Josie Cox"],"language":"en","source_country":"US","sentiment":-0.027},{"id":281772432,"title":"NLC faults fresh petrol price hike, says FG insensitive","text":"The Nigeria Labour Congress has frowned on the recent hike in the pump prices of Premium Motor Spirit, popularly called petrol, describing it as the height of insensitivity against the masses.\n\nSenior NLC officials disclosed this in separate interviews with our correspondents on Sunday, as oil marketers refuted being blamed for the recent hike in PMS prices nationwide.\n\nSimilarly, the Dangote Petroleum Refinery also said the rise in petrol price was not from the $20bn Lekki-based plant but due to an increase in the cost of crude oil, the major component for refined petroleum products.\n\nRecall that on Friday, the pump prices of petrol rose to between N1,050 and N1,150 per litre following the hike in the cost of the commodity by the Dangote Petroleum Refinery and various depot owners.\n\nDealers confirmed that PMS prices would continue to rise since the major component in fuel production, crude oil, has been on the upward swing lately.\n\nReacting to this, the Deputy President of Nigeria Labour Congress Political Commission, Prof Theophilus Ndubuaku argued that in a saner clime, representatives of workers, the organised private sector and students would have been called to a roundtable to deliberate on the course of action and analysis of the consequences before the decision would be taken.\n\nHe said, “This pump price hike will not only affect foodstuff and fare. There is the problem of inflation and the value of naira to contend with. Instead, what we are seeing is a situation we call Tinubunomics. It is something that has not been tested.\n\n“When you talk about subsidies, is there a country that doesn’t have it? It’s all over the world. Even most of the goods you see in this country from China are subsidised. You are refusing to subsidise fuel and also refusing to even facilitate the so-called CNG buses. How many years does it take to do something like this?\n\n“If you know the kind of game we (the NLC) and them are playing on this CNG thing. Now, they are not even involving the people in the so-called CNG conversion. If you promise to run an inclusive government, It’s not just you that should be doing the talking. Yet, when somebody talks, they send attack dogs to attack and label him a member of the Obidient movement.”\n\nContinuing, Ndubuaku emphasised that President Bola Tinubu will do well to borrow the template of former leaders like Olusegun Obasanjo, who he claimed held a monthly roundtable with stakeholders whenever sensitive issues that have a lot to do with workers’ welfare were being discussed.\n\n“Such discussions were held in the Villa. Every month people would be invited and issues would be discussed. We’re not saying you shouldn’t do it. But please, carry people along. Let us know why you want to do these things so people will be prepared.\n\n“But you can’t just keep changing the prices without any regard for us? This is what is causing all this frustration. They are not carrying the masses along. They have virtually made it difficult for the NLC to be involved in anything they are doing. Nigeria is not the personal property of anybody.\n\n“If you are going to do anything that will involve the masses, you should call the people who represent the workers at least. You have certain blocks and groups of people in this country that have representatives, even in the so-called business sector that you can talk to,” he explained.\n\nLabour tackles marketers\n\nAlso speaking on the hike in petrol price, the Chairperson of the Nigeria Labour Congress in Lagos State, Sessi Funmi, accused oil marketers of being major contributors to Nigeria’s economic challenges, describing them as “enemies of the masses.”\n\nSpeaking with The PUNCH on Sunday, Sessi criticised oil marketers for manipulating petroleum pricing to exploit Nigerians, alleging that they were undermining the government’s efforts to stabilise the downstream oil sector.\n\nShe asserted that the recent reduction in the pump price of petrol did not sit well with marketers because it disrupted their exploitative practices.\n\n“How can marketers be telling us that an increase in crude oil prices automatically translates to higher prices for the finished product? Are they buying crude oil? No! They buy the finished product,” Sessi said.\n\nShe applauded Tinubu’s administration for reviving two of Nigeria’s refineries in Port Harcourt and Warri, emphasising that these developments should lead to a further reduction in PMS prices.\n\nShe argued that oil marketers are attempting to frustrate these efforts to maintain their monopolistic control.\n\n“The Tinubu administration has done what successive governments failed to do by putting our refineries to work. Marketers should stop frustrating these efforts.\n\n“The government must deal directly with suppliers and eliminate middlemen who corruptly enrich themselves,” Sessi added.\n\nShe urged the government to emulate Dangote refinery’s direct supply model and establish agreements with oil companies and petrol stations to ensure fair pricing.\n\n“Marketers are the problem. They’ve been receiving subsidies without supplying products and now want to determine prices when they don’t even own refineries.\n\n‘We reject this. Nigerians cannot continue to suffer due to their greed,” Sessi concluded.\n\nThe NLC chair called for transparency and accountability in the petroleum sector, warning that Nigerians will no longer tolerate exploitative practices.\n\nDangote refutes blame\n\nThe Dangote refinery said it has agreed with its partners – MRS, Ardova and Heyden – to sell its PMS at the rate of N970 per litre across the country.\n\nThe company said it absorbed the increased logistics costs to guarantee uniform pricing across the 36 states of the federation and the Federal Capital Territory. \n\nIn a statement by the Dangote Group spokesman, Anthony Chiejina, the company clarified that the recent adjustment in its ex-depot price of petrol was directly related to the significant increase in global crude oil prices.\n\n“At Dangote Petroleum Refinery, we recognise the critical importance of affordable fuel for all Nigerians, and we remain committed to offering the best value with guaranteed quality to our customers. While we have made a five per cent adjustment to our ex-depot price from N899.50 to N950 per litre, it is important to note that this increase is considerably lower than the 15 per cent rise in global crude oil prices. Furthermore, Dangote refinery has maintained the Single-Point Mooring ex-vessel price at N895 per litre.\n\n“All our partners, including Ardova, Heyden, and MRS Holdings, will offer petrol to Nigerians at a retail price of N970 per litre nationwide. We have absorbed the increased logistics costs to guarantee uniform pricing across the 36 states of the federation and the Federal Capital Territory,” Chiejina said.\n\nSpeaking further, he said the Dangote refinery absorbed approximately 50 per cent of the cost increases in the international oil market due to its unwavering commitment to quality and affordability, as well as the ownership of the refinery by Nigerians.\n\n“If Dangote refinery were to pass on the entire increase in the price of crude oil to the market, the retail price of PMS would be approximately N1,150 to N1,200 per litre in some locations, compared to the current price of N970 per litre.\n\n“We are committed to providing reliable, top-quality petrol to the Nigerian people at competitive prices. In these challenging times, we continue to prioritise the best interests of Nigerians, striving to shield consumers from the full impact of global price volatility while adapting to evolving market conditions.\n\n“We sincerely appreciate the continued trust and support of Nigerians as we strive to deliver the best value for their money and contribute to the development of a self-sufficient economy that is resilient to international price fluctuations,” he stated.\n\nIn the interest of transparency and good governance, Chiejina said the Dangote refinery will now commence publishing its ex-depot price, ex-vessel price, and pump price every week so that consumers are not exploited.\n\nHe concluded, “We would like to express our gratitude to President Bola Tinubu for the introduction of the visionary Naira-for-Crude Initiative. This groundbreaking initiative has enabled consistent access to high-quality PMS for all Nigerians, while also insulating the Nigerian consumers from the volatility of the global oil market.”\n\nMarketers speak\n\nMeanwhile, marketers of petroleum products said they should not be blamed for the instability in the prices of petrol in recent times.\n\nThis is as stakeholders warned that the price of petrol will no longer be stable following the full deregulation of the market.\n\nAccording to them, the major factors determining the price are the international crude oil price and the exchange rate. It was argued that the instability of the two factors means that the price of PMS will continue to rise and fall at intervals.\n\nAs of Sunday, the Benchmark Brent crude price was $80.78; the WTI was $77.88 while the Morban crude was $83.65, according to oilprice.com. Nigeria’s Brass River crude was $83.69 and the Qua Iboe was $83.59.\n\nSpeaking with The PUNCH, retailers under the aegis of the Petroleum Products Retail Outlets Owners Association of Nigeria urged Nigerians, especially the labour unions, not to believe that filling stations are to blame for the changes in the prices of PMS.\n\nPETROAN affirmed that the increase in PMS prices was a result of the rise in the cost of crude oil in the international market.\n\nPrices were said to have risen to a four-month high following the introduction of new United States sanctions against Russian oil.\n\nThe sanctions imposed on January 10 caused a spike in the price of oil and a surge in the cost of tanker shipping, as the outgoing President Joe Biden’s administration took steps to damage Russia’s oil exports and hinder attempts by Moscow to build its fleet.\n\nThe Biden administration had issued sweeping sanctions targeting the Russian energy sector, aiming for Moscow’s oil revenues just days before Donald Trump would assume office.\n\nThe measures include sanctions on Russian oil producers, Gazprom Neft and Surgutneftegas, and the blacklisting of 183 vessels involved in Russian energy exports. Dozens of traders, Russia-based oilfield service providers, and energy officials were also targeted.\n\nThe National President of PETROAN, Dr Billy Gillis-Harry, quoting Section 205 of the Petroleum Industry Act, stated that petrol prices are determined by market forces, indicating that the government and the Nigerian National Petroleum Company Limited no longer set petrol prices nor do marketers arbitrarily inflate prices.\n\nAs a result, he noted that refinery operators in Nigeria will respond accordingly to changes in crude oil prices while the effect would be felt by dealers, retailers, and end consumers.\n\nGillis-Harry noted that increasing crude oil prices would inevitably affect domestic costs.\n\n“Retailers should not be blamed for the price increase. It’s no longer funny; even we, retail outlet owners, are affected by this up-and-down movement of prices. It affects our business,” he noted.\n\nGillis-Harry emphasised that PETROAN members cannot buy petrol at a higher price and sell it at a lower rate.\n\n“Our selling rate always reflects our buying rate. Our members shouldn’t be blamed for the current increase; it’s an external factor. We cannot buy petrol at a higher price and sell below that cost. We cannot buy at N955 and sell at N1,000 per litre. We need to look at logistics and add a humane margin,” he added.\n\nThe National Vice Chairman of the Independent Petroleum Marketers Association of Nigeria, Hammed Fashola, said marketers are aware of the competition in the market and no one wants to be left behind by selling at higher rates.\n\n“You cannot deceive yourself. There is competition out there. So, if you like, put your fuel at N1,500 per litre, nobody will buy it. So, the price change is not deliberately done by marketers,” Fashola said.\n\nHe noted that marketers are now wary of the volatility of the downstream sector, saying they have to go with information before making purchases or before making imports as many of them made losses in December when the price was suddenly reduced by the Dangote refinery and the NNPC.\n\n“And there are some factors you have to consider. That is the exchange rate and the crude oil price. Those are the major factors that determine the price of petroleum products,” he added.\n\nTo avoid running into financial losses, he advised that owners of filling stations must be futuristic and do their projections well.","summary":"•Labour fears hike will fuel food crisis •Increase in line with rising crude price –Dangote The Nigeria Labour Congress has frowned on the recent hike in the pump prices of Premium Motor Spirit, popularly called petrol, describing it as the height of insensitivity against the masses. Senior NLC officials disclosed this in separate interviews with \n\n\n \n Read More","url":"https://punchng.com/nlc-faults-fresh-petrol-price-hike-says-fg-insensitive/","image":"https://cdn.punchng.com/wp-content/uploads/2025/01/18221504/FEMALE-KOROPE-DRIVER-60x34.jpg","video":null,"publish_date":"2025-01-20 00:14:22","author":"Adebayo Folorunsho,Our Reporters","authors":["Adebayo Folorunsho","Our Reporters"],"language":"en","source_country":"ng","sentiment":-0.354},{"id":281768142,"title":"TikTok creators react to restored service: 'My whole livelihood was on the line this weekend'","text":"TikTok restored services in the US on Sunday, easing the concerns of content creators and entrepreneurs who make their living from the platform — at least for now.The platform was down for 12 hours starting late Saturday night and was restored following a Truth Social post by President-Elect Donald Trump, who said he'd issue an executive order on Monday to delay the ban. TikTok's future remains unclear, as its China-based parent company, ByteDance, has so far refused to divest from the app as required by law, but for now, the economy driven by TikTok can continue to churn.\"My whole livelihood was on the line this weekend,\" Live shopping host Kimberly Balance told Business Insider. \"Never experienced anything like this the entire time that I've been a business owner.\"Balance, who goes by KIMMIEBBAGS, sells luxury consignment goods on TikTok, Instagram, and the marketplace platform Whatnot. Last week, she relocated her business from Florida to California to expand her live shopping operations.Balance was set to host a six-hour live shopping show on TikTok on Saturday as part of a new live shopping partnership she had struck with Reunited Luxury. On Thursday evening, TikTok informed her that her Friday meeting with the platform's luxury sales manager was canceled. Her show on Saturday was canceled soon after, in a blow to her business' revenue.Since it launched in 2023, TikTok's online marketplace, TikTok Shop, has quickly become a prime source of revenue for creators on the platform. The app also has an affiliate program where creators can earn a commission for sales they help drive by tagging products in videos or live streams. Creators can also package products from different sellers on their profiles for users to search through. TikTok takes a cut of each transaction.In its April 2024 economic impact report, the company said TikTok \"brings tens of billions of dollars to the US economy,\" including $15 billion in revenue to small businesses that use the app, supporting more than 224,000 jobs. Business Insider could not independently confirm these internal statistics.Before TikTok \"went dark\" on Saturday night, some creators on the platform told Business Insider they worried the ban could hurt them financially.In a press release for the social media app Own, one creator, ChalkDunny, said he made more than 60% of his income in 2024. Another creator, izzybizzyspider, said in the release that TikTok is her \"biggest source of income and biggest platform.\"She warned that creators on the app have to be \"prepared to be flexible and adapt quickly.\"Nadya Okamoto, founder of menstrual-care brand August, which sells products on TikTok, told Business Insider she is \"relieved\" that TikTok came back online. However, she said the ongoing volatility over the ban prompted her to develop a contingency plan that reduces her reliance on the app.\"I've been encouraging my followers to connect with me on platforms like Instagram and YouTube for updates,\" she said. \"I'm also exploring other affiliate shopping opportunities, such as YouTube Shop, where I've started adding shoppable products—particularly in my skincare-related videos.\"Balance said she plans to switch up the platforms where she does business, given TikTok's still-uncertain future.\"We're going to continue probably to lean on the other channels like Instagram and possibly launch a YouTube,\" she said. \"I think this is just an eye opener for all small businesses that we need to have a diverse way to reach our audiences.\"TikTok did not immediately return a request for comment from Business Insider for this story.","summary":"TikTok restored its US services on Sunday, easing the concerns of content creators who make their living off the platform &mdash; at least for now.","url":"https://www.businessinsider.com/tiktok-creators-react-economy-make-money-app-restored-service-2025-1","image":"https://i.insider.com/678d7edeae09223df2baa358?width=1200&format=jpeg","video":null,"publish_date":"2025-01-20 00:11:34","author":"Katherine Tangalakis-Lippert,Kenneth Niemeyer,Lakshmi Varanasi","authors":["Katherine Tangalakis-Lippert","Kenneth Niemeyer","Lakshmi Varanasi"],"language":"en","source_country":"US","sentiment":-0.028},{"id":281770728,"title":"Melania releases own meme coin after Trump's new cryptocurrency reaches staggering value","text":"Donald Trump's cryptocurrency meme coin had been soaring in value but suddenly suffered a steep drop after his wife Melania Trump launched her own coin.\n\nThe former first lady announced her crypto token Sunday afternoon at 4:10pm ET on Truth Social and X, after which $TRUMP tanked roughly 41 percent, according to price tracker CoinMarketCap.\n\nDespite that, Trump reposted both of Melania's announcements on his social media pages. \n\n$MELANIA is hosted on the Solana blockchain, just like $TRUMP, and can be bought for about $0.09. Her token is much smaller than her husband's, having a market cap of nearly $4.5 million to Trump's $8.5 billion.\n\nShortly after the soon-to-be president announced his meme coin on Friday via Truth Social, his supporters pushed it up to a market cap of $13.3 billion.\n\nThe reaction most people had to Melania's meme launch was one of complete shock.\n\n'This is beyond insane,' analysts at The Kobeissi Letter posted to X. 'Less than 48 hours ago, Donald Trump launched $trump which just erased $7.5 billion in market cap in 10 minutes. In the minutes around the launch of Melania Trump's token, we saw massive sell orders in $trump.'\n\n'Looks like crypto is becoming a family business,' prolific X influencer Mario Nawfal posted.\n\nMeme coins are generally considered to be incredibly risky investments, since they are prone to insider-trading and extreme volatility.\n\nThere are thousands of them available for purchase through many different platforms, but the most recent meme coin that has gotten negative media attention was Haliey Welch's.\n\nWelch, better known as the 'Hawk Tuah Girl,' launched $HAWK with the help of a shady foundation on December 4. \n\nThe token cratered by over 90 percent just hours after it reached a $490 million market cap, prompting accusations of fraud from the crypto community and a lawsuit against the creators of the coin.\n\nAccording to Melania's meme website, 35 percent of the tokens have been distributed to team vesting, 20 percent have gone to both the team's treasury and community, and 10 percent has gone to liquidity. \n\nJust 15 percent of the tokens are available to purchase for the general public, according to the website.\n\nOver 147,000 crypto wallets have stakes in $MELANIA, according to DEXScreener data. Four wallets hold 85 percent of the token.\n\nIn a disclaimer on the website, it says Melania's meme coin is 'intended to function as an expression of support for and engagement with the values embodied by the symbol MELANIA.' \n\nThe coin is 'not intended to be, or to be the subject of, an investment opportunity, investment contract, or security of any type,' according to the website.\n\nSimilar disclaimers are present on Trump's meme coin website, which are almost certainly an attempt to avoid an enforcement action from the Securities and Exchange Commission. \n\nTrump's meme coin announcement featured an artist rendering of the coin showing Trump pumping his right fist in the air with the slogan, 'Fight, Fight, Fight.' \n\n'My new Official Trump Meme is here! It's time to celebrate everything we stand for: winning!' the president-elect wrote. 'Join my very special Trump Community. Get your $Trump now. Go to — Have Fun!'\n\nIt features an image of the President-elect in the moments after an assassination attempt at a campaign rally in Butler, Pennsylvania, on July 13, 2024, when he defiantly threw his hand in the air to show he was unharmed.\n\nBoth Melania and Trump's coins are fungible tokens, meaning that each token is identical and interchangeable with one another. Government-issued currencies like US dollars are considered fungible as well.\n\nTrump has also sold non-fungible tokens in the past, better known as NFTs. They were billed as digital trading cards that featured him in various heroic settings.\n\nThe joint announcements came as Trump is set to be inaugurated as the next president on Monday after defeating Vice President Kamala Harris in the November election.\n\nTrump has already announced he'll be signing a flurry of executive orders on day one of his second presidency, the most anticipated being his decree to save TikTok after it was briefly banned in the US on Saturday.","summary":"After Donald Trump's meme coin has had success in its initial days, Melania Trump has released her own cryptocurrency in her image and name.","url":"https://www.dailymail.co.uk/news/article-14302909/melania-releases-meme-coin-trump-cryptocurrency-inauguaration.html","image":"https://i.dailymail.co.uk/1s/2025/01/19/23/94276153-0-image-a-12_1737329881468.jpg","video":null,"publish_date":"2025-01-20 00:11:09","author":"Editor,James Cirrone","authors":["Editor","James Cirrone"],"language":"en","source_country":"gb","sentiment":-0.082},{"id":281766536,"title":"What will Trump's inauguration look like after the last-minute decision to move it indoors?","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSports meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nWorkers build a stage in the U.S. Capitol Rotunda for Trump's Inauguration, which was moved indoors because of cold temperaturesAlamy Stock Photo\n\nThe Morning Lead\n\nWhat will Trump's inauguration look like after the last-minute decision to move it indoors?\n\nIt will be the first time since President Ronald Reagan took the oath of office in 1985 for his second term that the ceremony will be moved inside the US Capitol.\n\n12.06am, 20 Jan 2025\n\nShare options\n\nTHOUSANDS OF PEOPLE had been set to line the streets of Washington DC for the inauguration ceremony of Donald Trump, but a move indoors might undercut his hopes for a grand spectacle to kick off his second term.\n\nPlanning for the event began over a year ago, when a non-partisan group of politicians from the upper and lower Houses of Congress in the US were tasked with managing and organising the ceremony.\n\nThe schedule for the 60th inaugural ceremony was finalised late last month and the construction of today’s stage started in September 2024 – but plans suddenly changed on Friday after forecasters predicted an “arctic blast” for Washington DC.\n\nIt means the planned traditional parade down Pennsylvania Avenue has changed into an indoor event because of the extreme cold, with temperatures of around -5 degrees expected.\n\nIt will be the first time since President Ronald Reagan took the oath of office in 1985 for his second term that the ceremony will be moved inside the US Capitol.\n\nMore than 250,000 tickets were being distributed to the public before Trump announced that frigid temperatures meant the inauguration would shift to the Capitol Rotunda, which can accommodate only about 600 people.\n\nIt is not quite clear how the ceremony will be adapted to the Capitol Rotunda.\n\nHowever, Trump said supporters could watch a live feed from Washington’s Capital One sports arena, which holds up to 20,000 – and he promised to drop in later.\n\nA man walks outside Capital One Arena, where Trump is expected to hold a post-inauguration ceremony celebrationAlamy Stock Photo\n\nAlamy Stock Photo\n\n“This will be a very beautiful experience for all,” the president-elect said.\n\nTrump will also hold a pre-inauguration event at the Capital One Arena.\n\nChurch ceremonies, music and briefings\n\nEvents will kick off at 1.15pm Irish time (8.15am in Washington DC) with a ceremonial service in the famous St John’s Church on Lafayette Square. \n\nCountry singer Carrie Underwood, long-time friend of Trump Lee Greenwood and Christopher Macchio, an American opera singer, will sing “America the Beautiful” during the swearing-in ceremony.\n\nCountry music artist Carrie Underwood is expected to perform during the performance at the Capitol Building today.Alamy\n\nAlso performing will be country singer Lee Greenwood, whose patriotic anthem “God Bless the USA” is standard at Trump rallies.\n\nA brief tea service at the White House with Biden will then begin at 2.15pm, where the President-elect will also be briefed on the day’s events by the Joint Congressional Committee on Inaugural Ceremonies (JCCIC).\n\nFollowing a cuppa, a procession to the Capitol will begin. It is tradition for the President-elect and the outgoing President to travel together to the Capitol for the swearing-in ceremonies.\n\nFormer presidents also attend the event, though Trump did not travel with Joe Biden and did not attend the ceremony in 2021.\n\nIt is unclear if the incumbent plans to sit out the procession, but Biden told reporters in December that he intends to attend the event.\n\nSwear-in ceremonies\n\nLook, no one will blame you for forgetting that today’s ceremony is actually dedicated to two people – Trump and Vice President-elect JD Vance.\n\nPossibly for that reason, organisers of the event rule that the incoming second-in-command is sworn in first. Vance is due to take the stage at 4.36pm (Irish Time), according to the official timetable.\n\nVice Presidents take a different oath to the President and is, essentially, a promise to uphold the American constitution for the duration of their term.\n\nVance will be making the same oath he made when he first took his seat as a senator for Ohio in January 2023 and will be sworn in by US supreme court judge, and family friend, Brett Kavanaugh.\n\nIn recent years, presidents have been sworn in from an enormous temporary platform on the Capitol’s scenic West Lawn. This year, owing to a frigid forecast, it too will take place inside the Capitol Rotunda.\n\nEleven minutes later, Trump will then be sworn in by John G. Roberts Jr, the chief justice of the US Supreme Court, as is tradition.\n\nAdvertisement\n\nBoth Vance and Trump will be joined by members of their family during the ceremony.\n\nStaging at the Capitol Building in Washington DC in 2017.Alamy\n\nThe President-elect will be asked to repeat: “I do solemnly swear that I will faithfully execute the Office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.”\n\nFollowing Trump’s first inauguration in 2017, he and his team claimed that the event was the most-watched ceremony in US history and crushed previous attendance records despite pictures and all other evidence suggesting otherwise.\n\nThe inaugural address is commonly used by the new President to outline their plan for the first 100 days of their term – a time when the new leader is under intense scrutiny by the media and the public.\n\nDuring Trump’s 15-minute speech following his inauguration ceremony in 2017, the Republican outlined plans to introduce a more populist regime in Washington DC.\n\nHe promised reforms to the justice, education and migration systems from the Obama administration during his term and to boost the productivity of American industry.\n\nIn the run up to the election last year, Trump promised to put small American businesses at the centre of a new, protectionist economic structure. He has also promised to implement tough and extensive tariffs on other nations.\n\nTrump during his 15-minute speech after he was sworn in as the 47th President.Alamy\n\nThe incoming President is likely to outline plans to begin mass-deportation programmes, end birthright citizenship and all of Biden’s migration policies. He previously vowed to pardon those accused and convicted of crimes during the Capitol riot on 6 January 2021.\n\nLast week, at least 11 defendants who stormed the US Capitol received court permission to attend the inauguration.\n\nHe has also promised to end the war in Ukraine, previously claiming he could do so within a day in office. In recent weeks, however, Trump has softened his optimism on how quickly the conflict in Europe can be resolved.\n\n‘Don’t let the door hit you’\n\nIt is tradition, following the ceremony and speech, for the new President to take part in an “honorary departure” and show the outgoing leader the door. Trump accompanied former President Barack Obama to the Marine One helicopter in 2017.\n\nTrump accompanied former President Barack Obama to the Marine One helicopter in 2017.Alamy\n\nHowever, Trump left the White House hours before Biden’s inauguration ceremony began in 2021 and did not return for the honorary departure. It’s unclear if Trump will again walk a Democratic President out, but Biden does not plan to leave early.\n\nFollowing the departure of the outgoing President, Trump and his family will then travel back to the Capitol building to sign nominations for his cabinet, proclamations and executive orders, his first official acts as the 49th President of the United States.\n\nThis, a tradition started by Ronald Reagan in 1981, is to ensure that the cabinet, who oversee various departments and policy programmes in the new administration, is confirmed and accepted by the US senate on the first day of the term.\n\nThe signing takes place in the President’s Room, an ornate 1850s parlour added onto the building when renovations were made to the Capitol, so that the President and Congress can begin their official business in unison.\n\nSigning and swearing done. It’s party time.\n\nWith the formalities out of the way, it’s party time. Lavish dinners, balls and galas have been organised by Trump’s transition team and a number of different groups from around Washington DC.\n\nThree official events have been organised at the White House by Trump’s team and the newly-elected president is expected to attend all of them.\n\n‘The Commander-in-Chief Ball’ is hosted in honor of the new president and is attended by a number of high-ranking military personnel and their families.\n\nA ‘Liberty’ ball, for supporters of Trump, has been organised and will feature a performance by the Village People.\n\nLastly, a number of elusive guests will attend the Starlight Ball, reserved for high-donors of the Trump campaign.\n\nFormer White House press secretary Sean Spicer meanwhile is hosting a ‘Star-Spangled’ Gala, hosting a number of military veterans and vice president Vance will attend a gala organised by the conservative policy think-tank Turning Point USA.\n\n‘Crypto bros’ have also organised their very own ‘Crypto Ball’ this evening as well.\n\n-With additional reporting from Diarmuid Pepper\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nMuiris O'Cearbhaill\n\nViewcomments\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “What will Trump's inauguration look like after the last-minute decision to move it indoors?”.\n\nRecipient's Email\n\nFeedback on “What will Trump's inauguration look like after the last-minute decision to move it indoors?”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nThis is YOUR comments community. Stay civil, stay constructive, stay on topic.\nPlease familiarise yourself with our comments policy\n\nbefore taking part.\n\nLeave a Comment\n\nSubmit a report\n\nPlease help us understand how this comment violates our community guidelines.\n\nDamaging the good reputation of someone, slander, or libel.\n\nRacism or Hate speech\n\nAn attack on an individual or group based on religion, race, gender, or beliefs.\n\nTrolling or Off-topic\n\nAn attempt to derail the discussion.\n\nInappropriate language\n\nProfanity, obscenity, vulgarity, or slurs.\n\nAdvertising, phishing, scamming, bots, or repetitive posts.\n\nPlease provide additional information\n\nThank you for the feedback\n\nYour feedback has been sent to our team for review.\n\nLeave a commentcancel\n\nNewly created accounts can only comment using The Journal app.\n\nThis is to add an extra layer of security to account creation.\n\nDownload and sign into the app to continue.\n\nAccess to the comments facility has been disabled for this user\nView our policy\n\n⚠️ Duplicate comment\n\nPost Comment\n\n have your say\n\nOr create a free account to join the discussion\n\nDonald Trump\n\nthe morning lead\n\nWashington DC\nWhite House\n\nNews in 60 seconds\n\nMan killed in stabbing in Bray, Co Wicklow\n\nQuiz: How much do you know about inaugurations of US presidents?\n\ngovernment formation\nMicheal Martin stands by past criticism of Michael Lowry, says tribunal findings were 'shocking'\n\nHow I Spend My Money\nMoney Diaries: How is your spending and saving going? Would you like to keep a diary for us?\n\n80-year-old woman struck by car in Donegal dies in hospital\n\nevening fix\nHere's What Happened Today: Sunday\n\nspecial ard fheis\nFianna Fáil members vote overwhelmingly in support of draft Programme for Government\n\nChristina Finn\n\nMan killed in stabbing in Bray, Co Wicklow\n\nIsrael says delayed Gaza ceasefire has come into force after Hamas releases hostage list\n\nOccupied Territories Bill to be replaced by new legislation, Martin confirms\n\nFirst three hostages back in Israel as Gaza ceasefire takes hold\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"It will be the first time since President Ronald Reagan took the oath of office in 1985 for his second term that the ceremony will be moved inside the US Capitol.","url":"https://www.thejournal.ie/donald-trump-inauguration-2025-6595629-Jan2025/","image":"https://img2.thejournal.ie/article/6595629/river/?height=400&version=6598285","video":null,"publish_date":"2025-01-20 00:05:04","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":-0.14},{"id":281772622,"title":"Israel frees 90 Palestinian prisoners as ceasefire takes hold after Hamas returns 3 Israeli hostages","text":"DEIR AL-BALAH, Gaza Strip (AP) — The first three hostages were released from Gaza, and the first Palestinian prisoners were freed from Israeli custody, as a fragile ceasefire between Israel and Hamas took hold following 15 months of war, with mixed emotions and more difficult steps ahead over the next six weeks.\n\nPalestinians across Gaza began making their way home, and the first trucks with a surge of humanitarian aid began to enter the devastated territory.\n\nBuses carrying the detainees exited the gates of Israel’s Ofer prison outside the West Bank city of Ramallah, as celebratory fireworks erupted. Palestinians thronged the buses or climbed on top, chanting and cheering.\n\nOthers filled streets, some waving flags, and horns sounded. The release occurred over seven hours after the first hostages were freed.\n\nThe ceasefire that began on Sunday morning raises hopes for ending the devastating conflict and returning the nearly 100 remaining hostages abducted in Hamas’ Oct. 7, 2023, attack. But major questions remain about whether fighting will resume after the six-week first phase.\n\nFirst came the release of 28-year-old Emily Damari, 24-year-old Romi Gonen and 31-year-old Doron Steinbrecher in a tense handover to the Red Cross on a Gaza City street. Footage showed them surrounded by a crowd of thousands, accompanied by masked, armed men wearing green Hamas headbands.\n\nThe women were taken to Israeli forces and then into Israel, where they hugged family members fiercely and wept. Damari was shown raising her bandaged hand in triumph. The military said she lost two fingers in the Oct. 7 attack.\n\nIn Tel Aviv, thousands of people who gathered to watch the news on large screens erupted in applause. For months, many had gathered in the square weekly to demand a ceasefire deal.\n\n“An entire nation embraces you,” Israeli Prime Minister Benjamin Netanyahu said.\n\nSeveral hours later, the first Palestinian prisoners were released. They had been detained for what Israel called offenses related to its security, from throwing stones to more serious accusations such as attempted murder.\n\nIsrael’s military, which occupies the West Bank, warned Palestinians against public celebration. The release took place in the middle of the night in what Palestinians criticized as an attempt to dampen the mood.\n\nThe most prominent detainee being freed was Khalida Jarrar, 62, a member of a secular leftist faction that was involved in attacks against Israel in the 1970s but later scaled back militant activities. Since her arrest in late 2023, she was held under indefinitely renewable administrative detention orders that were criticized by human rights groups.\n\nThe next release of hostages and prisoners comes Saturday, with 33 hostages and nearly 2,000 Palestinian prisoners and detainees to be freed over the ceasefire’s 42-day first phase. In just over two weeks, talks are to begin on the far more challenging second phase.\n\nThis is just the second ceasefire in the war, longer and more consequential than a weeklong pause in November 2023, with the potential to end the fighting for good.\n\nBut Netanyahu, who had been under pressure from both the Biden administration and President-elect Donald Trump to achieve a deal before Monday’s U.S. inauguration, has said he has Trump’s backing to continue fighting if necessary.\n\nMeanwhile, Israel’s hard-line national security minister said his Jewish Power faction was quitting the government in protest over the ceasefire, reflecting the political friction that some Israelis said delayed a deal. Itamar Ben-Gvir’s departure weakens Netanyahu’s coalition but will not affect the truce.\n\n‘Joy mixed with pain’\n\nAcross Gaza, there was relief and grief. The fighting has killed tens of thousands, destroyed large areas and displaced most of the population.\n\n“This ceasefire was a joy mixed with pain, because my son was martyred in this war,” said Rami Nofal, a displaced man from Gaza City.\n\nMasked militants appeared at some celebrations, where crowds chanted slogans in support of them, according to Associated Press reporters in Gaza. The Hamas-run police began deploying in public after mostly lying low due to Israeli airstrikes.\n\nSome families set off for home on foot, their belongings loaded on donkey carts.\n\nIn the southern city of Rafah, residents returned to find massive destruction. Some found human remains in the rubble, including skulls.\n\n“It’s like you see in a Hollywood horror movie,” resident Mohamed Abu Taha said as he inspected the ruins of his family’s home.\n\nAlready, Israeli forces were pulling back from areas. Residents of Beit Lahiya and Jabaliya in northern Gaza told the AP they didn’t see Israeli troops there.\n\nOne resident said they saw bodies in the streets that appeared to have been there for weeks.\n\nIsraelis divided over deal\n\nIn Israel, people remained divided over the agreement.\n\nAsher Pizem, 35, from the city of Sderot, said the deal had merely postponed the next confrontation with Hamas. He also criticized Israel for allowing aid into Gaza, saying it would contribute to the militant group’s revival.\n\n“They will take the time and attack again,” he said while viewing Gaza’s smoldering ruins from a small hill in southern Israel with other Israelis gathered there.\n\nWhen President Joe Biden was asked Sunday whether he has any concerns about Hamas regrouping, he said no.\n\nImmense toll\n\nThe toll of the war has been immense, and new details will now emerge. The head of the Rafah municipality in Gaza, Ahmed al-Sufi, said a large part of the infrastructure, including water, electricity and road networks, was destroyed, in addition to thousands of homes.\n\nThere should now be a surge of humanitarian aid, with hundreds of trucks entering Gaza daily, far more than Israel allowed before. The U.N. World Food Program said trucks started entering through two crossings. Biden’s top Middle East adviser, Brett McGurk, told CBS 800 trucks were expected to flow in Sunday.\n\nOver 46,000 Palestinians have been killed, according to Gaza’s Health Ministry, which says women and children make up more than half the fatalities but does not distinguish between civilians and fighters.\n\nThe Hamas-led attack on southern Israel that sparked the war killed over 1,200 people, mostly civilians, and militants abducted around 250 others. More than 100 hostages were freed during the weeklong ceasefire in November 2023.\n\nSome 90% of Gaza’s population has been displaced. Rebuilding — if the ceasefire reaches its final phase — will take several years at least. Major questions about Gaza’s future, political and otherwise, remain unresolved. ___ Magdy reported from Cairo and Goldenberg from Tel Aviv, Israel. Associated Press reporters Josef Federman in Jerusalem; Sam Mednick in Ramallah, West Bank; and Mohammad Jahjouh in Khan Younis, Gaza Strip, contributed to this report. ___ Follow AP’s war coverage at https://apnews.com/hub/israel-hamas-war\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"DEIR AL-BALAH, Gaza Strip (AP) — The&#160;first three hostages were released&#160;from Gaza, and the first Palestinian prisoners were freed from Israeli custody, as a&#160;fragile ceasefire...","url":"https://whdh.com/news/israel-frees-90-palestinian-prisoners-as-ceasefire-takes-hold-after-hamas-returns-3-israeli-hostages/","image":"https://whdh.com/wp-content/uploads/sites/3/2025/01/hamas.jpg?quality=60&strip=color","video":null,"publish_date":"2025-01-20 00:04:51","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":0.01},{"id":281769084,"title":"OnePlus 13R: OnePlus Goes Back To Define The Future","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nOnePlus 13R\nEwan Spence\n\nOnePlus started, and arguably defined, the idea of the flagship-killer smartphone. The idea that you could get very close to the form and function of top-of-the-line smartphones but with a notable discount has become more prevalent as pricing becomes more variable and the gap between mid-range and high-end functionality lessens.\n\nYet the OnePlus 13R is a quintessential flagship killer from the mother of the genre. Its price ($599 for the 12 GB RAM / 256 GB Storage) is in that curious no-mans-land between the iPhone SE and Pixel 8a smartphones of the world. The specs are going to deliver more than enough power and performance for the average user, and it looks the part with a cutting-edge design\n\nIt also has some subtle downgrades and choices to reach that target price.\n\nOnePlus 13R\nEwan Spence\n\nOnePlus 13R Specs\n\nThe OnePlus 13R design is a striking mix of utilitarian flat surfaces. The corners are curved to help grip, but the flat screen with minimal bezels helps the screen stand out and gives the phone a sense of purpose. That might not be enough to let you recognise the 13R from a distance, but one element does… the three-way alert slider that gives you a choice of silent/vibrate/on, which can all be done by touch.\n\nJust a few moments with the OnePlus 13R and it felt like a OnePlus. That intangible moment takes years to create across multiple phones, and it’s easily lost.\n\nOnePlus 13R\nEwan Spence\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nThe display is the key part of the package and lifts the feel of the handset. It eschews the recent trend for curved screens by going for a completely flat look—and I’m perfectly happy with that choice. It also has a variable refresh rate from 1Hz to 120Hz, and OnePlus’ Aqua Touch allows for touch operations in the wet, and a glove mode enables the phone to pick up inputs as long as the glove’s material is not too deep.\n\nLike previous R models, the chipset is the prior year’s premium choice. So, the OnePlus 13R comes with Qualcomm’s Snapdragon 8 Gen 3. The demands on a smartphone—perhaps excepting on-device generative AI—have not changed significantly over the last year, so last year’s powerhouse still delivers.\n\nIf you want more powerful options, then you should look at the OnePlus 13, which offers the latest technology.\n\nOnePlus 13R\nEwan Spence\n\nOnePlus Battery Life\n\nJust as the OnePlus 13 delivered a class-leading battery that would comfortably exceed two days of regular use, so does the OnePlus 13R, which offers a similarly impressive number in the £700 range. Battery life is a touch longer than last year’s OnePlus 12R, and you will get a comfortable day of use out of the handset. Two days of general use is too much for the device, so I can see this as a regular ‘charge every night’ device.\n\nThe larger battery, coupled with just 80W in the fast charger, means the empty to 100 percent time is longer than most, with 45 minutes being the best I saw. This is if you use the SuperVOOC wired charger, which is an additional purchase—OnePlus does not ship the phone with a charger, just the signature red USB-C cable.\n\nUnfortunately, the 13R does not support wireless charging. Given the svelte construction and the larger battery, there may not be the internal volume to accommodate everything. For a long time, OnePlus put off adding wireless charging, noting that with a fast-charging battery, the need for wireless charging diminished. I guess the internal prioirty of faster wired over wireless is still in effect.\n\nOnePlus 13R\nEwan Spence\n\nOnePlus 13R Camera\n\nI think that OnePlus has over-extended what it can deliver with the camera. I’d argue that the three-lens arrangement has one lens too many.\n\nThe primary lens is the only lens with optical and electronic stabilization to help capture crisp and clear shots. That’s a massive help in low-light environments, so you’ll lean into the default lens for most of your work.\n\nThankfully, the macro lens found on the OnePlus 12R has been replaced with an x2 telephoto camera. It’s not a tremendous amount of magnification, but it’s more welcome and valuable than a lens for super close-up work.\n\nWhile the primary and telephoto lenses have 50-megapixel sensors, the wide-angle lens comes in at just 8 megapixels. The lack of physical pixels means there is a lot more post-processing going on here, and once you start to edit your own, the lack of original detail becomes apparent.\n\nGiven how close the primary and telephoto lens quality is, I wonder if dropping the third lens and investing the savings into what would be a two-lens system would have been a better choice. Smartphone design is about making choices, which is a rather fundamental choice at the heart of the system.\n\nOnePlus 13R\nEwan Spence\n\nOnePlus 13R OS And AI\n\nThe OnePlus 13R uses OxygenOS 15, which is OnePlus’ flavor of Android 15. With four years of software support and six years of security updates, the 13R offers a solid window of support for the price. OxygenOS remains a clean implementation of Android with little added by OnePlus to Google’s standard package.\n\nIt’s also functionally identical to the software running on the OnePlus 13. You get the latest Gemini AI tools from Google, alongside OnePlus’s own AI software; its generative editing tools are most noticeable when working with your photos.\n\nOnePlus 13R\nEwan Spence\n\nOnePlus 13R Final Thoughts\n\nThe OnePlus 13R has some clear weak spots. The camera doesn’t have the optical zoom or the accuracy of other handsets at a similar price, and the lack of wireless charging is disappointing.\n\nYet the OnePlus 13R is more than those choices. It’s a well-rounded device that is a cut above the mid-range smartphones that get a lot of attention. It’s closer in price to the iPhone 16 and the Galaxy S24 FE, while the specs are closer to their larger brethren. And the endurance you get from the battery is a huge selling point.\n\nThe OnePlus 13R isn’t really a mid-range smartphone. When mid-range customers look for something “a little bit more”, they don’t want to step up to an expensive premium device. They need something that’s close in specs, offers more potential than the average smartphone, and has a little bit of class around it.\n\nThere should be a name for that. Oh wait, there is.\n\nThe OnePlus 13R… the flagship killer.\n\nDisclaimer: OnePlus supplied a OnePlus 13R for review purposes.\n\nFollow me on Twitter or LinkedIn. Check out my website. \n\nEwan Spence\n\nEditorial Standards\n\nForbes Accolades","summary":"OnePlus started, and arguably defined, the idea of the flagship-killer smartphone. Has it rediscovered that killer instinct with the OnePlus 13R?","url":"https://www.forbes.com/sites/ewanspence/2025/01/19/oneplus-13r-android-flagship-killer-smartphone-oxygenos-review/","image":"https://imageio.forbes.com/specials-images/imageserve/678d8dd792aa2e29704e7c5a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-20 00:04:07","author":"Ewan Spence,Senior Contributor","authors":["Ewan Spence","Senior Contributor"],"language":"en","category":"politics","source_country":"US","sentiment":0.138},{"id":281766824,"title":"Keir Starmer congratulates Donald Trump ahead of inauguration","text":"Sir Keir Starmer has congratulated US President-elect Donald Trump ahead of his inauguration and said that the so-called special relationship “will continue to flourish for years to come”.\n\nThe president-elect will be sworn in to his second term in the White House on Monday, eight years after he first took the oath of office.\n\nThe Prime Minister paid tribute to the “depth of friendship” between the 47th president and the UK, and pledged to continue to “work together to ensure the success of both our countries and deliver for people on both sides of the Atlantic”.\n\nMr Trump spent the eve of the inauguration at a rally, where he declared his supporters had “built a new American majority that will lead our country to success for generations to come”.\n\nUK politicians including Nigel Farage are in the American capital ahead of the ceremonies, but questions remain over what impact the second Trump presidency will have on economies across the world if he follows through on threats to implement tariffs.\n\nIn a statement on Sunday evening, the Prime Minister sent his congratulations to Mr Trump.\n\n“For centuries, the relationship between our two nations has been one of collaboration, cooperation and enduring partnership. It is a uniquely close bond,” Sir Keir said.\n\n“Together, we have defended the world from tyranny and worked towards our mutual security and prosperity.”\n\nThe Prime Minister and the president-elect met in New York in September at Trump Tower, ahead of the US election, and at the time Sir Keir said he is a “great believer in personal relations on the international stage”.\n\nSir Keir added on Sunday: “Since our first meeting in September, the President and I have spoken about the need to deepen and invest in the transatlantic relationship.\n\n“We will continue to build upon the unshakeable foundations of our historic alliance as we tackle together the global challenges we face and take our partnership to the next level focused on shared opportunities ahead for growth.\n\n“I look forward to our next meeting as we continue our shared mission to ensure the peace, prosperity and security of our two great nations.\n\n“The special relationship between the United Kingdom and United States will continue to flourish for years to come.”\n\nThe Associated Press news agency reported on Sunday evening that supporters of Mr Trump filled the Capital One Arena for the pre-inauguration rally.\n\n“Tomorrow, at noon, the curtain closes on four long years of American decline, and we begin a brand-new day of American strength and prosperity, dignity and pride,” Mr Trump told supporters.\n\nHe added: “We not only won a mandate, but we built a new American majority that will lead our country to success for generations to come.”\n\nA number of UK political figures have gathered in Washington DC ahead of the inauguration – the Government will be represented by outgoing ambassador to the US Dame Karen Pierce.\n\nShadow foreign secretary Dame Priti Patel and Reform UK leader Nigel Farage are among the UK political figures in Washington ahead of Monday’s ceremonies.\n\nIn a video posted on X on Saturday, Dame Priti said she was there to represent the Conservative Party, with whom the Republicans have a “decades-long relationship”.\n\nShe added: “Post-inauguration, our parties will continue to work together on those shared values to secure prosperity and freedom across the globe.”\n\nClacton MP Mr Farage shared an image of himself in front of the illuminated White House on Friday evening, alongside three US flags.\n\nThere are questions over what the second Trump presidency could mean for countries and economies around the globe if the president goes ahead with promised tariffs on US imports.\n\nA Cabinet minister suggested on Sunday that the Government “has prepared for all scenarios” in terms of tariffs.\n\nChief Secretary to the Treasury Darren Jones said “we need to see what the Trump administration do” but also that Mr Trump is “well known for wanting to do a good deal”.\n\nWhen asked about tariffs, Mr Jones told the BBC’s Sunday With Laura Kuenssberg programme: “Well, look, as you would expect, the Government has prepared for all scenarios.\n\n“They’re hypothetical at this stage, we need to see what the Trump administration do.”","summary":"The president-elect will be sworn in to his second term in the White House on Monday, eight years after he first took the oath of office.","url":"https://www.standard.co.uk/news/politics/donald-trump-keir-starmer-nigel-farage-priti-patel-prime-minister-b1205756.html","image":"https://static.standard.co.uk/2025/01/20/00/19-c07a227be18c4f9ea9f1b07c7448a307.jpg?width=1200","video":null,"publish_date":"2025-01-20 00:01:48","author":"Caitlin Doherty","authors":["Caitlin Doherty"],"language":"en","category":"politics","source_country":"GB","sentiment":0.296},{"id":281771842,"title":"'We need to save TikTok' says Trump who called for the app to be banned in 2020 – video","text":"Skip to main contentSkip to navigationSkip to navigation\n\nPrint subscriptions\nSearch jobs\n\nEurope edition\n\nAustralia edition\nInternational edition\nThe Guardian - Back to homeThe Guardian\n\nShow moreHide expanded menu\n\nView all News\n\nClimate crisis\n\nEnvironment\n\nGlobal development\n\nView all Opinion\nThe Guardian view\n\nOpinion videos\n\nView all Sport\n\nRugby union\n\nView all Culture\n\nArt & design\n\nView all Lifestyle\n\nHealth & fitness\nHome & garden\n\nSearch input \ngoogle-search \n\nPrint subscriptions\n\nSearch jobs\n\nDigital Archive\nGuardian Licensing\n\nThe Guardian app\n\nNewsletters\nToday's paper\nInside the Guardian\nThe Observer\nGuardian Weekly\n\nCorrections\n\nSearch input \ngoogle-search \n\nSearch jobs\n\nDigital Archive\nGuardian Licensing\n\nMiddle East\n\nGlobal development\n\nDonald Trump\n\n'We need to save TikTok' says Trump who called for the app to be banned in 2020 – video\n\nDuring a rally the day before his inauguration, Donald Trump called on the social media app to be saved. Trump had called for the app to be banned in 2020 during his firm term as president\n\nTikTok says it is restoring service in US after Trump vowed to delay ban\n\nSource: Reuters, CNBC\nMon 20 Jan 2025 01.01 CET\n\nExplore more on these topics\n\nDonald Trump\n\nSocial media\n\nAsia Pacific\n\nMost viewed\n\nMost viewed\n\nMiddle East\n\nGlobal development\n\nOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our email\n\nComplaints & corrections\n\nWork for us\n\nPrivacy policy\nCookie policy\nTerms & conditions\n\nAll writers\nDigital newspaper archive\nTax strategy\n\nNewsletters\n\nAdvertise with us\nSearch UK jobs\n\nBack to top\n© 2025 Guardian News & Media Limited or its affiliated companies. All rights reserved. (dcr)","summary":"During a rally the day before his inauguration, Donald Trump called on the social media app to be saved. Trump had called for the app to be banned in 2020 during his firm term as president \n\n\nTikTok says it is restoring service in US after Trump vowed to delay ban\n\n Continue reading...","url":"https://www.theguardian.com/us-news/video/2025/jan/19/trump-tiktok-ban","image":"https://i.guim.co.uk/img/media/89a8ed8cf18e795bf97656c855734a1283682cbf/0_463_6937_4164/master/6937.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-01-20 00:01:45","author":"Guardian Staff","authors":["Guardian Staff"],"language":"en","source_country":"us","sentiment":0.466},{"id":281769094,"title":"UFC 313 Fight Card Main Event Opening Odds - Pereira Vs. Ankalaev","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nLAS VEGAS, NEVADA - JUNE 29: Alex Pereira of Brazil reacts to his victory in the UFC light ... [+] heavyweight championship fight against Jiri Prochazka of the Czech Republic during the UFC 303 event at T-Mobile Arena on June 29, 2024 in Las Vegas, Nevada. (Photo by Jeff Bottari/Zuffa LLC via Getty Images)\nZuffa LLC via Getty Images\n\nThe UFC made it official during Saturday’s UFC 311 fight card, the UFC 313 pay-per-view main event will be a matchup between UFC light heavyweight champion Alex Pereira and the No. 1 ranked contender Magomed Ankalaev.\n\nUFC 313 Main Event: Alex Pereira vs. Magomed Ankalaev\n\nAlex Pereira (12-2) began 2023 by losing his UFC middleweight title to Israel Adesanya by knockout. In July, Pereira followed that setback with a win over former UFC light heavyweight title holder, Jan Błachowicz, in his UFC debut at 205 pounds. He finished the year by knocking out ex-UFC light heavyweight kingpin Jiří Procházka at UFC 295 to claim the vacant UFC 205-pound title.\n\nPereira made his first defense of his crown in April when he knocked out(another) ex-UFC light heavyweight champ, Jamahal Hill, in the first round of their UFC 300 matchup. Pereira showed his power is on another level, when he finished Hill 3:14 into the first round of the main event of UFC 300.\n\nIn June, on very short notice, the UFC called on Pereira and Procházka to headline UFC 303 when the Conor McGregor vs. Michael Chandler fight fell off that card.\n\nAfter the bout, which Pereira won via a knockout 13 seconds into the second stanza, I wrote:\n\nPereira showed that his first win over Prochazka wasn't a fluke. The UFC light heavyweight champ is a fearsome fighter who packs a lot of power in his strikes, but he's also an extremely focused competitor who doesn't let anything bother him.\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nPereira effectively scored two knockouts on Saturday night, blasting former champion Jiri Prochazka to the mat at the bell to end the first round and then sending him right back down in the opening moments of the second round with a head kick.\n\nLAS VEGAS, NEVADA - JUNE 29: (R-L) Alex Pereira of Brazil kicks Jiri Prochazka of the Czech Republic ... [+] in the UFC light heavyweight championship fight during the UFC 303 event at T-Mobile Arena on June 29, 2024 in Las Vegas, Nevada. (Photo by Chris Unger/Zuffa LLC via Getty Images)\nZuffa LLC via Getty Images\n\nIn August the UFC booked Pereira against Khalil Rountree Jr for the main event of UFC 307, which took place on October 5. Pereira outclassed Rountree, putting a beating on his opponent before scoring a fourth-round TKO win.\n\nPereira picked up his third UFC title defense of 2024 on Saturday night. Pereira let his opponent, Khalil Rountree Jr, tire himself out in the early going of the fight while simultaneously slowing him with powerful kicks to Rountree's lead leg. Pereira picked up the pace in the third round, fighting very effectively behind his jab. That jab opened up several nasty cuts around Rountree's eye and on the bridge of his nose. Those blows hurt Rountree, and once Pereira had Rountree fading, he picked him apart with precision and power, forcing the referee, Marc Goddard, to stop the fight in the fourth round. Goddard could have stopped this much sooner.\n\nPereira was in the running for fighter of the year for 2024.\n\nABU DHABI, UNITED ARAB EMIRATES - OCTOBER 26: Magomed Ankalaev of Russia reacts after a victory ... [+] against Aleksandar Rakic of Austria in a light heavyweight fight during the UFC 308 event at Etihad Arena on October 26, 2024 in Abu Dhabi, United Arab Emirates. (Photo by Chris Unger/Zuffa LLC)\n\nMagomed Ankalaev (19-1-1-1) has been a member of the UFC roster since 2018. Ankalaev lost his UFC debut when Paul Craig submitted him at 4:59 of the third round. Since then, Ankalaev has gone 13 fights without a loss.\n\nAnkalaev secured a title fight in December 2022 when he faced former UFC champion Jan Blachowicz for the vacant light heavyweight crown. However, that contest ended in a split draw, and with neither man impressing the matchmakers in that matchup, the UFC opted not to give either man a second go at earning the belt.\n\nSince then, Ankalaev is 2-0-0-1 with a no contest (illegal knee) against Johnny Walker, and most recently a decision win over Aleksandar Rakic at UFC 308.\n\nWhen the UFC opted to give UFC light heavyweight champion Alex Pereira a fight against Khalil Rountree at UFC 307 and bypass Ankalaev, he felt snubbed by the promotion, but also motivated.\n\n“Now everybody knows I'm not fighting for the title and will fight Rakic in Abu Dhabi. Whoever (UFC matchmaker) Mick Maynard gives me I will smash their face so that they can no longer deny me if I do my job impressively. I feel sorry for whoever is gonna fight me from now going forward,” Ankalaev said at the time.\n\nNot long after that, Ankalaev said that Pereira was running from him.\n\nAt UFC 313, Ankalaev gets his long awaited shot at Pereira.\n\nUFC 313 Main Event: Alex Pereira vs. Magomed Ankalaev Opening Betting Odds\n\nAccording to BetOnline, Ankalaev opened as the -200 betting favorite over Pereira, who opened as the +170 betting underdog.\n\nUFC 313 Fight Card\n\nUFC 313 is scheduled to take place on Saturday, March 8 at T-Mobile Arena in Las Vegas, Nevada.\n\nTrent Reinsmith\n\nEditorial Standards\n\nForbes Accolades","summary":"The main event of the UFC 313 PPV fight card sees Alex Pereira put his light heavyweight title on the line against Magomed Ankalaev. We look at the opening betting odds.","url":"https://www.forbes.com/sites/trentreinsmith/2025/01/19/ufc-313-fight-card-main-event-opening-oddspereira-vs-ankalaev/","image":"https://imageio.forbes.com/specials-images/imageserve/6680f178efb36ecd95dbc163/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-20 00:01:44","author":"Contributor,Trent Reinsmith","authors":["Contributor","Trent Reinsmith"],"language":"en","source_country":"US","sentiment":-0.293},{"id":281768966,"title":"'Gaza ceasefire was a moment of relief and regret - war proved violence does not work'","text":"For Palestinians and Israelis, yesterday was a moment of relief and regret.\n\nThere was relief that a ceasefire has finally been agreed but regret at lives lost and destruction caused during the 470-day war. The immediate task is to secure the -fragile truce so more hostages can be freed and more aid can reach the people of destroyed Gaza.\n\nThe majority of the victims of this brutal conflict have been innocent civilians. Tens of thousands have died and millions more have been left homeless and starving.\n\nRebuilding a habitable Gaza will take time but rebuilding the conditions for a lasting peace will take even longer. The war proved only one thing: that violence does not work.\n\nHamas failed in its aim of destroying Israel, while Israel’s use of excessive force -radicalised a new generation of Palestinians.\n\nDanger ahead\n\nIt is impossible to view another four years of Donald Trump without foreboding.\n\nDuring his first term in the White House he was constrained by the Cabinet and Congress. This time he has surrounded himself with cronies and the Republicans have control in the Senate and the House of Representatives.\n\nThis leaves Mr Trump with the power to sow discord both domestically and internationally. He plans to expel millions of migrants, replace civil -servants with partisan supporters and pardon -protesters who tried to subvert democracy. Overseas, he threatens to unleash trade wars and rip up climate change treaties.\n\nHe has left a question mark over the future of Nato and raised fears he could force Ukraine to strike an unacceptable deal with Russia.\n\nAmerica’s allies will hope for the best but could justifiably fear for the worst.\n\nThrifty champ\n\nTyson Fury may have millions in the bank but the ring king still uses his council-run leisure centre.\n\nHe clearly boxes clever when it comes to his hard-earned money.","summary":"Fighting paused in Gaza as Israel and Hamas honoured a ceasefire that allowed hostages to be released after 470 days in captivity in the Gaza strip - both Hamas and Israel failed","url":"https://www.mirror.co.uk/news/world-news/gaza-ceasefire-moment-relief-regret-34511723","image":"https://i2-prod.mirror.co.uk/incoming/article31557070.ece/ALTERNATES/s1200/114_the-mirror-says-6.jpg","video":null,"publish_date":"2025-01-20 00:01:00","author":"Voice of the Mirror","authors":["Voice of the Mirror"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.419},{"id":281766810,"title":"‘British Muslims fear Musk influence and emboldened Islamophobia under Trump’","text":"Young British Muslims are worried about the influence of Elon Musk and whether the Donald Trump presidency in the US might see Islamophobia “emboldened”, the outgoing leader of the UK’s largest Muslim umbrella organisation said.\n\nIn her final days as secretary-general of the Muslim Council of Britain (MCB), Zara Mohammed, the first woman and youngest person to hold the role, warned of a “deeply challenging time” for her community.\n\nMr Musk, the billionaire owner of Tesla and SpaceX, is a close ally of Mr Trump, who will be inaugurated for his second presidential term on Monday.\n\nMr Musk is expected to have a key role in the political administration in the US, and has been engaging in controversial commentary online regarding UK politics recently, including piling pressure on the Prime Minister to order an inquiry into grooming gangs.\n\nIn an interview with the PA news agency before she steps down after her four-year term as MCB leader, Ms Mohammed said the “normalisation of figures on the far-right” is concerning.\n\nAsked how young British Muslims are feeling, she said: “I think it’s a deeply challenging time. Many Muslims in particular are kind of staying away from X and certain social media platforms.\n\n“It’s so hostile. It’s so disgusting I would say, the kind of vitriol we’re seeing. The smearing of, whether it’s Pakistani communities or Muslim communities, you know.\n\n“Using child grooming to, again, politicise and actually make one community look really barbaric – so I think we’re really worried.\n\n“I think we’re worried about the influence of Musk. We’re worried about the kind of normalisation of figures on the far-right, particularly the Tommy Robinsons and even Nigel Farage, which just always veer away from the illegal, you know, just on the borderline.\n\n“But Tommy’s obviously been very vocal about his sentiment and feeling. The anti-immigrant rhetoric, anti-refugee rhetoric, and growing Islamophobia.\n\n“So I think these are going to be the biggest challenges in 2025 and I think with the Trump election, we’ll wait to see how much more that’s emboldened.”\n\nMs Mohammed said that while the conflict in the Middle East had been “very polarising”, it was the riots last summer after the Southport stabbings which were perhaps the hardest period of her leadership.\n\nShe told PA: “I could not believe that mobs of people were physically trying to destroy, arson attack, hurt Muslims, refugees, mosques, marching around.”\n\nShe contrasted the work she and others had done to bring communities together, with the scenes of division on the streets.\n\nShe said: “On one hand we’re making great progress, we’re more integrated, you know, but at the same time, we’re being treated as a security and immigration issue.\n\n“And I think the politics and the national narrative of belonging is really in a bad juxtaposition.”\n\nMs Mohammed said the current climate is one in which there is a particular need for “meaningful partnerships” between the Government and organisations like the MCB.\n\nShe said the current policy of non-engagement with the MCB is “a disservice to future generations”, having hoped for official engagement to have been reinstated during her tenure.\n\nTies were first cut under Labour in 2009, over a reported declaration of support by a then-senior figure in the MCB for Hamas.\n\nThey were restored the following year after the MCB stated its opposition to violence, but more recently both the Conservative and Labour administrations have refused to engage with the organisation.\n\nMs Mohammed said that while the MCB has had “our fair share of history”, they do not advocate for any “negative” views, saying they are democratically-run, with elections, a code of conduct, protocols “and a lot of scrutiny”.\n\nShe added: “For me, I think particularly again after the riots, and again after the constant increase in Islamophobia and hate crime, this new Government, I hope, will change its approach.\n\n“I think it’s a disservice to future generations. You know, this Government shouldn’t let down the future of young British Muslims.\n\n“We can’t afford to let them down, actually. And I think that with all that’s going on, what we need is meaningful partnerships.”\n\nLabour minister Alex Norris confirmed to Parliament in August that the Government’s policy not to engage remained unchanged and that there were no plans for ministers to meet the MCB.\n\nA Government spokesman declined to comment on the specific reasons for current non-engagement.\n\nThey said: “All forms of religious and racial hatred have absolutely no place in our society.\n\n“The Government engages regularly with faith communities to foster strong working relationships and we are exploring a more integrated and cohesive approach to tackling racial and religious hatred, including Islamophobia.\n\n“Further details of this work will be set out in due course.”","summary":"Outgoing Muslim Council of Britain leader Zara Mohammed said this is a “deeply challenging time” for her community.","url":"https://www.standard.co.uk/news/politics/elon-musk-donald-trump-british-islamophobia-muslim-council-of-britain-b1205767.html","image":"https://static.standard.co.uk/2025/01/20/00/99a9359fab68ac7869c75b040292c698Y29udGVudHNlYXJjaGFwaSwxNzM3MjIyODI1-2.78574756.jpg?width=1200","video":null,"publish_date":"2025-01-20 00:01:00","author":"Aine Fox","authors":["Aine Fox"],"language":"en","category":"politics","source_country":"GB","sentiment":-0.094},{"id":281766788,"title":"New agreement to enable UK-qualified professionals to work in Switzerland","text":"A new agreement will enable UK-qualified professionals such as lawyers and ski instructors to work in Switzerland, ministers have announced.\n\nThe UK-Switzerland Recognition of Professional Qualifications Agreement will mean Britons’ qualifications in more than 200 professions are recognised in Switzerland, according to the Department for Business and Trade.\n\nIt replaces a similar agreement that was in place while the UK was departing the EU which expired at the end of 2024.\n\nThe announcement comes as Chancellor Rachel Reeves and Business Secretary Jonathan Reynolds will be in the country for the World Economic Forum annual meeting at Davos this week.\n\nAccording to the department, the new deal will cover a range of professions from auditors to driving instructors and cabin crew, and for the first time anaesthetists will also be covered.\n\nIt replaces the citizens’ rights agreement which was reached in 2018 as the UK was leaving the EU and covered UK and Swiss nationals living in both nations, and provided similar cover for professional qualifications.\n\nMr Reynolds said his experience as a trainee solicitor means “I know the challenges faced by UK professionals when working abroad and innovative agreements like this will make a real difference to our world-class services sectors”.\n\nHe added: “As a resolutely pro-business Government, we want to make it as seamless as possible for UK businesses to operate abroad.\n\n“With the UK and Switzerland being two global leaders in services trade, this agreement is testament to our unwavering commitment to economic growth.”\n\nThe summit in Switzerland this week comes after a report released by the World Economic Forum last week found that global economies are facing declining optimism amid growing concerns about armed conflicts.\n\nThe WEF annual global risk survey found that climate change and extreme weather events remain the biggest concern over the long term, however, and increased geopolitical pressures are causing growing uncertainty across the economy.\n\nThe poll of more than 900 global risk experts, policymakers and industry leaders showed that the majority of respondents, 52%, are anticipating an “unsettled” global outlook over the next two years.\n\nThis is also linked to concerns over shifting trade policies, amid the threat of the US’s Donald Trump imposing new tariffs on other countries later this year.","summary":"It replaces a similar agreement that was in place while the UK was departing the EU which expired at the end of 2024.","url":"https://www.standard.co.uk/business/business-news/new-agreement-to-enable-ukqualified-professionals-to-work-in-switzerland-b1205750.html","image":"https://static.standard.co.uk/2025/01/20/00/e99a93f038407a090e11019d817ee892Y29udGVudHNlYXJjaGFwaSwxNzM3MzkyODUw-2.78635777.jpg?width=1200","video":null,"publish_date":"2025-01-20 00:01:00","author":"Caitlin Doherty","authors":["Caitlin Doherty"],"language":"en","category":"politics","source_country":"GB","sentiment":0.241},{"id":281767314,"title":"NBC News host confronts top Democrat on whether he had 'responsibility to be more forthcoming' about Biden","text":"House Minority Leader Hakeem Jeffries, D-N.Y., was confronted with an old clip of himself during an interview on Sunday in which he declared President Biden was the best candidate to run against President-elect Donald Trump. \"What do you say to Americans who believe you and other top Democrats misled them?\" NBC's Kristen Welker asked Jeffires after playing him a clip of himself from February 2024 on \"The View\" saying Biden was the \"definitely the strongest candidate\" to run against the now-president elect. \"Well, Joe Biden was the incumbent president at the time. He was the candidate at the time, and I supported him at the time, and that was the right thing to do, based on the incumbent president making the decision that he was going to run,\" Jeffries said, responding to the clip. JOURNALISTS WHO HID BIDEN'S DECLINE SHOULD BE HELD ACCOUNTABLE: NY POST EDITORIAL BOARD Jeffries added that he wanted to look forward, rather than backwards, and focus on delivering for Americans after Trump's victory. Welker pressed further, \"Do you believe you had a responsibility to be more forthcoming about what you had seen behind closed doors as it relates to President Biden?\" \"What I saw behind closed doors was a president who was working hard to get things done to deliver for the American people on infrastructure, on driving down the high price of life saving prescription drugs, on bringing domestic manufacturing jobs back home to the United States of America,\" Jeffries responded. The NBC News host similarly confronted Sen. Chuck Schumer, D-N.Y., with a clip of himself insisting concerns about Biden's mental acuity were \"right wing propaganda.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"His mental acuity is great. It’s fine. It’s as good as it’s been over the years. All this right-wing propaganda that his mental acuity has declined is wrong,\" Schumer declared in February 2024. When asked what he would tell Americans who think they were misled by top Democrats, Schumer said, \"\"We didn't. Let's look at President Biden. He’s had an amazing record. The legislation we passed, one of the most significant groups of legislation since Lyndon Johnson’s great society, putting in 235 judges, a record, and he’s a patriot.\" Welker then asked Schumer if he was confident Biden could have served a second term. CLICK HERE TO GET THE FOX NEWS APP \"Well I'm not going to speculate. As I said, I think his record is a stellar one, and he’ll go down in history as a really outstanding president,\" Schumer responded.","summary":"NBC News&apos; Kristen Welker pressed House Minority Leader Hakeem Jeffries on what he would tell Americans who felt mislead by Democrats on Sunday.","url":"https://www.foxnews.com/media/nbc-news-host-confronts-top-democrat-whether-he-had-responsibility-more-forthcoming-about-biden","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/welker-jeffires-split.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-20 00:00:58","author":"Hanna Panreck","authors":["Hanna Panreck"],"language":"en","category":"politics","source_country":"us","sentiment":0.061},{"id":281767596,"title":"Treasury nominee says tariffs will be for remedying unfair trade practices, for negotiations under Trump","text":"U.S. Treasury Secretary nominee Scott Bessent said Thursday that under the incoming Trump administration, tariffs will be used for remedying unfair trade practices by China and other countries as well as for negotiations.\n\nDuring his confirmation hearing at the Senate Committee on Finance, Bessent, the founder of Key Square Group, a global investment firm, made the remarks, as Korea and other U.S. partners are pondering ways to navigate through incoming President Donald Trump's plans to impose new tariffs on foreign goods.\n\nDuring his election campaign, Trump said he would slap blanket tariffs of 10 to 20 percent on all imports, and threatened to slap tariffs of up to 60 percent on Chinese goods, as he hammered away at his America First agenda that some say smacks of isolationism and protectionism.\n\n\"The American people should think about tariffs in three ways. Under the Trump administration, one will be for remedying unfair trade practices either by industry or country,\" Bessent said.\n\n\"Two ... maybe for a more generalized tariff as a revenue raiser for the federal budget and three, President Trump, I think, has added a third use of tariffs as a skilled negotiator,\" he added.\n\nHe noted that sanctions have apparently been overused, and that sanctions may be driving countries out of using the U.S. dollar.\n\n\"So tariffs can be used for negotiations, whether it's for Mexico on the fentanyl crisis,\" he said.\n\nBessent underscored that to rebuild America's economy and lay the foundation for the next generation of American competitiveness, the U.S. must use \"all tools available\" to better serve the interest of working Americans.\n\nHe pointed out that \"for too long,\" the U.S. has allowed \"unfair distortions\" in the international trading system.\n\n\"President Trump was the first president in modern times to recognize the need to change our trade policy and stand up for American workers,\" he said. \"If confirmed, I look forward to working with President Trump and members of this committee to do just that.\n\nIn November, Trump nominated Bessent, describing the hedge fund mogul as a \"strong\" advocate of his America First agenda and vowing to usher in a \"new golden age\" for the U.S.\n\nBessent has been in the investment management business for over 35 years. He is a member of the French Huguenot Church of Charleston, where his family were founding members in the 1680s.\n\nIn 1984, he graduated from Yale University with a Bachelor of Arts in political science. He served as an adjunct professor of economic history at Yale from 2006 to 2011. (Yonhap)","summary":"U.S. Treasury Secretary nominee Scott Bessent said Thursday that under the incoming Trump administration, tariffs will be used for remedying unfair trade practices by China and other countries as well as for negotiations.","url":"https://nation.lk/online/treasury-nominee-says-tariffs-will-be-for-remedying-unfair-trade-practices-for-negotiations-under-trump-292428.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/10c6a41d4681490dac4f2b0bf80e5882.png","video":null,"publish_date":"2025-01-20 00:00:23","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.305},{"id":281767602,"title":"US lawsuit accuses PepsiCo of price discrimination that favored Walmart over smaller stores","text":"The Federal Trade Commission sued PepsiCo on Friday, alleging that it has engaged in illegal price discrimination by giving unfair price advantages to one large retailer at the expense of other vendors and consumers.\n\nThe benefiting customer wasn’t named in an FTC statement about the lawsuit. But a source familiar with the case, who asked not to be named because they were not authorized to discuss it, said the retailer was Walmart.\n\nPepsiCo said the lawsuit “is wrong on the facts and the law” and misunderstands the way consumer product companies help retailers provide lower prices.\n\n“PepsiCo strongly disputes the FTC’s allegations and the partisan manner in which the suit was filed. We will vigorously present our case in court,” the company said in a statement.\n\nThe FTC said PepsiCo’s practices included making promotional payments to Walmart but not to large grocery chains or independent convenience stores. The FTC said that lets Walmart lower its prices, but forces Americans to pay inflated prices for PepsiCo products unless they shop at Walmart.\n\n“When firms like Pepsi give massive retailers a leg up, it tilts the playing field against small firms and ultimately inflates prices for American consumers,” FTC Chair Lina Khan said in the statement. “The FTC’s action will help ensure all grocers and other businesses — no matter the size — can get a fair shake and compete on the merits of their skill, efficiency, and talent.”\n\nWalmart said Friday it had “nothing to add at this time.” PepsiCo said its practices “are in line with industry norms.” “We do not favor certain customers by offering discounts or promotional support to some customers and not others,” the company said.\n\nThe FTC sued PepsiCo under the rarely enforced 1936 Robinson-Patman Act. The FTC said the act prohibits companies from using promotional incentive payments to favor large customers over smaller ones.\n\nIt was the second time in a little more than a month that the FTC has cited the Robinson-Patman Act in a lawsuit. In December, the commission sued Southern Glazer’s Wine and Spirits, a large U.S. distributor, saying it illegally discriminated against small and independent businesses by giving discounts and rebates to larger stores.\n\nIn the waning days of the Biden administration, the FTC has been busy issuing consumer refunds, taking enforcement actions against companies the agency accuses of deceptive practices and finalizing rules it says are needed to make the marketplace more fair.\n\nThe FTC voted 3-2 to authorize staff to file a lawsuit for a permanent injunction against PepsiCo in the U.S. District Court for the Southern District of New York. Commissioner Andrew Ferguson, who is President-elect Donald Trump’s choice to replace Khan, was one of the two dissenting votes.\n\nThe other commissioner voting against the lawsuit, Melissa Holyoak, wrote in her dissent that the case against PepsiCo was “the worst case I have seen in my time at the commission.” Holyoak said the majority of commissioners rushed the case out the door before they had enough evidence to support the allegations.\n\n“Pepsi’s promotions to the retailer are not disguised discriminatory discounts but rather ordinary price concessions,” Holyoak wrote.\n\nPepsiCo, based in Purchase, New York, is one of the world’s largest food companies. It makes Pepsi, Mountain Dew and Gatorade as well as snack foods like Lay’s potato chips, Doritos and Fritos. It also makes Quaker Oats, brekfast cereals and granola bars.\n\nPepsiCo’s prices have been the subject of some scrutiny since the pandemic. In 2022, for example, the company acknowledged shrinking its Gatorade bottles from 32 ounces to 28 ounces, but it didn’t respond when asked why it charged more for the 28-ounce bottles.\n\nIn October, Democratic Sen. Elizabeth Warren of Massachusetts and U.S. Rep. Madeleine Dean of Pennsylvania sent letters to PepsiCo, Coca-Cola and General Mills accusing them of price gouging through shrinking package sizes.\n\nPepsiCo has said its price increases were necessary because of the rising cost of ingredients, shipping, packaging and labor. But over the summer, the company said consumers were pulling back on snack and drink purchases or shifting to cheaper store brands.\n\nPepsiCo responded by trying to make Lay’s more affordable through a mix of product promotions, more chips per bag and value packs. Similar promotions were planned for Doritos and Tostitos, the company said.","summary":"The Federal Trade Commission sued PepsiCo on Friday, alleging that it has engaged in illegal price discrimination by giving unfair price advantages to one large retailer at the expense of other vendors and consumers. The benefiting customer wasn’t named...","url":"https://nation.lk/online/us-lawsuit-accuses-pepsico-of-price-discrimination-that-favored-walmart-over-smaller-stores-292425.html","image":"https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/01/AP25017632766570.jpg","video":null,"publish_date":"2025-01-20 00:00:06","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":-0.132},{"id":281770330,"title":"And disquiet follows the don, at WEF","text":"Donald Trump will address the World Economic Forum’s annual meeting in Davos virtually and give it a miss in person—his glittering presidential inauguration in Washington DC will be underway just as the influential annual gathering of global movers and shakers, as well as many who fancy themselves to be, gets underway in this Swiss ski town. But concerns over the impact of his upcoming presidency—the combative trade policies he promised on his campaign trail as well as the likely withdrawal of US support to Ukraine and its fallout on Europe, especially—will cast a formidable shadow over the meeting, which has steadily grown in influence since its inaugural edition in 1971.The anxiety over Russia ending up at Europe’s doorstep was dramatically vocalised this week by NATO secretary general Mark Rutte, when he said European nations should sharply increase funding for their own defence or start learning the Russian language. 117368295“We are meeting at one of the most uncertain moments in a generation, as new geoeconomic, geopolitical and technological forces reshape our societies,” WEF president and CEO Børge Brende wrote in a dispatch to the 3,000 invited attendees on the eve of the opening. “The dynamic changes taking place are creating both significant challenges to address, as well as important opportunities, particularly regarding fast-evolving technologies, to unlock.”An estimated 20,000 people converge at this resort town on the sidelines of the summit (in addition to the 3,000 officially invited), to network, evangelise their causes and pitch their wares in numerous meetings and dinners that take place in the labyrinth of luxury hotels and pavilions that mushroom around the main venues of the conference. The stars of the official conference also feature in the numerous events on the sidelines. India Inc, the country’s government, as well as a number of state governments are also here in a big way. More than 65 Indian CEOs are attending the summit. Industry leaders such as Kumar Mangalam Birla and Tata Sons’ N Chandrasekaran are attending, as are financial services leaders such as SBI’s Challa Sreenivasulu Setty, Axis Bank’s Amitabh Chaudhry and Sanjiv Bajaj, chairman & MD, Bajaj Finserv. Wipro’s Rishad Premji, TCS’ K Krithivasan and Infosys boss Salil Parekh will also be attending. 117368299Joining them are the next generation of business leaders, including Anant Goenka of RPG Group, Shashwat Goenka of the RP-Sanjiv Goenka Group and Sudarshan Venu of TVS Motor, alongside startup CEOs such as Paytm’s Vijay Shekhar Sharma and Razorpay’s Harshil Mathur.The renewable energy sector is making its mark with Renew Power’s Sumant Sinha and Waaree Energies’ CMD Hitesh Chimanlal Doshi representing India’s green ambitions. The Indian contingent, representing one of the few large economies still growing at a respectable clip, will walk with their heads high on the promenade. Interest in collaborations and partnerships with Indian businesses and states is palpable, gauging from behind-the-scenes discussions and the hectic meeting schedules weighing down the calendars of business leaders and chief ministers—among them Maharashtra’s Devendra Fadnavis, Andhra Pradesh’s N Chandrababu Naidu and Telangana’s Revanth Reddy. BK Goenka, chairman of the Welspun Group, who has been a familiar face in Davos for over 15 years, recalls how much India's global standing has evolved over the years. “When I first started attending, India barely featured in global conversations—it was all about China. Today, it feels incredible to see India taking centrestage in global discussions. It makes me proud to be Indian.” Inox Group promoter Siddharth Jain, who has over 25 meetings scheduled in the next three-four days with different global delegations, said that the WEF is the perfect space to portray and amplify India’s growth story and the potential the country holds in the global economic landscape.Anish Shah, Group CEO & MD, Mahindra Group, has a clearcut agenda: pushing the company’s EV plans that’s picking up pace with new launches. “I look forward to conversations with global CEOs. I want to understand global opportunities and risks and explore areas of common interest,” he said. The central government is being represented by railways minister Ashwini Vaishnaw, food processing industries minister Chirag Paswan, civil aviation minister Ram Mohan Naidu and Jayant Chaudhary, minister of state for skill development and entrepreneurship. Other key figures include TRB Rajaa, industries minister of Tamil Nadu and Suresh Kumar Khanna, finance minister, UP. Indian states, including Maharashtra, Gujarat and Telangana, are expected to announce record MoUs and investment deals over the next few days. The theme of WEF 2025 is ‘Collaboration for the Intelligent Age’, and technology is expected to be front and centre in most conversations. Davos veteran and EY India region chairman Rajiv Memani said he expects future technologies and green growth to be dominant themes at WEF 2025—a trend that has been gaining momentum for some time. “In recent years, the focus on technology, specifically on AI, has increased at WEF because of its widespread impact around the world. Besides AI, the focus on climate change and implementation realities of sustainability has continued to dominate the agenda. Secondly, the presence of new-age companies and young entrepreneurs has gone up significantly as compared to previous years,” he said","summary":"Donald Trump will address the World Economic Forum in Davos virtually, coinciding with his presidential inauguration. Concerns over Trump's trade policies and US support for Ukraine loom over the event. Indian business leaders and government officials, including state ministers, are present to promote India's growth and form partnerships. The focus themes are future technologies, AI, and green growth.","url":"https://economictimes.indiatimes.com/news/india/and-disquiet-follows-the-don-at-wef/articleshow/117379039.cms","image":"https://img.etimg.com/thumb/msid-117379118,resizemode-4,width-1200,height-900,imgsize-1328034,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-01-20 00:00:00","author":"Vinod Mahanta","authors":["Vinod Mahanta"],"language":"en","source_country":"in","sentiment":0.443},{"id":281764836,"title":"TikTok back to US, Washington to own 50% — Trump","text":"WASHINGTON, January 20. /TASS/. TikTok returns to the United States, US President-elect Donald Trump said during a rally in Washington, adding that the US will own half of its assets.\n\n\"As of today, TikTok is back,\" Trump told the audience. \"I said, I’ll approve [the service's operation in the United States], but let the United States of America own 50% of TikTok. So they will have a partner, the United States, they will have a lot of bidders and the United State will do what we call a joint venture, and there is no risk.\"\n\nThe president-elect explained that the United States will not invest money to this joint venture.\n\n\"All we are doing is we are giving them an approval, without which they don’t have anything,\" Trump noted.","summary":"\"The United State will do what we call a joint venture, and there is no risk,\" US president-elect said","url":"https://tass.com/economy/1901479","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-19 23:56:05","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.476},{"id":281767202,"title":"Trump Celebrates Victory At Final Rally Before Inauguration, Declares \"We Won\"","text":"Washington: US President-elect Donald Trump held one last rally to celebrate his election victory, expressing confidence and optimism about the future of the country on the eve of his second inauguration. Despite deep national divisions, Trump delivered a strong message to thousands of cheering supporters at the Capital One Arena in Washington DC. “We won,” Trump declared to the crowd, reinforcing his claim of victory and saying that the country was about to begin a new era of strength and prosperity. He added, \"Tomorrow, at noon, the curtain closes on four long years of American decline, and we begin a brand-new day of American strength and prosperity, dignity and pride.\"Trump, who had returned to Washington after a victory that brought mixed reactions across the country, told his supporters at the event, \"We not only won a mandate, but we built a new American majority that will lead our country to success for generations to come.\"The mega rally, which took place in cold, rainy weather, saw an attendance of over 20,000 supporters in the arena. The event featured a performance by musician Kid Rock, who sang \"All Summer Long,\" as well as \"God Bless the USA\" by singer Lee Greenwood, a song closely associated with Trump’s re-election campaign.Trump’s supporters were vocal, and the atmosphere was celebratory, a stark contrast to the tense political climate of the past few years. Actor Jon Voight also took the stage, praising Trump as “a man who never gave up on the American people, and we the people never gave up on him”.Do NOT retweet this video of President Donald J. Trump telling the world, “WE WON” 🇺🇸 This will offend every Liberal on 𝕏 pic.twitter.com/wAKYyAryDv— MAGA Voice (@MAGAVoice) January 19, 2025 Stephen Miller, one of Trump’s prominent political advisors and the incoming deputy chief of staff delivered a passionate speech, saying, “Justice is coming.” He further added, “We are about to get our country back and our democracy back. Donald J Trump is about to save this country.”Trump, who has promised to take swift executive actions once in office, also mentioned his plans to address US-Mexico border policy and other major issues.Before the rally, Trump had breakfast privately with Republican senators at Blair House, the official residence across from the White House, and later posed for a photo with Republican female senators and his incoming chief of staff, Susie Wiles.Unlike the events in 2021, when Trump’s supporters stormed the Capitol, authorities did not anticipate massive protests or unrest this time. Instead, the capital was filled with jubilant celebrations from Trump’s supporters, some of whom were dressed in their finest clothes. Many gathered at local hotels and restaurants, chanting \"MAGA\" as they celebrated.","summary":"Trump Celebrates Victory At Final Rally Before Inauguration, Declares &quot;We Won&quot;","url":"https://www.republicworld.com/world-news/trump-celebrates-victory-at-final-rally-before-inauguration-declares-we-won","image":"https://img.republicworld.com/all_images/trump-celebrates-victory-at-final-rally-before-inauguration-declares-we-won-1737330939997-16_9.webp","video":null,"publish_date":"2025-01-19 23:55:45","author":"Digital Desk","authors":["Digital Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.465},{"id":281769092,"title":"From Great Resignation To Great Detachment: 4 Actions Leaders Must Take","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nDetached, disconnected workforce\n\nWhen Anthony Klotz, an organizational psychologist and professor at UCL School of Management, coined the term \"Great Resignation,\" he also noted that the end of this phenomenon should not signify a return to pre-pandemic employment patterns. Instead, he urged leaders to prioritize understanding the underlying factors contributing to employee disengagement.\n\nIn response to the Great Resignation, many organizations did begin to focus on enhancing employee engagement and wellbeing, although the success of these initiatives varied considerably. Additionally, the rapid acceleration of AI has led to a renewed emphasis on digital upskilling, equipping employees with the necessary skills to thrive in an evolving workplace.\n\nFrom Departure To Detachment\n\nFast forward to today: What lessons have we learned? How have we transformed? According to Gallup’s latest research, the answer may be sobering—not much has changed. Rather, things are looking worse.\n\nEmployees are increasingly disengaged, burned out and actively seeking new opportunities. Gallup characterizes this trend as the \"Great Detachment.\" While employees may still be physically present, many are psychologically distant. This disengagement can often be subtle, requiring careful listening or thoughtfully designed engagement surveys to identify its root causes.\n\nMore employees are increasingly satisfied and looking for a change\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nOrganizations that proactively addressed the challenges of the Great Resignation often uncovered pathways for growth and improvement, turning a difficult situation into a strategic advantage. Conversely, those that resisted change may now face the consequences of the Great Detachment.\n\nIn a rapidly evolving business environment where priorities and work practices have shifted significantly in the post-pandemic landscape, executive teams must strive to understand this growing sense of detachment among employees. They need to reorient themselves to the new realities of the workplace and adapt to evolving employee expectations.\n\nTo effectively drive change and foster engagement, executive leaders should consider four key actions:\n\n1. Amidst Disruption, Have A Clear Future Growth Narrative\n\nAccording to recent research by Gallup, nearly 70% of employees report significant disruptions in their jobs. Today's workplace dynamics can be likened to navigating a ship through turbulent seas, where strong winds and towering waves continuously challenge one's course and determination. Many leaders are likely familiar with this pervasive uncertainty. Failing to effectively manage these continuous waves of change will result in employees increasingly drifting away from the company's culture, mission, vision, and future aspirations.\n\nGallup highlights several key factors contributing to this disconnection, including team restructuring, increased job responsibilities, and budget cuts. However, in the midst of this drift, are leaders fostering clarity and connection? A study by MIT-Sloan, which surveyed 124 organizations, found that only 28% of executives and middle managers responsible for executing strategy could identify three of their company's strategic priorities. This gap indicates a lack of cohesive vision; while leaders may advocate for their unit's objectives, they often fail to align with a broader strategy. Such fragmentation can result in competing priorities and mixed messages for employees, complicating efforts to achieve alignment.\n\nTo realign and reconnect employees, leaders should help develop a narrative that clearly articulates the organization’s ongoing journey —reflecting on the past (where we’ve come from), assessing the present (the changes we face today), and envisioning the future (the actions needed to navigate upcoming disruptions). This narrative will serve as a guiding compass for the organization connecting all employees to the mission, vision and key strategies.\n\nLeaders must also present a united front. Engaging in open discussions about the implications of disruptions helps create connection, and collaboratively prioritizing key actions to address these challenges provides confidence and clarity. It’s crucial to communicate a unified strategic response across the organization. By establishing a consistent narrative and fostering collaboration among leadership, companies can better navigate the complexities of disruption, inspiring their workforce to remain connected, focused and resilient amidst disruptive change.\n\n2. Communicate A Clear Workplace Value Proposition\n\nThe post-pandemic workplace has transformed significantly. Gallup research has highlighted several challenges in adapting to this new norm. Hybrid working has become the standard, but it brings its own set of leadership challenges, including schedule coordination, optimizing in-office time and addressing the emotional detachment caused by physical distance.\n\nWhile much attention is given to how employees are adapting to new work models, it is equally important to examine the role of leaders in driving this shift. The critical question is whether leaders have successfully alleviated some of the transition pains through clear communication and effective planning.\n\nGiven the significant changes in work dynamics—and the potential for further shifts with the integration of AI and other digital technologies—it is crucial for leaders to establish a clear value proposition for how specific work arrangements and tech augmentation can drive desired outcomes in performance, productivity and innovation.\n\nLeaders must clearly communicate the value of a hybrid work model to all employees, outlining the benefits it brings to individuals, teams, and the organization as a whole. Instead of simply mandating office attendance, leaders should present compelling rational and emotional reasons that encourage employees to embrace their preferred work arrangement—whether that be hybrid, remote or onsite.\n\nLeaders must also themselves model these new ways of working. For example, if promoting a three-day in-office schedule, leaders should adhere to this practice themselves. When employees are in the office, it’s essential to engage in activities that foster collaboration, such as meetings, hackathons or culture-building initiatives, rather than spending the day on virtual calls.\n\n3. Envision a Clear Customer Engagement Approach\n\nIn today’s rapidly evolving and competitive business landscape, maintaining a close connection with customers is paramount. As the ways in which customers interact with service providers continue to transform, their expectations are also rising—demanding not only exceptional service but also a more differentiated value proposition.\n\nIn this environment of constant disruption, it is essential for leaders to prioritize the customer in all their decisions, strategies, and objectives. Recent research from Gallup reveals a concerning trend: only slightly more than 20% of employees believe their organizations consistently fulfill their customer promise, and just under 30% express extreme pride in the quality of their products and services.\n\nRegarding leadership, a significant issue stands out: just over 20% of employees feel that their leaders consistently make decisions in the best interest of the customer. This raises an important question: Are leaders truly aligned with the customer promise, or are market disruptions and other uncertainties causing them to shift their focus away from customers—where it should be firmly anchored?\n\nThe research also uncovers a significant disconnect: many employees feel that their leaders are not sufficiently prioritizing customer-centric strategies. The findings reveal substantial gaps in perceptions regarding customer-focused decision-making between leaders and employees. Specifically, fewer employees believe that leaders consistently act in the best interests of the customer or that their colleagues always prioritize what is right for the customer, compared to leaders' perspectives. This disconnect creates a perfect recipe for customer detachment.\n\nLeaders can start by establishing a transparent and compelling customer promise that guides all organizational efforts—a clear customer value proposition communicated both externally and internally. This clarity is essential in a rapidly changing service environment, especially with the rise of digital interfaces and new technological advancements needed to enhance service delivery and meet evolving customer needs. Additionally, developing robust feedback mechanisms for both B2B and B2C environments can help continuously gather insights and inform decision-making.\n\n4. Reimagine Careers and Development Pathways\n\nThe pandemic has acted as an important reset for many employees—changing ways of working have triggered a renewed realization and reevaluation of life, careers, relationships and aspirations. According to Gallup, needs from the workplace are shifting, with work-life balance, compensation and remote flexibility becoming increasingly important determinants of what employees want from work.\n\nStaff turnover or job rotation in people management, human resources to manage to recruit new people ... [+] for replacement concept, businessman new hire entering office while other resigned for new job.\n\nThere is also a growing acknowledgment that employees prefer to work in an individualized manner. Gallup research shows that there are \"blenders\" who can effortlessly blend work time with personal time—expecting flexibility and work that aligns with their personal commitments—and \"splitters\" who prefer more rigid boundaries between work and personal life.\n\nThese shifts are transforming what people want from their careers. The traditional career ladder (linear promotion-based progression) is being replaced by the career lattice (sideways and lateral moves). Blenders and splitters have very different needs and preferences regarding career advancement activities. For instance, blenders might favor asynchronous, virtual training that aligns better with their schedules, while splitters might prefer in-house, scheduled training.\n\nPerformance management has also undergone significant changes. While conventional ratings and rankings were once emphasized, there is now a greater focus on coaching, development, and feedback. However, a Gallup survey revealed that only 2% of Fortune 500 companies believe their performance management systems are effective. Additionally, only 47% of employees strongly agree they know what is expected of them at work, down from 56% before the pandemic.\n\nLeaders should prioritize an individualized approach to both performance and career management. This shift necessitates the active support of managers who must engage in more coaching. To do this effectively, managers need to be equipped with the skills to coach, provide constructive feedback, and foster employee development and progression. Ultimately, leaders must spearhead the evolution of organizational strategy from a focus on ranking and rating to one centered on coaching and development.\n\nNew Leadership Frontiers In The Era Of Great Detachment\n\nThe Great Resignation was born out of unique situations—the pandemic and its chaos forced a different reality for employees. In contrast, the Great Detachment has perhaps emerged from ineffective leadership in this new landscape. Addressing this will require concerted actions on employee engagement, customer engagement, and well-being, along with greater support and role modeling from leaders.\n\nImportantly, leaders must recognize these shifts in employee development expectations are long term - and invest fully in systems and processes, such as career management and performance development, that can help employees grow in a world where career expectations and growth avenues have been radically altered.\n\nAs the Great Detachment replaces the Great Resignation, taking these proactive measures, organizations can foster a more engaged workforce and build loyalty among customers.\n\nFollow me on LinkedIn. \n\nVibhas Ratanjee\n\nEditorial Standards\n\nForbes Accolades","summary":"Since the Great Resignation, employees are today more detached based on Gallup research. These are four actions for leaders to navigate this Great Detachment.","url":"https://www.forbes.com/sites/vibhasratanjee/2025/01/19/from-great-resignation-to-great-detachment-4-actions-leaders-must-take/","image":"https://imageio.forbes.com/specials-images/imageserve/676f57676779a0d0e563ff3e/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-19 23:54:27","author":"Contributor,Vibhas Ratanjee","authors":["Contributor","Vibhas Ratanjee"],"language":"en","source_country":"US","sentiment":0.294},{"id":281769088,"title":"WEF 2025: Three Opportunities For Cooperation In Davos","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nLeaders at WEF 2025 in Davos have the opportunity to prioritize global cooperation on urgent issues ... [+] like children's health, climate action, and renewable energy, paving the way for transformative, collaborative solutions to the world's most pressing challenges (Photo by Fabrice COFFRINI / AFP) (Photo by FABRICE COFFRINI/AFP via Getty Images)\nAFP via Getty Images\n\nThis week, as people gather in Washington for Donald Trump’s inauguration as the 47th President of the United States, leaders from business, government, philanthropy, and non-profit sectors are also gathering in Davos for the World Economic Forum 2025 edition (WEF 2025). High on the agenda, according to WEF President Børge Brende in a recent New York Times article, is fostering cooperation in areas where mutual self-interest makes collaboration possible.\n\nWhile one interpretation of last year’s electoral outcomes might suggest a retreat from cooperation, Brende argues otherwise, asserting that the results reflected frustration with incumbents rather than a rejection of global collaboration. Exhausted from conflict, global food crises, economic strain, and ever-frequent and more devastating natural disasters, voters worldwide threw out governments they blamed for inaction.\n\nBrende makes the case that “the message was clear: people are seeking new and more effective solutions to their challenges—solutions that can only emerge through cooperation.” The question is not, therefore, whether they should cooperate, but how—and on what issues.\n\nHere are three opportunities where I think leaders attending WEF 2025 in Davos can drive cooperation—not only to deliver tangible impact but to build a healthier, more equitable world that benefits everyone:\n\n1. Strengthening Global Health Security Through Immunization Programs\n\nIn a world still recovering from the aftershocks of the COVID-19 pandemic, the urgency of strengthening global health systems cannot be overstated. Programs like those facilitated by Gavi, the Vaccine Alliance, have proven to be one of the most effective tools for preventing disease outbreaks and saving lives. Immunization, after all, is the most basic yet vital health intervention—keeping kids alive and healthy while preventing unnecessary deaths from preventable diseases.\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nYet, as infectious diseases like measles and polio resurge in underserved regions, sustained investment is essential to immunize vulnerable populations and prevent future pandemics. Even in 2025, too many children die from preventable causes per UNICEF annual reporting.\n\nSince the spread of infectious diseases anywhere is a global threat, leaders in Davos should prioritize global health by committing funding to organizations like Gavi. This funding doesn’t just save lives—it strengthens health systems, prepares nations for future pandemics, and builds public trust.\n\nAhead of a pledging moment to be co-hosted by the European Commission and the Gates Foundation in March, Gavi seeks $9 billion for the next five years to immunize 500 million more children. Failing to act and deliver on this risks reversing decades of progress, leaving millions at risk, and undermining global growth and stability.\n\n2. Protecting the Amazon And Global Biodiversity\n\nProtecting the Amazon is a global imperative. As the \"lungs of the planet,\" it is nearing an irreversible tipping point due to deforestation, illegal mining, and land degradation. According to organizations like Re:wild, this vital carbon sink absorbs billions of tons of CO2 annually (roughly the amount of carbon emitted by 450 million cars burning gasoline for a whole year), stabilizing the Earth’s climate. If it reaches a tipping point, preserving other ecosystems will become far harder, accelerating global climate instability and potentially amplifying the severity of natural disasters, such as the devastating fires in California this month. In short, the Amazon is the planet’s canary in the coal mine—its health is directly tied to its survival.\n\nAt Davos, leaders have the opportunity to prioritize cooperation to protect the Amazon and other critical ecosystems, laying the groundwork for the UN’s COP30 climate talks to be held in Brazil later this year. This includes mobilizing financial resources for sustainable development, enforcing environmental protections, and empowering indigenous communities who are key stewards of these lands. To this end, President Lula has called on the private sector and philanthropy to contribute $1 billion towards this effort by COP30, given the global public benefit protecting the Amazon provides.\n\n3. Accelerating the Renewable Energy Transition In Africa\n\nWith the world facing the dual crises of climate change and energy insecurity, scaling renewable energy solutions cheaply and equitably has become one of the urgent challenges of our time to overcome. Nowhere is this need more urgent than in Africa, where nearly 600 million people still lack access to electricity, yet the potential for solar, wind, and hydropower is immense.\n\nAfrica is brimming with potential—a young, dynamic population, abundant resources, and untapped markets make it a future global engine for growth. Yet, intentional investment in seizing that potential remains insufficient.\n\nTo be clear, investing in renewable energy is also a mutually beneficial endeavor. For example, by leveraging public investment through the European Union’s Global Gateway initiative, Europe is unlocking private sector capital, opening new markets for European businesses across the continent, and reducing reliance on Russian gas and fossil fuels. And it goes without saying that supporting Africa’s sustainable growth also helps mitigate climate change, which, as seen in last year’s floods in Spain, impacts wealthy nations too.\n\nAt WEF 2025, leaders must prioritize actions that close the financing gap for renewable energy projects in Africa and other underserved regions. Governments, development banks, and corporations should support the urgent need to quadruple renewable energy capacity in Africa by 2030, aligning with global climate goals and the International Energy Agency’s recommendations while addressing energy poverty.\n\nA Call for Collaborative Leadership At WEF 2025\n\nI agree with Brende’s optimism: “The global landscape of today is less predictable and more chaotic. But it doesn’t have to be less collaborative.” In a world facing unprecedented challenges, cooperation is not just desirable—it is imperative. Leaders attending WEF 2025 in Davos have the opportunity to demonstrate that collaboration, even in turbulent times, is the key to addressing humanity’s most pressing issues.\n\nThe theme of the WEF this year is Collaboration for the Intelligent Age. Still, while I'm in Davos, I’ll be thinking about opportunities for Intelligent Collaboration Today because tackling the challenges before us—from the health of our people, our economies, and our planet—requires more than lofty rhetoric. It calls for immediate, tangible, collaborative interventions that yield real results.\n\nWith time running out short on a number of challenges as leaders gather for WEF 2025, the stakes for cooperation have never been higher.\n\nFollow me on Twitter or LinkedIn. Check out some of my other work here. \n\nMichael Sheldrick\n\nEditorial Standards\n\nForbes Accolades","summary":"The 2025 World Economic Forum in Davos presents three key opportunities for cooperation on health security, Amazon protection, and Africa's renewable energy transition.","url":"https://www.forbes.com/sites/globalcitizen/2025/01/19/wef-2025-three-opportunities-for-cooperation-in-davos/","image":"https://imageio.forbes.com/specials-images/imageserve/678d8f5beb30263c41c196f0/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-19 23:53:48","author":"Contributor,Michael Sheldrick","authors":["Contributor","Michael Sheldrick"],"language":"en","source_country":"US","sentiment":0.136},{"id":281767316,"title":"Trump inauguration brings Kid Rock, Jon Voight, more stars to nation’s capital: PHOTOS","text":"Published just in 7 Images Trump inauguration brings Kid Rock, Jon Voight, more stars to nation’s capital: PHOTOS Celebrities flocked to Washington D.C. in celebration of Donald J. Trump's Presidential Inauguration on Jan. 20. \n Start Slideshow\n\n Kid Rock performed some of his biggest hits to kick off a rally ahead of the 60th presidential inauguration, Sunday, Jan. 19, 2025, in Washington, D.C. read more AP Photo/Matt Rourke / AP Images Share\n\n Latin pop star Justin Quiles and Puerto Rican rapper Anuel AA took the stage to show their support for Trump, the \"strongest President.\" read more AP Photo/Alex Brandon / AP Images Share\n\n Jon Voight speaks before President-elect Trump arrives at a rally ahead of the 60th presidential inauguration, Sunday, Jan. 19, 2025, in Washington, D.C. read more Elizabeth Frantz/Reuters / Reuters Share\n\n UFC CEO Dana White said, \"Democracy is alive and well in this country. The people have spoke loud and clear. America wants President Trump back in the White House.\" read more Scott Olson/Getty Images / AP Images Share\n\n Lee Greenwood performed his hit \"God Bless the USA\" as President-elect Trump arrived at a rally. read more Alex Brandon/AP / AP Images Share\n\n Elon Musk was welcomed to the stage by President-elect Trump. \"We’re going to do great things here,\" Musk told the crowd. read more AP Photo/Alex Brandon / AP Images Share\n\n The Village People performed \"Y.M.C.A\" at a rally with Trump dancing alongside the band. read more AP Photo/Alex Brandon / AP Images Share\n\nPublished just in 7 Images Trump inauguration brings Kid Rock, Jon Voight, more stars to nation’s capital: PHOTOS Celebrities flocked to Washington D.C. in celebration of Donald J. Trump's Presidential Inauguration on Jan. 20. \n Start Over\n\n Share Slideshow\n Published on Published on Published on \n See More Slideshows","summary":"Celebrities flocked to Washington, D.C., in celebration of Donald Trump&apos;s presidential inauguration on Jan. 20.","url":"https://www.foxnews.com/entertainment/celebrities-attend-donald-trump-inauguration-celebrations-washington-d-c","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/1200/675/kid-rock-jon-voight.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-19 23:53:01","author":"Christina Dugan Ramirez","authors":["Christina Dugan Ramirez"],"language":"en","category":"politics","source_country":"us","sentiment":0.344},{"id":281769080,"title":"Chloe Kim, Maddie Mastro Progress Women’s Halfpipe With Historic Laax Open","text":"Share to Facebook\n\nShare to Twitter\n\nShare to Linkedin\n\nChloe Kim competes in the Women's Snowboard Halfpipe Semi Finals during the Laax Open, part of the ... [+] FIS Snowboard World Cup 2025, on January 17, 2025 in Laax, Switzerland.\nGetty Images\n\nIt was a historic women’s halfpipe competition at the Laax Open in Switzerland this weekend, and leading the charge were—unsurprisingly—two of the discipline’s longtime standard-bearers: Chloe Kim and Maddie Mastro.\n\nKim and Mastro may each be only 24 years old, but in the women’s halfpipe field, they’re seasoned vets. And they’ve both solidified their places in the sport’s legacy.\n\nAt 17, Kim became the youngest woman to win an Olympic snowboarding gold medal at the Pyeongchang 2018 Games; at Beijing 2022, she became the first woman to win two gold medals in halfpipe. She was the first woman to land back-to-back 1080s in competition, and at X Games Aspen 2024, she became the first to land a 1260 in competition.\n\nForbesChloe Kim Lands First 1260 In Women’s Halfpipe Competition At X GamesBy Michelle Bruton\n\nMastro has made her own innovative contributions to the sport. She was the first to land the double crippler (a frontside double backflip with no spin) in competition.\n\nAnd in the women’s halfpipe final at this weekend’s Laax Open, where Kim and Mastro earned gold and silver, respectively, they added more history to their résumés, becoming the first women to land a double cork 1080 in competition.\n\nMORE FOR YOU\n\nTikTok Ban Live Updates: Trump Says ‘TikTok Is Back’ In Victory Rally As App Restores Access\n\nTikTok Ban: Apple Issues ‘Unprecedented’ Response For iPhone Users\n\nDonald Trump Launches $TRUMP Meme Coin—Token Hits $9 Billion Market Cap\n\nKim’s switch frontside double 1080 came in her first run, which scored 96.50 and ultimately stood as the top score of the contest.\n\nIn her second run, Mastro landed the first frontside double 1080 in women’s competition as well as her double crippler, becoming the first woman to land two double inversions in one competition run.\n\nSixteen-year-old Gaon Choi of South Korea rounded out the women’s podium. Choi has cited Kim as her inspiration to begin snowboarding.\n\nJapanese riders finished fourth through seventh—in order, Mitsuki Ono, who is currently ranked first in the world; Rise Kudo; Sena Tomita and Sara Shimizu. Spain’s Queralt Castellet finished in eighth.\n\nAs the road to Milano-Cortina 2026 gets underway, Mastro and Kim are ranked second and fourth in the world, respectively, earning valuable quota points for the U.S. as well as themselves.\n\nWomen’s halfpipe snowboarding has never been more exciting, and Kim and Mastro are setting the tone for the rest of the field. The two U.S. Snowboard Team members will carry their momentum into next week’s X Games Aspen.\n\nFollow me on Twitter or LinkedIn. \n\nMichelle Bruton\n\nEditorial Standards\n\nForbes Accolades","summary":"U.S. women's halfpipe snowboarders Chloe Kim and Maddie Mastro made history at the Laax Open in Switzerland this weekend.","url":"https://www.forbes.com/sites/michellebruton/2025/01/19/chloe-kim-maddie-mastro-progress-womens-halfpipe-with-historic-laax-open/","image":"https://imageio.forbes.com/specials-images/imageserve/678d8953071965d2a7d07084/0x0.jpg?format=jpg&crop=2264,1272,x0,y0,safe&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-19 23:52:29","author":"Contributor,Michelle Bruton","authors":["Contributor","Michelle Bruton"],"language":"en","source_country":"US","sentiment":0.369},{"id":281764380,"title":"Sylvester Stallone warns fans fake ‘Godfather’ movie trailer using AI is ‘not to be taken seriously’","text":"Sylvester Stallone is warning his fans after a fake trailer for “The Godfather Part 4” went viral online. \n\nStallone, 78, took to social media to comment on the fan-made video creation. \n\n“What is going on? Lol this is definitely not to be taken seriously!” the Hollywood actor laughed and wrote on Instagram. His post included two photos of Stallone, one of him smoking a cigar and the second of the actor holding a gun. \n\nThe creator of the fake “Godfather 4” video trailer sent a message to viewers explaining how it was made.\n\n“Please note that this video is a concept trailer created solely for artistic and entertainment purposes. I have meticulously incorporated various effects, sound design, AI technologies, movie analytics, and other elements to bring my vision to life.”\n\nFans were quick to react on social media, and supported the idea of Stallone starring in another “Godfather” movie. \n\n“Actually it [could] be a great idea, why not ???” one comment read. \n\nAnother fan wrote, “I looked [too] fast and got real excited.”\n\n“That would be the greatest news!!!! Perfect!!!! Let it [happen],” a social media user suggested. \n\nWhile the famous actor is best known for starring in the “Rocky,” “Rambo” and “Creed” movies, he was previously denied the opportunity to be an extra in the famous wedding scene in “The Godfather.”\n\n“I went to Paramount, and said, ‘Can I be an extra in the wedding scene?’,” he told Empire Magazine during an interview in 2022. \n\n“They said, ‘Yeah, we don’t know if you’re the type of guy.’ I go, ‘I’m not the type? To play in the background, hiding behind a f–king wedding cake?’”\n\nDespite that rejection, Stallone went on to portray a character involved with the Mafia in Taylor Sheridan’s series “Tulsa King.”\n\nStallone’s fake “Godfather” trailer comes as he was named one of three legendary stars tapped by President-elect Donald Trump to be Hollywood ambassadors. \n\nTrump announced the special envoys on Thursday with the purpose of promoting business in Hollywood.\n\n“It is my honor to announce Jon Voight, Mel Gibson, and Sylvester Stallone, to be Special Ambassadors to a great but very troubled place, Hollywood, California,” Trump wrote on his Truth Social platform. \n\n“They will serve as Special Envoys to me for the purpose of bringing Hollywood, which has lost much business over the last four years to Foreign Countries,” he wrote in part. Trump added, “These three very talented people will be my eyes and ears, and I will get done what they suggest. It will again be, like The United States of America itself, The Golden Age of Hollywood!”\n\nStallone called Trump the “second George Washington” while introducing the 47th president at the America First Policy Institute Gala in November.“We are in the presence of a really mythical character. Nobody in the world could have pulled off what he pulled off, so I’m in awe,” the actor said.\n\n“When George Washington defended his country, he had no idea that he was going to change the world, because, without him, you could imagine what the world would look like. Guess what? We’ve got the second George Washington. Congratulations!”\n\nFox News Digital’s Tracy Wright contributed to this report.","summary":"Sylvester Stallone is warning his fans after a fake trailer for \"The Godfather Part 4\" went viral online. ","url":"https://nypost.com/2025/01/19/entertainment/sylvester-stallone-warns-fans-fake-godfather-movie-trailer-using-ai-is-not-to-be-taken-seriously/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/2024-palm-beach-florida-president-96980772.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/yCek6Lct-RyIcpnTz.mp4","publish_date":"2025-01-19 23:51:29","author":"Fox News","authors":["Fox News"],"language":"en","source_country":"us","sentiment":0.228},{"id":281769050,"title":"TikTok Resumes Services Following Trump’s Pledge to Lift Ban with Executive Order","text":"TikTok has confirmed it’s working to restore the app while thanking President-elect Trump for intervening as the social media platform shows the first signs of recovery following its dramatic shutdown.\n\nIn an official statement, the social media app said: ‘In agreement with our service providers, TikTok is in the process of restoring service.’\n\nThe company specifically credited Trump for providing ‘necessary clarity and assurance’ to service providers that they won’t face penalties for keeping the platform available to its American user base.\n\n‘TikTok is in the process of restoring service,’ the statement read. ‘We thank President Trump for providing the necessary clarity and assurance to our service providers that they will face no penalties providing TikTok to over 170 million Americans and allowing over 7 million small businesses to thrive.’\n\n‘It’s a strong stand for the First Amendment and against arbitrary censorship. We will work with President Trump on a long-term solution that keeps TikTok in the United States.’\n\nTikTok appears to be ‘back online’ after some users report regaining access to the social media platform – with limited functionality – after the app went dark early Sunday.\n\nSome users report now being able to view their own profiles while they are still unable to upload new content.\n\nThe exact number of users who have regained access is unclear. \n\nScott Sutton, CEO of Later Media, confirmed the partial restoration on X (formerly Twitter): ‘TikTok is back up and working on desktop! Seems services are slowly coming back online.’\n\nMinutes later, Sutton noted the limitation of the app.\n\n‘TikTok app access is back, but no content other than mine loading, and all engagement history on posts is missing.’\n\nThe development comes after the popular social media app went dark for 170 million Americans after the Supreme Court allowed a nationwide ban to take effect early Sunday. \n\nPresident-elect Donald Trump offered a hope to devastated TikTok users, announcing he will sign an executive order on Monday to delay the ban on the popular app – just hours after it went dark for millions of Americans. \n\nThe ban comes after Congress passed legislation requiring Chinese parent company ByteDance to sell its stakes by January 19, 2025.\n\nWith no deal materializing, the platform’s fate now hangs in the balance, affecting some 170 million American users.\n\nThe Supreme Court’s ruling affirmed that the ban does not violate users’ First Amendment rights.\n\nBut skeptical users are now accusing the shutdown of being a calculated political ‘stunt’ to make Trump ‘look good.’\n\nThe dramatic restoration announcement has sparked fierce backlash on social media.\n\n‘This is a stunt and was all along,’ one user wrote.\n\n‘This will obviously work as well because I genuinely think some people aren’t actually informed and didn’t know Trump was planning to do this since last week.’\n\nUsers continued questioning whether the platform-wide blackout was orchestrated to boost Trump’s image.\n\nOne wrote: ‘This was all a stunt to make Trump look good.’\n\n‘So it really was all a ploy for his “I saved the day moment,”‘ added another.\n\n The platform has become a cultural phenomenon and career launcher for countless content creators.\n\nTikTok influencers across the US have filmed themselves breaking down in hysteria as the Supreme Court-backed ban took effect, with many mourning the loss of their platform and livelihood. \n\nThe app went dark for 170 million Americans after the Supreme Court allowed a nationwide ban to take effect early Sunday.\n\nThe shutdown has spurred waves of emotional reactions online, with many influencers sharing tearful videos of them breaking down while mourning the loss of their careers and connections to millions of followers. \n\nViral TikTok sensation Alix Earle, who boasts 7.2 million followers, shared an emotional video as she grappled with the platform’s impending shutdown.\n\n‘I can’t sleep, I’m so freaked out about this,’ a watery-eyed Earle told the camera. ‘I’m just so sad, just thinking like all of the memories just going away.\n\nFormer Goldman Sachs employee Danielle Pheloung, 27, who left her lucrative banking career to become a full-time content creator, posted a video joking about having to call her old employer.\n\nThe New York-based influencer, with a following of over 430k, built her empire sharing office fashion videos and early morning routines.\n\nAs the ban took effect, Pheloung took to Instagram to document her evening, sharing a series of increasingly anxious posts. ‘This is so eerie,’ she wrote.\n\nControversial Trans activist Dylan Mulvaney shared their own emotional farewell to the platform that helped launch her career.\n\nThey posted a heartfelt message about how TikTok enabled them to express their authentic self.\n\nMulvaney emphasized how the platform had given them the power to take control of their own narrative and career.\n\n‘Sharing this here since we can’t watch it on TikTok now,’ they wrote on Instagram.\n\n‘Welcome to MAGAland: Trump’s Second 100 Days’ is the new politics podcast bringing you the latest news and gossip from Trump insiders. New episodes every Monday, Wednesday and Friday. Follow wherever you get your podcasts now.","summary":"Internewscast Journal\n\nInternewscast\n\n\nTikTok has confirmed it&#8217;s working to restore the app while thanking President-elect&#8230;\n\n\nThis Post: TikTok Resumes Services Following Trump&#8217;s Pledge to Lift Ban with Executive Order first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/tiktok-resumes-services-following-trumps-pledge-to-lift-ban-with-executive-order/","image":"https://i.dailymail.co.uk/1s/2025/01/19/17/94262019-14302369-image-a-1_1737307496772.jpg","video":null,"publish_date":"2025-01-19 23:50:26","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.005},{"id":281764388,"title":"Gov. Hochul orders flags raised to full-staff for Trump’s inauguration in goodwill gesture to new administration","text":"Gov. Kathy Hochul has ordered all flags in the State of New York to be raised to full-staff for Donald Trump’s inauguration as the 47th US president.\n\nFlags are currently flying at half-staff across the nation to mark the death of former President Jimmy Carter, who died Dec. 29 at the age of 100.\n\nPer American flag code, the Stars and Stripes are lowered on “all federal buildings, grounds and naval vessels” nationwide to mark the death of a sitting or former president. \n\nHowever, Hochul is bucking convention, at least temporarily.\n\n“Tomorrow, we are all Americans as we observe the centuries-old traditions of Inauguration Day,” Hochul said in a statement to The Post.\n\n“For that reason, I am directing flags to fly at full staff throughout the State of New York on January 20 and return to half staff to honor the late President Carter on January 21,” she added.\n\n“Regardless of your political views, the American tradition of the peaceful transition of power is something to celebrate.”\n\nStaten Island Borough President Vito Fossella expressed similar sentiment in a letter he penned to Hochul Sunday obtained by The Post.\n\n“I am writing to respectfully request that all flags across the state of New York be raised in honor of President Trump’s inauguration,” his note reads in part.\n\n“This gesture would serve as a symbol of unity and respect for the Office of the President, regardless of political affiliation. It is important to recognize an honor of the Democratic process and the peaceful transition of power that is cornerstone of our nation’s values.”\n\nHochul is joining liberal Democratic governors including Gavin Newsom of California and Jared Polis of Colorado, who have both ordered flags in their respective states flown at full mast for the duration of Monday’s inauguration.\n\nLast week, House Speaker Mike Johnson similarly ordered all US flags at the Capitol to fly at their full height when Trump takes the oath of office.\n\n“On January 20th, the flags at the Capitol will fly at full-staff to celebrate our country coming together behind the inauguration” of the president-elect, Johnson (R-La.) said in a statement.\n\n“The flags will be lowered back to half-staff the following day to continue honoring President Jimmy Carter,” he added.\n\nRepublican governors around the country followed suit, such as GOP Texas Gov. Greg Abbott, who announced American flags at government outposts in the Lone Star State would be flown full-staff in recognition of the new president being sworn in.\n\nTwenty-eight states in all will have their flags raised on Jan. 20 to honor the inauguration.\n\nTrump himself had expressed consternation that flags would be lowered on Inauguration Day, hitting out at social media liberals on Truth Social for being “giddy” over the implication that the nation would be in mourning for his assumption of office.\n\n“Nobody wants to see this, and no American can be happy about it. Let’s see how it plays out. MAKE AMERICA GREAT AGAIN!” Trump wrote Jan. 3.","summary":"Gov. Kathy Hochul has ordered all flags in the State of New York to be raised to full-staff for Donald Trump's inauguration as the 47th US president.","url":"https://nypost.com/2025/01/19/us-news/gov-hochul-orders-flags-raised-to-full-staff-for-trumps-inauguration-in-goodwill-gesture-to-new-administration/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/01/president-elect-donald-trump-speaks-96983198.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-01-19 23:49:20","author":"Carl Campanile,Chris Nesi","authors":["Carl Campanile","Chris Nesi"],"language":"en","category":"politics","source_country":"us","sentiment":-0.059},{"id":281767144,"title":"Trump promises ‘brand new day’, harsh immigration limits at pre-inauguration victory rally","text":"US president-elect Donald Trump told thousands of roaring supporters on Sunday that he would impose severe limits on immigration on his first day in office, vowing to swiftly fulfil the central promise of his presidential campaign on Sunday at a rally inside a packed Washington arena a day before he returns to power.\n“By the time the sun sets tomorrow, the invasion of our country will have come to a halt,” he said to cheers at a “Make America Great Again Victory Rally” at the Capital One Arena.\nTrump repeated his campaign pledge to launch the largest deportation effort in US history, which would remove millions of immigrants. An operation of that scale, however, would likely take years and be hugely costly.\nThe rally resembled the freewheeling campaign speeches that have been a Trump staple since his first White House run in 2016, with the former and future president delivering a mix of boasts, false claims and sweeping promises to the delight of the crowd.\n“This is the greatest political movement in American history, and 75 days ago, we achieved the most epic political victory our country has ever seen,” he said. “Starting tomorrow, I will act with historic speed of strength and fix every single crisis facing our country.”\nThe event marked his first major address in Washington since his speech on January 6, 2021, that preceded the storming of the US Capitol by an angry mob of his supporters. Trump has said he will pardon many of the more than 1,500 people convicted or charged in connection with the attack.\nTrump’s rally, along with his inaugural address on Monday, could preview the tone he plans to adopt during his second White House term. In recent weeks, Trump has bewildered foreign allies by musing aloud about taking over Greenland and the Panama Canal and turning Canada into a US state.\nA source familiar with the planning said border security will figure prominently in Trump’s first executive orders on Monday, which are likely to classify drug cartels as “foreign terrorist organisations”, declare an emergency at the US-Mexico border and move towards reinstatement of the “Remain in Mexico” policy which forces non-Mexican asylum seekers to wait in Mexico for their US court dates.\n\nTrump said he would “get radical woke ideologies the hell out of our military” and order the military to construct a missile defence shield over the US, though he has yet to offer details on how to carry it out.\nHe also promised to reverse the “over-classification” of government documents, a seeming reference to his federal indictment for retaining classified papers after leaving office. That case, along with a separate federal indictment for plotting to overturn the 2020 election, was dropped by the Justice Department after Trump won the election in November.\nThe indoor hockey and basketball venue will also host some of Monday’s inauguration festivities after forecasts of bitter cold prompted officials to move the planned outdoor events inside.\nTrump also pledged to release classified documents relating to the assassinations of former US President John F Kennedy, his brother Robert Kennedy and civil rights leader Martin Luther King Jnr.\nEarlier on Sunday, Trump had breakfast with Republican US senators at Blair House, the guest quarters across from the White House. John Cornyn, Susan Collins, Ted Cruz, Rick Scott and Tim Scott were among the guests seen leaving the event.\nHe later placed a wreath at the Tomb of the Unknown Soldier at Arlington National Cemetery outside Washington. Trump saluted the tomb as a military bugler played Taps.\nAhead of the event, Trump’s fans, many dressed in the campaign’s trademark red jackets and Maga (Make America Great Again) hats, waited in a cold, driving rain along several downtown Washington blocks, some chanting “USA! USA!”\n\nVal Tordjman, 58, had travelled across the country from Denver with tickets to watch the inauguration. When he heard the ceremony was being moved inside, notably cutting the size of the in-person audience, he said: “I felt like crying.”\nTordjman said he planned to spend the night on the street next to the arena, despite temperatures forecast to plunge to around -7 degrees Celsius (19 degrees Fahrenheit). He said he had yet to see Trump in person.\n“This is a once in a lifetime opportunity,” he said.\nLarge swathes of the streets around the US Capitol and White House have been blocked off by steel fences since last week, and police were visible throughout the city.\nTikTok CEO Chew Shou Zi planned to attend the rally, hours after the company announced it was restoring its service thanks to Trump’s promise to delay a US ban that took effect on Sunday. Chew is also expected to join other tech executives at Trump’s inauguration on Monday, including the world’s richest man, Elon Musk, a close Trump confidant who made a brief appearance on stage with Trump.\nTrump took credit for bringing TikTok back online and said the US would do a “joint venture” to save the app alongside bidders to buy the company.\nJoe Biden, meanwhile, made his last official trip as president on Sunday to Charleston, South Carolina, to mark Martin Luther King Jnr Day, which is also on Monday. He attended services and spoke about King’s legacy at Royal Missionary Baptist Church, while also urging despondent fellow Democrats not to give up hope.\nThe inauguration is expected to start at for noon local time on Monday, when Trump will take the presidential oath of office inside the rotunda of the Capitol building, after the cold weather prompted organisers to move the ceremony indoors. Around 25,000 police will be on hand to provide security.","summary":"‘By the time the sun sets tomorrow, the invasion of our country will have come to a halt,’ he said to a cheering crowd at a Washington arena.","url":"https://www.scmp.com/news/world/united-states-canada/article/3295407/trump-promises-brand-new-day-harsh-immigration-limits-pre-inauguration-victory-rally","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/20/3a43ca6b-5d07-4a05-9e70-ffe91c0aaa41_7d642f73.jpg","video":null,"publish_date":"2025-01-19 23:47:21","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":0.017},{"id":281769700,"title":"WATCH: Lindsey Graham snaps back at network anchor, says she should ‘worry about reporting the news fairly’","text":"Republican South Carolina Sen. Lindsey Graham snapped back at CBS host Margaret Brennan on Sunday over his defense of FBI director nominee Kash Patel, telling her she needed to “worry about reporting the news fairly.”\n\nSince President-elect Donald Trump’s nomination of Patel, Democrats have pushed back against the nominee while Republicans have raised concerns over the FBI’s past leadership. On “Face the Nation,” Brennan asked Graham about former Attorney General Bill Barr’s claim in his memoir that Patel “would never be able to command the respect necessary to run the day-to-day operations of the Bureau.”\n\nWhile Graham disregarded Barr’s claim, Brennan continued to push her point and highlight other officials who support Patel. However, Graham pushed back, pointing out how the CBS host neglected to ask him about the “Russia hoax” Patel “exposed,” before attempting to pivot to the Israel-Hamas war.\n\n“Lindsey Graham, this is a far cry from the question about Kash Patel,” Brennan said. “You took me all the way to Israel from Kash Patel. Are you committing to vote for him no matter what?”\n\n“I won’t say no matter what,” Graham responded. “Yes, I am ready to vote for Kash Patel because you will never ask me the role he played in exposing the darkest moment of the FBI since J. Edgar Herbert. That’s why I trust him.”\n\nBrennan hit back one last time, telling the senator to, “Ask him about going after journalists, which he’s also said. I’m interested in the answer to that.”\n\n“Yeah, I’m sure Democratic friends will ask him,” Graham said. “You shouldn’t worry about Kash Patel. You should worry about reporting the news fairly, which you don’t do when it comes to everything Trump.”\n\nDuring Trump’s first administration, Patel served as chief of staff to the secretary of defense. During his time, he voiced sharp criticism of Robert Mueller’s investigation into alleged “Russian interference” in the 2016 presidential election, which was ultimately found to be a distraction.\n\nWhile legacy media pundits and other political guests continuously hyped claims that Trump colluded with the Russian government to defeat then-Democratic presidential candidate Hillary Clinton, the Steele Dossier, which was used as evidence, was later discredited and found to have been opposition research funded by Clinton’s campaign.\n\nPatel’s hearing before Senate lawmakers is expected to take place soon, however, no date has been scheduled as of Sunday.\n\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].","summary":"'Which you don't do when it comes to everything Trump'","url":"https://www.wnd.com/2025/01/watch-lindsey-graham-snaps-back-at-network-anchor-says-she-should-worry-about-reporting-the-news-fairly/","image":"https://www.wnd.com/wp-content/uploads/2025/01/lindsey-graham-20250119-jpg.jpg","video":null,"publish_date":"2025-01-19 23:45:50","author":"Daily Caller News Foundation","authors":["Daily Caller News Foundation"],"language":"en","source_country":"us","sentiment":-0.208},{"id":281764834,"title":"Apple CEO vows to make ‘massive investment’ in US — Trump","text":"WASHINGTON, January 20. /TASS/. Apple CEO Tim Cook promised that his company will make \"massive investments\" to the US economy, US President-elect Donald Trump said.\n\n\"Today I spoke with Tim Cook of Apple. He said that they are going to make a massive investment to the United States because of our big election,\" he said, speaking during a rally at the Capital One arena in Washington.\n\nPreviously, Trump has repeatedly said that he will make large business to bring back its production to the United States and create new jobs inside the country.","summary":"\"Today I spoke with Tim Cook of Apple. He said that they are going to make a massive investment to the United States because of our big election,\" US president-elect said","url":"https://tass.com/world/1901477","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-19 23:45:43","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"RU","sentiment":-0.304},{"id":281763418,"title":"Donald Trump to assume office as President of the United States","text":"WASHINGTON, January 20. /TASS/. The inauguration of US President-elect Donald Trump and Vice President-elect James David Vance will take place in Washington. They will take the oath of allegiance to the Constitution and the country.\n\nThis ceremony, which will become the second for Trump, who served as the US President in 2017-2021, will be noticeably different from previous ones. Contrary to tradition, the Republican invited heads of several countries to attend; some of the accepted this invitation. Many events were relocated indoors due to cold weather.\n\nIn particular, Trump and Vance will take their oath not before the Congress building, as was initially planned, but in its central hall, in the rotunda, which can accommodate over 1,000 people. Trump will deliver his speech there. Last time, a presidential inauguration took place in this hall in 1985, before Ronald Reagan’s second presidential term.\n\nThe event will be live streamed from the Capital One Arena sports center. The traditional parade will also take place there instead of the Pennsylvania Avenue, as was planned earlier. Trump promised to join the audience at the center after taking the oath.","summary":"Contrary to tradition, the Republican invited heads of several countries to attend","url":"https://tass.com/world/1901475","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-19 23:44:37","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":0.456},{"id":281766842,"title":"Another Terrible Hostage Deal","text":"Joe Biden and Donald Trump both claim credit for Israel-Hamas ceasefire deal, which began to be implemented today. I suspect it has more to do with calculations made by the Israelis and Hamas themselves. But in truth, no one deserves credit, because the deal is terrible. The Israelis will release some 1900 terrorists and captured Hamas members in exchange for 33 mostly civilian Israeli hostages (some of whom are not even alive). Many of the terrorists scheduled for release have committed horrific atrocities. Like previous hostage deals with terrorists, this predictably incentivizes future terrorism. You get more of what you reward. Plus, the released terrorists are likely to kill again, as has happened with many of those released in previous deals. \n\nIt seems neither the Israeli nor the American backers of this deal have learned the terrible lessons of previous such exchanges. I summarized them in an October 2023 post, which also referenced a 2011 piece, in which I was critiqued the Shalit deal, which was a key factor in leading to the October 7, 2023 attack that started the current war:\n\nThe horrific Hamas terrorist attacks against Israel revealed a variety of weaknesses in Israel's security policies, and perhaps those of some other Western nations, too. But one that has not gotten as much attention as it deserves is the folly of hostage deals with terrorists. Hamas leader Yahya Sinwar, the likely mastermind of the [October] attacks, was one of 1027 Palestinian terrorist prisoners released by Israel in 2011, in exchange for a captured Israeli soldier Gilad Shalit. And one of Hamas's motives for the attack was to use the captured hostages to secure the release of other Palestinian terrorists held by Israel… At the time of the 2011 agreement, Israeli Prime Minister Benjamin Netanyahu's government was widely praised for demonstrating how much it values the lives of its people. I was one of the relatively few critics of the deal…. While it seems I was right to predict that the deal would cost far more innocent lives than it saved, I had no idea of the enormous extent to which this has turned out to be true. With well over 1000 dead, the terrorist attack in which Sinwar played a key role is by far the worst in Israel's history, and one of the worst in the entire history of the world. It is also the biggest anti-Semitic massacre since the Holocaust…. Simple Economics 101 says you get more of the kinds of activities you reward. If you reward hostage-taking, you will predictably incentivize more hostage-taking. Plus, the terrorists you release are themselves likely to go out and commit more acts of terrorism - as Yahya Sinwar did. I hope this time the lesson will finally be learned. But I fear it will not….\n\nYahya Sinwar was ultimately killed by Israeli forces last year, but not before he masterminded the October 7 attacks.\n\nSadly, it seems I was right to worry that the lessons of the Shalit deal and other previous failures would not be learned, even after October 7. The present deal shows it.\n\nAnd, admittedly, this is not a simple matter of the Israeli government yielding to the US. Polls indicate the deal is highly popular in Israel, backed by a large majority of public opinion. That is probably the main reason why the government agreed to it.\n\nI wrote about the problematic political dynamics of hostage deals in my 2023 post:\n\n[H]ostages currently held by terrorists are very visible to the public, and politicians like [Israeli Prime Minister Bibi] Netanyahu have strong incentives to listen to the anguished pleas of their family and friends. It seems cruel not to! By contrast, we cannot and do not know the identities of the future hostages whose seizure we incentivize through our deal. Nor can we know the identities of future victims of terrorists released in the deal. In 2011, no one could know the identities of the future victims of Yahya Sinwar. Their families were in no position to lobby government officials to save them.\n\nIn the 2023 post, I also recognize that people might dismiss my view because it is not my friends and relatives who are being held hostage:\n\nI realize that… some will reject the above logic on the grounds that I can only say these things because it isn't me or my family who are being held as hostages by Hamas. If it were, maybe I would think differently. It may well be so. I have never had a friend or family member taken hostage and cannot know what I would do if I did. I have dealt with a number of death threats (most due to my advocacy of migration rights). I chose not to give in…. But the small risk I took was utterly insignificant compared to that endured by hostages held by groups like Hamas. Still, I would ask those inclined to give in to such emotional considerations to remember that the future hostages seized as a result of the deals we make today also have families who will suffer terrible anguish. The same goes for the families of future victims of terrorists released under those deals. We should strive to reduce the amount of such suffering, not increase it. And that means remembering Econ 101, and learning to say \"no\" - as the Israelis should have done in 2011.\n\nEitan Fuld, whose brother Avi was killed by one of the terrorists scheduled to be released in today's deal gets the point:\n\n\"The release of Ari's murderer hurts,\" he said in a statement. \"My big problem and for all of us is that of the coming victims and the next families that to our regret will join the bereaved families due to this bad deal.\"\n\nI realize that my take on this deal aligns with that of far-right Israeli parties who voted against it. I think these parties and and much of their agenda are awful. I have, for example, critiqued their and Netanyahu's plans to undermine judicial review in Israel. I am likewise (to understate the point) no fan of their repressive and discriminatory policies respecting West Bank Palestinians and Israel's Arab minority. But a stopped clock is right twice per day, and this is such a moment.\n\nI am more happy to be in alignment with libertarian-leaning conservative Boston Globe columnist Jeff Jacoby, who has criticized the deal on similar grounds.\n\nWill Israel never learn? On numerous occasions in the past, Israeli governments have agreed to similarly lopsided exchanges with terrorist organizations like Hamas, Hezbollah, and the Palestine Liberation Organization. Time and again, Israel has paid for the freedom of a few hostages or prisoners of war, or sometimes just their remains, by releasing hundreds of violent prisoners, many of them responsible for the deaths of civilians. Time and again, the newly freed terrorists have picked up where they left off.\n\nAs noted above and in my earlier posts on these issues, the Israelis aren't alone in their failure to learn this lesson. Other Western governments, including our own, have all too often made the same types of mistakes.","summary":"The Israel-Hamas ceasefire deal that went into effect today exchanges hundreds of terrorists for 33 Israeli hostages. It will predictably incentivize more hostage-taking and terrorism.","url":"https://reason.com/volokh/2025/01/19/another-terrible-hostage-deal/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2023/10/Yahya-Sinwar.jpg","video":null,"publish_date":"2025-01-19 23:41:41","author":"Ilya Somin,Joe Lancaster","authors":["Ilya Somin","Joe Lancaster"],"language":"en","source_country":"us","sentiment":-0.343},{"id":281767320,"title":"Trump vows the 'biggest first week' in presidential history during Victory Rally: 'Extremely happy'","text":"President-elect Donald Trump outlined his plans for the opening days of his administration during his Victory Rally in Washington, D.C., on Sunday, vowing an onslaught of executive orders that will make voters \"extremely happy.\" \"You're going to see something tomorrow. You're going to see executive orders that are going to make you extremely happy. Lots of them, lots of them. We have to set our country on a proper course. By the time the sun sets tomorrow evening, the invasion of our borders will have come to a halt and all the illegal border trespassers will, in some form or another, be on their way back home,\" Trump said during his rally on Sunday. Fox News Digital exclusively reported earlier Sunday that Trump will sign more than 200 executive actions on his first day in office. \"Every radical and foolish executive order of the Biden administration will be repealed within hours of when I take the oath of office,\" Trump said. \"You're going to have a lot of fun watching television tomorrow.\" TRUMP FIRES UP SUPPORTERS WITH ONE LAST PRE-INAUGURATION RALLY Trump vowed that he will make \"remaining records relating to the assassinations of President John F. Kennedy, his brother Robert Kennedy, as well as Doctor Martin Luther King Jr\" publicly available. He also vowed to start constructing the \"Great Iron Dome missile defense shield,\" as well as to get North Carolina back on its feet after hurricanes ripped through the state last year. As for January 6 protesters who were charged or convicted, Trump hinted they will be \"very, very happy.\" TRUMP TO TAKE MORE THAN 200 EXECUTIVE ACTIONS ON DAY ONE \"The American people have given us their trust, and in return, we're going to give them the best first day, the biggest first week, and the most extraordinary first 100 days of any presidency in American history. To implement this historic agenda, I have assembled an all-star cabinet of patriots and visionary reformers for America, and together we will win, win, win for America,\" he said before giving a shout out to his cabinet picks. Trump's speech also focused on the immigration crisis that throttled the nation, vowing again that his administration will carry out a massive deportation operation. \"Very soon we'll begin the largest deportation operation in American history. Larger, even larger than President, Dwight Eisenhower, who has the record right now,\" he said. \"And we're going to end the Biden war and American energy and unleash our energy resources to quickly defeat inflation and achieve the lowest cost of energy and electricity on Earth. And we're going to be using our emergency powers to allow countries and entrepreneurs and people with a lot of money to build big plants,\" he said. TRUMP WINS 2024 PRESIDENTIAL ELECTION Trump's speech is his last as president-elect ahead of taking the oath of office for the second time and returning to the Oval Office on Monday. A bevy of longtime high-profile Trump supporters joined Trump at the rally to deliver remarks or perform, including musicians Kid Rock and Lee Greenwood, as well as UFC CEO Dana White, tech billionaire Elon Musk and actor Jon Voight. \"What an honor. What an honor it is for me to be up here in front of you. Great men and women who've all come here to celebrate the greatest win of all time. The greatest of all time. The victory we were all fighting for,\" Voight said from the Capital One Arena on Sunday afternoon ahead of Trump. \"To save our country, our democracy. And I'm so grateful that I'm able to say that Donald J. Trump is the 47th president of the United States of America. And now he will make America thrive again. He will make America great again, safer again. And we the people will honor our flag again,\" he continued. Trump recently announced Voight will serve as a special ambassador \"to a great but very troubled place, Hollywood, California.\" Trump also brushed off President Biden taking victory for securing the hostage and ceasefire deal between Israel and Hamas last week. Hamas began releasing hostages on Sunday ahead of Trump's rally. HIGHLIGHTS FROM PRESIDENT-ELECT DONALD TRUMP'S 1ST INAUGURATION DAY; WHAT TO EXPECT FROM MONDAY \"I'm glad to report that the first hostages have just been released. And who knows what's going to happen. I know that Biden thinks that they made the deal,\" Trump said while supporters booed Biden's name. Biden took credit for inking the cease fire deal in his opening remarks of his final address to the nation last week. Credit for reaching the agreement, however, was bolstered by the incoming Trump administration, according to sources who told Fox Digital that a recent meeting between Trump's incoming Middle East envoy Steve Witkoff and Israeli Prime Minister Benjamin Netanyahu reportedly played a pivotal role in the deal. Trump thanked Witkoff for his efforts to help secure the deal during the rally, while arguing war would not have broken out in the Middle East if he had been president. CLICK HERE TO GET THE FOX NEWS APP Trump wrapped up his speech vowing to Make America Great Again – noting \"it all starts tomorrow\" after his inaugration. \"We put America first, and it all starts tomorrow. When I raise my hand or they vote to be sworn as your. We'll be sworn in tomorrow. We're all going to be sworn in together. That's the way I look at it,\" he said. Fox News Digital's Brooke Singman contributed to this report.","summary":"President-elect Donald Trump held his Victory Rally in Washington, D.C., on Sunday evening ahead of being sworn-in as the 47th president of the United States on Sunday.","url":"https://www.foxnews.com/politics/trump-vows-biggest-first-week-presidential-history-during-victory-rally-extremely-happy","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/donald-trump-presidential-inauguration-washington-dc_84.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-19 23:41:23","author":"Emma Colton","authors":["Emma Colton"],"language":"en","category":"politics","source_country":"us","sentiment":0.02}]}