{"offset":0,"number":50,"available":11261,"news":[{"id":274066486,"title":"CNN's Harry Enten Has Some More Pro-Trump Data That's Going to Upset Dems, RINOs","text":"Not only did President-elect Donald Trump handily win the election on Nov. 5, he also won the popular vote with over 77 million votes. \n\nNow on top of that, most Americans are also approving of his transition moves. This is despite the efforts of many in the media/many Democrats trying to tank his nominees. \n\nIt seems once again, just like with the election, Americans are tuning out the attack-dog media, and even CNN has to admit it. \n\nCNN's senior data analyst Harry Enten laid out how completely Trump has won his party, including that almost all the GOP members who voted to impeach Trump are now themselves gone, while Trump has triumphed. \"It's Trump's party, and his GOP opponents can cry if they want to,\" Enten said, borrowing from Lesley Gore's famous song. \n\n\"They're adios amigos, goodbye!\" Enten smiled, waving. That's hilarious and he says it with such enthusiasm it makes me wonder about who he supports. He also thinks this is very positive for potential legislation. \n\n\"He should be able to ram through legislation,\" he said. I think that he's right about Trump having more support now; plus, with the voters pushing, it's going to be harder for GOP members who might want to stand in his way of getting things done, although there still seem to be those who don't want to get things done there in Congress. But I think if everyone sticks to their guns, they can get things done despite any resistance. \n\nEnten pointed out how 96 percent of GOP voters were approving of the transition moves by Trump. It's hard to get more than that. But it's indicative of how much the people want action — they don't want the same old, same old bureaucratic nonsense. They want to clean house. That's why there's such an embrace of things like DOGE. \n\nREAD MORE: CNN's Harry Enten Explains Just How Historic Trump's Win Is, With Astonishing Numbers\n\nEnten also explains how this isn't likely to change in the future because the people coming up now behind Trump are MAGA as well, including JD Vance, Donald Trump Jr., and Vivek Ramaswamy. So, the bench is looking pretty strong.\n\nBottom line? The American people voted for Trump and his policies. That's what they want put through. They want an economy that doesn't run them over; they want a secure border; they don't want to be involved in endless wars. And they want the government cleaned out and reoriented to its true purpose and not an ever-mushrooming money pit bureaucracy that seeks to control us.","url":"https://redstate.com/nick-arama/2024/12/17/cnn-transition-poll-enten-remarks-on-maga-n2183339","image":"https://media.townhall.com/cdn/hodl/2024/291/0d0d351b-55f4-4b92-a3a0-876ba0bd6422.jpg","video":null,"publish_date":"2024-12-18 01:07:22","author":"Nick Arama","authors":["Nick Arama"],"language":"en","source_country":"us","sentiment":0.004},{"id":274066484,"title":"Kamala Harris Talks a Bunch, Says Nothing","text":"When I was a little tad, my grandfather was fond of pointing out that there was a reason I had two ears and only one mouth. Now, Grandpa certainly had the gift of gab; he was an outgoing sort, and everyone in northern Lynn County, Iowa, from before the Great War until he died in 1975, counted Grandpa as a friend. But he also knew that there were times when one had to sit down, shut up, and listen.\n\nKamala Harris would do well to learn this lesson. Why? Because every time she talks, she gives another lesson on how she's just not any good at it. In the latest example, she gave a word-salad-laden talk at Prince George’s County Community College in Maryland, and hoo boy, was it a doozy.\n\nVice President Kamala Harris, in another word salad-filled speech Tuesday, urged young voters to stay engaged in politics as her 2024 opponent returns to the White House — her first extended public remarks since a concession speech to supporters last month following her landslide loss.“The true test of our commitment is whether in the face of an obstacle: Do we throw up our hands — or do we roll up our sleeves?” Harris, 60, said during a speech at Prince George’s County Community College in Maryland, before heavily implying that the main impediment to her audience would be President-elect Donald Trump.“And I ask you to remember the context in which you exist,” the vice president said, pausing slightly and then adding with a laugh, “Yeah, I did that. Uh-huh.”\n\nOK, let's deconstruct these remarks. \n\nFirst: “The true test of our commitment is whether in the face of an obstacle: Do we throw up our hands — or do we roll up our sleeves?” Well, Madam Vice President, we all know what you did in the face of the last obstacle; you ran one of the worst presidential campaigns in the history of the republic against a man who had all the might and fury of the legacy media and the Democratic Party (but I repeat myself) stacked against him, a man who was facing unfounded lawfare on all sides — and you lost. You lost. There's no point in rolling up your sleeves now because you already lost. \n\nAnd there's that cackle again.\n\nSecond: “And I ask you to remember the context in which you exist,” the vice president said, pausing slightly and then adding with a laugh, “Yeah, I did that. Uh-huh.” Wait, what? The context in which you exist? Like...reality? OK, scratch that; many of the young skulls full of mush that lined up to see Kamala Harris spew out another word salad probably have only a nodding acquaintance with reality. But that \"Yeah, I did that. Uh-huh.\" Really? When did she \"remember the context in which (she) existed\"? How, precisely, does one go about this?\n\nSee Related: Flaherty: Kamala Harris' Struggle With Sports Media Signaled Her Loss in the Culture War\n\nThis, I would remind you all, is the presumptive Democrat front-runner in 2028. Given that she will likely face JD Vance, who is everything Kamala Harris cannot dream of being — smart, articulate, dedicated, hard-working, with a compelling life story — well, if the Dems anoint Kamala again in 2028, she can roll up her sleeves until she cuts off the circulation in her arms and it won't do her any good.\n\nAnd she will probably believe she stands a chance with the voters. Does she think we just fell out of a coconut tree?","url":"https://redstate.com/wardclark/2024/12/17/kamala-harris-talks-a-bunch-says-nothing-n2183338","image":"https://media.townhall.com/cdn/hodl/2024/282/16a0f4cd-ac4d-455d-8427-a22aa6ac05cc.png","video":null,"publish_date":"2024-12-18 01:07:22","author":"Ward Clark","authors":["Ward Clark"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.321},{"id":274065528,"title":"'Still hopeful': Ukrainian soldier savouring brief peace in Calgary describes grinding war","text":"Advertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.\n\nArticle contentArticle content“We’re still hopeful very much that victory will be ours — we’re doing our best every day,” said Serhii.Article contentArticle content“It’s a huge achievement we’re still standing.”Article contentArticle content‘Support really matters — it tells us we’re not alone’Article contentArticle contentHe’s less hopeful of convincing the Russian public that the war their country is waging is wrong and harmful to them.Article contentArticle contentSerhii said he has close relatives living near Moscow who refuse to view the war beyond Kremlin talking points.Article contentArticle content“It’s very deeply rooted in their minds from many years of Russian propaganda — they say it’s all fake,” he said, adding he’s visited that part of Russia several times.Article contentArticle content“I don’t talk to them (anymore) — it doesn’t really work. They don’t try to find reason.”Article contentArticle contentSerhii said he’s found considerably more moral support among Canadians during his two weeks away from the fighting.Article contentArticle content“I’m able to confirm how much support really matters — it tells us we’re not alone,” he said.Article contentArticle contentBeing in Canada, even briefly, highlights the stark differences between peace and a relentless war, he said.Article contentAdvertisement 3Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentArticle content“It feels very nice to be in a civil country which is not in active war. People in Ukraine do not have a confidence in their near future due to persistent attacks of Russia on the whole country,” he said.Article contentArticle content“And being under the constant pressure of terrorists is very depressing.”Article contentArticle contentNo end of conflict in sight, says soldierArticle contentArticle contentTalk of negotiating peace with Russia based on conceding occupied Ukrainian territory, which has become more frequent with the impending return of U.S. president-elect Donald Trump, should be viewed with skepticism, said the soldier.Article contentArticle contentSuch a deal, he said, would leave Ukraine vulnerable to resumed Russian aggression in the future.Article contentArticle content“It’d be a very short break (in fighting) . . . we have no trust in the Russians if we have an unstable agreement,” he said.Article contentArticle contentFor now, there’s no end of the conflict in sight, which means he’ll serve indefinitely, said Serhii, adding Christmas for him won’t be very festive.Article contentArticle contentHe’ll be returning to an embattled Ukraine on Christmas Eve — the country’s third during total war — “and in a couple of days I’ll be back to my duty that’s going to continue into New Year’s Day,” he said.Article contentArticle content“I’m sure there would be some hopes and wishes made during that day, but we have to continue our work in order to support them coming true.”Article contentArticle contentArticle contentArticle contentX: @BillKaufmannjrnArticle contentArticle contentAdvertisement 2This advertisement has not loaded yet.\n\nFeatured Local Savings","url":"https://calgaryherald.com/news/local-news/ukrainian-soldier-on-leave-calgary-grinding-war","image":"https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/12/Ukranian-soldier-121724-gya-4-copy.jpg","video":null,"publish_date":"2024-12-18 01:03:23","author":"Bill Kaufmann","authors":["Bill Kaufmann"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.375},{"id":274065514,"title":"Calgary Herald letters, Dec. 17: Cheers for Arts Commons, but what about other venues?","text":"At a February 2024 rally in South Carolina, Donald Trump was hostile toward countries that did not spend two per cent of their GDP on defence. “Everybody’s gonna pay. If they don’t pay, no, I would not protect you… I would encourage them (Russia) to do whatever the hell they want.” Of whom was he talking about? Of 32 countries in NATO, 10 have not paid two per cent of their GDP on defence. Of these, Canada is fifth from the bottom at 1.37 per cent of GDP spent on defence.","url":"https://calgaryherald.com/opinion/letters/calgary-herald-letters-dec-17-private-trees-are-not-for-the-taking","image":"https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/12/ACT_Expansion_Exterior_Nightime-copy.jpg","video":null,"publish_date":"2024-12-18 01:03:23","author":"Calgary Herald","authors":["Calgary Herald"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.74},{"id":274066962,"title":"Japan's exports expand faster than expected in November","text":"TOKYO: Japan's exports rose for a second straight month in November, data showed on Wednesday (Dec 18), indicating strong global demand that businesses worry could be undermined by protectionist US trade policies.\n\nThe solid data, released just a day before the Bank of Japan's policy decision, supports the central bank's plans to gradually raise interest rates from near-zero levels.\n\nTotal exports rose 3.8 per cent year-on-year in November, more than a median market forecast for a 2.8 per cent increase and following a 3.1 per cent rise in October.\n\nExports to China, Japan's biggest trading partner, rose 4.1 per cent in November from a year earlier, while those to the United States were down 8 per cent, the data showed.\n\nImports dropped 3.8 per cent in November from a year earlier, compared with market forecasts for a 1 per cent increase.\n\nAs a result, Japan ran a trade deficit of ¥117.6 billion (US$766.17 million) in November, compared with the forecast of a deficit of ¥688.9 billion.\n\nThe outlook for exports is increasingly uncertain.\n\nNearly three-quarters of Japanese companies expect Donald Trump's next term as US president to have a negative impact on their business environment, a Reuters survey showed.\n\nBOJ Governor Kazuo Ueda has said the bank will keep raising rates if the economy and prices move in line with projections.\n\nHowever, sources have told Reuters the central bank is leaning toward keeping interest rates steady this week as policymakers prefer to spend more time scrutinising overseas risks.","summary":"","url":"https://www.channelnewsasia.com/business/japans-exports-expand-faster-expected-november-4813066","image":"https://onecms-res.cloudinary.com/image/upload/s--oISd4t-t--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-12-18t001231z_1_lynxmpekbh00a_rtroptp_3_japan-economy-trad","video":null,"publish_date":"2024-12-18 01:01:43","author":null,"language":"en","source_country":"sg","sentiment":0.301},{"id":274067636,"title":"Trump nominates Oregonian to be ambassador to Japan","text":"President-elect Donald Trump on Monday tapped Oregon native George Glass to become his ambassador to Japan.\n\nGlass, a Trump donor who founded the Portland investment bank Pacific Crest Securities, served as ambassador to Portugal during the first Trump administration.","summary":"Glass graduated from the University of Oregon and founded the Portland investment bank Pacific Crest Securities.","url":"https://www.oregonlive.com/politics/2024/12/trump-nominates-oregonian-to-be-ambassador-to-japan.html","image":"https://www.oregonlive.com/resizer/v2/3M7LKLYUSJAV3E45PWISH7H7CE.jpg?auth=29415bb3df8d025499ccb1ffc2fe01c3a4d63ea2cab46afd21268c4ccdf99a41&width=1280&quality=90","video":null,"publish_date":"2024-12-18 00:58:23","author":"Matthew Kish","authors":["Matthew Kish"],"language":"en","category":"politics","source_country":"us","sentiment":-0.225},{"id":274065020,"title":"Indian firms turn to euro, yen swaps to trim borrowing cost","text":"Indian firms are opting for cross-currency swaps to convert part of their debt into the euro or Japanese yen in order to trim borrowing costs, said bankers. They anticipate a sharper fall in interest rates of these two currencies instead of the dollar. While some are converting their rupee debt into the euro or yen, others are converting their dollar debt. With the easing of rates by the European Central Bank, the borrowing cost is expected to be reduced by 150-200 basis points over a few months, said bankers. Cross-currency swaps are derivative structures that allow companies to convert loan principal, interest repayments, or both, from one currency to another, helping manage interest rates and forex risk. Also ReadQ2 a blip, growth to pick up in next quarters: Finance Minister “People are moving to yen as its rate of interest is closer to zero. Also, the pricing of loans is better,” said a head of treasury at a state-owned bank. Moreover, expectations of dollar strengthening further have also prompted Indian firms to opt for cross-currency pairs other than USD-INR. The dollar strengthened 0.16% to 0.894 against the Swiss franc, hovering near its highest level since July. Against the yen, the dollar strengthened 0.31% to 154.12, after rising as high as 154.48 for the first time since November 26. “Euro interest rates will go down due to the slowdown in the Euro Zone, while dollar interest rates may not fall significantly, particularly if Trump imposes tariffs. So, people are switching to these swaps,” said Anil Kumar Bhansali, head of treasury at Finrex Treasury. ECB president Christine Lagarde hinted at a bigger 50 basis point rate cut to buffer the euro zone economy. On December 12, the ECB cut interest rates for the fourth time this year and kept the door open to more easing as the economy is dragged down by political instability in the region and the threat of a fresh US trade war. As uncertainty looms in both domestic and global markets regarding the trajectory of the American greenback going forward, the dollar hedging cost has increased for Indian corporates. Currency hedging is an attempt to reduce the effects of changes in the exchange rate on the value of investments. Also Read55th GST Council meet on 21st December: Here is what to expect The dollar has been reaping the benefits of Donald Trump's victory in the US presidential elections, which sent the currency to its highest level since November 26. With the dollar scaling at an all-time high, the euro has fallen to a one-year low, and the rupee has been touching fresh lows. Usually, when the dollar gains momentum, other currencies essentially depreciate. Consequently, countries that have dollar-denominated debt become less creditworthy as it makes it harder for them to purchase the US currency, said bankers. “Cross-currency swaps have increased over a period of time. From Indian corporates' point of view, the dollar hedging cost has increased in recent times; therefore, they are preferring other currencies,” said a trader with a foreign bank.","url":"https://www.financialexpress.com/policy/economy-indian-firms-turn-to-euro-yen-swaps-to-trim-borrowing-cost-3694037/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/currency.freepik.jpg","video":null,"publish_date":"2024-12-18 00:57:22","author":"Anupreksha Jain","authors":["Anupreksha Jain"],"language":"en","source_country":"in","sentiment":0.057},{"id":274065196,"title":"Far-right American pundit Candace Owens appeals visa rejection","text":"Far-right American commentator Candace Owens is challenging Tony Burke’s decision to deny her a visa in Australia’s top court, calling the rejection a “dangerous step toward censorship”.\n\nThe Home Affairs Minister in October blocked Ms Owens from entering Australia for her speaking tour because she had the “capacity to incite discord”, citing her litany of anti-Semitic comments.\n\nSince the visa decision, Ms Owens has taken multiple shots at the Albanese government, including joking that Mr Burke cost her the ambassadorship to Israel in Donald Trump’s incoming US administration.\n\nThe pundit confirmed on Wednesday that she had filed an appeal in the High Court.\n\n“I am deeply disappointed by the decision to block my entry to Australia,” Ms Owens said.\n\n“This is not just a personal affront but a dangerous step toward censorship.\n\n“Australia is a nation that prides itself on its commitment to free expression, yet here we are, witnessing the government prevent the open exchange of ideas based on an unfounded and vague assertion that I will somehow ‘incite discord’.\n\n“This is a classic case of ideological overreach, and I will not stand by while our fundamental freedoms are eroded.”\n\nMr Burke denied Ms Owens’ visa amid rising anti-Semitism in Australia sparked by Israel’s casualty-heavy war against Palestinian terrorist group Hamas.\n\nIn recent weeks, Australia’s Jewish community has been shaken by high-profile anti-Semitic incidents in the country’s biggest cities, including the firebombing of a Melbourne synagogue.\n\n“From downplaying the impact of The Holocaust with comments about (notorious Nazi doctor Josef) Mengele through to claims that Muslims started slavery, Candace Owens has the capacity to incite discord in almost every direction,” Mr Burke said at the time of his decision.\n\nHe said the “national interest is best served when Candace Owens is somewhere else”.\n\nBut in her latest remarks, Ms Owens rejected the charge.\n\n“My speaking tour is about fostering constructive debate on important issues facing the world today,” she said.\n\n“I am committed to offering a platform where diverse perspectives can be heard, even if those perspectives are uncomfortable or controversial.\n\n“The rejection of my visa is an attempt to stifle that dialogue, and I will fight this decision in the High Court.”\n\nHer appeal came a day after she joked about a Jewish advocacy group naming her anti-Semite of the year.","summary":"Far-right American commentator Candace Owens has escalated her ongoing stoush with an Australian MP after he denied her a visa.","url":"https://thewest.com.au/news/far-right-american-pundit-candace-owens-appeals-visa-rejection-c-17123006","image":"https://images.thewest.com.au/publication/C-17123006/c122cb2f3d9a5503246785aad0a68726beddf439-16x9-x0y0w2048h1152.jpg?imwidth=1200","video":null,"publish_date":"2024-12-18 00:56:25","author":"Joseph Olbrycht,Joseph Olbrycht-Palmer","authors":["Joseph Olbrycht","Joseph Olbrycht-Palmer"],"language":"en","category":"politics","source_country":"au","sentiment":-0.128},{"id":274064946,"title":"Photo Shows Pelosi Posing After Breaking Her Hip, Before Going To Hospital","text":"What's NewA Republican lawmaker said Tuesday that after former House Speaker Nancy Pelosi fell and broke her hip last week, she got up and posed for a photograph before going to the hospital.\"She had a hip replacement,\" Texas Representative Michael McCaul told ABC News on Monday. \"I was right next to her. She likes to wear high heels. Very high. She was on one of her last steps on this marble staircase that didn't have a railing. She lost her footing and fell to the ground. I immediately helped pick her up.\"McCaul also told ABC's Jay O'Brien that after the former House Speaker fell, she powered through, took the photograph, and then went to the hospital.\"We took a picture after that, you can see me holding her up by her hand, and then very soon thereafter, a vehicle showed up, and she was taken to the hospital,\" McCaul said.Newsweek reached out to McCaul's office for comment.Why It MattersPelosi, 84, is one of the most powerful figures in the Democratic Party. She made headlines last week after falling down the stairs while on a congressional trip to Luxembourg to celebrate the 80th anniversary of the Battle of the Bulge.It was the second time in a week that an older member of Congress suffered an injury. Senate Minority Leader Mitch McConnell, 82, fell and sprained his wrist last Tuesday after a Senate Republican lunch on Capitol Hill, his office told Newsweek.What To KnowA spokesperson for Pelosi announced Saturday that the California Democrat had a \"successful hip replacement\" after she was hospitalized abroad.The former House Speaker's office also said Friday that she was \"receiving excellent treatment from doctors and medical professionals\" after the fall.\"Earlier this morning, Speaker Emerita Pelosi underwent a successful hip replacement and is well on the mend,\" Pelosi's spokesperson, Ian Krager, said in an official statement Saturday morning.He added: \"Speaker Pelosi is grateful to U.S. military staff at Landstuhl Regional Medical Center at Landstuhl Army Base and medical staff at Hospital Kirchberg in Luxembourg for their excellent care and kindness Speaker Pelosi is enjoying the overwhelming outpouring of prayers and well wishes and is ever determined to ensure access to quality health care for all Americans.\"Who is Nancy Pelosi?Nancy Pelosi is an influential American politician and member of the Democratic Party who served as the Speaker of the United States House of Representatives. She was the first woman in U.S. history to hold this position, showcasing her significant role in American politics. Representing California's 12th congressional district, Pelosi has been a central figure in legislative processes, particularly during key moments like the passage of the Affordable Care Act and multiple impeachment trials of President Donald Trump. Her leadership has marked her as a formidable presence in Congress.Although Pelosi stepped down from the speakership last year, she continues wielding tremendous power within the Democratic Party.She was instrumental in getting U.S. President Joe Biden to bow out of the 2024 presidential race after his disastrous performance against President-elect Donald Trump in an ABC News debate over the summer.And this week, Pelosi duked it out—from her hospital bed—with New York Representative Alexandria Ocasio-Cortez over Ocasio-Cortez's bid to be the top Democrat on the House Oversight Committee. The New York Times reported that Pelosi worked the phones behind the scenes to convince Democrats to throw their support behind Representative Gerry Connolly, 74.Ocasio-Cortez lost to Connolly by a vote of 131-84.What People Are SayingMcCaul told ABC News: \"She's 84, but when I talked to her on the phone, she had a lot of energy. Very spunky, she wants to get out of there, wants to be able to fly back home to the United States. But, you know, overall, she's in good spirits and there's no more health danger to her other than a hip replacement.\"Sharon Eliza Nichols, director of communications for Congresswoman Eleanor Holmes Norton, said on X: \"She broke her hip, put her stilettos back on and took the freaking picture.That is the most Nancy Pelosi thing ever done.\"Charlie Kirk, conservative political commentator, author, and founder of Turning Point USA, wrote on X on December 14 after Pelosi originally fell and broke her hip, \"I don't care that Nancy Pelosi broke her hip, I still want to see her arrested & charged for Insider Trading.\"What Comes NextShe was reelected in 2024 to her 20th term in the House upon the convening of the 119th Congress, which begins on January 3, 2025.","summary":"Pelosi fell, injured her hip, powered through it to pose for a photograph, and went to the hospital after, a GOP lawmaker told ABC.","url":"https://www.newsweek.com/photo-nancy-pelosi-hip-injury-luxembourg-2002482","image":"https://d.newsweek.com/en/full/2546668/nancy-pelosi-luxembourg.png","video":null,"publish_date":"2024-12-18 00:53:14","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","source_country":"US","sentiment":-0.086},{"id":274065030,"title":"Could Trump prevent a TikTok ban?","text":"Could Trump prevent a TikTok ban?\n TikTok is asking the Supreme Court to pause a law that could ban the app in the U.S. President-elect Donald Trump said that he has a \"warm spot\" in his heart for the social media app. CBS News Supreme Court producer Catherine Cole has more.","summary":"TikTok is asking the Supreme Court to pause a law that could ban the app in the U.S. President-elect Donald Trump said that he has a \"warm spot\" in his heart for the social media app. CBS News Supreme Court producer Catherine Cole has more.","url":"https://www.cbsnews.com/video/could-trump-prevent-tiktok-ban/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/18/8721ce07-faa2-4827-aad4-7c43c949d1fc/thumbnail/1200x630/754fcf59658fb919805dd310b49145c8/cbsn-fusion-could-trump-prevent-tiktok-ban-thumbnail.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-18 00:49:38","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.414},{"id":274063938,"title":"Indiana prepares to put to death a killer of 4 after 15-year pause in executions","text":"INDIANAPOLIS (AP) — Indiana officials are preparing to execute the state’s first death row inmate in 15 years, who was convicted a quarter-century ago of killing his brother and three other men.\n\nJoseph Corcoran, 49, has been on Indiana’s death row since 1999. If he is put to death as scheduled Wednesday, it will be the state’s first execution since 2009. In that time, 13 executions were carried out in Indiana but those were initiated and performed by federal officials in 2020 and 2021 at a federal prison.\n\nCorcoran is scheduled to be executed before sunrise Wednesday at the Indiana State Prison in Michigan City, about 45 miles (72 kilometers) east of Chicago.\n\nIndiana’s resumption of executions is refocusing attention on Corcoran’s case and questions about how the state has been able to obtain a drug for lethal injections.\n\nWhat was Corcoran convicted of?\n\nCorcoran was 22 on July 26, 1997, when he fatally shot his brother, 30-year-old James Corcoran, and three other men: Douglas A. Stillwell, 30, Timothy G. Bricker, 30, and Robert Scott Turner, 32.\n\nAccording to court records, Joseph Corcoran was under stress because the forthcoming marriage of his sister to Turner would necessitate moving out of the Fort Wayne, Indiana, home he had shared with his brother and sister.\n\nHe awoke to hear his brother and others downstairs talking about him, loaded his rifle and then shot all four men, records show.\n\nWhile jailed, Corcoran reportedly bragged about shooting his parents in 1992 in northern Indiana’s Steuben County. He was charged in their killings but acquitted.\n\nCorcoran’s sibling opposes execution\n\nCorcoran’s sister, Kelly Ernst, who lost a brother and her fiancé in the 1997 shootings, declined to discuss whether she believes her younger brother killed their parents.\n\nBut Ernst, who lives in northeastern Indiana, said she believes the death penalty should be abolished and her brother’s execution won’t solve or change anything. She does not plan to attend his execution.\n\nErnst said she had been out of contact with her brother for 10 years until recently. She believes it’s “fairly obvious” he has a serious mental illness.\n\n“I kind of just feel that there’s no such thing as closure,” Ernst, 56, said Friday. “I just don’t know what else to say. I haven’t slept in weeks.”\n\nWhy did Indiana stop executions?\n\nIndiana last executed Matthew Wrinkles, who was put to death in 2009 for killing his wife, her brother and sister-in-law in 1994.\n\nState officials said they couldn’t continue executions because a combination of drugs used in lethal injections had become unavailable. There has been a yearslong nationwide shortage because pharmaceutical companies — particularly in Europe, where opposition to capital punishment is strongest — have refused to sell their products for that purpose.\n\nThat has prompted states to turn to compounding pharmacies, which manufacture drugs specifically for a client. Some states have switched to more accessible drugs such as the sedatives pentobarbital or midazolam, both of which, critics say, can cause excruciating pain.\n\nIndiana is following that lead, planning to use pentobarbital to execute Corcoran.\n\nThe federal government also used pentobarbital in the 13 federal executions carried out during the final six months of then-President Donald Trump’s first term.\n\nSecret source of the drug\n\nMany states, including Indiana, refuse to divulge where they get the drugs. When asked how the state obtained the pentobarbital it plans to use in Corcoran’s execution, the Indiana Department of Correction directed The Associated Press to a state law labeling the source of lethal injection drugs as confidential.\n\nIn June, Gov. Eric Holcomb announced the state had acquired pentobarbital and asked the Indiana Supreme Court to set a date for Corcoran’s execution. The high court set his Dec. 18 execution date in September.\n\nThe state’s execution plan\n\nState law lays out the specific timing and process. It also limits the people who have a role in an execution and shields their identities and specifies who can witness executions at the Indiana State Prison.\n\nAt the time of an execution, Indiana code states that the only people allowed to be present are the prison warden, those selected to assist in the execution, the prison physician, one additional physician, the condemned person’s spiritual adviser and the prison chaplain.\n\nUp to five friends or relatives of the person being executed and up to eight relatives of the victims of the crime are allowed to view the process.\n\nThe Indiana Department of Correction did not respond to multiple queries from the AP asking whether any of the staffers who will help carry out Corcoran’s execution have previously taken part in a state execution.\n\nNo media can witness Indiana executions\n\nIndiana is one of only two states, along with Wyoming, that do not allow for members of the news media to witness state executions, according to a recent report by the Death Penalty Information Center.\n\nThat report states “unobstructed media access to executions is critical because the media observes what the public cannot. States generally prohibit citizens from attending executions, so the media becomes the public’s watchdog, providing important information about how the government is following the law and using taxpayer funds.”\n\nIs there a fight to stop the execution?\n\nCorcoran had exhausted his federal appeals in 2016.\n\nHis attorneys asked the Indiana Supreme Court to stop his execution but were denied on Dec. 5. The high court also denied petitions to argue whether he is competent to be executed.\n\nIn a handwritten affidavit to the justices, Corcoran said he no longer wanted to litigate his case.\n\n“I am guilty of the crime I was convicted of, and accept the findings of all the appellate courts,” he wrote.\n\nOn Wednesday, his attorneys filed a petition in U.S. District Court of Northern Indiana asking the court to stop his execution and hold a hearing to decide if it would be unconstitutional because Corcoran has a serious mental illness.\n\nThey argued he has “severe and longstanding paranoid schizophrenia” and his condition “manifests as auditory hallucinations and delusions that prison guards are torturing him with an ultrasound machine.”\n\n“Indeed, he has volunteered to be executed, and is eager to be executed, because he believes his execution will give him relief from the perceived pain his delusions and hallucinations inflict upon him,” the filing states.\n\nBut on Friday, the federal district court declined to intervene, prompting defense attorneys to appeal to the U.S. Court of Appeals for the 7th Circuit.\n\nThere’s also the possibility that outgoing Gov. Eric Holcomb, who has said he would let the legal process “play out,” could step in.\n\nIndiana Disability Rights, a disability rights organization, asked Holcomb in a Dec. 6 letter to commute the death sentence to life in prison without parole.\n\n“Executing individuals who cannot fully comprehend their circumstances, or the consequences of their actions, violates fundamental principles of human dignity and equity,” the letter said.","summary":"Joseph Corcoran, 49, will be the state's first execution since 2009.","url":"https://nypost.com/2024/12/17/us-news/indiana-prepares-to-put-to-death-a-man-who-killed-four-after-15-year-pause-in-executions/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/undated-photo-provided-indiana-department-95526438.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/XKr7walv-RyIcpnTz.mp4","publish_date":"2024-12-18 00:46:18","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.112},{"id":274063924,"title":"Former U.S. ambassador to Turkey says Trump is exaggerating the country's influence on Syria","text":"Former U.S. ambassador to Turkey says Trump is exaggerating the country's influence on Syria\n President-elect Donald Trump said that the rebels in Syria are \"controlled by Turkey.\" The former U.S. ambassador to Turkey, David Satterfield, joins \"The Daily Report\" to discuss how much influence Turkey has on the rebel forces that toppled the regime of Bashar al-Assad.","summary":"President-elect Donald Trump said that the rebels in Syria are \"controlled by Turkey.\" The former U.S. ambassador to Turkey, David Satterfield, joins \"The Daily Report\" to discuss how much influence Turkey has on the rebel forces that toppled the regime of Bashar al-Assad.","url":"https://www.cbsnews.com/video/former-us-ambassador-turkey-says-trump-exaggerating-countrys-influence-syria/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/12/18/5de02057-b76a-4ba0-bdf9-e01246da4361/thumbnail/1200x630/56ed47f9f311737222e384fa9a4f1df0/cbsn-fusion-former-us-ambassador-turkey-says-trump-exaggerating-countrys-influence-syria-thumbnail.jpg?v=564e83c5","video":null,"publish_date":"2024-12-18 00:44:51","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.06},{"id":274062834,"title":"PM Anwar’s pick of Thaksin as Asean adviser raises eyebrows in Malaysia","text":"SINGAPORE – Prime Minister Anwar Ibrahim’s move to appoint former Thai premier Thaksin Shinawatra as his “informal adviser” when Kuala Lumpur takes over as Asean chair in 2025 has caused a stir in Malaysia.\n\nAnd while some see it as strategic for the country to tap the experience of the 75-year-old Thai leader and possibly other political bigwigs on regional issues, especially the crisis in Myanmar, others are sceptical about turning to a foreign politician for advice, and a controversial one at that. \n\n“I have agreed to appoint (Thaksin) as my informal adviser on chairing Asean, with a team of members from Asean countries in an informal set-up,” said Datuk Seri Anwar, announcing the appointment during an official visit by Thai Prime Minister Paetongtarn Shinawatra, who is Thaksin’s daughter, at the Perdana Putra in Putrajaya on Dec 16.\n\nThaksin, who returned to Thailand in 2023 after over a decade of self-exile to avoid criminal charges, cuts a controversial figure in that country, where he had been convicted of corruption and abuse of power. \n\nStill, Malaysian officials and analysts have said that Thaksin’s influence not just in Thailand, but also in countries such as the United States and China could help Asean with challenges such as navigating US-China tensions or territorial spats in the South China Sea. \n\nAt the Dec 16 meeting with Ms Paetongtarn, Mr Anwar also proposed setting up an informal advisory group to the Asean chair, consisting of former Asean leaders. They will reportedly include Singapore’s former foreign minister, Mr George Yeo, according to local news outlet Malay Mail. \n\nThe Straits Times has contacted Mr Yeo for comment. \n\n“Thaksin is influential in Thailand, is accepted by the US, and has a close relationship with China. This positions him as a bridge for Asean (to foster stronger ties),” Malaysian Foreign Minister Mohamad Hasan was quoted by Bernama as saying at a press briefing on the country’s Asean chairmanship in Kuala Lumpur on Dec 16. \n\nBut opposition Parti Islam SeMalaysia’s information chief Ahmad Fadhli Shaari described the move as “unprecedented” and asked whether this move will benefit Asean or if it is for personal benefit to boost the image of the Malaysian premier in the international community. \n\n“Since when does the head of state choose a former leader of another country as his personal adviser?” wrote Mr Ahmad in a statement on Dec 16.\n\n“Usually, the head of the state will choose a diplomatic expert, a former foreign affairs minister, or an academic whose expertise is in international relations as an adviser. But this time, Anwar chooses a former prime minister who has been sentenced to jail in his own country for abuse of power and corruption,” wrote the Pasir Mas MP. \n\nSpeaking to reporters in Putrajaya on Dec 17, former Malaysian prime minister Mahathir Mohamad also questioned the choice, saying: “I don’t know why he (Anwar) chose him (Thaksin). We have many people (to choose from) and Thaksin has his own (legal) issues... (but) it’s Anwar’s right to appoint whoever he wants.”\n\nThaksin took office as Thailand’s 23rd prime minister in 2001, but his government was deposed in a military coup in 2006, and he fled the country in 2008. Even while abroad in self-exile, Thaksin remained influential in Thai politics through family members and allies who were part of various administrations.\n\nThaksin returned to Thailand in August 2023 and was sentenced to jail for eight years, but this was later reduced to just a year by the King. He spent most of his time in hospital before he was released on parole.\n\nDr Oh Ei Sun, a senior fellow at the Singapore Institute of International Affairs, said Mr Anwar’s choice can be seen as a gesture of neighbourly friendliness and solidarity. \n\nDr Ong Kian Ming, pro vice-chancellor of external engagement at Taylor’s University in Malaysia, said Thaksin’s experience could help Mr Anwar achieve certain objectives under Asean, such as a peace plan in Myanmar or reaching out to members of incoming US President Donald Trump’s administration to allay fears about Malaysia’s position vis-a-vis China and Russia.\n\nThai media reported in May that Thaksin has offered to be a mediator between Myanmar’s resistance and the military regime as during his premiership, he had established ties with the current junta leader Min Aung Hlaing. \n\nMyanmar, which has been under military rule since the military seized power in a 2021 coup, has largely ignored calls by its South-east Asian neighbours to cease hostilities under what is known as the five-point consensus. \n\nNearly 6,000 people have been killed and 30,000 imprisoned in the war-torn country, with a third of its 55 million population in need of humanitarian aid as at August 2024. \n\nMs Kasthuri Prameswaren, associate faculty at the Singapore University of Social Sciences, agreed that Thaksin would be a useful ally for Mr Anwar in pushing for peace in Myanmar, and said that the pair also share similar concerns relating to Thai-Muslim grievances, extremism and transnational crime. \n\nBut from a political point of view, Ms Kasthuri said, it is odd for Mr Anwar to turn to foreign leaders through an Asean advisory group, even one dubbed as informal, instead of Malaysia’s own diplomats or experts, noting that such a move has never happened before. \n\nDr Ong said: “This move can be a disadvantage if it is perceived as Anwar not having enough confidence in himself, his Cabinet and his civil service to achieve his desired goals during Malaysia’s chairmanship of Asean.”\n\nIt is also unclear what roles such informal advisers play, how they will impact Asean’s decisions, and what they expect from Mr Anwar in return for their service, he added. \n\nDr Sufian Jusoh, a professor of international trade and investment at Universiti Kebangsaan Malaysia’s Institute of Malaysia and International Studies, however, disagreed that Mr Anwar’s move discredits the confidence of the Prime Minister and of his Cabinet and government.\n\nHe said all hands need to be on deck given the many “heavy burdens” that Malaysia will have to carry as Asean chair, including US-China relations under Trump, relations with Russia and the Myanmar crisis.\n\n“Perhaps this informal arrangement may be new, but we need to have expert opinions on these matters to advise the civil service and the government. And the opposition needs to be mindful of what it says, given the big things that are coming to us (Malaysia) in 2025.”\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you.","url":"https://www.straitstimes.com/asia/se-asia/pm-anwars-pick-of-thaksin-as-asean-adviser-raises-eyebrows-in-malaysia","image":"https://cassette.sphdigital.com.sg/image/straitstimes/0aa2fcafa717349908d1677b7a8889bd908f7bd24d0347d4d84cff02b485f81d","video":null,"publish_date":"2024-12-18 00:43:22","author":"Harith Mustaffa","authors":["Harith Mustaffa"],"language":"en","source_country":"sg","sentiment":0.229},{"id":274062340,"title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — December 18","text":"Buy or sell stocks for today: Domestic equity benchmarks Sensex and Nifty 50 logged across-the-board selling pressure in the previous session, dragged by a continued flight of foreign capital amid a negative global market trend. Investors maintained a cautious approach in the market ahead of the much-awaited US Federal Reserve’s interest rate decision, due later today, for which Wall Street traders have priced in a quarter-point policy reduction.For the second day in a row, the 30-share BSE benchmark Sensex tanked 1,064.12 points, or 1.30 per cent, to 80,684.45, below the psychological 81,000 level. The Nifty tumbled 332.25 points or 1.35 per cent to 24,336.All sectoral indexes except media fell. The more domestically focused small-caps and mid-caps declined 0.7 per cent and 0.8 per cent, respectively. The Indian rupee weakened to its lifetime low. Foreign investors likely sold stocks after data showed India’s trade deficit widened to a record level in November. Investors’ wealth tumbled ₹4.92 lakh crore on Tuesday.\nThe market capitalisation of BSE-listed firms eroded by ₹4,92,644.06 crore to ₹4,55,13,913.24 crore ($5.36 trillion). While a 25 basis points (bps) interest rate cut is widely expected and priced in for later today, markets are bracing for US Fed policymakers to scale back its easing next year in anticipation of higher inflation under the Donald Trump administration.Vaishali Parekh’s stocks to buy todayVaishali Parekh, Vice President of Technical Research at Prabhudas Lilladher, said, “Nifty has been finding resistance near the 24,750 zone for quite some time and tanked heavily, breaking below the important 50EMA level of 24,450 zone, weakening the overall bias and turning the sentiment into a cautious approach.”For Bank Nifty, the Prabhudas Lilladher expert said, “Bank Nifty has slipped down from the resistance zone of 53,800 levels with heavy profit booking witnessed and would have the significant 50EMA-level of 52,200 as the next important support, a breach of which would further weaken the trend.”Vaishali Parekh recommended three intraday stocks for today: RateGain Travel Technologies, Aster DM Healthcare, and National Fertilizers Ltd. Stock market todayFor today’s outlook on the Nifty 50, Parekh said, “The index would have the psychological support zone of 24,000 level and would be eagerly awaiting the US Fed outcome, which can decide the further directional move in the coming days.”On Bank Nifty, she said, “At the same time, as mentioned earlier, for further fresh upside move, a decisive breach above the 53,850 zone is necessary to confirm a breakout in the coming days.”Nifty 50’s support for the day is seen at 24,200 levels, while the resistance would be at 24,500 levels. Bank Nifty would have the daily range of 52,200-53,500. Buy or sell stocks by Vaishali Parekh1.RateGain Travel Technologies: Buy RateGain Travel Technologies at ₹741.90 with a target price of ₹775 and a stop loss of ₹725.2.Aster DM Healthcare: Buy Aster DM Healthcare at ₹488 with a target price of ₹514 with a stop loss of ₹476.3.National Fertilizers Ltd: Buy National Fertilizers Ltd at ₹125.50 with a target price of ₹135 and a stop loss of ₹122. Disclaimer: The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts, consider individual risk tolerance, and conduct thorough research before making investment decisions, as market conditions can change rapidly, and individual circumstances may vary.","url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-december-18-11734451272719.html","image":"https://www.livemint.com/lm-img/img/2024/12/17/1600x900/Buy_or_sell_stocks_to_buy_today_stock_market_today_1698023021624_1734451412158.jpg","video":null,"publish_date":"2024-12-18 00:41:22","author":"Nikita Prasad","authors":["Nikita Prasad"],"language":"en","source_country":"in","sentiment":0.007},{"id":274062330,"title":"Chile Delivers Hawkish Interest Rate Cut That Raises Odds of a Pause to Easing","text":"(Bloomberg) -- Chile’s central bank cut its key interest rate by a quarter point for the third meeting and delivered a stern warning on short-term inflation challenges, raising the odds of a coming pause to its easing cycle. Policymakers led by Rosanna Costa voted unanimously to lower borrowing costs to 5% late Tuesday, as expected by all analysts in a Bloomberg survey except three who forecast no change. Rates have tumbled from 11.25% in mid-2023. In an accompanying statement, policymakers wrote that the inflation outlook has become more daunting. Chile’s consumer price dynamics have come under pressure from factors including a weaker peso, rising electricity tariffs and higher labor costs that include “significant” wage gains. “The balance of risks for inflation is biased to the upside in the short term, which highlights the need to be cautious,” policymakers wrote. “The board will gather information with respect to the economy to evaluate the opportunity for further rate cuts in coming quarters.” Central bankers extended their easing cycle as inflation expectations remain anchored at the 3% target in two years. Domestic activity is facing numerous headwinds — demand from top trading partner China is weakening, while locally unemployment is high and business confidence levels are subdued. Still, global geopolitical and economic volatility is giving reason for caution. “We interpret the decision as a ‘hawkish cut’ that signals the central bank will take some time to assess if macro conditions allow for additional cuts toward the nominal neutral rate range,” said Andres Perez, chief Latin America economist at Banco Itau. “The easing cycle to pause, for now.” Board members have estimated the neutral rate — which neither stimulates nor restricts the economy — at between 3.5% and 4.5%. While central bankers signaled in their statement that rates should fall over their policy horizon, they did not reference when borrowing costs will reach the neutral level. 5% Inflation Annual inflation was 4.2% last month, above the central bank’s forecast from September. Consumer prices will remain pressured, most notably due to a new electricity tariff hike scheduled for January as well as a fresh slide in the peso, which has weakened some 11% against the dollar this year. Given those price drivers, annual inflation is likely to fluctuate around 5% in the first half of next year, policymakers wrote in the statement. Weaker domestic demand will mitigate cost-of-living increases in the medium-term, they wrote. What Bloomberg Economics Says “Cautious forward guidance suggests policymakers are poised to hold rates for some time while awaiting evidence that inflationary pressures — from peso depreciation, increasing salaries and higher electricity prices — are transitory. Higher inflation in the first half of next year — as the central bank now projects — and the more cautious outlook suggest they may hold the rate at 5% into the second quarter.” — Felipe Hernandez, Latin America economist — Click here for full report Private consumption was weak in the third quarter while bank credit has been lackluster and job creation has shown “poor performance,” policymakers wrote. Consumer and business expectations are on the pessimistic side, they wrote. Finance Minister Mario Marcel said this month that gross domestic product will expand 2.4% in 2024, below the government’s most recent forecast of 2.6%. He singled out investment as a top challenge going forward. Meanwhile, the global outlook has turned more uncertain due to fiscal concerns, possible changes to international trade and the policies that will come once Donald Trump takes office as US president, central bankers wrote. “The financial markets have reacted to this heightened uncertainty with increases in long-term interest rates and a strengthening of the dollar,” they wrote. “There’s justified caution after the quarter-point rate cut,” Jorge Selaive, chief economist at Scotiabank Chile, wrote on X. “They will probably pause in January and perhaps also in March.” Chile’s central bank will publish its latest forecasts for economic growth and inflation, as well as the likely path for borrowing costs going forward, in its quarterly monetary policy report Wednesday. --With assistance from Giovanna Serafim and Rafael Gayol. (Re-casts story, adds details from central bank statement starting in third paragraph) More stories like this are available on bloomberg.com ©2024 Bloomberg L.P.","url":"https://www.livemint.com/market/stock-market-news/chile-delivers-hawkish-interest-rate-cut-that-raises-odds-of-a-pause-to-easing-11734481307997.html","image":"https://www.livemint.com/lm-img/img/2024/12/06/1600x900/market1_1733465997762_1733466008348.jpg","video":null,"publish_date":"2024-12-18 00:41:22","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","source_country":"in","sentiment":-0.007},{"id":274062846,"title":"Trump Mines Fraught Moment in Canadian Politics","text":"Prime Minister Justin Trudeau of Canada and his government were in serious trouble well before Donald J. Trump was re-elected in November.\n\nAfter nine years in government, a housing and cost-of-living crisis, worries about immigration and a growing divide on culture issues, Mr. Trudeau, once the optimistic face of the liberal order, is on thinning ice.\n\nOpinion polls show that, in national elections that must take place by the fall under Canadian electoral rules, Mr. Trudeau is unlikely to win a fourth term as prime minister.\n\nMr. Trump has tapped into this brewing trouble, even before taking office.\n\nHe has threatened to slap tariffs on Canadian goods, sending the country into panic mode. He has trolled Mr. Trudeau as the “governor” of the “Great state of Canada,” putting his disdain on public display and triggering debates about how or whether Mr. Trudeau should respond.","summary":"The president-elect’s threat to impose major tariffs on Canadian goods and other pointed comments have tapped into a treacherous moment in domestic politics.","url":"https://www.nytimes.com/2024/12/17/world/canada/trudeau-trump-tariffs.html","image":"https://static01.nyt.com/images/2024/12/17/multimedia/17canada-trudeau-gbvz/17canada-trudeau-gbvz-facebookJumbo.jpg","video":null,"publish_date":"2024-12-18 00:40:48","author":"Matina Stevis-Gridneff","authors":["Matina Stevis-Gridneff"],"language":"en","category":"politics","source_country":"us","sentiment":0.167},{"id":274063922,"title":"Trump sues Des Moines Register and Iowa pollster over pre-election poll","text":"Trump sues Des Moines Register and Iowa pollster over pre-election poll\n President-elect Donald Trump has sued the Des Moines Register over a pre-election poll that had him trailing Vice President Kamala Harris in Iowa. He ultimately won the state by 13 points. The lawsuit accuses the outlet and pollster Ann Selzer of election interference. CBS News political correspondent Caitlin Huey-Burns has more.","summary":"President-elect Donald Trump has sued the Des Moines Register over a pre-election poll that had him trailing Vice President Kamala Harris in Iowa. He ultimately won the state by 13 points. The lawsuit accuses the outlet and pollster Ann Selzer of election interference. CBS News political correspondent Caitlin Huey-Burns has more.","url":"https://www.cbsnews.com/video/trump-sues-des-moines-register-iowa-pollster-over-pre-election-poll/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/18/c368ed3c-6ad1-4d5b-b53e-2924cf973113/thumbnail/1200x630/e27c49b7206ddd490a2609b031c76feb/cbsn-fusion-trump-sues-des-moines-register-iowa-pollster-over-pre-election-poll-thumbnail-3411568-640x360.jpg?v=5","video":null,"publish_date":"2024-12-18 00:40:02","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.145},{"id":274061948,"title":"Donald Trump must not block the TikTok ban — it’s the ULTIMATE battle against abuse by Big Tech and Big (Foreign) Gov","text":"Mr. President-elect, don’t sell out on a TikTok ban: The app is a Chinese state influence op, and you were elected on a promise to get tough when social-media companies collude with governments.\n\nA quick recap: After a rare bipartisan victory in Congress, a ban on the app is set to take effect Jan. 19 unless parent company ByteDance sells out to a different owner not answerable to the Chinese Communist Party.\n\nThat’s great news. \n\nTikTok has massively harmed our country. \n\nBut now TikTok has asked the Supreme Court to intervene — and Donald Trump met with CEO Shou Zi Chew at Mar-A-Lago in Florida and is making noises suggesting he might throw the company a lifeline. \n\nWe know that Trump loves to make deals, and is likely enjoying the attention of a now-supine corporate America as it reckons with his commanding victory. \n\nHe’s also a huge fan of social media as a communications tool.\n\nBut TikTok is a tool of China’s massive surveillance state. \n\nOne of the company’s board seats is filled by a government appointee. \n\nThe vast troves of user data the social app collects, including private messages?\n\nThere for the CCP’s perusal; the company’s already admitted that its employees in China were using the data to track US journos. \n\n(Imagine what they haven’t fessed up to.) \n\nByteDance has major ties to China’s defense sector, including running an AI academy explicitly for military purposes. \n\nCrucially, ByteDance owns the addictive algorithm that’s been key to Tik Tok’s success (and destruction) and won’t let it fall out of CCP-controlled hands. \n\nThat’s damning all by itself.\n\nAnd that’s to say nothing over the app’s power to promote whatever content Beijing sees fit. \n\nIt’s a massive soft-power intelligence operation, in other words, running right out in the open — even as it damages and demoralizes American kids.\n\nSome free-market evangelists may be uncomfortable with banning a business, but this is about restraining our most formidable foe.\n\nThe law banning it is beyond necessary. \n\nTrump may claim a “warm spot” in heart for the app and he would’ve been impressed by the views he drove during the election. \n\nBut winning the fight against the Big Tech-Big Gov combine — as he has promised to do — means winning battles like this. \n\nAnything less would be hypocrisy.","summary":"The president-elect is making noises about throwing TikTok a lifeline, if he's serious about freedom from Big Tech surveillance, he shouldn't.","url":"https://nypost.com/2024/12/17/opinion/donald-trump-must-not-block-the-tiktok-ban-its-the-ultimate-battle-against-abuse-by-big-tech-and-big-foreign-gov/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/2024-12-17T221437Z_475312132_RC2GQBA4H7MS_RTRMADP_3_USA-TRUMP-UBER-e1734481998945.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-12-18 00:37:39","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.023},{"id":274061444,"title":"Biden Cabinet Officials Asked If Biden Was Fit to Serve - Bizarro World Ensues","text":"It's no secret that Washington, D.C., is a place that occupies its own bubble. It's a separate world of up is down and down is up, and trying to convince people that what they see and hear is not really what they are seeing and hearing. It takes a certain kind of person to survive in a place like that — feel free to insert your own definition of what that might be. No one will say that politics is an honest business. But in the past four years, we have seen the Biden administration take that concept to a whole other level.\n\nRecently, Fox News Digital conducted a poll of sorts. They contacted several Biden administration Cabinet members and asked an interesting question: Did they believe that President Joe Biden was fit to serve, and did they stand by statements they had made in the past about their confidence in his abilities? The answers are what you might expect...mind-numbing. \n\nREAD MORE: Biden's Delusional Remarks About Scandal and Kamala at DNC Holiday Party\n\nIn a statement made in September, Department of Homeland Security Secretary (DHS) Alejandro Mayorkas said he had \"full confidence\" in Biden's ability to do the job. He added:\n\n\"As I’ve said before, I come fully prepared for my meetings with President Biden, knowing his questions will be detail-oriented, probing, and exacting. In our exchanges, the President always draws upon our prior conversations and past events in analyzing the issues and reaching his conclusions.\"\n\nOn Monday, DHS stated that Mayorkas stands by those comments. \n\nCommerce Secretary Gina Raimondo said that Biden was \"one of the most accomplished presidents in American history and continues to effectively lead our country with a steady hand.\" A spokesman said Raimondo also stood by her comments. \n\nIt wasn't just Cabinet members claiming Biden has been at the top of his game. Sabrina Singh is the deputy press secretary at the Pentagon. She said in September:\n\n\"As Secretary Austin has said before, he has watched President Biden make tough national security decisions and seen his commitment to keeping our troops safe - he has nothing but total confidence in our Commander-in-Chief.\"\n\nSingh said the Defense Department stands by the comments.\n\nQuestions about Biden's mental acuity surfaced early on in his presidency. There were little things that the media dutifully ignored, like referring to Vice President Kamala Harris as \"President Harris,\" calling Harris the \"president-elect,\" and not remembering Defense Secretary Lloyd Austin's name, saying, “My . . . the guy who runs that outfit over there.” In March of 2021, Biden fell three times while going up the stairs of Air Force One. The serious questions came after the presidential debate in June between Donald Trump and Biden. Just 10 minutes in, Biden lost his train of thought, slurred his words, and his answers to questions trailed off. It was at that point that calls for Biden to drop out of the race began. \n\nIn September, Biden turned the reins of a Cabinet meeting over to First Lady Jill Biden. That didn't strike any of these Cabinet secretaries or other department officials as the least bit odd? Of course, it did. But power in Washington is addictive, so much so that no one closest to an obviously mentally impaired president will speak up. And remember, Mayorkas told us the border was closed, Raimondo had no knowledge of a downward jobs revision in August, and Lloyd Austin's main concern was DEI in the military.\n\nWhat these officials had to know gets even worse when you consider, as my colleague Mike Miller recently reported, the latest video from James O'Keefe, in which a Security Council official admits that Biden's mental condition is far worse than is publicly known. Henry Appel admits that “[Biden] can’t say a sentence.” He added, “We give all of the senior policymakers all of the secrets.” \n\nREAD MORE: James O’Keefe Releases Shocking Video of NSC Advisor Admitting Biden Is Far Worse Off Than We Know\n\nBut the theme of \"Don't believe your lyin' eyes\" rolls merrily along among Biden Cabinet officials. Health and Human Services (HHS) Secretary Xavier Becerra said that Biden \"has done more as president for this country than any other president whom I have worked with since 1992.\" He added, \"Is he fit? He's proving it.\" You know the drill, an HHS spokesman says Becerra also stands by his comments, as did spokesmen for the Environmental Protection Agency (EPA) and the Departments of Energy and Agriculture.\n\nIt's a level of gaslighting rarely seen even in Washington. Once Joe Biden is gone, will anyone finally speak up because they think it's \"safe?\"","url":"https://redstate.com/beckynoble/2024/12/17/biden-cabinet-officials-asked-if-biden-was-fit-to-serve-bizarro-world-ensues-n2183335","image":"https://media.townhall.com/cdn/hodl/2024/262/576e8c51-2d44-46e3-8cd9-6982cc1ac573.png","video":null,"publish_date":"2024-12-18 00:35:22","author":"Becky Noble","authors":["Becky Noble"],"language":"en","source_country":"us","sentiment":-0.038},{"id":274062308,"title":"Robert F. Kennedy Jr. nomination sparks debate about fluoride in water","text":"Robert F. Kennedy Jr. nomination sparks debate about fluoride in water\n President-elect Donald Trump's pick of Robert F. Kennedy Jr. to lead the Department of Health and Human Services has brought back a debate about fluoride in drinking water that many thought was settled decades ago. Meg Oliver takes a look at how a lack of fluoride can affect dental health.","summary":"President-elect Donald Trump's pick of Robert F. Kennedy Jr. to lead the Department of Health and Human Services has brought back a debate about fluoride in drinking water that many thought was settled decades ago. Meg Oliver takes a look at how a lack of fluoride can affect dental health.","url":"https://www.cbsnews.com/video/robert-f-kennedy-jr-nomination-sparks-debate-about-fluoride-in-water/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/12/18/5d2daadb-6e77-4806-a0ed-b24698d780d2/thumbnail/1200x630/f6bf4c1becc509b6417bf9deceba5e8c/1217-en-oliver.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-18 00:33:00","author":null,"language":"en","source_country":"US","sentiment":0.004},{"id":274067120,"title":"Ontario’s premier says Trump’s tariffs would be a disaster for US markets - The Associated Press","text":"TORONTO (AP) — The premier of Canada’s most populous province said Tuesday President-elect Donald Trump’s plan to impose sweeping 25% tariffs on all Canadian products would be a “disaster” that would hurt U.S. stock markets.\n\nOntario Premier Doug Ford also said in an interview with The Associated Press that he’s “extremely worried” about Trump’s plan to launch a mass deportation of millions of undocumented people. Ford said he has a plan to send hundreds of police officers to the border if they come north. \n\nFord said tariffs won’t work considering how integrated the U.S. and Canadian economies are. He noted that in the auto sector alone parts and go back and forth between Canada-U.S. border seven or eight times before being assembled in Ontario or Michigan. \n\n“It is so integrated. I don’t even know how you separate that in the supply chain. It would be a disaster,” Ford told the AP. “It will affect the market. The market will drop and we have every CEO saying that is not the way to go.”\n\nFord said the market consequences will get Trump’s attention. \n\n“I know he has many scorecards, but one is the stock market. It will affect the market, the market will drop,” Ford said. \n\nFord said he’s also very worried about Trump’s mass deportation plan. Trump has talked about creating “the largest mass deportation program in history,” calling for using the National Guard and mobilizing domestic police forces.\n\n“I am extremely concerned,” Ford said. “We do have a plan ready. We have hundreds of provincial police officers that are ready within hours, if not immediately, to hit the borders.”\n\nFord said a combination of local police, provincial police and the federal government will all be working together. “We’ll make sure that we tighten up that border like we’ve never seen before,” he said. \n\nTrump has threatened to impose 25% tariffs on all Canadian goods if Canada and Mexico do not stem the flow of migrants and fentanyl from entering the U.S. border — even though far fewer of each crosses into the U.S. from Canada than from Mexico. \n\nFord made the comments shortly after Canada’s federal government announced some more details about a billion dollar border plan that’s designed to avert the tariffs. Canada’s national police plans to create a new aerial intelligence task force to provide round-the-clock surveillance of Canada’s border using helicopters, drones and surveillance towers.\n\nCanada will also propose to the United States the creation of a North American “joint strike force” to target organized crime groups that work across borders. \n\n“We’re stepping up to keep our border strong and secure: By deploying new helicopters, drones and surveillance tools. By adding new scanners and sniffer dog teams to stop and seize fentanyl. By cracking down on the money laundering that’s funding cross-border crime,” Canadian Prime Minister Justin Trudeau said in a post on X. \n\nTrudeau is under pressure from some of his own lawmakers to resign after his finance minister quit cabinet. Ford said it’s up to Trudeau to resign and said Canada’s provincial premiers are united in telling the Americans how important U.S-Canada trade is. \n\nFord reiterated he would restrict electricity exports to Michigan, New York and Minnesota if the sweeping tariffs are imposed. \n\n“I want to sell them more energy, more critical minerals, but I’m going to always keep every tool in our tool box available” Ford said. “That’s the the last thing I want to do. We have the energy. They need the energy.”\n\nAbout 60% of U.S. crude oil imports are from Canada, and 85% of U.S. electricity imports as well.\n\nCanada is also the largest foreign supplier of steel, aluminum and uranium to the U.S. and has 34 critical minerals and metals that the Pentagon is eager for. \n\nNearly $3.6 billion Canadian ($2.7 billion) worth of goods and services cross the border each day. Canada is the top export destination for 36 U.S. states.\n\nFord said he spoke with the governors of Michigan and New York and they “fully understand.” Michigan is Ontario’s top trading partner. \n\n“We want to sit down and explain to Trump and inform him that we aren’t the enemy,” Ford said. “And as for Mexico I want to do a bilateral trade deal directly with the U.S.”\n\nFlows of migrants and seizures of drugs at the two countries’ border are vastly different. U.S. customs agents seized 43 pounds of fentanyl at the Canadian border during the last fiscal year, compared with 21,100 pounds at the Mexican border.\n\nMost of the fentanyl reaching the U.S. — where it causes about 70,000 overdose deaths annually — is made by Mexican drug cartels using precursor chemicals smuggled from Asia.\n\nOn immigration, the U.S. Border Patrol reported 1.53 million encounters with migrants at the southwest border with Mexico between October 2023 and September 2024. That compares to 23,721 encounters at the Canadian border during that time.","summary":"Ontario’s premier says Trump’s tariffs would be a disaster for US markets  The Associated Press","url":"https://apnews.com/article/canada-trump-us-ontario-ford-tariffs-2b8f74835456ed37d5c0b2f2e8688d7b","image":"https://dims.apnews.com/dims4/default/08c0867/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2F0a%2F12e4d74efe0c4be90276d6a583d3%2F3a8beaa2cc2d40378e3280e18dadabe1","video":null,"publish_date":"2024-12-18 00:27:00","author":"Rob Gillies","authors":["Rob Gillies"],"language":"en","category":"politics","source_country":"us","sentiment":0.277},{"id":274058706,"title":"PolitiFact Manages to Lie in Its Presentation of Its 'Lie of the Year' Award","text":"PolitiFact has unfurled its brand of accolade, “The Lie of the Year.” In an unsurprising fashion that is totally on-brand for the site, the deeply egregious falsehoods from the left were completely dispatched in order to saddle Donald Trump with the award. Biden is “sharp,” Biden will not step down, accurate clips of Biden are “cheap fake videos,” Kamala is not the Border Czar, Biden will not pardon Hunter – all were not as big as Trump accusing immigrants of eating pets.\n\nNot only were his comments based on reports out of Springfield, Ohio — and that Vance received from his own constituents — but in its piece, PolitiFact actually (get this) delivered lies of its own.\n\nThe site made a point in mentioning that Trump’s comments led to bomb threats and school closures, despite the widely reported fact that these were shown to be hoaxes, most of which originated from sources overseas.\n\nPolitifact's ‘Lie of the Year’ Glosses Over Bigger Whoppers, Including One Biden Told for Over a Yearhttps://t.co/AErWFG8og0— RedState (@RedState) December 17, 2024\n\nLegalized Press-titution – REUTERS\n\nWondering if Biden told the news outlet that “The money is on the dresser, sugar-bottom!”\n\nSome things to first consider. The press has told us that Donald Trump is going to corrupt and manipulate the media complex when he takes office. Also, the press LOVES to cloak themselves in the noble mission of holding those in power accountable. Just hold those concepts in mind as we now learn that Joe Biden paid a news syndicate to perform acts on his behalf, like an escort on-call.\n\nMike Benz has found a series of payouts to Reuters from a collection of U.S. government agencies. \n\nThe Biden Admin paid Reuters over $300 million in government contracts. 11 different Biden government agencies targeted Elon's businesses. All 11 agencies paid millions to Reuters. Reuters then won the Pulitzer Prize for \"their work on Elon Musk and misconduct at his businesses\" pic.twitter.com/3IGGtuHv7L— Mike Benz (@MikeBenzCyber) December 17, 2024\n\nBenz states that the payments were made to compel the news syndicate to go after Elon Musk and/or his business interests in its reporting. While this is not made immediately clear — an explanation possibly is that Reuters offers a series of business services and software work that was contracted out by a number of government agencies — it is still a bad position for what is primarily a media corporation.\n\nNo news outlet should have itself beholden to the government in this fashion, as it can be leveraged with that money. If you do not kill a story that is hurting the administration, for instance, there could be a threat of pulling the contracts for those services being commissioned.\n\nBoth Kinds of Standards – METRO UK\n\nYou all do realize that this means you also called Biden and Harris “Nazis,” correct?\n\nOne of the common retorts from opponents when Trump was named “Person of the Year” by Time Magazine was that this was also an award given to Adolph Hitler. This blithe dig is one thing when seen from randos on social media, but it is really bad to see a news outlet lapsing into this lazy Godwin move in its coverage.\n\nAnd yet, there is the Metro UK doing just this. What is telling is that in the coverage of Joe Biden and Kamala Harris picked four years ago, you saw not a single reference to the despots who previously won.\n\nAs the press struggles with the reality of people abandoning them as valued news sources, they continue with this behavior.Note that when Biden and Harris won POY, in the same outlet there was no mention of tyrants. This is undiluted hackery by @JessicaGKwong. pic.twitter.com/PQ0CQ5pMlD— Brad Slager: CNN+ Lifetime Subscriber (@MartiniShark) December 17, 2024\n\nBody-Checking the Fact-Checkers – CNN\n\nI see somebody went and woke Dale up, just before going back to work.\n\nThe four year vacation is over! Get to work!This must have been the clarion heard at CNN, as we see that Daniel Dale has been rousted from his avoidance of Joe Biden’s prevarications and is getting his muscle memory back in action to go after Donald Trump.\n\nIt will be expected this will become a busy time ahead for the ardent Canadian truth detector, who was so dedicated to his craft he managed to spot all of one falsehood told by Kamala Harris during her debate. (We collected nearly two dozen from that performance, in an effort to show Dale how his job is to be performed.)\n\nTDS Alert: CNN's Daniel Dale Is Back to 'Fact Checking' and the Jokes Just Write Themselveshttps://t.co/6Zb9YLg0TR— RedState (@RedState) December 17, 2024\n\nDNC PR Firm – CBS NEWS\n\nSo are we to gather that anything a SCOTUS member does for the first time is to be considered “historic”?\n\nA brief reminder, Norah O’Donnell is set to leave the CBS Evening News desk in a matter of days.\n\nWe just needed to point that out before we present to you the magnificence in the type of reporting we will be lacking in the days ahead, leaving us bereft and pining for the froth of yesterday.\n\nNorah went on a lengthy segment and interview with Supreme Court Justice Ketanji Brown Jackson as she makes history. Was this based on some type of key legislation or a ruling made that altered the American experience?Nope. KBJ sang a song on Broadway. That was it. That was the “historic” accomplishment.\n\nWe are going to miss you, Norah!\n\nCBS Evening News gushes over Justice Jackson's Broadway debut pic.twitter.com/02YcaWcPav— Jorge Bonilla (@BonillaJL) December 17, 2024","url":"https://townhall.com/columnists/bradslager/2024/12/17/politifact-manages-to-lie-in-its-presentation-of-their-lie-of-the-year-award-n2649201","image":"https://media.townhall.com/cdn/hodl/2022/125/66fbb8d3-a712-4029-9ed3-329460992e27.png","video":null,"publish_date":"2024-12-18 00:17:22","author":"Brad Slager","authors":["Brad Slager"],"language":"en","category":"politics","source_country":"us","sentiment":-0.231},{"id":274058702,"title":"As the Left Freaks Out About RFK, Jennings Reminds How 'Science Became Religion' During COVID","text":"This week, Robert F. Kennedy Jr. is on Capitol Hill to meet with senators as he hopes to be confirmed as President-elect Donald Trump's pick to serve as Secretary of Health & Human Services. As the nominee takes part in such meetings, RFK and Trump have sought to put to rest concerns that crucial vaccines, such as those for polio, will be at risk. Scott Jennings chimed in on such meetings and their strategies during Monday's episode of \"CNN NewsNight with Abby Phillip.\" He also issued a crcuial reminder of what it is that RFK should bring to the table, especially in a post-COVID world. \n\nAs host Abby Phillip asked Jennings to weigh in about concerns that Trump would get rid of vaccine mandates for school, Jennings made clear that the \"polio vaccine's fine,\" with Trump having \"laid down the marker,\" emphasizing \"we're not touching the polio vaccine\" and that \"this was totally put to bed today.\"\n\nHe also offered advice for Trump, which is where the reminders about how the country operated under COVID, and what we don't want to go back to, came into it. \"If I were in their shoes, I would just simply say everything we do is going to be based on science and evidenced-based decision-making, because that's all anybody really wants to hear,\" Jennings offered. \"And if I were further advising RFK and Donald Trump on vaccines or anything else, I would say, I'd like for science to go back to be science, because during COVID and during the last few years, science became religion. You know, when we're putting people up on pedestals and making prayer candles with their image on it and sewing pillows with their face on it, that's no longer science. That became a religion.\" \n\nJennings further emphasized moving away from treating science in such a way that it became a religion, adding, \"so, if I were in their shoes, I would say, science is going to rule, evidence-based decision-making is going to rule, and that's how we're going to make all our decisions.\"\n\n\"I'd like for science to go back to being science. During COVID, science became religion!\" @ScottJenningsKY pic.twitter.com/yjK1Fmqqkh— Townhall.com (@townhallcom) December 17, 2024\n\nAnother panelist, Ashley Allison, countered in part by bringing up something of an unrelated point, which is that RFK \"has pontificated on things, and he's not a doctor, and he's not an expert.\" The current head of HHS, Xavier Becerra, is particularly unqualified, especially as he's not a doctor either. His previous roles included serving as Attorney General as California and as a member of Congress.\n\nWhile the panel devolved at times to discussing concerns about vaccines overall, Jennings once more brought it back to COVID.\n\n\"I also think it's important for us to remember why are we here at all in this moment where people are questioning the public health regime, and it is all out of COVID,\" which even earned some agreement on the panel. \"Everything comes from COVID, things we were told that weren't true, things about the vaccine that we were told that weren't true. This has caused people--in the past folks, might have just accepted this sight unseen. Now, I think it's legitimate for Americans to say, are we being told the absolute truth by the supposed experts? I don't have a problem with those questions.\"\n\nAs Phillip tried to bring up how \"there was misinformation happening pretty far and wide in the COVID era,\" in a way that tried to make it sound like it was a both sides issue, Jennings also countered with his reminder that \"millions of school children, millions of people's small businesses, millions of lives were totally upended on things that ultimately we deeply, deeply regret,\" as he continued to remind the other panelists, especially Allison, that \"it was because we were lied to about the science.\"\n\nBest argument RFK can make for his HHS nomination: let’s make science actual science again. During COVID, “the science” became a religion and millions of kids and people suffered for it. My latest on @cnn. pic.twitter.com/jrEAgs0lLk— Scott Jennings (@ScottJenningsKY) December 17, 2024\n\nTo Jennings' main point, it's not an exaggeration to say that \"science became religion,\" especially with the votive candles devoted to Fauci, as he himself proudly displayed. Fauci also memorably declared that \"I represent science,\" and took issue with those who dared to question him. \n\nJennings' post of the segment to his X account received plenty of attention, from those in favor of Jennings' points, to those wanting to take issue with him, though mostly by focusing on other topics to do with COVID, as pollster Frank Luntz did. \n\nSen. Rand Paul (R-KY), who will serve as the chairman of the Homeland Security Committee for the 119th Congress, reposted Jennings' clip, with a message of \"Couldn’t have said it better myself[.]\"\n\nPaul and Fauci, as we've been covering from the start, have been particularly noteworthy foes, though Paul has vowed to keep investigating Fauci and COVID, even after Fauci retired as the director of the National Institute of Allergy and Infectious Diseases (NIAID). \n\n\"I think we’re on the cusp of, really, the beginning of uncovering what happened with COVID,\" Paul also said last month, when it was announced that he would chair the Committee.\n\nCouldn’t have said it better myself: https://t.co/MLQdb6EBQU— Rand Paul (@RandPaul) December 17, 2024","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/17/scott-jennings-on-covid-suffering-n2649181","image":"https://media.townhall.com/cdn/hodl/2022/266/075552e7-2dd5-437c-b1e5-627a33c429ba.png","video":null,"publish_date":"2024-12-18 00:17:22","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","source_country":"us","sentiment":-0.19},{"id":274058704,"title":"'Time to End the Lawfare Once and for All': Trump Reacts to Merchan's Latest Ruling","text":"On Monday, as we covered at the time, Judge Juan Merchan ruled that the hush money conviction against President-elect Donald Trump from May 30 withstands the U.S. Supreme Court ruling of Trump v. United States, handed down on July 1. Earlier on Tuesday, Trump weighed in with two strongly worded posts over Truth Social. From the start, Trump did not mince words, as he began by declaring his statement was \"BREAKING.\"\n\n\"In a completely illegal, psychotic order, the deeply conflicted, corrupt, biased, and incompetent Acting Justice Juan Merchan has completely disrespected the United States Supreme Court, and its Historic Decision on Immunity,\" Trump went on to say. From the start, there have been concerns about Merchan's conflict of interest, including when it comes to his adult daughter, Loren Merchan.\n\n\"But even without Immunity, this illegitimate case is nothing but a Rigged Hoax. Merchan, who is a radical partisan, wrote an opinion that is knowingly unlawful, goes against our Constitution, and, if allowed to stand, would be the end of the Presidency as we know it,\" Trump went on to warn. He also continued to emphasize Merchan and \"his family’s disqualifying and illegal conflicts[.]\"\n\nIn a subsequent post, Trump reminded that he is \"the only Political Opponent in American History not allowed to defend myself,\" likely referencing the gag order against him, referring to it as \"A despicable First Amendment Violation!\"\n\nTrump has strong words for DA Alvin Bragg's office as well, with how they handled the case stupefying a litany of legal experts, with the Truth Social post listing out many by name. \"Merchan took the Manhattan D.A.’s Witch Hunt, that, according to all Legal Scholars, including Jonathan Turley, Elie Honig, Andy McCarthy, Alan Dershowitz, Gregg Jarrett, David Rivkin, Elizabeth Price Foley, Katie and Andy Cherkasky, Paul Ingrassia, and many others, is a nonexistent case, barred by the Statute of Limitations, and should have never been brought and, through his fraud and misconduct, gave it a semblance of 'life.'\"\n\nThat the statue of limitations had already expired has long been a sharp criticism against Bragg's case. Republican members of Congress, such as Rep. Elise Stefanik of New York, who has since been selected as Trump's nominee to the United Nations, was among those calling out this \"zombie\" case once Trump was convicted. \n\nTrump also referenced the other criminal cases that had been brought against him, specifically by Special Counsel Jack Counsel, who last month moved to drop all of his cases against Trump, though he did so without prejudice, and so they may theoretically be brought back in 2029, when Trump is out of office. \n\n\"While Deranged Jack Smith was sent packing back to The Hague after losing all of his politically manufactured cases against me, Merchan, who is far worse and even more corrupt than Smith in his fight for my hopeless political opponents, just cannot let go of this charade. Is it because of his conflicts and relations that he keeps breaking the Law? This has to stop! It is time to end the Lawfare once and for all, so we can come together as one Nation and, Make America Great Again,\" Trump concluded, once more raising concerns about Merchan's conflicts of interest.\n\nWhen it comes to the legal experts Trump has named, many have weighed in over X to offer their thoughts on Merchan's ruling. Professor Jonathan Turley even put out a lengthy thread.\n\nAs predicted, Judge Merchan has rejected the challenge to the Bragg charges under the recent immunity decision of the Supreme Court. He tossed the challenge entirely but also found that any possible violations would be harmless error. Here is the opinion: https://t.co/Vbu5IwHTwa— Jonathan Turley (@JonathanTurley) December 17, 2024\n\n...There is also the question of what to do with sentencing in light of the reelection of Trump. Bragg is still suggesting that the court could leave Trump in suspended legal animation--serving as president awaiting a sentence...https://t.co/N2tRhohtfe. .— Jonathan Turley (@JonathanTurley) December 17, 2024\n\n...Notably, the decision shatters the widespread claim of many on the left that the Supreme Court created absolute immunity. In this opinion, the court found multiple and independent grounds for placing conduct outside of the parameters created by the court...— Jonathan Turley (@JonathanTurley) December 17, 2024\n\n...While there are good-faith arguments for appeal, many judges would agree with the outcome. It shows that the Supreme Court was more balanced and nuanced than claimed. Merchan found multiple grounds for rejecting immunity under Trump v. United States. https://t.co/jEKfKId6qn— Jonathan Turley (@JonathanTurley) December 17, 2024\n\nOthers weighing in included Andy McCarthy for National Review and attorney Paul Ingrassia. \n\nAlan Dershowitz also teased discussion of Merchan's ruling for Tuesday night's show.\n\nAs Expected, Judge Merchan Denies President-elect Trump’s Immunity Claim - unrealistic to think Bragg and Merchan were going to confess error or dismiss case, but I don’t think Trump will ever be formally convicted and sentenced. Delay, delay, delay works. https://t.co/gz4XxoIjuh— Andy McCarthy (@AndrewCMcCarthy) December 17, 2024\n\nThe doctrine of Presidential Immunity is time-honored and was just again fortified by the Supreme Court this past year. I appreciate the President’s reference to my writing, alongside a distinguished list of first-rate legal scholars!Merchan is completely out of line with this… pic.twitter.com/YCnYeEdsau— Paul Ingrassia (@PaulIngrassia) December 17, 2024\n\nNY Judge doubles down on Trump unconstitutional hush $ conviction. Watch the Dershow live @ 5:30pm est on Youtube and Rumble. Leave a question in the live chat. https://t.co/A9G3R0eDmu— Alan Dershowitz (@AlanDersh) December 17, 2024\n\nThe case is strongly believed to be overturned on appeal, as Jeff Clark, who served as Assistant Attorney General for the Civil Division, also reminded over X with a quoted repost of Turley. \n\nThis Merchan opinion will be reversed on appeal, even if it has to go all the way to the U.S. Supreme Court. https://t.co/gDH5Ph7S1a— Jeff Clark (@JeffClarkUS) December 17, 2024","url":"https://townhall.com/tipsheet/rebeccadowns/2024/12/17/time-to-end-the-lawfare-once-and-for-all-trump-reacts-to-merchans-latest-ruling-n2649204","image":"https://media.townhall.com/cdn/hodl/2024/151/87e7acdf-023b-455e-8dca-c8fa171a5173.jpg","video":null,"publish_date":"2024-12-18 00:17:22","author":"Rebecca Downs","authors":["Rebecca Downs"],"language":"en","source_country":"us","sentiment":-0.724},{"id":274060406,"title":"Electoral College votes to confirm 2024 election results","text":"Electoral College votes to confirm 2024 election results\n Presidential electors gathered Tuesday to formalize President-elect Donald Trump's victory over Vice President Kamala Harris in the 2024 election. Members of the Electoral College met at state capitols across the U.S. to cast their electoral votes. CBS News election law expert and political contributor David Becker joins to break down the process.","summary":"Presidential electors gathered Tuesday to formalize President-elect Donald Trump's victory over Vice President Kamala Harris in the 2024 election. Members of the Electoral College met at state capitols across the U.S. to cast their electoral votes. CBS News election law expert and political contributor David Becker joins to break down the process.","url":"https://www.cbsnews.com/video/electoral-college-votes-confirm-2024-election-results/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/18/e4beac51-6076-4fcc-b6c9-fd17464fc298/thumbnail/1200x630/c68791520c612e33eeefc1ac6650bd54/cbsn-fusion-electoral-college-votes-confirm-2024-election-results-thumbnail.jpg?v=564e83c5974b3893ba1bcac5fe5947a","video":null,"publish_date":"2024-12-18 00:16:51","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.964},{"id":274058618,"title":"Trump's lawyers say juror misconduct tainted verdict","text":"President-elect Donald Trump's lawyers allege his conviction on criminal charges stemming from hush money paid to a porn star was tainted by juror misconduct, but details were scant because much of their court filing was redacted from public view.\n\nIn a filing dated December 3 and made public on Tuesday, Trump's lawyers said Justice Juan Merchan should keep the misconduct allegation in mind while considering a separate motion to dismiss the charges.\n\nJurors in the trial were anonymous. Merchan said in a court filing on Monday that making the misconduct allegations public without redactions could place them at risk.\n\nManhattan District Attorney Alvin Bragg's office, which brought the charges, said the defence's \"vague\" allegations fell short of the standard that would require a hearing to investigate them.\n\nIn a letter dated December 5 and also made public on Tuesday, the prosecutors said Trump was seeking to inject \"unsworn, untested, and at least partially inaccurate allegations into the public domain\".\n\nThe case stemmed from a $US130,000 ($A205,112) payment that Trump's former lawyer Michael Cohen made to adult film actor Stormy Daniels. The payment was for her silence before the 2016 election about a sexual encounter she has said she had a decade earlier with Trump, who denies it.\n\nThe Manhattan jury in May found Trump guilty of 34 counts of falsifying business records to cover up the payment. It was the first time a US president - former or sitting - had been convicted of or charged with a criminal offence.\n\nAfter Trump defeated Democratic Vice President Kamala Harris in presidential election, defence lawyers urged Merchan to overturn the conviction on the basis that having the case loom over Trump after he begins his second White House term on January 20 would disrupt his ability to govern.\n\n\"The Court should not avert its eyes to the complete lack of fundamental fairness to President Trump throughout these proceedings,\" Trump's lawyers wrote.\n\nBragg's office has said measures short of overturning the conviction, such as guaranteeing that Trump will not face prison time, would assuage his concerns.\n\nTrump on Monday lost yet another bid to dismiss the case when Merchan rejected his argument that the Supreme Court's July ruling recognising immunity from prosecution for a president's official acts meant the verdict could not stand.\n\nThe judge sided with the prosecutors, who argued that the conduct at issue in the hush money case was personal in nature.","summary":"Donald Trump's lawyers say his hush money conviction was tainted by juror misconduct, opening a new front in their fight to overturn the verdict.","url":"https://thewest.com.au/news/crime/trumps-lawyers-say-juror-misconduct-tainted-verdict-c-17122663","image":"https://images.thewest.com.au/publication/C-17122663/34ce239d9758a1cdc97c25451bf74948b988b5a1-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-12-18 00:15:51","author":"Luc Cohen","authors":["Luc Cohen"],"language":"en","category":"politics","source_country":"au","sentiment":-0.508},{"id":274058934,"title":"Ghana’s 2024 general election, lessons for Nigeria","text":"Last Saturday, December 7, 2024, Ghana had its ninth general election in its Fourth Republic, which started with the 1992 Constitution. On Monday, December 9, the Chairperson of the Electoral Commission of Ghana, Mrs Jean Mensa, officially declared John Dramani Mahama of the National Democratic Congress as the president-elect. The presidential poll, held across the 40,976 polling stations contested by 12 of the 15 registered political parties and four independents with 18,774,159 registered voters resulted in a landslide victory for the former president, Mahama. According to the EC chairperson who was the returning officer, Jean Mensa, Ex-president John Mahama polled 6,328,397 representing 56.55 per cent, while the Vice President and presidential candidate of the governing New Patriotic Party, Dr Mahamudu Bawumia, secured 4, 657, 304, representing 41.61 per cent, representing. Voter turnout was officially put at 60.9 per cent. A turnout “Big Brother” Nigeria still dream of.\n\nIt is noteworthy that the NPP candidate and the outgoing Vice President of Ghana, Dr Mahamudu Bawumia, had on Sunday, December 8, showed statesmanship by calling his main rival, John Mahama, to concede victory and congratulate him. That singular action was taken ahead of the conclusion of the vote tallying deescalated tension in the country. It is quite exemplary! Mahama, Ghana’s president between 2012 and 2016 like Donald Trump had successfully staged a comeback to the Jubilee House after a series of losses to the outgoing President Nana Akufo Addo in 2016 and 2020. Another epochal thing with the just concluded election is that Ghana has made history by producing its first female Vice President-Elect, Prof. Naana Jane Opoku-Agyemang. She was the former vice-chancellor of the University of Cape Coast and later in 2013 appointed Minister of Education by John Mahama.\n\nIt is noteworthy that no political party has been able to win more than two elections back-to-back in Ghana since 1992. The electoral upset which led to the massive defeat of the ruling New Patriotic Party follows the political trajectory in Liberia in November 2023, Senegal in March 2024, the UK in July 2024, and the US in November 2024. In these countries, opposition political parties were able to roundly defeat the party in power, thereby, causing political upset. The causative factors in all of these are the rising cost of living, inflation, and unemployment.\n\nThough Ghana has long established itself as an oasis of democracy in what is regarded as the coup belt of Africa; last Saturday’s elections are not without flaws. According to the appraisal of the elections done by a Ghanaian newspaper, Myjoyonline, “The exercise, which started peacefully on Saturday morning, later escalated into chaos in some parts of the country due to issues of attempted rigging, and delays in the collation of results in some constituencies. The post-election violence has claimed three lives, with many others injured. The Ghana Police Service has so far arrested 89 people for various election-related offences.” There were also reported cases of vote buying on the internet.\n\nI was on the Nigerian Television Authority flagship breakfast show called ‘Good Morning Nigeria” last Monday, December 9. I was an accredited observer under the platform of The Carter Centre in 2008 and I am of the view that Nigeria could learn a few things from its West Africa Anglophone neighbour. Ghana, a country of over 34 million people with 16 administrative regions and 276 electoral constituencies shares a common history with Nigeria. Apart from being a former British colony, the country also had its fair share of military rule. Under Section 44 (2) of Ghana’s 1992 Constitution, the chairperson of the electoral commission is appointed on similar conditions as a Justice of the Court of Appeal.\n\nAmong the similarities between Nigeria and Ghana is: They are both in their Fourth Republic, running multiparty democracy. Despite having a de jure multiparty system, they are both de facto two-party countries. While the two dominant political parties in Nigeria are the All Progressives Congress and the Peoples Democratic Party, in Ghana, the dominant political parties are the New Patriotic Party and the National Democratic Congress. Both countries are members of the Economic Community of West African States and long-time trade partners; both countries run a presidential system of government of four-year tenure and a maximum of two terms for executive positions. Both nations now sign peace accords ahead of presidential elections. The voting age in Ghana is 18 just like in Nigeria. \n\nIn Ghana, just like in Nigeria, there is no grant given to political parties. They source their money internally without limit while foreign donation is barred. According to Section 55 (15) of Ghana’s 1992 Constitution, only a citizen of Ghana can contribute or donate to a political party registered in Ghana. What, however, is doubtful is whether there is strict enforcement of this clause. Party members in Ghana buy party souvenirs. I saw many of them with their party flags, mufflers, handkerchiefs, T-shirts, etc. The parties in turn provide free transport service to party members who may wish to travel to where they registered to vote.\n\nUnlike in Nigeria, however, Ghana has provision for independent candidacy; voting hours are from 7 am–5 pm and there is no lockdown of the country as with the case in Nigeria. Election day in Ghana is December 7 of the election year and the swearing-in date for the new president is January 7 of the new year. This is very much like the US, where the election is the first Tuesday in November of the election year and the inauguration is on January 20 of the following year. To win the presidential election in Ghana, a candidate needs to win 50+1 per cent of the valid votes cast. That means the absolute majority of the votes cast. To be eligible to run in the presidential election, candidates must be Ghanaian, 40 years or older, and registered voters. Candidates for parliamentary seats must be Ghanaians of 21 years or older and registered voters. Candidates for the elections must not owe allegiance to any other country and must have settled all tax obligations.\n\nUnder the Ghana electoral system, there is a provision for voting by proxy and special or early voting. While voting by proxy allows a person to vote on behalf of another person, special voting is meant for electoral officials, media practitioners and members of armed forces, who are likely to be on election duty. Early voting takes place on December 2. In the just concluded elections, 1,291 voters cast their votes by proxy, allowing someone else to vote on their behalf. Ghana’s electoral system recognises voting by proxy for voters who are sick, outside the country, or unable to participate on election day. However, a proxy voter can only vote for one person.\n\nUnlike Nigeria, which runs a bicameral legislature, Ghana has a unicameral legislature. Unlike Nigeria, which has two electoral management bodies, i.e. INEC and state independent electoral commissions, Ghana has only one, which is the Electoral Commission of Ghana, currently headed by a lady, Mrs Jean Mensa. Ghana’s electoral commission has seven members- a chairman, two deputy chairmen and four other members. Nigeria, on the other hand, has a 14-member commission- a chairman, 12 national commissioners and the secretary.\n\nTruth be told, Ghana has better political credentials than Nigeria and we can learn and borrow some useful ideas from our dear neighbour. Things like the civic political culture, provision for early voting, independent candidacy, robust political party management system and a constitutionally backed date for elections, the election of more women into executive and legislative positions, reduction of qualification age to run for state houses of assembly and councillorship positions from 25 to 21, and more issue-based campaigns are some of the useful lessons we can learn from the land of the Black Stars.As the tenure of Prof Mahmood Yakubu as INEC chairman ends next year, President Bola Tinubu should scout for a virtuous woman to replace him. Ahead of the 2027 presidential poll, APC and PDP should think about having female vice presidential candidates.\n\nX: @jideojong","summary":"Last Saturday, December 7, 2024, Ghana had its ninth general election in its Fourth Republic, which started with the 1992 Constitution. On Monday, December 9, the Chairperson of the Electoral Commission of Ghana, Mrs Jean Mensa, officially declared John Dramani Mahama of the National Democratic Congress as the president-elect. The presidential poll, held across the [&#8230;]\n\n\nThe post Ghana’s 2024 general election, lessons for Nigeria appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2024/12/18/ghanas-2024-general-election-lessons-for-nigeria/","image":"https://www.ghanamma.com/wp-content/uploads/2024/12/JIDE-OJO.jpg","video":null,"publish_date":"2024-12-18 00:11:39","author":"Ghana News","authors":["Ghana News"],"language":"en","source_country":"gh","sentiment":-0.123},{"id":274057786,"title":"Hungary blocks EU funding for arms shipments to Ukraine","text":"Budapest, Dec 17: Hungary has once again vetoed the European Union's (EU) allocation of 6.5 billion euros ($6.83 billion) to member states supplying weapons to Ukraine, Foreign and Trade Minister Peter Szijjarto announced in Brussels.Speaking after a meeting of the EU Foreign Affairs Council, Szijjarto on Monday confirmed on his official Facebook page that he had blocked disbursement of the funds from the European Peace Facility, citing Hungary's long-standing opposition to mandatory contributions of arms shipments, Xinhua news agency reported.\"Hungary has not supplied weapons before, has not contributed to any arms shipments,\" Szijjarto said. He stressed that while Hungary would not interfere with member states funding such initiatives voluntarily, it would not support making these contributions compulsory. Szijjarto also voiced his disapproval of the proposed relocation of an EU coordination unit to Kyiv and deploy advisors for security sector reforms in Ukraine. He called these measures \"highly dangerous and escalating the conflict,\" highlighting the associated risks of personnel deployment within an EU framework.Moreover, the minister rejected proposals to sanction Russia's UN ambassador and its Olympic Committee, stating, \"Mixing sports with geopolitics is unacceptable.\" Describing Brussels' approach as a \"pro-war strategy\" that ignored a \"new reality\" shaped by recent Russian battlefield gains and the reelection of US President Donald Trump, the minister expressed broader criticism of EU policies.Szijjarto said that the council's rejection of his government's recent Christmas ceasefire proposal was disappointing. \"Not only was there no support for a ceasefire that could save lives, but many argued against it,\" he remarked. He stressed that halting the fighting could achieve what armaments valued at tens or hundreds of billions of euros have failed to accomplish: preventing further Russian advances.","url":"https://assamtribune.com/international/hungary-blocks-eu-funding-for-arms-shipments-to-ukraine-1561397","image":"https://assamtribune.com/images/logo.png","video":null,"publish_date":"2024-12-18 00:11:22","author":"Ians","authors":["Ians"],"language":"en","category":"politics","source_country":"in","sentiment":-0.452},{"id":274057968,"title":"Musk accuses ‘deep state traitors’ of targeting him","text":"US federal agencies have initiated at least three reviews into whether Elon Musk and his rocket company, SpaceX, complied with security reporting protocols designed to safeguard state secrets, according to people familiar with the matter who spoke with the New York Times.\n\nElon Musk currently holds a top-secret security clearance at SpaceX, the highest level granted by the Defense Counterintelligence and Security Agency. This clearance allows him access to highly sensitive classified information, including advanced US military technology, but he is required to report details of his private life under the “continuous vetting” rules.\n\nThe investigations were triggered by alleged repeated failures to report crucial details about Musk's travel and other activities, including meetings with foreign leaders, the NYT reported on Tuesday.\n\nSpaceX employees responsible for ensuring compliance have allegedly raised concerns about lax reporting practices within the company since at least 2021. But according to the publication, complaints reached a “tipping point” following Musk’s public support for President-elect Donald Trump and his growing potential “influence” in the upcoming US administration.\n\n”Deep state traitors are coming after me, using their paid shills in legacy media. I prefer not to start fights, but I do end them...” Musk wrote on X on Tuesday, responding to the NYT allegations.\n\nThe Defense Department’s Office of Inspector General opened its review this year, while the Air Force and the Pentagon’s Office of the Under Secretary of Defense for Intelligence and Security began separate investigations last month, the NYT reported. The agencies have declined to officially confirm or deny the existence of these reviews and have not accused the South African billionaire of disclosing classified material.\n\nLast month, Senator Jeanne Shaheen, a Democrat from New Hampshire and a member of the Senate Committees on Armed Services and Foreign Relations, expressed concern about Musk’s potential to inadvertently disclose sensitive information. In a letter to the Pentagon Inspector General and the US Attorney General, Shaheen and Senator Jack Reed of Rhode Island cited an October article in the Wall Street Journal claiming that Musk had multiple conversations with Russian officials, including President Vladimir Putin in 2022. The newspaper relied on anonymous sources, and provided no evidence to support the assertions.\n\nMusk has dismissed those claims, referring to the senators as “puppets” and questioning who was behind the letter. “Who actually wrote this and made those knuckleheads sign it?” he wrote on X at the time.\n\n”There will be consequences for those who pushed foreign interference hoaxes,” he vowed last month, threatening to take action against officials and politicians making baseless accusations. “I’m going to find out who’s making these accusations and nuke them.”\n\nThe allegations of links between Musk and Russia echo similar accusations leveled against Donald Trump during his first term in office. Those widespread claims, fueled by media reports and inconclusive investigations, were used to undermine his presidency but were later found to be without basis. The Kremlin has also denied claims that Musk frequently communicated with Putin, calling the allegations another ingredient “tossed into” the US political struggles.\n\nMusk has actively supported the president-elect and has become an increasingly influential figure among his team. Trump appointed Musk and entrepreneur Vivek Ramaswamy to head the Department of Government Efficiency (DOGE), a new initiative tasked with reducing government waste and streamlining the federal bureaucracy.","summary":"US federal agencies have initiated several reviews into whether Elon Musk complied with protocols designed to safeguard state secrets \nRead Full Article at RT.com","url":"https://www.rt.com/news/609503-musk-security-clearance-probes/","image":"https://mf.b37mrtl.ru/files/2024.12/article/67620ecc20302710b259475a.jpg","video":null,"publish_date":"2024-12-18 00:03:44","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":0.043},{"id":274058158,"title":"Everybody is showing up in Mar-a-Lago, highlights Kevin O’Leary","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit December 17, 2024 04:24 \n\n Everybody is showing up in Mar-a-Lago, highlights Kevin O’Leary \n ‘Shark Tank’ investor Kevin O’Leary discusses how CEOs are amping up their investment in America before President-elect Donald Trump takes office on ‘The Evening Edit.’\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags WHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITPOLITICS","summary":"‘Shark Tank’ investor Kevin O’Leary discusses how CEOs are amping up their investment in America before President-elect Donald Trump takes office on ‘The Evening Edit.’","url":"https://www.foxbusiness.com/video/6366155922112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/e5d62194-4de1-4164-bba5-6c843896cd41/0ab88c45-911a-4926-b65e-21896c531425/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-18 00:03:43","author":null,"language":"en","source_country":"us","sentiment":-0.243},{"id":274055882,"title":"Biden administration gas export report could upset Trump energy plans - POLITICO","text":"“The DOE will use the study to determine whether LNG exports are in the public interest, a legal requirement under the Natural Gas Act,” Parker said in an email to POLITICO. “This new study should bolster arguments that any public interest analysis is flawed if it doesn’t recommend denying LNG export licenses, because the harms from these exports clearly outweigh the benefits.”\n\nThe long-awaited report comes after a nearly yearlong pause in the administration’s processing of new approvals for liquefied natural gas exports, which Republicans and many in the energy industry decried as a political move by Biden to appease climate activists. The report isn’t likely to prevent Trump from approving the new projects soon after entering office, said an industry lawyer who has discussed the plans with members of Trump’s transition team and was granted anonymity to discuss private conversations.\n\n“The Trump team is really indifferent to this report,” said this person, who was granted anonymity to discuss private conversations.\n\nStill, Granholm said the findings should inform the Trump administration’s decisions. DOE officials said they considered the report final but would still allow 60 days for public comment. One official, speaking on background, said they expect the incoming Trump administration to wait until it has analyzed comments before weighing in on new projects.\n\n“We hope they’ll take these facts into account to determine whether additional LNG exports are truly in the best interest of the American people and the economy,” Granholm told reporters.\n\nDemocratic Rep. Sean Casten (Ill.), speaking alongside environmental groups after the report’s release, hammered home the economic point on a call with environmental groups. \n\n“If you are a U.S. gas producer or investor and you have the opportunity to sell it to people in the United States at one price, or sell it to people overseas at a higher price, you’re going to take the higher price because you want to make more money — nothing wrong with that,” Casten said. “But if you’re exporting gas overseas to take a higher price by definition you are raising the price in the United States.\n\n“It is not in the national interests to raise the price of energy to U.S. consumers, for us to disrupt U.S. communities or for us to accelerate the impacts of global warming,” Casten continued. \n\nA spokesperson for the Trump transition team did not address questions on whether the new administration would take the report into consideration as it weighs whether to approve new projects.\n\n“Families have suffered under the past four years’ war on American energy, which prompted the worst inflation crisis in a generation,” transition spokesperson Karoline Leavitt said in an email. “When he takes office, President Trump will make America energy dominant again, protect our energy jobs, and bring down the cost of living for working families.”\n\nBy highlighting the economic argument against LNG exports, the Biden administration may be hoping to reach Trump supporters with a populist economic message. When Biden officials first launched the review in January, they highlighted the climate impacts of processing and burning the gas as one of the areas of main concern. But the administration in its final product stressed the economic impacts unfettered growth in U.S. gas exports could have on domestic prices, said Tyson Slocum, energy director at government watchdog group Public Citizen.\n\n“On the economics, it’s a no-brainer,” Slocum said in an interview. “Donald Trump and Republicans are talking about how they won the election because of moderate and low income voters concerned about rising energy prices. Here you have a peer reviewed Department of Energy study that dives into the economic elements of exports and finds those same voters are most susceptible to harm from LNG exports.”","url":"https://www.politico.com/news/2024/12/17/biden-gas-export-trump-00194824","image":"https://www.politico.com/dims4/default/2505141/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fba%2Fe8%2F14a92db9411caac563e30fe99f91%2Fcop29-climate-summit-11529.jpg","video":null,"publish_date":"2024-12-18 00:03:43","author":"Ben Lefebvre","authors":["Ben Lefebvre"],"language":"en","category":"politics","source_country":"us","sentiment":0.063},{"id":274055880,"title":"House Dems solidify their anti-Trump policy chiefs - Live Updates - POLITICO","text":"House Democrats have largely set their team for countering President-elect Donald Trump’s agenda next year. While the caucus is still making other Democratic committee heads official, they decided several contested panel leader elections Tuesday morning, with uncontested elections for leadership recommendations later in the day. House Democrats largely saw the contested races to lead Democrats on the Oversight, Agriculture and Natural Resources Committees as a check on seniority in the caucus — and a way to instill fresher talent from the ranks. On the Natural Resources panel, Rep. Jared Huffman (Calif.) is replacing Rep. Raúl Grijalva (Ariz.), who ended his bid to lead Democrats on the panel again. On the Agriculture panel, Rep. Angie Craig (Minn.) beat Rep. David Scott (Ga.), who faced questions about his health and finished in a distant third in an internal caucus panel election before dropping out of the race. On Oversight, Rep. Gerry Connolly (Va.) defeated Rep. Alexandria Ocasio-Cortez (N.Y.), though both would have represented new leadership after Rep. Jamie Raskin (Md.) launched a bid for the ranking position on Judiciary. Although they won’t hold gavels, House Democrats are looking to counter the incoming Republican trifecta and Trump however they can. Former Speaker Nancy Pelosi played a prominent role on that front during his first term, and personally backed two of the three new ranking members on key positions. Heading into the next Congress, Democrats had fretted about their aging leaders’ ability to respond to conservative policy changes on the farm bill in the Agriculture Committee and in energy policy on Natural Resources. They also see high-profile panels like the Oversight Committee as a messaging bulwark against the Trump administration. Here’s what the new rankers will do from their leadership perches: Oversight and Accountability Committee Connolly, a seasoned investigator, told reporters Tuesday that he’s experienced at countering Trump, and his strategy to fight Republicans was going to be “to tell the truth.” “And if that hurts, then we know we’ve made our mark,” Connolly said. He added that “we will do a thorough assessment of the committee on the Democratic side and make appropriate changes.” Connolly had earned plaudits from his colleagues for his tenure on the Oversight panel, where he worked on Postal Service issues and currently serves as the top Democrat on a subpanel on cybersecurity. His allies also pointed to his deep well of relationships in the Democratic caucus, including in the centrist New Democrat Coalition, which had backed him during the elections for the top spot on the panel. “He's bright, he's witty,” said Rep. Gregory Meeks (D-N.Y.), who helped campaign for Connolly. “I've seen him on the Foreign Affairs committee, taking charge of the issue, particularly when the Republicans are overstepping, etc., as well as doing it in a way that brings us all together. … And I think that's who Gerry is.” Connolly said he was diagnosed with cancer in a statement after the election. In private conversations as he sought the top Oversight spot, Connolly said he has pledged to his colleagues that he will be transparent about the status of his diagnosis, including if it were to unexpectedly worsen. Natural Resources Committee Huffman is now in a key position to challenge Republicans' effort to enact Trump’s planned “drill, baby, drill” push. The Californian has a decade of experience on the committee and is known for his frequent sparring with Republicans, plus policy chops that he developed when he worked as an attorney for the Natural Resources Defense Council. He was a leader among Democrats clamoring for a generational change atop committee leadership. In taking over the panel that oversees federal lands issues, including energy production and permitting, Huffman told reporters Tuesday he planned to aggressively defend against Republicans’ “Project 2025 agenda” while building on Grijalva’s legacy to “put environmental justice first and really lifted up his disadvantaged communities that bear the brunt of the climate crisis.” Huffman had the backing of the large and powerful California delegation, including Pelosi, who he thanked “for her advice and support.” Huffman’s backers cited his knowledge of environmental and climate issues, advocacy for tribes and environmental justice, and his pragmatic streak, along with his work raising money for colleagues on the committee and in the caucus running in tough districts. Agriculture Committee Craig’s defeat of Scott and Rep. Jim Costa (D-Calif.) will make her the first woman ranking member of the House Agriculture panel, which some of her supporters touted as a shot at the “boys club” of panel leadership, according to one House Democratic lawmaker who was granted anonymity to discuss the internal caucus dynamics. It’s also a loss for Pelosi, who was advocating for Costa, her fellow Californian, along with the state’s powerful delegation, behind the scenes. In comments to reporters right after her win, Craig noted it wasn’t easy overcoming the “powerful California” delegation. In a series of closed-door meetings over the past week, Craig made an aggressive pitch to Democratic House members, citing her credentials as a frontline Democrat from a rural district. She also argued during the closed-door Steering panel meeting that the party needed a Midwestern battleground Democrat in committee leadership to balance out the many senior Democratic leaders hailing from the coasts. Craig is incredibly well-liked by a wide swath of members, especially younger members who are growing their ranks. Young female members, especially on the Agriculture Committee, wanted to help her climb.","url":"https://www.politico.com/live-updates/2024/12/17/congress/house-dems-anti-trump-team-00194948","image":"https://www.politico.com/dims4/default/954973b/2147483647/resize/1200x/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F9b%2F54%2Fe7838dad40f78bc7706bd393fc53%2Fu-s-congress-26163.jpg","video":null,"publish_date":"2024-12-18 00:03:43","author":"Daniella Diaz,Josh Siegel,Nicholas Wu","authors":["Daniella Diaz","Josh Siegel","Nicholas Wu"],"language":"en","source_country":"us","sentiment":0.108},{"id":274058554,"title":"After investigating Jan. 6, House GOP sides with Trump and goes after Liz Cheney","text":"WASHINGTON - \n\n\r\n Wrapping up their own investigation on the Jan. 6 2021 Capitol attack, House Republicans have concluded it's former GOP Rep. Liz Cheney who should be prosecuted for probing what happened when then-President Donald Trump sent his mob of supporters as Congress was certifying the 2020 election.\n\n\r\n The findings issued Tuesday show the Republican Party working to reinforce Trump's desire to punish his perceived enemies including Cheney and members of the Jan. 6 committee that the president-elect has said should be in jail.\n\n\r\n House Administration Committee Chairman Barry Loudermilk, R-Ga., wrote, “Until we hold accountable those responsible, and reform our institutions, we will not fully regain trust.”\n\n\r\n\r\n Read more of the latest international headlines\r\n\n\r\n The panel Republicans' 128-page interim report arrives as Trump is preparing his return to the White House and working to staff his administration with officials at the highest levels, including Kash Patel as FBI Director, who appear like-minded in his efforts at retribution. Trump also vows to pardon people who were convicted for roles in the riot at the Capitol.\n\n\r\n It revisits long-running Republican arguments that Trump is not to blame for the attack on the Capitol. The Department of Justice has prosecuted some 1,500 people including the leaders of the militant Oath Keepers and Proud Boys, and indicted Trump on four criminal charges, including conspiracy to overturn the election. Special counsel Jack Smith has since abandoned the case against Trump ahead of the inauguration in adherence to Justice Department guidelines that sitting presidents cannot be charged.\n\n\r\n But the new report's conclusion singles out Cheney, the daughter of the former vice president, and herself once a rising conservative star who was kicked out of GOP leadership after her vote to impeach Trump for inciting the insurrection. Once she became vice chair of the Jan. 6 committee, Cheney lost her own reelection to a Trump-backed challenger in Wyoming. By fall, Cheney was working to stop Trump from returning to the White House, having campaigned for Vice President Kamala Harris.\n\n\r\n Cheney on Tuesday delivered a detailed defense of her committee’s painstaking work, the 900-page Jan. 6 report released in December 2022, and said Loudermilk’s own report “disregards the truth.”\n\n\r\n \"January 6th showed Donald Trump for who he really is – a cruel and vindictive man who allowed violent attacks to continue against our Capitol and law enforcement officers while he watched television and refused for hours to instruct his supporters to stand down and leave,” Cheney said in a statement.\n\n\r\n “Now, Chairman Loudermilk’s ‘Interim Report’ intentionally disregards the truth and the Select Committee’s tremendous weight of evidence, and instead fabricates lies and defamatory allegations in an attempt to cover up what Donald Trump did.”\n\n\r\n\r\n The information you need to know, sent directly to you: Download the CTV News App\r\n\n\r\n President Joe Biden is considering issuing pardons to spare members of Congress and others from Trump’s wrath. But several of the people involved have said they are not seeking or don’t want pardons from Biden.\n\n\r\n Among those Trump wants prosecuted are Speaker Emerita Nancy Pelosi, Cheney and others members of the Jan. 6 committee, as well as Smith, the DOJ special counsel who indicted Trump.\n\n\r\n The report's release comes at a timely moment when Congress will be asked in the weeks ahead to confirm the results of the 2024 election. But unlike four years ago, when Republicans refused to accept Biden's victory over Trump and claimed voter fraud, the Democrats say they trust and accept the election results.\n\n\r\n The GOP panel's findings revisit the multiple security failings on Jan. 6, 2021, and revive the dispute over the lag in calling in the National Guard, which along with police reinforcements, restored order at the Capitol by nightfall. Congress returned to work that evening and worked into the next morning to certify the 2020 election for Biden.\n\n\r\n \"This report reveals that there was not just one single cause for what happened at the U.S. Capitol on January 6,\" Loudermilk wrote in an introduction. “The Capitol is no safer today.”\n\n\r\n But Loudermilk focuses just as intently on the Jan. 6 committee that then-Speaker Pelosi stood up in the aftermath to investigate what happened, and its leaders Chairman Bennie Thompson, D-Miss., and Cheney.\n\n\r\n The report singles out Cheney for prosecution for her role in working with one of the star witnesses against Trump, a former young White House aide, Cassidy Hutchinson, who provided some of the most detailed descriptions of the defeated president's actions that day.\n\n\r\n Hutchinson had testified before the Jan. 6 committee in 2022 hearing that she had not been forthcoming during her first interviews with the panel and had a “moral struggle” and wanted to return.\n\n\r\n She eventually ditched her Trump-aligned lawyer and later delivered a blockbuster public hearing, describing Trump at the White House as the Capitol riot unfolded.\n\n\r\n Cheney, in her own account in her book “Oath and Honor” of the committee's work, had been crucial in meeting with Cassidy and worried for her safety as she decided to come forward.\n\n\r\n Loudermilk's panel concludes these actions are witness tampering and grounds for prosecution.\n\n\r\n “Numerous federal laws were likely broken by Liz Cheney,” the committee wrote in its conclusion. “These violations should be investigated by the Federal Bureau of Investigation.”\n\n\r\n It also says Thompson broke House rules in the handling of files and transcripts.\n\n\r\n Thompson said the report was filled with “baseless” allegations. “There’s no escaping the reality that Donald Trump bears the responsibility for the deadly January 6th attack no matter how much Mr. Loudermilk would love to rewrite history,” he said.\n\n\r\n Trump in an interview earlier this month revived his campaign promises to go after those who blamed him for Jan. 6.\n\n\r\n “Honestly, they should go to jail,” referring to members of Congress who investigated the Capitol attack.","summary":"Wrapping up their own investigation on the Jan. 6 2021 Capitol attack, House Republicans have concluded it's former GOP Rep. Liz Cheney who should be prosecuted for probing what happened when then-President Donald Trump sent his mob of supporters as Congress was certifying the 2020 election.","url":"https://www.ctvnews.ca/world/after-investigating-jan-6-house-gop-sides-with-trump-and-goes-after-liz-cheney-1.7149442","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/17/liz-cheney-1-7149449-1734479995309.jpg","video":null,"publish_date":"2024-12-18 00:03:40","author":"Lisa Mascaro,The Associated Press","authors":["Lisa Mascaro","The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.381},{"id":274062852,"title":"How Elon Musk and Taylor Swift Can Resolve U.S.-China Relations","text":"I just spent a week in Beijing and Shanghai, meeting with Chinese officials, economists and entrepreneurs, and let me get right to the point: While we were sleeping China took a great leap forward in high-tech manufacturing of everything.\n\nIf no one has told Donald Trump, then I will: His nickname on Chinese social media today is “Chuan Jianguo” — meaning “Trump the (Chinese) Nation Builder” — because of how his relentless China bashing and tariffs during his first term as president lit a fire under Beijing to double down on its efforts to gain global supremacy in electric cars, robots and rare materials, and to become as independent of America’s markets and tools as possible.\n\n“China had its Sputnik moment — his name was Donald Trump,” Jim McGregor, a business consultant who lived in China for 30 years, told me. “He woke them up to the fact that they needed an all-hands-on-deck effort to take their indigenous scientific, innovative and advanced manufacturing skills to a new level.”\n\nThe China that Trump will encounter is a much more formidable export engine. Its advanced manufacturing muscles have exploded in size, sophistication and quantity in the last eight years, even while consumption by its people remains puny.","summary":"Trump will face a new China this time, one whose advanced manufacturing muscles have exploded in size, sophistication and quantity.","url":"https://www.nytimes.com/2024/12/17/opinion/us-china-musk-swift-tariffs-manufacturing.html","image":"https://static01.nyt.com/images/2024/12/17/opinion/17friedman/17friedman-facebookJumbo.jpg","video":null,"publish_date":"2024-12-18 00:00:05","author":"Thomas L. Friedman","authors":["Thomas L. Friedman"],"language":"en","source_country":"us","sentiment":0.101},{"id":274061634,"title":"Congress releases short-term funding bill as deadline nears to avert a holiday shutdown","text":"WASHINGTON — Congressional leaders on Tuesday evening released the text of a short-term bill to keep the federal government open until March 14, rolling it out just days ahead of a key deadline to prevent a shutdown and after numerous delays. Funding expires at the end of Friday, when the House and Senate are hoping to adjourn for the Christmas, Hanukkah and New Year holidays. The 1,547-page bill includes $100.4 billion for disaster relief funding to address damage caused by hurricanes Helene and Milton in places like western North Carolina and Florida. That was roughly what President Joe Biden had requested of Congress. It also includes $10 billion in economic assistance for farmers; a one-year extension of the farm bill; and a provision reauthorizing a Department of Homeland Security program allowing federal agencies to coordinate and counter threats from drones, given public concern about recent sightings. In addition, the continuing resolution or CR, includes a separate provision to give control of Robert F. Kennedy Memorial Stadium to Washington, D.C., which would allow the city to negotiate bringing the NFL's Commanders back to the district. Lawmakers have mere days to prevent a government shutdown ahead of the holidays, putting pressure on the Republican-led House to break its 72-hour rule between releasing text and voting on a bill. And the Democratic-run Senate would need unanimous agreement to skip procedural hurdles and pass it in time. The legislation would throw a messy new shutdown deadline into President-elect Donald Trump’s first 100 days in office. The move carries ups and downs for Republicans, who will seize control of the White House and Senate in January, in addition to maintaining a narrow House majority. On one hand, the GOP’s “trifecta” in 2025 will give the party more leverage to shape the contours of a full funding deal next year. Government funding is subject to the Senate’s 60-vote threshold, so they would still need Democratic support to pass it. There’s also a benefit for House Speaker Mike Johnson, R-La., in punting difficult spending decisions beyond Jan. 3, when he will need nearly every House Republican to vote to re-elect him as speaker. Pushing through a sweeping government funding deal with Democrats around Christmas would face backlash from conservatives in his ranks, imperiling his standing. The GOP House majority was trimmed down to 220 to 215 in last month’s election, giving Johnson very little margin for error. The main downside is that it would force Congress to grapple with another deadline early in Trump’s term, potentially taking time away from his other priorities, like confirming nominees through the Senate and advancing his party-line measures on tax cuts, immigration funding and domestic energy policy. For that reason, some Republicans preferred to finish the job earlier and take the current fiscal year’s funding task off Trump’s plate. Sen. Susan Collins, R-Maine, who is set to become chair of the Appropriations Committee, said she preferred a mid-January deadline as it would be “far better for the incoming president.” “I think it’s really important that we let the new administration have a clean slate and not be worrying” about fiscal year 2025, she said. But with Congress hoping to finish up this week and leave town for the holidays, most members of both parties have accepted that another short-term solution will have to prevail. “We just need to keep things afloat for the next three to four months,” said former Appropriations Committee Chair Rosa DeLauro of Connecticut, who is now the panel’s top Democrat.","summary":"House Republicans released legislative text of their short-term bill Monday to keep the federal government open until mid-March, just days ahead of a key deadline to prevent a shutdown.","url":"https://www.nbcnews.com/politics/congress/congress-releases-short-term-funding-bill-deadline-nears-avert-holiday-rcna184146","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-12/241213-us-capitol-building-ew-1209p-0934f1.jpg","video":null,"publish_date":"2024-12-18 00:00:05","author":"Kyle Stewart,Sahil Kapur,Scott Wong","authors":["Kyle Stewart","Sahil Kapur","Scott Wong"],"language":"en","source_country":"us","sentiment":-0.107},{"id":274058942,"title":"Top Kamala campaign staffer accidentally admits TRUTH about the Democratic Party","text":"Not only was Donald Trump elected because Americans couldn’t take another four years of Biden-era policies but because Kamala Harris’ campaign had no idea how to reach voters across the aisle.\n\n And in a recent interview, Rob Flaherty, deputy campaign manager for Biden’s re-election campaign, actually told the truth about why that was — and it was illuminating, to say the least.\n\n “For the left, our amplification ecosystem is the mainstream media and Hollywood,” Flaherty casually admitted. “The mainstream media and Hollywood don’t really mess with us. They’re not like actually allies, and they’re not where these voters who don’t want to pay attention to politics are.”\n\n “Like, we’re sitting here at Harvard, at a big event with the mainstream media, and voters out there that we actually needed to reach are not seeing this at all, and they’re not seeing mainstream media at all,” he continued.\n\n “And I think, fundamentally, we have a mismatch between the amplification engine of the left and the media of this moment, which is increasingly alternative, anti-establishment, all that stuff. And so that presents a real issue for us as the party of institutions at a time when people really hate institutions,” he concluded.\n\n “That’s amazing,” Pat Gray of “Pat Gray Unleashed” comments, shocked. “All of Hollywood and all of mainstream media is not enough. What else do you need?”\n\n “This just goes to my point that they can’t win based on any debate, on any factual argument. They just can’t win. That’s why they resent so much that there are conservative podcasts, and there’s Fox News, and that’s about all we have,” he says.\n\n “Well, the truth is the enemy of the left,” Keith Malinak adds. “And as long as they can hide their true intentions, they think they can pull one over on you. But man, he came right out and said that they’re not going to mess with us, Hollywood, and the mainstream media.”\n\nWant more from Pat Gray?\n\nTo enjoy more of Pat's biting analysis and signature wit as he restores common sense to a senseless world, subscribe to BlazeTV — the largest multi-platform network of voices who love America, defend the Constitution, and live the American dream.","summary":"Not only was Donald Trump elected because Americans couldn’t take another four years of Biden-era policies but because Kamala Harris’ campaign had no idea how to reach voters across the aisle.\n\n\n\n\tAnd in a recent interview, Rob Flaherty, deputy campaign manager for Biden’s re-election campaign, actually told the truth about why that was — and it was illuminating, to say the least.\n\n\n\n\t“For the left, our amplification ecosystem is the mainstream media and Hollywood,” Flaherty casually admitted. “The mainstream media and Hollywood don’t really mess with us. They’re not like actually allies, and they’re not where these voters who don’t want to pay attention to politics are.”\n\n\n\n\t“Like, we’re sitting here at Harvard, at a big event with the mainstream media, and voters out there that we actually needed to reach are not seeing this at all, and they’re not seeing mainstream media at all,” he continued.\n\n\n\n\n\t“And I think, fundamentally, we have a mismatch between the amplification engine of the left and the media of","url":"https://www.theblaze.com/shows/pat-gray-unleashed/kamala","image":"https://www.theblaze.com/media-library/image.jpg?id=55361537&width=1200&height=600&coordinates=0%2C0%2C0%2C120","video":null,"publish_date":"2024-12-18 00:00:00","author":"BlazeTV Staff","authors":["BlazeTV Staff"],"language":"en","category":"politics","source_country":"US","sentiment":-0.239},{"id":274054998,"title":"‘We just lost the quarterback’: What Freeland’s resignation could mean for Canada-U.S. relations","text":"Chrystia Freeland’s bombshell resignation from cabinet strips the Trudeau government of its top negotiator as it prepares to face off against an increasingly antagonistic Trump administration threatening hefty tariffs, say business advocates, insiders and Liberal colleagues.\n\nFlavio Volpe, president of the Auto Parts Manufacturers’ Association, credited Freeland for successfully building a team including political rivals to handle trade renegotiations during Donald Trump’s first administration, heralding her as Canada’s “best” trade or global affairs minister.\n\nREAD MORE: Hectic day on the Hill leaves Trudeau’s leadership in doubt\n\n“[She] had the confidence to bring in and build a team Canada full of political adversaries, or at least from different parts of the spectrum and from industry and other stakeholders that not only brought their reputation, but all their egos, [and] she was confident enough and humble enough to be able to be the one that brought that all together,” he said.\n\n“I think that’s what we’re losing. We still have everybody else but [to compare it to] football, we built the team around the system, and we just lost the quarterback.”\n\nVolpe was part of Freeland’s Team Canada that was put together to manage the re-negotiations of the North American free trade deal after Trump first won election in 2016. The resulting deal, known as the Canada-United States-Mexico Agreement, is up for renegotiation in 2026.\n\nHowever, Trump announced last month that he would slap 25 per cent tariffs on Canada and Mexico when he takes office next year in an effort to stem the flow of illicit drugs and migrants across the U.S. border.\n\nSoon after Trump’s second election victory in November, Prime Minister Justin Trudeau reconvened a cabinet committee on Canada-U.S. relations, chaired by Freeland, who at the time, served as deputy prime minister and finance minister.\n\nFreeland resigned both posts on Monday after saying Trudeau told her last week that he would replace her as finance minister. He reportedly offered to move her to a Canada-U.S. portfolio without a ministry, which Freeland saw as a demotion.\n\nIn her resignation letter, posted on social media, she acknowledged tension between the finance department and the prime minister’s office on “the best path forward for Canada” in the face of Trump’s tariff threat.\n\nThe resulting public resignation prompted a flurry of calls for Trudeau to resign, leading to a tense caucus meeting Monday night, where several Liberal MPs told the prime minister he should step down. Trudeau is reportedly reflecting on his next steps.\n\nIn a post on Truth Social late Monday night, Trump weighed in on the news, slamming Freeland for her “toxic” behaviour.”\n\n“The Great State of Canada is stunned as the Finance Minister resigns, or was fired, from her position by Governor Justin Trudeau. Her behavior was totally toxic, and not at all conducive to making deals which are good for the very unhappy citizens of Canada. She will not be missed!!!”\n\nSarbjit Kaur, the co-founder of Kapow Communications and a longtime Liberal, said Trump’s comments signal that Freeland was an effective and hard-nosed negotiator.\n\n“Trump’s tweets applauding her departure, if anything, can be read as a compliment to her, because typically, the person who is the strongest at the negotiation table is the person that you really don’t want in the room,” she said, adding that losing Freeland shows that the Trudeau government is “more unstable than ever.”\n\nOthers were also quick to praise Freeland but stressed that there were still people who could be counted upon to help Canada in talks with the U.S.\n\nAn Ontario Liberal MP, who requested anonymity to speak freely, said Freeland’s role during the first Trump presidency was “critical,” but stressed the Canada-U.S. relationship “transcends any one person.”\n\n“We will always have the backs of Canadian workers and defend Canadian interests,” the MP said.\n\n“Chrystia contributed greatly to that role, and there are others that will need to do the same.”\n\nVolpe, who said he spoke to the Prime Minister’s Office on Monday, also noted that there were other “people who can carry the ball.”\n\n“I think they also wanted to ensure that everybody knows, in spite of losing Chrystia, the task remains and they remain committed to working [cooperatively.]”\n\nREAD MORE: Trudeau faces mounting pressure from caucus after Freeland resigns\n\nIt seems that Dominic LeBlanc, who replaced Freeland as finance minister, will now do much of the heavy lifting on the Canada-U.S. file going forward.\n\nHe joined Trudeau during the impromptu visit to Mar-a-Lago to have a post-Thanksgiving dinner with Trump last month, and also serves as public safety minister, giving responsibility for the border.\n\nFormer top Liberal staffer Stevie O’Brien called Freeland an “exceptionally smart and talented woman politician,” but expressed optimism that LeBlanc could play a helpful role on Canada-U.S. relations.\n\n“She will be in the history books as our first female finance minister, as somebody who led the charge on NAFTA renegotiations, on support for Ukraine, on helping steer the Canadian economy successfully through COVID. So, her impact on the country and on the party is significant. That being said, I think Dominic LeBlanc is an excellent person to be part of the discussions going forward with future president Trump.”\n\nO’Brien, now a government and public policy lawyer with McMillan, noted that while Freeland chaired the Canada-U.S. cabinet committee, LeBlanc was the one who travelled to Florida to meet Trump.\n\n“I think that.., the intention was, even before all of this, for Dominic to have a larger role [going] forward, vis-a-vis the discussions around the tariffs. He has a fantastic relationship with the other premiers, and that’s also true of Freeland, but that’s another important part of really having that Team Canada approach.”\n\nShe added it’s unclear how negotiations with Trump will play out but it’s clear that it’s “going to be different than it was last time.”\n\nFor the business community, Freeland’s resignation has created confusion about Canada’s approach to the file.\n\nGaphel Kongsta, director of international policy with the Canadian Chamber of Commerce, said the “surprise departure adds to the already fairly high degree of uncertainty around… our response to the incoming Trump administration.”\n\n“Obviously the tariffs are top of mind for many of our members and businesses of Canada, but it’s not quite certain what form they will take and how the government will respond to that and that’s sort of been compounded by the fact that Minister Freeland, while she was the finance minister was chair of the Canada-U.S. cabinet committee.”\n\nREAD MORE: Liberals set to make border announcement: source\n\nFreeland’s departure comes as the Liberals prepare to roll out their plan to respond concerns raised by Trump about the Canadian border.\n\nA border security announcement is set for Tuesday afternoon, as iPolitics reported earlier in the day.\n\nThe Liberals reportedly shared with the premiers last week a plan to strengthen the enforcement of the border.\n\nOther outlets reported that the Liberals have a $1 billion border security package and the government has teased sending helicopters and drones to assist in patrols.","url":"https://www.ipolitics.ca/news/we-just-lost-the-quarterback-what-freelands-resignation-could-mean-for-canada-u-s-relations","image":"https://old.ipolitics.ca/wp-content/uploads/2024/12/CP173666484-scaled.jpg","video":null,"publish_date":"2024-12-17 23:59:31","author":"Governor Justin Trudeau","authors":["Governor Justin Trudeau"],"language":"en","source_country":"ca","sentiment":0.048},{"id":274054992,"title":"Border plan features round-the-clock aerial surveillance, drug detection support","text":"The RCMP will create a new aerial intelligence task force to provide round-the-clock surveillance of Canada’s border using helicopters, drones and surveillance towers.\n\nThe move is part of the federal government’s $1.3-billion upgrade to border security and monitoring to appease concerns of U.S. president-elect Donald Trump about the flow of migrants and illegal drugs.\n\nTrump has threatened to impose a 25 per cent tariff on all Canadian and Mexican exports to the U.S. as soon as he is inaugurated next month unless both countries move to improve border security.","url":"https://www.ipolitics.ca/news/border-plan-features-round-the-clock-aerial-surveillance-drug-detection-support","image":"https://old.ipolitics.ca/wp-content/uploads/2024/12/4b9e318be5c8673e4b9b6f9dfef2370684b733c9bf7172af4ecf596191028187.jpg","video":null,"publish_date":"2024-12-17 23:59:31","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":0.017},{"id":274054632,"title":"Farage says he talked money with Musk amid speculation of donation to Reform UK","text":"Reform UK leader Nigel Farage suggested he has kicked off talks with Elon Musk for a potential donation to the party, saying the two had discussed money and that there will be “ongoing negotiations” with the tech billionaire.\n\nMr Farage described his hour-long meeting with Mr Musk at Donald Trump’s Mar-a-Lago resort on Monday as “great” and “historic”, saying he and party treasurer Nick Candy had “learned a great deal about the Trump ground game”.\n\n“We only have one more chance left to save the West and we can do great things together,” he said.\n\nMr Farage also met vice president-elect JD Vance during the trip.\n\nThe meeting follows newspaper reports, dismissed by Mr Farage, that X owner Mr Musk was preparing to donate up to 100 million dollars (£79 million) to Reform UK.\n\nMr Farage has previously criticised American political figures for getting involved in British politics, saying then-president Barack Obama had “behaved disgracefully” by suggesting the UK would be “at the back of the queue” for a US trade deal if it voted for Brexit.\n\nHe had repeatedly insisted he knows nothing about a potential contribution to Reform from Mr Musk, but said the party would take the money if it were offered.\n\nBut writing in The Telegraph after the meeting, Mr Farage said Mr Musk described Labour and the Conservatives as “the uniparty” and “left us in no doubt that he is right behind us”.\n\n“Inevitably, following such intense media speculation, the issue of money was discussed, and there will be ongoing negotiations on that score,” the Reform UK leader added.\n\nThe Prime Minister’s official spokesman said it was a “matter for the rules” when asked if a potential large donation by Mr Musk to a UK party would worry Sir Keir Starmer.\n\nHe added: “There are already existing rules on foreign donations, but the Government has committed to, you know, to strengthening the rules.”\n\nMr Farage said his meeting with Mr Vance on Monday was “great”.\n\nI will always do what is in the national interest and renewing our strong ties with America after four years of Joe Biden can only be a good thing for our countryNigel Farage, Reform UK leader\n\n“He is a friend of mine and I have known him for 14 years – Kemi Badenoch has known him for 14 days,” he said.\n\nTory leader Mrs Badenoch met Mr Vance during a recent trip to the US where she met Republican figures in Washington DC.\n\nMr Farage has previously suggested he could be a bridge between Sir Keir and Mr Trump due to his friendship with the US president-elect.\n\nHe said: “I have always said I will help this Government with contacts.\n\n“It isn’t just President Trump and the incoming vice president, but I have known large numbers of the cabinet for many years.\n\n“I will always do what is in the national interest and renewing our strong ties with America after four years of Joe Biden can only be a good thing for our country.”\n\nMr Musk is reported to have spent more than 250 million dollars (£197 million) to support Mr Trump’s re-election campaign, focused on increasing turnout in key states.\n\nHe has since been named as one of the two heads of a new cost-cutting Department of Government Efficiency in the incoming Trump administration.\n\nThe visit is at least the fourth time Mr Farage has travelled to America since his election as MP for Clacton in July.","url":"https://www.grampianonline.co.uk/news/national/farage-says-he-talked-money-with-musk-amid-speculation-of-donation-to-reform-uk-123498/","image":"https://www.grampianonline.co.uk/_media/img/NDY0ADRJGSE0ME4WVJ63.jpg","video":null,"publish_date":"2024-12-17 23:57:29","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.04},{"id":274055932,"title":"El Colegio Electoral pone a Trump un paso más cerca de la Casa Blanca","text":"Los miembros del Colegio Electoral en Estados Unidos se están reuniendo este martes en sus respectivos estados para elegir a Donald Trump como nuevo presidente, un paso más en el proceso para que el líder republicano llegue a la Casa Blanca el 20 de enero.\n\nLa cita ha pasado prácticamente desapercibida a diferencia de lo que pasó hace cuatro años, cuando electores partidarios de Trump trataron de reunirse en siete estados en un intento de revertir el resultado electoral, que dio como ganador al demócrata Joe Biden.\n\nAlgunos de esos electores que hace cuatro años intentaron formar una votación paralela contraria al resultado de las urnas este martes formaron parte del cuerpo oficial de delegados republicanos en estados como Pensilvania o Míchigan.\n\nLa mayoría de los estados organizaron sus votaciones a primera hora de la tarde, sin que se hayan reportado incidentes.\n\nEn Arizona, sin embargo, los electores mantuvieron en secreto el lugar de su reunión por motivos de seguridad.\n\nTrump ganó las elecciones del pasado 5 de noviembre en estados que le otorgan 312 votos en el Colegio Electoral, frente a los 224 de la candidata demócrata, la actual vicepresidenta Kamala Harris.\n\nUna vez concluya el procedimiento de hoy, los certificados con los resultados de los respectivos estados se envían a Washington, donde deben estar en manos del presidente el Senado -en este caso Harris- y del archivista de Estados Unidos antes del 25 de diciembre.\n\nEl archivista es el encargado de transferir los certificados al nuevo Congreso, que se forma el 3 de enero.\n\nEl 6 de enero, el nuevo Congreso se reúne en una sesión conjunta de las dos cámaras para contar y anunciar los votos de los estados, que deben reflejar el 312 para Trump y 224 para Harris.\n\nEn esa sesión, los legisladores pueden hacer públicas objeciones a los certificados si consideran que ha habido irregularidades.\n\nEsta fecha también fue clave hace cuatro años, ya que partidarios de Trump asaltaron violentamente el Capitolio tratando de evitar el conteo de votos que daba la victoria a Biden mientras decenas de congresistas republicanos objetaban a los resultados.\n\nEsta vez, sin embargo, no se esperan mayores sobresaltos en este proceso tedioso que a lo largo de la historia ha pasado inadvertido.\n\n«Para ser honesto, me había olvidado. Así de aburrido y sin incidentes va a ser», dijo en declaraciones al diario The Washington Post Gabriel Sterling, un alto funcionario electoral del estado de Georgia.\n\nSterling tuvo un papel clave en 2020 ya que tuvo que defender el resultado de las urnas, que los partidarios de Trump trataron de manipular. EFE\n\nLea: Morales dice ser «víctima» de «guerra jurídica» tras ser imputado por trata de personas","summary":"Los miembros del Colegio Electoral en Estados Unidos se están reuniendo este martes en sus respectivos estados para elegir a Donald Trump como nuevo presidente,...","url":"https://www.latribuna.hn/2024/12/17/el-colegio-electoral-pone-a-trump-un-paso-mas-cerca-de-la-casa-blanca/","image":"https://cdn.latribuna.hn/wp-content/uploads/2024/12/Donald-Trump-EEUU-La-Tribuna-6.jpg","video":null,"publish_date":"2024-12-17 23:55:45","author":"Redacción Web","authors":["Redacción Web"],"language":"en","category":"politics","source_country":"hn","sentiment":1},{"id":274054770,"title":"Canadian PM Justin Trudeau faces  increasing calls to resign: ‘Lost control of everything’","text":"Canadian Prime Minister Justin Trudeau is facing mounting pressure to resign after one of his top minister’s abruptly stepped down Monday, leaving his political foes to conclude he’s “lost control of everything.”\n\nFinance Minister Chrystia Freeland quit Monday and offered some choice words on Trudeau’s handling of President-elect Donald Trump’s looming tariffs — providing fresh fodder for critics of the unpopular prime minister.\n\n“For the last number of weeks, you and I have found ourselves at odds over the best path forward for Canada,” Freeland wrote in her resignation letter posted on X.\n\nFreeland referenced the need for Canada to be ready should Trump employ the 25% tariffs that he has threatened to implement.\n\n“That means keeping our fiscal powder dry today, so we have the reserves we may need for a tariff war. That means eschewing costly political gimmicks, which we can ill afford,” she wrote.\n\nFreeland, once deemed “minister of everything” for Trudeau, received a standing ovation when she walked into a room of members of parliament following the announcement of her resignation, sources told the Toronto Star.\n\nNow, as many as 45 MPs have signed a letter demanding Trudeau step down, up from 24, the Toronto Star reported.\n\nConservative Leader Pierre Poilievre, who has his eyes on becoming prime minister himself, called out Trudeau and the Liberal party for becoming a “circus.”\n\n“The real consequences of yesterday’s clown show are playing out in tragedies right across this country,” Poilievre said, according to the National Post.\n\n“Justin Trudeau has lost control of everything,” Poilievre added.\n\nBloc Quebecois leader Yves- Francois Blanchet is also calling for Trudeau to put personal ambition aside for the sake of the nation.\n\n“We must put an end as quickly as possible to the very bad spectacle that we are giving internationally about the way Canada is preparing to face discussions with the Americans,” Blanchet said, the National Post reports.\n\nBoth Poilievre and Blanchet are calling for an election in early 2025.\n\nPolitical allies of the beleaguered prime minister are saying that Trudeau needs times for self-reflection.\n\n“I think what the prime minister has to think about is does he have the right vision for the country?,” said Montreal MP Francis Scarpaleggia, according to the National Post.\n\nMP Peter Fragiskatos had a similar message, harping on Trudeau’s need for self-examination.\n\n“At the heart of [Trudeau’s] reflection needs to be a view that says that no individual is bigger than the country,” Fragiskatos told reporters, the National Post reports.\n\nThese tepid statements come on the heels of a blowout Conservative party win in a “byelection” in British Columbia — where the right-leaning candidate Tamara Jansen won by a whopping 50 point margin on Monday.\n\nTrudeau is expected to address supporters at the Liberal party’s holiday party on Tuesday evening.\n\nThere is no mechanism for Trudeau’s party to force him out of office presently, but a “no confidence” vote in Parliament would trigger an election, according to the Associated Press.\n\nThe “governor of Canada” has been in the crosshairs of Trump — with Trudeau coming to loggerheads with the incoming Trump administration who is keen to kick off new trade policies by levying tariffs on the nation’s northern neighbor.","summary":"Canadian Prime Minister Justin Trudeau is facing mounting pressure to resign after one of his top minister’s abruptly stepped down Monday, leaving his political foes to conclude he’s “lost control of everything.” Finance Minister Chrystia Freeland quit Monday and offered some choice words on Trudeau&#8217;s handling of President-elect Donald Trump&#8217;s looming tariffs — providing fresh...","url":"https://nypost.com/2024/12/17/world-news/canadian-pm-justin-trudeau-faces-increasing-calls-to-resign-lost-control-of-everything/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/canadas-prime-minister-justin-trudeau-95462402.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/HiZZ2TAK-RyIcpnTz.mp4","publish_date":"2024-12-17 23:55:20","author":"Shane Galvin","authors":["Shane Galvin"],"language":"en","source_country":"us","sentiment":-0.15},{"id":274053830,"title":"Sean Trende: \"Trying To Win Back the Senate Is Probably a Two-Cycle Initiative for Democrats\"","text":"Tuesday on the RCP podcast, Tom Bevan and RCP election analyst Sean Trende looked and the president-elect's transition scoring a positive approval rating in some new polls and discussed what to expect in the next midterm elections. Can the Democrats take back the Senate in 2026?\n\n\"Does it surprise me? Absolutely, the man hasn't had a positive approval rating in the 10 years he's been in the public eye,\" Trende said about Trump's transition approval rating. \n\n\"In our RealClearPolitics average of approval ratings, Trump has never been over 50%, even from the day he was inaugurated,\" Tom Bevan noted. \"He's already starting out ahead of where he was in 2016.\"\n\nBevan asked Trende to run down some of the Senate contests scheduled for the 2026 midterm elections, where Republicans will be defending their new 53-seat majority.\n\nSen. Jon Ossoff in \"Georgia is potentially the most vulnerable seat\" for Democrats, Trende said. \"Assuming that [Georgia Republican Gov.] Brian Kemp manages to avoid a primary challenge. If Kemp wants it, I think he's a generally popular governor. I think the DNA of Georgia is still pretty Republican, and that's going to be a tough race.\"\n\nMaine Republican Sen. \"Susan Collins has said she's running, and she has a history of running ahead of Donald Trump,\" he continued. \"Beyond that, they've got Sen. Thom Tillis up in North Carolina. Mark Robinson is making noises about primarying him, which, if that were successful, is probably the end of the road for Republicans there. We have seen Republicans do some pretty catastrophic face-plants over the last 14 years in Senate races. I think that would exceed Delaware in 2010 with Christine O\u0019Donnell, 'I'm a Witch.' That would be worse than that.\"\n\n\"One race that's underrated is if Lara Trump is the appointee for the Florida Senate seat,\" he added. \"That Florida Senate race could go sideways for Republicans if Matt Gaetz gets in or if Lara Trump is the nominee and Trump is unpopular.\"\n\n\"Beyond that, maybe Joni Ernst gets primaried in Iowa, and the person is too far to the right for the Iowa electorate. Texas is really slim pickings for the Democrats. Trying to get back the Senate is probably a two-cycle initiative for Democrats.\"\n\n\"If you're looking for potential soft spots for Democrats, it would be maybe Michigan. Gary Peters doesn't light anyone's heartstrings on fire. Maybe in New Hampshire if Shaheen retires and Chris Sununu decides he wants to be a senator,\" adds Trende.\n\nRelated Topics: Siriusxm_clips, Sean Trende, Senate 2026, Election 2026, Senate, Tom Bevan, Jon Ossoff, Joni Ernst, , Lara Trump\n\n Show comments\n Hide Comments \n\n Send Tips\n\n Follow Us\n\n Latest Political Videos\n\n You may like\nHerbeautyA Puppy Rescued By UA Soldiers Is Being Called Their GuardianHerbeautyHerbeautyHerbeautyFind Out What Happened To The PLL Girls After They Grew UpHerbeautyHerbeautyBrainberriesThe Weapon Of Comedy! See Top Most Poignant Ukraine War MemesBrainberriesBrainberriesBrainberriesThese Popular Hollywood Stars Got Their Start On Soap OperasBrainberriesBrainberries\n\n Video Archives\n\n PoliticsPolicyMarketsWorldDefenseEnergyHealthScienceReligionInvestigationsEducationFoundationHistoryBooks & CulturePublic AffairsFloridaPennsylvania\n\n Privacy Policy\n Advertise With Us\n\n View Mobile Site\n\n Copyright � 2024 RealClearHoldings, LLC. Do Not Sell My Personal Information\n\n �2024 RealClearPolitics | Go to full site","url":"https://www.realclearpolitics.com/video/2024/12/17/trende_trying_to_win_back_the_senate_is_probably_a_two-cycle_initiative_for_democrats.html","image":"https://assets.realclear.com/images/67/672882_5_.jpg","video":null,"publish_date":"2024-12-17 23:49:37","author":"Tim Hains","authors":["Tim Hains"],"language":"en","source_country":"us","sentiment":-0.334},{"id":274053832,"title":"Scott Turner for HUD Secretary: A New Era of Leadership and Reform","text":"At a time when housing affordability and economic mobility are at the forefront of national conversations, the need for effective, accountable leadership at the Department of Housing and Urban Development has never been more urgent. To address these challenges, we need a HUD secretary who not only understands the complexities of housing policy but also is committed to implementing bold reforms that prioritize American families and communities. That\u0019s why I am proud to endorse Scott Turner for HUD secretary. His experience, vision, and conservative principles make him the ideal leader to address the critical issues facing our housing crisis today.\n\nOne of Scott Turner\u0019s primary goals will be ensuring that HUD is led by professionals who align with President Donald J. Trump\u0019s priorities. For too long, HUD has struggled with bureaucratic inefficiency. Turner will take decisive action to place motivated, politically aligned leaders in key positions, transforming career roles into non-career positions where appropriate. This shift will steer the department toward meaningful change that serves the needs of the American people.\n\nAs China\u0019s influence in U.S. housing markets continues to grow unchecked, Turner will prioritize addressing foreign investment in U.S. real estate, particularly from hostile actors. He will actively monitor and respond to foreign acquisitions to safeguard American homeowners and our economy from exploitation. Swift action is vital to protect our national interests.\n\nAnother critical area of reform involves reversing the harmful policies of the Biden-Harris administration, which prioritized ideological goals over effective housing solutions. Under Scott Turner, HUD will focus on fairness, transparency, and opportunity for all Americans \u0013 without pursuing political objectives. Turner will ensure that taxpayer-funded housing programs prioritize American citizens and legal residents \u0013 not illegals \u0013 ensuring assistance reaches those who truly need it. He will carry out President Trump\u0019s mandate to ensure illegal aliens are ineligible for public housing, end funding to sanctuary cities, and reinstate the Public Charge rule to stop the misuse of public safety-net benefits. Additionally, Turner will work to ban urban camping and restore the beauty of once-thriving American cities like San Francisco, Chicago, Washington, D.C., and my hometown of New York City.\n\nTurner will also embrace a forward-thinking vision for HUD that transcends mere housing assistance. Empowering individuals and families to achieve self-sufficiency is essential for long-term success. By strengthening work requirements and reducing dependency on federal assistance, Turner will help break the cycle of poverty and create a pathway to economic independence. Furthermore, he will continue efforts to revitalize rural and urban communities left behind by Democrats, while encouraging private capital investment to foster opportunity and upward mobility for all Americans.\n\nHaving witnessed the devastation caused by Hurricane Ian in 2022 \u0013 particularly in Southwest Florida \u0013 I understand the critical role HUD must play in disaster recovery. Communities impacted by natural disasters require swift, coordinated responses to rebuild homes, restore neighborhoods, and help families regain stability. Unfortunately, the federal response has often been slow and inefficient, with some reports suggesting political bias in disaster relief efforts.\n\nUnder Scott Turner\u0019s leadership, HUD will streamline disaster recovery efforts, ensuring that resources are deployed quickly and effectively. The federal government will act as a true partner in recovery \u0013 one that listens to local communities and responds in real time. Turner will prioritize the rapid and responsible deployment of funds to rebuild homes and strengthen communities\u0019 resilience to future disasters.\n\nAs we modernize government efficiency following President Trump\u0019s announcement of the Department of Government Efficiency, Scott Turner will be a vital ally in implementing data-driven, efficient management strategies for HUD programs. His proven track record of fiscal accountability and transparency will ensure that HUD\u0019s operations are responsive to the needs of the American people while safeguarding taxpayer dollars.\n\nScott Turner\u0019s leadership at HUD has the potential to be truly transformative. His commitment to restoring accountability, reforming housing policies, and prioritizing the needs of American citizens is exactly what we need to bring about real change. As a member of Congress, I fully support his nomination and look forward to working with him to implement reforms that will make HUD more efficient, fair, and effective. The failed public housing and homelessness policies of the past will end with Scott Turner at the helm.\n\nIt\u0019s time to put America first. With Turner leading HUD, we can ensure that our housing policies align with the best interests of American families. I urge my colleagues in the U.S. Senate, particularly those on the Senate Committee on Banking, Housing, and Urban Affairs, to support his nomination as HUD Secretary.\n\nByron Donalds represents Florida\u0019s 19th Congressional District.","url":"https://www.realclearpolitics.com/articles/2024/12/17/scott_turner_for_hud_secretary_new_era_leadership_reform_152100.html","image":"https://www.realclearpolitics.com/asset/img/social_media_assets/site_logos/rcp.png","video":null,"publish_date":"2024-12-17 23:49:37","author":"Byron Donalds","authors":["Byron Donalds"],"language":"en","category":"politics","source_country":"us","sentiment":0.329},{"id":274053826,"title":"Megyn Kelly: Stephanopoulos Has Always Been A Partisan Hack, He's Just Too Ball-Less To Own His Partisan Nature","text":"Back to Videos\n\n Megyn Kelly: Stephanopoulos Has Always Been A Partisan Hack, He's Just Too Ball-Less To Own His Partisan Nature\n\n | \n\n Posted By Ian Schwartz\n On Date December 16, 2024\n \n\nSIRIUSXM: Megyn Kelly begins the show by discussing the massive media news about the ABC News paying Donald Trump $15 million and apologizing for George Stephanopoulos' comments during a March interview, the defamation lawsuit at issue and whether Stephanopoulos really defamed Trump, the real reason ABC settled, and more.\n\nMEGYN KELLY: You never see these media organizations held to account for their vile lies they tell about Donald Trump. It's rare to see it happen at all. And trust me, as a media figure, I'm not clamoring to see media figures consumed for defamation for mild sins or even moderate sins. But this was just so egregious, and they did it over and over and over again at ABC News. They didn't care. They clearly enjoyed saying what George Stephanopoulos said. It made them feel good about themselves. This is George Stephanopoulos\u0019... I'll just leave the dirty teen joke there that that's how he feels about saying nasty things about Trump. And finally, it came back to bite him. \n\nI would love to see what's in his text messages to his producers, because I guarantee it just cost ABC News $15 million. That's almost certainly what happened. So you may have heard this over the weekend, Trump sued ABC News, and ABC News caved. They collapsed. They gave in like that, and quickly settled the case with President-elect Donald Trump after the network's top star George Stephanopoulos, had been ruled by the judge to be required to sit for a deposition. He fought it. He didn't want to have to do it. And the judge late last week said, \u0018Well, you have to. You said a bunch of dumb shit. You've been sued for defamation. I've refused to get rid of this case thus far, and you must sit like any other defendant.\u0019 You privilege whatever. \u0018You must sit for deposition and answer questions from Trump\u0019s lawyer&\u0019\n\nThey collapsed. They gave in and cried uncle. It's sad, because I would have loved to have read that deposition transcript. You guys are probably familiar with the absolutely disgusting interview that led to all of this with George Stephanopoulos. We did a big episode on this, because he had on Congresswoman Nancy Mace back in the spring& And we focus on the fact that he thought it would be super fun and really make him look good to go after a rape survivor, Nancy Mace, and really twist her facts and her words in her face& \u0018You claim you're a rape victim. How could a rape victim support a rapist.\u0019 \n\nGreat. Great positioning. You're idiots. Stephanopoulos is an idiot, and so are his producers, because let me tell you, in all my years at Fox \u0013 nevermind, my short stint at NBC \u0014 the producers have a couple of jobs. One is to arm the anchor with facts& Fail. Okay, fail there! And two is to protect the anchor. You protect the anchor. And so if the anchor is out there saying something colossally stupid, usually, if you have a great producer, they'll get in your ear to say, \u0018No, it's this. No, it's that. Be careful.\u0019 That happens with me all the time on this show. My producers, the ones who run heard on various segments that I'm doing, if they realize I've said something inaccurate or that I'm searching for a fact are constantly in my ears, that is why I wear these headphones?... Ten times that, a hundred times that, on ABC broadcast news and a Sunday show like the one George Stephanopoulos sits for \u0013 partisan hack. He's been there a long time. \n\nIt doesn't make him any more respectable. He's a partisan hack. He started off as a partisan hack, and he remains one. He's just too ball-less to own his partisan nature and [he] wants us to believe that he's straight and narrow now, notwithstanding all those years helping Bill Clinton. And the irony of him going after a rape supporter in that way& after his years running the War Room tearing down Bill Clinton's sexual assault accusers. It's just rich. So now the whole thing has cost him his reputation and his company $15 million. \n\n Recommended\n\n \n\n Sen. Eric Schmitt: Voters Rejected Media, Democrats' Lawfare on January 6, They Don't Want To Be A Banana Republic\n\n December 15, 2024\n\n Republican Missouri Sen. Eric Schmitt says Donald Trump's second election victory signals a mandate from the voters rejecting the \"lawfare\" campaign against Donald Trump, Sunday during an interview with George Stephanopoulos on ABC's \"This Week.\"\n\nGEORGE STEPHANOPOULOS: Finally, I want to ask...\n \n Eric SchmittJanuary 6THIS WEEK\n \n\n \n\n Sen. Adam Schiff: \"Conspiracy Theorist... Sycophant\" Kash Patel Is Not Fit To Lead FBI\n\n December 15, 2024\n\n California Democrat Sen. Adam Schiff, Sunday on ABC's \"This Week,\" responded to Republican Sen. Eric Schmitt's endorsement of Kash Patel, Donald Trump's pick to head the FBI: \n\nSEN. ADAM SCHIFF (D-CA): Well, let me just say, with respect to some of the nominees like Kash Patel, this is someone...\n \n Adam SchiffFBIKash PatelTHIS WEEKABC NewsTrump cabinetJanuary 6","url":"https://www.realclearpolitics.com/video/2024/12/16/megyn_kelly_stephanopoulos_has_always_been_a_partisan_hack_hes_just_too_ball-less_to_own_his_partisan_nature.html","image":"https://assets.realclear.com/images/67/672808_5_.jpg","video":null,"publish_date":"2024-12-17 23:49:37","author":"Ian Schwartz","authors":["Ian Schwartz"],"language":"en","source_country":"us","sentiment":-0.42},{"id":274053828,"title":"Sen. Eric Schmitt: FBI Desperately Needs Reform, Kash Patel Is Very Qualified And Will Get Senate's Support","text":"Republican Missouri Sen. Eric Schmitt expresses support for Donald Trump's pick for FBI director, Kash Patel, during an interview with George Stephanopoulos on ABC's \"This Week.\"\n\n\"This guy served as deputy chief of staff at the Department of Defense, he was a deputy at DNI, a prosecutor, and public defender,\" Schmitt said. \"And let's review the tape here. The FBI was involved in spying on President Trump in 2016, the FBI was involved in the Hunter Biden laptop coverup -- they pre-bunked that story with Big Tech. The FBI investigated Catholics who attended the traditional Latin mass and parents who showed up at school board meetings under the auspices of the Patriot Act. That agency is in desperate need of reform. Kash Patel is very qualified and I think he's going to get support in the Senate.\"\n\nGEORGE STEPHANOPOULOS, ABC NEWS: How about the president's nominee for FBI director, Kash Patel? He put out a book called \"Government Gangsters\" and included a 60-person enemies list and \"The Wall Street Journal\" this week wrote this, I mean, in this December 1st wrote this about it. They said the main concern is Mr. Patel's stated desire to use power in a second Trump term to seek revenge against Mr. Trump's opponents. \n\nVoters didn't re-elect Mr. Trump to practice lawfare the way his opponents have. The country wants a bureau it can trust, not a Republican version of the Comey FBI. How do you respond to \"The Wall Street Journal\"? \n\nSEN. ERI SCHMITT: Well, first of all, the idea that he came up with an enemies list is false. There's a footnote in his book related to corrupt actors and I do think Kash Patel is the right man for the job. This guy served as chief of staff for the Department of Defense. He was a deputy at DNI. He was a prosecutor, he was a public defender. And let's review the tape here. The FBI was involved in spying on President Trump in 2016. \n\nThe FBI was involved in the Hunter Biden laptop coverup. They pre-bunked that story with big tech. The FBI has investigated Catholics because they attend traditional Latin mass, and the FBI has investigated parents who show up to school board meetings under the auspices of the Patriot Act. That agency is in desperate need of reform. \n\nKash Patel is very qualified and I think he's going to get the support in the Senate.\n\nHerbeautyConsider These Face Masks, Which Are Faster Than Facials\n\n Recommended\n\n \n\n Rep. Goldman: Trump Trying To Gaslight People That Kash Patel Will Appropriately Implement The Rule Of Law\n\n December 11, 2024\n\n On NewsNation's \"Dan Abrams Live,\" Rep. Dan Goldman (D-NY) said Kash Patel, President-elect Donald Trump's pick to lead the FBI, is \"dangerous.\"\n\nDAN ABRAMS, NEWSNATION HOST: Well, I'm glad to hear you say that. Do you think that Kash Patel is going to get confirmed in the Senate?\n\nREP. DAN...\n \n dan goldmanDonald TrumpKash Patel\n \n\n \n\n Jesse Watters: The Deep State Has Never Been This Backed Into A Corner\n\n December 12, 2024\n\n FOX News host Jesse Watters discusses the latest bombshell report claiming multiple FBI informants were at the Capital on January 6 on \u0018Jesse Watters Primetime.\u0019\n\nJESSE WATTERS, FOX NEWS: The Justice Department just released the bombshell report that we've been waiting for. What actually...\n \n Jesse WattersDonald Trump\n \n\n \n\n Sen. Adam Schiff: \"Conspiracy Theorist... Sycophant\" Kash Patel Is Not Fit To Lead FBI\n\n December 15, 2024\n\n California Democrat Sen. Adam Schiff, Sunday on ABC's \"This Week,\" responded to Republican Sen. Eric Schmitt's endorsement of Kash Patel, Donald Trump's pick to head the FBI: \n\nSEN. ADAM SCHIFF (D-CA): Well, let me just say, with respect to some of the nominees like Kash Patel, this is someone...\n \n Adam SchiffFBIKash PatelTHIS WEEKABC NewsTrump cabinetJanuary 6\n \n\nRelated Topics: Eric Schmitt, GEORGE STEPHANOPOULOS, ABC News, THIS WEEK, Kash Patel, FBI, FBI Director, Trump Administration\n\n Show comments\n Hide Comments \n\n Send Tips\n\n Follow Us\n\n Latest Political Videos\n\n In The News\n\n Hemingway: Trump Is Showing The Republican Party What It Looks Like To Win, Be A Leader Who Gets Things Done\n\n Van Jones: Democrats Relied On Mainstream Media Beating The Hell Out Of Trump, The Media Is Now The Fringe\n\n Amy Walter: Approval For Handling of Trump Transition Much Higher Than First Term, \"It Feels Very Normal\"\n\n Trump on NJ Drone Flap: \"Government Knows What's Happening... For Some Reason, They Want To Keep People In Suspense\"\n\n Sen. Adam Schiff: \"Conspiracy Theorist... Sycophant\" Kash Patel Is Not Fit To Lead FBI\n\n Most Popular VideosMost Popular VideosPolitical VideosIn The NewsCHANGING LANESRC Original Video Natalie Winters: \"Our Conspiracy Theories Were So Good They Need Blanket Preemptive Pardons\"Mark Levin: What Did Democrats Know When They Flipped And Changed Their Position On Illegal Immigration?Trump: \"First Term Everybody Was Fighting Me, This Term Everybody Wants To Be My Friend\"Trump on NJ Drone Flap: \"Government Knows What's Happening... For Some Reason, They Want To Keep People In Suspense\"Hemingway: Trump Is Showing The Republican Party What It Looks Like To Win, Be A Leader Who Gets Things DoneRealClearPolitics: Unpacking Trump's First Post-Election Presser, ABC Settles Defamation Lawsuit, 2026 Around the Corner, Drone MysteryDevin Nunes on ABC's $15 Million Settlement: \"These News Agencies Need To Get Out Of The Smear Merchant Business\"Sen. Adam Schiff: \"Conspiracy Theorist... Sycophant\" Kash Patel Is Not Fit To Lead FBIRuth Marcus on Trump Cabinet: Trump Voters Signed Up For Disruption, I Don't Know If They Signed Up For This MuchYou may like\nHerbeautyHugh & Deborra: \"The Longer It Goes On, The Better It Gets\"HerbeautyHerbeautyBrainberriesMacaulay Culkin's Own Version Of The New \u0018Home Alone\u0019BrainberriesBrainberriesBrainberriesYour Guide To The Best Japanese Horror Movies Of All TimeBrainberriesBrainberriesHerbeautyHow You Can Stimulate Hair GrowthHerbeautyHerbeauty\n\n Video Archives\n\n Popular in the Community\n\n PoliticsPolicyMarketsWorldDefenseEnergyHealthScienceReligionInvestigationsEducationFoundationHistoryBooks & CulturePublic AffairsFloridaPennsylvania\n\n Privacy Policy\n Advertise With Us\n\n View Mobile Site\n\n Copyright � 2024 RealClearHoldings, LLC. Do Not Sell My Personal Information\n\n �2024 RealClearPolitics | Go to full site","url":"https://www.realclearpolitics.com/video/2024/12/15/sen_eric_schmitt_fbi_desperately_needs_reform_kash_patel_is_very_qualified_and_will_get_senates_support.html","image":"https://assets.realclear.com/images/67/672635_5_.jpg","video":null,"publish_date":"2024-12-17 23:49:37","author":"Tim Hains","authors":["Tim Hains"],"language":"en","source_country":"us","sentiment":-0.251},{"id":274053310,"title":"Three possible futures for the global economy if Trump brings in new trade tariffs","text":"The last time Donald Trump was US president, he entered trade wars with China and Europe. But despite his bravado and tariffs, the US trade deficit did not improve. \n\nIn fact, it deteriorated from US$195 billion in the first quarter of 2017 to US$260 billion in the same period of 2021.\n\nThe first round of Trump tariffs were at a maximum of 25% and were slapped on a number of selected goods. But now his policy appears to be that the US will apply tariffs of 10% or 20% to most imported goods. Canada and Mexico could be facing tariffs of 25% – and Chinese products might be looking at 60%. \n\nThis new proposal seems to be significantly different to the previous one. So what are the possible scenarios for the US, the UK and the global economy?\n\nScenario 1: Confrontation\n\nTaking the president-elect’s word to the letter, if Trump stands his ground on across-the-board tariffs one consequence may be that the US economy faces higher prices because of more expensive imports. The demand for US-produced goods will increase, which is likely to push up domestic wages – and could end with spiralling inflation. \n\nIt is not difficult to imagine the US economy overheating rapidly. However, there are also opposing forces. Higher tariffs and large investment in the US will most likely trigger an appreciation of the dollar, meaning imports becoming cheaper at the border, before tariffs are applied. This could eat away at inflation.\n\n Read more: Why Donald Trump's election could hasten the end of US dollar dominance \n\nIn addition the promise of massive layoffs in the public sector might ease the pressure on the jobs market. Technological innovation – the push for driverless cars, for example – might also move things in the same direction. \n\nFinally, relaxing environmental regulations in the energy sector, together with potential peace with Russia and maybe even in the Middle East, might make energy prices more affordable.\n\nScenario 2: The art of the deal\n\nDonald Trump is well known for his transactional approach to politics. In terms of trade, this means it is unburdened by the international rules that have governed international trade after the second world war.\n\nThe nomination of Scott Bessent as treasury secretary adds to this trend. In his words, tariffs are a “sanctioning tool” in wider political and economic games. \n\nThis leads to a likely scenario for future trade relations with the rest of the world where the US dangles relatively appealing terms to access its market in exchange for a wide array of potential concessions. These could include closer political alignment, large investment in the US, or more opportunities for US investment or its exports. \n\nOverall, there could be a major restructuring of supply chains under which imports from the most efficient countries could be replaced by less efficient ones. This could cut the US’s trade deficit with China but increase its trade deficit with the EU, UK, Mexico and Canada.\n\nA looming question is: will these deals be extended to China – and will China take them? If not, the prospect of two economic blocs – one centred around China and the other around the US – is possible. \n\nScenario 3: Deterrence\n\nIn a third – unlikely – scenario, the Chinese government might accept the US demands to rebalance their bilateral trade deficit in the belief that the time is not yet ripe to contest US supremacy.\n\nMaintaining an export-led growth model, building strength, breaking into foreign markets and just sitting out the Trump presidency could be China’s best strategy. The Chinese government would have to accept larger and rapid buyouts of American-made goods and services than set out in the previous agreement between the Trump and Xi administrations. \n\nBut what about the UK and Europe? UK exports to the US will face a 20% tariff, reducing sales and impacting on those UK producers exporting goods the US buys, like pharmaceuticals or machinery, for example. The UK’s first dilemma will be whether to retaliate and introduce tariffs for US goods. And if so, at what level?\n\nA trade war with US is not in the UK’s interests, but what happens next will depend on the conditions the Trump administration imposes. There is already talk that the UK should choose between the US or EU, assuming that regional trade blocs emerge because of other countries’ retaliatory moves.\n\nThe effects will be similar for the EU, although there is a significant difference. The EU as a bloc has its own trade policy and a similar-sized economy to that of the US. As such, the incentive for retaliation and a trade war between the EU and US is strong. \n\nIf the EU decides to go down that route, it will make things complicated for the UK. In this scenario, the UK would eventually need to choose a side. It would have to choose either the special relationship with the US and a further deterioration of trade with the EU – its nearest market. Or it would have to opt to move politically and economically closer to the EU.\n\nSadly, when countries close their borders to trade, they are also – perhaps inadvertently – readying themselves for conflict.\n\nAgelos Delis receives funding from the Department of Business and Trade. \n\nSami Bensassi receives funding from the Foreign, Commonwealth & Development Office.","url":"https://home.nzcity.co.nz/news/article.aspx?id=412918","image":null,"video":null,"publish_date":"2024-12-17 23:48:24","author":null,"language":"en","source_country":"nz","sentiment":0.101},{"id":274055292,"title":"Cuba reiterates readiness to talk to Trump","text":"HAVANA: Cuba on Tuesday (Dec 17) reprised its willingness to enter into a dialogue with Donald Trump when he returns as US president in January, despite his reinstatement of restrictions during his first term.\n\n\"Cuba will not be the one to suggest or take the initiative to suspend existing dialogue or cooperation, not even discreet exchanges on sensitive issues,\" Deputy Foreign Minister Carlos Fernandez de Cossio said on the tenth anniversary of the rapprochement coordinated by ex-presidents Barack Obama and Raul Castro.\n\nOn Dec 17, 2014, Obama and Castro announced the beginning of a process that led to the restoration of diplomatic relations in 2015, after more than half a century of confrontation between Washington and the communist-run island.\n\nThe process culminated with Obama, his wife Michelle and their two daughters visiting Havana in March 2016.\n\nTrump reversed Obama's Cuba policies and toughened a US embargo in place since 1962.\n\nBesides placing restrictions on sending remittances to family in Cuba, he banned most individual visits to Cuba and put the island back on a list of states that sponsor terrorism.\n\nCurrent President Joe Biden kept Cuba on that list but resumed discussions with Havana on the fight against terrorism and illegal migration.\n\nCuba has suffered an unprecedented emigration wave since 2022, driven by a deep economic crisis which has led to three nationwide blackouts in two months and shortages of food and fuel.","summary":"","url":"https://www.channelnewsasia.com/world/cuba-reiterates-readiness-talk-trump-4813016","image":"https://onecms-res.cloudinary.com/image/upload/s--G61xahwF--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-12-17t110907z_2_lynxmpekbg0dl_rtroptp_3_usa-trump.jpg?itok","video":null,"publish_date":"2024-12-17 23:48:03","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.037},{"id":274055294,"title":"Salesforce closes 1,000 paid 'Agentforce' deals, looks to robot future","text":"Salesforce has closed more than 1,000 paid deals for \"Agentforce,\" its platform for creating virtual representatives powered by artificial intelligence, its CEO Marc Benioff said on Tuesday.\n\nAt a company event in San Francisco, Salesforce previewed improvements for how businesses could build bots for recruiting, customer service and other specific tasks on its platform and in its messaging app Slack.\n\nSalesforce has done as much for its own operations, said Benioff. He said his company now needed half the number of humans to resolve simple customer queries, though he still wants to increase the company's headcount in sales by 10 per cent or more.\n\nSince ChatGPT's launch in 2022, many companies have piloted AI without yet deriving major savings or revenue from it.\n\nFor Benioff, who in recent months has focused his cloud company on agents, \"digital labor\" is poised to augment humans and expand the economy. Further out, Salesforce will start a \"robot force partner program\" that can connect real-world machines with virtual ones, he told reporters.\n\nBenioff cited hotel chains as an example. They could handle back- and front-office work with an army of focused digital assistants, while robots could clean guests' rooms, he said.\n\nThe Salesforce co-founder and Time magazine owner said he hoped President-elect Donald Trump's administration would engage CEOs on the topic of digital labor. Trump appeared on a recent Time cover as the magazine's \"Person of the Year.\"\n\nAsked if he expected to donate to Trump's inaugural fund as others have done, Benioff said: \"I think we just donated the photo. He can use the Time cover at no charge.\"","summary":"","url":"https://www.channelnewsasia.com/business/salesforce-closes-1000-paid-agentforce-deals-looks-robot-future-4813021","image":"https://onecms-res.cloudinary.com/image/upload/s--2NPVhQHy--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-12-17t234643z_1_lynxmpekbg104_rtroptp_3_salesforce-stocks.","video":null,"publish_date":"2024-12-17 23:47:23","author":null,"language":"en","source_country":"sg","sentiment":0.041},{"id":274053442,"title":"Biden Border Policies Blasted as Suspected Gang Members Arrested in Aurora","text":"What's NewA police chief in Colorado said his city and others like it were picking up the pieces of President Joe Biden's border policies, as he announced the arrest of 14 suspected migrant gang members Tuesday.The group was arrested after two people were effectively tortured in an apartment building in the city of Aurora—one of the focal points of the immigration discussion during the presidential election campaign.\"They were pistol-whipped, they were beat, they were mistreated,\" Chief Todd Chamberlain said at a press conference Tuesday. \"So does that fall in the category of torture for me? Yeah, it does.\"Newsweek reached out to the White House and Immigration and Customs Enforcement (ICE) for comment Tuesday evening via email.Why It MattersThe arrests come after the Colorado city was thrust into the national spotlight in September, following a viral video allegedly showing Venezuelan migrants armed in an apartment building. President-elect Donald Trump and other members of the Republican Party said Aurora had been taken over by migrants, which local leaders denied.What To KnowChief Chamberlain said his officers were called to The Edge at Lowry Apartments Monday night after two residents were taken by a group to a different apartment, where they were \"terrorized\" as their home was burgled.Both the victims, who are thought by law enforcement to be immigrants, were bound, and one was stabbed. They were only released once they promised not to go to the police, but they told officers anyway.The building was one of a handful highlighted by the GOP in September as having been taken over by members of the Venezuelan gang Tren de Aragua. While local leaders insisted to Newsweek that the gang's presence was restricted to these apartment buildings, there were claims the city itself was struggling to cope with migrant numbers.\"As the nation knows, this complex is an incredibly problematic complex,\" the chief said Tuesday.Chamberlain said he suspected the group were members of TdA and that his team was working with federal immigration enforcement agencies to identify them. Monday's arrests followed several others in recent months.The chief said he had spoken to a person at the White House in September, who told him that once a person crosses the border \"that's all we really care about\", which he said was a problem.What People Are SayingChief Chamberlain said at Tuesday's press conference: \"We have individuals who come to our country, they get dropped off into a community, they have absolutely no infrastructure, they have absolutely no support, they have absolutely no guidance from the federal government on what to do, how to live, how to survive. This is the ramifications of that activity.\"This is the ramifications of not monitoring what's occurring, how it's occurring and who it's occurring to. So now in Aurora, we are now in the process, as are many other cities across this nation, of picking up the pieces of a very bad system that was in place.\"Conservative commentator Charlie Kirk, posted on X, formerly Twitter: \"Tom Homan should set up a command center in Aurora, CO. Ground Zero for his first massive initiative. We want perp walks of all of these evil gang members torturing and extorting American citizens. Go street by street, apartment complex by apartment complex.\"What's NextThe chief said his department's work would continue to bring those responsible for Monday's incident to justice. Work was ongoing to determine the identities of those arrested, with Chamberlain saying evidence suggested they were TdA members.","summary":"A Colorado police chief said his city and others like it had been forced to pick up the pieces of a broken immigration system.","url":"https://www.newsweek.com/aurora-colorado-migrant-gang-members-arrested-chief-blasts-biden-policy-2002467","image":"https://d.newsweek.com/en/full/2546648/aurora-colorado-apartment-building.jpg","video":null,"publish_date":"2024-12-17 23:47:10","author":"Dan Gooding","authors":["Dan Gooding"],"language":"en","category":"politics","source_country":"US","sentiment":-0.362},{"id":274062720,"title":"Blinken Anthony \n Net Worth","text":"Anthony John Blinken – American politician, US Secretary of State. US Deputy Secretary of State in 2015–2017.\n\nPlace of Birth. Education. Anthony Blinken was born April 16, 1962, in Yonkers, New York, to Jewish parents Judith (Frem) and Donald M. Blinken, former US Ambassador to Hungary. His maternal grandparents were Hungarian Jews. Blinken’s uncle, Alan Blinken, served as the American ambassador to Belgium. Great-grandson of the Jewish writer Meyer Blinken (1879–1915), a native of Pereyaslav and a graduate of the Kiev Commercial School, published in Yiddish under the pseudonym “B. Meer”. Blinken’s grandfather was born in Kiev, when the city was part of the Russian Empire. He migrated to the United States, graduating from New York University in 1921 and law school in 1924.\n\nAnthony Blinken attended the prestigious New York Dalton Private School until 1971. In 1970, the parents divorced, and the following year, the mother married Polish-born Holocaust lawyer and writer Samuel Pizar and moved with her son to Paris, where she headed the American Center for Students and Artists. In Paris, Blinken attended the École Jeannine Manuel.\n\nBlinken graduated from Harvard University in 1984. where he was one of the editors of the student newspaper The Harvard Crimson. In 1985 pHe continued his education at Columbia University, enrolling in law school. \n\nCareer. Wrote reports for the New Republic. After receiving his Juris Doctor degree in 1988, he practiced law in New York and Paris.\n\nIn 1988, Blinken worked with his father Donald to raise funds for the presidential campaign of Democrat Michael Dukakis.\n\nFor two decades, Blinken has held senior foreign policy positions in two administrations. From 1994 to 2001 he was a member of the staff of the National Security Council. \n\nFrom 1994 to 1998, Blinken was Special Assistant to President Bill Clinton and Senior Director of Strategic Planning and Senior Director of Speeches at the NSC. \n\nFrom 1999 to 2001 he was Special Assistant to the President and Senior Director for European and Canadian Affairs.\n\nFrom 2001 to 2002 – Senior Research Fellow at the Center for Strategic and International Studies.\n\nFrom 2002 to 2008, he headed the apparatus of the Democratic faction of the US Senate Committee on Foreign Relations (one of the Committee chairmen during this period was Senator Joe Biden).\n\nIn 2008, Blinken worked for the Joe Biden presidential campaign and was a member of the Obama-Biden presidential team.\n\nIn 2009–2013, during the first term of Barack Obama, Anthony Blinken served as National Security Advisor to Vice President Joe Biden. Blinken has been involved in shaping US strategy on Afghanistan, Pakistan, the Iran nuclear deal and Syria, advocating a military campaign against the Assad regime over the use of chemical weapons in 2013.\n\nIN 2013–In 2015, he was Deputy National Security Adviser to the President of the United States.\n\nOn November 7, 2014, President Obama announced that he would nominate Blinken to the position of Assistant Secretary of State, replacing William Joseph Burns, who had resigned. On December 16, 2014, Blinken was confirmed by the Senate as Deputy Secretary of State by a vote of 55 to 38.\n\nHe took part in the development of the most important foreign policy decisions of the Obama administration: the elimination of Osama bin Laden in 2011, the war against the Islamic State. “I have never seen a more courageous decision taken by a leader”, – Blinken said, commenting on the operation to assassinate the head of the terrorists.\n\nIn 2018, he co-founded, with former Assistant Secretary of Defense for Political Affairs Michelle Flournoy, WestExec Advisors, a political strategy consulting firm.\n\nDuring the 2024 presidential campaign, he was a foreign policy adviser to presidential candidate Joe Biden.\n\nOn November 23, 2024, Joe Biden announced the list of his candidates for key positions in his future cabinet, naming Tony Blinken as a contender for the post of Secretary of State.\n\nJanuary 26, 2024 confirmed by the Senate to the post of US Secretary of State.\n\nBlinken and Ukraine. When Russia occupied Crimea in 2014, Blinken called it a strategic defeat for the Kremlin. Since then, he has consistently advocated increasing pressure on the Russian Federation. V speech at the Brookings Institution in June 2014, he stressed that extensive sanctions against the environment of the President of the Russian Federation Putin and all Russians “are of decisive importance”, to “to show the Russian people that there is a very heavy fine for supporting international criminals like Putin.” He also actively advocated the need for political isolation of Russia and Putin in the form of exclusion of the Russian Federation from the G8.\n\nBlinken called Russia’s war against Ukraine “a flagrant violation of the most basic norms of the international order that the United States helped establish after World War II”. And if in 2015 in an interview with a newspaper Day Blinken, while in Kiev as an Obama administration politician, opposed the supply of lethal weapons to Ukraine, then already in 2017 he radically changed his position, stating in a column for NYT: “Weapons for Ukraine – an idea whose time has come. \n\nDuring the presidency of Donald Trump, Blinken supported his decision to bomb Syria, as well as to provide Ukraine with lethal weapons. \n\nPersonal life. He is married to Irish Catholic Evan Ryan, granddaughter of the former head of the US Secret Service, who began her career in the 1990s as an assistant to the first lady of the United States (the wedding ceremony was held jointly according to the Catholic and Jewish rites).\n\nHobbies. Blinken plays guitar and has three songs available on Spotify as ABlinken.","summary":"Anthony John Blinken &#8211; American politician, US Secretary of State. US Deputy Secretary of State in 2015&#8211;2017. Place of Birth. Education. Anthony Blinken was born April 16, 1962, in Yonkers, New York, to Jewish parents ... Read more\n\n\nThe post Blinken Anthony\n\n Net Worth appeared first on Turkish Weekly.","url":"https://turkishweekly.net/blinken-anthony-net-worth/","image":"https://turkishweekly.net/wp-content/uploads/2022/01/20210401093306-9139.jpg","video":null,"publish_date":"2024-12-17 23:44:20","author":"Vealthy Milton","authors":["Vealthy Milton"],"language":"en","category":"politics","source_country":"tr","sentiment":0.284}]}