{"offset":0,"number":50,"available":15996,"news":[{"id":266377648,"title":"'Lobbyist for the government of Qatar': Experts slam Trump’s new AG nominee","text":"Less than 24 hours after former Rep. Matt Gaetz (R-FL) withdrew his name from consideration for Attorney General, President-Elect Donald Trump announced Gaetz's replacement for the nomination. \n\n\"I am proud to announce former Attorney General of the Great State of Florida, Pam Bondi, as our next Attorney General of the United States,\" Trump wrote via Truth Social. \n\nA slew of legal experts and journalists quickly reacted to the news, many criticizing the president-elect's choice.\n\nREAD MORE: Trump picks his ex-impeachment defense lawyer to replace Gaetz as AG nominee\n\nRochester Institute of Technology law professor David Cay Johnston commented: \"Pam Bondi, Trump's new AG pick, is so corrupt. She took an illegal $25,000 campaign donation from the Trump Foundation. Bondi kept the money (!!!), given when -- as Florida AG -- she shut down her office's investigation of the utterly fraudulent Trump University.\"\n\nOrlando Sentinel columnist Scott Maxwell added: \"Hi America. If you want to understand why Donald Trump likes Pam Bondi, know this: Complaints were filed about Trump U. in with attorneys general in two states. - NY's AG pursued and got a $25 million settlement - Trump gave Bondi $25k, and she did nothing.\"\n\nJournalist Ken Klippenstein wrote: \"Trump's new pick for AG, Pam Bondi, was a registered lobbyist for the government of Qatar\"\n\nHuman Rights Campaign national press secretary Brandon Wolf replied: Two days after my best friends and 47 others were murdered at Pulse Nightclub, Pam Bondi tried to paint herself as a friend to the community. She hoped we’d forget that, just TWO years earlier, she said our freedom to marry would cause 'significant public harm.' We didn’t.\"\n\nDemocratic strategist Ameshia Cross replied: \"The same Pam Bodi who let Jeffrey Epstein slide\"\n\nREAD MORE: Trump rejects effort to install Project 2025 author over 'controversial' stance on key issue\n\nLong Island County, New York's Suffolk Young Democrats Chair Skyler Johnson commented: \"Trump makes sure to point out that she was the first female Attorney General of Florida. I’m sorry - I thought acknowledging such things was an unforgivable sin, and proof someone was selected because of DEI? Are the rules different now?\"","summary":"Less than 24 hours after former Rep. Matt Gaetz (R-FL) withdrew his name from consideration for Attorney General, President-Elect Donald Trump announced Gaetz's replacement for the nomination. \n\n\"I am proud to announce former Attorney General of the Great State of Florida, Pam Bondi, as our next Attorney General of the United States,\" Trump wrote via Truth Social. \n\nA slew of legal experts and journalists quickly reacted to the news, many criticizing the president-elect's choice.\n\nREAD MORE: Trump picks his ex-impeachment defense lawyer to replace Gaetz as AG nominee\n\nRochester Institute of Technology law professor David Cay Johnston commented: \"Pam Bondi, Trump's new AG pick, is so corrupt. She took an illegal $25,000 campaign donation from the Trump Foundation. Bondi kept the money (!!!), given when -- as Florida AG -- she shut down her office's investigation of the utterly fraudulent Trump University.\"\n\nOrlando Sentinel columnist Scott Maxwell added: \"Hi America. If you want to understand why Donald Trump ","url":"https://www.alternet.org/pam-bondi-trump-ag/","image":"https://www.alternet.org/media-library/image.jpg?id=54966131&width=1200&height=600&coordinates=0%2C285%2C0%2C285","video":null,"publish_date":"2024-11-22 01:11:00","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.354},{"id":266377444,"title":"AP News Summary at 8:05 p.m. EST","text":"Trump convinced Republicans to overlook his misconduct. But can he do the same for his nominees?\n\nWASHINGTON (AP) — President-elect Donald Trump has tried to act with impunity while staffing his new administration, choosing loyalists who often lack expertise or sometimes face sexual misconduct allegations. Now his efforts have hit their first roadblock. Trump's choice for attorney general, Matt Gaetz, withdrew from consideration on Thursday. The former Florida congressman was widely disliked by his colleagues and he was accused of having sex with an underage girl. Now the question is whether Gaetz was uniquely unpalatable or if Trump's other picks could exceed Republicans' capacity to overlook red flags. For example, potential Pentagon chief Pete Hegseth paid a confidential settlement to a woman who accused him of sexual assault.\n\nDeath toll in Gaza from Israel-Hamas war passes 44,000, Palestinian officials say\n\nDEIR AL-BALAH, Gaza Strip (AP) — Palestinian health officials say the death toll in the Gaza Strip from the 13-month-old war between Israel and Hamas has surpassed 44,000. The Gaza Health Ministry does not distinguish between civilians and combatants in its count, but it has said that more than half of the fatalities are women and children. The Israeli military says it has killed over 17,000 militants, without providing evidence. The war began when Hamas-led militants stormed into southern Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting another 250. Around 100 hostages are still inside Gaza, at least a third of whom are believed to be dead. Most of the rest were released during a cease-fire last year.\n\nPutin touts Russia's new missile and delivers a menacing warning to NATO\n\nThe new ballistic missile fired by Russia struck a military-industrial facility in the central Ukrainian city of Dnipro, but its real mission was delivering a deadly new message to NATO. Hours after Thursday’s strike touched off a debate over whether the Ukrainian plant was hit by an intercontinental ballistic missile, President Vladimir Putin cleared up the mystery in a rare and surprise appearance on Russian television. He described it as a new, intermediate-range ballistic missile that raced to its target at 10 times the speed of sound and couldn't be stopped by modern anti-missile systems. One Western expert said it was the first time that such a missile was used in the war — and perhaps in any conflict.","summary":"Trump chooses loyalist Pam Bondi for attorney general pick after Matt Gaetz withdraws","url":"https://www.postandcourier.com/aikenstandard/news/nation/ap-news-summary-at-8-05-p-m-est/article_9af5bfc8-c9d8-5131-9732-9296e28305e3.html","image":"https://bloximages.newyork1.vip.townnews.com/postandcourier.com/content/tncms/custom/image/4baaad6a-de4a-11ea-8c18-4b8516e38b1c.jpg?resize=600%2C315","video":null,"publish_date":"2024-11-22 01:05:45","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.353},{"id":266377258,"title":"North Korean leader says past diplomacy only confirmed US hostility","text":"SEOUL, South Korea (AP) — North Korean leader Kim Jong Un said his past negotiations with the United States only confirmed Washington’s “unchangeable” hostility toward Pyongyang and described his nuclear buildup as the only way to counter external threats, state media said Friday.\n\nKim spoke Thursday at a defense exhibition where North Korea displayed some of its most powerful weapons systems, including intercontinental ballistic missiles designed to target the U.S. mainland, the North’s Korean Central News Agency said. While meeting with army officers last week, he had pledged a “limitless” expansion of his military nuclear program.\n\nKim has yet to comment directly on Donald Trump’s reelection as U.S. president. During his first term, Trump held three highly orchestrated summits with the North Korean leader in 2018 and 2019, before the diplomacy collapsed over disagreements in exchanging the release of U.S.-led economic sanctions and the North’s steps to wind down its nuclear program.\n\nDuring the speech at the exhibition, Kim touched on the failed summits without naming Trump.\n\n“We have already gone as far as possible with the United States with negotiations, and what we ended up confirming was not a superpower’s will for coexistence, but a thorough position based on force and an unchangeable invasive and hostile policy,” toward North Korea, Kim said.\n\nKim accused the United States of raising military pressure on North Korea by strengthening its military cooperation with regional allies and increasing the deployment of “strategic strike means,” apparently a reference to major U.S. assets like long-range bombers, submarines and aircraft carriers. He called for accelerated efforts to advance the capabilities of his nuclear-armed military, saying the country’s only guarantee of security to build up the “strongest defense power that can overwhelm the enemy.”\n\nKim’s expanding nuclear weapons and missile program includes various weapons targeting South Korea and Japan and longer range missiles that have demonstrated the range to reach the U.S. mainland. Analysts say Kim’s nuclear push is aimed at eventually pressuring Washington into accepting the North as a nuclear power and to negotiate economic and security concessions from a position of strength.\n\nIn recent months, the priority of Kim’s foreign policy has been Russia, as he tries to strengthen his international footing, embracing the idea of a “new Cold War” and aligning with President Vladimir Putin’s broader conflicts with the West.\n\nWashington and its allies have accused North Korea of providing Russia with thousands of troops and huge amounts of military equipment, including artillery systems and missiles, to help sustain its fighting in Ukraine. Kim in return could possibly receive badly needed economic aid and possible Russian technology transfers that would possibly enhance the threat posed by his nuclear-armed military, according to outside officials and experts.\n\nEven with Trump returning to the White House, a quicky resumption of diplomacy with Pyongyang could be unlikely, according to some experts. North Korea’s deepening alliance with Russia and the weakening sanctions enforcement against Pyongyang are presenting further challenges in the diplomatic push to resolve the nuclear standoff with Kim, who also would have a greater perception of his bargaining powers following a rapid expansion of his arsenal in recent years.","summary":"SEOUL, South Korea (AP) — North Korean leader Kim Jong Un said his past negotiations with the United States only confirmed Washington’s “unchangeable” hostility toward Pyongyang and described his nuclear buildup as the only way to counter external threats, state…","url":"https://www.thestar.com/news/world/asia/north-korean-leader-says-past-diplomacy-only-confirmed-us-hostility/article_3b9739f0-4c9a-5f34-8b89-52f6aa9878a4.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/3/ca/3caec98e-7cff-5b65-966d-3e7fae2fb7f9/673fd8bd00b8b.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2024-11-22 01:03:34","author":"Kim Tong-hyung The Associated Press,Wire Content","authors":["Kim Tong-hyung The Associated Press","Wire Content"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.05},{"id":266377578,"title":"Election 2024: No sign of The Monk — but the faithful turn out in numbers for Mary Lou","text":"Fr Brendan has forgotten where he left the holy water to bless the tree. As the people wait and Elton John beckons everyone to ‘Step into Christmas’, a young boy throws small triangular sandwiches on the ground with one hand and waves one of Mr Hutch’s leaflets in the other.\n\nSome speculated that the controversial candidate might grace the community event but, aside from a well-timed appearance of a small van with Mr Hutch’s face, he is nowhere to be seen.\n\nSinn Féin leader Mary Lou McDonald is right in the thick of things, however, as she targets the youth vote just over one week out from election day.\n\n“It is you who has the most to gain in this election, and the most to lose,” is the refrain she delivers to groups of students in Dublin City University (DCU) and the gathered youth at a busy city centre pub.\n\nResponding to concerns about Mr Hutch’s candidacy, Ms McDonald says the law dictates who can run for election, but added: \n\n“I will say this: Representing the communities who really suffered in the course of that gangland conflict — it wasn’t glamourous, it is not cool, it is not funny. \n\n There were people, families, and children left very traumatised still by that.\n\nThe question is asked by one of a mob of students who cluster around the Dublin TD as soon as she arrives. \n\nWhile a few are just there to get content for their social media, most are eager to speak to the woman who would be taoiseach about their concerns.\n\nSpeaking to students, we hear that Sinn Féin feels like a party they “know”.\n\nBeth O’Connor, aged 19, says that Sinn Féin speaks to young people in what feels like a clear and transparent manner. \n\nOthers say they appreciate the lack of political jargon from the party.\n\nMs McDonald’s appeal does not stop with students. \n\nAs she walks the main street in Bray, she receives plenty of compliments from women.\n\n“You’re as attractive in person as you are on the television,” one woman says, holding Ms McDonald’s hand.\n\nAnother woman claims Ms McDonald is the only potential taoiseach who will be able to give US president-elect Donald Trump what for during the annual St Patrick’s Day trip to the White House.\n\nWhile in Bray, Ms McDonald drops in to Jigsaw Wicklow, a mental health charity for young people.\n\nIn conversation with the staff, Ms McDonald recalls the student in DCU who told her that “if you don’t have good mental health, you don’t have anything”.\n\nAccessible mental health services for young people, or lack thereof, is within the top three issues among the youth of Ireland, she notes.\n\n“The World Health Organization recommends 12% of the health budget go towards mental health and seeing it be 6% in the last budget is really disappointing to see,” says Aisling Murphy, a youth advocate at Jigsaw Wicklow.\n\nMs McDonald responds by saying that Sinn Féin will extend the cut-off point for youth mental health services to the age of 25.\n\nWarm reception on a cold day\n\nA lengthy day walking the freezing streets of Dublin and Wicklow ends in a much warmer spot as an enthusiastic group of young Sinn Féin members gather in the basement of a bar in Dublin to hear Ms McDonald speak.\n\nShe receives warm applause and cheers but it is when Brian Warfield of the Wolfe Tones joins her on stage that the atmosphere really picks up.\n\nMs McDonald had laughed at the suggestion that she should sing for her votes on stage at the Christmas light ceremony but sing for her vote she did, joined by a choir of guaranteed youth voters eager to see her as the first female taoiseach.","summary":"During an upbeat meeting with students, SF president struck a serious note about the candidacy of Gerry Hutch, saying of Dublin's gangland conflict: 'It wasn’t glamourous, it is not cool, it is not funny'","url":"https://www.irishexaminer.com/news/politics/arid-41521856.html","image":"https://www.irishexaminer.com/cms_media/module_img/8778/4389425_19_seoimage1x1_2.78268223.jpg.jpg","video":null,"publish_date":"2024-11-22 01:02:00","author":"Irishexaminer.com,Michelle McGlynn, Political Reporter","authors":["Irishexaminer.com","Michelle McGlynn, Political Reporter"],"language":"en","source_country":"ie","sentiment":-0.063},{"id":266377240,"title":"RFK Jr.’s fluoride concerns gain steam in Arkansas legislature","text":"Four Republicans filed two bills on Wednesday that could remove the state’s mandatory fluoridation of drinking water after Robert F. Kennedy Jr., the incoming Trump administration’s nominee to head the Department of Health and Human Services, has repeatedly expressed concerns about the chemical. \n\n​​State Sens. Clint Penzo and Bryan King introduced Senate Bill 2 and Senate Bill 4, which were cosponsored by Reps. Matt Duffield and Aaron Pilkington.\n\nEfforts in Arkansas to give control to local water providers over whether to add fluoride to the public water supply have failed in the past. But as Kennedy looks to overhaul one of the country’s largest health bureaucracies and gains prominence in President-elect Donald Trump’s second term, his concerns about side effects from fluoride appear to be gaining traction across the country. \n\nCity commissioners in Winter Haven, Florida, recently cited Kennedy as part of their impetus to remove fluoride from the city’s water supply. \n\nMeanwhile, a local Arkansas water district has fought for years against the state’s mandate requiring water fluoridation. Arkansas’s Department of Health has fined the Ozark Mountain Regional Public Water Authority, which has 5,000 customers, more than $100,000 for refusing to add fluoride to its water system. The water provider is being penalized $500 per week for defying the state’s mandate. \n\nOMRPWA Board Chairman Andy Anderson told the Eureka Spring Independent that his customers had requested that the chemical be removed from their drinking supply. \n\n“The customers we sell wholesale water to adamantly opposed the mandate and remain opposed to it,” Anderson said. “We’ve got several smaller systems that had fluoride levels above the contaminant levels allowed, and the ADH said they had to do something. So, we banded together to create the OMRPWA in 2009. Then the Arkansas Legislature came along in 2011 and said we would have to start adding fluoride.”\n\nWith Republicans holding a supermajority in both the state’s chambers and Gov. Sarah Huckabee Sanders (R-AR) being a close Trump ally who has praised Kennedy, the GOP’s latest efforts to reduce oversight over water fluoridation might have a chance to pass once Arkansas’s legislative session picks up in January. \n\nOne of the country’s premier health agencies, the Centers for Disease and Control and Prevention, has long praised fluoridation of water as safe, touting the “benefits of community water fluoridation as an effective, cost-efficient method for preventing tooth decay and improving overall oral health.”\n\nAs some federal studies show high levels of fluoride are linked to lower IQs in children and lowered testosterone levels in men, Kennedy has argued the chemical could have questionable side effects, pointing to a recent California court decision that ordered the Environmental Protection Agency to address potential health risks with fluoride.\n\nHe announced earlier this month that Trump would immediately “advise all U.S​. water systems to remove fluoride from public water” when he takes office on Jan. 20.","summary":"Arkansas Republicans want to give state residents control over whether to add fluoride to the public water supply.&#160; Four Republicans filed two bills on Wednesday that could remove the state’s mandatory fluoridation of drinking water after Robert F. Kennedy Jr., the incoming Trump administration’s nominee to head the Department of Health and Human Services, has [&#8230;]","url":"https://www.washingtonexaminer.com/policy/healthcare/3238376/rfk-jr-fluoride-concerns-gain-steam-arkansas-legislature/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/09/Robert-F.-Kennedy-Jr.-_vv2.webp","video":null,"publish_date":"2024-11-22 01:01:07","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"us","sentiment":-0.292},{"id":266376234,"title":"US official says 'tariffs' not the only issue dictating trade amid worries about Trump's policy","text":"A senior US diplomat said Thursday tariffs are \"not the only issue\" that will \"make or break\" trade, as concerns have lingered over President-elect Donald Trump's election-year proposal for sweeping tariffs on US imports that could affect trade with South Korea and other partners.\n\nMatt Murray, the US senior official for Asia-Pacific Economic Cooperation at the State Department, made the remarks as he addressed a question about whether the APEC platform can serve as an effective forum to help prevent the potential emergence of trade protectionism.\n\n\"Tariffs are not the only issue that make or break trade. We need supply chain resiliency. We need trade facilitation. We need good governance. We need anti-corruption. We need good rules around customs and border protection,\" he said during the briefing hosted by the Foreign Press Center.\n\n\"We need to enable digital trade. We need to make sure that we're all talking about rules around e-commerce and cross-border data flows and all of these things ... You can have discussions about tariffs (at APEC), but you can also have discussions about a lot of other things that constitute good economic and trade relations,\" he added.\n\nHe stressed that APEC has a \"multi-faceted\" approach to trade, and that it has a \"built-in\" opportunity for its 21 member economies to come together every year to talk about challenges facing them.\n\nOn the stump, Trump underscored his pursuit of tariffs on foreign goods, a move that would affect trade ties with South Korea and other partners.\n\nThe president-elect has said he might slap tariffs of up to 20 percent on all US imports while proposing a 60 percent tariff on Chinese goods.\n\nCommenting on South Korea's planned hosting of the APEC summit next year, Murray said that the Asian country is \"very well placed\" to lead the APEC agenda, involving a wide range of topics, including supply chains.\n\n\"I think when it comes to the APEC agenda, if you talk about interconnected trade and supply chains, if you talk about innovation, digitalization, if you talk about sustainable and inclusive growth, then Korea is very well placed to lead that agenda and share that agenda next year as the host,\" he said.\n\nHe pledged that Washington will be supportive of South Korea's chair role next year.\n\n\"We want to be supportive of the chair as much as possible,\" he said. \"I think particularly given that we were the chair just a year ago, we also are very understanding of a lot of the pressures both in the region and also domestically that come with chairing APEC, and so we want to be as supportive as possible.\" (Yonhap)","summary":"A senior US diplomat said Thursday tariffs are &quot;not the only issue&quot; that will &quot;make or break&quot; trade, as concerns have lingered over President-elect Donald Trump&#039;s election-year proposal for sweeping tariffs on US imports that could affect trade with South Korea and other partners. Matt Murray, the US senior official for Asia-Pacific Economic Cooperation at the State Department, made the remarks as he addressed a question about whether the APEC platform can serve as an","url":"https://www.koreaherald.com/view.php?ud=20241122050009","image":"https://res.heraldm.com/content/image/2024/11/22/20241122050004_0.jpg","video":null,"publish_date":"2024-11-22 00:58:29","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"kr","sentiment":0.488},{"id":266375766,"title":"The Hells Angel with a Hitler tattoo, suitcases stuffed full of dollars... and the chilling inside story of how Iran is using a network of criminal thugs to spread terror to Britain - and the world","text":"I am sitting in the corner of a quiet cafe in the centre of a major Western city talking to an intelligence source who has promised me something exceptional.\n\n'David, we know that Iran – specifically its international terror networks – is a subject of great interest to you,' they say.\n\nI agree. Iran's proxy terror groups Hamas and Hezbollah may be dispensing sadism and death thousands of miles away, but Iran's network of terror stretches out from the Middle East and across continents.\n\nUK counter-terror police have identified over 15 credible Iranian threats to kill or kidnap Britons or British residents since 2022. In March, in the London suburb of Wimbledon, an Iranian-British journalist was stabbed outside his home four times by Eastern European criminals in the pay of Tehran.\n\n'Well, given your interest, we have something for you.' A sheaf of documents slides across the smooth polish of the table. It is marked 'Top Secret'.\n\n'Does the name 'Ramin Yektaparast' mean anything to you?' the source asks. It does.\n\nYektaparast was a German-Iranian leader of a Hells Angels biker gang. A brutal thug and unashamed anti-Semite with a tattoo of Adolf Hitler on his arm, he was suspected of numerous crimes, including planning attacks on synagogues in Germany in November 2022. These were barbarous crimes in which shots were fired and a Molotov cocktail thrown at synagogues in the cities of Essen and Bochum.\n\n'Understand Yektaparast and you understand exactly how Iran's international machine of terror works,' my source says. 'You're going to get a look right inside it.'\n\nWhat my source is about to show me is the most detailed account of Tehran's terror modus operandi that I have ever seen. My eyes flick to the first page of the dossier, which is headed: 'Report summarising the investigation of Ramin Yektaparast in Iran by Western Intelligence Agents.'\n\nI hit upon a startling paragraph: 'It can now be revealed that in early 2024 Yektaparast was detained for covert questioning by foreign intelligence personnel in Iran. \n\nDuring his interrogation, he described the history of his ties with Quds Force [the foreign operations branch of Iran's Revolutionary Guard]. He provided details of his handlers and of the targets. The accurate information he relayed facilitated the disruption of several terror attacks in Europe.'\n\nI read the words twice and look up.\n\n'Hold on,' I say to my source. 'These Western intelligence agencies captured and interrogated him... in Iran?'\n\nMy source looks at me and smiles. Ramin Yektaparast, I read, was the brain and brawn behind two terror attacks mounted by the Quds Force in Germany in 2022, as well as dozens of other foiled attacks in Europe.\n\nHe fled to Iran before he was due to stand trial in 2021 for the murder and dismemberment of another biker gang member in 2014. The Quds Force had approached him due to 'his reputation as a cruel gang leader with an extensive network of ties in Europe'. \n\nThe Iranians liked this thug's willingness to 'mount any type of terror attack that Quds Force asked of him'. He was passed onto Quds Force Unit 840, described to me as the regime's 'terror export' unit.\n\nYektaparast knew criminals in about 50 countries, many of them Mafia members. In 2023, he had begun working with gangs in Morocco and Poland as well as bringing members of these gangs to Iran. Most Mafia members have no ideology beyond making money, Yektaparast explained to his questioners in Iran. But the German and Polish mafia are different: they're raised to hate Jews.\n\nHe knew the Quds Force had flagged him as a good candidate for recruitment due to his openly anti-Semitic beliefs. His handlers were keen to exploit those ugly convictions and 'presented their anti-Semitic stances to him, noting that the Jews are the cause of all his troubles'.\n\nFrom there, it was a rapid immersion into the world of the Quds Force, which quickly began to shower him with money. On several occasions, Yektaparast was paid with dollar-stuffed suitcases: for the German synagogue attacks he received $5 million.\n\nContact was regular, and in multiple locations, including at the Quds Force's HQ in the Afsariyeh neighbourhood of south-east Tehran, as well as in restaurants, cars and elsewhere.\n\nHe began working with their operatives – these ranged from soldiers and killers of ruthless efficacy to Hamid, a 'short fat bully' responsible for arranging the entry and exit of assets to and from Iran.\n\nAmong Yektaparast's key contacts was a man named 'Sayeed' (in reality Mohsen Bozorgi from Unit 840). Through him, Yektaparast began to understand how the Quds Force worked. Sayeed was a bearded man. He smoked a packet of cigarettes a day, drove a Peugeot and had two children. He was always armed.\n\nYektaparast thought Sayeed was intelligent and reckoned he wanted to climb the ranks. No surprise then that Sayeed generally did only what the Quds force leadership told him to do.\n\nYektaparast was not always impressed with the Quds Force. He believed most of the terror activities abroad were carried out not by Quds Force operatives but by paid agents like him.\n\nThings often didn't go according to plan. The 2022 Germany synagogue attacks were a typical example. The plan was to throw two Molotov cocktails into two synagogues in Bochum, while also shooting at the windows.\n\nFor this, he turned to a criminal associate whom he knew hated Jews, a German-Iranian known as 'Babak J', 35. But Babak J ended up throwing Molotov cocktails at a school as well, before being arrested when an acquaintance tipped off the authorities.\n\nBabak J was charged with several crimes including conspiracy to commit aggravated arson and attempted arson and was eventually sentenced to two years and nine months in prison.\n\nDespite the blunder, Yektaparast's handlers were happy. He was paid in full. They were pleased no connection was made between him, the attacks and Quds Force. Europe, they crowed, would have no extra justification to designate the Islamic Revolutionary Guard Corps (IRGC), to which the Quds Force belongs, an officially proscribed terror organisation.\n\nWe are ignominiously timorous when it comes to facing down Iranian terror. Not a single European country has proscribed the IRGC. The Quds Force would be forgiven for believing it can operate with near impunity on European soil.\n\nYektaparast made clear to his interrogators that the organisation is using the latest technology as part of its foreign terror operations.\n\nIn 2022, he began plotting to kill Josef Schuster, the president of the Central Council of Jews in Germany. He wanted to attack Shuster with a drone and contacted a Quds Force individual named 'Sepher', who could arrange for a killer drone to be shipped from Iran to Istanbul and then to Europe on a lorry. He knew there are minimal checks on deliveries from Turkey to Germany.\n\nHe worked out that drones could carry up to 20 pounds of explosives and fly over 15 miles. His plan was to use a 3D printer to produce the drone components and then transfer the parts into Europe in packages of toys and video games on a lorry. His handlers loved it.\n\nHe began operational tests in Balochistan, near Iran's border with Pakistan. For one test, he used the drone to attack and kill a group of 20. Both Quds Force and Iranian domestic intelligence were aware of this.\n\nHe also carried out tests with senior Iranian security officials. At this point I was shown six photos of Yektaparast, taken from his phone, alongside Iranian security present during the tests. Everything was slotting into place. \n\nWith the drone selected and the route secured, it was just about transferring the explosives. Yektaparast found an aeroplane flight attendant. His plan was to ask her to take a package of documents on a flight to Germany and sneak the explosive into the documents. The attendant agreed but then changed her mind, and the operation was aborted.\n\nJust under two years later, Yektaparast would be killed, the victim of a shooting in Tehran. UK and US newspapers reported that Israeli Mossad got him, though the Iranian authorities claimed it was the result of a 'personal dispute'.\n\nAfter my meeting, I check the information on the secret documents against other sources. It all stacks up. The report I saw is clear evidence that Iran is employing the basest criminals to attempt to commit murder on its behalf around the world. And that modus operandi can be turned against anyone, no matter how powerful. \n\nFederal prosecutors in the US recently unsealed charges against Iranian operatives linked to a plot to assassinate Donald Trump in revenge for the then-President's 2020 killing of Quds Force leader Qassem Soleimani.\n\nTrump has made clear that his administration will make dealing with Iran a foreign policy priority. Tension between the two countries is inevitable.\n\nFollowing my meeting, I keep thinking about what I read in that cafe. But what sticks in my mind is something my source told me: 'David, this story is just the tip of the iceberg. There is so much more. Terror is vital to the Islamic Republic's foreign policy, and the Iranians will never stop, until we stop them.'\n\nSome details have been changed for reasons of security.","summary":"I am sitting in the corner of a quiet cafe in the centre of a major Western city talking to an intelligence source who has promised me something exceptional.","url":"https://www.dailymail.co.uk/news/article-14111607/Hells-Angel-Hitler-tattoo-Iran-network-criminal-thugs-terror-Britain.html","image":"https://i.dailymail.co.uk/1s/2024/11/21/20/92346375-0-image-m-19_1732219948983.jpg","video":null,"publish_date":"2024-11-22 00:53:36","author":"David Patrikarakos,Editor","authors":["David Patrikarakos","Editor"],"language":"en","source_country":"gb","sentiment":-0.02},{"id":266376262,"title":"Oregon Republican in the running for labor secretary, national outlets report","text":"U.S. Rep. Lori Chavez-DeRemer of Oregon is in the running to become labor secretary under President-elect Donald Trump, according to several national media reports.\n\nChavez-DeRemer, a Republican and former Happy Valley mayor, is finishing a two-year term representing Oregon’s 5th Congressional District, which stretches from south of Portland to Bend. She flipped the seat to Republican control in 2022, then narrowly lost her re-election bid this month to Democratic state Rep. Janelle Bynum in one of the most expensive and closely watched House races across the country.\n\nWillamette Week reported on Tuesday that Chavez-DeRemer was a contender for the top spot in the U.S. Department of Labor. Politico reported that Teamsters president Sean O’Brien is backing Chavez-DeRemer for the job, and Fox News said Wednesday that Chavez-DeRemer was scheduled to visit Trump’s Florida home at Mar-a-Lago this week.\n\nA Chavez-DeRemer spokesperson did not respond to a request for comment on Thursday. But in a statement to Fox News, Chavez-DeRemer said she’d be honored to support Trump’s “mission to empower and grow our nation’s workforce.”\n\n“Hardworking Americans finally have a lifeline with the president, and I’d work tirelessly to support his impressive efforts to remake the Republican Party into the Party of the American worker,” Chavez-DeRemer told the outlet.\n\nChavez-DeRemer’s father was a member of the Teamsters union, she said. She’s touted her support for unions during contract negotiations and for apprenticeship programs. She was one of just three Republicans to cosponsor a Democratic initiative expanding employee rights to bargain and organize, the Oregon Capital Chronicle reported, and the only Republican to vote against a Republican measure restricting which labor disputes go before the National Labor Relations Board.\n\nHowever, some Democrats and union leaders alleged during the campaign that Chavez-DeRemer’s labor support was surface level, criticizing her for missing anti-union meetings where she had a chance to defend unions against Republican attacks.\n\n“When it comes down to it, she has not shown up for us when we needed her in Congress,” Melissa Unger, executive director of SEIU 503 said at a Bynum rally in October. “She does not push her party to support workers.”\n\nBynum and Chavez-DeRemer split union support in the 5th District. Bynum had the backing of large public sector unions representing Oregon nurses and teachers, SEIU and the AFL-CIO. Chavez-DeRemer earned endorsements from trade and public safety unions representing everyone from ironworkers to firefighters. Oregon’s local Teamsters Joint Council 37 also endorsed Chavez-DeRemer in her reelection bid, though it backed Democrats in Oregon’s other contested state and congressional races.\n\n“She’s got more labor union endorsements than any Republican I’ve ever seen in my life,” House Speaker Mike Johnson, a Louisiana Republican, said at a Chavez-DeRemer campaign rally in October.\n\nJimbo Anderson, business manager and financial secretary for the Local 701 operating engineers union that represents nearly 4,000 heavy equipment operators and engineers in Oregon and southwest Washington, said Thursday he thought Chavez-DeRemer would make “a very good labor secretary.”\n\nWhen Anderson called Chavez-DeRemer during a 10-week strike against Valley Landfills last year and asked her to sign a petition urging the company to get back to the bargaining table, Chavez-DeRemer instead penned her own letter of support and offered to help mediate negotiations, Anderson said.\n\nAnderson is hopeful Chavez-DeRemer would help bring consistency to labor support at the federal level. Support for labor tends to seesaw according to the administration, he said: Democrats typically back labor unions while Republicans swing for big business. If politicians across both parties could take care of working people while enabling companies to make money, that would be a win-win for Americans, Anderson said. He thinks Chavez-DeRemer “knows both sides” of labor issues.\n\n“I honestly believe that if Trump is saying that he wants to support labor and take care of the working people, if he’s as smart as everybody thinks he is, he’d be crazy not to hire her,” Anderson said.\n\nSami Edge covers higher education and politics for The Oregonian. You can reach her at sedge@oregonian.com or (503) 260-3430.","summary":"Rep. Lori Chavez-DeRemer could land a new job in President Donald Trump's Cabinet.","url":"https://www.oregonlive.com/politics/2024/11/oregon-republican-in-the-running-for-labor-secretary-national-outlets-report.html","image":"https://www.oregonlive.com/resizer/v2/Q2CC23OUFVG4VLR4T42KOSQQFE.JPG?auth=e5f5b3b4d381991060468dc5a9e98a97a77715f08b0698a436637c2214ea6758&width=1280&quality=90","video":null,"publish_date":"2024-11-22 00:52:33","author":"Sami Edge","authors":["Sami Edge"],"language":"en","category":"politics","source_country":"us","sentiment":0.014},{"id":266375650,"title":"Ellen DeGeneres goes incognito with a new hair color while at a British bar with Portia de Rossi as they leave the United States following Trump’s election victory.","text":"Ellen DeGeneres and her wife Portia de Rossi are getting to know their new stomping grounds after reportedly relocating from the U.S. to rural England. \n\nThe couple have been spotted enjoying the tunes of The Corrs as they made a stop at The Farmer’s Dog, the new pub owned by British broadcaster Jeremy Clarkson, 64, that is located in the United Kingdom.\n\nIn video posted by the watering hole, Ellen, 66, and Portia, 51, were among those listening to the Irish band doing a relaxed, acoustic performance. \n\nSingers James Blunt, 50, and Natalie Imbruglia, 49, were also present.\n\n‘@natalie_imbruglia @thetallirish @jamesblunt what a great night in the pub with @thecorrsofficial ..the way a good pub night should be ..acoustic set, a few drinks, great friends @jeremyclarkson1 thanks for organising it!,’ the post was captioned. \n\nIt seems her new life abroad may have inspired Ellen to consider a new hairstyle – she ditched her familiar blonde for a head full of brunette tresses. \n\nThe couple, clad in matching black tops, cosied up together at a table as Ellen enjoyed a glass of water. \n\nThe video was shared last week, before The Wrap reported that the couple had moved to rural England. \n\nDeGeneres is taking up roots in the UK with her wife, and they reportedly have no plans to return to the US.\n\nTo underscore the apparent permanence of the move, the couple plan to put their Montecito mansion on the market.\n\nA person close to the former Ellen DeGeneres Show host claimed that she and de Rossi were primarily skipping town in response to the 2024 presidential election, which saw Donald Trump win a second non-consecutive term. \n\nThe couple are now reportedly living in the Cotswolds, a rural portion of Southwest England that is about 100 miles from London.\n\nThe area is popular with celebrities looking to avoid the hustle and bustle of London, which would make sense for DeGeneres and Rossi, as they had already tried to avoid Los Angeles by moving out to Santa Barbara County’s Montecito, about 75 miles from LA.\n\nA source told People that Ellen went across the pond last month to check out new houses before finding her newest residence.\n\n‘Ellen was in England house hunting in the beginning of October. She ended up finding a house that she loved and purchased it shortly after,’ the source said.\n\nThe insider noted of their latest outing at the pub: ‘They hung out with [Clarkson’s partner, actress] Lisa Hogan and James Blunt, and The Corrs performed at the pub.’\n\nEllen and Portia will have plenty of celebrity neighbors. Among the stars with properties in the Cotswolds are David and Victoria Beckham, Kate Moss, Patrick Stewart, Elizabeth Hurley, Jeremy Clarkson and Damien Hirst, among many others.\n\nThe area is even home to royalty, as King Charles owns Highgrove House in Gloucestershire.\n\nKate Winslet has also had a mansion in the area at one point, though it’s unclear if she still lives there, and Hugh Grant has been rumored for years to have a small hideaway in the Cotswolds.\n\nIn October, The Sun reported that the couple had bought a Cotswolds property, so their purchase predates the 2024 election.\n\nHowever, after Trump’s win the married couple became ‘very disillusioned,’ and one source claimed the vowed to ‘to get the hell out’ of the US afterward, according to sources who spoke to TMZ.\n\nThough many celebrities have threatened to leave the US in the face of a Trump win, most haven’t followed through.\n\nStars including Cher, Barbra Streisand, Sharon Stone and Sophie Turner have all said they were considering leaving the US if Trump won, though it’s not clear if any of them will actually do so.\n\nAmerica Ferrera is said to be considering a move to the UK, and Eva Longoria has spoken about relocating to Europe, though she clarified that, despite her disapproval of Trump, she had moved for international work.\n\nThe publication notes that DeGeneres was among Vice President Kamala Harris’ high-profile celebrity donors.\n\nShe donated $3,300 to the losing Democratic candidate, which is the maximum amount that can be donated directly to a candidate, though wealthy donors often get around the contribution limits by donating much more to political action committees and super PACs.\n\nHarris was tapped to replace President Biden as the Democratic candidate in July of this year, and DeGeneres shared an endorsement for her on social media in August.\n\nDespite reportedly leaving the US because of the election and Donald Trump’s looming second administration, DeGeneres had plenty of reasons for a new start away from home.\n\nHer career was tarnished — likely permanently — by accusations that she fostered a toxic workplace on the set of her eponymous daytime talk show, which aired its last episode on May 26, 2022.\n\nShe delved into her persona non grata status on her stand-up special For Your Approval, which was released on Netflix in late September.\n\nThe comedian joked that she had been ‘kicked out of show business’ in the special, which featured material about how she has been spending her time since the end of her TV show.\n\nAccording to The Wrap, DeGeneres and de Rossi have either pocket-listed their Bali-inspired Montecito mansion, or it will soon be listed.\n\nAccording to TMZ, they are still mulling a potential asking price, but once they settle on one the property will go on the market.\n\nDeGeneres and de Rossi purchased the massive home for an eye-popping $27 million in 2019.\n\nThe mansion features five bedrooms and 10 bathrooms over 8,188 square feet, and it includes exotic features like bamboo ceilings, flamed black limestone and gorgeous distressed oak floors. \n\nThe couple also sold their Carpinteria mansion for $96million in August.","summary":"Ellen DeGeneres and her wife Portia de Rossi are getting to know&#8230;","url":"https://internewscast.com/news/us/ellen-degeneres-goes-incognito-with-a-new-hair-color-while-at-a-british-bar-with-portia-de-rossi-as-they-leave-the-united-states-following-trumps-election-victory/","image":"https://internewscast.com/wp-content/uploads/2024/11/1732236514_rewrite-this-title-Ellen-DeGeneres-unrecognizable-as-a-brunette-at-800x430.jpg","video":null,"publish_date":"2024-11-22 00:49:31","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.39},{"id":266377658,"title":"Trump’s Pentagon pick Pete Hegseth ‘will get confirmed’ despite sexual assault allegations","text":"“As far as the media is concerned, it’s very simple. The matter was fully investigated, and I was completely cleared, and that’s where I’m gonna leave it,” Hegseth said, speaking to reporters after meeting with Republican senators. \n\nHegseth, who was accompanied by Vice President-elect J.D. Vance, met with Sens. Roger Wicker (R-MS), Marsh Blackburn (R-TN), Bill Haggerty (R-TN), John Barrasso (R-WY) and Sen. Markwayne Mullin (R-OK). All five Senators came out of the meetings with positive reviews, playing down the allegations.\n\nWicker, the incoming chairman of the Senate Armed Services Committee, said he believes Hegseth’s nomination is “going to be in pretty good shape,” and said they did not discuss the sexual assault allegation in their meeting.\n\n“We weren’t specific, but you know since no charges were brought by authorities, we only have the press reports,” Wicker said, as he got into an elevator following his meeting.\n\n.@SenatorWicker after his meeting with Pete Hegseth: “I think he’s going to be in pretty good shape.” Wicker says they did not discuss the sexual assault allegation: “We weren’t specific, but you know since no charges were brought by authorities, we only have the press reports.” pic.twitter.com/ztosSppWBG— Samantha-Jo Roth (@SamanthaJoRoth) November 21, 2024\n\nBarrasso, the incoming No. 2 ranking Republican in the next Congress, called Hegseth a “strong nominee” to lead the Defense Department.\n\n“Pete pledged that the Pentagon will focus on strength and hard power — not the current administration’s woke political agenda,” Barrasso said in a statement Thursday. “National security nominations have a history of quick confirmations in the Senate. I look forward to Pete’s hearing and a vote on the floor in January.”\n\nBlackburn said she would support his nomination and offered no other comments, while Hagerty called the allegations “a he-said, she-said thing” and called it a “shame” that they were being raised in the first place.\n\nMullin emerged from his meeting with a full-throated defense of Hegseth, claiming “there is no way in the world this was a sexual assault,” after reading the police report. \n\n“I read the report, it’s pretty clear what took place, she definitely wasn’t drugged and I don’t want to get into the entire situation because you can read the report yourself,” he said. “If you read it, you can see it was two people flirting with each other.”\n\nThe allegations of sexual misconduct do not appear to be dissuading Republican senators from supporting President-elect Donald Trump’s pick, especially after Trump won the election despite being found liable for sexual abuse last year.\n\n“I assume that there’s two sides to every story. So, we’re going to treat these folks fairly and hopefully get the president his team,” said Sen. John Cornyn (R-TX). “But, we’re not going to decide based on pieces of the story. We want the whole story”\n\nAs the Hegseth nomination proceeds, another controversial nominee, former Rep. Matt Gaetz (R-FL), withdrew his nomination for consideration as attorney general on Thursday afternoon. Mullin acknowledged without “Matt’s distraction” there inevitably will be even more scrutiny on Hegseth’s nomination.\n\n“Matt’s distraction is gone now and so you guys are going to be focusing more and more on Pete, which I don’t think is a bad deal and you’ll look more and more at what happened and it’s all been taken completely out of context,” Mullin said to reporters later in the afternoon ahead of a Senate vote. “I think Pete will get confirmed at the end of the day.”\n\nTrump can only afford three defections within the Senate Republican conference to get his picks confirmed with the GOP’s 53-seat majority in the 119th Congress. \n\nNotably, Hegseth did not meet with Sen. Joni Ernst (R-IA), a combat veteran, who has been an outspoken advocate of preventing military sexual assault and has sponsored bipartisan legislation to hold perpetrators accountable. \n\nIn 2019, Ernst was the lone Republican who opposed Air Force Gen. John Hyten who was confirmed, despite sexual assault allegations against him. \n\nErnst said she was looking forward to meeting with him face-to-face.\n\n“There’s a lot floating around out there, we need to actually be able to visit with him face to face, and I know the committee will do a thorough vetting,” she said, speaking with reporters on Thursday. \n\nSome GOP senators responded to Hegseth’s nomination with surprise due to his lack of experience in the federal government, but reserved their opinions until after the public nomination hearing process. \n\nThe former Fox News host will also need to earn the votes of Republican Senators he’s criticized in the past. He’s previously slammed outgoing GOP Senate Leader Mitch McConnell (R-KY), Susan Collins (R-ME) and Lisa Murkowski (R-AK). He was frustrated by the entire conference when they failed to repeal Obamacare during Trump’s first term. \n\n“Clearly we’re going to have to have a full background check and Senate committee investigation and public hearings, which is standard,” Collins said to reporters on Wednesday.\n\nHegseth will likely have other questions to answer. He said as recently as Nov. 7, that women shouldn’t be allowed in combat. He has also advocated for firing “woke” generals and eliminating the Pentagon’s diversity programs, advocating a “frontal assault” on the Defense Department.\n\n“We need to work this through, we are going to give the president the benefit of the doubt, but we’re going to do our due diligence, which means we will look at all the information and then we will make up our minds based on the information that’s presented,” said Sen. Mike Rounds (R-SD), speaking with the Washington Examiner.\n\n CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nSen. Dan Sullivan (R-AK), another member of the Armed Services Committee, seemed enthusiastic about Hegseth’s nomination, calling his nomination coupled with Rep. Mike Waltz (R-FL) as national security advisor and Sen. Marco Rubio (R-FL) as Secretary of State “strong.” \n\n“I’ve been focused on the policies that I’m quite confident he will focus on and implement, and in a big contrast to the current administration,” Sullivan said.","summary":"Pete Hegseth, the former Fox News host and nominee for secretary of defense, likely has a clear path to Senate confirmation after Republican senators indicated they would support him, despite new details coming out about the 2017 sexual assault claim against him. Hegseth, 44, who met with GOP senators on Capitol Hill on Thursday, was [&#8230;]","url":"https://www.washingtonexaminer.com/news/senate/3238399/trump-pentagon-pick-pete-hegseth-will-get-confirmed-sexual-assault-allegations/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Pete-Hegseth-November-21-2024-1-scaled.webp","video":null,"publish_date":"2024-11-22 00:49:28","author":"Samantha-Jo Roth And Ramsey Touchberry","authors":["Samantha-Jo Roth And Ramsey Touchberry"],"language":"en","category":"politics","source_country":"US","sentiment":-0.332},{"id":266375192,"title":"Sheinbaum says audits found ‘corruption’ at Mexico’s INAI: the mañanera recapped","text":"Donald Trump’s mass deportation plan and the lower house of Congress’ approval of a constitutional bill that seeks to eliminate seven watchdog agencies were among the topics President Claudia Sheinbaum spoke about at her morning press conference on Thursday.\n\nWater was an overarching theme of the president’s presser as the director general of the National Water Commission presented the federal government’s new National Water Plan.\n\n‘We don’t agree with migrants being treated like criminals’\n\nEarly in her engagement with reporters, Sheinbaum was asked about Trump’s plan to use the military to carry out his proposed mass deportation operation.\n\n“First, clearly, we don’t agree with migrants being treated like criminals,” she said.\n\nSheinbaum subsequently said that Mexican officials will highlight to members of Trump’s transition team “the importance of the work” that Mexicans do in the United States.\n\nShe said that officials will also attend meetings with Trump’s team armed with information about how much Mexicans pay in tax in the United States. The United States needs Mexican workers, the president said.\n\nIf Mexicans are deported, “we will welcome” them and “we have a plan for that, but before that, we’re going to work to demonstrate that there is no reason to deport our compatriots who are on the other side of the border,” Sheinbaum said.\n\n“On the contrary they benefit the United States economy,” she said.\n\nSheinbaum said that no meetings with Trump’s team have been arranged as yet, but told reporters that she was “certain” they would happen.\n\n‘Those who defend INAI to the hilt forgot about the corruption’\n\nIn response to a question about the Chamber of Deputies’ approval of a bill that seeks to eliminate seven autonomous government agencies, Sheinbaum focused on the plan to disband the National Institute for Transparency, Access to Information and the Protection of Personal Data, better known as INAI.\n\n“Those who defend INAI to the hilt forgot about the corruption” in the agency, she told reporters.\n\nThe president proceeded to cite examples of corruption and nepotism within INAI that were uncovered by the Federal Auditor’s Office (ASF).\n\n“Workers and ex-workers have reported that high-ranking INAI managers demanded between 10% and 60% of their salaries every two weeks,” Sheinbaum said before highlighting that the ASF also detected cases of relatives of INAI employees being appointed to positions in the institute for which they were not qualified.\n\nShe noted that INAI’s responsibilities are set to be taken on by the Anti-Corruption and Good Governance Ministry (formerly called the Ministry of Public Administration).\n\n“There will be more transparency … [and] there won’t be corruption. … Personal data will be protected,” Sheinbaum said.\n\n“And we’re going to create mechanisms to make transparency mandatory for all ministries,” she said, adding that it will be easy for citizens to obtain information about “everything the government of Mexico does.”\n\nInvitations aplenty\n\nSheinbaum told reporters that she received “invitations to go to various places” while she was at the G20 Leaders’ Summit in Rio de Janeiro earlier this week.\n\n“We even received an invitation to go to China. We received invitations to go to France, to Korea, to Vietnam. … And we also made invitations,” she said.\n\nSheinbaum said she would consider the invitations to visit foreign countries but stressed that her “main job” is in Mexico.\n\nBy Mexico News Daily chief staff writer Peter Davies ([email protected])","summary":"At her Thursday's press conference, the president discussed why ending Mexico's transparency agency was a good idea and U.S. mass deportations was a bad one.\n\n\nThe post Sheinbaum says audits found &#8216;corruption&#8217; at Mexico&#8217;s INAI: the mañanera recapped appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/politics/sheinbaum-inai/","image":"https://mexiconewsdaily.com/wp-content/uploads/2024/11/Sheinbaum-mananera-11-21-2024-featured-image-Daniel-Augusto-Cuartoscuro.jpg","video":null,"publish_date":"2024-11-22 00:48:08","author":"MND Staff","authors":["MND Staff"],"language":"en","source_country":"mx","sentiment":0.043},{"id":266375336,"title":"Matt Gaetz withdraws from consideration as Attorney General","text":"Former Florida congressman Matt Gaetz has withdrawn as President-elect Donald Trump’s pick for attorney general following continued scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nThe Republican’s announcement comes a day after meeting with senators in an effort to win their support for his confirmation to lead the Justice Department.\n\nHis withdrawal is a setback to Trump’s push to install steadfast loyalists in his incoming administration.\n\nBy bowing out, Gaetz averts what was shaping up to be a pitched confirmation battle that would have tested how far Senate Republicans were willing to go to confirm Trump’s Cabinet selections.\n\n“While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,” Gaetz said in a statement announcing his decision.\n\n“There is no time to waste on a needlessly protracted Washington scuffle, thus I’ll be withdrawing my name from consideration to serve as Attorney General. Trump’s DOJ must be in place and ready on Day 1.”\n\nTrump, in a social media post, said: “I greatly appreciate the recent efforts of Matt Gaetz in seeking approval to be Attorney General. He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect. Matt has a wonderful future, and I look forward to watching all of the great things he will do!”\n\nTrump’s replacement nomination\n\nTrump has nominated former Florida AG Pam Bondi as his replacement pick.\n\n“Pam was a prosecutor for nearly 20 years, where she was very tough on Violent Criminals, and made the streets safe for Florida Families,” the president-elect wrote in a post on his social media platform, Truth Social.\n\nBondi served in the first Trump administration as a member of the Opioid and Drug Abuse Commission.\n\nGaetz’s announcement comes days after an attorney for two women said that his clients told House Ethics Committee investigators that Gaetz paid them for sex on multiple occasions beginning in 2017, when Gaetz was a Florida congressman.\n\nOne of the women testified she saw Gaetz having sex with a 17-year-old at a party in Florida in 2017, according to the attorney, Joel Leppard.\n\nLeppard has said that his client testified she didn’t think Gaetz knew the girl was underage, stopped their relationship when he found out and did not resume it until after she turned 18. The age of consent in Florida is 18.\n\nGaetz has vehemently denied any wrongdoing and said last year that the Justice Department’s investigation into sex trafficking allegations involving underage girls had ended with no federal charges against him.\n\nGaetz’s political future remains uncertain.\n\nHe had abruptly resigned his congressional seat upon being selected to be as attorney general.\n\nThat move was seen as a way to shut down the ethics investigation into allegations of sexual misconduct.","summary":"The Republican&#8217;s announcement follows continued scrutiny over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation&#8217;s chief federal law enforcement officer. ADVERTISEMENT Former Florida congressman Matt Gaetz has withdrawn as President-elect Donald Trump&#8217;s pick for attorney general following continued scrutiny over a federal sex trafficking investigation that &#8230;\n\n\nThe post Matt Gaetz withdraws from consideration as Attorney General appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/europe/matt-gaetz-withdraws-from-consideration-as-attorney-general/","image":"https://static.euronews.com/articles/stories/08/86/71/10/1200x675_cmsv2_6af77700-a485-5117-a312-7446a64ff2d3-8867110.jpg","video":null,"publish_date":"2024-11-22 00:47:08","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.021},{"id":266376396,"title":"Matt Gaetz's accusers' lawyer opens up about House investigation","text":"Matt Gaetz's accusers' lawyer opens up about House investigation\n Former Florida Rep. Matt Gaetz said his confirmation process was a distraction as he withdrew from consideration to be President-elect Donald Trump's attorney general. Gaetz has faced scrutiny over a House Ethics Committee probe into alleged sexual misconduct. He denies any wrongdoing. Joel Leppard, the attorney for two women who testified in the probe, joins \"The Daily Report\" to discuss.","summary":"Former Florida Rep. Matt Gaetz said his confirmation process was a distraction as he withdrew from consideration to be President-elect Donald Trump's attorney general. Gaetz has faced scrutiny over a House Ethics Committee probe into alleged sexual misconduct. He denies any wrongdoing. Joel Leppard, the attorney for two women who testified in the probe, joins \"The Daily Report\" to discuss.","url":"https://www.cbsnews.com/video/matt-gaetzs-accusers-lawyer-opens-up-house-investigation/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/11/22/1312c78a-aadf-4973-b532-ea0d13bb3904/thumbnail/1200x630/c96dc93c11d4759cc370dc54959ba2d5/cbsn-fusion-matt-gaetzs-accusers-lawyer-opens-up-house-investigation-thumbnail.jpg?v=6056e68389c16974d8d95eeea60b","video":null,"publish_date":"2024-11-22 00:47:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.727},{"id":266375318,"title":"Gaetz withdraws as Trump's nominee for attorney general","text":"Former Congressman Matt Gaetz withdrew as President-elect Donald Trump's nominee for attorney general Thursday amid a controversy over sexual misconduct allegations that clouded the prospects for his confirmation.\n\nGaetz announced the decision to withdraw from consideration for the top Justice Department post, dealing a setback to Trump's ongoing efforts to round out his Cabinet to push for his America First policy agenda.\n\n\"While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,\" he wrote on X, formerly Twitter.\n\n\"There is no time to waste on a needlessly protracted Washington scuffle, thus I'll be withdrawing my name from consideration to serve as Attorney General. Trump's DOJ must be in place and ready on Day 1,\" he added, referring to the Department of Justice.\n\nGaetz said he remains fully committed to see that Trump is the \"most successful president in history.\"\n\n\"I will forever be honored that President Trump nominated me to lead the Department of Justice and I'm certain he will Save America,\" he said.\n\nThe Florida Republican's withdrawal came days after Trump said he was not reconsidering tapping Gaetz for the attorney general post despite growing uncertainty over whether Gaetz could get Senate approval.\n\nIn a social media post, Trump expressed his appreciation to Gaetz for his recent efforts for Senate confirmation.\n\n\"He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect,\" Trump wrote on Truth Social.\n\n\"Matt has a wonderful future, and I look forward to watching all of the great things he will do!\"\n\nGaetz's nomination has brought renewed attention to previous sex trafficking allegations against him. He has strongly denied the allegations as the related Justice Department probe ended with no federal charges filed against him last year.\n\nGaetz was also under a probe by the House Ethics Committee for allegations of sexual misconduct and illicit drug use -- accusations he flatly rejected. As he resigned from the House after the nomination for the Cabinet post, the committee's jurisdiction for Gaetz's case halted.\n\nRegarding Gaetz's withdrawal, White House press secretary Karine Jean-Pierre reiterated that she will not comment on Trump's personnel choices but stressed President Joe Biden's commitment to the smooth transition of power.\n\n\"We really, truly want to respect the transfer of power. We want it to be efficient. We want it to happen in a way that the American people deserve,\" she told a press briefing.\n\nShe also pointed out that a Justice Department investigation should be \"independent.\"\n\n\"There should be no partisanship,\" she said. \"There should be no loyalty to one party or the other. The loyalty should be to the Constitution, and the loyalty should be to the rule of law.\" (Yonhap)","summary":"Former Congressman Matt Gaetz withdrew as President-elect Donald Trump&#039;s nominee for attorney general Thursday amid a controversy over sexual misconduct allegations that clouded the prospects for his confirmation. Gaetz announced the decision","url":"https://www.koreaherald.com/view.php?ud=20241122050008","image":"https://res.heraldm.com/content/image/2024/11/22/20241122050003_0.jpg","video":null,"publish_date":"2024-11-22 00:45:52","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"KR","sentiment":0.077},{"id":266374804,"title":"Women in Military ‘Make Us Stronger’: Defense Secretary","text":"Outgoing Defense Secretary Lloyd Austin said in a Nov. 20 interview that women and racial diversity are essential to the strength and success of the U.S. armed forces.\n\nAustin made the remarks in an interview with NBC News as the former commander of the U.S. Central Command prepares to leave his position after four years as head of the Department of Defense.\n\n“I have spent 41 years in uniform, three long tours in Iraq, one in Afghanistan, and everywhere I went on a battlefield, there were women in our formation,” Austin said.\n\n“I would tell you that, you know, our women are the finest troops in the world. Quite frankly, some of the finest in the world.”\n\nThe interview followed President-elect Donald Trump’s choice for Austin’s successor, Pete Hegseth, recently came under fire for past comments he made about women in combat. A former Army National Guard Major, Hegseth is a veteran of Iraq, Afghanistan, and Guantanamo Bay, and has two Bronze Stars and a Combat Infantryman’s Badge.\n\nIn a recent podcast interview, Hegseth said the military “should not have women in combat roles” and “men in those positions are more capable. ”\n\nAccording to a November 2023 Defense Department report, in 2022, women accounted for 17.5 percent of the U.S. military’s active-duty force and 21.6 percent of the selected reserve.\n\nAustin said that women “do impact readiness.”\n\n“They make us better. They make us stronger. And again, what I’ve seen from our women is quite incredible, and I’m not—this is not hyperbole. This is fact.”\n\nIn addition to removing women from combat roles, Hegseth suggested he would move to remove military officials who back diversity, equity, and inclusion (DEI) programs, which Republicans often criticize as weakening military readiness.\n\nAustin declined to speculate on this but said the military values diversity despite being a meritocracy.\n\n“We’re a diverse nation, and we’re going to remain a diverse nation. Our military is going to remain a diverse military,” he said.\n\n“The matter was fully investigated, and I was completely cleared,” Hegseth told reporters at the Capitol on Thursday, describing the relationship in question as consensual.\n\nRegarding Hegseth’s nomination to succeed him as the next secretary of defense, Austin said, “The president-elect has the opportunity to nominate anyone that he chooses for any position, and certainly, you know, we respect that.”\n\nRegarding Trump’s stated plans to use the military to conduct widespread deportations of illegal immigrants living in the United States, Austin declined to discuss the president-elect’s intentions but added that the law defines “how we employ our military.”\n\n“I have faith and confidence in our senior leaders that they will always make the right decisions and make the right recommendations to their leadership,” he said.\n\nPresident Joe Biden appointed Austin, a four-star general, as defense secretary in 2021.","summary":"Lloyd Austin made the comments after his nominated successor, Pete Hegseth, said women should not be in combat roles.","url":"https://www.theepochtimes.com/us/women-in-military-make-us-stronger-defense-secretary-austin-5764063","image":"https://img.theepochtimes.com/assets/uploads/2024/11/03/id5753135-lloyd-austin-feb-LSedit-300x180.jpg","video":null,"publish_date":"2024-11-22 00:43:27","author":"Jacob Burg","authors":["Jacob Burg"],"language":"en","category":"politics","source_country":"us","sentiment":0.01},{"id":266374658,"title":"Trump picks former Florida AG Pam Bondi for attorney general after Matt Gaetz withdraws","text":"Trump picks former Florida AG Pam Bondi for attorney general after Matt Gaetz withdraws\n President-elect Donald Trump has named Pam Bondi, Florida's former attorney general, as his new pick for attorney general after Matt Gaetz took himself out of the running. The former congressman's withdrawal followed weeks of intense scrutiny since he was named to be America's top law enforcement official. Ed O'Keefe reports.","summary":"President-elect Donald Trump has named Pam Bondi, Florida's former attorney general, as his new pick for attorney general after Matt Gaetz took himself out of the running. The former congressman's withdrawal followed weeks of intense scrutiny since he was named to be America's top law enforcement official. Ed O'Keefe reports.","url":"https://www.cbsnews.com/video/trump-picks-former-florida-ag-pam-bondi-for-attorney-general-after-matt-gaetz-withdraws/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/22/7a8d7259-43b4-4691-b2b0-e2fc1378743b/thumbnail/1200x630/f82d947090d41792e59cf666fe555758/1121-en-okeefe.jpg?v=6056e68389c16974d8d95eeea60b7a3a","video":null,"publish_date":"2024-11-22 00:40:30","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.176},{"id":266375304,"title":"I'm A Celebrity star suffers nasty lip injury during Bushtucker trial as fans voice concern","text":"Black Friday\n\nStrictly Come Dancing\n\nGreat British Bake Off\n\nPrivacy Policy\n\nFriday, Nov 22nd 2024\n\n5-Day Forecast\n\nAdvertisement\n\nI'm A Celebrity star suffers nasty lip injury during Bushtucker trial as fans voice concern\n\nHave YOU got a story? Email tips@dailymail.com \nBy LILY JOBSON FOR MAILONLINE \n Published:00:35 GMT, 22 November 2024 |Updated:00:36 GMT, 22 November 2024 \n\nA celebrity suffered a nasty lip injury during their Bushtucker trial on Thursday night's episode.\nDean McCullough, 32, caused concern amongst fans as he displayed a bloody gash on his mouth following his trial.\nThe radio star quit yet another Bushtucker trial after struggling to come to terms with fish guts in the challenge.\nDean had to get the star using his mouth while having his head surrounded by cockroaches, crickets and mealworms, giant lizards, snakes and spiders in different tubes.\nBut afterwards, fans noticed Dean had 'blood' on his lip and assumed it was from the trial.\nVoicing their concern, fans wrote on X: 'bless him for getting 4 stars tho. also has anyone noticed that Dean has cut his lip',\n\nA celebrity suffered a nasty lip injury during their Bushtucker trial on Thursday night's episode (Reverend Richard Cole and Maura Higgins pictured)\n\nDean McCullough, 32, caused concern amongst fans as he displayed a bloody gash on his mouth following his trial\n'dean actually tried hard tonight he even cut his lip #ImACeleb',\n'Why is Dean's mouth bleeding? Spider bite?'\nDean had two minutes to complete an experiment, which will be worth 2 stars, in the experimentation area.\nHe then had to make his way through seven different containment areas, where a further eight stars were up for grabs.\nDean told Ant and Dec: 'I like to overpromise and underdeliver.'\nDuring the first experiment, he had to combine both a green liquid and a clear liquid into the test tube together to create a chemical reaction. \nHalf way through the trial, he said: 'This is not looking good boys.'\nAs he successfully created a chemical reaction by combining the two liquids, he won two stars for camp and moved on to the containment areas.\n\nThe radio star quit yet another Bushtucker trial after struggling to come to terms with fish guts in the challenge \n\nDean had to get the star using his mouth while having his head surrounded by cockroaches, crickets and mealworms, giant lizards, snakes and spiders in different tubes\n\nBut afterwards, fans noticed Dean had 'blood' on his lip and assumed it was from the trial\n\nVoicing their concern, fans wrote on X: 'bless him for getting 4 stars tho. also has anyone noticed that Dean has cut his lip'\n\nAs fish guts poured into the compartment, Dean immediately shouted: 'I’m A Celebrity… Get Me Out Of Here!'\n\nDespite calling I'm A Celebrity... Get Me Out Of Here, Dean was able to go back to camp with four stars\nAfter winning two more stars in containment areas one and three, he then moved onto area five.\nAs fish guts poured into the compartment, Dean immediately shouted: 'I’m A Celebrity… Get Me Out Of Here!'\nDespite calling I'm A Celebrity... Get Me Out Of Here, Dean was able to go back to camp with four stars.\nGK and Dean were left 'mortified' as they took zero stars back to camp after failing the Bushtucker Trial on Wednesday.\nThe duo were voted by the public to take on the Down In The Drumps trial on Tuesday, in order to earn meals for the group.\nI'm A Celebrity…Get Me Out Of Here! Continues nightly at 9pm on ITV1, STV and ITVX \n\nI'M A CELEBRITY 2024: MEET THE ALL STAR LINE UP\n\nOTI MABUSE \n\nOti Mabuse has already two Strictly glitterballs under her belt\n\nOCCUPATION: Professional dancer\nFAMOUS FOR: Oti is best known for being a professional dancer on the British television series Strictly Come Dancing, which she won in 2019 and 2020. \n\nDANNY JONES \n\nDanny Jones is one of the bookies' favourites to win this year's I'm A Celeb\n\nOCCUPATION: McFly singer\nFAMOUS FOR: Danny is one of the lead vocalists and the lead guitarist for pop-rock band McFly. \nHe is also a coach on The Voice UK. \n\nBARRY MCGUIGAN \n\nFormer boxer Barry McGuigan is heading into the jungle\n\nOCCUPATION: Retired professional boxer\nFAMOUS FOR: Barry was nicknamed The Clones Cyclone and held the WBA and lineal featherweight titles from 1985 to 1986. \n\nGK Barry is a TikTok star who recently joined the ITV family on Loose Women\n\nOCCUPATION: TikTok star \nFAMOUS FOR: Grace is known for her comedic commentary on culture, lifestyle, and fashion. She has over 3.6 million followers and recently joined the Loose Women panel. \n\nDEAN MCCULLOUGH \n\nITV bosses are hoping Dean McCullough will ruffle feathers in the camp\n\nOCCUPATION: Radio 1 DJ \nFAMOUS FOR: Radio 1 DJ Dean has been signed by I'm A Celeb bosses, in the hope that he will ruffle feathers with his outspoken views. \nEarlier this year it was announced Dean would be taking over the BBC Radio 1 Early Breakfast Show, after previously fronting the afternoon slot. \n\nJANE MOORE \n\nJane is best known as a panellist and anchor of Loose Women\n\nOCCUPATION: Journalist\n FAMOUS FOR: Jane is best known as a panellist and anchor of Loose Women between 1999 and 2002. \nShe returned as a regular panellist from 2013 onwards.\nJane takes on the challenge following her high-profile split from husband of 20 years, Showbiz agent, Gary Farrow. \n\nMELVIN ODOOM \n\nMelvin was previously courted by I'm A Celeb bosses back in 2021\n\nOCCUPATION: DJ and TV presenter\nFAMOUS FOR: His work on radio. Melvin was previously courted by I'm A Celeb bosses back in 2021, but turned down the offer at the last minute.\nHe also had a primetime stint on Strictly back in 2016. \n\nCOLEEN ROONEY \n\nReports claim that she has been offered the biggest deal in the show's history\n\nOCCUPATION: WAG\nFAMOUS FOR: Wagatha Christie case against arch rival Rebekah Vardy.\nReports claim that she has been offered the biggest deal in the show's history, exceeding Nigel Farage's £1.5million from last year.\n\nALAN HALSALL \n\nAlan Halsall is best known for his role as Tyrone Dobbs on Coronation Street\n\nOCCUPATION: Actor \nFAMOUS FOR: Coronation Street actor Alan Halsall was forced to withdraw from I'm A Celeb last year, after undergoing ACL Reconstruction surgery.\nBosses have now convinced the actor to sign up again, and no doubt he will draw in a huge fanbase thanks to his long-running role as Tyrone Dobbs on the soap. \n\nTulisa is making her career comeback after reuniting with N-Dubz last year\n\nOCCUPATION: Singer and former X Factor judge \nFAMOUS FOR: Tulisa reunited with N-Dubz last year for a tour after first finding fame with the band in 2007.\nIn 2011, she became a judge on The X Factor and went on to launch her debut solo album, The Female Boss. \nShe released her fourth album with N-Dubz last year. \n\nREVEREND RICHARD COLES\n\nRichard is an English writer, radio presenter and Church of England priest\n\nOCCUPATION: Writer, broadcaster and priest\nFAMOUS FOR: Richard is an English writer, radio presenter and Church of England priest. \nHe first came to prominence as the multi-instrumentalist who partnered Jimmy Somerville in the 1980s band the Communards.\n\n MAURA HIGGINS\n\nMaura is best known for her stint on Love Island UK in 2019\n\nOCCUPATION: TV Personality\nFAMOUS FOR: Maura is an Irish television personality, television presenter and model. \nShe rose to prominence in 2019, when she was a finalist on the fifth series of ITV2 reality series Love Island.\n\nShare or comment on this article: \nI'm A Celebrity star suffers nasty lip injury during Bushtucker trial as fans voice concern\n\nAdd comment\n\nEnter search term:\n\nEXCLUSIVEBrad Pitt's 'heartbroken' parents haven't seen their grandkids in nearly a decade amid bitter Angelina Jolie legal battle\n\nPregnant Charlotte Crosby's robbery terror as masked raiders armed with machete burst into £1million Sunderland home \n\nEllen DeGeneres unrecognisable as a brunette at UK pub with Portia de Rossi as they flee US after Trump win\n\nI'm A Celebrity's Coleen Rooney reveals husband Wayne's 'difficult' mistake but explains why they have stayed together\n\nLily Allen finds new pad in England after losing her dream home, writes RICHARD EDEN\n\n'It's a real pleasure to be in now - we love it' - how families are transforming their bathrooms from dull to delightful (and how you can too!)\n\nI'm A Celeb fans in hysterics as Ant McPartlin TELLS OFF Dean McCullough in stern chat before his third trial\n\nI'm A Celeb's Coleen Rooney leaves GK Barry stunned as she reveals husband Wayne's VERY romantic gesture 'to keep their relationship alive'\n\nI'm A Celeb viewers brand Maura Higgins and Reverend Richard Coles an 'iconic duo' and gush that they are 'obsessed' with the 'genius' pairing\n\nTime to deck the halls! Get in the gifting spirit this holiday season with these top 10 brands\n\nStrictly's Pete Wicks and Jowita Przystal are 'closer than ever' and 'have been secretly seeing each other' as Maura Higgins insists 'I'm single'\n\nGavin And Stacey cast recreate iconic photo 17 years on in first look image as major new plotlines are revealed for the Christmas Day special \n\nAngelina Jolie gives rare update on her six children and their future amid ongoing Brad Pitt divorce\n\nSelena Gomez flashes the flesh as she goes naked under a blanket then models a see-through dress for Perfect\n\nBake a little joy this Christmas! Create new festive traditions with these easy bakes the little ones will love\n\nThe Traitors villain Paul Gorton welcomes baby boy with wife Kate Waldron and reveals adorable name\n\nJeremy Vine stuns fans announcing that he's bisexual live on TV in awkward blunder - as viewers compare him to Alan Partridge\n\nDamian Hurley shares heartfelt message to Liam Payne's family and girlfriend Kate Cassidy after accompanying her to his 'breathtakingly sad' funeral\n\nPedro Pascal shares shirtless snap of Gladiator II co-star Paul Mescal as they took bromance off set\n\nRiviera glamour, Ibiza nightlife and the most stylish ships at sea: Why THIS is the ultimate cruise for your adults-only Mediterranean escape\n\nI'm A Celeb new arrivals Maura Higgins and Reverend Richard Coles convince campmate Coleen Rooney with their sneaky lies\n\nLouis Tomlinson's sweet gesture revealed hours after the funeral of his close friend Liam Payne\n\nEDEN CONFIDENTIAL: Still mad about the boy, Bridget Jones star Renee Zellweger mourns Mr Darcy\n\nAriana Grande could win an Oscar for her role as Glinda in Wicked say critics\n\nFind your inner glow: We asked one beauty writer to trial a new range of gentle skincare - here's how she got on\n\nMargot Robbie wears a mask as she joins husband Tom Ackerley while taking their newborn son out in LA\n\nMolly-Mae Hague cheers on pal Maura Higgins as she makes her I'm A Celebrity arrival after becoming a last minute replacement for ex Tommy Fury\n\nI'm A Celeb viewers left in stitches at the 'best secret mission ever' as fans claim they 'haven't stopped laughing'\n\nCuba Gooding Jr. has surprising reaction to overturning of Empire costar Jussie Smollett's conviction\n\n'Appy as Larry! Study finds the average Brit relies on SEVEN life admin apps - here's how to make the most of them\n\nI'm A Celebrity rating figures revealed and the hit ITV show beats BBC rival Strictly Come Dancing by a HUGE number\n\nI'm A Celebrity RECAP: Maura Higgins and Rev Richard Coles await 'shock of their lives' as pair face 'huge secret' mission when they enter jungle\n\nEXCLUSIVELook away Diddy! Rapper's baby mama Dana Tran gets cozy with mystery man in LA as he languishes behind bars\n\nI'm A Celebrity's Dean McCullough is given savage nickname as he quits yet ANOTHER trial\n\nStruggling to maintain your weight during menopause? You're not alone - here's why this happens and what you can do about it\n\nKaia Gerber reveals surprise connection to Pamela Anderson only a nepo baby could have\n\nI'm A Celeb campmates are punished after Dean McCullough and another celeb smuggle BANNED items into jungle\n\nCheryl is 'devastated over Liam Payne's death and is 'heartbroken' her son Bear, 7, won't see his father again\n\nSelena Gomez fans are furious with Benny Blanco for 'embarrassing' her after sharing new details about their romance\n\nDamaged hair? Don't despair! With 1 billion bonds packed in every bottle, the NEW bond-building wonder product is here to help\n\nKristen Stewart flashes her tummy in a crop top while carrying a coffee mug with a male friend in Los Angeles\n\nSafiyya Vorajee breaks her silence after Ashley Cain reveals he's having a third child three years after the death of their daughter Azaylia\n\nWhy Taylor Swift and Travis Kelce can't share a room before Chiefs games and other rules they must follow\n\nRebekah Vardy continues obsessive campaign against Coleen Rooney - as she urges public to vote for her nemesis\n\nSmells like clean spirit: Why fragrance is so important to us, and how the right scent can make (or break) your day\n\nMaya Jama hints at reasons for Stormzy split in a rare interview and she says she WILL marry and have kids with her next boyfriend\n\nJax Taylor rear-ended car then drove off WITHOUT exchanging insurance information in shock incident\n\nKim Kardashian, 44, is bra-free with reading glasses on as she enters her SEVENTH year of law studies\n\nRichard Gere reveals why he's quitting the U.S. with his wife and kids and moving to Spain\n\nApp-tastic! From business to beauty, here are 10 must-have apps to try this month\n\nAshley Cain reveals he's having a third child three years after the death of daughter Azaylia\n\nBBC bosses sign West End legend for EastEnders guest role - and her first episode airs tonight\n\nKaty Perry wows in a racy nude bra as she announces she is adding an extra London show to The Lifetimes Tour due to overwhelming demand\n\nEXCLUSIVEHow Jason Statham reacted to Kristin Cavallari's claim that he was her 'hottest hookup'\n\nAshton Kutcher looks tense during chat on LA walk after Mila Kunis divorce rumors and Diddy drama\n\nGet Amazon Audible for just 99p for THREE months in early Black Friday deal - plus you'll get £10 voucher to spend on your favourite audiobooks, podcasts and more\n\nDemi Moore pitches Now and Then sequel as she reunites with Melanie Griffith, Rita Wilson, and Rosie O'Donnell\n\nDiddy blasts prosecutors for 'destroying his reputation' as he makes third bid for release on bail\n\nWicked fans OUTRAGED after major spoiler from Ariana Grande and Cynthia Erivo film is revealed: 'Please delete!'\n\n'There's no brand I'd trust more!': The affordable moisturiser Sex Education star Anthony Lexa swears by for painful, itchy and dry skin revealed\n\nPregnant Jennifer Lawrence embraces casual maternity style in LA days after glamorous appearance\n\nSimone Biles makes shock career move as she teams up with Snoop Dogg after Olympics friendship\n\nBridgerton actress stars in mesmerising new music video for Bastille - and fans are left 'speechless' by her 'superb' performance\n\nBillie Shepherd confirms she has QUIT her ITV show The Family Diaries after 10 years of letting cameras into her home\n\nHelen Flanagan reunites with ex fiancé Scott Sinclair as they take their daughter to Winter Wonderland - following her new romance with boyfriend Robbie Talbot\n\nHollywood star looks completely unrecognisable as he puffs on a cigar and gets into character as iconic director Alfred Hitchcock\n\nKate Nash joins OnlyFans with racy snap of her bare bottom to fund her tour - after revealing financial woes and slamming music industry\n\nJay Leno sparks wild gambling debt conspiracy theory as fans question his bruised face\n\nVictoria Beckham looks adorable in throwback childhood snaps as she wishes her lookalike sister Louise a happy birthday\n\nLindsay Lohan and Lacey Chabert reenact iconic Mean Girls scene with Andy Cohen as Regina George\n\nWorld's smallest woman reveals challenges of life at just 63cm as she meets TALLEST woman on Earth in unflinching This Morning interview\n\nCher, 78, is a wrinkle-free wonder as she debuts blonde hair in NYC after teasing a new album\n\nEXCLUSIVEJessica Simpson ditches ring as she attends nephew's party without Eric Johnson amid split rumors\n\nKatie Price calls troll an 'ugly s**g' and tells them to 'go f***k yourself' in shock foul-mouthed rant on TikTok live\n\nCher reveals Tina Turner asked for help on how to leave abusive husband Ike in heartbreaking memoir\n\nMAFS UK's Polly Sellman debuts her newly-dyed blonde hair as she shows off her stunning new look following her incredible two stone weight loss\n\nGisele Bundchen worries fans as she says there is 'no guide to life, no roadmap' after shock pregnancy news\n\nCruel Intentions shocks with 'incest' storyline as new Netflix series proves more scandalous than 1999 movie\n\nStrictly Christmas Special full line up is REVEALED: Racing driver completes star-studded group for the festive edition of the dancing show\n\nFans all saying the same thing about Dwayne 'The Rock' Johnson's hunky body for live action Moana movie\n\nTori Spelling, 51, shares sexy bikini magazine cover from 24 years ago when she was on Beverly Hills, 90210\n\nSelena Gomez reveals the advice another woman offered her that upped her acting game\n\nRuth Langsford launches uncharacteristically furious tirade and says she 'won't be shamed' after she's attacked by trolls\n\nVanderpump Rules star Katie Maloney confirms romance with guitarist Nick Martin in loved up snap\n\nJussie Smollett special prosecutor blasts Illinois supreme court for ignoring evidence to overturn conviction\n\nKeke Palmer breaks silence on the rumors that ex-costar Lea Michele can't read\n\nI'm A Celeb star GK Barry's mum reveals the heartbreaking truth behind her glam transformation - and how she gets ultimate revenge on bullies\n\nThe Chase fans rage over 'shocking scenes' as contestant breaks show records in the worst possible way - fuming 'you should be ashamed!'\n\nEXCLUSIVEThe truth about why Zoe Ball quit as £950k breakfast show host and was off for six weeks, revealed by her closest friends to ALISON BOSHOFF\n\nCast of 'shocking' nineties kids TV show reunite 23 years after last ever episode aired - but do you recognise them?\n\nJussie Smollett has hoax charges OVERTURNED in shock ruling\n\nDavina McCall admits she's 'annoyingly positive' despite all the hardships she's faced in life - after undergoing shock brain surgery\n\nNicholas Hoult insists it's 'fairly clear' he is married to model Bryana Holly as he sets the record straight on their relationship\n\nBBC unveils major star for spectacular New Year's Eve celebrations with exciting surprises in store\n\nKim Kardashian's dog Sushi is ALIVE after fans sparked concern over mysterious disappearance\n\nBeloved Netflix romcom announces return to screens - and new series is just months away from hitting screens\n\nRichard Gere, 75, and wife Alejandra Silva, 41, celebrating Thanksgiving in Spain ahead of Madrid move\n\nWicked fans in uproar after cinemas warn them 'not to sing' during screenings of the beloved musical - and demand 'singalongs'\n\nChrissy Teigen reveals she gets her Thanksgiving meal from Popeye's, KFC and even Disneyland\n\nCall the Midwife star reflects on being jailed for a bank robbery aged 19 after leaving school 'unable to read, write and with no prospects'\n\nFirst look at Harry and Meghan's POLO: Duke's BFF Nacho Figueras fronts trailer for new Netflix series featuring some VERY glam WAGs\n\nBillie Eilish is announced as Apple Music's Artist of the Year after winning an Academy Award and two Grammys\n\nZara McDermott goes braless in sexy nightwear as she poses for new Rise campaign while boyfriend Sam Thompson is in Australian jungle\n\nTeddi Mellencamp shares bizarrely seductive workout video amid horse trainer affair scandal\n\nCarol Vorderman, 63, sends VERY cheeky message to I'm A Celebrity's Melvin Odoom, 44, after he admitted having a massive crush on her\n\nDiddy was a 'diva' on SNL as he demanded closed set for rehearsals but Will Ferrell was having none of it\n\nThe monarchy is in deep trouble - and could end. This 'greedy' habit may be their downfall, predicts eminent royal expert AN WILSON\n\nEXCLUSIVERevealed: Cheryl's heartbreaking vow after Liam Payne's funeral, friends tell KATIE HIND, and how One Direction members 'all wanted to be there' despite tensions\n\nEXCLUSIVEI'm A Celebrity hosts Ant McPartlin and Declan Donnelly hint ITV are ALREADY trying to sign Gary Lineker \n\nCMA Awards are plagued with complaints from viewers who are disappointed with the winners\n\nPregnant Eleanor Tomlinson is seen for the first time since revealing she's expecting her first child as she shows off her bump\n\nEXCLUSIVEJodie Marsh recalls wild night out with John Prescott as she pays tribute to the 'perfect gentleman' after former Deputy Prime Minister's death\n\nCillian Murphy shoots canal boat scenes as Tommy Shelby in freezing conditions as work continues on the set of Peaky Blinders film The Immortal Man\n\nCountry music fans lose it over 'disgusted' George Strait's reaction to CMA performance\n\nPregnant Jorgie Porter cradles her baby bump in a chocolate brown dress as she joins Rhian Sugden and her family at Mum & Me event\n\nLegendary BBC comedy returning 30 years on from first ever episode - but with a completely new format\n\nEXCLUSIVEHow Damian Hurley has supported Kate Cassidy through her darkest time: Inside the pair's bond as he joins her at Liam Payne's funeral\n\nAaron Taylor-Johnson looks dapper at Kraven The Hunter photocall in London amid James Bond speculation\n\nStephanie Seymour, 56, was an '80s supermodel who posed for Playboy and dated Axl Rose - see her now\n\nLoose Women's Coleen Nolan, 59, announces arrival of second grandchild as son welcomes baby boy with his partner\n\nThe BRIT Awards 2025 trophy designer revealed as the ceremony confirms its awards category list\n\nMartin Freeman, 53, shows off his quirky style at Claridge's Christmas party after Amanda Abbington gave an insight into the pair's close bond\n\nOne Direction's heartbreaking reunion: How the remaining band members came together in grief nine years after they were last pictured together at Zayn's final concert\n\nHow Coleen Rooney got her Jungle shower body: As mum-of-four shows off on I'm A Celeb while her campmates claim it's 'too cold'\n\nTulisa's secret health battle revealed that saw her 'tearing into her face' and left with 'gaping weeping holes' after she opened up on 12-year struggle with Bell's palsy\n\nKelly Osbourne puts on a sophisticated display in black leather trousers and quirky glasses as she hosts Live Nation event\n\nI'm A Celebrity star is shock millionaire and earns almost as much as campmate Coleen Rooney\n\nFrom commuters to concertgoers: A look at St Pancras Station's most iconic surprise performances with A-listers showing off their piano skills\n\nEXCLUSIVEMarried at First Sight UK couple SPLIT after year-long romance - leaving only one pair still together from the 2023 series\n\nPregnant Montana Brown shows off her blossoming baby bump in a stylish green bikini as she prepares to welcome her baby girl\n\nMaura Higgins claims 'she won't find love in the I'm A Celeb jungle because no one will fancy her' after insisting she is single despite THAT steamy smooch with Pete Wicks\n\nCate Blanchett cuts a chic figure in a stylish brown suit as she takes to the stage at the Camerimage Film Festival after the event was embroiled in misogyny row\n\nBeaming Jude Law battles the chilly weather in a cosy black bomber jacket while attending a photocall for Star Wars: Skeleton Crew in London\n\nShetland viewers rage 'it's going downhill fast!' and complain they're 'struggling' with 'plodding and naff' new BBC series\n\nWallace And Gromit's epic TV return date confirmed in new BBC trailer for festive film Vengeance Most Fowl\n\nEXCLUSIVERylan Clark reveals I'm A Celeb star Tulisa has 'been through a hell of a lot' as he breaks his silence after defending her against 'disgusting' trolls\n\nStacey Solomon enjoys night out with her sister and children at Winter Wonderland without Joe Swash - after their 'explosive street row'\n\nMegan Barton Hanson shares a backseat kiss with Instagram model Leah Ray as they make their way to a London hotel - after star's split with Demi Sims\n\nStrictly Come Dancing's Janette Manrara takes very cheeky swipe at husband Aljaz Skorjanec \n\nElizabeth Olsen channels her Marvel character Wanda as she puts on a leggy display in red leather mini dress and matching tights\n\nI'm A Celeb host Ant McPartlin and his wife Anne-Marie Corbett step out with son Wilder, 7 months, for the first time together in Australia\n\nThe striking detail on Lindsay Lohan's new face leaving fans puzzled\n\nIconic BBC fantasy series with record-breaking budget returning to screens a whopping 40 years on from first ever episode\n\nCaprice, 53, strips down to a Santa hat and heels for new promotional campaign as she prepares to make her film debut in A European Christmas\n\nAgency for top reality show is accused of 'not paying its castmembers' and treating on-screen talent like 'volunteers'\n\nI'm A Celebrity star Reverend Richard Coles 'set to add to his surprise fortune by signing a huge deal with one of ITV's biggest rivals'\n\nLove Island star Malin Andersson announces shock split from boyfriend just two months after going Instagram official as she admits she will 'never settle'\n\nRobbie Williams and Nicole Scherzinger 'reach out to Liam Payne's family after being unable to attend the One Direction star's funeral'\n\nSaoirse Ronan claims Paul Mescal, Eddie Redmayne and Denzel Washington were 'humbled' by her comments on violence against women on The Graham Norton Show\n\nEXCLUSIVEReason Maura Higgins is already set to be crowned Queen of the Jungle is REVEALED - ahead of her bombshell entry into camp\n\nThe touching moment Girls Aloud stars embraced as they supported bandmate Cheryl at Liam Payne's funeral\n\nBBC's Moonflower Murders has an epic blink-and-you'll-miss-it celebrity cameo - but can you spot it?\n\nLottie Moss looks glamorous in an ankle-length fur coat as she enjoys a star-studded evening at Winter Wonderland\n\nDisney's Say Nothing branded 'horrendous and cruel' by son of IRA murder victim - fuming 'it's not entertainment, this is our reality'\n\nTammy Hembrow spotted prepping for her nuptials to Matt Zukowski - as she hands over daughter Posy to ex Matt Poole just days ahead of her wedding\n\nNot quite a Bushtucker Trial! Rebekah Vardy enjoys an adrenaline-filled night on the Winter Wonderland rides with her family\n\nI'm A Celeb's Ant McPartlin sinks claws into Dean McCullough for 'not trying' during Bushtucker Trial - mocking star for 'screaming at water'\n\nThe (VERY youthful) face of Fairy Liquid! Nanette Newman, 90, attends the Oldie Of The Year ceremony with son-in-law Sir John Standing, also 90\n\nCompetition for Andrew Garfield? James Norton sends fans wild with his VERY flirty chat with Amelia Dimoldenberg at the GQ Men Of The Year Awards\n\nBBC announces return of 'masterpiece' thriller after rave reviews - as writer gushes 'I'm beyond thrilled!' and fans go wild\n\nEllen DeGeneres and wife Portia de Rossi moving to ENGLAND after Trump win as they become latest stars to flee US\n\nKatie Price, 46, speaks out over claims she is planning a 'magical' NINTH marriage proposal as she prepares for her first Christmas with boyfriend JJ Slater, 31\n\nI'm A Celeb's Coleen Rooney reveals the big mistake Wayne almost made when he got a tattoo tribute to her\n\nKim Kardashian shows off her figure in a leopard print bra and thong as she poses for sizzling Dolce & Gabbana X SKIMS campaign\n\nEXCLUSIVEWhy Jennifer Garner has limited contact with Jennifer Lopez after Ben Affleck marriage break down\n\nAmy Childs flaunts her two stone weight loss in suede minidress as she packs on the PDA with fiancé Billy Delbosq during romantic date night\n\nKarate Kid star Ralph Macchio beams as he receives a star on the Hollywood Walk Of Fame: 'It means the world to me'\n\nOne Direction reunites for first time in nine years at Liam Payne's funeral: Ex-bandmates come together to say farewells\n\nJohn Prescott dead aged 86: 'Devastated' Tony Blair leads tributes to his 'fierce but loving, kind and compassionate' former Deputy Prime Minister \n\nI'm A Celebrity's Coleen Rooney left disgusted after fellow campmates refuse to SHOWER as Oti Mabuse admits 'everyone smells horrendous'\n\nKaia Gerber looks sensational in bejewelled mini dress as she joins Reese Witherspoon's daughter Ava Phillippe at Hollywood Reporter event\n\nHarry Styles' hug for Kimberley Walsh at Liam Payne's funeral: Mourning One Direction star embraces Girls Aloud singer at private service\n\nJennifer Lopez embraces fall fashion in a white sweater and jeans during coffee run in LA\n\nLily Cole looks stylish in a quirky patterned coat as she joins her rarely-seen boyfriend Kwame Ferreira at Chiltern Firehouse\n\nJelly Roll shows off his 110lb weight loss as he poses with his wife Bunnie XO at the 2024 CMA Awards\n\nSir Rod Stewart, 79, addresses retirement as he announces he is 'ending large scale world tours'\n\nEXCLUSIVEFirst look at The Rock as Maui! Dwayne Johnson shows off VERY buff body filming live-action Moana remake\n\nPaul Mescal cuts a stylish figure in a logo T-shirt and grey coat as he arrives for The Late Show with Stephen Colbert amid Gladiator II press tour\n\nTaylor Swift enjoys a girls night out with Faith Hill and Este Haim at private members-only club in NYC\n\nAlec Baldwin looks tense after skipping Rust premiere where audience gasped during shooting scene which paralleled Halyna Hutchins death\n\nSelena Gomez enjoys date night with boyfriend Benny Blanco in LA after dishing on their 'future'\n\nPaul Mescal suits up for Gladiator II premiere with co stars Connie Nielsen and Fred Hechinger\n\nI'm a Celeb's Tulisa reveals devastating truth of how her 'life fell apart' after an elaborate drug sting\n\n'The legend is here!' I'm A Celeb fans 'pop open the champagne' as Maura Higgins teases bombshell jungle arrival alongside Rev Richard Coles\n\nHow Reverend Richard Coles was 'destroyed' by his husband's death: New I'm A Celebrity arrival, 63, lost his partner, 43, to alcoholism \n\nRebekah Vardy takes a night off from watching rival Coleen Rooney on I'm A Celeb to enjoy family outing at Winter Wonderland\n\nCharlie Hunnam looks unrecognizable as he transforms into serial killer Ed Gein for third season of Ryan Murphy's Monster anthology series\n\nWhat happened to Post Malone's voice? Fans shocked by 'awful' 2024 CMA Awards performance in Nashville\n\nKate Moss' lookalike daughter Lila, 22, bares an uncanny resemblance to the supermodel in her prime as she stuns in DKNY photoshoot\n\nInside Ellen DeGeneres' star-studded UK neighborhood: TV host will reside next to A-listers like David and Victoria Beckham and Kate Moss \n\nBack so soon, Eva? Actress returns to 'dystopian' US for a Hollywood party after moving abroad following Donald Trump's election victory\n\nGwen Stefani looks unrecognizable in flashback snap as she makes sad confession about her appearance\n\nAmy Adams coordinates in chic all-black with husband Darren Le Gallo at LA premiere of Nightb***h\n\nInside the new home Lizzo snapped up from Jeremy Renner for $12.4 million\n\nMaura Higgins reveals she has prepared for I'm A Celebrity in the 'worst way possible' as she indulges on pasta and red wine during lavish Vegas trip\n\nColeen Rooney's youngest son Cass, 6, dons jungle hat and clutches kangaroo teddy as he watches his mum on I'm A Celeb\n\nLiam Payne's parents' moment of comfort for heartbroken Simon Cowell: Music mogul is hugged by singer's mother and father after private funeral\n\nHow The Rock got buff for Moana remake: Inside his insane workout routine and indulgent cheat meals\n\nWill & Grace star hospitalized twice in one night with recurring 'heart issue'\n\nScott Mills' pay is REVEALED as he takes over Radio 2 breakfast show... but it's much less than Zoe Ball's salary\n\nWorst dressed celebrities at 2024 CMA Awards revealed as country stars flock to red carpet in Nashville\n\nIris Law turns heads in a stylish black pinstriped jumpsuit as she attends a luxury party in Manhattan\n\nRebekah Vardy takes aim at I'm A Celebrity's Dean McCullough AGAIN for fawning over his campmates and brands Melvin Odoom 'boring'\n\nNew Diddy lawsuit claims he raped girl, 17, at infamous White Party in the Hamptons\n\nThe changing BBC rich list: How host of new faces are set to top the cost-cutting Beeb's highest earners after Gary Lineker stepped down from MOTD,\n\nI'm A Celeb fans praise Danny Jones as he and Oti break down in tears while discussing his mental health after she lost her brother to suicide\n\nMiranda Lambert wows in off-shoulder gown alongside sizzling Kacey Musgraves and Lainey Wilson as they lead glamour at the CMA Awards 2024 in Nashville\n\nJeff Bridges suffers awkward fail at the 2024 CMA Awards in Nashville while announcing biggest award of night\n\nReverend Richard Coles is 'worried' he won't recognise his I'm A Celeb campmates as he gears up to join them in the jungle as a late arrival\n\nTaylor Swift's surprising new friendship with liberal journalist Ronan Farrow revealed\n\nAnne Hathaway fans weigh in after she signs up for film adaptation of Colleen Hoover thriller Verity\n\nI'm A Celeb fans left MORTIFIED as campmate reveals they haven't changed their underwear since they arrived in the jungle\n\nKyle Richards reacts to castmate's bombshell claim she tried to hook up with Kevin Costner in Aspen\n\nThe Real Housewives of Potomac's Ashley Darby divorcing husband Michael two years after separating\n\nEXCLUSIVEWatch Dwayne 'The Rock' Johnson hold Maui's magical fish hook and hug Moana in FIRST video for remake\n\nTarzan star Ron Ely's cause of death revealed nearly two months after his passing at 86\n\nAfter just a week, the sun goes down on Elton John's Broadway musical\n\nThe Apprentice's return confirmed as BBC drops first look pic of series 19 with Lord Sugar, Karren Brady and Tim Campbell\n\nThe Chase's Mark Labbett reveals heartbreaking reason he split from Hayley Palmer and insists he 'isn't looking' for another woman\n\nChrissy Teigen puts on a leggy display in a polka-dotted mini dress in NYC\n\nKim Kardashian slammed over Tesla robot and Elon Musk friendship: 'We know she voted for Trump!'\n\nLindsay Lohan continues to stun fans with her radiant new look during glamorous outing in NYC\n\nHow Gwyneth Paltrow's controversial comedy Shallow Hal may have inspired her daughter Apple's name\n\nLIVELiam Payne funeral latest updates: Celebrity mourners comfort one another after private service for tragic One Direction star \n\nThat's awkward! Rebel Wilson is demoted to the third row at a Lakers game after previously sitting courtside\n\nThe suicide tragedy that rocked I'm a Celeb star Oti Mabuse's family life as star is praised for opening up\n\nI'm A Celebrity star caught sneaking contraband into the jungle as fans speculate the brutal repercussion which will cause a HUGE stir in camp\n\nI'm A Celeb: GK Barry screams 'I'm done' as she and Dean are left 'mortified' after getting ZERO stars in latest Bushtucker Trial- and fans brand duo 'useless'\n\nPrince Harry and Meghan Markle's latest Netflix documentary is hitting screens next month - and its release date has finally been revealed \n\nEmmerdale star returns to village from beyond the grave in tear-jerking scenes - leaving fans sobbing\n\nMiley Cyrus DEFENDS Chappell Roan for setting boundaries with fans after singer's rant about posing for photos\n\nJulia Garner is stony-faced stepping out in NYC after Madonna reveals her biopic is in development hell\n\nZoe Ball looks cheery as she is seen for the first time after quitting her £950,000 role as Radio 2 Breakfast Show host to 'focus on family'\n\nGlastonbury 2025 lineup: Huge British pop rock band 'set to headline Friday night slot'\n\nColdplay drops surprise new music video starring The Karate Kid star Ralph Macchio and was filmed in Australia\n\nWhy Billy Ray Cyrus was 'surprised' Beyonce didn't get CMA Awards nomination for country album\n\nInside the private lives of Angelina Jolie and Brad Pitt's six kids after Knox's rare appearance leaves dad 'suspicious'\n\nPregnant Princess Beatrice stuns in a black blazer and dress as she joins Emma Weymouth at glitzy Ralph Lauren event in London\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"A celebrity suffered a nasty lip injury during their Bushtucker trial on Thursday night's episode.","url":"https://www.dailymail.co.uk/tv/article-14112487/Im-Celebrity-star-suffers-nasty-lip-injury.html","image":"https://i.dailymail.co.uk/1s/2024/11/22/00/92350653-0-image-m-25_1732235233951.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/11/21/3890780100740299219/1024x576_MP4_3890780100740299219.mp4","publish_date":"2024-11-22 00:36:57","author":"Editor,Lily Jobson","authors":["Editor","Lily Jobson"],"language":"en","source_country":"gb","sentiment":-0.378},{"id":266376066,"title":"Trump nominates Pam Bondi for US attorney-general after Gaetz drops out","text":"US president-elect Donald Trump has nominated Pam Bondi for attorney-general just hours after Matt Gaetz, his initial pick, withdrew from consideration for the role.\n\nThe unexpected move injected fresh drama into Trump’s selection of cabinet nominees, as he seeks to swiftly secure a head for the Department of Justice, one of the most important posts in his incoming administration.\n\nA former Florida attorney-general, Bondi is seen as a less controversial pick than Gaetz, the former firebrand congressman. But she is a Trump ally who defended the president-elect’s efforts to question the result of the 2020 election.\n\n“For too long, the partisan Department of Justice has been weaponized against me and other Republicans — Not any more,” Trump wrote on his platform Truth Social on Thursday. “Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.”\n\nHe added that Bondi, a former Florida attorney-general, was “smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!”\n\nBondi is a partner at Ballard Partners, an influential lobbying firm in Washington, where she chairs its corporate regulatory compliance practice. She could not immediately be reached for comment.\n\nThis is a developing story","summary":"Announcement comes just hours after controversial initial nominee withdrew from consideration for the role","url":"https://www.ft.com/content/5ad291a2-b768-42d5-a606-a6d37eb700d4","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Faf50d3a2-ff46-4942-a126-122a616db9ea.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1","video":null,"publish_date":"2024-11-22 00:36:30","author":"Lauren Fedor,Stefania Palma","authors":["Lauren Fedor","Stefania Palma"],"language":"en","category":"politics","source_country":"gb","sentiment":0.128},{"id":266375540,"title":"Laura: The DC swamp lies under scrutiny","text":"to top close Video This video is playing in picture-in-picture.\n\nIngraham Angle November 21, 2024 08:11 \n\n Laura: The DC swamp lies under scrutiny \n Fox News host Laura Ingraham unpacks President-elect Donald Trump's plans to reshape government and end corruption on 'The Ingraham Angle.'\n\n Facebook Twitter Email Copy to clipboard Copy to clipboard Tags OPINIONSHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTHE INGRAHAM ANGLE","summary":"Fox News host Laura Ingraham unpacks President-elect Donald Trump&apos;s plans to reshape government and end corruption on &apos;The Ingraham Angle.&apos;","url":"https://www.foxnews.com/video/6365021131112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/478fc33a-6039-4e28-ab59-9e565c080aad/e4542765-7284-47dc-8eb7-7ddf0b68dfdd/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-22 00:36:06","author":null,"language":"en","source_country":"us","sentiment":-0.005},{"id":266375076,"title":"Trump taps Pam Bondi for attorney general after Gaetz withdraws","text":"Trump taps Pam Bondi for attorney general after Gaetz withdraws\n President-elect Donald Trump has named former Florida Attorney General Pam Bondi as his new pick for U.S. attorney general after former Rep. Matt Gaetz announced he was withdrawing from consideration for the role. CBS News senior White House and political correspondent Ed O'Keefe has the details. Then, Tom LoBianco, national politics reporter and co-founder of 24sight news, joins with analysis.","summary":"President-elect Donald Trump has named former Florida Attorney General Pam Bondi as his new pick for U.S. attorney general after former Rep. Matt Gaetz announced he was withdrawing from consideration for the role. CBS News senior White House and political correspondent Ed O'Keefe has the details. Then, Tom LoBianco, national politics reporter and co-founder of 24sight news, joins with analysis.","url":"https://www.cbsnews.com/video/trump-taps-pam-bondi-for-attorney-general-after-gaetz-withdraws/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/22/e082c996-41d9-48fe-ac48-29231dce5b17/thumbnail/1200x630/2fff0c0569e617b5b9d042d1c9fa302d/cbsn-fusion-trump-taps-pam-bondi-for-attorney-general-after-gaetz-withdraws-thumbnail.jpg?v=6056e68389c16974d8d95","video":null,"publish_date":"2024-11-22 00:35:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.229},{"id":266374624,"title":"Matt Gaetz drops bid for attorney general amid U.S. Senate opposition","text":"WASHINGTON - Hardline Republican Matt Gaetz withdrew his name from consideration as President-elect Donald Trump's attorney general after the former lawmaker faced opposition from Senate Republicans over his past conduct.Gaetz, who resigned from the U.S. House of Representatives last week, was the subject of an Ethics Committee probe into allegations of having sex with an underage 17-year-old girl. He has denied wrongdoing.The nomination was an early test of Trump's power over Congress, where his Republican Party will hold majorities in both chambers next year. Gaetz was disliked by many fellow Republicans for having orchestrated the ouster last year of former House Speaker Kevin McCarthy, throwing the House into chaos for weeks.","summary":"Matt Gaetz was the subject of an Ethics Committee probe into allegations of having sex with a 17-year-old girl.","url":"https://www.japantimes.co.jp/news/2024/11/22/world/politics/gaetz-drops-out/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/11/22/435584.JPG?v=3.1","video":null,"publish_date":"2024-11-22 00:34:00","author":"Andrew Goudsward,Bo Erickson,David Morgan,Web Master","authors":["Andrew Goudsward","Bo Erickson","David Morgan","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":0.056},{"id":266373918,"title":"Police report released in sexual assault claim against Pete Hegseth","text":"Police report released in sexual assault claim against Pete Hegseth\n A police report that details a 2017 allegation of sexual assault against Pete Hegseth, President-elect Donald Trump's pick for defense secretary, was released Wednesday. In the report, a woman claims she was sexually assaulted by Hegseth in a Northern California hotel. Hegseth, who told police that the encounter was consensual, was on Capitol Hill on Thursday meeting with Senate Republicans in an effort to shore up their support for his expected nomination. Nikole Killion has more.","summary":"A police report that details a 2017 allegation of sexual assault against Pete Hegseth, President-elect Donald Trump's pick for defense secretary, was released Wednesday. In the report, a woman claims she was sexually assaulted by Hegseth in a Northern California hotel. Hegseth, who told police that the encounter was consensual, was on Capitol Hill on Thursday meeting with Senate Republicans in an effort to shore up their support for his expected nomination. Nikole Killion has more.","url":"https://www.cbsnews.com/video/police-report-released-in-sexual-assault-claim-against-pete-hegseth/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/11/22/3c5c7b7a-ba4a-40c8-9d7d-ca89070b50cb/thumbnail/1200x630/68df0d093a521e90691cc79e87254a8c/1121-ad-killion.jpg?v=6056e68389c16974d8d95eeea60b7a3a","video":null,"publish_date":"2024-11-22 00:32:51","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.153},{"id":266373654,"title":"US Leads Crucial AI Safety Talks as Trump Vows to Dismantle Biden’s Strategy","text":"President-elect Donald Trump has made it clear that, should he return to the White House for a second term, he intends to repeal President Joe Biden’s landmark artificial intelligence (AI) policy. However, the true implications of this promise for the future development and regulation of AI technology remain uncertain.\n\nIn the midst of this political uncertainty, government scientists and AI experts from around the world are seeking greater clarity on the direction of AI policy. This week, they are gathering in San Francisco, a global hub for AI innovation, to discuss safety measures for the rapidly evolving technology. The meeting, hosted by the Biden administration, is a crucial moment for international collaboration on AI safety, drawing officials from key U.S. allies, including Australia, Canada, Japan, Kenya, Singapore, the United Kingdom, and the European Union.\n\nThe summit’s discussions are focused on urgent concerns, such as the growing issue of AI-generated deepfakes. These manipulated videos and images are increasingly being used for fraudulent purposes, impersonating individuals, and even spreading harmful content, including instances of sexual abuse. Addressing these challenges is one of the core agenda items, with officials looking for solutions to better detect and combat the misuse of AI technologies.\n\nThis meeting marks the first of its kind since world leaders gathered at an AI summit in South Korea earlier this year. At that event, they agreed to establish a global network of publicly supported safety institutes, aimed at advancing AI research and ensuring robust testing of these technologies.\n\nDuring the opening of the San Francisco meeting, U.S. Commerce Secretary Gina Raimondo emphasized the responsibility that comes with developing AI. She spoke directly to the gathered officials, researchers, and private-sector leaders, reminding them, “We have a choice. We are the ones developing this technology. You are the ones developing this technology. We can decide what it looks like.”\n\nRaimondo, like other speakers, acknowledged both the tremendous opportunities AI presents and the significant risks it poses. She specifically referenced the frightening prospect of AI advancements leading to “human extinction,” prompting the question, “Why would we allow that?” Her comments underscored the need for careful consideration and collaboration as the global community continues to navigate the complex landscape of AI development and its potential consequences.","summary":"The impact on the future of AI technology is still uncertain. One group seeking more clarity includes government scientists and AI specialists from various countries, who are meeting in San Francisco this week to discuss safety measures for AI.","url":"https://publishedreporter.com/2024/11/21/us-leads-crucial-ai-safety-talks-as-trump-vows-to-dismantle-bidens-strategy/","image":"https://publishedreporter.com/wp-content/uploads/2024/11/673e81cc2ff3f2.55987366.jpeg","video":null,"publish_date":"2024-11-22 00:31:40","author":"Sheenu Gupta","authors":["Sheenu Gupta"],"language":"en","category":"politics","source_country":"us","sentiment":0.509},{"id":266373650,"title":"Lawyer For Linda McMahon Addresses WWE ‘Ring Boy’ Lawsuit, Confirms Vince & Linda Separation","text":"Regarding the current cases involving Vince McMahon and WWE, Linda McMahon’s attorney has stated that she and Vince are not together. According to reports, Linda will be selected as President-elect Donald Trump’s choice for Secretary of Education. An article about the ongoing Vince-related WWE scandals, like as Janel Grant’s lawsuit against Vince, WWE, and John Laurinaits for sexual assault and human trafficking, was published by the Washington Post. It also covers the “ring boy” litigation in which Linda is a defendant.\n\nLaura Brevetti, Linda’s attorney, verified a long-standing but unsubstantiated rumor that Linda and Vince are no longer together. Regarding the ring boys case, Brevetti, who defended Vince McMahon during his criminal conviction in 1994, added:\n\n“There are numerous scurrilous lies, exaggerations, and misrepresentations in this lawsuit, which is based on allegations that date back more than thirty years.” Grant’s attorney was also questioned by the article regarding the potential for the Trump administration to sabotage the Justice Department’s Vince McMahon probe. “We have an unwavering will to see that Janel gets justice, but we have no control over what happens with any criminal investigation,” stated Grant’s attorney.","summary":"Regarding the current cases involving Vince McMahon and WWE, Linda McMahon&#8217;s attorney has stated that she and Vince are not together. According to reports, Linda will be selected as President-elect Donald Trump&#8217;s choice for Secretary of Education. An article about the ongoing Vince-related WWE scandals, like as Janel Grant&#8217;s lawsuit against Vince, WWE, and John [&#8230;]","url":"https://publishedreporter.com/2024/11/21/lawyer-for-linda-mcmahon-addresses-wwe-ring-boy-lawsuit-confirms-vince-linda-separation/","image":"https://publishedreporter.com/wp-content/uploads/2024/11/Linda-McMahon-Mike-Pence-645x370-1.jpg","video":null,"publish_date":"2024-11-22 00:31:10","author":"Prerna Sharma","authors":["Prerna Sharma"],"language":"en","source_country":"us","sentiment":-0.04},{"id":266373952,"title":"Number of Hongkongers enrolled in US universities hits record low","text":"The number of Hong Kong students studying for undergraduate degrees in the US has hit a record low, falling below 3,000 for the first time in more than 50 years, according to official data.\nThe high cost of US education and emigration routes in other countries had spurred parents and students to look for opportunities elsewhere, said Ng Po-shing, a consultant with the Hok Yau Club, a youth counselling organisation.\nFurther possible restrictions on international students under the next administration led by Donald Trump might also further reduce the number from Hong Kong, Ng added.\nAccording to the latest US government-sponsored annual survey by the Institute of International Education, there were 2,762 undergraduates from Hong Kong in the country in the last school year.\nThey were among 5,627 Hongkongers enrolled in tertiary education programmes, including bachelor, graduate and non-degree courses.\nThe figure marked a drop of 4 per cent from the previous school year and a record low since 1969-70, when there were 7,202 Hongkongers studying in the country.\nHong Kong has seen a declining number of students pursuing higher education in the US since 2015-16, when the number started to fall below 8,000 and then under 7,000 in 2018-19.\nThe Covid pandemic pushed down the number to below 6,000 in 2020-21, with just a slight uptick of 0.3 per cent in 2022-23.\nNg said parents aiming to send children overseas might have switched to the United Kingdom, Canada or Australia in recent years because those countries offered Hong Kong students and their families bespoke immigration routes.\n“With these three countries now offering emigration routes, parents may give up the choice of their children studying in the US,” he said.\nNg said more students were also receiving offers by local tertiary institutions as the number of secondary school leavers declined.\n“As the number of students pursuing tertiary education in Hong Kong has been decreasing ... students are presented with more local choices to pursue their studies,” Ng said.\nHe added parents choosing the US might also be put off by high tuition fees and living expenses when compared with other study destinations.\nUS public universities charge at least HK$220,000 (US$28,265) per year, followed by HK$150,000 in Australia and HK$110,000 in the United Kingdom and Canada, according to IDP, an education consultancy in global education services.\n\nHe said the number of Chinese students studying in the US, including those from Hong Kong, might be affected by the next administration under Trump, who implemented more restrictive immigration policies during his last tenure in 2017 to 2021.\n“If there are more restrictions or unwelcoming sentiment against overseas students in the future under Donald Trump, more students will turn to other places,” he added.\nThe shrinking number of students going to the US to study was also in line with the results of a survey conducted by Hong Kong’s education authorities.\nOnly about 87 Form Six students graduating in 2023 picked the US as their further study destination out of 3,609 students surveyed, and it was the first time the number had fallen below 100.\nHong Kong is not the only place in Asia to lose its interest in the US as a study destination, with mainland China, Japan, South Korea, Malaysia, Indonesia and Thailand sending fewer students to American higher education institutions compared with 2022-23.\nMainland China was also overtaken by India as the top source of international students in the US for the first time in about 15 years, according to the data.","summary":"According to US government-sponsored survey, country had 2,762 undergraduates from Hong Kong in last school year.","url":"https://www.scmp.com/news/hong-kong/education/article/3287605/number-hongkongers-enrolled-us-universities-hits-record-low","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/11/21/725670f4-cdf3-44af-a54d-adae0819e82f_afa7abb2.jpg","video":null,"publish_date":"2024-11-22 00:30:17","author":"William Yiu","authors":["William Yiu"],"language":"en","source_country":"cn","sentiment":-0.106},{"id":266377532,"title":"A one-of-a-kind Royal Canadian Mint coin sells for more than $1.5M","text":"CTVNews.ca Top Stories\n\n From essential goods to common stocking stuffers, Trudeau offering Canadians temporary tax relief\n\n Canadians will soon receive a temporary tax break on several items, along with a one-time $250 rebate, Prime Minister Justin Trudeau announced Thursday.\n\n She thought her children just had a cough or fever. A mother shares sons' experience with walking pneumonia\n\n A mother shares with CTVNews.ca her family's health scare as medical experts say cases of the disease and other respiratory illnesses have surged, filling up emergency departments nationwide.\n\n Trump chooses Pam Bondi for attorney general pick after Gaetz withdraws\n\n U.S. president-elect Donald Trump on Thursday named Pam Bondi, the former attorney general of Florida, to be U.S. attorney general just hours after his other choice, Matt Gaetz, withdrew his name from consideration.\n\n Putin says Russia attacked Ukraine with a new missile that he claims the West can't stop\n\n Russian President Vladimir Putin announced Thursday that Moscow has tested a new intermediate-range missile in a strike on Ukraine, and he warned that it could use the weapon against countries that have allowed Kyiv to use their missiles to strike Russia.\n\n Here's a list of items that will be GST/HST-free over the holidays\n\n Canadians won’t have to pay GST on a selection of items this holiday season, the prime minister vowed on Thursday.\n\n Taylor Swift's motorcade spotted along Toronto's Gardiner Expressway\n\n Taylor Swift is officially back in Toronto for round two. The popstar princess's motorcade was seen driving along the Gardiner Expressway on Thursday afternoon, making its way to the downtown core ahead of night four of ‘The Eras Tour’ at the Rogers Centre.\n\n A one-of-a-kind Royal Canadian Mint coin sells for more than $1.5M\n\n A rare one-of-a-kind pure gold coin from the Royal Canadian Mint has sold for more than $1.5 million. The 99.99 per cent pure gold coin, named 'The Dance Screen (The Scream Too),' weighs a whopping 10 kilograms and surpassed the previous record for a coin offered at an auction in Canada.\n\n Service Canada holding back 85K passports amid Canada Post mail strike\n\n Approximately 85,000 new passports are being held back by Service Canada, which stopped mailing them out a week before the nationwide Canada Post strike.\n\n Manitoba RCMP issue Canada-wide warrant for Ontario semi-driver charged in deadly crash\n\n Manitoba RCMP have issued a Canada-wide arrest warrant for the semi-driver involved in a crash that killed an eight-year-old girl and her mother.\n\n Vancouver \n\n B.C. man sentenced to probation for social media stunt\n\n A man who drove a car into B.C.'s Burrard Inlet in a livestreamed social media stunt has been sentenced to one year of probation and will not have a criminal record if he complies with court-ordered conditions.\n\n Video shows octopus 'hanging on for dear life' during bomb cyclone off B.C. coast\n\n Humans weren’t the only ones who struggled through the bomb cyclone that formed off the B.C. coast this week, bringing intense winds and choppy seas.\n\n Man stabbed by stranger in Surrey's Newton area, RCMP say\n\n Authorities are investigating after a man was reportedly stabbed by a stranger in Surrey's Newton area this week.\n\n Taylor Swift's motorcade spotted along Toronto's Gardiner Expressway\n\n Taylor Swift is officially back in Toronto for round two. The popstar princess's motorcade was seen driving along the Gardiner Expressway on Thursday afternoon, making its way to the downtown core ahead of night four of ‘The Eras Tour’ at the Rogers Centre.\n\n 2 people arrested, 3rd suspect still at large in connection with fatal Brampton shooting\n\n Two people have been arrested and another suspect remains at large in connection with a fatal shooting in Brampton earlier this month.\n\n Mother charged after infant dies in midtown Toronto: police\n\n The mother of an infant who died after being found at an apartment building in midtown Toronto on Wednesday has been charged with failing to provide the necessaries of life.\n\n Calgary Fire Department responding to explosion in Mahogany\n\n Calgary Fire Department is responding to an explosion at a six-plex in the city's southeast.\n\n Police probe possible connection between Calgary house fire and Bitcoin notes\n\n Calgary police are seeking information in relation to a Tuesday fire in Hillhurst they believe was deliberately set and notes left in the area demanding Bitcoin.\n\n Six shots fired after Calgary road rage incident, police seek dash-cam footage\n\n Calgary police are looking for dash-cam footage as they investigate a shooting in the community of Cityscape believed to be the result of road rage.\n\n uOttawa to reconsider participation in U-Pass if city increases student fares, student union says\n\n The student union at the University of Ottawa says it will consider pulling its participation from the U-Pass, which provides discounted transit fares for students, if the city goes forward with hiking student transit fees and violating the program’s contract.\n\n Abdi inquest: Arresting officer feared for his safety during deadly arrest, jurors hear\n\n A former Ottawa police officer returned to the witness stand on Monday and provided further details of the moments before the violent and deadly arrest of Abdirahman Abdi on the fourth day of a coroner's inquest into the circumstances of his death.\n\n 2 arrested during Greenpeace protest outside Stornoway residence in Ottawa\n\n Two people have been arrested following a protest outside Stornoway, the official residence of Canada's leader of the Opposition.\n\n Pro-Palestinian protesters gathered outside Concordia University amid Quebec-wide boycotts\n\n The lobby of Concordia University’s Hall Building was flooded with pro-Palestinian protesters Thursday as others gathered and chanted outside the campus as part of Quebec-wide solidarity strikes.\n\n Transit and taxes: mixed reactions to Quebec budget\n\n There was a mixed reaction to the Quebec government's fall fiscal update on Thursday as the province announced billions of dollars in new spending.\n\n Montreal shelter for abuse victims is raising funds amid rise in demand\n\n The Shield of Athena is fundraising to expand services after a sharp increase in demand from abuse victims.\n\n Alberta pitches new rules for auto insurance, including rate hikes, no-fault claims\n\n The Alberta government is making changes to auto insurance, including rate hikes and switching to a predominantly no-fault claims model.\n\n Alberta forecasts $4.6B surplus in budget update, but braces for uncertainty\n\n Alberta is forecasting a $4.6-billion surplus for this fiscal year, but Finance Minister Nate Horner says \"mounting pressures\" threaten to soon put the province in the red.\n\n 'No 2 days are the same': Alberta Wildfire hiring 500 firefighters for next season\n\n The wildfire season may have officially ended on Oct. 31, but Alberta Wildfire is already preparing for next year.\n\n CTV News Roundtable: N.S. leaders discuss solutions on affordability, housing, health care\n\n Nova Scotia’s top three political party leaders took part in CTV Atlantic’s roundtable discussion on Thursday, where they sparred over affordability, housing, health care, and campaign promises.\n\n From essential goods to common stocking stuffers, Trudeau offering Canadians temporary tax relief\n\n Canadians will soon receive a temporary tax break on several items, along with a one-time $250 rebate, Prime Minister Justin Trudeau announced Thursday.\n\n 'This is cold': P.E.I. mother upset over decision to remove late daughter's photos from school memorial wall\n\n A high school on Prince Edward Island is removing pictures of its late students from a memorial wall – a decision that has upset one mother whose daughter attended the school.\n\n BREAKING | \n\n Sio Silica plans to try again with controversial project in Manitoba\n\n Sio Silica is planning to try again with a controversial mining project in the same spot using the same method that the province rejected less than a year ago, but this time with more community engagement.\n\n Manitoba RCMP issue Canada-wide warrant for Ontario semi-driver charged in deadly crash\n\n Manitoba RCMP have issued a Canada-wide arrest warrant for the semi-driver involved in a crash that killed an eight-year-old girl and her mother.\n\n Mayor Gillingham and Premier Kinew to face off in friendly hockey game for Winnipeg 150\n\n The Manitoba premier is set to face off against Winnipeg's mayor on Nov. 30 to mark Winnipeg's 150th anniversary.\n\n Contractor fatally injured while on the job at Regina's Evraz plant\n\n Evraz North America says an investigation is underway after a contractor was fatally injured while on the job in Regina on Nov. 19.\n\n 'I'll always be a Pat': Regina Pats trade captain Tanner Howe to Calgary\n\n The Regina Pats have announced a blockbuster trade Thursday that sees captain Tanner Howe on his way to Calgary to play for the Hitmen as the team continues rebuilding for the future.\n\n Jeremy O'Day speaks on wins, losses and Riders' overall performance in 2024\n\n The Grey Cup Champion has officially been crowned for the 2024 season and once again it did not go to the Saskatchewan Roughriders. On Thursday, General Manager, Jeremy O'Day, spoke to media to break down another year.\n\n Kitchener \n\n FunGuyz says it's closing all 30 of its magic mushroom stores in Ontario\n\n FunGuyz, which calls itself the biggest magic mushroom dispensary in Canada, says it's shutting down all 30 of its Ontario locations.\n\n LRT train knocked off its tracks after slamming into car\n\n A crash between an LRT train and car shut down a busy Kitchener street for more than eight hours on Thursday.\n\n Fight between rival motorcycle gangs in Cambridge leads to five arrests, more than a dozen charges\n\n A fight between rival outlaw motorcycle gangs has led to multiple arrests, more than a dozen charges and the seizure of 17 firearms.\n\n Saskatoon \n\n Saskatoon's first female mayor sworn in\n\n After being sworn in Wednesday night alongside a mix of new and returning city councillors, Cynthia Block becomes the first female mayor of Saskatoon.\n\n Sask. tuxedo business closes stores across the province\n\n A Saskatchewan tuxedo business says struggles with inflation and operating costs have caused it close stores across the province.\n\n Alberta non-profit Mustard Seed to run Saskatoon's Lighthouse\n\n Alberta-based non-profit the Mustard Seed is stepping up to run Saskatoon's Lighthouse.\n\n Northern Ontario \n\n Province cancels deal with Canadore College for North Bay addiction treatment centre\n\n After years of delays, the province has pulled the plug on an addiction treatment centre in North Bay. A news release from Canadore College on Thursday confirmed the centre won’t be moving forward.\n\n From essential goods to common stocking stuffers, Trudeau offering Canadians temporary tax relief\n\n Canadians will soon receive a temporary tax break on several items, along with a one-time $250 rebate, Prime Minister Justin Trudeau announced Thursday.\n\n $3M donation to help repair arena in Elliot Lake\n\n The City of Elliot Lake said Thursday it has received a $3-million donation from Edward and Suzanne Rogers for the Centennial Arena restoration.\n\n Former London Lightning player Chad Posthumus dead at 33 after brain aneurysm\n\n Posthumus played a stint with the London Lightning - hitting the court for 22 games in the 2015-2016 season, averaging 11 points, and 6.5 rebounds.\n\n London man arrested after attempting to break into a home, threatening residents\n\n Police say that on Thursday, November 21 between the hours of 1:30 a.m., and 4:30 a.m. the suspect came and went from a residence on Conway Drive.\n\n Goderich man charged with sex crimes and luring a child: police\n\n A 21-year-old Goderich man is facing more than 20 criminal charges related to sex crimes, and police believe there may be more victims.\n\n How to avoid the number one cause of lung cancer in non-smokers, according to health experts\n\n Radon is the number one cause of lung cancer in non-smokers in Canada, according to Grey Bruce Public Health Unit.\n\n Local shelter receives donated Taylor Swift tickets\n\n Staff at the Busby Centre, a nonprofit organization that supports individuals struggling and living on the streets of Barrie, received a surprise donation on Wednesday in the form of Taylor Swift tickets.\n\n OPP launch 'Project Atlas' to curb crypto scams\n\n With the rise of cryptocurrency investment scams, the OPP have launched ‘Project Atlas’ this week, an initiative to clamp down on investment fraud.\n\n Report ranks Windsor 88th in Canadian housing performance\n\n A new report puts Windsor’s housing performance near the bottom of the pack among Canada’s largest 100 cities and towns in a review of construction starts over the last six years.\n\n Woman sought following serious assault in west Windsor\n\n Windsor police are asking for the public’s help identifying a suspect wanted in connection to an alleged serious assault that happened this past summer.\n\n Service Canada holding back 85K passports amid Canada Post mail strike\n\n Approximately 85,000 new passports are being held back by Service Canada, which stopped mailing them out a week before the nationwide Canada Post strike.\n\n Vancouver Island \n\n Major crime investigators reviewing death of Victoria teen, which coroner reclassified as homicide\n\n Vancouver Island’s major crime unit is investigating the case of a Victoria teenager whose death was initially ruled an accidental overdose, but has since been reclassified by coroners as a homicide.\n\n 1 dead after Nanaimo house fire, RCMP say\n\n One person is dead after a fire that destroyed a home in Nanaimo's south end Wednesday morning.\n\n Another windstorm headed to B.C.’s South Coast Friday, Environment Canada says\n\n Another fall storm is forecast to bring high winds to B.C.’s South Coast on Friday, Environment Canada says.\n\n Man in hospital following targeted shooting in Kamloops\n\n Police are appealing for information on a targeted shooting that resulted in the hospitalization of a man in Kamloops.\n\n Police cleared of fault in fatal 2023 crash in B.C.'s Interior\n\n British Columbia's independent police watchdog has cleared officers of wrongdoing in a crash where three people were killed south of Kamloops in July of last year.\n\n B.C. woman sentenced for stealing $14K in funds raised for schoolkids\n\n A B.C. woman who stole more than $14,000 in volunteer-raised funds that were supposed to be spent on school supplies and programs – including hot meals for vulnerable kids – won't spend any time in jail.\n\n Lethbridge \n\n Lethbridge career exploration day aims to get women more involved in agriculture\n\n Agriculture is an industry mainly dominated by men, but around 80 middle school and high school students – all of whom are female – are hoping to change that.\n\n Driver killed in Trans-Canada Highway crash near Salmon Arm, B.C.\n\n B.C. RCMP say one person was killed in a head-on crash on the Trans-Canada Highway near Salmon Arm on Wednesday.\n\n Giving Machine at Lethbridge's Park Place Mall sells you things that go straight to people in need\n\n There’s a new way to give this holiday season.\n\n Sault Ste. Marie \n\n After a year of struggle, centre that helps Sault youth to move to a building with heat\n\n Sault-based charity Save Our Young Adults, or SOYA, will soon move to a new home -- for good reason.\n\n $3M donation to help repair arena in Elliot Lake\n\n The City of Elliot Lake said Thursday it has received a $3-million donation from Edward and Suzanne Rogers for the Centennial Arena restoration.\n\n Sault College accounting students get a head start on their careers\n\n Students in Sault College’s business accounting program have a new learning pathway that will ultimately give them a head start to a career.\n\n As N.L. firm pivots, scientists say Canada's green hydrogen dreams are far-fetched\n\n A Newfoundland energy company's embrace of data centres is raising doubts about eastern Canadian hopes of harnessing the region's howling winds to supply Germany with power from green hydrogen.\n\n Canadian leads group pushing Vatican for zero-tolerance policy on abuse by clergy\n\n An international group led by a Canadian is in Rome this week to push the Catholic Church to adopt a zero-tolerance policy on abuse by clergy.\n\n Newfoundland wind-to-hydrogen company eyes data centre as international market lags\n\n A company hoping to build a multi-billion-dollar wind-to-hydrogen project in western Newfoundland is eyeing other options as Canada's plans to supply Europe with green energy have not yet materialized.\n\n Local Spotlight \n\n B.C. man reunites with Nova Scotia stranger, 56 years after being saved from drowning\n\n After driving near the water that winter day, Brian Lavery thought he saw a dog splashing in the waves – then realized it was way too cold for that.\n\n 'It's nice to just talk to people': Toronto podcaster prank calling Nova Scotians\n\n Toronto radio and podcast host Jax Irwin has recently gone viral for videos of her cute -- and at times confusing -- phone conversations.\n\n 'I'm just tickled pink': Childhood friends from New Brunswick named Rhodes Scholars\n\n Two young women from New Brunswick have won one of the most prestigious and sought-after academic honours in the world.\n\n B.C. man to cycle length of New Zealand to raise funds for Movember\n\n Stretching 3,000 kilometres from the tip of New Zealand to its southernmost point, with just a bicycle for transport and a tent to call home, bikepacking event Tour Aotearoa is not for the faint of heart.\n\n 'She's a people person': Urban chicken inspires positivity in B.C. neighbourhood\n\n When he first moved to his urban neighbourhood, Barry Devonald was surprised to be welcomed by a whole flock of new neighbours.\n\n 'A little piece of history': Winnipeg homeowner finds 80-year-old letters hidden in walls\n\n When George Arcioni began renovating his kitchen last summer, he didn’t expect to find a stack of letters hidden in the wall behind his oven.\n\n Love story: Nova Scotia couple gets engaged at Taylor Swift’s Toronto show\n\n A Nova Scotia couple fulfilled their wildest dreams Thursday night when they got engaged at Taylor Swift’s Eras Tour in Toronto.\n\n 'Fireball' meteor lights up Calgary's sky\n\n Some Calgary residents caught what appeared to be a meteor streaking across the sky early on Wednesday morning.\n\n 'I get in this workshop and everything disappears': N.B. man creates whimsical birdhouses in spare time\n\n Four years ago, Phill Hebb started up 'Phil’s Unique Birdhouses' and since then, they’ve made their way all across Canada and into the United States.\n\n Consul general reiterates he had no influence on $9M Manhattan condo purchase\n\n Canada's consul general in New York doubled-down Thursday on his past claim that he exerted no influence on the decision of Global Affairs Canada to buy a $9 million condo in Manhattan.\n\n Trudeau says Canada would 'abide' by ICC arrest warrant for Israel PM Netanyahu\n\n Prime Minister Justin Trudeau said Canada will 'abide' by an International Criminal Court (ICC) arrest warrant for Israeli Prime Minister Benjamin Netanyahu.\n\n From essential goods to common stocking stuffers, Trudeau offering Canadians temporary tax relief\n\n Canadians will soon receive a temporary tax break on several items, along with a one-time $250 rebate, Prime Minister Justin Trudeau announced Thursday.\n\n She thought her children just had a cough or fever. A mother shares sons' experience with walking pneumonia\n\n A mother shares with CTVNews.ca her family's health scare as medical experts say cases of the disease and other respiratory illnesses have surged, filling up emergency departments nationwide.\n\n Why you should keep exercising in cold weather\n\n What kind of exercise is best during chilly weather? How can people safely and enjoyably participate in physical activity outdoors when it’s cold out?\n\n Texas doctor gets 190-year sentence for tampering with IV bags used in surgeries\n\n A Dallas anesthesiologist was sentenced Wednesday to 190 years in prison for injecting a nerve-blocking agent and other drugs into bags of intravenous fluid at a surgical center where he worked, leading to the death of a coworker and causing cardiac emergencies for several patients.\n\n Canada's space agency invites you to choose the name of its first lunar rover\n\n The Canadian Space Agency (CSA) is inviting Canadians to choose the name of the first Canadian Lunar Rover.\n\n Unprecedented image may reveal impending supernova that could be visible from Earth\n\n Astronomers have captured the first close-up image of a star beyond our galaxy, taken during a dramatic moment near the end of the star’s life. In it, the 'behemoth' star appears to puff out gas and dust, a critical final step before exploding in a supernova.\n\n Rare fruit fly caught at Detroit Metro Airport\n\n A rare kind of fruit fly has been caught by U.S. Customs and Border Protection (CBP) agriculture specialists at Detroit Metro Airport.\n\n Entertainment \n\n Pamela Hayden, longtime 'Simpsons' voice actor, including Bart's friend Milhouse, hangs up her mic\n\n Pamela Hayden, the longtime voice actor behind Milhouse Van Houten — Bart Simpson's very uncool friend — is stepping away after 35 years of whining.\n\n Flashback documentary explores the Edmonton dance club that changed Alberta\n\n Everybody who lived in Edmonton in the 1980s knew it was famous for two things: the mall and the Oilers.\n\n A decades-old cassette revealed an unreleased Luther Vandross cover of a Beatles classic\n\n A musical gem was recently uncovered from the vaults of the Luther Vandross Estate — a soulful, never-before-heard rendition of The Beatles' song 'Michelle.'\n\n FunGuyz says it's closing all 30 of its magic mushroom stores in Ontario\n\n FunGuyz, which calls itself the biggest magic mushroom dispensary in Canada, says it's shutting down all 30 of its Ontario locations.\n\n Retail industry praises GST holiday but says it may be 'laborious' for some\n\n A temporary pause on charging the federal sales tax on many items has retailers excited, even though they say preparing for the relief will mean a lot of extra work in a short period of time.\n\n Canada's Irving Tissue plans a US$600M factory expansion in Georgia, hiring 100 more workers\n\n Irving Tissue said it needs to expand in Macon because the mill is currently selling all the bath tissue and paper towels it can make\n\n Lifestyle \n\n World's tallest and shortest women meet for afternoon tea\n\n The world's tallest woman and the world’s shortest woman have met for afternoon tea in London to celebrate Guinness World Records Day.\n\n 'That sent my imagination wild': B.C. grandma paints 12-foot Star Wars mural with grandson\n\n Sandra Kroek and her grandson Remington spent 200 hours painting a massive Star Wars mural together.\n\n Are you a digital nomad? Share your journey of remote work and travel\n\n CTVNews.ca wants to hear from digital nomads who have taken up location-independent jobs and can work from anywhere with an internet connection.\n\n Alex Ovechkin expected to miss 4 to 6 weeks with broken left leg\n\n Alex Ovechkin has a broken left fibula and is expected to be out four to six weeks, an injury that pauses the Washington Capitals superstar captain’s pursuit of Wayne Gretzky’s NHL career goals record.\n\n 1991-2024 \n\n 1991-2024 | \n\n Winnipeg Sea Bears captain Chad Posthumus dies at 33\n\n Sea Bears centre Chad Posthumus has died at age 33.\n\n NFL warns players after home break-ins: Organized groups are targeting pro athletes\n\n After recent burglaries at homes of professional athletes, the NFL has issued a security bulletin to teams and the players union warning that “organized and skilled groups” are increasingly targeting players’ residences for such crimes.\n\n Northvolt says Quebec battery plant will proceed despite bankruptcy filing\n\n Northvolt AB has filed for bankruptcy protection in the United States, but said the move will not jeopardize the manufacturer's planned electric vehicle battery plant in Quebec — though hundreds of millions of taxpayer dollars invested in the parent company could be lost.\n\n Canadian drivers own their poor road habits: survey\n\n Canadian drivers are regularly in a hurry to get to their destination and a majority are willing to take unnecessary risks on the road, according to the results of a new survey.\n\n B.C. man who sold Porsche to scammers shares cautionary tale\n\n A man from B.C.’s Lower Mainland who was scammed while selling his Porsche Cayenne online is sharing his cautionary tale – while calling for increased protections from the government.\n\n Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n The Ultimate 2024 Holiday Gift Guide For Nature Lovers And Outdoor Adventurers\n\n 27 Of The Absolute Best Stocking Stuffers For Men\n\n 19 Of The Absolute Best Gift Exchange Ideas For 2024\n\n Our Guide to the Best Jewellery Boxes You Can Find Online Right Now\n\n 16 Home Gadgets That'll Make Your Life Easier\n\n The 5 Best Drip Coffee Makers In Canada In 2024, Tested and Reviewed\n\n 23 Great Secret Santa Gifts Under $15 From Amazon Canada\n\n All The Best Beauty Stocking Stuffers That Ring In Under $25\n\n 24 Of The Best Host And Hostess Gifts You Can Find Online Right Now\n\n 20 Anti-Aging Skincare Products That Reviewers Can’t Stop Talking About\n\n 12 Budget-Friendly Makeup Brushes And Tools Worth Adding To Your Kit\n\n If You Suffer From Dry Skin, You'll Want To Add At Least One Of These Hydrating Moisturizers To Your Cart\n\n These 2024 Advent Calendars Are All On Sale Right Now For Black Friday Week\n\n Run, Don't Walk — These Reviewer-Favourite Loop Earplugs Are Majorly On Sale For Amazon's Black Friday Week Sale\n\n Amazon Canada's Black Friday Week Is On: This Smart Thermometer Will Make Holiday Cooking So Much Easier (And It’s 20% Off Right Now)\n\n Stay Connected","summary":"A rare one-of-a-kind pure gold coin from the Royal Canadian Mint has sold for more than $1.5 million. The 99.99 per cent pure gold coin, named 'The Dance Screen (The Scream Too),' weighs a whopping 10 kilograms and surpassed the previous record for a coin offered at an auction in Canada.","url":"https://www.ctvnews.ca/canada/a-one-of-a-kind-royal-canadian-mint-coin-sells-for-more-than-1-5m-1.7119161","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/11/21/pure-gold-coin-1-7119172-1732232994355.jpg","video":null,"publish_date":"2024-11-22 00:28:00","author":"Lynn Chaya","authors":["Lynn Chaya"],"language":"en","source_country":"ca","sentiment":0.107},{"id":266374636,"title":"3 steps Trump should take to prevent WWIII","text":"WND recently published my article “The top elites want Trump to run their pending war” in which I further elaborated on my theory that Donald Trump forced them to dismantle their barriers to his second term and let him back in the White House. What they’ve surrendered to is letting Trump take on the challenge of preserving the American Empire in his own way – which is dramatically different from their own Ukraine-centered, Russian scapegoating, global bullying strategy. Trump and the top tier elites share the goal of preserving U.S. military and economic global dominance but are polar opposites on Cultural Marxism and the battle between nationalism and “one world” globalism.\n\nTrump’s win means he gets the chance to roll back socialism and restore constitutionalism against their will on the domestic front while pursuing their common priority internationally. This was the same general trade-off Reagan had, but, importantly, Trump’s agenda adds the component of anti-“one world” globalism. In this context, Trump’s “nationalism” might better be termed “international federalism” because it clearly presumes an international order in which nations remain cooperating independent sovereigns and not mere components of single global Marxist conglomerate like the neo-Soviet European Union strives to be.\n\nThey surrendered to Trump not just because he beat them politically, but because Vladimir Putin beat them militarily in Ukraine. When their military failure became so obvious in 2023 that they could no longer contain the situation with war propaganda, they fell back to Plan B: the much riskier Israel/Hamas gambit, which is mostly limited to the Iran problem and related Middle East objectives. I have contended since it happened that the all-too-real Oct. 7, 2023, massacre was allowed to happen for that purpose. I believe they let slip the rabid dogs of Hamas deliberately to shift the “Eye of Sauron” media focus away from Ukraine (which I disapprove), and create the justification for de-nuking Iran (which goal I endorse, if not the duplicitous staging.)\n\nAre the elites truly that evil? Ask the hundred million plus innocent unborn babies they’ve slaughtered worldwide (including in Israel) by normalizing abortion as a population-reduction tactic. Or maybe we should ask the entire generation of dead and maimed Ukrainian men sacrificed as cannon fodder proxies in a 100% preventable NATO- orchestrated war.\n\nLet’s review what’s really happening in the world of geopolitics – as seen from outside the bubble of neocon propaganda constantly being spewed by the corporate media of the U.S., U.K. and European Union. \n\nMassive corruption and abuse of power by the Bush/Clinton/Obama/Biden tag-team cabal over the past several decades has bankrupted America, poisoned much of the world against us and driven a growing alliance of would-be competitors to formalize and implement a plan to end our global hegemony. The greatest threat their BRICS network represents is to the U.S. dollar’s dominance as the world’s reserve currency. If BRICS develops a way to dethrone the dollar, we will (supposedly) collapse like a house of cards under an avalanche of debt we have no ability to pay – some $36 trillion worth – or higher by some accounts. Our fall would be swift and spectacular – creating a political vacuum into which the BRICS nations would flow to replace us with their vision of a new multi-polar order.\n\nObviously, that existential threat has – in the warped minds of the elite megalomaniacs who rule us – warranted extreme measures, which included the anti-Trump color revolution and coup of 2020, facilitated by the global deployment of their COVID bio-weapon and imposition of de facto medical martial law. In one fell swoop they intended to crush the rapidly growing worldwide populist uprising that threatened their grip on the levers of national and international power AND at the same time intimidate the BRICS nations into submission in classic Mafia style.\n\nTo invoke the old Chinese idiom, they intended to “kill the chicken to scare the monkey.” But to their shock, the populist chicken (led by the MAGA movement in the U.S.) didn’t die. Instead it got stronger and began pushing back even harder, not just against the fake vaccine but also against government-coerced censorship, manipulative fake-news narratives, forced DEI lunacy and child-grooming … and the proxy war in Ukraine. That was only possible because MAGA’s champion, Donald Trump, did not retreat after J6 but redoubled his efforts.\n\nSo now we’ve all been rewarded with front-row seats to the greatest show on earth as a greatly wiser and fully unshackled President-elect Trump begins the process of draining the swamp and restoring America’s greatness – not just domestically, but internationally.\n\nI think President Trump can prevent World War III during his delayed second term by doing three things:\n\nFirst, by embracing some form of the BRICS multi-polar vision on the condition that the dollar remains the sole world currency for international trade. This would further his goal of withdrawing the United States from the roles of international policeman, babysitter and financial sugar-daddy, while earning the appreciation and respect of those BRICS nations being entrusted as true partners in international matters, no longer treated as mere vassals of the U.S. This would mean ending the top-down divide-and-conquer polarization model for international relations established long ago by the British Empire and replacing it with the model of international federalism mentioned above.\n\nSecond, by developing a partnership with Putin and Russia based upon our mutual Christian history and cultural foundations to 1) fully drain the swamp of Marxism globally, starting with the European Union; and 2) constrain Islamist expansion everywhere, starting with Islamist-targeted Christian nations like Nigeria. In my view the only reason Russia is militarily allied with Shiite Iran is to counter the U.S. alliance with the Sunni majority headed by Saudi Arabia. A U.S./Russia alliance on Islam and Middle East policy would completely transform the geopolitical dynamics, provide the opportunity to compel Iran to de-nuke without resort to military force, and protect Israel from destruction by the Islamic world by removing Russia’s incentive to ally with Israel’s enemies as a tactic of self-defense. Russia instead would be an ally of Israel, which I believe Putin would prefer.\n\nThree, the lynchpin making the prior elements possible would be NATO and the Russian Federation entering into a mutual non-expansion agreement. What’s really driving all these currently failing international policies is the Mackinder theory of geopolitics held forever by the British (and by extension the Americans) that if Russia gains control of the Eurasian plateau it would become an unstoppable world power. If Russia formally abandoned any dream of a restored Soviet Union (which I don’t think it wants) and NATO ended its encroachment/encirclement strategy for containing Russia, then the threat of WWIII would fade dramatically.\n\nAll this, of course, assumes that the elites won’t start WWIII before Trump’s inauguration. I’ll address that issue in my next column.","summary":"'We've all been rewarded with front-row seats to the greatest show on earth'","url":"https://www.wnd.com/2024/11/3-steps-trump-should-take-to-prevent-wwiii/","image":"https://www.wnd.com/wp-content/uploads/2018/07/donald-trump-vladimir-putin-helsinki-WH-600.jpeg","video":null,"publish_date":"2024-11-22 00:25:25","author":"Scott Lively","authors":["Scott Lively"],"language":"en","category":"politics","source_country":"us","sentiment":0.078},{"id":266374466,"title":"Kevin O'Leary says Trump reviving Keystone Pipeline would be 'great' for energy independence","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit November 21, 2024 03:07 \n\n Kevin O'Leary says Trump reviving Keystone Pipeline would be 'great' for energy independence \n Kevin O'Leary reacts to President-elect Donald Trump set to revive the Keystone Pipeline with U.S. energy on the cusp of a new era on 'The Evening Edit.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSWHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITELECTIONENERGY","summary":"Kevin O&apos;Leary reacts to President-elect Donald Trump set to revive the Keystone Pipeline with U.S. energy on the cusp of a new era on &apos;The Evening Edit.&apos;","url":"https://www.foxbusiness.com/video/6365021220112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/6fe9096b-77c0-4fc9-8f45-4e2099d4e8f2/72da5919-793d-4eca-b1a4-cabad14885e3/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-11-22 00:25:15","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.146},{"id":266372964,"title":"Trump’s Bureaucracy Cuts","text":"The stunning results of the USA elections surprised both Democrats and Republicans alike. Trump’s unprecedented victory was accompanied by Republican wins in the US Senate and House of Representatives. Before the 2024 elections, Democrats controlled the Senate with 51 seats to Republicans’ 49, while Republicans held a narrow majority in the House with 220 seats to Democrats’ 212. After the elections, Republicans gained control of the Senate with 53 seats, and in the House, they retained their majority with 220 seats to Democrats’ 213, with 2 races undecided. This outcome resulted in unified Republican control of both chambers of Congress. This has emboldened President-elect Donald J. Trump to undertake one of the boldest policy and administrative decisions in US history, which could be a potential game changer. Mr. Trump has established the Department of Government Efficiency (DOGE), to streamline federal operations by identifying wasteful spending, reducing regulatory burdens, and restructuring or potentially abolishing certain agencies to enhance government efficiency. He is poised to substantially reduce the size of the US civilian and military bureaucracy, which, according to the strategic reform team led by Elon Musk and Vivek Ramaswamy, has grown excessively large. They argue that the bureaucracy has become a de facto “fourth branch” of government, assuming overriding control over decision-making processes and diminishing the power of the democratically elected political leadership.\n\nThe rationale behind this initiative is that the federal bureaucracy has grown disproportionately large, with hefty perks and benefits, while many departments, despite their significant size and employment levels, are either underperforming or have lost sight of their original purpose. This has led to an unsustainable diversion of government funds to sustain a bloated bureaucracy rather than focusing on essential public services. The composition of the team leading this significant reform effort is noteworthy. Both Elon Musk and Vivek Ramaswamy come from private-sector backgrounds and have no prior experience in government bureaucracy. However, as highly successful corporate entrepreneurs, they bring a proven track record of building organizations from scratch and transforming them into success stories.\n\nBy decentralizing power to state and local governments, it would foster greater accountability and responsiveness while empowering communities.\n\nFor instance, Vivek Ramaswamy, born in Cincinnati, Ohio, to Indian immigrant parents, is a biotech entrepreneur and a prominent Republican figure. A Harvard graduate in biology and a Yale Law School alumnus, he founded Roivant Sciences in 2014, spearheading groundbreaking pharmaceutical ventures. Ramaswamy gained national prominence through his criticism of “woke” corporate culture, as outlined in his 2021 book Woke, Inc. Recognized for his conservative principles and innovative thinking, he was appointed by Trump to co-lead DOGE.\n\nHis vision includes reducing the federal workforce by up to 75 percent, abolishing redundant agencies, and implementing eight-year term limits for unelected federal employees to prevent the entrenchment of power. He supports rescinding Executive Order 11246 to shift to a merit-based system and advocates utilizing Schedule F to streamline the removal of “deep-state” actors. These reforms aim to streamline government operations, reduce costs, and ensure a more responsive and meritocratic system.\n\nLike Vivek, Elon Musk is a visionary entrepreneur, engineer, and inventor, known for founding and leading several transformative companies. Born on June 28, 1971, in Pretoria, South Africa, Musk moved to the US to pursue higher education. He earned degrees in physics and economics from the University of Pennsylvania. Musk co-founded Zip2, an online business directory, and PayPal, a digital payments platform, before venturing into ambitious projects like SpaceX, Tesla, Neuralink, and The Boring Company. Through these ventures, Musk has revolutionized industries such as space exploration, electric vehicles, artificial intelligence, and infrastructure, earning a reputation as one of the most influential and innovative leaders of the 21st century.\n\nElon Musk has consistently called for a drastic reduction in federal bureaucracy, advocating for the elimination of redundant agencies and unnecessary regulations. In a November 2024 interview, he proposed cutting the number of federal agencies from 428 to 99, effectively reducing the government by 77 percent. The proposed slicing includes several agencies, including the Department of Education, FBI, ATF, IRS, CDC, and the Nuclear Regulatory Commission. Musk has criticized overlapping responsibilities and entrenched bureaucratic elements, often referred to as the “deep state,” which he believes hinder efficiency and innovation. Comparing excessive regulation to having more referees than players in a game, he emphasizes the need for a streamlined, responsive government that fosters progress.\n\nAccording to the concept, reducing federal bureaucracy by 70 percent to 77 percent can promote self-governance, efficiency, and potential tax reductions. By decentralizing power to state and local governments, it would foster greater accountability and responsiveness while empowering communities to address their unique needs.\n\nMoreover, streamlining operations eliminates redundancies will enhance decision-making agility, and will integrate modern technologies to reduce costs. Savings from reduced expenditures can lower taxes, address national debt, and boost public investment in critical areas like infrastructure and social welfare. This leaner structure would encourage economic growth, reduce dependence on centralized systems, and builds trust in a fiscally responsible government, benefiting both individuals and the private sector.\n\nIn a hypothetical scenario, if the civil and military bureaucracy is reduced by 77 percent, it would generate savings of approximately $815.24 billion, and economic growth would add another $260 billion, the total additional funds available would be $1,075.24 billion annually.\n\nIf this amount is used to reduce taxes for the common people, it could result in a tax reduction of approximately $3,239 per person annually, significantly easing the financial burden on households across the United States, besides the higher growth rate would amplify the benefits of deregulation and tax cuts, driving economic dynamism, fostering business expansion, and enhancing government revenue through increased overall economic activity.\n\nThough the concept and ideal looks great on paper and while reducing bureaucracy would promise cost savings, improved efficiency, and enhanced self-governance, its practical implementation most likely would face significant challenges. Political resistance from entrenched interests, legislative hurdles, and opposition from the bureaucracy itself could impede progress. Downsizing risks substantial job losses, economic disruption, and potential service gaps in critical public functions, including national security.\n\nAdministrative complexities, such as restructuring workflows and maintaining morale among remaining employees, add further difficulties. The anticipated economic growth from deregulation and tax reductions may not materialize quickly, and regional economies dependent on federal jobs could suffer. Legal and ethical concerns, including labor lawsuits and equity issues, also pose significant risks. To succeed, such reforms would require a phased, strategic approach, stakeholder engagement, and meticulous planning to avoid unintended consequences and ensure sustainable outcomes.\n\nThe writer is a former press secretary to the president; former press minister to the Embassy of Pakistan to France and former MD (SRBC).","summary":"The stunning results of the USA elections surprised both Democrats and Republicans alike. Trump&#8217;s unprecedented victory was accompanied by Republican wins in the US Senate and House of Representatives. Before the 2024 elections, Democrats controlled the Senate with 51 seats to Republicans&#8217; 49, while Republicans held a narrow majority in the House with 220 seats [&#8230;]","url":"https://dailytimes.com.pk/1241704/trumps-bureaucracy-cuts/","image":"https://dailytimes.com.pk/assets/uploads/2020/10/no-pic-123.jpg","video":null,"publish_date":"2024-11-22 00:25:07","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","category":"politics","source_country":"pk","sentiment":0.404},{"id":266374590,"title":"Why did Matt Gaetz withdraw as Trump's attorney general pick?","text":"Why did Matt Gaetz withdraw as Trump's attorney general pick?\n Just over a week after President-elect Donald Trump named Matt Gaetz as his intended nominee for attorney general, the now-former congressman has withdrawn his name from consideration for the position. CBS News congressional correspondent Scott MacFarlane has the latest.","summary":"Just over a week after President-elect Donald Trump named Matt Gaetz as his intended nominee for attorney general, the now-former congressman has withdrawn his name from consideration for the position. CBS News congressional correspondent Scott MacFarlane has the latest.","url":"https://www.cbsnews.com/video/why-did-matt-gaetz-withdraw-trumps-attorney-general-pick/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/22/256933e9-b9a3-414f-8df8-d696cc1fe65b/thumbnail/1200x630/22d0ea44f22dfce8126e1c4edbbb6d5b/cbsn-fusion-why-did-matt-gaetz-withdraw-trumps-attorney-general-pick-thumbnail.jpg?v=6056e68389c16974d8d95eeea60b","video":null,"publish_date":"2024-11-22 00:24:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.05},{"id":266374692,"title":"Sen. Bob Casey concedes Pennsylvania Senate race to Republican Dave McCormick","text":"Sen. Bob Casey, D-Pa., on Thursday conceded the race for Pennsylvania's Senate seat to his Republican opponent, Dave McCormick. NBC News projected McCormick's win shortly after Casey's concession. The slim margin of the race had triggered an automatic recount, with results expected to be released Wednesday. \"I just called Dave McCormick to congratulate him on his election to represent Pennsylvania in the United States Senate,\" Casey said in a video on X. \"As the first count of ballot is completed, Pennsylvanians can move forward with the knowledge that their voices were heard, whether their vote was the first to be counted or the last.\" McCormick thanked Casey in a statement, saying Casey has “dedicated his career to bettering our commonwealth.” “I am so honored to represent every single citizen in Pennsylvania in the United States Senate and will fight for you every day,” he added. McCormick had declared victory earlier this month after The Associated Press called the race for him. Casey, though, had held out hope as ballots were counted, even as Republicans criticized him for waiting to concede. With 99.8% of expected votes counted, McCormick had 48.8% of the vote to Casey's 48.6%. The candidates are separated by just over 16,000 votes. McCormick's win pads Republicans' narrow majority in the Senate, which is at 53 seats for the next Congress. His victory could make it easier for President-elect Donald Trump's Cabinet picks to be confirmed. Republicans will control the White House and majorities in both the House and the Senate starting in January.","summary":"Sen. Bob Casey, D-Pa., on Thursday conceded the race for Pennsylvania's Senate seat to his Republican opponent, Dave McCormick.","url":"https://www.nbcnews.com/politics/2024-election/bob-casey-concedes-pennsylvania-senate-race-dave-mccormick-rcna181277","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-11/241121-bob-casey-dave-mccormick-se-640p-cd4b3e.jpg","video":null,"publish_date":"2024-11-22 00:23:55","author":"Megan Lebowitz","authors":["Megan Lebowitz"],"language":"en","source_country":"us","sentiment":-0.021},{"id":266373622,"title":"Matt Gaetz Withdraws as Trump’s Pick for Attorney General","text":"Matt Gaetz, who faced a torrent of scrutiny over allegations of sex trafficking and drug use, abruptly withdrew his bid to become attorney general on Thursday in the first major political setback for President-elect Donald J. Trump since his election this month.\n\nMr. Gaetz has consistently denied the allegations, but his prospective nomination ran into trouble in the Senate, where Republicans were deeply reluctant to confirm someone to run the same Justice Department that once investigated him on suspicion of sex trafficking an underage girl, even though no charges were brought.\n\nThe collapse of Mr. Gaetz’s prospective candidacy just 16 days after the election appeared to be the earliest such failed cabinet pick in modern history and underscored the haphazard way that Mr. Trump has gone about assembling his new administration. He picked Mr. Gaetz almost on a whim last week without extensive vetting, knowing that allegations were out there, but essentially daring Senate Republicans to accept him anyway.\n\nMr. Trump moved quickly to replace Mr. Gaetz with another conservative favorite. By the day’s end, he announced on social media that he planned to nominate Pam Bondi, the former attorney general of Florida and one of his defense lawyers in his first impeachment trial, to be U.S. attorney general.","summary":"Mr. Gaetz has consistently denied the allegations of sexual misconduct and drug use, but his prospective nomination ran into trouble in the Senate.","url":"https://www.nytimes.com/2024/11/21/us/politics/matt-gaetz-withdraws-trump-attorney-general.html","image":"https://static01.nyt.com/images/2024/11/21/multimedia/21trump-header-jvqc/21trump-header-jvqc-facebookJumbo-v2.jpg","video":null,"publish_date":"2024-11-22 00:22:49","author":"Jonathan Swan,Maggie Haberman","authors":["Jonathan Swan","Maggie Haberman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.229},{"id":266372518,"title":"Biden jokes, dribbles basketball as he hosts NBA champs in first event since turning 82: ‘You’re Celtics, right?’","text":"WASHINGTON — Retiring President Biden appeared in public Thursday for the first time since turning 82 — jokingly asking the NBA championship-winning Boston Celtics to confirm “you’re Celtics, right” in brief public remarks before dribbling a basketball in front of a crowd. \n\nBiden, who notched another presidential age record with his birthday Wednesday, spoke for about 5 minutes on the South Lawn as he hosted members of the team — and scandal-plagued first son Hunter Biden, 54, was spotted in the crowd.\n\n“Welcome to the White House. I didn’t know any of these guys behind me, but they just showed up. I don’t know where the hell they came from,” Biden opened, referring to members of the team arrayed behind his lectern.\n\n“2024 NBA champions the Balls — you’re Celtics, right?” he went on, turning around. “The Boston Celtics.”\n\nIt’s unclear if Biden was attempting to make a joke about the perception of his fading mental acuity, over which fellow Democrats forced him to relinquish the Democratic presidential nomination in July in favor of Vice President Kamala Harris, who went on to lose the Nov. 5 election.\n\nBiden told the 18-title-winning team that his Secret Service name is also “Celtic” — calling himself an “an old Irish Celtic,” referring to his ancestry in the British isles. \n\nThe Biden family’s other code names also begin with “C” — with Hunter, who is awaiting sentencing for gun and tax crimes, known as “Chieftain.”\n\nIt’s unclear if the outgoing president will pardon his son before leaving office on Jan. 20.\n\nBiden, who just returned Tuesday night from a nearly weeklong South America tour where he repeatedly snubbed the press, again took no questions from journalists Thursday.\n\nBiden’s silence has roiled the press — as he continues to remain mum on his decision to allow Ukraine to use US rockets far inside of Russia and about President-elect Donald Trump’s transition, which he claimed earlier this year posed the risk of ending American democracy.\n\nThe lame-duck president, however, worked the rope line and posed for a number of selfies after being presented with a gifted Celtics jersey bearing his name.\n\nOne spectator tossed him a basketball, which he dribbled on the White House’s driveway while smiling before returning inside.","summary":"WASHINGTON — Retiring President Biden appeared in public Thursday for the first time since turning 82 — jokingly asking the NBA championship-winning Boston Celtics to confirm &#8220;you&#8217;re Celtics, right&#8221; in brief public remarks before dribbling a basketball in front of a crowd. Biden, who notched another presidential age record with his birthday Wednesday, spoke for...","url":"https://nypost.com/2024/11/21/us-news/biden-jokes-dribbles-basketball-as-he-hosts-nba-champion-celtics/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/11/94093328.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/RcJanhGU-RyIcpnTz.mp4","publish_date":"2024-11-22 00:21:56","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","source_country":"us","sentiment":-0.362},{"id":266375102,"title":"As ABC staff ‘gobsmacked’ over RN shakedown, Kim Williams lectures on ethical leadership","text":"While the changes to the ABC’s 2025 Radio National line-up reverberated around Ultimo on Thursday, Kim Williams addressed a group of business leaders in the broadcaster’s headquarters on the issue of ethical leadership. \n\nThe ABC was rocked on Thursday by the news that ABC Sydney Mornings host Sarah Macdonald, along with weekend presenter Simon Marnie, didn’t have their contracts renewed. Former Seven and Ten presenter Chris Bath was also announced as the replacement for Drive presenter Richard Glover. \n\nCurrent and former ABC figures took to social media, with outgoing Media Watch host Paul Barry describing Macdonald as “one of the best things on radio”, while former ABC reporter Emma Alberici said she was “utterly gobsmacked”. \n\nCrikey understands Macdonald’s departure came as a shock to staff at the ABC, with an ABC staffer telling Crikey morale was “at an all-time low”, given Macdonald and Marnie’s status as “two of the most loved members of staff”. Tears were said to have flowed in Ultimo as news of Macdonald’s departure circulated.\n\nWhile giving the Vincent Fairfax Oration for the Cranlana Centre for Ethical Leadership (of which he is a former chair) on Thursday night Williams referenced historian Timothy Snyder’s book On Tyranny in underlining the importance of professional ethics. \n\nWilliams, in passing, took a veiled swipe at the “string of scandals relating to the conduct and ethics of large, prominent, respectable Australian enterprises, led by highly-compensated professionals, ranging from management consulting firms to leading banks, from aviation to big supermarkets”. \n\n“We might also note that these scandals have rarely affected the public reputations and careers of those involved, certainly not in any meaningful way. It’s as if these acts of malfeasance are relatively harmless,” Williams said. \n\nA Q&A session following the address, however, brought the issue of the day to the fore. \n\nModerator Matt Beard warned the audience (filled with high-society members of the Fairfax and Myer families) ahead of time that long-winded comments or questions on the management of the ABC were welcome to be aired elsewhere, appearing to anticipate that the news of Macdonald’s departure may raise prickly questions for Williams. \n\nInstead of having to face the music on staff movement at the national broadcaster, Williams instead fielded questions about the US election and whether there were lessons to take from Republican Donald Trump’s victory.\n\n“First is that there was a peaceful transition from one side of politics to the other … and the Democratic side of politics will do that gracefully and constitutionally. I would assert that was not what happened when Joe Biden won the election,” Williams began. \n\n“I think it’s also a very useful lesson in the power of words and the power of fear, and I would encourage people to look as objectively as possible at all of the contributing factors that resulted in the election of President-elect Trump. I would not be truthful with you if I did not pass comment on the fact that clearly, there were many known, prosecuted lies on an industrial scale in that election, and we should all take note of that.” \n\nAnother question on the US election prompted Beard to steer questions back to the content of Williams’ speech. One question about how deeper issues can be tackled in an age of attention deficits and short-form journalism prompted Williams to wax lyrical about the golden age of the app once known as Twitter. \n\n“It’s very clear to me that the majority of people who had views about the product once known as Twitter rarely used it and did not understand it, because the majority of tweets were in fact not 140-character offerings [but] … links to other things … a wide variety and diversity of articles, scholarly papers, independent journalistic offerings. It was one of the first promoters of independent, user-generated, serious journalism. And that’s certainly what happened during the Arab Spring,” Williams said. \n\n“I think X is just a running sewer of rubbish, but Twitter was actually an enormously compelling place, and it was predominantly giving access to a very wide variety of deep thinking … and it was a very democratic space … I actually found that quite addictive, and became a big user of Twitter,” he said. \n\nWilliams is due to address the National Press Club in Canberra on November 27. \n\nHave something to say about this article? Write to us at letters@crikey.com.au. Please include your full name to be considered for publication in Crikey’s Your Say. We reserve the right to edit for length and clarity.","summary":"ABC chair Kim Williams got to avoid curly questions on a day when Aunty was rocked by major departures. \n\n\nThe post As ABC staff &#8216;gobsmacked&#8217; over RN shakedown, Kim Williams lectures on ethical leadership appeared first on Crikey.","url":"https://www.crikey.com.au/2024/11/22/abc-radio-national-kim-williams-sarah-macdonald/","image":"https://www.crikey.com.au/wp-content/uploads/2024/11/kim.jpg?quality=70","video":null,"publish_date":"2024-11-22 00:21:41","author":"Daanyal Saeed","authors":["Daanyal Saeed"],"language":"en","source_country":"au","sentiment":0.012},{"id":266374630,"title":"Should pro-lifers be concerned about RFK Jr.’s history?","text":"As Donald Trump’s pick for health and human services secretary, Robert F. Kennedy Jr. has allowed many high-powered profiteers to put a target on his back. His plans to clean up the agencies overseen by HHS are certainly at odds with the Deep State’s plans. As such, he is exhibiting tremendous courage by putting himself in this dangerous position, considering his family’s history of assassination.\n\nAfter all, the HHS secretary appoints the director of health agencies, like the FDA, the CDC, etc. This is not a token position; it is an extremely influential one.\n\nThe Deep State continues to attempt to deep-six evidence of the overreach, corruption and criminality that has become insidious in these organizations. RFK Jr. represents someone who will bring all of it to light. The fact state-run media, state-run pundits and federal bureaucrats are bristling at this nomination is a good sign. Big Pharma is said to be the biggest lobby in Washington, D.C. Both sides of the aisle have been bought off and misinformed.\n\nVarious groups spent a record $4.2 billion in 2023 on lobbying federal lawmakers. According to OpenSecrets, the pharmaceutical and health products sector spent the most at both the federal and state levels, trying to influence elected officials.\n\nWhat about RFK’s stance on abortion?\n\nKennedy’s position on abortion is not confirmed. He has indicated he favors abortion bans, and he doesn’t favor abortion bans. He is going to Washington to Make America Healthy Again (MAHA), not to support killing human beings in the womb.\n\nI suspect that he is personally against abortion. He is Catholic and acknowledges the human baby in the womb is susceptible to many of the health risks currently facing babies born today. Political messages have been confusing because he is not for abortion but was seeking financial support from Democrat donors.\n\nOpen-minded\n\nRFK Jr. has been surrounded by “choice” his whole life and has heard little sentiment from pro-life advocates. He has shown to be open-minded when he confessed that he believed the negative view of Trump for a long time, but came to understand these as lies. In a recent episode of the Joe Polish Show, Kennedy and Calley Means discussed their plans to Make America Healthy Again. Here are some excerpts of Kennedy in his own words:\n\n“I shared the same kind of contempt and disdain for President Trump that most liberal Democrats felt because we’ve been propagandized. … I believed all the, um, all the defamations about him. … I believe now that he is really a great man.”\n\nIn the Trump administration, RFK Jr. will be surrounded by Christian pro-life conversation. This will seep into his open mind. He will then move away from a “right to choose” position to a “right to life” position.\n\nIn the interview, Kennedy states that he is in the 12-step recovery for alcohol and practices prayer and meditation daily. The right to life discussions will find fertile ground for growth during this daily practice.\n\nChemical abortion pill abuses at the FDA\n\nRFK Jr. is aware of corruption at the FDA and is committed to addressing it. This includes investigating abuses by FDA bureaucrats who may have conflicts of interest due to ties with pharmaceutical companies. His outspoken criticism of the FDA’s handling of vaccines is well-known, and I believe his moral and scientific focus will extend to the issue of chemical abortion pills (RU-486).\n\nAs director of Children’s Health Defense, RFK Jr. has been an advocate for vaccine safety, criticizing their toxic ingredients and lack of safety testing. The National Childhood Vaccine Injury Act (NCVIA) of 1986 granted vaccine manufacturers a blanket liability waiver, allowing vaccines to continue development without facing financial penalties for injuries. RFK Jr. became involved in the vaccine debate after learning about mercury toxicity from environmental cases, which led him to investigate the potential link between vaccines, mercury and autism.\n\nThe issue of chemical abortion pills is similarly concerning. The FDA approved these drugs despite known risks to women’s health, and during the COVID-19 pandemic, regulations were relaxed, allowing the pills to be prescribed without an in-person exam. This made it easier for anyone to obtain them online, sometimes leading to dangerous situations such as sex trafficking, where male partners force women to take the pills without their consent. With no follow-up required, women often end up in the emergency room due to incomplete abortions, hemorrhaging and toxicity. Although these pills were initially recommended for use only up to eight weeks, they are now regularly prescribed up to 10 weeks or more, often without a doctor’s consultation.\n\nKennedy is committed to public health and could potentially act to reform policies around chemical abortion pills, both for women’s safety and environmental protection. He has significant experience fighting water pollution and could work with pro-life groups to address the environmental impact of chemical abortion waste. In 2024, the Guttmacher Institute reported that 63% of U.S. abortions were chemical, and Planned Parenthood noted that nearly 70% of its abortion patients choose the pill. There is growing concern about the environmental dangers posed by the drugs in water systems. Groups like Students for Life of America are calling for legal action to prohibit chemical abortion drugs in water, citing the federal Clean Water Act as a potential tool to regulate this issue.\n\nAdditionally, RFK Jr. may also become aware of the ethical concerns surrounding taxpayer-funded NIH fetal tissue research. Many see this as morally wrong, and should he learn the full extent of this research, he may take a stance against it, particularly if he is exposed to information from pro-life sources in the Trump administration.\n\nThen there is the matter of surgical abortion wastewater.\n\nAs a leader committed to both environmental and public health, RFK Jr., as HHS secretary, has an opportunity to address the abuses associated with chemical abortion pills, environmental contamination and unethical fetal tissue research.","summary":"'The fact state-run media ... are bristling at this nomination is a good sign'","url":"https://www.wnd.com/2024/11/should-pro-lifers-be-concerned-about-rfk-jr-s-history/","image":"https://www.wnd.com/wp-content/uploads/2024/06/rfk-jr-robert-f-kennedy-jpg.jpg","video":null,"publish_date":"2024-11-22 00:21:32","author":"Cecily Routman","authors":["Cecily Routman"],"language":"en","source_country":"us","sentiment":-0.082},{"id":266372808,"title":"Jeff Bezos gives three-word response to Elon Musk's claim he predicted Trump would lose","text":"Jeff Bezos gives three-word response to Elon Musk's claim he predicted Trump would lose\n\nREAD MORE: Elon Musk applauds Bezos' Washington Post op-ed as long standing feud between billionaires appears to thaw \n\nBy STEPHEN M. LEPORE FOR DAILYMAIL.COM\n\nPublished: 00:20 GMT, 22 November 2024 | Updated: 00:21 GMT, 22 November 2024\n\nJeff Bezos clapped back at Elon Musk after the Donald Trump ally claimed the Amazon founder told people the president-elect 'would lose for sure' and should sell all Tesla and SpaceX stock.\n\nMusk and Bezos have had a contentious rivalry over the years as they've flipped between being the richest and second-richest men on the planet. \n\nOn Thursday, Musk posted to X: 'Just learned tonight at Mar-a-Lago that Jeff Bezos was telling everyone that @realDonaldTrump would lose for sure, so they should sell all their Tesla and SpaceX stock so they should sell all their Tesla and SpaceX stock.' \n\nBezos quickly, succinctly responded: 'Nope. 100% not true.'\n\nMusk was then quickly deferential in the replies: 'Well, then, I stand corrected.'\n\nBezos had not tweeted at any point since his post congratulating Trump on his election victory.\n\n'Big congratulations to our 45th and now 47th President on an extraordinary political comeback and decisive victory. No nation has bigger opportunities. Wishing [Trump] all success in leading and uniting the America we all love,' he wrote November 6.\n\nIt continued a series of overtures Bezos has made toward the president after the Washington Post declined to endorse a candidate in the race, though its since been clarified that Bezos did not make that decision. \n\nJeff Bezos clapped back at Elon Musk after the Donald Trump ally claimed the Amazon founder told people the president-elect 'would lose for sure' and should sell all Tesla and SpaceX stock\n\nHe may need a good relationship with Musk to continue those peace offerings as the multi-hyphenate begins his work as Trump's Department of Government Efficiency (DOGE) co-chair. \n\nBezos and Musk have had an occasionally contentious rivalry over the past two decades, with Bezos skeptical of Musk's plan to colonize Mars and Musk saying Amazon should be broken up. \n\nThe rivalry goes back to 2004 when Bezos accepted an invite from Musk to tour the SpaceX facility.\n\nAfterwards he received a 'somewhat curt email' after from Musk 'expressing annoyance' why Bezos hadn't invited Musk to Blue Origin in Seattle, so Bezos promptly did.\n\nBut on the tour Bezos was taken aback when Musk started telling him how to run the company.\n\nMusk said: 'Dude we tried that and that turned out to be really dumb so I'm telling you, don't do the dumb thing we did'.\n\nBezos thought Musk was 'a bit too sure of himself' given he hadn't actually launched a rocket yet, Walter Isaacson wrote about the duo.\n\nIn another book written about the pair, Musk claims Bezos shafted him when both Bezos' Blue Origin and SpaceX were beginning.\n\nMusk and Bezos have had an occasionally contentious rivalry over the years as they've flipped between being the richest and second-richest men on the planet\n\n'I actually did my best to give good advice, which he largely ignored,' Musk said. \n\nElon Musk applauds Bezos' Washington Post op-ed as long standing feud between billionaires thaws\n\nThe next known public spat between the pair was when Blue Origin protested SpaceX's ability to use a NASA launchpad exclusively, which Musk categorized as a 'phony tactic'\n\nHe then went off on Bezos' space company as a whole. \n\n'[Blue Origin] has not yet succeeded in creating a reliable suborbital spacecraft, despite spending over 10 years in development,' he said. \n\n'If they do somehow show up in the next five years with a vehicle qualified to NASA's human rating standards that can dock with the Space Station, which is what Pad 39A is meant to do, we will gladly accommodate their needs.'\n\nHowever, he clarified: 'I think we are more likely to discover unicorns dancing in the flame duct.' \n\nMuch of Musk's issues with Bezos have had to do with Blue Origin, as he's criticized their hiring practices and attempts to patent technology that already exists, according to Business Insider. \n\nSpace News reported that SpaceX has an email filter that gets rid of the words 'blue' and 'origin.'\n\nBezos and Musk have had an occasionally contentious rivalry over the past two decades, with Bezos skeptical of Musk's plan to colonize Mars and Musk saying Amazon should be broken up\n\nWhile the feud has largely been one-sided in public, Bezos slammed Musk's dream of colonizing Mars in 2019, calling it 'un-motivating.'\n\n'Go live on the top of Mount Everest for a year first and see if you like it, because it's a garden paradise compared to Mars,' he said.\n\nIn the 2020s, Blue Origin and SpaceX have battled over NASA contracts.\n\nBlue Origin filed a 2021 lawsuit against NASA, claiming a $2.9 billion lunar lander contract was unfairly awarded to SpaceX earlier that year.\n\nThe suit 'challenges NASA´s unlawful and improper evaluation of proposals.'\n\nBlue Origin was originally in competition with SpaceX and a third firm called Dynetics for what was expected to be two NASA contracts. \n\nIn response, Elon Musk rolled his fellow multibillionaire Bezos, tweeting he 'can't get it up (to orbit).'\n\nMusk has criticized Amazon, saying it 'should be broken up' and that Bezos 'takes himself a little too seriously.'\n\nWhile Musk is a massive Trump supporter and has been out on the campaign trail giving away $1million a day to newly registered voters who will pledge their support for the former president, Bezos has been more of a thorn in Trump's side\n\nIndeed, when Trump first ran for president , he began to threaten how Amazon and Jeff Bezos would pay the price\n\nHe further fueled the antagonism with Bezos with a 2021 interview in which he praised Bezos for having 'reasonably good engineering aptitude' but he said he didn't spend enough time on the details.\n\nMusk mocked Bezos' wealthy lifestyle and compared it to him living in rented quarters in Texas.\n\nElon said: 'In some ways I'm trying to goad him into spending more time at Blue Origin so they make more progress. He should spend more time at Blue Origin and less time in the hot tub'.\n\nWhile Musk is a massive Trump supporter and has been out on the campaign trail giving away $1million a day to newly registered voters who will pledge their support for the former president, Bezos has been more of a thorn in Trump's side. \n\nIndeed, when Trump first ran for president, he began to threaten how Amazon and Jeff Bezos would pay the price. \n\n'If I become president — oh, do they have problems. They're going to have such problems,' he warned. \n\nTrump was particularly aggrieved at Bezos's ownership of the Washington Post.\n\nHe would rage at what he called the 'Amazon Washington Post,' claiming spuriously that it had avoided 'internet taxes.' \n\nDuring his time in office Trump became 'obsessed' with retribution against Bezos for the Post's negative coverage of him.\n\nRecently, it appeared there was another brief peace when Musk praised Bezos for defending the Washington Post over his paper's decision not to endorse Kamala Harris or Trump \n\nMusk wrote, 'kudos to @JeffBezos' while retweeting an earlier an earlier tweet that read, 'Kudos to @JeffBezos for telling the newsroom the hard, bitter truth: there's nothing wrong with the readers\n\n'Every hour, we're getting calls from reporters from the Washington Post asking ridiculous questions,' he ranted in once instance. 'And I will tell you: This is owned as a toy by Jeff Bezos, who controls Amazon. Amazon is getting away with murder, taxwise. He's using the Washington Post for power.'\n\nDuring the Trump administration, Amazon sued the government after alleging it had blocked a $10 billion cloud-computing-services contract with the Pentagon over the then-president's ire about coverage in the Post.\n\nYet throughout the Trump presidency, Bezos resolutely supported the staff's coverage and he has not interfered with reporting on his own business interests or personal life.\n\nBezos, in turn, criticized Musk's $44 billion purchase of Twitter: 'Did the Chinese government just gain a bit of leverage over the town square?' \n\nHe did clarify his position: 'My own answer to this question is probably not. The more likely outcome in this regard is complexity in China for Tesla, rather than censorship at Twitter.'\n\n'But we'll see. Musk is extremely good at navigating this kind of complexity,' Bezos added. \n\nBezos gave some clearer thoughts on Musk in an interview with Lex Friedman in 2023.\n\n'I don't really know Elon very well. I know his public persona but I also know you can't know anyone by their public persona - it's impossible. You may think you do, but I guarantee you don't.'\n\nHe complimented Musk as someone who 'must be a very capable leader' and didn't disagree with suggestions the two were similar. \n\n'I agree with you and I think with a lot of these endeavors we're very like-minded. So I think, I'm not saying we're identical, but we're very like-minded so I love that idea.'\n\nRecently, it appeared there was another brief peace when Musk praised Bezos for defending the Washington Post over his paper's decision not to endorse Kamala Harris or Trump.\n\nBezos said that political endorsements 'create a perception of bias' and argued ending the long-running practice of endorsing a candidate for the White House was a 'principled decision, and it's the right one.'\n\n'Presidential endorsements do nothing to tip the scales of an election. No undecided voters in Pennsylvania are going to say, 'I'm going with Newspaper A's endorsement.' None,' he wrote. \n\nIn response, writing on X, Musk wrote, 'kudos to @JeffBezos' while retweeting an earlier tweet that read, 'Kudos to @JeffBezos for telling the newsroom the hard, bitter truth: there's nothing wrong with the readers.'\n\nElon MuskAmazonSpaceXTeslaJeff Bezos\n\nShare or comment on this article:\nJeff Bezos gives three-word response to Elon Musk's claim he predicted Trump would lose\n\nAdd comment","summary":"Jeff Bezos clapped back at Elon Musk after the Donald Trump ally claimed the Amazon founder told people the president-elect 'would lose for sure' and should sell all Tesla and SpaceX stock.","url":"https://www.dailymail.co.uk/news/article-14112175/jeff-bezos-responds-elon-musk-claim-trump-defeat.html","image":"https://i.dailymail.co.uk/1s/2024/11/22/00/92352889-0-image-a-4_1732234414242.jpg","video":null,"publish_date":"2024-11-22 00:21:23","author":"Editor,Stephen M. Lepore","authors":["Editor","Stephen M. Lepore"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.206},{"id":266372338,"title":"Singapore expects 1-3% GDP growth in 2025 amid Trump worries","text":"SINGAPORE -- Singapore's economy is expected to grow 1% to 3% in 2025, officials said Friday, slower than this year as uncertainties loom, with Donald Trump returning to the White House in January and planning to impose steep import tariffs.\n\n\"Turning to 2025, overall GDP growth in Singapore's key trading partners is expected to ease slightly from 2024's level,\" the Trade and Industry Ministry said in a media release. \"In Asia, China's GDP growth is projected to moderate in line with weaker exports growth due to already-announced tariff hikes.\"","url":"https://asia.nikkei.com/Economy/Singapore-expects-1-3-GDP-growth-in-2025-amid-Trump-worries","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F0%2F9%2F5%2F48595900-4-eng-GB%2FCropped-17321688752023-01-27T103853Z_207526129_RC2OYY97PL","video":null,"publish_date":"2024-11-22 00:20:31","author":"Dylan Loh","authors":["Dylan Loh"],"language":"en","source_country":"jp","sentiment":-0.257},{"id":266374626,"title":"Our Sherpa media: Shocked by voters’ different path","text":"Jacob Bronowski, the celebrated Polish-British philosopher best known for his 1973 documentary series aired on the BBC, “The Ascent of Man,” described a fascinating feature of Nepal’s Sherpa people. Living high in the Himalayas, Sherpas naturally became skillful mountaineers, serving as guides for early Everest expeditions, including Sir Edmund Hillary, first to reach the summit on May 29, 1953.\n\nThe Sherpas, despite possessing intimate knowledge of the mountain, knew the face of Everest only from the familiar perspective of their homes. When first shown pictures of Mount Everest from other vantage points many, even among the most seasoned guides, expressed shock, hardly able to believe their eyes. \n\nWrote Bronowski, “Their disbelief changed to amazement when they realized that something with which they were so familiar could have other sides to it.” \n\nSounds to me very much like today’s mainstream media, shocked that their preferred narratives aren’t universally trusted as the only paths – and themselves as the only accredited guides along those paths – to the summit of cultural and political truth.\n\nConservatives employ many descriptors for traditional news organizations. “Mainstream” media. “Legacy” media. “Establishment” media. “Regime” media. \n\nToday, I add a new word to the lexicon of adjectives describing media bias – Sherpa media. America’s Sherpa media, by my definition, describes the unquestionably skilled, and equally unquestionably biased, cadre of once-trusted guides to cultural and political opinion. \n\nOur Sherpa media, once trusted as expert guides to the summit of truth, has now self-righteously hunkered down, satisfied with their narrow vantage point of observation, urging Americans to follow them along the paths of their agreed upon narratives.\n\nThat’s why, in the wake of Trump’s landslide victory and assumed mandate, our Sherpa media are in a state of shocked disbelief that Americans have discovered new and more trustworthy guides to lead them to the summit of the political Mount Everest that is Donald J. Trump and the MAGA movement.\n\nThere can be no denying that Trump has proven himself a Mount Everest figure in American politics, a point driven home last weekend by Sylvester Stallone at a Mar-a-Lago victory celebration, asserting that Trump, after accomplishing his political resurrection, now owns mythological status.\n\nHow dismayed must our once-trusted Sherpa media guides be to realize the truth of what “Rocky” himself claimed for Trump, haunted at imagining Trump’s rock-faced addition to Mt. Rushmore.\n\nThat our Sherpa media have lost the respect and trust of the American people is glaringly obvious, precisely because they are manifestly blind to other perspectives than their own, therefore mystified to learn that Americans living on the other side of Mount MAGA could see differently and discover alternative paths to the summit.\n\nBut see differently they most surely do, as evidenced by over 80% of American counties shifting to the right on Election Day 2024, even in urban and decidedly leftist enclaves. \n\nThe voters have made it clear that they are ready to hire new guides, leaving the Sherpa media fuming while spewing their condescending attitude toward Americans as they claim superior knowledge of Trump as a danger to American democracy. “If only conservatives would open their eyes and let us guide them to the peak of truth.”\n\nHow, though, could Americans ever trust again our Sherpa media, having followed them through the last decade of Trump-dominated news cycles down one dead-end path after another? Russian collusion. The “fine people” hoax. The “inject bleach” hoax. The Blinken-inspired lies of 51 former intelligence experts on Hunter’s laptop. The Mar-a-Lago raid and other lawfare expeditions of a weaponized Justice Department. \n\nOur Sherpa media sought to guide Americans along all these, and many more, as paths to truth, despite Americans’ clear-eyed conclusion that the Biden administration had embarked on a dangerous path that, fat from leading the public to truth, exposed the utter corruption of those in power. \n\nWith each one of these lies (and many more, by which our Sherpa media led the public deep into paths with no exit) a greater number of Americans abandoned their once-esteemed media guides. \n\nWith greater numbers of news consumers in these post-election days departing from “Old” news sources like ABC, NBC, MSNBC, CNN, etc., Americans are openly declaring their liberation from fear of being labeled racists, misogynists, fascists, uneducated and, to use Biden’s latest slur, garbage.\n\nSherpa media bias sent Americans on a quest for other guides and, on the other side of Mount MAGA, such guides have been found, and are reaping the rewards.\n\nToday, those having fired the Sherpa media are ascending Mount MAGA with swagger, as deliciously displayed in the end-zone Trump-dance celebrations by NFL athletes. (Shout out here to the Babylon Bee’s headline from Tuesday alongside an image of Hitler posed as if doing the Trump dance, “Newly Unearthed Video Shows Hitler Did the Trump Dance”).\n\nOpinions once whispered softly and only to pro-Trump friends, lest they be discovered and labeled racist, are now spoken openly, without fear. How could they be labeled as racist now, when Republican support among blacks, Hispanics and (drum roll, please) Native Americans has increased to highs previously unknown? Native Americans voted 65% for Trump, topping even white America’s 57%! \n\nConservatives are following the new paths to the summit of Mount MAGA with a plenteous supply of oxygen and abundant energy, knowing that the dart of the racist accusation has been forever been blunted. \n\nConservatives have always known themselves and the American people to be other than the race hustlers have sought to convince them they are, as in, for example, Project 1619 and “White Fragility.” Conservatives are ready at last to dismiss the alphabet paths of CRT and DEI – these the preferred routes of the Sherpa media to guide the disgusting racists of America to the pinnacle of racial truth.\n\nConservatives in the post-election euphoria of Trump’s landslide victory find themselves unburdened by what has been (thanks for the line that keeps on giving, Kamala), deliciously mocking our Sherpa media as they continue to guide along the old paths to their increasingly dwindling audiences.","summary":"'Trump has proven himself a Mount Everest figure in American politics'","url":"https://www.wnd.com/2024/11/our-sherpa-media-shocked-by-voters-different-path/","image":"https://www.wnd.com/wp-content/uploads/2024/11/sherpa-mt-everest-unsplash.jpg","video":null,"publish_date":"2024-11-22 00:16:53","author":"Siegfried Johnson","authors":["Siegfried Johnson"],"language":"en","source_country":"us","sentiment":0.274},{"id":266372860,"title":"America's allies in Syria hope they can sway Trump's decisions about US troops there","text":"For almost a decade, US troops have been on the ground in Syria to assist Kurdish-led forces in the defeat of the infamous Islamic State. These forces tamp down on the ISIS remnants in the northern and eastern regions they presently control, where tens of thousands of captured ISIS fighters, their families and suspected affiliates remain in open-air camps and prisons.But there's a new wrinkle of uncertainty in this highly volatile and contested region: US President-elect Donald Trump.During his first term, Trump ordered the withdrawal of US troops partnered with the Kurdish-led Syrian Democratic Forces after ISIS' territorial defeat. Trump did this following a phone call with the president of Turkey, a staunch rival of the SDF, resulting in an immediate cross-border Turkish operation against those US-allied forces. Trump then backtracked and kept 900 US troops in Syria.His imminent return to the Oval Office once again raises the specter that the US could pull out, leaving a power vacuum that Turkey, the Syrian regime, and Russia may move to fill at the SDF's expense. The resulting instability could be an opening for ISIS to regroup. Turkish officials want the US to leave, with the incumbent defense minister stating, \"Trump will strongly focus on this.\" But the Kurds hope they can persuade him otherwise.\"We formed a successful alliance with the United States in combating terrorism,\" Sinam Mohamad, the representative of the Syrian Democratic Council mission to the United States and a top diplomat of the Autonomous Administration of North and East Syria, told Business Insider.\"We may have felt frustrated during Trump's first term due to his decision to withdraw American forces from Syria in 2019,\" Mohamad said. \"But today, as a result of the political circumstances in the Middle East and the world, we see that President Trump will have a different outlook than before.\"The AANES administrates large swathes of north and east Syria under the SDF's control.The regime of Syrian President Bashar al-Assad, which is backed by Russia, does not recognize the AANES. Turkey vehemently opposes it, claiming the SDF has inextricable ties to its main adversary, the Kurdistan Workers' Party, or PKK. Turkish strikes against AANES infrastructure have cut off water and electricity to over a million people, leading to charges that Turkey is violating international law.\"The incoming Trump administration has an opportunity to reconfigure the entire US strategy in Syria, maintain its minimal but high-rewards troops presence in Syria, and proceed with a bold vision to mend fences between Syrian Kurds and Ankara,\" Mohammed A. Salih, a non-resident senior fellow in the Foreign Policy Research Institute and an expert on Kurdish and regional affairs, told BI.\"The focus should be on a win-win outcome for all sides, America, Kurds, and Turkey.\"Some called for a US withdrawal after the January drone attack against a US base in Jordan that supports operations in Syria, killing three Americans and injuring 47.The specific timing of any American withdrawal will also be a critical factor.\"The American withdrawal from Syria may take place in 2026 or before that, but what will be different are the circumstances that will accompany this withdrawal,\" the SDC's Mohamad said. \"It may take into account the dangers facing the areas of the autonomous administration and Washington's allies in the fight against terrorism, and at that time, it is necessary to ensure the withdrawal with political security for the region.\"The official underlined the continued importance of the American presence for ensuring \"the continuation of the fight against terrorism\" and that the SDF can continue securing the \"large number of prisoners of the terrorist organizations languishing\" in AANES detention.The Kurds have thousands of former ISIS fighters in its camps and detention centers. The sprawling Al-Hol camp has a population of over 40,000, including thousands of ISIS women and children, a number of whom remain radicalized. It has warned that another Turkish invasion would divert SDF fighters and resources away from securing these facilities.\"The Syrian Democratic Forces have the qualifications to secure these facilities,\" said Mohamad, the Kurdish diplomat. \"But they will not be able to perform their duty to the fullest extent if the withdrawal occurs without political security for the region's situation.\"Mohamad stressed that AANES and SDF would want American guarantees that Turkey will not invade after a US withdrawal.\"A sudden troop withdrawal could probably result in even more disastrous outcomes than in Afghanistan, given the presence of various regional and global powers in Syria and the resurgence of ISIS and other jihadi groups there,\" said Salih, the FPRI regional expert.\"In all likelihood, the situation will be highly chaotic in the event of a withdrawal with serious consequences that could witness the mass escaping of ISIS prisoners, likely more radicalized and resentful as a result of their prison experience,\" Salih added.While weakened from years of war, ISIS has already demonstrated its capability to regroup and threaten their adversaries. A coordinated ISIS jailbreak attempt in 2022 led to almost two weeks of heavy fighting with the SDF.A rapid US withdrawal tips the uneasy balance of powers. Salih anticipates this could lead to \"a hectic race\" between Iran, Russia, the Syrian regime, and Turkey for the resource-rich AANES regions.\"All the problems we suffer from in the regions of North and East Syria are related to the necessity of placing our region within the international solution platforms related to Syria, political support, and finding a solution to the Syrian crisis with the participation of the Autonomous Administration and the Syrian Democratic Council in the political process,\" Mohamad said.\"This will have a major impact in changing the shape of the region, reducing hotbeds of tension, and ensuring global security and peace.\"Paul Iddon is a freelance journalist and columnist who writes about Middle East developments, military affairs, politics, and history. His articles have appeared in a variety of publications focused on the region.","summary":"US troops have been in Syria since 2015 to counter ISIS. But President Trump's return adds new uncertainty to the highly volatile region.","url":"https://www.businessinsider.com/us-troops-military-in-syria-trump-isis-2024-11","image":"https://i.insider.com/673f731f9f2901eb60362907?width=1200&format=jpeg","video":null,"publish_date":"2024-11-22 00:16:02","author":"Paul Iddon","authors":["Paul Iddon"],"language":"en","category":"politics","source_country":"us","sentiment":-0.281},{"id":266375144,"title":"Trump picks his ex-impeachment defense lawyer to replace Gaetz as AG nominee","text":"Hours after his pick for attorney general removed himself from consideration, Donald Trump announced his replacement pick on Truth Social: former Florida Attorney General Pam Bondi.\n\n\"I am proud to announce former Attorney General of the Great State of Florida, Pam Bondi, as our next Attorney General of the United States,\" wrote Trump. \"Pam was a prosecutor for nearly 20 years, where she was very tough on Violent Criminals, and made the streets safe for Florida Families. Then, as Florida’s first female Attorney General, she worked to stop the trafficking of deadly drugs, and reduce the tragedy of Fentanyl Overdose Deaths, which have destroyed many families across our Country. She did such an incredible job, that I asked her to serve on our Opioid and Drug Abuse Commission during my first Term — We saved many lives!\"\n\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans - Not anymore,\" Trump continued. \"Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again. I have known Pam for many years — She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!\"\n\nTrump did not mention in his announcement that Bondi also served as one of his defense attorneys during his first impeachment trial, where he was accused of abuse of power and obstruction of Congress in his effort to try to extort Ukrainian President Volodymyr Zelenskyy into announcing an \"investigation\" of Joe Biden's family.\n\nBondi also faced controversy for shutting down a state probe of Trump University, which authorities said falsely claimed to offer education, but actually sought to upsell students to more expensive programs. Bondi's decision came around the same time a political group linked to her accepted a $25,000 campaign donation from the Trump Foundation.\n\nShe also worked for a lobbyist for Qatar at the same time she was representing Trump's defense, according to the book, \"The Big Cheat\"by David Cay Johnston\n\nTrump's original pick for attorney general was former Florida Rep. Matt Gaetz, but this nomination quickly went off the rails amid a House Ethics Committee report, still as of now unreleased, into allegations he engaged in child sex trafficking and illicit drug use.","summary":"Hours after his pick for attorney general removed himself from consideration, Donald Trump announced his replacement pick on Truth Social: former Florida Attorney General Pam Bondi.\n\n\"I am proud to announce former Attorney General of the Great State of Florida, Pam Bondi, as our next Attorney General of the United States,\" wrote Trump. \"Pam was a prosecutor for nearly 20 years, where she was very tough on Violent Criminals, and made the streets safe for Florida Families. Then, as Florida’s first female Attorney General, she worked to stop the trafficking of deadly drugs, and reduce the tragedy of Fentanyl Overdose Deaths, which have destroyed many families across our Country. She did such an incredible job, that I asked her to serve on our Opioid and Drug Abuse Commission during my first Term — We saved many lives!\"\n\n\"For too long, the partisan Department of Justice has been weaponized against me and other Republicans - Not anymore,\" Trump continued. \"Pam will refocus the DOJ to its intended purpose of fighti","url":"https://www.alternet.org/trump-pam-bondi-ag/","image":"https://www.alternet.org/media-library/image.jpg?id=54966080&width=1200&height=600&coordinates=0%2C288%2C0%2C288","video":null,"publish_date":"2024-11-22 00:15:31","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","category":"politics","source_country":"US","sentiment":0.071},{"id":266373472,"title":"Old Montage of Trump ‘Pretending to Be Married to Melania’ Leaves Everyone In Splits: \"She Knows…\"","text":"Resurfaced clips of Donald Trump attempting to hold Melania Trump’s hand—only to be rebuffed—have reignited speculation about their marriage. These moments, edited together and posted on Reddit with the title \"Donald Trump pretending to be married to Melania,\" have left the internet buzzing with humor and critique, as users dissect the interactions and body language between Donald and Melania. In each instance, Trump repeatedly reached for Melania’s hand, which was met with what appears to be deliberate avoidance.\n\nFor instance, one of the most widely discussed moments (during Donald's first presidency) occurred in 2017 during a visit to Tel Aviv. As the Trumps walked the red carpet alongside Israeli Prime Minister Benjamin Netanyahu and his wife, Sara, Melania appeared to swat Donald’s hand away, as reported by The Hill.\n\nThen again, on a trip to Ohio, Melania strategically used her coat to block access to her hands, effectively avoiding any contact. In yet another public engagement, Melania forcefully swung her hand to free herself, causing Donald to stumble a little before regaining his composure and adjusting his suit. These repeated public gestures of swatting indicate unsaid tension, with body language offering subtle insights into their relationship dynamics.\n\nThe viral footage fueled rumors of marital discord, but Melania later dismissed the speculation in her memoir Melania. She explained what happened in 2017: “As we walked down the red carpet, I gently waved away his attempt to hold my hand. The media labeled it as a ‘swat’ and used it as supposed evidence of marital discord.” Melania described the incident as a ‘mere misunderstanding,’ blaming the media for sensationalizing a trivial moment. She explained that the protocol required the prime minister and the president to walk side by side, leaving the spouses behind. When Trump offered his hand, Melania declined, preferring to walk alone.\n\nThere have been several instances of visible tension between Melania and Donald, as captured by cameras during public appearances. After the 2020 final presidential debate, Melania was seen pulling away from Donald’s hand, nudging him to give her a slight push on the back before walking away, visibly irritated. During another viral moment, while exiting Air Force One, Melania pulled her hand away, leaving Donald awkwardly trying to hold it again before giving up.\n\nNetizens on Reddit had a lot to say regarding the couple's swatting game. One user wrote, “The hand swat in the white dress is still my favorite.” In agreement, another added, “That's what happens when you pay people to marry you.” Someone else echoed a similar sentiment, “She's just waiting for him to die, trying to do the bare minimum to maximize inheritance and not get booted from the will. The contempt is palpable.” Another user added, “The fact that she knows this is going to be filmed just shows the hatred for her POS husband.”\n\nAs if this wasn’t enough, one critic remarked, “They both know they’re being filmed, that’s the best part. He desperately wants to be seen holding hands and she does her best to avoid it.” Others noted, “She reportedly cried the night he won. She just wanted to be a regular trophy wife who didn't have to really be around him. Instead, she had to be a full-time public first lady. But yeah will be quite an interesting drama to see if she stays or goes when Trump inevitably flees to Russia.”\n\nAs per Express, this isn’t the first time their interactions have faced scrutiny. Darren Stanton, a body language expert, analyzed the couple’s demeanor during Donald's post-election speech at Mar-a-Lago. According to Stanton, Melania exhibited a ‘contrived smile’ and ‘very little reciprocal liking.’ During a staged embrace, Stanton noted a stark contrast between the president-elect's affectionate overtures and Melania’s detached demeanor. “There’s no passion; she doesn’t want to be there…He is doing all the work here,” he remarked.","summary":"One critic wrote, “She just wanted to be a regular trophy wife who didn&#39;t have to really be around him.&#34;","url":"https://www.inquisitr.com/old-montage-of-trump-pretending-to-be-married-to-melania-leaves-everyone-in-splits-she-knows","image":"https://dab57h0r8ahff.cloudfront.net/724967/uploads/3fc110b0-a5ac-11ef-90f7-9d17179f5ae0_1200_630.jpeg","video":null,"publish_date":"2024-11-22 00:15:00","author":"INQUISITR,Ishita Sen Gupta","authors":["INQUISITR","Ishita Sen Gupta"],"language":"en","category":"politics","source_country":"us","sentiment":-0.292},{"id":266377454,"title":"Trump’s education secretary pick Linda McMahon body slammed by Kane in resurfaced WWE clip","text":"A resurfaced clip of President-elect Donald Trump’s nominee for Secretary of Education getting body slammed in the wrestling ring by Kane, who is now a Republican mayor, has gone viral.\n\nWWE co-founder Linda McMahon was announced as one of Trump’s cabinet picks on November 19 with critics and WWE fans questioning her qualifications for the role.\n\nOne video posted by the X (formerly Twitter) account “Just Talk Wrestling” shared a video of McMahon being placed in a headlock by Glenn Jacobs, a former Hall of Fame wrestler who went by the wrestling name Kane. He is now the mayor of Knox County, Tennessee.\n\n“US politics is so wild,” the account captioned the post. “Here’s the Mayor of Knox County Tombstoning the US Secretary of Education.”\n\nThe video shows McMahon confronting Kane, who then retaliates by picking her up and slamming her on the floor.\n\nMany people turned to the comments section to joke about how the video reflected the state of the country.\n\n“Yes, we are a clown show of a nation. Thanks for pointing that out,” one commenter wrote while another agreed, writing, “If this were real, it would instantly go viral for blending politics and wrestling in the most dramatic way possible.”\n\n“So the government is just for entertainment they don’t actually do anything 90% of the time?” a third commenter echoed.\n\nJacobs even went on to congratulate the WWE co-founder on her accomplishment as he shared a photo of himself alongside her on X with a caption that read, “Congrats to @Linda_McMahon, our new Secretary of Education! Honored to call you a friend and can’t wait to see all you accomplish with @realDonaldTrump over the next four years.”\n\nMcMahon was the president and the CEO of the WWE alongside her husband, Vince, from 1980 to 2009. Following her time at WWE, she ran for Senate in Connecticut in 2010 and in 2012, having lost both times.\n\n“For the past four years, as the Chair of the Board at the America First Policy Institute (AFPI), Linda has been a fierce advocate for Parents’ Rights, working hard at both AFPI and America First Works (AFW) to achieve Universal School Choice in 12 States, giving children the opportunity to receive an excellent Education, regardless of zip code or income,” Trump said in a statement announcing McMahon’s nomination.\n\n“As Secretary of Education, Linda will fight tirelessly to expand ‘Choice’ to every State in America, and empower parents to make the best Education decisions for their families.”\n\n“Linda served for two years on the Connecticut Board of Education, where she was one of fifteen members overseeing all Public Education in the State, including its Technical High School system,” Trump added in his statement.\n\n“She also served as a Member of the Board of Trustees at Sacred Heart University in Fairfield, Connecticut, for two stints totaling over 16 years.”\n\nMcMahon also led the Small Business Administration between 2017 and 2019 when she left to be in charge of the pro-Trump Super PAC America First Action.","summary":"The billionaire former wrestling executive was announced as the nominee for Secretary of Education on November 19","url":"https://www.independent.co.uk/life-style/linda-mcmahon-wwe-kane-b2651632.html","image":"https://static.independent.co.uk/2024/11/20/14/SEI230235193.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/deUgokZf-OhrQWqOm.mp4","publish_date":"2024-11-22 00:14:45","author":"Brittany Miller","authors":["Brittany Miller"],"language":"en","source_country":"gb","sentiment":0.024},{"id":266372104,"title":"Trump chooses Pam Bondi for attorney general pick after Gaetz withdraws","text":"President-elect Donald Trump has named Pam Bondi, the former attorney general of Florida, to be US attorney general just hours after Matt Gaetz withdrew his name from consideration.\n\nMs Bondi is a long-time ally of Mr Trump and was one of his lawyers during his first impeachment trial when he was accused — but not convicted — of abusing his power as he tried to condition US military assistance to Ukraine on that country investigating then-former vice president Joe Biden.\n\nMs Bondi was among a group of Republicans who showed up to support Mr Trump at his hush money criminal trial in New York which ended in May with a conviction on 34 felony counts. She has chaired the America First Policy Institute, a think tank set up by former Trump administration staffers.\n\n“For too long, the partisan Department of Justice has been weaponised against me and other Republicans – Not anymore,” Mr Trump said in a social media post. “Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.”\n\nThe swift selection of Ms Bondi came about six hours after Mr Gaetz withdrew.\n\nMr Gaetz stepped aside amid continued fallout over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nThat announcement capped a turbulent eight-day period in which Mr Trump sought to capitalise on his decisive election win to force Senate Republicans to accept provocative selections like Mr Gaetz, who had been investigated by the Justice Department before being nominated last week to lead it.\n\nThe decision could heighten scrutiny on other controversial nominees, including Pentagon pick Pete Hegseth, who faces sexual assault allegations that he denies.\n\n“There is no time to waste on a needlessly protracted Washington scuffle, thus I’ll be withdrawing my name from consideration to serve as Attorney General. Trump’s DOJ must be in place and ready on Day 1.”\n\nIn a social media post, Mr Trump said: “I greatly appreciate the recent efforts of Matt Gaetz in seeking approval to be Attorney General. He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect. Matt has a wonderful future, and I look forward to watching all of the great things he will do!”\n\nLast week, Mr Trump named his personal lawyers Todd Blanche, Emil Bove and D John Sauer to senior roles in the department. Another possible attorney general contender, Matt Whitaker, was announced Wednesday as the US ambassador to Nato.","summary":"A long-time ally to the president-elect, Ms Bondi was one of his lawyers during his first impeachment trial.\n\n\nThe post Trump chooses Pam Bondi for attorney general pick after Gaetz withdraws appeared first on Jersey Evening Post.","url":"https://www.jerseyeveningpost.com/morenews/worldnews/2024/11/22/trump-chooses-pam-bondi-for-attorney-general-pick-after-gaetz-withdraws/","image":"https://d3gvyx4eg3tne0.cloudfront.net/wp-content/uploads/2024/11/Img39377884.jpg","video":null,"publish_date":"2024-11-22 00:13:21","author":"World News","authors":["World News"],"language":"en","category":"politics","source_country":"gb","sentiment":0.026},{"id":266372888,"title":"BREAKING: Trump Names Former Florida AG Pam Bondi Attorney General","text":"President-elect Donald Trump wasted little time in naming another attorney general after former Florida Rep. Matt Gaetz withdrew his name earlier Thursday. Trump named Pam Bondi, a former Florida attorney general and prosecutor for nearly 20 years.\n\n“I am proud to announce former Attorney General of the Great State of Florida, Pam Bondi, as our next Attorney General of the United States,” Trump posted on Truth Social Thursday night. “Pam was a prosecutor for nearly 20 years, where she was very tough on Violent Criminals, and made the streets safe for Florida Families.”\n\n“Then, as Florida’s first female Attorney General, she worked to stop the trafficking of deadly drugs, and reduce the tragedy of Fentanyl Overdose Deaths, which have destroyed many families across our Country,” he added. “She did such an incredible job, that I asked her to serve on our Opioid and Drug Abuse Commission during my first Term — We saved many lives!”\n\nThe president-elect hailed Bondi as a force against the weaponization of the federal government against conservatives.\n\n“For too long, the partisan Department of Justice has been weaponized against me and other Republicans – Not anymore,” Trump said. “Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again. I have known Pam for many years — She is smart and tough, and is an AMERICA FIRST Fighter, who will do a terrific job as Attorney General!”\n\nGaetz, Trump’s first pick for attorney general, withdrew his nomination in a surprise move Thursday amid sexual assault claims. The Justice Department previously investigated the claims against him and declined to press charges. Gaetz also resigned from Congress after Trump nominated him, and his resignation brought an end to a congressional ethics investigation.\n\nBondi, a prosecutor in Hillsborough County, Florida, served as Florida’s 37th attorney general from 2011 to 2019. She was the first woman to serve in that role. Bondi served as one of Trump’s lawyers during his first impeachment trial in 2020, and she led the legal arm of the America First Policy Institute earlier this year. \n\nThis is a breaking story and will be updated.","summary":"President-elect Donald Trump wasted little time in naming another attorney general after former Florida Rep. Matt Gaetz withdrew his name earlier Thursday. Trump named Pam... Read More\n\n\nThe post BREAKING: Trump Names Former Florida AG Pam Bondi Attorney General appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2024/11/21/breaking-trump-names-former-florida-ag-pam-bondi-attorney-general/","image":"https://www.dailysignal.com/wp-content/uploads/2024/11/Pam-Bondi.jpg","video":null,"publish_date":"2024-11-22 00:13:04","author":"Tyler O,Tyler O'Neil","authors":["Tyler O","Tyler O'Neil"],"language":"en","category":"politics","source_country":"us","sentiment":-0.047},{"id":266374360,"title":"An election-filled year, But…","text":"Breaking News\n\nPress Release\n\nFrom the Courts\n\nSpecial Features\n\nRegional / World\n\nOur Readers’ Opinions\n\nBassy – Love Vine\n\nDr. Fraser- Point of View\n\nR. Rose – Eye of the Needle\n\nDr Jozelle Miller\n\nThe World Around Us\n\nRandom Thoughts\n\nKitchen Corner\n\nWhat’s on Fleek this week\n\nHealth Wise\n\nPhysician’s Weekly\n\nBusiness Buzz\n\nPrime the pump\n\nIn Memoriam / Acknowledgement\n\nAdvertise With Us\n\nLetters To The Editor\n\nGeneral Contact Information\n\nContact our Webmaster\n\nInteractive Media Ltd\n\nSt. Vincent & the Grenadines\n\n\r\n\r\n\r\n\r\n\r\n\r\n\nBreaking News\n\nPress Release\n\nFrom the Courts\n\nSpecial Features\n\nRegional / World\n\nOur Readers’ Opinions\n\nBassy – Love Vine\n\nDr. Fraser- Point of View\n\nR. Rose – Eye of the Needle\n\nDr Jozelle Miller\n\nThe World Around Us\n\nRandom Thoughts\n\nKitchen Corner\n\nWhat’s on Fleek this week\n\nHealth Wise\n\nPhysician’s Weekly\n\nBusiness Buzz\n\nPrime the pump\n\nIn Memoriam / Acknowledgement\n\nAdvertise With Us\n\nLetters To The Editor\n\nGeneral Contact Information\n\nContact our Webmaster\n\nInteractive Media Ltd\n\nSt. Vincent & the Grenadines\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n Editorial \r\n\nNovember 22, 2024\r\n\n\r\n\r\n\n\r\n An election-filled year, But… \r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\nThere are still six weeks to go before 2024 comes to an end, but already this year has witnessed an unprecedented number of national elections worldwide with most of the 70 scheduled already completed. It has been far from plain sailing for those occupying power at the beginning of the year. Unfortunately for those incumbents, a significant number of them lost power and even when they managed to retain power, did so with reduced majorities. For the first time since 1905, every incumbent party facing the polls lost vote share, even if it managed to hold on to office. As it stands now, there are new leaders in the United Kingdom, Japan, Sri Lanka, Bangladesh, Mauritius, Pakistan, Iran and Senegal. Not all of these were from electoral defeats as was the case in Iran, the President dying in an air plane crash. To these will be added the President-elect of the United States of America, Donald Trump, when he takes the reins after his victory at the polls earlier this month. A most worrying feature of the shifts in world politics, besides the hugely significant Trump/Republican victory, is the shift to the right especially in Europe. Already the European Union itself has to contend with mavericks like Hungarian President Viktor Orban, but national elections this year revealed growing support for the far right in France and Austria. Even while Britain rejected the Conservative Party in the general elections in July, the racist Reform Party gathered the support of over 4 million voters. Right in this hemisphere, the new US administration will be buoyed by the support it will receive from one of the most right-wing governments ever elected in this part of the world, that of Argentina.\n\nAnother worrying trend in electoral engagements globally, is the growing trend among losers to challenge election results. The statistics reveal that between mid-2020 and mid-2024, one in five of election results globally was challenged, and a corresponding number of losing Presidential candidates publicly rejected the results. As it stands now electoral results in Mozambiqyue and Georgia have been disputed.\n\nUndoubtedly there may be valid cases, but it now seems that every election loser becomes a “sore loser” refusing to concede defeat, even if there appears to be no solid basis for such actions. The most spectacular example of this was the USA itself, the self-appointed promoter and defender of democracy worldwide. The results of its own Presidential elections of 2020 were not only challenged by Donald Trump, but an instigated mob stormed Congress, threatened elected officials and even killed and wounded protective forces. The court cases against Trump are now effectively dead, the followers convicted are likely to be pardoned, and God alone knows what else is in store.\n\nOur country has not been immune from such threats. The results of the 1998 General Elections received with massive, disruptive street protest by the then opposition Unity Labour Party; and the current Opposition openly challenged the challenged the results of both the 2010 and 2015 elections. Once more it is raising the hopes of its supporters. What will be the result if it fails to triumph in 2025/6? We can only hope for an early resolution if there are any differences on electoral matters and not wait until the heat of the battle when tempers are frayed. It is also hoped that the court will again be used to settle any challenges which may arise.\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n ALSO IN THE NEWS\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Training Workshop targets TVET students \r\n\r\n\n\r\n\r\n\n\r\n Forrest \r\n\n\r\n\nNovember 20, 2024 \r\n\n\r\n Fifty students from Technical and Vocational Training Institutes around the country are this week gaining first-hand knowledge and experience in busin... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n Front Page \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n 128 given rights to plots in Langley Park \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n Government has distributed letters for 128 lots of lands to persons in two areas in the constituency of North Windward. The distribution of offer lett... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n Front Page \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n PM looks to become ‘Six Star General’ after nextelections \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n Prime Minister, Dr Ralph Gonsalves, has pronounced that he will move up a notch and wear the figurative badge of ‘Six Star General’ after the next Gen... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n Front Page \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Architect speaks well of features of Holiday Innat hand overlast Saturday \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n by Eldonté Samuel The new Holiday Inn Express Hotel and Suites located at Diamond, was handed over to the government of St Vincent and the Grenadines ... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n Front Page \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Reclaiming the True Meaning of Garifuna Settlement Day \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n by James Lovell During the month of November, culminating today, November 19, the towns of Dangriga and Punta Gorda in Belize come alive with festivit... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n Front Page \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Man who paralysed inmate in 2017 shot dead on Saturday \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n A Fairbaine Pasture man who is no stranger to violence, and who was given the alias “Bolo” (as he was compared to Bolo Yeung, an extremely violent mov... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Training Workshop targets TVET students \r\n\r\n\n\r\n\r\n\n\r\n Forrest \r\n\n\r\n\nNovember 20, 2024 \r\n\n\r\n Fifty students from Technical and Vocational Training Institutes around the country are this week gaining first-hand knowledge and experience in busin... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Public being urged to ‘police’ minivan operators \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n Users of public service transport-minivans, are being urged to report poor conduct by operators of these vehicles and documenting incidents with the u... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Kingstown fireunder investigation \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n The police say they are currently investigating the circumstances surrounding a fire that occurred on November 17, 2024, involving a store in Kingstow... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Founder of the SVG Alzheimer’s Disease, Dementia Association is now a Nursing Fellow \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n Founder and Vice-President of the SVG ( St Vincent and the Grenadines) Alzheimer’s Disease and Dementia Association (SVGADDA), Dr. Glenna Brewster has... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n News \r\n\r\n\r\n\n\r\n\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n Vincentian appointed Director of UWI Institute for Gender \r\n\r\n\n\r\n\r\n\n\r\n Webmaster \r\n\n\r\n\nNovember 19, 2024 \r\n\n\r\n Vincentian, Dr. Halimah DeShong, has been appointed as the new Director of the Institute for Gender and Development Studies (IGDS) at The University o... \r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\n\r\n\r\n\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\r\nSubscribe Now\r\n\r\n\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\n\r\n\r\n\r\n\n\r\n\r\n\nInteractive Media Ltd. • P.O. Box 152 • Kingstown • St. Vincent and the Grenadines • Phone: 784-456-1558 © Copyright Interactive Media Ltd.. All rights reserved.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\r\n\r\n\r\n\r\n\n\r\n\nWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok","summary":"","url":"https://www.searchlight.vc/editorial/2024/11/22/election-filled-year/","image":"","video":null,"publish_date":"2024-11-22 00:12:30","author":"Webmaster","authors":["Webmaster"],"language":"en","category":"politics","source_country":"vc","sentiment":-0.1},{"id":266372046,"title":"Pete Hegseth meets with GOP senators to secure support for expected nomination","text":"Washington — Former Fox News host Pete Hegseth, President-elect Donald Trump's pick for defense secretary, met with senators on Capitol Hill on Thursday as new details emerged about an alleged sexual assault that took place in 2017.Hegseth was accompanied in his meetings by Vice President-elect JD Vance, an Ohio senator, as they seek to secure support among Republican senators for the former Fox News host's expected nomination. Trump selected the 44-year-old Army veteran — who served in Iraq and Afghanistan — last week, citing his military experience and calling him a \"Warrior for the Troops.\"Ahead of the meetings, the release of a detailed police report late Wednesday drew increased attention to the defense secretary pick, building upon information unearthed about an investigation into Hegseth for an alleged sexual assault in 2017. The report included the first detailed accounts of the incident from the unnamed woman, Hegseth and others. Hegseth denies the allegation and characterized the incident as a consensual encounter. Hegseth and Vance have met with Sens. Bill Hagerty and Marsha Blackburn of Tennessee, Roger Wicker of Mississippi and Marco Rubio of Florida. Rubio was selected by Trump to serve as secretary of state but could vote on Hegseth's nomination if he is still in the Senate should it takes place.Blackburn said she had a \"great meeting\" with Hegseth, noting that he is a Tennessean whom \"we look forward to supporting.\"Hagerty likened the allegations against Hegseth to those made against Supreme Court Justice Brett Kavanaugh in 2018. Kavanaugh was accused of sexually assaulting Christine Blasey Ford when he was in high school in the 1980s. He vehemently denied the claims, and none of the people who attended the gathering where the alleged incident happened could corroborate Ford's allegations.\"It's a disgrace that those allegations are nothing but what you said, allegations that are he-said she-said,\" he told reporters. \"This is a case that has been dismissed. This is just dredging up something, try to smear and discredit a candidate. It reminds me of what happened to Brett Kavanaugh. It's a disgrace.\"The Monterey Police Department forwarded its report about the alleged assault to the Monterey County District Attorney's Office for review back in 2017. Monterey County District Attorney Jeannine M. Pacioni said Thursday that in January 2018 her office \"declined to file charges\" as none were \"supported by proof beyond a reasonable doubt.\"Sen. John Barrasso of Wyoming, the Republican conference chair, praised Hegseth as a \"strong\" candidate to lead the Pentagon. Barrasso will become the second highest-ranking Senate Republican in the next Congress after he was selected to serve as majority whip.\"We had an excellent discussion about the need for America's military to remain the best in the world. That means taking care of our service members, equipping them with the latest technology, and focusing on making our military the most lethal force on the planet,\" he said in a statement. \"Pete pledged that the Pentagon will focus on strength and hard power — not the current administration's woke political agenda.\"The allegations against Hegseth were revealed last week when officials in Monterey, California, released a public statement disclosing an incident that occurred the night of Oct. 7, 2017, and into the morning of Oct. 8, 2017, at the Hyatt Regency Monterey Hotel. An incident report was filed with the Monterey Police Department five days later.That police report, which was released Wednesday to CBS News and other outlets in response to public records requests, provided more details about the incident between Hegseth and the unidentified woman. The alleged victim told police that Hegseth sexually assaulted her after a Republican women's event at the hotel. She said he took her phone, blocked the door to a hotel room and refused to let her leave, according to the investigative report.The report said law enforcement was first notified of the alleged assault by a nurse informing police that a patient requested a sexual assault exam. Police also spoke with a hotel staffer and another woman who was at the event with Hegseth.The alleged victim told the nurse that she had been drinking with coworkers but thinks something may have been slipped into her drink because she could not remember many of the night's events. She recalled being in a coworker's hotel room, laying on either a couch or bed, and a bare-chested Hegseth hovering over her with his dog tags hanging over her face. According to the report, she said that Hegseth ejaculated on her stomach and then asked, \"Are you OK?\"The unidentified woman said her last memory was of walking into her hotel room, though she told police she did not remember how she got back to it, the report states. Hegseth also spoke with police and claimed the alleged victim led him to his room. He said the interaction was consensual and he checked multiple times to make sure the woman was comfortable with what was happening, according to the report.Timothy Parlatore, Hegseth's lawyer, said \"This police report confirms what I've said all along. That the incident was fully investigated and the police found the allegations to be false, which is why no charges were filed.\"While no charges were filed, neither Monterey police nor city officials have publicly said the allegations were found to be false.Parlatore had told CBS News on Monday that his client paid a confidential financial settlement to a woman who accused him of sexual assault because he was concerned Fox News would fire him because of the allegation.In addition to the allegations against Hegseth, his selection has drawn criticism due to his lack of high-level national security experience. The Defense Department is the largest federal agency, with more than 3 million civilian and military employees and a budget of more than $800 billion. He's also drawn criticism for his stance that women should not be in combat roles in the U.S. military. The meetings come a day after former Rep. Matt Gaetz also met with GOP senators before withdrawing his name from consideration for attorney general. Gaetz said in a post on social media that it had become clear that his candidacy \"was unfairly becoming a distraction to the critical work of the Trump/Vance Transition.\"","summary":"Former Fox News host Pete Hegseth was with Vice President-elect JD Vance on Capitol Hill on Thursday.","url":"https://www.cbsnews.com/news/pete-hegseth-meets-with-senate-republicans-new-details-alleged-misconduct/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/21/e955d04a-0286-4cc8-a603-6f52568cf12b/thumbnail/1200x630g2/56ff3caa3d01162157031735e2e6d973/gettyimages-2185953335.jpg?v=6056e68389c16974d8d95eeea60b7a3a","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3354526_hls/master.m3u8","publish_date":"2024-11-22 00:12:18","author":"Kaia Hubbard,Melissa Quinn","authors":["Kaia Hubbard","Melissa Quinn"],"language":"en","source_country":"US","sentiment":-0.243},{"id":266372474,"title":"National City council will consider censuring one of its own","text":"National City leaders have agreed to consider censuring the freshly re-elected Councilmember Jose Rodriguez over assertions that he has repeatedly violated the city’s code of conduct.\n\nOn Tuesday, the City Council voted 3-2 to put the matter on the Dec. 3 agenda. Mayor Ron Morrison, who is proposing his colleague be censured, received support from Councilmembers Marcus Bush and Luz Molina. Rodriguez and Councilmember Ditas Yamane voted against it.\n\n“I’ve had a number of requests from people saying that there’s been so many different things that have come up over these last couple of years, but … this is the only legal way to do that,” Morrison said.\n\nThe mayor and several other residents allege that Rodriguez used city resources to help himself get re-elected and have accused him of being politically divisive.\n\n“It’s simply petty,” Rodriguez told his colleagues during the contentious conversation that was supposed to be brief and without any details about the proposed censure.\n\nHe suggested that complaints about his campaign be made with the state Fair Political Practices Commission.\n\n“This is grossly utilizing city resources for your political gain at this moment and that is a shame and is something that continues to be a reoccurring theme throughout your 30-year tenure,” Rodriguez told Morrison. “The election is over, guys. Get over it.”\n\nVoters on Nov. 5 elected Rodriguez to serve a second four-year term. He was first elected at-large to the City Council in 2020 and earlier this month he was chosen to represent the newly drawn District 2. He beat Randi Castle-Salgado, a city Planning commissioner, by more than 70%, according to the San Diego County Registrar of Voters.\n\nCritics argue that Rodriguez used public funds for a turkey giveaway to residents last November during a city event about park updates. They’ve also questioned his hiring of city staff members to promote his re-election campaign indirectly at city events.\n\nAdditionally, he was accused of making divisive comments and bringing negative attention to a planning commissioner after sending out a campaign email with a photo of the official’s house and a Trump flag. The message erroneously suggested that Castle-Salgado lived there and was a supporter of president-elect Donald Trump.","summary":"The City Council will formally consider a vote to censure Councilmember Jose Rodriguez on Dec. 3","url":"https://www.sandiegouniontribune.com/2024/11/21/national-city-council-will-consider-censuring-one-of-its-own/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/11/SUT-L-NATIONALCITY-CENSURE.jpg?w=1024&h=654","video":null,"publish_date":"2024-11-22 00:10:11","author":"Tammy Murga","authors":["Tammy Murga"],"language":"en","category":"politics","source_country":"us","sentiment":-0.101},{"id":266373906,"title":"Trump chooses Pam Bondi for attorney general pick after Gaetz withdraws","text":"Ms Bondi was among a group of Republicans who showed up to support Mr Trump at his hush money criminal trial in New York which ended in May with a conviction on 34 felony counts. She has chaired the America First Policy Institute, a think tank set up by former Trump administration staffers.\n\n“For too long, the partisan Department of Justice has been weaponised against me and other Republicans – Not anymore,” Mr Trump said in a social media post. “Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.”\n\nMr Trump’s son Donald Trump Jr told Fox Business on Sunday that the transition team had back-ups in mind for his controversial nominees should they fail to get confirmed.\n\nThe swift selection of Ms Bondi came about six hours after Mr Gaetz withdrew.\n\nMr Gaetz stepped aside amid continued fallout over a federal sex trafficking investigation that cast doubt on his ability to be confirmed as the nation’s chief federal law enforcement officer.\n\nThat announcement capped a turbulent eight-day period in which Mr Trump sought to capitalise on his decisive election win to force Senate Republicans to accept provocative selections like Mr Gaetz, who had been investigated by the Justice Department before being nominated last week to lead it.\n\nThe decision could heighten scrutiny on other controversial nominees, including Pentagon pick Pete Hegseth, who faces sexual assault allegations that he denies.\n\n“While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,” Mr Gaetz, a Florida Republican who one day earlier met with senators to win their support, said in a statement.\n\n“There is no time to waste on a needlessly protracted Washington scuffle, thus I’ll be withdrawing my name from consideration to serve as Attorney General. Trump’s DOJ must be in place and ready on Day 1.”\n\nIn a social media post, Mr Trump said: “I greatly appreciate the recent efforts of Matt Gaetz in seeking approval to be Attorney General. He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect. Matt has a wonderful future, and I look forward to watching all of the great things he will do!”\n\nLast week, Mr Trump named his personal lawyers Todd Blanche, Emil Bove and D John Sauer to senior roles in the department. Another possible attorney general contender, Matt Whitaker, was announced Wednesday as the US ambassador to Nato.","summary":"President-elect Donald Trump has named Pam Bondi, the former attorney general of Florida, to be US attorney general just hours after Matt Gaetz ...","url":"https://www.irishexaminer.com/world/arid-41521871.html","image":"https://www.irishexaminer.com/cms_media/module_img/8778/4389443_1_seoimage1x1_50c500ca8af8429584fa33b0470fe4d8.jpg.jpg","video":null,"publish_date":"2024-11-22 00:10:00","author":"Eric Tucker And Alana Durkin Richer, Associated Press,Irishexaminer.com","authors":["Eric Tucker And Alana Durkin Richer, Associated Press","Irishexaminer.com"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.004},{"id":266374632,"title":"Joe & Mika: From ‘fascist’ to ‘let’s do lunch!’","text":"Of the television commentators who routinely disparaged, attacked, demeaned and mocked former President Donald Trump and his supporters, Joe Scarborough and Mika Brzezinski, co-hosts of MSNBC’s “Morning Joe,” belong to the “A” team.\n\nYet, after Trump’s extraordinary victory two weeks ago, including a sweep of all seven swing states and becoming the first Republican presidential candidate to win the popular vote in 20 years, Scarborough and Brzezinski visited Trump at Mar-a-Lago after the election, spending a reported 90 minutes with the president-elect. \n\nAs for why they made the trek, Brzezinski said: “For those asking why we would go speak to the president-elect during such fraught times, especially between us, I guess I would ask back, ‘Why wouldn’t we?’ Joe and I realized it’s time to do something different, and that starts with not only talking about Donald Trump but also talking with him.”\n\nNeither Brzezinski nor Scarborough mentioned the most likely reason: ratings. Since Trump’s victory that several MSNBC hosts predicted would not happen, the channel’s prime-time viewership is down a whopping 53%. By contrast, Fox’s ratings are up 38%.\n\nThe MSNBC pundits for the most part not only failed to prepare their viewers for Vice President Kamala Harris’ defeat but host Rachel Maddow, for example, all but predicted a humiliating loss for Trump. Two days before the election, Maddow devoted several minutes to the “gold standard” of polls, an Iowa poll showing Trump down 3 points in the Hawkeye State, where no Democratic presidential candidate has won since 2012. Gosh, Trump is down even in Iowa!\n\nMaddow gushed: “The prototypical example of a gold standard poll is the Iowa poll done by J. Ann Selzer in Iowa. … (H)er poll has accurately predicted the winner of the Senate and presidential races in Iowa within one or two points every time. … (Y)ou have seen Ann Selzer basically as a living bull”s-eye.” Trump won Iowa 56% to Harris’ 42.7%.\n\nMSNBC News wrote about historian and election predictor Allen Lichtman, who supposedly has correctly predicted eight out of the last nine presidential contests. He uses “13 keys” to determine the result, eight of which he said pointed to Harris. \n\nBut back to the “Morning Joe” hosts. Roll tape:\n\nScarborough: “And I’m not being hyperbolic when I say that if there are articles of impeachment ever drawn up, the first article of impeachment drawn up against Donald Trump will be the first article of impeachment drawn up against Richard Nixon and that is obstruction of justice, because I could find you 1,000 Republican criminal defense lawyers across America who could say what Donald Trump has admitted already on national television could rise to the level of obstruction of justice.”\n\nScarborough described to me Trump’s visit to Europe with leaders as a “disaster” and said Trump looked like a “thug, goon and an idiot.”\n\n– June 2018\n\nScarborough: “… (W)ho in the world would be so cruel, so hateful, who would be so despicable, who would be so utterly lacking in character, to suggest, to – to make something up about someone having a facelift for the sole purposes of trying to damage or humiliate them. … You would have to be utterly despicable, a classless man, to say that about a woman.”\n\nScarborough: “But there are these bizarre disconnects, and they’re showing up in campaign ads. There are these weird things he’s saying off the cuff. Again, it’s so – it is so ironic that Trump’s campaign team actually go after Joe Biden for non sequiturs, for stumbling, for getting lost halfway through his sentence when –”\n\nBrzezinski: “Or a decline.”\n\nScarborough: “– that’s what Donald Trump has been doing now, in a very public way, for three and a half years.”\n\n– April 2024\n\nScarborough: “They voted for Trump in ’20, they knew exactly what they were doing. If they vote for Donald Trump in 2024 … they’re knowingly voting for a fascist, they’re voting for a racist. …” \n\nQuestion: What’s it like spending 90 minutes with a “fascist,” a “thug” and a man who is “utterly despicable”? Did they bring along a food taster? But most important for these Trump-hating hosts turned Mar-a-Lago guests, will their ratings improve? \n\nWhen it comes to declining ratings, Joe and Mika know how to turn on a dime – to make a dime.","summary":"'For these Trump-hating hosts turned Mar-a-Lago guests, will their ratings improve?'","url":"https://www.wnd.com/2024/11/joe-mika-from-fascist-to-lets-do-lunch/","image":"https://www.wnd.com/wp-content/uploads/2023/10/joe-and-mika.jpg","video":null,"publish_date":"2024-11-22 00:09:59","author":"Larry Elder","authors":["Larry Elder"],"language":"en","category":"politics","source_country":"us","sentiment":-0.438},{"id":266376062,"title":"Donald Trump taps loyalist Pam Bondi for US attorney general after Matt Gaetz withdraws","text":"US President-elect Donald Trump announced Pam Bondi, Florida's former attorney general, as his choice for US attorney general on Thursday, following Matt Gaetz's withdrawal from consideration. Bondi, a steadfast Trump supporter, served as one of his defence lawyers during his first impeachment trial regarding allegations of power misuse concerning Ukraine and Biden investigations.Bondi demonstrated her loyalty by supporting Trump at his New York hush money trial, which concluded in May with 34 felony convictions. She has held a leadership position at the America First Policy Institute, an organisation established by former Trump administration personnel.\"For too long, the partisan department of justice has been weaponised against me and other Republicans - Not anymore,\" Trump said in a social media post. \"Pam will refocus the DOJ to its intended purpose of fighting Crime, and Making America Safe Again.\"Donald Trump Jr indicated on Fox Business that alternative candidates were available for controversial nominations. Bondi's selection came shortly after Gaetz's withdrawal, which occurred amidst ongoing concerns about a federal sex trafficking investigation.The eight-day period saw Trump attempting to leverage his election victory to secure Senate Republican support for controversial choices like Gaetz. This development may increase attention on other contentious nominees, including Pete Hegseth for the Pentagon position, who contests sexual assault allegations.\"While the momentum was strong, it is clear that my confirmation was unfairly becoming a distraction to the critical work of the Trump/Vance Transition,\" Gaetz said, following his meetings with senators. He later indicated on social media his intention to continue his political work in a different capacity.Trump expressed appreciation for Gaetz's efforts via social media, \"I greatly appreciate the recent efforts of Matt Gaetz in seeking approval to be Attorney General. He was doing very well but, at the same time, did not want to be a distraction for the Administration, for which he has much respect. Matt has a wonderful future, and I look forward to watching all of the great things he will do!\"Previously, Trump appointed Todd Blanche, Emil Bove and D John Sauer to senior departmental positions, while Matt Whitaker received the nomination for US ambassador to Nato.","summary":"Pam Bondi has been named as US Attorney General by Donald Trump, succeeding Matt Gaetz, who withdrew amid a federal investigation. Bondi, a staunch Trump ally, previously defended him in his first impeachment trial and supported him during his recent hush money trial. Trump praised Bondi's commitment and outlined his vision for the Department of Justice to prioritise crime fighting and national security.","url":"https://timesofindia.indiatimes.com/world/us/donald-trump-taps-loyalist-pam-bondi-for-us-attorney-general-after-matt-gaetz-withdraws/articleshow/115545054.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115545084/115545084.jpg","video":null,"publish_date":"2024-11-22 00:09:27","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":0.48}]}