{"offset":0,"number":50,"available":8222,"news":[{"id":261455796,"title":"‘He’ll lose it for us’: Donald Trump voters panicking","text":"He has clawed back some of Kamala Harris’ lead in the polls, leaving the contest essentially neck and neck. \n\nBut a small sign – no bigger than an A4 piece of paper – on a Republican Party office window in a remote corner of the US, has revealed a deep worry in the Trump campaign. \n\n“He could lose this, he could,” one Trump supporter told news.com.au. \n\nWhile an academic has said his bombastic rally this weekend in New York City may have “angered” more people that were energised.\n\n‘Vote policy, not personality’\n\nIn Port Angeles, in the north western state of Washington, the Republican Party office is hard to miss. \n\nOutside is painted with a giant US flag. Inside, smiling towards passers by, are life size cut outs of Donald and Melania Trump. Surrounding them are brightly coloured placards for a host of other Republicans standing in local contests on November 5. \n\nBut tacked to the window, next to the cardboard head of Mr Trump, is another poster. \n\nSolemn, black and white, it looks like it was produced in Word and probably spat out of the office printer. \n\nIt has four simple words: “Vote policy, not personality”.\n\nThe head of the local Republican Party Pamela Blakeman told news.com.au the sign was very much about one particular politician: Mr Trump. \n\nIn a maddeningly tight election, there are real fears Mr Trump’s personality could put off enough voters that the Republicans lose the race.\n\n‘I don’t like that man at the top’\n\nA few days ago, Ms Blakeman said, she was handing out leaflets encouraging people to vote for Republican candidates, including Mr Trump. \n\n“I knocked on this one guy’s door and he just kept saying ‘I don’t like that man at the top, I don’t like him’.\n\n“He couldn’t get over his dislike for him so in the end I took out a pen and I put an ‘X’ through (Mr Trump’s) head, and I said ‘now will you take the leaflet’?\n\n“He took it,” she said. \n\nIn news.com.au’s travels around the US, a common refrain from Republicans is that Mr Trump’s rhetoric is an issue.\n\nFrom repeating lies about migrants eating pets, to spit balling about whether Ms Harris’ crowds were AI generated. From dwelling on the penis size of late golfer Arnold Palmer to calling Ms Harris a “sh*t Vice President”. \n\nFrom his tolerance for dictators to comments about the “enemy within,” a phrase that evokes fears a future President Trump could clamp down on any opposition.\n\n“If he talks about the policies – the border and the economy – he will win,” a Republican supporter told news.com.au in Chicago. \n\n“But he has to stop talking about crowd sizes and the other stuff because he will lose.”\n\nA delegate at July’s Republican National Convention in Milwaukee – someone who should be the most MAGA of MAGAs – was even more direct to news.com.au. \n\n“Donald Trump’s a jerk. \n\n“But he loves his family and he loves his country,” she added\n\nComedian’s wild comment about swing voters\n\nIt’s not just Mr Trump. It’s the people he surrounds himself with.\n\nThe warm up acts for Mr Trump’s NYC rally could have been a broad church of Republicans. Instead it included Tucker Carlson, a far right wing pundit who cosied up to Russian President Vladimir Putin, and an acquaintance of the nominee who called Ms Harris the “devil” and the “anti-Christ” while holding aloft a cross.\n\nBut most memorable was comments from comedian Tony Hinchcliffe, who has previously been embroiled in accusations of racism. \n\nAt the rally, he said the US territory of Puerto Rico was a “floating island of garbage,” among another racially charged quips. The jokes fell flat. \n\nAlmost 6 million Puerto Ricans live in the mainland US and a good proportion of them can vote in swing states like Pennsylvania. \n\nThe Trump campaign said Hinchcliffe’s comments did not reflect the views of the nominee.\n\nBut there have been numerous times when Mr Trump, or another speaker at one of his rallies, has made a comment that the campaign has then had to dismiss or downplay. \n\n‘Flood the zone with crazy’\n\n“There is some wisdom to him just flooding the zone with crazy,” Alyssa Farrah Griffin, a former communications director in the Trump White House, told CNN. \n\n“Talking about the silly Arnold Palmer story means we’re not talking about him saying he’d use the American military against US citizens”.\n\nAlso on CNN, Erin Pierre, another former Trump comms staffer, said his campaign was likely trying to devise a strategy to get key policy points across to swing voters.\n\n“But instead, Donald Trump is going to do Donald Trump, and that’s going to be whatever thought comes out of his mind at the moment and he’s going to say it to the American people. \n\n“But it’s baked into the polling. The American people at this point kind of shrug off all the bombasticness, because it’s a never ending outrage cycle about him.”\n\nFor other politicians, Mr Trump’s words might scupper their campaign. However, many voters appear to either zone out of his comments, brush them aside as just Trump hyperbole or weigh up that there is more to like about Mr Trump than dislike. \n\nRepublican Governor of New Hampshire Chris Sununu once called Mr Trump “crazy”. \n\nYet last week, he said that while some of Mr Trump’s comments gave him “pause,” it was really was just “hyperbole,” and, anyway, during his term in office Mr Trump never really went after his rivals. \n\nAs a case in point, in August, a Chicago cab driver told news.com.au that he wasn’t fazed by Mr Trump’s comments and liked his other qualities. \n\n“He tells it like it is.\n\n“Others make money off us, he made his own money.\n\n“Trump is seen as the US dream by many. They aspire to his riches.”\n\n‘Fear activation’ \n\nUniversity of Kansas professor of rhetoric and political communication Robert Rowland told news.com.au Mr Trump’s success was in “activating negative emotions” and then “presenting himself as the strongman who can protect people”.\n\n“His fear activation has been very powerful, despite the fact that none of the groups he attacks actually threaten the nation.”\n\nGovernment data shows a group Mr Trump often focuses on, undocumented migrants, have a lower crime rate that Americans born in the US. \n\n“Trump does not shift to another playbook, because the only message he has is nationalist appeals warning about dangerous others, populist attacks on elites, and a presentation of himself as the strongman saviour for the nation.”\n\nThat was a weakness, said Prof Rowland. \n\n“One of the notable aspects of the campaign is how many traditional Reagan Republicans have endorsed Harris.\n\n“It isn’t that they support her domestic policies, but they fear and despise what Trump stands for.\n\n“This creates a situation in which Trump has a very strong core of support, but not a high ceiling for appealing to swing voters. \n\n“It is quite possible that the extremism in the New York rally, which is reflective of all his rally speeches, will anger more people than it activates.”\n\nThe Harris campaign has, in some ways, co-opted the Trump rhetoric. Vice presidential hopeful Tim Walz has called Mr Trump “dumb” and “weird”. Hillary Clinton compared Sunday’s event to a Nazi rally. Former President Barack Obama has made none-too-subtle references to Mr Trump’s manhood. \n\nNonetheless, in Port Angeles, Ms Blakeman was frustrated that voters were “still focused on Donald Trump’s mean tweets”. \n\nShe said his comments were just “superficial”.\n\n“He’s toned it down so much,” she insisted to news.com.au. \n\n“But the mainstream media and censorship paints him as this incredibly horrible person. \n\n“I don’t see that.\n\n“I say to (voters), ‘what about the policies, what about creating jobs for the black people, what about keeping jobs in America? You were better off four years ago. That needs to count for something, right?’”\n\nWouldn’t the media focus less on Mr Trump’s outbursts, if there were simply less of them?\n\n“But the flip side is there is this strong group that wants to just let Trump be,” she said. \n\n“And they are the ones that are very passionate and go out the vote”. \n\nYet, she conceded, Mr Trump’s provocative pronouncements, were “an obstacle for some people”.\n\nAt the New York rally, TV host Dr Phil pointedly said voters “didn’t have to love everything about somebody,” to support them.\n\nIt felt very much like the same message on the office window of a Republican Party office in a remote corner of the US.","summary":"Donald Trump may appear to be cruising to victory but a tiny poster in a Republican Party office window reveals a deep concern that all is not well.","url":"https://www.news.com.au/world/north-america/us-politics/hell-lose-it-for-us-donald-trump-voters-panicking/news-story/83ab3ccb44d80c29cd5a7421560cb62d?from=rss-basic","image":"https://content.api.news/v3/images/bin/90f4f654f2b805eddae86861ba01488e","video":null,"publish_date":"2024-10-29 01:10:59","author":"Benedict Brook In Washington State","authors":["Benedict Brook In Washington State"],"language":"en","category":"politics","source_country":"au","sentiment":-0.132},{"id":261455514,"title":"Grateful Dead’s Bob Weir Endorses Kamala Harris: ‘I’ve Done My Research’","text":"Bob Weir is voting for Kamala Harris and her vice presidential pick, Tim Walz, in the upcoming election.\n\n The Grateful Dead rocker took to Instagram on Monday (Oct. 28) to share a photo of himself wearing a Dead-inspired Harris-Walz 2024 shirt, alongside a snap of Walz holding the tee and another with his wife, Natascha Münter, holding up a Harris sign. “Well, OK, I guess it all depends on your worldview; you can see your place in the world as something to defend from those who might want to take some or all of it from you—or you can see it as a grand adventure, a place to make dreams come to fruition for yourself and for others,” he wrote in the caption.\n\n “There is, of course, an in-between place—but the more you lean toward the grand adventure side, the clearer the choice becomes,” he continued. “More good comes from focusing on building a world where disparities aren’t so pronounced that they cause friction and reducing the inequalities that create barriers. With these things in mind, I’ve done my research and come to the clear conclusion that I’ll be voting for @KamalaHarris and @TimWalz this time around.”\n\n See the post here.\n\n Weir is the latest musician to put his support behind Harris as the presidential election nears. Most recently, Bad Bunny, Jennifer Lopez and Ricky Martin were among the artists who showed support for the VP after a speaker at a Donald Trump rally made a racist joke about Puerto Rico. Beyonce, Taylor Swift, Bruce Springsteen, Billie Eilish, Stevie Nicks, Cardi B, Jason Isbell, John Legend, Katy Perry and many more have also endorsed Harris in recent months.","summary":"Bob Weir is voting for Kamala Harris and her vice presidential pick, Tim Walz, in the upcoming election. The Grateful Dead rocker took to Instagram on Monday (Oct. 28) to share a photo of himself wearing a Dead-inspired Harris-Walz 2024 shirt, alongside a snap of Walz holding the tee and another with his wife, Natascha &#8230;\n\n\nThe post Grateful Dead’s Bob Weir Endorses Kamala Harris: ‘I’ve Done My Research’ appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/grateful-deads-bob-weir-endorses-kamala-harris-ive-done-my-research/","image":"https://www.billboard.com/wp-content/uploads/media/bob-weir-grateful-dead-2016-b-billboard-1548.jpg?w=1024","video":null,"publish_date":"2024-10-29 01:05:34","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.278},{"id":261455220,"title":"Trump and Harris Present Dueling Visions of America in Final Campaign Stretch","text":"Uncertainty reigns entering the final full week of the 2024 campaign with Democrat Kamala Harris and Republican Donald Trump locked in a fiercely competitive presidential contest. What happens in the coming days will be pivotal in deciding the winner of next week’s election.\n\nTrump on Sunday held a rally at Madison Square Garden where several speakers made racist and crude remarks, including comedian Tony Hinchcliffe, who described Puerto Rico as “a floating island of garbage.” Shortly after those remarks, Puerto Rican reggaeton artist Bad Bunny endorsed Harris.\n\nTrump is holding a rally in Atlanta on Monday evening while Harris is making several campaign stops in Michigan, including a rally with singer-songwriter Maggie Rogers.\n\nHere’s the latest:\n\nHarris to young voters: ‘You are rightly impatient for change’\n\nHarris urged young voters Monday in Ann Arbor, Michigan, to take the baton from “generations of Americans” who preserved freedom and back her over Trump.\n\nThe pitch urged young voters, many of whom were in the audience from the nearby University of Michigan, to seize the power they want and protect a series of rights. Harris specifically called out abortion rights, a key issue for younger voters.\n\n“Generations of Americans before us fought for freedom and now the baton is in our hands,” Harris said. “The baton is in our hands.”\n\n“I love your generation,” Harris told the young audience. “You are rightly impatient for change.”\n\nTrump: US towns are being ‘invaded and conquered’ by ‘blood-thirsty criminals’\nTrump described the U.S. as an occupied nation due to illegal immigration, claiming undocumented migrants were more invasive and dangerous than a hostile occupying military.\n\n“I will rescue every city and town that has been invaded and conquered,” Trump said. “You know, they have been invaded,” Trump said of towns across the country, “just as though a foreign enemy was invading, a military was invading, and probably just as vicious or more vicious,” the former president said.\n\n“And we will put these blood-thirsty criminals in jail or kick them out of our country,” Trump said.\n\nHe once again promised to seek the death penalty for any unlawful migrant who has killed an American, drawing cheers from the crowd.\n\nPro-Palestinian protestors interrupt Harris rally\n\nHarris was confronted by roughly 30 pro-Palestian protestors at her event in Ann Arbor. The Democratic nominee, hearing the chants, told the protestors, “Hey, guys, I hear you.”\n\nThe group was chanting, “Israel bombs, Kamala pays, how many kids have you killed today?”\n\nAfter Harris acknowledged the group, the vice president said, “On the subject of Gaza, we all want this war to end as soon as possible and to get the hostages out and I will do everything in my power to make it so.”\n\nThe group was escorted out of the event shortly after their chants were drowned out by chants of “Kamala.”\n\nMichigan, because of its sizable Arab American population and progressive cities like Ann Arbor, has become the epicenter of activism against Harris and Democrats because of U.S. weapons sales to Israel.\n\nWalz: ‘Our team is running like everything’s on the line’\n\nHarris’ running mate, Gov. Tim Walz, sought to comfort Democrats on Monday in Michigan by highlighting how hard the party’s presidential campaign is working a few days before Election Day.\n\nThe event is a rare rally featuring both Harris and Walz, who often headline separate events.\n\n“Eight days til the election and our team is running like everything’s on the line,” Walz said.\n\nWalz directed part of his speech directly at men. “All of you who have that woman in your life that you love … Their lives are at stake in this election,” the Democratic governor said. “Be very clear about that.”\n\nWalz, a former high school football coach, quoted famed University of Michigan football coach Bo Schembechler, telling the crowd, “The team, the team, the team.” The quote comes from a speech Schembechler gave in 1983 about his approach to coaching.\n\n“Boy,” said Walz, “do we have the right team.”\n\nArab American official rallies for Harris in Ann Arbor\n\nWayne County’s highest-ranking Arab American official, Assad Turfe, spoke at a rally for Kamala Harris in Ann Arbor, Michigan. Turfe endorsed Harris in August and has been working since to ease tensions in Michigan’s large metro Detroit community.\n\n“The past year has been unimaginable for so many people in my community. We are mourning loved ones who have died in Gaza and Lebanon,” said Turfe, who is from Dearborn, where nearly half of the city’s 110,000 residents are Muslim.\n\n“We are desperate for a president who sees us, who understands us and who will give voice to our pain,” Turfe said. “And Ann Arbor, I’m here tonight because I know without a doubt that Kamala Harris is that leader.”\n\nTurfe’s appearance comes days after Trump had Michigan Muslim leaders onstage at a campaign rally in Novi, Michigan.\n\nTrump rebukes Nazi comparisons and calls Harris ‘a fascist’\n\nTrump dismissed claims that he or his supporters were comparable to Nazis.\n\n“I’m not a Nazi. I’m the opposite of a Nazi,” Trump told the crowd assembled at Georgia Tech. “Now the way they talk is so disgusting and just horrible.”\n\nAfter his Sunday evening rally at Madison Square Garden drew widespread criticism from opponents for crude and racist remarks from several speakers, the event drew comparisons to a 1939 Nazi rally in the same venue.\n\n“My father — I had a great father, tough guy. He used to always say, never use the word Nazi. Never use that word.”\n\nHe criticized Harris for “using the f-word.” Following comments from Trump’s former chief of staff John Kelly saying the former president met the definition of a fascist, Harris said she agreed with the assessment.\n\nTrump said of Harris: “She’s a fascist, okay? She’s a fascist.”\n\nMaggie Rogers: ‘In these next 8 days, you can fight back against the fear of Donald Trump’\n\nRogers performed five songs, including “Love You For A Long Time,” “Back In My Body” and “Don’t Forget Me” at Harris’ rally in Ann Arbor, Michigan.\n\n“As I’m standing here with you today, I can’t ignore the headlines I have been seeing on my phone any longer,” Rogers said. “It is terrifying. … I don’t always know what to do with that feeling but there is something to me that is greater than fear, and that is action. … Voting is the key to the future.”\n\n“In these next eight days, you can fight back against the fear of Donald Trump and everything he creates. You can take action against his darkness, you can choose the light,” she added.\n\nRogers is an ardent abortion rights supporter. After the Supreme Court decision overturning Roe v. Wade, she wrote online that “abortion is healthcare.” She also invited a series of nonprofits, including Planned Parenthood, to organize outside her most recent tour.\n\nTrump lashes out at Michelle Obama\n\nTaking the stage at his Atlanta rally, the former president quickly took aim at the former first lady.\n\n“You know who’s nasty? Michelle Obama,” Trump says at his Atlanta rally. “That was a big mistake that she made.”\n\n“I always tried to be so nice and respectful,” Trump said, claiming that she had “opened a little bit of something,” without further explanation.\n\nObama spoke at a political rally with Harris over the weekend. She will headline an Atlanta rally for her nonpartisan voter engagement group on Tuesday.\n\nMaggie Rogers takes the stage at Harris rally in Ann Arbor\n\nThe singer opened with her song “Love You for a Long Time.”\n\nBetween songs, Rogers said that she took a break from her tour to perform at the rally “because nothing is more important than this election right now.”\n\nRogers is the latest musical guest to appear with Harris, who welcomed Beyoncé to a rally in Houston on Friday.\n\nThe theme of Trump’s Atlanta rally: protecting women\n\nThe Trump campaign zeroes in on supporting and protecting women with its own spin, focusing on the threats potentially facing American women — and how Trump would defend them. The message stands in contrast to how Democrats discuss women’s issues, which often first highlight topics like abortion.\n\nTwo close aides to the former president, attorney Alina Habba and the campaign’s national press secretary, Karoline Leavitt, spoke at the start of the rally. Stephen Miller, a longtime Trump confidante, rallied the crowd by promising how Trump would protect American women from violent criminals and illegal immigration.\n\nThe Trump campaign also released an ad featuring an endorsement from the mother of Jocelyn Nungaray, a 12-year-old girl who was killed by two suspected gang members who were in the country illegally.\n\nVoter Voice: Musical appearances at Harris rally are ‘cherry on top’\n\nUniversity of Michigan graduate student Haley Boylan said that while she is attending Kamala Harris’ rally in Ann Arbor to support the vice president, musical guest Maggie Rogers’ appearance is a “cherry on top.”\n\n“How cool is it to see hopefully the future president of the United States and a great music guest at once?” said Boylan.\n\nBoylan said that having special guests like Rogers is “a great way to get young people to come out, especially in these college towns.”\n\n“It’s more drive for people to come out and hopefully just for politics in general, but it’s exciting to have that additional bonus as well,” said Boylan.\n\nStephen Miller stirs crowd with nativist rhetoric\n\nTrump adviser Stephen Miller, one of the architects of the former president’s immigration policies, is stirring a Trump rally crowd in Atlanta by blasting Harris as solely responsible for an “open border” that he says led directly to murders of U.S. citizens.\n\nUnder Harris, he says, “It is a certainty that American wives, American daughters … that American blood will be spilled … that American children will have their whole future ripped away from them.”\n\nVance calls Madison Square Garden rally ‘a celebration of America’\n\nSen. JD Vance defended the Trump campaign’s Madison Square Garden rally on Monday after critics condemned the racist remarks of some speakers and equated the event to the 1939 neo-Nazi rally that took place in the same venue.\n\n“It was a celebration of America,” Vance said during a political rally in Wausau, WI. He dismissed claims that the event was racist or featured discriminatory language.\n\n“They decided to compare us to literal Nazis for gathering in Madison Square Garden and celebrating the United States of America. These are the same people, of course, who call us racists for wanting to secure the southern border,” Vance told a crowd.\n\n“They’re the same people who have no plans, no ideas and no solutions,” Vance said, urging the crowd to vote for Trump and himself and “reject … ridiculous name-calling over actual governance.”\n\nThe White House could have a mezuzah on its doorpost\n\nWhen Harris was sworn into office as vice president, she and Emhoff placed a mezuzah on the VP’s residence in Washington. Emhoff says if Harris is elected, he would look to see if one could be placed in the White House.\n\n“Three months from now, the White House residence could – I have to check first — could have a mezuzah on its doorpost,” Emhoff said.\n\nEmhoff says he and Harris are committed to battling antisemitism\n\nSecond gentleman Doug Emhoff says voters have a choice of whether to empower the voices fighting antisemitism or those fomenting it — declaring that he and Kamala are committed to “extinguishing this epidemic of hate.”\n\nDelivering remarks on antisemitism in America Monday in Pittsburgh, a day after the anniversary of the Tree of Life synagogue massacre, Emhoff says, “There is a fire in this country, and we either pour water on it or we pour gasoline on it.”\n\n“One thing we know about antisemitism is that whenever chaos and cruelty are given a green light, Jew-hatred has historically not far behind,” Emhoff says. “And that matters so much today because Donald Trump is nothing if not an agent of chaos and cruelty.”\n\nEmhoff credits his wife for urging him to “use my voice” on the issue and says she has an “unwavering” commitment to support Israel. “Kamala feels it in her kishkes.” He contrasted her commitment with Trump, who according to former aides has praised Nazis.\n\nHarris says Trump ‘doesn’t understand the importance of unions, at all’\n\nHarris made the comment while standing before a few union members at a training facility in the key Michigan county. “He gives a lot of talk about what he cares about, but on the issues, specifically for what is good for unions and union labor, he has been awful.”\n\nHarris specifically called out the way Trump filled the National Labor Relations Board, the federal agency that enforced labor laws in the United States, with anti-union figures, a frequent attack levied against Trump by union members. She also hit Trump for lauding ally Elon Musk, the businessman and owner of the social media platform X, for discussing firing striking workers.\n\n“You’re here, he’s not,” a worker said to Harris after her critiques of Trump.\n\nUnion workers are important in a series of key swing states. While Democrats have long enjoyed the support of union leadership, Trump has improved Republican’s standing with rank-and-file union workers in both 2016 and 2020.\n\nTrump returns to a defining location on the 2024 campaign trail\n\nTrump’s Atlanta rally this evening is being held at McCamish Pavilion, across the street from the CNN studios where Trump and President Biden had their campaign-defining debate just four months ago.\n\nMcCamish housed thousands of credentialed media that night, along with the “spin room” floor where surrogates come to insist their candidate won. The spin room turned out to be no contest that night, though, after Biden’s whispering, disjointed performance highlighted the 81-year-old president’s age and led ultimately to him dropping out of the race.\n\nTrump’s top aides were on McCamish floor that night crowing about what happened on the debate stage and predicting a romp over Biden, only to have Democrats opt instead for nominating Vice President Harris.\n\nTrump praises Christians but negs them as not ‘very solid voters’\n\nTrump talked about his experience with faith and fatherhood at the National Faith Advisory Board summit. Trump recounted his upbringing in New York, saying that he at times enjoyed religious ceremonies but broadly sidestepped questions of his own faith.\n\nTrump praised conservative Christians as a key part of his administration and said that a revamped office of faith would have a direct line into the Oval Office. He also promised to repeal the Johnson Amendment, which bars 501(c)(3) nonprofit organizations from supporting or opposing political candidates.\n\n“I shouldn’t scold anyone, but Christians aren’t known for being very solid voters,” Trump said to the crowd.\n\n“We have to save religion in this country. No, honestly religion is under threat,” he warned.\n\nGreene mangles New York City history to brag on Trump\n\nMarjorie Taylor Greene, the Georgia congresswoman and Trump loyalist, employed quite the exaggeration to brag on Trump at the Georgia Tech rally.\n\nHaving returned from Trump’s rally in New York City, she described Trump as “the man who built that city.”\n\nTrump’s first real estate development projects, with his father’s company, came in the 1970s. He opened Trump Tower in 1983. Many of NewYork City’s signature skyscrapers predate this era, including the Woolworth Building (1913), the Empire State Building (1931) and the World Trade Center (dedicated in 1973).\n\nMarjorie Taylor Greene pushes back on ‘fascist’ and ‘Nazi’ labels\n\nConspiracy theorist and U.S. Rep. Marjorie Taylor Greene is pushing back at Donald Trump’s harshest critics.\n\n“We are fed up being called Nazis and fascists,” Greene, R-Ga., said at Trump’s rally on the Georgia Tech campus in Atlanta. “Those are absolute lies, and we’re not going to take it any more.” Greene suggested Trump supporters file a class-action lawsuit against media and others that have circulated those labels about the former president and his supporters in the 2024 election.\n\nShe did not mention that Trump has many times referred to Harris as a “communist” and “fascist.”\n\nShe blasted Harris and all Democrats as incompetent, arguing their policies don’t work “and neither did their stupid vaccine” to combat COVID-19. Greene is among the loudest anti-vaccine conspiracy theorists.\n\nDemocrats hope to dissuade Puerto Ricans from backing Trump\n\nDemocrats are sharing and condemning the racist comment made by a comedian at Trump’s New York rally. They’re hoping to dissuade Puerto Ricans nationwide from voting for the former president, but the impact could be particularly potent in Pennsylvania.\n\nThe Census Bureau has found Puerto Ricans are the largest detailed Hispanic group in the commonwealth. A study by the University of California-Los Angeles put the figure above 470,000 as of 2018.\n\nHarris’ new ad centers on racist Trump rally remark\n\nHarris’ campaign will begin running a new ad condemning the racist joke calling Puerto Rico “a floating island of garbage” told yesterday at Trump’s rally by a comedian.\n\nThe Harris ad opens with audio of the joke, before Harris says, “I will never forget what Donald Trump did. He abandoned the island and offered nothing more than paper towels and insults,” referring to the then-president’s response to Hurricane Maria in 2017. When Trump visited the island after the deadly hurricane, he threw rolls of paper towels into a crowd of people.\n\n“Puerto Ricans deserve better,” Harris says on camera. “As president, I will always fight for you and your families and together we can chart a new way forward,” she adds.\n\nThe Harris campaign says the ad will run on digital platforms in all battleground states, but will specifically target zip codes with high concentrations of Latino voters.\n\nTrump takes the stage at the National Faith Advisory Board\n\n“That is a lot of religion out there. That’s pretty. That’s pretty good. We like that,” the former president said after applause. The National Faith Advisory Board summit is being held in Powder Springs, Georgia.\n\nRepublicans ask US Supreme Court to block some provisional ballots in Pennsylvania\nRepublicans on Monday asked the U.S. Supreme Court for an emergency order in Pennsylvania that could result in thousands of votes not being counted in this year’s election in the battleground state.\n\nJust over a week before the election, the court is being asked to step into a dispute over provisional ballots cast by Pennsylvania voters whose mail ballots are rejected for not following technical procedures in state law.\n\nThe state’s high court ruled 4-3 that elections officials must count provisional ballots cast by voters whose mail-in ballots were voided because they arrived without mandatory secrecy envelopes.\n\nThe election fight arrived at the Supreme Court the same day Virginia sought the justices’ intervention in a dispute over purging voter registrations.\n\nIn their high-court filing, state and national Republicans asked for an order putting the state court ruling on hold or, barring that, requiring the provisional ballots be segregated and not included in the official vote count while the legal fight plays out.\n\nWalz slams rhetoric used at Trump rally: ‘It’s about hate, it’s about division’\n\nMinnesota Gov. Tim Walz told a Wisconsin audience Tuesday that the rhetoric used during former President Donald Trump’s rally at New York’s Madison Square Garden on Sunday highlighted the antagonistic tone of the Republican campaign’s closing message.\n\n“Their closing argument last night was clear to the rest of the world: It’s about hate, it’s about division,” said the Democratic nominee for vice president, speaking at Copilot Coffee Co. in downtown Waukesha, Wisconsin.\n\nThe rally, which saw thousands of Trump supporters at one of the most iconic arenas in the country, was filled with crude and racist insults.\n\nDemocrats have lambasted the remarks, particularly one comment where a speaker called Puerto Rico a “floating island of garbage.”\n\nWalz said he and Harris offer “a new way forward” and lamented that Trump’s version of the Republican Party is “fundamentally different” from former Republican presidents like Richard Nixon and Ronald Reagan.\n\nSpeaker Johnson appears to confirm Trump’s ‘secret’ plan\n\nHouse Speaker Mike Johnson appears to be confirming Trump’s claim that Republicans have a “secret” plan to win the election.\n\n“By definition, a secret is not to be shared — and I don’t intend to share this one,” House Speaker Mike Johnson said in a statement.\n\nThe Republican speaker, who led a key legal challenge to the 2020 election, has worked to stay close to Trump and has been hesitant to contradict him. At his rally in New York on Sunday Trump said they have a “little secret” in the House that will have a “big impact.”\n\nThe statement was first reported by the New York Times.\n\nHarris says her administration will ‘reassess’ federal jobs requiring a college degree\n\nKamala Harris, campaigning in Michigan on Monday, told an audience at a semiconductor facility in Saginaw County that on “day one” of her possible presidency she will reassess which federal jobs require a college degree.\n\nThe comment is both a policy proposal and a political bridge.\n\nOne of the clearest political divides in the nation over the past few presidential cycles has been between college-educated and non-college-educated voters, with Democrats acknowledging they need to cut into Donald Trump’s support among the latter group.\n\n“One of the things immediately is to reassess federal jobs, and I have already started looking at it, to look at which ones don’t require a college degree,” she said. “Because here is the thing: That’s not the only qualification for a qualified worker.”\n\nEarlier in her speech, Harris said, “We need to get in front of this idea that only high-skilled jobs require college degrees.”\n\n‘We cannot rest on tradition’\n\nVice President Kamala Harris told an audience at a semiconductor facility in Saginaw County, Michigan, on Monday that their work represents “the best of who we are as a country,” balancing the traditions of the nation and the desire to push technology forward.\n\n“When we understand who we are as a nation, we take great pride in being a leader on so many things. And we have a tradition of that,” she said at the Hemlock Semiconductor facility in central Michigan. “But I think that what we know as Americans is that we cannot rest on tradition.”\n\nHarris added: “We have to constantly be on top of what is happening, what is current, and investing in the industries of the future, as well as honoring the traditions and the industries that have built up America’s economy.”\n\nHemlock Semiconductor recently received a $325 million federal grant for a new factory.\n\nTrump will speak to reporters at Mar-A-Lago on Tuesday\n\nThe Republican nominee for president will deliver what his campaign is calling “remarks to the press” at 10 a.m. at his private club and residence in Palm Beach, Florida. It is unclear whether the former president will take questions.\n\nAmericans in Puerto Rico can’t vote for US president. Their anger at Trump is shaping the race\nSAN JUAN, Puerto Rico — A comic calling Puerto Rico garbage before a packed Donald Trump rally in New York was the latest humiliation for an island territory that has long suffered from mistreatment, residents said Monday in expressions of fury that could affect the presidential election.\n\nPuerto Ricans cannot vote in general elections despite being U.S. citizens, but they can exert a powerful influence with relatives on the mainland. Phones across the island of 3.2 million people were ringing minutes after the speaker derided the U.S. territory Sunday night, and they still buzzed Monday.\n\nBiden criticizes Musk’s $1M giveaway as ‘inappropriate’\n\nPresident Joe Biden said it was “totally inappropriate” for Elon Musk to pledge to give away $1 million a day to voters for signing his political action committee’s petition. The billionaire and owner of the social platform X has gone all-in on Republican Donald Trump.\n\nThe giveaway has raised questions and alarms among some election experts who say it is a violation of the law to link a cash handout to signing a petition that also requires a person to be registered to vote.\n\n“I think it’s totally inappropriate,” he said in Delaware where he just voted.\n\nSince Labor Day, the campaigns have made more visits to Pennsylvania than to other states\nThe Democratic and Republican presidential tickets are heading into the final week of campaigning with a familiar strategy: Rally supporters in the handful of states that will decide the race.\n\nPennsylvania, Michigan, North Carolina and Wisconsin have received the most attention from Kamala Harris, Donald Trump and their running mates since the Labor Day weekend — the point when campaigning traditionally intensifies.\n\nThe Democratic ticket has been more active over the past two weeks, according to Associated Press tracking of the campaigns’ public events.\n\nFrom Oct. 14 through this past weekend, Harris and her running mate, Minnesota Gov. Tim Walz, held 42 campaign events over the seven swing states while Trump and his running mate, Sen. JD Vance, held 25.\n\nThere has been a stark contrast in Wisconsin: Harris and Walz visited the state eight times between Oct. 14 and Sunday, compared to just one visit by Trump and Vance during that span. The Republicans are headed back to Wisconsin this week, including a rally in Milwaukee.\n\nThe AP tracker shows that from Labor Day through this past weekend both campaigns have made more visits to Pennsylvania (43) than to Georgia, Arizona and Nevada combined (40). See where the campaigns have been traveling with this AP interactive map.\n\nBiden calls Trump’s New York rally ‘simply embarrassing’\nIn response to Donald Trump’s New York rally where speakers made crude and racist insults, President Joe Biden said: “It’s simply embarrassing. That’s why this election is so important.”\n\nBiden was speaking after he voted Monday in Delaware.\n\n“Most of the presidential scholars I’ve spoken to talk about the single most consequential thing about a president is character. Character,” Biden said. “And he puts that in question every time he opens his mouth.”\n\nBiden has voted in the 2024 election\nPresident Joe Biden waited in line for about 40 minutes Monday before he cast his ballot.\n\nHe handed his identification to the election worker, who had him sign and then announced: “Joseph Biden now voting.”\n\nAs Biden voted behind a black drape, some first-time voters were announced and the room erupted in cheers for them.\n\nAlaska Sen. Murkowski says neither Trump nor Harris will get her vote\nU.S. Sen. Lisa Murkowski, an Alaska Republican and outspoken critic of former President Donald Trump, says she won’t vote for him or Vice President Kamala Harris, the Democratic nominee, in the general election.\n\n“I want to vote for somebody and not against someone,” she told the Anchorage Daily News. She added she was disappointed with the choices from both major parties.\n\nMurkowski voted to impeach Trump after the Jan. 6 insurrection and also called for him to resign. She said she didn’t vote for him in 2016 or 2020.\n\n“I am going to be voting for someone and hopefully I will feel good about that, even knowing that that individual probably is not going to be in the winner column,” Murkowski said.\n\nMurkowski declined to say who would get her vote.\n\nThere are six other candidates on the Alaska ballot for president, including Robert F. Kennedy Jr. even though he dropped out of the race in August.\n\nBiden is waiting in line to cast his ballot\nWhen President Joe Biden arrived at the polling place at the Delaware Department of Elections on Monday, there was a long line of people lined up waiting to vote.\n\nHe chatted with some and was pushing an older woman in a wheelchair who was ahead of him in line. They were all casting ballots early for the Nov. 5 election.\n\nHarris: Trump is ‘fixated on his grievances, on himself, and on dividing our country’\nKamala Harris said Donald Trump’s rally at Madison Square helped prove her point about the stakes of the election.\n\nSpeaking to reporters on Monday, Harris said the Sunday event “really highlighted the point that I’ve been making throughout this campaign,” which is that Trump is “fixated on his grievances, on himself, and on dividing our country, and it is not in any way something that will strengthen the American family, the American worker.”\n\nHarris plans to deliver her closing argument on Tuesday in Washington.\n\n“There’s a big difference between he and I,” she said.\n\nPresident Joe Biden is heading to cast his ballot\n“Let’s go vote,” he told reporters Monday after breakfast with Rep. Lisa Blunt Rochester, who has served as Delaware’s lone House member since 2017 and is running for U.S. Senate.\n\nTrump to hold his election night party at Palm Beach Convention Center\nDonald Trump will be holding his election night party in Florida at the Palm Beach Convention Center.\n\nThe venue, announced by his campaign on Monday, is not far from his Mar-a-Lago club and residence.\n\nUS voters concerned about post-election violence and efforts to overturn the results: AP-NORC poll\nWASHINGTON — American voters are approaching the presidential election with deep unease about what could follow, including the potential for political violence, attempts to overturn the election results and its broader implications for democracy, according to a new poll.\n\nThe findings of the survey, conducted by The Associated Press-NORC Center for Public Affairs Research, speak to persistent concerns about the fragility of the world’s oldest democracy, nearly four years after former President Donald Trump’s refusal to accept the 2020 election results inspired a mob of his supporters to storm the U.S. Capitol in a violent attempt to stop the peaceful transfer of power.\n\nAbout 4 in 10 registered voters say they are “extremely” or “very” concerned about violent attempts to overturn the results after the November election. A similar share is worried about legal efforts to do so. And about 1 in 3 voters say they are “extremely” or “very” concerned about attempts by local or state election officials to stop the results from being finalized.\n\nBiden breakfasts in Wilmington with Rep. Lisa Blunt Rochester\nPresident Joe Biden swung by a breakfast spot near his home outside Wilmington, Delaware, with a longtime ally who is vying to represent Delaware in the U.S. Senate.\n\nThe president and Rep. Lisa Blunt Rochester headed to The Legend Restaurant & Bakery in New Castle. Blunt Rochester, who has served as Delaware’s lone House member since 2017, is trying to become the first Black woman elected to represent Delaware in the U.S. Senate.\n\nBiden formally endorsed Blunt Rochester in a video released on Sunday evening by the lawmaker’s campaign. He is set to cast his early-vote ballot later Monday before heading back to Washington.\n\nHarris says she’d take a cognitive test if asked to\nAs former President Donald Trump continues to attack Vice President Kamala Harris with deeply personal insults, he has also suggested she should take a cognitive test.\n\nIn an interview with CBS News, Harris said “sure” when asked whether she’d take such a test.\n\n“I would challenge him to take the same one,” Harris said. “I think he actually is increasingly unstable and unhinged and has resorted to name-calling because he actually has no plan for the American people.”\n\nIt’s the same line Trump used when President Joe Biden was still running for president as questions swirled about the 81-year-old’s age and mental acuity following his disastrous debate performance in June.\n\nTrump is 78 and is now the oldest candidate to run for office.\n\nBiden plans to cast an early ballot on Monday\nPresident Joe Biden plans to cast an early ballot on Monday near his home outside Wilmington, Delaware, according to the White House.\n\nFor all but a few years since 1970, Biden has held office or has been running for one during election season. But this year, his hopes lie with a newer generation of Democrats, including three on the Delaware ballot looking to make history.\n\nVice President Kamala Harris, who Biden endorsed after dropping out of the presidential race in July, is vying to become the first Black woman and first person of South Asian descent to serve as president.\n\nMeanwhile, state Sen. Sarah McBride is looking to become the first openly transgender candidate to be elected to the U.S. House.\n\nMcBride is aiming to succeed Democrat Rep. Lisa Blunt Rochester, who is looking to become Delaware’s first Black woman to win the U.S. Senate seat. She has served as Delaware’s lone representative in the House since 2017.\n\nBiden on Sunday evening formally endorsed Blunt Rochester, cutting a video for her campaign in which he called her “Delaware through and through.”\n\nHarris highlights costs of living, abortion rights and border security as 3 immediate priorities\nKamala Harris says she has three immediate legislative priorities when she takes office, should she be elected president.\n\nIn an interview with CBS News, Harris said her first priority will be reducing costs for Americans with an expanded child tax credit and efforts to reduce the cost of groceries and make homes more affordable. The second is to work to restore abortion rights protections and the third will be to work on passage of a border security bill.\n\nHarris and Republican Donald Trump are in a tight race for the White House.\n\nHarris heads to Michigan\nKamala Harris will focus on manufacturing jobs Monday as she heads back to Michigan.\n\nShe’s set to visit Corning’s Hemlock Semiconductor Next Gen Facility. The Saginaw company received a $325 million investment from the CHIPS and Science Act, legislation passed by the Biden administration.\n\nShe’s then touring a labor training facility in Macomb County. The election is in a week and one day, and Harris is hoping to appeal to many different voting blocs in the battleground states, in a dead-heat race with Donald Trump. On Tuesday she’ll give a closing speech in Washington.\n\nHere’s what to watch in the final full week of the presidential campaign\nUncertainty reigns entering the final full week of the 2024 campaign with Democrat Kamala Harris and Republican Donald Trump locked in a fiercely competitive presidential contest. What happens in the coming days will be pivotal in deciding the winner.\n\nRead more about what we’re watching this week.","summary":"Uncertainty reigns entering the final full week of the 2024 campaign with Democrat Kamala Harris and Republican Donald Trump locked&#8230; Continue reading Trump and Harris Present Dueling Visions of America in Final Campaign Stretch\n\n\nThe post Trump and Harris Present Dueling Visions of America in Final Campaign Stretch appeared first on The National Herald.","url":"https://www.thenationalherald.com/trump-and-harris-present-dueling-visions-of-america-in-final-campaign-stretch/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/10/trump14-1.jpg","video":null,"publish_date":"2024-10-29 00:55:21","author":"Antonis","authors":["Antonis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.15},{"id":261455330,"title":"Grateful Dead’s Bob Weir Endorses Kamala Harris: ‘I’ve Done My Research’","text":"Bob Weir is voting for Kamala Harris and her vice presidential pick, Tim Walz, in the upcoming election.\n\n The Grateful Dead rocker took to Instagram on Monday (Oct. 28) to share a photo of himself wearing a Dead-inspired Harris-Walz 2024 shirt, alongside a snap of Walz holding the tee and another with his wife, Natascha Münter, holding up a Harris sign. “Well, OK, I guess it all depends on your worldview; you can see your place in the world as something to defend from those who might want to take some or all of it from you—or you can see it as a grand adventure, a place to make dreams come to fruition for yourself and for others,” he wrote in the caption.\n\n “There is, of course, an in-between place—but the more you lean toward the grand adventure side, the clearer the choice becomes,” he continued. “More good comes from focusing on building a world where disparities aren’t so pronounced that they cause friction and reducing the inequalities that create barriers. With these things in mind, I’ve done my research and come to the clear conclusion that I’ll be voting for @KamalaHarris and @TimWalz this time around.”\n\n See the post here.\n\n Weir is the latest musician to put his support behind Harris as the presidential election nears. Most recently, Bad Bunny, Jennifer Lopez and Ricky Martin were among the artists who showed support for the VP after a speaker at a Donald Trump rally made a racist joke about Puerto Rico. Beyonce, Taylor Swift, Bruce Springsteen, Billie Eilish, Stevie Nicks, Cardi B, Jason Isbell, John Legend, Katy Perry and many more have also endorsed Harris in recent months.","summary":"He shared a photo of himself wearing a Dead-inspired Harris-Walz 2024 shirt.","url":"https://www.billboard.com/music/music-news/grateful-dead-bob-weir-endorses-kamala-harris-1235813629/","image":"https://www.billboard.com/wp-content/uploads/media/bob-weir-grateful-dead-2016-b-billboard-1548.jpg","video":null,"publish_date":"2024-10-29 00:50:10","author":"Rania Aniftos","authors":["Rania Aniftos"],"language":"en","source_country":"US","sentiment":0.278},{"id":261455254,"title":"Jeff Bezos breaks silence to deliver 'hard truth' about Washington Post refusal to endorse Kamala Harris as he denies quid pro quo with Trump","text":"Jeff Bezos has broken his silence following The Washington Post's controversial decision to block an endorsement of Vice President Kamala Harris.\n\nThe billionaire insisted in a lengthy op-ed that the decision was not connected to his vast business interests while claiming endorsements 'create a perception of bias.'\n\nBezos argued the newspaper's ending its long-standing practice of endorsing a candidate is one based on principles. \n\n'Presidential endorsements do nothing to tip the scales of an election. No undecided voters in Pennsylvania are going to say, \"I'm going with Newspaper A's endorsement.\" None,' Bezos wrote.\n\n'What presidential endorsements actually do is create a perception of bias. A perception of non-independence. Ending them is a principled decision, and it's the right one.'\n\nWhether principled or not, more than 200,000 people canceled their digital subscriptions for the Washington Post by midday on Monday. \n\nBezos - who purchased The Post for $250 million in 2013 - was also at pains to point out that 'no quid pro quo of any kind is at work here.'\n\nSuch a suggestion became easy to make after Dave Limp, the CEO of Blue Origin, Bezos rocket ship company, met with Trump on the day of the announcement. \n\nTo outsiders, it gave the idea that some sort of deal was being made whereby the Post would no longer move to endorse Harris for president. \n\n'Neither campaign nor candidate was consulted or informed at any level or in any way about this decision. It was made entirely internally,' Bezos wrote. \n\n'I sighed when I found out, because I knew it would provide ammunition to those who would like to frame this as anything other than a principled decision. But the fact is, I didn’t know about the meeting beforehand.\n\n'Even Limp didn’t know about it in advance; the meeting was scheduled quickly that morning. There is no connection between it and our decision on presidential endorsements, and any suggestion otherwise is false.'\n\nBezos lamented that he wished the paper had made the change many months ago and not so close to the date of the election. \n\nHe blames the decision on 'inadequate planning, and not some intentional strategy.' \n\nEither way, the Post has suffered a 'tidal wave' of cancellations since the announcement was made, NPR explained.\n\nThe figure represents about 8 percent of the paper's paid circulation of 2.5 million subscribers, which includes print as well.\n\nThe number of cancellations only continued to grow Monday afternoon. \n\nBezos continued to state how decisions he makes involving the newspaper and 'principled' and nothing to do with his other companies or investments. \n\n'You can see my wealth and business interests as a bulwark against intimidation, or you can see them as a web of conflicting interests,' he wrote. \n\n'Only my own principles can tip the balance from one to the other. I assure you that my views here are, in fact, principled, and I believe my track record as owner of The Post since 2013 backs this up. \n\n'You are of course free to make your own determination, but I challenge you to find one instance in those 11 years where I have prevailed upon anyone at The Post in favor of my own interests.' \n\nA series columnists have also resigned from the Washington Post in recent days as the paper deals with the fallout of owner Jeff Bezos's decision to block a prepared endorsement of Vice President Kamala Harris for president.\n\nIn a post on Friday, William Lewis, the British publisher and chief executive officer of the newspaper said it would not be making an endorsement of a presidential candidate in the November 5 election, nor in any future presidential election.\n\n'We are returning to our roots of not endorsing presidential candidates,' Lewis wrote.\n\n'The Washington Post's decision not to make an endorsement in the presidential campaign is a terrible mistake,' wrote 20 columnists in an opinion piece on the Post's own website, adding that it 'represents an abandonment of the fundamental editorial convictions of the newspaper that we love.\n\n'This is a moment for the institution to be making clear its commitment to democratic values, the rule of law and international alliances, and the threat that Donald Trump poses to them—the precise points The Post made in endorsing Trump's opponents in 2016 and 2020,' the columnists wrote. \n\nThe decision was immediately condemned by a former executive editor but one that the current publisher insisted was 'consistent with the values the Post has always stood for.' \n\nIn an article posted on the front of its website, the Washington Post - reporting on its own inner workings - also quoted unidentified sources within the publication as saying that an endorsement of Harris over Trump had been written but not published. \n\nThose sources told the Post reporters that Amazon billionaire and Washington Post owner Jeff Bezos made the decision.\n\nThe Post's publisher, Will Lewis, wrote in a column that the decision was actually a return to a tradition the paper had years ago of not endorsing candidates.\n\nHe said it reflected the paper's faith in 'our readers' ability to make up their own minds.'\n\n'We recognize that this will be read in a range of ways, including as a tacit endorsement of one candidate, or as a condemnation of another, or as an abdication of responsibility. That is inevitable,' Lewis wrote. \n\n'We don't see it that way. We see it as consistent with the values the Post has always stood for and what we hope for in a leader: character and courage in service to the American ethic, veneration for the rule of law, and respect for human freedom in all its aspects.'\n\nThe Post said the decision had 'roiled' many on the opinion staff, which operates independently from the Post's newsroom staff - what is known commonly in the industry as a 'church-state separation' between those who report the news and those who write opinion.\n\nSeveral other longtime columnists have resigned in disgust at the decision to pull any endorsement. \n\nEx-editor at large and longtime columnist Robert Kagan, a conservative Trump critic, resigned from his position in the editorial board after the decision emerged.\n\nKagan suggested Bezos had set up a deal with Bezos and his space company Blue Origin.\n\nAnother columnist, Michele Norris, walked out the door on Sunday writing on X that the decision not to endorse was a 'terrible mistake'. \n\n'The Posts decision to withhold an endorsement that had been written & approved in an election where core democratic principles are at stake was a terrible mistake & an insult to the paper's own longstanding standard.'\n\nThe response from the Post's staff has been 'uniformly outraged,' according to NPR's David Folkenflik. \n\nThe Washington Post Guild issued a statement denouncing the move.\n\n'We are deeply concerned that The Washington Post would make the decision to no longer endorse presidential candidates, especially a mere 11 days ahead of an immensely consequential election,' it read.\n\nThe two infamous Washington Post reporters who uncovered Watergate also slammed the paper's decision not to endorse a candidate. \n\nBob Woodward and Carl Bernstein released a joint statement to CNN in which they expressed their disappointment in the Post's decision. \n\nIt said: 'We respect the traditional independence of the editorial page, but this decision 11 days out from the 2024 presidential election ignores the Washington Post’s own overwhelming reportorial evidence on the threat Donald Trump poses to democracy.\n\n'Under Jeff Bezos’s ownership, the Washington Post’s news operation has used its abundant resources to rigorously investigate the danger and damage a second Trump presidency could cause to the future of American democracy.\n\n'That makes this decision even more surprising and disappointing, especially this late in the electoral process.'\n\nWoodward and Bernstein became legends in the world of journalism after they broke Watergate - a sordid political scandal that involved the Nixon administration and his re-election campaign. \n\nThanks to the pair's investigative reporting, the true extent of Watergate was uncovered, and Nixon was ultimately forced to resign from office. \n\nWoodward and Bernstein aren't the only ones who are frustrated with the Post's decision, though. \n\nMany of the outlet's liberal readers are now pledging to cancel their subscriptions.\n\nThe paper's page editor David Shipley had already approved an endorsement of Harris and had reportedly told colleagues that it was being reviewed by the paper's owner Jeff Bezos, according to NPR. \n\nBut on Friday CEO Will Lewis published an op-ed that the paper is returning to its 'roots of not endorsing presidential candidates.'\n\nThe paper's staff learned of the decision from page editor Shipley in a 'tense' meeting on Friday, according to NPR. \n\nShipley told staff he owned the decision and it was meant to create 'independent space' where the paper does not tell people how to vote. \n\nHowever, The Post itself has reported that it was Bezos who made the decision to not endorse a presidential candidate.\n\n'The role of an Editorial Board is to do just this: to share opinions on the news impacting our society and culture and endorse candidates to help guide readers... The message from our chief executive, Will Lewis — not from the Editorial Board itself — makes us concerned that management interfered with the work of our members in Editorial\n\n'According to our own reporters and Guild members, an endorsement for Harris was already drafted, and the decision to not to publish was made by The Post’s owner, Jeff Bezos.\n\n'We are already seeing cancellations from once loyal readers. This decision undercuts the work of our members at a time when we should be building our readers’ trust, not losing it.'\n\nFormer Post executive editor Martin Baron said: 'This is cowardice, a moment of darkness that will leave democracy as a casualty. Donald Trump will celebrate this as an invitation to further intimidate The Post’s owner, Jeff Bezos (and other media owners). \n\n'History will mark a disturbing chapter of spinelessness at an institution famed for courage.","summary":"The owner of The Washington Post and CEO of Amazon Jeff Bezos has broken his silence following the newspaper's decision to block an endorsement of Vice President Kamala Harris.","url":"https://www.dailymail.co.uk/news/article-14013057/jeff-bezos-breaks-silence-washington-post-endorse-kamala-harris.html","image":"https://i.dailymail.co.uk/1s/2024/10/29/00/91393235-0-The_owner_of_The_Washington_Post_and_CEO_of_Amazon_Jeff_Bezos_ha-a-11_1730160521926.jpg","video":null,"publish_date":"2024-10-29 00:49:24","author":"Editor,James Gordon","authors":["Editor","James Gordon"],"language":"en","source_country":"gb","sentiment":-0.138},{"id":261455820,"title":"Comics legend Alan Moore calls out 'reflexive belligerence' of pop culture fandom: 'Fan attitudes have toxified the world'","text":"Alan Moore, widely regarded as one of the best and most influential comic book writers in the world, has penned a treatise in The Guardian on the rise of \"fandom\" in popular media and beyond, warning that while it can be \"a productive force for good,\" it has a tendency to toxify into \"a grotesque blight that poisons the society surrounding it with its mean-spirited obsessions and ridiculous, unearned sense of entitlement.\"\n\nMoore's essay begins by casting back to older comments he made about the rise of superhero movies, originally published in 2017 on Folha de São Paulo and translated and posted to his own site a couple years later. The most famous part of the interview is probably his comment about the \"deliberate, self-imposed state of emotional arrest combined with a numbing condition of cultural stasis\" among superhero movie fans, but the real fire actually comes a bit later.\n\n\"The superheroes themselves—largely written and drawn by creators who have never stood up for their own rights against the companies that employ them, much less the rights of a Jack Kirby or Jerry Siegel or Joe Schuster—would seem to be largely employed as cowardice compensators, perhaps a bit like the handgun on the nightstand,\" Moore continued. \"I would also remark that save for a smattering of non-white characters (and non-white creators) these books and these iconic characters are still very much white supremacist dreams of the master race. In fact, I think that a good argument can be made for DW Griffith’s Birth of a Nation as the first American superhero movie, and the point of origin for all those capes and masks.\"\n\nThe damning critique didn't go over super-well with some people at the time, particularly fans of superhero movies, as you might imagine. But it forms a foundation for his new essay, in which Moore takes a closer look at the nature of fandom and the ways it's changed since his early days to be older, more affluent, and firmly in the grip of nostalgia. That increase in age and status may explain the commensurate jump in a sense of privilege, he continued, and along with that \"its tendency to carp and cavil rather than contribute or create.\"\n\n\"I speak only of comics fandom here, but have gained the impression that this reflexive belligerence—most usually from middle-aged white male conservatives—is now a part of many fan communities,\" Moore wrote. \"My 14-year-old grandson tells me older Pokémon aficionados can display the same febrile disgruntlement.\"\n\nOf course, that sort of thing is also very visible in the world of videogames, which is rife with campaigns, largely on social media, against anyone who dares challenge stereotypical \"gamer\" supremacy, built on memories and ideas that took hold in early puberty. It can be seen in the \"tidal wave of hate and abuse\" inflicted on the developers of Dustborn, or the ire directed against games like Suicide Squad and Concord, which went far beyond any reasonable or acceptable level of criticism.\n\nIt's not universal: Some fandoms are \"entirely benign,\" made up of people with shared interests who enjoy supporting their hobbies. But that \"febrile disgruntlement,\" as Moore put it (a phrase I absolutely intend to steal), of toxic fans leaches into the real world, polluting the cultural waters that surround us, and the net result is that \"our culture has become a fan-based landscape that the rest of us are merely living in.\"\n\n\"We may endure largely misogynist crusades such as Gamergate or Comicsgate from those who think 'gate' means 'conspiracy,' and that Nixon’s disgrace was predicated on a plot involving water, but this is hardly the full extent to which fan attitudes have toxified the world surrounding us, most obviously in our politics,\" Moore wrote, indicating a more than passing familiarity with game industry history.\n\n\"Elections that decide the fate of millions are conducted in an atmosphere more suited to evictions on I’m a Celebrity…, in which contestants who are insufficiently amusing are removed from office. Saleability, not substance, is the issue. Those who vote for Donald Trump or Boris Johnson seem less moved by policy or prior accomplishment than by how much they’ve enjoyed the performances on The Apprentice or Have I Got News for You.\"\n\nMoore concluded that it's fine to be a big fan of something, but using it to \"displace personal frustrations into venomous tirades about your boyhood hobby\" is not: \"You don’t need the machete or the megaphone.\" He's right about that, just as he's largely right about all the rest of it—but (because he is largely right about the rest of it) we'll be closing the comments anyway.","summary":"Moore, widely regarded as one of the great comic book writers of all time, shared some thoughts on the nature of fandom in a new essay.","url":"https://www.pcgamer.com/games/comics-legend-alan-moore-calls-out-reflexive-belligerence-of-pop-culture-fandom-fan-attitudes-have-toxified-the-world/","image":"https://cdn.mos.cms.futurecdn.net/HfrAYsRST48JVPL3YVtrpd.jpg","video":null,"publish_date":"2024-10-29 00:47:59","author":"Andy Chalk","authors":["Andy Chalk"],"language":"en","category":"politics","source_country":"us","sentiment":0.325},{"id":261455458,"title":"Report: Washington Post loses more than 200,000 subscriptions following non-endorsement","text":"More than 200,000 people have canceled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday.\n\nNPR reported the figure, citing “two people at the paper with knowledge of internal matters.” \n\nThe reported loss of subscriptions of that magnitude would be a blow to a news outlet that is already facing financial headwinds. The Post had more than 2.5 million subscribers last year, the bulk of them digital, making it third behind The New York Times and Wall Street Journal in circulation.\n\nA Post spokeswoman, Olivia Peterson, would not comment on the report when contacted by The Associated Press.\n\nThe Post's editorial staff had reportedly prepared an endorsement of Democrat Kamala Harris before announcing instead Friday that it would leave it up for readers to make up their own minds. The timing, less than two weeks before Election Day, led critics to question whether Post owner and Amazon founder Jeff Bezos had been concerned about whether Republican Donald Trump might retaliate if he were elected president.\n\nThe Post's retired former editor, Marty Baron, had denounced the decision on social media as “cowardice, with democracy as its casualty.”\n\nSome journalists, including Post columnist Dana Milbank, urged readers not to express their anger at the decision by canceling subscriptions, for fear it could cost reporters or editors their jobs.\n\nThe Post's decision came only days after the Los Angeles Times also said it would not endorse a presidential candidate, which the newspaper has acknowledged has cost them thousands of subscribers.\n\nAn article on the Post's website about the fallout from the non-endorsement had more than 2,000 comments, many of them from readers saying they were leaving.\n\n“I am unsubscribing after 70 years,” wrote one commenter, claiming to have lost hope and belief that the Post would publish the truth.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"More than 200,000 people have canceled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published…","url":"https://japantoday.com/category/business/report-washington-post-loses-more-than-200-000-subscriptions-following-non-endorsement","image":"https://japantoday.com/images/japan-today-social.jpg","video":null,"publish_date":"2024-10-29 00:45:02","author":"Japan Today Editor,The Associated Press","authors":["Japan Today Editor","The Associated Press"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.35},{"id":261454612,"title":"Ballot boxes torched ","text":"PORTLAND, Ore. — Incendiary devices were set off Monday at two ballot drop boxes — one in Portland and another in nearby Vancouver, Washington — destroying hundreds of ballots in what one official called a “direct attack on democracy” about a week before a heated Election Day.\n\nThe early morning fire at the drop box in Portland was extinguished quickly thanks to a suppression system inside the box as well as a nearby security guard, police said, and just three ballots were damaged there.\n\nBut within a few hours, another fire was discovered at a transit center drop box across the Columbia River in Vancouver. Vancouver is the biggest city in Washington’s 3rd Congressional District, the site of what is expected to be one of the closest U.S. House races in the country, between first-term Democratic Rep. Marie Gluesenkamp Perez and Republican challenger Joe Kent.\n\nThe ballot box in Vancouver also had a fire suppression system inside, but that failed to prevent hundreds of ballots from burning, said Greg Kimsey, the longtime elected auditor in Clark County, Washington, which includes Vancouver. He urged voters who dropped their ballots in the transit center box after 11 a.m. Saturday to contact his office for a replacement ballot.\n\n“Heartbreaking,” Kimsey said. “It’s a direct attack on democracy.”\n\nThe office will be increasing how frequently it collects ballots and changing collection times to the evening, Kimsey said, to keep the ballot boxes from remaining full of ballots overnight when similar crimes are considered more likely to occur.\n\nBallot drop boxes have faced increasing criticism from Republicans and have been the focus of baseless right-wing conspiracy theories in recent years, tied to former President Donald Trump’s lie that the 2020 election was stolen from him. An Associated Press survey of state election officials across the U.S. found that there were no widespread issues with drop boxes in 2020, and none that could have affected the results.\n\nSix states have banned ballot drop boxes since 2020: Arkansas, Mississippi, Missouri, North Carolina, South Carolina and South Dakota, according to research by the Voting Rights Lab, which advocates for expanded voting access.\n\nWashington and Oregon, which are both vote-by-mail states, have long used ballot drop boxes.\n\nAuthorities said at a news conference in Portland that enough material from the incendiary devices was recovered to show that the two fires Monday were connected — and that they were also connected to an Oct. 8 incident, when an incendiary device was placed at a different ballot drop box in Vancouver. No ballots were damaged in that incident.\n\nThe FBI was also investigating.","summary":"PORTLAND, Ore. — Incendiary devices were set off Monday at two ballot drop boxes — one in Portland and another in nearby Vancouver, Washington — destroying hundreds of ballots in what one official called a &#8220;direct attack on democracy&#8221; about a week before a heated Election Day. The early morning fire at the drop box [&#8230;]","url":"https://www.bostonherald.com/2024/10/28/ballot-boxes-torched/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/AP24302801064336-rotated.jpg?w=1024","video":null,"publish_date":"2024-10-29 00:42:17","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.356},{"id":261454536,"title":"Inside The Washington Post’s decision to scrap presidential endorsements","text":"It came after additional discussion between Bezos and the two Post leaders, Shipley and Lewis, who privately made a case not to abandon the tradition so close to an election. The editorial board had already drafted an endorsement of Vice President Kamala Harris, though Bezos did not read it before his decision, Lewis said in a statement on Saturday.\n\nThe decision by Bezos had been in the making for weeks. It is not clear what motivated his final determination or its timing.\n\nBezos has clashed repeatedly with Harris’ electoral opponent, former president Donald Trump, who for years has been openly hostile to him on social media. In 2019, Amazon sued the Trump administration, blaming Trump’s animosity toward Bezos for its loss of a $US10 billion cloud computing contract.\n\nThe businesses Bezos founded, including Amazon and aerospace company Blue Origin, still compete regularly for lucrative government contracts. Blue Origin executives met with Trump on Friday, and the company has a $US3.4 billion contract with the National Aeronautics and Space Administration to build a lunar lander.","summary":"Jeff Bezos’ decision to end the Post’s decades-long practice exploded into public view last week, sparking fury among reporters, editors, readers and the Watergate journalists.","url":"https://www.smh.com.au/world/north-america/inside-the-washington-post-s-decision-to-scrap-presidential-endorsements-20241029-p5km6r.html","image":"https://static.ffx.io/images/$zoom_0.23098478798450425%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_58%2C$y_52/t_crop_custom/q_86%2Cf_auto/ed1dbf7d690b1086c3f001bc2172b4ed448a7896","video":null,"publish_date":"2024-10-29 00:39:46","author":"Benjamin Mullin,Katie Robertson","authors":["Benjamin Mullin","Katie Robertson"],"language":"en","category":"politics","source_country":"au","sentiment":-0.232},{"id":261455114,"title":"Inside The Washington Post’s decision to scrap presidential endorsements","text":"It came after additional discussion between Bezos and the two Post leaders, Shipley and Lewis, who privately made a case not to abandon the tradition so close to an election. The editorial board had already drafted an endorsement of Vice President Kamala Harris, though Bezos did not read it before his decision, Lewis said in a statement on Saturday.\n\nThe decision by Bezos had been in the making for weeks. It is not clear what motivated his final determination or its timing.\n\nBezos has clashed repeatedly with Harris’ electoral opponent, former president Donald Trump, who for years has been openly hostile to him on social media. In 2019, Amazon sued the Trump administration, blaming Trump’s animosity toward Bezos for its loss of a $US10 billion cloud computing contract.\n\nThe businesses Bezos founded, including Amazon and aerospace company Blue Origin, still compete regularly for lucrative government contracts. Blue Origin executives met with Trump on Friday, and the company has a $US3.4 billion contract with the National Aeronautics and Space Administration to build a lunar lander.","summary":"Jeff Bezos’ decision to end the Post’s decades-long practice exploded into public view last week, sparking fury among reporters, editors, readers and the Watergate journalists.","url":"https://www.brisbanetimes.com.au/world/north-america/inside-the-washington-post-s-decision-to-scrap-presidential-endorsements-20241029-p5km6r.html","image":"https://static.ffx.io/images/$zoom_0.23098478798450425%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_58%2C$y_52/t_crop_custom/q_86%2Cf_auto/ed1dbf7d690b1086c3f001bc2172b4ed448a7896","video":null,"publish_date":"2024-10-29 00:39:46","author":"Benjamin Mullin,Katie Robertson","authors":["Benjamin Mullin","Katie Robertson"],"language":"en","category":"politics","source_country":"au","sentiment":-0.232},{"id":261454846,"title":"Inside The Washington Post’s decision to scrap presidential endorsements","text":"It came after additional discussion between Bezos and the two Post leaders, Shipley and Lewis, who privately made a case not to abandon the tradition so close to an election. The editorial board had already drafted an endorsement of Vice President Kamala Harris, though Bezos did not read it before his decision, Lewis said in a statement on Saturday.\n\nThe decision by Bezos had been in the making for weeks. It is not clear what motivated his final determination or its timing.\n\nBezos has clashed repeatedly with Harris’ electoral opponent, former president Donald Trump, who for years has been openly hostile to him on social media. In 2019, Amazon sued the Trump administration, blaming Trump’s animosity toward Bezos for its loss of a $US10 billion cloud computing contract.\n\nThe businesses Bezos founded, including Amazon and aerospace company Blue Origin, still compete regularly for lucrative government contracts. Blue Origin executives met with Trump on Friday, and the company has a $US3.4 billion contract with the National Aeronautics and Space Administration to build a lunar lander.","summary":"Jeff Bezos’ decision to end the Post’s decades-long practice exploded into public view last week, sparking fury among reporters, editors, readers and the Watergate journalists.","url":"https://www.theage.com.au/world/north-america/inside-the-washington-post-s-decision-to-scrap-presidential-endorsements-20241029-p5km6r.html","image":"https://static.ffx.io/images/$zoom_0.23098478798450425%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_58%2C$y_52/t_crop_custom/q_86%2Cf_auto/ed1dbf7d690b1086c3f001bc2172b4ed448a7896","video":null,"publish_date":"2024-10-29 00:39:46","author":"Benjamin Mullin,Katie Robertson","authors":["Benjamin Mullin","Katie Robertson"],"language":"en","category":"politics","source_country":"au","sentiment":-0.232},{"id":261454392,"title":"Kamala Harris caught on hot mic admitting her campaign needs help appealing to male voters","text":"Vice President Kamala Harris got caught on a hot mic admitting her campaign needs to work on appealing to male voters during a campaign stop over the weekend. \n\nHarris, 60, was sitting at a bar with Michigan Gov. Gretchen Whitmer in Kalamazoo Saturday when she seemed to have forgotten they were surrounded by microphones and cameras, according to footage posted to social media. \n\n“We need to move ground among men,” Harris appeared to tell Witmer over beers at the Trak Houz Bar and Grill. \n\nThe Democratic nominee then looks up and realizes that they being recorded by cameras and microphones.\n\n“Oh, we have microphones in here listening to everything. I didn’t realize that,” Harris says as she turns around while pointing around the room. “OK. So now you’ll tell us.”\n\n“You’ll bleep my F words,” Whitmer jokes. \n\n“We just told all the family secrets. Sh-t,” Harris says laughing. \n\nMany on social media theorized that the “hot mic” moment was staged as a corny joke considering the governor and vice president were both wearing mics clipped onto their clothing and surrounded by boom mics, cameras and reporters for a photo-op. \n\nEven so, Harris’ campaign does need to make up ground on grabbing male voters. \n\nThe vice president lags behind former President Donald Trump, 78, significantly among men.\n\nTrump leads Harris 55% to 41% among male voters in the latest New York Times/Siena College poll published less than two weeks before Election Day.\n\nHarris has a slightly narrower lead among the opposite sex. She takes 54% of female voters to Trump’s 42%, according to the poll. \n\nThe poll, which was conducted from Oct. 20 to 23 among 2,516 registered voters nationwide, has a margin of error of plus or minus 2.2 percentage points.\n\nIt also revealed that the 2024 election is largely a toss-up. Harris and Trump each received 48% support among likely voters, locking the candidates in a dead heat as early voting has already begun in many states.\n\nA spokesperson for the Harris campaign did not return a request for comment.","summary":"\"We need to move ground among men,\" Harris appeared to tell Witmer over beers at the Trak Houz Bar and Grill.","url":"https://nypost.com/2024/10/28/us-news/kamala-harris-caught-on-hot-mic-admitting-her-campaign-needs-help-appealing-to-male-voters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/kamala-harris-caught-hot-mic-92588915.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/DZcie7ay-RyIcpnTz.mp4","publish_date":"2024-10-29 00:38:08","author":"Allie Griffin","authors":["Allie Griffin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.456},{"id":261454442,"title":"Targeting Young Voters: Democrats Launch Digital Ads Against Jill Stein and Cornel West","text":"PHOENIX – Democrats are spending about $500,000 for a last-minute push to persuade voters in battleground states to reject third-party candidates Jill Stein and Cornel West, warning a vote for them will help Republican Donald Trump.\n\nThe Democratic National Committee said Monday that the digital ads will run on Instagram and YouTube, targeting younger voters and college campuses. They use video of Trump from a June rally in Philadelphia, when he said: “Cornel West. He’s one of my favorite candidates, Cornel West. And I like her also, Jill Stein, I like her very much. You know why? She takes 100% from them. He takes 100%.”\n\nStung by narrow losses in 2000 and 2016 that they blame in part on support for Green Party nominees, Democrats have put a major emphasis this year on discouraging left-leaning voters from backing third-party candidates. They pushed back aggressively against No Labels, a nascent third-party movement, and the independent candidacy of Robert F. Kennedy Jr. before turning attention to Stein and West.\n\nStein was the Green Party nominee in 2016 and won 132,000 votes across Wisconsin, Michigan and Pennsylvania. Democrat Hillary Clinton lost by a combined 77,000 votes in those states. This year, Stein has broadened the Green Party’s traditional pro-environment base by fiercely denouncing Israel and its military strikes in Gaza, Lebanon and elsewhere.\n\nCritiques of Israel and support for Palestinians made up the bulk of her 45-minute appearance at a coffee shop in suburban Phoenix on Monday.\n\nStein urged dozens of supporters not to be intimidated by pressure to vote for the “lesser evil” between Trump and Democrat Kamala Harris, alleging both are “ genocidal candidates” because of their support for Israel.\n\n“If we are to be a democracy we have to stand up for what we want,” Stein said. “We have to vote for what we want.”\n\n“There is absolutely nothing to gain by voting for either one of them and there’s everything to lose,” she added. She called the Democratic campaign against her a threat to free speech.\n\nHer campaign manager, Jason Call, was more blunt.\n\n“We want them to lose,” Call said of the Democratic ticket. “Genocide deserves losing.” He added that “nobody wants Trump to win,” but argued the consequences of sending another Democrat to the White House “will be worse than Trump.”","summary":"PHOENIX – Democrats are spending about $500,000 for a last-minute push to&#8230;","url":"https://internewscast.com/local-news/targeting-young-voters-democrats-launch-digital-ads-against-jill-stein-and-cornel-west/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Democrats-go-after-Jill-Stein-Cornel-West-700x430.jpg","video":null,"publish_date":"2024-10-29 00:36:42","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.254},{"id":261454840,"title":"Today Diwali is proudly celebrated in White House: President Biden extends greetings","text":"US President Joe Biden extended Diwali greetings to the people, highlighting its significance, and acknowledged that today, the festival is proudly celebrated in the White House.Highlighting the contributions of the South Asian American community to the fabric of American life, Biden said the community is the fastest-growing and most engaged community in the world.Addressing the White House Diwali Celebrations on Monday (local time), the US President said, “The South Asian American community has enriched every part of American life.”“Yours is the fastest-growing and most engaged community in the world…Now, Diwali is celebrated openly and proudly in the White House,” he added.The President also spoke to the moment’s significance, noting that the country is facing an “inflection point” and reminding attendees not to take the ‘Idea of America’ for granted.Reflecting on the challenges of American democracy, he acknowledged the ongoing debates and dissent inherent in a diverse society but stressed the importance of unity and historical awareness.“This is not my house; this is your house…Today we face an inflection point…Every once in a few generations we are reminded to not take the Idea of America for granted… American Democracy has never been easy. In a country as diverse as ours, we debate, we dissent… but the key is, we never lose sight of how we got here and why,” Biden said.The US President further recalled the time when he and First Lady Jill Biden hosted the first Diwali celebration at the Vice President’s residence in 2016. He touted the diversity of his administration, including current Vice President Kamala Harris as well as US Surgeon General Vivek Murthy.“Only in America is everything possible,” Biden said at the end.Over the years, the Bidens’ Diwali celebration has added a unique touch to this luminous tradition. The celebration, characterised by lights, colour, music, and dancing, also features traditional performances and dancers.Diwali events at the White House began with President George W Bush in 2003 and have included President Barack Obama lighting a diya in the Oval Office, as well as then-Vice President Biden hosting a reception in 2016.President Donald Trump continued the Diwali tradition in 2017 by lighting a diya alongside his daughter Ivanka and Indian American members of his administration. However, in 2018, the crucial midterm elections disrupted the 15-year-long tradition of formal Diwali celebrations at the White House.","summary":"The News Mill","url":"https://thenewsmill.com/2024/10/today-diwali-is-proudly-celebrated-in-white-house-president-biden-extends-greetings/","image":"https://cdn.shortpixel.ai/spai/q_lossy+ret_img+to_webp/thenewsmill.com/wp-content/uploads/2022/12/ANI-News-Logo-96x96.jpg","video":null,"publish_date":"2024-10-29 00:33:30","author":"ANI","authors":["ANI"],"language":"en","category":"politics","source_country":"in","sentiment":0.048},{"id":261455166,"title":"Amid Row Over Hitler Remark, Trump Says He Is \"Not A Nazi\"","text":"Donald Trump told campaign supporters Monday in swing state Georgia that he is \"not a Nazi,\" pushing back on critics' accusations that the Republican is seeking to be an authoritarian American leader.\"I'm not a Nazi. I'm the opposite of a Nazi,\" Trump told a boisterous crowd in Atlanta, one day after he held a mega-rally in New York's famed Madison Square Garden that was widely condemned for racist remarks that his allies made during the event.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"Donald Trump told campaign supporters Monday in swing state Georgia that he is \"not a Nazi,\" pushing back on critics' accusations that the Republican is seeking to be an authoritarian American leader.","url":"https://www.ndtv.com/world-news/amid-row-over-hitler-remark-donald-trump-says-he-is-not-a-nazi-6896523","image":"https://c.ndtvimg.com/2024-05/hnhhqieg_donald-trump-afp_625x300_31_May_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-10-29 00:31:45","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.24},{"id":261454644,"title":"Editorial: The Race To The White House Gets Tighter","text":"With just about a week left for the US presidential election, the race between Vice President Kamala Harris and former President Donald Trump is tighter than ever before. The Democratic and Republican candidates respectively are neck and neck, and most polls suggest that it is too close to call, though till recently Harris enjoyed a slight edge. Now, however, the momentum seems to have shifted to Trump. The seven swing states with 90 electoral college votes that will play a key role in the election are Nevada, Georgia, Wisconsin, Michigan, Pennsylvania, North Carolina and Arizona. For the traditional White voter, Trump still offers hope with his Make America Great Again (MAGA) campaign. Whether the USA is ready to accept a woman and one of colour as the next head of state remains to be seen. Their politics are vastly different as is evidenced by Trump’s threats to root out all illegal immigrants, crack down on the media and his critics and his soft attitude to Vladimir Putin vis-a-vis Ukraine. He has vowed to stop arming Ukraine if he becomes President. His cavalier attitude to climate action was evident in his first Presidency when he withdrew from the Paris accord. His erstwhile Chief of Staff has revealed his ‘fascistic’ tendencies, his admiration for Hitler and a wish to have subservient generals. His views on abortion are diametrically opposed to Harris’ opinion on the sensitive issue. Harris has called for a humane immigration policy. Both the Democrats and Republicans support Israel but at least the Biden administration has urged Tel Aviv to step back on its attacks on Palestine and has even threatened to stop arms supplies. Trump, on the other hand, is avowedly pro-Israel and sees no justification in the Palestine cause. He also justifies Israeli action on Iran.\n\nApart from foreign policy issues, on domestic policy Trump is becoming increasingly strident in his opposition to illegal immigrants as seen by his bizarre supposition during his one and only debate with Kamala Harris that Haitian immigrants were eating people’s pets in Springfield, Ohio. Though his outrageous claim was fact-checked, vast swathes of America are swayed by such fake news. Harris also is at a disadvantage as she entered the election race late given that Joe Biden was supposed to be the Democratic candidate till his campaign imploded after his first debate with Donald Trump where he appeared weak, bumbling and quite incoherent. The Democratic Party then urged him to step down and Biden endorsed Harris as the most suitable candidate for the presidential race. Harris has had her share of detractors and critics who have painted her as an inept vice president and someone incapable of handling tough issues. However, as her performance in her debate with Trump showed she can more than hold her own. She succeeded in getting major funding for her campaign and also garnered celebrity endorsements. For the vast majority of liberal America she is the obvious choice as the alternative is a Trump presidency which may well result in chaos. However, even Black Americans and Hispanics are not fully behind Harris. Her last-minute bid to gain their support may or may not succeed. In the ultimate analysis, it is the turnout on voting day that will make the difference. Who will be the leader of the so called free world? The two choices before the American people are a narcissistic, self-absorbed tyrant or a woman who has worked her way up in the American system through grit and determination.\n\nFor India under the BJP dispensation a Trump Presidency is probably more advantageous. The present tension over the alleged murder attempt on Khalistani activist Gurpatwant Singh Pannun and the supposed involvement of an Indian security official has created some friction in relations with the Biden administration. Harris’ Indian connection is unlikely to mark any significant shift in the Democratic establishment’s stated policies. Trump has praised Narendra Modi in the past but his views on tariffs and trade are quite unfavourable to India. The world is watching with bated breath as the most significant election of the year unfolds. In Europe and Britain a Trump presidency will mark doom given his views on NATO and Ukraine. He is the great disruptor that the world is hoping will not cross the finish line. In the event of a Harris win, the Republican camp is unlikely to take the result lying down. There will be legal challenges and the US is also bracing for a repeat of the January 6, 2021 attack on the Capitol. Interesting times are ahead for America and the world.","summary":"","url":"https://www.freepressjournal.in/analysis/editorial-the-race-to-the-white-house-gets-tighter","image":"https://media.assettype.com/freepressjournal/2024-07/040d1d72-6013-49ce-89ff-172706420c74/kamala trump.jpg","video":null,"publish_date":"2024-10-29 00:30:00","author":"Fpj Editorial","authors":["Fpj Editorial"],"language":"en","category":"politics","source_country":"IN","sentiment":-0.053},{"id":261455478,"title":"Democrats go after Jill Stein, Cornel West in digital ads aimed at young voters","text":"Democrats are spending about $500,000 for a last-minute push to persuade voters in battleground states to reject third-party candidates Jill Stein and Cornel West, warning a vote for them will help Republican Donald Trump.\n\nThe Democratic National Committee said Monday that the digital ads will run on Instagram and YouTube, targeting younger voters and college campuses. They use video of Trump from a June rally in Philadelphia, when he said: “Cornel West. He’s one of my favorite candidates, Cornel West. And I like her also, Jill Stein, I like her very much. You know why? She takes 100% from them. He takes 100%.”\n\nStung by narrow losses in 2000 and 2016 that they blame in part on support for Green Party nominees, Democrats have put a major emphasis this year on discouraging left-leaning voters from backing third-party candidates. They pushed back aggressively against No Labels, a nascent third-party movement, and the independent candidacy of Robert F. Kennedy Jr. before turning attention to Stein and West. \n\nStein was the Green Party nominee in 2016 and won 132,000 votes across Wisconsin, Michigan and Pennsylvania. Democrat Hillary Clinton lost by a combined 77,000 votes in those states. This year, Stein has broadened the Green Party's traditional pro-environment base by fiercely denouncing Israel and its military strikes in Gaza, Lebanon and elsewhere.\n\nCritiques of Israel and support for Palestinians made up the bulk of her 45-minute appearance at a coffee shop in suburban Phoenix on Monday. \n\nStein urged dozens of supporters not to be intimidated by pressure to vote for the “lesser evil\" between Trump and Democrat Kamala Harris, alleging both are “ genocidal candidates” because of their support for Israel.\n\n“If we are to be a democracy we have to stand up for what we want,” Stein said. “We have to vote for what we want.” \n\n“There is absolutely nothing to gain by voting for either one of them and there's everything to lose,” she added. She called the Democratic campaign against her a threat to free speech. \n\nHer campaign manager, Jason Call, was more blunt.\n\n“We want them to lose,” Call said of the Democratic ticket. “Genocide deserves losing.” He added that “nobody wants Trump to win,” but argued the consequences of sending another Democrat to the White House “will be worse than Trump.”","summary":"Democrats are spending about $500,000 for a last-minute push to persuade voters in battleground states to reject third-party candidates Jill Stein and Cornel West","url":"https://www.independent.co.uk/news/jill-stein-ap-democrats-cornel-west-donald-trump-b2637155.html","image":"","video":null,"publish_date":"2024-10-29 00:26:32","author":"Jonathan J. Cooper","authors":["Jonathan J. Cooper"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.254},{"id":261453874,"title":"Hitler murdered my family — comparing him to Trump is a despicable lie","text":"As the grandchild of four now-passed beautiful, loving, sweet Holocaust survivors, it’s hard to describe how painful it is for me to hear, read or type the name Adolf Hitler.\n\nHe is the monster that brutally murdered most of my family. And no one has ever come closer to completely wiping the Jewish people off of the face of the earth.\n\nNevertheless, I summon the strength to say his name here, very specifically to address those who find it all too easy to yell “Hitler!” for callously hyper-partisan reasons.\n\nSuch casual use of Hitler’s name and imagery is a despicable insult to the memories of my gassed-to-death great-grandparents, my many great uncles and aunts, and to all 6 million victims of this fiend’s incomparable genocidal brutality.\n\nIt is nothing short of psychotic to compare the architect of those atrocities to Donald Trump.\n\nBut it’s exactly what Eric Orts, a University of Pennsylvania law professor and former Paul, Weiss attorney, did on LinkedIn last week.\n\nOrts, who specializes in ethics, posted a now-deleted image of Trump and Hitler side by side, followed by a shockingly absurd and unsupported demand that we can only avoid a Hitleresque scenario in the United States by voting in Kamala Harris.\n\n-I shudder to think how Orts might address students in his classroom who might dare to disagree with his rhetoric and believe — along with half of the country — that Trump is the better candidate.\n\nAfter all, Orts has already used a comparison to Hitler to make his point. \n\nIf I were a 20-year-old, I’d probably be too scared to say anything that my professor had already declared would make me a fascist pariah.\n\nBut then, shutting down opposing views before they can even begin to sprout is the whole point, isn’t it? Any means to an end.\n\nEven if it means spewing the most vicious hyperbole imaginable to terrify people into agreeing with you.\n\nWell, I will not sit idly by when anyone uses my family’s murders at the hand of the actual Adolf Hitler to score political points.\n\nYou mock my family, and the memory of 6 million Jewish souls, when you compare that grotesquely unparalleled genocide to the actions of any American politician.\n\nThis slander did not begin with Donald Trump, of course: Casually and recklessly throwing around Hitler’s name has long been a leftist pastime.\n\nBut it has now become ubiquitous — and increasingly dangerous.\n\nVice President Kamala Harris has repeatedly likened Trump to Hitler and fascists. Early Sunday, Tim Walz compared Trump’s campaign rally at Madison Square Garden to a Nazi rally held at the venue in 1939. \n\nHilary Clinton did the same, and MSNBC even spliced clips from that long-ago event into its coverage.\n\nYet thousands of Jewish New Yorkers attended the rally. Israeli flags proudly flew both inside and outside the arena, and Hasidic Chabad volunteers were there to beautifully wrap tefillin (Jewish prayer garb) around the arms of rally attendees.\n\nA Nazi rally with Israeli flags flying peacefully and Jews openly praying?\n\nStill, media hack Catherine Rampell of The Washington Post recently warned her readers: “Don’t scoff at the Hitler comparisons, Trump’s rhetoric is that bad.” CNN has ubiquitously shared the trope. The Guardian followed suit.\n\nIt goes on and on.\n\nThis spring an honors student thesis entitled “An Exploration of Trump’s and Hitler’s Rise to Power” was accepted by Gardner-Webb University and published in an academic journal.\n\nRidiculously, the thesis argued that “Trump and Hitler ascended to power in very similar ways,” and repulsively compared Hitler’s “Mein Kampf” to Trump’s 2020 State of the Union Address.\n\nShame on the academic advisers — Professor Elizabeth Amato and Dr. Wilson Hawkins — who oversaw and encouraged this hideous project and elevated it to “scholarship” status that is now widely distributed in academic circles.It shocks the conscience that we actually do live in a world where people like the rapists, baby burners and genocidal mass murderers of Hamas really do hold an ideology comparable to Hitler’s.\n\nThat Americans are comparing their political adversaries, and not terror groups like Hamas, to a monster like Hitler is outrageous and deeply deflating.\n\nJewish people have had an extremely rough couple of years. Trump has nearly been assassinated — twice.\n\nThe rhetoric must change. \n\nWe must stop comparing our political opponents to a man who wiped out nearly half of the Jews in the world. \n\nNot only is it dishonest and downright revolting to all decent people, it’s also deeply offensive to the victims of Hitler and their families — and dangerous to those who run for office.\n\nJeffrey Lax, a professor of law and chair of the business department at CUNY, is co-founder of S.A.F.E. Campus.","summary":"It is nothing short of psychotic to compare the architect of the Holocaust's atrocities to Donald Trump.","url":"https://nypost.com/2024/10/28/opinion/hitler-murdered-my-family-tying-him-to-trump-an-evil-lie/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-wf5owcef3-1730156643044.jpg?quality=75&strip=all&1730142305&w=1200","video":"https://cdn.jwplayer.com/videos/4NSNXCxc-RyIcpnTz.mp4","publish_date":"2024-10-29 00:23:50","author":"Jeffrey Lax","authors":["Jeffrey Lax"],"language":"en","category":"politics","source_country":"us","sentiment":-0.361},{"id":261453584,"title":"We need more ‘grown-up’ Democrats like Mayor Adams","text":"One of the greatest things about Mayor Adams is how he stands up and calls out bull when he hears it — the latest being his damning remarks on Democrats’ closing “argument” of calling Donald Trump a “fascist” and even “Hitler.” \n\n“I know what Hitler has done, and I know what a fascist regime looks like,” he said Saturday at a press conference on security measures for Trump’s MSG rally. “I think, as I have called for over and over again, that the level of conversation, I think we can all dial down the temperature.”\n\nAfter two assassination attempts, that certainly makes sense.\n\nPlus, it’s just good political advice: Kamala Harris’ own super PAC has been pushing the Harris-Walz campaign to drop this name-calling in favor of something that might actually make the case for electing her.\n\nIndeed, Adams was also spot-on when he slammed the rally’s horrible opening act, “comedian” Tony Hinchcliffe, who seemed to think raw bigotry counts as humor.\n\nEric Adams isn’t a guy to echo anyone’s party line. \n\nNot when he was running back in 2021 and warned, “America is failing in running cities” — an implicit slap at the progressives who’ve led the way in that failure. \n\nNot after the Oct. 7 attack on Israel, when he headlined the “New York Stands With Israel” rally and damned how “right here in the city of New York you have those who celebrate” the atrocities and vowed: “We will not be all right until every person responsible for this act is held accountable.”\n\nAnd again this spring, after the NYPD answered Columbia University’s request for help in ending the pro-Hamas campus occupation, when he slammed “those who came to the city to disrupt our city” and took pride in showing New York’s Finest restoring the American flag, where protesters had imposed a Palestinian one: “That’s our flag, folks. You don’t take over our buildings and put another flag up. It may be fine to other people, but it’s not to me.”\n\nProgs vilify Adams for being out of step with the Democratic Party’s leftward march; they (and the Biden-Harris folks) were furious when he started calling out the illegal-migrant crisis’ baneful impact on New York City.\n\nAdams’ straight-shooting has the berserk left crying for his head, but the Democratic Party needs more grownups like him — and a lot fewer “go with the flow” hacks.\n\nAnd what a contrast with Gov. Hochul, who never full-on faces down the hard left.\n\nNot the pro-crime progs in the Legislature, nor the raging antisemites on the streets and campus: Just look at the weak-tea report she ordered up on facing down Jew-hatred at CUNY.\n\nAdams is also a true free-speech supporter, saying Saturday he “strongly disagree[s]” with those calling for the rally to be scrapped: “This is America. This is New York, and I think it’s important that we allow individuals to exercise their right to get their message clear to New Yorkers,” he said. \n\n“And our job as a city and as a Police Department is to make sure they can do that in a peaceful, in a peaceful way.”\n\nMission accomplished again, Mr. Mayor — and here’s hoping the rest of your party can learn a few lessons in what real leadership looks like.","summary":"Mission accomplished again, Mr. Mayor — and here's hoping the rest of your party can learn a few lessons in what real leadership looks like.","url":"https://nypost.com/2024/10/28/opinion/we-need-more-grown-up-democrats-like-mayor-adams/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/shutterstock_editorial_Briefing_on_Security_Preparati_14826032a-e1730161194890.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/yWGynhLz-RyIcpnTz.mp4","publish_date":"2024-10-29 00:21:20","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.392},{"id":261454144,"title":"The Right Is Already Saying the Election Is Rigged","text":"The election is rigged. Democrats are already working to steal the election from Donald Trump, and the results are going to be illegitimate. That is, unless Trump wins. This is the message that has been percolating through segments of the online right. Over the past several weeks, conservative figures ranging from the fringe to the mainstream have been priming their audiences to declare fraud should the election not go their way. “The Democrats are rigging the 2024 election just like they did in 2020,” Laura Loomer, a right-wing troll and Trump ally, posted on the messaging app Telegram earlier this month. “From illegal voter registrations in Arizona, to widespread mail-in ballot fraud and encouraging democrats to flood the polls with illegal alien voters, they’re setting the stage to steal key swing states.”\n\nDemocrats “will be stealing Wisconsin and Michigan,” Owen Shroyer, the far-right host of the Infowars show, War Room, said on air last week. “I’d say that’s all but guaranteed at this point.” He then moved on to question why results might not be available on election night as they were in years prior to the rise of mail-in ballots (which take more time to count and process), a common right-wing line intended to further call the election’s integrity into question. The idea is that it’s supposedly fishy that votes now take longer to count, as though election fraud is something that cannot be done rapidly, but must be carefully aged like a delicate French cheese.\n\nEven by the standards of the fringier segments of the right, Loomer and Shroyer are known for saying outrageous and polemic things. Still, more mainstream figures are also trying to more gently push the idea that election-security flaws may exist that could jeopardize the results. Fox News’s Jesse Watters accused Democrats of “trying to make elections less secure” on a segment during his show earlier this month. On Infowars, Representative Marjorie Taylor Greene claimed that voting machines were changing voters’ intended ballot choices in a reliably red, mostly rural county in Georgia. “I will be working to investigate this issue and ensure the integrity of our elections in Georgia,“ she later posted.\n\nThe claims fall into several rough categories that range from soft attempts to undermine the credibility of the election to outright conspiracy theories: that there are voting irregularities that suggest something is amiss, that the time it will take for results to be tallied is suspiciously long, that Democrats are encouraging explicit voter fraud, that a conspiracy is afoot to let noncitizens vote and potentially sway the election. But there is no evidence that the election is being rigged.\n\nGiven that the MAGA right seeded election denialism after Trump lost his bid for the presidency in 2020, such claims are is not surprising. Some kind of “Stop the Steal” redux has long seemed almost inevitable. Less obvious is what the downstream impacts will be. Claims that noncitizens are voting have already led to the erroneous removal of registered voters from the polls, as seen in Texas, but other effects are less clear. Intelligence officials have warned that they anticipate violence around the election. But what does that actually look like, especially if Trump loses?\n\nIn 2020, a series of escalating protests in Washington, D.C., culminated in the attack on the Capitol after the turn of the new year. January 6 was energized and encouraged by right-wing protests against COVID-era lockdowns in statehouses across the United States. A protest of hundreds of MAGA protestors had already happened in D.C. by this time in 2020. They served as dry runs for the big one.\n\nThis time around, nothing like this has happened in the lead-up to Election Day. Although the past year has seen notable far-right mobilization and activity, and Trump attracts large crowds at his rallies, it hasn’t reached the levels it did in 2020. There haven’t been practice protests across the country that could build up to a massive moment. A January 6-style event is possible, but it would require an abrupt shift in energy, and the will to mobilize would have to materialize almost immediately. And such mobilization would have to happen in a world where people have seen the consequences of January 6, understanding that they could face prosecution and convictions as well.\n\nThe right “can’t create momentum out of thin air,” Hannah Gais, a researcher at the Southern Poverty Law Center, told me. Still, even if there isn’t energy in the streets, there is momentum online to reject a Trump loss, and that probably is going to escalate. This rhetoric will likely be translated into violence, just not the Capitol-riot kind. Gais fears that the spike in violent rhetoric encouraged by claims of election fraud could spur unpredictable, isolated instances of violence across the country, instead of large, organized January 6-style ones.\n\nThe intelligence community is similarly worried. In a memo, reported on by Wired, the Department of Homeland Security’s Office of Intelligence and Analysis is concerned about an increased “risk of violence against government targets and ideological opponents,” heightened by the election season. According to the report, analysts have seen online discussions “preparing for future violence against public officials and federal agents.”Now more and more people, especially on the right, are openly fantasizing about subjecting their enemies to violent retribution, and in some cases, are actually already doing it\n\nThese fantasies are now starting to edge their way into reality. Last week, a man punched a poll worker after the official asked him to remove his MAGA hat to comply with electioneering laws. On Monday, hundreds of ballots were destroyed after ballot drop boxes were set on fire in Portland, Oregon and Vancouver, Washington.\n\nOther recent political violence has been more concerning. Earlier this year, a man in Pennsylvania beheaded his federal-employee father and called on others to kill federal employees. In a separate incident, a man in Arizona planned a mass shooting at a rap concert in an attempt to start a race war before the election. These events happened months ago, before the election was in full swing and before people started making unfounded claims about it being rigged. Should Trump lose on November 5, Loomer, Shroyer, Greene, and the like are laying the groundwork for very dark things to happen.","summary":"The next “Stop the Steal” movement has begun.","url":"https://www.theatlantic.com/technology/archive/2024/10/election-denial-stop-steal-trump-harris/680436/","image":"https://cdn.theatlantic.com/thumbor/kMC5HpEpxzGUGGE1WJUcYyYgoFs=/0x57:2696x1461/1200x625/media/img/mt/2024/10/2024_10_28_1240195263/original.jpg","video":null,"publish_date":"2024-10-29 00:19:00","author":"Ali Breland","authors":["Ali Breland"],"language":"en","category":"politics","source_country":"US","sentiment":-0.472},{"id":261453360,"title":"MAUREEN CALLAHAN: Michelle Obama hints at the election outcome. Just listen to the straightforward facts…","text":"Tight as the polls are, it feels like Donald Trump will win.\n\nAfter all, why else would the left-wing media call him Hitler?\n\nWhy else would MSNBC shamelessly intersperse footage of the 1939 Nazi rally at Madison Square Garden with Trump’s Sunday MSG event, overflowing with middle and working-class voters — in effect, calling those voters Nazis?\n\nWhy else would the New York Times plaster the front page of its Sunday op-ed section with huge block type, font size otherwise reserved for the outbreak of world wars, to what Trump will do if he wins — including ‘USE SOLDIERS AGAINST CITIZENS’?\n\nNot to mention the furor over the refusal by both the L.A. Times and Washington Post (owned by Amazon’s Jeff Bezos) to endorse either candidate, which sent the left into a tizzy of canceled subscriptions and social-media virtue-signaling.\n\nAuthor Stephen King: ‘After five years, I have cancelled my subscription to the Washington Post’ — a statement King posted on X, which happens to be owned by another Trump-supporting billionaire. The left can’t win for trying.\n\nYes, even WaPo — its none-too-subtle motto ‘Democracy Dies in Darkness’ born after Trump’s 2016 victory — has perhaps rethought the stakes.\n\nWhat does it say when two of America’s largest left-leaning newspapers can’t, or won’t, endorse Kamala Harris over Trump? A man we are told is an irredeemable racist, sexist, xenophobe who poses a threat unlike any we have ever confronted?\n\nHere’s exactly what it says: Billionaire businessmen know a loser when they see one.\n\nThis weekend, Harris was the subject of a lengthy New York Times profile, informed by 100 friends and colleagues who also seemed incapable of offering a full-throated endorsement. In particular, they noted that ‘she was not a gifted student’ in law school, and that her 2019 presidential run ‘revealed a person for whom… politics did not come naturally. She struggled to define herself ideologically.’\n\nAs she still does, a struggle that’s excruciating to watch. But of course, this NYT piece, ‘The World According to Kamala Harris’, argued that as a woman of color, everything has been harder for Kamala Harris.\n\nExcuse me? Let’s get real: Identity politics might be the only reason this unimpressive, unintellectual Queen of Word Salad has risen far above her capabilities to potentially become president of the United States.\n\nAs Kamala would say: Let’s understand how we got here.\n\nDuring a 2020 presidential debate, Joe Biden got backed into promising a female running mate, and Harris — who had all but called Biden a racist during her own failed campaign — was right there, willing to forgive and forget, if not acknowledge that she never believed what she’d said in the first place.\n\nJill Biden has reportedly never forgiven her. Does anyone really think that she and Joe, still smarting over his forced ouster, want Harris to win?\n\nThe Bidens, the billionaire class and rational voters everywhere all know that Trump isn’t going to unleash the military on U.S. citizens, or ‘be a dictator on day one’, or prosecute his political enemies.\n\nHell — Trump even said he’d consider pardoning Hunter Biden if elected!\n\n‘I wouldn’t take it off the books,’ Trump told radio host Hugh Hewitt last week. ‘Unlike Joe Biden, despite what they’ve done to me, where they’ve gone after me so viciously… I happen to think it’s very bad for our country.’\n\nLook at that. If only the left-leaning media would amplify that message. Instead, we got Michelle Obama stumping for Harris over the weekend, remonstrating the crowd much as her husband has been unsuccessfully doing to black male voters.\n\n‘I hope you’ll forgive me,’ Michelle said in Kalamazoo, Michigan on Saturday, ‘if I’m a little frustrated that some of us are choosing to ignore Donald Trump’s gross incompetence while asking Kamala to dazzle us at every turn.’\n\nDazzle us? At this point, we’re just looking for a coherent, specific answer to any question. Just one.\n\nBut in Michelle’s telling, voters who are concerned about the border crisis, rising crime, the affordable housing shortage, and a Middle East on fire just need to lower their expectations.\n\n‘We pick apart Kamala’s answers from interviews that [Trump] doesn’t even have the courage to do,’ she continued.\n\nPlease. Trump sat down for three hours with Joe Rogan last week, an appearance that has already racked up over 34 million views on YouTube alone. And this billionaire spoke the lingua franca of his working-class supporters: MMA fighters, what he learned about UFOs, and his sheer awe at moving into the White House and standing in the Lincoln bedroom.\n\nTrump also noted that, unlike Harris, he can speak discursively before circling back to his initial thought — what he calls ‘the weave’.\n\nThe vice president, he said, ‘couldn’t put two sentences together’.\n\nThat is some plain-spoken truth. It certainly lands better than hysterical cries of fascism.\n\nHarris has an open invite to do Rogan’s show — but she won’t, because she can’t speak that for long, that extemporaneously, and everyone knows it.\n\nShe didn’t have the guts to show up at the Al Smith charity dinner earlier this month, as presidential candidates of every party (save Walter Mondale in 1984) historically have done. Even Trump and Hillary appeared together in 2016 — and that was at the height of ‘lock her up!’\n\nThis year, comedian and host Jim Gaffigan spoke for the pols and power brokers in that room.\n\n‘Why is Vice President Harris not here? I mean… this is a room full of Catholics and Jews in New York City. This is a layup for the Democratic nominee’.\n\nEven Kamala’s own events aren’t about her anymore. Last week’s campaign headlines were dominated by Bruce Springsteen and Beyoncé, who finally appeared at a rally to endorse but did not perform – again.\n\nHave we heard anything new — anything? — from Kamala herself? Or anything that sounds honest? She has never really answered to what she knew and when about President Biden’s cognitive decline.\n\nNor could she answer a simple question, at CNN’s town hall last week, about the one piece of dream legislation she’d love to pass.\n\nTo the poli-sci professor named Carol who had dared to ask, we got this: ‘Well, there’s not just one. I have to be honest with you, Carol. Um, there’s a lot of work that needs to happen but let’s, let’s — I think that maybe part of this, the point that I — how I think about it is, we’ve got to get past this era of politics and partisan politics slowing down what we need to do in terms of progress in our country.’\n\nYet, per the Obamas, the fault is ours for not abiding this inanity.\n\nAnd, of course, Kamala has not been asked once about her husband, Doug, whose ex-girlfriend has accused him of slapping her in the face so hard she spun around — in public, outside an A-list gala — and of impregnating the nanny during his first marriage.\n\nInstead, Harris gets to return, over and over again, to her assertion that she is a protector of girls and women, a claim much of the mainstream media happily promotes.\n\nTruly, this is an election between the out-of-touch elites and the everyman – but only one is speaking clearly.","summary":"Tight as the polls are, it feels like Donald Trump will win.&#8230;","url":"https://internewscast.com/news/maureen-callahan-michelle-obama-hints-at-the-election-outcome-just-listen-to-the-straightforward-facts/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-MAUREEN-CALLAHAN-Michelle-Obama-just-dropped-a-800x430.jpg","video":null,"publish_date":"2024-10-29 00:17:47","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.177},{"id":261453250,"title":"Trump's New York Rally Was Moment That Ended His Campaign: Geraldo Rivera","text":"The former Fox News host and one-time Trump supporter Geraldo Rivera said Monday that he thinks Donald Trump's rally at Madison Square Garden on Sunday will be remembered as the moment that ended his 2024 campaign.\"I think it will be famous for ending President Trump's meteoric campaign to be reelected,\" Rivera told CNN's Wolf Blitzer. \"I think that the surveys, the polls will show that this was the time, this was the moment where things turned on Donald Trump.\"Rivera tore into the comedian and podcast host Tony Hinchcliffe, who spoke at Trump's rally on Monday and drew swift backlash for describing Puerto Rico as a \"floating island of garbage.\" Hinchcliffe also made a number of other racist jokes about Hispanics, Jews, and Black people.\"The first thing I thought of when I heard him was, how dare he?\" Rivera said. \"A floating island of garbage?\"He went on to reference Trump's xenophobic and anti-immigrant comments, including his claim that migrants are \"poisoning the blood\" of the country; that migrants who commit murder introduce \"bad genes\" into the country; and his pledge to ramp up deportations from his first day in office.\"There is no reason a Latino American should vote for Donald Trump,\" Rivera told Blitzer. \"He has disqualified himself by surrounding himself with hateful, ugly rhetoric. These racist remarks have divided this nation. They've made people feel embattled. They've made people worry about their future, their children. It is something that is beyond the pale.\"Rivera, who is now a contributor on News Nation, went on to say that Trump's comments are \"not politics ... This is hate speech, and I have had it.\"\"You know, Madison Square Garden is famous for a lot of things,\" he continued. \"I think it will be famous for ending President Trump's meteoric campaign to be reelected. I think that the surveys, the polls will show that this was the time, this was the moment where things turned on Donald Trump.\"Rivera also came out swinging Sunday evening against the candidate he once supported, following Hinchcliffe's description of Puerto Rico as a \"floating island of garbage.\"\"F--k these racists,\" he wrote on X, formerly Twitter. \"Latino men of good will, have pride in yourselves and your ancestors. A vote for Trump is a vote against self-respect.\"Hinchcliffe defended his remarks after drawing intense backlash from the public and from politicians, including those in New York, which is home to more than one million Puerto Ricans.\"These people have no sense of humor,\" Hinchcliffe wrote on X. \"Wild that a vice presidential candidate would take time out of his 'busy schedule' to analyze a joke taken out of context to make it seem racist.\"The Trump campaign, meanwhile, distanced itself from Hinchcliffe amid the backlash.\"This joke does not reflect the views of President Trump or the campaign,\" said Danielle Alvarez, a senior advisor for the campaign.Trump's running mate, Ohio Senator JD Vance, said during a rally Monday that he hadn't heard Hinchcliffe's joke but said people should \"stop getting so offended.\"\"Maybe it's a stupid, racist joke,\" he said. \"Maybe it is not. But we have to stop getting so offended at every little thing can a United States of America.\"","summary":"Rivera came out swinging against Trump, saying Trump's New York rally effectively killed his campaign.","url":"https://www.newsweek.com/geraldo-rivera-donald-trump-msg-rally-puerto-rico-1976328","image":"https://d.newsweek.com/en/full/2222781/fox-news-co-host-rips-republicans-nra-remarks.jpg","video":null,"publish_date":"2024-10-29 00:17:03","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.172},{"id":261453434,"title":"Harris hitting every battleground state, hoping to drive turnout","text":"Vice President Kamala Harris will visit every battleground state in the final week before Election Day, with a focus on female voters who she hopes will propel her to the White House. The campaign has directed several messages to female voters in recent days, reminding them that what happens in the voting booth is a secret.A Democratic ad released Monday delivers the message: \"You can vote any way you want and no one will ever know.\" On Saturday in Kalamazoo, Michigan, former first lady Michelle Obama reminded women that \"we are more than just baby making vessels.\" \"If you are a woman who lives in a household of men that don't listen to you or value your opinion, just remember that your vote is a private matter,\" Obama said in the battleground state. A voter CBS News met at the rally said she's heard from a number of female Republicans who will vote Democrat. \"There's been kind of a little under campaign going about,\" she said. \"You can vote and no one knows your vote. And it's been aiming at women.\"Four first-time female voters all said the top issue for women their age is abortion and reproductive rights. Harris told CBS News in an interview Saturday that she would restore Roe v. Wade if she wins the election. \"I support Roe v. Wade being put back into law by Congress, and to restore the fundamental right of women to make decisions about their own body. It is that basic,\" Harris said. Harris skirted the question about whether she supports abortion restrictions after fetal viability, generally considered to be between 22 and 24 weeks of pregnancy. \"We would not be debating this if Donald Trump had not hand-selected three members of the United States Supreme Court with the intention they would undo the protections of Roe v. Wade,\" she said, noting that women have died because of restrictions that have been enacted since the rollback. \"We have seen women who are experiencing a miscarriage around a pregnancy they prayed for and being denied healthcare because doctors are afraid they're going to go to prison, and those women developing sepsis,\" she said. \"We have seen extraordinary harm and pain and suffering happen because of what Donald Trump did in intending and effectuating and overturning of Roe v. Wade. Yes, my first priority is to put back in place those protections and to stop this pain and to stop this injustice that is happening around our country.\" She also urged Americans not to take former President Donald Trump at his word when he denies that he would support a national abortion ban. \"He says everything,\" Harris said. \"Come on, are we really taking his word for it? He said that women should be punished. He has been all over the place on this.\" With polling showing some of Harris' early gains have slowed and that the race for the presidency is essentially a dead heat, Harris said she doesn't put too much stock in the polls.\"I think, certainly, polling is a measure, but to be frank, if I'd listened to polls I would have never run for my first or second office,\" she said. \"Wouldn't be here talking with you.\"She pointed to record turnout for early voting in North Carolina and Georgia as a sign of enthusiasm.Asked if, considering how late in the process she became the Democratic nominee, she felt she had sufficient time to make her case to the American people, Harris responded, \"I'm gonna make the most of the time I have.\"","summary":"The campaign is reminding women that all votes are secret.","url":"https://www.cbsnews.com/news/kamala-harris-michigan-first-time-women-voters-abortion/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/28/f74aef1b-617f-4e87-aaeb-8b9113fa2d20/thumbnail/1200x630/24f93e204e0833f27c0da619748389a1/1730158135467.png?v=17b612a59ff4c1e4774d3d0d3ec005e8","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3298033_hls/master.m3u8","publish_date":"2024-10-29 00:15:58","author":"Norah O'donnell","authors":["Norah O'donnell"],"language":"en","category":"politics","source_country":"US","sentiment":-0.118},{"id":261453536,"title":"The dramatic final full week of the presidential campaign: watch this","text":"Uncertainty reigns entering the final full week of the 2024 campaign with Democrat Kamala Harris and Republican Donald Trump locked in a fiercely competitive presidential contest. What happens in the coming days will be pivotal in deciding the winner.\n\nCan Trump stay on message (relatively speaking)?\n\nEven before the week began, Trump’s campaign risked being knocked off course by controversy. A rally at New York City’s Madison Square Garden late Sunday that was meant to serve as a closing message was instead overshadowed by racist insults, including a comedian who called Puerto Rico a “floating island of garbage.”\n\nAnd with eight days to go until Election Day, history suggests Trump is virtually guaranteed to say or do something else controversial in the final stretch. The only question is whether it will break through.\n\nIf there’s one thing we know, it’s that Trump cannot help himself. He’s been using authoritarian-style rhetoric in recent days to suggest that his Democratic opponents, whom he calls “ the enemy within,” are more dangerous to the nation than the threat posed by Russia and China.\n\nDemocrats will be combing through every Trump interview and public appearance for something similar to exploit. There are also multiple ongoing criminal investigations into Trump, who has already been convicted of 34 felony charges, that could reveal new information.\n\nYet Democrats are the first to admit that voter opinions of Trump is so hardened that it would take something truly stunning to change the course of the election.\n\nThere is precedent for a final-week stunner, however. Remember, it was Oct. 28, 2016, when former FBI Director James Comey sent a letter to Congress indicating that federal investigators learned of new emails pertinent to the investigation into Hillary Clinton’s use of a private email server.\n\nWill Harris’ closing message harness anxiety?\n\nIt would be an understatement to describe Democrats as anxious as Election Day looms. But there was a deliberate effort by Harris’ senior team over the weekend to project optimism to help temper the fear.\n\nHarris senior adviser Jen O’Malley Dillon predicted victory on MSNBC on Sunday: “We are confident we’re going to win this thing,” she said. “We’re seeing extraordinary enthusiasm. This is going to be a close race, and our campaign is exactly where we want to be.”\n\nHarris will try to alleviate Democratic anxiety further on Tuesday when she delivers her “closing argument” at the Ellipse, the same spot near the White House where Trump spoke on Jan. 6, 2021 shortly before his supporters attacked the Capitol.\n\nHarris is expected to focus her remarks on the danger Trump poses to U.S. democracy. She has called her Republican rival “a fascist” in recent days. And she’s been joined by an unlikely ally, Trump’s former chief of staff John Kelly, who has also described Trump as a fascist recently.\n\nBut she’s expected to hit broader themes as well, encouraging voters to look behind her at the White House and imagine who will be sitting at the Resolute Desk at a moment of great consequence. She’s aiming to drive home the stakes of the Nov. 5 election for undecided voters — especially moderate Republicans who may be uncomfortable with Trump’s divisive leadership and extreme rhetoric. And while Harris’ team is betting that there is a significant number of moderates who can still be persuaded, progressive Democrats are worried she’s not focused enough on economic issues in the campaign’s closing days.\n\nDemocratic anxiety, we have learned, may be a fact of life.\n\nWhere will they go?\n\nThe candidates’ evolving travel schedules will tell us much about the battlegrounds that will matter most on Election Day.\n\nHere’s what we know for sure: Harris and Trump are aggressively competing in just seven swing states that will ultimately decide the election. They are the three so-called “Blue Wall” states — Michigan, Pennsylvania and Wisconsin — in addition to Arizona, Georgia, Nevada and North Carolina.\n\nFor a political perspective, however, not every one of the seven is created equal.\n\nHarris spent Sunday in Pennsylvania, which may be the election’s biggest prize. Harris is next scheduled to go to Michigan. And after Tuesday’s closing argument in Washington, she plans to visit North Carolina, Pennsylvania and Wisconsin on Wednesday alone. She heads to Nevada and Arizona on Thursday.\n\nWhat do we know about Trump’s schedule? He’s booked to host at least one rally every day next week: Monday in Georgia, Tuesday in Pennsylvania, Wednesday in Wisconsin, Thursday in Nevada, Friday in Wisconsin again and Saturday in Virginia.\n\nBut as a reminder, these schedules are likely to change based on the campaigns’ intelligence on the ground.\n\nWill the early voting surge continue?\n\nMore than 41 million votes have already been cast in the election nationwide. Democrats generally have an advantage in early voting, but so far, at least, Republicans are participating at a much higher rate than they have in the past.\n\nHow hard will Trump work to undermine results?\n\nHistory may one day decide that the most significant thing Trump said in the closing days of the 2024 election is the thing that many voters barely notice anymore: his persistent warnings that this election is rigged against him.\n\nIndeed, as Election Day approaches, Trump is increasingly warning his supporters that he will lose on Nov. 5 only if his political opponents cheat. Such statements have no basis in fact. MDT/AP","summary":"Uncertainty reigns entering the final full week of the 2024 campaign with Democrat Kamala Harris and Republican Donald Trump locked in a fiercely competitive presidential contest. What happens in the coming days will be pivotal in deciding the winner. Can Trump stay on message (relatively speaking)? Even before the week began, Trump’s campaign risked being [&#8230;]\n\n\nThe post The dramatic final full week of the presidential campaign: watch this appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/the-dramatic-final-full-week-of-the-presidential-campaign-watch-this.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2024/10/AP24298592245841.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2024-10-29 00:14:07","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.285},{"id":261453480,"title":"Bucks' Doc Rivers calls Trump's MSG rally 'atrocious'","text":"Milwaukee Bucks head coach Doc Rivers ripped former President Donald Trump’s campaign rally at Madison Square Garden in New York as \"atrocious\" on Monday. Rivers was across the river in Brooklyn coaching the Bucks to a 115-20 loss against the Brooklyn Nets. As the Bucks regrouped for their game against the Boston Celtics, Rivers spoke about Trump’s rally. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"If you saw Madison Square Garden, I mean come on. … like, right?\" Rivers said, via Sports Illustrated \"So, to me it’s so important to vote. I’m gonna keep it as close to that as possible. But gosh. When I tell people, if the guy was so great, why did 80 million people vote against him the last time he ran. \"I don’t know. I don’t get it. But we gotta do something about — that was atrocious what we saw. If you’re a Black man or woman, Brown, Latino or Puerto Rican or — they hit everybody. And it was awful.\" Rivers’ comments came after he appeared in an ad supporting Vice President Kamala Harris. In the ad, he was calling plays for second gentleman Doug Emhoff. WALZ ZINGS BEARS AFTER CHICAGO SUFFERS CRUSHING LOSS ON HAIL MARY PLAY The remarks also came days after San Antonio Spurs head coach Gregg Popovich ripped Trump in a lengthy rant at a pregame press conference. \"Now, the danger follows the delusion and our kids and grandkids are gonna have to live with what this guy puts out there,\" Popovich said in part. CLICK HERE TO GET THE FOX NEWS APP \"I’m just hoping people who are already sold on him for whatever reason, I can’t figure it out… The ones that stay home and don’t vote are the ones that worry me because we need everybody to vote. I hope that they won't stay home, that they'll understand that this guy is a scam artist. He's great at it. I'll give him credit for that. He's the best ever, but he makes you want to puke.\" Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Milwaukee Bucks head coach Doc Rivers called former President Donald Trump&apos;s rally in New York City &quot;atrocious&quot; in a clunky press conference on Monday.","url":"https://www.foxnews.com/sports/bucks-doc-rivers-calls-trumps-msg-rally-atrocious","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/c76e2980-doc-rivers.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-29 00:11:45","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","category":"politics","source_country":"us","sentiment":-0.059},{"id":261453130,"title":"Washington Post loses more than 200,000 subscriptions following non-endorsement: Report","text":"NPR reported the figure, citing “two people at the paper with knowledge of internal matters.”\n\nThe reported loss of subscriptions of that magnitude would be a blow to a news outlet that is already facing financial headwinds. The Post had more than 2.5 million subscribers last year, the bulk of them digital, making it third behind The New York Times and Wall Street Journal in circulation.\n\nA Post spokeswoman, Olivia Peterson, would not comment on the report when contacted by The Associated Press.\n\nThe Post‘s editorial staff had reportedly prepared an endorsement of Democrat Kamala Harris before announcing instead Friday that it would leave it up for readers to make up their own minds. The timing, less than two weeks before Election Day, led critics to question whether Post owner and Amazon founder Jeff Bezos had been concerned about whether Republican Donald Trump might retaliate if he were elected president.","summary":"NEW YORK — More than 200,000 people have cancelled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday. NPR reported the figure, citing &#8220;two people at the paper with knowledge of internal matters.&#8221; The reported loss of subscriptions of [&#8230;]","url":"https://torontosun.com/news/world/washington-post-loses-more-than-200000-subscriptions-following-non-endorsement-report","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/media-washington-post.jpg","video":null,"publish_date":"2024-10-29 00:11:36","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"CA","sentiment":-0.496},{"id":261454512,"title":"Jeff Bezos defends Washington Post’s decision to stop presidential endorsements days before election","text":"Jeff Bezos, the billionaire Amazon founder who owns The Washington Post, defended the newspaper's decision to stop endorsing presidential candidates, arguing in part that the move is a way to shore up credibility and combat perceptions of political bias. \"Presidential endorsements do nothing to tip the scales of an election. No undecided voters in Pennsylvania are going to say, 'I’m going with Newspaper A’s endorsement.' None. What presidential endorsements actually do is create a perception of bias. A perception of non-independence. Ending them is a principled decision, and it’s the right one,\" Bezos wrote in a nine-paragraph article published on the Post's website Monday night. Bezos published his comments three days after Will Lewis, the publisher and chief executive officer of the Post, announced that the storied publication would not make a presidential endorsement this year or \"in any future presidential election\" — breaking with decades of tradition. The announcement sparked immediate backlash from readers, current and former staff members, an employee guild and liberal social media influencers. NPR reported Monday that the newspaper has lost more than 200,000 digital subscribers since Lewis' announcement. At least three members of the newspaper's editorial board have stepped down in protest. The Post's editorial page had planned to endorse the Democratic nominee, Vice President Kamala Harris, according to the newspaper's own reporting. The Post, in an article citing four people who were briefed on the matter, reported that Bezos made the decision to stop issuing presidential endorsements. The newspaper has denied that claim through spokespeople. Bezos acknowledged that the move could have been handled better. \"I wish we had made the change earlier than we did, in a moment further from the election and the emotions around it,\" Bezos wrote. \"That was inadequate planning, and not some intentional strategy.\" Bezos also flatly denied that there was a \"quid pro quo of any kind\" with Harris or former President Donald Trump, adding that neither \"campaign nor candidate was consulted or informed at any level or in any way about this decision.\" \"Dave Limp, the chief executive of one of my companies, Blue Origin, met with former president Donald Trump on the day of our announcement,\" Bezos wrote. \"I sighed when I found out, because I knew it would provide ammunition to those who would like to frame this as anything other than a principled decision. But the fact is, I didn’t know about the meeting beforehand. Even Limp didn’t know about it in advance; the meeting was scheduled quickly that morning. There is no connection between it and our decision on presidential endorsements, and any suggestion otherwise is false.\" Bezos, who purchased the Post for $250 million in 2013, insisted that he would not use the publication as a vehicle for his \"personal interest\" and argued that the 146-year-old publication will need to \"exercise new muscles\" to stay commercially competitive and culturally current. \"While I do not and will not push my personal interest, I will also not allow this paper to stay on autopilot and fade into irrelevance — overtaken by unresearched podcasts and social media barbs — not without a fight,\" he wrote. \"It’s too important. The stakes are too high. Now more than ever the world needs a credible, trusted, independent voice, and where better for that voice to originate than the capital city of the most important country in the world?\" The members of the editorial board who announced their resignations earlier Monday said they believed it was imperative for the newspaper to formally back Harris over Trump, whom they described as a threat to American democracy and the free press. \"I believe we face a very real threat of autocracy in the candidacy of Donald Trump,\" contributing editor David Hoffman wrote in a resignation letter to David Shipley, the editor of the editorial page. \"I find it untenable and unconscionable that we have lost our voice at this perilous moment.\" (Hoffman shared a copy of the letter with NBC News.) The Post's non-endorsement came days after news broke that the Los Angeles Times would not get behind Trump or Harris ahead of the Nov. 5 general election. The news website Semafor reported that the newspaper was preparing to back Harris but that owner Patrick Soon-Shiong blocked the editorial page from getting behind either candidate. (NBC News has not independently verified the report.)","summary":"Jeff Bezos, the billionaire Amazon founder who owns The Washington Post, defended the newspaper's decision to stop endorsing presidential candidates, arguing in part that the move is a way to shore up credibility and combat perceptions of political bias.","url":"https://www.nbcnews.com/news/us-news/jeff-bezos-defends-washington-post-endorsement-decision-rcna177742","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2023-11/231103-jeff-bezos-mn-1315-d8a268.jpg","video":null,"publish_date":"2024-10-29 00:11:34","author":"Daniel Arkin","authors":["Daniel Arkin"],"language":"en","category":"politics","source_country":"us","sentiment":-0.346},{"id":261455724,"title":"Fact Check: Doug Emhoff Claims 'Racist and Antisemitic Speeches' at Trump MSG Rally","text":"CLAIM: There were “antisemitic and racist speeches at Trump’s rally in Madison Square Garden” in New York.\n\nVERDICT: FALSE. There were no such speeches in the six-hour event. A warmup comedian told a few ethnic jokes.\n\nSecond Gentleman Doug Emhoff — the admitted philanderer and accused woman-beater hoping to be the country’s first First Gentleman if his wife, Vice President Kamala Harris, wins the presidency — delivered an address that was billed as the “closing argument” on Trump and antisemitism in Pittsburgh, Pennsylvania, on Monday.\n\nThe address was thin, but repeated false claims about a “Nazi” rally for former President Trump at Madison Square Garden.\n\nIn particular, Emhoff claimed that there were “antisemitic and racist speeches” at the rally. Democrats, and their friendly media outlets, following the campaign’s lead, repeated that claim. But what was the basis for the charge?\n\nSeveral media outlets — notably Axios and New York put their stories about alleged racism at the rally behind a paywall, suggesting that perhaps the claims were not exactly of pressing public interest. But CNN.com did not.\n\nIts article, titled “Trump loyalists spew racist, vulgar attacks at Harris and Democrats at New York City rally,” listed jokes by comedian Tony Hinchcliffe, who delivered the first televised portion of what was a six-hour-long event.\n\nOne joke referred to Puerto Rico as “a floating island of garbage in the middle of the ocean,” and the crowd groaned.\n\nCNN’s Gregory Krieg lied, however, claiming: “The line was well-received by Trump supporters.” (Judge for yourself.)\n\nThere were no more examples of “racist” or “vulgar” attacks in the CNN article, save for a reference to Harris as the “antichrist” and the use of the term “illegals,” which left-wing activists often consider a slur against illegal migrants.\n\nThe New York Times dinged Hinchcliffe for a Jewish joke: “He mocked Palestinians as rock-throwers and Jews as cheapskates,” the Times complained. (The joke: in rock, paper, scissors, Palestinians would win because they would always throw the rock and the Jews would be reluctant to throw the paper, a reference to money.)\n\nOther than those mildly offensive comments — standard fare for comedy — that was it. There were no “antisemitic and racist speeches.”\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Agenda: What Trump Should Do in His First 100 Days, available for pre-order on Amazon. He is also the author of The Trumpian Virtues: The Lessons and Legacy of Donald Trump’s Presidency, now available on Audible. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.","summary":"Other than those mildly offensive comments -- standard fare for comedy -- that was it. There were no \"antisemitic and racist speeches.\"\n\n\nThe post Fact Check: Doug Emhoff Claims &#8216;Racist and Antisemitic Speeches&#8217; at Trump MSG Rally appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2024/10/28/fact-check-doug-emhoff-claims-racist-and-antisemitic-speeches-at-trump-msg-rally/","image":"https://media.breitbart.com/media/2024/10/Doug-Emhoff-Associated-Press-2-640x335.jpg","video":null,"publish_date":"2024-10-29 00:10:31","author":"Joel B. Pollak","authors":["Joel B. Pollak"],"language":"en","category":"politics","source_country":"US","sentiment":-0.382},{"id":261453630,"title":"Washington Post loses more than 200k subscriptions following non-endorsement, according to report","text":"NEW YORK — More than 200,000 people have canceled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday.\n\nNPR reported the figure, citing “two people at the paper with knowledge of internal matters.”\n\nThe reported loss of subscriptions of that magnitude would be a blow to a news outlet that is already facing financial headwinds. The Post had more than 2.5 million subscribers last year, the bulk of them digital, making it third behind The New York Times and Wall Street Journal in circulation.\n\nA Post spokeswoman, Olivia Peterson, would not comment on the report when contacted by The Associated Press.\n\nThe Post’s editorial staff had reportedly prepared an endorsement of Democrat Kamala Harris before announcing instead Friday that it would leave it up for readers to make up their own minds. The timing, less than two weeks before Election Day, led critics to question whether Post owner and Amazon founder Jeff Bezos had been concerned about whether Republican Donald Trump might retaliate if he were elected president.\n\nThe Post’s retired former editor, Marty Baron, had denounced the decision on social media as “cowardice, with democracy as its casualty.”\n\nSome journalists, including Post columnist Dana Milbank, urged readers not to express their anger at the decision by canceling subscriptions, for fear it could cost reporters or editors their jobs.\n\nThe Post’s decision came only days after the Los Angeles Times also said it would not endorse a presidential candidate, which the newspaper has acknowledged has cost them thousands of subscribers.\n\nAn article on the Post’s website about the fallout from the non-endorsement had more than 2,000 comments, many of them from readers saying they were leaving.\n\n“I am unsubscribing after 70 years,” wrote one commenter, claiming to have lost hope and belief that the Post would publish the truth.","summary":"The cancellations have been mounting since the newspaper announced its decision last week not to endorse a candidate for president.","url":"https://www.ocregister.com/2024/10/28/report-washington-post-loses-more-than-200000-subscriptions-following-non-endorsement/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/AP24302847434532.jpg?w=1024","video":null,"publish_date":"2024-10-29 00:09:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.296},{"id":261453534,"title":"NATO confirms that North Korea has sent troops to join Russia’s war in Ukraine","text":"NATO yesterday confirmed that North Korean troops have been sent to help Russia in its almost three-year war against Ukraine and said some have already been deployed in Russia’s Kursk border region, where Russia has been struggling to push back a Ukrainian incursion.\n\n“Today, I can confirm that North Korean troops have been sent to Russia, and that North Korean military units have been deployed to the Kursk region,” NATO Secretary-General Mark Rutte told reporters.\n\nRutte said the move represents “a significant escalation” in North Korea’s involvement in the conflict and marks “a dangerous expansion of Russia’s war.”\n\nAdding thousands of North Korean soldiers to Europe’s biggest conflict since World War II will pile more pressure on Ukraine’s weary and overstretched army. It will also stoke geopolitical tensions in the Korean Peninsula and the wider Indo-Pacific region, including Japan and Australia, Western officials say.\n\nRussian President Vladimir Putin is keen to reshape global power dynamics. He sought to build a counterbalance to Western influence with a summit of BRICS countries, including the leaders of China and India, in Russia last week. He has sought direct help for the war from Iran, which has supplied drones, and North Korea, which has shipped large amounts of ammunition, according to Western governments.\n\nRussia’s Foreign Minister Sergey Lavrov shrugged off Rutte’s comments and noted that Pyongyang and Moscow signed a joint security pact last June. He stopped short of confirming North Korean soldiers were in Russia.\n\nLavrov claimed that Western military instructors already have been covertly deployed to Ukraine to help its military use long-range weapons provided by Western partners.\n\n“Western military personnel long have been working in Ukraine,” Lavrov said after a meeting with the Kuwaiti foreign minister in Moscow.\n\nUkraine, whose defenses are under severe Russian pressure in its eastern Donetsk region, could get more bleak news from next week’s U.S. presidential election. A Donald Trump victory could see key U.S. military help dwindle.\n\nIn Moscow, the Defense Ministry announced yesterday that Russian troops have captured the Donetsk village of Tsukuryne — the latest settlement to succumb to the slow-moving Russian onslaught.\n\nRutte spoke in Brussels after a high-level South Korean delegation, including top intelligence and military officials as well as senior diplomats, briefed the alliance’s 32 national ambassadors at NATO headquarters.\n\nRutte said NATO is “actively consulting within the alliance, with Ukraine, and with our Indo-Pacific partners,” on developments. He said he was due to talk soon with South Korea’s president and Ukraine’s defense minister.\n\n“We continue to monitor the situation closely,” he said. He did not take questions after the statement.\n\nThe South Koreans showed no evidence of North Korean troops in Kursk, according to European officials who were present for the 90-minute exchange and spoke to The Associated Press about the security briefing on condition of anonymity.\n\nIt’s unclear how or when NATO allies might respond to the North Korean involvement. They could, for example, lift restrictions that prevent Ukraine from using Western-supplied weapons for long-range strikes on Russian soil. LORNE COOK, BRUSSELS, MDT/AP","summary":"NATO yesterday confirmed that North Korean troops have been sent to help Russia in its almost three-year war against Ukraine and said some have already been deployed in Russia’s Kursk border region, where Russia has been struggling to push back a Ukrainian incursion. “Today, I can confirm that North Korean troops have been sent to [&#8230;]\n\n\nThe post NATO confirms that North Korea has sent troops to join Russia’s war in Ukraine appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/nato-confirms-that-north-korea-has-sent-troops-to-join-russias-war-in-ukraine.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2024/10/AP24302404795618.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2024-10-29 00:06:00","author":null,"language":"en","category":"politics","source_country":"mo","sentiment":-0.393},{"id":261452646,"title":"US says N. Korea has sent about 10,000 troops to eastern Russia","text":"North Korea has sent around 10,000 troops to eastern Russia, which will likely augment Russian forces near Ukraine \"over the next several weeks,\" a US National Security Council official said Monday, as President Joe Biden called the deployment \"very dangerous.\"\n\nA NSC spokesperson made the remarks after North Atlantic Treaty Organization (NATO) Secretary General Mark Rutte confirmed that North Korean troops have been deployed to Russia's western front-line Kursk region -- a development feared to further escalate the protracted war in Ukraine.\n\n\"We believe that North Korea has sent around 10,000 total soldiers to train in eastern Russia that will probably augment Russian forces near Ukraine over the next several weeks,\" the spokesperson said in response to a question from Yonhap News Agency. \"A portion of those soldiers have already moved closer to Ukraine.\"\n\nEarlier, Pentagon's Deputy Press Secretary Sabrina Singh made the same statement during a press briefing, according to a transcript posted on the Department of Defense's website.\n\n\"We are increasingly concerned that Russia intends to use these soldiers in combat or to support combat operations against Ukrainian forces in Russia's Kursk Oblast near the border with Ukraine,\" she said.\n\n\"Should DPRK soldiers be used on the battlefield, this would mark a further escalation and highlights President Putin's increasing desperation as Russia has suffered extraordinary casualties on the battlefield, and an indication that Putin may be in more trouble than people realize,\" she added.\n\nDPRK stands for the North's official name, the Democratic People's Republic of Korea.\n\nSingh warned that should North Korean troops enter into combat, there would not be limitations on the use of US-provided weapons on those forces.\n\n\"If we see DPRK troops moving in and towards the front lines, I mean, they are co-belligerents in the war. So they are fighting on these front lines and the Ukrainians are defending their sovereign territory and pushing the Russians back,\" she said. \"So, this is a calculation that North Korea has to make.\"\n\nCasting an early ballot at the state of Delaware Department of Elections, Biden made his first public comment on the North's troop deployment.\n\n\"(It's) very dangerous, very dangerous,\" he told reporters after casting a vote.\n\n\"The idea that Kamala's opponent's talking to Putin and discussing what should be done ... I mean, anyway,\" he added, apparently referring to former President Donald Trump.\n\nSouth Korea's Defense Minister Kim Yong-hyun and US Defense Secretary Lloyd Austin plan to meet at the Pentagon on Wednesday for their annual defense talks. The following day, they will join Foreign Minister Cho Tae-yul and Secretary of State Antony Blinken for their \"two-plus-two\" meeting.\n\nNorth Korea's troop deployment as well as the allies' measures to address it are expected to figure prominently in those two meetings.\n\nIn a press briefing, Matthew Miller, the State Department's spokesperson, also confirmed the deployment of around 10,000 North Korean troops to Russia, while voicing concern over Russia's apparent intention to utilize those personnel.\n\nMiller said that at the upcoming two-plus-two meeting this week, the two countries' top defense officials and diplomats are expected to discuss Pyongyang's expanding partnership with Moscow including the troop deployment, and a variety of North Korea's provocative actions over the past few months.\n\nAsked to comment on the United States' diplomatic communication with China on the military ties between the North and Russia, Miller said that Washington has voiced concerns to China over \"destabilizng\" actions by Pyongyang and Moscow.\n\n\"I'll let them speak for themselves, but we have been making clear to China for some time that they have an influential voice in the region, and they should be concerned about steps that Russia has taken to undermine stability, they should be concerned about steps that North Korea has taken to undermine stability and security,\" he said.\n\nHong Jang-won, the first deputy director of South Korea's National Intelligence Service, confirmed that North Korea's deployment of units to Kursk is happening more rapidly than previously anticipated. He was in Brussels, leading a South Korean delegation tasked with briefing the transatlantic alliance on the North's troop dispatch.\n\n\"We (initially) reported to the government that it would take until early December, but it seems that both Russia and North Korea have accelerated their pace since the intelligence became public,\" Hong said.\n\nDuring a phone call with European Commission President Ursula von der Leyen on Monday, President Yoon Suk Yeol described the current situation as \"grave,\" noting that North Korean troops' actual entry into front lines could come sooner than expected.\n\nEarlier this month, NIS said that North Korea was expected to send a total of around 10,000 troops by the end of this year, including some 3,000 troops already dispatched. (Yonhap)","summary":"North Korea has sent around 10,000 troops to eastern Russia, which will likely augment Russian forces near Ukraine &quot;over the next several weeks,&quot; a US National Security Council official said Monday, as President Joe Biden called the deploym","url":"https://www.koreaherald.com/view.php?ud=20241029050070","image":"https://res.heraldm.com/content/image/2024/10/29/20241029050072_0.jpg","video":null,"publish_date":"2024-10-29 00:04:41","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"KR","sentiment":-0.073},{"id":261453056,"title":"Liz Cheney bashes Trump in new key battleground Harris ad as election hits final sprint","text":"FIRST ON FOX: The Harris-Walz campaign is deploying former House Rep. Liz Cheney, R-Wyo., in a final appeal to Republicans in the critical battleground state of Wisconsin. Cheney and political commentator Charlie Sykes are featured in a pair of new radio ads being launched on Monday, taking aim at former President Trump and promoting Vice President Kamala Harris. Fox News Digital was the first national outlet to preview the clips. \"I am a Ronald Reagan conservative. Never voted for a Democrat. But we've never faced a threat like this before – what Donald Trump is proposing in terms of withdrawing from NATO, welcoming Vladimir Putin to attack our NATO allies, praising President Xi of China. America will find our very freedom and security challenged and threatened. It's a risk we just simply can't take as a nation,\" Cheney said in the ad. TRUMP RESPONDS TO EX-CHIEF OF STAFF AFTER HE'S LABELED ‘AUTHORITARIAN’ AND THE ‘GENERAL DEFINITION OF FASCIST’ \"Freedom requires that we have a president who understands America has to lead and that our strength comes both from our greatness and also from our goodness. And that's Vice President Harris. \"She's somebody that I know will put the good of this country first. Wisconsin, I ask you to help us elect Kamala Harris, our president.\" Sykes, a former conservative radio host and ex-editor-in-chief of anti-Trump right-wing outlet The Bulwark, said in the second of two ads, \"I've been a conservative for a long time and my values have not changed. But this election is not normal.\" EX-TRUMP OFFICIALS TELL AMERICANS TO ‘HEED GENERAL KELLY’S WARNING' TRUMP'S A FASCIST \"It's not about liberal versus conservative or Democrat versus Republican. It's about democracy, the rule of law, character, and whether or not America will continue to be a shining city on a hill to the rest of the world,\" he said. Sykes' advertisement also invoked the recent New York Times interview with former Trump Chief of Staff John Kelly, where the retired general said Trump met the \"general definition of a fascist.\" Trump and his allies have forcefully pushed back on that and other claims in Kelly's interview. Outreach to Republicans and Republican-leaning independents has been a core tenet of Harris' campaign, and one whose benefit will be seen next week after Election Day on Nov. 5. Multiple polls show Trump and Harris in a near dead-heat with just a few points separating them. Cheney and her father, former Vice President Dick Cheney, have been two of Harris' most visible GOP supporters. FORMER REPUBLICAN US SENATOR ENDORSES KAMALA HARRIS, SAYS ELECTION OFFERS 'STARK CHOICE' In Wisconsin, Harris has been endorsed by the longest-serving state senator, Republican Robert Cowles, as well as Waukesha Mayor Shawn Reilly, who left the GOP after the Jan. 6 Capitol riot but was re-elected to lead the red-leaning city. Several Republicans, like former House Rep. Adam Kinzinger, R-Ill., spoke at the Democratic National Convention (DNC) in August. But the Trump campaign has dismissed Harris attempts at GOP outreach, with the vast majority of Republicans still publicly supporting the former president. Cheney, the former vice chair of the House select committee on Jan. 6, lost re-election to a Trump-backed Republican primary challenger in the 2022 elections. CLICK TO GET THE FOX NEWS APP Trump criticized her as \"terrible\" in comments to Fox News' Bill Melugin after she endorsed Harris. \"Liz Cheney is a stupid war hawk. All she wants to do is shoot missiles at people…I really think it hurts,\" Trump said in early October. \"I think they hurt each other.\" When reached for comment by Fox News Digital, Trump campaign communications director Steven Cheung said, \"\"Liz Cheney is a stone-cold loser who is so desperate for relevance and attention, she has debased herself by campaigning with a weak, failed, and dangerously liberal in Kamala Harris.\" \"The both of them are made for each other— proponents of endless wars, killers of Social Security, and enemies of American workers,\" Cheung said. Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"Former Rep. Liz Cheney is starring in a new radio ad in Wisconsin making the pitch to Republican voters there that they should support the Harris campaign.","url":"https://www.foxnews.com/politics/liz-cheney-drops-new-ad-bashing-trump-key-battleground-election-hits-final-sprint","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/donald-trump-liz-cheney.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-29 00:03:36","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"us","sentiment":-0.049},{"id":261453574,"title":"In swing state Michigan, Harris promises to rethink education for jobs","text":"Democratic Party nominee Kamala Harris is promising to reassess which federal jobs require a college degree if elected as United States president.\n\nHarris was campaigning in Michigan on Monday and told workers at a semiconductor facility in Saginaw County that the country needed to change the idea that certain jobs require college degrees.\n\n“We need to get in front of this idea that only high-skilled jobs require college degrees,” said Harris, promising she would tackle this on “day one” of her presidency.\n\n“One of the things immediately is to reassess federal jobs, and I have already started looking at it, to look at which ones don’t require a college degree,” she said. “Because here is the thing: That’s not the only qualification for a qualified worker.”\n\nEducation divide\n\nHarris’s comments reflect Democrats’ efforts to bridge the political divide in the country between college-educated and non-college-educated voters. Democrats are trying to attract support from the latter group, which now tend to vote Republican.\n\nLast month, Harris introduced proposed economic policies aimed at spurring domestic manufacturing.\n\nHer visit to the Hemlock Semiconductor plant in central Michigan was to highlight the Democrats’ efforts to build up the US semiconductor industry. The company recently received a $325m federal grant for a new factory from the new CHIPS and Science Act.\n\nRepublican candidate Donald Trump has been critical of the law, blasting it during a lengthy interview on The Joe Rogan Experience on Friday. “That deal is so bad,” Trump said on the podcast, adding that the subsidies went to “rich companies”.\n\nBut Harris said the country has to be willing to balance its economic traditions and the jobs that go with it, with the need to push for new technology.\n\n“When we understand who we are as a nation, we take great pride in being a leader on so many things. And we have a tradition of that,” she said. “But I think that what we know as Americans is that we cannot rest on tradition.”\n\nShe added: “We have to constantly be on top of what is happening, what is current, and investing in the industries of the future, as well as honouring the traditions and the industries that have built up America’s economy.”\n\nTrump ‘fixated’ on himself\n\nHarris also took a shot at Trump before she flew to Michigan. She told reporters that Trump’s rally at Madison Square Garden helped prove her point about what was at stake in the election.\n\nHarris said the Sunday event “really highlighted the point I’ve been making throughout this campaign”, which is that Trump is “fixated on his grievances, on himself, and on dividing our country, and it is not in any way something that will strengthen the American family, the American worker”.\n\nTrump held a rally at Madison Square Garden on Sunday where several speakers made racist and crude remarks, including comedian Tony Hinchcliffe, who described Puerto Rico as “a floating island of garbage”.\n\nHarris plans to deliver her closing campaign argument on Tuesday in Washington, DC.\n\n“There’s a big difference between he and I,” she said.","summary":"The vice president reaches out to non-college-educated voters in battleground stops.","url":"https://www.aljazeera.com/news/2024/10/29/in-swing-state-michigan-harris-promises-to-rethink-education-for-jobs?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/10/AP24302734006860-1730156355.jpg?resize=1920%2C1440","video":null,"publish_date":"2024-10-29 00:03:07","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.25},{"id":261452620,"title":"The Post endorses Trump for president: Letters to the Editor — Oct. 29, 2024","text":"The Issue: The Post’s endorsement of former President Donald Trump for president in the 2024 election.\n\nKudos to The Post for endorsing former President Donald Trump alongside its cover headline, “He’s a Mensch” (“Donald Trump for President,” Editorial, Oct. 25).\n\nThis endorsement recognizes Trump’s significance, while the front-page headline quotes Holocaust survivor Jerry Wartski — and is a stirring response to Vice President Kamala Harris’ claim that Trump is a fascist and comparable to Hitler.\n\nWarren Goldfein\n\nMount Arlington, NJ\n\nYour newspaper is endorsing a convicted felon who was found liable for sexual abuse and a failed businessman who bankrupted several companies.\n\nTrump is a man who will do anything and say anything to get what he wants, regardless of legality, a man who lies with every waking breath.\n\nHe’s a man who cares not for this country but only for himself and his desires. Remember what several of his highly respected former Cabinet members have said about him.\n\nTrump would accomplish none of his supposed domestic goals unless he could act unilaterally, without congressional approval.\n\nTrump’s only strength is foreign policy, but world leaders view him as an unstable amateur — and they are 100% correct.\n\nWilmington, Del.\n\nAs a devoted, longtime Trump supporter, I want to thank you for this much-deserved endorsement by one of the nation’s most popular and trusted media companies.\n\nWhile many Democratic Party-controlled media outlets are either endorsing Harris or refusing to endorse, your support of Trump is truly important and special.\n\nLet’s hope he wins, along with all of his endorsed down-ballot candidates — to return Senate and House control to the Republican Party.\n\nJ.J. Crovatto\n\nWhat a surprise — your editorial staff endorsed Trump for president.\n\nWhere else can a right-wing newspaper support a second-generation Mussolini and his plans to increase the budget deficit by $7.5 trillion while prosecuting political rivals?\n\nHave we become a banana republic, one that treats females akin to cavemen?\n\nAlan Swartz\n\nKudos to the intrepid Post for endorsing Trump. It joins the ranks of only a handful of newspapers bold enough to go against the grain and the general “etiquette” of public opinion.\n\nThe Post has a record of outsmarting its competitors and will likely build on that record once again.\n\nRonald Frank\n\nWest Orange, NJ\n\nThe Post’s endorsement of Trump could not bring itself to acknowledge the elephant in the room.\n\nEven a glimpse of the Jan. 6 Committee hearings in Congress was enough to confirm what was already clear during the Capitol attack: Trump encouraged many people in many different ways to take illegal action to grant him the presidency, knowing it was wrong.\n\nIf the former president himself acted lawlessly, how can “law and order” exist under him?\n\nJorge Sierra\n\nIn the runup to the 2016 election, many on the left smugly declared they’d leave the country if Trump won. He did — and, sadly, they didn’t leave.\n\nNow those similar sentiments are circulating among the nation’s so-called “elite.” One can only hope they keep their word this time.\n\nAnthony Parks\n\nGarden City\n\nIt’s funny how you now warmly endorse Trump for president when, during the primaries, you had nothing good to say about him.\n\nWhat has changed about him now when, before, The Post stated he should never hold that office again?\n\nMichael Walker\n\nStaten Island\n\nI disagree with The Post’s endorsement of Trump, but I respect your right to endorse the candidate you believe should be president.\n\nJeff Bezos of The Wash-ington Post, on the other hand, chose not to endorse anyone. The reason: He’s afraid of antagonizing Trump.\n\nPaul Feiner\n\nWant to weigh in on today’s stories? Send your thoughts (along with your full name and city of residence) to letters@nypost.com. Letters are subject to editing for clarity, length, accuracy, and style.","summary":"NY Post readers discuss The Post’s endorsement of former President Donald Trump for president in the 2024 election.","url":"https://nypost.com/2024/10/28/opinion/the-new-york-post-endorses-donald-trump-for-president-letters/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/Election_2024_Trump_26896-34450.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/xpMROJXD-RyIcpnTz.mp4","publish_date":"2024-10-29 00:03:01","author":"Post Readers","authors":["Post Readers"],"language":"en","category":"politics","source_country":"us","sentiment":0.302},{"id":261453150,"title":"Wisconsin Opposes RFK Jr.’s Supreme Court Application to Take His Name Off Ballot","text":"Officials in swing state Wisconsin told the U.S. Supreme Court on Oct. 28 that they oppose Robert F. Kennedy Jr.’s emergency application asking to remove his name from the ballot.\n\nEarly in-person absentee voting began in the state on Oct. 22.\n\nKennedy, a Democrat-turned-independent, suspended his campaign on Aug. 23 and endorsed former President Donald Trump, the Republican presidential candidate.\n\nKennedy has tried to remove his name from ballots in hotly contested states since then.\n\nHe previously said he was doing this to avoid siphoning votes away from Trump in swing states while leaving room for a longshot bid for the presidency in a possible so-called contingent election, which would put the presidency in the hands of the U.S. House of Representatives in the event of an electoral college deadlock.\n\nRemoving Kennedy’s name “one week before the general election … would require the county and municipal clerks of Wisconsin to handcraft and apply millions of stickers to Wisconsin ballots in order to cover his name—at least those ballots that have not already gone to voters and been returned,” the state said.\n\n“The absurdity of this proposal is evident on its face, and Applicant comes nowhere close to showing why it would be appropriate.”\n\nThe state said the relief Kennedy is seeking from the nation’s highest court would also violate the so-called Purcell principle “at its most fundamental level.”\n\nThe Supreme Court previously held in Purcell v. Gonzalez (2006) that courts should not change rules or procedures close to an election because doing so creates a risk of confusing voters.\n\nThe state said Wisconsin Elections Commission staffers and county election clerks have given evidence that implementing the sticker plan would have “disastrous impacts.”\n\n“Today, it is not possible to affix tiny stickers to the ballots remaining with clerks, and hundreds of thousands of ballots have been sent to voters, with many already returned.”\n\nThe Supreme Court should also deny the application because Kennedy is “very unlikely to succeed on the merits of his claims,” the state said.\n\nOn Sept. 27, the Wisconsin Supreme Court rejected Kennedy’s appeal of a lower state court ruling holding that candidates may only be taken off the ballot if they die.\n\nThe state supreme court “unanimously decided his … appeal on independent and adequate state law grounds,” and Kennedy failed to present “a developed theory of why Wisconsin’s statutes are unconstitutional under equal protection or First Amendment principles,” the state said.\n\n“That is core political speech, and it’s protected under the First Amendment,” he said.\n\nKennedy added that he has “diligently pursued” getting off the Wisconsin ballot for the last two months.\n\nWisconsin election officials say early in-person absentee voting in the first four days of balloting is up almost 40 percent compared to the same period in the 2020 election.\n\nVoting began on Oct. 22 and as of early Oct. 25, 292,702 individuals had voted early in-person, compared with 209,665 who had voted by the morning of Oct. 23, 2020.","summary":"Complying with Kennedy’s request at this late date would be impossible, the state said.","url":"https://www.theepochtimes.com/us/wisconsin-opposes-rfk-jr-s-supreme-court-application-to-take-his-name-off-ballot-5749369","image":"https://img.theepochtimes.com/assets/uploads/2024/09/06/id5719606-Kennedy-GettyImages-2167258349-300x180.jpg","video":null,"publish_date":"2024-10-29 00:02:13","author":"Matthew Vadum","authors":["Matthew Vadum"],"language":"en","category":"politics","source_country":"us","sentiment":-0.585},{"id":261453576,"title":"For Taiwan’s crucial chip industry, both Trump and Harris bring risks","text":"Taipei, Taiwan – For engineers working in Taiwan’s semiconductor industry, the past few years have been difficult.\n\nThe United States’s efforts to curb the growing power of China, Taiwan’s neighbour, by cutting off its access to the most cutting-edge chips has put the island’s chip sector in the crosshairs of the world’s most consequential geopolitical rivalry.\n\nFor Taiwan, the US-China competition for dominance is a double-edged sword.\n\nOn one hand, US efforts to restrain China’s growing power and influence serve as a counter to the risk of a possible future Chinese invasion of the self-governing island, which Beijing considers its territory.\n\nOn the other, they have made doing business more complicated for semiconductor and equipment makers in Taiwan, which sell a large portion of such “critical technology” to China.\n\nDespite its small size, Taiwan produces nearly 60 percent of the world’s supply of semiconductor chips and nearly 90 percent of the most advanced chips needed to power everything from smartphones to artificial intelligence.\n\nSince US President Joe Biden’s signing of the Chips and Science Act in 2022, which incentivises chip production in the US while restricting tech transfers to China, Taiwan’s semiconductor sector has had to adapt to a changing regulatory environment.\n\nMany companies have shifted their business focus away from China, diversifying production to the US and Southeast Asia.\n\nFor some rank-and-file members of the industry, there has been a feeling of whiplash.\n\n“There’s a clear direction. [The US] would like to compete with and restrict Chinese development. However, the policy is never consistent, it’s dynamic,” a Taiwanese engineer at a European multinational chipmaker told Al Jazeera.\n\n“We have a hard time trying to figure out what is our policy [towards] our Chinese business under these circumstances because the rules change rapidly. Today it’s like this, tomorrow it’s like that,” the engineer said, asking not to be named for professional reasons.\n\nAfter the shakeups of the past two years, more upheaval could be in store as the US holds its presidential election on November 5.\n\nWhether Vice President Kamala Harris or former President Donald Trump is elected, analysts widely anticipate new restrictions on Chinese tech, with knock-on effects for Taiwan’s chip industry.\n\n“The theme is that Trump and Harris are turning the screws on China and Taiwanese firms are going to have to adapt. There will be some that benefit and some that will be hurt, but they will all have to adapt,” Chris Miller, the author of Chip War: The Fight for the World’s Most Critical Technology, told Al Jazeera.\n\nWhile Harris and Trump have major differences on domestic issues, anti-China sentiment has increasingly reflected the consensus among both Democrats and Republicans.\n\nDuring his term as president, Trump launched a trade war with Beijing, imposing tariffs on about $380bn worth of Chinese goods, according to an analysis by the Tax Foundation.\n\nUS President Joe Biden, a Democrat, kept those tariffs after winning the 2020 election and earlier this year added tariffs worth a further $18bn on imports including steel, semiconductors and electric vehicles following a lengthy investigation by the US Trade Representative.\n\nWith trade protectionism back in vogue in Washington, DC, there have been hints at the probable trajectory of China policy under either a Trump or Harris presidency, said Chim Lee, a senior analyst at the Economist Intelligence Unit.\n\n“The overall trajectory under both presidencies is not too bad, but the kind of impact it would have would be a bit more volatile under Trump. Regardless of who wins the election in November, reindustrialisation and improving the US manufacturing sector are the priority. They are both looking at protectionist measures,” Lee told Al Jazeera.\n\nThe main difference, Lee added, is Harris would be more “consultative” while Trump would be more “unstable”.\n\nIn Taiwan, polling has suggested a public preference for a Harris win, as well as a considerable amount of ambivalence.\n\nIn a survey conducted by Taiwanese broadcaster TVBS in July and August, 46 percent of respondents expressed a preference for a Harris victory, compared with 15 percent who supported Trump. Notably, 39 percent said they were undecided.\n\nOn the campaign trail, Trump has accused Taiwan of “stealing” the chip industry from the US decades ago.\n\nTrump has also called for a 60 percent tariff on all Chinese goods, a move that would pass on costs to numerous Taiwanese suppliers that do business with China.\n\nIn an interview with The Wall Street Journal published on Saturday, the Republican said that he wouldn’t have to use military force to break a blockade against Taiwan because Chinese President Xi Jinping “respects me and he knows I’m f— crazy”.\n\nHe also said he would impose even higher tariffs of 150-200 percent on Chinese goods if Beijing ever invaded.\n\nHarris has been more muted in her comments about Taiwan-China relations.\n\nIn an interview with CBS’s 60 Minutes in October, the Democrat said she could not discuss “hypotheticals” when asked whether the US would defend Taiwan in the event of a Chinese invasion.\n\nShe added, however, that she would ensure “Taiwan’s ability to defend itself,” echoing the language of the 1979 Taiwan Relations Act, which commits Washington to “make available to Taiwan such defence articles and defence services in such quantity as may be necessary”.\n\nIn her trade policy, Harris is expected to be more targeted in her approach to Chinese tariffs, following the tone set by Biden, whose administration has prioritised “re-shoring” chip production to the US and keeping the most advanced semiconductors out of Chinese hands.\n\nFor Taiwan, the CHIPS Act has been a mixed bag – providing a boost to some of Taiwan’s nearly 300 semiconductor-related companies, while creating difficulties for others, depending on their position on the industry ladder.\n\n“Taiwan was hugely impacted by the export control measures from the US,” Kristy Tsun-Tzu Hsu, the director of the Taiwan ASEAN Studies Center at Taipei’s Chung-Hua Institution for Economic Research, told Al Jazeera, explaining that Taiwanese firms were previously major suppliers for Chinese giants such as Huawei.\n\nCompanies like leading chipmaker TSMC have adjusted their business model in line with US requirements.\n\nIn 2020, the company halted all new orders from Huawei, then its second-largest client, following the announcement of new export controls.\n\nSince then, TSMC has gravitated towards its US business, which is now three times the size of its Chinese equivalent, Hsu said, as a result of demand from tech giants such as Apple and Nvidia.\n\nThrough the CHIPS Act, the company is due to receive $6.6bn in direct funding and $5bn in loans to help it build three facilities in Arizona to “diversify” its supply chain, while also spending $65bn of its own money on the project.\n\nTSMC obtained a US waiver to keep manufacturing its 12, 16, 22 and 28-nanometre chips at its plant in the Chinese city of Nanjing, although its most advanced chip manufacturing remains outside of China.\n\nIts most cutting-edge offering yet, the 2nm chip, will be made in Taiwan.\n\nOther companies have found themselves grappling with knock-on effects in the unrestricted “legacy chip” market, the term for less advanced but ubiquitous chips found in everything from smart refrigerators to electronic vehicles.\n\nCut off from their supply of advanced chips and machinery, Chinese tech companies went on a spending spree for machines to manufacture legacy chips.\n\nAs Chinese manufacturing capacity increased, Taiwan’s smaller chip companies suddenly found themselves in a market teetering on the brink of overcapacity.\n\nMany Taiwanese companies fear Chinese competitors will flood the market completely in three to five years, Hsu said.\n\nThere are also concerns about Washington’s next moves further down the chip-making equipment supply chain.\n\nFollowing US pressure, the Dutch government earlier this year announced export restrictions on advanced semiconductor manufacturing equipment of the kind produced by Veldhoven-based ASML, the sole supplier of the most advanced chip-making machines.\n\nIn September, Morgan Stanley downgraded its earnings estimates for ASML amid concerns about waning demand from Chinese chipmakers, which had driven a surge in orders for legacy chip-making machines.\n\nA Taiwanese engineer with ASML said he was worried about Harris implementing policies similar to those pushed by Biden, while Trump was his own source of concern due to his mercurial reputation.\n\n“I think most of the engineers will want Harris to win the election, because … Trump is not really friendly towards Taiwan. For example, I still remember he claimed that Taiwan stole the chip business from America,” the engineer told Al Jazeera, speaking on condition of anonymity.\n\n“Harris has a stronger relationship with Silicon Valley. I think it will be more beneficial for the high-tech industry in Taiwan.”\n\nTrump’s proposed 60 percent blanket tariff on Chinese goods, in particular, poses risks to Taiwan’s trade.\n\nAn analysis released by UBS in July calculated that the tariffs would more than halve China’s gross domestic product growth by 2.5 percentage points over the subsequent 12 months.\n\nSuch a slowdown would have knock-on effects on Taiwan’s economy, even as Taiwanese companies are steadily moving many of their operations out of China in the face of rising costs and geopolitical tensions.\n\nTrump’s recurring complaints about trade deficits with other countries have also raised concerns he could impose trade restrictions on Taiwanese goods to address the US’s $47bn trade deficit with the island.\n\nWith so much uncertainty, the best Taiwan can do for now is to brace for change, said Yachi Chiang, a professor in tech law at National Taiwan Ocean University.\n\n“The biggest worry for [Taiwan] now is that maybe we cannot count on our first term experience with Trump because he’s really unpredictable,” Chiang told Al Jazeera.\n\n“In the case of a Harris win, and even if she follows most of Biden’s policies, she will still have her own opinions. In her case, Taiwan has to be ready for the changes.”","summary":"Taiwan’s semiconductor sector is watching US election closely amid geopolitical rivalry between Washington and Beijing.","url":"https://www.aljazeera.com/economy/2024/10/29/for-taiwans-crucial-chip-industry-both-trump-and-harris-bring-risks?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2024/10/GettyImages-2178296658-1729576456.jpg?resize=1920%2C1440","video":null,"publish_date":"2024-10-29 00:02:03","author":"Apps Support,Erin Hale","authors":["Apps Support","Erin Hale"],"language":"en","source_country":"QA","sentiment":0.023},{"id":261453004,"title":"Bầu cử Mỹ bước vào tuần then chốt","text":"Còn một tuần nữa đến ngày bầu cử tổng thống Mỹ và 2 ứng viên đang bung hết sức để vượt lên trong cuộc bầu cử đầy kịch tính và chia rẽ.\n\nTheo dữ liệu của dự án Election Lab của Đại học Florida (Mỹ), tính đến hôm qua, đã có gần 42 triệu cử tri bỏ phiếu sớm cho cuộc bầu cử tổng thống năm nay. Trong khi ngày bầu cử chính thức đang đến gần, hai ứng viên Donald Trump và Kamala Harris đang trình bày những thông điệp chính nhằm thuyết phục những cử tri chưa quyết định.\n\n Thông điệp cuối\n\nCuối tuần qua, cựu Tổng thống Trump đưa ra trước tầm nhìn của ông cho nhiệm kỳ tổng thống lần 2. Tại sự kiện ở New York, ứng viên đảng Cộng hòa đặc biệt nhấn mạnh đến tình trạng nhập cư trái phép và tuyên bố “sẽ khởi động chương trình trục xuất lớn nhất trong lịch sử Mỹ ngay ngày đầu nhiệm kỳ”, theo Reuters. Bài phát biểu cũng tập trung về cáo buộc cho rằng chính quyền đương nhiệm, trong đó bà Harris là Phó tổng thống, đã phá hỏng nền kinh tế và chính sách nhập cư, và ông Trump sẽ khắc phục sau khi tái nhậm chức.\n\nBầu cử Mỹ: Bà Melania Trump bất ngờ xuất hiện, phát biểu cổ vũ chồng\n\nBên cạnh đó, ông Trump công bố chính sách mới nhằm cung cấp một hạn mức tín dụng thuế cho những người là trụ cột gia đình, cam kết giảm một nửa giá năng lượng và giảm thuế doanh nghiệp. Ông không trình bày rõ kế hoạch kinh tế bởi việc thay đổi quy định về thuế cần được quốc hội thông qua, trong khi chưa có gì đảm bảo đảng Cộng hòa sẽ nắm quyền kiểm soát lưỡng viện sau kỳ bầu cử này. Ngoài ra, sự kiện tại New York còn gây tranh cãi bởi những phát biểu bị cho là mang tính phân biệt chủng tộc, thô tục từ những đồng minh của vị cựu tổng thống.\n\n Sô cô la có hình hai ứng viên tổng thống Mỹ trong cửa hàng tại New York. ẢNH: REUTERS\n\nTrong khi đó, bà Harris có các sự kiện vận động tại Philadelphia, thành phố lớn nhất tại bang chiến trường quan trọng bậc nhất là Pennsylvania, để thu hút cử tri gốc Puerto Rico, vùng lãnh thổ bị một đồng minh tại sự kiện của ông Trump miêu tả là “đảo rác”.\n\nTrong ngày 29.10, bà Harris sẽ có cuộc vận động quan trọng tại công viên Ellipse ở Washington D.C, nơi mà vào ngày 6.1.2021 ông Trump có bài phát biểu trước khi người biểu tình xông vào tòa nhà quốc hội để cản trở việc phê chuẩn chiến thắng của ông Joe Biden. NBC News dẫn lời các trợ lý của bà Harris cho hay phó tổng thống sẽ tập trung vào việc miêu tả ông Trump là mối đ.e dọ.a cho nền dân chủ, đồng thời nêu bật tầm nhìn và kế hoạch trong nhiệm kỳ tương lai của bà.\n\nBầu cử Mỹ: Tại sao kết quả chung cuộc có thể không được công bố ngày 5.11?\n\n Lo ngại hậu bầu cử\n\nHiện tại, đã xuất hiện những lo ngại từ trong và ngoài nước Mỹ về cả 2 kịch bản ông Trump thua hoặc thắng. Theo AFP, một bộ phận người Mỹ lo rằng với bản tính không chấp nhận thua cuộc của ông Trump, tình trạng bạo lực có thể sẽ lại tái diễn như sau cuộc bầu cử 4 năm trước. Sự cân bằng trong các cuộc khảo sát báo hiệu kết quả cuộc đua có thể được phân định bởi vài chục ngàn phiếu bầu và là cơ sở cho những tranh cãi, kiện tụng sau bầu cử. Nhà phân tích chính trị Adrienne Uthe của Hãng truyền thông Kronus Communications (Mỹ) dự báo mâu thuẫn pháp lý có thể kéo dài nhiều tuần và tùy vào mức độ có thể dẫn đến biểu tình, thậm chí bạo lực. Theo khảo sát của Scripps News/Ipsos mới đây, gần 2/3 người Mỹ dự đoán sẽ có bạo lực sau bầu cử.\n\nTrong khi đó, tại các cuộc họp thường niên của Quỹ Tiề.n tệ quốc tế (IMF) và Ngân hàng Thế giới (WB) tại Washington D.C tuần qua, giới chức tài chính các nước bày tỏ lo ngại về tác động tiềm tàng của chính quyền Trump nhiệm kỳ 2. Theo Reuters, trong số những lo ngại lớn là hệ thống tài chính toàn cầu bị thay đổi bởi việc tăng thuế mạnh, gia tăng phát hành nợ và đảo ngược nỗ lực chống biến đổi khí hậu để ưu tiên sản xuất năng lượng nhiên liệu hóa thạch. Trái lại, một chiến thắng cho bà Harris được xem là sự tiếp nối chính sách hợp tác đa phương của chính quyền Biden trong 4 năm qua về các lĩnh vực khí hậu, thuế doanh nghiệp, giảm nợ.\n\n“Mọi người có vẻ lo ngại đối với sự không chắc chắn cao về việc ai sẽ trở thành tổng thống kế tiếp và chính sách nào sẽ được thực thi”, Thống đốc Ngân hàng Nhật Bản Ueda Kazuo cho hay.\n\n Tổng thống Biden bỏ phiếu sớm\n\nNhà Trắng thông báo Tổng thống Joe Biden sẽ bỏ phiếu sớm trong ngày 28.10 tại TP.Wilmington, bang Delaware. Đây là quê hương của ông Biden, nơi ông làm thượng nghị sĩ đại diện từ năm 1973 – 2009, và cũng là lãnh địa của đảng Dân chủ.\n\nGần 25 triệu người bỏ phiếu sớm bầu cử tổng thống Mỹ Gần 25 triệu cử tri đã bỏ phiếu, thông qua hình thức bỏ phiếu sớm trực tiếp hoặc gửi qua thư, trong bối cảnh chỉ còn chưa đầy 2 tuần nữa là đến Ngày Bầu cử. Cử tri xếp hàng bỏ phiếu sớm tại điểm bầu cử ở Atlanta, bang Georgia. Ảnh: Getty Images/TTXVN Theo hãng tin Reuters, một số bang, bao gồm...","summary":"Còn một tuần nữa đến ngày bầu cử tổng thống Mỹ và 2 ứng viên đang bung hết sức để vượt lên trong cuộc bầu cử đầy kịch tính và chia rẽ.","url":"https://vietgiaitri.com/bau-cu-my-buoc-vao-tuan-then-chot-20241029i7303737/","image":"https://t.vietgiaitri.com/2024/10/10/bau-cu-my-buoc-vao-tuan-then-chot-600x432-928-7303737.webp","video":null,"publish_date":"2024-10-29 00:01:39","author":"Bảo Vinh","authors":["Bảo Vinh"],"language":"en","source_country":"vn","sentiment":-1},{"id":261453066,"title":"Jeff Bezos Says “Presidential Endorsements Do Nothing” Amid Washington Post Subscriber Exodus","text":"The Washington Post owner Jeff Bezos wrote in an op-ed on Monday that the paper’s choice to cease presidential endorsements was borne from an attempt to regain the trust of its readers. \n\n “Presidential endorsements do nothing to tip the scales of an election,” Bezos wrote. “What presidential endorsements actually do is create a perception of bias. A perception of non-independence.” \n\n Post CEO Will Lewis announced in a memo on Thursday that the paper would not endorse a candidate for president — the first time since 1988 — and will cease to do so for future elections. The news came three days after the Los Angeles Times announced similar plans. \n\n In his editorial on Monday, Bezos wrote that their decision was one way to rebuild the public’s trust, he said had been degraded by “off-the-cuff podcasts, inaccurate social media posts and other unverified news sources.” He also referenced a Gallup poll reporting that Americans’ trust in the media had fallen below that of Congress. \n\n “Most people believe the media is biased,” Bezos wrote. “Anyone who doesn’t see this is paying scant attention to reality, and those who fight reality lose.” \n\n The Amazon billionaire went on to invoke Eugene Meyer, publisher of The Washington Post from 1933 to 1946, who also refused to endorse presidential candidates. “He was right,” Bezos wrote. \n\n Bezos also said he wished “we had made the change earlier than we did, in a moment further from the election and the emotions around it,” saying the decision “was inadequate planning, and not some intentional strategy.” \n\n Acknowledging the critics who say Bezos made the decision out of his own business interests, Bezos wrote that readers “can see my wealth and business interests as a bulwark against intimidation, or you can see them as a web of conflicting interests,” but that “only my own principles can tip the balance from one to the other.” \n\n He concluded, “While I do not and will not push my personal interest, I will also not allow this paper to stay on autopilot and fade into irrelevance.” \n\n The Post has seen a mass exodus of subscribers since last week, with 200,000 gone by Monday, NPR reported. Among them was Liz Cheney, who said at a New Yorker event that “when you have Jeff Bezos apparently afraid to issue an endorsement for the only candidate in the race who’s a stable responsible adult because he fears Donald Trump, that tells you why we have to work so hard to make sure that Donald Trump isn’t elected.”","summary":"The Amazon billionaire and Post owner said the paper's decision to cease presidential endorsements came from a drive to avoid the \"perception of non-independence.\"","url":"https://www.hollywoodreporter.com/business/business-news/jeff-bezos-presidential-endorsements-do-nothing-washington-post-subscriber-exodus-1236047197/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/10/JeffBezosGettyImages-1353159820.jpg","video":null,"publish_date":"2024-10-29 00:01:38","author":"Zoe G Phillips,Zoe G. Phillips","authors":["Zoe G Phillips","Zoe G. Phillips"],"language":"en","category":"politics","source_country":"US","sentiment":-0.021},{"id":261452746,"title":"Susanna Reid says sleep will take a ‘backseat’ while she covers US election","text":"Good Morning Britain (GMB) co-host Susanna Reid has said sleep will take a “backseat” while she covers the US election for ITV.\n\nOn November 5, US voters will decide who they want as their next president – Democratic nominee Kamala Harris or Republican candidate Donald Trump.\n\nAlongside her co-host Ed Balls, Reid will present Good Morning Britain: America Decides on November 6, with special guests including Stormy Daniels, the woman at the centre of Mr Trump’s hush money trial, and The News Agents podcast co-host Jon Sopel.\n\nSpeaking to Radio Times, Reid said: “Ed Balls and I are flying straight out to Washington DC after hosting Good Morning Britain on Monday 4 November.\n\n“We’ll be soaking up the atmosphere. Then we’ll be on the ground, presenting the election results programme on the Wednesday morning.”\n\nShe continued: “It’ll be one of those weeks where sleep takes a backseat.\n\n“There are some stories where the adrenaline and cortisone just stream through your body!”\n\nSpeaking about her co-host Balls, she added: “He’s steeped in politics, a political veteran even at his very young age!\n\n“He’s not just an expert on British politics – he’s a senior fellow at Harvard, so an expert on American politics, too. He’ll bring an experienced eye to our coverage.”\n\nReid previously covered US elections in 2016 and 2020 for GMB alongside presenter and former Daily Mirror editor Piers Morgan.\n\nShe said: “Piers, as we know, had a very close relationship with Donald Trump, and in 2016 Piers called it for Trump very early on, saying, ‘Don’t underestimate this man. He’s a winner. He knows how to strike a deal.’\n\n“He was a lone voice among the media commentariat. People were absolutely convinced Hillary Clinton was going to win it. But Piers stuck to his guns.”\n\nITV’s election coverage will be led by Tom Bradby, who is presenting Harris V Trump: The Results from 10.45pm on ITV1 and ITVX on November 5.\n\nHe will be joined by correspondent Robert Moore and ITV News’ deputy political editor Anushka Asthana.\n\nGMB will be live from Washington DC on November 6 and 7.","summary":"Reid and Ed Balls will present Good Morning Britain from Washington DC on November 6 and 7.","url":"https://www.standard.co.uk/showbiz/celebrity-news/susanna-reid-good-morning-britain-ed-balls-kamala-harris-stormy-daniels-b1190660.html","image":"https://static.standard.co.uk/2024/10/29/00/034adb38b96ba12634286b4bf91f9063Y29udGVudHNlYXJjaGFwaSwxNzMwMjE4NjA0-2.77901646.jpg?width=1200","video":null,"publish_date":"2024-10-29 00:01:00","author":"Hannah Roberts","authors":["Hannah Roberts"],"language":"en","category":"politics","source_country":"gb","sentiment":0.359},{"id":261453054,"title":"Coverage of Trump, Harris in presidential race 'most lopsided in history,' 85% negative for Trump: report","text":"Coverage on ABC, CBS and NBC News of the presidential race between former President Trump and Vice President Kamala Harris has been the most \"lopsided in history,\" a new study released one week before the election found. Analysis from the Media Research Center (MRC) published Monday found that Harris has received 78% positive coverage on broadcast evening news since July, versus Trump, who has been the subject of 85% negative coverage on the same networks. \"The difference in coverage between the two candidates is far greater than in 2016, when both Trump and then-challenger Hillary Clinton received mostly negative coverage [91% negative for Trump, vs. 79% negative for Clinton,]\" according to MRC analysts. FOR THIRD YEAR IN A ROW, MORE AMERICANS HAVE ‘NO TRUST’ IN MEDIA THAN THOSE WHO DO The disparity between the Trump and Harris coverage is even greater than in 2020, \"when Joe Biden was treated to 66% positive coverage, vs. 92% negative for Trump,\" the study reads. MRC reported that ABC, CBS and NBC have spent more than 200 minutes of airtime, most of it negative, harping on controversies surrounding Trump while glossing over or, in many cases, outright ignoring controversies related to Harris - such as plagiarism accusations and allegations surrounding her husband, Doug Emhoff. \"Instead, Harris’ coverage has been larded with enthusiastic quotes from pro-Harris voters, creating a positive ‘vibe’ for the Democrat even as network reporters criticize Trump themselves,\" MRC writes. WHAT THE LATEST FOX NEWS POLLS IN THE 2024 ELECTION SHOW Analysts reviewed more than 600 segments about the presidential race that aired on ABC, CBS or NBC beginning on the day President Biden suspended his candidacy in late July, through October 25. After weeks of glowing coverage for Harris as the Democratic nominee, the three networks seemingly changed their tone following the debate between Harris and Trump in September, the MRC analysts found. \"The networks shifted attention away from Harris, spending significantly more airtime targeting Trump,\" the report reads. \"From the date Harris entered the race on July 21 through September 10, she received 353 minutes of network evening news coverage, virtually identical to the 355 minutes given Trump during the same period. Since then, however, TV has focused nearly twice as much attention on Trump as Harris: 398 minutes for the former President, compared to just 230 minutes for the Vice President,\" the study found. \"The additional airtime for Trump was hardly meant as a gift. Instead, it reflected the networks’ intensive focus on Trump controversies, providing opportunities for negative news coverage,\" according to MRC. Roughly 31% of the 753 minutes of evening news spent on Trump since July 21 spotlighted his personal controversies, the study found. \"This compares to barely five percent of Harris’s airtime [28 minutes, out of a total 583 minutes of coverage] spent on similar topics. The networks repeatedly cited January 6 and Trump’s claim that the 2020 election was rigged while labeling him as a \"danger to democracy,\" MRC reported. Comparatively, \"Harris faced no such onslaught. Over fourteen weeks, evening news viewers heard a scant 5 minutes, 22 seconds of GOP criticisms that she’s too liberal, barely one-sixth the airtime spent on the claim Trump is a ‘fascist.’ None of this coverage included any criticisms of Harris from either network reporters or nonpartisan sources,\" MRC analysts found. \"Add it all up, and the media coverage of the past three months is more lopsided than that of any presidential election in the modern media age,\" the report reads. \"So if Donald Trump regains the White House next week, the media’s campaign against him will have accomplished nothing, except the further erosion of their own reputations.\" CLICK HERE TO GET THE FOX NEWS APP The MRC findings come shortly after a Gallup study revealed that trust remains both historically and consistently low in the media. Only 31% of those polled expressed a \"great deal\" or \"fair amount\" of faith in the media to report news properly. \"For the third consecutive year, more U.S. adults have no trust at all in the media (36%) than trust it a great deal or fair amount. Another 33% of Americans express ‘not very much’ confidence,\" Gallup Senior Editor Megan Brenan wrote. ABC, CBS and NBC News did not respond to Fox News Digital's request for comment. Fox News' Alexander Hall contributed to this report.","summary":"ABC, CBS and NBC News have treated Kamala Harris to glowing media coverage since July while attacking Trump in 85% of their coverage of the presidential race in the same time frame.","url":"https://www.foxnews.com/media/coverage-trump-harris-presidential-race-most-lopsided-history-85-negative-trump-report","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trump-harris-season-finale-2.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-29 00:00:29","author":"Yael Halon","authors":["Yael Halon"],"language":"en","category":"politics","source_country":"us","sentiment":-0.473},{"id":261452750,"title":"Jimmy Fallon Roasts Donald Trump With a Hilarious Take on His 'Successful' McDonald's Stunt","text":"Jimmy Fallon, the famous late-night television host, jumped at the chance to share some sharp thoughts after Donald Trump's latest stunt at a McDonald's in Pennsylvania over the weekend. The fast-food restaurant chain was forced to make its view on the 2024 presidential election clear on Monday, which put it in an awkward situation. In a swift response to its staff following Trump's photo op at a restaurant in Bucks County, McDonald's emphasized its neutral stance in the impending election. Fallon took advantage of this golden occasion and said, \"McDonald's won't endorse Trump, but they are willing to keep track of all his lawsuits.\"\n\nAs Fallon quipped on Tuesday's show, he also showed an image of the iconic McDonald's sign declaring \"Over 99 billion served.\" Then, the Late Night with Jimmy Fallon host said about the former president, \"He had a great time at McDonald's, because for 20 minutes, Trump actually ran a successful business,\" referencing Trump's complex history of business ventures, as per HuffPost.\n\nThe entire McDonald's episode wasn't just fodder for Fallon. Fellow late-night host Stephen Colbert chimed in, noting that Trump's appearance was 'blue-collar drag, but with more makeup.' Colbert emphasized that the event was actually \"a half-hour photo op at a closed McDonald's, and the people he served were preselected supporters.\"\n\nSeth Meyers also added his own perspective, mocking Trump's declaration of love for McDonald's and jobs: \"I love when he said 'I've always wanted to work at McDonald's' with a straight face and expects us to believe it. Oh, do you? Well, no one's stopping you, bro. I noticed you didn't pick up an application on your way out,\" as per The New York Times.\n\nMeyers further dissected Trump's McDonald's appearance with his characteristic wit, comparing the ex-president's speaking pattern to a beloved children's TV character. \"Trump told reporters, 'I love McDonald's. I love jobs. I like to see good jobs.' Wow, I just realized, if you replace 'I' with 'me,' he has the same vocabulary as Cookie Monster: 'Me love McDonald's. Me love jobs,'\" Meyers quipped, drawing laughs from his audience.\n\nTaking a more playful jab at the fast-food chain itself, Meyers exclaimed, \"Well, McDonald's screwed up my order again!\" This comment came as part of a broader criticism of what Jon Stewart described as Trump's current campaign strategy: \"'Ave Maria' dance party, 'I'm going to deport everybody,' football tailgate, blame the Jews if I lose, McDonald's drive-through.\"\n\nThe story gets even more interesting with the backdrop of Kamala Harris’s McDonald's appearance. Vice President Harris attracted attention when she shared her experience working at McDonald's during her college years, saying, \"I worked there as a student. I was a kid who worked there. I think part of the difference between me and my opponent includes our perspective on the needs of the American people and what our responsibility is to meet those needs.” Trump has repeatedly criticized her claims, especially during this stunt.","summary":"Fallon didn&#39;t let this golden opportunity slip by and said, &#34;McDonald&#39;s won&#39;t endorse Trump, but they are willing to...&#34;","url":"https://www.inquisitr.com/jimmy-fallon-roasts-donald-trump-with-a-hilarious-take-on-his-successful-mc-donalds-stunt","image":"https://dab57h0r8ahff.cloudfront.net/721713/uploads/1cd85220-92a6-11ef-bac0-df68b243fc47_1200_630.jpeg","video":null,"publish_date":"2024-10-29 00:00:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","category":"politics","source_country":"US","sentiment":0.219},{"id":261452346,"title":"Washington Post owner Jeff Bezos says in op-ed: ‘Americans don’t trust the news media’","text":"Washington Post owner Jeff Bezos in an op-ed published Monday evening defended the newspaper’s recent controversial decision not to endorse a candidate in the presidential election as a “meaningful step in the right direction” to reverse the loss of trust in the media by Americans.\n\nBut Bezos also wrote, “I wish we had made the change earlier than we did, in a moment further from the election and the emotions around it.”\n\nThe op-ed — with the headline “The hard truth: Americans don’t trust the news media — was published hours after NPR reported that The Washington Post had lost more than 200,000 digital subscribers since Friday’s announcement by CEO Will Lewis that the newspaper would no longer endorse presidential candidates. \n\nThree members of the paper’s editorial board have resigned from that panel, while retaining their staff roles at the Post, because of that decision.\n\nBezos, who founded Amazon, in the op-ed wrote, “I would also like to be clear that no quid pro quo of any kind is at work here” in deciding not to endorse a candidate.\n\nBezos said that the presidential campaigns of Kamala Harris and Donald Trump were not consulted or told about the newspaper’s decision\n\n“It was made entirely internally,” said Bezos.\n\nBut Bezos noted that Dave Limp, the CEO of his space exploration company Blue Origin, met with Trump on the same day Lewis announced the paper’s decision.\n\n“I sighed when I found out, because I knew it would provide ammunition to those who would like to frame this as anything other than a principled decision,” Bezos wrote. \n\n“But the fact is, I didn’t know about the meeting beforehand. Even Limp didn’t know about it in advance; the meeting was scheduled quickly that morning,” Bezos wrote. “There is no connection between it and our decision on presidential endorsements, and any suggestion otherwise is false.\n\nThis is breaking news. Please refresh for updates.","summary":"Amazon founder Jeff Bezos arrives for his meeting with British Prime Minister Boris Johnson at the UK diplomatic residence in New York City, Sept. 20, 2021. Michael M. Santiago &#124; Getty Images News &#124; Getty Images Washington Post owner Jeff Bezos in an op-ed published Monday evening defended the newspaper&#8217;s recent controversial decision not to &#8230;\n\n\nThe post Washington Post owner Jeff Bezos says in op-ed: &#8216;Americans don&#8217;t trust the news media&#8217; appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/washington-post-owner-jeff-bezos-says-in-op-ed-americans-dont-trust-the-news-media/","image":"https://image.cnbcfm.com/api/v1/image/106944637-1632178358304-gettyimages-1341554748-img_3875_2021092061521093.jpeg?v=1730158503&w=1920&h=1080","video":null,"publish_date":"2024-10-28 23:58:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.234},{"id":261452260,"title":"Trump Campaign Just Gave Kamala Harris New 'Opportunity': GOP Strategist","text":"Republican strategist Shermichael Singleton said that Vice President Kamala Harris has a new \"opportunity\" to win voters in the swing state of Pennsylvania following the racist remarks made during former President Donald Trump's New York City rally.Perhaps the biggest story out of Trump's event in Madison Square Garden was the polarizing statements made by comedian Tony Hinchcliffe, who spoke before Trump and others close to his campaign took the stage Sunday night. Among the list of statements that sparked a firestorm was Hinchcliffe saying that Puerto Rico is a \"floating island of garbage.\" Hinchcliffe also made vulgar comments about Blacks and Hispanics.Trump's team has said that the joke \"does not reflect the views of President Trump or the campaign.\" Other Republicans have also denounced Hinchcliffe's comments.No matter how much Trump distances himself from the statements, however, experts have suggested that Hinchcliffe's jokes could hurt Trump in some key battleground states, where Puerto Rican voters have the chance to tip the results of some of Trump and Vice President Kamala Harris' closest battles.Singleton—who worked on the presidential campaigns for Newt Gingrich, Mitt Romney and Ben Carson—said during an appearance on CNN Monday afternoon that the jokes could specifically hurt Trump in Pennsylvania.\"I'm looking at a state like Pennsylvania, [a] critical battleground state where we know there are 465,000 plus Puerto Rican voters,\" Singleton said during a panel on The Situation Room with Wolf Blitzer.\"Now, I would argue, that the Harris campaign has been struggling to find their footing in Pennsylvania, which I believe is a must-win state for either side,\" Singleton continued.\"You've now given the Harris campaign an opportunity to potentially target that demographic with ads, Spanish and English, to be able to put their door knockers and focus on heavy Puerto Rican communities to turn them out,\" he continued. \"So if you're looking at a 1 to 2 percent marginal turnout among Puerto Ricans alone, the math tells you, that would potentially be enough for the Vice President to win that state.\"Newsweek reached out to Trump's campaign via email on Monday for comment.Harris' campaign wasted no time jumping on Hinchcliffe's comments on Sunday, including by resharing his jokes about Puerto Rico to its social platforms. The vice president also released a video message on Sunday attacking Trump's policies toward Puerto Rico and released a detailed plan of how she intends to uplift the island's economy if elected in November.Several Puerto Rican celebrities have also come out in support of Harris following Hinchcliffe's remarks. Bad Bunny, who has 45.6 million followers on Instagram, shared Harris' video message four times on his platform. Songwriter and actor Ricky Martin, who has over 18.6 million followers on Instagram, posted a clip of Hinchcliffe's jokes to his account, writing in Spanish, \"This is what they think about us. Vote for Kamala Harris.\"According to a map compiled by UCLA's Social Sciences Computing department, over 470,000 Puerto Ricans live in Pennsylvania, around 3.69 percent of the state's total population.Mark Shanahan, an associate professor of political engagement at the U.K.'s University of Surrey, told Newsweek earlier in the day Monday that Hinchcliffe's comments \"may be the campaign line that comes back to hurt Trump most in the coming week.\"\"If Hinchcliffe has caused enough offense to draw voters away from Trump, it could be a joke that ends his career and Trump's hopes of a return to the White House,\" Shanahan said.According to the polling aggregator FiveThirtyEight, as of Monday evening, Trump is ahead in Pennsylvania by 0.3 percent on average, meaning the race is practically at a tie. The New York Times' polling average also finds Trump and Harris tied at 48 percent across Pennsylvania polling as of Monday.","summary":"Some experts have warned that the racist remarks made by a speaker at Trump's rally Sunday night could hurt his election chances.","url":"https://www.newsweek.com/trump-campaign-just-gave-kamala-harris-new-opportunity-gop-strategist-1976331","image":"https://d.newsweek.com/en/full/2506318/trump-just-gave-kamala-harris-new-opportunity.jpg","video":null,"publish_date":"2024-10-28 23:57:13","author":"Kaitlin Lewis","authors":["Kaitlin Lewis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.265},{"id":261453600,"title":"Washington Post loses more than 200,000 subscriptions following non-endorsement","text":"CTVNews.ca Top Stories\n\n BREAKING | \n\n B.C. NDP poised to win 2024 election, with judicial recounts increasingly likely\n\n Incumbent B.C. Premier David Eby’s NDP appears poised to win the province’s nail-biting 2024 election – and could potentially retain the party’s majority, by the narrowest of margins.\n\n 'Time to clear the air': Some Liberal MPs want secret ballot vote on Trudeau's leadership\n\n A growing number of Liberal caucus members are calling for a secret ballot vote to decide whether Justin Trudeau should step down as party leader.\n\n 'We promise to be better': N.S. firefighter club criticized after group in KKK costumes attends Halloween dance\n\n A group of Cape Breton firefighters are apologizing after four people showed up at a Halloween dance dressed in what appeared to be Ku Klux Klan costumes.\n\n Next CPP payment coming on Tuesday for Canadian retirees\n\n Here's how retirees will get their funds from the federal benefit.\n\n Ont. couple accused of human trafficking plead not guilty as complainant testifies\n\n Marred by several delays, the trial of alleged human traffickers Lauriston and Amber Maloney finally got underway on Monday in a Bradford courtroom, with a woman who worked and lived with the couple testifying.\n\n Washington Post loses more than 200,000 subscriptions following non-endorsement\n\n More than 200,000 people have cancelled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday.\n\n Previously unseen photos of Prince William with his mother Diana visiting homeless charity released\n\n Prince William has opened up about how a powerful childhood experience with his brother and late mother helped shape his work in combatting homelessness.\n\n Google exempt from Online News Act for 5 years, must pay news outlets $100M: CRTC\n\n The Canadian Radio-television and Telecommunications Commission has granted Google a five-year exemption from the Online News Act, ordering it to pay $100 million to Canadian news outlets within 60 days.\n\n 'Pieces of wood': Gummy candies recalled, Canadian Food Inspection Agency says\n\n A recall has been issued for gummy candies due to pieces of wood, according to the Canadian Food Inspection Agency.\n\n Community awaits answers in death of Halifax Walmart employee found in store oven\n\n The family and community of a woman who died in a Halifax Walmart is still waiting for answers.\n\n 'We promise to be better': N.S. firefighter club criticized after group in KKK costumes attends Halloween dance\n\n A group of Cape Breton firefighters are apologizing after four people showed up at a Halloween dance dressed in what appeared to be Ku Klux Klan costumes.\n\n Ont. couple accused of human trafficking plead not guilty as complainant testifies\n\n Marred by several delays, the trial of alleged human traffickers Lauriston and Amber Maloney finally got underway on Monday in a Bradford courtroom, with a woman who worked and lived with the couple testifying.\n\n Lawsuit alleging anti-Black racism in federal public service heads to Federal Court\n\n A Federal Court hearing got underway Monday to determine whether a group of Black public servants can proceed with a class-action lawsuit alleging discrimination in the federal government.\n\n Minister to launch consultations on advanced requests for assisted dying\n\n Health Minister Mark Holland said the federal government will launch consultations this fall about expanding the medical assistance in dying regime to include advanced requests.\n\n Man who went missing amid sexual abuse allegations in 2009 declared dead by B.C. court\n\n A B.C. man who went missing nearly 15 years ago, while facing multiple sexual abuse allegations, has been declared dead by the court – which found he likely died when a fire engulfed the airplane hangar where he was last seen.\n\n Democrats escalate attacks on Trump after comedian calls Puerto Rico 'floating island of garbage'\n\n Democrats stepped up their attacks on Donald Trump on Monday, a day after a comedian opening a rally for the former president called Puerto Rico a \"floating island of garbage.\"\n\n Israel passes two bills to restrict the work of a UN agency that is a lifeline for Gaza\n\n Israeli lawmakers passed two laws on Monday that could threaten the work of the main U.N. agency providing aid to people in Gaza by barring it from operating on Israeli soil, severing ties with it and labeling it a terror organization.\n\n Washington Post loses more than 200,000 subscriptions following non-endorsement\n\n More than 200,000 people have cancelled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday.\n\n Police say fires set at ballot boxes in Oregon and Washington are connected; 'suspect vehicle' ID'd\n\n Police say they have identified a 'suspect vehicle' connected to incendiary devices that set fires in ballot drop boxes in Oregon and Washington state early Monday.\n\n As Democrats court Haley supporters, the former UN ambassador is still waiting to hear from Trump\n\n Nikki Haley received more Republican primary votes than anyone who challenged Donald Trump for this year's presidential nomination. She has said she's voting for him, and she released her delegates so they could support him at the Republican National Convention\n\n 'Bob's Burgers' actor sentenced to 1 year in prison for role in Capitol riot\n\n An actor known for his roles in the television comedies “Bob's Burgers” and “Arrested Development” was sentenced on Monday to one year in prison for his part in a mob's attack on the U.S. Capitol nearly four years ago.\n\n 'Time to clear the air': Some Liberal MPs want secret ballot vote on Trudeau's leadership\n\n A growing number of Liberal caucus members are calling for a secret ballot vote to decide whether Justin Trudeau should step down as party leader.\n\n Poilievre promises to abolish federal sales tax on new homes under $1 million\n\n Conservative Leader Pierre Poilievre says if his party forms government, it will scrap the federal sales tax on new homes sold for less than $1 million and push provinces to do the same.\n\n Google exempt from Online News Act for 5 years, must pay news outlets $100M: CRTC\n\n The Canadian Radio-television and Telecommunications Commission has granted Google a five-year exemption from the Online News Act, ordering it to pay $100 million to Canadian news outlets within 60 days.\n\n Potential organ donors opting out of programs after reports of man mistakenly declared dead\n\n Transplant experts are seeing a spike in people revoking organ donor registrations, their confidence shaken by reports that organs were nearly retrieved from a Kentucky man mistakenly declared dead.\n\n Ottawa will not challenge Quebec MAID law that allows advance requests\n\n Ottawa said it will not challenge a Quebec law that allows people to request medical assistance in dying (MAID) in advance.\n\n Why a group of Canadian doctors says workplace sick notes need to go\n\n Canadian doctors are calling for employers and schools not to require sick notes when it comes to short-term minor illnesses.\n\n Fitness app Strava gives away location of Biden, Trump and other leaders, French newspaper says\n\n An investigation by French newspaper Le Monde found that the highly confidential movements of U.S. President Joe Biden, presidential rivals Donald Trump and Kamala Harris, and other world leaders can be easily tracked online through a fitness app that their bodyguards use.\n\n British man sentenced to 18 years for using AI to make child sexual abuse imagery\n\n A British man who used artificial intelligence to create images of child abuse was sent to prison for 18 years on Monday.\n\n Margaret Atwood, unworried by AI, continues prolific writing career\n\n Renowned Canadian author Margaret Atwood, who is currently writing her memoir, said in an interview that she is too old to be worried about the rise of artificial intelligence and described herself as still having a 'good time' writing.\n\n Entertainment \n\n Adele and Celine Dion share heartfelt embrace and shed tears in sweet concert encounter\n\n Adele and Celine Dion were each brought to tears after an emotional interaction during Adele's concert at The Colosseum at Caesars Palace in Las Vegas.\n\n Colin Farrell finishes Dublin Marathon while pushing friend in a wheelchair\n\n Colin Farrell took time out from his acting schedule on Sunday to complete the Dublin Marathon – while pushing an old friend in a wheelchair.\n\n Hollywood star Victor Garber gets emotional after surprise meeting with his former teacher in London, Ont.\n\n Victor Garber got teary-eyed when he walked into a brunch in his honour Sunday in London, Ont.\n\n CrowdStrike, Delta sue each other over flight disruptions\n\n Cybersecurity firm CrowdStrike said on Monday it sued Delta Air Lines in U.S. District Court in Georgia after a faulty software update prompted a global outage in July.\n\n Volkswagen's employee council says the automaker plans to close at least 3 German plants\n\n Volkswagen has informed employee representatives that it wants to close at least three plants in Germany, the head of the company's works council said Monday.\n\n American Airlines tests boarding technology that audibly shames line cutters\n\n American Airlines is testing a new technology at three airports across the U.S. during the boarding process that aims to cut down on passengers who try to cut the line.\n\n Lifestyle \n\n Previously unseen photos of Prince William with his mother Diana visiting homeless charity released\n\n Prince William has opened up about how a powerful childhood experience with his brother and late mother helped shape his work in combatting homelessness.\n\n The Pope has shown openness to greater roles for women – but there’s pressure for him to go further\n\n A sense of urgency has been growing after the role of women emerged as a dominant theme when Catholics from across the globe were canvassed for their views ahead of a meeting of bishops and lay people – a synod – which formally concluded Sunday.\n\n Once illegal, this Japanese alcohol is making a comeback\n\n One bar in Tokyo has been trying to reintroduce to locals and visitors alike a taste of doburoku, one of the oldest and most controversial drinks in Japanese history.\n\n Manchester City midfielder Rodri wins the men's Ballon d'Or award for the world’s best soccer player\n\n Manchester City midfielder Rodri wins the men's Ballon d'Or award for the world’s best soccer player.\n\n Nine straight wins in reach for the Winnipeg Jets during a primetime matchup with the Toronto Maple Leafs\n\n Another day, another chance for the Winnipeg Jets to extend their season opening winning streak.\n\n Dwyane Wade's new statue goes viral after Miami Heat unveiling and more from around the NBA on Sunday\n\n Dwyane Wade’s status as a Miami Heat legend was further cemented on Sunday as the franchise unveiled an eight-foot statue of the three-time NBA champion.\n\n Volkswagen's employee council says the automaker plans to close at least 3 German plants\n\n Volkswagen has informed employee representatives that it wants to close at least three plants in Germany, the head of the company's works council said Monday.\n\n Teen charged for driving nearly 200 km/h in Ottawa\n\n A 17-year-old Ottawa driver was caught speeding nearly 90 km/h over the speed limit on Highway 417.\n\n Here's what buyers should know before making a used car purchase in Canada\n\n Based on initial appearances, there are signs indicating the automobile industry is in healthy shape – for now.\n\n Local Spotlight \n\n More than 20,000 goldfish removed from Edmonton stormwater pond\n\n Epcor says it has removed more than 20,000 goldfish from an Edmonton stormwater pond.\n\n Witches and warlocks take to the water across New Brunswick\n\n Witches and warlocks have been flocking to New Brunswick waterways this month, as a new Halloween tradition ripples across the province.\n\n Cosplay Queen: New Brunswick artist's handmade costumes attract thousands of followers online, celebrity commissions\n\n New Brunswicker Jillea Godin’s elaborate cosplay pieces attract thousands to her online accounts, as well as requests from celebrities for their own pieces.\n\n Meet the rescued duck at a Manitoba farm who has waddled her way into the internet's heart\n\n A new resident at a Manitoba animal rescue has waddled her way into people's hearts.\n\n Runners try to 'Beat Beethoven' classics during unique Halifax race\n\n Hundreds of people ran to the music of German composer and pianist Beethoven Wednesday night in a unique race in Halifax.\n\n 'Things are very hard here': Popular Toronto crossing guard asks community for help finding work\n\n He is a familiar face to residents of a neighbourhood just west of Roncesvalles Avenue.\n\n Sky over Lake Erie lights up with fireball as Orionid meteor shower peaks\n\n A meteor lit up our region's sky last night – with a large fireball shooting across the horizon over Lake Erie at around 7:00 p.m.\n\n 'Aggressive' wild turkey causing problems for residents in Ottawa's Rideauview neighbourhood\n\n Residents of Ottawa's Rideauview neighbourhood say an aggressive wild turkey has become a problem.\n\n Man who died in floodwaters among 8 Nova Scotians awarded Medal of Bravery\n\n A man who lost his life while trying to rescue people from floodwaters, and a 13-year-old boy who saved his family from a dog attack, are among the Nova Scotians who received a medal for bravery Tuesday.\n\n Vancouver \n\n Missing 82-year-old woman’s van found on remote B.C. road\n\n Langley RCMP have confirmed the grey Dodge Grand Caravan that a missing 82-year-old woman was last seen driving, was found on a remote service road, far from where she lives.\n\n Protesters rally in effort to save trees slated for removal in Delta park\n\n As workers arrived on Monday morning with metal fencing to section off portions of Winskill Park in Tsawwassen, a group of protestors gathered in a forested corner of the park where the City of Delta plans to cut down a stand of trees.\n\n Vancouver food bank feeling demand as Food Banks Canada reports doubling of users\n\n More than two million Canadians used a food bank in March of this year, compared to one million users in March of 2018, according to the Hunger Count report by Food Banks Canada.\n\n Here's how the TTC plans to keep the city moving during Taylor Swift's Toronto stay\n\n The TTC is sharing details about how it plans to cope with the massive influx of Taylor Swift fans into Toronto’s core during the superstar’s six-show stay in the city.\n\n Man shot in North York parking garage has died, say police\n\n A 31-year-old man died in hospital over the weekend after being found critically injured in an underground parking garage in North York late last week.\n\n Toronto Zoo's 'iconic' out of public's view due to 'concerning health symptoms'\n\n An 'iconic' gorilla that has lived at the Toronto Zoo since it first opened in 1974 is experiencing health issues and will be kept from the public as he receives treatment.\n\n Alberta income tax cut still on the table despite oil prices dip\n\n A provincial income tax cut could be coming for Albertans, along with a reprieve at the pumps, in connection with the price of oil.\n\n 'Baffling': MP says Alberta minister made false claims about pandemic bill\n\n A Liberal member of Parliament says he's baffled by the Alberta United Conservative government's response to his private member's bill about pandemic preparedness.\n\n Calgary hockey community mourning loss of former Flames equipment manager\n\n Gus Thorson, a former Flames equipment manager and prominent member of the Calgary hockey community, has died.\n\n ‘Heart of Gold’: Perth, Ont. mourns the death of a 15-year-old\n\n Grief counsellors are at Perth and District Collegiate Institute in Perth, Ont. today, as family, friends and the community mourn the death of 15-year-old Reese Stanzel.\n\n 'Diamond for the community': Friends remember Brkti Berhe\n\n Some of the people who knew Brkti Berhe, the woman killed in an Ottawa park in what police have said was femicide, are remembering her as a devoted wife, loving mother, and pillar of the community.\n\n Lawyer accused of offering legal services for sexual favours ordered to pay former client $235,000\n\n Suspended Ottawa lawyer James Bowie has been ordered to pay $235,000 in damages to a former client after he repeatedly suggested she pay for his legal services with oral sex and released personal details about her online after the allegations were reported by CTV News Ottawa.\n\n Montrealers aren't hanging out downtown as much as they used to: survey\n\n A new study suggests Montrealers are going downtown less often with four in 10 saying they go less often than before the pandemic.\n\n Montreal to remove city hall welcome sign that includes woman wearing hijab\n\n Montreal's mayor says a welcome sign depicting a woman wearing a veil that adorns a lobby at city hall will be taken down in the name of secularism.\n\n Ottawa will not challenge Quebec MAID law that allows advance requests\n\n Ottawa said it will not challenge a Quebec law that allows people to request medical assistance in dying (MAID) in advance.\n\n Proposed Alberta Bill of Rights changes aim to protect freedom to refuse vaccines, medical treatment\n\n The Alberta government introduced its promised amendment to the provincial Bill of Rights on the first day of the legislature's fall sitting on Monday, a move Premier Danielle Smith said will \"strengthen\" human rights protections and \"ensure our province remains one of the freest societies in the world.\"\n\n 'Elaborate encampment' with solar panels and mini-power grid dismantled by EPS\n\n Edmonton Police Service (EPS) has dismantled one of the ‘most elaborate encampments’ officers have ever seen.\n\n Camrose Casino owner in receivership after application to move casino to Edmonton\n\n The Alberta Gaming, Liquor and Cannabis Commission says it is evaluating the relocation of the Camrose Casino after the company that owns it was forced into receivership.\n\n 'We promise to be better': N.S. firefighter club criticized after group in KKK costumes attends Halloween dance\n\n A group of Cape Breton firefighters are apologizing after four people showed up at a Halloween dance dressed in what appeared to be Ku Klux Klan costumes.\n\n Saint John police search for man wanted in connection with shooting\n\n The Saint John Police Force is asking for the public’s help in locating a man wanted on a Canada-wide warrant in connection with a shooting incident in the city over the weekend.\n\n Halifax police investigating break-ins of more than 25 cars in parking garages\n\n Halifax Regional Police is investigating two break-and-enters in parking garages early Sunday morning.\n\n Students express safety concerns after U of M dorm attack\n\n An assault on a woman at a University of Manitoba dorm room has left students on edge.\n\n Woman run over by her own car during carjacking\n\n A Winnipeg woman is recovering after being run over by her own vehicle during a carjacking this weekend.\n\n Manitoba chief electoral officer calls for legislation against disinformation\n\n Manitoba's chief electoral officer is calling for a legal crackdown on disinformation about provincial elections, including the conduct of election officials and electronic vote-counting machines.\n\n Where to watch Saskatchewan's 2024 provincial election\n\n Candidates across Saskatchewan have made their final pitches to potential voters as the 2024 campaign comes to a close and election day arrives.\n\n Here are the ridings to watch in Saskatchewan's 2024 provincial election\n\n With multiple polls suggesting a tight race to the finish for Saskatchewan's major political parties – here are the ridings where some extra attention may be required.\n\n Here's where you can vote in Regina\n\n Election day has arrived in Saskatchewan. With it, the last wave of voters prepare to cast their ballots and decide who will form government in the province.\n\n Kitchener \n\n 'Ideology' remains significant factor in Villalba-Aleman terrorism charge\n\n What role does ideology play in the sentencing of the man who pleaded guilty to four charges in an attack at the University of Waterloo?\n\n Guelph Police dedicating more resources to downtown public safety initiative\n\n The Guelph Police Service is planning to dedicate more resources to ensuring public safety in the city’s downtown area as part of an ongoing initiative.\n\n Guelph, Ont. charitable bike repairs halted due to bylaw complaint\n\n After 14 years of repairing and selling bicycles out of the garage of her home, a Guelph, Ont. woman’s efforts have ended – for now, at least.\n\n Saskatoon \n\n Where to watch Saskatchewan's 2024 provincial election\n\n Candidates across Saskatchewan have made their final pitches to potential voters as the 2024 campaign comes to a close and election day arrives.\n\n Here are the ridings to watch in Saskatchewan's 2024 provincial election\n\n With multiple polls suggesting a tight race to the finish for Saskatchewan's major political parties – here are the ridings where some extra attention may be required.\n\n 'Life will never be the same': Sask. man fighting for life after being robbed and shot\n\n A construction worker who was robbed, shot and left for dead last week remains in a Saskatoon hospital awaiting more surgeries.\n\n Northern Ontario \n\n Ontario Premier Doug Ford announces $34.9M for Sudbury wastewater facility\n\n Ontario Premier Doug Ford in Sudbury on Monday afternoon to make an infrastructure funding announcement at a wastewater facility.\n\n Sault St. Marie, Ont., landlord found to have violated rights of tenant with a disability\n\n A landlord in Sault Ste. Marie discriminated against a man who is deaf and has limited sight, the Ontario Human Rights Tribunal has ruled.\n\n Pair busted trying to use fake money to purchase machinery in Nipissing First Nation\n\n Two people were busted in Nipissing First Nation trying to use fake money to buy machinery, Anishinabek Police Service says.\n\n Families scramble as retirement home at centre of fraud investigation announces closure\n\n An Oxford County retirement residence at the centre of a fraud investigation has announced it will be closing its doors next month, leaving residents and their families with just a couple of weeks to find alternate accommodations.\n\n Projected tax hike for London's 2025 budget comes in short of initial projections\n\n According to a statement from the city on Monday, the projected tax increase for 2025 has come in at 7.4 per cent, which is down form the initial projection of 8.7 per cent.\n\n Five injured in two vehicle crash in Huron County\n\n A pickup truck and car collided in the Huron County village of Nile this afternoon, sending as many as five people to hospital.\n\n Priced out of rental market, Midland senior lives in her shed\n\n A Midland senior has resorted to living in her shed out of desperation\n\n Small community reeling amid homicide investigation in Huntsville\n\n Ontario’s Special Investigation Unit has not confirmed the identities of three people found dead inside a home in Huntsville as the community is left reeling.\n\n Ont. couple accused of human trafficking plead not guilty as complainant testifies\n\n Marred by several delays, the trial of alleged human traffickers Lauriston and Amber Maloney finally got underway on Monday in a Bradford courtroom, with a woman who worked and lived with the couple testifying.\n\n Police hoping to identify two suspects after homicide on Highland Avenue\n\n Windsor police officers are asking for the public’s help to identify two suspects related to the death of a 69-year-old man in south-central Windsor.\n\n ‘This is a taboo topic’: Milk dumping under the microscope\n\n A new study estimates $14 billion in milk has “disappeared” from Canada between 2012 and 2021.\n\n Food bank operators calling on government to step up\n\n With more and more people turning to food banks for help, operators in Windsor-Essex are looking for a government intervention.\n\n Vancouver Island \n\n BREAKING | \n\n B.C. NDP poised to win 2024 election, with judicial recounts increasingly likely\n\n Incumbent B.C. Premier David Eby’s NDP appears poised to win the province’s nail-biting 2024 election – and could potentially retain the party’s majority, by the narrowest of margins.\n\n Mounties say 'at least' 1 person dead after house fire on Vancouver Island\n\n Mounties are investigating after the remains of at least one person were found following a house fire on Vancouver Island on Monday morning.\n\n B.C. NDP lead grows in Juan de Fuca-Malahat after election recount\n\n The last of three recounts in British Columbia's closely contested provincial election has concluded with B.C. NDP candidate Dana Lajeunesse still leading in the Juan de Fuca-Malahat riding.\n\n Pickup truck may be linked to suspicious deaths, RCMP say 2 years after bodies found in B.C. park\n\n More than two years after Alannah Brown and Douglas Barker were found dead north of Penticton, police are asking for help identifying a vehicle they believe was associated with the crime.\n\n B.C. homeowner astounded someone managed to steal one of his prized giant pumpkins\n\n Dave Lindsey began growing giant pumpkins to bring a bit of magic to his grandkids' Halloween.\n\n B.C. man gets prison sentence, fine for using fake names to buy guns in the U.S.\n\n A U.S. District Court judge in Montana has sentenced a 27-year-old man from Kelowna, B.C., to 18 months in prison for using fake names to buy guns with the aim of selling them in Canada.\n\n Lethbridge \n\n Lethbridge food banks struggle to cope with higher demand\n\n Food Banks Canada's annual Hunger Count report shows more Canadians than ever are resorting to food banks.\n\n Deadly motorcycle crash near Medicine Hat investigated by RCMP\n\n RCMP say a Medicine Hat man was killed in a collision between an SUV and a motorcycle in southeast Alberta on Sunday evening.\n\n City of Lethbridge reaches tentative agreement with 900 CUPE employees on new deal\n\n A tentative agreement has been reached between the City of Lethbridge and more than 900 employees belonging to CUPE Local 70.\n\n Sault Ste. Marie \n\n Sault woman walking her dog has scary encounter with a pack of coyotes\n\n A Sault Ste. Marie woman had a close encounter this weekend with a group of coyotes -- and her small dog just narrowly escaped serious injury.\n\n Traffic safety coalition holds seminar in North Bay on impaired driving and its effects\n\n A seminar took place Monday in North Bay with law enforcement agencies, traffic experts and other community partners looking to try and end impaired driving.\n\n Sault St. Marie, Ont., landlord found to have violated rights of tenant with a disability\n\n A landlord in Sault Ste. Marie discriminated against a man who is deaf and has limited sight, the Ontario Human Rights Tribunal has ruled.\n\n Women's hockey is growing, but junior athletes play fewer competitive years on average. A new league aims to change that\n\n Teams are facing off in a new eastern Newfoundland hockey league aiming to bring competitive play — and a few extra years on the ice — for young women in the province.\n\n Remains of missing Kansas man found at scene of western Newfoundland hotel fire\n\n Investigators found the remains of a 77-year-old American man on Wednesday at the scene of a fire that destroyed a hotel in western Newfoundland earlier on the weekend.\n\n 77-year-old Kansas man missing after hotel fire in western Newfoundland\n\n Police in western Newfoundland say a 77-year-old man visiting the province from Kansas is missing after a fire at a hotel in Deer Lake, N.L.\n\n Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n Here Are All The Best Slippers You Can Find Online Right Now\n\n Here Are The Best 2024 Advent Calendars You Can Get In Canada\n\n 20 Products That’ll Help You Wind Down At The End of a Busy Day\n\n If You Take Your Coffee Routine Seriously, Check Out These 17 Products (They Also Make Great Gifts!)\n\n 18 Puzzles, Games, And Indoor Activities You'll Want To Order Before The Temperature Drops \n\n Our Guide To The Best Shop Vacuums In Canada In 2024 (And Where To Get Them)\n\n 27 White Elephant Gifts That Won’t Get Re-Gifted\n\n The Ultimate 2024 Holiday Gift Guide for Toddlers\n\n The Ultimate 2024 Holiday Gift Guide For Homebodies\n\n Is It Too Dramatic To Say This CND Cuticle Oil Changed My Life?\n\n Little Luxuries Are Important, So Let Me Introduce You To A Few Body Washes That Smell Amazing\n\n If You're Looking For A Hyaluronic Acid Serum, Here Are A Few That Reviewers Are Loving Right Now\n\n From The Bay to Best Buy: Here Are The Best Deals You'll Find Online This Week\n\n From Fossil To Frank And Oak: Here Are The Best Deals You'll Find Online This Week\n\n Prime Big Deal Days Sale: 6 Bestselling Vacuums You Can’t Afford to Miss\n\n Stay Connected","summary":"More than 200,000 people have cancelled subscriptions to The Washington Post since the newspaper announced its decision last week not to endorse a candidate for president, a published report said Monday.","url":"https://www.ctvnews.ca/world/washington-post-loses-more-than-200-000-subscriptions-following-non-endorsement-1.7090177","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/28/the-washington-post-1-7090188-1730159642443.jpeg","video":null,"publish_date":"2024-10-28 23:56:39","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"CA","sentiment":0.034},{"id":261452862,"title":"Ex-GOP leaders slam Republican rep up for reelection in urgent letter","text":"In a letter published on Monday, five former Republican leaders called on Pennsylvania voters to oust Rep. Scott Perry (R-PA) by voting for his Democratic opponent, Janelle Stelson. \n\n\"As current and former leaders from the Republican Party, it is rare for us to endorse a Democrat running for Congress,\" former US Reps. Barbara Comstock (R-VA), Adam Kinzinger (R-IL), Denver Riggleman (R-VA), Dave Trott (R-MI), and Joe Walsh (R-IL) — who all signed the letter — wrote, according to Mediaite. \n\nThe letter continued: \n\nWhere Stelson will work with Republicans and Democrats to find common ground, Scott Perry is consistently rated as one of the least bipartisan members of Congress. He is routinely the only member of the Pennsylvania delegation – Republican or Democrat – to oppose common sense measures that would improve the lives of his constituents, including legislation to protect firefighters and crack down on human trafficking.\n\nScott Perry also turned his back on our brave veterans by being the only Republican or Democrat in the Pennsylvania delegation to vote against legislation to house homeless veterans. He also opposed the bipartisan PACT Act, the largest expansion of VA benefits in history, which provided healthcare and compensation to servicemembers who suffered from toxic burn pit exposure. These are the men and women who risked – and in many cases, gave – their lives to defend our freedom.\n\nPerhaps nothing is more emblematic of Perry’s brazen self-interest than his involvement in the plot to overturn the results of the 2020 election. After playing a direct role in the effort to nullify the will of Pennsylvania’s voters, Perry had his cell phone seized by the FBI and has spent hundreds of thousands of dollars on legal defense fees. Former White House staffer Cassidy Hutchinson testified under oath that Perry requested a presidential pardon for his actions in the leadup to the deadly January 6th insurrection.\n\nREAD MORE: Why this GOP congressman 'just might' lose his seat: report\n\nPittsburgh's WESA FM reports that the GOP lawmaker's \"district has modestly favored Republicans since it was redrawn in 2018, and [Donald] Trump won it by 4 percentage points in 2020. But as Perry runs for a seventh term, he faces a vigorous challenge.\"\n\nAxios reported last week that Scott hasn't been raking in the financial support he needs to beat Stelson. \n\nHe's received \"little financial help from GOP leadership so far, with the National Republican Congressional Committee and Congressional Leadership Fund spending effectively nothing on ads in his district as of\" October 12, the news outlet noted. \n\nREAD MORE: These 7 down-ballot races could determine control of Congress","summary":"In a letter published on Monday, five former Republican leaders called on Pennsylvania voters to oust Rep. Scott Perry (R-PA) by voting for his Democratic opponent, Janelle Stelson. \n\n\"As current and former leaders from the Republican Party, it is rare for us to endorse a Democrat running for Congress,\" former US Reps. Barbara Comstock (R-VA), Adam Kinzinger (R-IL), Denver Riggleman (R-VA), Dave Trott (R-MI), and Joe Walsh (R-IL) — who all signed the letter — wrote, according to Mediaite. \n\nThe letter continued: \n\nWhere Stelson will work with Republicans and Democrats to find common ground, Scott Perry is consistently rated as one of the least bipartisan members of Congress. He is routinely the only member of the Pennsylvania delegation – Republican or Democrat – to oppose common sense measures that would improve the lives of his constituents, including legislation to protect firefighters and crack down on human trafficking.\n\nScott Perry also turned his back on our brave veterans by being the only Republican ","url":"https://www.alternet.org/republican-leaders-scott-perry/","image":"https://www.alternet.org/media-library/image.png?id=54017320&width=1200&height=600&coordinates=0%2C89%2C0%2C90","video":null,"publish_date":"2024-10-28 23:56:15","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","category":"politics","source_country":"US","sentiment":-0.134},{"id":261453014,"title":"Swifties Are Not Happy With Tony Hinchecliff Calling Travis Kelce the ‘Next O.J. Simpson’ at Trump Rally","text":"Swifties are speaking out against comedian Tony Hinchecliff after he gave a controversial speech at a Donald Trump rally at Madison Square Garden over the weekend.\n\n In addition to a series of racist remarks about Puerto Rico, the Latin community, Black people, Jewish people, Palestinians and more, Hinchecliff’s speech also included several derogatory statements about music stars. “I don’t know about you, but I think that Travis Kelce might be the next O.J. Simpson,” he said in reference to the Super Bowl-winning boyfriend of Taylor Swift, whom Trump called out on X last month after the superstar endorsed Kamala Harris for president.\n\n Simpson was a successful professional football player who was charged in June 1994 for murdering his ex-wife Nicole Brown and her friend Ron Goldman, after the two were found stabbed to death in Los Angeles. The now-infamous eight-month murder trial led to his acquittal in October 1995. Three years later, in 1998, he was found liable for the murders in a civil suit from the victims’ families. \n\n Following Hinchecliff’s speech, Swift’s fans flooded social media with criticism of the remark and the distasteful implication that Kelce might murder the “I Can Do It With a Broken Heart” singer. “While you’re here, can you please explain in detail why calling Travis Kelce the ‘next OJ’ is funny?” one fan asked Hinchcliffe in response to his defense of his set, noting that people have “no sense of humor.”\n\n “How utterly offensive,” another wrote, while a third expressed, “That racist comedian’s jokes were so disgustingly racist and vile that the #swifties haven’t caught wind about the fact that he made a joke about Travis Kelce being the next OJ Simpson, implying he will k*ll Taylor Swift, and everyone laughed.”\n\n See more reactions below.\n\nThe OJ reference is in really poor taste. The guy brutally murdered his wife and her friend. \nTo imply that Travis Kelce could become like that is just sick. Not funny.\n— Flyover Zone Patriot 🇺🇸 (@SharkeyTim) October 27, 2024\n\n https://platform.twitter.com/widgets.js","summary":"Simpson was charged in June 1994 for murdering his ex-wife Nicole Brown and her friend Ron Goldman.","url":"https://www.billboard.com/music/music-news/swifties-react-tony-hinchecliff-travis-kelce-next-oj-simpson-trump-rally-1235813612/","image":"https://www.billboard.com/wp-content/uploads/2024/10/Taylor-Swift-and-Travis-Kelce-oct-1124-billboard-1548.jpg","video":null,"publish_date":"2024-10-28 23:53:13","author":"Rania Aniftos","authors":["Rania Aniftos"],"language":"en","category":"entertainment","source_country":"US","sentiment":-0.349},{"id":261452046,"title":"Trump’s in his best shape yet, woke Jew-hate alive & well and other commentary","text":"Pollsters: Trump’s in His Best Shape Yet\n\nMost polls show a “tied race” between Vice President Kamala Harris and former President Donald Trump, yet “a closer look at the numbers indicates that the former president is better positioned now than at any other point since Harris entered the race,” explain Douglas Schoen & Carly Cooperman at The Hill. “RealClearPolitics’ aggregate has Trump ahead across all seven battlegrounds.” Further, “GOP voter enthusiasm” in early-vote states is up; Democrats’ five-point early-vote advantage “is significantly lower than their 14-point edge just four years ago.” And while a CNBC poll shows Trump leads Harris by two points overall, on immigration he leads by 35 points and by 13 points on inflation. “With only days to go, it is clear that Trump is in a much stronger position than he was just weeks ago.”\n\nCulture desk: Woke Jew-Hate Alive & Well\n\n“The modern left’s authoritarian impulse” is “alive and well,” argues Lionel Shriver at the Free Press — fingering the “400 writers, including Sally Rooney and Arundhati Roy” who “signed a letter calling for a mass boycott of the Israeli publishing industry.” “The impulse to form a mob is surely antithetical to the impulse to record your thoughts in text in private.” “The boycott seeks to go well beyond the signatories and intimidate all authors.” “It is not in the larger interest of any writer for publishers, agents, and festivals to be the preserve of a narrow ideological position on any issue.” “Writing is a positive expression of faith in language to compel and persuade. I do not wish for other authors’ silence to speak for me.”\n\nLibertarian: Chill Out, America\n\nReason’s J.D. Tuccille bemoans “the spreading poison of political hatred.” Per a Yahoo poll, 24% of Republicans” and 26% of Democrats “say they have had a friendship or family relationship end because of a disagreement over politics.” And 20% of employees “said they had been mistreated at work by their co-workers or peers due to their political views.” Worse, “political disputes are poisoning male-female relationships,” which explains why dating apps have added “political criteria to their services.” Argh! “Creating ideological and partisan litmus tests for family, friends, lovers, and co-workers is a guarantee of damaging social fractures.” Sorry: “Americans need to chill the f - - k out.”\n\nConservative: Bibi’s Beating the West’s Enemies\n\n“After the October 7 massacres,” recalls Victor Davis Hanson at American Greatness, “the conventional wisdom speculated not if, but only when [Prime Minister Benjamin Netanyahu] would be forced out of office.” Yet “an embattled Netanyahu, shunned by the Biden administration, demonized by the European Union, and smeared and slandered by the UN . . . understood that the sheer depravity of October 7 gave Israel, at least for a brief window, the moral authority to wage all-out war on its enemies.” So: “Israel systematically neutered Hamas,” took out “much of the Iranian missile inventory and launch sites” and “decimated Hezbollah.” “The surreal aspect of the Netanyahu retaliatory tour is that he has done more to neutralize European and American enemies” than did “NATO, the CIA, the FBI, and Interpol combined, and yet more often received rebuke rather than gratitude.”\n\nFrom the right: Harris Goes Fringe on SCOTUS\n\n“Would Kamala Harris support packing the Supreme Court by adding, say, three Justices?” ask The Wall Street Journal’s editors. She gave a vague but welcoming answer to a question on just that last week. And she “has already endorsed President Biden’s plan to impose ‘ethics’ rules on the Justices that would invite political harassment and compromise judicial independence.” If Harris wins and Dems keep the Senate, “they have promised progressive voters they’ll take a wrecking ball to the current Supreme Court. It used to be a fringe position to propose fundamental ‘reform’ of the Court, but Mr. Biden has embraced it, Ms. Harris has endorsed it, and the Senate Judiciary Committee has passed it.”\n\n— Compiled by The Post Editorial Board","summary":"Most polls show a “tied race” between Vice President Kamala Harris and former President Donald Trump, yet “a closer look at the numbers indicates that the former president is better positioned now than at any other point since Harris entered the race,” explain Douglas Schoen &amp; Carly Cooperman at The Hill.","url":"https://nypost.com/2024/10/28/opinion/trumps-in-his-best-shape-yet-woke-jew-hate-alive-amp-well-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/Election_2024_Trump_62174-6574d-e1730159427729.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-28 23:52:13","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":-0.078},{"id":261452016,"title":"Group of Christian Leaders Praying Over Donald Trump Takes off Online","text":"Former President Donald Trump took the stage at the National Faith Summit on Monday, hosted by the National Faith Advisory Board in Atlanta.At the end of the event, a group of Christian leaders converged around Trump and prayed over the Republican nominee.\"I think it would be good if you all stretched out a hand towards President Trump and unite our hearts together for him,\" said Pastor Jack Graham of Prestonwood Baptist Church in Plano, Texas.\"We love you, Jesus, and we also love our country,\" Graham said. \"And we thank you that you have raised up a man, Donald J. Trump, to be a warrior for the word of God and the wisdom that comes from Trump ... And we pray, as you raise him up once again to be our president, that you would give him strength and wisdom and joy in the journey.\"Televangelist Paula White, who headlined and hosted the event, thanked God \"for our fighter of faith, and for freedom, and for religion.\"The prayer ended with the song, \"YMCA.\"Watch the moment in the video below, starting around the 57:45 minute mark:Trump—a core part of whose base consists of evangelist voters—was asked during the event what his faith means to him.He responded by praising White and her crowd sizes.\"One of the churches, it was in the middle of nowhere, and she had big, big — I mean, the number of people going every Sunday,\" Trump said as White laughed.The former president went on to criticize the Biden administration, saying, \"We're going through a lot of problems in our country if you take a look at the anger, the problems that we're having.\"He also called Christians \"the most important people,\" adding that \"they're trying to hurt you, they're trying to stymie you ... And they are people that are not nice people.\"Trump touched down in Atlanta on Monday as both he and Vice President Kamala Harris vie for the support of independent and undecided voters in key battleground states, including Georgia.He's set to hold a rally on the Georgia Tech campus Monday evening, while Harris has her own rally in Ann Arbor, Michigan.Michigan, Wisconsin, and Pennsylvania all comprise the so-called \"blue wall\" — states that are crucial for a Democratic candidate to carry in order to win the election.Harris also campaigned in Georgia last week, with former President Barack Obama making his first appearance alongside the vice president on the campaign trail. She rounded out the week campaigning in Houston, Texas, with Beyoncé, who formally endorsed Harris at the rally and touted her support for reproductive freedom.","summary":"A group of Christian leaders prayed for Trump at the National Faith Summit before the event closed out to \"YMCA.\"","url":"https://www.newsweek.com/national-faith-advisory-board-prays-over-donald-trump-1976277","image":"https://d.newsweek.com/en/full/2506279/trump-national-faith-summit.jpg","video":null,"publish_date":"2024-10-28 23:51:27","author":"Sonam Sheth","authors":["Sonam Sheth"],"language":"en","category":"politics","source_country":"us","sentiment":0.084},{"id":261452344,"title":"Trump Rally Attack On Puerto Ricans Breaks Through With Voters","text":"The Harris campaign says that the attacks on Puerto Ricans at Trump’s Madison Square Garden rally have broken through with voters in a big way.\n\nSelina Wang of ABC News reported:The Harris campaign sees that whole rally as a fortuitous gift for the campaign. You heard the Vice President today saying that this is just more of the same from Donald Trump\r\r\r\r\r\r , more of this divisive and chaotic language where Donald Trump is seeking to have Americans point fingers at each other instead of trying to come up with practical solutions.\n\nAnd what’s really notable is that the exact moment that this rally was underway, where people were comparing Puerto Rico to a floating island of garbage, Vice President Harris said Was actually at a Puerto Rican restaurant engaging with the local community and that very morning she had just laid out her economic plan for Puerto Rico, which includes rebuilding some of the energy grid as well as trying to provide more access to affordable housing.\n\nAnd I just spoke to a campaign source who is telling me that they are seeing We’re seeing this backlash breakthrough in a way that they have not seen yet. This cycle with non traditional media outlets and with celebrities who aren’t politically engaged hopping into this conversation. Bad Bunny, who is one of the most influential figures in the Latino community, especially with Latino men and young Latino men, he had reposted a video of Vice President Harris talking about her plan for Puerto Rico.\n\nYou had other celebrities getting into this conversation as well. I’m told that the campaign is going to continue seizing on this that they’re working on an advertisement around this right now, and they’re well aware, Kira, that in battleground Pennsylvania, there’s some half a million Puerto Ricans.\n\n Campaign source tells me they’re seeing Puerto Rico comparison to “floating island of garbage” breaking through in a way they haven’t seen yet this political cycleCampaign had already been in convos with Bad Bunny on Puerto Rico policiesPennsylvania has ~500K Puerto Ricans @ABC pic.twitter.com/K4lnJo8JAw — Selina Wang (@selinawangtv) October 28, 2024 \n\nTrump held a big MAGA gathering in the epicenter of American media, and instead of generating attention on his closing message, it exposed the racism that is fueling his campaign.\n\nPeople aren’t talking about Trump’s rally as a triumph, but how it might end up costing him the key state of Pennsylvania, and maybe the election.","summary":"The Harris campaign says that the attacks on Puerto Ricans at Trump’s Madison Square Garden rally have broken through with voters in a big way. Selina Wang of ABC News reported:The Harris campaign sees that whole rally as a fortuitous gift for the campaign. You heard the Vice President today saying that this is just &#8230;\n\n\nThe post Trump Rally Attack On Puerto Ricans Breaks Through With Voters appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/trump-rally-attack-on-puerto-ricans-breaks-through-with-voters/","image":"https://www.politicususa.com/wp-content/uploads/2024/10/Kill-tony-scaled.jpg","video":null,"publish_date":"2024-10-28 23:50:03","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.167},{"id":261452200,"title":"What would Trump's mass deportations look like in practice?","text":"What would Trump's mass deportations look like in practice?\n CBS News polling has shown immigration policy to be been one of the top issues for voters this election cycle. Former President Donald Trump says he plans to address it by conducting the largest mass deportation in U.S. history if reelected. CBS News immigration and politics reporter Camilo Montoya-Galvez has more on what we know about Trump's mass deportation plans and how he intends to carry them out.","summary":"CBS News polling has shown immigration policy to be been one of the top issues for voters this election cycle. Former President Donald Trump says he plans to address it by conducting the largest mass deportation in U.S. history if reelected. CBS News immigration and politics reporter Camilo Montoya-Galvez has more on what we know about Trump's mass deportation plans and how he intends to carry them out.","url":"https://www.cbsnews.com/video/what-would-trump-mass-deportations-look-like-in-practice/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/28/d2031690-0dc4-40e4-9082-25a850c150df/thumbnail/1200x630/6d58a2532373df88d0acf142b75931c0/cbsn-fusion-what-would-trump-mass-deportations-look-like-in-practice-thumbnail.jpg?v=17b612a59ff4c1e4774d3d0d3ec0","video":null,"publish_date":"2024-10-28 23:48:59","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.009}]}