{"offset":0,"number":50,"available":3060,"news":[{"id":260578658,"title":"Tucker Carlson shocked by grim forecast of potential post-election scenarios","text":"Tucker Carlson invited journalist Mark Halperin on his show to predict what the post-election future could look like for America and was horrified by what he heard.\n\nHalperin, an author of several books about American elections and currently a reporter for Newsmax, told Carlson it may result in a psychological catastrophe across the country if Donald Trump beats Kamala Harris.\n\n‘I think it will be the cause of the greatest mental health crisis in the history of the country,’ he said, adding that liberals would question their ‘connection to the nation’ and suffer ‘trauma in the workplace.’\n\nCarlson, flabbergasted, responded: ‘Are you being serious?’\n\nHalperin confirmed he was ‘100% serious’ before making even more dire predictions of a second Trump term.\n\n‘I think there’ll be alcoholism, broken marriages… yeah. They think he’s the worst person possible to be president,’ he said.\n\nThe former ABC News reporter said Democrats could stomach Trump having won due to ‘a fluke’ in 2016 but that Trump winning fair and square would ruin their psyches.\n\nHe then predicted violence everywhere from protests to average, everyday interactions between Americans. \n\n‘I think there’ll be workplace fights, fights at kids’ birthday parties, I think there will be protests that will turn violent. I hope they don’t, but I think there will be some,’ Halperin said.\n\nCarlson then wondered how conservatives might handle Harris defeating Trump in November. \n\n‘I think the negative impact of her winning on the psychology of the losers will not be as great, but I don’t think it’ll be nothing. I think there’ll be all sorts of things — lawfare, replacing Biden with her after Trump had spent millions trying to beat Biden, the media putting its full body on the scale,’ he said.\n\nHe added that it will probably ‘be up to Trump’s attitude’ and Democrats’ willingness to be transparent how his MAGA base react to a hypothetical Harris victory. \n\n‘If all that happens, and Kamala Harris decides to be gracious in the transition, in her inaugural address, and in her legislative agenda, I think we could be in a decent place,’ he said.\n\nCarlson pivoted to another, potentially realistic, possibility: what if America picks Kamala Harris and Democrats to take over the House of Representatives but also a Republican Senate? \n\n‘All of MAGA, and those unhappy with her winning, will put their chips in the Senate and say it’s up to the Senate to keep her from turning this into a far-left country,’ he theorized. \n\n‘That goes to nominations, I think it will be very difficult for her to nominate anyone acceptable to the left that will be confirmed by the Senate… You can’t be acting forever, it is very limited –what you can do as an acting secretary.’\n\nHalperin says he doesn’t think there’s going to be a civil war in reaction to the election but isn’t dismissive of the possibility.\n\n‘I hope the governors all have great bipartisan plans for minimizing this, for policing peaceful protests, and not allowing them to escalate while not trampling on the First Amendment. I think we could have violence regardless of who wins. I think both sides are capable of that,’ he said. \n\nHalperin isn’t the first person to suggest there could be violence after the election. \n\nEarlier this month, President Joe Biden warned of the potential that the aftermath of the election could be violent, when asked if it would be free and fair, as well as peaceful. \n\nTrump’s ‘enemy within’ line can trace itself to Sen. Joseph McCarthy during the red scare. McCarthy invoked an unidentified historical figure and said, ‘When a great democracy is destroyed, it will not be from enemies from without, but rather because of enemies from within.’\n\nAbraham Lincoln spoke in his Lyceum speech in 1838 about internal threats to the republic a generation before the Civil War, during a period of growing mob violence. ‘At what point then is the approach of danger to be expected? I answer, if it ever reach us, it must spring up amongst us. It cannot come from abroad. If destruction be our lot, we must ourselves be its author and finisher. As a nation of freemen, we must live through all time, or die by suicide.’\n\nHe was asked whether he was confident the election would be free and fair and whether it would be peaceful.\n\nBiden said those were ‘two separate questions.’ \n\n‘I’m confident it will be free and fair. I don’t know whether it’ll be peaceful,’ he responded.","summary":"Tucker Carlson invited journalist Mark Halperin on his show to predict what&#8230;","url":"https://internewscast.com/news/us/tucker-carlson-shocked-by-grim-forecast-of-potential-post-election-scenarios/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Tucker-Carlson-stunned-by-dystopian-prediction-of-800x430.jpg","video":null,"publish_date":"2024-10-22 01:09:04","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.393},{"id":260578462,"title":"Observing Floods, Early Voting, and a Refugee Rescue","text":"The aftermath of a helicopter crash in the Second Ward in Houston on Oct. 20, 2024. Houston Fire Department via AP\n\nA member of the U.S. Marine band plays the historic 1938 Steinway piano inside the White House Entrance Hall, part of the new educational enhancements to the official public tour of the executive mansion in Washington, D.C., on Oct. 21, 2024. Chip Somodevilla/Getty Images\n\nVice President and Democratic presidential candidate Kamala Harris (L) holds a moderated conversation with former U.S. Rep. Liz Cheney, Republican, of Wyoming, at People's Light performing arts theater in Malvern, Pa., on Oct. 21, 2024. Brendan Smialowski/AFP via Getty Images\n\nPeople leave after casting their ballots at the Coral Gables Branch Library in Coral Gables, Fla., on Oct. 21, 2024. Chandan Khanna/AFP via Getty Images\n\nUnits of the Mozambican anti-riot police patrol the streets during a march called by the presidential candidate of the Optimist Party for the Development of Mozambique in Maputo on Oct. 21, 2024. Alfredo Zuniga/AFP via Getty Images\n\nFormer President and Republican presidential candidate Donald Trump speaks to the media in Swannanoa, N.C., on Oct. 21, 2024, after observing cleanup efforts in the aftermath of Hurricane Helene, which devastated the region. Madalina Vasiliu/The Epoch Times\n\nPeople on a relief boat approach a boat loaded with dozens of Rohingya refugees anchored off the coast of Labuhan Haji in Southern Aceh province, Indonesia, on Oct. 21, 2024. A boat loaded with more than 100 Rohingya refugees was spotted off Indonesia's westernmost province with at least one dead body seen on board, local officials said on Oct. 19. Chaideer Mahyuddin/AFP via Getty Images\n\nDaniel Penny, who is charged in the death of Jordan Neely, walks into the courthouse as jury selection begins in his trial in New York City on Oct. 21, 2024. Penny, 26, a former Marine, is charged in the death of Jordan Neely on a New York City subway by choking him after an altercation on the train car. Spencer Platt/Getty Images\n\nA Kuwaiti jeweler displays items at his shop in Kuwait City on Oct. 21, 2024. Yasser Al-Zayyat/AFP via Getty Images\n\nPete Howard, owner of Sifters record shop in Burnage, poses behind his counter in Manchester, England on Oct. 21, 2024. Sifters was made famous by the Oasis song “Shakermaker.” Band members Noel Gallagher and his younger brother Liam grew up in Manchester before forming the rock band Oasis in 1991. After global success with eight UK number-one singles and albums, the band split up in 2009 after the Gallagher brothers fell out. This year, they announced they were reforming to play a number of concerts in 2025. Christopher Furlong/Getty Images\n\nActivists protest against investment in fossil fuels outside World Bank headquarters during the first day of meetings of the IMF/World Bank in Washington, DC on Oct. 21, 2024. Tasos Katopodis/Getty Images\n\nAn Afghan boy rides a donkey along a road in the Fayzabad district of Badakhshan province, Afghanistan, on Oct. 21, 2024. Omer Abrar/AFP via Getty Images\n\nThe Moon is seen as a passenger plane flies in the hazy sky above Vienna, Austria, on Oct. 21, 2024. Joe Klamar/AFP via Getty Images\n\nWorkers commute through a flooded road following heavy rainfall in Bengaluru, India, on Oct. 21, 2024. Idrees Mohammed/AFP via Getty Images\n\nKieran Elliott of Tasmania bowls during the Sheffield Shield match between Western Australia and Tasmania at the WACA Ground in Perth, Australia, on Oct. 21, 2024. Paul Kane/Getty Images\n\nTunisia's President Kais Saied (top R) waits to take his oath of office during his swearing-in ceremony before the National Assembly in Tunis on Oct. 21, 2024. Fethi Belaid/AFP via Getty Images\n\nDutch Police officers remove a demonstrator (C) as activists of the environmental movement “Extinction Rebellion” take part in an action around the arrival of cruise ship MSC Virtuosa before its departure to Amsterdam, to protest against cruise ship pollution at the port city of IJmuiden, Netherlands, on Oct. 21, 2024. Ramon Van Flymen/ANP/AFP via Getty Images\n\nRussia's President Vladimir Putin, United Arab Emirates President Sheikh Mohamed bin Zayed Al Nahyan, and members of both delegations hold a meeting at the Kremlin in Moscow on Oct. 21, 2024. Evgenia Novozhenina/POOL/AFP via Getty Images\n\nA vendor (R) fries peas at a local market in Keelung, Taiwan, on Oct. 21, 2024. I-Hwa Cheng/AFP via Getty Images\n\nFans take their seats in the stands prior to the Premier League match between Nottingham Forest FC and Crystal Palace FC at City Ground in Nottingham, England, on Oct. 21, 2024. Carl Recine/Getty Images\n\nMoldova's President Maia Sandu arrives for a press conference at her campaign headquarters in Chisinau, Moldova, on Oct. 21, 2024. Moldova's pro-EU President Maia Sandu blamed an “unprecedented assault on our country's freedom and democracy” after partial election results on Sunday showed a majority of Moldovans choosing “no” in a referendum on joining the EU. Daniel Mihailescu/AFP via Getty Images\n\nWorkers on a hydraulic platform clean the blinds on the facade of the Paul Loebe Building in the government quarter in Berlin, Germany on Oct. 21, 2024. Ralf Hirschberger/AFP via Getty Images\n\nFirst year students take part in the annual St. Andrews foam fight in St. Andrews, Scotland, on Oct. 21, 2024. The Raisin Monday foam fight is the culmination of a week of mentoring to welcome first-year students as they begin their studies at the University of St. Andrews. Jeff J Mitchell/Getty Images\n\nSyrian emergency and security services inspect the wreckage of a car that exploded in Damascus on Oct. 21, 2024. Syria's defense ministry said two civilians were killed in an Israeli strike on a vehicle on Oct. 21 in the Mazzeh district of Damascus, home to embassies and security headquarters. Louai Beshara/AFP via Getty Images\n\nA general view of the Notre-Dame de Paris Cathedral in Paris, on Oct. 21, 2024. The cathedral was partially destroyed when a fire broke out beneath its roof on April 15, 2019. Ludovic Marin/AFP via Getty Images","summary":"A look into the world through the lens of photography.","url":"https://www.theepochtimes.com/article/observing-floods-early-voting-and-a-refugee-rescue-5744375","image":"https://img.theepochtimes.com/assets/uploads/2024/10/21/id5745373-GettyImages-2179111465-OP-300x180.jpg","video":null,"publish_date":"2024-10-22 01:08:16","author":"Epoch Times Staff","authors":["Epoch Times Staff"],"language":"en","category":"politics","source_country":"us","sentiment":0.253},{"id":260578274,"title":"The X factor: How Trump ally Elon Musk is using social media to prime voter mistrust ahead of 2024 election","text":"Elon Musk has used the social media platform he owns to amass nearly 3.3 billion views on X by fueling doubts about election security issues since January this year — making the tech mogul one of the most viral voices on elections during the 2024 campaign, a CBS News investigation has found. \n\nMusk has frequently shared conspiratorial narratives that have been vexing to public officials who are trying to maintain Americans’ confidence in the election in the face of a barrage of misinformation and disinformation. \n\nAt his first solo appearance at a pro-Trump rally in Philadelphia last week, Musk claimed, “Statistically there are some very strange things that happen that are statistically incredibly unlikely.” He then repeated debunked claims about the validity of vote tallies produced by Dominion voting machines. But even before he took the stage, Musk had already emerged as a prolific conduit for election misinformation on X, formerly known as Twitter. \n\n“The goal all along has been to import as many illegal voters as possible,” Musk posted in July, echoing the conspiracy that Democrats are purposefully letting immigrants enter the country illegally to vote in the upcoming presidential election. The post gained 45.8 million views. \n\nThe CBS News Confirmed team fact-checked Musk’s posts on election security and found that 55% contain misleading or false statements, or amplify posts that do. Further analysis of these posts showed that 40 of the accounts Musk replied to or reposted were accounts researchers have identified as promoters of voter fraud claims. \n\nMusk did not respond to CBS News’ request for comment. \n\nCBS News collected more than 48,000 of Musk’s posts over the past four years, with support from the International Center for Journalists Disarming Disinformation program and the research group Convocation Research+Design. The analysis focused on X posts on the topic of election administration, security and operation. \n\nAn analysis of nearly 17,000 of Musk’s posts from this year, as well as thousands more he replied to or reposted, found 361 posts specifically on the topic of potential election fraud in U.S. elections. Although these election posts represent a small fraction of the dozens of posts Musk publishes each day, each one had an average of 9.3 million views as Musk continues to be the most followed profile on X. \n\nExperts are concerned that such high audience engagement on posts amplifying election fraud conspiracies could set the stage for possible post-election chaos. \n\n“On election night, if Trump believes he’s losing, he is likely to spread massive amounts of disinformation about the existence of fraud,” said David Becker, executive director of the Center of Election Innovation and Research. \n\n“I think we can say with near certainty, Elon Musk is going to take those comments and spread them out to hundreds of millions of people to be consumed immediately, while election officials are busy counting ballots,” Becker said. \n\nMekela Panditharatne, senior counsel for the Brennan Center for Justice’s Elections & Government Program, agreed. “I think that this is galvanizing unfounded fears and concerns about the election process, and preparing for the possibility of unfounded challenges to election results in the aftermath,” she said. \n\nMusk’s increased engagement with election conspiracies has mirrored his embrace of the establishment political right. \n\nThe tech entrepreneur said that he voted Republican for the first time in a Texas congressional race in June 2022. A month later, he wrote that he thought it was time “for Trump to hang up his hat.” Over the next two years, posts criticizing President Biden and the prosecution of Trump became more frequent. \n\nOn July 13, 2024, the day of the first attempted assassination of Trump, Musk announced his formal endorsement of the Republican candidate for a second term. Since then, his posts have shown full-throated support for Trump. \n\n“I have never been materially active in politics before, but this time I think civilization as we know it is on the line,” Musk posted last month. “If we want to preserve freedom and a meritocracy in America, then Trump must win.” \n\nSince then he has campaigned with the former president in Arizona and contributed more than $74.95 million to the America PAC, a super PAC that supports Trump’s reelection. \n\nMusk has also used his platform to go head-to-head with election officials who try to refute his conspiracies. This weekend he posted on X claiming that Michigan has more registered voters than eligible citizens. Michigan Secretary of State Joceyln Benson responded with a correction, saying that there are not more voters than citizens in the state. “There are 7.2 million active registered voters and 7.9 million citizens of voting age in our state,” her post said. “@elonmusk is spreading dangerous disinformation.” \n\n“Jocelyn Michelle Benson, shame on you for blatantly lying to the public!” Musk responded. The post amassed 24.2 million views and 39,000 retweets in less than three days. \n\nThe skepticism online directed towards election officials like Benson can have real-world impacts. The secretary said that she and her team received an uptick in threats and harassing messages directed to her office after Musk’s post. She ended up asking her security team to focus on protecting her children and her executive assistant after messages started coming in using extreme language and echoing the concerns about voter registration numbers, citing two incidents of swatting earlier this year. \n\n“It’s unnerving because his actions lead to a direct uptick in threats to me and other election officials around Michigan,” she told CBS News. “This is all happening when early voting is unfolding in Michigan, and while my team needs to be focused fully on making voting work properly, they are having to deal with this instead.” \n\nBenson’s experience is not unique. “We have seen a number of election officials who have expressed the view that Musk’s posts coincide with a surge in questions from constituents about the integrity of the process,” said Panditharatne. “Musk’s posts have encouraged vitriol directed at election officials.” \n\n Musk focuses on non-citizens, machines and mail voting \n\nMore than half of Musk’s posts on election security this year relate to non-citizen voting or representation in Congress, with many repeating the conspiracy that Democrats under the Biden administration are intentionally allowing an increase in immigration to boost their political power. \n\nSome posts even extend beyond the upcoming presidential election to a future political landscape. \n\n“My prediction is that if Kamala wins, the Dems will import and legalize enough migrants to ensure a permanent one-party rule that is increasingly socialist (to a confiscatory level) and repressive,” wrote Musk in a September post. \n\nThe idea that Democrats are “importing voters” echoes the “great replacement theory,” a conspiracy, widely decried as racist, that White voters are being replaced by non-White voters entering the country. \n\n“These kinds of lies make the assumption that the ‘real’ voters are White voters,” said Gilda Daniels, author and professor at the University of Baltimore Law School. “That other-ism, that idea that immigration is out of control, and so we have all these people who are not White [voting].” \n\nNon-citizen voting is not widespread, and it is already illegal for non-citizens to vote in national elections. Non-citizens who vote can face fines, prison time, or even deportation. A Washington Post analysis of the conservative Heritage Foundation’s data found that of 2 billion votes cast since 1979, there were only 85 cases involving allegations of non-citizen voting. \n\nOther posts that Musk frequently engages with discuss potential tampering with voting machines, vulnerabilities of absentee voting, and the need for stricter photo ID laws. His posts on mail-in ballots have a combined 344 million views, and posts about voter ID have a combined 524 million views. He also advocates for hand-counting paper ballots without machines, which experts say makes it difficult to audit ballots for accuracy. \n\n“They’re throwing everything against the wall and seeing what sticks,” said Becker. “As with all disinformation, it is not based at all on truth or actual policies that need to be improved upon or changed. It is based solely upon outcome, because [Musk] is highly invested in seeing a Donald Trump presidency.” \n\n Amplification of the extreme \n\nAn analysis by Convocation Research + Design, or CoRD, a research lab that focuses on disinformation and the far-right, has found that the accounts he replies to reposts the most on this topic primarily post far-right ideas, including the great replacement theory. \n\n“More and more often these accounts Musk is engaging with are far right, and become further right,” said Sam Smith, co-founder of CoRD. \n\n “We have witnessed Musk become more right-wing in his posting, as well as more political.” \n\nWithin his most amplified accounts are several profiles known to engage in far right ideology. On the topic of election security, he engages the most with “EndWokeness,” an account known for spreading conspiracies about immigration and posting racist memes. Earlier this year, Musk reposted an EndWokeness post falsely claiming that the number of people registering to vote without a photo ID in three states was “skyrocketing.” \n\n“Extremely concerning,” Musk wrote in a post that gained 65.7 million views. State election officials confirmed that the numbers in the post represented the number of requests from the states to the Social Security Administration to verify voter identities, not new voter registrations. \n\nResearchers are concerned with the way that Musk’s engagement with right-wing accounts may alter the posts other X users see on their profiles. \n\n“If Musk frequently engages with or amplifies far-right content, the platform’s algorithm may prioritize similar content for his followers. This can lead to an unintended exposure to extreme viewpoints, misinformation, or harmful ideologies,” said Smith. \n\nRepublican lawmakers and conservative activists are also among the top ten accounts Musk interacts with on the topic of election integrity: Speaker of the House Mike Johnson, Sen. Mike Lee’s alt account “BasedMikeLee,” and Steven Miller, former senior adviser to President Trump, who now runs America First legal. \n\nIn response to a thread from Johnson on the SAVE Act, a bill that would have required proof of citizenship to vote, Musk wrote “Those who oppose this are traitors. All Caps: TRAITORS. What is the penalty for traitors again?” The repost had 56.8 million views. \n\nFor election night, and the days after, experts like Becker are concerned about the reach of Musk’s posts and the impact they may have on trust in the process. \n\n“When we see attacks on the judiciary, when we see attacks on law enforcement, when we see attacks on election officials, when we see attacks on voters themselves, those will probably be amplified by Musk on his platform that he owns,” he said. \n\n“So, the ability of the truth to reach citizens is going to be extremely limited while the ability of liars to defraud citizens is going to be maximized,” Becker said. \n\n Facts about voting \n\n Non-citizen voting refers to voting by unauthorized immigrants, green-card holders, or immigrants on temporary visas. Voting by these groups is not widespread. Federal law requires citizenship to vote in national elections, and voters attest under penalty of perjury that they are citizens when they register. Non-citizens who vote can face fines, prison time or even deportation. A Washington Post analysis of the conservative Heritage Foundation’s data found that of 2 billion votes cast since 1979, there were only 85 cases involving allegations of non-citizen voting. A study of Arizona voter rolls found 1,934 voters in Arizona were non-citizens — 0.04% of the state’s registered voters. After the 2016 election, analysis by the Brennan Center for Justice found 30 cases of suspected non-citizens voting reported by election officials out of 23.5 million votes cast in 42 jurisdictions that were reviewed. Non-citizen representation: The Constitution states that all people should be counted in the apportionment of seats in the House of Representatives, which is used to calculate the number of electoral votes each state receives. Even if the census includes a citizenship question, according to the Constitution, non-citizens would be counted in the population totals used for determining congressional and electoral representation. Analyses by the Pew Research Center and Center for Immigration Studies found that not counting non-citizens in apportionment of House seats would have minimal impact on the additional seats that historically lean toward Democrats. Voting machines must pass federal and state certification standards to be deployed and are tested before voters cast their ballots to make sure they are working properly. Additionally, while voting machines are highly accurate in counting votes, widely used paper ballots allow those machine counts to be checked and audited by people. Forty-nine states performed a post-election audit of some kind, including Pennsylvania, which found just 24 discrepancies among the 201,715 total votes officials reviewed in 2023. That’s about 1/100 of 1% of all ballots audited. According to the Election Infrastructure Government Coordinating Council and others, “All of the states with close results in the 2020 presidential race” had paper records of each vote. Mail-in voting: Historically, mail ballot systems have had bipartisan trust. Security measures protect against vulnerabilities such as tampering, impersonation and ballot stuffing. Mail-in ballots are enclosed in sealed envelopes that are confirmed for eligibility. The voter’s identity is verified by signature and other identifying information to ensure it matches details on file. Multiple election staff members or bipartisan teams are present when ballots are retrieved and handled throughout the process. Election officials track issued ballots to prevent duplicate voting with serial numbers or barcodes, and the number of ballots received is compared to the number of voters who applied for a ballot. Suspicious ballots are investigated and relayed to law enforcement as needed. \n\n contributed to this report.","summary":"Elon Musk has used the social media platform he owns to amass nearly 3.3 billion views on X by fueling doubts about election security issues since January this year — making the tech mogul one of the most viral voices on elections during the 2024 campaign, a CBS News investigation has found. Musk has frequently &#8230;\n\n\nThe post The X factor: How Trump ally Elon Musk is using social media to prime voter mistrust ahead of 2024 election appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/the-x-factor-how-trump-ally-elon-musk-is-using-social-media-to-prime-voter-mistrust-ahead-of-2024-election/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/21/91c888f6-e33a-45b0-b4e0-623e432a6969/thumbnail/1200x630/28cf6e482ccbb1f0495e5988b8c80652/gettyimages-2176078700.jpg?v=b241b87adbbb7f0a227ed35b96d0cefa","video":null,"publish_date":"2024-10-22 01:05:05","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.125},{"id":260578180,"title":"Genius move virtually secures Trump victory","text":"“Even if you flippin’ fries at McDonald’s,” Oprah Winfrey once said, “if you are excellent, everybody wants to be in your line.”\n\nI thought of this quote when Donald Trump turned up yesterday at a McDonald’s restaurant in suburban Philadelphia to work a shift making French fries, then handing bags of food to drive-through customers.\n\nAs political stunts go, this might have been the best I’ve ever seen, because it served two very powerful purposes in the presidential race.\n\nFirst, it reminded voters that his rival, Kamala Harris, has repeatedly boasted about having a summer job at McDonald’s to make her sound more relatable to her fellow Americans, but to date, not a single person has been able to verify this.\n\nThis is quite extraordinary given how specific she has been, with her campaign team stating that she worked at McDonald’s on Central Avenue in Alameda, Calif., in 1983 after her freshman year at Howard University, working on the cash register, French fries station and ice cream machine.\n\nBut then, she didn’t mention it in her memoir, nor does it appear on the 1987 resumé she submitted when applying for a position at the Alameda County District Attorney’s Office despite listing her other work experiences.\n\nIt was like it never happened at all!\n\nEven more intriguingly, the New York Times reported on Sunday: “In subsequent years, Ms. Harris talked so little about her long-ago job at McDonald’s that even some of her friends and close aides did not know she had worked there.”\n\nForgive me, but I smell the same gigantic, disingenuous rat that Trump’s been smelling about Kamala’s supposed McDonald’s career move.\n\nAnd it matters because it goes right to the heart of the Democratic candidate’s persistent pitch that she is the truth antidote to fork-tongued Trump.\n\nIf you’re going to position yourself as a bastion of honesty, you can’t tell brazen, self-promoting “I’m middle class just like you” fibs about working at McDonald’s.\n\nThe second reason why Trump’s stunt worked so effectively is because McDonald’s is about the purest personification imaginable of the American free market dream — a place where everyone can afford to eat, and equally, where everyone has a shot at potentially running a McDonald’s franchise one day.\n\nThere are 13,562 McDonald’s restaurants in America, a third of all the McDonald’s outlets in the entire world.\n\nThey’re in all 50 states, spread across over 5000 cities.\n\nAnd they serve 25 million people a day, approximately 7.5 per cent of the US population.\n\nStaggeringly, nearly nine out of 10 American households visited McDonald’s at least once in the past year.\n\nAnd the No. 1 biggest-selling item on the menu is the original, basic French fries.\n\nSo when Donald Trump announced, “I’ve always wanted to work at McDonald’s” as he arrived yesterday, and then donned his apron to start preparing those very fries, he was tapping directly into a job that so many of his countrymen can instantly relate to.\n\nAmazon’s billionaire founder Jeff Bezos worked at McDonald’s, as did the likes of Jay Leno, Pink, James Franco, Pharrell Williams and Olympic great Carl Lewis.\n\nAnd so have millions of ordinary non-celebrity Americans.\n\nMcDonald’s is the great unifier, crossing all race, gender, age and creed divides.\n\nAnd Trump was very clearly “lovin’ it” every minute he was a temporary employee of the iconic burger chain.\n\n“I could do this all day,” he exclaimed. “I love McDonald’s, I love jobs, I love to see good jobs.”\n\nMembers of the carefully screened public who drove through to be handed free bags of food by the former, and possibly next, president were all lovin’ it too, looking thrilled by their interactions with their unlikely server.\n\nOne woman even thanked him for “taking a bullet for us”.\n\n“To be successful,” Ray Kroc, who bought the company from the original founding McDonald brothers and transformed it into a global powerhouse, said of his business strategy, “you must be daring … and different.”\n\nWell, Trump definitely pursued a daring and different campaign path with this stunt, and I think it paid off spectacularly.\n\nFor a privileged billionaire who’s never been seen cooking a meal in his life to put a shift in at McDonald’s like that was not just hilariously funny, it was also a powerful connective link to regular voters.\n\nAnd to those who have mocked him for it or lambasted him for alleging Harris invented her own Golden Arches experience, I’m reminded of Kroc’s other business ethos: “If any of my competitors were drowning,” he said, “I’d stick a hose in their mouth and turn on the water. It is ridiculous to call this an industry. This is not. This is rat eat rat, dog eat dog. I’ll kill ’em, and I’m going to kill ’em before they kill me. You’re talking about the American way — of survival of the fittest.”\n\nIf Donald Trump wins the election in 15 days, as I believe he will, it may well be this stunt that won it for him. And if he doesn’t, he sounds like the perfect guy to run a McDonald’s in the spirit of Ray Kroc!\n\nThis article originally appeared on the New York Post and has been republished with permission.","summary":"Donald Trump’s Macca’s stunt has divided commentators, but Piers Morgan has praised it as “the best I’ve ever seen”.","url":"https://www.news.com.au/world/piers-morgan-trumps-genius-stunt-will-fry-kamala-at-the-ballot-box/news-story/e2bc684e6c5869a78324e55a36c5ae22?from=rss-basic","image":"https://content.api.news/v3/images/bin/3d464ffb7a03b134d1423c2bebca6cc6","video":null,"publish_date":"2024-10-22 01:03:37","author":"Piers Morgan","authors":["Piers Morgan"],"language":"en","category":"politics","source_country":"au","sentiment":0.072},{"id":260578100,"title":"Donald Trump Would Hire CEOs His Age. Is Mandatory CEO Retirement Bad?","text":"Whether in the Oval Office or the boardroom, age is becoming a bigger topic.\nAFP via Getty Images\n\nThe number 65 is a milestone—especially when it comes to retirement. Since the Social Security Act of 1935, 65 has been the age at which individuals could first claim full retirement benefits. Over the decades, this number has served as the informal \"passing of the torch\" for many executives. But a 65-year-old today is far from what a 65-year-old was in 1935. The notion that age alone is a reason to step aside has risen into question more. Critics argue that this approach ignores modern advances in healthcare, longevity, and executive performance. Consider this: in 1935, the average life expectancy was 59.9 years. Today, it's 77.5, according to the CDC.\n\nDespite these advances, ageism persists—even as people live longer, healthier lives. Ageism has also become a political issue, particularly with President Biden at 81 and former President Donald Trump turning 78 a few months ago. Trump recently remarked in an interview with Bloomberg Editor-in-Chief John Micklethwait that he would indeed appoint a CEO his age, stating, \"Some of our great world leaders are in their 80s.\" But when it comes to corporate leadership, is age still relevant?\n\nAre Older CEOs Outdated Or An Untapped Resource?\n\nIn the corporate world, CEOs are trending older. According to Madison Trust, the average age of a Fortune 500 CEO is 59.2, with only six Fortune 500 CEOs older than Trump. As reported by CBS News, more Americans over 65 are also staying in the workforce, with the 75+ group being one of the fastest-growing segments. In fact, in 2022, 1 in 12 people over 75 were still working, up from 1 in 20 two decades ago, according to the Labor Department.\n\nHowever, age-based retirement policies still exist, particularly for board members. A report by executive search firm Spencer Stuart in 2023 found that 69% of S&P 500 boards have mandatory retirement policies, with 97% setting the age at 72 or higher and 57% setting it at 75 or older. Legally, as shared in a CNN report, the Age Discrimination in Employment Act (ADEA) allows companies to mandate retirement for bona fide executives and high-level policy makers over 65 if they receive a non-forfeitable retirement benefit of at least $44,000 annually. However, with advancements in science, technology, and health, heavily relying on age as a metric for CEO retirement is looking increasingly outdated. Here are three critical ways companies can shift from a rigid age-based approach to a more nuanced strategy for evaluating their CEOs.\n\nAge isn't the most important metric for CEOs capability.\n\n1.Prioritize CEO Health and Well-Being\n\nThe traditional argument for mandatory retirement is the expectation of declining physical and mental health. However, today's health advancements enable people to maintain high levels of well-being well beyond 65. This could be taken further for CEOs who already undergo annual executive physicals. Companies could easily replace arbitrary age limits with comprehensive, in-depth health and well-being assessments. These evaluations could ensure that CEOs maintain the mental, emotional, and physical capacity to lead. Moreover, a CEO who prioritizes their well-being can set a positive example for the entire organization. Just as companies have KPIs for business performance, they could also implement KPIs for CEO health. This move would not only ensure effective leadership, but it could also trickle down to improve the health and productivity of employees across the board as the leader sets the tone for the organization.\n\nChevron CEO Mike Wirth Shares How CEOs Can Build Stronger Team Loyalty\n\n2.Focus on Leadership, Innovation, and Vision\n\nIn baseball, pitchers may lose velocity with age, but the greats adjust and evolve. Similarly, older CEOs may not have the same youthful vigor, but they bring a wealth of experience and wisdom. The question and concern isn't the CEOs' age but whether they can still inspire, lead, and innovate in today's fast-paced, ultra-competitive, ever-changing business environment. Is your CEO adapting to current technologies and preparing the company for future challenges? Are they evolving their leadership style to keep up with a modern workforce? These are the more relevant questions to ask, rather than focusing solely on age. CEOs should be evaluated by their boards and organizations based on their ability to navigate complexity, lead through uncertainty, and drive innovation.\n\n3.Develop Succession and Mentorship Plans\n\nWhen older CEOs are still mentally sharp and physically healthy, they represent a wealth of knowledge that can benefit the company for years. The challenge for organizations is determining when and how to transition leadership. Succession planning doesn't mean sidelining the current CEO. Instead, it presents an opportunity for mentorship. Just as successful sports coaches are often remembered for the leaders they develop, CEOs can build a lasting legacy by building up their successors. Warren Buffet, for example, has named Greg Abel his successor at Berkshire Hathaway, yet remains fully engaged in leading the company. The goal is to create a seamless transition, which could take years. Companies should avoid blanket age limits and develop personalized transition plans based on ongoing health, leadership, and vision evaluations.\n\nWhether in the Oval Office or the boardroom, the adage \"age is just a number\" is becoming increasingly appropriate. Thanks to modern healthcare, readily available information, and many people's desire to keep working, organizations must adopt a more nuanced approach to age or risk missing out on some of their most valuable assets.","summary":"Former president Donald Trump stated he’d hire a CEO his age. This raises the question: Is the mandatory retirement age for CEOs still relevant today?","url":"https://www.forbes.com/sites/julianhayesii/2024/10/21/donald-trump-would-hire-ceos-his-age-is-mandatory-ceo-retirement-bad/","image":"https://imageio.forbes.com/specials-images/imageserve/6716e3efa32e51b0f0688f4d/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-10-22 01:00:06","author":"Contributor,Julian Hayes II","authors":["Contributor","Julian Hayes II"],"language":"en","category":"politics","source_country":"US","sentiment":0.213},{"id":260578620,"title":"The Trump shadow hovers as the global economy breaks apart","text":"The IMF, the world’s lender of last resort, and the World Bank, which provides longterm funding for infrastructure development and poverty alleviation, will debate how to make themselves more effective and relevant, do a better job of financing development and the response to climate change and better reflect the shifting balance of the global economy from the West to the East and South.\n\nThey’ll also consider how to respond to an increasingly indebted world, one in which developing economies are devoting an increasing proportion of their revenues to servicing their debts, and one where restructuring sovereign debt has been complicated and often frustrated by China’s status as a major creditor of developing economies through its Belt and Road initiative. (China resists acknowledging losses on its loans).\n\nThe IMF has said that global public debt will reach a record $US100 trillion ($150 trillion) by the end of this year, or 93 per cent of global GDP, and 100 per cent of GDP by 2030. It could, perhaps, be as much as 115 per cent of GDP within three years in the most adverse of the IMF’s scenarios.\n\nWhile it’s not explicitly on the agenda, the organisations will also have to consider the implications of another Donald Trump presidency for their own futures and that of multilateralism more broadly. The “Tariff Man” and his trade policies would see the US aggressively undermining the post-war world economic order and the multilateral institutions it helped create and promote.","summary":"In the US and Russia this week, two meetings are being held at a critical moment for the global economy. In the background is Donald Trump.","url":"https://www.theage.com.au/business/the-economy/the-trump-shadow-hovers-as-the-global-economy-breaks-apart-20241022-p5kk71.html","image":"https://static.ffx.io/images/$zoom_0.7065%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1%2C$y_0/t_crop_custom/q_86%2Cf_auto/cbd4f1f2f9d7892083d2648424a94adcc53c93a4","video":null,"publish_date":"2024-10-22 00:59:58","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":0.415},{"id":260578330,"title":"The Trump shadow hovers as the global economy breaks apart","text":"The IMF, the world’s lender of last resort, and the World Bank, which provides longterm funding for infrastructure development and poverty alleviation, will debate how to make themselves more effective and relevant, do a better job of financing development and the response to climate change and better reflect the shifting balance of the global economy from the West to the East and South.\n\nThey’ll also consider how to respond to an increasingly indebted world, one in which developing economies are devoting an increasing proportion of their revenues to servicing their debts, and one where restructuring sovereign debt has been complicated and often frustrated by China’s status as a major creditor of developing economies through its Belt and Road initiative. (China resists acknowledging losses on its loans).\n\nThe IMF has said that global public debt will reach a record $US100 trillion ($150 trillion) by the end of this year, or 93 per cent of global GDP, and 100 per cent of GDP by 2030. It could, perhaps, be as much as 115 per cent of GDP within three years in the most adverse of the IMF’s scenarios.\n\nWhile it’s not explicitly on the agenda, the organisations will also have to consider the implications of another Donald Trump presidency for their own futures and that of multilateralism more broadly. The “Tariff Man” and his trade policies would see the US aggressively undermining the post-war world economic order and the multilateral institutions it helped create and promote.","summary":"In the US and Russia this week, two meetings are being held at a critical moment for the global economy. In the background is Donald Trump.","url":"https://www.brisbanetimes.com.au/business/the-economy/the-trump-shadow-hovers-as-the-global-economy-breaks-apart-20241022-p5kk71.html","image":"https://static.ffx.io/images/$zoom_0.7065%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1%2C$y_0/t_crop_custom/q_86%2Cf_auto/cbd4f1f2f9d7892083d2648424a94adcc53c93a4","video":null,"publish_date":"2024-10-22 00:59:58","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","source_country":"au","sentiment":0.415},{"id":260577642,"title":"Olivia Nuzzi and New York Magazine End Their Relationship Following RFK Jr. Situation","text":"New York Magazine announced Monday that it is parting ways with star political reporter Olivia Nuzzi, whose previously undisclosed personal relationship with Robert F. Kennedy Jr. led to an investigation into her work during the 2024 campaign.\n\nThe investigation, conducted by the law firm Davis Wright Tremaine, “reached the same conclusion as the magazine’s initial internal review of her published work, finding no inaccuracies nor evidence of bias,” New York Magazine said in a statement on its website. \n\nThe magazine said the two parties agreed to part ways, adding, “Nuzzi is a uniquely talented writer and we have been proud to publish her work over her nearly eight years as our Washington Correspondent.”\n\nIn a statement to Vanity Fair, Nuzzi’s attorney, Ari Wilkenfeld, wrote that Nuzzi “is gratified though not surprised that two different investigations have determined that her reporting on the 2024 campaign was sound and that she did nothing wrong.”\n\nNuzzi was put on leave last month after she admitted to a “personal relationship” with Kennedy. At the time, she wrote in a statement to The New York Times that “some communication between myself and a former reporting subject turned personal.”\n\nShe added, “The relationship was never physical but should have been disclosed to prevent the appearance of a conflict.” While she had covered the subject previously, Nuzzi said, she did not report on him directly during their relationship.\n\nKennedy’s spokesperson, meanwhile, wrote that he “only met Olivia Nuzzi once in his life for an interview she requested, which yielded a hit piece.”\n\nNuzzi wrote a profile on Kennedy, the former independent presidential candidate, in November headlined: “The Mind-Bending Politics of RFK Jr.’s Spoiler Campaign.” Its subheading read: “He’s a conservative. He’s a liberal. And he could turn the presidential race upside down.”\n\nKennedy dropped out of the race in late August and endorsed Donald Trump. He is the son of the late Attorney General Robert F. Kennedy and is married to “Curb Your Enthusiasm” star Cheryl Hines.","summary":"New York Magazine announced Monday that it is parting ways with star&#8230;","url":"https://internewscast.com/news/us/olivia-nuzzi-and-new-york-magazine-end-their-relationship-following-rfk-jr-situation/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Olivia-Nuzzi-and-New-York-Magazine-part-800x430.jpg","video":null,"publish_date":"2024-10-22 00:43:56","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.298},{"id":260577444,"title":"'What fresh hell is this?' Critics blast headline as whitewashing Trump’s latest speech","text":"Politico published a story on Monday that critics say sanitized Donald Trump's speech in storm-ravaged Asheville, North Carolina — even as the article acknowledged several other chaotic developments and actions the former president has taken in the previous few days.\n\n\"After a weekend of headlines about Donald Trump’s entertainment-focused message on the campaign trail — he jokingly touted the size of Arnold Palmer’s genitalia, learned how to cook McDonald’s french fries and appeared at a Steelers game — the former president delivered a more somber address about the resilience of survivors of the deadly storm, while also bashing the Biden-Harris administration’s response,\" said the report, written by Natalie Allison.\n\nCommenters on social media took umbrage, accusing Politico of whitewashing Trump's extreme behavior.\n\n\"In 2024 Trump being 'somber' just means he didn’t explicitly mention anyone’s genitalia or call for using the military against Americans,\" wrote Dave Willett of the League of Conservation Voters.\n\nSome commenters pointed out that Trump's \"somber\" tone wasn't all that somber; Kamala Harris campaign spokesman Ian Sams posted a video of Trump praising gunmen who threatened FEMA aid workers trying to help the city, saying, “I think you have to let people know how they’re doing. If they’re not doing, if they’re doing a poor job, we’re supposed to not say it? By doing that, they’ll do a better job next time.” \n\n\".@politico wrote this up with a headline about Trump striking a somber tone,\" wrote national security attorney Bradley Moss.\n\n\"What fresh hell is this @politico ?!\" wrote former Chicago and Seattle local news reporter Jennifer Schulze. \"Take a look at the actual clips of Trump in NC and see if you think this is anyone's idea of somber. Good grief.\"\n\n\"Dear @politico reporters. It really is OK to fact-check candidates' claims -- rather than just repeat them verbatim as if you're human tape-recorders,\" wrote former Wall Street Journal editor and Columbia University professor Bill Grueskin, emphasizing the article omitted that many of Trump's claims about absent disaster response in North Carolina were false.\n\n\"Literally WHAT is happening in the Politico newsroom?? Trump angrily lied & politicked throughout his NC damage tour-- including justifying threats against FEMA workers stemming from his own disinformation,\" wrote T.J. Adams-Falconer, a former adviser to former President Barack Obama.\n\n\"I’ve resisted the conclusion that the mainstream press wants Trump to win,\" wrote progressive reporter Aaron Rupar. \"But stuff like this really makes me wonder what the hell is going on in some of these editorial meetings.\"","summary":"Politico published a story on Monday that critics say sanitized Donald Trump's speech in storm-ravaged Asheville, North Carolina — even as the article acknowledged several other chaotic developments and actions the former president has taken in the previous few days.\n\n\"After a weekend of headlines about Donald Trump’s entertainment-focused message on the campaign trail — he jokingly touted the size of Arnold Palmer’s genitalia, learned how to cook McDonald’s french fries and appeared at a Steelers game — the former president delivered a more somber address about the resilience of survivors of the deadly storm, while also bashing the Biden-Harris administration’s response,\" said the report, written by Natalie Allison.\n\nCommenters on social media took umbrage, accusing Politico of whitewashing Trump's extreme behavior.\n\n\"In 2024 Trump being 'somber' just means he didn’t explicitly mention anyone’s genitalia or call for using the military against Americans,\" wrote Dave Willett of the League of Conservation Voter","url":"https://www.alternet.org/critics-blast-trump-latest-speech/","image":"https://www.alternet.org/media-library/image.jpg?id=23476138&width=1200&height=600&coordinates=0%2C18%2C0%2C19","video":null,"publish_date":"2024-10-22 00:43:11","author":"Matthew Chapman,Raw Story","authors":["Matthew Chapman","Raw Story"],"language":"en","category":"politics","source_country":"US","sentiment":-0.184},{"id":260578270,"title":"Trump leans on Christians in final Sun Belt push","text":"Peter Navarro, Trump’s former trade ambassador, spoke ahead of the former president and outright told the crowd that if Harris wins in November, both the countries and devout Christians will suffer.\n\nDr. Ben Carson, Trump’s former secretary of housing and urban development, declared that the 2024 election will determine if the U.S. is a “secular nation” or “one nation under God.”\n\n“We are a people of faith,” Carson stated. “We will not give that up.”\n\nTrump’s own remarks came immediately following a live performance of “God Bless the U.S.A.” by Lee Greenwood, and the former president opened by reminding the crowd that he has a granddaughter named Carolina.\n\n“We need more of that,” Trump added in agreement when an attendee shouted out “Jesus is Lord” during a break in his speech.\n\nTrump briefly described his own faith, recalling going to church with his parents and being impressed by the “amazing” preacher yet not quite absorbing all of the lessons in his sermon.\n\nThe former president proceeded to say that, after reflecting on the two recent attempts on his life, he “now [recognizes] that it was the hand of God guiding me.”\n\n“I think they became more religious that day,” he added of his sons, Eric and Donald Jr. Trump, who are both avid shooters and were stunned by Trump’s survival in Butler.\n\nTrump quickly turned his faith discussion into an attack on Harris, singling out her recent handling of Christian hecklers at a campaign rally in Wisconsin.\n\n“She’s very destructive to religion. She’s very destructive to Christianity,” he told the crowd. “She’s your worst nightmare.”\n\nTrump’s crowd responded with renewed chants of “Jesus! Jesus!”\n\n“I’m here to deliver a simple message to Christians across America,” the former president closed. “It’s time to stand up and save your country. On November 5 Christian voters need to turn out in the largest numbers ever.”\n\nStill, roughly 15 minutes into the former president’s remarks, a slow stream of attendees began departing the Concord Convention Center. Harris, of late, has started mocking Trump’s rambling during his rallies, causing some attendees to leave before he finishes speaking.\n\nA number of rally attendees told the Washington Examiner that they were pleased to see Trump highlighting Christianity in the final days of the election.\n\nKendra Ashwood, who lives in nearby Kannapolis, said that she wanted to attend the Concord rally because Carson, whom she called a “good, Christian man,” would be speaking alongside Trump.\n\nU.S. Marine Kenneth Murray, a transplant from New York to North Carolina, claimed to have met Trump in the 1980s. Though he said he had not purchased a copy of the Bible Trump has been selling, Murray cheered the former president’s decision to focus on faith Monday night.\n\n“Faith is a very, very, very personable thing. Your level of faith is shown in the substance of your family. People say, ‘Prayer don’t help,’” he stated. “That’s because they’re living in the flesh. They need to learn to separate the flesh and the spirit.”\n\nTrump isn’t alone among Republicans in focusing on North Carolina. The former president carried the state in 2020 by less than 2 points, Trump’s narrowest win of any state last cycle, and Democrats have claimed that since 2022 the abortion debate puts North Carolina back in play for Democrats.\n\n“We are going to win or lose the presidency based on what happens in North Carolina,” Republican National Committee chairman Michael Whatley assessed last week while taking part in a GOP bus tour.\n\nDespite delays caused by Helene, North Carolinians have already cast more than 1 million ballots since early voting began earlier this month and are expected to cast 5.5 million ballots once polls close on Nov. 5.Polls have given Trump slight advantages over Vice President Kamala Harris in Arizona, Georgia, and North Carolina since September — 1.6, 1.8, and 0.5 points, respectively, as of Monday, according to the RealClearPolitics polling average.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nThe former president held three separate events in North Carolina on Monday, starting his morning by visiting Asheville, the western North Carolina city ravaged by Hurricane Helene. Trump had previously visited Valdosta, Georgia in the days following Helene’s landfall, but his Monday appearance was his first to survey storm damage in the Western part of the Tar Heel State.\n\nMonday afternoon, Trump proceeded to hold a rally in Greenville, North Carolina before heading to Concord, Trump will hold yet another North Carolina rally, this one in Greensboro, on Tuesday afternoon following campaign stops in Florida and Georgia.","summary":"CONCORD, North Carolina — Former President Donald Trump is making a final push to win over evangelicals in the final two weeks of the 2024 election, campaigning in the south with religious leaders Monday. Trump&#8217;s campaign schedule, which has seen him visit Georgia and North Carolina, as well as a planned visit to Florida, makes it [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3197847/trump-leans-christians-final-sun-belt-push/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/trump_north_carolina_oct.webp","video":null,"publish_date":"2024-10-22 00:35:05","author":"Christian Datoc","authors":["Christian Datoc"],"language":"en","category":"politics","source_country":"US","sentiment":-0.023},{"id":260577890,"title":"Blinken Heads To Middle East As Israel Intensifies Strikes In Lebanon","text":"US Secretary of State Antony Blinken left for the Middle East Monday on a new push for an elusive Gaza ceasefire two weeks before US elections, seeing a new opportunity from Israel's killing of Hamas's leader.It will be the 11th trip to the Middle East by the top US diplomat since war broke out a year ago, with Blinken on his last visit to Israel in August warning it may have been the \"last chance\" for a US-led ceasefire plan.That push did not succeed, and the conflict has escalated and expanded since then, with Israel pounding Hezbollah targets in Lebanon and warning of a new strike directly on Iran, whose clerical leaders back both Hamas and Hezbollah.US President Joe Biden, who personally laid out the ceasefire plan on May 31 that would also free hostages from Gaza, has seen new hope since Israel last week killed Hamas chief Yahya Sinwar.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Biden, speaking to reporters on a visit to Germany, said he called Prime Minister Benjamin Netanyahu to congratulate him and tell him that Blinken would head to the region.\"I told him that we were really pleased with his actions and, further, that now is the time to move on -- move on, move towards a ceasefire,\" Biden said Thursday.The Gaza war was sparked by the unprecedented Hamas attack on Israel last year that resulted in the deaths of 1,206 people, mostly civilians, according to an AFP tally of official Israeli figures.Israel's retaliatory campaign in Gaza has killed 42,603 people, also mostly civilians, according to data from the health ministry in the Hamas-run territory, figures the UN considers reliable.Last month, Israel expanded its military operations to Lebanon, where at least 1,470 people have been killed since then, according to an AFP tally of Lebanese health ministry figures.Blinken's trip comes days after he and Defense Secretary Lloyd Austin warned Israel that the United States could withhold some of its billions of dollars in military aid unless more humanitarian assistance is allowed into Gaza, where the UN warns more than 1.8 million people are facing extreme hunger.- US election implications -A breakthrough could be a major boost for US Vice President Kamala Harris, who is running in a razor-tight November 5 race for the White House against Donald Trump.The war has been a political albatross for Biden and to an extent Harris, his political heir, with Netanyahu repeatedly brushing aside US entreaties to do more to spare civilians.Trump also spoke to Netanyahu about Sinwar's killing, with the Republican saying that the Israeli leader was proven right in ignoring Biden's pressure to dial back military operations.Trump suggested he would give freer rein to Netanyahu, telling reporters that Biden was \"trying to hold him back and he probably should be doing the opposite.\"Trump staunchly backed Israel in his first term. He has a complicated relationship with Netanyahu but Republican voters, unlike Democrats, are overwhelmingly supportive of Israel and Netanyahu.- Seeing ways forward -Blinken flies first to Israel and then will tour other countries in the Middle East through Friday.An official on the plane with him said Blinken will visit Jordan on Wednesday and discuss humanitarian aid for the Gaza Strip.The State Department did not list his other stops but on previous trips Blinken has visited a number of Arab countries, especially Qatar and Egypt, the key intermediaries in ceasefire negotiations.Blinken \"will discuss the importance of bringing the war in Gaza to an end, securing the release of all hostages and alleviating the suffering of the Palestinian people,\" a State Department statement said.It said Blinken would also discuss post-war arrangements critical for a peace deal and seek a \"diplomatic resolution\" in Lebanon, where the United States has stopped short of urging an immediate ceasefire.Blinken has also sought to coax Netanyahu into compromise by dangling the prospect of normalization with Saudi Arabia -- which would be a historic game-changer in Israel's quest for acceptance, as the kingdom is the guardian of Islam's two holiest sites.Netanyahu, leading the most right-wing coalition in Israeli history, has called Sinwar's death \"the beginning of the end\" of the Gaza war but faces calls from his base to keep up military operations in Gaza, which has already largely been reduced to rubble.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"US Secretary of State Antony Blinken left for the Middle East Monday on a new push for an elusive Gaza ceasefire two weeks before US elections, seeing a new opportunity from Israel's killing of Hamas's leader.","url":"https://www.ndtv.com/world-news/us-secretary-of-state-antony-blinken-heads-to-middle-east-as-israel-intensifies-strikes-in-lebanon-6843454","image":"https://c.ndtvimg.com/2023-11/mqsci3sk_antony-blinken_625x300_30_November_23.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2024-10-22 00:25:13","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.375},{"id":260577000,"title":"A week after China’s war games, US and Canadian warships sail through Taiwan Strait","text":"U.S. and Canadian warships sailed through the Taiwan Strait last weekend, almost a week after China held massive military exercises around Taiwan, which Beijing claims as its own territory.\n\nThe destroyer USS Higgins and the Canadian frigate HMCS Vancouver made a “routine” transit of the Taiwan Strait meant to uphold the principle of freedom of navigation for all countries, read a statement yesterday by the U.S. Navy’s 7th Fleet.\n\nThe U.S. Navy, occasionally joined by ships from allied countries, regularly transits the sensitive waterway separating China from Taiwan. Germany sent two warships through the Taiwan Strait last month as it seeks to increase its defense engagement in the Asia-Pacific region.\n\nChina condemned the joint U.S.-Canada maneuver.\n\n“The Taiwan issue is not about freedom of navigation but concerns China’s sovereignty and territorial integrity,” Foreign Ministry spokesperson Lin Jian said. “China firmly opposes any country provoking or threatening China’s sovereignty and security in the name of freedom of navigation.”\n\nThe Chinese military’s Eastern Theater Command said the transit of the U.S. and Canadian warships undermined peace and stability in the region, and that it had mobilized naval and air forces to monitor them “in accordance with the law.”\n\nThe ships navigated “through waters where high-seas freedom of navigation and overflight apply in accordance with international law,” read the U.S. Navy 7th Fleet statement.\n\n“The international community’s navigational rights and freedoms in the Taiwan Strait should not be limited,” it added.\n\nLin, asked about recent comments by U.S. presidential candidate Donald Trump on Taiwan and China, said that Taiwan is a domestic issue “that allows no external interference” and that China opposes “any U.S. individuals making an issue of China during the elections.”\n\nTrump told the Wall Street Journal editorial board that he is confident that China wouldn’t invade Taiwan if he were to return to the White House.\n\nThe U.S.-Canada transit came less than a week after China conducted large-scale military exercises surrounding Taiwan and its outlying islands last Monday, simulating the sealing off of key ports in a move that underscores the tense situation in the Taiwan Strait.\n\nBeijing employed a record 125 aircraft, as well as its Liaoning aircraft carrier and ships as part of the drills, which were in reaction to a “National Day” speech by Taiwanese leader Lai Ching-te. Lai had emphasized his commitment to “resist annexation or encroachment” by Beijing.\n\nThe U.S. is Taiwan’s biggest unofficial ally and is bound by its own laws to provide the island with the means to defend itself. China objects to American military sales and aid to Taiwan.\n\nChina also tries to restrict Taiwan’s diplomatic space.\n\nSouth Africa confirmed last week that it had asked Taiwan to move its liaison office from Pretoria, the administrative capital, to Johannesburg, in a move seen as a concession to China. MDT/AP","summary":"U.S. and Canadian warships sailed through the Taiwan Strait last weekend, almost a week after China held massive military exercises around Taiwan, which Beijing claims as its own territory. The destroyer USS Higgins and the Canadian frigate HMCS Vancouver made a “routine” transit of the Taiwan Strait meant to uphold the principle of freedom of [&#8230;]\n\n\nThe post A week after China’s war games, US and Canadian warships sail through Taiwan Strait appeared first on MACAU DAILY TIMES 澳門每日時報.","url":"https://macaudailytimes.com.mo/a-week-after-chinas-war-games-us-and-canadian-warships-sail-through-taiwan-strait.html","image":"https://i0.wp.com/macaudailytimes.com.mo/wp-content/uploads/2024/10/AP24295136568901.jpg?resize=150%2C150&ssl=1","video":null,"publish_date":"2024-10-22 00:22:51","author":null,"language":"en","source_country":"mo","sentiment":0.023},{"id":260577478,"title":"CRAIG BROWN: Celebrity sarnie? I can offer you moose or cheese","text":"I’m grateful to my colleague Jan Moir for alerting us all to a new vegan cookbook by the shapely former Baywatch star Pamela Anderson. It is called I Love You, and is subtitled recipes from the heart.\n\nPammy intends to demonstrate ‘how romantic, comforting and indulgent it can be to cook only with vegetables’. In an attempt to convince us of this, she includes recipes for Chicory Dandelion Coffee, Green Glow Juice, and Whipped Cranberry Porridge. And let’s not forget to leave room for her Anti-Inflammatory Lentil Soup.\n\nHow many cookery books do we really need? It seems that the world can never have enough.\n\nAt the moment, the book charts are full to bursting with them. The Food for Life Cookbook by Tim Spector (‘the only gut-health cookbook you need’) is at number one in the Amazon top ten, and Bored of Lunch (‘a revolutionary collection of calorie-counted recipes for your slow cooker’) is at number two.\n\nFor all the hoo-ha surrounding its publication, Boris Johnson’s autobiography Unleashed is only at number 8. If only his publishers had named it ‘Boris’s Great British Banger Cookbook’ and put a photo on the cover of the former PM brandishing a sausage on the end of a fork then it might have made more of a splash.\n\nThe celebrity cookbook is going strong – perhaps even stronger than the celebrity children’s book. Over the years, Oprah Winfrey, Ziggy Marley, Pippa Middleton, Eva Longoria, Sheryl Crow, Alicia Silverstone and Gloria Estefan have all published them.\n\nCurrently, you can buy cookbooks by Stanley Tucci, Gwyneth Paltrow, Reese Witherspoon and even Snoop Dogg, whose work has the unappealing title From Crook to Cook: Platinum Recipes from Tha’ Boss Dogg’s Kitchen.\n\nFamous actors, pop stars and politicians are often asked to contribute recipes for charity publications. I’d guess a fair number of them have no idea how to cook and simply instruct someone on their staff to come up with something suitable.\n\nOn my shelves I have a 1987 House of Commons Cookery Book, featuring Nigel Lawson’s Summer Pudding, Cecil Parkinson’s Lancashire Hot Pot, Margaret Thatcher’s Saute of Chicken with Tarragon Sauce and Edward Heath’s Truite a L’Edward. How many of them ever opened an oven door? \n\nSome celebrities prefer to keep it simple. By far the most straightforward celebrity recipe was contributed to an American cookbook a few years ago by the wry singer/songwriter Randy Newman. \n\nHis contribution went:\n\nRandy Newman’s Primitive Cheese Sandwich\n\n3 Slices English cheddar cheese.\n\n2 Slices white bread.\n\nPlace cheese between bread slices, stacking carefully.\n\nPossibly the most off-putting celebrity recipe appeared in a book written by the swashbuckling American President Teddy Roosevelt back in 1899. ‘Elk tongues are most delicious eating, being juicy, tender and well flavoured; they are excellent to take out as a lunch on a long hunting trip’,\n\nFashions in cookery come and go. Around the same time, an explorer called Frederick Selous published a book in which he recommended ‘elephant heart, roasted on a forked stick over ashes’, though he advised against eating the elephant’s foot, describing it as ‘tasteless and insipid’. \n\nHe also tipped off his readers that ‘giraffes are splendid eating, and... are a luxury that no one can properly appreciate till he has lived for a time on nothing but the dry meat of the smaller antelopes’.\n\nIn his book, Big Game Hunting In The Rockies And On The Great Plains, Roosevelt advised that ‘The flesh of the moose is very good, though some deem it coarse.’ For those who might have dithered over whether to cook it or not, he added, encouragingly, that ‘Old hunters, who always like rich, greasy food, rank a moose’s nose with a beaver’s tail as the chief of backwood delicacies.’\n\nIn the run-up to the Presidential election, it’s hard to imagine Donald Trump or Kamala Harris suggesting a similar tuck-in. Trump himself seems to subsist on a diet of burgers and french fries, which may be why staged a photo opportunity at the weekend dressed in a pinafore serving fries at a McDonald’s in a suburb of Philadelphia. ‘I love salt,’ he exclaimed, shaking extra over a pack of fries.\n\nBon appetit!","summary":"How many cookery books do we really need? It seems that the world can never have enough. At the moment, the book charts are full to bursting with them.","url":"https://www.dailymail.co.uk/debate/article-13985309/CRAIG-BROWN-Celebrity-sarnie-offer-moose-cheese.html","image":"https://i.dailymail.co.uk/1s/2024/10/22/00/91124353-0-image-m-78_1729554330729.jpg","video":null,"publish_date":"2024-10-22 00:19:09","author":"Craig Brown,Editor","authors":["Craig Brown","Editor"],"language":"en","source_country":"gb","sentiment":0.469},{"id":260576562,"title":"How Trump ally Elon Musk is using social media to prime voter mistrust","text":"Elon Musk has used the social media platform he owns to amass nearly 3.3 billion views on X by fueling doubts about election security issues since January this year — making the tech mogul one of the most viral voices on elections during the 2024 campaign, a CBS News investigation has found. Musk has frequently shared conspiratorial narratives that have been vexing to public officials who are trying to maintain Americans' confidence in the election in the face of a barrage of misinformation and disinformation. At his first solo appearance at a pro-Trump rally in Philadelphia last week, Musk claimed, \"Statistically there are some very strange things that happen that are statistically incredibly unlikely.\" He then repeated debunked claims about the validity of vote tallies produced by Dominion voting machines. But even before he took the stage, Musk had already emerged as a prolific conduit for election misinformation on X, formerly known as Twitter. \"The goal all along has been to import as many illegal voters as possible,\" Musk posted in July, echoing the conspiracy that Democrats are purposefully letting immigrants enter the country illegally to vote in the upcoming presidential election. The post gained 45.8 million views. The CBS News Confirmed team fact-checked Musk's posts on election security and found that 55% contain misleading or false statements, or amplify posts that do. Further analysis of these posts showed that 40 of the accounts Musk replied to or reposted were accounts researchers have identified as promoters of voter fraud claims. Musk did not respond to CBS News' request for comment. CBS News collected more than 48,000 of Musk's posts over the past four years, with support from the International Center for Journalists Disarming Disinformation program and the research group Convocation Research+Design. The analysis focused on X posts on the topic of election administration, security and operation. An analysis of nearly 17,000 of Musk's posts from this year, as well as thousands more he replied to or reposted, found 361 posts specifically on the topic of potential election fraud in U.S. elections. Although these election posts represent a small fraction of the dozens of posts Musk publishes each day, each one had an average of 9.3 million views as Musk continues to be the most followed profile on X. Experts are concerned that such high audience engagement on posts amplifying election fraud conspiracies could set the stage for possible post-election chaos. \"On election night, if Trump believes he's losing, he is likely to spread massive amounts of disinformation about the existence of fraud,\" said David Becker, executive director of the Center of Election Innovation and Research. \"I think we can say with near certainty, Elon Musk is going to take those comments and spread them out to hundreds of millions of people to be consumed immediately, while election officials are busy counting ballots,\" Becker said. Mekela Panditharatne, senior counsel for the Brennan Center for Justice's Elections & Government Program, agreed. \"I think that this is galvanizing unfounded fears and concerns about the election process, and preparing for the possibility of unfounded challenges to election results in the aftermath,\" she said. Musk's increased engagement with election conspiracies has mirrored his embrace of the establishment political right. The tech entrepreneur said that he voted Republican for the first time in a Texas congressional race in June 2022. A month later, he wrote that he thought it was time \"for Trump to hang up his hat.\" Over the next two years, posts criticizing President Biden and the prosecution of Trump became more frequent. On July 13, 2024, the day of the first attempted assassination of Trump, Musk announced his formal endorsement of the Republican candidate for a second term. Since then, his posts have shown full-throated support for Trump. \"I have never been materially active in politics before, but this time I think civilization as we know it is on the line,\" Musk posted last month. \"If we want to preserve freedom and a meritocracy in America, then Trump must win.\" Since then he has campaigned with the former president in Arizona and contributed more than $74.95 million to the America PAC, a super PAC that supports Trump's reelection. Musk has also used his platform to go head-to-head with election officials who try to refute his conspiracies. This weekend he posted on X claiming that Michigan has more registered voters than eligible citizens. Michigan Secretary of State Joceyln Benson responded with a correction, saying that there are not more voters than citizens in the state. \"There are 7.2 million active registered voters and 7.9 million citizens of voting age in our state,\" her post said. \"@elonmusk is spreading dangerous disinformation.\" \"Jocelyn Michelle Benson, shame on you for blatantly lying to the public!\" Musk responded. The post amassed 24.2 million views and 39,000 retweets in less than three days. The skepticism online directed towards election officials like Benson can have real-world impacts. The secretary said that she and her team received an uptick in threats and harassing messages directed to her office after Musk's post. She ended up asking her security team to focus on protecting her children and her executive assistant after messages started coming in using extreme language and echoing the concerns about voter registration numbers, citing two incidents of swatting earlier this year. \"It's unnerving because his actions lead to a direct uptick in threats to me and other election officials around Michigan,\" she told CBS News. \"This is all happening when early voting is unfolding in Michigan, and while my team needs to be focused fully on making voting work properly, they are having to deal with this instead.\" Benson's experience is not unique. \"We have seen a number of election officials who have expressed the view that Musk's posts coincide with a surge in questions from constituents about the integrity of the process,\" said Panditharatne. \"Musk's posts have encouraged vitriol directed at election officials.\" Musk focuses on non-citizens, machines and mail voting More than half of Musk's posts on election security this year relate to non-citizen voting or representation in Congress, with many repeating the conspiracy that Democrats under the Biden administration are intentionally allowing an increase in immigration to boost their political power. Some posts even extend beyond the upcoming presidential election to a future political landscape. \"My prediction is that if Kamala wins, the Dems will import and legalize enough migrants to ensure a permanent one-party rule that is increasingly socialist (to a confiscatory level) and repressive,\" wrote Musk in a September post. The idea that Democrats are \"importing voters\" echoes the \"great replacement theory,\" a conspiracy, widely decried as racist, that White voters are being replaced by non-White voters entering the country. \"These kinds of lies make the assumption that the 'real' voters are White voters,\" said Gilda Daniels, author and professor at the University of Baltimore Law School. \"That other-ism, that idea that immigration is out of control, and so we have all these people who are not White [voting].\" Non-citizen voting is not widespread, and it is already illegal for non-citizens to vote in national elections. Non-citizens who vote can face fines, prison time, or even deportation. A Washington Post analysis of the conservative Heritage Foundation's data found that of 2 billion votes cast since 1979, there were only 85 cases involving allegations of non-citizen voting. Other posts that Musk frequently engages with discuss potential tampering with voting machines, vulnerabilities of absentee voting, and the need for stricter photo ID laws. His posts on mail-in ballots have a combined 344 million views, and posts about voter ID have a combined 524 million views. He also advocates for hand-counting paper ballots without machines, which experts say makes it difficult to audit ballots for accuracy. \"They're throwing everything against the wall and seeing what sticks,\" said Becker. \"As with all disinformation, it is not based at all on truth or actual policies that need to be improved upon or changed. It is based solely upon outcome, because [Musk] is highly invested in seeing a Donald Trump presidency.\" Amplification of the extreme An analysis by Convocation Research + Design, or CoRD, a research lab that focuses on disinformation and the far-right, has found that the accounts he replies to reposts the most on this topic primarily post far-right ideas, including the great replacement theory. \"More and more often these accounts Musk is engaging with are far right, and become further right,\" said Sam Smith, co-founder of CoRD. \"We have witnessed Musk become more right-wing in his posting, as well as more political.\" Within his most amplified accounts are several profiles known to engage in far right ideology. On the topic of election security, he engages the most with \"EndWokeness,\" an account known for spreading conspiracies about immigration and posting racist memes. Earlier this year, Musk reposted an EndWokeness post falsely claiming that the number of people registering to vote without a photo ID in three states was \"skyrocketing.\" \"Extremely concerning,\" Musk wrote in a post that gained 65.7 million views. State election officials confirmed that the numbers in the post represented the number of requests from the states to the Social Security Administration to verify voter identities, not new voter registrations. Researchers are concerned with the way that Musk's engagement with right-wing accounts may alter the posts other X users see on their profiles. \"If Musk frequently engages with or amplifies far-right content, the platform's algorithm may prioritize similar content for his followers. This can lead to an unintended exposure to extreme viewpoints, misinformation, or harmful ideologies,\" said Smith. Republican lawmakers and conservative activists are also among the top ten accounts Musk interacts with on the topic of election integrity: Speaker of the House Mike Johnson, Sen. Mike Lee's alt account \"BasedMikeLee,\" and Steven Miller, former senior adviser to President Trump, who now runs America First legal. In response to a thread from Johnson on the SAVE Act, a bill that would have required proof of citizenship to vote, Musk wrote \"Those who oppose this are traitors. All Caps: TRAITORS. What is the penalty for traitors again?\" The repost had 56.8 million views. For election night, and the days after, experts like Becker are concerned about the reach of Musk's posts and the impact they may have on trust in the process. \"When we see attacks on the judiciary, when we see attacks on law enforcement, when we see attacks on election officials, when we see attacks on voters themselves, those will probably be amplified by Musk on his platform that he owns,\" he said. \"So, the ability of the truth to reach citizens is going to be extremely limited while the ability of liars to defraud citizens is going to be maximized,\" Becker said. Facts about voting Non-citizen voting refers to voting by unauthorized immigrants, green-card holders, or immigrants on temporary visas. Voting by these groups is not widespread. Federal law requires citizenship to vote in national elections, and voters attest under penalty of perjury that they are citizens when they register. Non-citizens who vote can face fines, prison time or even deportation. A Washington Post analysis of the conservative Heritage Foundation's data found that of 2 billion votes cast since 1979, there were only 85 cases involving allegations of non-citizen voting. A study of Arizona voter rolls found 1,934 voters in Arizona were non-citizens — 0.04% of the state's registered voters. After the 2016 election, analysis by the Brennan Center for Justice found 30 cases of suspected non-citizens voting reported by election officials out of 23.5 million votes cast in 42 jurisdictions that were reviewed. Non-citizen representation: The Constitution states that all people should be counted in the apportionment of seats in the House of Representatives, which is used to calculate the number of electoral votes each state receives. Even if the census includes a citizenship question, according to the Constitution, non-citizens would be counted in the population totals used for determining congressional and electoral representation. Analyses by the Pew Research Center and Center for Immigration Studies found that not counting non-citizens in apportionment of House seats would have minimal impact on the additional seats that historically lean toward Democrats. Voting machines must pass federal and state certification standards to be deployed and are tested before voters cast their ballots to make sure they are working properly. Additionally, while voting machines are highly accurate in counting votes, widely used paper ballots allow those machine counts to be checked and audited by people. Forty-nine states performed a post-election audit of some kind, including Pennsylvania, which found just 24 discrepancies among the 201,715 total votes officials reviewed in 2023. That's about 1/100 of 1% of all ballots audited. According to the Election Infrastructure Government Coordinating Council and others, \"All of the states with close results in the 2020 presidential race\" had paper records of each vote.Mail-in voting: Historically, mail ballot systems have had bipartisan trust. Security measures protect against vulnerabilities such as tampering, impersonation and ballot stuffing. Mail-in ballots are enclosed in sealed envelopes that are confirmed for eligibility. The voter's identity is verified by signature and other identifying information to ensure it matches details on file. Multiple election staff members or bipartisan teams are present when ballots are retrieved and handled throughout the process. Election officials track issued ballots to prevent duplicate voting with serial numbers or barcodes, and the number of ballots received is compared to the number of voters who applied for a ballot. Suspicious ballots are investigated and relayed to law enforcement as needed.","summary":"CBS News analysis finds tech billionaire and Trump supporter Elon Musk has amassed billions of views in posts on X about election fraud conspiracies.","url":"https://www.cbsnews.com/news/elon-musk-trump-social-media-election-2024/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/21/91c888f6-e33a-45b0-b4e0-623e432a6969/thumbnail/1200x630/28cf6e482ccbb1f0495e5988b8c80652/gettyimages-2176078700.jpg?v=b241b87adbbb7f0a227ed35b96d0cefa","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3281660_hls/master.m3u8","publish_date":"2024-10-22 00:17:54","author":"Julia Ingram,Madeleine May","authors":["Julia Ingram","Madeleine May"],"language":"en","category":"politics","source_country":"US","sentiment":-0.125},{"id":260577668,"title":"Pakistani Americans:  Crucial vote, crucial choice","text":"AS the 2024 US presidential election draws near, the political landscape within the Pakistani American community is experiencing a major shift. Historically aligned with the Democratic Party, a significant portion of this over six million strong community is re-evaluating its political loyalties, prompted by both domestic and international events. Pakistani Americans, concentrated in urban areas and key swing states, have emerged as a critical voting bloc, potentially shaping the outcome of this tightly contested election. The Pakistani American Public Affairs Committee (PAKPAC), a prominent organization representing this community, has announced its endorsement of former President Donald J. Trump for the 2024 election.\n\nIn a statement, PAKPAC acknowledged differences with Trump but emphasized their belief in his ability to improve US-Pakistan relations and secure the release of political prisoners in Pakistan, including former Prime Minister Imran Khan. They cited the Biden Administration’s inaction on Pakistan’s political turmoil as a reason for their support of Trump, hoping his leadership could reverse Pakistan’s democratic decline. The contrast between Trump’s past approach to Pakistan and the policies under President Joe Biden is striking. During his tenure, Trump facilitated dialogue with Pakistan, hosting the then-democratically elected Prime Minister and engaging in direct talks through high-level visits. PAKPAC’s endorsement stems from these interactions, which they feel have been neglected by the Biden Administration.\n\nIn particular, they criticized Biden for pushing Pakistan toward a legislative coup that unseated a popular leader, a move that has left many Pakistani Americans disillusioned. However, the endorsement is not unanimous within the community. Dr. Ijaz Ahmed, Chairman of the American Pakistan Public Affairs Committee (APPAC) and a former supporter of Biden, now backs Vice President Kamala Harris’s candidacy. Ahmed believes that the Biden Administration has made positive strides for the Pakistani American community and that continued support would strengthen US- Pakistan ties. This division reflects the broader schism within the community as they weigh their options ahead of the 2024 election. Among the factors contributing to this re-evaluation of political loyalties are two critical issues. First, the ongoing Gaza conflict has left many Pakistani Americans dissatisfied with President Biden’s handling of US Foreign Policy.\n\nMany see his stance as too one-sided and damaging to the reputation of the US in the Muslim world. Second, the imprisonment of former Pakistani Prime Minister Imran Khan has deeply resonated within the community. Many believe that Trump’s return to power could offer diplomatic leverage to secure Khan’s release, further fuelling pro-Trump sentiments. Business tycoon and community leader Tanweer Ahmed is one such figure who strongly supports Trump, seeing him as the best candidate to not only improve Pakistan’s internal situation but also fulfill the demands of overseas Pakistanis. Beyond foreign policy, the domestic concerns of Pakistani American voters are gaining prominence.\n\nIssues such as immigration reform, healthcare access, quality education and combating discrimination against Muslims are key factors influencing the community’s voting preferences. These concerns are reflected in the increasing political activism within the community. In 2022, two Pakistani Americans were elected to the Texas State Assembly, a milestone that marks the growing influence of this demographic in US politics. This surge in local political engagement is particularly notable among younger generations, who are driving voter registration efforts and pushing for greater representation in the democratic process. Prominent Pakistani American leaders, such as businessman Tahir Javed, have observed the community’s growing divide, emphasizing how global and local concerns are shaping voting behaviours. Javed, a long-time Democrat, acknowledges the split within the community, noting that many are reconsidering their long-standing allegiance to the Democratic Party. This rift could prove decisive in key battleground states where the Pakistani American vote may tip the balance in favour of either candidate.\n\nAs both Republicans and Democrats ramp up their outreach to immigrant communities, Pakistani Americans find themselves at the centre of the political conversation. With their evolving political views and growing participation in US elections, they are poised to play a significant role in determining the next president. The 2024 election will not only be a test of the political power of Pakistani Americans but also a reflection of broader demographic shifts in the United States. Their influence could offer a window into how immigrant communities are shaping the future of American politics, as they increasingly move from being voters to policymakers. The coming weeks will be pivotal as both parties vie for the support of this community. The question remains: will Pakistani Americans continue their historical support for the Democrats, or will Trump’s outreach and promises of a stronger US-Pakistan relationship sway enough voters to secure his return to the White House? The answer will have significant implications, not just for US politics, but for the future of US-Pakistan relations and the global stage.\n\n—The writer is a senior journalist and media expert:\n\n([email protected])","summary":"AS the 2024 US presidential election draws near, the political landscape within the Pakistani American community is experiencing a major…","url":"https://pakobserver.net/pakistani-americans-crucial-vote-crucial-choice/","image":"https://pakobserver.net/wp-content/uploads/2022/11/article.jpg","video":null,"publish_date":"2024-10-22 00:17:30","author":"Faysal Aziz Khan","authors":["Faysal Aziz Khan"],"language":"en","category":"politics","source_country":"pk","sentiment":0.135},{"id":260578268,"title":"Harris hunts for GOP votes as Democrats fear her base support is eroding","text":"The Harris campaign held moderated conversations in an effort to court centrists in the suburbs in battlegrounds that delivered Trump victory in 2016 but swung back for President Joe Biden in 2020. \n\nHarris is stumping alongside Cheney in an effort to win over voters who might have backed former U.N. Ambassador Nikki Haley, who had a base of supporters who were centrist and college-educated. \n\nThe former Wyoming congresswoman who is the daughter of Vice President Dick Cheney was exiled from the GOP after participating in a congressional investigation of Trump’s role in the Jan. 6 attack on the Capitol. \n\nShe previously was in Republican leadership in the House before supporting Trump’s second impeachment. She was eventually booted from leadership and defeated by a Trump-backed challenger in a GOP primary for her seat. Cheney called the choice between Harris and Trump, specifically on foreign policy, “absolutely clear.”\n\n“Our adversaries know they can play Donald Trump,” Cheney said. “They absolutely know they can play him, and we simply can’t afford to take that risk.”\n\nCheney, speaking at the event in Malvern, Pennsylvania, a Philadelphia suburb, asked women there who oppose abortion to put their feelings on the topic aside and suggested that Republican restrictions on abortion had gone too far following the 2022 Supreme Court ruling in Dobbs v. Jackson Women’s Health Organization that there is no constitutional right to abortion.\n\n“I think there are many of us around the country who have been pro-life but who have watched what is going on in states since the Dobbs decision and have watched state legislatures put in place laws that are resulting in women not getting the care they need,” Cheney said. “In places like Texas, for example, the attorney general is talking about suing, is suing to get access to women’s medical records. That’s not sustainable for us as a country, and it has to change.”\n\nAs Trump and Republicans attempt to paint Harris as a “radical liberal,” she struck a moderate tone during her appearances on Monday, promising to “invite good ideas from wherever they come.”\n\n“We are traveling to three states to talk to all Americans about what is at stake in this election, but doing it through the lens of a very important point — that what is at stake in this election is so fundamental that it does really cross partisan lines,” Harris said to reporters ahead of her second event in Michigan on Monday.\n\nVOTER REGISTRATION AND EARLY VOTING: KEY DATES AND DEADLINES IN THE 2024 ELECTION\n\nAt an event in Royal Oak, Michigan, outside of Detroit, Cheney asked voters to vote their conscience and that they do “not ever have to say a word to anybody.”\n\nCheney explained she had been spending time getting to know Harris and explained this would be the first time she is voting for a Democrat.\n\n“When I look at the nature of the threat Donald Trump poses — look, Donald Trump is doing everything he can to get people to forget about what he did … that level of instability, misogyny, that is someone you cannot entrust to the Oval Office,” Cheney said.\n\nTrump attacked Cheney on social media on Monday, accusing her of being a “war hawk” and calling her “dumb as a rock.”\n\nHarris’s bipartisan pursuit of support comes as some Democrats have grown concerned about Harris’s support among working-class voters in the Midwest.\n\nThe vice president has not received the same level of support as President Joe Biden among organized labor. The International Brotherhood of Teamsters declined to back either candidate, as did the International Association of Fire Fighters. Both endorsed Biden four years ago.\n\nDemocrats want Harris to focus on appealing to blue-collar workers and strike a more populist tone.\n\n“I think it’s a real possibility we are losing some of these voters to Trump and it’s critical Harris speak about the work the administration has already done to benefit these workers,” said a Democratic strategist based in Pennsylvania, who asked not to be named in an effort to speak candidly about the race.\n\n“She needs to be talking about the CHIPS Act, the administration’s work to grow the auto industry and other things they’ve done,” the person said, referencing the 2022 CHIPS and Science Act, which provided major new subsides for the domestic manufacturing of advanced computer chips and other key technologies. “Sometimes the threat to democracy message doesn’t resonate with these people.”\n\nIn the latest New York Times-Siena College poll, 70% of black men likely to vote said they would opt for Harris, while 20% said they would back Trump. Those numbers illustrate a 15-point difference from 2020, when 85% of black men answered they planned to support Biden.\n\nRepublicans continue to point out Harris’s previous positions on electric vehicles and fracking in these critical states. Former Michigan GOP chair Saul Anuzis said Trump’s messaging is clearly resonating with voters part of the “blue wall” that propelled Biden to victory last cycle.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\n“Trump traditionally has been a candidate that has appealed to a kind of working class, blue collar, culturally conservative voter who doesn’t like either political party. They just want to shake things up,” Anuzis said, speaking with the Washington Examiner. \n\n“They see Trump as a big disrupter, where Kamala Harris was kind of the quintessential establishment person who, you know, obviously got, you know, anointed for the nomination,” he added.","summary":"Vice President Kamala Harris teamed up with former Rep. Liz Cheney on Monday in an aggressive bid to win over centrist Republicans who are on the fence about voting for former President Donald Trump in Pennsylvania, Michigan, and Wisconsin. The Harris campaign held moderated conversations in an effort to court centrists in the suburbs in [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3197834/harris-hunts-gop-votes-democrats-fear-base-eroding/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Harris-Cheney-scaled.webp","video":null,"publish_date":"2024-10-22 00:13:55","author":"Samantha-Jo Roth","authors":["Samantha-Jo Roth"],"language":"en","category":"politics","source_country":"US","sentiment":-0.429},{"id":260576968,"title":"Trump makes strange remark about RFK Jr. amidst cheating scandal","text":"Donald Trump made a bizarre comment about RFK Jr. during a town hall-style event in the Bronx, New York on Monday, saying how he was big into ‘women things.’\n\nTrump was being asked a question about what he would do to ban artificial foods but it appears other things were on the former president’s mind. \n\nWhen asked at the Q&A session at a local barbershop how Trump would ensure more organic foods reach urban and low-income areas he went on a ramble about Robert F Kennedy Jr., who has previously endorsed the former president. \n\n‘What is the plan to do about the food healthcare industry and getting artificial foods banned in urban communities that have less access to organic whole foods?’ came the question to Trump from a Bronx man. \n\nTrump, who loves his fast food and Diet Coke suddenly veered into talking about RFK Jr. \n\n‘Bobby Kennedy, right? Everybody likes Bobby Kennedy. And he’s so big into the healthy food and women things. Everything. He wants to do things and the environment and he endorsed me,’ Trump said.\n\n‘He’s a great guy. He would be so perfect. He doesn’t like pesticides and all the things they put on it. We have plenty of food and our farmers are great. If you listen to him for 10 minutes, I mean, he says other countries that don’t do anything [to their foods] are healthier than us. \n\n‘Okay, we’re not that healthy, to put it mildly. We don’t want artificial foods. I’m gonna have Bobby Kennedy on it. He’s a great guy. He cares about food more than anything else,’ he said.\n\nTrump’s referring to 70-year-old RFK Jr.’s love of ‘women things’ comes weeks after he became embroiled in a sex scandal with star political reporter with New York magazine, Olivia Nuzzi, 31.\n\nRFK Jr. previously had a history of being something of a womanizer in the past. \n\nOn Monday, the outlet and Nuzzi decided jointly to ‘part ways’ after reports that she had a personal digital relationship with a source while covering the 2024 campaign.\n\nThe magazine said Monday that its own internal review and an investigation by a law firm it enlisted found no issues with Nuzzi’s accuracy or bias.\n\n‘Nevertheless, the magazine and Nuzzi agreed that the best course forward is to part ways,’ the publication said in a post on its website, which it framed as an update to readers. \n\n‘Nuzzi is a uniquely talented writer and we have been proud to publish her work over her nearly eight years as our Washington correspondent. We wish her the best.’\n\nLast month, the newsletter Status, which broke the story, and The New York Times both cited unnamed sources in identifying RFK Jr. as the person involved with Nuzzi.\n\nShe has not confirmed Kennedy´s involvement and Kennedy said in a statement that he had only met her once.\n\nDavid Haskell, New York magazine’s editor in chief, said in a note to staff members after the news broke that Nuzzi told them the relationship began last December, ‘after we had published her November profile.’ \n\nNuzzi’s only published profile that month was of Kennedy. The relationship reportedly ended in August, Haskell wrote.\n\nThe publication said at the time that if it had been aware of the relationship, Nuzzi would not have been permitted to cover the presidential campaign.\n\nLast month, Nuzzi said in a statement to Status that the nature of some communication between herself and a former reporting subject turned personal early this year.\n\n‘During that time, I did not directly report on the subject nor use them as a source,’ she said. \n\n‘The relationship was never physical but should have been disclosed to prevent the appearance of a conflict. I deeply regret not doing so immediately and apologize to those I´ve disappointed, especially my colleagues at New York.’","summary":"Donald Trump made a bizarre comment about RFK Jr. during a town&#8230;","url":"https://internewscast.com/news/us/trump-makes-strange-remark-about-rfk-jr-amidst-cheating-scandal/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trumps-bizarre-comment-about-RFK-Jr-as-800x430.jpg","video":null,"publish_date":"2024-10-22 00:05:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.096},{"id":260575678,"title":"Inside the last-ditch hunt by Harris and Trump for undecided voters","text":"Vice President Kamala Harris and former President Donald Trump are carrying out a virtual house-to-house hunt for the final few voters who are still up for grabs, guided by months of painstaking research about these elusive Americans.","summary":"Vice President Kamala Harris and former President Donald Trump are carrying out a virtual house-to-house hunt for the final few voters who are still up for grabs, guided by months of painstaking research about these elusive Americans.","url":"https://www.mercurynews.com/2024/10/21/inside-the-last-ditch-hunt-by-harris-and-trump-for-undecided-voters/","image":"https://www.mercurynews.com/wp-content/uploads/2024/10/US-NEWS-CAMPAIGN-POLLS-ABA.jpg?w=1024","video":null,"publish_date":"2024-10-22 00:02:34","author":"New York Times","authors":["New York Times"],"language":"en","category":"politics","source_country":"us","sentiment":-0.26},{"id":260576066,"title":"New Yorker writer admits he's never met a Trump supporter at work in 15-year media career","text":"Jay Caspian Kang, a staff writer for The New Yorker, ascribed media bias not to a conspiracy among journalists, but to the fact that the overwhelming majority of journalists are left-leaning. Kang wrote a piece for The New Yorker, \"How Biased Is the Media, Really?\" in response to a recent Gallup poll showing that Americans’ trust in mass media remains not only historically low, but consistently abysmal for the third year in a row. He responded by addressing multiple common critiques from Americans on both sides of the political spectrum, including the accusation that \"Every news organization that feigns objectivity is actually heavily slanted toward the left. Not only that; the media is actively working with the Democrats to defeat Donald Trump.\" \"The most obvious explanation for this impression is that the press corps is mostly made up of liberals,\" he wrote in the piece, adding that \"At prestige outlets—many of which do don the armor of impartiality—the imbalance skews a lot further to the left than what many outsiders might imagine.\" 5 THINGS VETERAN NPR EDITOR EXPOSED IN STUNNING CRITICISM OF OWN EMPLOYER’S LIBERAL BIAS He recalled Uri Berliner emerging as a whistleblower against NPR and the rise of progressive identity-politics, but argued the effect of such politics on journalism is ultimately \"negligible compared with the effect of the fact that nearly everyone who works [in the media]\" are \"college-educated Democratic voters from middle- to upper-middle-class families. I have mentioned this before, but it bears repeating: in the course of a fifteen-year career that has included stints at radio shows, print outlets, digital media and television, I have yet to meet a Trump supporter at work.\" He recalled a specific quote about how journalists being an overwhelmingly liberal crowd isn't a secret, but an obvious fact of life. \"The basic ideological homogeneity of the press corps isn’t some secret that’s tightly guarded by journalists or even the people who run news organizations,\" he said. \"In a 2023 interview in this magazine, A. G. Sulzberger, the publisher of the New York Times, said, ‘Almost everyone who works at the New York Times lives in the big city and graduated from college. That alone makes our staff unrepresentative. It means that we’re going to under-index in gun ownership, under-index in church attendance.’\" NPR EDITOR'S BOMBSHELL ESSAY CAUSING 'TURMOIL' AT LIBERAL OUTLET: REPORT He responded to the quote by arguing, \"As Sulzberger intimated, it’s difficult to believe that a press corps mostly made up of one type of person who votes one type of way would not be influenced by both their prior beliefs and their gaps in knowledge.\" He then argued that the New York Times is a prime example of this trend. \"And, indeed, the Times—who bears the brunt of media criticism across all political spectrums—has, nor do they have a columnist or editorial writer who openly supports Trump. The situation is largely the same at the big network-news shows and most newspapers,\" he wrote. \"So, yes, there is a liberal bias to the news.\" CLICK HERE TO GET THE FOX NEWS APP","summary":"The New Yorker&apos;s staff writer, Jay Caspian Kang, argued that the media is overwhelmingly staffed by liberals, and is colored by their biases and knowledge gaps as a result.","url":"https://www.foxnews.com/media/new-yorker-writer-admits-hes-never-met-trump-supporter-work-15-year-media-career","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/trump-unamused.png?ve=1&tl=1","video":null,"publish_date":"2024-10-22 00:00:02","author":"Alexander Hall","authors":["Alexander Hall"],"language":"en","category":"politics","source_country":"US","sentiment":-0.315},{"id":260575852,"title":"Trump ramps up attacks as battle for undecided voters intensifies","text":"Trump ramps up attacks as battle for undecided voters intensifies\n With Election Day just over two weeks away, the fight for every last undecided vote in battleground states is intensifying. Former President Donald Trump kicked off his closing arguments today, launching a two-day swing through North Carolina while ramping up his attacks on Vice President Kamala Harris. Robert Costa has more.","summary":"With Election Day just over two weeks away, the fight for every last undecided vote in battleground states is intensifying. Former President Donald Trump kicked off his closing arguments today, launching a two-day swing through North Carolina while ramping up his attacks on Vice President Kamala Harris. Robert Costa has more.","url":"https://www.cbsnews.com/video/trump-ramps-up-attacks-as-battle-for-undecided-voters-intensifies/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/21/9bf88c57-98b9-4fe9-85a6-2e8408fc4d19/thumbnail/1200x630/b0b7406c9ff005da00efdb1a2164884d/1021-en-costa.jpg?v=b241b87adbbb7f0a227ed35b96d0cefa","video":null,"publish_date":"2024-10-21 23:56:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.373},{"id":260575682,"title":"Trump makes more debunked claims about FEMA as he surveys storm damage in North Carolina","text":"By MICHELLE L. PRICE and BILL BARROW\n\nSWANNANOA, N.C. — Surveying storm damage in North Carolina, former President Donald Trump on Monday blasted federal emergency responders whose work has been stymied by armed harassment and a deluge of misinformation, but he said he was not concerned that the aftermath of Hurricane Helene would affect election results in the battleground state.\n\nTrump was asked whether it was helpful to criticize hurricane relief workers after the Federal Emergency Management Agency recently paused work in the area because of reports they could be targeted by militia. He responded by again assailing the agency and repeating the falsehood that the response was hampered because FEMA spent its budget helping people who crossed the border illegally. That claim was debunked weeks ago by U.S. Rep. Chuck Edwards, R-N.C., who stood behind Trump as he spoke.\n\n“Well, I think you have to let people know how they’re doing,” Trump told reporters in Swannanoa, outside Asheville. “If they were doing a great job, I think we should say that, too, because I think they should be rewarded. … If they’re doing a poor job, we’re supposed to not say it?”\n\nTrump’s campaign and that of his Democratic rival, Vice President Kamala Harris, are ramping up their activity in North Carolina again after the storm. Trump had three stops in the state Monday. After the Asheville area, he held a rally across the state in Greenville and was slated to speak later at a faith leaders event in Concord, outside Charlotte.\n\nTODAY: Liz Cheney helps Harris seek moderate votes, painting Trump as a dangerous choice\n\nHarris on Monday focused her campaigning efforts on the “blue wall,” traveling to suburban Pennsylvania, Michigan and Wisconsin. She held a series of conversations with Republican Liz Cheney moderated by GOP strategist Sarah Longwell, publisher of the Bulwark, a commentary site for anti-Trump conservatives, and conservative radio host Charlie Sykes. Trump won those three states in 2016 and lost them in 2020, and Harris could all but lock up the presidency if she swept them.\n\nCheney, a former Wyoming congressman who lost her seat after she spoke out against Trump following the Jan. 6, 2021, insurrection, offered advice to her fellow Republicans who are uneasy with Trump but not comfortable broadcasting support for a Democrat.\n\n“You can vote your conscience and not ever have to say a word to anybody,” Cheney said.\n\nHurricane Helene displaced thousands of voters\n\nMany North Carolina counties affected by Hurricane Helene moved Election Day precincts or changed early voting sites. Thousands of voters remained displaced or without power or water as early voting commenced. Both parties are scrambling to check their turnout operations.\n\n“We’re working every channel we can, you know?” Republican National Committee Chair Michael Whatley, a North Carolinian, said. “We’re going to be doing phone calls. We’re going to be doing direct mail. We’ll be doing emails and digital — basically anything we can do to let people know where to go.”\n\nDespite extensive damage across western North Carolina, Trump said he saw no reason for the storm to cast doubt on the North Carolina election results.\n\n“No, I think in a way, it’s the opposite,” Trump said. “I mean, we’re so impressed, and I think they have a pretty good system here.”\n\nRepublican Renee Kyro, who lives a short drive from the devastated mountain town of Chimney Rock, said she knows “plenty of Trump supporters who lost everything,” and others who remain in their homes but don’t have reliable internet or phone connections and may not know their polling location.\n\n“I’ll go door to door if I have to,” she said.\n\nState Sen. Natalie Murdock, who doubles as political director for Democrats’ coordinated campaign in the state, said the party has the apparatus to reach their target voters in the disaster zone. Field workers in some of Democrats’ two-dozen-plus offices around the state have engaged in recovery efforts, distributing water and other supplies to residents.\n\nNorth Carolina Gov. Roy Cooper, a Democrat, urged Trump not to “share lies or misinformation” about the storm recovery.\n\nMany storm survivors lost everything, and they want help and truth, Cooper said Monday at a briefing in Asheville.\n\n“We should work together to give them both,” the governor said. “Storm recovery cannot be partisan.”\n\nEdwards, who represents Asheville and surrounding areas in Congress, put out a long statement last month debunking “outrageous rumors” that FEMA was halting trucks from bringing in supplies, abandoning rescue efforts to bulldoze Chimney Rock, running out of money and more. He did not defend FEMA from Trump’s criticism Monday.\n\nInstead, Edwards, who owns McDonald’s franchises, presented Trump with what he called a “French fry certification pin” in a nod to the former president’s photo opportunity Sunday at one of the fast-food restaurants.\n\nWhite House press secretary Karine Jean-Pierre called Trump’s FEMA comments “dangerous” and said they had been debunked on a bipartisan basis. She said 5,500 federal personnel were in North Carolina and Florida after Helene and Hurricane Milton and noted that $2 billion in federal assistance had been approved for those affected in North Carolina.\n\n“They are dangerous,” Jean-Pierre said of Trump’s remarks. “They are unhelpful. It is not what leadership looks like.”\n\nDemocrats are running both on Helene and Mark Robinson\n\nEven before Helene, North Carolina was all the more compelling because of its history of split-ticket voting. It’s one of the few states that features competitive governor’s races concurrent with presidential contests.\n\nDemocrats have carried the presidential electoral vote just once since 1992 — in Barack Obama’s narrow win in 2008. Republicans have won just one governor’s race in the same span. Four years ago, Cooper won reelection by 4.5 points despite Trump outpacing Biden. He’s prevented by term limit laws from running again.\n\nDemocrats hope Republican gubernatorial nominee Mark Robinson’s latest struggles, centered on CNN’s revelations that the state’s first Black lieutenant governor once called himself a “Black Nazi” and posted lascivious statements on a porn website, turn thousands of Cooper-Trump voters into supporters of Harris and Democratic gubernatorial nominee Josh Stein. Robinson has denied the allegations and sued CNN, calling its report defamatory.\n\nTrump demurred Monday when asked whether voters should support Robinson, whom Trump has endorsed and has referred to as “Martin Luther King on steroids.”\n\n“I’m not familiar with the state of the race right now,” he said. “I haven’t seen it.”\n\nAssociated Press writers Thomas Beaumont in Des Moines, Iowa, Colleen Long in Washington and Jonathan J. Cooper in Phoenix contributed to this report.","summary":"The former president blasted federal emergency responders whose work has been stymied by armed harassment and a deluge of misinformation.","url":"https://www.ocregister.com/2024/10/21/trump-makes-more-debunked-claims-about-fema-as-he-surveys-storm-damage-in-north-carolina-2-2/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/AP24295594515785-1.jpg?w=1024","video":null,"publish_date":"2024-10-21 23:51:23","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.044},{"id":260575320,"title":"UFC fighters tell Michigan Arabs to vote for Trump as a peacemaker: ‘We’re definitely in the championship rounds’","text":"WARREN, Mich. — UFC fighters Justin Gaethje, Beneil Dariush and Henry Cejudo stepped into the political ring last week, urging a crowd of Arab-American voters in swing-state Michigan to cast their ballots for GOP heavyweight Donald Trump. \n\nTheir selling point to clinch support for Trump? He’ll fight for peace in the Middle East.\n\nThe newly minted Conservative Middle Eastern political-action committee, which seeks to register such voters Republican, sponsored the event in coordination with former Director of National Intelligence Ric Grenell, who’s been heavily involved in Trump world’s efforts to win over Michigan’s sizable Arab-American population. \n\nThe UFC trio became involved with campaign outreach via their manager, Ali Abdelaziz, who is a close friend of both Trump and Grenell. \n\nThe venue was a dazzling Arab banquet hall in the greater Detroit area, the epicenter of the fight for Arab-American and Muslim votes this election cycle. \n\nOne by one, the star fighters took the stage to make their case for the former president to about 50 attendees. \n\n“I do get punched in the head for a living, so I have written some words,” joked Gaethje, a lightweight fighter famous for his bloody five-round battles. \n\n“I think we’re definitely in the championship rounds, three weeks to go of this fight for America,” he said before urging attendees to vote for Trump.\n\nNext up, Olympic gold medalist and former UFC champion Cejudo told the mostly Arab-American crowd that as the son of Mexican immigrants, he related to their experiences as newer and first-generation Americans. \n\nWearing a “Trump For Peace” T-shirt, Cejudo told the crowd: “I stand here as a Latino-American — or better yet an American — so hopefully I can make a change with people that come from my background, people that have come from the same circumstances.”\n\nThe most passionate speaker was Dariush, a lightweight fighter and Assyrian Christian who was born in Iran. \n\nHe forged a strong connection with the crowd, which was comprised of many Chaldeans, another Christian minority group from the Middle East that’s suffered from the Islamic State’s rise and other conflicts in the region. \n\n“Assyrians and Chaldeans are brothers,” he said before making his case for Trump. \n\n“I saw the things he did in the Middle East, where he stopped ISIS, where he stopped bombing just random people like [former President Barack] Obama was doing,” Dariush said.\n\nHe also argued Trump broke the mold of the hawkish, old-guard Republican Party in favor of a new kind of foreign policy. \n\n“He made me realize something about the government — not just over there there’s extremists, there’s extremists on our side, too. And they love war. War is profitable to them.”\n\nThis line resonated with Rana Salem, 36, a Chaldean American from Sterling Heights and president of Nineveh Rising, a charity that provides aid to Christian Iraqis.\n\n“Most of my community can’t stand [former President George W.] Bush. I mean, he destroyed our country— our other country. America’s our country. But Trump ended ISIS just like Beneil said,” she told The Post.\n\nAfter his speech, Dariush told The Post protecting the people from his native region is a top political priority for him, second only to fighting for his family in the United States.\n\n“For me, peace abroad, it’s probably like second to my own family at home. I want peace for my family. I want prosperity for my family at home. But to forget about those people?”\n\nAbdelaziz, the Egyptian-born mixed-martial-arts manager who brought this retinue of fighters, was just as outspoken about foreign policy.\n\nAddressing the crowd, he apologized for his accent and nervousness before he spoke on the carnage in the Middle East.\n\n“I don’t care if you’re Jewish, you’re Muslim, you’re Christian — people are dying,” he said. “Now do you really miss President Trump? Because in four years he created the Abraham Accords. Maybe it was not perfect, people, but nobody died.”\n\n“I think Donald Trump brought four years of peace,” Abdelaziz said after his remarks in an exclusive interview with The Post. \n\n“Now you see the whole world has war: in Gaza, Syria, Iraq, Lebanon, now Iran. The whole world is going crazy because I don’t think the people respect the leadership of the United States right now.”\n\nAlso in attendance was Ali Aljahmi, 19, a Yemeni American who helps run his family’s restaurant in Dearborn. He went so far as to tweet his endorsement, believing Trump will end the end the Israel-Hamas war. \n\nSpeaking to The Post in the banquet hall, Aljahmi had few kind words for the Biden-Harris administration. \n\n“Kamala Harris, she’s been the vice president for four years. She sees what’s going on in Palestine. She sees what’s going on in Iraq. She sees what’s going on in the Middle East. And I believe the Dearborn community and the Michigan Arab community do not support Biden,” he said before offering his view of the Gaza situation. \n\n“You see children with no heads, no nothing, and they’re supporting that genocide. It is a genocide, and free Palestine from the river to the sea,” he continued. “Let me tell you something, Donald Trump is a peacemaker.”\n\nArab-American activist Oubai Shahbandar, who moderated the event, told The Post he believes these outreach efforts to Michigan’s Middle Eastern community have contributed to Trump’s improved numbers in the state. \n\n“You can draw a direct correlation with the feedback that we’re getting from all the people that are showing up to the impact on the polls. Obviously, Kamala does a lot of this work for us, but we’re capitalizing on it,” he said.\n\nTrump and Harris are tied in the Wolverine State, per Trafalgar Group’s just-released survey.","summary":"WARREN, Mich. — UFC fighters Justin Gaethje, Beneil Dariush and Henry Cejudo stepped into the political ring last week, urging a crowd of Arab-American voters in swing-state Michigan to cast their ballots for GOP heavyweight Donald Trump. Their selling point to clinch support for Trump? He&#8217;ll fight for peace in the Middle East. The newly...","url":"https://nypost.com/2024/10/21/us-news/ufc-fighters-tell-michigan-arabs-to-vote-for-donald-trump-as-a-peacemaker/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/COMP-2024-10-16T030320Z_186109867_RC2FLAA2HFF0_RTRMADP_3_USA-ELECTION-TRUMP.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-21 23:50:12","author":"George Caldwell","authors":["George Caldwell"],"language":"en","source_country":"us","sentiment":0.171},{"id":260576860,"title":"Trump is Selling 'Swiss-Made' Watches For $100,000 — Apparently, It's From a Wyoming Mall","text":"Donald Trump unveiled a line of exclusive and luxurious watches last month that ranged from $499 to an astounding $100,000. On his Truth Social platform, the presidential candidate expressed his enthusiasm for the watches and assured prospective buyers that they would love them. Its website also boasted of 'Swiss-made power and precision.' However, as per a recent CNN investigation, in reality, these supposedly high-end watches came from a little shopping center in Sheridan, Wyoming. \n\n“Would make a great Christmas Gift. Don’t wait, they will go fast. GET YOUR TRUMP WATCH RIGHT NOW!” Trump wrote on Truth Social, as reported by The Independent. When trying to track down the company, CNN also looked into the watchmaker's origins. The company making these watches, TheBestWatchesOnEarth LLC., reportedly shares the same address with a Wendy's restaurant, a vape store, and a daycare center. It's interesting to note that this address is also connected to a lobbying group that works with the Montenegro government.\n\nThe location is also associated with an LLC that sells honey for male enhancement. It is also the registered address for the company that produces Trump’s golden sneakers. Additionally, many businesses connected to the Wyoming address have a common 'organizer,' Andrew Pierce. Carol Mendelsohn, the chief marketing officer for Pierce’s company, disclosed that their organization acts as the registered agent for several enterprises tied to Trump.\n\nMendelsohn said, “To be absolutely clear, registered agents do not bear any responsibility for the actions of their clients and we will not respond to any further communication via email or phone about these companies.\" Meanwhile, Mark Pierce, Andrew's father and business partner, disclosed that he was unaware of the relationship between Trump and their two other unnamed clients. He opined, “If Mr. Trump or anyone in his family were on the same side of the street I was on, I would cross the street.” Mark further cautioned, “Before spending $100,000 on a watch, they should know who they’re buying it from.\"\n\nThe Trump watches come in two distinct models—the 'Fight, Fight, Fight watch' and the 'Trump Victory Tourbillon.' The Tourbillon— priced at $100,000—according to its website, is primarily crafted from 18-carat gold and has been adorned with 122 diamonds. Additionally, it has a tourbillon mechanism— a high-end addition meant to improve the accuracy of the watch. Meanwhile, according to CBS News, the gold-plated 'Fight, Fight, Fight watch' ranges from $500 to $800 depending on the color.\n\nRecently, Trump introduced 'Trump Coins,' claiming they were minted in the USA and designed by him. These were priced at $100 each, as reported by Rolling Stone. He previously also launched a 'God Bless the USA Bible,' which includes the Constitution, the Bill of Rights, the Declaration of Independence, and the Pledge of Allegiance, selling for $59.99 or $1,000 if signed by Trump.","summary":"Republican candidate Donald Trump has been actively working on expanding his merchandise range recently.","url":"https://www.inquisitr.com/trump-is-selling-swiss-made-watches-for-100-000-apparently-its-from-a-wyoming-mall","image":"https://dab57h0r8ahff.cloudfront.net/720895/uploads/7c30c340-8f79-11ef-9088-db00356c8f2c_1200_630.jpeg","video":null,"publish_date":"2024-10-21 23:45:00","author":"INQUISITR,Simran Kumari","authors":["INQUISITR","Simran Kumari"],"language":"en","source_country":"US","sentiment":-0.091},{"id":260575096,"title":"Trump and Harris adjust campaign tactics in response to security concerns","text":"Amid heightened security concerns and mounting staffing issues within the U.S. Secret Service, both presidential campaigns have curtailed the frequency and kinds of events they’re holding on the trail, four sources with the campaigns said. \n\nOfficials with Kamala Harris and Donald Trump’s camps say they’ve pulled back on “off-the-record” stops — when a candidate breaks from larger-scale events to drop into a diner, ice cream shop or barber — because of more burdensome security requirements. There’s an element of surprise to many of these stops, which is what can create local buzz about the candidate. \n\nBut since a July assassination attempt on Trump, the worlds for both candidates have drastically changed. \n\nEach of the campaigns say Secret Service safety demands have created new challenges to booking the stops, in some cases requiring 48-hour advance notice and often far more detailed plans than they had in the past. Planning the local stops now can be as labor-intensive for campaign staff as putting on a full event, the sources said. \n\nOn top of the time and resources required, the new demands scuttle the intent of the events, which are aimed to be more impromptu, organic visits in a community. They also provide intimate settings for candidates to mix it up with small-business owners and potential voters. \n\n“It takes a lot of the surprise element out of the experience,” said a Harris campaign official who, like others in this article, were granted anonymity to speak candidly.\n\nThe limitations on local stops is the new reality as both candidates race across battleground states in what polling has shown to be a contest that hangs within the margin of error. These kinds of visits typify the last stretch of the race, often garnering positive local media coverage in targeted areas within battleground states. They also often provide fresh fodder for the campaigns to post on social media. \n\n“In order to maintain operational security, the U.S. Secret Service does not discuss the specific means and methods used to conduct its protective operations. However, in this increased threat environment, the Secret Service is constantly adjusting our protective posture to ensure the highest levels of protection at all times and in all places,” U.S. Secret Service spokesperson Special Agent Matt Young said in a statement to NBC News.\n\n“The Secret Service continues to work closely with our local, state, and federal partners to ensure that our protectees are receiving the highest levels of protection on the campaign trail,” he added. “We take our responsibility to ensure that all candidates remain safe and secure in all campaign settings very seriously.”\n\nOn top of the security concerns from the Secret Service, even small-business owners who back the presidential candidate are increasingly expressing reservations about hosting the events, according to two of the sources. \n\n“Some have come back and said, ‘You know what? I would prefer that you don’t come by’ because of how much their safety is now at stake because of the retribution and the doxing and the trolling online,” one of the officials said. \n\nThe new dynamic is the latest example of how the presidential landscape has transformed since a July 13 assassination attempt on Trump at a rally in Butler, Pennsylvania. Trump was grazed by a bullet after a gunman managed to fire rounds even after people in the crowd outside the event venue sounded the alarm about a man crawling on a rooftop. One person was killed in the shooting, and two people were injured. The extraordinary events caused a reckoning within the Secret Service, forcing the director to resign and prompting the acting director to call for a “paradigm shift” in the nearly 160-year-old agency. \n\nIt has all meant an unprecedented level of security for both Harris and Trump on the trail, including a surge in personnel and additional layers of protection, like erecting bullet-proof glass around outdoor lecterns and curbing outdoor events all together. \n\nA person familiar with planning Trump’s events said the new security restrictions have also forced a change in the optics, because many strong visual moments aimed for TV or social media have been eliminated.\n\nIn one example, according to the source, Trump’s recent stop at a barbershop required his car to drop him off behind a tent when he arrived, depriving him of “a hero’s welcome, like the bodega,” referring to a surprise appearance Trump made in Harlem after a court appearance in April. Then, cameras had access to film Trump as he walked onto the sidewalk and into the bodega, and a cordoned-off crowd cheered on either side of him.\n\nOn Monday, Sen. JD Vance of Ohio defended Trump from criticisms that his Sunday visit to a Pennsylvania McDonald’s was “stage managed,” underscoring the recent shifts in security intensity. The McDonald’s was closed for normal business, and the cars that went through the drive-thru were pre-selected and screened by Secret Service in advance.\n\n“The fact that these people are accusing him of a stage-managed thing, of course the president has to have security because there have been two attempts on his life in the last eight weeks,” Vance said in a morning interview on Fox news. “He can’t just walk into a McDonald’s and sign a W9 and actually go on the payroll. That’s just not how this works, especially given the security threats on his life.”\n\nBoth campaigns note though they haven’t completely dropped the events. Last week, Vance, joined by his wife and oldest son, stopped by a feed and agriculture center in Williamsport, Pennsylvania, with their German shepherd puppy, Atlas, in tow. Vance ended up purchasing a Trump chew toy. \n\n“I don’t know if he’ll be pleased about that or pissed off about that,” Vance said after a big laugh, and later added a chew toy resembling President Joe Biden. \n\nAfter recording a podcast with Charlemagne Tha God in Michigan, Harris stopped at the Cred Cafe in Detroit. She held up a T-shirt that read “Detroit vs Everybody,” and talked to the crowd about working hard to win the election. \n\nThat brought this local headline on Fox 2 Detroit’s Facebook page: “It was standing room only at CRED Cafe in Detroit where Harris crashed her own watch party.”","summary":"Amid heightened security concerns and mounting staffing issues within the U.S. Secret&#8230;","url":"https://internewscast.com/news/us/trump-and-harris-adjust-campaign-tactics-in-response-to-security-concerns/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Trump-and-Harris-shift-strategies-on-the-800x430.jpg","video":null,"publish_date":"2024-10-21 23:43:05","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.223},{"id":260575190,"title":"McDonald's agreed to Trump event but says it isn't endorsing a presidential candidate","text":"McDonald’s Corp. agreed to host former President Donald Trump at a Pennsylvania store over the weekend but said it isn’t endorsing a candidate in the U.S. presidential race.\n\nTrump staffed the fry station at a McDonald’s in suburban Philadelphia on Sunday before answering questions through the drive-thru window. The restaurant was closed to the public for the Republican nominee's visit.\n\nIn a message to employees obtained Monday by The Associated Press, McDonald's said the owner-operator of the location, Derek Giacomantonio, reached out after he learned of Trump’s desire to visit a Pennsylvania restaurant. McDonald’s agreed to the event.\n\n“Upon learning of the former president’s request, we approached it through the lens of one of our core values: we open our doors to everyone,” the company said. “McDonald’s does not endorse candidates for elected office and that remains true in this race for the next president. We are not red or blue – we are golden.\"\n\nThe Chicago burger giant said franchisees have also invited Vice President Kamala Harris, the Democratic nominee, and her running mate, Gov. Tim Walz, to their restaurants. The Associated Press left a message seeking comment with the Harris campaign.\n\nMcDonald’s said it has “been a fixture of conversation this election cycle” even though it hasn’t sought that attention. At several campaign stops and during interviews, Harris has recalled working at McDonald’s for spending money during her college years. Trump has claimed – without evidence – that Harris is lying.\n\nMcDonald’s sidestepped that issue in its employee message. The company said it is proud of “Harris’s fond memories working under the arches” and noted the often-cited figure that 1 in 8 Americans works at McDonald’s at some point.\n\n“While we and our franchisees don’t have records for all positions dating back to the early ‘80s, what makes ‘1 in 8’ so powerful is the shared experience so many Americans have had,” McDonald’s said.\n\nTrump’s appearance led to some backlash on social media. Google searches for “boycott McDonald’s” briefly surged Monday morning, and some Twitter users vowed not to return to the chain after Trump’s event.\n\nChris Hydock, a marketing professor at Tulane University's Freeman School of Business, said that authorizing the visit was a risky move for McDonald's. Hydock said his research shows that when brands become associated with divisive candidates or positions, whether purposefully or not, customers who dislike those positions tend to react more strongly than those who don't dislike them.\n\nSmall companies can still benefit sometimes, Hydock said, since even a divisive position wins them attention and customers. But in the case of a big company like McDonald's, everyone is already aware of the company.\n\n“Trump working at McDonald's can’t attract more customers,” he said. “All it can end up doing is pissing some people off.”\n\nBut Lori Rosen, president of the public relations firm Rosen Group, said McDonald’s won’t likely see long-term damage from the event.\n\n“The coverage and publicity alone generated from McDonald’s agreeing to have former President Trump work at one of their franchises already surpasses the negative chatter on social media ,” Rosen said. “I am not sure if the American people will benefit from this publicity stunt. However, McDonald’s comes out ahead.”\n\nBruce Newman, a professor in business ethics and marketing at DePaul University’s Driehaus College of Business, agrees.\n\n“They look like the company that’s getting the attention of the presidential candidates, and it heightens the awareness of the brand,” he said.\n\nNewman added that Trump was likely trying to put a different, more casual face on his campaign, wearing a smile and an apron instead of a suit jacket.\n\n© Copyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.","summary":"McDonald’s Corp. agreed to host former President Donald Trump at a Pennsylvania store over the weekend but said it isn’t endorsing a candidate in the U.S. presidential race.…","url":"https://japantoday.com/category/business/mcdonald%27s-agreed-to-trump-event-but-says-it-isn%27t-endorsing-a-presidential-candidate","image":"https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/23/57/6e35f602c79ca1e51b330eee62ac3cbaec34/download/_w1700.jpg","video":null,"publish_date":"2024-10-21 23:41:27","author":"Japan Today Editor,The Associated Press","authors":["Japan Today Editor","The Associated Press"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.249},{"id":260575434,"title":"Breaking down the House panel report on Trump rally shooting","text":"Breaking down the House panel report on Trump rally shooting\n A bipartisan House task force investigating the July 13 assassination attempt on former President Donald Trump said the event was \"preventable.\" That's according to a preliminary, 53-page report detailing the shortcomings of the Secret Service and law enforcement that led to the shooter opening fire at the rally in Pennsylvania. CBS News congressional correspondent Scott MacFarlane has the details.","summary":"A bipartisan House task force investigating the July 13 assassination attempt on former President Donald Trump said the event was \"preventable.\" That's according to a preliminary, 53-page report detailing the shortcomings of the Secret Service and law enforcement that led to the shooter opening fire at the rally in Pennsylvania. CBS News congressional correspondent Scott MacFarlane has the details.","url":"https://www.cbsnews.com/video/breaking-down-house-panel-report-trump-rally-shooting/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/21/652dbf9f-e1a6-48c6-b6a1-d7cf0fc74d25/thumbnail/1200x630/a77fd7c94a77e1d08d15dcc88451577e/cbsn-fusion-breaking-down-house-panel-report-trump-rally-shooting-thumbnail.jpg?v=b241b87adbbb7f0a227ed35b96d0cef","video":null,"publish_date":"2024-10-21 23:39:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.271},{"id":260574668,"title":"How America’s ‘double haters’ could send Trump back to the White House","text":"Pundits and analysts are looking at head-to-head polling numbers to read the presidential race’s tea leaves.\n\nBut to understand where the contest between Kamala Harris and Donald Trump will end, rather than where it stands today, look at the candidate’s favorability numbers instead.\n\nHistorically, a presidential candidate’s favorability rating is highly correlated with his or her ultimate share of the vote. In 2016 and 2020, almost all those who told exit pollsters they had a favorable opinion of a candidate voted for that person.\n\nThat fact was obscured in 2016, though, because of the unusually high share of voters who disliked both candidates.\n\nTrump won the Electoral College because he carried the 18% of voters who were “double haters” — that is, who said they disliked both him and Democratic rival Hillary Clinton — by a thumping 17-point margin, 47% to 30%.\n\nTrump lost in 2020 because almost everyone liked one of the two nominees — and while 52% of voters said they liked Biden, only 46% liked Trump. Each candidate lost only 4% of those voters to the other.\n\nBut look at the math: Trump lost the popular vote in 2020 by only 4.5%, a bit less than the 6% implied by the differential in the two men’s favorability scores.\n\nThat suggests he again won the “double haters” — but on Election Day there were too few of them to matter.\n\nThe 2024 election is shaping up to be something between those two contests. \n\nAs of Oct. 16, Trump had a 45% favorability rating among polls of likely voters listed on the Real Clear Politics average since Oct. 1. Harris’ favorability was higher, at 49.3%.\n\nThis would appear to imply that she should have a lead of about 4 percentage points. But in fact, the head-to-head horserace numbers in those same polls showed a Harris lead of only 2.4 percentage points.\n\nThere’s only one way to square those two numbers: Harris must be losing the roughly 6% of voters who are “double haters” — and by a significant margin.\n\nStrategically, this suggests that Trump needs to drive anti-Harris sentiment up as high as possible. The more people unhappy with Harris, the more people likely to — even regretfully — vote for Trump.\n\nThe October polls also suggest that Trump needs to change the composition of the voter pool by driving turnout higher.\n\nThree polls this month of registered voters or all adults showed Harris with only a 1.7-point favorability edge over Trump — and with just a 1.66-point lead in the race.\n\nIn other words, Trump is doing better than Harris among people who do not habitually vote.\n\nVoting propensity correlates with educational attainment, so Trump’s chances of victory improve if the electorate is larger — and therefore less tilted toward college graduates.\n\nAnd if Trump’s less-well-educated, low-voting-propensity fans stay home, either on Election Day or during the early voting period, Harris’ odds of winning go up — a lot.\n\nThat’s why many GOP worriers are concerned that Trump’s ground game isn’t up to snuff.\n\nRather than hiring thousands of party staffers to man field offices and do phone-banking and door-knocking in key states, the Trump campaign appears to have “contracted out” that part of its effort to outside groups like Turning Point Action and Elon Musk’s America PAC.\n\nMeanwhile, these two factors — presidential-candidate favorability and voter turnout — will also matter for the candidates downballot.\n\nRaces for the Senate and House have become nationalized: More Americans are voting a straight ticket, sticking with one party for every race on the ballot; fewer House and Senate candidates can attract voters who support the other party’s presidential nominee.\n\nIf Harris can keep her favorability numbers up, Democrats have a much better chance at taking the House and keeping their losses in the Senate to a small handful.\n\nIf Trump can bring Harris’ favorability down and energize his low-engagement voters, he can build coattails that could boost Senate and House Republican numbers significantly.\n\nWe won’t know until after Election Day whether the Trump turnout game succeeds. But within the next few days, early-voting data will begin to give us some clues.\n\nIf the early votes from registered Republicans (or, in states without partisan registration, from heavily GOP counties) include a significant number of ballots from first-time or irregular voters, then we can infer Trump is getting his non-traditional voters to the polls.\n\nThe opposite is also true: If the Republicans’ early-vote totals come mainly from those who vote religiously, then turnout models that give Harris the edge are likelier to be true.\n\nAll the data point to 2024 being one of the closest elections in our history — again.\n\nBut watch the favorability numbers closely: If Trump’s negativity blitz succeeds and Harris’ favorability drops, the “double haters” might help send him back to the White House.\n\nHenry Olsen, a political analyst and commentator, is a senior fellow at the Ethics and Public Policy Center.","summary":"Donald Trump has consistently won the voters who dislike both him and his Democratic opponent — and this year, they could swing the election results.","url":"https://nypost.com/2024/10/21/opinion/how-double-haters-could-send-trump-back-to-the-white-house/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-kvvgy1viw-1729548116675.jpg?quality=75&strip=all&1729533749&w=1200","video":"https://cdn.jwplayer.com/videos/AiRY0fVk-RyIcpnTz.mp4","publish_date":"2024-10-21 23:38:09","author":"Henry Olsen","authors":["Henry Olsen"],"language":"en","category":"politics","source_country":"us","sentiment":0.011},{"id":260575278,"title":"Newsom Says ‘I’m With Elon’ in California Commission’s SpaceX Dispute","text":"Gov. Gavin Newsom has sided with billionaire Elon Musk after a California agency rejected a plan to increase SpaceX rocket launches in Southern California.\n\n“I didn’t like that,” said Newsom of the way the California Coastal Commission, which oversees the use of land and water within the state’s more than 1,000 miles of coastline, handled the proposal.\n\nWhile the rockets are mainly used to deliver the company’s Starlink satellites, which provide commercial satellite internet and telecommunications, they’re also used for military missions, and officials consider the missions to be critical to national defense.\n\nThe Coastal Commission rejected the proposal for increased launches on Oct. 10 with a 6–4 vote, saying commercial space launches are not federal government activity and must submit to the commission’s coastal development permitting authority.\n\nIn a lengthy discussion on the matter, commissioners also commented on Musk’s social media posts and his open support of former President Donald Trump as concerns.\n\n“Elon Musk is hopping about the country, spewing and tweeting political falsehoods and attacking FEMA while claiming his desire to help the hurricane victims with free Starlink access to the internet,” Commissioner Gretchen Newsom said at the meeting.\n\nOther commissioners agreed with her.\n\n“We’re dealing with a company, the head of which has aggressively injected himself into the presidential race and he’s managed a company in a way ... that I find to be very disturbing,” said Caryl Hart, chair of the agency’s 12-commissioner board.\n\nGretchen Newsom and Hart both voted to reject the plan after condemning Musk’s conduct.\n\nIn the lawsuit, SpaceX argues the commission “engaged in naked political discrimination.”\n\n“Rarely has a government agency made so clear that it was exceeding its authorized mandate to punish a company for the political views and statements of its largest shareholder and CEO,” the suit states.\n\nNewsom said he was in general agreement with SpaceX’s rationale for bringing forth the lawsuit, which was filed in the court for the Central District of California.\n\n“Look, I’m not helping the legal case,” Newsom told Politico. “You can’t bring up that explicit level of politics.”\n\nThe governor said the commission erred by not solely focusing on the permit’s merits during their discussion, instead of digressing into a wide-ranging discussion of Musk’s politics.\n\n“These are friends of mine that said that,” Newsom said, who was responsible for appointing certain members of the commission. “These are good commissioners. But you got to call balls and strikes. And trust me, I’m not big on the Elon Musk bandwagon right now. So that’s me calling balls and strikes.”\n\nNewsom also said his office helped work on the proposal to increase the number of SpaceX launches.\n\n“We engaged in the spirit of finding compromise,” the governor said. It wasn’t about SpaceX, it was about exploration and other precedent. So I saw that [decision, and thought] that’s not what this was about. ... They certainly could have said, ‘We are just not comfortable with [the proposal] right now.’ But that wasn’t what they said.”\n\nThe rejection might not mean the end of the proposal to increase SpaceX launches, according to the commission.\n\nAlthough certain activities by federal agencies such as the Space Force—which is organized under the Air Force—must be approved by the commission, these agencies maintain the authority to continue “as they see fit regardless of the commission’s determination,” commission spokesman Joshua Smith previously told The Epoch Times.\n\nThe Coastal Commission did not respond to a request for comment from The Epoch Times regarding Newsom’s comments by publication time.","summary":"Elon Musk recently sued the state's Coastal Commission after its commissioners rejected a proposal to increase SpaceX rocket launches.","url":"https://www.theepochtimes.com/us/newsom-says-im-with-elon-in-california-commissions-spacex-dispute-5745274","image":"https://img.theepochtimes.com/assets/uploads/2023/06/11/id5326586-Newsom-United-Nations-300x180.jpg","video":null,"publish_date":"2024-10-21 23:37:18","author":"Kimberly Hayek","authors":["Kimberly Hayek"],"language":"en","source_country":"us","sentiment":-0.061},{"id":260574356,"title":"Trump keeps ticking for 60 Minutes transcript of Kamala Harris interview","text":"Former President Donald Trump continued his push Monday to convince 60 Minutes to release an unedited transcript of its interview with Vice President Kamala Harris.\n\nTrump, on Monday, took to his Truth Social Media platform to demand, yet again, that CBS release the entire transcript of Harris’ sit down with the nation’s longest running news magazine.\n\n“When will CBS release their Transcript of the fraudulent Interview with Comrade Kamala Harris? They changed her answer in order to make Kamala look intelligent, rather than ‘dumb as a rock.’ This may be the Biggest Scandal in Broadcast History! CBS MUST GET THE TRANSCRIPT OUT NOW — Litigation has already started,” the 45th President of the United States wrote, capitalization his.\n\nTrump’s demands for a transcript come after Harris sat for an interview that Trump declined, and after the network took the rare step this weekend of pushing back on his assertions, calling them “false.”\n\n“60 Minutes gave an excerpt of our interview to Face the Nation that used a longer section of her answer than that on 60 Minutes. Same question. Same answer. But a different portion of the response,” they explained.\n\nWhen editing does occur, the network said they “strive to be clear, accurate and on point.”\n\n“The portion of her answer on 60 Minutes was more succinct, which allows time for other subjects in a wide ranging 21-minute-long segment,” they wrote.\n\nTrump was not convinced, declaring that “Harris wasn’t able to put two sentences together, so they completely removed her answer, and put in another one.”\n\n“The Public has a right to know what was changed to save this TOTALLY UNFIT Presidential Candidate from our Country’s Voters. SHE IS A THREAT TO DEMOCRACY!” he wrote, capitalization again his.\n\nCBS also noted that Trump still has a standing invitation to appear on the show if he so chooses.\n\n“Remember, Mr. Trump pulled out of his interview with 60 Minutes and the vice president participated,” they wrote.","summary":"Former President Donald Trump continued his push Monday to convince 60 Minutes to release an unedited transcript of its interview with Vice President Kamala Harris.","url":"https://www.bostonherald.com/2024/10/21/trump-keeps-ticking-for-60-minutes-transcript-of-kamala-harris-interview/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/harris-maine-2.jpg?w=1024","video":null,"publish_date":"2024-10-21 23:35:01","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","source_country":"us","sentiment":-0.696},{"id":260574408,"title":"Gerald Ford’s Daughter Endorses Kamala Harris for President","text":"The only daughter of former Republican President Gerald Ford has endorsed Kamala Harris in the 2024 presidential election.\n\nSusan Ford Bales is a registered Republican and admitted she would ‘likely disagree on some policy matters’ pushed by the vice president.\n\nBut ultimately she believed that Harris’ ‘integrity and commitment to those same principles that guided Dad have led me to conclude’ that she should be in the White House over Donald Trump.\n\n‘She recognizes the good and the greatness in our country,’ Ford Bales said. \n\n‘I know she will defend the rule of law and our Constitution. And I know she will work to bring all Americans together to move us beyond partisanship. \n\n‘That is what America deserves from our President.’\n\nHer endorsement is a significant win for Harris in one of the seven battleground states.\n\nFord was Michigan’s only president and was propelled to the White House when Richard Nixon resigned in 1973 in the aftermath of the Watergate scandal.\n\n‘When my father, Gerald Ford, was sworn-in as America’s 38th President, the nation was in need of a serious, compassionate and honorable leader who had the courage to do what was right and always to defend our Constitution,’ Ford Bales added in her statement.\n\n‘His dedication to those values helped bring our country through a turbulent time and restored Americans’ trust in our democracy.’ \n\nHer endorsement comes as the vice president is headed back to Michigan on Monday as she courts moderate Republicans and Independent voters this week with a series of events alongside Republican former Congresswoman Liz Cheney. \n\nEarlier on Monday, Harris and Cheney had a discussion moderated by Republican strategist Sarah Longwell in suburban Chester County, PA.\n\nThere, Cheney argued despite their policy differences, Harris will defend the Constitution.\n\nThe congresswoman also gave her closing pitch for crossing the aisle to vote for the vice president.\n\n‘I think that in this election, and especially here in Pennsylvania, we have the opportunity to tell the whole world who we are, and we have the chance to say we’re going to reject cruelty, we’re going to reject the kind of vile vitriol that we’ve seen from Donald Trump,’ Cheney said. \n\n‘We’re going to reject the misogyny that we’ve seen with Donald Trump and J.D. Vance,’ she added.\n\nIn Michigan, Harris will speak with voters in Oakland, County in another conversation with Cheney as she continues her outreach to swing voters.\n\nThe vice president and former Congresswoman are targeting Republican voters who cast ballots for Nikki Haley as part of their outreach effort. \n\nMore than 300,000 Michigan voters picked Haley in the Republican presidential primary over Trump. Democrats are trying to woo them to expand their coalition for November. \n\nIn her endorsement, Ford Bales said the U.S. if facing a ‘similar dynamic’ now as the country was when her father helped lead the country following Watergate.\n\n‘America cannot regress back to a divisive paradigm of loathing toward one another and disdain for our Constitution,’ she said in her statement.\n\nThe former first daughter pointed to the ‘horrors’ of the attack on January 6.\n\nShe said the forces that incited it must be held accountable and never put in a position of power to do it again. \n\n‘We can never allow a repeat of that tragedy,’ she said.","summary":"The only daughter of former Republican President Gerald Ford has endorsed Kamala&#8230;","url":"https://internewscast.com/politics/gerald-fords-daughter-endorses-kamala-harris-for-president/","image":"https://i.dailymail.co.uk/1s/2024/10/21/18/91111481-13984265-image-m-2_1729532533599.jpg","video":null,"publish_date":"2024-10-21 23:33:56","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.176},{"id":260574410,"title":"Liz Cheney reveals that many Republicans secretly support Kamala Harris","text":"Former Republican Congresswoman Liz Cheney is out campaigning hard for Kamala Harris, but she also believes millions of Republicans will quietly vote for the vice president over Donald Trump come November.\n\nThe conservative former lawmaker and Harris make an odd pair on the campaign trail, but on Monday, they hit the road together for a series of events in the battleground states that make up Democrats’ so-called blue wall.\n\nSpeaking at a campaign event in suburban Oakland County, Michigan outside Detroit, Cheney said while she is making the public case for Republicans to vote for a Democrat, she won’t be the only one.\n\n‘I certainly have many Republicans who will say to me “I can’t be public.” They do worry about a whole range of things regarding violence, but they’ll do the right thing,’ Cheney said.\n\n‘If you’re at all concerned, you can vote your conscience and never have to say a word to anybody, and there will be millions of Republicans who do that in November,’ she claimed.\n\nHer remarks came at an event moderated by journalist and Kennedy family member Maria Shriver as Harris looks to win over GOP voters including those who supported Nikki Haley in the Republican presidential primary as part of her coalition in the tight race.\n\n‘I have seen a lot of Republicans go up to Liz Cheney and thank her,’ said Harris, seated next to the congresswoman. \n\nShe praised Cheney for her ‘extraordinary courage’ for speaking out post January 6 despite what she called the ‘undercurrent that is violent in terms of the language and the tenor.’\n\n‘I’ve seen Republicans come up to her and from my vantage point, she’s not alone,’ Harris said.\n\nCheney is one of multiple anti-Trump Republicans who have been out campaigning for Harris ahead of the election. \n\nIt is Cheney’s first time voting for a Democrat. Her father former GOP Vice President Dick Cheney also supports Harris in the 2024 race. \n\nOn Tuesday, former Republican President Gerald Ford’s daughter Susan Ford Bales became the latest Republican to publicly endorse Harris. \n\nShe noted that she likely disagrees on some policy matters but said she has the right principals that guided her dad and should be in the White House over Trump.\n\nCheney said of the election on Tuesday ‘I think that we are facing a choice in this election. It’s not about party, it’s about about right and wrong.’\n\nShe was asked if the decision to speak out openly in support of Harris was scary, but she denied that it was. \n\n‘It wasn’t scary at all in terms of making this decision because when I look at the nature of the threat that Donald Trump poses, Cheney said.\n\n‘Donald Trump is doing everything he can to try and get people to forget about what he did, what he did on January 6, and when you think about that level of instability, the level of erratic decision making, the misogyny, that’s not someone you can entrust with the power of the Oval Office,’ she explained.\n\nCheney said she could have just done everything she could to work against Trump and said a lot of Republicans have said that but argued she is ‘very proud and I’m honored’ to endorse Harris.\n\nDuring the event, a former Republican member of Michigan’s House asked about national security and what the U.S. could do to deter Russia from continuing its war in Ukraine.\n\nNational security is one of the policy issues the two women agree on.\n\nHarris said the U.S. has taken a position as a leader on international rules and norms and must stand in support of one of the most international norms which is ‘protecting sovereignty and territorial integrity.’ \n\nShe pointed to ‘huge difference’ between her and Trump on the issue and said on matters of national security it’s not about partisanship.\n\n‘It’s about where should America stand in terms of supporting our allies and standing for certain principles,’ the vice president said.\n\nCheney warned there has been a ‘really dangerous embrace of isolationism’ and tyrants in the Republican party. She also slammed Trump and said he ‘heaps praise on the world’s most evil people’ while he ‘attacks his political opponents with venom here at home.’\n\nThe conservative Republican said the U.S. has led since World War II but cannot do it alone and need their allies and slammed Trump for suggesting the U.S. might get out of NATO.\n\n‘For anybody who is a Republican who is thinking that they might vote for Donald Trump because of national security policy, I ask you please please study his national security policy. Not only is it not Republican, it’s dangerous,’ Cheney said. \n\n‘And without allies, America will find our very freedom and security challenges and threatened,’ she continued before warning ‘don’t think that Congress can stop him.’\n\nAs she spoke Harris nodded along in agreement. \n\nThe series of events come as more than 15 million people have already cast ballots in the 2024 election, and new polling shows Kamala Harris is surging ahead among those who have already voted.\n\nThe vice president leads Donald Trump roughly two-to-one with 63 percent to the ex-president’s 34 percent among those who have already voted in the presidential election, according to a new USA TODAY/Suffolk University poll.\n\nAcross the country, many voters are taking advantage of early in-person voting which is already underway in a number of states and kicking off in more states this week. Voters also have the option to vote-by-mail in a number of states by absentee ballot.\n\nIn the crucial swing states of Georgia, Michigan and North Carolina, more than one million ballots have already been cast. Florida early voting has also already passed the one million votes mark. \n\nOverall, a third of voters who responded to the poll said they plan to vote early. Among them, Harris lead 52 percent to 39 percent over Trump.\n\nBut among those who prefer to wait until Election Day to vote, Trump has the lead 52 percent to 35 percent.\n\nHowever, overall the race appears extremely close. The poll found Harris at 45 percent and Trump at 44 percent.","summary":"Former Republican Congresswoman Liz Cheney is out campaigning hard for Kamala Harris,&#8230;","url":"https://internewscast.com/news/us/liz-cheney-reveals-that-many-republicans-secretly-support-kamala-harris/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Liz-Cheney-identifies-millions-of-Republicans-who-800x430.jpg","video":null,"publish_date":"2024-10-21 23:32:02","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.057},{"id":260575372,"title":"US 2024 Election: Key Facts On Historic Kamala Harris Vs. Donald Trump Showdown","text":"As the United States approaches the pivotal presidential election on November 5, 2024, the nation finds itself at a historic turning point.Voters face the choice of electing Democrat Kamala Harris, potentially the first female president, or returning Republican Donald Trump to the White House. This election transcends mere political competition mdash;its a reflection of the American peoples aspirations and concerns at a critical juncture.An Engaged and Diverse ElectorateThe composition of the electorate for this year rsquo;s election is noteworthy, with 161.42 million registered voters. The youth are making their presence felt, with 49.1% of voters between the ages of 18 and 24 stepping up to participate. Gender distribution shows a close balance, with 68.2% of men and 70% of women registered to vote, indicating strong engagement across the board.Adding to this dynamic voter base is the record 23.8 million foreign-born voters eligible to cast their ballots. This diverse group brings varied political leanings: 44% of Democrats identify as minorities, while 79% of Republicans are non-Hispanic White. This diversity highlights the range of perspectives that will shape the elections outcome.Economic Concerns in FocusEconomic factors are critical in shaping voter concerns. As of September 2024, the U.S. faces a staggering public debt of $35.26 trillion and a GDP of $20.77 trillion for Q4 2023. The unemployment rate, seasonally adjusted, stands at 4.1%. These numbers are significant for voters evaluating the economic platforms of Harris and Trump.Evolving Voter PrioritiesVoter concerns have shifted throughout the election cycle. In November 2023, Democrats prioritized preserving democracy, while Republicans focused on economic issues. However, by mid-2024, inflation, immigration, and healthcare emerged as the top three concerns across the electorate, illustrating the fluid nature of public priorities.A Nation rsquo;s Future on the LineThis election comes at a time when the U.S. seeks direction on numerous fronts mdash;economic recovery, social justice, and international standing. The decision between Kamala Harris and Donald Trump symbolizes broader debates about the nation rsquo;s future trajectory.In conclusion, the 2024 US Presidential Election represents a critical decision point for the American electorate. With record voter registration, including a substantial number of young and foreign-born voters, this election could shape the nation rsquo;s future in profound ways.","summary":"As the United States approaches the pivotal presidential election on November 5, 2024, the nation finds itself at a historic turning point. Voters face the choice of electing Democrat Kamala Harris, potentially the first female president, or returning Republican Donald Trump","url":"https://www.oneindia.com/india/us-2024-election-key-facts-on-historic-kamala-harris-vs-donald-trump-showdown-011-3965893.html","image":"https://imagesvs.oneindia.com/img/2024/10/us-elections---b-webp-1729504796127-1200x675.jpg","video":null,"publish_date":"2024-10-21 23:30:10","author":"Saumya Joshi","authors":["Saumya Joshi"],"language":"en","category":"politics","source_country":"in","sentiment":0.75},{"id":260574930,"title":"Liz Cheney helps Harris seek moderate votes, painting Trump as a dangerous choice","text":"By COLLEEN LONG and CHRIS MEGERIAN\n\nROYAL OAK, Mich. — Kamala Harris teamed up with Liz Cheney on Monday to make a bipartisan appeal to Republican voters uneasy about Donald Trump, describing the former president as a malignant force that needs to be excised from American politics.\n\nCheney, a former congresswoman from Wyoming, reminded people that “you can vote your conscience and not ever have to say a word to anybody.”\n\n“There will be millions of Republicans who do that on Nov. 5,” she predicted.\n\nCheney made the comments in Royal Oak, Michigan, outside of Detroit, during her second of three events with Harris. Their campaign swing began near Philadelphia and was scheduled to end near Milwaukee, reflecting an intense focus on moderate, suburban voters in battleground states.\n\nDuring the first event, in Malvern, Pennsylvania, Harris said that Trump “has been using the power of the presidency to demean and to divide us” and “people are exhausted with that.”\n\n“People around the world are watching,” Harris said. “And sometimes I do fret a bit about whether we as Americans truly understand how important we are to the world.”\n\nCheney, the daughter of former Vice President Dick Cheney, was essentially exiled from the Republican Party for participating in a congressional investigation of Trump’s involvement in the Jan. 6 attack on the U.S. Capitol. She lost her congressional seat in a primary battle two years ago.\n\nAlthough she disagrees with Harris on some issues, Cheney said her conservative philosophy means prioritizing the Constitution over her political party. She also said she’s concerned about allowing a “totally erratic, completely unstable” Trump to run foreign policy.\n\n“Our adversaries know that they can play Donald Trump,” she said. “And we cannot afford to take that risk.”\n\nTrump lashed out at Cheney on social media on Monday, calling her “dumb as a rock” and accusing her of being a “war hawk.”\n\nThe Republican nominee has frequently tried to paint Harris, who is from deep blue California, as a radical liberal, but she struck a moderate tone during her appearance with Cheney.\n\nHarris promised to “invite good ideas from wherever they come” and “cut red tape,” and she said “there should be a healthy two party system” in the country.\n\n“We need to be able to have these good intense debates about issues that are grounded in fact,” Harris said.\n\n“Imagine!” Cheney responded.\n\n“Let’s start there!” Harris said as the audience clapped. “Can you believe that’s an applause line?”\n\nAlthough Cheney has long described herself as pro-life, she suggested that Republican women should vote for Harris on the issue of reproductive health because restrictions on abortion have gone too far since the U.S. Supreme Court overturned Roe v. Wade.\n\nCheney said women aren’t getting the medical care that they need and “we’re seeing people come together to say . . . that’s not sustainable for us as a country, and it has to change.”\n\nWhenever abortion rights have been on the ballot in states, they have succeeded, including in red states. But it’s not clear whether the issue will propel Republican women to the polls in this year’s presidential election.\n\nHarris said she believes that defending abortion rights can appeal to people on both sides of the aisle.\n\n“The American people vote for freedom, regardless of the party with which they’re registered to vote,” she told reporters after arriving in Michigan. Harris also warned that “our daughters are going to have fewer rights than their grandmothers.”\n\nThe more intimate settings on Monday were a shift for Harris, whose campaign has mostly focused on rallies with thousands of people. The audiences listened intently to her and Cheney, sometimes nodding along or smiling. During Harris’ story about a young boy who was afraid of a school classroom where there wasn’t a closet to hide from a shooter, some eyes welled with tears.\n\nWith just over two weeks to go before the presidential election and the race a dead heat, the Democratic nominee is looking for support from every possible voter. Her campaign is hoping to persuade those who haven’t made up their minds, mobilize any Democrats considering sitting this one out, and pick off voters in areas where support for Trump may be fading. All three of the counties visited by Harris on Monday were won by Nikki Haley, the former South Carolina governor and U.S. ambassador to the United Nations who ran against Trump for the Republican nomination.\n\nA few votes here and there could add up to an overall win. In Waukesha County, for example, Haley won more than 9,000 primary votes even after she dropped out of the race. Overall, Wisconsin was decided for President Joe Biden in 2020 by just 20,000 votes. In-person early voting in the state starts Tuesday.\n\nCheney is not the only member of her party to back Harris. More than 100 former Republican officeholders and officials joined Harris last week in Washington Crossing, Pennsylvania, not far from where Gen. George Washington led hundreds of troops across the Delaware River to a major victory in the Revolutionary War.\n\nNear the end of her campaign, Harris has increasingly focused on Trump’s lies about the election and his role in the violent mob’s failed efforts on Jan. 6, which he has called a “day of love.”\n\nOn Monday, Harris repeatedly noted that Gen. Mark Milley, the former chairman of the Joint Chiefs of Staff, reportedly said that Trump is “fascist to the core.” That’s in Bob Woodward’s latest book.\n\nShe also said voters should take Trump’s rhetoric seriously rather than write it off as a “sick sense of humor.”\n\n“Some people find it humorous what he says and it’s just silly,” she said. “But understand how serious it is.”","summary":"They described the former president as a malignant force that needs to be excised from American politics.","url":"https://www.ocregister.com/2024/10/21/liz-cheney-helps-harris-seek-moderate-votes-as-they-paint-trump-as-a-dangerous-choice-2/","image":"https://www.ocregister.com/wp-content/uploads/2024/10/AP24295742189552.jpg?w=1024","video":null,"publish_date":"2024-10-21 23:29:14","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.146},{"id":260575586,"title":"Trump sued for defamation by exonerated Central Park Five over debate comments","text":"Yusef Salaam, Raymond Santana, Kevin Richardson, Antron Brown, and Korey Wise were the center of a cause celebre in 1989 when they were convicted of attacking and raping a jogger in Central Park. After several years in prison, the five were exonerated following a new confession and DNA evidence. In a lawsuit filed Monday, the defendants alleged that Trump made false statements that caused them harm.\n\nThe lawsuit alleged that “his false and defamatory statements with ill will and spite, and with wanton, reckless or willful disregard for their injurious effects on Plaintiffs.”\n\nTrump had briefly touched on the Central Park Five case during the debate, hinting at their possible guilt, when Harris brought up his involvement in the case. Trump put out a full-page newspaper ad on May 1, 1989, calling for the return of the death penalty shortly after the Central Park jogger attack happened. However, the ad made no mention of the jogger attack and didn’t call for any specific executions, rather bemoaning the state of rising crime in New York City in general.\n\n“They admitted — they said, they pled guilty. And I said, well, if they pled guilty they badly hurt a person, killed a person ultimately,” Trump said at last month’s debate. “And if they pled guilty — then they pled we’re not guilty.”\n\nThe five defendants all pleaded not guilty, and the woman who was attacked, though grievously injured, ultimately ended up surviving.\n\nAlso included in the lawsuit was an encounter between Salaam and Trump after the debate, when the former asked him if he would apologize.\n\n“Ah, you’re on my side then,” Trump said to Salaam. When the defendant said that he wasn’t a supporter, Trump waved and walked away.\n\n“Plaintiff Salaam was attempting to politely dialogue with Defendant Trump about the false and defamatory statements that Defendant Trump had made about Plaintiffs less than an hour earlier, but Defendant Trump refused to engage with him in dialogue,” the lawsuit alleged.\n\nTrump campaign spokesman Steven Cheung waved off the lawsuit in a statement, obtained by the Washington Post.\n\n“This is just another frivolous, Election Interference lawsuit, filed by desperate left-wing activists, in an attempt to distract the American people from Kamala Harris’s dangerously liberal agenda and failing campaign,” he said.\n\nThe defendants have repeatedly blamed Trump for the popular sentiment against them, most recently in a speech at the Democratic National Convention.\n\n“Our youth was stolen from us every day as we walked into courtroom, people scream at us, threaten us because of Donald Trump,” Wise said.","summary":"The Central Park Five defendants are suing former President Donald Trump for defamation over comments he made during his debate with Vice President Kamala Harris. Yusef Salaam, Raymond Santana, Kevin Richardson, Antron Brown, and Korey Wise were the center of a cause celebre in 1989 when they were convicted of attacking and raping a jogger [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3197768/trump-sued-defamation-by-exonerated-central-park-five-over-debate-comments/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Central-Park-Five.webp","video":null,"publish_date":"2024-10-21 23:28:44","author":"Brady Knox","authors":["Brady Knox"],"language":"en","category":"politics","source_country":"US","sentiment":-0.766},{"id":260573888,"title":"Tina Brown says Meghan Markle’s ‘ideas are total crap,’ calls Prince Harry ‘naïve’ and working with Harvey Weinstein was ‘dumbest’ career move","text":"Tina Brown says “all of [Meghan Markle’s] ideas are total crap,” and thinks Prince Harry is a “naïve” “lamb to the slaughter.\n\nThe former Vanity Fair and New Yorker editor dished on the couple to promote her new substack, “Fresh Hell” — and also admitted that going into business with Harvey Weinstein in the late ’90s herself was “the dumbest career move of anybody’s life.”\n\nThe Ankler’s Janice Min asked the Brit wunderkind editor who took over New York in the ’80s about the Duke and Duchess of Sussex on the latest episode of the Ankler podcast. \n\nBrown said of Harry’s defection from the royal family: “In England, they’re going to constantly make a career out of trashing Harry. But actually, the thing about Harry is he’s very good at being Prince Harry. And that’s the tragedy of all of this, is that he is the most talented member of the royal family, without doubt, in terms of being a prince, which is all he does know how to do… he’s really sort of flawless at it.”\n\nAs for Markle, she added, “I think he’s pretty much in the thrall of Meghan. The trouble with Meghan is that she has the worst judgment of anyone in the entire world. She’s flawless about getting it all wrong. She really is.”\n\nBrown said of the “Suits” star turned American Riviera Orchard entrepreneur, “She’s a perfectionist about getting it all wrong. Her issue is that she doesn’t listen. She has all these people, asks them their opinion, and then doesn’t follow it. She does what she wants to do. And all of her ideas are total crap, unfortunately.”\n\nShe reckons of Harry’s worldview, “he’s so naïve and really unschooled in the ways of the world. Being Prince Harry means that I doubt if he ever booked a table in a restaurant. The army was great for him, and he was extremely good and competent in there. That really helped turn him into a real person.”\n\nBut with Markle, “he’s the lamb to the slaughter in this situation,” Brown said. “He was terribly impressed by Meghan. He thought that she knew all, she persuaded him that she was the savvy Hollywood wheeler-dealer who could come in and make them stars and all the rest of it. And he just sort of blindly followed her like a child, really.”\n\nThe couple married in 2018 at Windsor Castle, but quit the royal family in 2020, and decamped for California. \n\nBrown says of Markle’s moves — and future, “unfortunately, she made every mistake in the book, and she’s kind of run out of road. I don’t know where Meghan goes. Harry could still, as I say, make a comeback. He’ll always be Prince Harry. He’ll always be the grandson of the Queen and the son of Diana.”\n\nMeanwhile, Brown also candidly recalled her time working with former power producer Weinstein, when she created the ill-fated Talk Magazine with his Miramax Films.\n\n“Well, the Harvey that I went to work for had just [produced] ‘The English Patient,’ so he was the god of quality at that point,” she told Min of launching their mag in 1999. “And, in probably the dumbest career move of anybody’s life, I left the New Yorker magazine to go into business with Harvey.”\n\nTalk was also overseen by famed Condè Nast exec Ron Galotti, who was allegedly the inspiration for Mr. Big on “Sex and the City,” and Hearst was also involved in the short-lived venture. \n\nWeinstein is infamously behind bars pending a new New York sex crimes trial after a 23-year sentence was overturned in April. He’s also facing another indictment, plus a trial in Los Angeles. \n\nBrown says that these days, “It’s so funny, whenever I go and speak at women’s empowerment conferences, I can see that they’re all crushed when I say that Harvey Weinstein didn’t sexually harass me. I mean, they all want him to have sexually harassed me.”\n\nShe added on Min’s podcast that, “He didn’t sexually harass me, but he was very difficult in other ways. I completely understand how people could end up feeling very much afraid of him. It is pretty incredible to think of him sitting there in that prison, and he’ll probably die there.”\n\nBrown also expounded on Donald Trump, Kamala Harris, Tucker Carlson, Harrison Ford, Tom Cruise and more in the wide-ranging chat. \n\nBrown is also behind the Truth Tellers investigative journalism summit in London, we’ve reported. \n\nShe told Page Six of the initiative, “We celebrate great journalists, who do brave and courageous work… What’s exciting about the summit is that we’re really trying to do great work despite these difficult times… Nothing beats a journalist willing to knock on doors.\n\nWe have reached out to Markle and Prince Harry’s rep for comment.","summary":"Brown says of Markle, \"unfortunately, she made every mistake in the book, and she’s kind of run out of road. I don't know where Meghan goes.\"","url":"https://pagesix.com/2024/10/21/gossip/tina-brown-says-meghan-markles-ideas-are-total-crap-calls-prince-harry-naive/","image":"https://pagesix.com/wp-content/uploads/sites/3/2024/10/92107978.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-21 23:28:01","author":"Ian Mohr","authors":["Ian Mohr"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.182},{"id":260573798,"title":"How could Senate Bill 1 impact Texas voters during this election?","text":"HOUSTON, Texas (KTRK) -- November will mark the first presidential election since Senate Bill 1 was enacted into Texas law three years ago, providing better insight into the legislation's impact on people who already face economic, social, and physical challenges when it comes to voting.\n\nSB 1 imposes a number of changes, including eliminating overnight early voting hours, outlawing ballot harvesting, adding rules for mail-in-voting, granting more autonomy to partisan poll watchers inside voting areas, and setting criminal penalties for voter assistance.\n\nSupporters call Senate Bill 1 an \"election protection\" law that came out of former President Donald Trump questioning the results of the 2020 presidential election, even though there has been no evidence of widespread voter fraud.\n\nMeanwhile, opponents believe the law is a way for Republicans to make it harder for disenfranchised communities to cast their ballots.\n\nConcerns among people living with disabilities\n\nDespite the challenges that come with living with muscular dystrophy, Lydia Nunez Landry has made it a priority to vote in nearly every single election. Her passion to be civically engaged partly came from her family. She remembers going to the polls with her mother when she was a little girl and standing by her side as she voted.\n\n\"Voting is important to me. My father fought in World War II for democracy. So I feel like it's my responsibility and as a good citizen to vote. Voting is fundamental to democracy. We can't have a democracy without it. That's the opportunity for us to choose who will represent us,\" said Nunez Landry.\n\nShe prefers to vote in person when she can, but believes it's important to have options. Nunez Landry has utilized mail-in voting several times for different reasons, whether it was because of the COVID-19 pandemic or the fact that there is no accessible public transportation in Seabrook where she lives.\n\nAfter the passage of SB 1, Nunez Landry feared that her ballot would not be accepted under the new signature verification process. She explained that she does not have a consistent signature due to her condition.\n\n\"My handwriting fluctuates from day to day. Sometimes I can write legibly and then sometimes it's incoherent,\" she said.\n\nLast August, the U.S. District Court for the Western District of Texas overruled the provision, citing that it violated the Civil Rights Act of 1964. It also overturned the provision that rejected mail-in ballots for using a form of identification that didn't match the one used on a voter registration application.\n\nHowever, she is still concerned about the part of the law that enacts possible criminal penalties for people who assist voters needing help with filling out their ballots, such as voters with disabilities.\n\n\"Some of us require assistance with using the accessible voting equipment. But the new language in the oath for assisters was very chilling. It had a chilling effect,\" she said. \"A lot of disabled people may hesitate to ask one of their attendants to do this and risk some serious criminal liability.\"\n\nRegardless, Nunez Landry is determined to help increase votership among people living with disabilities. She currently volunteers with REV UP, a voter campaign organized by the American Association of People with Disabilities.\n\n\"So many people would say to me, 'No one cares about us.' I told them that's exactly why we need to vote. There's power in numbers,\" she said. \"You want to challenge me? I'm going to show up even more. I just can't afford to succumb to despair and cynicism.\"\n\nShe added, \"I also want people to know the difference between drive-thru voting, which was eliminated under SB 1, and curbside voting. Curbside is still available for people with disabilities and/or over 65 years old. You can drive up to the polling location and ring a buzzer where the signage is.\"\n\nConcerns about people voting absentee\n\nMorrow Entrekin, 19, has been anticipating the moment when she'll be able to vote in her first presidential election in November. Although she is currently a student living on-campus at Oklahoma State University, Entrekin plans to cast her ballot as an absentee in Tarrant County where her parents live.\n\n\"My drive to get home is about four hours, which I know is not that bad. I would love to vote in-person. But it doesn't work out for me, because the hours available for voting are not the hours I would be able to travel without having to skip class,\" she said.\n\nEntrekin knows that she has to request her mail-in ballot on her own, thanks to her mother who is familiar with the voting process. But she worries about others in a similar situation who may not be aware and could miss out on the opportunity to vote.\n\nUnder SB 1, local officials are no longer allowed to proactively send out applications for mail-in ballots, even if they are to people who automatically qualify.\n\n\"It's inconvenient that we have to remember before each and every single election to apply for a mail-in ballot. On top of that, you have to make sure you do everything right so it doesn't get rejected. That's why I send mine months in advance, just in case,\" said Entrekin. \"I watch my friends in Oklahoma vote by mail and it is not nearly this hard.\"\n\nThe college sophomore said she already sees voter apathy among her peers, causing concern that the new legislation may discourage young populations in Texas from voting.\n\n\"If you create these barriers, some people won't do it. When it's hard for them one time, they might not do it the next time because they know it's difficult,\" she said.\n\nPotential widespread impact on the November election\n\nThe actual impact of SB 1 on the results of the 2024 presidential election will remain unclear until after November. However, Rice University Political Science Prof. Bob Stein anticipates it could hurt the Republican turnout, as the majority of people who vote by mail were conservatives.\n\nStein said since the state has increased skepticism, his survey of Republican primary voters showed that none of them will vote by mail and could cause the party to lose votes from those who are elderly, disabled, or living in nursing homes.\n\n\"I've been working with a group of Republican consultants this summer, who invited me into a project to help convince Republican voters that elections are conducted fairly. They tell me they scratch their head and don't understand why Republicans, led by Donald Trump, are attacking the voting system,\" said Stein.\n\nBut Stein has an explanation. He said Republicans typically get elected in primaries, not general elections. So in states like Texas where Republicans hold a majority of the state legislature, the race for office is the primary.\n\n\"Most Republican legislators will tell you they don't think there's a lot of voter fraud and at best, if they pass something, they may suppress Democratic turnout. But what they do know is if they don't get behind the Trump message, they may not be in office,\" he said.\n\nFurthermore, Stein predicts that Senate Bill 1 may actually help increase voter turnout among diverse communities.\n\n\"I think the parties use SB 1 as a scapegoat for mobilizing their base. Republicans point to it and say, 'See? We're fighting for a fair election.' Democrats turn it around as 'They don't want you to vote, so that's why you should,'\" he said. \"I call it the Tom Sawyer effect.\"","summary":"SB 1 imposes a number of changes, including eliminating overnight early voting hours and setting criminal penalties for voter assistance, along with a list of other items.","url":"https://abc13.com/post/how-will-senate-bill-1-impact-texas-voters-during-2024-presidential-election-november/15437727/","image":"https://cdn.abcotvs.com/dip/images/15451508_102124-ktrk-voters-clean-img.png?w=1600","video":"https://vcl.abcotv.net/video/ktrk/102124-ktrk-4pm-ewn-RNG-sb1-election-gina-vid.mp4","publish_date":"2024-10-21 23:21:30","author":"Rosie Nguyen","authors":["Rosie Nguyen"],"language":"en","category":"politics","source_country":"us","sentiment":-0.105},{"id":260573548,"title":"Trump holds edge in key poll","text":"The polling agency that accurately predicted his victory in 2016 says former President Donald Trump now stands a point ahead of Vice President Kamala Harris in his second attempt at a second term, though the race for the White House in it’s final two weeks remains locked in a statistical tie.\n\nTrump’s small lead, according to TIPP Insights, is down from a two-point split seen in the polling agency’s last daily tracking poll, but is nevertheless a reversal of fortunes for the former president from when the pollsters first began their countdown-to-November.\n\n“Former President Donald Trump’s support against VP Kamala Harris now enjoys a one-point lead, 48% to 47%, in the TIPP tracking poll,” pollsters wrote.\n\nThe first release of the TIPP tracker, on October 14, showed Harris leading the 45th President by three points, just barely outside the poll’s 2.8-point margin of error.\n\nA Suffolk University/USA Today poll found the race all but tied in a contest including third party options — they show Harris has a one-point advantage in a 3.1-point-margin survey — and the director of the Suffolk University Political Research Center David Paleologos, said those third parties may prove to be the only thing that breaks the tie.\n\n“In 2016, Libertarian Gary Johnson and Green Party nominee Jill Stein (yes, the same Jill Stein) each received more votes in the 3 ‘blue wall’ states than the margin by which Hillary Clinton lost,” Paleologos wrote in a USA Today column published Monday.\n\n“Then in 2020, Libertarian Jo Jorgensen, the only significant third-party candidate, received more votes than the margin by which Trump lost in Georgia, Arizona, and Wisconsin,” Paleologos wrote.\n\nAccording to the professor, if the Harris campaign were to push Republican voters toward Libertarian Chase Oliver or Independent Robert F. Kennedy Jr. (who dropped out, but remains on the ballot in several states), that might swing the overall vote in the key battlegrounds of Pennsylvania, Michigan, and Wisconsin in her favor. The same can be said for Trump with Independent Cornel West or Stein – if enough Democratic leaning voters choose either left-leaning alternative, that’s potentially enough to hand him those three states.\n\n“It’s too late to try to remove third-party candidates from the ballot, but there is a way for Harris and Trump to make the composition of each state’s ballot work for them: forget trying to convince voters to choose you, and instead try to convince your opponent’s softest voters to pick someone else,” Paleologos advises.\n\nAn Emerson College Poll released late last week showed precisely the same deadlock — with Harris up by one point but inside the margins — and also showed third party candidates grabbing a small but significant amount of the vote at 1%.\n\nSpencer Kimball, the executive director of Emerson College Polling, said with that poll’s release that the survey demonstrates some clear splits in voter support.\n\n“Women and male voters break in near opposite directions: men for Trump, 56% to 42%, and women for Harris, 55% to 41%. Hispanic voters break for Harris, 61% to 35% and Black voters 81% to 12%, while white voters break for Trump 60% to 38%,” Kimball said.\n\nVoters who haven’t yet made up their mind — one supposes they must exist, since the Emerson survey found more than a few people making that assertion — tend to lean toward Harris, according to Kimball.\n\n“Voters who made their decision on who to support over a month ago break for Trump, 52% to 48%, while voters who made up their mind in the last month or week break for Harris, 60% to 36%,” Kimball said. “The three percent of voters who said they could still change their mind currently favor Harris, 48% to 43%.”","summary":"The race for the White House enters it's final two weeks locked in a statistical tie.","url":"https://www.bostonherald.com/2024/10/21/trump-holds-edge-in-key-poll/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/AP24295594515785.jpg?w=1024","video":null,"publish_date":"2024-10-21 23:21:30","author":"Matthew Medsger","authors":["Matthew Medsger"],"language":"en","category":"politics","source_country":"us","sentiment":-0.378},{"id":260574094,"title":"White House Wants Women's Health Insurance To Cover Condoms, Other Non-Prescription Contraceptives","text":"The White House announced a plan Monday for a new federal rule requiring that women's health insurers pay for over-the-counter contraceptives.The regulation would cover condoms, spermicides, birth control sponges, so-called morning after pills and Perrigo's Opill, the only non-prescription daily birth control pills approved by the Food and Drug Administration, according to Reuters.The proposal by the Departments of Health and Human Services, Labor and Treasury would expand an Affordable Care Act mandate for coverage of preventive care services at no cost. If approved, the new rule would take effect next year.\"This rule, once finalized, will expand contraception coverage for 52 million women of reproductive age with private health insurance,\" White House Gender Policy Council Director Jennifer Klein said during a news conference.The announcement came 15 days before the Nov. 5 election that pits Vice President Kamala Harris against former President Donald Trump.Harris has made abortion rights a key issue in her campaign and the White House released a statement in which she hailed the no-cost contraception plan, saying, \"Every woman in every state must have reproductive freedom and access to the health care they need.\"Trump has bragged about appointing three Supreme Court justices who helped overturn the Roe v. Wade decision, leading to abortion bans or stringent restrictions in 21 states.During this year's race, he refused to say whether he would veto a national abortion ban until the subject came up during the Oct. 1 vice presidential debate, when he said would \"because it's up to the states to decide.\"Perrigo stock closed Monday at $25.85 a share, up 2.21%.","summary":"The proposal would expand an Affordable Care Act mandate for coverage of preventive care services at no cost and take effect next year.","url":"https://www.ibtimes.com/white-house-wants-womens-health-insurance-cover-condoms-other-non-prescription-contraceptives-3747578","image":"https://d.ibtimes.com/en/full/4555720/condoms.jpg","video":null,"publish_date":"2024-10-21 23:17:34","author":"Bruce Golding","authors":["Bruce Golding"],"language":"en","source_country":"US","sentiment":-0.278},{"id":260576374,"title":"Harris holding moderated conversations with Liz Cheney in 3 battleground states","text":"MALVERN, Pa. -- Vice President Kamala Harris is doing a series of moderated conversations with former Wyoming Republican Rep. Liz Cheney in suburban cities in the battleground states of Pennsylvania, Michigan and Wisconsin on Monday -- the day before in-person voting begins in Wisconsin.\n\nWith roughly two weeks until Election Day, the effort is part of the Harris campaign's effort to reach swing voters in the crucial battleground states. Harris is speaking with Cheney in the suburban areas of Chester County, Pennsylvania; Oakland County, Michigan; and Waukesha County, Wisconsin.\n\nThe conversations were to be moderated by Bulwark publisher and longtime Republican strategist Sarah Longwell and conservative radio host and writer Charlie Sykes.\n\nBoth Harris and former President Donald Trump have events scheduled for battleground states this week as they work to win over voters in what's expected to be a close contest. On Monday, Trump is spending time in in the battleground state of North Carolina.\n\nWhile in Pennsylvania, Harris and Cheney worked to pick off Republicans disaffected with their party's nominee who may vote for the vice president and focus on the dangers Trump poses to the country and to democracy -- especially white suburban women who voted Republican.\n\n\"There are months in the history of our country which challenge us, each of us, to really decide when we stand for those things that we talk about, including, in particular, country over party,\" Harris said.\n\nCheney, a staunch Trump critic who endorsed Harris in September despite their party and policy differences, said \"every single thing in my experience and in my background has played a part\" in her supporting Harris.\n\n\"In this race, we have the opportunity to vote for and support somebody you can count on. We're not always going to agree, but I know Vice President Harris will always do what she believes is right for this country. She has a sincere heart, and that's why I'm honored to be in this place.\"\n\nAt the Michigan event, Cheney said that she understood why some Republicans would find it difficult to publicly support Harris.\n\n\"I certainly have many Republicans who will say to me, 'I can't be public.' They do worry about a whole range of things, including violence. But, but they'll do the right thing,\" she said.\n\n“And I would just remind people, if you're at all concerned, you can vote your conscience and not ever have to say a word to anybody, and there will be millions of Republicans who do that on November 5th, vote for Vice President Harris,” she added.\n\nCheney voted to impeach Trump following the events of Jan. 6, 2021, and was vice chair of the House select committee that investigated the Jan. 6 attack on the Capitol. She received backlash from Trump and other Republicans for her criticism of the former president and was censured by the Republican National Committee.\n\nSince her endorsement of Harris, Cheney has campaigned for the vice president -- including in battleground Wisconsin, where she called Trump petty, vindictive and cruel.\n\nCheney is among a handful of prominent Republicans, including her father, former Vice President Dick Cheney, who have pledged to support Harris' bid.\n\nThe number of actual votes these events could move, with just two weeks to go, is small -- yet could be significant in states expected to be decided by slim margins, Joe Zepecki, a Milwaukee-based Democratic strategist, told ABC News.\n\nIdeally, Zepecki said, the events would bring over \"Republicans available to Harris who might need one last reminder, one last push in that direction.\"\n\nGeorge Levy, a 66-year-old voter from Delaware County, outside Philadelphia, said he was an independent until Trump entered the political arena in 2015.\n\n\"I'm never going back. I'll be a Democrat from now on,\" he told ABC News as he waited in line to enter the intimate theater in Malvern, Pennsylvania, a Philadelphia suburb that was the site of the first Cheney discussion of the day.\n\n\"[Cheney] did the right thing for our country, and I'm proud of her for doing that,\" he said. \"I know she doesn't agree with many Democratic policies, but she believes in our country and loves our country, and I appreciate her speaking out.\"\n\nIn a social media post on Monday, Trump attacked Harris for campaigning with Cheney, claiming that the former Wyoming Republican congresswoman is going to lead the United States to go to war with \"every Muslim Country known to mankind\" like her father and former Vice President Dick Cheney \"pushed\" former President Georgia W. Bush to the war in the Middle East.\n\nHarris' events this week will feature more interactivity where voters see the vice president taking questions -- including during her town hall with CNN on Wednesday in Pennsylvania.\n\nABC News' Sarah Beth Hensley contributed to this report.","summary":"Vice President Kamala Harris is doing a series of moderated conversations with former Rep. Liz Cheney in the battleground states of Pennsylvania, Michigan and Wisconsin.","url":"https://abcnews.go.com/Politics/harris-moderated-conversations-liz-cheney-3-battleground-states/story?id=114990344","image":"https://i.abcnewsfe.com/a/c5e83b3e-d74f-4bb4-b88f-87e52081d1b3/cheney-1-gty-er-241021_1729527352075_hpMain_16x9.jpg?w=1600","video":null,"publish_date":"2024-10-21 23:15:42","author":"Fritz Farrow,Gabriella Abdul-Hakim,Will McDuffie","authors":["Fritz Farrow","Gabriella Abdul-Hakim","Will McDuffie"],"language":"en","category":"politics","source_country":"us","sentiment":0.004},{"id":260573492,"title":"Latest on 2024 race with 15 days until Election Day","text":"Latest on 2024 race with 15 days until Election Day\n Former President Donald Trump and Vice President Kamala Harris are campaigning in a combined four battleground states on Monday with just 15 days until Election Day. CBS News' Weijia Jiang and Robert Costa have the latest.","summary":"Former President Donald Trump and Vice President Kamala Harris are campaigning in a combined four battleground states on Monday with just 15 days until Election Day. CBS News' Weijia Jiang and Robert Costa have the latest.","url":"https://www.cbsnews.com/video/2024-race-latest-15-days-until-election-day/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/21/0c3dafd5-08fb-45f2-b601-7cfd3ac91b0c/thumbnail/1200x630/0c4cb4cc34abf873c679e85c024aae2c/harris-trump.jpg?v=b241b87adbbb7f0a227ed35b96d0cefa","video":null,"publish_date":"2024-10-21 23:14:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.225},{"id":260574080,"title":"5 dead in shooting at Washington state home with teen in custody, police say","text":"CTVNews.ca Top Stories\n\n Former B.C. premier Christy Clark wants to be 'part of the conversation' on Liberal party future\n\n As Prime Minister Justin Trudeau faces growing pressure to step aside, former B.C. premier Christy Clark says she is open to 'returning to politics' should the position of Liberal leader become available.\n\n WATCH LIVE \n\n WATCH LIVE | \n\n New Brunswick election 2024: Polls close after 33-day campaign\n\n Polls are now closed in New Brunswick, where hundreds of thousands of residents voted Monday in what is predicted to be a tight provincial election.\n\n 2 plead guilty to B.C. murder of former Air India suspect Ripudaman Singh Malik\n\n Two men charged in the killing of former Air India bombing suspect Ripudaman Singh Malik have pleaded guilty to second-degree murder in a British Columbia court.\n\n Major Toronto hospital network reinstates masking requirement\n\n The University Health Network (UHN) is making masks mandatory as respiratory illness season ramps up.\n\n Investigation ongoing into death of 19-year-old Walmart employee in Halifax\n\n The investigation into the sudden death of a 19-year-old Walmart employee over the weekend is ongoing in Halifax.\n\n Alleged assassination target calls expelled Indian high commissioner 'less of a diplomat and more of a hypocrite'\n\n Gurpatwant Singh Pannun — a dual Canada-United States citizen and the target of an alleged assassination attempt in New York City last year — says the expelled Indian High Commissioner to Canada, Sanjay Kumar Verma, is 'less of a diplomat, and more of a hypocrite.'\n\n Death toll from B.C. atmospheric river climbs as driver found dead, another presumed drowned\n\n Mounties on Vancouver Island say one person is dead and another is presumed to have drowned after two vehicles were found submerged in a river following heavy rains that washed out roadways across British Columbia.\n\n Are you a Canadian stuck in Cuba without power? We want to hear from you\n\n Daily life in Cuba has been largely affected since an outage led to a nationwide blackout in the country, followed by Tropical Storm Oscar hitting the country's east coast. If you're a Canadian stuck in Cuba through this ordeal, CTV News wants to hear from you.\n\n Frozen waffles recalled across Canada, U.S. over Listeria concerns\n\n A U.S.-based food manufacturer that supplies frozen waffles to major grocery chains across North America has launched a voluntary recall over concerns its products carry the potential for illness.\n\n Are you a Canadian stuck in Cuba without power? We want to hear from you\n\n Daily life in Cuba has been largely affected since an outage led to a nationwide blackout in the country, followed by Tropical Storm Oscar hitting the country's east coast. If you're a Canadian stuck in Cuba through this ordeal, CTV News wants to hear from you.\n\n Death toll from B.C. atmospheric river climbs as driver found dead, another presumed drowned\n\n Mounties on Vancouver Island say one person is dead and another is presumed to have drowned after two vehicles were found submerged in a river following heavy rains that washed out roadways across British Columbia.\n\n 2 plead guilty to B.C. murder of former Air India suspect Ripudaman Singh Malik\n\n Two men charged in the killing of former Air India bombing suspect Ripudaman Singh Malik have pleaded guilty to second-degree murder in a British Columbia court.\n\n Montreal-area woman hit by gunshot while lying in bed 2 floors above neighbour: police\n\n A 23-year-old woman is recovering in hospital after being shot while lying in her bed in Repentigny, Que. on Friday night.\n\n Investigation ongoing into death of 19-year-old Walmart employee in Halifax\n\n The investigation into the sudden death of a 19-year-old Walmart employee over the weekend is ongoing in Halifax.\n\n Vermont man charged with drunk driving in Ottawa Valley thought he was still in U.S.\n\n Ontario Provincial Police charged an impaired Vermont man who illegally crossed the border into Canada and thought he was still in the United States.\n\n 5 dead in shooting at Washington state home with teen in custody, police say\n\n Law enforcement officials found five people killed in a shooting inside a home southeast of Seattle on Monday morning and took a teenager into custody, police said.\n\n Navy identifies two killed in fighter jet crash as aviators from California\n\n The navy identified on Monday the two crew members who died last week in a jet fighter crash near Mount Rainier as two 31-year-old aviators from California.\n\n 'Central Park Five' members sue Trump for defamation after his debate comments on 1989 case\n\n Members of the 'Central Park Five' sued former President Donald Trump on Monday over \"false and defamatory\" statements they allege he made about their 1989 case during a presidential debate last month.\n\n Writer Olivia Nuzzi, New York magazine part ways after relationship with political source revealed\n\n New York magazine and its star political reporter, Olivia Nuzzi, have decided jointly to \"part ways\" after reports that she had a personal digital relationship with a source while covering the 2024 campaign.\n\n New Zealand airport imposes cuddle cap with 3-minute limit on goodbye hugs to avoid traffic jams\n\n A new three-minute time limit on goodbye hugs in a New Zealand's airport drop-off area is intended to prevent lingering cuddles from causing traffic jams.\n\n Jury selection begins in the trial of a man charged in a New York City subway chokehold death\n\n Jury selection began Monday in the trial of a U.S. Marine Corps veteran charged with manslaughter for placing a man in a deadly chokehold on a New York City subway train last year.\n\n Former B.C. premier Christy Clark wants to be 'part of the conversation' on Liberal party future\n\n As Prime Minister Justin Trudeau faces growing pressure to step aside, former B.C. premier Christy Clark says she is open to 'returning to politics' should the position of Liberal leader become available.\n\n One Liberal MP says he's signed letter asking Trudeau to resign, others remain mum\n\n Liberal MP Sean Casey is the first to publicly confirm that he has signed a letter calling on Prime Minister Justin Trudeau to resign, arguing it would be in the best interests of the country to let someone else take the reins.\n\n Alleged assassination target calls expelled Indian high commissioner 'less of a diplomat and more of a hypocrite'\n\n Gurpatwant Singh Pannun — a dual Canada-United States citizen and the target of an alleged assassination attempt in New York City last year — says the expelled Indian High Commissioner to Canada, Sanjay Kumar Verma, is 'less of a diplomat, and more of a hypocrite.'\n\n Frozen waffles recalled across Canada, U.S. over Listeria concerns\n\n A U.S.-based food manufacturer that supplies frozen waffles to major grocery chains across North America has launched a voluntary recall over concerns its products carry the potential for illness.\n\n Major Toronto hospital network reinstates masking requirement\n\n The University Health Network (UHN) is making masks mandatory as respiratory illness season ramps up.\n\n Quebec religion wants Health Canada's blessing to use magic mushrooms in ceremonies\n\n A Quebec-based religion says Health Canada is dragging its feet on a decision whether to allow members to use magic mushrooms in their ceremonies.\n\n Artificial intelligence a 'double-edged sword' in world of cybersecurity: experts\n\n In the fight against cyber attackers, they reason AI can help just as much as it harms.\n\n Preserving the history of Saskatchewan small towns is this tech company's specialty\n\n The image of a sleepy Saskatchewan small town with 'not a lot going on' is a well-known anecdote. However, one Saskatchewan company is hoping to change that – and allow communities both on and off the beaten path to share their stories and advertise what they have to offer.\n\n Is it pickled fat? Pierogi? Newfoundland 'blobster' expert eyeing weird beach goo\n\n A Newfoundland scientist known for identifying a gelatinous, rancid mass that washed up on the island's shores decades ago is hoping to get his hands on a slice of the strange white globs appearing on the province's beaches.\n\n Entertainment \n\n Facing 7 more lawsuits, Sean 'Diddy' Combs protests a 'fresh wave of publicity'\n\n Seven new lawsuits have been filed against Sean ‘Diddy’ Combs, including one alleging the rape of a 13-year-old girl. They come as his lawyers tried again Monday to get him freed on bail, and complained that a “fresh wave of publicity” is endangering his right to a fair criminal trial.\n\n Jennifer Lawrence expecting second child with husband Cooke Maroney\n\n Jennifer Lawrence will soon be a mom of two. The Oscar-winning actress is pregnant with her second child, a representative for Lawrence told Vogue on Sunday.\n\n Liam Payne fans gather in great crowds to pay tribute in London's Hyde Park\n\n London’s Hyde Park was one of the several sites around the world this weekend for an outpouring of love, grief and recollection in honor of Liam Payne, the former One Direction boy band member who tragically fell to his death at a hotel in Buenos Aires last week at the age of 31.\n\n Six months on, what has the Trans Mountain pipeline project achieved and what's next?\n\n Nearly six months after its opening, the Trans Mountain pipeline expansion is boosting Canada's energy sector as promised — but questions still linger about who will pay for the project's massive cost overruns.\n\n Waterloo, Ont. company removed from U.S. entity list after supplying tech used for surveillance, spyware\n\n A Waterloo, Ont. tech company says it’s been removed from the U.S. Department of Commerce’s entity list, after previously supplying technology allegedly used for mass surveillance and censorship.\n\n High cost of groceries, rent squeezing Canadians: poll\n\n High grocery and rental costs are squeezing lower-income Canadians even as inflation trends downward, a new survey suggests.\n\n Lifestyle \n\n Husband-and-wife food bloggers show how two chefs can navigate the home kitchen and stay happy\n\n Husband-and-wife food bloggers and podcasters Sonja and Alex Overhiser have a new cookbook that uses a simple step to keep the kitchen a less heated place for two chefs: clear, alternating roles.\n\n 83-year-old Newfoundland musician still playing sold-out shows, even with memory loss\n\n At 2 p.m. on Thursday, the scene at the Lions Club in Clarenville, N.L., rivalled any rowdy St. John's bar that thumps with music late on a weekend night.\n\n 'It was a good choice': This U.S. couple say their living costs dropped by nearly US$3,000 a month when they moved to Italy\n\n The retired elementary teachers, Tony and Francine Smarrelli, originally from Syracuse, New York, resolved to leave the U.S. and move to Italy for good. They say they’ve cut back nearly US$3,000 per month on expenses, which amounts to US$36,000 a year, since moving there permanently.\n\n Liberal, Bloc MPs vote not to summon soccer officials for cheating scandal questions\n\n A parliamentary committee will not question the coaches of the national women's soccer team about the Paris Olympics cheating scandal, after Liberal and Bloc Québécois MPs voted against launching a study today.\n\n Ken Griffey Sr. and Jr. will be at Lakers' opener, hoping to see LeBron and Bronny make NBA history\n\n If LeBron James Sr. and his son, Bronny, make NBA history Tuesday night by playing in the same game for the Los Angeles Lakers, Ken Griffey Sr. and Ken Griffey Jr. will be there to witness it.\n\n Professional mountain biker attempts new world record in Winnipeg while raising awareness for need for more biking facilities\n\n A newly minted Winnipegger is hoping a world record attempt will help bring awareness for the need for more pump track facilities in the city.\n\n Thousands of hybrid vehicles recalled in Canada over risk of fire\n\n An increased risk of fire has prompted the recall of thousands of Honda hybrid vehicles in Canada.\n\n U.S. to probe Tesla's 'Full Self-Driving' system after pedestrian killed in low visibility conditions\n\n The U.S. government's road safety agency is investigating Tesla's 'Full Self-Driving' system after getting reports of crashes in low-visibility conditions, including one that killed a pedestrian.\n\n Canada vowed to clamp down on auto thefts. How is it doing?\n\n Canada’s border guards have seized more than 1,900 stolen cars so far this year at railyards and ports, which is over a hundred more than in 2023.\n\n Local Spotlight \n\n 'He's a hero': Father runs into burning home and emerges with two infant children\n\n A Springfield, Ont. man is being hailed a 'hero' after running into his burning home to save his two infant children.\n\n 'I am humbled': Meet the 87-year-old Ontario woman who graduated from York University\n\n Hortense Anglin was the oldest graduate to make her way across the platform at York University's Fall Convocation ceremony this week. At the age of 87, she graduated with an Honours degree in Religious Studies.\n\n Haunted walk in Eganville, Ont. sharing donations among local charities\n\n Looking for a scare with good intentions this Halloween season? The ghosts and ghouls of Eganville, Ont. invite families to tour the Haunted Walk at Lekbor Manor.\n\n Preserving the history of Saskatchewan small towns is this tech company's specialty\n\n The image of a sleepy Saskatchewan small town with 'not a lot going on' is a well-known anecdote. However, one Saskatchewan company is hoping to change that – and allow communities both on and off the beaten path to share their stories and advertise what they have to offer.\n\n Donated Moncton home to be transformed into cancer resource hub\n\n A Moncton, N.B., home has been donated to the Friends of The Moncton Hospital Foundation and will be transformed into a resource hub for people living with cancer.\n\n The 'Fellow in Yellow' stops in southwestern Ontario during run across Canada\n\n A Nova Scotia man crossing Canada on foot is passing through southwestern Ontario. Trevor Redmond is perhaps better known as the ‘Fellow in Yellow.’\n\n $5 waffles, $7 eggs benny: Victoria diner revives menu from 1989\n\n John Cantin vividly remembers opening day for his Victoria diner. Stress levels were high, tables were full, and one of the most popular menu items couldn’t be freed from the unyielding grip of the waffle maker.\n\n 'The risk is real': Book on Manitoba mushrooms suspected to be written by AI\n\n A Manitoba professor is warning the public after a book on regional mushrooms that he suspects is AI-generated was delisted from Amazon.\n\n 'Vindictive and malicious': B.C. court weighs in on long-running neighbour dispute\n\n A B.C. judge has issued a decision in a years-long dispute between neighbours that began with a noise complaint over barking dogs, crowing roosters and quacking ducks – awarding $15,000 in damages to the plaintiffs in the case.\n\n Vancouver \n\n Death toll from B.C. atmospheric river climbs as driver found dead, another presumed drowned\n\n Mounties on Vancouver Island say one person is dead and another is presumed to have drowned after two vehicles were found submerged in a river following heavy rains that washed out roadways across British Columbia.\n\n Man tasered, arrested in Victoria, B.C., school library: police\n\n A school in Victoria, B.C., went into lockdown Monday before police tasered and arrested a man in the library, according to authorities.\n\n B.C. Greens' ex- leader Weaver thinks minority deal with NDP less likely than in 2017\n\n Former B.C. Green leader Andrew Weaver knows what it's like to form a minority government with the NDP, but says such a deal to form the province's next government is less likely this time than seven years ago.\n\n Major Toronto hospital network reinstates masking requirement\n\n The University Health Network (UHN) is making masks mandatory as respiratory illness season ramps up.\n\n 'Failure to provide necessities of life': Durham cop charged in on-duty incident\n\n A Durham police officer has been charged criminally after he allegedly failed to render medical assistance to a person in distress.\n\n Hamilton man shot after letting six-year-old play with gun now facing charges: police\n\n A 25-year-old Hamilton man who was shot after letting a six-year-old child play with his gun is facing charges, police say. That’s just one incident in what Hamilton police say has been a record year for shootings in the city.\n\n 7 sent to hospital after 9-vehicle crash on Peigan Trail\n\n Three people were sent to hospital following a crash on Peigan Trail Monday morning.\n\n Here's what Calgary Parking says about stickers covering tap payment readers\n\n Calgary Parking says there is “no need to worry” about stickers covering the contactless payment sensors on payment machines in the city.\n\n Fatal shooting at Homestead Drive home linked to organized crime: police\n\n Police now say a deadly shooting Friday evening in northeast Calgary is linked to organized crime. According to police, about a quarter of the year's total shootings are.\n\n 'I regret leaving my cat there': Eastern Ontario cat rescue under investigation, allegations of abuse, neglect\n\n A cat rescue southwest of Ottawa is under investigation after allegations of abuse, neglect and falsified medical records have surfaced.\n\n Trillium Line passes 14-day trial running\n\n OC Transpo says the line finished the test with a 14-day rolling average on-time performance of 99.5 per cent.\n\n City of Ottawa hybrid workers required to be in the office 2 days a week\n\n As federal employees head into the office three days a week under the federal government's new hybrid work model, the City of Ottawa is only requiring its hybrid employees to be in the office a minimum of two days a week.\n\n Quebec religion wants Health Canada's blessing to use magic mushrooms in ceremonies\n\n A Quebec-based religion says Health Canada is dragging its feet on a decision whether to allow members to use magic mushrooms in their ceremonies.\n\n Montreal-area woman hit by gunshot while lying in bed 2 floors above neighbour: police\n\n A 23-year-old woman is recovering in hospital after being shot while lying in her bed in Repentigny, Que. on Friday night.\n\n Plateau residents upset after city removes parking spots for trees\n\n Some people living in the Le Plateau-Mont-Royal are seeing red over a new landscaping project meant to bring more green to the neighbourhood.\n\n Edmonton Public Schools support staff to go on strike Thursday\n\n Edmonton Public Schools support workers will go on strike on Thursday.\n\n Oilers coach, players hesitant to change struggling power play\n\n Edmonton Oilers head coach Kris Knoblauch told media Monday after practice that although his team's usually potent power play has been sputtering badly to start the season, he's not ready – yet – to make changes to it.\n\n Alberta basketball coach pleads guilty to child pornography charges\n\n A Stony Plain basketball coach has pleaded guilty to child pornography charges.\n\n WATCH LIVE \n\n WATCH LIVE | \n\n New Brunswick election 2024: Polls close after 33-day campaign\n\n Polls are now closed in New Brunswick, where hundreds of thousands of residents voted Monday in what is predicted to be a tight provincial election.\n\n Investigation ongoing into death of 19-year-old Walmart employee in Halifax\n\n The investigation into the sudden death of a 19-year-old Walmart employee over the weekend is ongoing in Halifax.\n\n Record high temperatures set Sunday in the Maritimes; chance at more Monday\n\n A very fair and mild October weekend allowed for a few recording-setting high temperatures in the Maritimes.\n\n Nearly half of Winnipeg construction projects completed as nice weather extends work season\n\n Almost half of the Winnipeg’s construction projects are either done or substantially done, according to the city.\n\n Manitoba mandating passenger heaters for all buses starting in November\n\n Starting next month, all buses in Manitoba will require functional heating systems for passengers.\n\n 17-year-old girl arrested after two teen boys attacked with machete outside Winnipeg school\n\n A 17-year-old girl is facing charges in connection with a machete attack involving two teenage boys outside a Winnipeg school.\n\n SaskPower warns of Interac e-Transfer scam\n\n SaskPower is warning customers of an email scam currently making the rounds.\n\n Regina police searching for suspect in weekend assault in North Central\n\n Regina police are asking the public for help as it searches for a suspect involved in an assault in the North Central area on Sunday.\n\n Saskatchewan contractor fined $125,000 for workplace injury\n\n A construction firm has pled guilty in the case of a serious workplace injury in 2023 near Moose Jaw.\n\n Kitchener \n\n Victims share impact of University of Waterloo stabbing spree at attacker's sentencing hearing\n\n Victims are sharing the lasting impact of the 2023 triple stabbing at the University of Waterloo. The attacker, Geovanny Villalba-Aleman, previously pled guilty to four assault-related charges.\n\n GPS technology the focus on Day 5 of second-degree murder trial of Erick Buhr\n\n Testimony continued Monday at the trial of Erick Buhr, who has pleaded not guilty to the second-degree murder of his grandmother, Viola Erb.\n\n Waterloo, Ont. company removed from U.S. entity list after supplying tech used for surveillance, spyware\n\n A Waterloo, Ont. tech company says it’s been removed from the U.S. Department of Commerce’s entity list, after previously supplying technology allegedly used for mass surveillance and censorship.\n\n Saskatoon \n\n 'Hateful and mean': LGBTQ+ advocates slam Sask. Party's proposed change room policy\n\n A Saskatoon LGBTQ+ advocate says if the Saskatchewan Party's proposed change room policy had been in place when he was a kid, he would not have survived high school.\n\n Sask. woman charged with impaired driving in collision that killed two Alberta women\n\n The RCMP says a 32-year-old Saskatchewan woman has been charged with criminal negligence and impaired driving after causing a fatal collision in the wrong lane of Highway 11.\n\n Saskatoon police say 76-year-old man pushed down stairs after domestic dispute\n\n Saskatoon police have arrested a woman who investigators believe may have pushed a 76-year-old man down a flight of stairs on Friday night.\n\n Northern Ontario \n\n Missing for eight months, Sudbury-area Chihuahua mix reunited with owners\n\n It’s a story of survival and perseverance. A Chihuahua and terrier mix named Diamondhas been reunited with her owners after going missing in Markstay-Warren in March.\n\n Sault rally hears from victims of violence\n\n Rallies by a group called Voices Against Violence took place across the country on Monday, including Sault Ste. Marie.\n\n Northern Ont. First Nation protests after ancestral remains found during excavation\n\n An Indigenous group in northwestern Ontario shut down the highway for a couple of hours Monday morning in protest after ancestral remains were found at a construction site.\n\n 'The focus needs to be the failings of the system'; victims of violence against women speak out at rally\n\n \"We cannot allow the dehumanization of women and girls to occur even in its smallest [form],\" said Mayor Morgan while speaking at the podium.\n\n Charges laid after sexual assault on underage girl: London police\n\n Around 10 p.m. on Oct. 17, police said a teenaged girl met a man in the area of Clarke Road and Wavell Street. The two people struck up a conversation and walked together to the east side of a school in the area.\n\n CN begins the first of several east end crossing upgrades\n\n A crossing near the intersection of Highbury and Florence was shut down on Monday afternoon for rail repairs.\n\n Expert predicts how long will this warm weather last\n\n It's a summer-like day in mid-October, with temperatures hitting 24C across Simcoe County, feeling more like 27C with the humidex. These daytime highs aren't unheard of, but they are definitely not the norm.\n\n Driver loses control of car, plows across cornfield and crashes into house\n\n Police charged a motorist after a vehicle crashed into a home in Innisfil Monday afternoon.\n\n Mobile trailer destroyed in fire caused by a candle\n\n Officials say a candle caused a fire that destroyed a mobile trailer in Oro-Medonte early Friday morning.\n\n Windsor Liberation Zone organizers pleased the University won’t reconsider two agreements with protestors\n\n The Windsor Liberation Zone organizers are pleased that the University of Windsor will not reconsider two agreements made with pro-Palestinian protestors. The agreements were signed after a nine-week occupation.\n\n As demand for Alzheimer’s care increases, Lisa Williams is 'lucky' to have family by her side for her mother\n\n Despite the uncertainties of caring for a mother with Alzheimer’s disease, Lisa Williams feels fortunate to have the time, energy and support of her immediate family.\n\n Windsor Goodfellows see rise in program usage\n\n The Windsor Goodfellows are preparing for the return of their annual newspaper campaign next month as demand at the non-profit organization soars.\n\n Vancouver Island \n\n Death toll from B.C. atmospheric river climbs as driver found dead, another presumed drowned\n\n Mounties on Vancouver Island say one person is dead and another is presumed to have drowned after two vehicles were found submerged in a river following heavy rains that washed out roadways across British Columbia.\n\n Man tasered, arrested in Victoria, B.C., school library: police\n\n A school in Victoria, B.C., went into lockdown Monday before police tasered and arrested a man in the library, according to authorities.\n\n 3 charged with murder after Vancouver Island overdose death\n\n Two people have been arrested and one is still at large in the alleged murder of a woman on Vancouver Island whose 2023 overdose death police treated as suspicious.\n\n B.C. homeowner astounded someone managed to steal one of his prized giant pumpkins\n\n Dave Lindsey began growing giant pumpkins to bring a bit of magic to his grandkids' Halloween.\n\n B.C. man gets prison sentence, fine for using fake names to buy guns in the U.S.\n\n A U.S. District Court judge in Montana has sentenced a 27-year-old man from Kelowna, B.C., to 18 months in prison for using fake names to buy guns with the aim of selling them in Canada.\n\n 2nd-degree murder charge laid nearly 2 years after Kelowna stabbing\n\n Nearly two years after a man was stabbed to death in downtown Kelowna, RCMP have made an arrest in the case.\n\n Lethbridge \n\n No risk to public: Lethbridge police take part in training exercises on Tuesday\n\n Lethbridge police are advising the public of officer training on Tuesday that will happen in two different venues throughout the day.\n\n Hitmen wrap up homestand in impressive fashion, defeating Hurricanes 6-1\n\n Calgary scored three times in the first, and three times in the third as the Hitmen defeated the Lethbridge Hurricanes 6-1 Saturday at the Saddledome.\n\n Final students to graduate from Lethbridge College to receive degrees this weekend\n\n The last students to graduate from Lethbridge College will make history this weekend as they cross the stage at fall convocation.\n\n Sault Ste. Marie \n\n Sault rally hears from victims of violence\n\n Rallies by a group called Voices Against Violence took place across the country on Monday, including Sault Ste. Marie.\n\n Northern Ont. First Nation protests after ancestral remains found during excavation\n\n An Indigenous group in northwestern Ontario shut down the highway for a couple of hours Monday morning in protest after ancestral remains were found at a construction site.\n\n Fines as high as $50K for owners of vacant properties in Sault Ste. Marie\n\n The owners of 73 vacant properties in the Sault have been fined for violations of the city's vacant properties bylaw, including 33 owned by a firm going through a high-profile insolvency process.\n\n 77-year-old Kansas man missing after hotel fire in western Newfoundland\n\n Police in western Newfoundland say a 77-year-old man visiting the province from Kansas is missing after a fire at a hotel in Deer Lake, N.L.\n\n 83-year-old Newfoundland musician still playing sold-out shows, even with memory loss\n\n At 2 p.m. on Thursday, the scene at the Lions Club in Clarenville, N.L., rivalled any rowdy St. John's bar that thumps with music late on a weekend night.\n\n Is it pickled fat? Pierogi? Newfoundland 'blobster' expert eyeing weird beach goo\n\n A Newfoundland scientist known for identifying a gelatinous, rancid mass that washed up on the island's shores decades ago is hoping to get his hands on a slice of the strange white globs appearing on the province's beaches.\n\n Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n 14 Of The Best Fall Dresses Under $200\n\n 19 Fall Clothing Pieces And Accessories That Are Equal Parts Stylish And Budget-Friendly\n\n The Best Cashmere Sweaters You Can Get In Canada Right Now\n\n The Best Pillows From Least To Most Expensive, Ranked And Rated\n\n Our Guide to the Best Heated Blankets in Canada in 2024 (And Where to Get Them)\n\n The 5 Best Digital Kitchen Scales In Canada In 2024 (And Where To Get Them)\n\n 20 Great Gifts That Ring In Under $30\n\n The Ultimate 2024 Holiday Gift Guide For Teens\n\n 17 Brilliant Gifts For Anyone Who Works From Home\n\n Little Luxuries Are Important, So Let Me Introduce You To A Few Body Washes That Smell Amazing\n\n If You're Looking For A Hyaluronic Acid Serum, Here Are A Few That Reviewers Are Loving Right Now\n\n I Will Be Wearing This $10 e.l.f. Lip Oil Every Day Until Further Notice\n\n From The Bay to Best Buy: Here Are The Best Deals You'll Find Online This Week\n\n From Fossil To Frank And Oak: Here Are The Best Deals You'll Find Online This Week\n\n Prime Big Deal Days Sale: 6 Bestselling Vacuums You Can’t Afford to Miss\n\n Stay Connected","summary":"Law enforcement officials found five people killed in a shooting inside a home southeast of Seattle on Monday morning and took a teenager into custody, police said.","url":"https://www.ctvnews.ca/world/5-dead-in-shooting-at-washington-state-home-with-teen-in-custody-police-say-1.7081816","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/21/washington-state-shooting-leaves-5-dead-1-7081821-1729552352001.jpg","video":null,"publish_date":"2024-10-21 23:12:31","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.179},{"id":260572726,"title":"Nearly 40 Percent of Florida Republicans Back Abortion Amendment: Poll","text":"Nearly 40 percent of Florida Republicans are supporting an amendment to protect abortion rights in the state, despite some agreeing with the Supreme Court's decision to overturn Roe v. Wade, according to a poll conducted by the University of North Florida.Voters in Florida will determine the fate of an amendment that would enshrine reproductive rights into the state's constitution until the point of fetal viability, generally about 24 weeks into pregnancy. Abortion emerged as a major campaign issue after the U.S. Supreme Court abolished Roe in 2022 in a decision that returned the question of abortion rights to the states.Republicans celebrated the victory, arguing that states should be able to make their own laws on the issue. More liberal states have protected abortion, while some conservative states have moved to ban the procedure in most cases, though some Republican-leaning states like Kansas and Ohio have still voted to protect the women's health procedure.In Florida, once a bellwether state that has trended more conservative in recent years, the abortion amendment has earned support from nearly four in 10 Republicans, including some who agree with the Supreme Court decision to bring it back to the states, according to a new poll.The University of North Florida poll—which surveyed 977 likely voters from October 7 to October 18—found that 38 percent of Republicans plan to vote in support of the amendment.It also found that 59 percent of Florida Republicans agreed with the decision to overturn Roe. The amendment is also being supported by 24 percent of respondents who identify as \"pro-life,\" according to the poll, which had a margin of error of plus or minus 3.78 percentage points.According to Michael Bender, faculty director of the University of North Florida's Public Opinion Research Lab, 21 percent of Republicans who said they agree with the Supreme Court's overturning of Roe still plan to vote in support of the amendment.Newsweek reached out to the Florida Republican Party for comment via email on Monday.The poll also found a big lead for former President Donald Trump in the state, giving him a 10-point advantage over Vice President Kamala Harris (53 percent to 43 percent).FiveThirtyEight's Florida polling aggregate on Monday showed Trump with an average lead of 6.2 percent (50.9 percent to 44.7 percent) on Monday. In 2020, Trump won the state over President Joe Biden by about three points (51 percent to 48 percent).The U.S. Senate race was notably closer in the poll, finding Republican Senator Rick Scott with a 3-point lead over his Democratic challenger, former Representative Debbie Mucarsel-Powell (49 percent to 46 percent). Scott is viewed as a favorite, but Democrats are hoping to pull off a surprise victory to help save their Senate majority.Trump, a Florida resident, in August said he will be voting against the ballot measure in an interview with Fox News, but said he believes a six-week limit is too short.\"You need more time than six weeks. I've disagreed with that right from the early primaries. When I heard about it, I disagreed with it. At the same time, the Democrats are radical because the nine months is just a ridiculous situation,\" he said.He said he will be \"voting no,\" pointing to false claims that there are other states \"where you can actually execute the baby after birth.\" Infanticide is not legal in any state.Democrats are hoping that abortion will remain a key issue for voters in this year's elections and will motivate independent and politically moderate women in key states to vote against Trump, as polls show him locked in a close race with Harris.","summary":"The survey also found that 21 percent of Republicans who agree with the overturning of Roe still plan to vote in support of the amendment.","url":"https://www.newsweek.com/florida-republicans-back-supreme-court-abortion-amendment-1972525","image":"https://d.newsweek.com/en/full/2500470/florida-abortion-amendment-poll.jpg","video":null,"publish_date":"2024-10-21 23:08:06","author":"Andrew Stanton","authors":["Andrew Stanton"],"language":"en","category":"politics","source_country":"us","sentiment":-0.379},{"id":260572730,"title":"Donald Trump Says MAGA Is Nearly Triple the Size of His 2020 Popular Vote","text":"Former President Donald Trump boasted about the size of the MAGA movement during a podcast interview, saying that there were now more than triple the number of members than those who voted for him in 2020.\"We have MAGA—Make America Great Again—you know all about it. Right now, it's 200 million people, maybe even more, representing a majority of the country,\" the Republican presidential nominee told WWE legend Mark \"The Undertaker\" Calaway Monday on his Six Feet Under show.Trump said that MAGA—which he called \"the greatest movement in the history of any country\"—is far larger than his 2020 popular vote of about 74 million, though he offered no evidence to support these numbers. Throughout his campaign, Trump has often inflated figures regarding his political base and rally attendance.As part of Trump's strategy to engage male voters through online platforms, the conversation shifted to his interest in professional wrestling—a sport he has long been involved with, having made appearances at WWE events and even participating in the 2007 \"Battle of the Billionaires\" at WrestleMania 23.During the podcast, Trump expressed curiosity about the physical demands of wrestling, asking Calaway, \"Whether it's for fun or entertainment, you're still getting slammed around, right? Does the ring absorb much of the impact?\"Trump, who frequently merges politics with spectacle, likened the professional dynamics of wrestling to politics, saying that much like wrestling, politicians need to work together even if they don't like each other. \"You don't have to like each other, but you have to be professional enough to work together,\" Calaway said, drawing a parallel between the two fields.The conversation also touched on Trump's memories of past WrestleManias. He praised Calaway's in-ring persona, highlighting his iconic entrance and impressive athleticism.\"You were wrestling a good guy that night...He was a good specimen,\" Trump said, referring to Dave Bautista, who had faced Calaway in a match and more recently criticized Trump, calling him a \"loser.\"The 2024 election has seen both Trump and Vice President Kamala Harris, the Democratic nominee, embrace non-traditional means of reaching new audiences, with podcasts emerging as one of the top formats.Professional wrestling legend Hulk Hogan endorsed the former president at the Republican National Convention, and Trump appeared on Logan Paul's Impaulsive podcast.Other professional wrestling icons have spoken out against the former president. WWE Hall of Famer Jesse Ventura almost resigned because Trump was inducted.The U.S. podcast audience is larger than ever, with around 135 million Americans listening to podcasts at least once a month—15 million of whom were new listeners in the last year alone. The long-form format allows politicians to speak about their platforms without interruption and, critically, helps them connect with audiences that are otherwise disengaged from politics, including young men.Trump appears to be heavily targeting this demographic, appearing on Lex Fridman's podcast and participating in a podcast-style interview with Elon Musk on X. He has also appeared on the Shawn Ryan Show, comedian Theo Von's podcast, and shows by streamers Adin Ross and Logan Paul and conservative podcaster Tim Pool—all of whom have strong followings among young men.Harris has appeared on the podcasts Call Her Daddy, the most popular podcast on Spotify for women, and All The Smoke in recent weeks.","summary":"On a podcast, Trump claimed the MAGA movement is much larger than his 2020 popular vote of 74 million without providing evidence.","url":"https://www.newsweek.com/trump-maga-triple-size-2020-popular-vote-1972574","image":"https://d.newsweek.com/en/full/2500839/trump-undertaker.jpg","video":null,"publish_date":"2024-10-21 23:07:49","author":"Jesus Mesa","authors":["Jesus Mesa"],"language":"en","category":"politics","source_country":"us","sentiment":0.168},{"id":260572570,"title":"Central Park Five sue Donald Trump for defamation over presidential debate claim","text":"The exonerated Central Park Five filed a federal lawsuit against former President Donald Trump on Monday, accusing him of defaming them during a televised presidential debate on Sept. 10.\n\nIn their lawsuit, the five men claim Trump knowingly repeated false information about the infamous case with the intent to cause them emotional distress. They said the statements he made during the debate were part of a “continuing pattern of extreme and outrageous conduct dating back several years.”\n\nThe men — New York City Councilmember Yusef Salaam, Raymond Santana, Kevin Richardson, Antron Brown and Korey Wise — were wrongfully convicted and imprisoned for the 1989 rape and assault of Trisha Meili, who was jogging in Central Park when she was attacked.\n\nDuring a portion of the debate addressing race, Vice President Kamala Harris invoked the full-page advertisement Trump took out in New York City newspapers in the assault’s wake. She said the ad was “calling for the execution of five young Black and Latino boys.”\n\nIn his response, Trump accused Harris of being “divisive.”\n\n“They come up with things like what she just said going back many, many years when a lot of people, including Mayor Bloomberg, agreed with me on the Central Park Five,” he said. “They admitted, they said they pled guilty. And I said, well, if they pled guilty, they badly hurt the person, killed the person ultimately.’”\n\nThe lawsuit alleges that Trump’s statements contained several falsehoods. As Gothamist and other outlets reported, the Central Park Five never pleaded guilty. They were convicted at trial after providing confessions that ultimately proved to be false. All five men had their convictions vacated in 2002, thanks in part to DNA evidence. Meili was brutalized and left in a coma, but she was not killed.\n\nThe lawsuit says Trump has made public statements that point to his knowledge of the men’s exoneration, including posting on social media about a documentary film on the case.\n\n“Given that Defendant Trump has seen the film, he knew that his statements at the September 10 debate were false, misleading and defamatory,” the filing states.\n\nFollowing the debate, Salaam, a Harlem Democrat who was elected to the City Council last year, confronted Trump as he took questions from the press, according to the lawsuit.\n\n“Ah, that’s good, you’re on my side,” Trump allegedly said.\n\n“No, no, no,” Salaam said, per the lawsuit. “I’m not on your side.”\n\n“Trump made his false and offensive statements with ill will and spite, and with wanton, reckless or willful disregard for their injurious effects on Plaintiffs,” the men’s lawsuit argues.\n\nTheir attorney, Shanin Specter, said in a statement that the men are seeking to again correct the record and clear their names. The lawsuit seeks at least $75,000 in compensatory and punitive damages and the plaintiffs’ out-of-pocket costs.\n\n“This is just another frivolous, Election Interference lawsuit, filed by desperate left-wing activists, in an attempt to distract the American people from Kamala Harris’s dangerously liberal agenda and failing campaign,\" Steven Cheuing, Trump campaign communications director, said in a statement.","summary":"New York City Councilmember Yusef Salaam speaks alongside other members of the exonerated &quot;Central Park Five&quot; group at the Democratic National Convention in Chicago on Aug. 22, 2024.\n\n\n  \n\nThe group of exonerated men, whom Trump once accused of an infamous 1989 crime, say the former president knowingly repeated false information. [ more › ]","url":"https://gothamist.com/news/central-park-five-sue-donald-trump-for-defamation-over-presidential-debate-claim","image":"https://api-prod.gothamist.com/images/347783/fill-1200x800|format-webp|webpquality-85/","video":null,"publish_date":"2024-10-21 23:06:37","author":"Catalina Gonella","authors":["Catalina Gonella"],"language":"en","category":"politics","source_country":"us","sentiment":-0.422},{"id":260572884,"title":"Mail-in ballots have made our election tallying a national embarrassment","text":"Elon Musk can land a rocket booster back at the launch tower seven minutes after it takes off, but swing states can’t count votes in a timely manner. \n\nUnlike recovering a rocket booster, vote-counting is not complicated and requires no advanced engineering. \n\nWe’ve managed to do it expeditiously and accurately through all of our history, yet it is at this moment — when Donald Trump will cast doubt on any result he doesn’t like, and trust in our institutions is low — that we’ve hobbled our own ability to complete this simple task in key swing states.\n\nWe no longer have Election Night; we have Election Days. In 2020, the general election was held on Tuesday, Nov. 3, but most media organizations didn’t call it until Saturday, Nov. 7. \n\nThis kind of delay is a national embarrassment. It creates uncertainty and breeds distrust, and is also completely unnecessary.\n\nThe culprit is early voting, or how some states go about processing — or to be more accurate, not processing — the early vote.\n\nOnly in government is it possible to have people do something well in advance and still have it end up delaying everything, out of easily fixable bureaucratic ineptitude. \n\nConsider Pennsylvania. It embraced no-excuse mail voting in 2019, without making the necessary changes to count these ballots in a timely manner. \n\nIn their wisdom, the Pennsylvania authorities don’t allow election employees to begin processing the early and absentee vote until 7 a.m. on Election Day, ensuring that they can’t cope. (There is something else important happening on Election Day — yes, you guessed it, the administering of an election.)\n\nThere are a lot of steps that go into the so-called pre-canvassing of mail and absentee ballots, from confirming that the outer envelopes are signed and dated, to opening the outer and inner envelopes, to unfolding the ballot itself. \n\nMost states allow this work to happen before Election Day, because that’s rational thing to do. \n\nLawmakers in Pennsylvania have deadlocked along partisan lines over whether, and how, to do the same.\n\nRepublicans have wanted a voter ID requirement as part of a change to the process, while Democrats have opposed that provision. So, the Keystone State will once again conduct its vote-counting in an absurd manner that ill-serves the nation. \n\n(Some Republicans worry that pre-canvassing will allow Democrats to learn how many fraudulent votes they need to produce to win. Pre-canvassing doesn’t involve the actual tabulating of ballots, though, and there is zero evidence that it has abetted widespread, election-determining fraud in other states where it is the norm.)\n\nIt’d be one thing if we didn’t know the results in Alabama or Massachusetts, states that are deep red or blue, on Election Night.\n\nBut with Pennsylvania, as well as Wisconsin and Arizona, likely to have delays, we are talking about the very most sensitive, important states on the map. \n\nAn erstwhile swing state, Florida, provides a model. It has a massive early vote, and yet rapid tabulating.\n\nCounties in the state process early ballots before Election Day. It helps that the state doesn’t allow ballots arriving after 7 p.m. on Election Day to be counted, avoiding the problems of states that, shockingly, permit post-election ballots. \n\nFlorida’s opposite in this, as in so much else, is California.\n\nThe Golden State has made a practice of overwhelming itself with mail-in ballots. It still hadn’t counted a third of its ballots after Election Day in 2020, and kept counting for weeks.\n\nThis year, ballots arriving up to a week after the election will be considered valid. A Democratic assemblyman told the AP that the state doesn’t need to please “a society that wants immediate gratification,” as if there’s something wrong with expecting expeditious, reliable election results.\n\nIt might seem facetious to say that Elon Musk will manage to send a rocket to Mars before states figure out how to eliminate intolerable delays in the vote count, but with Musk hoping to do that a couple of years from now, it’s almost certainly true.\n\nTwitter: @RichLowry","summary":"Elon Musk can land a rocket booster back at the launch tower seven minutes after it takes off, but swing states can’t count votes in a timely manner. ","url":"https://nypost.com/2024/10/21/opinion/mail-in-vote-has-made-our-election-tallying-a-national-shame/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-1zfvpf6gg-1729550890800.jpg?quality=75&strip=all&1729536592&w=1200","video":null,"publish_date":"2024-10-21 23:04:52","author":"Rich Lowry","authors":["Rich Lowry"],"language":"en","category":"politics","source_country":"us","sentiment":-0.183},{"id":260572288,"title":"Writer Olivia Nuzzi and Magazine 'Part Ways' After RFK Jr. Claims","text":"Olivia Nuzzi, a political correspondent for New York Magazine, has now parted ways with the publication after claims surfaced that she had a personal digital relationship with RFK, Jr. while covering the 2024 presidential campaign.Despite an internal review and a law firm investigation clearing Nuzzi of any bias or inaccuracies in her reporting, the magazine announced Monday that it was in the best interest of both parties to move on.\"Nevertheless, the magazine and Nuzzi agreed that the best course forward is to part ways,\" the publication said in a post on its website, which it framed as an update to readers. \"Nuzzi is a uniquely talented writer and we have been proud to publish her work over her nearly eight years as our Washington correspondent. We wish her the best.\"The controversy erupted last month when reports from The New York Times and media newsletter Status named Robert F. Kennedy Jr. as the individual involved with Nuzzi. While she has yet to confirm Kennedy's involvement, he has publicly stated that he met her only once.A spokesperson for Kennedy, who is married, told the Times that he \"only met Olivia Nuzzi once in his life for an interview she requested, which yielded a hit piece.\"Kennedy, 70, ended his independent run for president in August. He has endorsed former president Donald Trump, the Republican nominee, and has been appointed to Trump's transition team should he win November's election.Newsweek has reached out to New York magazine via email for comment.Nuzzi's relationship with the source reportedly began in December 2023, shortly after the publication of her November profile on Kennedy in which she said his campaign had the potential to turn \"the presidential race upside down,\" and ended in August 2024.David Haskell, the editor-in-chief of New York magazine, revealed in a staff memo that the relationship had started after Nuzzi's profile was published. According to Haskell, had the publication known of the relationship earlier, Nuzzi would have been prohibited from covering the campaign.In a statement to Status, Nuzzi expressed regret for not disclosing the relationship sooner, stating,\"During that time, I did not directly report on the subject nor use them as a source,\" she said. \"The relationship was never physical but should have been disclosed to prevent the appearance of a conflict. I deeply regret not doing so immediately and apologize to those I've disappointed, especially my colleagues at New York.\"The split comes after the publication previously placed Nuzzi on leave last month and said the relationship was \"a violation of the magazine's standards around conflicts of interest and disclosures.\"\"She is currently on leave from the magazine, and the magazine is conducting a more thorough third-party review,\" the magazine said last month.Since then, the investigation concluded that Nuzzi's work remained accurate and impartial.This article includes reporting from The Associated Press.","summary":"Writer Olivia Nuzzi and New York Magazine have parted ways after claims she had a personal digital relationship with Robert F. Kennedy Jr.","url":"https://www.newsweek.com/writer-olivia-nuzzi-magazine-part-ways-after-rfk-jr-claims-1972576","image":"https://d.newsweek.com/en/full/2500811/olivia-nuzzi.jpg","video":null,"publish_date":"2024-10-21 23:02:31","author":"Natalie Venegas","authors":["Natalie Venegas"],"language":"en","category":"entertainment","source_country":"us","sentiment":-0.128},{"id":260578562,"title":"UK to lend Ukraine an additional £2.26bn for weapons to fight Russia","text":"Britain is to lend Ukraine an additional £2.26bn and allow Kyiv to spend the money on weapons to fight off the Russian invasion as part of a wider $50bn (£38.5bn) loan programme expected to be confirmed by G7 members later this week.\n\nThe loans will be repaid using interest generated by the $300bn of frozen Russian assets held in the west, with the extra funds promised as the US heads towards a presidential election where support for Ukraine is a divisive issue.\n\nRachel Reeves said: “The profits being made on those assets aren’t being kept for Russia to use in the future. They’re now being used to fund Ukraine.” The chancellor made the announcement alongside the defence secretary, John Healey.\n\nBritain has already committed to donating £3bn a year in military aid to Ukraine. The UK loan would be additional to that and likely to be spent by Kyiv on badly needed munitions, Healey said, once enabling legislation passed through parliament.\n\nEfforts to hand the entire amount of Russian frozen assets to Ukraine foundered amid opposition from the IMF, concerned it would undermine confidence in the financial system, and fears it could be subject to legal challenges from Moscow.\n\n“What we’re not doing is confiscating these assets to fund this loan,” Reeves said. “We’re using the extraordinary profits on the assets, and that’s how we’re confident that we can do this within all the right legal frameworks.”\n\nThe US is expected to contribute $20bn, with other G7 members confirming their share of commitments. Reeves emphasised the UK announcement was timed before this week’s IMF and World Bank annual meetings in Washington DC, a fortnight before the US presidential election. “We hope the other parts of the jigsaw fall into place at the end of this week,” the chancellor said.\n\nDonald Trump, the Republican presidential candidate, has expressed scepticism about continuing future funding for Ukraine, raising questions about Ukraine’s ability to fight the war given the US has so far been Kyiv’s largest donor. Washington has provided $64bn in military aid since Russia launched its full-scale invasion in February 2022.\n\nSome of the $50bn loans may be used to buy weapons made by the US, with diplomats seeing that as a possible alternative if Trump were to halt the flow of donations from US stockpiles. But it would be up to Ukraine to determine what it wanted to use the money for, in discussion with each G7 country providing a loan.\n\nReeves declined to discuss whether next week’s budget, the first under this Labour government, would give a timetable as to when the UK would increase defence spending to 2.5% of GDP from 2.32% at present. “We stand by that commitment, and we’ll set out the details of that as soon as we can,” she said.\n\nThe chancellor is aiming to make £40bn worth of tax rises and spending cuts in the budget. Relations between the Treasury and Ministry of Defence remain cordial, with Healey not one of the ministers who have written to Reeves to complain about the level of cuts being sought by his department.","summary":"Loans will be repaid using interest generated by $300bn of frozen Russian assets held in the west\n\nBritain is to lend Ukraine an additional £2.26bn and allow Kyiv to spend the money on weapons to fight off the Russian invasion as part of a wider $50bn (£38.5bn) loan programme expected to be confirmed by G7 members later this week.\n\nThe loans will be repaid using interest generated by the $300bn of frozen Russian assets held in the west, with the extra funds promised as the US heads towards a presidential election where support for Ukraine is a divisive issue.\n\n Continue reading...","url":"https://www.theguardian.com/politics/2024/oct/22/uk-lend-ukraine-2bn-for-weapons-to-fight-russia","image":"https://i.guim.co.uk/img/media/f5dd16931af3d33066a56407ca4d627ca65fc534/0_237_3921_2353/master/3921.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2024-10-21 23:01:49","author":"Dan Sabbagh","authors":["Dan Sabbagh"],"language":"en","category":"politics","source_country":"us","sentiment":-0.02},{"id":260572888,"title":"Central Park Five sue Donald Trump for jogger case remarks made at presidential debate","text":"He appeared to be confusing guilty pleas with confessions. Also, no victim died.\n\nThe now Exonerated Five, including Salaam, who is now a New York City councilman, have been campaigning for Harris. Some of them spoke at the Democratic National Convention in August, calling out Trump for never apologizing for the newspaper ad.\n\nThey have also joined civil rights leader the Rev. Al Sharpton for a get-out-the-vote bus tour.\n\nPrior defamation suits involving Trump have led to sizable amounts awarded to the plaintiffs. In January, a jury awarded $83.3 million to advice columnist E. Jean Carroll over Trump’s continued social media attacks against her claims he sexually assaulted her in a Manhattan department store in 1996. In May 2023, a jury found Trump liable for sexually abusing her and issued a $5 million judgement.","summary":"The men formerly known as the Central Park Five before they were exonerated filed a defamation lawsuit on Monday against Republican presidential nominee Donald Trump. With Election Day two weeks away, the group accused the former president of making &#8220;false and defamatory statements&#8221; about them during last month&#8217;s presidential debate with Vice President Kamala Harris. [&#8230;]","url":"https://torontosun.com/news/world/central-park-five-sue-donald-trump-for-jogger-case-remarks-made-at-presidential-debate","image":"https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/new-trump-e1728927175509.jpg","video":null,"publish_date":"2024-10-21 23:01:21","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.325},{"id":260573494,"title":"The data behind where Harris, Trump make campaign stops","text":"The data behind where Harris, Trump make campaign stops\n With 15 days until Election Day, where candidates go can be crucial to their chances of winning. CBS News executive director of elections and surveys Anthony Salvanto explains why Vice President Kamala Harris and former President Donald Trump are heading to certain cities in battleground states. Then, Shelby Talcott, political reporter for Semafor, and Hugo Lowell, senior political correspondent for The Guardian, join with analysis.","summary":"With 15 days until Election Day, where candidates go can be crucial to their chances of winning. CBS News executive director of elections and surveys Anthony Salvanto explains why Vice President Kamala Harris and former President Donald Trump are heading to certain cities in battleground states. Then, Shelby Talcott, political reporter for Semafor, and Hugo Lowell, senior political correspondent for The Guardian, join with analysis.","url":"https://www.cbsnews.com/video/data-behind-where-harris-trump-make-campaign-stops/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/21/bb661fcb-f817-4a39-8444-446c950eb95d/thumbnail/1200x630/7a14e2a72da59e8bf7c41f0372a88d03/cbsn-fusion-data-behind-where-harris-trump-make-campaign-stops-thumbnail.jpg?v=b241b87adbbb7f0a227ed35b96d0cefa","video":null,"publish_date":"2024-10-21 23:01:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.389},{"id":260573800,"title":"Central Park Five sue Trump for defamation over debate remarks","text":"The five Black and Hispanic teenagers who were wrongfully convicted for the 1989 rape of a white jogger in New York’s Central Park sued Donald Trump for defamation today over statements he made at last month’s U.S. presidential debate.\n\nKnown widely as the Central Park Five, the defendants spent between five and 13 years in prison before they were cleared in 2002 based on new DNA evidence and the confession of another person.\n\nTrump, the Republican nominee for the White House, falsely said at the Sept. 10 debate with Democrat Vice President Kamala Harris that the Central Park Five had killed a person and pleaded guilty.\n\nThe lawsuit, filed in federal court in Philadelphia by Yusef Salaam, Raymond Santana, Kevin Richardson, Antron Brown and Korey Wise, called Trump’s statements “demonstrably false.” Salaam is now a member of the New York City Council.\n\nA spokesperson for Trump’s campaign today called the case “just another frivolous, election interference lawsuit, filed by desperate left-wing activists.”\n\nA lawyer for the plaintiffs, Shanin Specter, said in a statement that Trump’s remarks “cast them in a harmful false light and intentionally inflicted emotional distress on them.”\n\nSpecter denied any political motive in the lawsuit. “I’m not commenting on politics. We are seeking redress in a court of law,” he said.\n\nThe plaintiffs are seeking unspecified monetary damages for reputational and emotional harms as well as punitive damages.\n\nTrump has drawn criticism before over his statements about the Central Park Five. After the jogger’s assault, he spoke out about the case and took out a full-page ad in several New York newspapers calling for the reinstatement of the death penalty.\n\nTrump in 2019 stood by his prior comments about the Central Park Five, and declined to apologize.\n\nTrump asked a U.S. appeals court in September to reject a $5 million verdict finding him liable for sexually assaulting and defaming the writer E. Jean Carroll.\n\nA different jury in January ordered Trump to pay Carroll $83.3 million for having defamed her and damaging her reputation in June 2019 after she first accused him of rape.","summary":"The five Black and Hispanic teenagers who were wrongfully convicted for the 1989 rape of a white jogger in New York&#8217;s Central Park sued Donald Trump for defamation today over statements he made at last month&#8217;s U.S. presidential debate.","url":"https://www.staradvertiser.com/2024/10/21/breaking-news/central-park-five-sue-trump-for-defamation-over-debate-remarks/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241021_brk_tru03.jpg","video":null,"publish_date":"2024-10-21 23:00:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":-0.223}]}