{"offset":0,"number":50,"available":10575,"news":[{"id":273446614,"title":"Will “They” Let Trump Hold Office?","text":"With elections over, Mr. Trump is set to be sworn into office two weeks later, on Jan. 20–after completing a two-month transition period as president-elect before being inaugurated–while Congress is scheduled to meet on January 6, 2025, to count the Electoral College results.\n\nI don’t know if this info makes sense at this point, as you all know what has just happened, out of the blue. Perhaps you’d rather ask how these elections are even different from preceding ones, as nothing of some special edition except Trump’s charisma worked out: tainting the political persona of Kamala Harris for good (harsh?) and rather reading the Democrats their last rites. This isn’t the first time the US has been through something like this. By all odds, it bore civil wars to economic downturns, internal chaos to foreign challenges, apartheid movements to the capsizing of social injustice—the list goes on. It, however, almost always crafted great manoeuvres to consistently push away the odds, stopped things from being blown out of proportions, and kept all the predicaments at bay while successfully preserving its long history of democracy, federalism, and international cooperation.\n\nBut again, what is this fuss about? Why is there an evident latent hostility brewing in every corner of the US? By looking at the face of a passenger boarding for NYK to a confounded rancher landing at the sheriff’s office in San Bernardino, the general anxiety seems to be stemmed off some reason!\n\nLet’s unwind the mystery, though I’m not sure if it helps. From the horse’s mouth, the United States of America has stepped just into the most perplexed sphere that they falsely thought they did before the 2024 elections unfolded. The political matrix looks a bit more off-key, and so are the Americans, who are hanging in the balance between Shakespearian ‘to be or not to be,’ as all the answers they had been expecting to find out post-elections have evolved into even bigger threatening questions.\n\nWith the Trump-Kamala face-off done and dusted, the emerging concern bodes a brand new series of riots in America, which are expected to start post Trump’s sworn, tout de suite. It is said that the ‘deep state phenomenon,’ which Americans would use as a buzzword, haunts them in their backyard. America’s underground state actors haven’t been expecting ‘this’ to happen, and they don’t want Trump to hold office on Jan. 20th, 2024. The fidgeting stakeholders are throwing fits as none of their ‘legalised efforts’ during elections brought dividends, and they only became a victim of their own setting of a booby trap. This isn’t a usual sighting when the USA’s deep state nexus only finds their entire manuscript being steamrolled by an otherwise egotistical Trump.\n\nHonestly, no credible evidence suggests that the United States of America will see a trouble of this intensity in 2025, but probably this isn’t the time to look for evidence. The Project 2025 is what deep state actors wouldn’t swallow at all!\n\nWhat is it?\n\nAs Donald Trump has stolen the march upon his contenders and secured the presidency in November, his administration is likely to follow the roadmap outlined in Project 2025, a transition plan created by the Heritage Foundation think tank. As per a famous print, the critics are already finding a lot to disagree with in this 900-page plethora of ground plans called ‘project 2025’ and label it as “authoritarian,” “dystopian,” and a “blueprint for destroying American democracy. It’s because it entails a wide range of conservative priorities, including restricting abortion access, rolling back LGBTQ+ rights, abandoning efforts to address climate change and income inequality, and implementing sweeping changes to the federal government workforce.\n\nApparently Trump pretends as if he turns a deaf ear to Project 2025, but this isn’t true. He holds the eye of a hawk, and this, ladies and gentlemen, makes the lifeblood of his entire campaign. The said project has been spearheaded by former Trump administration officials, including Paul Dans and Russell Vought, with more than 100 conservative organisations contributing to the plan, making crucial schemes for its swift execution, laying down exact timelines for each event, and providing alternative procedures for any backlash from the public—as if they care. This goes without saying: with the Republicans regaining control of the White House in January 2025, most of the contributors here (those who worked on the Project 2025 manuscript) would hold significant influence in Washington.\n\nOn the other hand, a clique among the masses is busy enticing ‘bulk-fear,’ gaslighting the voters about their proclivities and choices for voting. Besides, top prints are pushing fiery questions into the pool, i.e., Is America going to survive 2025 without getting its constitutional federal republic ship harmed? Could political disruption and mayhem sabotage American supremacy across the globe? Are the non-state actors successful in stacking the deck in their favour and ready to putting a massive dent in the corporate and socio-economical sectors of America? Why is something looking massively fishy, precisely a sword of Damocles constantly hanging over US democratic institutions, the federal system, and global partnerships? Could 2025 be the last year of the US as a constitutional federal republic? Or that this coming year might put “The End” to the great and formidable existence of the USA as the worlds top power?\n\nWe’d discuss more about Project 2025 in the next part, and I’d highlight the imminent dangers Trump might come across before holding office in January 2025!","url":"https://dailytimes.com.pk/1247854/will-they-let-trump-hold-office/","image":null,"video":null,"publish_date":"2024-12-16 01:19:22","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.189},{"id":273445344,"title":"China eyes negotiations as Trump threatens new tariffs","text":"BEIJING: As Donald Trump steps up his tariff threats against China, Beijing is moving to beat the next US president to the punch with its own restrictions and get Washington to the negotiating table ahead of a full-blown trade war, analysts say.\n\nArmed with the lessons of the last trade war during Trump’s first term, China is seeking to amass bargaining chips to kick off talks with a new US administration on contentious aspects of bilateral ties, including trade and investment, and science and technology. It is also concerned about the harmful effects of additional tariffs on its already fragile economy.\n\nThis week, China launched a probe into US chip giant Nvidia over what it claimed were suspected antitrust violations, which follows its ban on US-bound exports of rare minerals.\n\n“We have to look at this as the opening bid in what will likely ultimately turn into a negotiation with the US rather than just an imposition of tariffs and everyone walks away,” HSBC’s Chief Asia Economist Fred Neumann said.\n\nChina is better prepared to deal with almost any tariffs, short of an “Armageddon announcement” of a 60% tariff on all Chinese goods, said George Magnus, research associate at Oxford University’s China Centre.\n\nThe world’s second-largest economy now globally dominates sectors such as electric vehicles and green energy, and has less need for the Boeing jets and large gasoline-fuelled cars it bought back in 2017, having found substitutes such as Airbus airplanes and its own Comac C919.\n\nBut China is far from self-sufficient.\n\nA new trade war with the world’s biggest economy would still hurt China more, analysts say, as Washington can levy ever-larger import duties on its goods and further rip China from its supply chains.\n\nChina still needs to import strategic materials from the US such as advanced microchips and other high-tech equipment and counts on US consumers to buy its goods, given an increasingly pessimistic global trade outlook and weak domestic consumer demand.\n\nBeijing wants to sit down with Trump before he places more curbs on US high-tech exports and to secure the renewal of the US-China Science and Technology Agreement, said Alicia Garcia-Herrero, chief economist for the Asia Pacific at Natixis.\n\nThe agreement, which enables scientific collaboration between the two countries, lapsed in August and negotiations over its renewal are unlikely to be completed before Trump’s Jan. 20 inauguration.\n\nWhile China’s Huawei has heavily invested in its advanced chip-making capabilities, their commercial viability remains unclear, she added, incentivising China’s negotiators to sit down with their US counterparts to strike a deal ensuring a steady supply of American-made chips.\n\nART OF THE DEAL Beijing took two years before it agreed to buy an extra $200 billion in American goods and services, per the terms of the “Phase One” agreement which ended the first trade war.\n\nThis time, China has new carrots to dangle, such as increasing purchases of oil and liquefied natural gas, as the US is currently pumping out more than it can consume.\n\n“Trump bragged on the campaign trail: ‘Drill baby, drill,’ so (he) will need the demand support,” said Bo Zhengyuan, a Shanghai-based partner at consultancy Plenum.\n\nGiven the increasing restrictions on the export of chips, agricultural goods, commodities and energy are among the items the US can still sell to China, Bo said.\n\nChina’s commerce ministry said it was open to engaging and communicating with the economic and trade teams of the Trump administration, when asked for comment.\n\nBut Beijing also has sticks to beat Washington with, if the US side feels China’s failure to meet its previous purchase commitments means it will gain more from tariffs than talks.\n\nUS firms are already feeling the squeeze, said Michael Hart, president of the American Chamber of Commerce in China.\n\n“US companies and other foreign companies have really been concerned about whether they actually have access to this market,” Hart said. “Can we even sell into China anymore? Is there an outright ban on us?”\n\nBusiness sentiment among US firms in China is at its lowest since 1999, according to a September survey by the American Chamber’s Shanghai chapter.","summary":"BEIJING: As Donald Trump steps up his tariff threats against China, Beijing is moving to beat the next US president to the punch with its own restrictions and get Washington to the negotiating table ahead of a full-blown trade war, analysts say.\n\n\n\nArmed with the lessons of the last trade war during Trump’s first term, China is seeking to amass bargaining chips to kick off talks with a new US administration on contentious aspects of bilateral ties, including trade and investment, and science and technology. It is also concerned about the harmful effects of additional tariffs on its already fragile economy.\n\n\n\nThis week, China launched a probe into US chip giant Nvidia over what it claimed were suspected antitrust violations, which follows its ban on US-bound exports of rare minerals.\n\n\n\n“We have to look at this as the opening bid in what will likely ultimately turn into a negotiation with the US rather than just an imposition of tariffs and everyone walks away,” HSBC’s Chief Asia Economist Fred Neumann said.\n","url":"https://www.brecorder.com/news/40337716/china-eyes-negotiations-as-trump-threatens-new-tariffs","image":"https://i.brecorder.com/large/2024/12/675f404cf0ad7.jpg","video":null,"publish_date":"2024-12-16 01:08:59","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.133},{"id":273445330,"title":"ABC News settles $15m defamation suit with Trump","text":"WASHINGTON: ABC News will pay a $15 million settlement payment to resolve a defamation lawsuit brought by President-elect Donald Trump, according to court documents filed Saturday.\n\nThe lawsuit stemmed from on-air comments made by top anchor George Stephanopoulos, who said Trump was found “liable for rape” during an interview with US Representative Nancy Mace that aired in March. The terms of the settlement require ABC News to make a $15 million donation to a fund dedicated to “a presidential foundation and museum” for Trump. \n\nThe news organization and Stephanopoulos will also issue public apologies saying they “regret statements” made about Trump during the aforementioned interview, and the broadcaster will pay an addition $1 million in attorney fees.\n\nThe case was settled one day after Judge Lisette M. Reid requested depositions from both Trump and Stephanopoulos.","summary":"WASHINGTON: ABC News will pay a $15 million settlement payment to resolve a defamation lawsuit brought by President-elect Donald Trump, according to court documents filed Saturday.\n\n\n\nThe lawsuit stemmed from on-air comments made by top anchor George Stephanopoulos, who said Trump was found “liable for rape” during an interview with US Representative Nancy Mace that aired in March. The terms of the settlement require ABC News to make a $15 million donation to a fund dedicated to “a presidential foundation and museum” for Trump. \n\n\n\nThe news organization and Stephanopoulos will also issue public apologies saying they “regret statements” made about Trump during the aforementioned interview, and the broadcaster will pay an addition $1 million in attorney fees.\n\n\n\nThe case was settled one day after Judge Lisette M. Reid requested depositions from both Trump and Stephanopoulos.","url":"https://www.brecorder.com/news/40337757/abc-news-settles-15m-defamation-suit-with-trump","image":"https://i.brecorder.com/large/2024/12/675f6fab17ace.jpg","video":null,"publish_date":"2024-12-16 01:08:59","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.451},{"id":273444960,"title":"Predictions for Trump&#x27;s new term","text":"Now much of the US election dust has settled, let’s examine both the unpleasant fallout and the expected improvements. At the beginning of the year, there was a time when the world of US politics was ill-defined and confused. Then it was evening and then it was morning, and a new dawn broke. In the succeeding days, President-elect Donald Trump spoke and brought light into the world. He is creating a cabinet of men and women with a clear instruction not to deviate from his direction. That is the plan for the next four years.Just as in biblical times, so in our days greed and jealousy have taken over human conduct and are pervading every facet of life. Such is the situation that Trump and his administration are inheriting today.While the Democratic hierarchy are licking their wounds and beginning to apportion blame for the loss of what they believed should have been an inevitable triumph for Kamala Harris, the fallout among their supporters is reminiscent of children throwing their toys out of the cot after not getting what they want. Read More... There is an ingrained hatred that is bordering on hysteria, particularly by fanatic left-wing extremists, of any action that Trump proposes to take. They are spraying vitriol into the faces of the voters by their insistence that all pending legal cases against Trump be pursued to prevent him from taking the presidential oath on January 20.Yehuda Kaploun and Donald Trump listen to Miriam Adelson speak at a Trump campaign event. (credit: Courtesy of Yehuda Kaploun)The Democratic hardliners will not accept that their traditional constituency has turned their backs on having an extreme green policy forced on them. They no longer appreciate being told on what type of stove they should cook their Christmas turkey.On the other hand, the Trump camp is celebrating an unprecedented victory. The Republicans did not only win the presidency, but while for the first time in many years garnering most of the popular vote, they also gained a majority in the US Senate and retained their majority in the House of Representatives, a historic achievement.The Trump administration Another cause of contention is the Democrats’ misunderstood interpretation of Trump’s policy on abortion, which is far from a blanket prohibition as the Democrats claim. Much of that is driven by Democratic women who are demanding free choice, which means their choice and no other, with abortion rights unlimited to the end of the trimester. That’s debasing womanhood, in my humble opinion.Such is some of the fallout that would have been embraced by a Democratic administration. Harris’s spending strategy was directed toward the crowd of the wine glass, while Trump concentrated on the working class. Although Harris spent 1.5 billion dollars in 15 weeks, large amounts of it on celebrity-studded events, she could not win even one of the seven swing states.During Trump’s last term as the 45th president of the United States, from 2017 to 2021, his foreign policy was most advantageous for Israel. He recognized Jerusalem as the capital of the State of Israel, relocated the US Embassy to Jerusalem, and designated the Golan as part of sovereign Israel. But that was between four and eight years ago.Trump recently threatened “all hell to pay in the Middle East” if the hostages Hamas still holds are not released by his inauguration.Although Trump says that he speaks the language of the Middle East and is determined to stop the war with Israel’s belligerent neighbors within weeks of moving into the Oval Office, he will find that it’s a tougher world today.Leaders of sovereign governments must now look to the opinions of the International Criminal Court before making decisions, lest they face ICC arrest warrants.It now remains to be seen how resolute Trump, his vice president JD Vance, and his team will be as they face increasing aggression from the Iranian terror regime.At this stage, we can only hope that the important promises that the incoming president repeatedly made during his election campaign have been well thought through and do not turn out to have been campaign rhetoric.Last but not least, there is not much one can give a man who cannot read anymore for his 101st birthday. All I want is to welcome home the remaining 100 hostages! ■Walter Bingham, who turns 101 on January 5, 2025, holds Guinness World Records as the world’s oldest working journalist and oldest active radio host.","url":"https://www.jpost.com/opinion/article-832973","image":"https://images.jpost.com/image/upload/q_auto/c_fill,g_faces:center,h_537,w_822/636966","video":null,"publish_date":"2024-12-16 01:08:22","author":"Walter Bingham","authors":["Walter Bingham"],"language":"en","source_country":"il","sentiment":-0.206},{"id":273444726,"title":"Dailytelegraph.com.au","text":"Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n\n \n \n \n \n \n \n Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n \n \n \n $5/WEEK\n \n \n \n \n \n \n\n \n\n \n \n \n $5/WEEK\n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.dailytelegraph.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n Lock in & save\n \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n News in video including the 5pm Bulletin on DTTV via the app \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.dailytelegraph.com.au/subscriptionterms for full details.","url":"https://www.dailytelegraph.com.au/business/controlling-the-country-the-music-and-the-dinner-menu-an-upclose-view-of-donald-trump-at-maralago/news-story/ffd193af3e4f78aeed3708bc69ed6e53","image":"https://content.api.news/v3/images/bin/e79d8fe8ade81c86c3a055e600acfaf4","video":null,"publish_date":"2024-12-16 01:02:22","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.35},{"id":273444672,"title":"Dailytelegraph.com.au","text":"Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n\n \n \n \n \n \n \n Full Digital Access \n 12 MONTH PLAN* \n \n Features\n \n \n \n \n $5/WEEK\n \n \n \n \n \n \n\n \n\n \n \n \n $5/WEEK\n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n \n \n for 12 months $20 charged every 4 weeks (min. cost $260). Then $20 charged every 4 weeks.* \n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.dailytelegraph.com.au/subscriptionterms for full details. \n \n \n \n \n \n \n \n \n\n Lock in & save\n \n Unlimited articles on web & app \n Subscriber-exclusive news emails \n Enjoy games & puzzles \n A digital version of Today’s Paper \n News in video including the 5pm Bulletin on DTTV via the app \n \n\n *Read the fine print\n \n \n \n THINGS YOU NEED TO KNOW\n \n Full Digital Access 12 Month Plan costs $260 (min. cost) for the first 12 months, charged as $20 every 4 weeks. This automatically renews after the first 12 months to be charged as $20 (min. cost) every 4 weeks. Renewals occur unless cancelled as per full Terms and Conditions. No cancellations during the first 12 months. Each payment, once made, is non-refundable, subject to law. Not in conjunction with any other offer. Prices after the first 12 months may be varied as per full Terms and Conditions. See www.dailytelegraph.com.au/subscriptionterms for full details.","url":"https://www.dailytelegraph.com.au/business/controlling-the-country-the-music-and-the-dinner-menu-an-upclose-view-of-donald-trump-at-maralago/news-story/ffd193af3e4f78aeed3708bc69ed6e53?expand_comments=true","image":"https://content.api.news/v3/images/bin/e79d8fe8ade81c86c3a055e600acfaf4","video":null,"publish_date":"2024-12-16 01:02:22","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.35},{"id":273444184,"title":"Bitcoin climbs to $US105,000 on strategic reserve hopes","text":"Bitcoin has surged to a record high above $US105,000 in early Asian trade, boosted by comments from president-elect Donald Trump that suggested he plans to create a US bitcoin strategic reserve similar to its strategic oil reserve. Bitcoin hit a high of $US105,142 ($A165,390) and last traded at $US104,609. The price rose on news reports over the weekend that Trump would go ahead with a bitcoin strategic reserve fund, according to Tony Sycamore, an analyst at IG. \"We&apos;re in blue sky territory here,\" Sycamore said on Monday. \"The next figure the market will be looking for is $110,000. The pullback that a lot of people were waiting for just didn&apos;t happen, because now we&apos;ve got this news.\" Bitcoin has surged more than 50 per cent since the November 5 election that saw Trump elected along with many other pro-crypto candidates. \"We&apos;re gonna do something great with crypto because we don&apos;t want China or anybody else - not just China but others are embracing it - and we want to be the head,\" Trump told CNBC late last week. When asked if he plans to build a crypto reserve similar to oil reserves, Trump said: \"Yeah, I think so.\" The cryptocurrency industry spent more than $US119 million backing pro-crypto US congressional candidates, hoping to boost those who would pass crypto-friendly bills to promote digital assets. Trump this month named a White House czar for artificial intelligence and cryptocurrencies, former PayPal executive David Sacks, a close friend of Trump adviser and megadonor Elon Musk. Australian Associated Press","url":"https://www.goulburnpost.com.au/story/8847822/bitcoin-climbs-to-us105000-on-strategic-reserve-hopes/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/5534f1d1-2c65-4644-ada2-5f506a7b5e8d.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-12-16 01:01:22","author":null,"language":"en","source_country":"au","sentiment":-0.176},{"id":273444138,"title":"The Trump threat hanging over the Fed chief","text":"When the US Federal Reserve Board’s Open Market meets for the last time this year it will be business as usual, but with a twitchy eye towards next year and Donald Trump’s controversial economic policies.\n\nThe meeting in Washington on Tuesday and Wednesday is expected to result in the Fed’s third rate cut in a cutting cycle that started in September. Futures markets have priced in a 98 per cent probability of a 25 basis point cut.\n\nThat’s despite recent inflation data showing that the US inflation rate has stalled, indeed has crept up marginally, and a jobs market that, while cooling, hasn’t cooled as much as the Fed had anticipated.\n\nRecent comments from the Fed’s chair, Jerome Powell, and other Fed governors have reflected a somewhat more conservative tone than was the case when the cycle began, with Powell saying the strength of US growth meant the central bank could afford to be a little more cautious as it tries to identify the neutral interest rate that neither stimulates nor suppresses growth.","summary":"Donald Trump’s controversial policies could put his old foe Jerome Powell in a very uncomfortable position.","url":"https://www.theage.com.au/business/the-economy/the-trump-threat-hanging-over-the-fed-chief-20241216-p5kylb.html","image":"https://static.ffx.io/images/$zoom_0.9184537037037037%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_221%2C$y_133/t_crop_custom/q_86%2Cf_auto/a26a10a6ffdec5dc6c3c3d969609e437f69c7cd4","video":null,"publish_date":"2024-12-16 00:58:54","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.463},{"id":273444388,"title":"The Trump threat hanging over the Fed chief","text":"When the US Federal Reserve Board’s Open Market meets for the last time this year it will be business as usual, but with a twitchy eye towards next year and Donald Trump’s controversial economic policies.\n\nThe meeting in Washington on Tuesday and Wednesday is expected to result in the Fed’s third rate cut in a cutting cycle that started in September. Futures markets have priced in a 98 per cent probability of a 25 basis point cut.\n\nThat’s despite recent inflation data showing that the US inflation rate has stalled, indeed has crept up marginally, and a jobs market that, while cooling, hasn’t cooled as much as the Fed had anticipated.\n\nRecent comments from the Fed’s chair, Jerome Powell, and other Fed governors have reflected a somewhat more conservative tone than was the case when the cycle began, with Powell saying the strength of US growth meant the central bank could afford to be a little more cautious as it tries to identify the neutral interest rate that neither stimulates nor suppresses growth.","summary":"Donald Trump’s controversial policies could put his old foe Jerome Powell in a very uncomfortable position.","url":"https://www.brisbanetimes.com.au/business/the-economy/the-trump-threat-hanging-over-the-fed-chief-20241216-p5kylb.html","image":"https://static.ffx.io/images/$zoom_0.9184537037037037%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_221%2C$y_133/t_crop_custom/q_86%2Cf_auto/a26a10a6ffdec5dc6c3c3d969609e437f69c7cd4","video":null,"publish_date":"2024-12-16 00:58:54","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.463},{"id":273444372,"title":"The Trump threat hanging over the Fed chief","text":"When the US Federal Reserve Board’s Open Market meets for the last time this year it will be business as usual, but with a twitchy eye towards next year and Donald Trump’s controversial economic policies.\n\nThe meeting in Washington on Tuesday and Wednesday is expected to result in the Fed’s third rate cut in a cutting cycle that started in September. Futures markets have priced in a 98 per cent probability of a 25 basis point cut.\n\nThat’s despite recent inflation data showing that the US inflation rate has stalled, indeed has crept up marginally, and a jobs market that, while cooling, hasn’t cooled as much as the Fed had anticipated.\n\nRecent comments from the Fed’s chair, Jerome Powell, and other Fed governors have reflected a somewhat more conservative tone than was the case when the cycle began, with Powell saying the strength of US growth meant the central bank could afford to be a little more cautious as it tries to identify the neutral interest rate that neither stimulates nor suppresses growth.","summary":"Donald Trump’s controversial policies could put his old foe Jerome Powell in a very uncomfortable position.","url":"https://www.smh.com.au/business/the-economy/the-trump-threat-hanging-over-the-fed-chief-20241216-p5kylb.html","image":"https://static.ffx.io/images/$zoom_0.9184537037037037%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_221%2C$y_133/t_crop_custom/q_86%2Cf_auto/a26a10a6ffdec5dc6c3c3d969609e437f69c7cd4","video":null,"publish_date":"2024-12-16 00:58:54","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.463},{"id":273443948,"title":"Trump nominees should ‘steer clear’ of undermining polio vaccine, McConnell says","text":"Senate Republican leader Mitch McConnell, who had polio as a child, says any of President-elect Donald Trump’s nominees seeking Senate confirmation should “steer clear” of efforts to discredit the polio vaccine.\n\n“Efforts to undermine public confidence in proven cures are not just uninformed — they’re dangerous,” McConnell said in a statement Friday. “Anyone seeking the Senate’s consent to serve in the incoming Administration would do well to steer clear of even the appearance of association with such efforts.”\n\nThe 82-year-old lawmaker’s statement appeared to be directed at Trump’s pick for health secretary, Robert F. Kennedy Jr., after a report that one of his advisers filed a petition to revoke approval for the polio vaccine in 2022. That vaccine is widely considered to have halted the disease in most parts of the world.\n\nMcConnell’s words were a sign that Kennedy, who has long advanced the debunked idea that vaccines cause autism, could face some resistance in the soon-to-be GOP-controlled Senate.\n\n“Mr. Kennedy believes the Polio Vaccine should be available to the public and thoroughly and properly studied,” said Katie Miller, the transition spokeswoman for Kennedy, in response to questions.\n\nThe New York Times reported that the petition was filed by a lawyer now helping Kennedy select candidates for federal health positions in the incoming administration.\n\nAny individual or company can file a petition with the Food and Drug Administration, which typically fields hundreds of requests at any time relating to various food, drug and medical issues. Most petitions are denied, but the FDA is required to respond to each one in writing.\n\nVaccines have been proven to be safe and effective in laboratory testing and in real-world use in hundreds of millions of people over decades — they are considered among the most effective public health measures in history.\n\nMcConnell contracted polio at 2 years old but survived because of “the miraculous combination of modern medicine and a mother’s love,” according to the statement. He praised the “saving power” of the polio vaccine for the “millions who came after me.”\n\nSenate Majority Leader Chuck Schumer, D-N.Y., said in a post on X that it was “outrageous and dangerous for people in the Trump Transition to try and get rid of the polio vaccine that has virtually eradicated polio in America and saved millions of lives.\n\nHe said Kennedy should clarify his own position on it.\n\nTrump announced last month his selection of Kennedy, saying Kennedy would work to protect Americans “from harmful chemicals, pollutants, pesticides, pharmaceutical products, and food additives.”\n\nBut that pick was met with alarm from scientists and public health officials, who fear Kennedy would unwind lifesaving public health initiatives such as vaccines.\n\nKennedy has pushed other conspiracy theories regarding vaccines, such as that COVID-19 could have been “ethnically targeted” to spare Ashkenazi Jews and Chinese people, comments he later said were taken out of context. He has repeatedly brought up the Holocaust when discussing vaccines and public health mandates.\n\nKennedy said he plans to remake the Department of Health and Human Services, an agency with sprawling reach and a $1.3 trillion budget, if he is approved. He has suggested the FDA is beholden to “big pharma,” and his anti-vaccine nonprofit has called on it to stop using COVID-19 vaccines.\n\nDuring the COVID-19 epidemic, his nonprofit group, Children’s Health Defense, petitioned the FDA to halt the use of all COVID vaccines. The group has alleged that the FDA is beholden to “big pharma” because it receives much of its budget from industry fees and some employees who have departed the agency have gone on to work for drugmakers.\n\nChildren’s Health Defense currently has a lawsuit pending against a number of news organizations, among them The Associated Press, accusing them of violating antitrust laws by taking action to identify misinformation, including about COVID-19 and COVID-19 vaccines. Kennedy took leave from the group when he announced his run for president but is listed as one of its attorneys in the lawsuit.","url":"https://www.vicnews.com/national-news/trump-nominees-should-steer-clear-of-undermining-polio-vaccine-mcconnell-says-7709810","image":"https://www.bpmcdn.com/f/files/shared/feeds/gps/2024/12/web1_20241212121252-20241212121252-675b2336cbeac28fd4bbccefjpeg.jpg","video":null,"publish_date":"2024-12-16 00:58:22","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.137},{"id":273441442,"title":"EXCLUSIVE: New York City Mayor denies seeking pardon from Trump","text":"IE 11 is not supported. For an optimal experience visit our site on another browser.\n\nEXCLUSIVE: New York City Mayor denies seeking pardon from TrumpDec. 16, 202409:50Progressive trailblazer Rep. Barbara Lee bids farewell to Congress: 'Public service is in my DNA'09:23Now PlayingEXCLUSIVE: New York City Mayor denies seeking pardon from Trump09:50UP NEXTWhy Trump is backtracking on his pledge to lower grocery prices08:18Trump's army of loyalists has botched the party of Lincoln: Jonathan Capehart04:53'Vengeance tour': Panel reacts to Trump's interview with NBC's Kristen Welker06:57First Korean-American senator reacts to Trump's vow to end birthright citizenship06:58MSNBC's Jonathan Capehart unveils new memoir 'Yet Here I Am'02:10Rep.-elect Adam Gray's House win spells trouble for GOP's slim majority04:31Clyburn urges Biden to pardon Trump 'so we can clean the slate'08:42Kash Patel could be Trump's most dangerous pick yet10:21Gov. Green is also a doctor. Here's why he thinks RFK, Jr. 'could doom us'07:58Bill Clinton's advice to Democrats: 'We haven't connected enough'06:17Trump's Homeland Security secretary unveils terrifying deportation plans04:39Bill Clinton: Trump's Cabinet is about loyalty, 'no matter who gets hurt'08:08\"MAGA Santa\": Ameshia Cross on how Trump plans to deliver on his promises of retribution05:40Trump's national security picks spark panic at the Pentagon09:35Former Health Secretary on RFK Jr. leading the agency: 'Absolutely terrifying'04:30Feeling lost after the election? Religious leaders on finding hope05:53'We're going to protect everyone': House Dems on standing up to Trump08:24Trump will get away with it. Merrick Garland is partly to blame: Ankush Khardori05:50Jonathan CapehartEXCLUSIVE: New York City Mayor denies seeking pardon from Trump09:50Share this -CopiedNew York City Mayor Eric Adams has signaled support for Donald Trump's hardline immigration policies, including modifying his city's sanctuary law. In an exclusive interview with MSNBC's Jonathan Capehart, Adams responds to allegations that he's cozying up to Trump for clemency from federal corruption charges.Dec. 16, 2024Progressive trailblazer Rep. Barbara Lee bids farewell to Congress: 'Public service is in my DNA'09:23Now PlayingEXCLUSIVE: New York City Mayor denies seeking pardon from Trump09:50UP NEXTWhy Trump is backtracking on his pledge to lower grocery prices08:18Trump's army of loyalists has botched the party of Lincoln: Jonathan Capehart04:53'Vengeance tour': Panel reacts to Trump's interview with NBC's Kristen Welker06:57First Korean-American senator reacts to Trump's vow to end birthright citizenship06:58MSNBC HIGHLIGHTS (BEST OF MSNBC)Play AllAlex Wagner TonightTrump’s attempt to rewrite history of January 6 instead adds new chapter of corruptionAlex Wagner TonightTrump moves to steamroll Senate Republicans in bid to build 'disruptive' administrationAll InTrump sends Kimberly Guilfoyle to Greece amid Don Jr. breakup rumorsAll InMcConnell decries ‘dangerous’ polio vaccine skeptics amid RFK Jr. reportAll InHayes: Trump and his billionaire friends have ‘amnesia’ about this issueThe Beat with AriSee Zuckerberg and AI’s Altman eat their words on TrumpPlay All","url":"https://www.msnbc.com/jonathan-capehart/watch/exclusive-new-york-city-mayor-denies-seeking-pardon-from-trump-227124293906","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/mpx/2704722219/2024_12/1734307460544_n_capehart_sun_ericadams_241215_1920x1080-hpgzhb.jpg","video":null,"publish_date":"2024-12-16 00:43:22","author":"Msnbc","authors":["Msnbc"],"language":"en","category":"politics","source_country":"us","sentiment":-0.196},{"id":273441352,"title":"Comedian faces backlash for cancer joke during Royal Variety Performance in front of King Charles","text":"During the glittering event, attendees of The Royal Variety Performance were introduced to the comedy stylings of Matt Forde.\n\nHe took to the stage on crutches and immediately tackled the subject at hand. He started: \"Thank you. Before I start, I'd like to explain why I need a walking stick.\"\n\nHe then delved into the cause behind his need for support, revealing: \"Just over a year ago, I had terrible nerve pain in my left leg, I went to get an MRI scan thinking the pain was caused by a slipped or a swollen disc. I got the results of that scan back, I was diagnosed with cancer.\"\n\nMatt went on to share that upon receiving his diagnosis, the uncertainty around his longevity weighed heavy on him. He continued: \"I'm telling you this, mainly just to get you on side! Because I'm going to impersonate a few politicians now and if I insult one you like, just remember, I've been very brave.\"\n\nBefore launching into his array of political impressions, the comedian gave the crowd some good news about his wellbeing. He updated: \"I'm now cancer-free and alive! I'm so glad I lived to see the wonderful, global, political events of the last few months.\", reports the Mirror.\n\nHis routine included impersonations of political figures such as Keir Starmer and Donald Trump, but not all ITV viewers were comfortable with his opening remarks regarding cancer, especially since King Charles, who was present, received a cancer diagnosis earlier this year and has undergone treatment. \n\nA viewer expressed their disapproval, remarking: \"Is a joke about cancer really the way to start a comedy routine? It certainly did not get me on side.\" One individual remarked: \"As a cancer survivor, I'm amazed Matt Forde thought it appropriate to use his diagnosis/treatment as the basis of jokes, given the year our Royal Family has had with this disease. Surely someone should have pulled that in the dress rehearsal? Tasteless.\"\n\nAnother queried: \"Did he have to mention his cancer diagnosis, as a cancer survivor myself good luck to him, but did he really have to mention it in front of the King? \" One was taken aback: \"The cancer joke is very ill timed after what the king has been through recently.\"\n\nHowever, there were some viewers who enjoyed watching Matt's performance. One person said: \"Funny guy Matt Forde.\" Another added: \"Matt Ford was funny.\"\n\nThe evening was presided over by hosts Amanda Holden and Alan Carr, who expressed their anticipation ahead of the annual event. Prior to the show, Alan Carr stated: \"I am completely thrilled to be asked back to host the Royal Variety Performance so soon, what a compliment and an honour! \".\n\n\"To be able to host this magical evening with my best friend and tv wife Amanda Holden is the icing on the cake for me. If we have half as much fun as we did three years ago, well we are all in for a real treat.\"","url":"https://www.chroniclelive.co.uk/news/tv/comedian-faces-backlash-cancer-joke-30593587","image":"https://i2-prod.chroniclelive.co.uk/news/tv/article30593586.ece/ALTERNATES/s1200/0_the_royal_variety_performance_2024_30.jpg","video":null,"publish_date":"2024-12-16 00:43:23","author":"Tianna Corbin","authors":["Tianna Corbin"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.124},{"id":273440996,"title":"Drones mystery: Andrew Tate demands answers from Musk - 'Explain ..., Elon'","text":"Amid growing speculation about mysterious drones flying over New Jersey and the East Coast that have captured national attention, controversial British-American influencer Andrew Tate took to Twitter to demand answers from SpaceX and Tesla CEO Elon Musk.Tate’s tweet, now viral, read: “Hello @elonmusk. You have SpaceX and speak to the most important people in the world. Please explain the drones. Thanks, The World.” Musk has yet to respond.— Cobratate (@Cobratate) Elon Musk on modern warfare: Fighter jets obsolete, drones are the futureNotably, billionaire entrepreneur Musk, recently selected by US President-elect Donald Trump to spearhead efforts to reduce federal government spending, made waves with his bold critique of modern fighter jets and his endorsement of drone warfare.“Manned fighter jets are obsolete in the age of drones anyway. Will just get pilots killed,” Musk wrote on his social media platform, X, where he also leads companies like SpaceX and Tesla.In a series of posts, Musk specifically targeted the F-35 Lightning II, calling it a “shit design” and pointing to consistent manufacturing and performance issues outlined in declassified Pentagon testing reports. He argued that drone swarms controlled by AI hive minds represent the future of air combat.“Meanwhile, some idiots are still building manned fighter jets like the F-35,” Musk commented in a post on November 24, alongside a video showing hundreds of drones flying in coordinated formation. In a follow-up post, Musk elaborated, “The F-35 design was broken at the requirements level, because it was required to be too many things to too many people. This made it an expensive & complex jack of all trades, master of none. Success was never in the set of possible outcomes.”His remarks had real-world consequences, as Lockheed Martin, the F-35's primary contractor, saw its stock drop by over 3% following Musk’s comments.Notably, Musk’s statements align with his growing advocacy for unmanned combat systems, which he argues will revolutionize warfare while saving lives. The tech magnate has been vocal about the inefficiency of manned aircraft and has repeatedly emphasized the inevitability of AI-controlled drones dominating the battlefield.The Pentagon has yet to respond to Musk's remarks, but his influence on the defense industry and public opinion is undeniable.Drone sightings create public alarmResidents in southern and northern New Jersey have described seeing brightly lit objects moving swiftly and emitting a humming noise. In Elsinboro, Susan and Lorelai Woodruff reported nightly visits from these objects since late November.\"I feel like our privacy is invaded,\" said Lorelai, 52. Portrait photographer Jenna Keen, also from Elsinboro, started a Facebook group to track the sightings, which gained over 600 members within hours.For many, the unexplained drones have disrupted daily life. Mendham resident Emily Ferguson shared that her children have started closing blinds out of fear. “The kids are asking, ‘What’s going on?’ and I don’t have answers,” she said.Others, like Michael Ash of Westfield, have observed multiple objects within minutes. “This is such a widespread phenomenon; it’s impossible to ignore,” Ash stated.Authorities, lawmakers address growing concernsHomeland Security Secretary Alejandro Mayorkas sought to reassure the public, stating, \"Some of those drone sightings are, in fact, drones. Some are manned aircraft mistaken for drones. Right now, we are not aware of any malicious activity.\"Still, lawmakers on both sides of the aisle have criticized federal agencies for their lack of transparency. Democratic Senator Chuck Schumer has called for immediate deployment of drone-detection systems in New York and New Jersey, emphasizing, “We need more tools to address this issue.”Meanwhile, Governor Kathy Hochul announced that New York has begun receiving drone-detection technology but urged Congress to pass legislation granting local law enforcement greater authority to address drone threats.Former President Donald Trump weighed in, calling for immediate action: “Let the public know, and now. Otherwise, shoot them down!!!”Public remains skepticalDespite reassurances, residents remain uneasy. “It’s unnerving to walk out your door and see this,” said Kieran Kelly, a Morristown technology consultant. Ferguson echoed the frustration: “Officials are trying to gaslight us, acting like we’re conspiracy theorists.”With theories ranging from extraterrestrial activity to military operations, social media remains flooded with videos and debates. Andrew Tate’s public plea to Musk has added another layer of intrigue to the growing mystery.For now, the origins of these drones remain unclear, leaving East Coast residents to wonder: What’s next in the skies above?","url":"https://timesofindia.indiatimes.com/world/us/drones-mystery-andrew-tate-demands-answers-from-musk-explain-elon/articleshow/116349237.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-116349368/116349368.jpg","video":null,"publish_date":"2024-12-16 00:42:22","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","source_country":"in","sentiment":0.241},{"id":273441282,"title":"Goodbye for Now, RedStaters","text":"Today will be my last day writing for RedState. After nearly five years of covering the news, expressing my thoughts on American politics, and chopping it up with many of you in the comments section, it has come time for me to take my career in a different direction.\n\nIt was about this time in 2019 when Streiff reached out to me and asked if I’d be interested in becoming a contributor. My answer was quick: Heck yes! Now, I will be embarking on a new adventure.\n\nBut I will not be going far; I will be transitioning, not to the opposite gender, but to a News Editor position at Townhall.com. I could not be more excited. But it is bittersweet as I will greatly miss being a part of this motley assortment of individuals who want the government to get off our lawns.\n\nFrom the moment I was blessed with the honor of joining RedState, I knew I had found a platform where I could speak boldly and honestly without compromise. That’s exactly what I have done over these five short years.\n\nNone of this would have been possible without awesome folks like Jennifer Van Laar, Streiff, Kira Davis, and plenty of others who believed in me enough to give me a place on one of the most powerful platforms in conservative politics.\n\nI am eternally grateful to each of these individuals for their mentorship, advice, and support. I am also grateful to you, dear readers, for reading and engaging with my work. You are the reason any of us can do what we love while pushing our country further toward liberty.\n\nTo put it simply, I would not be where I am without you, and I will never forget it.\n\nOver the years, I have honed my craft while further evolving in my ideology. I went from mainly covering national issues and the culture war to also focusing on areas of government overreach at the local and state levels.\n\nI recently covered the story of Jennifer Mayo, a Texas farmer who could be facing up to 20 years in prison simply for bringing chicken eggs from Vietnam into the United States. I have written about multiple instances of Georgia’s child protective services ripping children away from their parents under false allegations of abuse. I have also extensively covered the case of Dexter Taylor, a New York native who is currently serving a ten-year sentence for manufacturing his own firearms.\n\nThese stories, as well as many others, show just how important it is for Americans to focus on the stories of everyday folks who are railroaded by governments that are supposed to protect their rights, not violate them. What happened to President-elect Donald Trump happens every single day to regular people who typically do not have the resources necessary to fight back. This is why I believe it is so important to tell their stories.\n\nRedState’s audience has been instrumental in helping me highlight these stories and even raise support for those who have been affected by government overreach and corruption. This community has helped to support this platform when it comes to meaningful and vital discussions about liberty and truth, which is why this is such a bittersweet moment for me.\n\nHowever, I am still blessed to have contributed in small part to this powerhouse of a news site, and I am very much looking forward to what all of us in the Townhall family can accomplish together.\n\nThis community has been more than an audience; it has been a source of inspiration in my journey. As I transition to my new role at Townhall, I will carry with me the lessons, friendships, and memories created here at RedState, and I will miss you dearly. But I will still chime in from time to time when it is possible, so this won’t be the last you will hear from me.\n\nMy mission remains the same: To champion liberty, truth, and principled dialogue at a moment when all of these things are sorely needed in this great country of ours.\n\nTo my readers, thank you so much for challenging, encouraging, and reminding me why each of us does this work. I urge you to continue questioning narratives, remaining steadfast in your convictions, and advocating for liberty in your own communities.\n\nThe battle ahead of us will not be an easy one, even with the outcome of the 2024 presidential election. There are still forces that seek to move our nation further toward authoritarianism. Yet, I remain optimistic because there are still plenty among us who yearn for the manifestation of the promise of a freer society. I am honored to stand shoulder-to-shoulder with you as we fight to preserve the principles upon which our nation was founded.\n\nAs the renowned abolitionist Frederick Douglass said: “The life of the nation is secure only while the nation is honest, truthful, and virtuous.”\n\nGoodbye for now, RedStaters, and always remember: Stay free, stay principled, and most importantly, stay ungovernable.","url":"https://redstate.com/jeffc/2024/12/15/goodbye-for-now-redstaters-n2183248","image":"https://media.townhall.com/cdn/hodl/rs/images/up/2024/350/0e618b9d-1722-4710-be5b-9b07fb9c7fcc.png","video":null,"publish_date":"2024-12-16 00:42:22","author":"Jeff Charles","authors":["Jeff Charles"],"language":"en","category":"politics","source_country":"us","sentiment":0.263},{"id":273440314,"title":"RBA interest rates: Marnie Baker, Renée Fry-McKibbin to join new RBA monetary policy board","text":"John Kehoe is economics editor at Parliament House, Canberra. He writes on economics, politics and business. John was Washington correspondent covering Donald Trump’s election. He joined the Financial Review in 2008 from Treasury. Connect with John on Twitter. Email John at jkehoe@afr.com","url":"https://www.afr.com/policy/economy/chalmers-brings-former-bank-ceo-economist-on-board-in-rba-overhaul-20241216-p5kykq","image":"https://static.ffx.io/images/$zoom_0.3531%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_60/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/ed08d85849294994bd556417baebf39c76e5e86a","video":null,"publish_date":"2024-12-16 00:37:22","author":"Michael Read, John Kehoe","authors":["Michael Read, John Kehoe"],"language":"en","source_country":"au","sentiment":0.169},{"id":273440310,"title":"Reserve Bank set for shake-up with new members","text":"John Kehoe is economics editor at Parliament House, Canberra. He writes on economics, politics and business. John was Washington correspondent covering Donald Trump’s election. He joined the Financial Review in 2008 from Treasury. Connect with John on Twitter. Email John at jkehoe@afr.com","url":"https://www.afr.com/policy/economy/credible-appointments-will-shake-up-the-reserve-bank-20241216-p5kykw","image":"https://static.ffx.io/images/$zoom_0.3531%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_opinion_no_age_social_wm/471924090032bc0598f2f38113c2d6dd8c711ac6","video":null,"publish_date":"2024-12-16 00:37:22","author":"John Kehoe","authors":["John Kehoe"],"language":"en","source_country":"au","sentiment":0.169},{"id":273440820,"title":"Japan's factory activity softens for 6th straight month, PMI shows","text":"TOKYO : Japan's factory activity shrank for the sixth straight month on lacklustre demand while the service sector extended gains in December, business surveys showed on Monday, highlighting the economy's increasing reliance on services.\n\nThe au Jibun Bank flash Japan manufacturing purchasing managers' index (PMI) dropped at a slower pace to 49.5 in December from 49.0 in November. The index has remained below the 50.0 threshold separating expansion from contraction since June.\n\n\"Diverging trends continued to be seen in demand, with services firms seeing the strongest rise in new business in four months, while goods producers saw a stronger reduction in orders,\" said Usamah Bhatti, economist at S&P Global Market Intelligence.\n\nBusiness confidence in the factory sector softened to the lowest level since May 2022. Highlighting persistent cost pressure, input inflation climbed at the fastest pace in four months while output price surged to the highest level since July.\n\nMeanwhile, the au Jibun Bank flash services PMI rose to 51.4 in December from 50.5 in November.\n\nWhile growth reached a four-month high, its business sentiment dipped over concerns of labour shortage and rising costs. The higher input costs pushed the average selling price up at its fastest pace in eight months. \n\nThe au Jibun Bank flash Japan composite PMI, which combines both manufacturing and service sector activity, stood at 50.8 in December, rising from 50.1 in November.\n\nA quarterly Bank of Japan \"tankan\" survey from Friday showed Japanese big manufacturers' sentiment improved slightly and non-manufacturers remained upbeat on business conditions in the three months to December.\n\nHowever, companies expect business conditions to worsen over the next three months as soft global demand and threats of higher tariffs from U.S. President-elect Donald Trump cloud the outlook.","summary":"","url":"https://www.channelnewsasia.com/business/japans-factory-activity-softens-6th-straight-month-pmi-shows-4808401","image":"https://onecms-res.cloudinary.com/image/upload/s--rfAuMYTl--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-12-16t003505z_1_lynxmpekbf00r_rtroptp_3_japan-companies-po","video":null,"publish_date":"2024-12-16 00:35:05","author":null,"language":"en","source_country":"sg","sentiment":-0.05},{"id":273439786,"title":"Trump let ABC off easy in settling for just $16 million over George Stephanopoulos’ blatant defamation","text":"Make no mistake: President-elect Donald Trump let ABC off easy; it only has to pay $15 million toward his future presidential library, plus $1 million for his lawyers’ fees, to get out of a defamation lawsuit it was sure to lose — and so avoid legal discovery that surely would have finished off whatever reputation its new division still has.\n\nThe defamation came from George Stephanopoulos back on March 10, on the Sunday show “This Week,” when he repeatedly insisted Trump had been “found liable for rape.”\n\nHe was referring to one of the first “lawfare” cases against Trump, E. Jean Carroll’s civil suit claiming he had defamed her by denying her claims that he’d sexually assaulted her three decades ago.\n\nBacked by a biased judge, Carroll was able to get the Manhattan jury to declare that “a preponderance of evidence” suggested he had abused her — but the jurors stipulated that (even by the thin “preponderance” standard) she had not proved rape.\n\nAnd, for what it’s worth, her whimsical reflections on how she’d spend her defamation-award money didn’t strike many viewers as how a rape victim would respond, even decades after the “fact.”\n\nThe judge, Lewis Kaplan, later nattered on about Carroll how hadn’t actually failed to prove rape as defined by dictionary.com, but only as New York law defines it — a clear parting bid to make the decision as useful as possible for anti-Trump electioneering.\n\nBut that left Stephanopoulos (or whoever writes his scripts) zero factual basis for his multiple, overheated claims about Trump being “liable for rape.”\n\nThe ABC host, incidentally, was a career Democratic operative before he became a “journalist.”\n\nThe law gives even public figures some rights against such smears; if the case had proceeded, Trump’s legal team would’ve been able to access ABC News’ internal communications in order to prove the network’s reckless attitude toward the truth.\n\nTrump was actually quite magnanimous in not making ABC pay him the settlement, even if the deal makes the company by far the largest donor to the Trump library.\n\nInevitably, the usual suspects will twist their hands over this settlement being an ominous sign of the media rolling over for the “vindictive” prez-elect.\n\nThat’s nonsense: Corporations like ABC and its parent company, Disney, don’t make such payouts unless they think they’re avoiding far worse if the case actually moves ahead.\n\nThe settlement came right as Stephanopoulos was about to be deposed, and so prove exactly what kind of “journalist” he is.\n\nFar from vindictive, Trump has been rising above baiting by dim network “newspeople.”\n\nNotably, he kept his calm despite near-constant carping from NBC’s Kristen Welker this month: getting his message out above her head.\n\nIt’s an attitude that serves the prez-elect well, another sign that he’s firmly focused on the tasks ahead — and on really getting even with his enemies by delivering for the American people.","summary":"The defamation came from George Stephanopoulos back on March 10, on the Sunday show “This Week,” when he repeatedly insisted Trump had been “found liable for rape.”","url":"https://nypost.com/2024/12/15/opinion/trump-let-abc-off-easy-in-settling-for-just-16-million-over-george-stephanopoulos-blatant-defamation/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-y1jte1dqi-1734308924042.jpg?quality=75&strip=all&1734290949&w=1200","video":null,"publish_date":"2024-12-16 00:32:42","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.54},{"id":273439276,"title":"Kamala Harris for CA Governor? Here's What Her Close Aides Think","text":"In a bold and unprecedented move, failed presidential candidate Kamala Harris is reportedly eyeing California Gov. Gavin Newsom’s job. The move would significantly shift her political trajectory after she was largely defeated by President-elect Donald Trump in the 2024 election. However, conservatives argue that her time as California attorney general would mirror her agenda as a governor. \n\nAccording to a CNN report, several top aides are urging Harris to run for governor in 2026 despite polling as one of the most unliked vice presidents in U.S. history. The report noted that the decision will depend on whether Democrats believe the outgoing vice president has a strong chance of winning the party’s presidential nomination in what is expected to be a highly competitive primary in 2028. Half the party appears to be split on whether Harris should try her chance at the White House again or take a different path. \n\nThe governor’s race, meanwhile, looks like a lay-up: Harris was elected statewide three times and served 10 years combined as state attorney general and US senator, and when asked by CNN, several major candidates made clear either directly or through aides that they would likely step aside if she got in. In CNN’s conversation with over a dozen current and former Harris advisers and other top California Democratic players, the only consensus around the vice president is that she likely can’t do both, since that would essentially require launching a presidential campaign soon after being sworn in as governor. Harris will need to decide very soon after Trump’s inauguration if she will quickly give up on her dream of being president – which she feels got short shrift from the circumstances of this year – and instead go for a job that, while one of the most powerful in American politics, would clearly be a fallback.\n\nThe report highlighted the tight timeline Harris would need to follow if she ultimately decides to run for Newsom’s seat. It pointed out that, at the latest, she must have a clear agenda for a potential governorship by the summer of 2025. \n\n“What she’s been saying to people over the last couple of weeks, donors, other supporters that she’s been talking with, is you haven’t seen the last of me, I’m not going quietly into the night,” CNN’s Issac Devore said. “Advisors, people close to her, are debating about what that means. They do not want her final official act ever to be essentially certifying Donald Trump’s win over her, especially four years after January 6. And so they look at this governor’s race in California in 2026, and it seems to them like a layup, essentially, that she would probably clear the field or mostly clear the field, and she would get to be governor of California.”\n\nA former advisor to Harris said that a run for governor would be more like a “capstone” rather than a “stepping stone,” adding that “if you’re thinking of running for president in 2028, the worst thing you can do is run for governor in 2026.”\n\nMeanwhile, another believed that Harris could win the presidential race once Trump was out of office and that the gubernatorial race would be distracting.","url":"https://townhall.com/tipsheet/saraharnold/2024/12/15/kamala-harris-for-ca-governor-n2649086","image":"https://media.townhall.com/cdn/hodl/2024/298/42dd46c2-58c1-47a6-b236-03dfb22bef27.jpg","video":null,"publish_date":"2024-12-16 00:27:22","author":"Sarah Arnold","authors":["Sarah Arnold"],"language":"en","source_country":"us","sentiment":-0.172},{"id":273439784,"title":"Trump picks to make last push for support before holidays","text":"Trump picks to make last push for support before holidays\n Several of President-elect Donald Trump's Cabinet picks will visit Capitol Hill this week to try to gain support before Congress recesses for the holidays. Nikole Killion has more.","summary":"Several of President-elect Donald Trump's Cabinet picks will visit Capitol Hill this week to try to gain support before Congress recesses for the holidays. Nikole Killion has more.","url":"https://www.cbsnews.com/video/trump-picks-to-make-last-push-for-support-before-holidays/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/12/16/e5ced102-3dba-46eb-9d14-6a08a60db85d/thumbnail/1200x630/1196c2d9469a754cc38a8148437e40c4/1215-wn-killion.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-16 00:21:23","author":null,"language":"en","source_country":"us","sentiment":-0.416},{"id":273438324,"title":"Netanyahu confirms holding \"very warm\" phone call with Trump on Israel's need to \"complete its victory\"","text":"Tel Aviv [Israel], December 16 (ANI): Israeli Prime Minister Benjamin Netanyahu confirmed holding a phone call with US President-elect Donald Trump, during which he reaffirmed his country's 'determination' to continue acting against Iran and its armed proxies, CNN reported.Netanyahu said in the video message that he had a \"very friendly, very warm, and very important conversation\" on Saturday (local time) and told about the need for Israel to \"complete its victory.\"The leaders also spoke of the need to bring home the remaining hostages in Gaza.Hamas carried out a massive terror attack on Israel on October 7 killing over 1200 people and holding over 250 as hostages. Around 100 of them are still believed to be in captivity in Gaza.Israel launched a strong counter-offensive targeting Hamas units in Gaza in an operation that has killed over 45,000 Palestinians.\"I discussed all of this again last night with my friend, US President-elect Donald Trump,\" Netanyahu said in a statement.\"It was a very friendly, very warm and very important conversation. We spoke about the need to complete Israel's victory, and we also spoke at length about the efforts we are making to free our hostages,\" he said as quoted by CNN.Netanyahu said that Israel continues to \"work tirelessly to bring our hostages home, both the living and the dead. And I add, the less we talk about it, the better, and so with God's help, we will succeed.\"On Sunday, the Israeli Prime Minister took to social media platform X and strongly affirmed that they would \"change\" the Middle East.\"I said we would change the Middle East and this is what is happening. Syria is not the same Syria. Lebanon is not the same Lebanon. Gaza is not the same Gaza. Iran is not the same Iran,\" Netanyahu said in a post on X.\n\nאמרתי שנשנה את המזרח התיכון וזה מה שקורה. סוריה היא לא אותה סוריה. לבנון היא לא אותה לבנון. עזה היא לא אותה עזה. איראן היא לא אותה איראן. pic.twitter.com/IFVso1czkH— Benjamin Netanyahu - בנימין נתניהו (@netanyahu) December 15, 2024\n\n\"We are committed to preventing Hezbollah from rearming,\" he said. \"This is an ongoing test for Israel, we must meet it - and we will meet it. I say to Hezbollah and Iran in no uncertain terms - to prevent you from harming us, we will continue to act against you as much as necessary, in every arena and at all times,\" as per Times of Israel.Since the rebels led by Hayat Tahrir al-Sham (HTS) overthrew the over two-decades-long Bashar al-Assad regime on December 8, Israel has launched hundreds of airstrikes across Syria and carried out a land incursion that stretches past the occupied Golan Heights into a previously demilitarized buffer zone, as reported by The Washington Post.The Israeli army swiftly took control of the abandoned army positions, and air attacks have decimated most of Syria's military capabilities.Netanyahu reiterated that recent airstrikes against Syrian military sites were carried out to ensure that the weapons would not be used against Israel in the future. Israel also hit arms supply routes to Hezbollah, he said, acording to Times of Israel.\"We have no interest in a conflict with Syria,\" Netanyahu said. \"We will determine Israel's policy toward Syria according to the emerging reality on the ground.\"Netanyahu has said that Israel has \"no intention of interfering\" in Syria's internal affairs, but also warned to take \"necessary\" measures if the current regime allows Iran to re-establish itself in Syria or transfers weapons to Hezbollah. (ANI)","url":"https://aninews.in/news/world/middle-east/netanyahu-confirms-holding-very-warm-phone-call-with-trump-on-israels-need-to-complete-its-victory20241216043657","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241215230650.jpg","video":null,"publish_date":"2024-12-16 00:18:22","author":"Hayat Tahrir","authors":["Hayat Tahrir"],"language":"en","category":"politics","source_country":"in","sentiment":-0.224},{"id":273438314,"title":"Taiwan must invest in asymmetric warfare, US expert says","text":"Taipei [Taiwan], December 16 (ANI): Noting that traditional weapons would be easy for China to counter, US-based military analyst Eric Gomez has stressed the need for Taiwan to invest in asymmetric weapons, Taipei Times reported citing a new report.The report, which was published by the Cato Institute said that Taiwan should maintain its existing conventional forces to combat low-intensity conflicts while acquiring more asymmetric warfare capabilities to counter potential aggression from China.The report compared military equipment sold to Taiwan during US President-elect Donald Trump's first term in office and US President Joe Biden's current term, and it was found that Trump sold more traditional weapons while Biden emphasized improving asymmetric warfare capabilities, according to Taipei Times.\"Traditional weapons are more flexible, but they tend to have much higher unit and lifetime costs and take longer to build than asymmetric capabilities,\" the report stated.The first Trump administration sold Taiwan USD 10.4 billion (New Taiwan Dollar 319.9 million) in traditional weapons, while the Biden administration has only sold USD 500 million worth of traditional weapons.\n\nAs of last month, only one of four military sales packages made by the Trump administration has been delivered to Taiwan.According to the report, while the Biden administration focused more on asymmetric capabilities, with nine sales packages worth USD 4.36 billion, and maintenance, with 14 sales packages worth a total of USD 2.81 billion.Acquiring more asymmetric capabilities while maintaining existing traditional capabilities is a \"sensible strategy,\" he said.\"While the first Trump administration sold Taiwan more weapons, the Biden administration sold Taiwan a better mix of weapons for Taiwan's self-defence needs,\" Gomez said. Except for the Patriot interceptors, \"this would be a terrible choice for Taiwan.\"Not only would these traditional systems consume most of Taiwan's limited defence budget, but \"they would be relatively easy for China to counter and take a long time to be built and delivered,\" he said.Taiwan has started focusing more on the development of much-needed asymmetric warfare capabilities in the last few years, he said. While large-scale arms sales might seem appealing, it is more rational for the shared interests of both nations for Taiwan to buy cheaper, but more militarily effective asymmetric capabilities, he added, as per Taipei Times. (ANI)","url":"https://aninews.in/news/world/asia/taiwan-must-invest-in-asymmetric-warfare-us-expert-says20241216052419","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241215235337.jpg","video":null,"publish_date":"2024-12-16 00:18:22","author":null,"language":"en","source_country":"in","sentiment":0.064},{"id":273442926,"title":"Elon Musk Reveals What He and Barron Trump Talked About 'All Night' at Mar-a-Lago Dinner","text":"Thanksgiving at Mar-a-Lago was anything but ordinary. While the festivities featured signature DJing, dancing, and high-profile guests, a quieter moment between Elon Musk and Barron Trump became the talk of the internet. Videos from the night showed Barron initially looking quiet and reserved as the party began. But the scene shifted when the youngest Trump child was seen in a deep conversation with Musk, as reported by The List.\n\nThe event, hosted by President-elect Donald Trump, included Elon, his mother Maye Musk, and Trump’s family, including Melania Trump, Tiffany Trump, Eric Trump, and Eric’s wife, Lara Trump. Musk later responded to a post on X (formerly Twitter), confirming their topic of conversation: “I was discussing consciousness and video games with Barron.” Elon's mother added her thoughts by retweeting the post and writing, “They were talking all night. Barron is very smart,” with heart-eye emojis. \n\nOnline users reacted quickly, sharing comments about Barron’s interests and humorously discussing his future. One person joked, “Just wait until @BarronXSpaces starts posting on X and then you can stream with him.\" Another added, \"Did you also discuss expanding the human consciousness and go beyond earth civilisation? Also, does he play Diablo IV?\" One compared Barron to John F. Kennedy Jr., saying, \"Barron is a knockout like John F Kennedy Jr was !! Handsome, brains and integrity!\" \n\nSome even pointed out Elon's involvement in the Trump family. One user said, \"Elon really has become an adopted Trump family member.\" Another jokingly quipped, \"Elon has residency now at Mar-a-Lago.\" One more user criticized the tech mogul for not being with his own family. \"Barron looks like he wants attention from his dad, and Elon is getting the attention from him. Why isn’t Elon with his 10 kids on Thanksgiving or at least a couple of them?\"\n\nElon has been closely connected to Donald since Election Day, even being nominated to head the Department of Government Efficiency. This close bond has led some to jokingly call Elon an 'honorary member' of the Trump family. Moreover, this glimpse into Barron’s personality added to the fascination surrounding the 18-year-old NYU freshman.\n\nAccording to the New York Post, John Morgan, founder of the Morgan & Morgan law firm, also weighed in on Barron’s intelligence. He said Barron was 'far smarter' than Kamala Harris’ campaign team, pointing to his strategic advice during the campaign. According to Morgan, Barron played a key role in suggesting that his father appear on podcasts like The Joe Rogan Experience.\n\n\"It turns out that Barron Trump, who looks like a runway model, was telling his father, ‘You need to go on podcasts, you need to go on Joe Rogan,’” Morgan said. Lara also shared something similar in a Valuetainment podcast episode, describing his unique personality and wit. \"He's really smart, he's very cool, very entertaining, he is his father's son. He is always throwing ideas out there. He is going to do really incredible things.\"","summary":"The event, hosted Donald Trump, also included Maye Musk, who praised Barron as &#39;very smart&#39; after the conversation.","url":"https://www.inquisitr.com/elon-musk-reveals-what-he-and-barron-trump-talked-about-all-night-at-mar-a-lago-dinner","image":"https://dab57h0r8ahff.cloudfront.net/727107/uploads/403d24d0-ba00-11ef-9bd5-5198d732ea76_1200_630.jpeg","video":null,"publish_date":"2024-12-16 00:15:00","author":"INQUISITR,Prachi Mallick","authors":["INQUISITR","Prachi Mallick"],"language":"en","category":"politics","source_country":"US","sentiment":0.065},{"id":273437304,"title":"Reconsidering the Space Force, Tariffs, and the Purchase of Greenland","text":"Many Americans who fancy themselves political analysts actually know very little about U.S. history. This lack of knowledge becomes vividly apparent when they think certain presidents not to their liking were the first to advance particular policies and practices. Just as many were surprised to learn that waterboarding didn’t begin with the George W. Bush Administration and that Thomas Jefferson, not Barack Obama, was the first president to celebrate Ramadan in the White House, today’s Trump-bashers undoubtedly would be shocked upon realizing that a U.S. Space Force, tariffs, and buying Greenland were serious issues long before Donald Trump ever got to DC.\n\nIt’s an old trick: the party out of power constructs false narratives designed to cause its base to ridicule a particular notion a sitting president has in mind, and the masses – too lazy to do their own research – fall for it like simpletons.\n\nClueless pseudointellectuals who fancy themselves well-informed about current events deridingly chuckle at the notion of a space force, dismissing it as some loony, amateurish Trumpism. If said pseudointellectuals are under 50, they probably have no idea much of the same was said about Ronald Reagan, when he proposed the idea of SDI (Strategic Defense Initiative); Reagan-bashers at the time called it ‘Star Wars’. But U.S. space forces have been in combat since the Vietnam War, and the idea was first conceptualized in the 1950s, when it became clear that the Cold War was far more than a passing nuisance. Star Wars actually avoided escalation of war in the Persian Gulf, when Israel used our Patriot missiles to shoot down Soviet Scuds.\nTrump didn’t come up with the idea of the Space Force in between rounds of golf; this was a decades-long project in the making and one of many in the category of things Trump actually accomplished rather than merely pondered.\n\nThe Space Force is now an official branch of the United States military. In 1947, the Truman Administration decided to move air force initiatives, housed within the Army to that point, into a United States Air Force. I wasn’t born yet, so I didn’t experience that moment firsthand, but I can’t imagine there were sniveling snotnoses around at the time who made fun of Harry Truman’s expansion of the armed forces as a response to enhanced military technology. Then again, I seriously doubt that Thomas Dewey supporters had college classes canceled and were given cocoa, coloring books, and cuddle puppies as coping mechanisms when Truman beat him in 1948. Think there might be a cause-and-effect there?\n\nNext, there are tariffs, taxes on foreign goods sold in the United States. In the post-World War II era, Democrats cornered the market on tariffs, insisting their goals were solely to protect American workers. Although that’s a noble concept and certainly one of the main reasons for tariffs, there’s a second that used to be talked about in the open: tariffs serve to beat foreign competition. Many would be very surprised to know that until 1913, Americans paid federal income taxes only in time of war: our bridges, roads, armies, and schools were funded by tariffs. Examining the 1888 and 1892 presidential elections provides a glimpse into the vitality of tariffs at the time, and how presidents were chosen largely on how effectively they would use them. In 1888, Benjamin Harrison defeated incumbent Grover Cleveland by promising to use tariffs more aggressively. But Harrison faced a lagging economy and much of the public thought his tariffs went too far; they handily reelected Cleveland four years later.\nThe situation is not much different today. After Bill Clinton broke with Democratic tradition and eschewed tariffs, his successor, Republican George W. Bush certainly wasn’t going to abandon free trade. And neither did the president who followed, Democrat Barack Obama. It was Trump, as part of his radical transformation of the GOP platform, who brought tariffs back in style. And though neither side will say it out loud, Joe Biden wasn’t much different from Trump on tariffs. As much as they may hate to admit it, Trump and Biden don’t disagree 100 percent of the time. Trump now says ‘tariff’ is the most beautiful word in the English language “even more beautiful than love,” he teases, as those who continue to take him literally are having fits. If he uses tariffs as a negotiating starting point, which I expect is the case, Trump critics who possess intellectual honesty will soon give him credit.\n\nLastly, there’s the proposed purchase of Greenland. Oh how the late night comics had a field day with that one during Trump’s first term. But if you ask most (if not all) of them who is widely considered to be the best U.S. secretary of state of all time, they probably couldn’t tell you it was the man who served in that capacity under James Monroe, and later became president himself, John Quincy Adams. Ranked at Number 2 right behind Adams is Abraham Lincoln’s head at State, William Seward. And Seward was the first high-ranking American official to suggest we buy Greenland. There was also much talk of annexing Greenland at the end of World War II. Recently, the American Foreign Policy Council’s Alexander Gray wrote that acquiring Greenland would safeguard against strategic threats in the Arctic, posed namely by Russia and China.\n\nFew, perhaps no one, other than Trump himself, can answer precisely when he familiarized himself with the issues of a space force, tariffs, and Greenland. But one thing is clear: he knows a great deal more about those subjects than the clueless twits who mock him about it and, in turn, unwittingly embarrass themselves.","url":"https://www.thenationalherald.com/reconsidering-the-space-force-tariffs-and-the-purchase-of-greenland/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/12/jefferson.jpg","video":null,"publish_date":"2024-12-16 00:07:23","author":"Antonis","authors":["Antonis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.352},{"id":273437598,"title":"Bitcoin surges above $US105,000 on US reserve fund news","text":"Bitcoin has surged to a record high above $US105,000 in early Asian trade, extending gains made since Republican Donald Trump, who has promised to champion cryptocurrencies, was elected US president in November.\n\nBitcoin hit a high of $US105,142 ($A165,390) and last traded at $US104,666.\n\nThe price rose on news reports over the weekend that Trump would go ahead with a bitcoin strategic reserve fund, according to Tony Sycamore, an analyst at IG.\n\n\"We're in blue sky territory here,\" Sycamore said on Monday.\n\n\"The next figure the market will be looking for is $110,000.\"","summary":"News that US president-elect Donald Trump plans to go ahead with a bitcoin strategic reserve fund has sent the cryptocurrency surging in value.","url":"https://thewest.com.au/business/money/bitcoin-surges-above-us105000-on-us-reserve-fund-news-c-17097554","image":"https://images.thewest.com.au/publication/C-17097554/626bef4f23e00819a04b06cef73ad40ea9fa70a7-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-12-16 00:07:02","author":"Staff Writers","authors":["Staff Writers"],"language":"en","source_country":"au","sentiment":0.094},{"id":273439410,"title":"US agencies should use advanced technology to identify mysterious drones, Schumer says","text":"BOSTON (AP) — After weeks of fear and bewilderment about the drones buzzing over parts of New York and New Jersey, elected officials are urging action to identify and stop the mysterious flights.\n\n“There’s a lot of us who are pretty frustrated right now,” Rep. Jim Himes, D-Conn., the top Democrat on the House Intelligence Committee, said on “Fox News Sunday.”\n\n“’We don’t know’ is not a good enough answer,” he said.\n\nNational security officials have said the drones don’t appear to be a sign of foreign interference or a public safety threat. But because they can’t say with certainty who is responsible for the sudden swarms of drones over parts of New Jersey, New York and other eastern parts of the U.S. — or how they can be stopped — has led leaders of both political parties to demand better technology and powers to deal with the drones.\n\nSen. Chuck Schumer called Sunday for the U.S. Department of Homeland Security to deploy better drone-tracking technology to identify the drones and their operators.\n\n“New Yorkers have tremendous questions about it,” Schumer, the Senate Majority leader, told reporters about the drone sightings. “We are going to get the answers for them.”\n\nThe federal government did little to answer those questions in its own media briefings Sunday morning. “There’s no question that people are seeing drones,” U.S. Homeland Security Secretary Alejandro Mayorkas told ABC’s George Stephanopoulos. “But I want to assure the American public that we are on it. We are working in close coordination with state and local authorities.”\n\nSome of the drones reported above parts of New York and New Jersey have turned out to be “manned aircraft that are commonly mistaken for drones,” Mayorkas said. “We know of no foreign involvement with respect to the sightings in the Northeast. And we are vigilant in investigating this matter.”\n\nLast year, federal aviation rules began requiring certain drones to broadcast their remote identification, including the location of their operators. It’s not clear whether that information has been used to determine who is behind the drones plaguing locations over New York and New Jersey. Mayorkas’ office didn’t respond to questions about whether they’ve been able to identify drones using this capability.\n\nSchumer wants the federal government to use a recently declassified radio wave technology in New York and New Jersey. The radio wave detector can be attached to a drone or airplane and can determine whether another flying object is a bird or a drone, read its electronic registration, and follow it back to its landing place. Schumer said state and local authorities do not have the authority to track drones.\n\nOn Sunday, New York Gov. Kathy Hochul said federal officials were sending a drone detection system to the state.\n\n“This system will support state and federal law enforcement in their investigations,” Hochul said in a statement. The governor did not immediately provide additional details, including where the system will be deployed.\n\nDozens of mysterious nighttime flights started last month over parts of New Jersey, raising concerns among residents and officials. Part of the worry stems from the flying objects initially being spotted near the Picatinny Arsenal, a U.S. military research and manufacturing facility and over President-elect Donald Trump’s golf course in Bedminster. Drones are legal in New Jersey for recreational and commercial use, but they are subject to local and Federal Aviation Administration regulations and flight restrictions. Operators must be FAA certified.\n\nDrones are now being reported all along the northern East Coast, with suspicious sightings in Connecticut, Massachusetts, Pennsylvania and Virginia, according to news reports.\n\nSome U.S. political leaders, including Trump, have called for much stronger action against these drones, including shooting them down.\n\nCertain agencies within the Department of Homeland Security have the power to “incapacitate” drones, Mayorkas said Sunday. “But we need those authorities expanded,” he said.\n\nA bill before the U.S. Senate would enhance some federal agencies’ authority and give new abilities to local and state agencies to track drones. It would also start a pilot program allowing states and local authorities to disrupt, disable or seize a drone without prior consent of the operator.\n\n“What the drone issue points out are gaps in our agencies, gaps in our authorities between the Department of Homeland Security, local law enforcement, the Defense Department.,” said Rep. Mike Waltz, R-Fla., Trump’s pick to be his national security adviser, speaking on CBS’ “Face the Nation” on Sunday. “Americans are finding it hard to believe we can’t figure out where these are coming from.’’\n\nCollins reported from Hartford, Connecticut.\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"BOSTON (AP) — After weeks of fear and bewilderment about the&#160;drones buzzing&#160;over parts of New York and&#160;New Jersey, elected officials are urging action to identify...","url":"https://whdh.com/news/us-agencies-should-use-advanced-technology-to-identify-mysterious-drones-schumer-says/","image":"https://whdh.com/wp-content/uploads/sites/3/2024/12/drone_fddbe2.jpg?quality=60&strip=color","video":null,"publish_date":"2024-12-16 00:05:01","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","source_country":"us","sentiment":-0.097},{"id":273436582,"title":"Broken Clock Romney Is Right: MAGA and Donald Trump Are the Republican Party Today, and Tomorrow","text":"Senator Mitt Romney, once Republican presidential nominee turned persona non grata after voting twice for the impeachments of President-elect Donald Trump, conceded some ground in a Sunday interview on CNN. Speaking with Jake Tapper on State of the Union, the soon-to-retire Senator from Utah said:\n\nMAGA is the Republican Party and Donald Trump is the Republican Party today. And if you were to ask me who the nominee will be in 2028, it would be JD Vance. Alright? He's smart, well-spoken, a part of the MAGA movement.\n\nSee also: WATCH: Romney Defends... Trump? Really?\n\nTapper interjected by confronting Romney with previous criticism of Vance, which Romney quickly brushed off, saying:\n\nI’m not going to rehash history, and we’ve worked together in the Senate together since then.\n\nRomney continued:\n\nThat is what the Republican Party is, will the party need to change? Look, the Republican Party has become the party of the working-class, middle-class voter. And you've got to give Donald Trump credit for having done that—taking that away from the Democrats.\n\nThe broken clock strikes again. Populism, as embraced by the MAGA movement, centers around the idea of representing the interests and concerns of everyday working-class Americans against what they perceive as an out-of-touch political establishment. This populist vision often contrasts the \"elites\" – including political figures, corporate leaders, and the legacy media – with the \"common people,\" giving rise to \"America First\" policies. This brand of populism prioritizes policies that protect U.S. jobs, industries, and national sovereignty.\n\nPopulism Is the Power Struggle Over MAGA\n\nHowever, Romney's latest sentiments contrast with his view of the party factions just over one year ago. In September 2023, he did not predict the sustained influence of MAGA forces within the party, instead framing himself as a part of what he called the “wise\" and enduring wing of Republicans.\n\nAs he announced he would not seek re-election, Romney told CNN:\n\nTump is the leader of the greatest portion of the Republican Party. It's a populist, demagogue portion of the party. I represent a small wing of the party. I call it the wise wing of the Republican Party. I don't believe we're going away.\n\nIn the wake of November's election, even Romney can’t deny the lasting influence of MAGA. Romney now concedes that Trump's populism has reshaped the party, especially in appealing to working-class voters. His prediction of JD Vance as the 2028 Republican presidential nominee further solidifies the trajectory of a party firmly under the sway of Trumpism.\n\nRomney's term ends on January 3, 2025.","url":"https://redstate.com/brutalbrittany/2024/12/15/broken-clock-romney-is-right-maga-and-donald-trump-are-the-republican-party-today-and-tomorrow-n2183244","image":"https://media.townhall.com/cdn/hodl/2020/24/293a6ab8-58fd-4342-acbd-b232b09fd3f9.jpg","video":null,"publish_date":"2024-12-16 00:01:47","author":"Brittany Sheehan","authors":["Brittany Sheehan"],"language":"en","category":"politics","source_country":"us","sentiment":-0.138},{"id":273440452,"title":"George Stephanopoulos doesn't mention ABC News settlement with Trump's defamation lawsuit on his Sunday show","text":"ABC News host George Stephanopoulos ignored the news about his network’s massive settlement with President-elect Donald Trump on his Sunday show. Fox News Digital first reported on Saturday that ABC News and Stephanopoulos agreed to a settlement to avoid a costly trial over Trump’s defamation lawsuit against the network and anchor. News of the settlement, however, failed to appear on ABC’s \"This Week.\" Instead, Stephanopoulos focused on stories about unidentified drones over New Jersey, ongoing conflicts in Syria and Trump’s cabinet picks. He also deleted his X account over the weekend. LIBERALS UNLOAD ON ABC'S SETTLEMENT WITH TRUMP, DEFEND GEORGE STEPHANOPOULOS: 'KNEE BENT, RING KISSED' Stephanopoulos was the focus of the lawsuit after he asserted that Trump was found \"liable for rape\" in a civil case during a contentious interview with Rep. Nancy Mace, R-S.C., last March. After playing a clip of Mace discussing being a victim of rape, Stephanopoulos asked her, \"How do you square your endorsement of Donald Trump with the testimony we just saw?\" \"You've endorsed Donald Trump for president. Judges and two separate juries have found him liable for rape and for defaming the victim of that rape,\" Stephanopoulos said, alluding to the legal victory by Trump accuser E. Jean Carroll. Stephanopoulos repeated that claim ten times during his spat with Mace, despite the fact that a jury actually determined Trump was liable for \"sexual abuse,\" which has a distinct definition under New York law. The \"This Week\" host was initially defiant against the lawsuit when asked about it in May, adding he would not be \"cowed out of doing my job because of a threat.\" \"Trump sued me because I used the word ‘rape,’ even though a judge said that’s in fact what did happen. We filed a motion to dismiss,\" Stephanopoulos told late-night host Stephen Colbert. According to the settlement, ABC News will pay $15 million as a charitable contribution to a \"Presidential foundation and museum to be established by or for Plaintiff, as Presidents of the United States of America have established in the past.\" Additionally, the network will pay $1 million in Trump's attorney fees. Stephanopoulos and ABC News also had to issue statements of \"regret\" as an editor's note at the bottom of a March 10, 2024, online article, about comments made earlier this year that prompted Trump to file the defamation lawsuit. The note reads, \"ABC News and George Stephanopoulos regret statements regarding President Donald J. Trump made during an interview by George Stephanopoulos with Rep. Nancy Mace on ABC’s This Week on March 10, 2024.\" TRUMP HOPES TO KEEP WINNING WHEN HE TAKES ABC NEWS, CBS NEWS TO COURT OVER ALLEGED 'DISHONEST REPORTING' ABC News said the network was \"pleased\" to have concluded the case. \"We are pleased that the parties have reached an agreement to dismiss the lawsuit on the terms in the court filing,\" an ABC News spokesperson told Fox News Digital. CLICK HERE TO GET THE FOX NEWS APP","summary":"ABC News’ George Stephanopoulos did not reference his network’s $15 million settlement with President-elect Donald Trump over comments he made on-air.","url":"https://www.foxnews.com/media/george-stephanopoulos-doesnt-mention-abc-news-settlement-trumps-defamation-lawsuit-his-sunday-show","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/12/931/523/george-stephanopoulos-this-week.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-16 00:00:44","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","category":"politics","source_country":"us","sentiment":-0.507},{"id":273439268,"title":"Pete Hegseth will release sexual assault accuser from NDA, Lindsey Graham says","text":"Pete Hegseth, Donald Trump’s embattled nominee to lead the Department of Defense, will release a woman from a non-disclosure agreement that followed a 2017 sexual assault allegation against the former Fox News anchor, according to Senator Lindsey Graham.\n\n“He told me he would release her from that agreement,” the South Carolina Republican told NBC’s Meet the Press Sunday. “Just think about what we’re talking about. I’d want to know if anybody nominated for a high-level job in Washington legitimately assaulted somebody.”\n\nGraham compared Hegseth’s nomination to the 2018 confirmation of Supreme Court Justice Brett Kavanaugh, who was publicly accused of sexually assaulting former classmate Christine Blasey Ford.\n\n“If people have any allegation to make, come forward and make it,” Graham said. “Like they did in Kavanaugh, we’ll decline whether or not it’s credible. Right now he’s being tried by anonymous sources, that will not stand.”\n\nThe Independent has requested comment from Hegseth’s attorney.\n\nIn 2017, police in Monterey, California, investigated an allegation that an intoxicated Hegseth sexually assaulted a woman in a hotel room after a Republican women’s conference, at one point physically blocking a door and stopping her from leaving, according to a police report viewed by The Independent.\n\nHegseth told police and has subsequently maintained the encounter was consensual. \n\nNo charges were filed.\n\nAfter the accuser threatened to sue Hegseth in 2020, they entered a non-disclosure agreement and Hegseth paid the individual. \n\n“Hegseth strongly felt that he was the victim of blackmail and innocent collateral damage in a lie that the Complainant was holding onto to keep her marriage intact,” his lawyer toldThe Washington Post of the agreement. \n\nHegseth’s attorney claimed earlier this month the NDA was better described as a confidential settement agreement and that the accuser has already voided it. He has threatened to file an extortion claim against the woman if the former Fox anchor isn’t confirmed. \n\n“There is no NDA to release her from,” Tim Parlatore told CNN. “If she wants to go in and talk about it, she can do it. I mean certainly she would do it at her own peril of a further defamation lawsuit.”\n\nHegseth has faced a numerous accusations concerning his allegedly troubling private behavior since Trump tapped him for defense secretary, including alcohol abuse, financially mismanaging veterans groups, and chanting “kill all Muslims” in a bar.\n\nHis mother accused him in an email later made public of being an “abuser of women,” though she’s since disavowed the message and defended her son’s nomination. \n\nThe allegations don’t appear to have damaged Hegseth’s standing with Trump, who hosted Hegseth as a guest during Saturday’s Army-Navy football game in Maryland.","summary":"Hegseth insists 2017 allegations are false","url":"https://www.independent.co.uk/news/world/americas/us-politics/pete-hegseth-lindsey-graham-trump-nda-b2664773.html","image":"https://static.independent.co.uk/2024/12/15/23/2024-12-12T205844Z_304455671_RC2RNBAR68A8_RTRMADP_3_USA-TRUMP-CABINET-SECURITY.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/jfuPa9K7-4VHSaSK0.mp4","publish_date":"2024-12-15 23:59:18","author":"Josh Marcus","authors":["Josh Marcus"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.417},{"id":273440940,"title":"Rate cuts this week to end year of easing","text":"A year when inflation subsided enough for monetary policy easing to start in most advanced economies is about to conclude with a 24-hour flurry of decisions led by the Federal Reserve.The US announcement will take centre stage on Wednesday, followed by peers in Japan, the Nordics and the UK over the following day - amounting to half of the world's 10 most-traded currency jurisdictions.Those events will draw most attention among investors bracing for the last big week for monetary policy in 2024. By close of play on Friday, at least 22 central banks accounting for two-fifths of the global economy will have set borrowing costs.The upshot is likely to underscore how momentum for easing now looks increasingly uneven as policymakers weigh up differing risks in the coming year.While the Fed itself is poised to deliver a quarter-point rate cut, the dawn of 2025 and the prospect of inflationary import tariffs threatened by the incoming administration of Donald Trump may give officials pause about the pace of further moves.","summary":"","url":"https://timesofindia.indiatimes.com/business/international-business/rate-cuts-this-week-to-end-year-of-easing/articleshow/116349235.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-47529300/47529300.jpg","video":null,"publish_date":"2024-12-15 23:58:53","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"IN","sentiment":-0.309},{"id":273435918,"title":"US bounces back from October slowdown, adds 227,000 jobs in November","text":"WASHINGTON, D.C.: The U.S. job market bounced back in November, adding 227,000 jobs, a sharp recovery from October's sluggish 36,000 gain. \n\nAccording to the Labor Department report, the hiring surge reflected the economy's resilience after disruptions caused by strikes and hurricanes.\n\nThe unemployment rate edged up slightly to 4.2 percent from 4.1 percent, while hourly wages rose 0.4 percent from October and four percent compared to a year earlier-both figures exceeding expectations. The report also revised up job gains for September and October by 56,000, painting a stronger picture of the labor market than previously estimated.\n\nWhile the numbers appear robust, economists urge caution. Julia Pollak, chief economist at ZipRecruiter, noted that the recovery primarily reflects one-time factors, such as the return of workers after strikes. \"I don't think we should be misled by the solid number of 227,000,\" she said. Averaging October and November gains yields a modest 132,000 per month, a clear sign of a cooling job market.\n\nThe gains were concentrated in a few sectors: healthcare, leisure, and hospitality, and government accounted for 70 percent of the new jobs. Factory jobs rose by 22,000, mainly due to the end of strikes at Boeing and other companies, while retailers shed 28,000 positions.\n\nDespite the slower hiring pace, Americans enjoy unusual job security. In October, layoffs dropped to a record low of 1.6 million. Job openings also rebounded, signaling continued demand for workers.\n\nThe broader economy remains resilient, growing at a 2.8 percent annual pace in the third quarter as consumer spending stayed strong. Inflation has cooled from its 9.1 percent peak in June 2022 to 2.6 percent last month, giving households a boost in purchasing power.\n\nLooking ahead, businesses remain cautious. Chris Butler, CEO of the National Tree Company, said his company is keeping a close eye on economic trends as it faces subdued holiday spending and potential new tariffs under President-elect Donald Trump. \"We'll probably add a few roles [in 2025], but it's certainly not going to be a hiring bonanza,\" Butler said.\n\nWith inflation easing and wage growth outpacing price increases, some economists are optimistic about the labor market's future. \"There are all kinds of mounting tailwinds that should propel this labor market forward,\" Pollak said. For now, though, hiring remains measured as businesses navigate economic uncertainty.","url":"https://www.sierraleonenews.net/news/274845585/us-bounces-back-from-october-slowdown-adds-227000-jobs-in-november","image":"https://cdn.bignewsnetwork.com/cus1733766736473.jpg","video":null,"publish_date":"2024-12-15 23:55:29","author":null,"language":"en","source_country":"sl","sentiment":0.176},{"id":273439386,"title":"Judicial Misconduct Complaint Against Judge Vaden For Columbia Boycott Referred to Seventh Circuit's Judicial Counsel","text":"It is all to common for critics to demand an \"enforceable\" ethics code against the Supreme Court justices. These charges, however, fail to recognize how the complaint system could be weaponized. For evidence of this risk, I would point to ongoing proceedings concerning Judge Stephen Vaden of the Court of International Trade.\n\nJudge Vaden was one of thirteen judges who joined the boycott of Columbia Law School. (I interviewed Judge Matt Solomson of the Court of Federal Claims about the boycott.) Shortly after the boycott was announced, a judicial misconduct complaint was filed against Judge Vaden.\n\nJudge Vaden was not alone. Similar complaints were filed against Judges in the Fifth Circuit, the Eleventh Circuit, and in the Court of Federal Claims. As best as I can tell, each of those complaints was dismissed within the circuit. On June 18, 2024, Chief Judge William Pryor of the Eleventh Circuit dismissed the complaint, and the Judicial Council of the Eleventh Judicial Circuit affirmed. On June 24, Chief Judge Priscilla Richman of the Fifth Circuit dismissed the complaint, and the Appellate Review Panel of the Judicial Council for the Fifth Circuit affirmed. And on October 1, 2024, Chief Judge Elaine D. Kaplan of the Court of Federal Claims dismissed the complaint.\n\nEach of these complaints was dismissed, with detailed opinions explaining why. Yet the complaint against Judge Vaden continues. Why?\n\nLet me take a step back and tell you what is public information, and what is not public record. The judicial misconduct process is byzantine. Generally, the proceedings are entirely confidential. Moreover, even if the subject of the complaint waives confidentiality, the proceedings will still remain confidential.\n\nThese requirements are spelled out in 28 U.S.C. § 360(a):\n\n(a)Confidentiality of Proceedings.—Except as provided in section 355, all papers, documents, and records of proceedings related to investigations conducted under this chapter shall be confidential and shall not be disclosed by any person in any proceeding except to the extent that— (1)the judicial council of the circuit in its discretion releases a copy of a report of a special committee under section 353(c) to the complainant whose complaint initiated the investigation by that special committee and to the judge whose conduct is the subject of the complaint; (2)the judicial council of the circuit, the Judicial Conference of the United States, or the Senate or the House of Representatives by resolution, releases any such material which is believed necessary to an impeachment investigation or trial of a judge under article I of the Constitution; or (3)such disclosure is authorized in writing by the judge who is the subject of the complaint and by the chief judge of the circuit, the Chief Justice, or the chairman of the standing committee established under section 331.\n\nThis rule is spelled out with more specificity in Rule 23(b)(7) of the Rules for Judicial Conduct and Judicial Disability Proceedings:\n\nSubject Judge's Consent. If both the subject judge and the chief judge consent in writing, any materials from the files may be disclosed to any person. In any such disclosure, the chief judge may require that the identity of the complainant, or of witnesses in an investigation conducted under these Rules, not be revealed.\n\nIn short, information about the complaint can only be made public if both the subject of the complaint, and the reviewing court approves it. How many people clamoring for an \"enforceable\" ethics code against the Supreme Court were even aware of these statutes?\n\nWith that background, I can point you to a statement posted on the First Liberty web site (for purposes of full disclosure, I've worked with First Liberty on many cases and projects over the years):\n\nJudge Stephen Vaden is a judge on the US Court of International Trade. He was appointed to the bench in 2020 by President Donald Trump. On May 6, 2024, thirteen federal judges, including Judge Vaden, sent a letter to Columbia University condemning the repeated instances of antisemitism on the campus after Hamas' October 7 attack on Israel. An inmate convicted of terrorism and vandalism offenses filed a judicial misconduct complaint against Judge Vaden for signing the letter. The misconduct complaint is currently pending before the Seventh Circuit's Judicial Council. The Chief Judges of the Court of Federal Claims, and United States Courts of Appeals for the Fifth and Eleventh Circuits, dismissed similar complaints about the letter. Those dismissals have all been affirmed by the relevant Judicial Councils. The inmate has no connection to Columbia University, any law school, Judge Vaden, or any case that could come before Judge Vaden. First Liberty, along with Lisa Blatt from Williams & Connolly LLP, represent Judge Vaden.\n\nAgain, rules of confidentiality constrain what I can write here. So let's play connect the dots. How can a complaint get from the Court of International Trade to the Seventh Circuit Judicial Council? Rule 26 lays out the process:\n\nIn exceptional circumstances, a chief judge or a judicial council may ask the Chief Justice to transfer a proceeding based on a complaint identified under Rule 5 or filed under Rule 6 to the judicial council of another circuit. The request for a transfer may be made at any stage of the proceeding before a reference to the Judicial Conference under Rule 20(b)(1)(C) or 20(b)(2) or a petition for review is filed under Rule 22. Upon receiving such a request, the Chief Justice may refuse the request or select the transferee judicial council, which may then exercise the powers of a judicial council under these Rules.\n\nSo two things had to happen here. First, the Chief Judge of the Court of International Trade, Mark Barnett, determined there were \"exceptional circumstances\" to ask Chief Justice John Roberts to transfer the complaint to another circuit. And second, Chief Justice Roberts had to agree that such a transfer was warranted.\n\nNow remember, similar complaints were already dismissed by three other chief judges, who saw no need to refer the case to other circuits. Why did Judge Barnett decide to transfer the case? I can't tell you. That information is confidential. And I think it is safe to say that Judge Vaden has not withheld confidentiality. The fact that he authorized his counsel to make the case public should support that conclusion. So it is the Chief Judge of the Seventh Circuit and/or Chief Justice Roberts, who is keeping this case on the down-low.\n\nSome more information may be helpful. The Court of International Trade is an Article III court. Judges are nominated by the President, are confirmed by the Senate, and serve during \"good behavior.\" But 28 U.S.C. § 251 mandates the political affiliation of federal judges:\n\nThe President shall appoint, by and with the advice and consent of the Senate, nine judges who shall constitute a court of record to be known as the United States Court of International Trade. Not more than five of such judges shall be from the same political party. The court is a court established under article III of the Constitution of the United States.\n\nIn general, there may not be Obama or Trump judges. But Judge Mark Barnett, by statute, was an Obama judge. And Judge Stephen Vaden, by statute, was a Trump judge. (I tend to think this statute is an unconstitutional constraint on the President's appointing power--the Senate can just withhold consent for a judge of the wrong party--but that is a matter for another day.) Chief Justice Roberts was certainly aware of this fact. And he was aware of prior dismissal orders by the Fifth and Eleventh Circuits. And, Chief Justice Roberts was under no obligation to transfer the complaint. You may recall that Roberts's rejected the transfer request from Chief Judge Srinivasan regarding Judge Griffith. Yet, Roberts let this case go forward here. Roberts could have transferred the case to the Fifth or Eleventh Circuits, which already resolved these issues. But he picked the Seventh Circuit.\n\nWhat exactly are the proceedings before the Seventh Circuit? Confidential. I hope Judge Vaden is relieved of this complaint as soon as practicable. And Chief Judge Barnett of the Court of International Trade, and Chief Justice Roberts, should think very carefully of why this case is any different than the prior cases from Texas and Georgia.\n\nYou may not care very much about this dispute, or the Court of International Trade. But this Court will have jurisdiction over Trump trade-related cases, including tariffs and customs. (See 28 U.S.C. § 1581). No other court in the country can hear challenges to virtually any tariff decision that Trump will make. This court will be very significant.\n\nPlus, the Court of International Trade does not use random assignments. Instead the Chief Judge assigns specific judges to specific panels. 28 U.S.C. § 253 provides:\n\nThe chief judge, under rules of the court, may designate any judge or judges of the court to try any case and, when the circumstances so warrant, reassign the case to another judge or judges.\n\nAnd Rule 77(e) of the Court's rules provide, in part:\n\n(e) Assignment and Reassignment of Cases. (1) Assignment to Single Judge. All cases will be assigned by the chief judge to a single judge, except as prescribed in paragraph (2) of this subdivision (e). (2) Assignment to Three-Judge Panel. A case may be assigned by the chief judge to a three-judge panel either on motion, or on the chief judge's own initiative, when the chief judge finds that the case raises an issue of the constitutionality of a federal statute, a proclamation of the President, or an Executive order; or has broad or significant implications in the administration or interpretation of the law. (3) Time of Assignment. Cases are assigned by the chief judge at any time on the chief judge's own initiative or on motion for good cause shown.\n\nThis assignment makes Amarillo and Fort Worth seem like no problem at all.\n\nIt would be worth studying how members on the evenly-divided court are assigned to high-profile cases. We will be hearing a lot more about Judge Barnett over the next four years. For all the complaint about single judge divisions, more attention should be focused on the Court of International Trade.","summary":"The Fifth and Eleventh Circuits already dismissed similar complaints, but the Chief Judge of the Court of International Trade asked the Chief Justice to refer it to another circuit, and Roberts did so.","url":"https://reason.com/volokh/2024/12/15/judicial-misconduct-complaint-against-judge-vaden-for-columbia-boycott-referred-to-seventh-circuits-judicial-counsel/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2021/11/the-volokh-conspiracy.jpg","video":null,"publish_date":"2024-12-15 23:53:23","author":"Billy Binion,Josh Blackman","authors":["Billy Binion","Josh Blackman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.093},{"id":273435542,"title":"Israel will close its Ireland embassy over Gaza tensions","text":"DEIR AL-BALAH, Gaza Strip — \n\nIsrael said Sunday it will close its embassy in Ireland as relations deteriorated over the war in Gaza, where Palestinian medical officials said new Israeli airstrikes killed over 30 people including several children. \n\nThe decision to close the embassy came in response to what Israel's foreign minister has described as Ireland's \"extreme anti-Israel policies.\" In May, Israel recalled its ambassador to Dublin after Ireland announced, along with Norway, Spain and Slovenia, it would recognize a Palestinian state. \n\nThe Irish Cabinet last week decided to formally intervene in South Africa's case against Israel at the International Court of Justice, which accuses Israel of committing genocide in Gaza. Israel denies it. \n\n\"We are concerned that a very narrow interpretation of what constitutes genocide leads to a culture of impunity in which the protection of civilians is minimized,\" Ireland's deputy premier and foreign affairs minister, Micheal Martin, said in a statement. \n\nIsraeli Foreign Minister Gideon Saar's statement on the embassy closure said that \"Ireland has crossed every red line in its relations with Israel.\" \n\nIrish Prime Minister Simon Harris called the decision to close the embassy \"deeply regrettable.\" He added on X: \"I utterly reject the assertion that Ireland is anti-Israel. Ireland is pro-peace, pro-human rights and pro-international law.\" \n\nIsraeli strikes in Gaza kill a journalist and children \n\nIsraeli forces continued Sunday to pound largely isolated northern Gaza, as the Palestinian death toll in the war approached 45,000. \n\nOne airstrike hit the Khalil Aweida school in the town of Beit Hanoun and killed at least 15 people, according to nearby Kamal Adwan Hospital where casualties were taken. The dead included two parents and their daughter and a father and his son, the hospital said. \n\nIn Gaza City, at least 17 people including six women and five children were killed in three airstrikes that hit houses sheltering displaced people, according to Al-Ahli Baptist Hospital. \n\n\"We woke up to the strike. I woke up with the rubble on top of me,\" said a bandaged Yahia al-Yazji, who grieved for his wife and daughter. \"I found my wife with her head and skull visible, and my daughter's intestines were gone. My wife was three months pregnant.\" His hand rested on a body wrapped in a blanket on the floor. \n\nIsrael's military in a statement said it struck a \"terrorist cell\" in Gaza City and a \"terrorist meeting point\" in the Beit Hanoun area. \n\nAnother Israeli airstrike killed a Palestinian journalist working for Al Jazeera, Ahmed al-Lawh, in central Gaza, a hospital and the Qatari-based TV station said. \n\nThe strike hit a point for Gaza's civil defense agency in the urban Nuseirat refugee camp, Al-Awda Hospital said. Also killed were three civil defense workers including the head of the agency in Nuseirat, according to al-Aqsa Martyrs hospital. The civil defense is Gaza's main rescue agency and operates under the Hamas-run government. \n\nThe war in Gaza began after Hamas and other militants from Gaza stormed southern Israel on Oct. 7, 2023, killing some 1,200 people and taking well over 200 hostage. \n\nIsrael's retaliatory offensive has killed almost 45,000 Palestinians, according to Gaza's Health Ministry. The ministry's count does not distinguish between combatants and civilians, but it says over half of the dead have been women and children. \n\nAlso Sunday, Israeli Prime Minister Benjamin Netanyahu said he spoke with U.S. President-elect Donald Trump about developments in Syria and a recent push to secure the release of Israeli and foreign hostages held by Hamas in Gaza. \n\nNetanyahu said he spoke with Trump on Saturday night about the issue. \n\nTrump's Middle East envoy, Steve Witkoff, warned last week during a visit to the region that it would \"not be a pretty day\" if the hostages held in Gaza were not released before Trump's inauguration on January 20. \n\nA Trump spokesperson on Sunday declined to give further details about the call.","url":"https://www.voanews.com/a/israel-will-close-its-ireland-embassy-over-gaza-tensions/7902215.html","image":"https://gdb.voanews.com/3F8F3FBD-6F40-402E-92FC-CD899C0D6F77_w1080_h608.jpg","video":null,"publish_date":"2024-12-15 23:52:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"et","sentiment":0.072},{"id":273435536,"title":"Ukrainian drones strike Russia as Kyiv reels from consecutive massive air attacks","text":"Ukrainian drone strikes on southern Russia killed a 9-year-old boy and set fire to a major oil terminal, officials said Saturday, the day after Moscow launched a massive aerial attack on its neighbor that Ukrainian President Volodymyr Zelenskyy said was one of the heaviest bombardments of the country’s energy sector in the nearly three-year war.\n\nThe boy died when a drone struck his family’s home outside Belgorod, a Russian city near the border with Ukraine, local Gov. Vyacheslav Gladkov reported on Saturday morning on the Telegram messaging app. His mother and 7-month-old sister were hospitalized with injuries, Gladkov said.\n\nHe posted photos of what he said was the aftermath of the attack, showing a low-rise house with gaping holes in its roof and front wall flanked by mounds of rubble.\n\nElsewhere in southern Russia, Ukrainian drones overnight hit a major oil terminal in the Oryol region, sparking a blaze, Ukraine’s General Staff reported. Photos published by the General Staff and on Russian Telegram news channels showed huge plumes of smoke engulfing the facility, backlit by an orange glow.\n\nOryol Gov. Andrey Klychkov confirmed that a Ukrainian drone strike set fire to a fuel depot. He said later the blaze had been contained and that there were no casualties.\n\nRussia’s Defense Ministry on Saturday claimed its forces shot down 37 Ukrainian drones over the country’s south and west the previous night.\n\nRussia pummels Ukrainian energy targets\n\nThe Ukrainian strikes came a day after Russia fired 93 cruise and ballistic missiles and almost 200 drones at its neighbor, further battering Ukraine’s energy infrastructure, around half of which has been destroyed during the war. Rolling electricity blackouts are common and widespread, and Zelenskyy charged Friday that Moscow is “terrorizing millions of people” with such assaults.\n\nAccording to Ukraine’s air force, Russia kept up its drone attacks on Saturday, launching 132 across Ukrainian territory. Fifty-eight drones were shot down and a further 72 veered off course, likely due to electronic jamming, it said.\n\nThe Russian Defense Ministry said its forces used long-range precision missiles and drones on “critically important fuel and energy facilities in Ukraine that ensure the functioning of the military industrial complex.”\n\nThe strike was in retaliation for Wednesday’s Ukrainian attack using U.S.-supplied the Army Tactical Missile System, or ATACMs, on a Russian air base, it said.\n\nKyiv’s Western allies have provided Ukraine with air defense systems to help it protect critical infrastructure, but Russia has sought to overwhelm the air defenses with combined strikes involving large numbers of missiles and drones called “swarms.”\n\nRussia has held the initiative this year as its military has steadily rammed through Ukrainian defenses in the east in a series of slow but steady offensives.\n\nBut uncertainty surrounds how the war might unfold next year. U.S. President-elect Donald Trump, who takes office next month, has vowed to end the war and has thrown into doubt whether vital U.S. military support for Kyiv will continue.\n\nNorth Koreans reportedly in combat in Kursk\n\nZelenskyy said Saturday that a “significant number” of North Korean troops were being deployed by Moscow in assaults in Russia’s southern Kursk region, where Ukrainian troops have held on following a stunning cross-border incursion this summer.\n\nIn a televised address, Zelenskyy said that North Korean soldiers have so far not entered the fight on Ukrainian soil, but claimed they are already taking “noticeable” losses.\n\nElsewhere, Ukrainian officials reported that Russian shelling on Friday and overnight killed at least two civilians and wounded 14 others in front-line areas Ukraine’s south and northeast.","url":"https://www.voanews.com/a/ukrainian-drones-strike-russia-as-kyiv-reels-from-consecutive-massive-air-attacks/7902088.html","image":"https://gdb.voanews.com/CBF50A42-1A27-4593-A39B-0AD311286F70_w1080_h608.jpg","video":"https://www.voanews.com/embed/player/article/7900622.html","publish_date":"2024-12-15 23:52:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"et","sentiment":-0.199},{"id":273435534,"title":"Incoming national security adviser calls for explanation of US drone sightings","text":"U.S. President-elect Donald Trump’s incoming national security adviser says it’s time to figure out where dozens of unexplained drones flying over eastern U.S. states are coming from and whether any ill intent is involved.\n\nRepublican Representative Michael Waltz, from Florida and set to join Trump’s White House team when the president-elect takes office January 20, told CBS’s “Face the Nation” on Sunday, “We need to get to the bottom of it.”\n\nFor weeks now, residents in the state of New Jersey, which borders New York City, and other states to the north and south along the Atlantic Ocean coastline have reported seeing more than 5,000 supposed drones, a figure U.S. officials have concluded is wildly inflated.\n\nAll manner of conspiracy theories has been offered for the unexplained sightings, including U.S. government spying and the deployment of Iran-launched drones from a mothership off U.S. eastern coastal waters.\n\nWaltz called them “long-loitering, could-be dangerous” drones. He credited the outgoing administration of President Joe Biden for trying to allay fears and resolve any mystery about the drones but offered no explanation himself.\n\n“We need more transparency,” Minnesota Senator Amy Klobuchar, a Democrat, told the CBS show. “This can’t be the future.”\n\nOn Saturday, officials from the White House, the Department of Homeland Security and the Federal Bureau of Investigation stressed that most of the recent purported drone sightings in New Jersey — the state with the most reports — and elsewhere have been manned aircraft and posed no national security threat.\n\nAn FBI official told reporters that the agency was working with 50 local, state and federal partners and had determined that fewer than 100 of the more than 5,000 reported sightings had turned out to merit further investigation.\n\n\"The combination of efforts so far ... to include technical equipment, tip line information and noted consults has ... not found any evidence to support large-scale [unmanned aerial system] activities,\" the official said, adding that many of the sightings occurred along regular flight paths.\n\nThe official said more investigations are under way to look at the remaining cases, including analysis of radar and intelligence.\n\n\"We can't ignore the sightings that have been there,\" the official said. \"We're doing our best to find the origin of those drone activities, but I think there has been a slight over-reaction\" in the number of claimed drone sightings.\n\nU.S. officials say they have confirmed drone sightings over military bases in New Jersey, including Picatinny Arsenal, but found no evidence that a foreign government had launched the drones. National security officials, however, have not been able to figure out who has been operating the unexplained drones.\n\nState and local officials in eastern seaboard states have expressed concern. Larry Hogan, a former Maryland governor, posted on social media Friday that he had seen “what appeared to be dozens of large drones in the sky” above his residence in the state. “The public is growing increasingly concerned and frustrated with the complete lack of transparency and the dismissive attitude of the federal government.”\n\nPresident-elect Trump suggested Saturday that the Biden administration was withholding information about the drone sightings and that the devices should be shot down. Republican Representative Christopher Smith of New Jersey said Friday in a statement that the White House’s attitude toward the sightings had been “dismissive.”\n\nU.S. officials said Saturday the administration had sent New Jersey officials radar technology with an “electro-optical infrared camera system” to track the devices.\n\nLast week, White House National Security spokesperson John Kirby said an investigation of the drone sightings had not turned up any illegal activity.\n\n“To the contrary, upon review of available imagery, it appears that many of the reported sightings are actually manned aircraft that are being operated lawfully,” Kirby said.","url":"https://www.voanews.com/a/incoming-national-security-adviser-calls-for-explanation-of-us-drone-sightings/7902167.html","image":"https://gdb.voanews.com/6F5E39F3-7242-4D1A-8003-951A6C1947D0_w1080_h608.jpg","video":null,"publish_date":"2024-12-15 23:52:22","author":"Ken Bredemeier","authors":["Ken Bredemeier"],"language":"en","category":"politics","source_country":"et","sentiment":-0.226},{"id":273435522,"title":"Incoming FCC chair is big tech critic who worries about China","text":"President-elect Donald Trump has nominated Brendan Carr to lead the Federal Communications Commission, which regulates communications in the United States. Carr, an FCC commissioner since 2017, has taken aim at big tech and China’s influence on U.S. communications. VOA’s Dora Mekouar reports.","url":"https://www.voanews.com/a/incoming-fcc-chair-is-big-tech-critic-who-worries-about-china/7902069.html","image":"https://gdb.voanews.com/4ec43770-0706-4f5d-a369-f3611192c0d3_tv_w1080_h608.jpg","video":null,"publish_date":"2024-12-15 23:52:22","author":"Dora Mekouar","authors":["Dora Mekouar"],"language":"en","source_country":"et","sentiment":0.57},{"id":273435476,"title":"Netanyahu confirms holding \"very warm\" phone call with Trump on Israel's need to \"complete its victory\"","text":"Fewer US grandparents are taking care of grandchildren, says new dataSouthwest jet and small plane shared same runway, says investigatorsAustralia plans to tax digital platforms that don't pay for newsWisconsin kayaker who fled the country after faking his death charged\n\n Netanyahu confirms holding \"very warm\" phone call with Trump on Israel's need to \"complete its victory\"Tel Aviv [Israel], December 16 (ANI): Israeli Prime Minister Benjamin Netanyahu confirmed holding a phone call with US President-elect Donald Trump, during which he reaffirmed his country's 'determination' to continue acting against Iran and its armed proxies, CNN reported.Netanyahu said in the video message that he had a \"very friendly, very warm, and very important conversation\" on Saturday (local time) and told about the need for Israel to \"complete its victory.\"The leaders also spoke of the need to bring home the remaining hostages in Gaza.Hamas carried out a massive terror attack on Israel on October 7 killing over 1200 people and holding over 250 as hostages. Around 100 of them are still believed to be in captivity in Gaza.Israel launched a strong counter-offensive targeting Hamas units in Gaza in an operation that has killed over 45,000 Palestinians.\"I discussed all of this again last night with my friend, US President-elect Donald Trump,\" Netanyahu said in a statement.\"It was a very friendly, very warm and very important conversation. We spoke about the need to complete Israel's victory, and we also spoke at length about the efforts we are making to free our hostages,\" he said as quoted by CNN.Netanyahu said that Israel continues to \"work tirelessly to bring our hostages home, both the living and the dead. And I add, the less we talk about it, the better, and so with God's help, we will succeed.\"On Sunday, the Israeli Prime Minister took to social media platform X and strongly affirmed that they would \"change\" the Middle East.\"I said we would change the Middle East and this is what is happening. Syria is not the same Syria. Lebanon is not the same Lebanon. Gaza is not the same Gaza. Iran is not the same Iran,\" Netanyahu said in a post on X.\"We are committed to preventing Hezbollah from rearming,\" he said. \"This is an ongoing test for Israel, we must meet it - and we will meet it. I say to Hezbollah and Iran in no uncertain terms - to prevent you from harming us, we will continue to act against you as much as necessary, in every arena and at all times,\" as per Times of Israel.Since the rebels led by Hayat Tahrir al-Sham (HTS) overthrew the over two-decades-long Bashar al-Assad regime on December 8, Israel has launched hundreds of airstrikes across Syria and carried out a land incursion that stretches past the occupied Golan Heights into a previously demilitarized buffer zone, as reported by The Washington Post.The Israeli army swiftly took control of the abandoned army positions, and air attacks have decimated most of Syria's military capabilities.Netanyahu reiterated that recent airstrikes against Syrian military sites were carried out to ensure that the weapons would not be used against Israel in the future. Israel also hit arms supply routes to Hezbollah, he said, acording to Times of Israel.\"We have no interest in a conflict with Syria,\" Netanyahu said. \"We will determine Israel's policy toward Syria according to the emerging reality on the ground.\"Netanyahu has said that Israel has \"no intention of interfering\" in Syria's internal affairs, but also warned to take \"necessary\" measures if the current regime allows Iran to re-establish itself in Syria or transfers weapons to Hezbollah. (ANI) \n\n Netanyahu confirms holding \"very warm\" phone call with Trump on Israel's need to \"complete its victory\"Netanyahu confirms holding \"very warm\" phone call with Trump on Israel's need to \"complete its victory\"ANI 16th December 2024, 10:18 GMT+11Tel Aviv [Israel], December 16 (ANI): Israeli Prime Minister Benjamin Netanyahu confirmed holding a phone call with US President-elect Donald Trump, during which he reaffirmed his country's 'determination' to continue acting against Iran and its armed proxies, CNN reported.Netanyahu said in the video message that he had a \"very friendly, very warm, and very important conversation\" on Saturday (local time) and told about the need for Israel to \"complete its victory.\"The leaders also spoke of the need to bring home the remaining hostages in Gaza.Hamas carried out a massive terror attack on Israel on October 7 killing over 1200 people and holding over 250 as hostages. Around 100 of them are still believed to be in captivity in Gaza.Israel launched a strong counter-offensive targeting Hamas units in Gaza in an operation that has killed over 45,000 Palestinians.\"I discussed all of this again last night with my friend, US President-elect Donald Trump,\" Netanyahu said in a statement.\"It was a very friendly, very warm and very important conversation. We spoke about the need to complete Israel's victory, and we also spoke at length about the efforts we are making to free our hostages,\" he said as quoted by CNN.Netanyahu said that Israel continues to \"work tirelessly to bring our hostages home, both the living and the dead. And I add, the less we talk about it, the better, and so with God's help, we will succeed.\"On Sunday, the Israeli Prime Minister took to social media platform X and strongly affirmed that they would \"change\" the Middle East.\"I said we would change the Middle East and this is what is happening. Syria is not the same Syria. Lebanon is not the same Lebanon. Gaza is not the same Gaza. Iran is not the same Iran,\" Netanyahu said in a post on X.\"We are committed to preventing Hezbollah from rearming,\" he said. \"This is an ongoing test for Israel, we must meet it - and we will meet it. I say to Hezbollah and Iran in no uncertain terms - to prevent you from harming us, we will continue to act against you as much as necessary, in every arena and at all times,\" as per Times of Israel.Since the rebels led by Hayat Tahrir al-Sham (HTS) overthrew the over two-decades-long Bashar al-Assad regime on December 8, Israel has launched hundreds of airstrikes across Syria and carried out a land incursion that stretches past the occupied Golan Heights into a previously demilitarized buffer zone, as reported by The Washington Post.The Israeli army swiftly took control of the abandoned army positions, and air attacks have decimated most of Syria's military capabilities.Netanyahu reiterated that recent airstrikes against Syrian military sites were carried out to ensure that the weapons would not be used against Israel in the future. Israel also hit arms supply routes to Hezbollah, he said, acording to Times of Israel.\"We have no interest in a conflict with Syria,\" Netanyahu said. \"We will determine Israel's policy toward Syria according to the emerging reality on the ground.\"Netanyahu has said that Israel has \"no intention of interfering\" in Syria's internal affairs, but also warned to take \"necessary\" measures if the current regime allows Iran to re-establish itself in Syria or transfers weapons to Hezbollah. (ANI) \n\n Read This Next US appeals court rejects Nasdaq's diversity rules for company boardsGM to exit from robotaxis, ends funding for autonomous vehicle unitFresh fin whale meat auctioned in Japan after 50 year breakNew Mexico oil income surpasses personal income tax revenueAlbertsons sues Kroger for not getting supermarket merger approval \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2024 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274851564/netanyahu-confirms-holding-very-warm-phone-call-with-trump-on-israel-need-to-complete-its-victory","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2024-12-15 23:51:22","author":"Hayat Tahrir","authors":["Hayat Tahrir"],"language":"en","category":"politics","source_country":"us","sentiment":-0.187},{"id":273435460,"title":"Xinhua Middle East news summary at 2200 GMT, Dec. 15","text":"Fewer US grandparents are taking care of grandchildren, says new dataSouthwest jet and small plane shared same runway, says investigatorsAustralia plans to tax digital platforms that don't pay for newsWisconsin kayaker who fled the country after faking his death charged\n\n Xinhua Middle East news summary at 2200 GMT, Dec. 15JERUSALEM -- The Israeli government approved a plan on Sunday to expand settlements in the Golan Heights, a Syrian territory currently occupied by Israel, according to a statement by Israeli Prime Minister Benjamin Netanyahu's office. The 10.81-million-U.S. dollar plan, unanimously approved by the cabinet, is being advanced \"in light of the war and the new front with Syria,\" the statement said. (Israel-Golan Heights-Settlements) - - - - JERUSALEM -- Israeli Prime Minister Benjamin Netanyahu said on Sunday he held talks with United States President-elect Donald Trump, focusing on Syria and other key regional issues. In a video message, Netanyahu described the conversation as \"very friendly, warm,\" adding that their discussion centered on \"the need to complete Israel's victory\" in the region. (Israel-Netanyahu-Trump-Talks) - - - - DOHA -- Qatar announced on Sunday that it will resume operations at its embassy in Syria, effective Tuesday, with Khalifa Abdullah Al Mahmoud Al Sharif appointed as the charge d'affaires. In a statement, Qatar's Ministry of Foreign Affairs noted that this move marks the restoration of diplomatic relations with Syria after a 13-year hiatus. (Qatar-Syria-Ties) - - - - DAMASCUS -- Syria's Hayat Tahrir al-Sham (HTS) leader, Ahmad al-Shara, held a meeting with UN Special Envoy for Syria Geir Pedersen on Sunday in Damascus to discuss the political transition in the country, according to a statement released by local al-Watan Online news outlet. Al-Shara, also known as Abu Mohammed al-Julani, said that UN Security Council Resolution 2254, adopted in 2015 concerning Syria's political transition, now requires an update to reflect the current realities in the country, urging a \"fresh approach\" that aligns with Syria's new leadership and evolving circumstances. (Syria-UN-Meeting) \n\n Xinhua Middle East news summary at 2200 GMT, Dec. 15Xinhua Middle East news summary at 2200 GMT, Dec. 15Xinhua 16th December 2024, 09:45 GMT+11JERUSALEM -- The Israeli government approved a plan on Sunday to expand settlements in the Golan Heights, a Syrian territory currently occupied by Israel, according to a statement by Israeli Prime Minister Benjamin Netanyahu's office. The 10.81-million-U.S. dollar plan, unanimously approved by the cabinet, is being advanced \"in light of the war and the new front with Syria,\" the statement said. (Israel-Golan Heights-Settlements) - - - - JERUSALEM -- Israeli Prime Minister Benjamin Netanyahu said on Sunday he held talks with United States President-elect Donald Trump, focusing on Syria and other key regional issues. In a video message, Netanyahu described the conversation as \"very friendly, warm,\" adding that their discussion centered on \"the need to complete Israel's victory\" in the region. (Israel-Netanyahu-Trump-Talks) - - - - DOHA -- Qatar announced on Sunday that it will resume operations at its embassy in Syria, effective Tuesday, with Khalifa Abdullah Al Mahmoud Al Sharif appointed as the charge d'affaires. In a statement, Qatar's Ministry of Foreign Affairs noted that this move marks the restoration of diplomatic relations with Syria after a 13-year hiatus. (Qatar-Syria-Ties) - - - - DAMASCUS -- Syria's Hayat Tahrir al-Sham (HTS) leader, Ahmad al-Shara, held a meeting with UN Special Envoy for Syria Geir Pedersen on Sunday in Damascus to discuss the political transition in the country, according to a statement released by local al-Watan Online news outlet. Al-Shara, also known as Abu Mohammed al-Julani, said that UN Security Council Resolution 2254, adopted in 2015 concerning Syria's political transition, now requires an update to reflect the current realities in the country, urging a \"fresh approach\" that aligns with Syria's new leadership and evolving circumstances. (Syria-UN-Meeting) \n\n Read This Next US appeals court rejects Nasdaq's diversity rules for company boardsGM to exit from robotaxis, ends funding for autonomous vehicle unitFresh fin whale meat auctioned in Japan after 50 year breakNew Mexico oil income surpasses personal income tax revenueAlbertsons sues Kroger for not getting supermarket merger approval \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2024 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274851555/xinhua-middle-east--summary-at-2200-gmt-dec-15","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2024-12-15 23:51:22","author":"Israeli Prime Minister","authors":["Israeli Prime Minister"],"language":"en","category":"politics","source_country":"us","sentiment":0.274},{"id":273436052,"title":"Bitcoin powers above $105,000 for first time","text":"Bitcoin surged to a record high above $105,000 in early Asian trade on Monday, extending gains made since Republican Donald Trump, who has promised to champion cryptocurrencies, was elected U.S. president in November.\n\nBitcoin hit a high of $105,142 and last traded at $104,666.\n\nThe price rose on news reports over the weekend that Trump would go ahead with a bitcoin strategic reserve fund, according to Tony Sycamore, an analyst at IG.\n\n\"We're in blue sky territory here,\" Sycamore said. \"The next figure the market will be looking for is $110,000.\"","summary":"","url":"https://www.channelnewsasia.com/business/bitcoin-powers-above-105000-first-time-4808351","image":"https://onecms-res.cloudinary.com/image/upload/s--3Ri8aVZ2--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2024-12-15t234427z_2_lynxmpekbe0ay_rtroptp_3_microstrategy-stoc","video":null,"publish_date":"2024-12-15 23:48:39","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.045},{"id":273435040,"title":"Between a niqab and a bikini: Riyadh aims to become world's fashion capital","text":"In October 2023, right after Paris Fashion Week ended, Saudi Arabia's capital Riyadh hosted its first-ever fashion week, organized by the Saudi Fashion Commission. Held at the King Abdullah Financial District, the event showcased 30 local designers and brands. Since then, the event has been held twice a year, drawing prominent figures from the Arab world and local celebrities including Georgina Rodríguez, Cristiano Ronaldo’s partner (Ronaldo plays for Al-Nassr in Saudi Arabia). Rodriguez attended shows by designers Fatima Alabdulqader and Khawla Alaiban. “The event highlights our top creative talents and allows our brands to show the world what Saudi fashion has to offer,\" Saudi Fashion Commission Director Burak Cakmak said. Riyadh Fashion Week marked a turning point in Saudi Arabia's approach to fashion and its openness to the Western world — a trend that's grown over the past year. In May, for example, Saudi Arabia held its first-ever swimwear fashion show — a bold step for the conservative Muslim nation. Recently, as part of the Riyadh Season festival, Lebanese designer Elie Saab’s fashion show featured singers like Jennifer Lopez and Céline Dion. Simultaneously, the Christian Dior: Designer of Dreams exhibition launched at Saudi Arabia’s National Museum (closing April 2), showcasing 75 years of Dior’s creations. The exhibits emphasize local influences, such as the Al-Ula region, reflected in designs inspired by desert light and golden sands, blending Western haute couture with local traditions and nature. One of Saudi Arabia's strategies to bolster its fashion industry was establishing the Saudi Fashion Commission in 2020, headed by Burak Cakmak, a former dean of fashion at Parsons School of Design in New York. “We have been building a fashion industry here in Saudi completely from scratch,\" Cakmak explained in a 2023 interview with Forbes. “The biggest challenge has been obtaining market data information. It’s important that the commission, as well as designers and businesses across the value chain, can make informed data-led decisions,” he said. “The Saudi fashion scene is truly like no other, you just need to attend a Saudi event such as the Saudi Cup to witness its originality and love of luxury and extravagance, blended with Saudi heritage and the contemporary,\" he added. Cakmak is optimistic about the sector’s growth in the Muslim country, envisioning a future that preserves Middle Eastern traditions while developing a new design language. One of his initiatives is the Saudi 100 Brands program, a professional development effort helping emerging fashion talents — 85% of whom are women — reach their potential through specialized courses and brand development support. “What distinguishes Saudi designers from others is our vision, which is born from our past and our heritage,” said Nour Al Dhahri, a designer from the Saudi 100 Brands program specializing in embroidered evening gowns and a regular at Riyadh Fashion Week. Saudi Arabia's current focus on expanding its presence in fashion, including shows, exhibitions and Western appeal, follows two and a half decades of stability in its luxury market, fueled by its oil wealth. In the early 2000s, luxury brands began entering the Saudi market — a trend that intensified in the 2010s with the expansion of major fashion groups like Chalhoub, representing brands like Fendi, Versace and Tom Ford. This period also saw the launch of fashion magazines targeting the local audience, such as Vogue Arabia and Marie Claire Arabia, based in the UAE. These developments strengthened the local economy. Whereas 70% of Gulf and Saudi customers’ luxury purchases previously occurred abroad in fashion hubs like Milan and Paris, there’s now a growing trend of buying luxury brands in local malls. As of 2023, Saudi Arabia's fashion industry is valued at approximately $30 billion, projected to reach $42 billion by 2028, with a significant 48% growth in retail fashion sales expected by 2025. The industry contributes 2.5% to the country’s GDP and has created 320,000 jobs. Women comprise 52% of the workforce, underscoring Saudi Arabia's emphasis on diversity and gender equality. The market also invests in expanding local brands and designers, such as Hindamme by Mohammed Khoja, which combines Saudi heritage with modern design haute couture designer Yousef Akbar and Arwa Al Banawi, known for blending classic and contemporary styles. 'Swimsuit models? This was unheard of in Saudi Arabia' “This is a revolutionary yet quiet period in Saudi Arabia, driven by Crown Prince Mohammed bin Salman,” explained Prof. Uzi Rabi, a senior researcher at Tel Aviv University’s Moshe Dayan Center for Middle Eastern and African Studies. “The openness in fashion takes the country a step further as it touches on women’s rights. Swimsuit models? This was unheard of in Saudi Arabia.\" \"But it’s part of Saudi Vision 2030 that the kingdom aims to promote. In the last five years, we’ve seen women driving alone, holding photo IDs and participating in short film competitions — developments that all point to one message: Saudi Arabia wants the world at its doorstep,\" he added. Vision 2030, launched by bin Salman in 2016, is a comprehensive strategic plan to diversify the kingdom’s economy and reduce reliance on oil revenue. The plan includes extensive economic, social and cultural reforms, particularly in tourism. “Bin Salman questioned what Saudi Arabia would look like in 2030 and began 'Saudizing' the workforce with a focus on women’s empowerment — by Saudi standards,” Rabi noted. “They’re not discarding the hijab, but they’re advancing things women could only dream of 15–20 years ago. It’s a delicate dance between progress and tradition, all seemingly sanctioned by religious approval. Sometimes, however, that approval comes after the fact.” How does modernization coexist with Islamic sharia law? “When contemporary Saudi society seeks progress, it consults its past to shape an acceptable future,” Rabi explained. “This involves adopting new elements that might initially be seen as heretical by radicals but eventually gain religious endorsement. Essentially, they’re bending religious law to facilitate modernization.\" Are they subordinating Islamic law to modernization efforts? “Absolutely,” Rabi said. “Bin Salman not only uses Islam as a tool for modernization but also leverages it to drive progress. This is part of his controversial persona. Despite his ruthlessness and authoritarian rule, he’s immensely popular among Saudi youth. He’s opening Saudi Arabia to the world, fostering interactions, and gaining recognition. \"This is a sophisticated strategy — not a whim — to make Saudi Arabia more welcoming to tourists and businesspeople. With [Donald] Trump’s election and Jared Kushner’s deep involvement in the Saudi economy, we can expect even bigger developments.\" The end of modesty laws is still far off Fashion in Saudi Arabia isn’t just about clothing or women wearing Dolce & Gabbana beneath their black niqabs — it reflects broader social and political shifts. According to Rabi, bin Salman's initiatives aren’t just PR moves aimed at Western liberal audiences they directly impact citizens’ lives, evident in social media, Saudi theater, freedom of expression, inheritance laws and education reforms — though superficially. By 2034, Saudi Arabia is also set to host the FIFA World Cup, positioning itself as a nation blending innovation with tradition and tourism with business. Modernization’s challenges arise both domestically and internationally. A prime example is the May swimwear show during the Red Sea Fashion Week at the luxury St. Regis Hotel on the Saudi island of Ummahat. Contrary to expectations, models wore one-piece swimsuits and bikinis, marking a historic moment. Fashion designer Yasmina Qanzal, who showcased swimwear at the event, told AFP, \"It's true that this country is very conservative but we tried to show elegant swimsuits which represent the Arab world,\" Despite this progress, Saudi women still don’t dress this way, even at the beach. The show sparked a divide: some celebrated it as a recognition of women’s rights and a move toward the kingdom’s aspirations, while others saw it as provocative and offensive to Islamic law, particularly in a devout country that hosts millions of pilgrims annually. Get the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv2 Saudi human rights activist Lina al-Hathloul argued that the May swimwear show was aimed at improving the kingdom’s international image but didn’t necessarily reflect genuine change in civil rights, personal freedoms or attitudes toward women. \"3 weeks after Saudi authorities sentenced Manahel to 11 years in prison for her choice of clothing, some of the #WWE’s top female talent were pictured posing in revealing swimsuits on the kingdom’s Red Sea coast. MBS’s Saudi Arabia in a nutshell,\" she wrote on her X account. Follow Ynetnews on Facebook | Twitter | Instagram","url":"https://www.ynetnews.com/magazine/article/sksqve341e","image":"https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/12/10/rkejIadBE1e/rkejIadBE1e_0_80_3000_1688_0_large.jpg","video":null,"publish_date":"2024-12-15 23:47:37","author":"Itay Yaacov","authors":["Itay Yaacov"],"language":"en","source_country":"il","sentiment":0.722},{"id":273435744,"title":"Donald Trump's FBI Pick Teases Releasing Epstein and Diddy Guest Lists: \"Giving People the Truth...\"","text":"Donald Trump's choice for FBI director, Kash Patel, just made a significant statement that has everyone talking: controversial lists connected to Sean \"Diddy\" Combs and Jeffrey Epstein could finally be released in the future for the public. The 44-year-old lawyer and former federal prosecutor promised to bring transparency to the table and pledged to uncover as much corruption as possible during a recent podcast with Benny Johnson, where Patel made waves with his controversial statements\n\nAccording to Patel, powerful figures are in cold sweat and 'terrified' because of the potential revelations. He also aimed to restore 'respect for government' with this revelation, claiming that it has been absent for '50, 60 years,' as per Indy100. The lists he is allegedly about to release are of high-profile individuals connected to Diddy's and Epstine's infamous scandals and have been a part of their controversial events in the past.\n\nIn September 2024, Diddy was arrested because of some grave allegations against him, including racketeering and sex trafficking. His lawyers corroborated the rapper's denials by saying everything that the allegations were a 'complete lie.' When it comes to Epstein, several huge names appeared on his plane's flight logs, including Prince Andrew, Bill Clinton, and Trump himself. However, it is important to note that a person's name showing up on those flight logs does not indicate any criminal activity.\n\nStill, Patel has been quite vocal about the flaws he sees in the system. He even went as far as to say, \"Put on your big boy pants,\" to Republicans and come out, demanding they name the pedophiles. If these lists are released, things will be very different. Patel seems to think that complete transparency is the only way to fix the government. \"The way to do it is by giving the American people the truth,\" he said during his podcast appearance. \"That's what they feared about Donald Trump. He's going to come in there and might just give them the Epstein list, the Diddy list, and everything else they're terrified of being exposed,\" Patel continued, according to Newsweek.\n\nAlthough Trump himself hasn't confirmed anything yet, he has talked about the possibility of revealing the Epstein list in an interview with podcaster Lex Fridman. The matter is made much more intriguing by the fact that Trump and Epstein had contacts and were even neighbors in Florida. Also jumping in, Donald Trump Jr. said that Diddy's arrest could be a part of a larger political plot. He even implied that some celebrities who support Democrats might have compromised information.\n\nFor Patel, however, things are not that easy. Given his apparent allegiance to Trump and his outrageous plans for reconstructing the FBI, it is anticipated that his Senate confirmation would be somewhat difficult. He has even suggested closing the FBI's headquarters in Washington, D.C., and redistributing its employees across the entire country. People have become so interested about what might happen next that there is even an X account created specifically to monitor whether he will reveal the Epstein list or not. The name of the account is Did Kash Patel Release the Epstein List Today?","summary":"This news broke during a recent podcast with Benny Johnson, where Patel made waves with his controversial statements.","url":"https://www.inquisitr.com/donald-trumps-fbi-pick-teases-releasing-epstein-and-diddy-guest-lists-giving-people-the-truth","image":"https://dab57h0r8ahff.cloudfront.net/727331/uploads/7f600fb0-b9f6-11ef-879d-dde6d17abef7_1200_630.jpeg","video":null,"publish_date":"2024-12-15 23:45:00","author":"INQUISITR,Shraddha","authors":["INQUISITR","Shraddha"],"language":"en","category":"politics","source_country":"US","sentiment":-0.166},{"id":273434348,"title":"Trump nominees should ‘steer clear’ of undermining polio vaccine, McConnell says","text":"Senate Republican leader Mitch McConnell, who had polio as a child, says any of President-elect Donald Trump’s nominees seeking Senate confirmation should “steer clear” of efforts to discredit the polio vaccine.\n\n“Efforts to undermine public confidence in proven cures are not just uninformed — they’re dangerous,” McConnell said in a statement Friday. “Anyone seeking the Senate’s consent to serve in the incoming Administration would do well to steer clear of even the appearance of association with such efforts.”\n\nThe 82-year-old lawmaker’s statement appeared to be directed at Trump’s pick for health secretary, Robert F. Kennedy Jr., after a report that one of his advisers filed a petition to revoke approval for the polio vaccine in 2022. That vaccine is widely considered to have halted the disease in most parts of the world.\n\nMcConnell’s words were a sign that Kennedy, who has long advanced the debunked idea that vaccines cause autism, could face some resistance in the soon-to-be GOP-controlled Senate.\n\n“Mr. Kennedy believes the Polio Vaccine should be available to the public and thoroughly and properly studied,” said Katie Miller, the transition spokeswoman for Kennedy, in response to questions.\n\nThe New York Times reported that the petition was filed by a lawyer now helping Kennedy select candidates for federal health positions in the incoming administration.\n\nAny individual or company can file a petition with the Food and Drug Administration, which typically fields hundreds of requests at any time relating to various food, drug and medical issues. Most petitions are denied, but the FDA is required to respond to each one in writing.\n\nVaccines have been proven to be safe and effective in laboratory testing and in real-world use in hundreds of millions of people over decades — they are considered among the most effective public health measures in history.\n\nMcConnell contracted polio at 2 years old but survived because of “the miraculous combination of modern medicine and a mother’s love,” according to the statement. He praised the “saving power” of the polio vaccine for the “millions who came after me.”\n\nSenate Majority Leader Chuck Schumer, D-N.Y., said in a post on X that it was “outrageous and dangerous for people in the Trump Transition to try and get rid of the polio vaccine that has virtually eradicated polio in America and saved millions of lives.\n\nHe said Kennedy should clarify his own position on it.\n\nTrump announced last month his selection of Kennedy, saying Kennedy would work to protect Americans “from harmful chemicals, pollutants, pesticides, pharmaceutical products, and food additives.”\n\nBut that pick was met with alarm from scientists and public health officials, who fear Kennedy would unwind lifesaving public health initiatives such as vaccines.\n\nKennedy has pushed other conspiracy theories regarding vaccines, such as that COVID-19 could have been “ethnically targeted” to spare Ashkenazi Jews and Chinese people, comments he later said were taken out of context. He has repeatedly brought up the Holocaust when discussing vaccines and public health mandates.\n\nKennedy said he plans to remake the Department of Health and Human Services, an agency with sprawling reach and a $1.3 trillion budget, if he is approved. He has suggested the FDA is beholden to “big pharma,” and his anti-vaccine nonprofit has called on it to stop using COVID-19 vaccines.\n\nDuring the COVID-19 epidemic, his nonprofit group, Children’s Health Defense, petitioned the FDA to halt the use of all COVID vaccines. The group has alleged that the FDA is beholden to “big pharma” because it receives much of its budget from industry fees and some employees who have departed the agency have gone on to work for drugmakers.\n\nChildren’s Health Defense currently has a lawsuit pending against a number of news organizations, among them The Associated Press, accusing them of violating antitrust laws by taking action to identify misinformation, including about COVID-19 and COVID-19 vaccines. Kennedy took leave from the group when he announced his run for president but is listed as one of its attorneys in the lawsuit.","url":"https://www.agassizharrisonobserver.com/national-news/trump-nominees-should-steer-clear-of-undermining-polio-vaccine-mcconnell-says-7709810","image":"https://www.bpmcdn.com/f/files/shared/feeds/gps/2024/12/web1_20241212121252-20241212121252-675b2336cbeac28fd4bbccefjpeg.jpg","video":null,"publish_date":"2024-12-15 23:40:22","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.137},{"id":273440606,"title":"Former longtime South Carolina congressman John Spratt dies at 82 - The Associated Press","text":"COLUMBIA, S.C. (AP) — John Spratt, a former longtime Democratic congressman from South Carolina who successfully pushed for a balanced budget deal in the 1990s but was unseated decades later when his district turned Republican, has died. He was 82.\n\nSpratt died Saturday night at home, surrounded by family, due to complications from Parkinson’s disease, his daughter, Catherine Spratt, said in a post on Facebook.\n\nTributes quickly poured in for Spratt, who represented South Carolina’s 5th District for nearly 30 years.\n\nFormer President Bill Clinton hailed Spratt as a “skilled and deeply principled lawmaker” who was willing to work with anyone to pass legislation to make a difference in people’s lives. \n\nIn a condolence letter to the family, according to Spratt’s daughter, President Joe Biden wrote that, “Guided by his wit, wisdom, decency and grace, John deeply understood the promise of America, and he fought tirelessly to bring people together to help us live up to that promise.”\n\nGov. Henry McMaster, a Republican, in a post on X called Spratt a man of “unmatched intellect, integrity, and kindness,” and said he would order flags across the state to be lowered to half-staff on the day of Spratt’s funeral.\n\nChristale Spain, chair of South Carolina’s Democratic Party, said in a release that Spratt “earned respect on both sides of the aisle, and he will be remembered for his courageous work to enhance and improve healthcare, support for our military, and his strengthening of rural communities leaves a lasting impact that will be felt for generations.”\n\nJaime Harrison, a South Carolina native currently serving as chairman of the Democratic National Committee, said he “often teased that Mr. Spratt had probably forgotten more about the federal budget than the majority of Members had ever known,” calling him “brilliant, kind, and beloved by many.”\n\nFirst elected to Congress in 1982, Spratt rose through the ranks to become chairman of the House Budget Committee and the second-highest-ranking Democrat on the Armed Services Committee. \n\nOne of his proudest accomplishments, his daughter said, was his role in passing the Balanced Budget Agreement of 1997.\n\n“I’ll always be grateful for the chance to work with him, especially on the Balanced Budget Act of 1997 which he co-authored and helped produce record surpluses,” Clinton said. “John was a true public servant and a really good man.”\n\nAs much of the South tilted more Republican, Spratt hung on to his congressional seat, fending off challengers as the districts around his stayed red, and Republicans took over the state, redrawing congressional maps to give them big advantages. \n\nSpratt’s district had been in Democratic hands for more than 100 years until state Republicans redrew district map, changing the boundaries to place it more safely under their party’s control. Republican Mick Mulvaney defeated Spratt in a 2010 race for the seat, which Mulvaney held for three terms before going on to serve President Donald Trump’s first administration as director of the Office of Management and Budget and, for more than a year, as acting White House chief of staff.\n\nSouth Carolina now has six Republicans and one Democrat — Rep. Jim Clyburn, who recently won his 17th term representing the state’s 6th District — in its U.S. House delegation. Only one other district, the 1st, was briefly won by a Democrat before reverting to Republican hands.\n\n“Serving in Congress with John Spratt was one of the most rewarding experiences of my life,” Clyburn wrote in a post on X, calling his former colleague “a friend and confidant, a colleague and counselor, and a mentor and partner,” as well as “an inconspicuous genius and the most ordinary, extraordinary person I have ever known.”\n\nSpratt graduated from Davidson College, where he was student body president. Winning a Marshall Scholarship to Oxford, he studied economics, and earned a law degree from Yale. Serving as a captain in the Army from 1969 to 1971, Spratt was awarded the Meritorious Service Medal.\n\nAfter that service, Spratt came home to South Carolina to practice law with his father in 1971. Eleven years later, he was elected to his first U.S. House term.\n\nSurvivors include his wife, Jane Stacy Spratt, to whom he was married for 56 years, three daughters, and several grandchildren.\n\nSchreiner reported from Shelbyville, Kentucky. AP reporter Jeffrey Collins in Columbia, South Carolina, also contributed to this report.","summary":"Former longtime South Carolina congressman John Spratt dies at 82  The Associated Press","url":"https://apnews.com/article/former-south-carolina-congressman-john-spratt-dies-d0cee6ed25371e6af81edc036d1c56bf","image":"https://dims.apnews.com/dims4/default/2de612d/2147483647/strip/true/crop/4288x2412+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd3%2F3c%2Fe8221a60c2c7b0412fde7735e24e%2F417a908bd78a4b95b37ef3bd4223469e","video":null,"publish_date":"2024-12-15 23:38:00","author":"Bruce Schreiner,Meg Kinnard","authors":["Bruce Schreiner","Meg Kinnard"],"language":"en","source_country":"us","sentiment":-0.04},{"id":273433838,"title":"‘SNL’ Put a Mischievous Chris Rock on Full Display","text":"During his fourth time hosting Saturday Night Live, Chris Rock brought a particularly magnetic and mischievous energy—one that showed his mastery of being a good-natured troll. In the show’s best moments, it followed suit: The episode was packed with sketches that feinted toward seemingly familiar premises before upending them, and many of Rock’s characters tapped into his punchy stand-up persona and button-pushing sense of humor. References that seemed outdated ended up feeling current; a sketch about a car based on Herbie, the sentient ’60s Volkswagen Beetle that hasn’t been featured in a movie in nearly a decade, wound up confronting the racism of older generations. The result was a night that was oddly refreshing for its idiosyncracy. Even the show’s most unpolished, truly not-ready-for-prime-time moments proved to be hilarious.\n\nIn Rock’s first (and strongest) sketch, he played an elf greeting customers visiting Santa Claus at the mall—only in his case, he was offering two Santas for them to choose between: one played by a white actor and the other by a Black one. The question was obviously meant to make people—especially white people trying to not appear racist—squirm, but Rock delivered every line like he was a salesman inviting his customer to embark on a once-in-a-lifetime opportunity. “All you gotta do is tell me which Santa you want to go to,” he said, grinning. “Which Santa do you want your daughter to get a picture with, a picture you’ll cherish for the rest of your life?”\n\nThe couple he spoke with, played by Heidi Gardner and Mikey Day, probably shouldn’t have responded. But Rock, a seasoned comedian and SNL veteran, specializes in characters unafraid to rile others up into realizing their own hypocrisies. When Day’s character asked for the “regular” Santa, Rock feigned ignorance: “‘Regular’? ‘Regular’ as opposed to ‘extra crispy’? You’re going to need to be a little more specific than that.” His knowingness was reminiscent of one of his most popular SNL appearances, when he played a guest at a 2016 presidential-election-night party where most attendees assumed Hillary Clinton would win. Rock’s character, along with a character played by the episode’s host, Dave Chappelle, were the only nonwhite guests—and therefore the only ones who weren’t shocked that so many Americans would vote for Donald Trump, a candidate whom the other guests thought only “racists” would support. Unbothered, Rock smiled widely throughout the sketch while the partygoers around him grimaced. “Don’t worry,” he assured them sarcastically, “it’s going to be all white.”\n\nRock’s opening monologue last night was playfully deceptive too. Unlike some of the other comics who have hosted SNL, he didn’t present what felt like a collection of bits he was excerpting from a forthcoming special. As he riffed on headlines, he baited the crowd into expecting mundane observations only to slip into a provocative punch line. He offered condolences for the family of the assassinated UnitedHealthcare CEO, letting the audience fall completely silent at his apparent earnestness. Then he revealed his sadness to be an act: “You know, sometimes drug dealers get shot.”\n\nAgain and again, Rock toyed with the crowd’s expectations. As he mocked the outrage that some Americans expressed over Donald Trump’s reelection, the stand-up worked the room into agreeing with him about how unsurprising Trump’s win was, pointing out that America has long celebrated less-than-savory leaders. “People are like, ‘He’s going to be so undignified. It’s the presidency of the United States,’” he said. “Come on, man—this is not the most dignified job in the world. You know we’ve had presidents show up to the inauguration with pregnant slaves, okay?” He seemed poised to deliver a serious history lesson—and then he unveiled a more contemporary target. “And I’m just talking about Bill Clinton!” he said in an apparent reference to the former president’s misconduct in office. By the time he declared that “nobody knows how to get rid of people like a South African”—a joke about Elon Musk’s close ties to Trump, and Trump’s plan to deport undocumented immigrants—the crowd was simultaneously laughing and groaning, swept up by Rock’s sheer confidence and rug-pulling delivery.\n\nLater, that rebellious energy coursed through a sketch about a Secret Santa exchange. In it, Rock played a character who received what he considered “the best gift I’ve ever gotten in my life”: a cartoon portrait of him, drawn to look like he was a character on The Simpsons. He initially appeared to be the odd man out, the overenthused guy at the party who wouldn’t stop talking about what his character’s episode of The Simpsons would be like. But Rock imbued his role with such uninhibited certainty about his importance to The Simpsons’ lore that everyone started playing along. Instead of being about a bunch of observers helplessly tolerating their peculiar friend, the sketch became an absurd illustration of the way groupthink manifests.\n\nBut one of the most memorable moments of the episode came from something that seemed entirely unplanned. In “Gallbladder Surgery,” Adam Sandler guest-starred as a patient whose artery began spewing an absurd amount of blood onto the surgeons surrounding the operating table, who were attempting to fix the mistakes of an anxious nurse. As in the Simpsons sketch, one character—here, the nurse in question (Sarah Sherman)—was positioned to take over the bit with loony catchphrases. As the scene progressed, though, Sandler’s patient took over the spotlight because a technical malfunction forced the actor to say the same line three times while waiting for the blood-gushing mechanism to work. By the time Sandler finally delivered a series of fourth-wall-breaking lines—“Not sure what your role in this skit is, but so happy you’re getting airtime,” he told the doctor played by the new cast member Emil Wakim—the sketch had begun threatening to unmoor all of the performers. While they held it together, Sherman still managed to end the proceedings with a goofy punch line.\n\nSNL produced a night of controlled chaos, in other words. Rock may not have been the strongest host this season, but the comic delivered an audacious monologue that seemed to inspire a similarly gleeful approach in the night’s sketches. Like the greeter introducing two mall Santas, Rock had no trouble trolling the audience with unpredictable turns. They kept guessing. And then they started laughing.","url":"https://www.theatlantic.com/culture/archive/2024/12/chris-rock-saturday-night-live/681008/","image":"https://cdn.theatlantic.com/thumbor/fZl3K3acV4yROAqKVmgIJe0_g5Q=/2x0:996x522/960x504/media/img/mt/2024/12/NUP_206567_00001/original.jpg","video":null,"publish_date":"2024-12-15 23:35:22","author":"Shirley Li","authors":["Shirley Li"],"language":"en","category":"entertainment","source_country":"us","sentiment":0.032},{"id":273446474,"title":"Chicago Mayor Johnson Goes on Attack Against the 'Evilness' of Donald Trump's Immigration Plan","text":"Chicago Mayor Brandon Johnson spoke Saturday for the first time in response to Donald Trump’s plans to ramp up deportation operations in Chicago, and delivered a diatribe filled with left-wing talking points but little else.\n\nThe self-described “progressive” Democrat mayor appeared on CNN host Victor Blackwell’s “First of All” podcast on Saturday, but despite being asked over and over about whether or not he would block Trump’s deportation efforts, Johnson refused to answer and instead spewed a constant stream of anti-Trump talking points and liberal doggerel.\n\nBlackwell opened his podcast asking the mayor, “Let’s start here your reaction to Homan saying he’s going to come after you if you stand in his way.”\n\n“Well, you know, unfortunately — first of all, good morning and Merry Christmas and Happy Holidays and Happy New Year to the people of the globe,” the mayor began. “Look the president elect and the former president of the United States of America, Trump, has demonstrated an incredible disdain for people, and my responsibility as Mayor of the City of Chicago is to invest in people, to protect people, and connect them to the resources that are ultimately needed in order to build not just a better, stronger, safer Chicago, but to build in the economy that’s sustainable,” Johnson said while working to avoid the question.\n\n“You know, this President has shown disdain towards not just immigrants, but lovers of public education. He is dead set on abolishing the entire education department. As a former public school teacher, as a product of public education, as someone who sends my children to public schools; working people around this country want public education to work,” Johnson said, continuing with his anti-Trump talking points.\n\n“He has shown an incredible animus towards public housing. Public Housing has been the way in which families have found true stability, their ability to experience a human right. He has demonstrated contempt towards vouchers, which would ultimately make it hard for families to access affordable homes. We built 3600 affordable homes in the city of Chicago since I’ve been in office,” the left-wing mayor said, patting himself on the back.\n\n“He’s also shown a great deal of evilness towards the Department of the Environment. He doesn’t believe in science. Twenty percent of the world’s fresh water is right here in the city of Chicago. We can build a green, blue economy to create real, sustainable opportunities for people. And so he has not just shown animus towards immigrants. He has shown a great deal of animus towards working people across the city of Chicago, and it is my responsibility, and is my joy, to protect all residents of this beloved city,” he said, still avoiding Blackwell’s actual question.\n\nBlackwell then played a clip of Trump border czar Tom Homan, who said he was asking for Democrat-controlled police departments to let Immigration and Customs Enforcement (ICE) agents know the whereabouts of criminal illegals.\n\n“I don’t want them to be immigration officers,” Homan said of police departments in the clip Blackwell played. “I want them, when they arrest an illegal alien for a serious crime, I’m just asking them to tell us where to find them. I don’t want you to hold a minute more. You have to hold them under your charges. But just work with us and take these public safety threats, not only off the streets but on the country. ”\n\nBlackwell then honed his question to a sharper point and asked Johnson, “So let me, let me ask you specifically, if you have someone in CPD who takes custody of someone who fits that scenario, that profile, accused of a violent crime in the country illegally, does local law allow you to inform ICE? And will you do that?”\n\nJohnson again went off with left-wing talking points and refused to actually answer the question.\n\n“Here’s what the local law does. First of all, you know, as a sanctuary city. You know, this ordinance was birthed by the first black mayor in the history of Chicago, Mayor Harry Washington. He understood during the Reagan administration, as foreign policies disrupted Central and South America, he made it very clear that the city of Chicago will serve as refuge for people around the globe. And so there’s a strong black liberation presentation that comes out of the city of Chicago as it relates to being a sanctuary city,” Johnson exclaimed.\n\n“Look, the law is very clear. Local police officers are not federal agents. That is clear. This so-called border czar seems to be getting educated more and more throughout you know, you know his, I guess, his speaking tour. It’s unfortunate, though, that there is an abominable ignorance that exists within the Trump administration that continues to displace and cause chaos,” Johnson said in his well-worn accusatory manner.\n\nThe rest of the interview was equally useless as CNN’s Blackwell pressed Johnson on the point several times and asked the mayor if his city’s sanctuary ordinances prevent the police from informing ICE about the presence in the city’s jails of illegal aliens, or if he — as mayor — simply intends to enforce a personal policy of preventing that cooperation. But the mayor refused to directly answer the question and instead danced around the issue, repeatedly falling back on the canard that “the police are not immigration agents” when no one — including Homan — has ever said they are or should be.\n\nLater in the interview, Johnson also made the false claim that Jesus of Nazareth was a “refugee” when he was born.\n\n“There are people all across this country who are going to celebrate this holiday season about the birth of Jesus Christ who fleed [sic] political and religious oppression as a refugee, as an asylum seeker,” Johnson blurted out.\n\nNone of this is true, of course. Christ’s parents were not “refugees,” or “asylum seekers,” and he was not born while they were “fleeing” anywhere. Christ’s parents, Mary and Joseph, were filing their taxes in their visit to Bethlehem, not fleeing their home.\n\nRegardless, despite a constant stream of false claims, incorrect factoids, and liberal talking points, Johnson never did tell Blackwell’s audience if he intended to use the Chicago Police Department to physically oppose ICE agents from performing their duties to round up and deport illegal aliens from the Windy City.\n\nFollow Warner Todd Huston on Facebook at: facebook.com/Warner.Todd.Huston, or Truth Social @WarnerToddHuston","summary":"Chicago Mayor Brandon Johnson spoke Saturday for the first time in response to Donald Trump's plans to ramp up deportation operations in Chicago, and delivered a diatribe filled with left-wing talking points but little else.\n\n\nThe post Chicago Mayor Johnson Goes on Attack Against the &#8216;Evilness&#8217; of Donald Trump&#8217;s Immigration Plan appeared first on Breitbart.","url":"https://www.breitbart.com/immigration/2024/12/15/chicago-mayor-johnson-goes-attack-against-evilness-donald-trumps-immigration-plans/","image":"https://media.breitbart.com/media/2024/12/GettyImages-2166794993-640x335.jpg","video":null,"publish_date":"2024-12-15 23:32:57","author":"Warner Todd Huston","authors":["Warner Todd Huston"],"language":"en","category":"politics","source_country":"US","sentiment":-0.12},{"id":273433158,"title":"Why Trump Won: Americans Optimistic Their Finances Will Improve in 2025","text":"Almost half of Americans are expecting their personal financial outlook to better next year, after Donald Trump takes office again. \n\nThe economy really was a deciding factor, if not the deciding factor, in the 2024 election as polling indicated. And while the inflation rate has supposedly gone down, this is often deceptive, not only because the federal government under Biden tends to play around with numbers, but also because inflation has continued to go up even as the rate “slows.” Prices still increase. So inflation is still catastrophic, as we all know. But Trump, unlike Biden and Harris, is serious about making America prosperous again.\n\nIs that why more than 40% of Americans are feeling more optimistic about their financial future?\n\nFox Business reported that a previous July survey from Discover Personal Loans found that a staggering 80% of Americans were experiencing “some level” of financial anxiety. That of course played a role in the election results. But that pessimism is starting to change.\n\nKamala Harris's economy has been an unmitigated disaster for American citizens. This is what happens when you bring in 20M+ low-wage workers through the wide open southern border.The American people get screwed while Kamala's corporate benefactors enjoy unlimited cheap labor. https://t.co/lH3gsiGKUB— JD Vance (@JDVance) October 4, 2024\n\nRelated: Bidenomics: A Million Fewer Native-Born U.S. Workers Since Last Year\n\nFrom Fox Business:\n\nBankrate said Thursday its survey found that 44% of American adults expect to see their financial situation become either \"somewhat\" or \"significantly better\" next year, a 7 percentage-point increase from the roughly same time last year. The survey, conducted on the personal finance site’s behalf by YouGov, took place Nov. 6, the day after the 2024 election, through Nov. 8 and involved nearly 2,500 American adults… For instance, [there’s] over one-third of Americans that anticipate they will see better personal finances in 2025 reported \"rising income\" as helping guide their positive outlook. A slightly lower share (30%) pointed to \"having less debt,\" while \"work done by elected representatives\" and \"better spending habits\" also factored into optimism for 25%.\n\nWhile Donald Trump is not listed explicitly among these reasons, it is not unreasonable to believe that people who voted for him because of his promises to bring down inflation and strengthen the economy see his election and the election of other Republicans as contributing to their potential future prosperity. After all, elected representatives were cited. \n\nFor lower income Americans, of course, inflation has hit hardest. And despite Biden-Harris propaganda, this is an ongoing struggle:\n\nInflation also had the most weight for U.S. adults anticipating worsening finances. That was followed by \"work done by elected representatives\" cited by 30%, \"stagnant or reduced income\" cited by 28% and debt holdings by 20%, among other factors, according to Bankrate. \n\nRead Also: California Restaurateur: Sales Nearly Doubled Post Trump Victory\n\nIt is interesting to note that even in California, restaurants saw business increase right after the election. Hopefully people’s optimism is justified under Trump and JD Vance next year, and Bidenomics will soon become a nightmare of the past.","url":"https://pjmedia.com/catherinesalgado/2024/12/15/why-trump-won-americans-optimistic-their-finances-will-improve-in-2025-n4935149","image":"https://media.townhall.com/cdn/hodl/2024/347/afe036a4-5f60-4cb5-b65c-5cfb83feef6a.jpg","video":null,"publish_date":"2024-12-15 23:27:22","author":"Catherine Salgado","authors":["Catherine Salgado"],"language":"en","category":"politics","source_country":"us","sentiment":-0.364},{"id":273433062,"title":"Last Trump tariff war helped India: Study","text":"The previous Donald Trump administration’s tariff war with China created new winners in US markets with countries like India, Mexico, Vietnam, Canada, South Korea and Germany expanding their exports and expected boost to local manufacturing not materialising, according to an analysis by Global Trade Research Initiative (GTRI). WIth the coming back of Donald Trump, a new tariff war is expected which might further realign world trade and offer more opportunities for India and other similarly placed countries, the trade policy think tank said in its report. The last time Donald Trump was US president the trade war was initiated in 2018 by tariffs on key commodities like steel and aluminium. Later its scope was expanded and this led to $ 81.56 billion decline in China’s exports to the US between 2017 and 2023. Despite this the overall US trade deficit widened as imports shifted to non-Chinese sources, bypassing tariffs through free trade agreements. Key beneficiaries of the trade war included Mexico, Canada, and Association of Southeast Asian Nations (ASEAN), which collectively accounted for 57% of the growth in US imports. India also emerged as a significant gainer, with exports to the U.S. rising by $36.8 billion, driven by sectors like electronics, pharmaceuticals, and engineering goods. Also ReadRBI intervention ensures rupee stability in CY24 The trade war created new export opportunities for several countries, with Mexico emerging as the biggest winner. Mexico’s exports to the U.S. increased by $164.3 billion between 2017 and 2023. Canada followed with $124.0 billion, and Vietnam came third with $70.5 billion. South Korea ($46.3 billion) and Germany ($43.0 billion) completed the top five. e “India ranked sixth, with a $36.8 billion increase in exports, driven by growth in electronics, pharmaceuticals, and engineering goods. Other significant gainers included Ireland ($33.6 billion), Thailand ($26.5 billion), Italy ($23.8 billion), and Singapore ($21.1 billion),” GTRI founder Ajay Srivastava said. Much of this growth for Mexico was driven by the US Mexico-Canada Agreement (USMCA), which enabled tariff-free trade, and Vietnam’s gain came from the Free Trade Agreement with the US. Trump’s proposed 25% tariffs on Canada and Mexico could undermine the USMCA, while proposed higher tariffs on products made by Chinese firms in ASEAN countries signal continued trade tensions, he said. “One of the reasons for the increase in exports from Mexico and ASEAN is growing Chinese investments in the manufacturing sector in these regions. In Mexico, the focus is on sectors like automotive, electronics, and heavy machinery. In ASEAN countries such as Vietnam, Thailand, and Indonesia, Chinese investments target electronics, textiles, and automotive sectors,” GTRI report said. Between 2017 and 2023, China’s exports to the US declined, and its exports to other countries surged. China’s global exports surged by $1.1 trillion, growing from $2.3 trillion to $3.4 trillion during 2017 and 2023, offsetting its losses in the US market. For dealing with new challenges and opportunities India post January 20 when Trump takes over as President, India should lower duties by modest adjustments and bring them down to 10% this will help in greater integration with global supply chains. A further boost to Make in India is crucial by focusing on value added exports in sectors like electronics, engineering goods, pharmaceuticals, and labor-intensive products. Strengthening local supply chains and producing critical intermediates can reduce reliance on China, while improving cost efficiency and ease of doing business will enhance competitiveness. While creating new capacities and capability, India must also derisk its services exports as the IT sector relies on the U.S. for 80% of its export revenue, GTRI added.","url":"https://www.financialexpress.com/policy/economy/last-trump-tariff-warnbsphelped-india-study/3692234/","image":"https://www.financialexpress.com/wp-content/uploads/2024/12/trump_shutdown-1_20241215154442.jpg","video":null,"publish_date":"2024-12-15 23:26:22","author":"Fe Bureau","authors":["Fe Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":0.406},{"id":273433138,"title":"Trump gets $15m in ABC News defamation case","text":"ABC News has agreed to pay $15m (£12m) to US President-elect Donald Trump to settle a defamation lawsuit after its star anchor falsely said he had been found “liable for rape”.\n\nGeorge Stephanopoulos made the statements repeatedly during an interview on 10 March this year while challenging a congresswoman about her support for Trump.\n\nA jury in a civil case last year determined Trump was liable for “sexual abuse”, which has a specific definition under New York law.\n\nAs part of Saturday’s settlement, first reported by Fox News Digital, ABC will also publish a statement expressing its “regret” for the statements by Stephanopoulos.\n\nAccording to the settlement, ABC News will pay $15m as a charitable contribution to a “Presidential foundation and museum to be established by or for Plaintiff, as Presidents of the United States of America have established in the past”.\n\nThe network also agreed to pay $1m towards Trump’s legal fees.\n\nUnder the settlement, the network will post an editor’s note to the bottom of its 10 March 2024 online news article about the story.\n\nIt will say: “ABC News and George Stephanopoulos regret statements regarding President Donald J Trump made during an interview by George Stephanopoulos with Rep. Nancy Mace on ABC’s This Week on March 10, 2024.”\n\nAn ABC News spokesperson said in a statement the company was “pleased that the parties have reached an agreement to dismiss the lawsuit on the terms in the court filing”.\n\nIn 2023, a New York civil court found Trump sexually abused E Jean Carroll in a dressing room at a department store in 1996. He was also found guilty of defaming the magazine columnist.\n\nJudge Lewis Kaplan said the jury’s conclusion was that Ms Carroll had failed to prove that Trump raped her “within the narrow, technical meaning of a particular section of the New York Penal Law”.\n\nJudge Kaplan noted that the definition of rape was “far narrower” than how rape is defined in common modern parlance, in some dictionaries and in criminal statutes elsewhere.\n\nIn a separate case, also presided over by the same judge, a jury ordered Trump to pay $83.3m to Ms Carroll for additional defamatory statements.\n\nDuring the 10 March broadcast, Stephanopoulos asked South Carolina Republican congresswoman Nancy Mace how she could endorse Trump.\n\nThe anchor falsely said “judges and two separate juries have found him liable for rape”.\n\nStephanopoulos repeated the claim 10 times throughout the broadcast.\n\nAhead of the ruling, a federal magistrate judge had ordered Trump and Stephanopoulos to give sworn evidence at depositions next week.\n\nTrump has also sued CBS, the BBC’s US broadcast partner, for “deceptive conduct” over an interview with Kamala Harris.\n\nIn 2023, a judge threw out his defamation lawsuit against CNN, in which he alleged the network had likened him to Adolf Hitler.\n\nHe has also had lawsuits filed against the New York Times and the Washington Post dismissed. (BBC News)","url":"https://barbadosgazette.com/trump-gets-15m-in-abc-news-defamation-case/","image":"https://barbadosgazette.com/app/uploads/2024/12/NEW-PRISON-BOOS-E3kl7e.jpeg","video":null,"publish_date":"2024-12-15 23:26:22","author":null,"language":"en","category":"politics","source_country":"bb","sentiment":-0.17},{"id":273432918,"title":"Israel plans to double population on occupied Golan, cites threats from Syria","text":"Israel agreed on Sunday (December 15, 2024) to double its population in the occupied Golan Heights while saying threats from Syria remained despite the moderate tone of rebel leaders who ousted President Bashar al-Assad a week ago.\n\n\"Strengthening the Golan is strengthening the State of Israel, and it is especially important at this time. We will continue to hold onto it, cause it to blossom, and settle in it,\" Prime Minister Benjamin Netanyahu said in a statement.\n\nIsrael captured most of the strategic plateau from Syria in the 1967 Six-Day War, annexing it in 1981.\n\nIn 2019, then-President Donald Trump declared U.S. support for Israeli sovereignty over the Golan, but the annexation has not been recognised by most countries. Syria demands Israel withdraw but Israel refuses, citing security concerns. Various peace efforts have failed.\n\n\"The immediate risks to the country have not disappeared and the latest developments in Syria increase the strength of the threat — despite the moderate image that the rebel leaders claim to present,\" Defence Minister Israel Katz told officials examining Israel's defence budget, according to a statement.\n\nMr. Netanyahu's office said the government unanimously approved a more than 40-million-shekel ($11 million) plan to encourage demographic growth in the Golan.\n\nIt said Mr. Netanyahu submitted the plan to the government \"in light of the war and the new front facing Syria, and out of a desire to double the population of the Golan\".\n\nSome 31,000 Israelis have settled there, said analyst Avraham Levine of the Alma Research and Education Center specialising in Israel's security challenges on its northern border. Many work in farming, including vineyards, and tourism. The Golan is home to 24,000 Druze, an Arab minority who practice an offshoot of Islam, Levine said. Most identify as Syrian.\n\nAvoiding ‘new confrontations’\n\nSyria's de facto leader, Ahmad al-Sharaa, said on Saturday (December 14, 2024) that Israel was using false pretexts to justify its attacks on Syria, but that he was not interested in engaging in new conflicts as his country focuses on rebuilding.\n\nMr. Sharaa - better known as Abu Mohammed al-Golani - leads the Islamist Hayat Tahrir al-Sham (HTS) group that swept Assad from power last Sunday, ending the family's five-decade iron-fisted rule.\n\nSince then Israel has moved into a demilitarised zone inside Syria that was created after the 1973 Arab-Israeli war, including the Syrian side of the strategic Mount Hermon that overlooks Damascus, where its forces took over an abandoned Syrian military post.\n\nIsrael, which has said that it does not intend to stay there and calls the incursion into Syrian territory a limited and temporary measure to ensure border security, has also carried out hundreds of strikes on Syria's strategic weapons stockpiles.\n\nIt has said it is destroying strategic weapons and military infrastructure to prevent them from being used by rebel groups that drove Assad from power, some of which grew from movements linked to al Qaeda and Islamic State.\n\nSeveral Arab countries, including Saudi Arabia, the United Arab Emirates and Jordan, have condemned what they called Israel's seizure of a buffer zone in the Golan Heights.\n\n\"Syria's war-weary condition, after years of conflict and war, does not allow for new confrontations. The priority at this stage is reconstruction and stability, not being drawn into disputes that could lead to further destruction,\" Mr. Sharaa said in an interview published on the website of Syria TV, a channel that sides with the rebels.\n\nHe also said diplomatic solutions were the only way to ensure security and stability and that \"uncalculated military adventures\" were not wanted.","url":"https://www.thehindu.com/news/international/israel-plans-to-double-population-on-occupied-golan-cites-threats-from-syria/article68989214.ece","image":"https://th-i.thgim.com/public/incoming/ixknkn/article68989639.ece/alternates/LANDSCAPE_1200/2024-12-15T161251Z_2002858278_RC2PPBAPHNE8_RTRMADP_3_SYRIA-SECURITY-GOLAN-HEIGHTS.JPG","video":null,"publish_date":"2024-12-15 23:25:22","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.122}]}