{"offset":0,"number":50,"available":15515,"news":[{"id":300340392,"title":"Marc Maron Calls Out Bill Maher for Agreeing With “Some of the Things That Trump Is Doing”","text":"Marc Maron is calling out fellow comedian Bill Maher for agreeing with “some of the things” that President Donald Trump has done during his time in the White House.\n\n On a recent episode of the WTF with Marc Maron Podcast — which also featured former CNN host W. Kamau Bell — the host criticized comedians who talk about controversial political news but then “get into a certain mania with that stuff to where you’re not even humanizing it.”\n\n Maron added, “All these people that are still sort of speaking about this as if it’s a presidency. It’s like when are you guys going to wake the fuck up?”\n\n The host proceeded to namedrop Bill Maher, who hosts his own political talk show, HBO’s Real Time With Bill Maher, for his perspective on Trump and some of the president’s controversial policies.\n\n “Are you going to be like Bill Maher, where it’s like, ‘I’m going to agree with some of the things that Trump is doing,’” Maron said. “It’s like, dude, you’re a bitch.”\n\n He then made fun of Maher for attempting to connect with Trump supporters, such as Kid Rock (who was a recent guest on Real Time). “‘You know, Kid Rock. I like Kid Rock,” Maron said in his best Maher voice, before adding. “It’s like, do you? And now you’re gonna blow him with a slightly disdainful look on your face? And that’s who you are?”\n\n The Hollywood Reporter reached out to Maher’s rep for comment. The comedian has been outspoken about his moderately democratic views for years, describing himself as “an old-school liberal.”\n\n Maron has previously been critical of “comedians with podcasts” having “shameless, self-proclaimed white supremacists and fascists on their show to joke around like they are just entertainers or even just politicians.” He shared a blog post in October, shortly after Trump appeared on Joe Rogan’s podcast before the 2024 election. \n\n “Even though I do not do a political show I have been very clear in my specials and on the podcast that I believe, and have believed for years, what is brewing in this country is an American fascist movement rooted half in grievance and half in Jesus and enabled by tech oligarchs and an inundation of propaganda from many sources,” he wrote in the post. “Well, it’s fully percolated and pouring into the minds of all of us. It is shameless and proud. Culturally, the combination of blatant racist fear mongering and the anti-woke movement has delivered their message for the future. A future that marginalizes almost all voices. \n\n Maron continued at the time, “The anti-woke flank of the new fascism is being driven almost exclusively by comics, my peers. Whether or not they are self-serving or true believers in the new fascism is unimportant. They are of the movement. Whether they see themselves as acolytes or just comics doesn’t matter. Whether they are driven by the idea that what they are fighting for is a free speech issue or whether they are truly morally bankrupt racists doesn’t matter. They are part of the public face of a fascist political movement that seeks to destroy the democratic idea.”","summary":"Maher, who hosts HBO's 'Real Time,' has called himself \"an old-school liberal\" for years.","url":"https://www.hollywoodreporter.com/news/politics-news/marc-maron-slams-bill-maher-agreeing-with-trump-1236164337/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2025/03/Marc-Maron-Bill-Maher-getty-H-2025.png","video":null,"publish_date":"2025-03-15 01:02:38","author":"Carly Thomas","authors":["Carly Thomas"],"language":"en","category":"politics","source_country":"us","sentiment":-0.027},{"id":300340176,"title":"U.S. aligns with G7, urges Russia to accept Ukraine ceasefire","text":"LA MALBAIE, Quebec - The United States drew closer to its Group of Seven allies Friday, at least momentarily, to back Ukraine's territorial integrity and warn Russia to follow Kyiv in accepting a ceasefire or face possible further sanctions.Their joint foreign ministers' communique followed weeks of tension between U.S. allies and President Donald Trump over his upending of Western trade, security and Ukraine-related policy.G7 officials had feared they would not be able to agree on an all-encompassing document touching on geopolitical issues from across the world, divisions that they said could have played into the hands of both Russia and China.","summary":"In a joint statement, the U.S. backed Ukraine's territorial integrity and warned Russia to follow Kyiv in accepting a ceasefire or face possible further sanctions.","url":"https://www.japantimes.co.jp/news/2025/03/15/world/politics/us-g7-russia-ukraine-unity/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/03/15/457292.JPG?v=3.1","video":null,"publish_date":"2025-03-15 00:55:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.117},{"id":300339194,"title":"Democrats Take Fight to Republicans' Own Turf With 'People's Town Halls'","text":"Democrats have announced a series of \"People's Town Halls\" as a form of counterprogramming after several high-profile protests derailed Republican town halls, prompting GOP leadership to advise party members to stop holding the events.Newsweek reached out to the Democratic National Committee (DNC) via email on Friday afternoon for comment.Why It MattersRepublicans have faced nearly relentless heckling at recent town halls as constituents berated lawmakers over cuts made by the Department of Government Efficiency (DOGE), an unofficial agency created through executive order and nominally led by Elon Musk.President Donald Trump last week dismissed the controversy as the work of \"paid troublemakers,\" and Republican leaders have speculated that Democrats organized the protests. They advised party members to stop holding the town halls, although some have continued to do so.What To KnowThe DNC, Democratic Congressional Campaign Committee (DCCC), the Association of State Democratic Committees (ASDC) and Democratic state parties on Friday announced that they will host a series of \"in-person public events\" in every state but focusing on districts with Republican representatives.The first slate of the People's Town Halls includes stops in Arizona, Colorado, Florida, Iowa, Michigan, Missouri, Nebraska and Pennsylvania:\nColorado's 8th Congressional District, represented by Republican Representative Gabe Evans\nFlorida's 13th Congressional District, represented by Republican Representative Anna Paulina Luna\nIowa's 3rd Congressional District, represented by Republican Representative Zach Nunn\nMichigan's 10th Congressional District, represented by Republican Representative John James\nMissouri's 2nd Congressional District, represented by Republican Representative Ann Wagner\nNebraska's 2nd Congressional District, represented by Republican Representative Don Bacon\nPennsylvania's 7th Congressional District, represented by Republican Representative Ryan Mackenzie\nPennsylvania's 8th Congressional District, represented by Republican Representative Rob Bresnahan\nRecently elected DNC Chair Ken Martin chided his counterparts, saying that \"working families deserve to have their voices heard, even if Republicans want to ignore them.\"\"Instead of facing their constituents, they're running scared and hiding from the people they were elected to represent,\" Martin said. \"If they won't talk to their own voters, then Democrats will. That's why we'll be hosting People's Town Halls in all 50 states across the country, starting now with vulnerable GOP-held target districts.\"House Speaker Mike Johnson last week urged Republican lawmakers to stop holding in-person town halls in the face of angry crowds, saying at a news conference: \"We've seen this movie before.\"\"They're professional protesters,\" Johnson said, repeating Trump's claims that the demonstrations are driven by paid activists. \"So why would we give them a forum to do that right now?\"But North Carolina Representative Chuck Edwards still held an event this week, during which several guests took issue with the cuts to veterans assistance. Videos of hecklers yelling at Edwards have racked up over 1 million views in just days.What People Are SayingMartin wrote on X, formerly Twitter: \"I'm excited to announce that [The Democrats] are partnering with the [DCCC] and [Dem State Parties] to host People's Town Halls in all 50 states, starting in vulnerable red districts. If Republicans won't face voters about the Trump-Musk chaos, we will. I'll see you out there.\"Democratic Minnesota Governor Tim Walz earlier this week wrote on X: \"People want to make their voices heard, but their congressmen are hiding in Washington and refusing to do town halls. I'm going to join Democrats across the country to show up where Republicans aren't.\"Trump said in a post on Truth Social: \"Paid 'troublemakers' are attending Republican Town Hall Meetings. It is all part of the game for the Democrats, but just like our big LANDSLIDE ELECTION, it's not going to work for them!\"GOP Representative Keith Self of Texas said in a post to X: \"Disruptive Democrats are fomenting outrage with the same old tired scare tactics. But the TRUTH is on our side. Over 77 million Americans voted for President Trump's agenda.\"What Happens NextWalz will hold the first two events this weekend, according to a news release from the DNC, although they did not specify which of the states Walz would first visit. The release advised: \"A list of events and information on how to RSVP for these \"People's Town Halls\" will be coming soon.\"","summary":"The Democratic National Committee is aiming to hold events in every state, targeting Republican-held districts, led by Minnesota Governor Tim Walz.","url":"https://www.newsweek.com/democrats-take-fight-republicans-own-turf-peoples-town-halls-2045240","image":"https://d.newsweek.com/en/full/2607956/republican-town-hall-heckling-protest.jpg","video":null,"publish_date":"2025-03-15 00:53:43","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"us","sentiment":-0.114},{"id":300340602,"title":"Vance confident TikTok will be sold to US company before deadline","text":"However, Vance insisted that “there will almost certainly be a high-level agreement that I think satisfies our national security concerns, allows there to be a distinct American TikTok enterprise” during comments to NBC News on Friday. \n\n“We’re trying to close this thing by early April,” the vice president told reporters aboard Air Force Two before adding that clerical issues and technical legalities have been stalling faster progress. “I think that the outlines of this thing will be very clear. The question is whether we can get all the paper done.”\n\nThere are four different groups looking at acquiring TikTok, according to comments President Donald Trump made earlier this week. The president did not identify the entities. \n\nTikTok was initially set to be banned in January. However, Trump signed an executive order that month giving the social media platform until April to fund a U.S. buyer. \n\nTrump said earlier this month he would “probably” grant TikTok another extension if it fails to meet the April 5 deadline. \n\nTRUMP WILL ‘PROBABLY’ EXTEND TIKTOK SALE DEADLINE IF AGREEMENT NOT REACHED\n\nVance said Friday that the administration would prefer to get a deal done without another extension but added that creating “thousands of legal documents” to seal the buyout was a painstakingly long process. \n\n“I think the question is, what is the equity ownership of the new joint venture? How do you do the contracts for all the investors, the customers, the service providers? … The deal itself will be very clear, but actually creating those thousands and thousands of pages of legal documents, that’s the one thing that I worry could slip,” he said.","summary":"Vice President JD Vance expressed optimism TikTok will meet an early April deadline requiring it to find a U.S. buyer or face a ban in the country.  TikTok is owned by ByteDance, a China-based company, giving rise to concerns that Beijing could use the popular app to steal millions of Americans’ data and pose a [&#8230;]","url":"https://www.washingtonexaminer.com/policy/technology/3348852/vance-confident-tiktok-sold-us-company-before-deadline/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/03/JD-Vance-March-14.webp","video":null,"publish_date":"2025-03-15 00:50:44","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","source_country":"us","sentiment":-0.542},{"id":300338698,"title":"US govt shutdown in balance after top Democrat avoids fight","text":"WASHINGTON: The US Senate appeared closer Friday to avoiding an economically damaging government funding shutdown after the Democrats’ top leader shied away from a major confrontation with President Donald Trump, prompting backlash from the left.\n\nDemocrats are smarting over Trump’s radical spending cuts which have shredded entire sections of government and seen Congress largely bypassed in what critics say is an unconstitutional exercise of power by the White House.\n\nMany in the party argue that refusing to back the Republican bill funding the US government for another six months would be a chance for Democrats to demonstrate opposition to the Trump project. Republicans have a slim majority with 53 of the 100 senators, but need some Democratic support to reach the necessary 60 votes for getting their bill through.\n\nAhead of the Friday midnight deadline, top Senate Democrat Chuck Schumer — who has long insisted that it is bad politics to shut down the government — said he would support the bill.\n\nA Democratic blockade of the bill and the ensuing chaos of the entire US government temporarily being out of funds would be “a gift” to Trump, he said. Many senior Democrats were furious at Schumer but early Friday, Trump signaled his pleasure at the climbdown.\n\n“Congratulations to Chuck Schumer for doing the right thing - Took “guts” and courage!” Trump wrote on his Truth Social platform.\n\nAmong those incensed by Schumer’s decision was former House speaker Nancy Pelosi, who issued a pointed statement Friday in apparent defiance of the Senate minority leader, calling the vote “a false choice between a government shutdown or a blank check that makes a devastating assault on…working families across America.”\n\n“Let’s be clear: neither is a good option for the American people. But this false choice that some are buying instead of fighting is unacceptable.”","summary":"WASHINGTON: The US Senate appeared closer Friday to avoiding an economically damaging government funding shutdown after the Democrats’ top leader shied away from a major confrontation with President Donald Trump, prompting backlash from the left.\n\n\nDemocrats are smarting over Trump’s radical spending cuts which have shredded entire sections of government and seen Congress largely bypassed in what critics say is an unconstitutional exercise of power by the White House.\n\n\nMany in the party argue that refusing to back the Republican bill funding the US government for another six months would be a chance for Democrats to demonstrate opposition to the Trump project. Republicans have a slim majority with 53 of the 100 senators, but need some Democratic support to reach the necessary 60 votes for getting their bill through.\n\n\nAhead of the Friday midnight deadline, top Senate Democrat Chuck Schumer — who has long insisted that it is bad politics to shut down the government — said he would support the bill.\n\n\nA Democr","url":"https://www.brecorder.com/news/40353067/us-govt-shutdown-in-balance-after-top-democrat-avoids-fight","image":"https://i.brecorder.com/large/2025/03/150547141fce761.jpg?r=054719","video":null,"publish_date":"2025-03-15 00:47:26","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.505},{"id":300339286,"title":"'The View' co-hosts cheerlead for Rosie O'Donnell fleeing to Ireland to escape Trump","text":"Multiple co-hosts of \"The View\" expressed support for comedian and former \"View\" host Rosie O’Donnell’s permanent move to Ireland, saying it’s a fair response to Donald Trump being the President of the United States. During Friday’s episode of the ABC daytime talk show, co-hosts Ana Navarro and Sunny Hostin defended O'Donnell's decision, noting that America is becoming a difficult place to live for people like her. Hostin said that America \"doesn’t seem to be working for everyone,\" suggesting that O’Donnell’s freedom is somehow threatened by a second Trump term. TRANS ACTIVIST DYLAN MULVANEY DERIDES TRUMP-ERA GENDER ORDERS The discussion followed O’Donnell revealing this week that she has been living in Ireland for nearly two months following Trump’s 2024 election. In a recent TikTok video, the celebrity came clean about her new home, stating, \"It’s been pretty wonderful, I have to say. And the people have been so loving, so kind and so welcoming. And I’m very grateful.\" The gay comedian added that she moved to the country on Jan. 15, five days before Trump’s inauguration. \"Although I was someone who never thought I would move to another country, that’s what I decided would be the best for myself and my 12-year-old child,\" she said, noting that she has been in the process of getting her Irish citizenship. O'Donnell and Trump have been involved in a feud since 2006 after she criticized him on \"The View\" about his leniency toward a Miss USA winner who had been accused of drug use and other bad behavior. TRUMP 'HOPES' PUTIN AGREES TO CEASEFIRE AS MOSCOW SIGNALS NO TRUCE YET Trump responded by slamming her as a \"real loser,\" and the two have been at odds ever since. O’Donnell would eventually describe receiving the \"most bullying I ever experienced in my life\" since the start of their feud, and has opposed Trump’s political career at every step. Navarro stated that O’Donnell was right to leave, considering the treatment she had gotten from Trump over the years, and the threat Trump allegedly represents while in office again. \"But I do know if you’re Rosie O’Donnell, who he hates and – in fairness, she hates him, it’s mutual – and you are listening to him threaten Liz Cheney, and you’re looking at him go after law firms, and you are listening to him saying he’s coming back to be the retribution, and you know how ruthless and vicious he is, and that he personally hates you, and you have a 12-year-old with special needs… then you make the hard decision of leaving.' she said. \"Good for her,\" Navarro added. \"She’s fought for her entire life. She’s putting herself first. I’m very supportive.\" Alyssa Farah Griffin wasn’t buying the suggestion that America isn’t a free place for some under Trump. \"I do think it’s important to remember that America’s bigger than the president,\" she said. ELLEN DEGENERES AND PORTIA DE ROSSI REPORTEDLY FLEE US AMID TRUMP VICTORY \"This country is bigger than who is president for four years,\" Griffin later added. \"I just think it’s important people remember — there are places I wouldn’t be able to get IVF treatments in Europe. Like we put – and love my European friends – but we put everyone else on this pedestal and act like America is so backward and broken. It’s not.\" Siding with Navarro, Hostin pushed back, \"It’s a pretty young democracy that doesn’t seem to be working right now.\" \"I believe more in America than Donald Trump’s ability to ruin it,\" Griffin interjected. Hostin argued back, stating that leaving the country is O’Donnell’s \"prerogative,\" as the country \"doesn’t work for her family and she is one of the few people that can pick her life up and move it somewhere.\" \"Most of us are stuck here,\" the co-host added. CLICK HERE TO GET THE FOX NEWS APP","summary":"&quot;The View&quot; co-hosts Sunny Hostin and Ana Navarro defended Rosie O&apos;Donnell fleeing the country to escape President Trump&apos;s time in the White House.","url":"https://www.foxnews.com/media/the-view-co-hosts-cheerlead-rosie-odonnell-fleeing-ireland-escape-trump","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/the-view-rosie.png?ve=1&tl=1","video":null,"publish_date":"2025-03-15 00:47:25","author":"Gabriel Hays","authors":["Gabriel Hays"],"language":"en","source_country":"us","sentiment":0.014},{"id":300339848,"title":"Prominent American billionaires criticize Trump: ‘The economy is getting weaker right now’","text":"Billionaires Jamie Dimon and Larry Fink have both begun to express their concern about the impact of Donald Trump’s policies on the US economy. \n\nJPMorgan Chase CEO Dimon, who has had a bumpy relationship with the President, warned this week that the uncertainty around tariffs is ‘not a good thing’ for business.\n\nThis was a marked turn from his blunt response two months ago when asked about people protesting Trump’s tariff proposals, when he told them to ‘get over it.’\n\nFellow billionaire Fink, who is CEO of investment management company BlackRock, also said on Wednesday that the volatility around the policy changes is already hurting the economy. \n\nTrump has proposed sweeping tariffs on Mexico and Canada, which have been delayed twice. \n\nOn Thursday, he also threatened a giant 200 percent duty on champagne and wine from the European Union. \n\nUncertainty around these proposals has spooked the stock market. The S&P 500 has fallen 10 percent since its peak on February 19, which investors term a ‘correction.’\n\nThe plunge is the seventh-fastest correction since records began after the Wall Street crash of 1929.\n\nFink, who has an estimated net worth of $1.2 billion, said that the Trump administration’s barrage of policy changes is paralyzing American consumers and businesses, CNN reported. \n\n‘The collective impact in the short run is that people are pausing, they’re pulling back,’ he told the outlet. \n\n‘Talking to CEOs throughout the economy, I hear that the economy is weakening as we speak.’\n\nThe administration has also been aggressively laying off federal workers across many departments. \n\nFink said the uncertainty sowed by these dramatic changes is unsettling companies and federal workers, and it remains to be seen what effect this could have long term.\n\n‘All of these things have that ripple effect, and we will see over a long cycle whether this ripple effect gets worse or does it stabilize,’ he said. \n\nHowever he added that he was still ‘very bullish on America,’ and said that the administration’s policies, including tariffs, could be beneficial for the economy over time. \n\n‘Right now the president is focusing on tariffs, but when he talks about reciprocal tariffs, actually, that may bring down tariffs over the long run.’\n\nFink has previously faced backlash from Republican-led states over his company’s climate targets. \n\nBut he reportedly spoke to the President directly to discuss BlackRock’s purchase of two Panama Canal ports which would shift them into American hands, according to Fortune. \n\nTrump has pledged to seize the Panama Canal, which is a key waterway that facilitates hundreds of billions of dollars of trade annually.\n\n‘The decision was purely economic, and we believe this is going to be great long term investment,’ Fink told CNN. \n\n‘My conversation with the president was positive, it was optimistic… but if it was four months earlier, I would have been calling the prior administration.’ \n\nJPMorgan CEO Dimon, meanwhile, who is worth an estimated $2.3 billion, appeared to change his tune by expressing his concerns about the impact of tariffs in an interview with Semafor on Wednesday. \n\n‘I don’t think the average American consumer who wakes up in the morning and goes to work… changes what they’re going to do because they read about tariffs,’ he said.\n\n‘But I do think companies might. Uncertainty is not a good thing.’\n\nDimon has had a bumpy relationship with the President in the past. \n\nHe was forced to publicly deny that he had endorsed Trump during his presidential campaign in October, and reportedly privately backed his rival Kamala Harris.\n\nBut Dimon surprised some people when he was originally asked about tariffs in January at the World Economic Forum in Davos, Switzerland. \n\n‘If it’s a little inflationary, but it’s good for national security, so be it. I mean, get over it,’ Dimon told CNBC at the time.\n\n‘National security trumps a little bit more inflation.’","summary":"Internewscast Journal\n\nInternewscast\n\n\nBillionaires Jamie Dimon and Larry Fink have both begun to express their&#8230;\n\n\nThis Post: Prominent American billionaires criticize Trump: &#8216;The economy is getting weaker right now&#8217; first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/prominent-american-billionaires-criticize-trump-the-economy-is-getting-weaker-right-now/","image":"https://i.dailymail.co.uk/1s/2025/03/14/16/96202075-14499229-JPMorgan_Chase_CEO_Dimon_who_has_had_a_bumpy_relationship_with_t-a-7_1741971536543.jpg","video":null,"publish_date":"2025-03-15 00:46:49","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.034},{"id":300338786,"title":"FBI agents want to get back to catching bad guys, ex-federal prosecutor argues","text":"to top close Video This video is playing in picture-in-picture.\n\nJesse Watters Primetime March 14, 2025 04:18 \n\n FBI agents want to get back to catching bad guys, ex-federal prosecutor argues \n Former U.S. attorney Brett Tolman discusses President Donald Trump's efforts to restore law and order at the DOJ on 'Jesse Watters Primetime.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard Tags JESSE WATTERS PRIMETIMESHOWSWHAT TO WATCH | VIDEOSLATEST NEWS | VIDEOSON AIRTRUMP'S FIRST 100 DAYSDONALD TRUMP","summary":"Former U.S. attorney Brett Tolman discusses President Donald Trump&apos;s efforts to restore law and order at the DOJ on &apos;Jesse Watters Primetime.&apos;","url":"https://www.foxnews.com/video/6370059527112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1ddef9b5-e186-46ed-b6a1-1242d955decb/a6f3d1b7-9702-478f-8ddc-da9b91d3da25/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-15 00:39:52","author":null,"language":"en","source_country":"us","sentiment":-0.389},{"id":300339622,"title":"NASA astronaut's defiant seven words as her SpaceX rocket finally takes off","text":"An astronaut expressed her determination as she and three other explorers blasted off in a SpaceX rocket for International Space Station (ISS) last night.\n\nAnne McClain is one of four astronauts deployed to replace Butch Wilmore, 62 and 59-year-old Suni Williams - stuck there since June - in a long-awaited mission. SpaceX sent Ms McClain, Nichole Ayers, Takuya Onishi and Kirill Peskov in its rocket on Friday night at NASA’s Kennedy Space Centre in Florida, US.\n\nMinutes into the flight, Ms McClain, 45, said: \"Spaceflight is tough, but humans are tougher.\" She referred to the bravery she shares with the three other astronauts, including Ms Ayers, also from US and Japan's Mr Onishi.\n\nArrival is set for late Saturday night. NASA wants overlap between the two crews so Mr Wilmore and Ms Williams can fill in the newcomers on happenings aboard the orbiting lab. That would put them on course for an undocking next week and a splashdown off the Florida coast, weather permitting.\n\nThe launch was supposed to happen on Wednesday - but it was scrapped again. Concerns over a critical hydraulic system were raised just as the four astronauts had been strapped into their seats.\n\nBut the quartet is finally on its way now, so it looks likely Mr Wilmore and Ms Williams will finally return home. They expected to be gone just a week or so when they launched from Cape Canaveral in Florida on June 5, but a series of helium leaks and thruster failures marred their trip to the space station.\n\nNASA and Boeing have been investigating in the months since to try to establish how to best proceed. The saga took a political twist when President Donald Trump and SpaceX’s Elon Musk vowed earlier this year to accelerate the astronauts’ return and blamed the former administration for stalling it.\n\nRetired Navy captains who have lived at the space station before, Mr Wilmore and Ms Williams have repeatedly stressed that they support the decisions made by their NASA bosses since last summer. The two helped keep the station running — fixing a broken toilet, watering plants and conducting experiments — and even went out on a spacewalk together. With nine spacewalks, Ms Williams set a new record for women - the most time spent spacewalking over a career.\n\nThe duo's extended stay has been hardest, they said, on their families — Mr Wilmore’s wife and two daughters, and Ms Williams’ husband and mother. Besides reuniting with them, Mr Wilmore, a church elder, is looking forward to getting back to face-to-face ministering and Ms Williams can’t wait to walk her two Labrador retrievers.\n\nMr Williams said in an interview earlier this week: \"We appreciate all the love and support from everybody. This mission has brought a little attention. There’s goods and bads to that. But I think the good part is more and more people have been interested in what we’re doing” with space exploration.\"","summary":"The SpaceX rocket has blasted off for the International Space Station in a rescue mission to free Butch Wilmore and Suni Williams - and replace them with fresh astronauts","url":"https://www.mirror.co.uk/news/us-news/nasa-astronauts-defiant-seven-words-34866171","image":"https://i2-prod.mirror.co.uk/incoming/article34866207.ece/ALTERNATES/s1200/1_Top-pic-template-1.jpg","video":null,"publish_date":"2025-03-15 00:36:26","author":"Bradley Jolly","authors":["Bradley Jolly"],"language":"en","source_country":"gb","sentiment":-0.167},{"id":300339986,"title":"Starmer to urge Kiev’s allies to increase pressure on Russia to achieve ceasefire","text":"LONDON, March 15. /TASS/. UK Prime Minister Keir Starmer plans to tell leaders of 25 countries, who will attend a meeting on Ukraine on Saturday via video link that Kiev’s allies should increase the pressure put on Russia to secure a ceasefire in Ukraine.\n\n\"If Russia finally comes to the table, then we must be ready to monitor a ceasefire to ensure it is a serious, and enduring peace, if they don’t, then we need to strain every sinew to ramp up economic pressure on Russia to secure an end to this war,\" the UK prime minister’s office quoted him as saying.\n\nThe British PM accused Russia of attempts to prolong the negotiations on the conditions of the ceasefire. \"The world needs to see action, not a study or empty words and pointless conditions,\" he claimed.\n\nThe full list of participants in the meeting has not been published. The prime minister's office noted that it will be attended by leaders of the EU countries, members of the European Commission, Australia, Canada, New Zealand, and Ukraine. It is noted that Starmer will urge his counterparts to make \"concrete commitments\" to implement US President Donald Trump's peace plan, as well as to continue providing military assistance to Ukraine.\n\nDuring the meeting, the intention of the \"Coalition of the Willing\" to deploy peacekeepers in Ukraine is expected to be made more concrete.","summary":"The British PM accused Russia of attempts to prolong the negotiations on the conditions of the ceasefire","url":"https://tass.com/world/1928619","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-03-15 00:34:05","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":0.298},{"id":300338992,"title":"US Senate approves funding bill hours before shutdown deadline, sending to Trump for signature","text":"WASHINGTON - The Senate passed a Republican-led spending bill Friday hours before a government shutdown, overcoming sharp Democratic opposition to the measure and sending it to President Donald Trump to be signed into law. The essentially party-line vote, 54-46, reflected gnawing Democratic angst over how to confront the Trump administration as its Department of Government Efficiency fires federal workers and dismantles operations. Democrats argued over whether to fight even risking a shutdown and fumed that Republicans drafted a measure that included little of their input, shortchanging health care, housing and other priorities. But in the end, enough of the Democratic senators decided a government shutdown would be even worse, and backed Senate Democratic leader Chuck Schumer's strategy to allow the bill to come forward. A shutdown will allow DOGE to shift into overdrive, Schumer said. Donald Trump and Elon Musk would be free to destroy vital government services at a much faster rate. Democrats were confronted with two painful options: allowing passage of a bill they believe gives President Donald Trump vast discretion on spending decisions or voting no and letting funding lapse. All told, 10 Democrats voted to break the party's filibuster to advance the bill to a final vote. On final passage, two Democrats supported the bill, and one Republican, Sen. Rand Paul of Kentucky, opposed it. It funds the government for another six months. Schumer gave members of his caucus days to vent their frustration about the options before them, but abruptly switched course and made clear on the eve of voting that he would not allow a government shutdown. His move outraged many in the party who want to fight the Trump agenda, but gave senators room to side with Republicans and allow the continuing resolution, often described as a CR, to advance. Democrats from all corners looked to pressure senators to kill the bill. House members wrote letters, posted on social media and held press conferences in the hours before the vote. The American people sent Democrats to Congress to fight against Republican dysfunction and chaos, said a letter from 66 House Democrats to Schumer. House Democratic leader Hakeem Jeffries and his team dashed back to the Capitol urging senators to block the bill and negotiate a true compromise with Republicans. Speaker Emerita Nancy Pelosi called the bill unacceptable. Some Democrats also argued that Republicans would take the blame for a shutdown, given they controlled all the levers of power in Congress and the White House. If you refuse to put forward an offer that includes any Democratic input and you don't get Democratic votes, that's on Republicans, said Sen. Patty Murray, the top Democrat on the Senate Appropriations Committee. In contrast, Schumer picked up one unexpected nod of support - from Trump himself, who just a day earlier was gearing up to blame Democrats for any shutdown. Congratulations to Chuck Schumer for doing the right thing - Took 'guts' and courage! the president posted on his social media account. Congress has been unable to pass the annual appropriations bills designed to fund the government, so they've resorted to passing short-term extensions instead. The legislation before the Senate is the third such continuing resolution for the current fiscal year, now nearly half over. The legislation would fund the federal government through the end of September. It would trim non-defense spending by about $13 billion from the previous year and increase defense spending by about $6 billion, which are marginal changes when talking about a topline spending level of nearly $1.7 trillion. The Republican-led House passed the spending bill Tuesday and then adjourned. The move left senators with a decision to either take it or leave it. And while Democrats pushed for a vote on a fourth short-term extension, GOP leadership made clear that option was a non-starter. Senate Majority Leader John Thune, R-S.D., and others made the case that any blame for a shutdown would fall squarely on Democrats. And House Speaker Mike Johnson, R-La., said Republicans stood together to get the job done. Meanwhile, some House Democrats lashed out at their colleagues across the Capitol after the vote. The constituents I represent need Democrats to stand up to this rogue administration, said Rep. Steven Horsford, D-Nev. What they got from Senate Democrats today was capitulation instead. But Schumer said Trump would seize more power during a shutdown, because it would give the administration the ability to deem whole agencies, programs and personnel non-essential, furloughing staff with no promise they would ever be rehired. Democrats were critical of the funding levels in the bill. But they are more worried about the discretion the bill gives the Trump administration on spending decisions. Many Democrats are referring to the measure as a blank check for Trump. Spending bills typically come with specific funding directives for key programs, but hundreds of those directives fall away under the continuing resolution passed by the House. So the administration will have more leeway to decide where the money goes. For example, a Democratic memo said the bill would allow the administration to steer money away from combating fentanyl and instead use it on mass deportation initiatives. Several amendments to the bill failed, but one to eliminate funding for DOGE drew support from a Republican, Sen. Lisa Murkowski of Alaska. The spending bill before the Senate is separate from the GOP effort to extend tax cuts for individuals passed in Trump's first term and to partially pay for them with spending cuts elsewhere in government. That second package will be developed in the months ahead, but it was clearly part of the political calculus. You're looking at a one-two punch, a very bad CR, then a reconciliation bill coming down, which will be the final kick in the teeth for the American people, said Sen. Bernie Sanders, I-Vt. Sen. Tom Cotton, R-Ark., said the Democratic arguments for voting against the bill were hypocritical because they were essentially calling for shutting down the government to protect the government. Democrats are fighting to withhold the paychecks of air traffic controllers, our troops, federal custodial staff, Cotton said. They can't be serious. Senators also unanimously approved a separate bill to fix an unexpected provision in the package that would require the District of Columbia to revert to 2024 budget levels, a cut of some $1.1 billion, even though the district raises most of its own money. That bill, which now goes to House, would allow spending at 2025 levels.","summary":"The Senate narrowly passed a GOP-led spending bill to prevent a government shutdown, despite Democratic concerns over funding priorities and the Trump administration's discretionary spending control. Senate Democratic leader Chuck Schumer allowed the bill to advance, which funds the government for six months. Some Democrats criticize the decision as a capitulation.","url":"https://economictimes.indiatimes.com/news/international/global-trends/senate-approves-funding-bill-hours-before-shutdown-deadline-sending-to-trump-for-signature/articleshow/119027014.cms","image":"https://img.etimg.com/thumb/msid-119027113,resizemode-4,width-1200,height-900,imgsize-2177881,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-15 00:30:14","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.201},{"id":300338248,"title":"Trump’s nomination of hostage envoy pulled after Hamas meeting","text":"President Donald Trump’s administration is withdrawing the nomination of Adam Boehler to be its top envoy for hostage issues, but he will continue to deal with those matters as a special government employee, according to the White House..The move comes after Boehler provoked anger from Israel for meeting with Hamas over the fate of US captives held by the group..“Adam Boehler will continue to serve President Trump as a special government employee focused on hostage negotiations,” White House spokeswoman Anna Kelly said in a statement Friday. “He will continue this important work to bring wrongfully detained individuals around the world home.”.Israeli leaders had criticized Boehler over his meeting with Hamas in the Qatari capital of Doha as part of the US effort to free hostages captured in the group’s Oct. 7, 2023 attack. News of the meeting came at a delicate time with Israel and Hamas exploring whether to extend a six-week ceasefire that expired earlier this month. Israel has warned it will return to fighting if Hamas doesn’t release the remaining hostages the group holds..Senior Israeli officials including Strategic Affairs Minister Ron Dermer complained. The meeting spurred fears that the US would try to cut a deal for Hamas to release US citizens it’s still holding while keeping Israelis in captivity. Trump has sought to maintain close ties with Prime Minister Benjamin Netanyahu’s government, and Hamas is labeled a terrorist organization by the US..Boehler defended the move during an interview with Fox News Sunday last weekend..“I would say that the Israelis were kept informed,” Boehler said. “I did have a discussion with Ron. Ron raised some concerns. And quite frankly, it’s totally fair for Israel to have concerns if we’re having direct contacts with Hamas.”.“For all he knows, he doesn’t know me, maybe I would meet them and say, ah, they seem like such nice guys. You know, let’s have beer and chips with them,” he added..Trump nominated Boehler as his special presidential envoy for hostage affairs in December. Though he had not yet had a hearing, Boehler had already begun his work, referring to himself on the social-media platform X as the US envoy for hostages..Asked about the meeting earlier this week, US Secretary of State Marco Rubio called it a “one-off situation.” Boehler “was given permission and encouraged to do so,” Rubio said. “He did so. As of now, it hasn’t borne fruit. But it doesn’t mean he was wrong to try.”.More stories like this are available on bloomberg.com.Gulf News English Text RSS April 2024.©2025 Bloomberg L.P.","summary":"Trump’s Nomination of Hostage Envoy Pulled After Hamas Meeting","url":"https://gulfnews.com/world/americas/white-house-pulls-hostage-envoy-s-nomination-after-hamas-meeting-1.500061367","image":"https://media.assettype.com/gulfnews/2025-03-15/36sipf2y/Adam-Boehler.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-03-15 00:27:26","author":"Bloomberg","authors":["Bloomberg"],"language":"en","category":"politics","source_country":"ae","sentiment":0.026},{"id":300335384,"title":"On topic: How is Asia responding to Trump's tariff threats?","text":"U.S. President Donald Trump has turned up the heat on America's biggest trading partners with a slew of tariffs, setting the stage for an all-out trade war that threatens to disrupt Asian economies.\n\nFrom China to Japan to South Korea, Asia's business and government leaders are now considering how to respond to a new -- and more hostile -- trade environment. China, a major target of the Trump administration's tariff policy, has already retaliated with levies of its own against U.S. goods.\n\nHere is a selection of stories to bring you up to date on the latest developments.\n\nAsia response to U.S. metals tariff muted as EU comes out swinging\n\nAsia has responded to Trump's 25% tariffs on all steel and aluminum imports, which took effect Wednesday, in terms ranging from disappointed to defiant to conciliatory. Australia described the new tariffs as \"disappointing,\" while Beijing has vowed to \"take all necessary measures\" to protect its interests. \n\nSouth Korea said it would send an envoy to Washington to discuss the matter \"based on trust.\" Japan, which sought an exemption, said the situation was \"regrettable.\" Read more.\n\nIndia braces as Trump tariffs could create a surge in steel imports\n\nThe U.S. steel tariffs could push major producers like Japan, South Korea and China to redirect more of their production toward India, further impacting the commodity's price there. Read more.\n\nChina rolls out U.S. farm tariffs as Xi digs in for wider trade war\n\nAfter Trump's latest additional 10% blanket tariff on Chinese goods took effect on March 4, bringing the total extra levy on Chinese exports to the U.S. to 20%, China hit back with new duties on an array of U.S. agricultural products. Then Beijing abruptly announced a plan to also impose tariffs on certain Canadian goods, leading at least one expert to suspect that China wanted to \"try and dissuade countries from aligning their trade policy with that of Mr. Trump.\" Read more.\n\nChina questions Walmart over response to Trump tariff costs\n\nChinese government agencies, including the Ministry of Commerce, summoned Walmart representatives this week after the U.S. retailer urged suppliers in China to offset tariffs with substantial price cuts, according to Beijing's state media. Read more.\n\nTrump tariff 'bomb' rattles South Korea's chip and auto sectors\n\nSouth Korean industry is worried about another 25% tariff on imported cars that Trump said would start in April. Read more.","url":"https://asia.nikkei.com/Economy/Trade-war/On-topic-How-is-Asia-responding-to-Trump-s-tariff-threats","image":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F7%2F6%2F9%2F49169670-1-eng-GB%2FAP24025846105012.jpg?width=1200&fit=cover&gravity=faces&d","video":null,"publish_date":"2025-03-15 00:27:24","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":-0.409},{"id":300336424,"title":"US Congress Passes Funding Bill To Avert Government Shutdown","text":"The United States averted a government shutdown with hours to spare Friday as lawmakers already reeling from President Donald Trump's radical federal spending cuts voted to keep the lights on through September.Facing a midnight deadline to fund the government or allow it to start winding down, Democrats dropped plans for a blockade on a Trump-backed bill passed earlier this week by the House -- clearing its path for approval by the Republican-led Senate.\"In their typical fashion, Senate Democrats engaged in political theater to delay the inevitable and cause instability,\" said Ted Cruz, chairman of the Senate Commerce Committee.\"Americans voted for change under President Trump and Republican leadership after four years of chaos. The government is funded, let's get back to work.\"Democrats had been under immense pressure from their own grassroots to defy Trump and reject a text they said was full of harmful spending cuts.But Chuck Schumer, their leader in the upper chamber, shocked his rank-and-file ahead of the crunch vote by announcing he would back the Republican-drafted proposal.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");Ten Democrats -- worried that they would be blamed over a stoppage with no obvious exit ramp -- backed down from a showdown with Trump and allowed the bill to advance to a final floor vote, where it only needed Republican support.The week's action in Congress marked a big victory for Trump, who turned the political thumbscrews on some holdouts among the fractious House Republicans -- effectively stamping out a rebellion that could have ushered in a shutdown.The funding fight was focused on opposition to Trump's Department of Government Efficiency (DOGE), spearheaded by tech billionaire Elon Musk, which is working to dramatically downsize the government.DOGE aims to cut federal spending by $1 trillion this year and claims to have made savings so far of more than $100 billion although its verified cost savings come to less than a tenth of that figure.- 'Betrayal' -Grassroots Democrats, infuriated by what they saw as Musk's lawless rampage through the federal bureaucracy, wanted their leaders to stand up to DOGE and Trump.Schumer warned, however, that a shutdown could play into Trump and Musk's hands, distracting from DOGE's most unpopular actions, which now include firing half the Education Department's workforce.The veteran campaigner published an op-ed in The New York Times defending his decision to support the package, a U-turn that sparked an angry backlash from grassroots critics and House Democrats who accused him of \"betrayal\" and of \"caving.\"Schumer argued that a shutdown would have allowed Musk and Trump to \"destroy vital government services at a significantly faster rate than they can right now.\"\"Under a shutdown, the Trump administration would have wide-ranging authority to deem whole agencies, programs and personnel nonessential, furloughing staff members with no promise they would ever be rehired,\" Schumer wrote.Shutdowns are rare but disruptive and costly, as everyday functions like food inspections halt and parks, monuments and federal buildings shut up shop.Up to 900,000 federal employees can be furloughed, while another million deemed essential -- from air traffic controllers to police -- work but forego pay until normal service resumes.Trump praised Schumer for having \"guts\" in a Truth Social post that hailed \"a whole new direction and beginning\" for the country.\"I appreciate Senator Schumer, and I think he did the right thing. Really, I'm very impressed by that,\" he told reporters later.Success for the funding bill will come as a relief to Schumer, who was struggling to keep Senate Democrats together under a barrage of criticism from his own side.Patty Murray, the top Democrat in the funding negotiations, called the House bill a \"dumpster fire.\"More than 100 demonstrators gathered early Friday outside Schumer's Brooklyn high-rise, shouting \"Chuck betrayed us\" and \"Dems -- don't be chickens in a coup.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"The United States averted a government shutdown with hours to spare Friday as lawmakers already reeling from President Donald Trump's radical federal spending cuts voted to keep the lights on through September.","url":"https://www.ndtv.com/world-news/us-congress-passes-funding-bill-to-avert-government-shutdown-7926211","image":"https://c.ndtvimg.com/2025-03/bm820bhk_us-congress_625x300_15_March_25.jpeg","video":null,"publish_date":"2025-03-15 00:25:14","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.061},{"id":300338874,"title":"Houston Rockets owner tapped by Trump for swanky Italian ambassadorship parks massive yacht outside the Capitol","text":"Houston Rockets owner tapped by Trump for swanky Italian ambassadorship parks massive yacht outside the Capitol\n\nREAD MORE: Michael Jordan's championship banners damaged during show \n\nBy LEOCCIANO CALLAO and REUTERS\n\nPublished: 00:23 GMT, 15 March 2025 | Updated: 00:24 GMT, 15 March 2025\n\nTilman Fertitta's fancy yacht was docked outside the US Capitol not long after the Houston Rockets owner was reportedly eyed by President Donald Trump to be the US ambassador to Italy.\n\nOn Friday, Fertitta's 77-meter, $150million Feadship Boardwalk was located in the tripoint connecting the Washington Chanel, Anacostia River, and Potomac Rivers converge outside the nation's capital.\n\nThe yacht was most recently seen at Fernandina Beach on March 10 before docking in Washington, DC.\n\nIn December, CBS reported that Trump was expected to appoint the 67-year-old billionaire businessman to the ambassador position.\n\nIf nominated by Trump and confirmed by the Senate, Fertitta could follow similar appointments made during Trump's first administration with New York Jets owner Woody Johnson (United Kingdom) and late Pittsburgh Steelers owner Dan Rooney (Ireland).\n\nFollowing the news, Fertitta called the appointment an honor in a statement.\n\nHouston Rockets owner Tilman Fertitta parked his fancy 77-meter yacht outside the US Capitol\n\nFertitta's 77-meter, $150million Feadship Boardwalk was located in the tripoint connecting the Washington Chanel, Anacostia River, and Potomac Rivers converge outside the nation's capital\n\nLeBron James called out by former NBA star over heated Stephen A. Smith confrontation\n\n'Italy is such an extraordinary country with its wonderful people, culture, and history and its strategic importance to The United States of America,' he said.\n\nFertitta made $2million in political donations to Trump and other Republican candidates since January 2023, according to filings reviewed by Front Office Sports.\n\nAs the chairman and CEO of Landry’s, Fertitta assembled an impressive portfolio that includes the Golden Nugget casinos, numerous hotels and restaurants, including Mastro’s Steakhouse and Catch Steak, luxury car dealerships, and hotels.\n\nThis adds to his ownership of the Rockets franchise, which he bought for $2.2billion in 2017.\n\nIn another report published in December, Fertitta expressed his interest in purchasing the NFL's New Orleans Saints.\n\nThe Saints, owned by Gayle Benson, are not currently on the market.\n\n'I've always loved the New Orleans Saints, but (Benson) won't sell them right now,' Fertitta told the Houston Business Journal.\n\nAccording to Forbes, Tillman's net worth is an astounding $10.7b as of this writing, ranking him 236th in the real-time billionaires list. \n\nItalyChanelHouston Rockets\n\nShare or comment on this article:\nHouston Rockets owner tapped by Trump for swanky Italian ambassadorship parks massive yacht outside the Capitol\n\nAdd comment","summary":"On Friday, Fertitta's 77-meter, $150million Feadship Boardwalk was located in the tripoint connecting the Washington Chanel, Anacostia River, and Potomac Rivers converge.","url":"https://www.dailymail.co.uk/sport/nba/article-14501097/rockets-owner-trump-parks-yacht-capitol.html","image":"https://i.dailymail.co.uk/1s/2025/03/15/00/96214685-0-image-m-40_1741998106053.jpg","video":null,"publish_date":"2025-03-15 00:24:52","author":"Editor,Leocciano Callao,Reuters","authors":["Editor","Leocciano Callao","Reuters"],"language":"en","category":"politics","source_country":"gb","sentiment":0.573},{"id":300338960,"title":"Tiger Woods ‘friend-zoned’ Vanessa Trump before starting to date","text":"It appears that Tiger Woods was not all-in on Vanessa Trump at first.\n\nWoods was allegedly “hesitant” to take his relationship with Trump — Donald Trump Jr.’s ex-wife — to the next level, Page Six first reported.\n\n“He was hesitant at first because he’s got a good relationship with [President Donald] Trump, and wasn’t sure if this would cause any problems,” an insider within Woods’ inner circle told Page Six.\n\nWoods met with President Trump on multiple occasions in February, once to play a round of golf with the President at Trump International Gold Club, and again to discuss the PGA Tour-LIV merger talks along with PGA Tour Commissioner Jay Monahan and player director Adam Scott.\n\nThe news broke regarding the relationship between Woods, 49, and Trump, 47, on Thursday, with the Daily Mail reporting that the couple first started dating around Thanksgiving 2024.\n\nTheir relationship, however, did not come about without Woods initially “friend-zoning” Trump.\n\n“He friend-zoned her; they just talked about the kids and kept things pretty platonic and casual. Then, sure enough, feelings started developing on both sides,” the insider added.\n\nA source also told Page Six that the pair’s relationship is currently “not too serious,” but alluded to them “heading in that direction” in the future.\n\n“They have a lot in common. They’ve both gotten used to public scrutiny. They both know how to keep their private life private. They’re both parents,” the insider told Page Six.\n\nThe source added, “They like to avoid drama, they share a lot of the same values.”\n\nInformation regarding how the couple’s relationship started remains to be uncertain, but the two celebrities live in Florida.\n\nVanessa’s oldest daughter, Kai Trump, is also a golfer, who committed to play at the University of Miami last August.\n\nVanessa and Kai were also seen watching Woods play at the TGL in Florida, an indoor league that he co-founded, according to pictures on Kai’s Instagram.","summary":"It appears that Tiger Woods was not all-in on Vanessa Trump at first.","url":"https://nypost.com/2025/03/14/sports/tiger-woods-friend-zoned-vanessa-trump-before-dating/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/newspress-collage-hhurn72dv-1741992389051.jpg?quality=75&strip=all&1741978030&w=1200","video":null,"publish_date":"2025-03-15 00:22:26","author":"Thomas Gamba-Ellis","authors":["Thomas Gamba-Ellis"],"language":"en","category":"politics","source_country":"us","sentiment":0.189},{"id":300335922,"title":"German stocks gains after Merz secures support for historic debt reform","text":"FRANKFURT: European stocks rallied on Friday, with German equities leading gains after the country’s political parties agreed a historic deal to ramp up state borrowing.\n\nThe pan-continental STOXX 600 climbed 1.1%. Germany’s benchmark index gained 1.9%, while mid-caps advanced 2.4%. Small-caps climbed 3.3%.\n\nConservative chancellor-in-waiting Friedrich Merz said he had secured the crucial backing of the Greens for a massive increase in state borrowing, clearing the way for the outgoing parliament to approve it next week.\n\n“Today’s political deal should have ensured a two-thirds majority in the parliament at next Tuesday’s vote. Nevertheless, the chance of a surprise failure is still not zero,” said Carsten Brzeski, ING’s global head of macro.\n\n“Regardless, the chances of a cyclical rebound on the back of positive sentiment effects and later actual spending, have clearly increased.”\n\nSectors expected to benefit the most from the reforms jumped after the news. European banks led gains with a 2.6% advance, followed by the industrial goods sector that houses defence stocks.\n\nThe continent-wide aerospace and defence index closed 4.1% higher, while the volatility index eased to its lowest since March 4, after jumping to its highest in more than seven months earlier in the week.\n\nAlthough the news renewed risk-appetite in Europe, the benchmark STOXX 600 index still logged a weekly loss, its worst since December.\n\nUS President Donald Trump’s back and forth on tariffs has prompted volatile moves on markets, and his threat to slap a 200% tariff on wine and other alcohol from the European Union in response to the bloc’s levies on US whiskey, has contributed to recent declines.\n\n“The ongoing uncertainty about tariffs… is raising questions about the outlook for growth and that’s having a particular impact on risky assets generally,” said Richard Flax, chief investment officer at Moneyfarm.\n\nSome investors remained optimistic despite the trade war gloom because of potential progress towards a ceasefire in Ukraine.\n\nAmong other stocks, Kering slumped 10.7% to the bottom of the STOXX 600 after its Italian luxury brand Gucci appointed Georgian designer Demna as its artistic director.","summary":"FRANKFURT: European stocks rallied on Friday, with German equities leading gains after the country’s political parties agreed a historic deal to ramp up state borrowing.\n\n\nThe pan-continental STOXX 600 climbed 1.1%. Germany’s benchmark index gained 1.9%, while mid-caps advanced 2.4%. Small-caps climbed 3.3%.\n\n\nConservative chancellor-in-waiting Friedrich Merz said he had secured the crucial backing of the Greens for a massive increase in state borrowing, clearing the way for the outgoing parliament to approve it next week.\n\n\n“Today’s political deal should have ensured a two-thirds majority in the parliament at next Tuesday’s vote. Nevertheless, the chance of a surprise failure is still not zero,” said Carsten Brzeski, ING’s global head of macro.\n\n\n“Regardless, the chances of a cyclical rebound on the back of positive sentiment effects and later actual spending, have clearly increased.”\n\n\nSectors expected to benefit the most from the reforms jumped after the news. European banks led gains with a 2.6% advance, ","url":"https://www.brecorder.com/news/40353056/german-stocks-gains-after-merz-secures-support-for-historic-debt-reform","image":"https://i.brecorder.com/large/2025/03/150146414f0bdc0.jpg?r=014700","video":null,"publish_date":"2025-03-15 00:22:04","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"pk","sentiment":-0.07},{"id":300338990,"title":"SpaceX, NASA launch mission to bring back astronauts Sunita Williams, Butch Wilmore from ISS","text":"The relief crew for two NASA astronauts stranded in space launched to the International Space Station on Friday evening, setting the stage for their colleagues' return after nine months.SpaceX must deliver this replacement team before Butch Wilmore and Sunita Williams can depart. The new crew is expected to arrive late Saturday night.To ensure proper handover of space station operations, NASA requires an overlap period between the crews. This arrangement would enable Wilmore and Williams to depart next week and land off Florida's coast, subject to weather conditions.Astronauts who arrived on a SpaceX rescue mission in September will accompany the pair back to Earth, using two seats previously allocated for their return journey.The fresh crew, launching from NASA's Kennedy Space Center, comprises NASA astronauts Anne McClain and Nichole Ayers (both military pilots), alongside Japanese astronaut Takuya Onishi and Russian cosmonaut Kirill Peskov (both former airline pilots). They will undertake a standard six-month mission after facilitating Wilmore and Williams' departure. Spaceflight is tough, but humans are tougher, McClain remarked shortly after launch.Initially scheduled for a week-long mission launching from Cape Canaveral on June 5, Wilmore and Williams, Boeing Starliner test pilots, encountered multiple technical issues. Helium leaks and thruster malfunctions prompted months of investigation by NASA and Boeing.NASA ultimately deemed the situation unsafe, ordering Starliner's unmanned return in September and reassigning Wilmore and Williams to a February SpaceX flight. Their return faced additional delays due to necessary battery repairs on SpaceX's new capsule. SpaceX opted to use a previously flown capsule to expedite their mid-March return.The extended mission gained political attention when President Donald Trump and SpaceX's Elon Musk pledged to accelerate their return, criticising the previous administration's handling of the situation.Both retired Navy captains with previous space station experience, Wilmore and Williams maintained support for NASA's decisions throughout their extended stay. They continued station maintenance, including toilet repairs, plant care, and research activities. Williams achieved a new female record with nine career spacewalks.A hydraulic issue with the Falcon rocket's support structure delayed Wednesday's launch. SpaceX resolved the problem by clearing trapped air from the clamp arm's hydraulics system.The prolonged mission particularly affected their families - Wilmore's wife and daughters, and Williams' husband and mother. Wilmore anticipates resuming his church elder duties, whilst Williams looks forward to walking her Labradors. We appreciate all the love and support from everybody, Williams stated in a recent interview. This mission has brought a little attention. There's goods and bads to that. But I think the good part is more and more people have been interested in what we're doing with space exploration.","summary":"NASA launched replacements for two astronauts stuck on the International Space Station for nine months. The new crew includes military and former airline pilots from the US, Japan, and Russia. The returning astronauts will bring back Wilmore and Williams, who set a record for women in spacewalks. The extended stay was challenging for their families.","url":"https://economictimes.indiatimes.com/news/international/global-trends/nasas-stuck-astronauts-butch-wilmore-and-sunita-williams-set-to-return-as-new-crew-launches-to-iss/articleshow/119026888.cms","image":"https://img.etimg.com/thumb/msid-119026939,resizemode-4,width-1200,height-900,imgsize-15972,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-03-15 00:21:21","author":null,"language":"en","source_country":"in","sentiment":-0.105},{"id":300338250,"title":"SpaceX sends crew to space ahead of stuck astronauts’ return","text":"SpaceX launched a crew to the International Space Station (ISS) on Friday, a closely watched mission that would allow marooned astronauts Butch Wilmore and Suni Williams to finally return home. .The company’s Falcon 9 rocket topped with the crew’s Dragon capsule launched shortly after 7 pm New York time from NASA’s Kennedy Space Center in Florida. .About 10 minutes into the flight, the capsule detached from the upper portion of the rocket and SpaceX said the crew was on their way to the ISS. The capsule is expected to arrive for docking at about 11:30 pm on March 15. .CrewThe mission crew includes two NASA astronauts, Anne McClain and Nichole Ayers, as well as Japanese astronaut Takuya Onishi and Russian cosmonaut Kirill Peskov..NASA maintains a continuous, rotating presence on the ISS to help manage the station’s operations and research. That means the Crew-10 astronauts must arrive at the station and go through a roughly two-day handover period before the current crew, which includes Wilmore and Williams, can depart. Then, Williams and Wilmore are slated to board a capsule already docked at the station and head back to Earth with other crew members no earlier than March 19. .Wilmore and Williams arrived at the ISS last June on a Boeing Co. Starliner spacecraft and were initially slated to stay for about a week. But after Starliner suffered technical difficulties on the journey there, NASA declared that it was too risky to bring the astronauts home on the craft..Instead, the space agency stated that the astronauts would ride back to Earth on a SpaceX craft, extending Wilmore and Williams’ stay for about nine months..Their return home, set to happen after the safe arrival and transition of Crew-10, has captured national attention and concern, including from President Donald Trump and Elon Musk, the chief executive officer of SpaceX..The arriving Crew-10 is planned to remain on board the ISS until the fall, conducting a range of scientific research, including on lunar navigation, material flammability and the human body’s reaction to space.","summary":"SpaceX Sends Crew to Space Ahead of Stuck Astronauts’ Return","url":"https://gulfnews.com/world/americas/spacex-launches-nasa-crew-to-space-ahead-of-stuck-crew-return-1.500061381","image":"https://media.assettype.com/gulfnews/2025-03-14/94bd8cq9/_1x_1.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-03-15 00:17:17","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"ae","sentiment":-0.56},{"id":300339548,"title":"David Eby responds to Alaskan senator’s threat to have cruise ships bypass B.C. ports","text":"“Trade wars only hurt people,” he says. “They don’t benefit anybody. This is our message to Donald Trump. It’s our message to all Americans. We don’t want this fight. We didn’t sign up for it, but that doesn’t mean we’re not going to arm ourselves.”","summary":"Eby's comments come after Sullivan called Canadian countermeasures to U.S. tariffs \"a bit of a dangerous game.\"","url":"https://vancouversun.com/news/david-eby-responds-alaskan-senator-cruise-ships-bypass-bc-ports","image":"https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2025/03/png0829-celebrityeclipse_272225130.jpg","video":null,"publish_date":"2025-03-15 00:14:56","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":-1},{"id":300334022,"title":"What’s on Vanessa Trump’s mind? Vanessa Trump, who is secretly dating Tiger Woods, is an heiress to a large fortune from the marinara sauce business.","text":"Yesterday, the Daily Mail published a story that claimed, based on several inside sources, that Vanessa Trump and Tiger Woods are dating. They have apparently been dating since Thanksgiving.\n\nNow, if you’re not aware, Vanessa is Donald Trump Jr.’s ex-wife. They were married from 2005 to 2018 and have five children together, including Kai Trump who has become quite famous in the last year.\n\nVanessa had an interesting dating history before Don Jr. In 1998, she briefly dated Leonardo DiCaprio. From 1998 to 2001, she dated a Saudi prince named Khalid bin Sultan Al Saud. Khalid’s mother’s father was King Faisal bin Abdulaziz, who was King of Saudi Arabia from 1964 until his assassination in 1975. Vanessa and Khalid intended to marry, but unfortunately, fate stepped in on 9/11/2001. Immediately after the attacks, Khalid was called back to Saudi Arabia because his father was suspected of having connections to the 9/11 hijackers. Today, Khalid is Saudi Arabia’s ambassador to the United Kingdom.\n\nOne night in 2003, Donald Trump and Don Jr. were attending a fashion event when the father spotted Vanessa. As Donald Sr. later recollected on an episode of “The Oprah Winfrey Show” in 2011:\n\nAs Vanessa later recounted in an interview, at that fashion event, Don Sr. embarrassingly kept introducing her to his son, forgetting that he had already made the introduction. When she bumped into Don Jr. a month later, she remembered him as, and I quote – these are her words – “the one with the retarded dad.”\n\nIn November 2004, Don Jr. proposed to Vanessa with a $100,000 diamond ring that he received for free from a jeweler in exchange for proposing in front of the store at the Short Hills Mall in New Jersey while paparazzi snapped photos.\n\nLook. Am I going to sit here and claim that I would not have accepted a free $100,000 ring in exchange for a cheesy photo-op setup? No. But I’m also not the son of a billionaire, and I think that’s what makes this move pretty lame.\n\nI just checked, and sure enough, one of the photos from that day is available for me to license from Getty. So I just spent the money for you to enjoy in all its glory:\n\nHere is the description that goes along with the photo:\n\nVannessa’s dating history is actually not my favorite story about her.\n\nA Saucy Investment\n\nVanessa Haydon grew up on the Upper East Side of Manhattan. Her mother ran the Kay Models agency, which probably helped when teenage Vanessa decided to pursue a modeling career. Her mother’s second husband, Charles Haydon, was actually her stepfather. He’s frequently referred to as her father, but he is actually her stepfather. I couldn’t find any information about her birthfather, but Vanessa’s legal birth name is Vanessa Kay Pergolizzi, so I’m guessing it’s a guy whose last name is Pergolizzi.\n\nThere’s a restaurant in New York called Rao’s that has been around since 1896.\n\nA century later, in 1992, the restaurant wanted to expand into selling pasta sauce commercially. Needing some capital to launch this new side business, Rao’s took on a $1 million investment from… Charles Haydon. In exchange, Charles received a 30% stake in the commercial business, not the restaurant.\n\nMarinara Millionara\n\nUnfortunately, Charles died in 1995. He left his 30% stake in equal parts to Vanessa and her mother (15% each).\n\nIn 2017, Rao’s was acquired by a competing consumer brand conglomerate for $415 million. With the acquisition, Vanessa and her mother split a $125 million windfall, $62 million a piece, pre-tax. They both became overnight marinara millionaras.\n\nWhen her mother dies, Vanessa will be the sole heir to the Rao’s windfall. Her full inheritance will easily be north of $100 million, all in with real estate and other sources of family wealth that were created outside of marinara.\n\nLove on the Links? Vanessa and Tiger Woods\n\nVanessa’s love life continues to be anything but boring.\n\nIf she is indeed dating Tiger Woods it would make a lot of sense. They both live in Palm Beach and have kids at the same elite school, The Benjamin School, where tuition costs $38,000 per year. They have been spotted together, including at a PGA Tour event where Vanessa’s daughter Kai wore Tiger’s golf merch. While neither has confirmed the relationship, the speculation is in full swing. Whether this is just a friendly pairing or something more, one thing’s for sure—Tiger knows a thing or two about driving, and Vanessa’s got the sauce to keep things interesting.","summary":"Internewscast Journal\n\nInternewscast\n\n\nYesterday, the Daily Mail published a story that claimed, based on several&#8230;\n\n\nThis Post: What&#8217;s on Vanessa Trump&#8217;s mind? Vanessa Trump, who is secretly dating Tiger Woods, is an heiress to a large fortune from the marinara sauce business. first appeared on Internewscast Journal","url":"https://internewscast.com/celeb/celeb-zone/whats-on-vanessa-trumps-mind-vanessa-trump-who-is-secretly-dating-tiger-woods-is-an-heiress-to-a-large-fortune-from-the-marinara-sauce-business/","image":"https://internewscast.com/wp-content/uploads/2025/03/rewrite-this-title-Penna-For-Her-Thoughts-Vanessa-Trump-Tiger.jpg","video":null,"publish_date":"2025-03-15 00:14:13","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.025},{"id":300340006,"title":"New Canadian PM takes aim at Trump","text":"Prime Minister Mark Carney has vowed that Canada will never become part of the United States, pushing back against US President Donald Trump’s repeated speculations about making the northern neighbor the 51st state.\n\nTrump reiterated on Thursday that “Canada only works as a state” and defended his decision to impose tariffs on the country, claiming that the US spends $200 billion a year to subsidize Ottawa.\n\nSpeaking outside Ottawa’s Rideau Hall after being sworn in as prime minister on Friday, Carney dismissed the notion of a US annexation.\n\n“We will never, ever, in any way, shape, or form, be part of the United States,” he underscored.\n\n“America is not Canada,” Carney added, calling his country “a very fundamentally different nation.” Both “the nature of Canada” and “the economics” make Trump’s idea unthinkable, he said.\n\nCarney also emphasized that Trump will only respect Canada if it has other options, stressing the need to strengthen the economy while seeking alternative trade partners. Earlier this week, Ottawa imposed 25% tariffs on tens of billions of dollars’ worth of American imports in retaliation for the 25% duty hikes introduced by Trump last month.\n\n“Negativity won’t win a trade war. Our country, Canada, is strong. Our government is united and strong, and we will immediately get to work,” he stated.\n\nCarney was elected leader of Canada’s ruling Liberal Party last week, making him the next prime minister pending a general election. Justin Trudeau resigned in January due to low approval ratings linked to inflation, a housing crisis, and economic struggles. In his inaugural speech on Sunday, the economist and former central banker promised to maintain Canada’s retaliatory tariffs until “Americans show us respect.”\n\n“We didn’t ask for this fight, but Canadians are always ready when someone else drops the gloves,” Carney said, adding, “Canada will win.”\n\nIn addition to his repeated calls for Canada to join the US, Trump has also expressed interest in annexing Denmark’s Arctic territory of Greenland and reasserting US control over the Panama Canal.","summary":"The new Canadian prime minister, Mark Carney, has vowed that Canada will never become part of the US \nRead Full Article at RT.com","url":"https://www.rt.com/news/614248-canada-carney-trump-state/","image":"https://mf.b37mrtl.ru/files/2025.03/article/67d49eff85f54078c433886d.jpg","video":null,"publish_date":"2025-03-15 00:09:12","author":null,"language":"en","source_country":"ru","sentiment":0.102},{"id":300339734,"title":"Trump’s Guantánamo fiasco cost taxpayers $16m","text":"President Donald Trump’s failed plan to detain up to 30,000 migrants at Guantánamo Bay has cost taxpayers millions of dollars.\n\nTrump’s administration has detained just 300 migrants at the U.S.-operated facility in Cuba over the last two months. But now, all migrants detained at the facility have since been flown out, The Independent learned. \n\nThe failed operation cost taxpayers at least $16 million, Representative Sara Jacobs told ABC News after visiting the site. \n\n\"It was clear that this was entirely for optics and the fact that Donald Trump wanted to be able to say that he was sending immigrants to Guantánamo Bay, with all of its history of human rights abuses and with no actual operational value,\" Jacobs said.\n\nThe government spent $3 million alone to construct tent structures, which are still not functional and were never used, CNN reports. \n\nFederal officials told ABC News that 195 tents were built, which could house up to 500 migrants. The tents, however, lacked necessities required by Immigration and Customs Enforcement, such as air conditioning.\n\nThey’re now expected to stay up for potential use during hurricane season.\n\nShipping all immigrants out does not necessarily mean the operation is over; two federal officials told the Associated Press that the s that the administration may use the facility again in the future. For instance, Trump has vowed to send migrants who have been deemed dangerous to the facility, such as members of criminal organizations like Tren de Aragua, a Venezuelan gang, CNN reports. But presumably millions of dollars more would be required to make the facility ususable.\n\nFor now, further use of Guantánamo Bay isn’t a “primary course of action” and officials are looking to use US military bases to house migrants, according to CNN.\n\nCivil rights groups have been fighting the Trump administration over treatment of immigrants, with one lawsuit alleging migrants were mistreated and subjected to “a living hell” while they were detained at Guantánamo Bay. \n\nJennifer Babaie, director of advocacy and legal services with Las Americas Immigrant Advocacy Center, said last month Guantánamo is a “breeding ground for violence, abuse and neglect.”\n\n“Many of these men have already been subjected to countless human rights abuses and due process violations,” she said. \n\n“Keeping them in Guantánamo without regular access to lawyers and loved ones while at the same time spreading unfounded accusations against them all on the basis of what they look like and where they come from, is dangerous, violent, and completely unacceptable,” she added.\n\nBefore they were removed, more than 100 migrants who were considered “higher-threat” were detained inside Camp IV. The facility resembles those used to house prisoners of war, according to sworn statements from Homeland Security and U.S. Army personnel. Other “lower-threat” detainees were held “in and around” a barracks-like “Migrant Operations Center.”\n\nThe American Civil Liberties Union and other advocacy groups also argued this week that moving migrants to Guantánamo Bay violates the Immigration and Nationality Act, the Associated Press reports. Meanwhile, the White House has maintained it has the authority to do so.\n\nThe Independent has contacted the White House for comment.\n\nWith reporting from Alex Woodward.","summary":"All migrants detained at the facility in Cuba have been flown back to the U.S. after Donald Trump’s abandoned project","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-guantanamo-bay-migrants-taxpayer-cost-b2715532.html","image":"https://static.independent.co.uk/2025/03/14/22/58/SEI242020048.jpg?trim=0,0,0,0&width=1200&height=800&crop=1200:800","video":"https://cdn.jwplayer.com/videos/7bnEclU8-4VHSaSK0.mp4","publish_date":"2025-03-15 00:07:01","author":"Katie Hawkinson","authors":["Katie Hawkinson"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.44},{"id":300336422,"title":"Amid Ceasefire Talks, Putin Tells Ukrainian Troops To \"Surrender\" In Kursk","text":"President Vladimir Putin called on Friday for beleaguered Ukrainian troops in the Russian region of Kursk to \"surrender\" as Ukraine's President Volodymyr Zelensky accused the Russian leader of seeking to sabotage a ceasefire initiative.US President Donald Trump urged Putin to spare the lives of the Ukrainian troops as he said his envoy had held \"productive\" talks with Russia's leader on a proposed 30-day ceasefire.Russia has mounted a rapid counteroffensive in the western border region of Kursk over the past week, recapturing much of the territory Ukraine seized in a shock incursion last August.Defeat in Kursk would be a major blow to Ukraine's plans to use its hold on the region as a bargaining chip in peace talks for the three-year-old war.(function(v,d,o,ai){ai=d.createElement(\"script\");ai.defer=true;ai.async=true;ai.src=v.location.protocol+o;d.head.appendChild(ai);})(window, document, \"//a.vdo.ai/core/v-ndtv/vdo.ai.js\");\"We are sympathetic to President Trump's call,\" Putin said in remarks broadcast on Russian television.\"If they lay down their arms and surrender, they will be guaranteed life and dignified treatment,\" Putin said.Trump said \"thousands\" of Ukrainian troops were \"completely surrounded by the Russian military, and in a very bad and vulnerable position\".- 'Horrible massacre' -\"I have strongly requested to President Putin that their lives be spared. This would be a horrible massacre, one not seen since World War II,\" Trump said.Ukraine's military leadership denied the claims. \"There is no threat of our units being encircled,\" Ukraine's General Staff posted on social media.Zelensky gave a more sober assessment in comments to reporters in Kyiv. \"The situation in the Kursk region is obviously very difficult,\" he said, while insisting the campaign still had value.Russia, he said, had been forced to pull troops from other areas on the front line, easing pressure on Ukrainian forces fighting to keep control of the eastern logistics hub of Pokrovsk.Trump's latest comments came as he gave an update on a meeting Thursday between his envoy Steve Witkoff and Putin on a US-Ukrainian proposal for a 30-day pause in hostilities.\"We had very good and productive discussions with President Vladimir Putin of Russia yesterday, and there is a very good chance that this horrible, bloody war can finally come to an end,\" Trump said on his Truth Social platform.- Ukraine losing grip -Putin said Thursday that he had \"serious questions\" about the proposal and that events in Kursk would influence the next moves towards a ceasefire.Zelensky accused the Russian leader of seeking to undermine the ceasefire initiative.\"He is now doing everything he can to sabotage diplomacy by setting extremely difficult and unacceptable conditions right from the start even before a ceasefire,\" Zelensky posted on X.The Kremlin said Friday that it was \"cautiously optimistic\" a deal could be reached, but that Trump and Putin had to speak directly before talks could progress.US National Security Advisor Mike Waltz said in a Fox News interview that the United States had \"some cautious optimism\" after Witkoff's visit.US Secretary of State Marco Rubio said at a meeting of the Group of Seven western powers in Canada that both sides would have to make \"concessions\".G7 foreign ministers warned Russia of new sanctions unless it accepted a ceasefire \"on equal terms\", saying sanctions could include \"caps on oil prices, as well as additional support for Ukraine, and other means\".France and Germany accused Russia of seeking to block a ceasefire, and support for Ukraine was to be discussed again in a video conference of some European leaders with Zelensky on Saturday.UK Prime Minister Keir Starmer on Friday said Russia's \"complete disregard for President Trump's ceasefire proposal only serves to demonstrate that Putin is not serious about peace\".Diplomatic sources said EU foreign affairs chief Kaja Kallas would propose that the 27-country bloc supply up to 40 billion euros ($43.5 billion) in new military aid to Ukraine.Ukraine hoped its hold on Kursk would be a bargaining chip in talks with Russia and was eyeing a potential land swap with Moscow, which has occupied around a fifth of Ukraine since it took Crimea in 2014 and launched its military offensive in February 2022.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)","summary":"President Vladimir Putin called on Friday for beleaguered Ukrainian troops in the Russian region of Kursk to \"surrender\" as Ukraine's President Volodymyr Zelensky accused the Russian leader of seeking to sabotage a ceasefire initiative.","url":"https://www.ndtv.com/world-news/amid-ceasefire-talks-russian-president-vladimir-putin-tells-ukrainian-troops-to-surrender-in-kursk-7926159","image":"https://c.ndtvimg.com/2024-12/nep7lkfo_vladimir-putin-reuters_625x300_27_December_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738","video":null,"publish_date":"2025-03-15 00:06:34","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","category":"politics","source_country":"in","sentiment":-0.429},{"id":300333044,"title":"Rubio declares South Africa’s ‘race-baiting’ ambassador ‘persona non grata’","text":"Secretary of State Marco Rubio said Friday that South Africa’s ambassador to the United States “is no longer welcome” in the country, in the latest Trump administration move targeting the African nation.\n\nRubio, in a post on X, accused Ebrahim Rasool of being a “race-baiting politician” who hates President Donald Trump and declared him “persona non grata.” \n\nRubio linked to a Breitbart story about a talk Rasool gave during a South African think tank’s webinar.\n\nRasool, speaking by videoconference, talked about Trump ally Elon Musk’s outreach to far-right figures in Europe as a “dog whistle” in a global movement trying to rally people who see themselves as part of an “embattled white community.”\n\nThe State Department did not have additional details about the ban, and it was unclear whether Rasool was even in the U.S. at the time the decision was made. \n\nRubio posted as he was flying back to Washington from a Group of 7 foreign ministers meeting in Canada.\n\nIt is highly unusual for the U.S. to expel a foreign ambassador, although lower-ranking diplomats are more frequently targeted with persona non grata status.\n\nAt the height of U.S.-Russia diplomatic expulsions during the Cold War and then again over Russia’s 2014 annexation of Crimea, allegations of interference in the 2016 U.S. election and the poisoning of a former Russian intelligence officer in Britain, neither Washington nor Moscow saw fit to expel the respective ambassadors.\n\nPhone calls to the South African Embassy seeking comment, made at the end of the work day, were not answered.\n\nRasool previously served as his country’s ambassador to the U.S. from 2010 to 2015 before returning in January.\n\nAs a child, he and his family were evicted from a Cape Town neighborhood designated for white people. Rasool became an active anti-apartheid campaigner, serving time in prison and identifying as a comrade of the country’s first post-apartheid president, Nelson Mandela. \n\nHe later became a politician in Mandela’s African National Congress political party.\n\nHis ouster comes after Trump signed an executive order that cut aid and assistance to the Black-led South African government. \n\nIn the order, Trump said South Africa’s Afrikaners, who are descendants of mainly Dutch colonial settlers, were being targeted by a new law that allows the government to expropriate private land.\n\nThe South African government has denied its new law is tied to race and says Trump’s claims over the country and the law have been full of misinformation and distortions.\n\nTrump said land was being expropriated from Afrikaners — which the order referred to as “racially disfavored landowners” — when no land has been taken under the law.\n\nTrump also announced a plan to offer Afrikaners refugee status in the U.S. \n\nThey are only one part of South Africa’s white minority.\n\nThe Expropriation Act was signed into law by South African President Cyril Ramaphosa earlier this year and allows the government to take land in specific instances where it is not being used, or where it would be in the public interest if it is redistributed.\n\nIt aims to address some of the wrongs of South Africa’s racist apartheid era, when Black people had land taken away from them and were forced to live in areas designated for non-white people.\n\nMusk, who grew up in South Africa and heads Trump’s Department of Government Efficiency, has highlighted that law in social media posts and cast it as a threat to South Africa’s white minority.","summary":"Secretary of State Marco Rubio said Friday that South Africa’s ambassador to the United States “is no longer welcome” in the country, in the latest Trump administration move targeting the African nation.","url":"https://nypost.com/2025/03/14/us-news/rubio-says-south-africas-ambassador-to-the-us-is-no-longer-welcome-in-the-country/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/03/100480750.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/zOJxjtCU-RyIcpnTz.mp4","publish_date":"2025-03-15 00:06:16","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.156},{"id":300333446,"title":"SpaceX Flight Launches into Space 8 Days After Rocket Explosion. What That Means for 'Stranded' Astronauts","text":"A new crew is officially on their way to the International Space Station, which means fellow astronauts Butch Wilmore and Suni Williams — who have been in space for nine months now — are officially one step closer to finally coming home.\n\n SpaceX and NASA's Crew-10 mission took off in a Falcon 9 rocket from NASA’s Kennedy Space Center in Florida on Friday, March 14, at 7:03 p.m. ET.\n\n The launch was initially scheduled to take off on Wednesday, March 12, but was delayed after a hydraulic issue.\n\n The crew on the SpaceX Dragon spacecraft consists of astronauts Anne McClain and Nichole Ayers, along with mission specialists JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi and Roscosmos cosmonaut Kirill Peskov.\n\n According to NASA, it will take  \"about 28.5 hours for the spacecraft to autonomously dock to the space station at 11:30 p.m. EDT Saturday, March 15, while traveling 17,000 mph orbiting the Earth.\"\n\n Once the crew successfully makes their way to the ISS, there will be a handover period — then Wilmore and Williams, who had been in space since June 2024, will fly back home as early as Wednesday, March 19.\n\n NASA astronaut Nick Hague and Roscosmos cosmonaut Aleksandr Gorbunov, who have been in space since last September, will also join them on the flight.\n\n The latest successful SpaceX launch came eight days after SpaceX’s Starship rocket exploded, grounding flights at Florida airports.\n\n Live stream footage showed engines cutting off from the rocket roughly eight minutes into the launch, shortly after the booster was successfully caught back at the tower.\n\n At the time, the Federal Aviation Administration also said it \"activated a Debris Response Area and briefly slowed aircraft outside the area where space vehicle debris was falling or stopped aircraft at their departure location.\"\n\n In a statement on its website, SpaceX said that \"prior to the end of the ascent burn, an energetic event in the aft portion of Starship resulted in the loss of several Raptor engines.\" It also shared that \"surviving debris would have fallen within the pre-planned Debris Response Area.\"\n\n The private space company said that they planned to \"conduct a thorough investigation, in coordination with the FAA, and implement corrective actions to make improvements on future Starship flight tests.”\n\n Wilmore and Williams, who arrived at the ISS in June 2024, originally expected to stay in space for no more than 10 days.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories.\n\n However, after their spacecraft encountered mechanical issues, their return was delayed. After weeks of troubleshooting, the spacecraft was sent back to Earth without them — and since then, their return home has continually been pushed back. Lately, it's also become politically charged, with President Donald Trump blaming his predecessor for their lengthy stay.\n\n However, Wilmore told CNN's Anderson Cooper on Thursday, Feb. 13 that they \"don’t feel abandoned.\"\n\n “If you’ll help us change the rhetoric, help us change the narrative, let’s change it to ‘prepared and committed.’ That’s what we prefer.\"\n\n Williams echoed the sentiments in a separate press conference earlier this month. \"Every day is interesting because we're up in space and it's a lot of fun,\" she said. \"The hardest part is having the folks on the ground have to not know exactly when we're coming back.\"","summary":"SpaceX and NASA's Crew-10 mission took off in a Falcon 9 rocket from NASA’s Kennedy Space Center on Friday, March 14","url":"https://people.com/spacex-flight-launch-what-that-means-stranded-astronauts-11694319","image":"https://people.com/thmb/5JTs5Jr7tR0MGVp5Exh8Ioo-yhk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/space-x-031425-2-092b454f22344fd38871666fe91e1391.jpg","video":null,"publish_date":"2025-03-15 00:06:15","author":"Charna Flam,Sam Gillette","authors":["Charna Flam","Sam Gillette"],"language":"en","source_country":"US","sentiment":-0.384},{"id":300334788,"title":"Relief as US Congress averts government shutdown","text":"WASHINGTON: The United States averted a government shutdown with hours to spare on Friday (Mar 14) as lawmakers already reeling from President Donald Trump's radical federal spending cuts voted to keep the lights on through September.\n\nFacing a midnight deadline to fund the government or allow it to start winding down, Democrats dropped plans for a blockade on a Trump-backed Bill passed earlier this week by the House – clearing its path for approval by the Republican-led Senate.\n\n\"In their typical fashion, Senate Democrats engaged in political theater to delay the inevitable and cause instability,\" said Ted Cruz, chairman of the Senate Commerce Committee.\n\n\"Americans voted for change under President Trump and Republican leadership after four years of chaos. The government is funded, let's get back to work.\"\n\nDemocrats had been under immense pressure from their own grassroots to defy Trump and reject a text they said was full of harmful spending cuts.\n\nBut Chuck Schumer, their leader in the upper chamber, shocked his rank-and-file ahead of the crunch vote by announcing he would back the Republican-drafted proposal.\n\nTen Democrats – worried that they would be blamed over a stoppage with no obvious exit ramp – backed down from a showdown with Trump and allowed the Bill to advance to a final floor vote, where it only needed Republican support.\n\nThe week's action in Congress marked a big victory for Trump, who turned the political thumbscrews on some holdouts among the fractious House Republicans, effectively stamping out a rebellion that could have ushered in a shutdown.\n\nThe funding fight was focused on opposition to Trump's Department of Government Efficiency (DOGE), spearheaded by tech billionaire Elon Musk, which is working to downsize the government.\n\nDOGE aims to cut federal spending by US$1 trillion this year and claims to have made savings so far of more than US$100 billion, although its verified cost savings come to less than a tenth of that figure.","summary":"","url":"https://www.channelnewsasia.com/world/us-congress-averts-government-shutdown-5002146","image":"https://dam.mediacorp.sg/image/upload/s--YhsPjFBh--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-02-15t044256z_1_lynxmpel1e018_rtroptp_3_usa-congress-ukraine.jpg?it","video":null,"publish_date":"2025-03-15 00:06:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.08},{"id":300333984,"title":"Pastors, protests and claims of persecution: The Burke family's ties with conservative America","text":"Advertisement\n\nWe need your help now\n\nSupport from readers like you keeps The Journal open.\n\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\n\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\n\nOne-off amount\n\nI already contribute\n\nSign in. It’s quick, free and it’s up to you.\n\nAn account is an optional way to support the work we do. Find out more.\n\nInvestigates\n\nInvestigates\n\nMoney Diaries\n\nDaft.ie Property Magazine\nAllianz Home Magazine\nThe 42 Sports Magazine\nThe Journal TV\n\nClimate Crisis\n\nCost of Living\nRoad Safety\n\nNewsletters\n\nTemperature Check\nInside the Newsroom\nThe Journal Investigates\n\nThe Explainer\n\nA deep dive into one big news story\n\nSports meets news, current affairs, society & pop culture\n\n have your say\n\nOr create a free account to join the discussion\n\nAdvertisement\n\nMore Stories\n\nMembers of Enoch Burke's family picket the Ireland funds dinner in Washington DC earlier this weekAlamy Stock Photo\n\nThe Morning Lead\n\nPastors, protests and claims of persecution: The Burke family's ties with conservative America\n\nThe family’s cause has been taken up by religious groups in the US.\n\n12.06am, 15 Mar 2025\n\nShare options\n\nTHE BURKE FAMILY made headlines this week after they travelled to Washington DC and were removed from a gala attended by Taoiseach Micheál Martin on Thursday night.\n\nMembers of the family protested the event over ongoing legal issues faced by Enoch Burke, who has repeatedly been imprisoned for breaking a court order requiring him to stay away from the grounds of his former employer, Wilson’s Hospital School\n\nIt was not the first time that the Burkes have been removed by police during a protest, but it was unusual to see such scenes in the US – a place where the family’s cause has been taken up by religious groups.\n\nEnoch Burke has no shortage of US supporters, as was evidenced when the latest episode in his case was heard at the High Court last week.\n\nThe hearing involved an application by the Attorney General to appoint a receiver who could collect fines that Burke owes the State, on foot of his refusal to comply with the court order\n\nIn the aftermath, the AG’s application was misleadingly framed by Burke and his supporters on social media as an attempt by the pillars of the State to silence him.\n\nA video posted to Burke’s verified account on X.com featured his brother Josiah and mother Martina claiming that he was being “stripped of every right he has because he won’t accept transgender ideology”. \n\nAnother anonymous account on the platform, going by the handle @CilColmLFC, re-shared the video with an incorrect claim that Burke was having his salary taken off him for refusing to use they/them pronouns for a transgender student.\n\nAt some point the next day, the post caught the attention of Elon Musk, who re-shared it on X with a one-word comment: “Wow.”\n\nBut while Musk has become the most high-profile person in the US to have amplified misinformation about Enoch Burke, other parts of conservative America have also championed the former teacher in recent years.\n\nEvangelical news outlets, members of the Christian right and US conspiracy groups have all promoted his case since the start of his legal issues, presenting him as a victim of the culture-war and religious persecution. \n\nCiaran O’Connor of the Institute for Strategic Dialogue suggested that Burke’s case could resonate among US conservative groups because they may see it as “similar to their own efforts to defend traditional or religious values”.\n\nHe said that misinformation about Burke’s case helped to play into a broader narrative around free speech and religious freedom.\n\n“Religious freedom and free speech are unquestionably important topics that must be protected, but they have nothing to do with Burke’s imprisonment,” O’Connor said.\n\n“It is misinformation peddled by supporters and others online that has helped fuel this misrepresentation.”\n\nEnoch Burke (file photo)Alamy Stock Photo\n\nAlamy Stock Photo\n\nCulture war crusades\n\nThe activities of Burke and his family can be seen in the context of a wider culture war crusade by the religious right against LGBTQ+ people internationally.\n\nAdvertisement\n\nIn recent years, Christian groups have increasingly campaigned against laws or policies that recognise or include the LGBTQ+ community by referencing the importance of their religious beliefs.\n\nThey have claimed that their beliefs are at odds with the legalisation of same-sex relationships and the recognition of different gender identities, and believe that their views should be prioritised instead.\n\nThe tactic originated among the Christian right movement in the US, where religious groups sought to evolve their methods as public opinion on LGBTQ+ rights has softened over time.\n\nIt has led to dozens of cases in the US in which conservative Christians have argued they should be constitutionally protected from having to serve LGBTQ+ people.\n\nThis culminated in a 2023 US Supreme Court ruling in favour of a Colorado web designer who refused to create wedding websites for gay couples on free speech grounds.\n\nHowever, members of the Burke family have been less successful in importing this legal approach to Ireland, where there is no constitutional protection for free speech as there is in the US.\n\nEnoch Burke’s case against Wilson’s is the most high-profile instance of the family adopting such a strategy, but it is not the first time they’ve done so.\n\nIn 2021, Enoch and three of his siblings, Isaac, Kezia, Ammi, lost a case they brought to the Circuit Court, in which they claimed that a lifetime ban imposed on them from joining college societies at NUI Galway amounted to religious discrimination.\n\nHowever, while the family have not been successful in the courts, Enoch’s imprisonment has earned him significant international support because of the way his case has been misleadingly framed as a wider culture war issue involving trans people and free speech.\n\nThough it fundamentally centres on the mundane technicalities of civil court orders and a HR battle involving his former employer, his case has been painted by the Burkes and Enoch’s supporters as a straightforward battle around religious freedom.\n\nThey claim Burke was fired because of his refusal to address a student by their preferred pronouns, misrepresenting his initial suspension because of his behaviour towards his principal at Wilson’s Hospital School.\n\nThey also say his religious stance culminated in his imprisonment for more than 500 days, though he was actually jailed for contempt of court after repeatedly breaching a High Court injunction requiring him to stay away from the school.\n\nAfter the latest hearing, the Burkes claimed the State is repressing Enoch’s freedom by taking his salary, which in truth is an attempt to recoup tens of thousands in unpaid fines handed to him in lieu of imprisoning him for breaching the court order. \n\nMembers of Enoch Burkes family are ejected from the Ireland Funds gala on Thursday nightAlamy Stock Photo\n\nAlamy Stock Photo\n\nBigger audience\n\nBy adopting the tactics of the American Christian right, the Burkes have amplified Enoch’s case to a much bigger audience.\n\nWhen Enoch was first arrested on 5 September 2022, the case was reported on by media outlets across the world, many of them glossing over the facts behind his imprisonment to present him as a culture war victim. \n\nThey included a handful of Christian media groups based in the United States which leaned into or repeated the false claim that Burke had been suspended from work and jailed because he wouldn’t address a transgender pupil by their preferred pronouns.\n\nThese pieces often described Burke as a “Christian teacher” and prominently reported his quotes from court like “Transgenderism is against my Christian belief” and “I am here today because I would not call a boy a girl”.\n\nAs news of Burke’s imprisonment exploded online, it was picked up by prominent religious and politically conservative groups in the US, who pushed the narrative that Burke was being persecuted.\n\nRelated Reads\n\nMembers of Enoch Burke's family forcibly removed from gala dinner in Washington DC after disrupting speech\n\nDebunked: Enoch Burke isn't forced to stand outside a school for refusing 'transgender ideology'\n\nThe Enoch Burke saga and what happens when prison is no longer a deterrent\n\nThe Young America’s Foundation – a group led by Wisconsin’s former Republican governor Scott Walker – shared a news article about Burke to more than 2 million followers on Facebook the day after Burke was imprisoned.\n\n“This brave teacher was hauled off to jail under threat of a government gun for refusing to submit to the Left’s ideology,” it incorrectly claimed.\n\nDave Rubin, a well-known conservative pundit who has almost 3 million followers on YouTube, also discussed Burke’s case in a video on the platform in which he warned that Americans could soon be imprisoned for the same reason.\n\n“Guess what? They will try to figure out a way for people to do it here in the United States – thank God for that First Amendment,” he said. \n\nA number of Evangelical pastors with large followings on social media also warned about Burke’s treatment in the days after he was first arrested as a sign of impending rapture.\n\nDr Jim Garlow, a well-known pastor who has been involved in politics in his home State of California, told his followers that Ireland was “only two steps ahead of the US”.\n\n“This is what the Democrat-Fascists-Progressive-Leftist believe in this country,” he said. “Ireland today. America tomorrow.”\n\nMore publicity\n\nSince Burke’s initial arrest, repeated decisions by judges to release and re-imprison him for breaching the court order have only given his message more opportunities for publicity in the US – as Musk’s post last week showed.\n\nBut others have continued to support Burke between his court appearances. \n\nAnother pastor, Tennessee-based Ken Peters, initially called on his followers to pray for Burke after his first arrest in September.\n\nSince then, he has posted regularly about Burke’s case to his tens of thousands of followers on Facebook and on X. \n\nThis week, he claimed incorrectly that Burke was still in prison and that the Burke family travelled to the US because they had been granted asylum by Donald Trump.\n\nPeters was previously named in a CNN investigation as being near the Capitol building in Washington DC and for calling Mike Pence a “coward” on Twitter on the day of the 6 January riots.\n\nAnti-trans NGOs in the US have also posted similar claims about the Burkes to motivate their followers, including a group called Gays Against Groomers, who re-shared an old video of Burke being arrested alongside links asking for donations.\n\nCiaran O’Connor of the Institute for Strategic Dialogue said that misrepresenting the true basis for Burke’s imprisonment has ultimately been key to his case going viral.\n\n“This framing was adopted by popular online channels, influencers and social media figures, who then amplified this misrepresentation across the world,” he said.\n\n“Notably, this framing played into a broader narrative that framed Burke as a martyr for free speech and religious freedom – two topics of great appeal to certain audiences.”\n\nReaders like you are keeping these stories free for everyone...\n\nA mix of advertising and supporting contributions helps keep paywalls away from valuable information like this article.\n\nOver 5,000 readers like you have already stepped up and support us with a monthly payment or a once-off donation.\n\nSupport The Journal\n\nStephen McDermott\n\nSend Tip or Correction\n\nEmbed this post\n\nTo embed this post, copy the code below on your site\n\n\n\n\n\n\n\nEmail “Pastors, protests and claims of persecution: The Burke family's ties with conservative America”.\n\nRecipient's Email\n\nFeedback on “Pastors, protests and claims of persecution: The Burke family's ties with conservative America”.\n\nYour Feedback\n\nYour Email (optional)\n\nReport a Comment\n\nPlease select the reason for reporting this comment.\n\nPlease give full details of the problem with the comment...\n\nChristian right\nEnoch Burke\nThe Burke family\n\nthe morning lead\n\nNews in 60 seconds\n\nTaoiseach in DC\nJewish groups discuss Irish \"attacks on Israel\" and Occupied Territories Bill with Taoiseach\n\nDublin primary school facing closure in April due to 'massive underfunding'\n\nHere's what happened today: Friday\n\neast yorkshire\nCaptain of ship in North Sea collision charged over death of crew member\n\nHousing Crisis\nOpinion: My heart sank when I saw the laughter in the Oval Office about our housing crisis\n\nDún Laoghaire\nGarda investigation under way after woman spits on Israeli man in Dublin hotel bar\n\nMan jailed for 11 years for repeated sexual abuse of his wife's grand-nephew\n\nIreland Funds gala\nMembers of Enoch Burke's family forcibly removed from gala dinner in Washington DC after disrupting speech\n\nJane Matthews\n\nReports from Washington DC\n\nDún Laoghaire\nGarda investigation under way after woman spits on Israeli man in Dublin hotel bar\n\nUS influencer who took baby wombat from mother leaves Australia\n\nmore from us\n\nInvestigates\n\nDaft.ie Property Magazine\n\nAllianz Home Magazine\n\nThe 42 Sports Magazine\n\nMoney Diaries\n\nThe Journal TV\n\nJournal Media\n\nAdvertise With Us\n\nAbout FactCheck\n\nOur Network\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nmore from us\n\nTV Listings\n\nGAA Fixtures\n\nJournal Media\n\nAdvertise With Us\n\nOur Network\n\nThe Journal\n\nFactCheck Knowledge Bank\n\nTerms & Legal Notices\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\n© 2025 Journal Media Ltd\n\nTerms of Use\n\nCookies & Privacy\n\nAdvertising\n\nCompetition\n\nSwitch to Desktop\nSwitch to Mobile\n\nThe Journal supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact the Council, at https://www.presscouncil.ie, PH: (01) 6489130, Lo-Call 1800 208 080 or email: mailto:info@presscouncil.ie\n\nReport an error, omission or problem:\n\nYour Email (optional)\n\nCreate Email Alert\n\nCreate an email alert based on the current article\n\nEmail Address\n\nOne email every morning\n\nAs soon as new articles come online","summary":"The family’s cause has been taken up by religious groups in the US.","url":"https://www.thejournal.ie/enoch-burke-family-us-connections-christian-right-religious-6647119-Mar2025/","image":"https://img2.thejournal.ie/article/6647119/river/?height=400&version=6650383","video":null,"publish_date":"2025-03-15 00:05:46","author":null,"language":"en","category":"politics","source_country":"ie","sentiment":-0.106},{"id":300331866,"title":"G7 adopts tough language on China, urges Russia to halt Ukraine war","text":"The foreign ministers of the Group of Seven democracies agreed Friday on tough language aimed at China's aggressive maritime actions and warned Russia it will face additional sanctions if it does not accede to an immediate cease-fire on \"equal terms\" with Ukraine.\n\nIn a joint statement, released after their talks this week in the Canadian resort town of La Malbaie, the ministers also emphasized the need for \"robust and credible security arrangements\" for Ukraine to enable it to defend its territorial integrity from any acts of aggression in the future.\n\nThe meeting took place at a pivotal time for the fate of Ukraine and tested the unity of the world's major industrialized countries, which have promoted shared values of democracy, the rule of law and human rights.\n\nThe 50-year-old grouping had operated with broad consensus before the rise of U.S. President Donald Trump, who returned to office in January.\n\nWhile Trump's apparent affinity for Russian President Vladimir Putin and tariff threats have raised tensions between the United States and other G7 members, the ministers ultimately managed to reaffirm \"unwavering support\" for Ukraine's freedom and independence.\n\nThe top diplomats of Britain, Canada, France, Germany, Italy and Japan, plus the European Union, welcomed a cease-fire proposal brokered by the United States for Russia's three-year-old invasion of Ukraine.\n\nThey also denounced China, Iran and North Korea for helping Russia in its war against Ukraine.\n\nSpeaking to reporters after the G7 meeting, Japanese Foreign Minister Takeshi Iwaya said he told his counterparts that U.S. involvement in the peace process for Ukraine is crucial, and the way Russia's invasion ends will impact the Indo-Pacific and elsewhere.\n\n\"I strongly felt that there is already a shared understanding that the security of the Euro-Atlantic is inseparable from that of the Indo-Pacific and Asia,\" Iwaya said. \"We must not allow any false lessons to be drawn from this (peace process).\"\n\nThe ministers met after Ukraine said earlier this week it was ready to accept an immediate 30-day cease-fire with Russia, as proposed by the Trump administration.\n\nFollowing hours of talks between the United States and Ukraine in Saudi Arabia on Tuesday, the administration agreed to resume its provision of military aid and intelligence to Kyiv, which was paused after Trump and Ukrainian President Volodymyr Zelenskyy clashed in the Oval Office in front of reporters two weeks ago.\n\nOn China, the G7 ministers said they remain \"seriously concerned\" over its activities in the East and South China seas, saying they \"continue to oppose strongly unilateral attempts to change the status quo, in particular by force and coercion.\"\n\nAs China has been locked in territorial disputes with the Philippines and Vietnam, they also raised concerns about dangerous maritime maneuvers in the vicinity of vessels from the Southeast Asian countries.\n\n\"We emphasized that China should not conduct or condone activities aimed at undermining the security and safety of our communities and the integrity of our democratic institutions,\" the statement said.\n\nAdditionally, they issued a declaration on maritime security and prosperity with even harsher criticism of Beijing, saying, \"We condemn China's illicit, provocative, coercive and dangerous actions\" to change the status quo, in reference to land reclamations, the building of outposts and their use for military purposes.\n\nCanadian Foreign Minister Melanie Joly, who hosted the event that began on Wednesday evening, told reporters on its closing day, \"I can say that through our long conversations, we were able to find strong G7 unity on a variety of issues that were discussed.\"\n\n\"One that I would like to highlight in particular is the one linked to Ukraine,\" she said, adding that the group is now watching for Russia's response to the proposed cease-fire.\n\nAlthough the statement called on Russia to \"reciprocate by agreeing to a cease-fire on equal terms and implementing it fully,\" it left out the harsher phrasing often adopted by the G7 prior to Trump's return to office, such as condemning Moscow for launching an \"illegal, unjustifiable and unprovoked\" war of aggression.\n\nOn Thursday, Putin reacted to the U.S.-led proposal for the first time, saying he is in favor of the plan in principle, but there are many important issues that need to be sorted out, hinting that the Kremlin will not stop fighting without conditions.\n\nReflecting the current status of U.S.-led negotiations, seemingly focused on securing compromise from both Russia and Ukraine, the G7 statement stopped short of demanding that Moscow accept an unconditional halt to hostilities.\n\nUkraine continues to seek guarantees for its future security from the United States, but Trump has been openly dismissive of such requests from the war-torn country.\n\nWhile many other European countries have also pursued U.S.-backed security guarantees for Ukraine, the foreign ministers could only agree to the extent that they \"underscored the need\" for strong \"security arrangements.\"\n\nThroughout his stay in the wintery Canadian town, U.S. Secretary of State Marco Rubio did not hold a press conference, speaking only to a group of selected reporters, and in his public statements he never expressed any frustration with Russia.\n\nRubio said on social media, \"Working with our G7 partners is key to solving the world's challenges. We must support a swift and durable end to the Russia-Ukraine war.\"\n\nRelated coverage","summary":"LA MALBAIE, Canada - The foreign ministers of the Group of Seven democracies agreed Friday on tough language aimed at Chi...","url":"https://english.kyodonews.net/news/2025/03/b889fb9cd3ae-update5-g7-adopts-tough-language-on-china-urges-russia-to-halt-ukraine-war.html","image":"https://img.kyodonews.net/english/public/images/posts/a9595beeab8a530a08b72902740c314b/cropped_image_l.jpg","video":null,"publish_date":"2025-03-15 00:03:04","author":null,"language":"en","category":"politics","source_country":"jp","sentiment":0.094},{"id":300335902,"title":"Thousands of protesters expected to gather in London amid police warnings","text":"Thousands of protesters are expected to gather in London on Saturday as the Metropolitan Police imposed conditions on three separate demonstrations.\n\nA protest organised under the Palestine Coalition, including the Palestine Solidarity Campaign (PSC) and Stop The War, will gather at 1pm in Piccadilly near Green Park station before marching to Whitehall for a rally.\n\nA counter-protest, organised by the group Stop The Hate, will be taking place in Coventry Street, near Piccadilly Circus.\n\nThe Met Police have imposed conditions under the Public Order Act on both protests meaning participants of the pro-Palestine demonstration must not assemble before 12pm and the procession must remain on a prescribed route, namely Piccadilly to Haymarket to Cockspur Street to Whitehall.\n\nThe rally, including any stages being used, must remain within a certain area of Whitehall and conclude by 4.30pm.\n\nSimilarly, Stop The Hate demonstration participants or any assembly protesting against the National Demonstration For Palestine march must remain within a specified area on Coventry Street.\n\nAnother protest, organised by the Inter-Parliamentary Alliance On China, is scheduled to take place outside the Royal Mint at the north end of Tower Bridge at 3pm in opposition to plans to build a new Chinese Embassy on the site.\n\nConditions have also been imposed on this demonstration meaning attendees must gather in a specified area in Mansell Street.\n\nA separate protest is due to take place outside the Tesla centre in Park Royal, west London, as part of a campaign encouraging people to boycott the car manufacturer in opposition to owner Elon Musk’s work for the US government and controversial political positions.\n\nThe electric car giant has already seen shares plunge since the start of the year as the firm has come under pressure from Chinese rivals and amid calls for a boycott over his close ties with US President Donald Trump and far-right causes.\n\nOrganisers are encouraging Tesla owners to sell their cars and for people to dump the company’s stock.\n\nTens of thousands of football fans are also expected in the capital at the weekend ahead of Sunday’s Carabao Cup final at Wembley.\n\nOn Saturday, the Trafalgar Square area, a favourite gathering spot for fans in previous years, will be closed because of ongoing preparations for St Patrick’s Day celebrations on Sunday, police said.","summary":"Thousands of protesters are expected to gather in London on Saturday as the Metropolitan Police imposed conditions on three separate demonstrations. A protest organised under the Palestine Coalition, including the Palestine Solidarity Campaign (PSC) and Stop The War, will gather at 1pm in Piccadilly near Green Park station before marching to Whitehall for a rally. [&#8230;]\n\n\nThe post Thousands of protesters expected to gather in London amid police warnings appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/03/15/thousands-of-protesters-expected-to-gather-in-london-amid-police-warnings/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/03/2.78063566-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-03-15 00:01:17","author":"Newsdesk","authors":["Newsdesk"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.016},{"id":300337880,"title":"Thousands of protesters expected to gather in London amid police warnings","text":"Thousands of protesters are expected to gather in London on Saturday as the Metropolitan Police imposed conditions on three separate demonstrations.\n\nA protest organised under the Palestine Coalition, including the Palestine Solidarity Campaign (PSC) and Stop The War, will gather at 1pm in Piccadilly near Green Park station before marching to Whitehall for a rally.\n\nA counter-protest, organised by the group Stop The Hate, will be taking place in Coventry Street, near Piccadilly Circus.\n\nThe Met Police have imposed conditions under the Public Order Act on both protests meaning participants of the pro-Palestine demonstration must not assemble before 12pm and the procession must remain on a prescribed route, namely Piccadilly to Haymarket to Cockspur Street to Whitehall.\n\nThe rally, including any stages being used, must remain within a certain area of Whitehall and conclude by 4.30pm.\n\nSimilarly, Stop The Hate demonstration participants or any assembly protesting against the National Demonstration For Palestine march must remain within a specified area on Coventry Street.\n\nAnother protest, organised by the Inter-Parliamentary Alliance On China, is scheduled to take place outside the Royal Mint at the north end of Tower Bridge at 3pm in opposition to plans to build a new Chinese Embassy on the site.\n\nConditions have also been imposed on this demonstration meaning attendees must gather in a specified area in Mansell Street.\n\nA separate protest is due to take place outside the Tesla centre in Park Royal, west London, as part of a campaign encouraging people to boycott the car manufacturer in opposition to owner Elon Musk’s work for the US government and controversial political positions.\n\nThe electric car giant has already seen shares plunge since the start of the year as the firm has come under pressure from Chinese rivals and amid calls for a boycott over his close ties with US President Donald Trump and far-right causes.\n\nOrganisers are encouraging Tesla owners to sell their cars and for people to dump the company’s stock.\n\nTens of thousands of football fans are also expected in the capital at the weekend ahead of Sunday’s Carabao Cup final at Wembley.\n\nOn Saturday, the Trafalgar Square area, a favourite gathering spot for fans in previous years, will be closed because of ongoing preparations for St Patrick’s Day celebrations on Sunday, police said.","summary":"The Metropolitan Police have imposed conditions on three separate demonstrations due to take place in the capital on Saturday.","url":"https://www.standard.co.uk/news/uk/london-metropolitan-police-piccadilly-whitehall-green-park-b1216878.html","image":"https://static.standard.co.uk/2025/03/15/00/96e1bbb3fb113d820238eec9643f31aeY29udGVudHNlYXJjaGFwaSwxNzQyMDgwNTA4-2.78063566.jpg?width=1200","video":null,"publish_date":"2025-03-15 00:01:17","author":"Rosie Shead","authors":["Rosie Shead"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.016},{"id":300336806,"title":"El conflicto de LeBron James con Stephen A. Smith, el Día Nacional de Descanso para las Mujeres Negras, la respuesta de la familia de una influencer negra a los rumores de su muerte, influencers negras que viven como Meghan Markle, la preocupación por la ","text":"Una mujer del Bronx abandonó la universidad tras ser diagnosticada con cáncer, pero la escuela le siguió cobrando hasta que esto sucedió.\n\nNunca es demasiado tarde para perseguir tus sueños, pero cuando una abuela del Bronx, Nueva York, decidió seguir los suyos y obtener su maestría, la vida dio un giro impensable. Después de un revés de dos años, de nuevo en marcha para abrir su propio negocio y brindar ayuda muy necesaria a la población sin hogar de Nueva York. -Phenix S Halley Leer más\n\nLeBron James habla sobre su verdadero problema con Stephen A. Smith\n\nLas cosas solo se están poniendo más complicadas en el disputa entre LeBron James y Stephen A. Smith. El futuro miembro del Salón de la Fama de la NBA Fue captado en un micrófono abierto discutiendo su problemas con la popular personalidad de la televisión, añadiendo más leña al fuego.-Noah A. McGee Leer más\n\nEn este Día Nacional de Descanso para las Mujeres Negras, aquí hay cinco cosas que puedes hacer para relajarte.\n\nPara quienes no lo saben, el 10 de marzo es el Día Nacional de Descanso de las Mujeres Negras. El día también reconoce la muerte de la pionera de los derechos civiles y la libertad, Harriet Tubman. un momento apropiado para alentar a las mujeres negras trabajadoras a tomar un descanso. -Kalyn Womack Leer más\n\nVaya, Stephen A. Smith aún no ha terminado de aplaudirle a LeBron James...\n\nDéjalo en manos de los deportes comentarista Stephen A. Smit¡Para tener la última palabra! Creímos haber escuchado la última palabra de la disputa de Smith con La estrella de la NBA LeBron James Después de que un altercado entre ambos se volviera viral la semana pasada... pero no. Parece que Smith todavía tiene algunas cosas que decir. -Phenix S Halley Leer más\n\nEl hombre negro más rico explica por qué la gente no debería tener miedo de la prohibición de la DEI por parte de Trump\n\nEn 2024, Smith fue nombrado el segundo hombre más rico en los EE. UU., después de años de ocupar el puesto número 1 en la lista de las personas negras más ricas de Forbes. No se llega a ser uno de los hombres más ricos del país sin aprender una o dos cosas sobre las prácticas de contratación. Por lo tanto, a la luz de la prohibición del presidente Donald Trump de la DEI a nivel federal y las importantes cooperaciones que siguieron su ejemplo, Robert F. Smith advierte a la gente negra y a otras minorías que no entren en pánico por una razón clave. -Phenix S. Halley Leer más\n\nA pesar de que el programa de Meghan Markle fue un éxito, los detractores siguen odiándolo y las mujeres negras saben por qué\n\nApenas ha pasado una semana desde el lanzamiento de la nueva serie de estilo de vida de Meghan Markle, “With Love, Meghan”. se estrenó en NetflixEn cada episodio, la duquesa de Sussex comparte algunas de sus recetas favoritas y consejos de anfitriona con sus famosos amigos, con una casa de campo de California como hermoso telón de fondo. - Angela Johnson Leer más\n\nLos negros protestan, pero de una manera diferente y brillante\n\nMientras el país intenta mantenerse al día con la vertiginosa cantidad de formas en que el presidente Donald Trump ataca todo, desde nuestra economía hasta nuestros derechos civiles, algunos que una vez pusieron excusas para justificar el movimiento MAGA (porque, ya saben, el precio de los huevos), están rogando a la gente negra que se una a la lucha para ayudar a arreglar las cosas. Pero después de salir en masa el día de las elecciones para intentar detener a Trump 2.0, muchos de nosotros estamos agotados. Y según el galardonado periodista y autor Charles Blow, “la gente negra son marchando. Simplemente se ve diferente”. - Angela Johnson Leer más\n\nLa familia de la popular influencer negra responde a los rumores tras su muerte en México.\n\nLos fanáticos están de luto por la pérdida de un creador de contenido popular en redes sociales quien falleció en México justo un día antes de su cumpleaños número 25. Alysha Burney murió mientras dormía el 2 de marzo mientras estaba de vacaciones en Cabo San Lucas. según Fox4KC. Pero mientras sus seguidores lamentan el prematuro fallecimiento de Burney, su familia afirma que no todos los detalles que circulan sobre su muerte son ciertos. - Angela Johnson Leer más\n\n¿Por qué la gente le teme a la “luna de sangre” que aparecerá esta noche en el cielo?\n\n¿Buscas una razón para quedarte despierto un poco más tarde de lo habitual esta noche? ¿Qué tal la oportunidad de echar un vistazo a un regalo especial en el cielo como eclipse lunar total (también conocida como “Luna de Sangre”) será visible en América del Norte y del Sur, partes occidentales de África y Europa, Nueva Zelanda y una parte de Rusia. - Angela Johnson Leer más\n\nMujeres negras influyentes que viven como Meghan Markle... más o menos\n\nCuando piensas en el vida suaveQuizás te vengan a la mente palabras como “con derecho” y “privilegiado”. Pero, al contrario de lo que puedas pensar, la vida tranquila no siempre significa volar en primera clase y beber champán caro (aunque no lo rechazaríamos si nos lo ofrecieras). Se trata más bien de hacer lo que puedas para darte un respiro, aunque sea solo por un ratito. - Angela Johnson Leer más","summary":"Nunca es demasiado tarde para perseguir tus sueños, pero cuando una abuela del Bronx, Nueva York, decidió seguir los suyos y obtener su maestría, la vida dio un giro impensable. Después de un revés de dos años, de nuevo en marcha para abrir su propio negocio y brindar ayuda muy necesaria a la población sin hogar de…\n\nRead more...","url":"https://es.theroot.com/el-conflicto-de-lebron-james-con-stephen-a-smith-el-d-1851770243","image":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/19b12ac842c03f0b1138944c6953c9f5.jpg","video":null,"publish_date":"2025-03-15 00:00:00","author":"The Root Bot","authors":["The Root Bot"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":300333856,"title":"Deputy First Minister says the UK being a 'trusted ally' and NATO member helped to sell Northern Ireland in the United States","text":"Emma Little Pengelly was speaking to the News Letter as she prepared to return to the UK after a number of days of engagements with senior figures in the Trump administration – including the President himself. She said Donald Trump had seemed “genuinely interested” in Northern Ireland during her meeting with him earlier this week. The joint head of government at Stormont also met with a number of senior figures in his administration, and used the meetings to urge “collaboration” between this part of the UK and the United States. The DUP politician said it was important to focus on Northern Ireland’s strengths – and singled out its “stance on aerospace and defence, our strengths on cyber, on health and life sciences and creative industries”. “Northern Ireland is a NATO ally as part of the UK”, she said – and also pointed out that “the trade deficit is not as anywhere near as significant as that in the Republic of Ireland”. The deputy First Minister said: “My strong my pitch is, first of all, we're open for business, so please come talk to us. We want to do business with you. “We can help and support businesses that want to come to Northern Ireland. Secondly, we've got a really strong basis for collaboration. This isn't just one way. “It's not about the US investing in Northern Ireland, and that's it. It's about our collaboration. We've got a really good cyber security hub now in Northern Ireland, and those companies are working with big US companies, for example, Bloomberg, United Airlines and others, and the potential to do more in terms of defence as well”. She said the province’s strong aerospace and defence industry was a focus of her pitch to senior figures in Washington, including the State Department. Mrs Little Pengelly said that Northern Ireland can support the US as a NATO ally on issues such as under sea cables and cyber security. “We are very trusted, we have good regulation, it's high quality. It is trusted, and that's been demonstrated in terms of that international reach that we have, and that's something we're giving back as well to the US. That's a genuine collaboration”, she said. Asked about health minister Mike Nesbitt’s comments that the US shouldn’t give the UK a more favourable deal than the EU, because of the potential impact on Northern Ireland under the Windsor Framework, the deputy First Minister said she was interested in standing up for Northern Ireland. “I want the best deal for Northern Ireland. That's the only metric that I'm using. So I would like to see a good UK trade deal, and Northern Ireland must be fully included in that trade deal, of course”, she said. On her meeting with President Trump, she said he seemed “genuinely interested”. “I got a good bit of time with him to talk through a number of things. He seemed absolutely, genuinely interested. He referred to the fact that the Open [golf tournament] was coming to Northern Ireland”, she said. After presenting the President with a bespoke flag from Royal Portrush Golf Club, the Lagan Valley MLA said he offered him the opportunity to come and play the famous North Coast course. “I'd asked him had he played Royal Portrush before, and he said he hadn't. So I said, it'd be fantastic to get him over to play the course”, she said. The deputy First Minister also said that with new administrations in Washington and London, it was an important opportunity to raise issues such as the specific impact tariffs could have on Northern Ireland. Speaking on Friday afternoon, she said: “At the gala dinner last night, I had a good conversation with the deputy chief of staff in the White House. I was able to raise Northern Ireland with him, speak to him about the special envoy issue”, she said. “Quite frankly, many, many other places in the world would look on enviously at that level of unparalleled access. But in addition to that, you are talking to those key people, the people who write the speeches, the people who are going to be in the room when big decisions are made, and when you look at this tariff issue, for example, it's very clear that the decisions that are made here in DC have the potential to have that significant impact in Northern Ireland”, Ms Little Pengelly said. Ben Lowry writes about a minor triumph for unionists in his column on Page 11","summary":"​The deputy First Minister says NATO membership – as well as being part of the UK – puts Northern Ireland in a good position when seeking investment and building relationships with the United States.","url":"https://www.newsletter.co.uk/news/politics/deputy-first-minister-says-the-uk-being-a-trusted-ally-and-nato-member-helped-to-sell-northern-ireland-in-the-united-states-5035116","image":"https://www.newsletter.co.uk/webimg/b25lY21zOjIwY2Q3MWEyLWJiMzMtNDEyZi1iZTJhLWQ5MjA2NTYwMGRhMzpmOTgwYTAwZi1hMzA4LTRlYWMtYjY3YS1kZDRmNzcxOTVlMmI=.jpg?width=1200&enable=upscale","video":null,"publish_date":"2025-03-15 00:00:00","author":"David Thompson","authors":["David Thompson"],"language":"en","category":"politics","source_country":"gb","sentiment":0.4},{"id":300334624,"title":"Elon Musk Rages 'This Is Their Standard Playbook!' and Claims Democrats 'Tried to Kill' Trump in Wild Rant — After Billionaire Watches Tesla Crash in the Stock Market","text":"Elon Musk is not very happy these days as he has now blamed Democrats for his company Tesla having a historic downfall on the stock market.\n\nThe controversial billionaire reminded his followers why he stopped voting for Democrats, claiming they are the party of \"hate\" and they tried to take out Donald Trump, RadarOnline.com can reveal.The 53-year-old took to his own platform X to respond after one loyal fan reacted to Musk's tweet from 2022.\n\nAt the time, Musk wrote: \"In the past, I voted Democrat, because they were (mostly) the kindness party. But they have become the party of division and hate, so I can no longer support them and will vote Republican.\"\n\n\"Now, watch their dirty tricks campaign against me unfold.\"The user claimed Musk's prediction was \"proven right,\" as he wrote: \"Death threats, Tesla stores shot up, Superchargers firebombed, cyber attacks on X and conservative X users swatted.\"\n\nAlways one for attention, on March 14, Musk responded and said: \"It was easy to predict. This is their standard playbook. \n\n\"Look at what they did to President Trump. He was loved by democrats until he ran for president.\" \n\n\"Now they call him Hitler, Mussolini, Stalin, etc and try to kill him,\" Musk added, referring to the assassination attempt on Trump in Meridian, Pennsylvania, in July 2024.All this comes as Musk's automotive and clean energy company Tesla has taken a brutal hit in the stock market. According to Business Insider, from December to Wednesday of this week after trading hours, Tesla lost almost 50 percent of its market cap.\n\nThe company saw its peak value of $1.54trillion from the end of 2024 fall to about $777billion.\n\n\"We struggle to think of anything analogous in the history of the automotive industry, in which a brand has lost so much value so quickly,\" JPMorgan analysts told the outlet.Tesla continues to see a global decline in sales, largely due to Musk's political views. Meanwhile, plenty of Tesla showrooms in the United States have been hit with protests and vandalism incidents. \n\nThe president even said he would consider branding the perpetrators domestic terrorists.\n\nMeanwhile, Musk previously claimed he was being \"silenced\" on X, after the platform underwent what the businessman labeled as a \"cyberattack.\"\n\nHowever, even politicians are getting in on the act against Musk, as Sen. Mark Kelly (D-Ariz.) said Friday he plans to boot his Tesla car, calling out \"a--hole\" Musk.The senator said on X: “When I bought this thing, I didn’t think it was going to become a political issue. Every time I get in this car in the last 60 days or so, it reminds me of just how much damage Elon Musk and Donald Trump is doing to our country.”\n\nHe continued: \"Talking about slashing Social Security, cutting health care benefits for poor people, for seniors.\"\n\n\"It’s one bad thing after the next. He’s firing veterans. I’m a veteran,\" Kelly added.The DOGE boss has been open about cutting government waste, previously sending an email to federal employees urging them to list five things they had done that week, giving them a deadline, too.\n\nMusk then doubled-down and told workers the email was to figure out “who had a pulse and two working neurons,\" and then warned those who did not send the email would “soon be furthering their career elsewhere.”\n\nHowever, the email was met with plenty of pushback, including from department leads Kash Patel and Tulsi Gabbard in what was just the start of backlash against Musk.","summary":"Elon Musk is clearly having a brutal week as he's bashing Democrats for the hard hit his company Tesla has received, and even accused the party of trying to kill Trump.","url":"https://radaronline.com/p/elon-musk-standard-playbook-democrats-trump-tesla-stock-market/","image":"https://media.radaronline.com/brand-img/gp6txxswN/0x0/musk-rant-2-1741989916294.jpg","video":null,"publish_date":"2025-03-15 00:00:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.464},{"id":300334026,"title":"American Secretary of State declares that South Africa’s ambassador is no longer wanted","text":"Senator Marco Rubio, the Secretary of State, announced that the United States no longer welcomes South Africa’s ambassador to the country. Rubio stated that Ebrahim Rasool is unwelcome and provided no further explanation for his decision. He accused Rasool of being a divisive figure who holds animosity towards President Donald Trump, labeling him as “persona non grata.”\n\nThere is a lack of clarity surrounding the situation, as the State Department did not offer any additional information. It is uncertain whether the ambassador was present in the US at the time of Rubio’s statement. The announcement was made by Rubio while he was en route to Washington from a meeting with foreign ministers of the Group of 7 in Quebec.\n\nRasool previously served as his country’s ambassador to the US from 2010 to 2015 before returning this year.\n\nRasool experienced displacement from a Cape Town neighborhood reserved for white residents during his childhood. This early injustice sparked his involvement in anti-apartheid activism, leading to time spent in prison. Rasool proudly aligned himself with Nelson Mandela, South Africa’s first post-apartheid president, and eventually ventured into a political career within Mandela’s African National Congress.\n\nTrump said land was being expropriated from Afrikaners — which the order referred to as “racially disfavoured landowners” — when no land has been taken under the law.\n\nTrump also announced a plan to offer Afrikaners refugee status in the US They are only one part of South Africa’s white minority.\n\nThe Expropriation Act was signed into law by South African President Cyril Ramaphosa earlier this year and allows the government to take land in specific instances where it is not being used, or where it would be in the public interest if it is redistributed.\n\nIt aims to address some of the wrongs of South Africa’s racist apartheid era, when Black people had land taken away from them and were forced to live in areas designated for non-whites.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSenator Marco Rubio, the Secretary of State, announced that the United States&#8230;\n\n\nThis Post: American Secretary of State declares that South Africa&#8217;s ambassador is no longer wanted first appeared on Internewscast Journal","url":"https://internewscast.com/news/au/american-secretary-of-state-declares-that-south-africas-ambassador-is-no-longer-wanted/","image":"https://internewscast.com/wp-content/uploads/2025/03/US-Secretary-of-State-says-South-Africa039s-ambassador-039no-longer.au2Ffs2F73aba930-644f-447f-8914-d1792facd056.jpeg","video":null,"publish_date":"2025-03-14 23:59:57","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.442},{"id":300333466,"title":"Vance hopeful 'high-level' TikTok deal will be completed by early April (Business)","text":"Vice President JD Vance said Friday that he was hopeful a deal to keep TikTok operating in the U.S. will be wrapped up by the early April deadline.\n\n“There will almost certainly be a high-level agreement that I think satisfies our national security concerns, allows there to be a distinct American TikTok enterprise,” Vance said in an interview with NBC News abroad Air Force Two.\n\nQuestions about the future of the popular video sharing app have continued to linger since a law requiring its China-based parent company to divest or face a ban took effect on Jan. 19. After taking office, President Donald Trump gave TikTok a 75-day reprieve by signing an executive order that delayed enforcement of the statute until April 5.\n\nVance, along with National Security Adviser Michael Waltz, were tapped by Trump to find an approved buyer. On Sunday, Trump told reporters aboad Air Force One the administration was in talks with “four different groups” about TikTok and that a deal could come soon.\n\nTikTok and its parent company, ByteDance, have not publicly commented on the talks. It’s also unclear if ByteDance has changed its position on selling TikTok, which it said early last year it does not plan to do.\n\nAfter it made those comments, ByteDance and TikTok launched a legal challenge against the federal law, which was passed with bipartisan support in Congress and signed by then-President Joe Biden. In January, the two companies lost their case at the U.S. Supreme Court.\n\nNBC News reported that Vance did not offer details on who the potential buyers could be but noted that some issues could push a final agreement past the April 5 deadline.\n\n“We’d like to get it done without the extension,” Vance told the news outlet. “I think the question is, what is the equity ownership of the new joint venture? How do you do the contracts for all the investors, the customers, the service providers? … The deal itself will be very clear, but actually creating those thousands and thousands of pages of legal documents, that’s the one thing that I worry could slip.”\n\nTrump has previously said the deadline on a TikTok deal could be extended further if needed. He has also proposed terms in which the U.S. would have a 50% stake in a joint venture. The administration hasn’t provided details on what that type of deal would entail.","summary":"Vice President JD Vance said Friday that he was hopeful a deal to keep TikTok operating in the U.S. will be wrapped up by the early April deadline. &amp;ldquo;There will almost certainly be a high-level agreement that I think satisfies our national security concerns, allows there to be a distinct Americ...","url":"https://www.castanet.net/news/Business/538698/Vance-hopeful-high-level-TikTok-deal-will-be-completed-by-early-April","image":"https://www.castanet.net/content/2025/3/ef7e514968908801416450d300c09e1fbbc84c0de4453748b8edeb0405cb917e_p4164134.jpg","video":null,"publish_date":"2025-03-14 23:56:00","author":"Haleluya Hadero,The Canadian Press","authors":["Haleluya Hadero","The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.441},{"id":300333384,"title":"SpaceX successfully launches mission to rescue stranded astronauts","text":"SpaceX has successfully launched a rescue mission team to the International Space Station (ISS) for the return of two stranded astronauts.\n\nIt comes after the space technology company had to delay its mission over a last-minute technical issue with the rocket's launch pad earlier this week.\n\nThe Falcon 9 rocket took off at 7:03 pm, local time, from NASA's Kennedy Space Center in Florida carrying four astronauts who will replace astronauts Butch Wilmore and Suni Williams.\n\nMr Wilmore and Ms Williams are veteran NASA astronauts and were the first to fly Boeing's Starliner capsule to the ISS in June 2024.\n\nBut problems with Starliner's propulsion system during the flight forced an extension of their planned eight-day stay as NASA deemed it too risky for them to fly home on the craft, which returned to Earth empty in September.\n\nOtherwise a routine crew rotation flight, Friday's Crew-10 mission is also a long-awaited key step to bring the astronaut duo back to Earth.\n\nThey are scheduled to depart the station on March 19 after the Crew-10 astronauts arrive Saturday night.\n\nThe mission has become entangled in politics as US President Donald Trump and SpaceX's CEO Elon Musk have said without evidence that former president Joe Biden left the astronauts on the station for political reasons.\n\n\"We came prepared to stay long, even though we planned to stay short,\" Mr Wilmore said.\n\nHe added that he did not believe NASA's decision to keep them on the ISS until Crew-10's arrival had been affected by politics.\n\n\"That's what your nation's human spaceflight program's all about,\" he said.\n\n\"Planning for unknown, unexpected contingencies and we did that.\"\n\nNASA said the two astronauts have had to remain on the ISS to maintain its minimum staffing level.\n\nMr Wilmore and Ms Williams have been doing scientific research and conducting routine maintenance with the other astronauts.\n\nNASA says it changed flight safety verification\n\nMr Trump and Mr Musk's demand for an earlier return was an unusual intervention.\n\nNASA brought forward the Crew-10 mission from March 26, swapping a delayed SpaceX capsule for one that would be ready sooner.\n\nThe pressure from Mr Trump and Mr Musk has hung over a NASA preparation and safety process that normally follows a well-defined course.\n\nNASA's Commercial Crew Program manager Steve Stich said SpaceX's \"rapid pace of operations\" had required NASA to change some of the ways it verifies flight safety.\n\nNASA space operations chief Ken Bowersox added that the agency had to address some \"late-breaking\" issues.\n\nThis included investigating a fuel leak on a recent SpaceX Falcon 9 launch and deterioration of a coating on some of the Dragon crew capsule's thrusters.\n\nMr Bowersox said it was hard for NASA to keep up with SpaceX.\n\n\"We're not quite as agile as they are, but we're working well together,\" he said.\n\nMr Wilmore and Ms Williams and two others — NASA astronaut Nick Hague and Russian cosmonaut Aleksandr Gorbunov — are set to return to Earth in a capsule that has been attached to the station since September.\n\nCrew-10 is expected to dock with the ISS late on Saturday night, followed by a traditional handover ceremony that will allow for the Crew-9 crew's departure on March 19.\n\nReuters/ABC","summary":"The Falcon 9 rocket has successfully launched after the rescue mission was delayed due to a technical issue earlier this week. ","url":"https://www.abc.net.au/news/2025-03-15/spacex-successfully-launches-rescue-mission-team-to-iss/105055856","image":"https://live-production.wcms.abc-cdn.net.au/d460427ac8265d57c9b11a15fec2895f?impolicy=wcms_crop_resize&cropH=1943&cropW=3455&xPos=0&yPos=90&width=862&height=485","video":null,"publish_date":"2025-03-14 23:54:58","author":"ABC News","authors":["ABC News"],"language":"en","source_country":"AU","sentiment":-0.276},{"id":300330870,"title":"How I became an American judge  – Nigerian-born woman, Abayomi Ajaiyeoba","text":"How did you navigate your journey into the legal system in the United States? \n\nI was born in Nigeria. My family came to the US when I was six years old. A lot of my education was here. Initially, I was a social worker. During about 11 months into social work, I was often in court. So, I had an interest in the court system. In terms of background, I have relatives that were attorneys. One of my late uncles, Toriola Oyewo, was a Senior Advocate of Nigeria and died over two years ago.\n\nAfter working as a social worker and having an encounter with the court system, I decided to do some training as a paralegal. As a paralegal in the US, I worked for a civil rights organisation. I also had an opportunity to work as one of the first paralegals for the juvenile rights division of the Legal Aid Society.\n\nFinally, I worked with the city government when I was a paralegal at an agency called the New York City Law Board. After they promoted me to director of enforcement, that’s when I realised I was at a crossroads in my paralegal career. I wanted to decide to go to law school or pursue journalism because I love to write. I decided to go to law school.\n\nMy daughter at the time was five years old. I just went ahead and pursued my legal education because I was always someone who would troubleshoot things. After pursuing my legal education, I worked at the New York City Law Department, which was a government entity that represented all the city agencies in New York. I did that for three years. I worked in the administrative law division. After that, I went into private practice at a real estate litigation firm. I was a jack of all trades. I did many different things in law which time wouldn’t permit me to mention.\n\nAnd then ultimately I went to an agency called the Office of Administrative Trials and Hearings, where I was an administrative law judge. Then, I was screened by the Democratic Party’s Judicial Screening Committee. I actually sat on that committee where I screened other people, and I was found qualified. So, I was put on that qualified list that gave me a chance to run.\n\n Later, the New York State Governor enacted legislation to expand the number of seats on the court to address the backlog. And so, as a result of that, I went through a whole process with different political leaders. There was a list of 11 people who qualified. That list got whittled down to three, and I was one of the three.\n\n Were there peculiar challenges you faced in achieving these goals?\n\n Well, there will always be challenges. You were in law school for three years. After three years, you have to take a bar examination. New York and California are the two toughest bars in the country. When I think about challenges, which I mostly see as opportunities, I’ve always had a sense of decency with the blend of someone raised in a Nigerian household and with the principles in the US. We hear about intersectionality. I’m a woman; then, I’m a woman of colour. I’m a Nigerian, I’m a mum. I’m a naturalised US citizen, but I have a Nigerian identity because I have my Nigerian passport. There is something negative that’s associated with Nigeria. Notwithstanding, Nigerians are the largest group with the highest number of lawyers, doctors, and engineers. With this, Nigeria has started having a good reputation.\n\n Are there American judicial values that could positively influence Nigeria’s justice system? \n\nIn terms of the view from the bench, I believe in this whole notion of organisational justice. And a lot of that stems from the way we interact with individuals. We must treat them with dignity and respect, and give them due process. It’s important to be transparent and fair.\n\nUnfortunately, I don’t think that has always been the case in Nigeria. There are certain matters they will bring to my attention that revolve around human rights issues. Honestly, this got me thinking a little bit. In the US, there’s always two sides to a story, right? And as a jurist, it’s important not to respond to matters based on emotion. The justice system in Nigeria can emulate this.\n\n What are your perspectives on President Donald Trump’s policy of labelling immigrants out of status as illegal?\n\nAs a judge, I’m not supposed to get into anything political. However, we have a protocol in place to handle that. Our court officers and judges know the protocol. Definitely, there has been a lot of concern. Another thing is that there’s a lot of misinformation that’s going on out there. But people have to do their due diligence. They should not rely on WhatsApp, TikTok, or social media to get their information. They must speak with attorneys who are handling these matters.\n\n One of the things that I’ve been able to do in family court is a SIJ petition, which is Special Immigration Juvenile status. If there is a child under the age of 21 whose family abandoned or faced a problem in their country, and then they have someone in the US who wants to step in in the place of a guardian to take care of them, they could apply for relief in family court. If the petition is granted, they can now take that to immigration.\n\n Do you have projects in Nigeria for mentorship or other services?\n\nI was looking to start some kind of scholarship programme. But, I’m someone who has always been part of a formal mentorship committee whether in Nigeria or the US. I’m a proud Nigerian and always looking to connect people to resources. And I like the question because I’ve been looking for a way to do something more formal. I’m looking forward to doing something in the near future. Apart from this, there were times we provided food items for people especially during the pandemic.\n\n There is a saying that it’s not always greener on the other side. What do you think?\n\nIt’s unfortunate because people go to different countries for many reasons. You can’t take these reasons away from them. What led my family to this country was seeking opportunities even when the Nigerian economy was still great. But, now look at it. The struggle of daily life is still there. There are challenges of unemployment and insecurity. Even people are going to Ghana for opportunities. So, what are the opportunities in Nigeria? About opportunities in the US, Nigerians can connect to resources. There are resources available for everyone who is diligent. People will have resources when they are diligent and connect with the people.\n\n What advice do you have for young Nigerians seeking to practice law in the US?\n\nIf you were called to the bar in Nigeria, do not think that you need to come to the US to get another law degree. Many attorneys came from Nigeria. They were barred in Nigeria and they set up their practice in the states. You can have an LLM. Connect the community. Reach out to other Nigerians so that you don’t have to reinvent the wheel. And I think people are willing to give advice, but don’t give up, persevere. Get assistance, and help navigate. Make sure that you join different organisations where Nigerian law partners have been involved with. Stay resilient. And don’t believe everything out there without doing your research.","summary":"A Nigerian-born female judge at Kings County Family Court, Brooklyn, New York, Mrs Abayomi Ajaiyeoba, speaks with BIODUN BUSARI on her legal career in the United States How did you navigate your journey into the legal system in the United States? I was born in Nigeria. My family came to the US when I was \n\n\n \n Read More","url":"https://punchng.com/how-i-became-an-american-judge-nigerian-born-woman-abayomi-ajaiyeoba/","image":"https://cdn.punchng.com/wp-content/uploads/2025/03/14221029/Abayomi-Ajaiyeoba.jpg","video":null,"publish_date":"2025-03-14 23:53:52","author":"Biodun Busari","authors":["Biodun Busari"],"language":"en","category":"politics","source_country":"ng","sentiment":0.017},{"id":300333470,"title":"Democratic Party fractures in government shutdown fight, with anger running high (World)","text":"The Democratic Party was fracturing Friday as a torrent of frustration and anger was unleashed at Senate Democrats, led by Sen. Chuck Schumer, who faced what they saw as an awful choice: shut the government down or consent to a Republican funding bill that allows President Donald Trump to continue slashing the federal government.\n\nAfter Schumer announced that he would reluctantly support the bill, he bore the brunt of that anger, including a protest at his office, calls from progressives that he be primaried in 2028 and suggestions that the Democratic Party would soon be looking for new leaders.\n\nNine other members of the Democratic Caucus — a contingent of mostly swing-state and retiring senators — eventually joined Schumer in voting to advance the Republican funding proposal, providing crucial support to bring it to a final vote. It passed late Friday with Sens. Jeanne Shaheen of New Hampshire and Angus King of Maine voting with Republicans in favor.\n\nSince their election losses, Democrats have been hunkered against a barrage of Trump's early actions in office, locked out of legislative power and left searching for a plan to regain political momentum. But as Schumer let pass one of the rare moments when the party might regain leverage in Washington, the Democratic Party erupted in a moment of anger that had been building for months.\n\nMany in the party felt the New York Democrat was not showing sufficient fight, arguing that a government shutdown would have forced Trump and Republicans to the negotiating table. Yet for Schumer, who has led Senate Democrats since Trump took office in 2016, the choice ultimately came down to preventing a shutdown that he believed would only hand Trump more power and leave his party with the blame for disruptions to government services.\n\n\"A shutdown would allow DOGE to shift into overdrive,” Schumer warned on the Senate floor Friday, referring to the Department of Government Efficiency effort led by Elon Musk. He was also able to secure a Senate vote on a bill that would restore federal funding for Washington, D.C., that had been cut by House Republicans.\n\nSchumer voted no on the final vote for the funding bill, which only needed a simple majority to pass. Nonetheless, House Democrats released a stream of angry statements and social media posts aimed at Schumer.\n\nDemocratic Rep. Troy Carter of Louisiana on social media shared a photo of Trump and Schumer engaged in conversation with the caption, “A picture is worth a thousand words!”\n\nEven in the Senate, hardly any Democrats were speaking up in support of Schumer's strategy Friday. It was a remarkable turn for the longtime Democratic leader, leaving him standing practically alone.\n\nSpeaker Emerita Nancy Pelosi, his longtime ally and partner in funding fights of the past, said in a statement, “Let’s be clear: neither is a good option for the American people. But this false choice that some are buying instead of fighting is unacceptable.”\n\nPelosi added that the senators should listen to the women who lead appropriations for Democrats, Rep. Rosa DeLauro of Connecticut and Sen. Patty Murray of Washington. They had proposed a 30-day stopgap plan instead of the Republican proposal that provides funding until September. The Republican bill will trim $13 billion in non-defense spending from the levels in the 2024 budget year and increase defense spending by $6 billion.\n\nAs House Democrats, who almost all voted against the bill earlier this week, concluded a retreat in northern Virginia Friday, they also called for their Senate colleagues to show more fight. House Democratic leadership rushed back to the Capitol to hold a news conference and urge their Senate colleagues to vote against the bill.\n\n“We do not want to shutdown the government. But we are not afraid of a government funding showdown,” Jeffries said.\n\nHe also repeatedly declined to answer questions about whether he had confidence in Schumer.\n\nOther Democrats, such as Kentucky Gov. Andy Beshear, who is seen as a potential presidential candidate in 2028 and also visited the Democratic retreat, called for a broader movement. He mentioned the recent 60th anniversary of peaceful civil rights protests in Selma, Alabama, and argued that Democrats need to find “collective courage.”\n\n“When those individuals marched, there wasn’t one voice,\" Beshear said. \"There was a collective courage of that group that changed the world. That day opened up the eyes of the country to what was really going on.”\n\nSome were ready to start marching.\n\n“We’re ready to get out of this building and head back to the Capitol at any moment and prevent the government from shutting down,\" said Rep. Greg Casar of Texas, chair of the Congressional Progressive Caucus.\n\n“Now is the moment for Democrats to draw a line in the stand and say that we stand very firmly on the side of working class people and against the ultra-rich that are trying to corrupt our government for themselves,” he added.\n\nMeanwhile, some of the nation’s most influential progressive groups warned of serious political consequences for Senate Democrats and predicted a fierce backlash when members of Congress return home next week.\n\nEzra Levin, co-founder of Indivisible, which has organized hundreds of protests across the nation, said that nearly 8 in 10 of the group’s activists support primary challenges against “Senate Dems who cave on the GOP bill.”\n\nHe wrote on social media that the vast majority of those Democratic activists plan to express their anger at town halls or other public events next week. MoveOn, another progressive group that claims nearly 10 million members nationwide, predicted that its activists would also demand answers from Democratic officials in the coming days\n\n“Clearing the way for Donald Trump and Elon Musk to gut Social Security, Medicare and Medicaid is unacceptable. It’s past time for Democrats to fight and stop acting like it’s business as usual,” said Joel Payne, a spokesperson for MoveOn.\n\nSenate Democrats were also mostly unwilling to speak up to defend Schumer's move. Sen. Raphael Warnock, a Georgia Democrat, even suggested that the party should be looking for new leaders in the coming years.\n\n“I think come '26, '28, we’ll get some new leadership,” he said. His office later said Warnock was answering the question broadly.\n\nMostly, though, senators just lamented that they had been jammed by a Republican Party that has found a new sense of unity under Trump. For years, House Republicans have not been able to muster votes for government funding on their own, forcing them into bipartisan negotiations. This time, they passed the bill on party lines and left Washington.\n\n“We’re stuck with two bad choices presented by a unified Republican front,\" said Sen. Mark Warner, a Virginia Democrat.\n\nHe voted against the bill, yet said of Schumer's decision: “These are tough, tough calls.\"","summary":"The Democratic Party was fracturing Friday as a torrent of frustration and anger was unleashed at Senate Democrats, led by Sen. Chuck Schumer, who faced what they saw as an awful choice: shut the government down or consent to a Republican funding bill that allows President Donald Trump to continue s...","url":"https://www.castanet.net/news/World/538695/Democratic-Party-fractures-in-government-shutdown-fight-with-anger-running-high","image":"https://www.castanet.net/content/2025/3/a5f2d70fc5b7e039bdbd9f6f32bf7f8fc2da2b99b23c85408749264a2bcf6534_p4163989.jpg","video":null,"publish_date":"2025-03-14 23:53:00","author":"Elon Musk. He,The Canadian Press","authors":["Elon Musk. He","The Canadian Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.32},{"id":300336712,"title":"The US aluminum industry has been under attack for 25 years, Century Aluminum CEO says","text":"to top close Video This video is playing in picture-in-picture.\n\nMaria Bartiromos Wall Street March 14, 2025 04:11 \n\n The US aluminum industry has been under attack for 25 years, Century Aluminum CEO says \n Century Aluminum CEO Jesse Gary says President Donald Trump understands U.S. manufacturing on 'Maria Bartiromo's Wall Street.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSV-VIDEOSWALL STREET","summary":"Century Aluminum CEO Jesse Gary says President Donald Trump understands U.S. manufacturing on &apos;Maria Bartiromo&apos;s Wall Street.&apos;","url":"https://www.foxbusiness.com/video/6370058306112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/825a87fc-200b-48fa-9e8e-202b858c4ab0/88b43407-14c2-43e7-9631-1fce8cca6cbf/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-03-14 23:48:10","author":null,"language":"en","source_country":"us","sentiment":0.116},{"id":300333328,"title":"Watch: Federal agents seen arresting Palestinian activist Mahmoud Khalil in newly released video","text":"By JAKE OFFENHARTZ, Associated Press\n\nNEW YORK (AP) — A video released Friday shows the moment federal immigration agents arrested Mahmoud Khalil, a Palestinian activist and Columbia University graduate student whose detention alarmed free-speech advocates.\n\nThe clip begins with at least three agents confronting Khalil in the lobby of his apartment building near the Columbia campus Saturday night. The agents inform him that he is “going to be under arrest,” then order him to “turn around” and “stop resisting.”\n\n“There’s no need for this,” Khalil replies calmly as they place him in handcuffs. “I’m going with you. No worries.”\n\nAs his wife, Noor Abdalla, cries out in protest, asking in Arabic: “My love, how can I call you?” Khalil assures her that he will be fine and instructs her to call his lawyer.\n\nAbdalla, an American citizen who is eight months pregnant, then asks the agents to identify themselves. “We don’t give our names,” one replies.\n\nThe video was released by Khalil’s attorneys the same day the Justice Department announced it was investigating whether the university concealed “illegal aliens” on its campus.\n\nKhalil is a lawful U.S. resident with no criminal history. Secretary of State Marco Rubio said he revoked Khalil’s permission to be in the U.S. because of his role in pro-Palestinian protests at Columbia, saying they had riled up “anti-Jewish” sentiment and amounted to support for Hamas, the group that controls Gaza and attacked Israel on Oct. 7, 2023.\n\nHamas has been designated as a terrorist organization by the United States, Canada and the European Union.\n\nPresident Donald Trump, meanwhile, has warned that the attempted deportation will be the “first of many” of people who joined protests against Israel’s military action in Gaza.\n\nFederal officials announced Friday that they had arrested another woman tied to protests outside Columbia University and revoked the visa of a Columbia University doctoral student, who then left the country.\n\nKhalil’s wife, Abdalla, described his arrest as “the most terrifying moment of my life” in a statement accompanying the video. She said the arrest happened as the couple were returning home from an Iftar celebration.\n\n“They threatened to take me too,” she said.\n\nThe arrests have triggered fear among international students at Columbia and been condemned by free speech groups, which accuse the Trump administration of seeking to criminalize political dissent.\n\nKhalil’s lawyers have challenged his detention in court.\n\nIn court documents, they described how he was rushed from New York to Louisiana last weekend after his arrest.\n\nThe experience reminded Khalil of when he left Syria, where he was born, shortly after the forced disappearance of his friends there during a period of arbitrary detention in 2013, the lawyers wrote.\n\nAccording to the lawsuit, federal agents denied Khalil’s request to speak to a lawyer. When he was taken to a federal office building in lower Manhattan, Khalil saw an agent approach another agent and say, “the White House is requesting an update,” the lawyers wrote.\n\nAt some point early Sunday, Khalil was taken, handcuffed and shackled, to a detention center in Elizabeth, New Jersey, where he spent the night in a cold waiting room. His request for a blanket was denied, the lawsuit said.\n\nThen he was sent back to New York by van.\n\nAt 2:45 p.m. Sunday, he was put on an American Airlines flight from to Dallas, where he was placed on a second flight to Alexandria, Louisiana, arriving at 1 a.m. Monday.\n\nKhalil is now being held in an isolated, low-slung ICE detention complex ringed by two rows of tall, barbed wire fences and surrounded by the endless pine forests. The complex, with a capacity of 1,160, is outside the small town of Jena, roughly 150 miles north of Baton Rouge.\n\nHe now worries about his pregnant wife and is “also very concerned about missing the birth of his first child,” the lawsuit said.\n\nIn April, Khalil was to begin a job and receive health benefits that the couple was counting on, it added.\n\n“It is very important to Mr. Khalil to be able to continue his protected political speech, advocating and protesting for the rights of Palestinians — both domestically and abroad,” the lawsuit said.","summary":"The Columbia University graduate student's detention has alarmed free-speech advocates.","url":"https://www.ocregister.com/2025/03/14/mahmoud-khalil-arrest-video/","image":"https://www.ocregister.com/wp-content/uploads/2025/03/Campus_Protests-Immigration_Arrest_84044_71346a.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-14 23:47:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.179},{"id":300333368,"title":"Watch: Federal agents seen arresting Palestinian activist Mahmoud Khalil in newly released video","text":"By JAKE OFFENHARTZ, Associated Press\n\nNEW YORK (AP) — A video released Friday shows the moment federal immigration agents arrested Mahmoud Khalil, a Palestinian activist and Columbia University graduate student whose detention alarmed free-speech advocates.\n\nThe clip begins with at least three agents confronting Khalil in the lobby of his apartment building near the Columbia campus Saturday night. The agents inform him that he is “going to be under arrest,” then order him to “turn around” and “stop resisting.”\n\n“There’s no need for this,” Khalil replies calmly as they place him in handcuffs. “I’m going with you. No worries.”\n\nAs his wife, Noor Abdalla, cries out in protest, asking in Arabic: “My love, how can I call you?” Khalil assures her that he will be fine and instructs her to call his lawyer.\n\nAbdalla, an American citizen who is eight months pregnant, then asks the agents to identify themselves. “We don’t give our names,” one replies.\n\nThe video was released by Khalil’s attorneys the same day the Justice Department announced it was investigating whether the university concealed “illegal aliens” on its campus.\n\nKhalil is a lawful U.S. resident with no criminal history. Secretary of State Marco Rubio said he revoked Khalil’s permission to be in the U.S. because of his role in pro-Palestinian protests at Columbia, saying they had riled up “anti-Jewish” sentiment and amounted to support for Hamas, the group that controls Gaza and attacked Israel on Oct. 7, 2023.\n\nHamas has been designated as a terrorist organization by the United States, Canada and the European Union.\n\nPresident Donald Trump, meanwhile, has warned that the attempted deportation will be the “first of many” of people who joined protests against Israel’s military action in Gaza.\n\nFederal officials announced Friday that they had arrested another woman tied to protests outside Columbia University and revoked the visa of a Columbia University doctoral student, who then left the country.\n\nKhalil’s wife, Abdalla, described his arrest as “the most terrifying moment of my life” in a statement accompanying the video. She said the arrest happened as the couple were returning home from an Iftar celebration.\n\n“They threatened to take me too,” she said.\n\nThe arrests have triggered fear among international students at Columbia and been condemned by free speech groups, which accuse the Trump administration of seeking to criminalize political dissent.\n\nKhalil’s lawyers have challenged his detention in court.\n\nIn court documents, they described how he was rushed from New York to Louisiana last weekend after his arrest.\n\nThe experience reminded Khalil of when he left Syria, where he was born, shortly after the forced disappearance of his friends there during a period of arbitrary detention in 2013, the lawyers wrote.\n\nAccording to the lawsuit, federal agents denied Khalil’s request to speak to a lawyer. When he was taken to a federal office building in lower Manhattan, Khalil saw an agent approach another agent and say, “the White House is requesting an update,” the lawyers wrote.\n\nAt some point early Sunday, Khalil was taken, handcuffed and shackled, to a detention center in Elizabeth, New Jersey, where he spent the night in a cold waiting room. His request for a blanket was denied, the lawsuit said.\n\nThen he was sent back to New York by van.\n\nAt 2:45 p.m. Sunday, he was put on an American Airlines flight from to Dallas, where he was placed on a second flight to Alexandria, Louisiana, arriving at 1 a.m. Monday.\n\nKhalil is now being held in an isolated, low-slung ICE detention complex ringed by two rows of tall, barbed wire fences and surrounded by the endless pine forests. The complex, with a capacity of 1,160, is outside the small town of Jena, roughly 150 miles north of Baton Rouge.\n\nHe now worries about his pregnant wife and is “also very concerned about missing the birth of his first child,” the lawsuit said.\n\nIn April, Khalil was to begin a job and receive health benefits that the couple was counting on, it added.\n\n“It is very important to Mr. Khalil to be able to continue his protected political speech, advocating and protesting for the rights of Palestinians — both domestically and abroad,” the lawsuit said.","summary":"The Columbia University graduate student's detention has alarmed free-speech advocates.","url":"https://www.bostonherald.com/2025/03/14/mahmoud-khalil-arrest-video/","image":"https://www.bostonherald.com/wp-content/uploads/2025/03/Campus_Protests-Immigration_Arrest_84044_71346a.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-14 23:47:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.179},{"id":300332648,"title":"Watch: Federal agents seen arresting Palestinian activist Mahmoud Khalil in newly released video","text":"By JAKE OFFENHARTZ, Associated Press\n\nNEW YORK (AP) — A video released Friday shows the moment federal immigration agents arrested Mahmoud Khalil, a Palestinian activist and Columbia University graduate student whose detention alarmed free-speech advocates.\n\nThe clip begins with at least three agents confronting Khalil in the lobby of his apartment building near the Columbia campus Saturday night. The agents inform him that he is “going to be under arrest,” then order him to “turn around” and “stop resisting.”\n\n“There’s no need for this,” Khalil replies calmly as they place him in handcuffs. “I’m going with you. No worries.”\n\nAs his wife, Noor Abdalla, cries out in protest, asking in Arabic: “My love, how can I call you?” Khalil assures her that he will be fine and instructs her to call his lawyer.\n\nAbdalla, an American citizen who is eight months pregnant, then asks the agents to identify themselves. “We don’t give our names,” one replies.\n\nThe video was released by Khalil’s attorneys the same day the Justice Department announced it was investigating whether the university concealed “illegal aliens” on its campus.\n\nKhalil is a lawful U.S. resident with no criminal history. Secretary of State Marco Rubio said he revoked Khalil’s permission to be in the U.S. because of his role in pro-Palestinian protests at Columbia, saying they had riled up “anti-Jewish” sentiment and amounted to support for Hamas, the group that controls Gaza and attacked Israel on Oct. 7, 2023.\n\nHamas has been designated as a terrorist organization by the United States, Canada and the European Union.\n\nPresident Donald Trump, meanwhile, has warned that the attempted deportation will be the “first of many” of people who joined protests against Israel’s military action in Gaza.\n\nFederal officials announced Friday that they had arrested another woman tied to protests outside Columbia University and revoked the visa of a Columbia University doctoral student, who then left the country.\n\nKhalil’s wife, Abdalla, described his arrest as “the most terrifying moment of my life” in a statement accompanying the video. She said the arrest happened as the couple were returning home from an Iftar celebration.\n\n“They threatened to take me too,” she said.\n\nThe arrests have triggered fear among international students at Columbia and been condemned by free speech groups, which accuse the Trump administration of seeking to criminalize political dissent.\n\nKhalil’s lawyers have challenged his detention in court.\n\nIn court documents, they described how he was rushed from New York to Louisiana last weekend after his arrest.\n\nThe experience reminded Khalil of when he left Syria, where he was born, shortly after the forced disappearance of his friends there during a period of arbitrary detention in 2013, the lawyers wrote.\n\nAccording to the lawsuit, federal agents denied Khalil’s request to speak to a lawyer. When he was taken to a federal office building in lower Manhattan, Khalil saw an agent approach another agent and say, “the White House is requesting an update,” the lawyers wrote.\n\nAt some point early Sunday, Khalil was taken, handcuffed and shackled, to a detention center in Elizabeth, New Jersey, where he spent the night in a cold waiting room. His request for a blanket was denied, the lawsuit said.\n\nThen he was sent back to New York by van.\n\nAt 2:45 p.m. Sunday, he was put on an American Airlines flight from to Dallas, where he was placed on a second flight to Alexandria, Louisiana, arriving at 1 a.m. Monday.\n\nKhalil is now being held in an isolated, low-slung ICE detention complex ringed by two rows of tall, barbed wire fences and surrounded by the endless pine forests. The complex, with a capacity of 1,160, is outside the small town of Jena, roughly 150 miles north of Baton Rouge.\n\nHe now worries about his pregnant wife and is “also very concerned about missing the birth of his first child,” the lawsuit said.\n\nIn April, Khalil was to begin a job and receive health benefits that the couple was counting on, it added.\n\n“It is very important to Mr. Khalil to be able to continue his protected political speech, advocating and protesting for the rights of Palestinians — both domestically and abroad,” the lawsuit said.","summary":"The Columbia University graduate student's detention has alarmed free-speech advocates.","url":"https://www.sandiegouniontribune.com/2025/03/14/mahmoud-khalil-arrest-video/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2025/03/Campus_Protests-Immigration_Arrest_84044_71346a.jpg?w=1024&h=682","video":null,"publish_date":"2025-03-14 23:47:57","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.179},{"id":300330268,"title":"SpaceX launches relief mission for stranded NASA astronauts","text":"NASA's beleaguered mission to rescue two stranded astronauts has finally launched, setting the stage for a happy ending to the nine-month-long saga.\n\nThe SpaceX Falcon 9 rocket successfully took off Friday night from NASA's Kennedy Space Center, on a mission to deliver four new astronauts to the International Space Station (ISS).\n\nThe new team is scheduled to arrive at the station on late on Saturday. Once there, astronauts Sunita Williams and Butch Wilmore will finally be able to return to Earth at some point on or shortly after March 19.\n\nThe pair have been stranded in orbit since June 5, with SpaceX owner Elon Musk and many others claiming Williams and Wilmore were left on the ISS for political reasons. \n\nThe duo were initially scheduled for an eight day mission. \n\nMusk said he offered to bring the astronauts home eight months ago, but the Biden Administration shot it down because it would've made Donald Trump 'look good' in the presidential race against former vice president Kamala Harris. \n\nThe successful takeoff comes after the Crew-10 mission was scrubbed on the launch pad due to mechanical issues just minutes before launch on Wednesday.\n\nCrew-10 includes NASA astronauts Anne McClain and Nichole Ayers, Japan's Takuya Onishi, and Russia's Kirill Peskov.\n\n'Spaceflight is tough, but humans are tougher,' McClain said minutes into the flight. \n\nThe new crew will spend the next six months at the space station, considered the normal stint. \n\nAlongside Williams and Wilmore, NASA's Nick Hague and Russia's Aleksandr Gorbunov will be returning home on board SpaceX's Crew-9 Dragon capsule that is already docked at the ISS.\n\nLast year's presidential race seems to be at the heart of why the astronauts have been stuck in space so long. \n\nMusk backed Trump during the 2024 presidential race, donating $288 million to his campaign and appearing at several MAGA rallies\n\nDuring a recent press briefing, Ken Bowersox, associate administrator of the NASA's Space Operations Mission Directorate, admitted that there 'may have been conversations' in the Biden White House about delaying the return for political optics of having Trump's most famous donor save the day, but he was not part of the discussions.\n\nWednesday's Crew-10 launch was called off due to a hydraulic system issue with the Falcon 9 rocket. NASA said teams were working to address the problem.\n\nNASA had moved up the return mission by two weeks after after President Trump told Musk to 'go get' Williams and Wilmore. \n\nBefore the president's request, the astronauts were not coming back earlier than March 26. \n\n'It's been a roller coaster for them, probably a little bit more so than for us,' Williams said of her family. \n\n'We're here, we have a mission - we're just doing what we do every day, and every day is interesting because we're up in space and it's a lot of fun.' \n\nWhen the new crew arrives aboard the station, Wilmore, Williams, Nick Hague, and Aleksandr Gorbunov can return to Earth in the capsule that has been attached to the station since September.\n\nWilmore and Williams flew to the ISS as the first test crew of Boeing's Starliner, which suffered propulsion system issues in space.\n\nNASA deemed it too risky for the astronauts to fly home on the Boeing craft. This led to the current plan to bring them home in a SpaceX capsule that arrived in September.\n\nThe space agency gave Boeing $4.5 billion contract to develop Starliner in a bid to compete with Musk's SpaceX.\n\nBowersox said that SpaceX 'helped with a lot of options' for bringing Williams and Wilmore back earlier, but the final decision came down to costs.\n\nHe explained that they discussed adding a mission or bringing the currently docked capsule home early, 'but we ruled them out pretty quickly just based on how much money we've got in our budget.' \n\nNASA's budget for the fiscal year 2024 comes in at just under $30 billion.\n\nIt comes after a report found the agency spent millions on Diversity, Equity, and Inclusion (DEI) grants and contracts while Williams and Wilmore have been stuck in space.\n\nBill Gerstenmaier, vice president for SpaceX, also said that NASA's delayed plan allowed the agency 'to use Sunny and Butch in a very productive manner' and 'keep the science going.'\n\nReturning the astronauts early would've meant fewer bodies on the International Space Station (ISS) to continue research.","summary":"The SpaceX Falcon 9 rocket successfully took off Friday night from NASA's Kennedy Space Center, on a mission to deliver four new astronauts to the International Space Station (ISS).","url":"https://www.dailymail.co.uk/sciencetech/article-14500361/SpaceX-launches-relief-mission-stranded-NASA-astronauts-elon-musk.html","image":"https://i.dailymail.co.uk/1s/2025/03/14/23/96214761-0-image-m-25_1741995831571.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/03/05/6695064963204401068/1024x576_MP4_6695064963204401068.mp4","publish_date":"2025-03-14 23:45:39","author":"Chris Melore,Editor","authors":["Chris Melore","Editor"],"language":"en","source_country":"GB","sentiment":-0.323},{"id":300333474,"title":"B.C. ports monitoring Alaska senatorâs cruise-ship bypass threat (BC)","text":"B.C. cruise-ship ports say they are monitoring political developments after Alaska Sen. Dan Sullivan reportedly suggested scrapping longstanding laws that require cruise ships to stop in Canada while travelling between states.\n\n“Recent discussions about a potential waiver to the U.S. Passenger Vessel Services Act (PVSA) have raised questions about the role of Canadian ports in the Alaska cruise experience\n\n“Greater Victoria Harbour Authority continues to closely monitor the political situation and to actively promote stability in the cruise industry,” said its CEO Robert Lewis-Manning in a statement to BIV Friday.\n\nSullivan’s comments to 650 KENI radio, as reported by Anchorage Daily News, came the day after B.C. Premier David Eby passed legislation allowing his government to toll trucks passing from Washington state to Alaska.\n\nEby has also pulled all American-produced alcohol off government liquor store shelves after initially targeting so-called “red states” or those with a Republican governor.\n\nSullivan is a Republican, as is Alaska Gov. Mike Dunleavy, who Eby said he spoke to earlier this month to discuss U.S. President Donald Trump’s tariff threats. Eby said he did not get the sense his concerns would be communicated to Trump.\n\nThe U.S. Passenger Vessel Services Act prohibits foreign-flagged vessels (such as cruise ships) from transporting passengers between U.S. ports (such as Seattle and Anchorage) without stopping at a foreign port. The act is a protectionist measure for U.S. maritime industries and there are some exceptions. \n\nThe act was last raised as an impediment during the COVID-19 pandemic, when American officials sought a broad exemption.\n\nThe Greater Victoria Harbour Authority’s Lewis-Manning said there are 320 cruise ships scheduled to visit his city in 2025.\n\nUltimately it is up to private cruise ships to decide if they wish to bypass a B.C. port between U.S. states, noted Lewis-Manning.\n\n“We will provide a warm welcome to every cruise ship passenger. There is a long history of Victoria welcoming travellers from countries around the world, and that will continue,” he said.\n\nMeanwhile, at the Port of Vancouver, spokesperson Alex Munroe said the agency is also monitoring the situation and “having ongoing conversations with our cruise line partners.”\n\nHowever, Munroe noted Vancouver differs from the likes of Victoria and Nanaimo because it is a home base for one-way and round-trip cruises.\n\n“We expect Canada Place will long remain one of North America’s premier homeports serving the Alaska market. The terminal also offers strategic advantages and benefits from a well-established support network of businesses and port operators that can ensure cruise lines are able to re-fuel, re-stock and maintain their ships between voyages, as well as offering U.S. border pre-clearance services and Canadian border services for passengers.” Munroe told BIV.\n\nAccording to the port, as of March 4 there are 301 cruise ship calls scheduled between March 5 and Oct. 21, with more than 1.2 million passengers expected to pass through the cruise terminal in 2025.\n\nDisembarking passengers are a key source of tourists for the region. Cruise operations in Vancouver are said to inject about $1 billion into the local economy, the port claims.","summary":"B.C. cruise-ship ports say they are monitoring political developments after Alaska Sen. Dan Sullivan reportedly suggested scrapping longstanding laws that require cruise ships to stop in Canada while travelling between states. &amp;ldquo;Recent discussions about a potential waiver to the U.S. Passenger ...","url":"https://www.castanet.net/news/BC/538690/B-C-ports-monitoring-Alaska-senator-s-cruise-ship-bypass-threat","image":"https://www.castanet.net/content/2025/3/glacier_145581_p.jpg","video":null,"publish_date":"2025-03-14 23:39:00","author":"Contributed","authors":["Contributed"],"language":"en","source_country":"ca","sentiment":0.104},{"id":300330694,"title":"Jasmine Crockett says we need illegal immigrants because they clean our hotels and pick our food","text":"Democratic Party rising star Rep. Jasmine Crockett, D-Texas, argued that Americans need illegal immigrants because they do the work that the college-educated in this country won't do. Crockett reportedly made the comments while speaking at the South by Southwest (SXSW) festival on March 8. In a video clip that went viral on Friday, Crockett made the point that Americans don't send their kids to college in the hope that they'll end up picking crops and cleaning hotel rooms, but that's what illegal immigrants do. \"How many of you are sending your kids to college?\" Crockett asked the crowd. \"How many of you are sending your kids to college to go and work on the farms?\" DEM STRATEGIST WARNS ILLEGAL IMMIGRANTS ARE NEEDED FOR ‘PICKING STRAWBERRIES’ After no response, Crockett added, \"Okay, so, guess who is working the farms so that you can afford your food? So that you can have food.\" The congresswoman continued to make her point that Americans don't want their college-educated kids to provide these services and goods. \"Now, how many of you are looking to send your kids into hospitality after this college education so that they can go and make the beds at the hotels?\" she asked. \"How many of you are planning to send your kids to college — because that's what we do, we send everybody to college — how many of you are planning to send your kids to college so that they can then go and build these houses?\" she continued. KELLY OSBOURNE INFAMOUS ‘VIEW’ REMARK ON LATINOS PART OF VIRAL TIKTOK TREND: ‘MOST CRINGE MOMENT OF MY LIFE’ \"So the reality is, as long as we live in a capitalistic society, there's always going to be someone, or a group of people, that will do work that some of the rest of y'all don't want to do,\" Crockett said. \"These are the people who are really making us great in this country. They pay into taxes. And guess what? They’re not able to pull down on Social Security. So to have people going out disparaging them and targeting them, that is not what makes us great,\" she concluded. Crockett was on stage with journalist Errin Haines, editor-at-large of The 19th News. Haines posted the clip to her social media earlier this week before it was re-shared on X on Friday, where it picked up over 1 million views in four hours. In the caption for the original video, Haines said she asked Crockett about President Donald Trump's efforts to \"significantly restrict immigration,\" including authorizing immigration law enforcement to raid churches and schools and rolling back funding for sanctuary states and cities. Crockett isn't the only Democrat who has made this argument in recent years. Rep. Jerry Nadler, D-N.Y., made similar comments last year, saying the country needed \"many illegal immigrants\" or our vegetables would \"rot in the ground.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE In 2023, Florida Rep. Debbie Wasserman Schultz also said vegetables in her state would start \"rotting\" due to an anti-illegal immigration law. Former House Speaker Nancy Pelosi said in 2022 that farmers need illegal immigrants \"to pick the crops\" in Florida. CLICK HERE TO GET THE FOX NEWS APP Crockett drew attention last week for claiming that entering the country illegally was \"not a crime,\" despite it being a violation of federal law. Improper entry into the United States is considered a federal misdemeanor crime in violation of 8 USC 1325, punishable by fines and up to six months in jail for first-time offenders. Repeat offenders can be subjected to fines and up to two years in prison.","summary":"Democratic Rep. Jasmine Crockett argued that most Americans don&apos;t want to do the jobs that illegal immigrants do, so the Trump administration shouldn&apos;t &quot;target&quot; them.","url":"https://www.foxnews.com/media/jasmine-crockett-says-we-need-illegal-immigrants-because-clean-our-hotels-pick-our-food","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/03/931/523/crockett1.png?ve=1&tl=1","video":null,"publish_date":"2025-03-14 23:37:20","author":"Kristine Parks","authors":["Kristine Parks"],"language":"en","category":"politics","source_country":"US","sentiment":-0.387},{"id":300331078,"title":"Mark Carney sworn in as Canada's new prime minister","text":"Former central banker Mark Carney was sworn in as Canada's new prime minister on Friday, and will now try to steer his country through a trade war brought by U.S. President Donald Trump, annexation threats and an expected federal election.Carney, 59, replaces Prime Minister Justin Trudeau, who announced his resignation in January but remained in power until the Liberal Party elected a new leader. Carney is widely expected to trigger a general election in the coming days or weeks.\"We will never, ever, in any way shape or form, be part of the United States. America is not Canada,\" Carney said. \"We are very fundamentally a different country.\"The governing Liberal Party had appeared poised for a historic election defeat this year until Trump declared economic war and repeatedly has said Canada should become the 51st state. Now the party and its new leader could come out on top.Carney has said he's ready to meet with Trump if he shows respect for Canadian sovereignty. He said he doesn't plan to visit Washington at the moment but hopes to have a phone call with the president soon.\"The president is a successful businessman and deal maker. We're his largest client in so many industries,\" Carney said. \"Clients expect respect and working together in a proper commercial way.\"Carney navigated crises when he was the head of the Bank of Canada during the 2008 financial crisis, and then in 2013 when he became the first noncitizen to run the Bank of England - helping to manage the worst impacts of Brexit in the U.K.Carney, a former Goldman Sachs executive with no experience in politics, becomes Canada's 24th prime minister. He said protecting Canadian workers and their families in the face of unjustified trade actions and growing the economy will be his top priorities.Carney said he will travel to Europe to visit French President Emmanuel Macron and U.K. Prime Minister Keir Starmer in the coming days. He received invitations from both.\"We must diversify our trade partners and strengthen our security in so doing,\" Carney said.Trump put 25% tariffs on Canada's steel and aluminum and is threatening sweeping tariffs on all Canadian products April 2. He has threatened economic coercion in his annexation threats and suggested the border is a fictional line.Carney called the idea \"crazy.\"The U.S. trade war and Trump's talk of making Canada the 51st U.S. state have infuriated Canadians, who are booing the American anthem at NHL and NBA games. Some are canceling trips south of the border, and many are avoiding buying American goods when they can.Carney said he's worked with Trump before at G7 and G20 summits during Trump's first presidency.\"We share some experiences. I have been in the private sector. I have worked in the real estate sector. I have done large transactions,\" Carney said. \"We will both be looking out for our countries but he knows, and I know from long experience, that we can find mutual solutions that win for both.\"The opposition Conservatives hoped to make the election about Trudeau, whose popularity declined as food and housing prices rose and immigration surge.But after decades of bilateral stability, the vote on Canada's next leader now is expected to focus on who is best equipped to deal with the U.S.\"He will do very well. He's respected internationally,\" former Prime Minister Jean Chrétien told reporters Friday. But, he added: \"There is no magic solution. This is not a normal situation. We've never seen someone who changes his mind every five minutes as president of the United States.\"","summary":"Carney, a former Goldman Sachs executive with no experience in politics, becomes Canada's 24th prime minister.","url":"https://www.cbsnews.com/news/mark-carney-canada-new-prime-minister/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2025/03/10/e0845d71-726f-48bf-a06e-afef2ab797e0/thumbnail/1200x630/727aba6618250846119debb354db861c/cbsn-fusion-mark-carney-to-be-canadas-new-prime-minister-after-justin-trudeau-resignation-thumbnail.jpg?v=e7f44f5","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3597282_hls/master.m3u8","publish_date":"2025-03-14 23:36:14","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.103},{"id":300332490,"title":"SpaceX launches new crew to space station to replace Nasa’s stuck astronauts","text":"The replacements for Nasa’s two stuck astronauts launched to the International Space Station on Friday night, paving the way for the pair’s return after nine long months.\nButch Wilmore and Suni Williams need SpaceX to get this relief team to the space station before they can check out. Arrival is set for late Saturday night.\nNasa wants overlap between the two crews so Wilmore and Williams can fill in the newcomers on happenings aboard the orbiting lab. That would put them on course for an undocking next week and a splashdown off the Florida coast, weather permitting.\nThe duo will be escorted back by astronauts who flew up on a rescue mission on SpaceX last September alongside two empty seats reserved for Wilmore and Williams on the return leg.\nRocketing toward orbit from Nasa’s Kennedy Space Centre, the newest crew includes Nasa’s Anne McClain and Nichole Ayers, both military pilots; and Japan’s Takuya Onishi and Russia’s Kirill Peskov, both former airline pilots.\nThey will spend the next six months at the space station, considered the normal stint, after springing Wilmore and Williams free.\n\nAs test pilots for Boeing’s new Starliner capsule, Wilmore and Williams expected to be gone just a week or so when they launched from Cape Canaveral on June 5. A series of helium leaks and thruster failures marred their trip to the space station, setting off months of investigation by Nasa and Boeing on how best to proceed.\nEventually ruling it unsafe, Nasa ordered Starliner to fly back empty last September and moved Wilmore and Williams to a SpaceX flight due back in February. Their return was further delayed when SpaceX’s brand new capsule needed extensive battery repairs before launching their replacements.\nTo save a few weeks, SpaceX switched to a used capsule, moving up Wilmore and Williams’ homecoming to mid-March.\nAlready capturing the world’s attention, their unexpectedly long mission took a political twist when US President Donald Trump and SpaceX’s Elon Musk vowed earlier this year to accelerate the astronauts’ return and blamed the former administration for stalling it.\nRetired Navy captains who have lived at the space station before, Wilmore and Williams have repeatedly stressed that they support the decisions made by their Nasa bosses since last summer.\nThe two helped keep the station running – fixing a broken toilet, watering plants and conducting experiments – and even went out on a spacewalk together. With nine spacewalks, Williams set a record for women: the most time spent spacewalking over a career.\nA last-minute hydraulics issue delayed Wednesday’s initial launch attempt. Concern arose over one of the two clamp arms on the Falcon rocket’s support structure that needs to tilt away right before lift-off. SpaceX later flushed out the arm’s hydraulics system, removing trapped air.\nThe duo’s extended stay has been hardest, they said, on their families – Wilmore’s wife and two daughters, and Williams’ husband and mother.\nBesides reuniting with them, Wilmore, a church elder, is looking forward to getting back to face-to-face ministering and Williams can’t wait to walk her two Labrador retrievers.\n“We appreciate all the love and support from everybody,” Williams said in an interview earlier this week.\n“This mission has brought a little attention. There’s goods and bads to that. But I think the good part is more and more people have been interested in what we’re doing” with space exploration.","summary":"Butch Wilmore and Suni Williams’ initial week-long mission became a nine-month stint after technical issues kept them from returning home.","url":"https://www.scmp.com/news/world/united-states-canada/article/3302493/spacex-launches-new-crew-space-station-replace-nasas-stuck-astronauts","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/03/15/7fa7faea-42f7-47d3-bd71-5249ed44b42b_c95b8ab6.jpg","video":null,"publish_date":"2025-03-14 23:32:42","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"cn","sentiment":-0.295},{"id":300331084,"title":"Universal Music Group Shares Fall Nearly 9% on Pershing Square Stock Sale","text":"The music business has earned a reputation for being recession-proof. In bad economic times, people still pay for their music subscription services and want to go to concerts. Some synch opportunities may dry up as advertisers make cutbacks, but overall, the music is a hearty business that doesn’t follow typical economic cycles.\n\n Music business stocks, however, aren’t immune to fluctuations in the market and investors’ worries about the increasingly fragile state of the economy. This week, just three of the 20 companies on the Billboard Global Music Index (BGMI) finished with gains, and five stocks had losses in excess of 10%. Despite a host of strong quarterly earnings results in recent weeks, President Donald Trump’s tariffs on goods from Canada, Mexico, China and Europe have caused markets to panic, taking down music stocks along with the industrial and agricultural companies most likely to be affected.\n\n The S&P 500 entered correction territory on Thursday (March 13) when it closed down 10% from the all-time high. The Russell 2000, an index of small companies, was down 18.4% from its peak. Most stocks improved on Friday (March 14) as markets rallied — despite a decline in the University of Michigan’s consumer confidence index — but the first four days of the week were too much to overcome. The S&P 500 finished the week down 2.3% and the Nasdaq composite closed down 2.4%.\n\n Markets outside of the U.S. fared better than U.S. markets. The U.K.’s FTSE 100 dropped just 0.5%. South Korea’s KOSPI composite index rose 0.1% and China’s SSE Composite Index improved 1.4%. \n\n Even though 17 of the 20 companies on the BGMI posted losses this week, the index rose 0.5% to 2,460.71 because of Spotify’s 8.1% gain, and the dollar’s nearly 1% increase against the euro offset the weekly declines of 17 other stocks. Spotify is the BGMI’s largest component with a market capitalization of approximately $117 billion — more than twice that of Universal Music Group’s (UMG’s) $50.2 billion. The stock also received rare good news this week as Redburn Atlantic initiated coverage of Spotify with a $545 price target (which implies 5.5% upside from Friday’s closing price) and a neutral rating.\n\n UMG shares fell 8.8% on Friday, a reaction to Pershing Square’s announcement on Thursday that it will sell 50 million shares worth approximately $1.5 billion. Pershing Square CEO Bill Ackman called UMG “one of the best businesses we have ever owned.” JP Morgan analyst Daniel Kerven admitted the news was “a near-term negative for confidence” in UMG but saw Pershing Square’s decision to sell shares as a move to take profits and re-weigh its portfolio (UMG was 27% of Pershing Square’s holdings) rather than a commentary about UMG’s long-term potential or recent operating performance. UMG shares ended the week down 8.2% to 25.46 euros ($27.78) but remained up 6.5% year to date. \n\n Live Nation shares dropped 6.5% to $119.22, marking the stock’s fourth consecutive weekly decline. During the week, Deutsche Bank increased its Live Nation price target to $170 from $150 and maintained its “buy” rating. On Friday, a judge denied Live Nation’s request to dismiss an accusation that the promoter illegally forced artists to use its promotion business if they wanted to perform in its amphitheaters. \n\n Other U.S.-based live entertainment companies also fell sharply. Sphere Entertainment Co. fell 10.1% to $31.55. MSG Entertainment dropped 1.3% to $31.46 despite Wolfe Research upgrading the stock to “outperform” from “peer perform” with a $46 price target. Vivid Seats, a secondary ticketing platform, fell 28.1% to $2.86 after the company announced fourth-quarter earnings. \n\n Radio companies, which tend to suffer when economic uncertainty causes advertisers to pull back spending, had yet another down week. iHeartMedia fell 12.0% to $1.61. Cumulus Media dropped 11.5% to $0.46. And SiriusXM, which announced layoffs this week, fell 10.1% to $22.67. Year to date, iHeartMedia is down 24.4% and Cumulus Media is down 40.3%. SiriusXM, on the other hand, has gained 1.4% in 2025. \n\n K-pop stocks also fell sharply despite South Korea’s market finishing the week with a small gain. HYBE, SM Entertainment, JYP Entertainment and YG Entertainment had an average decline of 7.4% for the week. Collectively, however, the four South Korean companies have had a strong start to 2025 and, after this week, had an average year-to-date gain of 19.3%.","summary":"The company's shares dropped on major shareholder Pershing Square’s plan to sell 50 million shares, capping off a rough week for most music stocks.  ","url":"https://www.billboard.com/pro/universal-music-group-shares-fall-pershing-stock-sale/","image":"https://www.billboard.com/wp-content/uploads/2024/03/universal-umg-headquarters-billboard-04-1548.jpg","video":null,"publish_date":"2025-03-14 23:31:43","author":"Glenn Peoples","authors":["Glenn Peoples"],"language":"en","source_country":"us","sentiment":-0.126},{"id":300330966,"title":"Letters: Silicon Valley’s technology promise has become a nightmare","text":"Promise of technology\nhas become nightmare\n\nBack in the late 1960s-90s, the emergence of Silicon Valley was hailed as a window into a bright future. We thought highly of those many technological entrepreneurs and their young techie workers, whose dreams and ideas fueled many innovations that improved our lives.\n\nHowever, in more recent times, Silicon Valley has become a source of ominous foreboding. The once positive humanitarian dreams of its entrepreneurs, who are now reveling in the billions in their portfolios, have turned into nightmarish longings for power and control. Their technology is no longer geared toward providing jobs and raising the standard of living for all, but instead, eliminating jobs through such things as AI, driverless cars and information algorithms. Instead of holding aloft a useful, new product, they wave chainsaws on stage in a sadistic dance of hate towards others’ work.\n\nYoung techies now engage in dismantling our institutions, not enhancing them.\n\nRobert Thomas\nCastro Valley\n\nOnly Lee has gravitas\nto lead Oakland\n\nAs a longtime Oakland resident and former councilmember, I know that Barbara Lee is the best choice to be our next mayor. I was proud of her for representing us in Congress for so many years and am excited for what she can do as mayor. Her accomplishments at the federal and state levels couldn’t have happened without her ability to bring people together, even across disparate interests.\n\nJust in the past few weeks, she already brought business and labor leaders together to collaborate on solving some of the Town’s toughest challenges. That’s the kind of leadership Oakland needs — someone who will bring us together to restore and rebuild. Barbara Lee is the only candidate with the gravitas to be able to do that.\n\nOakland must stand up\nagainst antisemitism\n\nRe: “Oakland leaders are ignoring the city’s antisemitism problem” (Page A8, March 9).\n\nThank you for Mark Cohen’s opinion piece. The fact that over 400 antisemitic graffiti incidents have occurred around Lake Merritt and Lakeshore within one year reveals the severity and persistence of this problem. Highlighting this disturbing pattern ensures that the voices of our entire community — Jewish and non-Jewish— are clearly heard.\n\nOakland’s leadership and the City Council should take immediate action by issuing a public condemnation of antisemitism, forming a dedicated antisemitism task force, and enforcing existing laws against hate-driven vandalism. Our leaders must send a clear message that hatred has no place here.\n\nBruce Burger\n\nIf DeSaulnier won’t fight,\nvote for a rep who will\n\nI have supported Rep. Mark DeSaulnier in every election, but I will vote against him in the next primary unless he starts fighting back. We are facing an authoritarian takeover. Donald Trump, with a thin mandate, is ruling by decree, dismantling democratic institutions while House Democrats stand by.\n\nHis record on education has been strong, but as Trump guts the Department of Education, where is his outrage? Where are the press releases, the urgent calls to action? Instead, we get tepid statements while federal workers are purged, civil liberties are trampled and democracy is shredded.\n\nLeadership means taking risks. It means fighting back. A rare few Democrats are physically confronting this destruction — why isn’t he standing with them? His silence is complicity. The Democratic base is done with milquetoast politics. Rise to the moment or be replaced. We need warriors, not bystanders.\n\nJesse MacKinnon\nPleasant Hill\n\nLook through Fox’s\nGOP smokescreen\n\nFox News does an incredible job of sanitizing Donald Trump’s and Elon Musk’s words and actions. If you don’t think there is a full-scale assault on federal departments and agencies, their services and our financial protections, along with the demise of the free press and freedom to protest, you need to switch channels. This goes way beyond efficiency improvements and Sean Hannity’s tagline of “promises made, promises kept.”\n\nYour grandchildren will ask, “Why didn’t you do anything?”\n\nBarry Brynjulson","summary":"Also: Lee's gravitas &#124; Stand up &#124; Dumping DeSaulnier &#124; GOP smokescreen. East Bay Times reader letters to the editor for March 16, 2025.","url":"https://www.mercurynews.com/2025/03/14/letters-silicon-valleys-technology-promise-a-nightmare/","image":"https://www.mercurynews.com/wp-content/uploads/2025/02/SJM-Z-OPED-TUFEKCI-0225.jpg?w=1024&h=683","video":null,"publish_date":"2025-03-14 23:30:42","author":"Letters To The Editor","authors":["Letters To The Editor"],"language":"en","source_country":"us","sentiment":0.044}]}