{"offset":0,"number":50,"available":14890,"news":[{"id":269539912,"title":"America First Fighter Patel Picked As New Fbi Director","text":"US President-elect Donald Trump nominated close confidant Kashyap Patel, also known as Kash Patel, for the powerful position of Director of the Federal Bureau of Investigation (FBI). Patel will be the highest-ranking Indian-American in Trump’s new administration.Patel (44) was born in New York to parents of Gujarati origin, who emigrated from East Africa to the US. Patel was raised a Hindu, making him the third after Tulsi Gabbard and Vivek Ramaswamy from the community to be picked for Trump’s new team.During the first term of Trump (2017-21), Patel was the Chief of Staff to the Secretary of Defence. Trump called Patel a votary of his ‘America First’ campaign. In a post on social media platform Truth Social, Trump said, “I am proud to announce that Kashyap ‘Kash’ Patel will serve as the next FBI Director. Kash is a brilliant lawyer, investigator and ‘America First’ fighter who has spent his career exposing corruption, defending justice and protecting the American people.”Before taking the charge, Patel will need to a confirmation from the US Senate. The FBI is currently headed by Christopher Wray, whom Trump had appointed for a 10-year term in 2017.As an attorney, Patel worked in Florida between 2005 and 2013. In 2014, he joined the Department of Justice as a trial attorney, and simultaneously served as a legal liaison to the Joint Special Operations Command.Patel was prominently seen with Trump at his New York court hearing that looked into allegations of Trump having incited riots in January 2021, when Joe Biden was to take over. If appointed, Patel is expected to go through with his announced intent of radically overhauling the FBI. Trump and Patel have in the past criticised the FBI and its activities, including the search warrant of Trump’s Mar-a-Lago residence in Florida in 2022.","url":"https://www.tribuneindia.com/news/diaspora/america-first-fighter-patel-picked-as-new-fbi-director/","image":"https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYWYxNDVmMzIwLWIwNDUtMTFlZi1iNzgzLTI3YTljZjkzNmFhMy5qcGc=","video":null,"publish_date":"2024-12-02 01:19:30","author":null,"language":"en","source_country":"in","sentiment":0.362},{"id":269539844,"title":"Trump Vows 100 Tariff On Brics Bloc If Dollar Countered With New Currency","text":"US President-elect Donald Trump has threatened BRICS countries of 100 per cent tariffs if they try to “move away from the US dollar and carry out international trade using a separate BRICS currency”.In a post on X, Trump said, “The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is over. India, China, Russia, Brazil and South Africa are the key partners of BRICS.”“We require a commitment from these countries that they will neither create a new BRICS currency nor back any other currency to replace the mighty US dollar or they will face 100% tariffs and should expect to say goodbye to selling (goods) to the wonderful US economy,” Trump warned.“There is no chance that BRICS will replace the US dollar in international trade and any country that tries it should wave goodbye to America,” he added.BRICS, formed in 2009, is the only major international group of which the US is not a part. Its members are India, Russia, China, Brazil, South Africa, Iran, Egypt, Ethiopia and the UAE. For the past few years, Russia and China have been seeking an alternative to the US dollar or creating a BRICS currency.India has not supported the currency move, but has allowed trade settlements in rupees with countries like Russia and the UAE and continues to discuss the issue with Indonesia.In August this year, External Affairs Minister S Jaishankar had expressed his scepticism over adopting a single currency for BRICS. “It is important to be realistic about the extent of alignment among BRICS members. It is more likely that they will continue trading using their own national currencies,” the minister had said.“A common currency needs an enormous alignment of the fundamentals of fiscal policies, monetary policies, economic policies or even the political policies,” Jaishankar had argued.Probably what triggered the US is the BRICS leaders’ joint declaration following a summit at Kazan, Russia, in October. It said, “Agreeing to discuss and study the feasibility of establishment of an independent cross-border settlement and depositary infrastructure.”At the summit, Russian President Vladimir Putin held out a paper, shaped and designed like a bank note, raising speculation of BRICS currency. However, no official announcement was made regarding any such launch.The idea of a single currency was first mooted in 2011, when South Africa joined Brazil, Russia, India and China as a member of the group.","url":"https://www.tribuneindia.com/news/india/trump-vows-100-tariff-on-brics-bloc-if-dollar-countered-with-new-currency/","image":"https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTlhYWM3NDgwLWIwNDUtMTFlZi1iNzgzLTI3YTljZjkzNmFhMy5qcGc=","video":null,"publish_date":"2024-12-02 01:19:30","author":null,"language":"en","source_country":"in","sentiment":-0.041},{"id":269539164,"title":"Economic Realities And Election Narratives In Australia","text":"This is a sample of The Echidna newsletter sent out each weekday morning. To sign up for FREE, go to theechidna.com.au The question will be asked repeatedly right up until the election: Are you better off now than you were three years ago? Borrowed from Donald Trump, who nicked it from Ronald Reagan (along with the Make America Great Again campaign slogan), the \"better off\" question will be asked relentlessly by the opposition. And who can blame them? For most people the answer will be no. But will that reflexive answer be entirely correct? Of course not. Four years ago, we were in the grip of the COVID pandemic, locked down, unable to travel, working and studying remotely. The vaccine rollout had not yet begun - the following year then-PM Scott Morrison told us gormlessly it was not a race. Morrison had already made a goose of himself by skipping off on holidays in the middle of the Black Summer fire disaster and being photographed thumbs-up as he did so. In the December quarter of 2020, the unemployment rate had dipped - to 6.6 per cent. In the September quarter of this year it is steady at 4.1 per cent. Keeping the economy on life support, the Reserve Bank dropped interest rates to an unprecedented low of 0.25 per cent by November of the same year. Easy money if you had a job to service the debt. So easy it fuelled a pent-up desire to spend when the shops finally reopened. There was more easy money from the Morrison government&apos;s HomeBuilder grants program which in just 12 months had helped push up the cost of new homes by 20.7 per cent. Tradies were laughing all the way to the new Ford Ranger as the rest of us watched inflation begin its steep climb and the housing crisis worsen. Ongoing confusion about energy policy - 22 of them over nine years of Coalition government - and the effects of climate change felt directly across the blackened eastern seaboard linger as we play catch-up years later. And then there were the scandals. Robodebt. Brittany Higgins. Morrison appointing himself to multiple secret ministerial positions. In the lead-up to the 2022 election, travelling the length and breadth of the Eden-Monaro electorate, I was repeatedly told of lifelong Liberal voters who couldn&apos;t bring themselves to vote for Scott Morrison. As the Coalition asks the \"better off\" question, the government responds with the \"worse off\" question. Would you have been worse off under a Coalition government? Quite possibly but the trouble with that approach is it&apos;s speculative. The misery so many feel now, not four years ago, has happened under Labor&apos;s watch. Real wages have gone backwards, thanks to inflation. They&apos;re no longer falling but they&apos;re still 5.4 per cent lower than they were before the pandemic. The cost-of-living measures the government has introduced - energy rebates, cheaper medicines, broader tax cuts, fee-free TAFE - have been communicated poorly. Worse, they&apos;ve made little appreciative difference to weekly household budgets and many of us still feel worse off. Labor will be punished for that. But will the other mob make things better or worse? Peter Dutton might be a formidable opposition leader. His record in government, however, is hardly glittering. Australian doctors voted him the worst health minister ever. His time at Home Affairs saw scandals over foreign au pairs for mates, questionable contracts and a blind eye to foreign labour scams. The \"better off\" question might seem simple. Answering it thoughtfully is a little more complicated. HAVE YOUR SAY: Are you better off now than you were three years ago? Will you change your vote if the answer is no? Would have been worse off under a Coalition government? Would you be better off under one now? Email us: echidna@theechidna.com.au SHARE THE LOVE: If you enjoy The Echidna, forward it to a friend so they can sign up, too. IN CASE YOU MISSED IT: - Rates of domestic violence are higher than \"ever experienced\" with warnings of increased risk over the holiday season. - An Indigenous leader who stole almost $1 million from Aboriginal organisations has been thrown behind bars for more than six years. Three separate juries convicted Geoff Clark, 72, on 25 charges of theft, obtaining financial advantage by deception, perjury and knowingly dealing with the proceeds of crime. - A police officer found guilty of unlawfully killing a 95-year-old woman will spend Christmas at home, with a judge declaring it&apos;s not certain he will do jail time for the crime. THEY SAID IT: \"Great spirits have always encountered violent opposition from mediocre minds.\" - Albert Einstein YOU SAID IT: The war on words is robbing our language of nuance and texture, wrote Garry. And political correctness is dulling the way we think. \"What a clever article in which you demonstrate the use of the word &apos;sly&apos; by having yet another sly dig at your perception of &apos;wokeness&apos; (a word that has itself been hijacked),\" writes Patricia. \"You failed to mention that language changes like society and these days, it changes fast. Dropping &apos;man&apos; in job titles may seem insignificant but not long ago cabin crew were referred to as &apos;hosties&apos; - talk about demeaning! Words are not officially &apos;dumped&apos;. People just stop using them if they are not useful anymore.\" Brad writes: \"It begins, Garry. Those of us studying 1984 at school in the 1970s wondered how it could be possible in the enlightened West (Orwell&apos;s Oceania)? Well, newspeak is precisely what this is: reduced language for social control. Time to tell the PETAs, for there are many, to check their definition of &apos;sly&apos;.\" \"I find the use of they/them to refer to individuals awkward at best,\" writes David. \"Since these pronouns are also still used to refer to plural groups, the combination of the two uses in works of fiction can make it more difficult for the reader. Is the character interacting with an individual or a group? I would prefer the LGBTQI community adopt a pronoun that doesn&apos;t already come with a well-established alternative meaning.\" Phil writes: \"Language changes and meanings change over time. Rarely can it be forced through but grows from common usage to dictionary status. There are better things to worry about for the prolespeakers.\" \"While we should be sensitive and not seek to give needless offence personally, this sort of linguistic witch-hunt is deeply troubling,\" writes Peter. \"What happened to the right to free expression? Specifically, historical terms need to be retained and understood, accepted as artefacts of the past, not suppressed and censored in order to pursue a contemporary agenda. (Whoops! Witch-hunt would clearly offend some, but it&apos;s a venerable term that reminds us how wise women once were actually persecuted).\" Diane writes: \"Love your column, you sly old fox, and it&apos;s my breakfast read each day. A phrase that makes my skin crawl is &apos;Let&apos;s give it up!&apos; when someone is being introduced to an audience, to encourage applause. Surely &apos;Please welcome&apos; or &apos;May I introduce&apos; or some such alternative would be far preferable. My skin would rest easy then!\" \"This is as brilliant and well-written an article as Thursday&apos;s offering on enshittification,\" writes Jan.\"We are surrounded by so many examples of bowdlerising words in our everyday lives and it annoys me just as much every time. The recent touchy-feely decision to re-name the Sirius building in Canberra on the grounds that it was named after one of the ships in the First Fleet and might conceivably offend our Indigenous community is one example. I would far rather have seen the vast amounts of money associated with re-naming the building instead being directed towards something constructive such as, for example, Aboriginal welfare programs.\" Old Donald writes: \"Misuse of fundamental words and the virtual elimination of so many with their layers of meaning has shattered this old English teacher and lecturer. One of the very worst is the (now) Jaws-like shark: the noun/verb/adjectival/adverbial but totally general use of impact. The words effect and affect, with their plethora of linguistic subtleties, have both been sacrificed in the name of electronic and verbal convenience. One might say it&apos;s very impactful... vale the beautiful language of Keats and WS.\" \"You won&apos;t hear me railing against &apos;wokeness&apos;, Garry, because I hate its antithesis even more,\" writes Anita. \"Good recall takes me back to the 1950s when I queried the fate of &apos;women&apos; in the story of Early Man. I was told they (the women), were part of the inclusive &apos;Men&apos;. I didn&apos;t understand it to be inclusive and wondered what the women were doing while the men were hunting the woolly mammoth.\" Tony writes: \"The pub should keep its name. PETA has gone too far in these instances. The breast is a distinct part of human anatomy, so people offended by that term are idiots. Whilst languages evolve, some terms are less useful than others. Moving forward is the term I like the least.\"","url":"https://www.goulburnpost.com.au/story/8833188/economic-realities-and-election-narratives-in-australia/?cs=2650","image":"/images/transform/v1/crop/frm/231012065/397337f4-a98c-4f1d-ba8d-a52201729382.jpg/r1_0_1919_1079_w1920_h1080_fmax.jpg","video":null,"publish_date":"2024-12-02 01:16:30","author":"John Hanscombe","authors":["John Hanscombe"],"language":"en","source_country":"au","sentiment":-0.357},{"id":269539156,"title":"Biden Pardons Son Hunter After Previous Pledges Not To","text":"US President Joe Biden has pardoned his son, Hunter, sparing him a possible prison sentence for gun and tax convictions and reversing past promises not to use the powers of the presidency for the benefit of his family members. \"Today, I signed a pardon for my son Hunter. From the day I took office, I said I would not interfere with the Justice Department&apos;s decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted,\" the president said in a statement released by the White House. \"I hope Americans will understand why a father and a President would come to this decision.\" Biden had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. Biden said he had made the decision over the weekend. The president, his wife, Jill Biden, and their family including Hunter, spent the Thanksgiving holiday in Nantucket, Massachusetts and returned to Washington on Saturday night. \"Here&apos;s the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice - and once I made this decision this weekend, there was no sense in delaying it further,\" he said. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before US President-elect Donald Trump is set to return to the White House. It caps a long-running legal saga for Hunter Biden, who publicly disclosed he was under federal investigation in December 2020 - a month after Joe Biden&apos;s 2020 US election victory. In June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News. As recently as November 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying: \"We&apos;ve been asked that question multiple times. Our answer stands, which is no.\" with Reuters Australian Associated Press","url":"https://www.goulburnpost.com.au/story/8835328/biden-pardons-son-hunter-after-previous-pledges-not-to/?cs=14264","image":"/images/transform/v1/crop/frm/silverstone-feed-data/d28dec89-12b7-4d42-9ad6-b51c7dda39a1.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2024-12-02 01:16:30","author":null,"language":"en","source_country":"au","sentiment":-0.311},{"id":269539136,"title":"Economic Realities And Election Narratives In Australia","text":"This is a sample of The Echidna newsletter sent out each weekday morning. To sign up for FREE, go to theechidna.com.au The question will be asked repeatedly right up until the election: Are you better off now than you were three years ago? Borrowed from Donald Trump, who nicked it from Ronald Reagan (along with the Make America Great Again campaign slogan), the \"better off\" question will be asked relentlessly by the opposition. And who can blame them? For most people the answer will be no. But will that reflexive answer be entirely correct? Of course not. Four years ago, we were in the grip of the COVID pandemic, locked down, unable to travel, working and studying remotely. The vaccine rollout had not yet begun - the following year then-PM Scott Morrison told us gormlessly it was not a race. Morrison had already made a goose of himself by skipping off on holidays in the middle of the Black Summer fire disaster and being photographed thumbs-up as he did so. In the December quarter of 2020, the unemployment rate had dipped - to 6.6 per cent. In the September quarter of this year it is steady at 4.1 per cent. Keeping the economy on life support, the Reserve Bank dropped interest rates to an unprecedented low of 0.25 per cent by November of the same year. Easy money if you had a job to service the debt. So easy it fuelled a pent-up desire to spend when the shops finally reopened. There was more easy money from the Morrison government&apos;s HomeBuilder grants program which in just 12 months had helped push up the cost of new homes by 20.7 per cent. Tradies were laughing all the way to the new Ford Ranger as the rest of us watched inflation begin its steep climb and the housing crisis worsen. Ongoing confusion about energy policy - 22 of them over nine years of Coalition government - and the effects of climate change felt directly across the blackened eastern seaboard linger as we play catch-up years later. And then there were the scandals. Robodebt. Brittany Higgins. Morrison appointing himself to multiple secret ministerial positions. In the lead-up to the 2022 election, travelling the length and breadth of the Eden-Monaro electorate, I was repeatedly told of lifelong Liberal voters who couldn&apos;t bring themselves to vote for Scott Morrison. As the Coalition asks the \"better off\" question, the government responds with the \"worse off\" question. Would you have been worse off under a Coalition government? Quite possibly but the trouble with that approach is it&apos;s speculative. The misery so many feel now, not four years ago, has happened under Labor&apos;s watch. Real wages have gone backwards, thanks to inflation. They&apos;re no longer falling but they&apos;re still 5.4 per cent lower than they were before the pandemic. The cost-of-living measures the government has introduced - energy rebates, cheaper medicines, broader tax cuts, fee-free TAFE - have been communicated poorly. Worse, they&apos;ve made little appreciative difference to weekly household budgets and many of us still feel worse off. Labor will be punished for that. But will the other mob make things better or worse? Peter Dutton might be a formidable opposition leader. His record in government, however, is hardly glittering. Australian doctors voted him the worst health minister ever. His time at Home Affairs saw scandals over foreign au pairs for mates, questionable contracts and a blind eye to foreign labour scams. The \"better off\" question might seem simple. Answering it thoughtfully is a little more complicated. HAVE YOUR SAY: Are you better off now than you were three years ago? Will you change your vote if the answer is no? Would have been worse off under a Coalition government? Would you be better off under one now? Email us: echidna@theechidna.com.au SHARE THE LOVE: If you enjoy The Echidna, forward it to a friend so they can sign up, too. IN CASE YOU MISSED IT: - Rates of domestic violence are higher than \"ever experienced\" with warnings of increased risk over the holiday season. - An Indigenous leader who stole almost $1 million from Aboriginal organisations has been thrown behind bars for more than six years. Three separate juries convicted Geoff Clark, 72, on 25 charges of theft, obtaining financial advantage by deception, perjury and knowingly dealing with the proceeds of crime. - A police officer found guilty of unlawfully killing a 95-year-old woman will spend Christmas at home, with a judge declaring it&apos;s not certain he will do jail time for the crime. THEY SAID IT: \"Great spirits have always encountered violent opposition from mediocre minds.\" - Albert Einstein YOU SAID IT: The war on words is robbing our language of nuance and texture, wrote Garry. And political correctness is dulling the way we think. \"What a clever article in which you demonstrate the use of the word &apos;sly&apos; by having yet another sly dig at your perception of &apos;wokeness&apos; (a word that has itself been hijacked),\" writes Patricia. \"You failed to mention that language changes like society and these days, it changes fast. Dropping &apos;man&apos; in job titles may seem insignificant but not long ago cabin crew were referred to as &apos;hosties&apos; - talk about demeaning! Words are not officially &apos;dumped&apos;. People just stop using them if they are not useful anymore.\" Brad writes: \"It begins, Garry. Those of us studying 1984 at school in the 1970s wondered how it could be possible in the enlightened West (Orwell&apos;s Oceania)? Well, newspeak is precisely what this is: reduced language for social control. Time to tell the PETAs, for there are many, to check their definition of &apos;sly&apos;.\" \"I find the use of they/them to refer to individuals awkward at best,\" writes David. \"Since these pronouns are also still used to refer to plural groups, the combination of the two uses in works of fiction can make it more difficult for the reader. Is the character interacting with an individual or a group? I would prefer the LGBTQI community adopt a pronoun that doesn&apos;t already come with a well-established alternative meaning.\" Phil writes: \"Language changes and meanings change over time. Rarely can it be forced through but grows from common usage to dictionary status. There are better things to worry about for the prolespeakers.\" \"While we should be sensitive and not seek to give needless offence personally, this sort of linguistic witch-hunt is deeply troubling,\" writes Peter. \"What happened to the right to free expression? Specifically, historical terms need to be retained and understood, accepted as artefacts of the past, not suppressed and censored in order to pursue a contemporary agenda. (Whoops! Witch-hunt would clearly offend some, but it&apos;s a venerable term that reminds us how wise women once were actually persecuted).\" Diane writes: \"Love your column, you sly old fox, and it&apos;s my breakfast read each day. A phrase that makes my skin crawl is &apos;Let&apos;s give it up!&apos; when someone is being introduced to an audience, to encourage applause. Surely &apos;Please welcome&apos; or &apos;May I introduce&apos; or some such alternative would be far preferable. My skin would rest easy then!\" \"This is as brilliant and well-written an article as Thursday&apos;s offering on enshittification,\" writes Jan.\"We are surrounded by so many examples of bowdlerising words in our everyday lives and it annoys me just as much every time. The recent touchy-feely decision to re-name the Sirius building in Canberra on the grounds that it was named after one of the ships in the First Fleet and might conceivably offend our Indigenous community is one example. I would far rather have seen the vast amounts of money associated with re-naming the building instead being directed towards something constructive such as, for example, Aboriginal welfare programs.\" Old Donald writes: \"Misuse of fundamental words and the virtual elimination of so many with their layers of meaning has shattered this old English teacher and lecturer. One of the very worst is the (now) Jaws-like shark: the noun/verb/adjectival/adverbial but totally general use of impact. The words effect and affect, with their plethora of linguistic subtleties, have both been sacrificed in the name of electronic and verbal convenience. One might say it&apos;s very impactful... vale the beautiful language of Keats and WS.\" \"You won&apos;t hear me railing against &apos;wokeness&apos;, Garry, because I hate its antithesis even more,\" writes Anita. \"Good recall takes me back to the 1950s when I queried the fate of &apos;women&apos; in the story of Early Man. I was told they (the women), were part of the inclusive &apos;Men&apos;. I didn&apos;t understand it to be inclusive and wondered what the women were doing while the men were hunting the woolly mammoth.\" Tony writes: \"The pub should keep its name. PETA has gone too far in these instances. The breast is a distinct part of human anatomy, so people offended by that term are idiots. Whilst languages evolve, some terms are less useful than others. Moving forward is the term I like the least.\"","url":"https://www.goulburnpost.com.au/story/8833188/economic-realities-and-election-narratives-in-australia/?cs=13410","image":"/images/transform/v1/crop/frm/231012065/397337f4-a98c-4f1d-ba8d-a52201729382.jpg/r1_0_1919_1079_w1920_h1080_fmax.jpg","video":null,"publish_date":"2024-12-02 01:16:30","author":"John Hanscombe","authors":["John Hanscombe"],"language":"en","source_country":"au","sentiment":-0.357},{"id":269539134,"title":"Economic Realities And Election Narratives In Australia","text":"This is a sample of The Echidna newsletter sent out each weekday morning. To sign up for FREE, go to theechidna.com.au The question will be asked repeatedly right up until the election: Are you better off now than you were three years ago? Borrowed from Donald Trump, who nicked it from Ronald Reagan (along with the Make America Great Again campaign slogan), the \"better off\" question will be asked relentlessly by the opposition. And who can blame them? For most people the answer will be no. But will that reflexive answer be entirely correct? Of course not. Four years ago, we were in the grip of the COVID pandemic, locked down, unable to travel, working and studying remotely. The vaccine rollout had not yet begun - the following year then-PM Scott Morrison told us gormlessly it was not a race. Morrison had already made a goose of himself by skipping off on holidays in the middle of the Black Summer fire disaster and being photographed thumbs-up as he did so. In the December quarter of 2020, the unemployment rate had dipped - to 6.6 per cent. In the September quarter of this year it is steady at 4.1 per cent. Keeping the economy on life support, the Reserve Bank dropped interest rates to an unprecedented low of 0.25 per cent by November of the same year. Easy money if you had a job to service the debt. So easy it fuelled a pent-up desire to spend when the shops finally reopened. There was more easy money from the Morrison government&apos;s HomeBuilder grants program which in just 12 months had helped push up the cost of new homes by 20.7 per cent. Tradies were laughing all the way to the new Ford Ranger as the rest of us watched inflation begin its steep climb and the housing crisis worsen. Ongoing confusion about energy policy - 22 of them over nine years of Coalition government - and the effects of climate change felt directly across the blackened eastern seaboard linger as we play catch-up years later. And then there were the scandals. Robodebt. Brittany Higgins. Morrison appointing himself to multiple secret ministerial positions. In the lead-up to the 2022 election, travelling the length and breadth of the Eden-Monaro electorate, I was repeatedly told of lifelong Liberal voters who couldn&apos;t bring themselves to vote for Scott Morrison. As the Coalition asks the \"better off\" question, the government responds with the \"worse off\" question. Would you have been worse off under a Coalition government? Quite possibly but the trouble with that approach is it&apos;s speculative. The misery so many feel now, not four years ago, has happened under Labor&apos;s watch. Real wages have gone backwards, thanks to inflation. They&apos;re no longer falling but they&apos;re still 5.4 per cent lower than they were before the pandemic. The cost-of-living measures the government has introduced - energy rebates, cheaper medicines, broader tax cuts, fee-free TAFE - have been communicated poorly. Worse, they&apos;ve made little appreciative difference to weekly household budgets and many of us still feel worse off. Labor will be punished for that. But will the other mob make things better or worse? Peter Dutton might be a formidable opposition leader. His record in government, however, is hardly glittering. Australian doctors voted him the worst health minister ever. His time at Home Affairs saw scandals over foreign au pairs for mates, questionable contracts and a blind eye to foreign labour scams. The \"better off\" question might seem simple. Answering it thoughtfully is a little more complicated. HAVE YOUR SAY: Are you better off now than you were three years ago? Will you change your vote if the answer is no? Would have been worse off under a Coalition government? Would you be better off under one now? Email us: echidna@theechidna.com.au SHARE THE LOVE: If you enjoy The Echidna, forward it to a friend so they can sign up, too. IN CASE YOU MISSED IT: - Rates of domestic violence are higher than \"ever experienced\" with warnings of increased risk over the holiday season. - An Indigenous leader who stole almost $1 million from Aboriginal organisations has been thrown behind bars for more than six years. Three separate juries convicted Geoff Clark, 72, on 25 charges of theft, obtaining financial advantage by deception, perjury and knowingly dealing with the proceeds of crime. - A police officer found guilty of unlawfully killing a 95-year-old woman will spend Christmas at home, with a judge declaring it&apos;s not certain he will do jail time for the crime. THEY SAID IT: \"Great spirits have always encountered violent opposition from mediocre minds.\" - Albert Einstein YOU SAID IT: The war on words is robbing our language of nuance and texture, wrote Garry. And political correctness is dulling the way we think. \"What a clever article in which you demonstrate the use of the word &apos;sly&apos; by having yet another sly dig at your perception of &apos;wokeness&apos; (a word that has itself been hijacked),\" writes Patricia. \"You failed to mention that language changes like society and these days, it changes fast. Dropping &apos;man&apos; in job titles may seem insignificant but not long ago cabin crew were referred to as &apos;hosties&apos; - talk about demeaning! Words are not officially &apos;dumped&apos;. People just stop using them if they are not useful anymore.\" Brad writes: \"It begins, Garry. Those of us studying 1984 at school in the 1970s wondered how it could be possible in the enlightened West (Orwell&apos;s Oceania)? Well, newspeak is precisely what this is: reduced language for social control. Time to tell the PETAs, for there are many, to check their definition of &apos;sly&apos;.\" \"I find the use of they/them to refer to individuals awkward at best,\" writes David. \"Since these pronouns are also still used to refer to plural groups, the combination of the two uses in works of fiction can make it more difficult for the reader. Is the character interacting with an individual or a group? I would prefer the LGBTQI community adopt a pronoun that doesn&apos;t already come with a well-established alternative meaning.\" Phil writes: \"Language changes and meanings change over time. Rarely can it be forced through but grows from common usage to dictionary status. There are better things to worry about for the prolespeakers.\" \"While we should be sensitive and not seek to give needless offence personally, this sort of linguistic witch-hunt is deeply troubling,\" writes Peter. \"What happened to the right to free expression? Specifically, historical terms need to be retained and understood, accepted as artefacts of the past, not suppressed and censored in order to pursue a contemporary agenda. (Whoops! Witch-hunt would clearly offend some, but it&apos;s a venerable term that reminds us how wise women once were actually persecuted).\" Diane writes: \"Love your column, you sly old fox, and it&apos;s my breakfast read each day. A phrase that makes my skin crawl is &apos;Let&apos;s give it up!&apos; when someone is being introduced to an audience, to encourage applause. Surely &apos;Please welcome&apos; or &apos;May I introduce&apos; or some such alternative would be far preferable. My skin would rest easy then!\" \"This is as brilliant and well-written an article as Thursday&apos;s offering on enshittification,\" writes Jan.\"We are surrounded by so many examples of bowdlerising words in our everyday lives and it annoys me just as much every time. The recent touchy-feely decision to re-name the Sirius building in Canberra on the grounds that it was named after one of the ships in the First Fleet and might conceivably offend our Indigenous community is one example. I would far rather have seen the vast amounts of money associated with re-naming the building instead being directed towards something constructive such as, for example, Aboriginal welfare programs.\" Old Donald writes: \"Misuse of fundamental words and the virtual elimination of so many with their layers of meaning has shattered this old English teacher and lecturer. One of the very worst is the (now) Jaws-like shark: the noun/verb/adjectival/adverbial but totally general use of impact. The words effect and affect, with their plethora of linguistic subtleties, have both been sacrificed in the name of electronic and verbal convenience. One might say it&apos;s very impactful... vale the beautiful language of Keats and WS.\" \"You won&apos;t hear me railing against &apos;wokeness&apos;, Garry, because I hate its antithesis even more,\" writes Anita. \"Good recall takes me back to the 1950s when I queried the fate of &apos;women&apos; in the story of Early Man. I was told they (the women), were part of the inclusive &apos;Men&apos;. I didn&apos;t understand it to be inclusive and wondered what the women were doing while the men were hunting the woolly mammoth.\" Tony writes: \"The pub should keep its name. PETA has gone too far in these instances. The breast is a distinct part of human anatomy, so people offended by that term are idiots. Whilst languages evolve, some terms are less useful than others. Moving forward is the term I like the least.\"","url":"https://www.goulburnpost.com.au/story/8833188/economic-realities-and-election-narratives-in-australia/?cs=14264","image":"/images/transform/v1/crop/frm/231012065/397337f4-a98c-4f1d-ba8d-a52201729382.jpg/r1_0_1919_1079_w1920_h1080_fmax.jpg","video":null,"publish_date":"2024-12-02 01:16:30","author":"John Hanscombe","authors":["John Hanscombe"],"language":"en","source_country":"au","sentiment":-0.357},{"id":269538958,"title":"Joe Biden Pardons His Son Hunter Biden On Gun Tax Charges Despite Previous Promises He Wouldn T 1","text":"Shopping Trends\n\n The Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us.\n\n Editor's Picks \n\n 20 Of The Best Gift Ideas For Men Under $200\n\n 13 Of The Best Self-Care Gifts You Can Find On Amazon Canada\n\n 19 Of The Best Tech Gifts Under $100\n\n Our Guide To The Best Cookware Sets In Canada In 2024 (And Where To Get Them)\n\n Our Guide To The Best Space Heaters In Canada In 2024 (And Where To Get Them)\n\n Our Guide to the Best Portable Induction Cooktops in Canada in 2024 (And Where to Get Them)\n\n 21 Of The Best Gift Ideas For Women Under $300\n\n 19 Of The Best Stocking Stuffers For Teenagers\n\n 15 Useful Amazon Products That Make Great Stocking Stuffers\n\n Our Guide To The Best Self Tanners You Can Get In Canada\n\n 20 Anti-Aging Skincare Products That Reviewers Can’t Stop Talking About\n\n 12 Budget-Friendly Makeup Brushes And Tools Worth Adding To Your Kit\n\n Here Are All The Best Amazon Black Friday Deals You Can Find On Beauty Products In Canada\n\n Here Are The Best Black Friday/Cyber Monday Deals You Can Find On Household Essentials In Canada\n\n This Smart Security Camera System Will Help You Keep An Eye On Your Home (And It's On Sale For 62% Off Right Now)\n\n CTVNews.ca Top Stories\n\n Joe Biden pardons his son Hunter Biden on gun, tax charges, despite previous promises he wouldn't\n\n U.S. President Joe Biden announced Sunday that he pardoned his son Hunter Biden on gun, tax charges, despite previous promises that he would not do so.\n\n Canada Post presents union with 'framework' to reach deal as strike continues\n\n Canada Post says it has presented the union representing some 55,000 striking postal workers with a framework to reach negotiated agreements.\n\n 'Devastating': Missing Surrey, B.C. teen found dead, family says\n\n The family of a missing 18-year-old, who was last seen in Surrey over a month ago, says there has been a tragic end to the search.\n\n The best tips to prepare your car for the winter\n\n Slippery or snow-covered roads, reduced visibility and bitter cold are all conditions that can make driving difficult and even dangerous during cold weather months. CAA spoke with CTV Morning Live this week on some of the best ways you can winterize your car.\n\n PM Trudeau 'surprised' provinces unanimous on accelerated defence spending: Ford\n\n Ontario Premier Doug Ford says his fellow provincial leaders are united in pushing for Canada to meet its NATO defence spending targets ahead of schedule, and that Prime Minister Justin Trudeau was \"surprised\" to hear it.\n\n Stellantis CEO Carlos Tavares resigns as carmaker continues to struggle with slumping sales\n\n Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep and Ram, amid an ongoing struggle with slumping sales.\n\n 'Wicked' star Marissa Bode speaks out against 'harmful' ableist comments made about her character\n\n 'Wicked' actress Marissa Bode posted a video on TikTok asking for kindness after receiving ableist comments on social media.\n\n Poilievre calls for asylum seeker cap, border plan as U.S. tariff threat looms\n\n Conservative Leader Pierre Poilievre has demanded the federal government present a plan before Parliament to beef up border security as U.S. president-elect Donald Trump threatens to impose stiff tariffs on Canada.\n\n Emergency crews battle large fire at Kitchener, Ont. townhouse complex\n\n Waterloo Regional Police say Kingsway Drive will remain closed as emergency crews continue to battle a large blaze at a townhouse complex.\n\n Natural gas line severed by vehicle crash ignites fire at gas station east of Edmonton\n\n The Tempo service station on the south side of Highway 16 at Range Road 223 burned down on Sunday after a vehicle crashed into the back of the building and severed a natural gas line.\n\n 'Devastating': Missing Surrey, B.C. teen found dead, family says\n\n The family of a missing 18-year-old, who was last seen in Surrey over a month ago, says there has been a tragic end to the search.\n\n Emergency crews battle large fire at Kitchener, Ont. townhouse complex\n\n Waterloo Regional Police say Kingsway Drive will remain closed as emergency crews continue to battle a large blaze at a townhouse complex.\n\n Bail and promises of justice: The case of Canadians Daniel Langlois and Dominique Marchand murdered in Dominica\n\n A year has passed since Canadians Daniel Langlois and Dominique Marchand were found dead in a burned-out car in Dominica, and there has yet to be justice for the philanthropists who were beloved by many on the island.\n\n Watch: Noisy throng of sea lions frolic near Jericho Beach\n\n A large swarm of California sea lions have converged in the waters near Vancouver’s Jericho and Locarno beaches.\n\n Canada Post presents union with 'framework' to reach deal as strike continues\n\n Canada Post says it has presented the union representing some 55,000 striking postal workers with a framework to reach negotiated agreements.\n\n A bus crashed near a ski resort in France killing two people and injuring at least 33\n\n A bus crashed Sunday evening near a ski resort in southern France, killing at least two people and injuring 33 others, local authorities said.\n\n Romanians vote in parliamentary election as turmoil in presidential race grips the nation\n\n Romania voted in a parliamentary election between two rounds of the presidential race, with allegations of electoral violations and Russian interference.\n\n Senegal demands answers as the West African country commemorates a French colonial massacre\n\n West African riflemen who fought for France during World War II were likely killed by the French army on Dec. 1, 1944, after demanding unpaid wages.\n\n He’s the first known transgender lawyer to argue before U.S. Supreme Court. For Chase Strangio, the mission ‘is not lost on me’\n\n Chase Strangio, an attorney for the ACLU, is set to make history Wednesday as the first known transgender person to argue before the U.S. Supreme Court.\n\n Trump taps Kash Patel for FBI director, an ally who would aid in his effort to upend law enforcement\n\n U.S. president-elect Donald Trump says he will nominate Kash Patel to serve as FBI director, turning to a fierce ally to upend America’s premier law enforcement agency and rid the government of perceived 'conspirators.' It’s the latest bombshell Trump has thrown at the Washington establishment and a test for how far Senate Republicans will go in confirming his nominees.\n\n Ghana activists warn an anti-gay bill threatens the young democracy's institutions\n\n The Canadian Press travelled to Cameroon as part of an investigative series looking into a global backslide in LGBTQ2S+ rights and the consequences for Canada, including the impact this trend has on democratic institutions.\n\n Poilievre calls for asylum seeker cap, border plan as U.S. tariff threat looms\n\n Conservative Leader Pierre Poilievre has demanded the federal government present a plan before Parliament to beef up border security as U.S. president-elect Donald Trump threatens to impose stiff tariffs on Canada.\n\n PM Trudeau 'surprised' provinces unanimous on accelerated defence spending: Ford\n\n Ontario Premier Doug Ford says his fellow provincial leaders are united in pushing for Canada to meet its NATO defence spending targets ahead of schedule, and that Prime Minister Justin Trudeau was \"surprised\" to hear it.\n\n 'We're going to be very visible': Minister Champagne on border plan amid Trump's tariff threat\n\n Industry Minister François-Philippe Champagne says the Canadian presence at the border it shares with the U.S. will be “very visible” in response to U.S. president-elect Donald Trump’s recent tariff threats.\n\n Why teens’ mental health may be more strained than you think heading into the holidays\n\n While many people might think of the end of the year as a time to wind down one’s workload and take a break, a Toronto psychiatrist says young people may actually be carrying more stress than usual heading into the holiday season.\n\n A twice-yearly shot could help end AIDS. But will it get to everyone who needs it?\n\n It’s been called the closest the world has ever come to a vaccine against the AIDS virus.\n\n Are scented candles bad for you? What the science says\n\n Concerns about the safety of candles are rooted in the chemical reactions that occur when you burn them, as well as in the artificial fragrances and colorants that contribute to the various scents you may love.\n\n Canadian tech company helps children with disabilities walk for the first time\n\n A Canadian tech company and an Ottawa pediatric care centre teamed up to offer kids with mobility challenges a once in a lifetime opportunity to take their very first steps.\n\n Montreal researchers make breakthrough discovery in fighting HIV\n\n Researchers in Montreal have made a breakthrough discovery in HIV research by finding a way to expel the virus from its hiding places and destroy it.\n\n As Australia bans social media for children, Quebec is paying close attention\n\n As Australia moves to ban social media for children under 16, Quebec is debating whether to follow suit.\n\n Entertainment \n\n 'Wicked' star Marissa Bode speaks out against 'harmful' ableist comments made about her character\n\n 'Wicked' actress Marissa Bode posted a video on TikTok asking for kindness after receiving ableist comments on social media.\n\n Gwyneth Paltrow and Chris Martin support daughter Apple at debutante ball debut\n\n Gwyneth Paltrow and Chris Martin came together on Saturday to watch their daughter Apple Martin make a glam societal debut at a Parisian debutante ball.\n\n 'Moana 2' sails to a record US$221 million opening as Hollywood celebrates a moviegoing feast\n\n 'Moana 2' brought in a tidal wave of moviegoers over the Thanksgiving Day weekend, setting records with $221 million in ticket sales, according to estimates.\n\n Stellantis CEO Carlos Tavares resigns as carmaker continues to struggle with slumping sales\n\n Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep and Ram, amid an ongoing struggle with slumping sales.\n\n Shoppers continue indulging in Black Friday sales, but mostly online\n\n Despite retailers offering holiday discounts earlier than usual this year, U.S. consumers did more shopping on Black Friday than the days leading up to it.\n\n Banks head into Q4 with investors looking for better days ahead\n\n The majority of Canada's big banks are heading into fourth-quarter earnings this week riding high as fears around mortgage defaults and a recession ease.\n\n Lifestyle \n\n Shopping on Shein and Temu for holiday gifts? You're not the only one.\n\n Welcome to the new online world of impulse buying, a place of guilty pleasures where the selection is vast, every day is Cyber Monday, and an instant dopamine hit that will have faded by the time your package arrives is always just a click away.\n\n A man hid 5 treasure chests worth more than US$2 million across the United States. Here’s how to find them\n\n Inside the chests, searchers can look forward to hopefully locating items such as rare Pokémon cards, shipwreck bounty, sports memorabilia, gold and precious medals.\n\n Bruce, the tiny Vancouver parrot, lands internet fame with abstract art\n\n Mononymous painter Bruce has carved a lucrative niche on social media with his abstract artworks, crafted entirely from the colourful juices of fruits.\n\n Botafogo wins its first Copa Libertadores title\n\n Botafogo overcame playing with ten men to win its first Copa Libertadores title after beating fellow Brazilian side Atletico Mineiro 3-1 in the final.\n\n Michigan pulls off major upset over No. 2 Ohio State 13-10 in college football\n\n Michigan upsets No. 2 Ohio State 13-10 for the Wolverines' 4th straight win in the bitter rivalry.\n\n John Herdman resigns as head coach of Toronto FC amid drone-spying scandal\n\n Embroiled in the Paris Olympic drone-spying scandal that has already cost Canadian women's coach Bev Priestman her job, Herdman resigned Friday as coach of Toronto FC.\n\n The best tips to prepare your car for the winter\n\n Slippery or snow-covered roads, reduced visibility and bitter cold are all conditions that can make driving difficult and even dangerous during cold weather months. CAA spoke with CTV Morning Live this week on some of the best ways you can winterize your car.\n\n Stellantis CEO Carlos Tavares resigns as carmaker continues to struggle with slumping sales\n\n Stellantis CEO Carlos Tavares is stepping down after nearly four years in the top spot of the automaker, which owns car brands like Jeep and Ram, amid an ongoing struggle with slumping sales.\n\n Highway 407 owner says no active buyback discussions with Ontario government\n\n Pressure is increasing on the provincial government to tap into the underused tolled Highway 407 to unclog congestion on Highway 401.\n\n Local Spotlight \n\n Auburn Bay residents brave the cold to hold Parade of Lights\n\n It was pretty cold Saturday night, but the hearts of those in a southeast Calgary neighbourhood warmed right up during a big annual celebration.\n\n Three million grams of cereal collected to feed students in annual Cereal Box Challenge\n\n The food collected will help support 33 breakfast and snack programs in the Greater Essex County District School Board.\n\n Regina's LED volume wall leaving Sask. months after opening\n\n Less than a year after an LED volume wall was introduced to the film world in Saskatchewan, the equipment is making its exit from the province.\n\n Temperature records broken, tied following latest snowfall in Saskatchewan\n\n Saskatchewan received yet more snow as winter continues to ramp up on the prairies. With the increased precipitation, communities have recorded dipping temperatures – with a handful breaking or tying longstanding records.\n\n 'My dear Carmel': Lost letters returned to 103-year-old Guelph, Ont. woman\n\n A young history buff was able to reunite a Guelph, Ont. woman with letters written by her husband almost 80 years ago.\n\n 'We have to do something': Homeless advocates in Moncton reaching out for help over holidays\n\n Twice a week, Joanne and Jeff Jonah fill up their vehicle full of snacks and sandwiches and deliver them to the homeless in downtown Moncton, N.B.\n\n 100-year-old Winnipeg man walks blocks to see his wife\n\n It's considered lucky to live to be 100, but often when you hit that milestone, you're faced with significant mobility issues. Not Winnipeg's Jack Mudry. The centenarian regularly walks five blocks to get where he wants to go, the care home where his wife Stella lives.\n\n Video shows B.C. cat bursting through pet door to confront raccoons\n\n Several hungry raccoons were chased off a B.C. couple’s deck this week by one over-confident house cat – who was ultimately lucky to saunter away unscathed.\n\n Trailer Park Boys host Canadian premiere of new movie in Dartmouth\n\n Sunday night was a big night for the Trailer Park Boys, as Ricky, Julian and Bubbles hosted an advanced screening of their new movie in Dartmouth, N.S.\n\n Vancouver \n\n South Vancouver residents hand city red card over consultation for FIFA training site\n\n A portion of a park in southeast Vancouver is slated to close for close to two years as one of two sites selected by the city for training facilities for visiting teams during the upcoming 2026 FIFA World Cup.\n\n Neighbours who sheared tops of B.C. man's bamboo plants ordered to pay $1K in damages\n\n A B.C. man whose neighbours lopped the tops off of four of his bamboo plants has been awarded $1,000 in damages by the province’s Civil Resolution Tribunal.\n\n Vancouver's laughing men statues don friendship bracelets for Eras Tour\n\n The iconic bronze statues of laughing men in Vancouver’s West End have been decked out with themed friendship bracelets ahead of another icon’s arrival in the city.\n\n Man, 25, charged with murder after allegedly killing mother in Pickering: police\n\n A 25-year-old man has been charged with second-degree murder after allegedly killing his mother on Sunday morning in Pickering, say police.\n\n Toronto-based arts-grant provider says nearly $10M was stolen by 'cybercriminal intruder'\n\n A Toronto-based non-profit that provides grants to musicians and others in the music industry says that nearly $10 million was stolen from its bank account by a 'cybercriminal' and then converted into cryptocurrency.\n\n Why teens’ mental health may be more strained than you think heading into the holidays\n\n While many people might think of the end of the year as a time to wind down one’s workload and take a break, a Toronto psychiatrist says young people may actually be carrying more stress than usual heading into the holiday season.\n\n HIV rates in Alberta are up 73%, nearly doubled since 2019\n\n Sunday marks World AIDs Day and doctors, researchers, and community advocates are raising the alarm over the significant rise in HIV rates across Canada, including Alberta.\n\n Vladar mask features tribute to Gaudreau brothers as Blue Jackets come to Calgary\n\n It will be an emotional night for Flames fans and Gaudreau family at the Scotiabank Saddledome Tuesday night when the Columbus Blue Jackets are in town.\n\n Calgary police seek arson suspect in bitcoin extortion case\n\n Calgary police are looking for a suspect in an arson case, connected to an attempt to extort bitcoin from victims.\n\n Stittsville family recreates Christmas movie themed holiday light display for charity\n\n A Christmas classic in Stittsville is back.\n\n Canadian tech company helps children with disabilities walk for the first time\n\n A Canadian tech company and an Ottawa pediatric care centre teamed up to offer kids with mobility challenges a once in a lifetime opportunity to take their very first steps.\n\n Low rise building fire seriously injures 40-year-old in downtown Ottawa\n\n A fire that started in the basement of a two-storey building in downtown Ottawa on Saturday night seriously injured a 40-year-old, paramedics say.\n\n Troubling allegations against Montreal's Bordeaux Prison over medical care for inmate battling cancer\n\n An Indigenous man battling cancer, and his family are alleging that Montreal's Bordeaux Prison has failed to provide him with adequate medical care, claiming that it's now too late to stop the disease's progression.\n\n HIV cases surge in Quebec, experts call for increased access to prevention and support\n\n HIV cases in Quebec have increased compared to previous years. According to Institut national de santé publique du Québec (INSPQ), 917 cases of HIV were recorded in 2022.\n\n Charlie McAvoy and Charlie Coyle each score twice as Bruins beat Canadiens on 100th anniversary\n\n Charlie McAvoy scored two goals — one coming when Boston scored three times in 70 seconds during the opening period — and the Bruins celebrated the 100th anniversary of their first NHL game with a 6-3 victory over the Montreal Canadiens on Sunday.\n\n Edmonton mayor to pitch tax reduction plan for 'immediate relief'\n\n Edmonton's mayor is pitching a plan to lower property taxes.\n\n Natural gas line severed by vehicle crash ignites fire at gas station east of Edmonton\n\n The Tempo service station on the south side of Highway 16 at Range Road 223 burned down on Sunday after a vehicle crashed into the back of the building and severed a natural gas line.\n\n Elks to name Killam head coach: CFL insider\n\n TSN's Farhan Lalji reported Saturday that Killam, who the Calgary Stampeders let go last month, will assume the reins from Jarious Jackson.\n\n A tail as big as a kite … shooting star shines bright over Christmas tree lighting in Fall River, N.S.\n\n A resident of Fall River, N.S., captured a Christmas miracle during a tree lighting on Saturday night.\n\n Modified Santa Parade draws thousands in Moncton, N.B.\n\n A modified version of Moncton’s traditional Santa Claus parade drew thousands of people Sunday after the original parade was cancelled due to bad weather.\n\n Ukrainian Club in Moncton, N.B., celebrates 3rd annual Koliada: Ukrainian Christmas Fest\n\n The Ukrainian Club of Moncton celebrated its 3rd annual Koliada: Ukrainian Christmas Fest on Sunday to share their culture with the community and support the war effort in their home country.\n\n Winnipeg man charged after drugs, shotgun seized\n\n A 32-year-old man has been charged with several weapon and drug-related offences by Winnipeg police.\n\n New mural unveiled in Winnipeg's West End\n\n A new mural that captures the heart and soul of the city’s South Valour community was unveiled Sunday afternoon.\n\n Woman arrested in Skywalk after wielding knife, threatening security: police\n\n A Winnipeg woman is facing several charges after police said she threatened security at the Millenium Library downtown.\n\n Agribition 2024 wraps up in Regina\n\n The 53rd Canadian Western Agribition wrapped up on Nov. 29, after an event-filled day.\n\n Manz verdict still unknown as jury deliberations enter third day\n\n The case of Regina chiropractor Ruben Manz sits in limbo as the court still awaits the jury's verdict Sunday morning.\n\n Temperature records broken, tied following latest snowfall in Saskatchewan\n\n Saskatchewan received yet more snow as winter continues to ramp up on the prairies. With the increased precipitation, communities have recorded dipping temperatures – with a handful breaking or tying longstanding records.\n\n Kitchener \n\n Emergency crews battle large fire at Kitchener, Ont. townhouse complex\n\n Waterloo Regional Police say Kingsway Drive will remain closed as emergency crews continue to battle a large blaze at a townhouse complex.\n\n One man dead after shooting at Kitchener's 'A Better Tent City'\n\n One man is dead after an afternoon shooting at 49 Ardelt Ave. in Kitchener.\n\n One man arrested after robbery involving firearm in Kitchener\n\n One man has been arrested after a firearm was brandished during a robbery in Kitchener Saturday evening.\n\n Saskatoon \n\n Saskatoon priest accused of sexual assault says he meant to encourage young girl with hug and kiss\n\n A Saskatoon priest accused of sexual assault says he meant to encourage and reassure a young girl when he hugged and kissed her during an encounter in 2023. He recounted the incident in his testimony at Saskatoon Provincial Court Friday.\n\n City crews battle overnight snowfall in Saskatoon\n\n The City of Saskatoon crews are plowing and grading high traffic roads following overnight snowfall in the city.\n\n Sask. Indigenous storytelling lives on through award-winning radio play\n\n For thousands of years, Indigenous peoples in North America have passed down stories and history through oral tradition. That age-old practice continues today with We Treaty People, a nine-part radio play series created by Burnt Thicket Theatre.\n\n Northern Ontario \n\n Saultites keep digging as the snow keeps falling\n\n Snowfall in Sault Ste. Marie seemed to be delayed this year, but the cruel joke by Mother Nature saw a single dump make up for weeks of fall-like weather.\n\n Canadian team told Trump's tariffs unavoidable right now, but solutions on the table in surprise Mar-a-Lago meeting\n\n During a surprise dinner at Mar-a-Lago, representatives of the federal government were told U.S. tariffs from the incoming Donald Trump administration cannot be avoided in the immediate term, two government sources tell CTV News.\n\n Man fined $10K for abandoning homemade barge in Lake Nipissing\n\n A man from Lavigne, Ont., has been fined $10,000 for abandoning a homemade barge in Lake Nipissing.\n\n SIU investigating collision north of London that sent three to hospital\n\n A collision occurred between two vehicles, and three people were transported to hospital, two with life-threatening injuries.\n\n Canada Post presents union with 'framework' to reach deal as strike continues\n\n Canada Post says it has presented the union representing some 55,000 striking postal workers with a framework to reach negotiated agreements.\n\n Intense Ontario snow strands vehicles, knocks out power, and is heading south\n\n Intense snow squalls battering Ontario moved south after burying some parts of the province under more than a metre of snow, stranding vehicles and prompting one town to declare a state of emergency.\n\n Muskoka reacts to major snowfall, Highway 11 still closed\n\n From road closures, power outages, weather declarations and nonstop shovelling, Muskoka residents were faced with nearly a metre of persistent snowfall on Saturday.\n\n Snow closes portion of Highway 11\n\n OPP have closed a segment of Highway 11 in South Muskoka due to unsafe driving conditions caused by weather.\n\n Muskoka declares significant weather event\n\n The District Municipality of Muskoka has declared a significant weather event in response to the snow that continues to fall in the region.\n\n Car ends up in water-filled ditch in Chatham-Kent\n\n On Saturday afternoon at roughly 5:30 p.m., Chatham-Kent Police say that they responded to a single vehicle collision on Queens Line near Drake Road.\n\n Former WWE star to appear in Leamington for NCG Wrestling's final show of 2024\n\n The Noble Champions Group is set to present its final event of the year on Dec. 7 at the Leamington Portuguese Community Club.\n\n Three million grams of cereal collected to feed students in annual Cereal Box Challenge\n\n The food collected will help support 33 breakfast and snack programs in the Greater Essex County District School Board.\n\n Vancouver Island \n\n Woman 'waving a weapon' seriously injured during Vancouver Island arrest; IIO called in\n\n B.C.’s police oversight agency has been called in to investigate after a woman on Vancouver Island suffered a serious injury while being arrested Friday.\n\n Yuletide festivities help kick off holiday season in Greater Victoria\n\n Greater Victoria has a host of yuletide festivities this weekend for residents ready to kick off the holiday season.\n\n Vancouver's laughing men statues don friendship bracelets for Eras Tour\n\n The iconic bronze statues of laughing men in Vancouver’s West End have been decked out with themed friendship bracelets ahead of another icon’s arrival in the city.\n\n Study of 2023 Okanagan wildfires recommends limiting development in high-risk areas\n\n A study into the devastating wildfires that struck British Columbia's Okanagan region in 2023 has recommended that government and industry limit development in high-fire-risk areas.\n\n Kelowna, B.C., to host the Memorial Cup in the spring of 2026\n\n The Western Hockey League's Kelowna Rockets will host the Memorial Cup in the spring of 2026, the Canadian Hockey League said Wednesday.\n\n 545 vehicles impounded in 332 days: BC Highway Patrol pleads for drivers to slow down\n\n Mounties with the BC Highway Patrol in Kelowna say they've impounded more than 545 vehicles for excessive speed and aggressive driving so far this year. That works out to more than 1.6 per day.\n\n Lethbridge \n\n Raiders hand Hurricanes sixth loss in a row, winning 3-2 in Prince Albert\n\n The Hurricanes ended November with a loss, dropping a 3-2 decision to the Raiders Saturday night in Prince Albert.\n\n University of Lethbridge launches geospatial insitute\n\n Geomatics research is about to take a step forward at the University of Lethbridge.\n\n Road-weary Hurricanes drop fifth in a row, losing 4-1 to Blades in Saskatoon\n\n The Lethbridge Hurricanes ran into a hot goalie in Evan Gardner Friday night who cooled them off, leading the Blades to a 4-1 win in Saskatoon.\n\n Sault Ste. Marie \n\n Saultites keep digging as the snow keeps falling\n\n Snowfall in Sault Ste. Marie seemed to be delayed this year, but the cruel joke by Mother Nature saw a single dump make up for weeks of fall-like weather.\n\n Two arrested following shooting on Manitoulin Island\n\n The Manitoulin detachment of the Ontario Provincial Police have two people in custody following a shooting incident in Wikwemikong Unceded Territory on Thursday.\n\n Another 60 cm of snow possible in the Sault as severe weather continues\n\n Closures and cancellations are piling up in Sault Ste. Marie as a major winter storm continues for another day Friday.\n\n Newfoundland's LGBTQ2S+ bar paid drag queens $37.50. Tara Nova called them out.\n\n If the screaming crowd in the twinkling Majestic Theatre in downtown St. John's was any indication, Newfoundland drag queen Tara Nova will never have to accept $37.50 for a show again.\n\n 'Who profits on hunger?': Inuit send pleading emails to minister about food costs\n\n People in Nunavut and northern Labrador have been writing to Canadian government officials this year to say grocers were charging exorbitant prices despite receiving a federal subsidy.\n\n As N.L. firm pivots, scientists say Canada's green hydrogen dreams are far-fetched\n\n A Newfoundland energy company's embrace of data centres is raising doubts about eastern Canadian hopes of harnessing the region's howling winds to supply Germany with power from green hydrogen.\n\n Stay Connected","url":"https://www.ctvnews.ca/world/joe-biden-pardons-his-son-hunter-biden-on-gun-tax-charges-despite-previous-promises-he-wouldn-t-1.7129975","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/12/1/joe-biden-pardons-son-hunter-biden-on-all-charges-1-7129985-1733101647931.jpg","video":null,"publish_date":"2024-12-02 01:14:30","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"ca","sentiment":0.542},{"id":269538584,"title":"Joe Biden Pardons His Son Hunter Despite Previous Pledges Not To C 16944819","text":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California.\n\nThe move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nKnow the news with the 7NEWS app: Download today \n\nIn June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News.\n\nAs recently as November 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”","url":"https://7news.com.au/news/world/joe-biden-pardons-his-son-hunter-despite-previous-pledges-not-to-c-16944819","image":"https://images.7news.com.au/publication/C-16944819/229929d1909f07b7317ea1487256c05ff5843ddc-16x9-x0y75w800h450.jpg?imwidth=1200","video":null,"publish_date":"2024-12-02 01:12:31","author":null,"language":"en","source_country":"au","sentiment":-0.237},{"id":269539806,"title":"US President Joe Biden Pardons Son Hunter of Possible Prison Sentence Despite Pledging Not To","text":"Washington: Outgoing US President Joe Biden , who had made several claims and promises earlier that he will not spare his own son, has now issued a pardon for Hunter Biden, after he was convicted on federal charges. Here's what the US President said…Biden Pardons Son HunterPresident Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.The Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.Hunter Biden Under Federal InvestigationIt caps a long-running legal saga for the president's son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden's 2020 victory. In June, as Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News. As recently as Nov 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We've been asked that question multiple times. Our answer stands, which is no.”Joe Biden Full Statement on Decision to Pardon SonFull written statement from President Joe Biden on his decision to pardon his son:Today, I signed a pardon for my son Hunter. From the day I took office, I said I would not interfere with the Justice Department’s decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted. Without aggravating factors like use in a crime, multiple purchases, or buying a weapon as a straw purchaser, people are almost never brought to trial on felony charges solely for how they filled out a gun form. Those who were late paying their taxes because of serious addictions, but paid them back subsequently with interest and penalties, are typically given non-criminal resolutions. It is clear that Hunter was treated differently.The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election. Then, a carefully negotiated plea deal, agreed to by the Department of Justice, unraveled in the court room – with a number of my political opponents in Congress taking credit for bringing political pressure on the process. Had the plea deal held, it would have been a fair, reasonable resolution of Hunter’s cases.(Inputs from AP)","summary":"US President Joe Biden Pardons Son Hunter of Possible Prison Sentence Despite Pledging Not To","url":"https://www.republicworld.com/world-news/us-president-joe-biden-pardons-son-hunter-of-possible-prison-sentence-after-conviction-on-federal-charges-despite-pledging-not-to-read-full-statement-here","image":"https://img.republicworld.com/all_images/joe-biden-with-son-hunter-1733101680822-16_9.webp","video":null,"publish_date":"2024-12-02 01:08:07","author":"Digital Desk","authors":["Digital Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.371},{"id":269537754,"title":"President Joe Biden Issues Pardon Son Hunter Gun Tax Charges Claiming Prosecution Was Influenced Politics","text":"WASHINGTON D.C. -- President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president's son, who publicly disclosed he was under federal investigation in December 2020 - a month after Joe Biden's 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, \"I abide by the jury decision. I will do that and I will not pardon him.\"\n\nAs recently as Nov. 8, days after Trump's victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, \"We've been asked that question multiple times. Our answer stands, which is no.\"\n\nIn a statement released Sunday evening, Biden said, \"Today, I signed a pardon for my son Hunter,\" alleging that the prosecution of his son was politically motivated and a \"miscarriage of justice.\"\n\n\"The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,\" Biden said. \"No reasonable person who looks at the facts of Hunter's cases can reach any other conclusion than Hunter was singled out only because he is my son.\"\n\n\"I hope Americans will understand why a father and a President would come to this decision,\" Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family.\n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin.\n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction.\n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely.\n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt \"to helping those who are still sick and suffering.\"\n\n\"I have admitted and taken responsibility for my mistakes during the darkest days of my addiction - mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,\" the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.","url":"https://abc7news.com/post/president-joe-biden-issues-pardon-son-hunter-gun-tax-charges-claiming-prosecution-was-influenced-politics/15611357/","image":"https://cdn.abcotvs.com/dip/images/15611366_120124-kfsn-ap-Hunter-Joe-Biden-1.jpg?w=1600","video":null,"publish_date":"2024-12-02 01:05:33","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.353},{"id":269537690,"title":"Zelenskiy urges Biden to rally support for Ukraine’s Nato membership","text":"KYIV: Ukrainian President Volodymyr Zelenskiy called on the outgoing US administration of President Joe Biden on Sunday to help convince NATO members to invite Ukraine to join the alliance, as Ukraine’s war with Russia enters an unpredictable new phase. \n\nKyiv wants NATO members to issue an invitation at an alliance meeting in Brussels this week as the invasion grinds toward its three-year mark and Russia makes battlefield gains. \n\nZelenskiy spoke to reporters in Kyiv alongside the new president of the European Union’s council of member states, Antonio Costa, who travelled to Ukraine on his first day in office to show support for Kyiv in its war with Russia. \n\nThe Ukrainian leader, who has been calibrating Ukraine’s positions before Donald Trump succeeds Biden in January, acknowledged that some NATO allies were still wary of inviting Kyiv to join the alliance, which obliges all members to aid each other if attacked. \n\n“There are two months left in the current administration in the United States,” he said. “They have influence on those few European sceptics of our future (in NATO).”","summary":"KYIV: Ukrainian President Volodymyr Zelenskiy called on the outgoing US administration of President Joe Biden on Sunday to help convince NATO members to invite Ukraine to join the alliance, as Ukraine’s war with Russia enters an unpredictable new phase. \n\n\n\nKyiv wants NATO members to issue an invitation at an alliance meeting in Brussels this week as the invasion grinds toward its three-year mark and Russia makes battlefield gains. \n\n\n\nZelenskiy spoke to reporters in Kyiv alongside the new president of the European Union’s council of member states, Antonio Costa, who travelled to Ukraine on his first day in office to show support for Kyiv in its war with Russia. \n\n\n\nThe Ukrainian leader, who has been calibrating Ukraine’s positions before Donald Trump succeeds Biden in January, acknowledged that some NATO allies were still wary of inviting Kyiv to join the alliance, which obliges all members to aid each other if attacked. \n\n\n\n“There are two months left in the current administration in the United States,” he s","url":"https://www.brecorder.com/news/40335348/zelenskiy-urges-biden-to-rally-support-for-ukraines-nato-membership","image":"https://i.brecorder.com/large/2024/12/674ce38222a83.jpg","video":null,"publish_date":"2024-12-02 01:04:32","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.246},{"id":269537934,"title":"Biden pardons son Hunter after previous pledges not to","text":"US President Joe Biden has pardoned his son, Hunter, sparing him a possible prison sentence for gun and tax convictions and reversing past promises not to use the powers of the presidency for the benefit of his family members.\n\n\"Today, I signed a pardon for my son Hunter. From the day I took office, I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted,\" the president said in a statement released by the White House.\n\n\"I hope Americans will understand why a father and a President would come to this decision.\"\n\nBiden had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California.\n\nBiden said he had made the decision over the weekend. The president, his wife, Jill Biden, and their family including Hunter, spent the Thanksgiving holiday in Nantucket, Massachusetts and returned to Washington on Saturday night.\n\n\"Here's the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice - and once I made this decision this weekend, there was no sense in delaying it further,\" he said.\n\nThe move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before US President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for Hunter Biden, who publicly disclosed he was under federal investigation in December 2020 - a month after Joe Biden's 2020 US election victory.\n\nIn June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News.\n\nAs recently as November 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying: \"We've been asked that question multiple times. Our answer stands, which is no.\"\n\nwith Reuters","summary":"US President Joe Biden says he had pardoned his son, Hunter Biden, who was convicted on a gun charge.","url":"https://thewest.com.au/politics/biden-pardons-son-hunter-after-previous-pledges-not-to-c-16945021","image":"https://images.thewest.com.au/publication/C-16945021/ff6a6046498b4a1340a79cf192a14fd0bcbe0b42-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-12-02 01:03:42","author":"Staff Writers","authors":["Staff Writers"],"language":"en","source_country":"au","sentiment":-0.277},{"id":269537906,"title":"Taiwan backs expansion of AUKUS, strait ship transits","text":"The AUKUS partnership is a form of an Asian NATO, the Taiwanese government says, after welcoming further transits of Australian warships through the Taiwan Strait to counter China’s military activity.\n\nSpeaking to journalists, Deputy Foreign Affairs Minister Francois Wu agreed the proposal floated by Japanese Prime Minister Shigeru Ishiba for a NATO-like security pact in Asia would likely anger Beijing.\n\n“Maybe it’s not good for the stability of the region,” Wu he told a group of Australian reporters at the Ministry of Foreign Affairs in the capital Taipei in November.\n\n“But having said that … AUKUS in some way, is another form of (an) Asian NATO.”\n\nThe North Atlantic Treaty Organisation is an alliance of 30 European, and two North American nations set up to defend each other against attacks by third parties.\n\n“You just don’t need to call (AUKUS) NATO, but it is a real NATO,” Wu said.\n\nUnder the AUKUS partnership, Australia has been promised at least three Virginia-class submarines from the US in the early 2030s, with a new class of nuclear-powered boats to be built for delivery from the 2040s.\n\nIn a joint statement, Australia, the UK and U.S earlier this year said they were consulting with New Zealand, Canada and South Korea to identify possibilities for collaboration on capabilities under AUKUS Pillar II, which covers advanced capabilities.\n\nBeijing has warned New Zealand if it were to join the partnership, it would inevitably have a negative impact on the country’s relationship with China.\n\nMr Wu said while Taiwan couldn’t join these agreements because of Beijing’s opposition, it would be good for countries such as Japan, Canada or New Zealand to do so.\n\nU.S president-elect Donald Trump has made comments about Taiwan, saying it should pay the U.S for its defence, prompting concern amongst officials about how Washington’s position may change after his inauguration in January.\n\nWu questioned how Trump could make the U.S “great again” if he abandoned Taiwan.\n\n“He will lose the credibility of the U.S in the total Asia-Pacific,” he said.\n\n“Every day we need to send a message to (Chinese President) Xi Jinping, not to invade Taiwan.”\n\nAustralian National University expert associate Jennifer Parker said while AUKUS was not a de-facto NATO, and was a capability rather than a security pact, it had been positive to see its increased acceptance in the region.\n\n“Different regions require different security constructs – And the NATO-like structure that relies on an aligned strategic outlook is not likely to be a successful model for Asia – as evidenced by the failure of the (1954 Southeast Asia Treaty Organisation, which was dissolved in 1977),” she told AAP.\n\n“We are a long way off from additional countries joining Pillar II of AUKUS, if ever.\n\n“But we will certainly see increased collaboration on AUKUS initiatives under Pillar II with countries such as Japan, Canada, New Zealand and South Korea.”\n\nA senior Taiwanese official speaking anonymously said the island welcomed the passage of Australian warships through the strait and would like to see more of it.\n\nWarships from Japan, Australia and New Zealand sailed through the Taiwan Strait in late September, prompting Beijing to warn it remained vigilant against any acts that might jeopardise its sovereignty.\n\nParker said transits through the strait by European and regional navies alongside Australia’s, had increased in the last 12 months.\n\n“They are an important method of highlighting that the Taiwan Strait is international waters and reinforcing support for the UN Convention on the Law of the Sea in the face of China’s regional attempts to challenge these norms,” she said.\n\nChina claims self-governed Taiwan as a breakaway province after the government of the Republic of China (Taiwan) relocated to the island in 1949 during the civil war with the Chinese Communist Party.\n\nThe AAP reporter travelled to Taipei with the assistance of the Taiwanese government…. PACNEWS/AAP","summary":"The AUKUS partnership is a form of an Asian NATO, the Taiwanese government says, after welcoming further transits of Australian warships through the Taiwan Strait to counter China's military activity.\n\n\nThe post Taiwan backs expansion of AUKUS, strait ship transits appeared first on Post Courier.","url":"https://www.postcourier.com.pg/taiwan-backs-expansion-of-aukus-strait-ship-transits/","image":"https://www.postcourier.com.pg/wp-content/uploads/2024/12/As-the-RAN-steps-up-patrol-in-the-Taiwan-Strait-Taipei-has-suggested-AUKUS-is-sort-of-Asian-NATO.jpg","video":null,"publish_date":"2024-12-02 01:01:20","author":"Japanese Prime Minister,postcourieronline","authors":["Japanese Prime Minister","postcourieronline"],"language":"en","source_country":"pg","sentiment":0.18},{"id":269536666,"title":"Our Brand Is Toxic Former Us Democratic Lawmaker Calls For Complete Reset Of Party After Harris Loss To Trump","text":"Former US Democratic lawmaker Tim Ryan urged the party to “rebrand” on Saturday, calling the party’s image “toxic” in many areas. Speaking on MSNBC's \"The Weekend,\" Ryan argued the party needs a major overhaul after President-elect Donald Trump's victory over vice president Kamala Harris.“You start with a complete reset. We need a rebrand. I think you and I have been talking about this since 2016, like, our brand is toxic in so many places and it is like, you are a Democrat? That’s the stuff we get like in Ohio. So it needs — we need a complete reboot. We need a complete reboot with the DNC. We need a complete rebranding,” Ryan said, as reported by Fox News. He believed the party hadn’t offered enough to voters in the political middle ground who were reluctant to vote for Trump.Ryan suggested the Democrats should focus on policies that resonate with working-class voters, like reindustrialization and American competitiveness. He questioned the party’s stance against the crypto industry and called for a return to “bread and butter policies.” He contrasted his view with a focus solely on redistribution.Ryan cited former President Bill Clinton’s campaign as a model for the party moving forward, saying, “The other thing that I think is really big, we can’t be for solely redistribution. It is about getting back to you want — it is the Bill Clinton campaign. It is the modern Democratic campaign. Look at the touchstone. Reinventing government.\"“We are going to tax the bad guys who are rich, which we want people to aspire to make money in America. We will tax them because they’re really bad people and we’re going to give you money. No, it is about growing the pie,” he added.While Ryan advocated for this change in direction, other prominent Democrats hold differing perspectives. Senator Bernie Sanders believes the party’s losses stem from abandoning the working class. However, House Speaker Nancy Pelosi disagreed with Sanders’ assessment. “With all due respect, and I have a great deal of respect for him [Sanders], for what he stands for, but I don't respect him saying that the Democratic Party has abandoned the working class families. That's where we are,” Pelosi said on The New York Times' \"The Interview\" podcast.","url":"https://timesofindia.indiatimes.com/world/us/our-brand-is-toxic-former-us-democratic-lawmaker-calls-for-complete-reset-of-party-after-harris-loss-to-trump/articleshow/115879612.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115880434/115880434.jpg","video":null,"publish_date":"2024-12-02 01:00:30","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"in","sentiment":-0.55},{"id":269538636,"title":"Biden pardons his son Hunter despite previous pledges not to","text":"WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family.\n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin.\n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction.\n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely.\n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.","summary":"WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers...","url":"https://nation.lk/online/biden-pardons-his-son-hunter-despite-previous-pledges-not-to-285922.html","image":"https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2024/12/President-Biden-pardons-son-Hunter-Biden.jpg","video":null,"publish_date":"2024-12-02 01:00:05","author":null,"language":"en","source_country":"lk","sentiment":-0.323},{"id":269538270,"title":"‘Go find another sucker’: Trump threatens Xi, Putin and co","text":"The self-proclaimed “Tariff Man” has struck again, this time threatening the BRICS countries with 100 per cent tariffs if they try to undermine the dominance of the US dollar.\n\nIn a post on his social media platform Truth Social at the weekend, Donald Trump threatened to use his weapon of first (and second, and third) choice if they tried to create an alternative currency to rival the dollar.\n\n“The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is over,” he wrote.\n\n“We require a commitment from these countries that they will neither create a new BRICS currency, nor back any other currency to replace the mighty US dollar or, they will face 100 per cent tariffs, and should expect to say goodbye to selling into the wonderful US Economy.","summary":"Donald Trump has found a new way to deploy his favourite weapon.","url":"https://www.brisbanetimes.com.au/business/markets/go-find-another-sucker-trump-threatens-xi-putin-and-co-20241202-p5kv1m.html","image":"https://static.ffx.io/images/$zoom_0.4038037692559816%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_78%2C$y_54/t_crop_custom/q_86%2Cf_auto/c795ec58c959f73febbec22f2b0257c8787134f2","video":null,"publish_date":"2024-12-02 00:58:48","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.225},{"id":269538208,"title":"‘Go find another sucker’: Trump threatens Xi, Putin and co","text":"The self-proclaimed “Tariff Man” has struck again, this time threatening the BRICS countries with 100 per cent tariffs if they try to undermine the dominance of the US dollar.\n\nIn a post on his Truth Social social media platform at the weekend, Donald Trump threatened to use his weapon of first (and second, and third) choice if they tried to create an alternative currency to rival the dollar.\n\n“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” he wrote.\n\n“We require a commitment from these Countries that they will neither create a new BRICS currency, nor back any other Currency to replace the mighty US dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful US Economy.","summary":"Donald Trump has found a new way to deploy his favourite weapon.","url":"https://www.smh.com.au/business/markets/go-find-another-sucker-trump-threatens-xi-putin-and-co-20241202-p5kv1m.html","image":"https://static.ffx.io/images/$zoom_0.4038037692559816%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_78%2C$y_54/t_crop_custom/q_86%2Cf_auto/c795ec58c959f73febbec22f2b0257c8787134f2","video":null,"publish_date":"2024-12-02 00:58:48","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.25},{"id":269537658,"title":"‘Go find another sucker’: Trump threatens Xi, Putin and co","text":"The self-proclaimed “Tariff Man” has struck again, this time threatening the BRICS countries with 100 per cent tariffs if they try to undermine the dominance of the US dollar.\n\nIn a post on his Truth Social social media platform at the weekend, Donald Trump threatened to use his weapon of first (and second, and third) choice if they tried to create an alternative currency to rival the dollar.\n\n“The idea that the BRICS Countries are trying to move away from the Dollar while we stand by and watch is OVER,” he wrote.\n\n“We require a commitment from these Countries that they will neither create a new BRICS currency, nor back any other Currency to replace the mighty US dollar or, they will face 100% Tariffs, and should expect to say goodbye to selling into the wonderful US Economy.","summary":"Donald Trump has found a new way to deploy his favourite weapon.","url":"https://www.theage.com.au/business/markets/go-find-another-sucker-trump-threatens-xi-putin-and-co-20241202-p5kv1m.html","image":"https://static.ffx.io/images/$zoom_0.4038037692559816%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_78%2C$y_54/t_crop_custom/q_86%2Cf_auto/c795ec58c959f73febbec22f2b0257c8787134f2","video":null,"publish_date":"2024-12-02 00:58:48","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.25},{"id":269537630,"title":"Biden Pardons Son Hunter Ahead Of Sentencing: Statement","text":"US President Joe Biden on Sunday issued an official pardon for his son Hunter, who is facing sentencing for two criminal cases related to tax evasion and the purchase of a firearm.\"No reasonable person who looks at the facts of Hunter's cases can reach any other conclusion than Hunter was singled out only because he is my son -- and that is wrong,\" the president said in a statement, calling it \"a miscarriage of justice.\"The younger Biden was convicted earlier this year of lying about his drug use when he bought a gun -- a felony -- and has also pleaded guilty in a separate tax evasion trial.The pardon comes after Biden has repeatedly said he wouldn't intervene in his son's legal troubles. The White House press secretary said as recently as September that Biden wouldn't issue a pardon for Hunter.At the same time, criminal cases against President-elect Donald Trump have come to a standstill after a sweeping ruling on presidential immunity by the Supreme Court -- all but ensuring Biden's Republican rival will likely never see a jail cell, even after his landmark conviction for falsifying business records in May.\"I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted,\" Biden said in Sunday's statement.\"The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,\" he added.\"I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice.\"","summary":"US President Joe Biden on Sunday issued an official pardon for his son Hunter, who is facing sentencing for two criminal cases related to tax evasion and the purchase of a firearm.","url":"https://www.ibtimes.com/biden-pardons-son-hunter-ahead-sentencing-statement-3753492","image":"https://d.ibtimes.com/en/full/4565931/pardon-comes-after-president-joe-biden-has-repeatedly-said-he-wouldnt-intervene-his-sons-legal.jpg","video":null,"publish_date":"2024-12-02 00:58:44","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.42},{"id":269537084,"title":"Joe Biden says he is pardoning his son, Hunter","text":"U.S. President Joe Biden said on Sunday he had pardoned his son, Hunter Biden, who had been convicted of making false statements on a gun background check and illegally possessing a firearm and plead guilty to federal tax charges. Today, I signed a pardon for my son Hunter. From the day I took office, I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted, he said in a statement released by the White House. The White House had said repeatedly that Biden would not pardon or commute the sentences of his son, a recovering drug addict who became a target of Republicans, including President-elect Donald Trump. No reasonable person who looks at the facts of Hunter's cases can reach any other conclusion than Hunter was singled out only because he is my son, Biden said. There has been an effort to break Hunter - who has been five and a half years sober, even in the face of unrelenting attacks and selective prosecution. In trying to break Hunter, they've tried to break me - and there's no reason to believe it will stop here. Enough is enough. Biden said he had made the decision over the weekend. The president, his wife, Jill Biden, and their family including Hunter, spent the Thanksgiving holiday in Nantucket, Massachusetts and returned to Washington on Saturday night. Here's the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice - and once I made this decision this weekend, there was no sense in delaying it further, Biden said. I hope Americans will understand why a father and a President would come to this decision.","summary":"U.S. President Joe Biden issued a pardon for his son Hunter Biden, who faced convictions for making false statements and illegal firearm possession, along with federal tax charges. Biden expressed that political motives led to an unfair prosecution. He stated that while believing in the justice system, he felt compelled to act due to political interference.","url":"https://economictimes.indiatimes.com/news/international/world-news/joe-biden-says-he-is-pardoning-his-son-hunter/articleshow/115880541.cms","image":"https://img.etimg.com/thumb/msid-115880545,resizemode-4,width-1200,height-900,imgsize-131720,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-12-02 00:53:19","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"in","sentiment":-0.572},{"id":269535264,"title":"Traders Flood Into Crypto Gold As Trump Bets Surge 20241030 P5kmhc","text":"Traders are scrambling to position for a Donald Trump victory in next week’s US election, triggering a frantic rush into bitcoin and gold which is tipped to benefit from ballooning deficits and geopolitical tensions under the Republican candidate.\n\nBitcoin has surged more than 8 per cent over the past two sessions to as high as $US73,564 ($111,974) on Tuesday in New York (Wednesday AEDT), just shy of March’s all-time peak of $US73,798. Meanwhile, gold hit a fresh record of $US2781.69 an ounce in Asia trading on Wednesday, topping its previous high posted on Tuesday.","url":"https://www.afr.com/markets/currencies/traders-flood-into-crypto-gold-as-trump-bets-surge-20241030-p5kmhc","image":"https://static.ffx.io/images/$zoom_0.3295%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_27/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/ae9ad9f43f63d0f187937dd3b7bfd5568a0f43aa","video":null,"publish_date":"2024-12-02 00:51:33","author":"Alex Gluyas","authors":["Alex Gluyas"],"language":"en","source_country":"au","sentiment":-0.084},{"id":269535256,"title":"Wall Street S Great Contrarian Reveals His Playbook For 2025 20241202 P5kv0z","text":"MarketsChanticleer\n\nDec 2, 2024 – 11.01am or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? \n\nIs it time for investors to start looking for some TINA turners?The return of a TINA (there is no alternative) narrative to financial markets has been one of the most fascinating aspects of the reaction to Donald Trump’s election victory.Loading...James Thomson is senior Chanticleer columnist based in Melbourne. He was the Companies editor and editor of BRW Magazine. Connect with James on Twitter. Email James at j.thomson@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreChanticleerOpinionWall StreetInvestingBondsSharemarket\n\nFetching latest articles","url":"https://www.afr.com/chanticleer/wall-street-s-great-contrarian-reveals-his-playbook-for-2025-20241202-p5kv0z","image":"https://static.ffx.io/images/$zoom_0.3429%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_opinion_no_age_social_wm/f93395dd30325b13b97cbd6d0dce3801ee569cb9","video":null,"publish_date":"2024-12-02 00:51:33","author":"James Thomson","authors":["James Thomson"],"language":"en","category":"entertainment","source_country":"au","sentiment":0.102},{"id":269535248,"title":"Northern Star Buys Rival Gold Miner De Grey In 5b Deal 20241202 P5kv1n","text":"Australia’s biggest gold miner, Northern Star, has agreed to buy smaller rival De Grey for $5 billion, as the metal’s soaring price swells the balance sheets of gold producers in an era of mounting economic uncertainty.\n\nThe price of gold is trading at $4059 an ounce and claimed a record $4239 an ounce on October 30, a week before Donald Trump was voted in for a second US presidential term. Trump’s fiscal agenda overseeing a widening US budget deficit has only served to make gold more attractive to investors who seek a hedge against the corrosive effect of inflation.","url":"https://www.afr.com/companies/mining/northern-star-buys-rival-gold-miner-de-grey-in-5b-deal-20241202-p5kv1n","image":"https://static.ffx.io/images/$zoom_0.4708%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_96/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/6c4a5a366fac40a4897fae288f5c10072a5e3ce1","video":null,"publish_date":"2024-12-02 00:51:33","author":"Mark Wembridge, Elouise Fowler","authors":["Mark Wembridge, Elouise Fowler"],"language":"en","source_country":"au","sentiment":0.054},{"id":269534866,"title":"Emmerdale actress 'quietly quits soap as their exit date is revealed' - after rollercoaster storyline","text":"Black Friday\n\nStrictly Come Dancing\n\nGreat British Bake Off\n\nPrivacy Policy\n\nMonday, Dec 2nd 2024\n\n5-Day Forecast\n\nAdvertisement\n\nEmmerdale actress 'quietly quits soap as their exit date is revealed' - after rollercoaster storyline\n\nHave YOU got a story? Email tips@dailymail.com\nBy AMELIA WYNNE FOR MAILONLINE \n Published:00:47 GMT, 2 December 2024 |Updated:00:48 GMT, 2 December 2024 \n\nAn Emmerdale actress has reportedly quietly quit the soap - and their exit date has been revealed.\nPaula Lane currently plays the part of Ella Forster in the long-running show but looks to be heading on to new opportunities, reports The Sun. \nPaula, 38, joined the Yorkshire-set last year and made her fiery debut on-screen in January 2024. \nShe was introduced as a no-nonsense receptionist and soon became friends with Mandy Dingle (Lisa Reilly) and was also a love interest for Dr Liam Cavanagh (Jonny McPherson). \nThe publication reports that there has been an update to her Spotlight talent page revealing she will stop filming in February 2025. \nSoon after entering the soap, Ella was revealed to have killed a friend of hers during her childhood and struggled to move on in her adult life.\n\nAn Emmerdale actress has reportedly quietly quit the soap - and their exit date has been revealed\n\nPaula Lane currently plays the part of Ella Forster in the long-running show but looks to be heading on to new opportunities, reports The Sun \nEarlier this year it was revealed that she was pregnant with Liam's child despite his love for Chas Dingle (Lisa Pargeter).\nShe sadly lost the baby as Liam grows his future with Chas. \nITV has been contacted by MailOnline for comment. \nPaula has also previously starred as Kylie Platt in Coronation Street and dramatically left the soap in 2016 after being brutally stabbed to death outside the kebab shop by Clayton Hibbs.\nShe died in the arms of her husband, David Platt, played by Jack P. Shepherd in final scenes. \nFollowing Kylie's tragic death, David went on to find love with Clayton's mum Shona Ramsey. \nAfter leaving Corrie Paula appeared in Call The Midwife and played Lauren in the UK tour of Kinky Boots. \nIt comes after last month viewers couldn't contain their emotions as they saw Sophie Powles reprise her role in Emmerdale for one last time. \nThe actress, 36, who starred as Holly Barton in the ITV soap opera on and off since 2009, returned to the village from beyond the grave on Wednesday as her mother Moira Dingle (Natalie J. Robb) went 'under the knife' to remove her tumour. \n\nPaula, 38, joined the Yorkshire-set last year and made her fiery debut on-screen in January 2024\nSophie's character had a fatal drug relapse and passed away in 2016, leaving her mother Moira devastated - just six months after she returned to the show. \nHowever, she has now temporarily returned to the show once again for a new tear-jerking storyline with her on-screen mother, leaving fans in bits.\nUpon seeing her return, viewers took to X, formerly Twitter, to express their delight at seeing Sophie on their screens once again. \n\n Emmerdale's Tom King star hints at twisted double exit as soap villain bows out with final act of cruelty \nFans wrote: 'OMG Holly Barton #emmerdale',\n'Holly Barton??', 'not me crying at the holly and moira part', 'Seeing Holly back made me sob',\n'Lovely Moira and Holly scene'.\nIn a new interview, Sophie discussed how she felt when the soap opera approached her to film the special episode. \nRevealing that she was 'grateful' to be back, Sophie said: 'I was really happy to come back.'\nShe added: 'Being a part of Emmerdale was just the best experience. Genuinely made friends for life in the cast and crew, learnt so much and have the best memories.'\n'So really grateful to come back and work with friends again on a show I love so much.'\n\nPaula has also previously starred as Kylie Platt in Coronation Street and dramatically left the soap in 2016 after being brutally stabbed to death outside the kebab shop by Clayton Hibbs\nEmmerdaleITV\n\nShare or comment on this article: \nEmmerdale actress 'quietly quits soap as their exit date is revealed' - after rollercoaster storyline\n\nAdd comment\n\nEnter search term:\n\nSir Elton John tells West End crowd 'I've lost my eyesight and cannot see the stage' - but tells The Devil Wear Prada cast they 'sounded great' \n\nWho left Strictly Come Dancing? Montell Douglas is the tenth celebrity to be eliminated following third dance-off in a row\n\nEXCLUSIVENewly-single Claire Sweeney breaks her silence on split from Ricky Hatton as she makes an appearance at The Devil Wears Prada\n\nAMANDA PLATELL: Gregg Wallace is attempting to smear accusers by suggesting they're prissy women \n\nWho left I'm A Celeb? Dean McCullough is the SECOND contestant to be evicted from the jungle camp as Irish DJ is voted out \n\nSpoil your loved ones with these 10 best gift brands - guaranteed to impress this Christmas!\n\nI'm A Celeb's Maura Higgins FINALLY admits to dating Pete Wicks (well, sort of) as she makes rare comment about her love life \n\nRevealed: Inside story of how Robbie Williams and Nicole Appleton became 'extremely close' again \n\nElizabeth Hurley joins Lily Collins, Vanessa Williams and Anna Wintour at star-studded launch of The Devil Wears Prada\n\nEXCLUSIVEStruggle to find jeans that fit? A lot of women do! This new size-inclusive range is here to change that - designed for every body type\n\nWayne Rooney leaves wife Coleen in tears as he sends her emotional message during letters from home segment\n\nEXCLUSIVEInside Holly Willoughby's TV comeback: A year after being scared to leave home how she's loving life again ahead of her return to our screens\n\nClaire Sweeney makes a rare red carpet appearance with son Jaxon, 7, as they attend The Devil Wears Prada: The Musical \n\nPeter Andre hit the big time at 16 and nearly squandered his new-found riches. Now he says he's lucky to have a wife who wants him to spend LESS, not more...\n\nFrom fun facts to puzzles and games: How a new magazine is getting children to fall in love with reading (and away from their screens!)\n\nI'm A Celeb star Coleen Rooney reveals husband Wayne proposed to her in a PETROL STATION\n\nUnconventional \n\nFrancesca Eastwood will NOT be charged in domestic violence arrest after row in LA with boyfriend got physical\n\nAnger as BBC allowed Gregg Wallace to remain on air - despite at least four complaints being made against him about his behaviour\n\nGregg Wallace accuser hits back after star blames 'middle class women of certain age' for complaining about his antics \n\nBake a little joy this Christmas! Create new festive traditions with these easy bakes the little ones will love\n\nEXCLUSIVEArlene Phillips, 81, weighs in on Gregg Wallace fiasco as he blames 'middle-class women of a certain age' for woes\n\nTeary-eyed Melvin Odoom is comforted by I'm A Celeb campmates Barry McGuigan and Oti Mabuse after jungle's constant torrential rain dampens his spirits\n\nGregg Wallace allegations are the 'tip of the iceberg' as former MasterChef contestant reveals 'really toxic environment' on show\n\nTimothy West's son Samuel reveals the actor's wife Prunella Scales - who is battling vascular dementia - is 'not well enough to take in' that he has died\n\nDamaged hair? Don't despair! With 1 billion bonds packed in every bottle, the NEW bond-building wonder product is here to help\n\nLily Collins cuts a glamorous figure in a busty gold gown as she cosies up to husband Charlie McDowell at The Devil Wears Prada\n\nStrictly Come Dancing results: Recap as Montell Douglas is eliminated in quarter-finals as she loses to Tasha Ghouri \n\nLauren Sanchez posts VERY racy BDSM photo, in what could be her sexiest snap ever\n\nLeft little to the imagination\n\nJohn Torode's savage Gregg Wallace remarks resurface after his MasterChef co-host hits back at misconduct allegations\n\nSmells like clean spirit: Why fragrance is so important to us, and how the right scent can make (or break) your day\n\nStrictly's Pete Wicks chokes back tears after making it through to semi-finals despite being bottom of the leaderboard \n\nGwyneth Paltrow shares photos as she reunites with ex husband Chris Martin for a 'special' long weekend in Paris w\n\nTess Daly looks incredible in a velvet jumpsuit as she joins Claudia Winkleman and Motsi Mabuse backstage\n\nStrictly viewers brand dance off a 'travesty' and rage neither Tasha Ghouri nor Montell Douglas deserved to be in the bottom two\n\nTime to deck the halls! Get in the gifting spirit this holiday season with these top 10 brands\n\n Ferocious social media backlash to Gregg Wallace's astonishing video blaming 'middle class women of a certain age' \n\nDavid Walliams, 53, holds hands with beloved mother Kathleen, 81, at The Devil Wears: The Musical launch night \n\nEXCLUSIVEArlene Phillips reveals her thoughts on Pete Wicks' Strictly journey as she admits she 'admires' the TOWIE star \n\nSir Elton John, 77, and David Furnish, 62, are joined by fashion icons as they attend The Devil Wears Prada: The Musical \n\nHave YOU suffered hair loss? Here's the science-backed solution experts are raving about\n\nBernie Ecclestone to sell £300MILLION car collection as Formula One mogul puts 69 vehicles up for sale\n\nOn the market \n\nAmber Davies sets pulses racing in a leather dress and matching gloves as she arrives at The Devil Wears Prada\n\nEllen DeGeneres shares heartfelt message to wife Portia de Rossi in 20th anniversary selfie after move to UK\n\nWayne Northrop dead at 77: Days Of Our Lives actor dies following battle with Alzheimer's\n\nThe actor's publicist confirmed the news\n\nPremium wine under £6 a bottle! Score HUGE savings on Laithwaites cases this Black Friday and stock up before Christmas with an extra 30% off\n\nSo will Hollywood star Zendaya embrace her roots... with a holiday in Dundee?\n\nZendaya is proud of her Scottish roots\n\nEddie Murphy's son and Martin Lawrence's daughter are engaged! Eric proposes to Jasmin with gorgeous ring\n\nHappy news \n\nKim Kardashian shares slumber party throwback with Wicked cast - and everyone is saying the same thing\n\nEXCLUSIVERicky Hatton and Claire Sweeney SPLIT following eight month romance after finding love on Dancing On Ice\n\nChanelle Hayes sends pulses racing in a skimpy white bikini as she packs on the PDA with her new husband Dan Bingham\n\nApple Martin caught having a mean girl moment at Paris debutante ball\n\nStephen Mulhern 'is replaced on ITV show by huge Coronation Street star' as presenter steps down following the death of his father \n\nDavid Beckham shows off his festive spirit as he shares a fun snap of the family's Elf On The Shelf for his kids Brooklyn, 25, Romeo, 22, Cruz, 19 and Harper, 13\n\nI'm A Celeb's Dean McCullough opens up on battle with alcohol addiction that left him in a 'really dark place' after celebrating four years of sobriety\n\nSave £100 on Gtech cordless vacuum shoppers call the 'best vacuum EVER' - plus more unmissable deals (save up to 50%)\n\nPete Wicks sends sweet message to Maura Higgins as it's revealed the I'm A Celeb beauty is the reason he has cooled his romantic liason with Jowita \n\nEXCLUSIVEThey formed an unlikely romance in the Big Brother house, and in their first joint interview, Nathan and Rosie lay bare struggles with 'showmance' claims\n\nGraziano Di Prima returns to London with wife Giada Lin for a dance class - four months after he was sacked from Strictly\n\nEllen DeGeneres accused of 'infesting the Cotswolds' by Donald Trump ally after fleeing to multi-million farmhouse with Portia di Rossi \n\nThis £29 blemish and scar treatment serum credited with 'massively' reducing blemishes is 20% off for Black Friday: 'Worked wonders for my skin'\n\nX users SLAM Alyssa Milano for deactivating her account amid Elon Musk feud\n\nThe actress has walked back her previous pledge\n\nKristen Doute seen for the first time since baby announcement at gender reveal party hosted by Brittany Cartwright\n\nPrince Harry and Meghan Markle won't join Royal Family for Christmas as the Sussexes 'have not been invited' to Sandringham festivities\n\nThe curse of Band Aid 40: Controversial new release features a wealth of stars whose lives have been plagued by tragedy\n\nHarry, Meghan and their new Netflix series on the racy world of polo that's set to cause yet more despair back in Britain\n\nNoel Gallagher reveals his mother's shocking reaction to the end of the brother's 15-year feud and the announcement of the Oasis reunion tour\n\nEXCLUSIVERuth Langsford's 'biggest worry' about being in the jungle revealed as she shares behind-the-scene look at the three metre floods causing chaos on I'm A Celeb \n\nSamuel West reveals the final words his theatre legend father Timothy said to him before he passed away aged 90 \n\nIs there something Wicked afoot? How the film's cast defied normality with bizarre gaffes, unexpected outbursts and PLENTY of tears on promo tour\n\nInside the 20-acre 'hippy countryside homestead' Talulah Riley and Thomas Brodie-Sangster share with four other adults and over 100 animals\n\nEXCLUSIVEAmy Hart hits back at pregnancy speculation as she shares baby plans and discusses marriage course - two months after exchanging vows \n\nZara Tindall shares a rare insight into how the Royal Family celebrates Christmas - including a very sweet gifting tradition\n\nA heart of gold and an inspiration... Sir Bradley's touching tribute to Sir Chris\n\nFormer Tour de France champion\n\nEXCLUSIVEI cracked Jade Goody's front tooth on stage in the middle of a TV show - she never forgave me for it, admits Big Brother winner Craig \n\nInside Sean Wilson's eight-minute meeting with Coronation Street bosses about historic sex claims that led to his comeback being axed\n\nDaniel Craig reveals the reason he initially rejected the chance to play James Bond after teasing who the next 007 could be\n\nChristina Hall is 'grateful for time together' as she enjoys a trip to NYC with daughter Taylor amid divorce\n\nWe bought one of Homes Under The Hammer's cheapest ever houses for just £15k - it turned out to be a heartbreaking mistake that ruined our property dreams\n\nMiranda Hart takes her husband Richard Fairs to Strictly studios to watch pal Sarah Hadland perform - after the pair tied the knot in secret\n\nKirstie Allsopp claims Greg Wallace bragged about 'performing a sex act with his partner' just an hour after meeting her as questions are raised of BBC\n\nEXCLUSIVECheers actress Shelley Long, 75, is all smiles in rare sighting a day after her longtime co-star was seen wheeled out of a dialysis clinic\n\nMichael Rowland announces his retirement from ABC News Breakfast after '15 years of 3am starts'\n\nI hosted one of the biggest TV shows of all time but when I was axed I ended up working at a call centre and sleeping on dad's sofa, recalls AJ Odudu\n\nMonty Don returns to stage for the first time after being forced to cancel gigs over health scare that left him hospitalised\n\nI'm A Celebrity SPOILER: Barry McGuigan, 63, struggles to win stars as he is left lying in a bed of critters in first look at his Bushtucker Trial\n\nThe VERY low-key reinvention of Dr Christian Jessen: How hunky TV medic has stepped out of the limelight following defamation row \n\nRobbie Williams told pregnant Nicole Appleton 'this baby is saving my life' before record company pressured her to have an abortion\n\nGregg Wallace lashes out at 'handful of middle-class women of a certain age' after MasterChef star is accused of groping staff and sexist behaviour\n\nStrictly Come Dancing fans are left devastated as dance-off results are LEAKED again - and furious viewers call verdict 'an absolute disgrace'\n\nGregg Wallace told Aasmah Mir one of her BBC colleagues was a \"sexy b****\" , broadcaster claims\n\nKing Charles shields himself from the rain with an umbrella as he attends Sunday morning service at Sandringham\n\nInside Sean Wilson's life after being axed from Coronation Street: From 'secret split' with famous girlfriend to surprise new career\n\nFormer Woman's Hour host Emma Barnett reveals endometriosis diagnosis meant she couldn't conceive naturally as she opens up about gruelling IVF battle\n\nEXCLUSIVEAnt McPartlin, 49, condemned over 'inappropriate' virginity jibes to female I'm A Celeb producers\n\nEXCLUSIVEI'm A Celebrity camp hit by the worst rain in show's history as three metre floods cause chaos for Ant and Dec and production staff\n\nVictoria Secret supermodel Elsa Hosk signs huge six-figure deal with online fashion brand PrettyLittleThing\n\nKate Nash takes aim at the music industry as she reveals how she got the idea to join X-rated site OnlyFans to fund her upcoming tour\n\nBritain's favourite TV shows revealed - and the surprising 1980s rib-tickling sitcom that millennials hate!\n\nWilliam and Kate share heartwarming message with Kevin Sinfield - as he kicks off gruelling charity challenge in memory of late friend Rob Burrow\n\nX Factor icon Janet Devlin opens up about her eating disorder and alcohol battle after finding fame at 16 on the ITV show\n\nStrictly Come Dancing fans slam Tess Daly for her 'embarrassing' comment to show favourite Chris McCausland\n\nSnack like a celeb! We try A-listers' weirdest food choices, from Amanda Holden's hard-boiled eggs to Selena Gomez's spicy popcorn \n\nZara Tindall takes on final leg of charity cycle challenge - in memory of late eventing rider Caroline March\n\nJacob Rees-Mogg's 'strangely addictive' new reality show is compared to 'The Addams Family' by unimpressed locals ahead of its premiere\n\nCoronation Street's Sean Wilson reveals he was axed from the soap over unfounded historic sex claim as he says 'his reputation was ruined in eight minutes'\n\nDenise Van Outen reveals why she wants to stay single after enjoying a wild 'hedonistic' summer partying and flirting with a Hollywood star\n\nRebel Wilson reveals heartbreaking news just days after celebrating Thanksgiving with her young family\n\nI'm A Celebrity's Jane Moore shares what she really thinks of Coleen Rooney and reveals which campmate she wants to see in the final\n\nInside Russell Crowe's harbourfront Sydney apartment as he quietly lists it for an eye-watering $50million\n\nEXCLUSIVERevealed: Why Strictly star Pete Wicks put a stop to his romantic liaison with dance partner Jowita Przystal\n\nEXCLUSIVEEthan Slater 'concerned' for Ariana Grande as fans raise fears over Wicked star's new look\n\nDolph Lundgren, 67, seen for the first time with wife Emma Krokdal, 28, since revealing he is cancer free\n\nAngelina Jolie says being a parent is 'everything' to her amid ongoing divorce battle with Brad Pitt\n\nBen Affleck looks downcast on solo outing after spending Thanksgiving with ex-wife Jennifer Garner\n\nI'm A Celebrity in chaos as Ant and Dec reveal fears the live show would be AXED as torrential rain continues to batter the camp\n\nKate Middleton's poignant message of hope and the importance of love in 'our darkest of times' to guests at her carol concert \n\nCelebrity Apprentice 'is set to RETURN in 2025 to celebrate show's 20th anniversary - with bosses hoping to sign Cheryl and Piers Morgan'\n\nHarry blew Meghan away when he whisked her off to Botswana on a 'starry-eyed' luxury safari for their third date... but she was actually the FOURTH girl he had taken there \n\nEXCLUSIVEI'm A Celebrity's Dean McCullough faced accusations of 'bullying' from production staff on BBC Radio 1 show\n\nWhat the stars of iconic fitness show Aerobics Oz Style look like now\n\nEXCLUSIVEAdele is 'disillusioned with Hollywood' and hunting for new home outside America\n\nKacey Musgraves calls out fan who grabbed her during Tampa concert: 'She ruined it for everybody'\n\nEXCLUSIVEPrincess Beatrice's 'dear friend' nutritionist Gabriela Peacock reveals how she's supporting the royal through her second pregnancy \n\nThe day Prince William's godmother got embroiled in a racism row: Two years ago today Lady Susan Hussey was accused of asking a black British woman 'Where are you really from?' \n\nDancing On Ice's future is thrown into doubt as judges Jayne Torvill and Christopher Dean reveal they are ready to retire \n\nJordana Brewster pays tribute to Fast & Furious co-star Paul Walker on 11th anniversary of his death\n\nStrictly fans predict Pete Wicks will be the next star sent home after major misstep during Musicals Week: 'Surely his luck has run out now'\n\nSelena Gomez breaks silence on boyfriend Benny Blanco featuring in People's 2024 Sexiest Man Alive issue\n\nNicole Scherzinger passionately kisses co-star Tom Francis in steamy moment during their Sunset Boulevard performance \n\n00-heaven! Inside the real spectacular locations used in James Bond blockbusters from mountain top lair to a tropical island\n\nWicked star Marissa Bode calls out shocking response to her disabled character Nessarose\n\nKanye West and Bianca Censori cause a stir when they step out in Tokyo as the rapper avoids his many legal troubles\n\nSean Penn's girlfriend Valeria Nicov, 30, models flowy gown as she and actor, 64, make red carpet debut\n\nActress Selma Blair left shocked as she's mistaken for an A-list pop star by airport security\n\nColeen Rooney's brother Joe reveals the sweet reason why the I'm A Celebrity star is determined to be crowned Queen of the Jungle\n\nJames Argent reveals he's moving in with his girlfriend Nicoline Artursson and they already 'want a family' just four months after they met \n\nPink sends fans wild as she shares rare photo with her 'handsome' brother\n\nKatie Price's former flame Kris Boyson says he will 'fight' any of her exes after narrowly avoiding Carl Woods and Kieran Hayler at Christmas event\n\nTaylor Swift reacts to Josh Allen and Hailee Steinfeld's engagement - as fans urge Travis Kelce to be next\n\nStrictly's Dianne Buswell breaks down in tears as she pays tribute to dance partner Chris McCausland after his incredible Quickstep\n\nKatie Holmes shows off her chic winter style as daughter Suri, 18, bundles up on a solo stroll in NYC\n\nMartha Stewart, 83, admits she doesn't know how to check her Instagram DMs\n\nTom Sandoval breaks silence on shock Vanderpump Rules recasting... after announcing closure of his LA bar\n\nRupert Everett lashes out at the cultural appropriation 'bulls***' taking over acting and fears the 'activists are in charge\n\nRupert Grint's HUGE net worth is revealed as the Harry Potter actor is ordered to pay £1.8million tax bill after losing HMRC case\n\nJustin Timberlake cancels Oklahoma tour stop with just DAYS notice due to injury\n\nI'm A Celebrity's Danny Jones is saddled with two sets of chores to do after new camp leaders are chosen\n\nGwyneth Paltrow and her lookalike daughter stroll through Paris during shopping trip... and the proof you're never too old to hold mum's hand\n\nMoana 2, Wicked and Gladiator II boost Black Friday box office ticket sales to historic heights\n\nI warned TV bosses about 'disgusting' Gregg Wallace 16 years ago but they ignored me, claims ex-MasterChef hopeful\n\nStrictly's Tasha Ghouri is forced to overcome wardrobe malfunction as her cochlear implant FALLS OUT in the middle of her performance\n\nBBC bosses let Gregg Wallace continue to work on MasterChef despite top exec's warning over his sexist behaviour on set \n\nKim Kardashian under fire for reinstating son Saint's YouTube account despite anti Kamala Harris posts\n\nEXCLUSIVETALK OF THE TOWN: Tory peer Zac sells £8m manor to set up home with model fiancée Hum\n\nTALK OF THE TOWN: Keira Knightley takes sweet revenge on critics who thought her 'stupid' for not going to university by taking up online degree in secret\n\nRead Kate's emotional letter in full: Princess of Wales invites lucky guests to her Westminster Abbey concert\n\nGwen Stefani gives fans rare insight into her personal life and motherhood: 'It's not what you think it will be like'\n\nStrictly's Carlos Gu is forced to PULL OUT of Christmas Special following an ankle injury - and a replacement has already stepped in\n\nLily Allen admits her alcohol addiction was so severe she can't remember having sober sex until she reached her 30s\n\nJordan North takes a brutal swipe at his former Radio 1 show as he boasts about rise in Capital listening figures during Saturday Kitchen appearance\n\nI'm A Celebrity's Coleen Rooney hits back at 'WAG' label as Dean McCullough brings up title \n\nI'm A Celebrity's Oti Mabuse details the vile abuse she received from 'mum-shaming trolls' after she returned to Dancing On Ice following the birth of her baby daughter\n\nFrom glitterball dreams to comedy screens: Strictly star Sarah Hadland planning dance sitcom with Car Share writer\n\nInside story of the Groucho Club closure and allegations of a troubling crime that could be the reason police shut the infamous celebrity-filled Soho haunt\n\nStrictly fans fume that Montell Douglas was 'set up to fail' with the 'wrong dance and song' as the judges slam her Rumba for being 'too slow'\n\nI'm A Celebrity's Tulisa Contostavlos and Reverend Richard Coles fight back TEARS in gruesome eating trial\n\nStrictly fans are left outraged by one couples' scores as they insist the judges have a 'vendetta' against them\n\nStrictly Come Dancing RECAP: Pete Wicks lands in the bottom as viewers spot famous audience member \n\nInside Gok Wan's swanky Georgian house: Fashion guru shows off his quirky property after overcoming childhood struggles \n\nStrictly's Shirley Ballas looks unrecognisable as she transforms into Miss Trunchbull for Musicals Week: 'Bravest judge outfit ever!'\n\nHe's an Oscar-winning actor and director worth $400m (and there's a Friends link!)... can you guess who it is?\n\nJessica Alba showcases her tanned and toned curves as she enjoys the beach in Puerto Vallarta\n\nJuice Wrld's posthumous album The Party Never Ends slammed by fans: 'It sounds like AI'\n\nMonica Bellucci, 60, wows in a red crochet jumpsuit as she and partner Tim Burton, 66, attend ceremony to honour Sean Penn \n\nVictoria's Secret Angel Lais Ribeiro welcomes baby with husband Joakim Noah: 'Thankful for my family'\n\nMoana 2 actress Auli'i Cravalho reveals incredible gift she was able to give mom after success\n\nLet me strip off! Margot Robbie reveals why she insisted on full-frontal nudity in The Wolf of Wall Street\n\nEXCLUSIVEEllen DeGeneres' Cotswolds dream is submerged: Hollywood star's idyllic multi-million-pound farmhouse is hit by floods with surrounding fields underwater\n\nSalma Hayek rocks a fedora as she takes a smoke break while bargain hunting on Black Friday in Los Angeles\n\nUlrika Jonsson looks downcast while on a dog walk as she is seen for the first time since accusing Gregg Wallace of making 'rape joke' that 'distressed' MasterChef contestant\n\nGeri Horner is seen for the first time since 'sparking fresh Spice Girls feud by derailing lucrative deal' as she attends Lionesses' friendly\n\nEXCLUSIVEI'm A Celebrity's Barry McGuigan wins support from his local MP Rosie Duffield who praises his 'character' and for 'working hard' in camp\n\nEXCLUSIVEWho Pete Wicks REALLY prefers in Maura Higgins and Jowita 'love triangle', according to a body language expert\n\nTop designer claims Diddy dangled her off 17th-story balcony and threatened to kill her\n\nStrictly's Tasha Ghouri is effortlessly stylish in a white faux fur coat as she joins fellow stars arriving in London ahead of musicals week\n\nDwayne 'The Rock' Johnson reveals adorable Christmas tradition he shares with his daughters\n\nJust why IS John Torode keeping so quiet? TV insiders reveal truth about his and Gregg Wallace's 'friendship' to KATIE HIND\n\nJames Van Der Beek sells merch from his 1999 classic Varsity Blues to help pay for his cancer treatments\n\nEXCLUSIVEThe moment it all went south for East 17: How the 90s icons went from topping the charts to homeless and in a bitter fallout \n\nAJ Pritchard arrives hand-in-hand with influencer girlfriend Zara Zoffany at Annabel's for date night - after ex Abbie took a savage swipe\n\nThe Traitors' Charlotte Chilton shares her pride for her newborn amid tot's 'medical issues' as she gives new health update after claiming Conor Maynard still hasn't met their baby\n\nEXCLUSIVEI'm A Celeb's Maura Higgins and Reverend Richard Coles to team up for their own show as fans go wild for the pair's sweet jungle friendship\n\nPregnant Montana Brown reveals she was taken to hospital after being struck down with illness as she shares her relief that son, 17 months, didn't catch it\n\nAll the things that are FAKE in your favourite Christmas films! Obvious plot holes and filming secrets that you won't be able to unsee in these festive classics\n\nPenny Lancaster and Rod Stewart are seen for the first time since her husband issued furious rant at 'tubby bully' Gregg Wallace\n\nChristine McGuiness shows off her toned figure in a skin-tight burgundy maxi dress as she poses for sizzling clip\n\nEXCLUSIVELord Alan Sugar's rags to riches story set to become a must-watch television series - but who will play him?\n\nLiam Payne had put his £3.2million five-bed Buckinghamshire mansion up for sale in the month before he died\n\nHer mum is a TV icon and adored by Brits - but can you guess whose bikini clad celebrity daughter this is?\n\nEXCLUSIVEThe prim private schoolgirl who ditched strict Catholic upbringing for Netflix fame... before her world came crashing down when she was caught drug-smuggling\n\nTOWIE's Ella Rae Wise, 24, and Dan Edgar, 34, pack on the PDA while filming Christmas special - after 'secretly SPLITTING amid showmance claims'\n\nDec Donnelly is left red-faced and in tears after making a VERY unfortunate innuendo on I'm A Celeb Unpacked as the team are left in hysterics\n\nThe devastating downfall of Jeremy Jackson: How the Baywatch heartthrob, 44, has been blighted by addiction, jail stints and a shock reality TV axe\n\nGemma Chan looks elegant in a smart black coat as she and boyfriend Dominic Cooper celebrate her 42nd birthday at Chiltern Firehouse\n\nInside Bob Bryar's life after My Chemical Romance: From battles with depression to new job as real estate agent as drummer is found dead aged 44\n\nNetflix fans left 'bawling like babies' by 'best movie ever' - raving 'I still get goosebumps after watching it three times'\n\nFrankie Bridge shows her incredible figure in a strapless dress as she enjoys a girls night out in Mayfair - after revealing 17 year health battle\n\nAlja korjanec reveals the REAL reason he returned to Strictly as he insists 'I replaced nobody'\n\nLily Allen admits that self-medicating was always 'going to be on the cards' for her because addiction 'runs deep' in her family\n\nMy Chemical Romance drummer Bob Bryar found dead at his home at age 44\n\nI'm A Celebrity's Reverend Richard struggles to swallow a huge fish eye while Tulisa looks on in disgust in first look at latest Bushtucker Trial\n\nLiam Gallagher reveals MAJOR hint for Oasis line up next summer as he 'confirms' who is returning to the guitar\n\nKris Jenner, 69, stuns fans with very youthful appearance in Thanksgiving photos with Khloe Kardashian\n\nDanny Cipriani cuts concerned figure but estranged wife Victoria walks off SMILING amid couple's bitter divorce battle\n\nPoppy Delevingne bundles up in a black oversized padded jacket and skintight yoga pants as she grabs sweet treats in Notting Hill\n\nLizzo shows off dramatic weight loss on Thanksgiving amid Ozempic rumors\n\nWho left I'm A Celeb? Loose Women's Jane Moore take swipe at fellow campmates and says 'hard work does not get rewarded' as she becomes first star to leave the jungle\n\nJoe Jonas cuts a stylish figure in a brown jacket and low-cut vest as he heads for drinks at Chiltern Firehouse\n\nZayn Malik pays heartfelt tribute to 'brother' Liam Payne on stage in the late One Direction star's hometown of Wolverhampton\n\nI wanted to die after starring on the world's sickest reality show - I spent 15 months in solitary confinement while producers secretly broadcast me\n\nI'm A Celeb's Jane Moore gleefully arrives at the hotel before being greeted by campmates' loved ones after being the FIRST star to be booted from the jungle\n\nRuth Langsford is 'gutted' for Jane Moore and says she makes 'great point' about 'showmen' campmates getting all the attention on I'm A Celebrity\n\nI'm A Celebrity's Coleen Rooney shares struggles of having two 'horrible' miscarriages before revealing the secret meaning behind her children's names\n\nGregg Wallace is accused of groping three women in bombshell new claim - as former MasterChef winner Emma Kennedy says she reported him 12 years ago \n\nLindsay Lohan flaunts smooth visage in new selfie after dad confirmed she HAS had cosmetic treatments\n\nJennifer Lopez shakes off Ben Affleck's cozy Thanksgiving with ex-wife Jennifer Garner as she shops in LA\n\nI'm A Celeb viewers left 'heartbroken' as ITV show scraps iconic segment\n\nDeadpool & Wolverine's cut X-rated joke finally revealed after Ryan Reynolds said he'd 'take it to his grave'\n\nEDEN CONFIDENTIAL: Naomi Campbell fights charity ban with 'bombshell' new evidence after watchdog found failings at fashion organisation\n\nTaylor Swift fans go wild as she MATCHES with Travis Kelce's mom Donna for Chiefs game\n\nAshley Cain becomes a father again! Star reveals he's welcomed a baby boy named Atlas a month early - and shares a sweet tribute to late daughter Azaylia\n\nSelena Gomez takes her younger sister Gracie, 11, Black Friday shopping in Los Angeles\n\nMakeup-free Kate Hudson gives a glimpse at family's Thanksgiving getaway to NYC\n\nBen Affleck 'felt blessed' to spend cozy Thanksgiving with ex Jennifer Garner amid Jennifer Lopez divorce\n\nI'm A Celebrity star Danny Jones' wife Georgia reveals his biggest fear after he kept it a secret from bosses\n\nI'm A Celeb fans brand Dean 'pathetic' amid 'crumpet gate' after he steals food from rival campmates and leaves seething Tulisa ready to 'start a war'\n\nMichael Fassbender and Keira Knightley leave viewers in hysterics with hilarious tales of 'spanking' as they reunite on Graham Norton 13 years after starring in iconic film\n\nWatch the moment Gregg Wallace touches his crotch and declare he 'never wears underwear' during Strictly rehearsals \n\nPregnant Charlotte Dawson says trolls called social services and falsely accused her of neglecting her children and giving her son, 3, alcohol\n\nI'm A Celebrity fans are left 'in tears' after Danny Jones makes emotional confession to Barry McGuigan during heartwarming speech\n\nGigi Hadid is the spitting image of her supermodel mom Yolanda in BTS from Holland's Next Top Model\n\nStrictly star JB Gill admits wife Chloe Tangney is 'so jealous' of him dancing with pro partners Amy Dowden and Lauren Oakley - but NOT because of the show's infamous curse\n\nI'm A Celebrity's Oti Mabuse 'tipped for a HUGE new TV show after impressing bosses with her moving jungle chats'\n\nJoanna Page admits that bidding farewell to Gavin and Stacey with final Christmas Special 'felt like grieving' as she poses for stunning shoot with Woman&Home\n\nLisa Barlow's unfiltered red carpet appearance sparks furious fan reaction over RHOSLC onscreen retouching\n\nLoose Women's Frankie Bridge reveals crippling health battle that landed her in hospital - admitting 'I've tried everything but treatment doesn't work'\n\nGregg Wallace is accused of 'racism' after allegedly saying 'me so horny' about Asian MasterChef contestant and making 'kung fu noises'\n\nIt's not quite the Kardashians. Or the Furys. But these Rees-Moggs are strangely addictive, writes JANE FRYER\n\nJana Kramer reveals if she will reprise her role for upcoming One Tree Hill revival\n\nJoe Rogan reacts to wild claim Diddy 'poisoned' Jamie Foxx causing his 2023 hospitalization\n\nTaylor Swift poses with Chiefs WAGs in VIP suite as they celebrate dramatic win over Raiders\n\nRosie Huntington-Whiteley goes braless in a sexy white crop top as she shows off her model physique in cosy loungewear\n\nI'm A Celebrity's Maura Higgins leaves viewers in stitches as she misunderstands Richard Coles' 'exorcism' comment\n\nCheery Katie Holmes heads back to Broadway after Thanksgiving break with daughter Suri Cruise\n\nEastEnders spoilers: Drunk Linda risks losing everything and Big Mo strips naked for charity calendar\n\nEmmerdale spoilers: Cain is arrested and Moira is abandoned at hospital in cheating twist\n\nCoronation Street spoilers: Baby Frankie goes missing and Shona injured in horror car accident\n\nArnold Schwarzenegger's LA home 'swatted' on Thanksgiving Day after prankster makes bomb threat to police\n\nMiley Cyrus blames mom Tish for controversial pole dancing-inspired 2009 performance at age 16\n\nDemi Moore gives shocking Hot Ones interview that has gobsmacked fans all saying the same thing\n\nMonica Bellucci, 60, stuns in a dramatic black caped gown as she joins her partner Tim Burton, 66, at the Marrakech International Film Festival\n\nMinnie Driver, 54, praised by fans for sharing make-up free snaps despite admitting she's 'pretty vain'\n\nHailee Steinfeld is engaged! Actress' NFL star boyfriend reveals they are set to tie the knot in stunning snaps\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"An Emmerdale actress has reportedly quietly quit the soap - and their exit date has been revealed.","url":"https://www.dailymail.co.uk/tv/article-14146809/Emmerdale-actress-quietly-quits-soap-exit-date-revealed-rollercoaster-storyline.html","image":"https://i.dailymail.co.uk/1s/2024/12/02/00/92682717-0-image-m-220_1733099507603.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/01/17/8412823042084811529/1024x576_MP4_8412823042084811529.mp4","publish_date":"2024-12-02 00:48:28","author":"Amelia Wynne,Editor","authors":["Amelia Wynne","Editor"],"language":"en","category":"entertainment","source_country":"gb","sentiment":-0.121},{"id":269536728,"title":"Hunter Biden: President Joe Biden pardons son after ‘miscarriage of justice’","text":"President Joe Biden has issued a presidential pardon to his son Hunter Biden.\n\nThe democratic leader, who will end his presidency when Donald Trump assumes power in January, has previously maintained that he would not issue a pardon to his son over gun and tax evasion charges.\n\nOn Monday, Mr Biden issued a statement confirming the pardon to the White House website.\n\n“Today, I signed a pardon for my son Hunter,” he said.\n\n“From the day I took office, I said I would not interfere with the Justice Department’s decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted.\n\n“Without aggravating factors like use in a crime, multiple purchases, or buying a weapon as a straw purchaser, people are almost never brought to trial on felony charges solely for how they filled out a gun form.\n\n“Those who were late paying their taxes because of serious addictions, but paid them back subsequently with interest and penalties, are typically given non-criminal resolutions. It is clear that Hunter was treated differently.\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election.\n\n“Then, a carefully negotiated plea deal, agreed to by the Department of Justice, unraveled in the court room – with a number of my political opponents in Congress taking credit for bringing political pressure on the process. Had the plea deal held, it would have been a fair, reasonable resolution of Hunter’s cases.\n\n“No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son – and that is wrong.\n\n“There has been an effort to break Hunter – who has been five and a half years sober, even in the face of unrelenting attacks and selective prosecution. In trying to break Hunter, they’ve tried to break me – and there’s no reason to believe it will stop here.\n\n“Enough is enough.”\n\nMr Biden said for his entire career he has followed a simple principle: “Just tell the American people the truth.”\n\n“They’ll be fair-minded.\n\n“Here’s the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice – and once I made this decision this weekend, there was no sense in delaying it further.\n\n“I hope Americans will understand why a father and a President would come to this decision.\n\nThe timing of Mr Biden’s apparent presidential pardon flip comes days before his son Hunter is set to be sentenced.\n\nSentencing for his conviction on federal gun charges is set for December 12 and his tax evasion on December 16.\n\nMore to come...","summary":"President Joe Biden has pardoned his son Hunter, saying ‘I hope Americans will understand why a father and a President would come to this decision.’","url":"https://thewest.com.au/politics/world-politics/hunter-biden-president-joe-biden-pardons-son-after-miscarriage-of-justice-c-16944676","image":"https://images.thewest.com.au/publication/C-16944676/22943c91fe8ca20a21ff2577a488dca28bab39af-16x9-x0y75w800h450.jpg?imwidth=1200","video":null,"publish_date":"2024-12-02 00:47:51","author":"Max Corstorphan","authors":["Max Corstorphan"],"language":"en","category":"politics","source_country":"au","sentiment":-0.436},{"id":269534664,"title":"Nancy Pelosi Orchestrating A Shake Up Of Democratic Leadership N2648478","text":"After playing a significant role in the coup against outgoing President Joe Biden, former House Speaker Nancy Pelosi (D-CA) is back doing what she knows best: plotting another ouster within the Democratic Party. \n\nAccording to a New York Times report, Pelosi seeks to shake up a critical House Committee. She is leading an effort to replace longtime Democrat Rep. Jerry Nadler (D-NY) as a ranking member of the House Judiciary Committee. She is quietly urging Rep. Jamie Raskin (D-CA) to challenge Nadler, and according to reports, he is strongly considering it. \n\nHowever, the NYT pointed out that Nadler and Raskin’s close friendship stands in the way. \n\nRaskin is a loyalist in Democrat's eyes. He played a leading role in pushing several hoaxes, including the bogus Russian disinformation claims involving President-elect Donald Trump. He also suggested he would refuse to certify Trump’s 2024 win. \n\nThe report alleges that Pelosi is concerned that the Democratic Party’s current leadership is not suited to take on Trump’s agenda and his allies in Congress. \n\nAlthough Raskin has not publicly announced his candidacy, Nadler has already hit the ground running, eager to hold on to his position. Nadler proudly said he led the Judiciary Committee’s efforts of two impeachments against Trump. The NYT also highlighted an additional advantage Raskin brings: his skill in engaging in impromptu debates. The report noted that House Democrat leaders are staying neutral for now.\n\nHowever, with current House Judiciary Committee Chair Jim Jordan (R-OH) being a staunch ally of Trump, Democratic efforts to block House investigations must go through his committee.\n\nSeventy-six-year-old Rep. Raúl Grijalva (D-AZ) and 79-year-old Rep. David Scott (D-GA) are also facing challenges from younger candidates who are vying for their seats. \n\nIn Jonathan Alter’s new book, American Reckoning, Pelosi was reportedly furious that the “only bloody fingerprints on the knife were hers” after Biden was forced out of the race. As a result, she is orchestrating the ousting of Nadler more carefully.","url":"https://townhall.com/tipsheet/saraharnold/2024/12/01/nancy-pelosi-orchestrating-a-shake-up-of-democratic-leadership-n2648478","image":"https://media.townhall.com/cdn/hodl/2024/234/52348a86-ded2-4a31-8afa-3e1e3ca6a935.jpg","video":null,"publish_date":"2024-12-02 00:47:32","author":"Sarah Arnold","authors":["Sarah Arnold"],"language":"en","category":"politics","source_country":"us","sentiment":-0.031},{"id":269534394,"title":"Us President Elect Donald Trump Appoints Daughter Tiffanys Father In Law As Advisor On Middle East Affairs 2643265 2024 12 02","text":"US President-elect Donald Trump on Sunday said Lebanese American businessman Massad Boulos would serve as senior adviser on Arab and Middle Eastern affairs.Trump made the announcement on Truth Social. Boulos, the father-in-law of Trump's daughter Tiffany, met repeatedly with Arab American and Muslim leaders during the election campaign. It was the second time in recent days that Trump chose the father-in-law of one of his children to serve in his administration.On Saturday, Trump said that he had picked his son-in-law Jared Kushner's father, real estate mogul Charles Kushner, to serve as US ambassador to France.In recent months, Boulos campaigned for Trump to drum up Lebanese and Arab American support, even as the US-backed Israel's military campaign against Hezbollah in Lebanon. Boulos has powerful roots in both countries.His father and grandfather were both figures in Lebanese politics and his father-in-law was a key funder of the Free Patriotic Movement, a Christian party aligned with Hezbollah.His son Michael and Tiffany Trump were married in an elaborate ceremony at Trump's Florida Mar-a-Lago Club in November 2022, after getting engaged in the White House Rose Garden during Trump's first term.Boulos has been in touch with interlocutors across Lebanon's multipolar political world, three sources who spoke to him in recent months say, a rare feat in Lebanon, where decades-old rivalries between factions run deep.Particularly notable is his ability to maintain relations with Hezbollah, they say. The Iranian-backed Shi'ite Muslim party has a large number of seats in Lebanon's parliament and ministers in the government.Boulos is a friend of Suleiman Frangieh, a Christian ally of Hezbollah and its candidate for Lebanon's presidency. He is also in touch with the Lebanese Forces Party, a vehemently anti-Hezbollah Christian faction, the sources say, and has ties to independent lawmakers.Aron Lund, fellow at the Century Foundation think tank, said Boulos was well-placed to influence Trump's Middle East policy after playing a small but significant role in expanding Trump's appeal to Arab American and Muslim voters during the campaign.\"Boulos' Lebanese political past gives no real indication of a geostrategic or even national vision, but it demonstrates ambition and a set of political allies that will stand out in Trump's circle like a sore thumb,\" Lund wrote.MICHIGAN WINBoulos, a billionaire with extensive business ties in Nigeria, was born in Lebanon, but moved to Texas as a teenager, where he attended the University of Houston, earned a law degree and became a US citizen.His son and Trump's daughter, whose mother is Trump's second wife Marla Maples, met on the Greek island of Mykonos, at actor Lindsay Lohan's club, People Magazine reported in 2022.Trump's election win in Michigan came in part because of Boulos' help flipping some of the 300,000 Arab Americans and Muslims in the state who overwhelmingly supported Biden in 2020 but opposed Biden's policies in Israel, Gaza and Lebanon, Trump campaign officials and supporters told Reuters.\"Boulos played a big role in the outreach to Muslim voters,\" said Rabiul Chowdhury, co-founder of Muslims for Trump.Beginning in September, the Trump campaign held weekly meetings in person and via Zoom with dozens of Arab American and Muslim civic leaders and business executives.Boulos spent weeks on the ground in Michigan, Pennsylvania and other states with big Arab American and Muslim populations, assuring audiences in private lunches and dinners that tapped his own connections to Lebanese American businessmen that Trump was committed to ending the wars in the Middle East.The Trump campaign spent tens of millions of dollars on the effort to mobilise Arab American and Muslim voters, Boulos told Reuters in an interview shortly after the election.Trump won endorsements from Muslim imams and the Muslim mayor of Hamtramck, another town near Detroit with a large Arab American population, as well as the large Bangladeshi community, and courted Iraqi Americans, Albanian Americans and others.While the events on the ground in Lebanon played a factor, the economy did too. And conservative Arabs and Muslims were concerned about what they saw as the Democrats' \"far left ideology,\" including support of transgender rights, Boulos said. Boulos met with members of the 150,000 strong Albanian community in Michigan.POLITICAL AMBITIONS?The new role could offer Boulos the kind of political clout he could not achieve in Lebanon. He had a brief run for Lebanon's parliament in 2018 alongside pro-Hezbollah candidates, but since then he has not consistently aligned himself with any particular party, sources in Lebanon said. He hails from a Greek Orthodox family.In Lebanon's sectarian powersharing system, that would cap his chances at a senior role in government at the level of deputy speaker of parliament. The post of president - the highest Christian role in the country - is reserved for Maronite Catholics.While he used to travel to Lebanon frequently, he has not visited in the last four years, one of the sources said. Some people in Lebanon were hopeful about the prospects of having a friendly face in Trump's inner circle even before the announcement on Sunday.\"It's a nice thing - and hopefully he will work for Lebanon. And Trump maybe is of the type who makes a promise and could possibly be more loyal to it than others,\" said Hamdi Hawallah, a Lebanese man in his late 70s.\"So we're optimistic about him. These days we hold on to a piece of driftwood just to be optimistic.\"Published By: Nakul AhujaPublished On: Dec 2, 2024Must Watch","url":"https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-appoints-daughter-tiffanys-father-in-law-as-advisor-on-middle-east-affairs-2643265-2024-12-02","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202412/donald-trump-010839363-16x9.jpg?VersionId=mVyED2N9lr22sJ6Yo5xWeys9xGUz2Cch?size=1280:720","video":null,"publish_date":"2024-12-02 00:45:31","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":0.191},{"id":269536830,"title":"US President Joe Biden pardons his son Hunter despite repeatedly pledging he wouldn’t","text":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.independent.ie/world-news/us-president-joe-biden-pardons-his-son-hunter-despite-repeatedly-pledging-he-wouldnt/a1709668728.html","image":"https://focus.independent.ie/thumbor/3vbHwSIsivWuwqg6C-uj0u3MUP8=/0x0:960x640/550x550/prod-mh-ireland/43ba635b-6aa2-44d7-885c-d964f55556d7/6d6857a3-b123-46dc-a5b2-98a582f11d0d/43ba635b-6aa2-44d7-885c-d964f55556d7.jpg","video":null,"publish_date":"2024-12-02 00:45:12","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.593},{"id":269537082,"title":"Donald Trump appoints daughter Tiffany's father-in-law Massad Boulos as senior adviser on Middle East Affairs","text":"US President-elect Donald Trump announced on Sunday that he would appoint Massad Boulos, a Lebanese billionaire and father-in-law of his daughter Tiffany Trump, as his senior adviser on Arab and Middle Eastern affairs. Trump described Boulos as an accomplished lawyer and a respected business leader with extensive international experience. He highlighted Boulos' long-standing support for Republican and Conservative values, as well as his instrumental role in fostering strong relationships with the Arab American community during the campaign. I am proud to announce that Massad Boulos will serve as Senior Advisor to the President on Arab and Middle Eastern affairs. Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene. He has been a longtime proponent of Republican and Conservative values, an asset to my Campaign, and was instrumental in building tremendous new coalitions with the Arab American Community. Massad is a dealmaker and an unwavering supporter of PEACE in the Middle East. He will be a strong advocate for the United States, and its interests, and I am pleased to have him on our team! Trump said in a social media post on Truth Social. According to The Hill, this appointment is part of a broader trend of family connections in Trump's administration, with Trump previously announcing the nomination of Charles Kushner, the father of his son-in-law Jared Kushner, as ambassador to France.While Jared and Ivanka Trump had roles during the first term, they are not expected to return for Trump's second term, The Hill reported.Massad Boulos is the father of Michael Boulos, who married Tiffany Trump, the president-elect's youngest daughter, in 2022. Massad Boulos leads the family-owned automotive company, SCOA Nigeria. He is known for his efforts in Michigan, where he helped Trump gain support among Arab American voters, contributing to the president-elect's victory in the state. Boulos' role will likely be pivotal in shaping Trump's Middle East policies, especially in light of the ongoing conflict between Israel and Gaza following the October 7 Hamas attack on Israel.","summary":"US President-elect Donald Trump has appointed Massad Boulos, a Lebanese billionaire and father-in-law of his daughter Tiffany Trump, as his senior advisor on Arab and Middle Eastern affairs. Boulos, an accomplished lawyer and business leader, will play a pivotal role in shaping Middle East policies and fostering strong relationships with the Arab American community.","url":"https://economictimes.indiatimes.com/news/international/world-news/donald-trump-appoints-daughter-tiffanys-father-in-law-massad-boulos-as-senior-adviser-on-middle-east-affairs/articleshow/115880481.cms","image":"https://img.etimg.com/thumb/msid-115880484,resizemode-4,width-1200,height-900,imgsize-8890,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2024-12-02 00:43:05","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.385},{"id":269536672,"title":"Biden pardons his son Hunter despite previous promises that he would not do so","text":"WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family.\n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin.\n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction.\n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely.\n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.\n\nBy Zeke Miller and Alanna Durkin Richer Associated Press","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.cleveland.com/nation/2024/12/biden-pardons-his-son-hunter-despite-previous-promises-that-he-would-not-do-so.html","image":"https://www.cleveland.com/resizer/v2/XNOAP3LUFZHNZFZX43DEPFNZ3Q.jpg?auth=32025521934df08d9807cb4e03f411cc5516dc0a33f493364b8240023c834d79&width=1280&quality=90","video":null,"publish_date":"2024-12-02 00:41:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"US","sentiment":-0.323},{"id":269534384,"title":"Biden pardons his son Hunter despite previous promises that he would not do so","text":"WASHINGTON (AP) — President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News.\n\nAs recently as Nov. 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.nj.com/news/2024/12/biden-pardons-his-son-hunter-despite-previous-promises-that-he-would-not-do-so.html","image":"https://www.nj.com/resizer/v2/XNOAP3LUFZHNZFZX43DEPFNZ3Q.jpg?auth=32025521934df08d9807cb4e03f411cc5516dc0a33f493364b8240023c834d79&width=1280&quality=90","video":null,"publish_date":"2024-12-02 00:41:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.354},{"id":269534630,"title":"Biden pardons his son Hunter despite previous promises that he would not do so","text":"WASHINGTON (AP) — President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News.\n\nAs recently as Nov. 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.mlive.com/news/2024/12/biden-pardons-his-son-hunter-despite-previous-promises-that-he-would-not-do-so.html","image":"https://www.mlive.com/resizer/v2/XNOAP3LUFZHNZFZX43DEPFNZ3Q.jpg?auth=32025521934df08d9807cb4e03f411cc5516dc0a33f493364b8240023c834d79&width=1280&quality=90","video":null,"publish_date":"2024-12-02 00:41:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.354},{"id":269536834,"title":"Biden pardons his son Hunter despite previous promises that he would not do so","text":"WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family.\n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin.\n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction.\n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely.\n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.\n\nBy Zeke Miller and Alanna Durkin Richer Associated Press","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.oregonlive.com/nation/2024/12/biden-pardons-his-son-hunter-despite-previous-promises-that-he-would-not-do-so.html","image":"https://www.oregonlive.com/resizer/v2/XNOAP3LUFZHNZFZX43DEPFNZ3Q.jpg?auth=32025521934df08d9807cb4e03f411cc5516dc0a33f493364b8240023c834d79&width=1280&quality=90","video":null,"publish_date":"2024-12-02 00:41:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.323},{"id":269535430,"title":"Biden pardons his son Hunter despite previous promises that he would not do so","text":"WASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family.\n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin.\n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction.\n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely.\n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.\n\nBy Zeke Miller and Alanna Durkin Richer Associated Press","summary":"President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.","url":"https://www.syracuse.com/us-news/2024/12/biden-pardons-his-son-hunter-despite-previous-promises-that-he-would-not-do-so.html","image":"https://www.syracuse.com/resizer/v2/XNOAP3LUFZHNZFZX43DEPFNZ3Q.jpg?auth=32025521934df08d9807cb4e03f411cc5516dc0a33f493364b8240023c834d79&width=1280&quality=90","video":null,"publish_date":"2024-12-02 00:41:50","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.323},{"id":269537458,"title":"Joe Biden pardons son Hunter over gun and tax charges before leaving the White House despite previously pledging not to","text":"PRESIDENT Joe Biden has issued a pardon for his troubled son Hunter following gun charges.\n\nThe decision marks a reversal for the outgoing president who has repeatedly said that he would not pardon his son or commute his sentence.\n\nIn a statement released by the White House, Biden said: \"Today, I signed a pardon for my son Hunter. \n\n\"From the day I took office, I said I would not interfere with the Justice Departments decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted.\"\n\nHe added: \"For my entire career I have followed a simple principle: just tell the American people the truth. \n\n\"They’ll be fair-minded. Here’s the truth: I believe in the justice system, but as I have wrestled with this, I also believe raw politics has infected this process and it led to a miscarriage of justice – and once I made this decision this weekend, there was no sense in delaying it further.\"\n\n\"I hope Americans will understand why a father and a President would come to this decision.\"\n\nThe pardon comes ahead of Hunter Biden’s December 12 sentencing for his conviction on federal gun charges.\n\nHunter Biden was set to be sentenced in a separate criminal case on December 16, after pleading guilty in September on federal tax evasion charges.\n\nThe pardon spares the younger Biden from a possible prison sentence for federal felony gun and tax convictions.\n\nThe move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the presidents son, who publicly disclosed he was under federal investigation in December 2020 a month after Joe Bidens 2020 victory.\n\nIn June, as his son Hunter was facing trial in the gun case in Delaware, Biden ruled out a pardon or clemency for his son in an interview with ABC News.\n\nAs recently as November 8, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying: \"We've been asked that question multiple times. Our answer stands, which is no.\"\n\nFamily pardons are not unheard of in presidential history. Before he left office in January 2001, Bill Clinton granted brother Roger a controversial presidential pardon for a 1985 cocaine-trafficking conviction.\n\nTrump himself pardoned Charles Kushner, father of son-in-law and ex-advisor Jared, before leaving office in 2020. Kushner was just yesterday named the US ambassador to France.\n\nHunter Biden was previously found guilty on all charges of his federal gun trial in June.\n\nThe turbulent life of Hunter was thrown into the spotlight as a federal courtroom heard shocking testimony about his drug addiction, which spiraled out of control after the death of his brother, Beau Biden, in 2015.\n\nA 12-panel jury in Wilmington, Delaware, convicted Hunter, who chose not to testify in his defense, on all charges on Tuesday after deliberating for about three hours.\n\nHunter stared straight ahead and showed no emotion as the verdict was read.\n\nThe First Son shook hands with some of his associates seated in the gallery behind the defense table and hugged his attorneys, Abbe Lowell and David Kolansky, before kissing his wife, Melissa Cohen Biden.\n\n'NO ONE IS ABOVE THE LAW'\n\nProsecutors hammered the narrative that Hunter Biden knowingly lied on a firearm form about using drugs when he bought a gun nearly six years ago.\n\nFederal prosecutors said that on October 12, 2018, Hunter walked into the StarQuest Shooters & Survival Supply store in Wilmington and purchased a .38 Colt Cobra revolver.\n\nThe government said the president's son answered \"No\" to a question on the Bureau of Alcohol, Tobacco, Firearms and Explosives form that asked if he was using or was addicted to drugs or a controlled substance.\n\n\"The defendant knew he used crack and was addicted to crack at the relevant time period,\" prosecutor Leo Wise said during closing arguments.\n\n\"There is no evidence that anyone else possessed the gun from October 12 to October 23, other than the defendant,\" Wise added of the gun Hunter owned for 11 days.\n\nJurors heard punishing testimony from those closest to Hunter about his years of drug addiction.\n\nProsecutors even played audio excerpts from Hunter's 2021 memoir, Beautiful Things, in the courtroom, which described in the defendant's own words his trouble with drugs and his sobriety.\n\nMore to follow... For the latest news on this story, keep checking back at The U.S. Sun, your go-to destination for the best celebrity news, sports news, real-life stories, jaw-dropping pictures, and must-see videos.","summary":"","url":"https://www.thescottishsun.co.uk/news/13950451/joe-biden-set-to-issue-pardon-son-hunter/","image":"https://www.thescottishsun.co.uk/wp-content/uploads/sites/2/2024/12/newspress-collage-pvdlv0bx9-1733099792195.jpg?1733099896&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2024-12-02 00:37:47","author":"Vera Demertzis","authors":["Vera Demertzis"],"language":"en","source_country":"gb","sentiment":-0.331},{"id":269536938,"title":"Biden pardons his son Hunter despite previous pledges not to","text":"By ZEKE MILLER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family. \n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin. \n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction. \n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely. \n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.","summary":"By ZEKE MILLER and ALANNA DURKIN RICHER WASHINGTON (AP) &#8212; President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family [&#8230;]","url":"https://www.mercurynews.com/2024/12/01/biden-pardons-his-son-hunter-despite-previous-pledges-not-to/","image":"https://www.mercurynews.com/wp-content/uploads/2024/12/Biden_AIDS_Day_30758.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-02 00:37:18","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.323},{"id":269535816,"title":"Biden pardons his son Hunter despite previous pledges not to","text":"By ZEKE MILLER and ALANNA DURKIN RICHER\n\nWASHINGTON (AP) — President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members.\n\nThe Democratic president had previously said he would not pardon his son or commute his sentence after his convictions in the two cases in Delaware and California. The move comes weeks before Hunter Biden was set to receive his punishment after his trial conviction in the gun case and guilty plea on tax charges, and less than two months before President-elect Donald Trump is set to return to the White House.\n\nIt caps a long-running legal saga for the president’s son, who publicly disclosed he was under federal investigation in December 2020 — a month after Joe Biden’s 2020 victory.\n\nIn June, Biden categorically ruled out a pardon or commutation for his son, telling reporters as his son faced trial in the Delware gun case, “I abide by the jury decision. I will do that and I will not pardon him.”\n\nAs recently as Nov. 8, days after Trump’s victory, White House press secretary Karine Jean-Pierre ruled out a pardon or clemency for the younger Biden, saying, “We’ve been asked that question multiple times. Our answer stands, which is no.”\n\nIn a statement released Sunday evening, Biden said, “Today, I signed a pardon for my son Hunter,” alleging that the prosecution of his son was politically motivated and a “miscarriage of justice.”\n\n“The charges in his cases came about only after several of my political opponents in Congress instigated them to attack me and oppose my election,” Biden said. “No reasonable person who looks at the facts of Hunter’s cases can reach any other conclusion than Hunter was singled out only because he is my son.”\n\n“I hope Americans will understand why a father and a President would come to this decision,” Biden added, claiming he made the decision this weekend. The president had spent the Thanksgiving holiday in Nantucket, Massachusetts with Hunter and his family. \n\nHe was convicted in June in Delaware federal court of three felonies for purchasing a gun in 2018 when, prosecutors said, he lied on a federal form by claiming he was not illegally using or addicted to drugs.\n\nHe was set to stand trial in September in the California case accusing him of failing to pay at least $1.4 million in taxes. But he agreed to plead guilty to misdemeanor and felony charges in a surprise move hours after jury selection was set to begin. \n\nHunter Biden said he was pleading guilty in that case to spare his family more pain and embarrassment after the gun trial aired salacious details about his struggles with a crack cocaine addiction. \n\nThe tax charges carry up to 17 years behind bars and the gun charges are punishable by up to 25 years in prison, though federal sentencing guidelines were expected to call for far less time and it was possible he would avoid prison time entirely. \n\nHunter Biden said in an emailed statement that he will never take for granted the relief granted to him and vowed to devote the life he has rebuilt “to helping those who are still sick and suffering.”\n\n“I have admitted and taken responsibility for my mistakes during the darkest days of my addiction – mistakes that have been exploited to publicly humiliate and shame me and my family for political sport,” the younger Biden said.\n\nA spokesperson for special counsel David Weiss, who brought the cases, did not respond to messages seeking comment Sunday night.","summary":"WASHINGTON (AP) &#8212; President Joe Biden has pardoned his son, Hunter, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers of the presidency for the benefit of his family members. The Democratic president had previously said he would [&#8230;]","url":"https://www.bostonherald.com/2024/12/01/biden-pardons-his-son-hunter-despite-previous-pledges-not-to/","image":"https://www.bostonherald.com/wp-content/uploads/2024/12/Biden_AIDS_Day_30758.jpg?w=1024&h=683","video":null,"publish_date":"2024-12-02 00:37:18","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.323},{"id":269538130,"title":"Who Is Tiffany Trump Married To? Here’s Everything You Need To Know About Michael Boulos","text":"Donald Trump’s return as president-elect has brought renewed attention to his family, including his daughter Tiffany Trump. Tiffany, Donald’s only child with his ex-wife Marla Maples, has generally stayed out of the political spotlight.\n\nHowever, she did make appearances at the Republican National Conventions in 2016, 2020, and most recently in 2024 to support her father.\n\nTiffany is also embracing a new chapter in her personal life as she and her husband, Michael Boulos, prepare to welcome their first child.\n\nTiffany Trump’s Marriage to Michael Boulos\n\nMichael Boulos: Son of a Billionaire\nMichael Boulos, Tiffany’s husband since November 2022, comes from a wealthy background. Born in Lebanon and raised in Nigeria, he is the son of billionaire businessman Massad Boulos. The elder Boulos serves as the managing director and CEO of the SCOA Nigeria conglomerate, which deals in motor vehicles and equipment.\n\nMassad Boulos has also been politically active, supporting Donald Trump by engaging Arab American voters during campaign efforts in key states. Michael, often described as the heir to his father’s business empire, was featured in Vanity Fair for his affluent upbringing.\n\nView this post on Instagram\n\nA Love Story That Began in 2018\nThe couple was first seen together publicly in September 2018 at a New York fashion show. Tiffany later confirmed their relationship with an Instagram post in January 2019, where they posed in front of a Christmas tree at the White House.\n\nEngagement at the White House\nMichael proposed to Tiffany in January 2021, and she shared the news via Instagram. Her post expressed joy at celebrating the engagement at the White House, a location filled with family memories.\n\nA Fairytale Wedding\nTiffany and Michael tied the knot in November 2022 at Mar-a-Lago, Donald Trump’s estate in Palm Beach, Florida. The venue held sentimental value for Tiffany, as it was her childhood home. Her mother, Marla Maples, highlighted the significance of the location during interviews.\n\nThe bride wore an elegant, floor-length gown with a voluminous skirt and long sleeves. Reflecting on the event, Tiffany described it as “the most magical day” in an Instagram post showcasing wedding photos.\n\nIn October 2024, during a campaign event in Detroit, Donald Trump announced that Tiffany and Michael were expecting their first child. While speaking at the Detroit Economic Club, he praised his son-in-law and shared the exciting news about their growing family.\n\nAs Tiffany embarks on this new chapter, she continues to balance her family commitments with her low-profile public life.\n\nView this post on Instagram\n\nMUST READ: Who Is Massad Boulos? Tiffany Trump’s Father-In-Law Is Trump’s Senior Adviser On Middle Eastern Affairs","summary":"Michael Boulos, Tiffany’s husband since November 2022, comes from a wealthy background. Born in Lebanon and raised in Nigeria, he is the son of billionaire businessman Massad Boulos.\n\n\nThe post Who Is Tiffany Trump Married To? Here&#8217;s Everything You Need To Know About Michael Boulos appeared first on NewsX World.","url":"https://www.newsx.com/world/who-is-tiffany-trump-married-to-heres-everything-you-need-to-know-about-michael-boulos/","image":"https://www.newsx.com/wp-content/uploads/2024/12/tiffany.webp","video":null,"publish_date":"2024-12-02 00:37:13","author":"Ashish Kumar Singh","authors":["Ashish Kumar Singh"],"language":"en","source_country":"in","sentiment":0.407},{"id":269533248,"title":"New Eu Chiefs Visit Kyiv On First Day Of Mandate","text":"KYIV: The EU’s new top diplomat Kaja Kallas and head of the European Council Antonio Costa arrived in Kyiv Sunday in a symbolic show of support for Ukraine on their first day in office. “We came to give a clear message that we stand with Ukraine, and we continue to give our full support,” Costa told media outlets including AFP accompanying them on the trip. The European Union’s new leadership team is keen to demonstrate it remains firm on backing Kyiv at a perilous moment for Ukraine nearly three years into its fight against Russia’s all-out invasion.\n\nQuestions are swirling around the future of US support once Donald Trump assumes office in January and there are fears he could force Kyiv to make painful concessions in pursuit of a quick peace deal. Meanwhile, tensions have escalated as Russian President Vladimir Putin has threatened to strike government buildings in Kyiv with his new Oreshnik missile after firing it at Ukraine for the first time last month.\n\nThe Kremlin leader said the move is a response to Kyiv getting the green light to strike inside Russia with American and British missiles, and he has threatened to hit back against the countries supplying the weaponry. As winter begins Russia has also unleashed devastating barrages against Ukraine’s power grid and on the frontline Kyiv’s fatigued forces are losing ground to Moscow’s grinding offensive. “The situation in Ukraine is very, very grave,” Kallas, a former prime minister of Estonia, said. “But it’s clear that it comes at a very high cost for Russia as well.”\n\nThe new EU leaders — the bloc’s top officials along with European Commission chief Ursula von der Leyen—were set to hold talks with Ukraine’s President Volodymyr Zelensky. Zelensky on Friday appeared to begin staking out his position ahead of any potential peace talks. He called on NATO to offer guaranteed protections to parts of Ukraine controlled by Kyiv in order to “stop the hot stage of the war”, and implied he would then be willing to wait to regain other territory seized by Russia.\n\n“If we speak ceasefire, (we need) guarantees that Putin will not come back,” Zelensky told Britain’s Sky News. Kallas said that “the strongest security guarantee is NATO membership”. “We need to definitely discuss this—if Ukraine decides to draw the line somewhere then how can we secure peace so that Putin doesn’t go any further,” she said.\n\nDiplomats at NATO say there appears little prospect of the alliance granting Ukraine membership soon given opposition from a raft of members cautious of getting dragged into war with Russia. Kallas said the EU “shouldn’t really rule out anything” in terms of the question of sending European troops to help enforce any ceasefire. “We should have this strategic ambiguity around this,” she said.\n\n‘Transactional language’\n\nTrump has cast doubt on continuing Washington’s vast aid for Ukraine and called on EU countries to do more. Europe together has spent around $125 billion on supporting Ukraine since Russia’s 2022 invasion, while the United States alone has coughed up over $90 billion, according to a tracker from the Kiel Institute. Kallas said the EU would use a “transactional language” to try to convince Trump that backing Kyiv was in the interest of the US.\n\n“Aid for Ukraine is not charity,” she said. “A victory for Russia definitely emboldens China, Iran, North Korea.” The new EU foreign policy chief said the bloc would continue seeking to put Ukraine in the “strongest” position — if and when Kyiv chose it was time to negotiate with Moscow. But she conceded that it was becoming “increasingly difficult” for the 27-nation bloc to agree on new ways to ramp up support for Ukraine. “This war has been going on for quite some time and it is harder and harder to explain it to our own people,” she said. “But I don’t see any option.” – AFP","url":"https://kuwaittimes.com/article/21785/world/europe/new-eu-chiefs-visit-kyiv-on-first-day-of-mandate/","image":"https://kuwaittimes.com/kuwaittimes/uploads/images/2024/12/01/186223.jpg","video":null,"publish_date":"2024-12-02 00:36:31","author":"Kuwait Times","authors":["Kuwait Times"],"language":"en","source_country":"kw","sentiment":-0.006},{"id":269534868,"title":"I'm A Celeb in chaos as bosses 'forced to draw up evacuation plan for camp' following more torrential rain - after flooding nearly forced live show AXE","text":"Black Friday\n\nStrictly Come Dancing\n\nGreat British Bake Off\n\nPrivacy Policy\n\nMonday, Dec 2nd 2024\n\n5-Day Forecast\n\nAdvertisement\n\nI'm A Celeb in chaos as bosses 'forced to draw up evacuation plan for camp' following more torrential rain - after flooding nearly forced live show AXE\n\n Have YOU got a story? Email tips@dailymail.com\nBy GERAINT LLEWELLYN FOR MAILONLINE \n Published:00:34 GMT, 2 December 2024 |Updated:00:34 GMT, 2 December 2024 \n\nI'm A Celebrity... Get Me Out Of Here! bosses are said to have been forced to draw up an evacuation plan for camp following more torrential rain.\nIt comes after hosts Ant McPartlin and Declan Donnelly revealed they almost had to call Saturday's live show due to the stormy weather.\nNow a source told The Sun: 'All the campmates are fine, but producers monitored them on Saturday night as the storm worsened. The crew were struggling to make it on site. \n'At one point there was genuine concern about how much they would be able to, fortunately, it calmed down a bit and all was OK.'\nMailOnline have contacted ITV for comment. \n\nI'm A Celebrity... Get Me Out Of Here! bosses are said to have been forced to draw up an evacuation plan for camp following more torrential rain\n\nIt comes after hosts Ant McPartlin and Declan Donnelly revealed they almost had to call Saturday's live show due to the stormy weather\nDuring Saturday's instalment of the ITV show, the campmates looked downcast as storms battered the camp, and it appears the conditions have also thrown filming into chaos.\nPresenters Ant and Dec, both 49, joined Joel Dommett, 39, on the spin-off show Unpacked, and revealed that they almost missed filming on the latest episode due to the severe weather. \nSpeaking about the torrential rain, Joel told viewers: 'It's really loud here' as he pointed towards the rainstorm. \nJoel then said to both hosts: 'We should talk about the fact that we almost didn't make it in today.'\nDec shared: 'I mean, we've had a very dramatic morning,' as Ant explained: 'We all got texts this morning saying the rain is so bad you might not even make it in today.' \nDec added: 'Well my text was from Joel, I woke up this morning and the first message on my phone was him going 'This is so exciting'. Everyone was stopped from coming on-site because the rain was so bad.' \nJoel confessed: 'I left my hotel, my wife's here and she doesn't trust me with the key. I left the hotel without a key and then I got a text saying 'You're not coming in for a bit' and then I sat outside my hotel for about two hours in the rain.'\nDec admitted that the weather became 'biblical' during the night - leaving them unsure as to whether filming would go ahead or not. \n\nNow a source said: 'All the campmates are fine, but producers monitored them on Saturday night as the storm worsened. The crew were struggling to make it on site\n\nDuring Saturday's instalment of the ITV show, the campmates looked downcast as storms battered the camp, and it appears the conditions have also thrown filming into chaos \n\nPresenters Ant and Dec, both 49, joined Joel Dommett , 39, on the spin-off show Unpacked, and revealed that they almost missed filming today's episode due to the severe weather\n\nHe shared: 'It was a bit of an effort to get the show on air today, there were only a few people here because we couldn't get on site.' \nWhile Ant revealed: 'It's only been this bad once before and we all nearly got trapped on site and a lot of people couldn't leave for ages.' \nAlthough the weather began to improve, there is still some uncertainty over Sunday's Bushtucker Trial. \nJoel asked the hosts: 'What have we got in store (the Bushtucker Trial)' and Ant revealed: 'I do know it's been delayed because of the weather, we'll be here a lot longer today.' \nDec added: 'They need to make sure the trial that was scheduled is doable in the area that it is.' \n\nSpeaking about the torrential rain, Joel said: 'We should talk about the fact that we almost didn't make it in today' \n\nDec shared: 'I mean, we've had a very dramatic morning,' as Ant explained: 'We all get texts this morning saying the rain is so bad you might not even make it in today'\n\nJoel asked the hosts: 'What have we got in store (the Bushtucker Trial)' and Ant revealed: 'I do know it's been delayed because of the weather, we'll be here a lot longer today'\n'Everything's a little bit up in the air here. And we don't know who's doing it because they're choosing.' \nThe hosts then admitted that some of the tents had blown down overnight - including the one where family and friends wait for their loved ones. \nIt comes after BBC Radio 1’s Dean McCullough became the second contestant to be voted off this year’s I’m A Celebrity… Get Me Out Of Here!\nThe Northern Irish presenter, 32, was greeted off the bridge by his mother, Ann, 51.\n\n I'm A Celeb's Dean opens up on battle with alcohol addiction that left him in a 'really dark place' \nAfter establishing himself in the first episode as a campmate who screamed during Trials, Dean went on to be voted in for seven Bushtucker Trials.\n'The more you do it the more you get used it,' he told hosts Ant McPartlin and Declan Donnelly. 'I wanted to do my family proud and myself proud. I am a strong person, I've just never been in that situation before.'\nOn the experience as a whole, he added: 'It's absolutely nuts, I still can't believe I'm here. I'm not disappointed to be going, I have early soaked up this whole experience, all the trials the things that I've faced, got stuck in at camp and I really enjoyed it. When I woke up this morning, I thought if I go today I'll be over the moon, I've lived the whole experience, I got to see the Jungle Junkyard.\n\nBBC Radio 1’s Dean McCullough is the second contestant to be voted off this year’s I’m A Celebrity… Get Me Out Of Here!\n\nThe Northern Irish presenter, 32, was greeted off the bridge by his mother, Ann, 51\n\n'It was nothing like I expected it to be not at all. You don't see the way the camp has to keep moving, we're so close, we sleep next to it.' \nHe added: 'You won't believe how bored we get in there. We played every game in there under the sun twice. You won't believe how much I have learnt about myself in there.'\nDean also weighed in on claims that he had avoided his share of the chores in camp, notably water carrying - a role typically left to fellow DJ Melvin Odoom. \n'I pulled my weight,' he insisted. 'But the thing with me and Jane [Moore] was I was out doing the trials every day and we made a pact that I did what I could while I was there, so that was that.\n'Melvin didn't speak to me about doing the water. I had done six trial back to back and he left me sleeping, I didn't ask him to do that! He's just a nice guy, but don't come back and say I haven't done anything.' \nHe added: 'We've had a lol about it. We wind each other up in camp no edn. I don't mind breaking the rules a bit and jumping in and mucking in to do other people's chores because you want to leave people sleeping or whatever.'\n\nI'M A CELEBRITY 2024: MEET THE ALL STAR LINE UP\n\nOTI MABUSE \n\nOti Mabuse has already two Strictly glitterballs under her belt\n\nOCCUPATION: Professional dancer\nFAMOUS FOR: Oti is best known for being a professional dancer on the British television series Strictly Come Dancing, which she won in 2019 and 2020. \n\nDANNY JONES \n\nDanny Jones is one of the bookies' favourites to win this year's I'm A Celeb\n\nOCCUPATION: McFly singer\nFAMOUS FOR: Danny is one of the lead vocalists and the lead guitarist for pop-rock band McFly. \nHe is also a coach on The Voice UK. \n\nBARRY MCGUIGAN \n\nFormer boxer Barry McGuigan is heading into the jungle\n\nOCCUPATION: Retired professional boxer\nFAMOUS FOR: Barry was nicknamed The Clones Cyclone and held the WBA and lineal featherweight titles from 1985 to 1986. \n\nGK Barry is a TikTok star who recently joined the ITV family on Loose Women\n\nOCCUPATION: TikTok star \nFAMOUS FOR: Grace is known for her comedic commentary on culture, lifestyle, and fashion. She has over 3.6 million followers and recently joined the Loose Women panel. \n\nDEAN MCCULLOUGH \n\nITV bosses are hoping Dean McCullough will ruffle feathers in the camp\n\nOCCUPATION: Radio 1 DJ \nFAMOUS FOR: Radio 1 DJ Dean has been signed by I'm A Celeb bosses, in the hope that he will ruffle feathers with his outspoken views. \nEarlier this year it was announced Dean would be taking over the BBC Radio 1 Early Breakfast Show, after previously fronting the afternoon slot. \n\nJANE MOORE \n\nJane is best known as a panellist and anchor of Loose Women\n\nOCCUPATION: Journalist\n FAMOUS FOR: Jane is best known as a panellist and anchor of Loose Women between 1999 and 2002. \nShe returned as a regular panellist from 2013 onwards.\nJane takes on the challenge following her high-profile split from husband of 20 years, Showbiz agent, Gary Farrow. \n\nMELVIN ODOOM \n\nMelvin was previously courted by I'm A Celeb bosses back in 2021\n\nOCCUPATION: DJ and TV presenter\nFAMOUS FOR: His work on radio. Melvin was previously courted by I'm A Celeb bosses back in 2021, but turned down the offer at the last minute.\nHe also had a primetime stint on Strictly back in 2016. \n\nCOLEEN ROONEY \n\nReports claim that she has been offered the biggest deal in the show's history\n\nOCCUPATION: WAG\nFAMOUS FOR: Wagatha Christie case against arch rival Rebekah Vardy.\nReports claim that she has been offered the biggest deal in the show's history, exceeding Nigel Farage's £1.5million from last year.\n\nALAN HALSALL \n\nAlan Halsall is best known for his role as Tyrone Dobbs on Coronation Street\n\nOCCUPATION: Actor \nFAMOUS FOR: Coronation Street actor Alan Halsall was forced to withdraw from I'm A Celeb last year, after undergoing ACL Reconstruction surgery.\nBosses have now convinced the actor to sign up again, and no doubt he will draw in a huge fanbase thanks to his long-running role as Tyrone Dobbs on the soap. \n\nTulisa is making her career comeback after reuniting with N-Dubz last year\n\nOCCUPATION: Singer and former X Factor judge \nFAMOUS FOR: Tulisa reunited with N-Dubz last year for a tour after first finding fame with the band in 2007.\nIn 2011, she became a judge on The X Factor and went on to launch her debut solo album, The Female Boss. \nShe released her fourth album with N-Dubz last year. \n\nREVEREND RICHARD COLES\n\nRichard is an English writer, radio presenter and Church of England priest\n\nOCCUPATION: Writer, broadcaster and priest\nFAMOUS FOR: Richard is an English writer, radio presenter and Church of England priest. \nHe first came to prominence as the multi-instrumentalist who partnered Jimmy Somerville in the 1980s band the Communards. \n\n MAURA HIGGINS\n\nMaura is best known for her stint on Love Island UK in 2019\n\nOCCUPATION: TV Personality\nFAMOUS FOR: Maura is an Irish television personality, television presenter and model. \nShe rose to prominence in 2019, when she was a finalist on the fifth series of ITV2 reality series Love Island. \nITVDeclan DonnellyJoel DommettAnt McPartlin\n\nShare or comment on this article: \nI'm A Celeb in chaos as bosses 'forced to draw up evacuation plan for camp' following more torrential rain - after flooding nearly forced live show AXE\n\nAdd comment\n\nEnter search term:\n\nSir Elton John tells West End crowd 'I've lost my eyesight and cannot see the stage' - but tells The Devil Wear Prada cast they 'sounded great' \n\nWho left Strictly Come Dancing? Montell Douglas is the tenth celebrity to be eliminated following third dance-off in a row\n\nEXCLUSIVENewly-single Claire Sweeney breaks her silence on split from Ricky Hatton as she makes an appearance at The Devil Wears Prada\n\nAMANDA PLATELL: Gregg Wallace is attempting to smear accusers by suggesting they're prissy women \n\nWho left I'm A Celeb? Dean McCullough is the SECOND contestant to be evicted from the jungle camp as Irish DJ is voted out \n\nSpoil your loved ones with these 10 best gift brands - guaranteed to impress this Christmas!\n\nI'm A Celeb's Maura Higgins FINALLY admits to dating Pete Wicks (well, sort of) as she makes rare comment about her love life \n\nRevealed: Inside story of how Robbie Williams and Nicole Appleton became 'extremely close' again \n\nElizabeth Hurley joins Lily Collins, Vanessa Williams and Anna Wintour at star-studded launch of The Devil Wears Prada\n\nEXCLUSIVEStruggle to find jeans that fit? A lot of women do! This new size-inclusive range is here to change that - designed for every body type\n\nWayne Rooney leaves wife Coleen in tears as he sends her emotional message during letters from home segment\n\nEXCLUSIVEInside Holly Willoughby's TV comeback: A year after being scared to leave home how she's loving life again ahead of her return to our screens\n\nClaire Sweeney makes a rare red carpet appearance with son Jaxon, 7, as they attend The Devil Wears Prada: The Musical \n\nPeter Andre hit the big time at 16 and nearly squandered his new-found riches. Now he says he's lucky to have a wife who wants him to spend LESS, not more...\n\nFrom fun facts to puzzles and games: How a new magazine is getting children to fall in love with reading (and away from their screens!)\n\nI'm A Celeb star Coleen Rooney reveals husband Wayne proposed to her in a PETROL STATION\n\nUnconventional \n\nFrancesca Eastwood will NOT be charged in domestic violence arrest after row in LA with boyfriend got physical\n\nAnger as BBC allowed Gregg Wallace to remain on air - despite at least four complaints being made against him about his behaviour\n\nGregg Wallace accuser hits back after star blames 'middle class women of certain age' for complaining about his antics \n\nBake a little joy this Christmas! Create new festive traditions with these easy bakes the little ones will love\n\nEXCLUSIVEArlene Phillips, 81, weighs in on Gregg Wallace fiasco as he blames 'middle-class women of a certain age' for woes\n\nTeary-eyed Melvin Odoom is comforted by I'm A Celeb campmates Barry McGuigan and Oti Mabuse after jungle's constant torrential rain dampens his spirits\n\nGregg Wallace allegations are the 'tip of the iceberg' as former MasterChef contestant reveals 'really toxic environment' on show\n\nTimothy West's son Samuel reveals the actor's wife Prunella Scales - who is battling vascular dementia - is 'not well enough to take in' that he has died\n\nDamaged hair? Don't despair! With 1 billion bonds packed in every bottle, the NEW bond-building wonder product is here to help\n\nLily Collins cuts a glamorous figure in a busty gold gown as she cosies up to husband Charlie McDowell at The Devil Wears Prada\n\nStrictly Come Dancing results: Recap as Montell Douglas is eliminated in quarter-finals as she loses to Tasha Ghouri \n\nLauren Sanchez posts VERY racy BDSM photo, in what could be her sexiest snap ever\n\nLeft little to the imagination\n\nJohn Torode's savage Gregg Wallace remarks resurface after his MasterChef co-host hits back at misconduct allegations\n\nSmells like clean spirit: Why fragrance is so important to us, and how the right scent can make (or break) your day\n\nStrictly's Pete Wicks chokes back tears after making it through to semi-finals despite being bottom of the leaderboard \n\nGwyneth Paltrow shares photos as she reunites with ex husband Chris Martin for a 'special' long weekend in Paris w\n\nTess Daly looks incredible in a velvet jumpsuit as she joins Claudia Winkleman and Motsi Mabuse backstage\n\nStrictly viewers brand dance off a 'travesty' and rage neither Tasha Ghouri nor Montell Douglas deserved to be in the bottom two\n\nTime to deck the halls! Get in the gifting spirit this holiday season with these top 10 brands\n\n Ferocious social media backlash to Gregg Wallace's astonishing video blaming 'middle class women of a certain age' \n\nDavid Walliams, 53, holds hands with beloved mother Kathleen, 81, at The Devil Wears: The Musical launch night \n\nEXCLUSIVEArlene Phillips reveals her thoughts on Pete Wicks' Strictly journey as she admits she 'admires' the TOWIE star \n\nSir Elton John, 77, and David Furnish, 62, are joined by fashion icons as they attend The Devil Wears Prada: The Musical \n\nHave YOU suffered hair loss? Here's the science-backed solution experts are raving about\n\nBernie Ecclestone to sell £300MILLION car collection as Formula One mogul puts 69 vehicles up for sale\n\nOn the market \n\nAmber Davies sets pulses racing in a leather dress and matching gloves as she arrives at The Devil Wears Prada\n\nEllen DeGeneres shares heartfelt message to wife Portia de Rossi in 20th anniversary selfie after move to UK\n\nWayne Northrop dead at 77: Days Of Our Lives actor dies following battle with Alzheimer's\n\nThe actor's publicist confirmed the news\n\nPremium wine under £6 a bottle! Score HUGE savings on Laithwaites cases this Black Friday and stock up before Christmas with an extra 30% off\n\nSo will Hollywood star Zendaya embrace her roots... with a holiday in Dundee?\n\nZendaya is proud of her Scottish roots\n\nEddie Murphy's son and Martin Lawrence's daughter are engaged! Eric proposes to Jasmin with gorgeous ring\n\nHappy news \n\nKim Kardashian shares slumber party throwback with Wicked cast - and everyone is saying the same thing\n\nEXCLUSIVERicky Hatton and Claire Sweeney SPLIT following eight month romance after finding love on Dancing On Ice\n\nChanelle Hayes sends pulses racing in a skimpy white bikini as she packs on the PDA with her new husband Dan Bingham\n\nApple Martin caught having a mean girl moment at Paris debutante ball\n\nStephen Mulhern 'is replaced on ITV show by huge Coronation Street star' as presenter steps down following the death of his father \n\nDavid Beckham shows off his festive spirit as he shares a fun snap of the family's Elf On The Shelf for his kids Brooklyn, 25, Romeo, 22, Cruz, 19 and Harper, 13\n\nI'm A Celeb's Dean McCullough opens up on battle with alcohol addiction that left him in a 'really dark place' after celebrating four years of sobriety\n\nSave £100 on Gtech cordless vacuum shoppers call the 'best vacuum EVER' - plus more unmissable deals (save up to 50%)\n\nPete Wicks sends sweet message to Maura Higgins as it's revealed the I'm A Celeb beauty is the reason he has cooled his romantic liason with Jowita \n\nEXCLUSIVEThey formed an unlikely romance in the Big Brother house, and in their first joint interview, Nathan and Rosie lay bare struggles with 'showmance' claims\n\nGraziano Di Prima returns to London with wife Giada Lin for a dance class - four months after he was sacked from Strictly\n\nEllen DeGeneres accused of 'infesting the Cotswolds' by Donald Trump ally after fleeing to multi-million farmhouse with Portia di Rossi \n\nThis £29 blemish and scar treatment serum credited with 'massively' reducing blemishes is 20% off for Black Friday: 'Worked wonders for my skin'\n\nX users SLAM Alyssa Milano for deactivating her account amid Elon Musk feud\n\nThe actress has walked back her previous pledge\n\nKristen Doute seen for the first time since baby announcement at gender reveal party hosted by Brittany Cartwright\n\nPrince Harry and Meghan Markle won't join Royal Family for Christmas as the Sussexes 'have not been invited' to Sandringham festivities\n\nThe curse of Band Aid 40: Controversial new release features a wealth of stars whose lives have been plagued by tragedy\n\nHarry, Meghan and their new Netflix series on the racy world of polo that's set to cause yet more despair back in Britain\n\nNoel Gallagher reveals his mother's shocking reaction to the end of the brother's 15-year feud and the announcement of the Oasis reunion tour\n\nEXCLUSIVERuth Langsford's 'biggest worry' about being in the jungle revealed as she shares behind-the-scene look at the three metre floods causing chaos on I'm A Celeb \n\nSamuel West reveals the final words his theatre legend father Timothy said to him before he passed away aged 90 \n\nIs there something Wicked afoot? How the film's cast defied normality with bizarre gaffes, unexpected outbursts and PLENTY of tears on promo tour\n\nInside the 20-acre 'hippy countryside homestead' Talulah Riley and Thomas Brodie-Sangster share with four other adults and over 100 animals\n\nEXCLUSIVEAmy Hart hits back at pregnancy speculation as she shares baby plans and discusses marriage course - two months after exchanging vows \n\nZara Tindall shares a rare insight into how the Royal Family celebrates Christmas - including a very sweet gifting tradition\n\nA heart of gold and an inspiration... Sir Bradley's touching tribute to Sir Chris\n\nFormer Tour de France champion\n\nEXCLUSIVEI cracked Jade Goody's front tooth on stage in the middle of a TV show - she never forgave me for it, admits Big Brother winner Craig \n\nInside Sean Wilson's eight-minute meeting with Coronation Street bosses about historic sex claims that led to his comeback being axed\n\nDaniel Craig reveals the reason he initially rejected the chance to play James Bond after teasing who the next 007 could be\n\nChristina Hall is 'grateful for time together' as she enjoys a trip to NYC with daughter Taylor amid divorce\n\nWe bought one of Homes Under The Hammer's cheapest ever houses for just £15k - it turned out to be a heartbreaking mistake that ruined our property dreams\n\nMiranda Hart takes her husband Richard Fairs to Strictly studios to watch pal Sarah Hadland perform - after the pair tied the knot in secret\n\nKirstie Allsopp claims Greg Wallace bragged about 'performing a sex act with his partner' just an hour after meeting her as questions are raised of BBC\n\nEXCLUSIVECheers actress Shelley Long, 75, is all smiles in rare sighting a day after her longtime co-star was seen wheeled out of a dialysis clinic\n\nMichael Rowland announces his retirement from ABC News Breakfast after '15 years of 3am starts'\n\nI hosted one of the biggest TV shows of all time but when I was axed I ended up working at a call centre and sleeping on dad's sofa, recalls AJ Odudu\n\nMonty Don returns to stage for the first time after being forced to cancel gigs over health scare that left him hospitalised\n\nI'm A Celebrity SPOILER: Barry McGuigan, 63, struggles to win stars as he is left lying in a bed of critters in first look at his Bushtucker Trial\n\nThe VERY low-key reinvention of Dr Christian Jessen: How hunky TV medic has stepped out of the limelight following defamation row \n\nRobbie Williams told pregnant Nicole Appleton 'this baby is saving my life' before record company pressured her to have an abortion\n\nGregg Wallace lashes out at 'handful of middle-class women of a certain age' after MasterChef star is accused of groping staff and sexist behaviour\n\nStrictly Come Dancing fans are left devastated as dance-off results are LEAKED again - and furious viewers call verdict 'an absolute disgrace'\n\nGregg Wallace told Aasmah Mir one of her BBC colleagues was a \"sexy b****\" , broadcaster claims\n\nKing Charles shields himself from the rain with an umbrella as he attends Sunday morning service at Sandringham\n\nInside Sean Wilson's life after being axed from Coronation Street: From 'secret split' with famous girlfriend to surprise new career\n\nFormer Woman's Hour host Emma Barnett reveals endometriosis diagnosis meant she couldn't conceive naturally as she opens up about gruelling IVF battle\n\nEXCLUSIVEAnt McPartlin, 49, condemned over 'inappropriate' virginity jibes to female I'm A Celeb producers\n\nEXCLUSIVEI'm A Celebrity camp hit by the worst rain in show's history as three metre floods cause chaos for Ant and Dec and production staff\n\nVictoria Secret supermodel Elsa Hosk signs huge six-figure deal with online fashion brand PrettyLittleThing\n\nKate Nash takes aim at the music industry as she reveals how she got the idea to join X-rated site OnlyFans to fund her upcoming tour\n\nBritain's favourite TV shows revealed - and the surprising 1980s rib-tickling sitcom that millennials hate!\n\nWilliam and Kate share heartwarming message with Kevin Sinfield - as he kicks off gruelling charity challenge in memory of late friend Rob Burrow\n\nX Factor icon Janet Devlin opens up about her eating disorder and alcohol battle after finding fame at 16 on the ITV show\n\nStrictly Come Dancing fans slam Tess Daly for her 'embarrassing' comment to show favourite Chris McCausland\n\nSnack like a celeb! We try A-listers' weirdest food choices, from Amanda Holden's hard-boiled eggs to Selena Gomez's spicy popcorn \n\nZara Tindall takes on final leg of charity cycle challenge - in memory of late eventing rider Caroline March\n\nJacob Rees-Mogg's 'strangely addictive' new reality show is compared to 'The Addams Family' by unimpressed locals ahead of its premiere\n\nCoronation Street's Sean Wilson reveals he was axed from the soap over unfounded historic sex claim as he says 'his reputation was ruined in eight minutes'\n\nDenise Van Outen reveals why she wants to stay single after enjoying a wild 'hedonistic' summer partying and flirting with a Hollywood star\n\nRebel Wilson reveals heartbreaking news just days after celebrating Thanksgiving with her young family\n\nI'm A Celebrity's Jane Moore shares what she really thinks of Coleen Rooney and reveals which campmate she wants to see in the final\n\nInside Russell Crowe's harbourfront Sydney apartment as he quietly lists it for an eye-watering $50million\n\nEXCLUSIVERevealed: Why Strictly star Pete Wicks put a stop to his romantic liaison with dance partner Jowita Przystal\n\nEXCLUSIVEEthan Slater 'concerned' for Ariana Grande as fans raise fears over Wicked star's new look\n\nDolph Lundgren, 67, seen for the first time with wife Emma Krokdal, 28, since revealing he is cancer free\n\nAngelina Jolie says being a parent is 'everything' to her amid ongoing divorce battle with Brad Pitt\n\nBen Affleck looks downcast on solo outing after spending Thanksgiving with ex-wife Jennifer Garner\n\nI'm A Celebrity in chaos as Ant and Dec reveal fears the live show would be AXED as torrential rain continues to batter the camp\n\nKate Middleton's poignant message of hope and the importance of love in 'our darkest of times' to guests at her carol concert \n\nCelebrity Apprentice 'is set to RETURN in 2025 to celebrate show's 20th anniversary - with bosses hoping to sign Cheryl and Piers Morgan'\n\nHarry blew Meghan away when he whisked her off to Botswana on a 'starry-eyed' luxury safari for their third date... but she was actually the FOURTH girl he had taken there \n\nEXCLUSIVEI'm A Celebrity's Dean McCullough faced accusations of 'bullying' from production staff on BBC Radio 1 show\n\nWhat the stars of iconic fitness show Aerobics Oz Style look like now\n\nEXCLUSIVEAdele is 'disillusioned with Hollywood' and hunting for new home outside America\n\nKacey Musgraves calls out fan who grabbed her during Tampa concert: 'She ruined it for everybody'\n\nEXCLUSIVEPrincess Beatrice's 'dear friend' nutritionist Gabriela Peacock reveals how she's supporting the royal through her second pregnancy \n\nThe day Prince William's godmother got embroiled in a racism row: Two years ago today Lady Susan Hussey was accused of asking a black British woman 'Where are you really from?' \n\nDancing On Ice's future is thrown into doubt as judges Jayne Torvill and Christopher Dean reveal they are ready to retire \n\nJordana Brewster pays tribute to Fast & Furious co-star Paul Walker on 11th anniversary of his death\n\nStrictly fans predict Pete Wicks will be the next star sent home after major misstep during Musicals Week: 'Surely his luck has run out now'\n\nSelena Gomez breaks silence on boyfriend Benny Blanco featuring in People's 2024 Sexiest Man Alive issue\n\nNicole Scherzinger passionately kisses co-star Tom Francis in steamy moment during their Sunset Boulevard performance \n\n00-heaven! Inside the real spectacular locations used in James Bond blockbusters from mountain top lair to a tropical island\n\nWicked star Marissa Bode calls out shocking response to her disabled character Nessarose\n\nKanye West and Bianca Censori cause a stir when they step out in Tokyo as the rapper avoids his many legal troubles\n\nSean Penn's girlfriend Valeria Nicov, 30, models flowy gown as she and actor, 64, make red carpet debut\n\nActress Selma Blair left shocked as she's mistaken for an A-list pop star by airport security\n\nColeen Rooney's brother Joe reveals the sweet reason why the I'm A Celebrity star is determined to be crowned Queen of the Jungle\n\nJames Argent reveals he's moving in with his girlfriend Nicoline Artursson and they already 'want a family' just four months after they met \n\nPink sends fans wild as she shares rare photo with her 'handsome' brother\n\nKatie Price's former flame Kris Boyson says he will 'fight' any of her exes after narrowly avoiding Carl Woods and Kieran Hayler at Christmas event\n\nTaylor Swift reacts to Josh Allen and Hailee Steinfeld's engagement - as fans urge Travis Kelce to be next\n\nStrictly's Dianne Buswell breaks down in tears as she pays tribute to dance partner Chris McCausland after his incredible Quickstep\n\nKatie Holmes shows off her chic winter style as daughter Suri, 18, bundles up on a solo stroll in NYC\n\nMartha Stewart, 83, admits she doesn't know how to check her Instagram DMs\n\nTom Sandoval breaks silence on shock Vanderpump Rules recasting... after announcing closure of his LA bar\n\nRupert Everett lashes out at the cultural appropriation 'bulls***' taking over acting and fears the 'activists are in charge\n\nRupert Grint's HUGE net worth is revealed as the Harry Potter actor is ordered to pay £1.8million tax bill after losing HMRC case\n\nJustin Timberlake cancels Oklahoma tour stop with just DAYS notice due to injury\n\nI'm A Celebrity's Danny Jones is saddled with two sets of chores to do after new camp leaders are chosen\n\nGwyneth Paltrow and her lookalike daughter stroll through Paris during shopping trip... and the proof you're never too old to hold mum's hand\n\nMoana 2, Wicked and Gladiator II boost Black Friday box office ticket sales to historic heights\n\nI warned TV bosses about 'disgusting' Gregg Wallace 16 years ago but they ignored me, claims ex-MasterChef hopeful\n\nStrictly's Tasha Ghouri is forced to overcome wardrobe malfunction as her cochlear implant FALLS OUT in the middle of her performance\n\nBBC bosses let Gregg Wallace continue to work on MasterChef despite top exec's warning over his sexist behaviour on set \n\nKim Kardashian under fire for reinstating son Saint's YouTube account despite anti Kamala Harris posts\n\nEXCLUSIVETALK OF THE TOWN: Tory peer Zac sells £8m manor to set up home with model fiancée Hum\n\nTALK OF THE TOWN: Keira Knightley takes sweet revenge on critics who thought her 'stupid' for not going to university by taking up online degree in secret\n\nRead Kate's emotional letter in full: Princess of Wales invites lucky guests to her Westminster Abbey concert\n\nGwen Stefani gives fans rare insight into her personal life and motherhood: 'It's not what you think it will be like'\n\nStrictly's Carlos Gu is forced to PULL OUT of Christmas Special following an ankle injury - and a replacement has already stepped in\n\nLily Allen admits her alcohol addiction was so severe she can't remember having sober sex until she reached her 30s\n\nJordan North takes a brutal swipe at his former Radio 1 show as he boasts about rise in Capital listening figures during Saturday Kitchen appearance\n\nI'm A Celebrity's Coleen Rooney hits back at 'WAG' label as Dean McCullough brings up title \n\nI'm A Celebrity's Oti Mabuse details the vile abuse she received from 'mum-shaming trolls' after she returned to Dancing On Ice following the birth of her baby daughter\n\nFrom glitterball dreams to comedy screens: Strictly star Sarah Hadland planning dance sitcom with Car Share writer\n\nInside story of the Groucho Club closure and allegations of a troubling crime that could be the reason police shut the infamous celebrity-filled Soho haunt\n\nStrictly fans fume that Montell Douglas was 'set up to fail' with the 'wrong dance and song' as the judges slam her Rumba for being 'too slow'\n\nI'm A Celebrity's Tulisa Contostavlos and Reverend Richard Coles fight back TEARS in gruesome eating trial\n\nStrictly fans are left outraged by one couples' scores as they insist the judges have a 'vendetta' against them\n\nStrictly Come Dancing RECAP: Pete Wicks lands in the bottom as viewers spot famous audience member \n\nInside Gok Wan's swanky Georgian house: Fashion guru shows off his quirky property after overcoming childhood struggles \n\nStrictly's Shirley Ballas looks unrecognisable as she transforms into Miss Trunchbull for Musicals Week: 'Bravest judge outfit ever!'\n\nHe's an Oscar-winning actor and director worth $400m (and there's a Friends link!)... can you guess who it is?\n\nJessica Alba showcases her tanned and toned curves as she enjoys the beach in Puerto Vallarta\n\nJuice Wrld's posthumous album The Party Never Ends slammed by fans: 'It sounds like AI'\n\nMonica Bellucci, 60, wows in a red crochet jumpsuit as she and partner Tim Burton, 66, attend ceremony to honour Sean Penn \n\nVictoria's Secret Angel Lais Ribeiro welcomes baby with husband Joakim Noah: 'Thankful for my family'\n\nMoana 2 actress Auli'i Cravalho reveals incredible gift she was able to give mom after success\n\nLet me strip off! Margot Robbie reveals why she insisted on full-frontal nudity in The Wolf of Wall Street\n\nEXCLUSIVEEllen DeGeneres' Cotswolds dream is submerged: Hollywood star's idyllic multi-million-pound farmhouse is hit by floods with surrounding fields underwater\n\nSalma Hayek rocks a fedora as she takes a smoke break while bargain hunting on Black Friday in Los Angeles\n\nUlrika Jonsson looks downcast while on a dog walk as she is seen for the first time since accusing Gregg Wallace of making 'rape joke' that 'distressed' MasterChef contestant\n\nGeri Horner is seen for the first time since 'sparking fresh Spice Girls feud by derailing lucrative deal' as she attends Lionesses' friendly\n\nEXCLUSIVEI'm A Celebrity's Barry McGuigan wins support from his local MP Rosie Duffield who praises his 'character' and for 'working hard' in camp\n\nEXCLUSIVEWho Pete Wicks REALLY prefers in Maura Higgins and Jowita 'love triangle', according to a body language expert\n\nTop designer claims Diddy dangled her off 17th-story balcony and threatened to kill her\n\nStrictly's Tasha Ghouri is effortlessly stylish in a white faux fur coat as she joins fellow stars arriving in London ahead of musicals week\n\nDwayne 'The Rock' Johnson reveals adorable Christmas tradition he shares with his daughters\n\nJust why IS John Torode keeping so quiet? TV insiders reveal truth about his and Gregg Wallace's 'friendship' to KATIE HIND\n\nJames Van Der Beek sells merch from his 1999 classic Varsity Blues to help pay for his cancer treatments\n\nEXCLUSIVEThe moment it all went south for East 17: How the 90s icons went from topping the charts to homeless and in a bitter fallout \n\nAJ Pritchard arrives hand-in-hand with influencer girlfriend Zara Zoffany at Annabel's for date night - after ex Abbie took a savage swipe\n\nThe Traitors' Charlotte Chilton shares her pride for her newborn amid tot's 'medical issues' as she gives new health update after claiming Conor Maynard still hasn't met their baby\n\nEXCLUSIVEI'm A Celeb's Maura Higgins and Reverend Richard Coles to team up for their own show as fans go wild for the pair's sweet jungle friendship\n\nPregnant Montana Brown reveals she was taken to hospital after being struck down with illness as she shares her relief that son, 17 months, didn't catch it\n\nAll the things that are FAKE in your favourite Christmas films! Obvious plot holes and filming secrets that you won't be able to unsee in these festive classics\n\nPenny Lancaster and Rod Stewart are seen for the first time since her husband issued furious rant at 'tubby bully' Gregg Wallace\n\nChristine McGuiness shows off her toned figure in a skin-tight burgundy maxi dress as she poses for sizzling clip\n\nEXCLUSIVELord Alan Sugar's rags to riches story set to become a must-watch television series - but who will play him?\n\nLiam Payne had put his £3.2million five-bed Buckinghamshire mansion up for sale in the month before he died\n\nHer mum is a TV icon and adored by Brits - but can you guess whose bikini clad celebrity daughter this is?\n\nEXCLUSIVEThe prim private schoolgirl who ditched strict Catholic upbringing for Netflix fame... before her world came crashing down when she was caught drug-smuggling\n\nTOWIE's Ella Rae Wise, 24, and Dan Edgar, 34, pack on the PDA while filming Christmas special - after 'secretly SPLITTING amid showmance claims'\n\nDec Donnelly is left red-faced and in tears after making a VERY unfortunate innuendo on I'm A Celeb Unpacked as the team are left in hysterics\n\nThe devastating downfall of Jeremy Jackson: How the Baywatch heartthrob, 44, has been blighted by addiction, jail stints and a shock reality TV axe\n\nGemma Chan looks elegant in a smart black coat as she and boyfriend Dominic Cooper celebrate her 42nd birthday at Chiltern Firehouse\n\nInside Bob Bryar's life after My Chemical Romance: From battles with depression to new job as real estate agent as drummer is found dead aged 44\n\nNetflix fans left 'bawling like babies' by 'best movie ever' - raving 'I still get goosebumps after watching it three times'\n\nFrankie Bridge shows her incredible figure in a strapless dress as she enjoys a girls night out in Mayfair - after revealing 17 year health battle\n\nAlja korjanec reveals the REAL reason he returned to Strictly as he insists 'I replaced nobody'\n\nLily Allen admits that self-medicating was always 'going to be on the cards' for her because addiction 'runs deep' in her family\n\nMy Chemical Romance drummer Bob Bryar found dead at his home at age 44\n\nI'm A Celebrity's Reverend Richard struggles to swallow a huge fish eye while Tulisa looks on in disgust in first look at latest Bushtucker Trial\n\nLiam Gallagher reveals MAJOR hint for Oasis line up next summer as he 'confirms' who is returning to the guitar\n\nKris Jenner, 69, stuns fans with very youthful appearance in Thanksgiving photos with Khloe Kardashian\n\nDanny Cipriani cuts concerned figure but estranged wife Victoria walks off SMILING amid couple's bitter divorce battle\n\nPoppy Delevingne bundles up in a black oversized padded jacket and skintight yoga pants as she grabs sweet treats in Notting Hill\n\nLizzo shows off dramatic weight loss on Thanksgiving amid Ozempic rumors\n\nWho left I'm A Celeb? Loose Women's Jane Moore take swipe at fellow campmates and says 'hard work does not get rewarded' as she becomes first star to leave the jungle\n\nJoe Jonas cuts a stylish figure in a brown jacket and low-cut vest as he heads for drinks at Chiltern Firehouse\n\nZayn Malik pays heartfelt tribute to 'brother' Liam Payne on stage in the late One Direction star's hometown of Wolverhampton\n\nI wanted to die after starring on the world's sickest reality show - I spent 15 months in solitary confinement while producers secretly broadcast me\n\nI'm A Celeb's Jane Moore gleefully arrives at the hotel before being greeted by campmates' loved ones after being the FIRST star to be booted from the jungle\n\nRuth Langsford is 'gutted' for Jane Moore and says she makes 'great point' about 'showmen' campmates getting all the attention on I'm A Celebrity\n\nI'm A Celebrity's Coleen Rooney shares struggles of having two 'horrible' miscarriages before revealing the secret meaning behind her children's names\n\nGregg Wallace is accused of groping three women in bombshell new claim - as former MasterChef winner Emma Kennedy says she reported him 12 years ago \n\nLindsay Lohan flaunts smooth visage in new selfie after dad confirmed she HAS had cosmetic treatments\n\nJennifer Lopez shakes off Ben Affleck's cozy Thanksgiving with ex-wife Jennifer Garner as she shops in LA\n\nI'm A Celeb viewers left 'heartbroken' as ITV show scraps iconic segment\n\nDeadpool & Wolverine's cut X-rated joke finally revealed after Ryan Reynolds said he'd 'take it to his grave'\n\nEDEN CONFIDENTIAL: Naomi Campbell fights charity ban with 'bombshell' new evidence after watchdog found failings at fashion organisation\n\nTaylor Swift fans go wild as she MATCHES with Travis Kelce's mom Donna for Chiefs game\n\nAshley Cain becomes a father again! Star reveals he's welcomed a baby boy named Atlas a month early - and shares a sweet tribute to late daughter Azaylia\n\nSelena Gomez takes her younger sister Gracie, 11, Black Friday shopping in Los Angeles\n\nMakeup-free Kate Hudson gives a glimpse at family's Thanksgiving getaway to NYC\n\nBen Affleck 'felt blessed' to spend cozy Thanksgiving with ex Jennifer Garner amid Jennifer Lopez divorce\n\nI'm A Celebrity star Danny Jones' wife Georgia reveals his biggest fear after he kept it a secret from bosses\n\nI'm A Celeb fans brand Dean 'pathetic' amid 'crumpet gate' after he steals food from rival campmates and leaves seething Tulisa ready to 'start a war'\n\nMichael Fassbender and Keira Knightley leave viewers in hysterics with hilarious tales of 'spanking' as they reunite on Graham Norton 13 years after starring in iconic film\n\nWatch the moment Gregg Wallace touches his crotch and declare he 'never wears underwear' during Strictly rehearsals \n\nPregnant Charlotte Dawson says trolls called social services and falsely accused her of neglecting her children and giving her son, 3, alcohol\n\nI'm A Celebrity fans are left 'in tears' after Danny Jones makes emotional confession to Barry McGuigan during heartwarming speech\n\nGigi Hadid is the spitting image of her supermodel mom Yolanda in BTS from Holland's Next Top Model\n\nStrictly star JB Gill admits wife Chloe Tangney is 'so jealous' of him dancing with pro partners Amy Dowden and Lauren Oakley - but NOT because of the show's infamous curse\n\nI'm A Celebrity's Oti Mabuse 'tipped for a HUGE new TV show after impressing bosses with her moving jungle chats'\n\nJoanna Page admits that bidding farewell to Gavin and Stacey with final Christmas Special 'felt like grieving' as she poses for stunning shoot with Woman&Home\n\nLisa Barlow's unfiltered red carpet appearance sparks furious fan reaction over RHOSLC onscreen retouching\n\nLoose Women's Frankie Bridge reveals crippling health battle that landed her in hospital - admitting 'I've tried everything but treatment doesn't work'\n\nGregg Wallace is accused of 'racism' after allegedly saying 'me so horny' about Asian MasterChef contestant and making 'kung fu noises'\n\nIt's not quite the Kardashians. Or the Furys. But these Rees-Moggs are strangely addictive, writes JANE FRYER\n\nJana Kramer reveals if she will reprise her role for upcoming One Tree Hill revival\n\nJoe Rogan reacts to wild claim Diddy 'poisoned' Jamie Foxx causing his 2023 hospitalization\n\nTaylor Swift poses with Chiefs WAGs in VIP suite as they celebrate dramatic win over Raiders\n\nRosie Huntington-Whiteley goes braless in a sexy white crop top as she shows off her model physique in cosy loungewear\n\nI'm A Celebrity's Maura Higgins leaves viewers in stitches as she misunderstands Richard Coles' 'exorcism' comment\n\nCheery Katie Holmes heads back to Broadway after Thanksgiving break with daughter Suri Cruise\n\nEastEnders spoilers: Drunk Linda risks losing everything and Big Mo strips naked for charity calendar\n\nEmmerdale spoilers: Cain is arrested and Moira is abandoned at hospital in cheating twist\n\nCoronation Street spoilers: Baby Frankie goes missing and Shona injured in horror car accident\n\nArnold Schwarzenegger's LA home 'swatted' on Thanksgiving Day after prankster makes bomb threat to police\n\nMiley Cyrus blames mom Tish for controversial pole dancing-inspired 2009 performance at age 16\n\nDemi Moore gives shocking Hot Ones interview that has gobsmacked fans all saying the same thing\n\nMonica Bellucci, 60, stuns in a dramatic black caped gown as she joins her partner Tim Burton, 66, at the Marrakech International Film Festival\n\nMinnie Driver, 54, praised by fans for sharing make-up free snaps despite admitting she's 'pretty vain'\n\nHailee Steinfeld is engaged! Actress' NFL star boyfriend reveals they are set to tie the knot in stunning snaps\n\nBack to top\n\nVideo Archive\n\nTopics Index\nMobile Apps\nScreensaver\n\nText-based site\nReader Prints\n\nTop of page\n\nMail on Sunday\nThis is Money\n\nMail Travel\n\nPublished by Associated Newspapers Ltd\n\nPart of the Daily Mail, The Mail on Sunday & Metro Media Group\n\nHow to complain\nLeadership Team\nAdvertise with us\nContributors\n\nSubscription Terms & Conditions\nDo not sell or share my personal information\nAbout MailOnline\nPrivacy Settings\nPrivacy policy & cookies\n\nAdvertisement\n\nAdvertisement","summary":"It comes after hosts Ant McPartlin and Declan Donnelly revealed they almost had to call Saturday's live show due to the stormy weather.","url":"https://www.dailymail.co.uk/tv/article-14146947/Im-Celeb-chaos-evacuation-plan-camp-rain.html","image":"https://i.dailymail.co.uk/1s/2024/12/02/00/92682841-0-image-a-364_1733099547559.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/12/01/4404668902365675700/1024x576_MP4_4404668902365675700.mp4","publish_date":"2024-12-02 00:34:11","author":"Editor,Geraint Llewellyn","authors":["Editor","Geraint Llewellyn"],"language":"en","source_country":"gb","sentiment":-0.576},{"id":269535590,"title":"What the papers say – December 2","text":"The continuing turmoil surrounding TV presenter Gregg Wallace again dominates the front pages of Monday’s newspapers.\n\nThe MasterChef presenter, who has stepped away from the show in the wake of allegations about his behaviour, faces a fresh backlash according to The Daily Telegraph after he released an Instagram video saying accusations against him were made by “middle-class women of a certain age”.\n\nThe Daily Mirror carries the simple headline DisasterChef as it says the comments were met with anger, while the Metro says it has sparked a fresh backlash.\n\nHis comments also feature on the front of The Independent, which says he remains defiant amid turmoil at the BBC over the allegations, the Daily Mail reporting the broadcaster received at least four complaints against him while he was still on screens.\n\nThe Sun and Daily Star offer some advice for the presenter to shut up and “stop digging”.\n\nHealth issues feature elsewhere with The Times reporting on NHS bosses warning A&E departments will suffer under plans to hit targets for routine operations, expected to be announced by Sir Keir Starmer this week.\n\nPlans for an “unprecedented transformation” of end-of-life care feature on the front of The Guardian in the wake of the Commons vote on assisted dying.\n\nA poll showing 47 per cent of people favour stronger links with the EU ahead of a free trade deal with the US under Donald Trump is on the front of the i.\n\nThe Financial Times also has an eye overseas, reporting that Russian and Syrian warplanes have hit back against rebels in Syria.","summary":"MasterChef presenter Gregg Wallace’s comments after complaints about his behaviour feature on Monday’s front pages.","url":"https://www.standard.co.uk/news/uk/gregg-wallace-metro-the-independent-the-daily-telegraph-keir-starmer-b1197522.html","image":"https://static.standard.co.uk/2024/12/02/00/b11373a82c28e839e50eb82122a80673Y29udGVudHNlYXJjaGFwaSwxNzMzMTg1MDg2-2.33243397.jpg?width=1200","video":null,"publish_date":"2024-12-02 00:31:46","author":"Pa Reporter","authors":["Pa Reporter"],"language":"en","source_country":"gb","sentiment":0.067},{"id":269534052,"title":"ECB chief Lagarde warns Europe against US tariff retaliation","text":"European Central Bank (ECB) President Christine Lagarde has warned against taking retaliatory measures in response to potential new tariffs imposed by U.S. President-elect Donald Trump, in an interview to the Financial Times newspaper published on Thursday.\n\n\"We could offer to buy certain things from the United States and signal that we are prepared to sit at the table and see how we can work together,\" Lagarde said, according to a transcript of her interview published by the ECB.\n\nShe argued that such a \"check book strategy\" was preferable to a purely retaliatory approach.\n\nLagarde reiterated warnings about the consequences of a possible trade war with the U.S. By offering to purchase goods from the U.S., the Europeans could signal their readiness to negotiate and explore possibilities for cooperation.\n\nA trade war would be \"in nobody's interest, neither for the United States nor for Europe, or anyone for that matter,\" the ECB chief added.\n\nThe interview was conducted on Monday, before Trump announced his intention on Tuesday to impose tariffs of 25 percent on all imports from Mexico and Canada on his first day back in office. Trump's inauguration is due to take place on Jan. 20.\n\nThroughout his election campaign, Trump had generally announced far-reaching tariffs, arguing that this would lead U.S. companies to increase domestic production and thereby create jobs. (DPA)","summary":"European Central Bank (ECB) President Christine Lagarde has warned against taking retaliatory measures in response to potential new tariffs imposed by U.S. President-elect Donald Trump, in an interview to the Financial Times newspaper published on Thursday.","url":"https://nation.lk/online/ecb-chief-lagarde-warns-europe-against-us-tariff-retaliation-285921.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/d1290f936fbf4ccfbf8102aa3236eaeb.jpg","video":null,"publish_date":"2024-12-02 00:30:28","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.143},{"id":269532878,"title":"Greens candidate picked for by-election after MP quits","text":"Close navigation menu\n\nSubscriber Exclusive\n\nToday's Paper\n\nWest Rewards\n\nVanishing Cousins\n\nThe West Live\n\nCourt in the Act\n\nReveal sub navigationChevron Down Icon\n\nCourts & Justice\n\nReveal sub navigationChevron Down Icon\n\nWest Coast Eagles\nFremantle Dockers\n\nRugby Union\nHorse Racing\n\nReveal sub navigationChevron Down Icon\n\nHerd On The Terrace\n\nAgriculture\nBulls N’ Bears\n\nReveal sub navigationChevron Down Icon\n\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\n\nReveal sub navigationChevron Down Icon\n\nGreat Southern\n\nPeel/Rockingham\n\nReveal sub navigationChevron Down Icon\n\nJessica Page\n\nKatina Curtis\nBasil Zempilas\nEmma Garlett\nKim MacDonald\nPaul Murray\nJustin Langer\nBelle Taylor\nLaura Newell\nAnxiety Aunt\n\nReveal sub navigationChevron Down Icon\n\nHealth & Wellbeing\n\nReal Estate\nHouse That!\n\nEntertainment\nReveal sub navigationChevron Down Icon\n\nCelebrity Gossip\n\nCompetitions & Puzzles\n\nReveal sub navigationChevron Down Icon\n\nWestern Australia\n\nWest Travel Club\nPhotography\nTravel Tips\n\nReveal sub navigationChevron Down Icon\n\nSmartphones\n\nTelecommunications\n\nThe West Australian\nToday's PaperPlace an AdMonday, 2 December 2024\n\nGreens candidate picked for by-election after MP quits\n\nWest Rewards External Logo\n\nEnjoy exclusive member discounts, giveaways and competitions with our subscriber rewards program.\n\nEnter Now For your chance to win, upload a photo or video of your home’s Christmas lights.\nFind out More\n\nFrom around the site\n\nLabor’s infrastructure projects hit with construction issuesPremium\nEx-Israeli minister denied a visa 'to stop hatred'Premium\nPM denies he went behind Plibersek’s back to kill EPA deal \nTrump wants Charles Kushner to be ambassador to FrancePremium\nAustralia's 'lucky' budget numbers set for misfortunePremium\nDonald Trump taps loyalist Kash Patel as FBI head\n\nTop Stories\n\nCrime PremiumTwo men jailed over plot to sell meth that never existed\n\nGoldCommentsPremiumNorthern Star swoops on De Grey’s Pilbara giant for $5b\n\nThe West Australian exclusive\nThe West Australian exclusiveCourts & JusticePremium\nThe West Australian exclusiveCorporate lawyer confesses to more vile child sex crimes\n\nOur Network\n\nWest Rewards\nWest Regional Network\nWest Announcements \nWest Classifieds\nWestBusiness Events \nWest Travel Club\n\nMedia Education\nThe Nightly\n\nOur Partners\n\nReal Estate View\nHealthengine\nHuddle Insurance\n\nRaiz Invest\n\nStarts at 60\n\nSubscribe To\n\nThe West Australian Newspaper\nThe West Email Newsletters\n\nConnect with usMessenger IconSend us a message\nShare to FacebookShare to TwitterShare to InstagramShare to YoutubeRSS FeedEmail Us\n\nFrequently Asked Questions\nEditorial Policy\nEditorial Complaints\nPlace an ad in the Classifieds\nAdvertise in The West Australian\n\n© West Australian Newspapers Limited 2024\nPrivacy Policy\nTerms of Use\nCookie Settings\nThe West Australian","summary":"The Greens have picked an environmental engineer as their candidate for a by-election after the former MP resigned after admitting to an affair with a staffer.","url":"https://thewest.com.au/politics/greens-candidate-picked-for-by-election-after-mp-quits-c-16944598","image":"https://images.thewest.com.au/publication/C-16944598/d1cb7b6a026a55545115efa41538bc2ba4bef6cd-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2024-12-02 00:28:31","author":"Melissa Meehan","authors":["Melissa Meehan"],"language":"en","category":"politics","source_country":"au","sentiment":0.518},{"id":269531896,"title":"Since Donald Trump Last Met Kim Jong Un The Dictator Has Made A Powerful New Ally  Vladimir Putin Fx4r85","text":"Since Donald Trump last met Kim Jong Un, the dictator has made a powerful new ally – Vladimir Putin\n\nSince Donald Trump last met Kim Jong Un, the dictator has made a powerful new ally – Vladimir Putin\n\nMonday 02/12/2024\n\nDonald Trump has added a new \"rocket man\" to his friend list. ( APReuters)\n\nDonald Trump now has two \"rocket men\" in his life.\n\nThe new one is Elon Musk, the world's richest man, a constant companion and the new best friend of the president-elect of the United States.\n\nMusk is widely reported to be spending many meals at Trump's Mar-a-Lago compound in Florida — both as an informal adviser and as someone to be appointed by Trump to slash $US2 trillion ($3 trillion) from federal government spending.\n\nSo close are the two men – for now – that when Trump was speaking recently to Ukraine's President Volodymyr Zelenskyy he casually handed the phone to Musk so he, too, could have a chat to Zelenskyy.\n\nAnd then there's Trump's original Rocket Man — Kim Jong Un, the leader of North Korea.\n\nIt was Trump during his first term in the White House who gave Kim his nickname. Until Trump, Kim Jong Un had been a marginalised figure on the world stage. As part of a dynasty that had ruled North Korea for three generations, he was seen as an eccentric leader of a backward country.\n\nNorth Korea is desperately poor and secluded. Traditionally its main ally has been China, so many were surprised when as president Trump elevated the status of Kim to a major figure – meeting him three times.\n\nBut when Trump re-enters the White House on January 20, he will find that the man he so enjoyed meeting has built for himself a new international status – now a major ally of Vladimir Putin.\n\nNorth Korea's new position\n\nNorth Korea's role on the world stage has changed dramatically – it recently decided on its first ever overseas military intervention, sending an estimated 10,000 soldiers to Russia to help in their fight against Ukraine.\n\nFor western countries, by doing this North Korea has crossed a line.\n\nNorth Korea has long been dubbed \"the hermit kingdom\". Kim, his father and grandfather consecutively ruled as dictators, living privileged lives in an isolated country.\n\nKim inherited from his father a regime based on brutality. As retired South Korean Army lieutenant general Chun In-bum told the ABC: [Kim] inherited a system that has its foundations on terror, murder, executions, torture, you name it … Kim Jong Un uses brainwashing, as well as rewards, and, of course, terrorising.\n\n\"Public executions [are carried out] in a very brutal way. It's not just hanging. They normally shoot people, but they also put them to the torch [or burn them], like in medieval Europe. And these executions are conducted in public in front of children.\"\n\nThe world changed for Kim when Donald Trump was elected in 2016. As president, Trump flirted with Kim and gave him a status he'd never had before – including three meetings.\n\nNorth Korea analyst Fyodor Tertitskiy wrote in Carnegie Politika that the reason North Korea has never previously sent military units abroad was because the regime is worried soldiers might pick up \"incorrect\" ideas, such as realising that people in other countries are much wealthier than them.\n\nHe says Pyongyang is cultivating closer relations with Moscow in the hope the alliance between the two countries will endure even when the Kremlin no longer needs its help in Ukraine.\n\n\"North Korea is strengthening ties with Russia in a whole range of different areas, from trade, tourism and exchanges, including of schoolchildren, to sending soldier and workers to Russia.\"\n\nBut Tertitskiy adds that the blossoming Russia-North Korea relationship could be stymied by South Korea or China.\n\n\"For the moment, Beijing is not bothered: North Korean troops will help Russia avoid defeat, and Kremlin support means China may be able to reduce the economic aid it gives to Pyongyang. But there are limits. China will not want to see Russia supplying North Korea with nuclear and missile technologies that could lead to regional escalation.\"\n\nThe North Korean special forces troops have gone to Russia to help Moscow in what has become its single most important battle: the battle to regain Kursk, the part of Russia that Ukraine took while Russian troops were fighting elsewhere on the frontline.\n\nA bargaining chip\n\nThe significance of Ukraine taking this chunk of Kursk is that it gives Ukraine a major bargaining chip at the negotiations expected soon after Trump takes power.\n\nBut to have it as a bargaining chip Ukraine needs to hold Kursk at least until Trump tries to force a ceasefire deal on Ukrainian leader Volodymyr Zelenskyy.\n\nTrump will be able to use a powerful leverage over Zelenskyy – he can threaten to withdraw US funding for NATO unless Zelenskyy agrees to a deal that would most likely be that Russia keeps most of the 20 per cent of Ukraine that it has taken since the full invasion of February 2022.\n\nWhich is where Kim Jong Un comes in, now a player in one of the world's biggest conflicts.\n\n\"Putin is deeply embarrassed to lose so much territory within Russia,\" says Robert Potter, a fellow at the ANU Centre for Europe who has worked on Ukraine and North Korean issues and spent time in both countries. \"He wants the territory back by [Trump's] inauguration day so he does not have to trade for it.\"\n\nNorth Korea's motivation for sending the soldiers, says Potter, is a perpetual need for foreign currency.\n\n\"Centralised assets which are generally controlled by the Kim family are the highest priority to turn into centres of revenue. This is why sanctions target areas like mining. Extraction of coal, hacking and selling labour have all been revenue earners for the government in the past.\n\n\"This along with getting access to comparatively new Russian defence technologies makes this a compelling deal for the Kims if they can avoid battlefield embarrassment.\"\n\nNorth Korea had a number of interrelated aims in mind when it agreed to provide soldiers, says Richard McGregor, senior fellow, East Asia, at the Lowy Institute.\n\n\"The country is poor and still has a desperate need for hard currency. So they will either be paid by Russia or be paid in kind, with modern missile technologies which will allow them to advance their aim of building a nuclear bomb which can threaten the United States,\" he says.\n\n\"North Korea also chafes at the overwhelming influence of its largest neighbour, China. Stronger ties with Russia gives them more options with China.\"\n\nChina, says McGregor, has considerable influence over North Korea.\n\n\"It controls the land border and can easily cut off oil supplies, for example, and foodstuffs, a lot of which travel through China.\n\n\"The two countries have a close but cool relationship. But China is cautious about using its leverage against North Korea, especially if it is seen as being in the service of US foreign policy aims, in this case, to hurt Russia.\n\n\"China will be uncomfortable about North Korean troops going to fight in Russia, but Beijing and Pyongyang are on the same side in the Ukraine conflict. They don't want Russia to lose.\"\n\nMcGregor rejects the suggestion that North Korea sending troops to Russia is in effect a back-channel way for China to support Russia in its war against Ukraine.\n\n\"China's own contributions are far more decisive,\" he says. \"I would look at it another way. Russia is like the DRPK (North Korea) in some ways. They don't want to be too reliant on China either. By embracing Pyongyang, Putin is making sure he has more partners than Beijing.\"\n\nAs to the much-discussed Russia-China-Iran-North Korea alliance, McGregor says: \"It doesn't work as a seamless alliance but they increasingly have shared interests and are developing the habit of working together. That by itself is significant.\"\n\nWhat recent events have shown is that despite North Korea's closeness to China, it also has a separate relationship with Moscow.\n\nRobert Potter points out that North Korea and Russia have a long-standing partnership independent of Beijing, but says he thinks the sending of soldiers would not have happened had China really wanted to stop it.\n\nThese soldiers, he says, will not make a difference in their current numbers but if this North Korean program continues to expand, then they will.\n\nMany analysts believe that for Trump, the challenge of ending the conflict between North and South Korea was a tantalising one.\n\n\"Trump thinks of himself as a deal-maker and settling the Korean peninsula would have been the ultimate deal,\" McGregor says.\n\n\"It was also quite legitimate for Trump to try personal diplomacy. Nothing else had worked for decades. But Trump underestimated the task and elevated the relationship with Kim to a near-bromance, rendering the hard work of any agreement all but useless by the end.\"\n\nHard to judge who is winning the war\n\nSo, with North Korean troops now deployable, who's winning the war in Ukraine?\n\nRobert Potter says neither party is on track to achieve their stated objectives.\n\n\"Ukraine has switched to a battlefield strategy of trading small amounts of territory to inflict grievous and unsustainable losses on Russia,\" he says.\n\n\"While this does not put Ukraine in a position to retake all of the conquered territory, it's unlikely Russia can maintain its present pace as long as Ukraine continues to receive aid.\n\n\"While Russia is taking small amounts of territory there is not much risk of them taking a major city — so far in the war, they've failed to do this. Realistically, they're still trying to clear the suburbs of Donetsk after 10 years of trying.\"\n\nStory by: global affairs editor John Lyons\n\nOriginal Story link: https://www.abc.net.au/news/2024-12-02/donald-trump-kim-jong-un/104666876\n\nFEATURE NEWS\n\nBag checks are a must in schools to protect children from drug exploitation - Tabuya\n\nBag checks in schools should be made compulsory to combat the growing issue of children being exploited as drug peddlers.\n\nThis was raised by Minist...\n\n2 hours ago\n\nLATEST NEWS\n\nEddie Murphy and Martin Lawrence will soon be family — their kids just got engaged\n\nEric Murphy and Jasmin Lawrence, the son of Eddie Murphy and daughter Martin Lawrence, have announced their engagement after three years of ...\n\n18 minutes ago\n\nPublic servants must be multi-skilled to meet citizens' needs promptly - Singh\n\nThe services provided by ministries must meet citizens’ needs promptly, ensuring they receive help without being told to return another day due to ...\n\n2 hours ago\n\nSince Donald Trump last met Kim Jong Un, the dictator has made a powerful new ally – Vladimir Putin\n\nDonald Trump now has two \"rocket men\" in his life.\n\nThe new one is Elon Musk, the world's richest man, a constant companion and the new best friend ...\n\n2 hours ago\n\nMan passes away following an accident along Valley Road in Sigatoka\n\nA man in his 20s has died following an accident along Valley Road in Sigatoka yesterday.\n\nDirector Traffic, Senior Superintendent of Police Mitieli ...\n\n4 hours ago\n\nFiji breaks 22 tournament drought after beating Spain 19-5\n\nAfter 9 years, the Fiji Airways Men's National 7s side has won the HSBC Dubai 7s title after defeating Spain 19-5 in the final this morning. Fiji ...\n\n8 hours ago\n\nfijivillage Straight Talk with Vijay Narayan\n\nLatest Videos\n\nStay tuned for the latest news on our radio stations\n\nProf. Biman Prasad on fijivillage Straight Talk With Vijay Narayan\n\nDeputy Prime Minister and Minister for Finance, Professor Biman Prasad will appear on fijivillage Straight With Vijay Narayan.The show focused on the ...\n\n38 minutes ago\n\nBullying and Assault issues at QVS\n\nMinister for Education, Aseri Radrodro says the extent of the bullying as highlighted by the Principal however will need to be verified by the ...\n\nDoctor Alipate Vakamocea on fijivillage Straight Talk with Vijay Narayan\n\nFiji Medical Association President, Doctor Alipate Vakamocea will appear on fijivillage Straight Talk with Vijay Narayan\n\nThe show will focus on ...\n\n17 days ago\n\nMore In Depth","url":"https://www.fijivillage.com/news/Since-Donald-Trump-last-met-Kim-Jong-Un-the-dictator-has-made-a-powerful-new-ally--Vladimir-Putin-fx4r85/","image":"https://www.fijivillage.com/news_images/984125630674cdc474370a85bfd97f.jpg","video":null,"publish_date":"2024-12-02 00:27:34","author":"Abc.net.au","authors":["Abc.net.au"],"language":"en","category":"politics","source_country":"fj","sentiment":0.226},{"id":269531372,"title":"Trump Appoints Daughter Tiffany Father In Law Massad Boulos As Senior Adviser On Middle East Affairs","text":"3 killed, 1 injured in Tesla Cybertruck crash in northern CaliforniaHundreds die as Israel Air Force pilots batter north GazaBolivia faces economic collapse, rampant shortagesMacy's Thanksgiving Day Parade marches into its second century\n\n Trump appoints daughter TIffany's father-in-law Massad Boulos as senior adviser on Middle East AffairsWashington DC [US], December 2 (ANI): US President-elect Donald Trump announced on Sunday that he would appoint Massad Boulos, a Lebanese billionaire and father-in-law of his daughter Tiffany Trump, as his senior adviser on Arab and Middle Eastern affairs.Trump described Boulos as an accomplished lawyer and a respected business leader with extensive international experience. He highlighted Boulos' long-standing support for Republican and Conservative values, as well as his instrumental role in fostering strong relationships with the Arab American community during the campaign.\"I am proud to announce that Massad Boulos will serve as Senior Advisor to the President on Arab and Middle Eastern affairs. Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene. He has been a longtime proponent of Republican and Conservative values, an asset to my Campaign, and was instrumental in building tremendous new coalitions with the Arab American Community. Massad is a dealmaker and an unwavering supporter of PEACE in the Middle East. He will be a strong advocate for the United States, and its interests, and I am pleased to have him on our team!\" Trump said in a social media post on Truth Social.According to The Hill, this appointment is part of a broader trend of family connections in Trump's administration, with Trump previously announcing the nomination of Charles Kushner, the father of his son-in-law Jared Kushner, as ambassador to France.While Jared and Ivanka Trump had roles during the first term, they are not expected to return for Trump's second term, The Hill reported.Massad Boulos is the father of Michael Boulos, who married Tiffany Trump, the president-elect's youngest daughter, in 2022. Massad Boulos leads the family-owned automotive company, SCOA Nigeria. He is known for his efforts in Michigan, where he helped Trump gain support among Arab American voters, contributing to the president-elect's victory in the state.Boulos' role will likely be pivotal in shaping Trump's Middle East policies, especially in light of the ongoing conflict between Israel and Gaza following the October 7 Hamas attack on Israel.(ANI) \n\n Trump appoints daughter TIffany's father-in-law Massad Boulos as senior adviser on Middle East AffairsTrump appoints daughter TIffany's father-in-law Massad Boulos as senior adviser on Middle East AffairsANI 2nd December 2024, 10:37 GMT+11Washington DC [US], December 2 (ANI): US President-elect Donald Trump announced on Sunday that he would appoint Massad Boulos, a Lebanese billionaire and father-in-law of his daughter Tiffany Trump, as his senior adviser on Arab and Middle Eastern affairs.Trump described Boulos as an accomplished lawyer and a respected business leader with extensive international experience. He highlighted Boulos' long-standing support for Republican and Conservative values, as well as his instrumental role in fostering strong relationships with the Arab American community during the campaign.\"I am proud to announce that Massad Boulos will serve as Senior Advisor to the President on Arab and Middle Eastern affairs. Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene. He has been a longtime proponent of Republican and Conservative values, an asset to my Campaign, and was instrumental in building tremendous new coalitions with the Arab American Community. Massad is a dealmaker and an unwavering supporter of PEACE in the Middle East. He will be a strong advocate for the United States, and its interests, and I am pleased to have him on our team!\" Trump said in a social media post on Truth Social.According to The Hill, this appointment is part of a broader trend of family connections in Trump's administration, with Trump previously announcing the nomination of Charles Kushner, the father of his son-in-law Jared Kushner, as ambassador to France.While Jared and Ivanka Trump had roles during the first term, they are not expected to return for Trump's second term, The Hill reported.Massad Boulos is the father of Michael Boulos, who married Tiffany Trump, the president-elect's youngest daughter, in 2022. Massad Boulos leads the family-owned automotive company, SCOA Nigeria. He is known for his efforts in Michigan, where he helped Trump gain support among Arab American voters, contributing to the president-elect's victory in the state.Boulos' role will likely be pivotal in shaping Trump's Middle East policies, especially in light of the ongoing conflict between Israel and Gaza following the October 7 Hamas attack on Israel.(ANI) \n\n Read This Next Harboring Hope: Plastic-free tourism takes lead as first ship arrives at Saint Martin'sLandmark fish and meat markets in London to closeTrade tariffs make it harder to keep prices low, IKEA executive saysFederal agency raises size of most single-family loans to $806,500HP, Dell's weak forecasts spark share selloff \n\nBig News Network ASSOCIATESBig News Network News AgencyMidwest Radio NetworkMainstream Media BIG NEWS NETWORK.COM About us Contact & SupportTerms & ConditionsSitemap PRODUCTS & SERVICES News Releases NewsletterArchive FOLLOW US Facebook Twitter Google+ RSS Feeds Copyright © 1998-2024 Big News Network All rights reserved. ISSN: 2616-6917","url":"https://www.bignewsnetwork.com/news/274808721/trump-appoints-daughter-tiffany-father-in-law-massad-boulos-as-senior-adviser-on-middle-east-affairs","image":"https://static.bignewsnetwork.com/bnn/images/big-news-network-slogan.jpg","video":null,"publish_date":"2024-12-02 00:23:31","author":null,"language":"en","source_country":"us","sentiment":0.103},{"id":269533996,"title":"Bernie Sanders: 'Elon Musk Is Right' On Wasteful Defense Spending","text":"On Sunday, Sen. Bernie Sanders (I-Vt.) took to social media to express his agreement with Elon Musk regarding the Pentagon’s financial management.\n\nWhat Happened: Sanders highlighted the Pentagon’s $886 billion budget and its failure to pass audits for the seventh consecutive year in a post on X.\n\nHe pointed out that billions have gone unaccounted for, emphasizing the need for reform. Sanders noted that only 13 senators opposed the defense budget last year, which he described as being riddled with waste and fraud. He stressed, “That must change.”\n\n— Elon Musk (@elonmusk) December 1, 2024\n\nSee Also: ‘Dr. Doom’ Roubini on Trump’s Second Term: ‘Inflation Will Be Higher, Growth Is Going To Be Lower’\n\nMusk responded to Sanders’ post by posting two U.S. flag emojis. Notably, the Vermont senator has been a vocal critic of Musk. Earlier this year, he criticized the entrepreneur’s reported donations to former President Donald Trump’s campaign, while advocating for publicly funded elections\n\nWhy It Matters: Sanders’ statement comes amid broader debates on military spending and technological advancements in warfare.\n\nRecently, Musk has been vocal about transforming military strategies, advocating for drones and AI over traditional fighter jets.\n\nMusk, appointed by Trump to co-lead the Department of Government Efficiency (DOGE), criticized the F-35 program, advocating for drones over manned jets. Musk called manned jets like the F-35 outdated, sparking a defense from the Pentagon and Lockheed Martin, who highlighted the jet’s global demand despite cost overruns and delays. Musk's remarks aligned with his broader concerns about government overspending and fiscal responsibility.\n\nDOGE, led by Musk and Vivek Ramaswamy, aims to cut wasteful federal spending, raising concerns for defense contractors as the $877 billion defense budget faces scrutiny. While defense stocks risk a downturn, government IT firms specializing in AI, cybersecurity, and efficiency technologies could emerge as winners in this sector shakeup.\n\nDespite ongoing discussions about wasteful defense spending, some exchange-traded funds in this sector have climbed since Trump's election. The iShares US Aerospace & Defense ETF ITA gained nearly 7.1% during this time, while the Global X Defense Tech ETF SHLF surged 39.2%.\n\nImage via Shutterstock\n\nDid You Know?\n\nCongress Is Making Huge Investments. Get Tips On What They Bought And Sold Ahead Of The 2024 Election With Our Easy-to-Use Tool\n\nThis story was generated using Benzinga Neuro and edited by Shivdeep Dhaliwal\n\nMarket News and Data brought to you by Benzinga APIs\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.","summary":"On Sunday, Dec. 1, 2024, Bernie Sanders echoed Elon Musk's concerns about Pentagon waste, citing unpassed audits and an $886 billion defense budget as areas needing urgent reform.\n\n\nread more","url":"https://www.benzinga.com/24/12/42258137/bernie-sanders-elon-musk-is-right-on-wasteful-defense-spending","image":"https://cdn.benzinga.com/files/images/story/2024/12/01/What-Sanders-Really-Said-.jpeg?width=1200&height=800&fit=crop","video":null,"publish_date":"2024-12-02 00:23:08","author":"Shivdeep Dhaliwal","authors":["Shivdeep Dhaliwal"],"language":"en","category":"politics","source_country":"us","sentiment":-0.36},{"id":269536510,"title":"Who is Massad Boulos? Trump's pick for adviser on Arab, Middle Eastern affairs","text":"US President-elect Donald Trump appointed his daughter Tiffany Trump's father-in-law and a Lebanese-born billionaire Massad Boulos as senior adviser for Arab and Middle Eastern affairs.Trump announced via Truth Social, commending Boulos's legal expertise and his dedication to Middle Eastern peace initiatives.\"I am proud to announce that Massad Boulos will serve as Senior Advisor to the President on Arab and Middle Eastern affairs. Massad is an accomplished lawyer and a highly respected leader in the business world, with extensive experience on the International scene,\" Trump wrote. \"Massad is a dealmaker, and an unwavering supporter of PEACE in the Middle East. He will be a strong advocate for the United States, and its interests.\"— TrumpDailyPosts (@TrumpDailyPosts) This is for the second time, a family member has been assigned with a role in Trump's new cabinet. Earlier, Trump offered a position in his administration to Charles Kushner, his daughter Ivanka’s father-in-law, to serve as ambassador to France.Trump has long turned to his family members to serve in political roles, raising questions about conflicts of interest and nepotism. Who is Massad Boulos?Born in Lebanon, Boulos relocated to Texas during his teenage years to study at the University of Houston. His professional journey began in Nigeria, where he advanced to leadership positions at SCOA Motors and Boulos Enterprises, Newsweek reported.Reports about Boulos's political involvement in Lebanon have been contested. While some sources suggested he contested a parliamentary seat in 2009 and maintained connections with Lebanon's Christian political establishment, Boulos clarified to Newsweek that he holds no party affiliations, though he acknowledges acquaintance with Christian leaders.During a June interview with AP, Boulos acknowledged his friendship with Suleiman Frangieh, who leads the Marada Movement and received Hezbollah's endorsement for the Lebanese presidency. Hezbollah's leader Hassan Nasrallah, who supported Frangieh's candidacy in 2023, was killed in an Israeli airstrike on Beirut in September.What is Boulos role in Trump campaign?Before the election last month, Boulos played a major unofficial role in the Trump campaign, courting Arab American voters who Republican strategists hoped would support Trump out of frustration with President Biden’s support for Israel. Despite Trump’s own defiantly pro-Israel policies during his first term as president, Boulos worked to build support for him in heavily Arab American and Muslim corners of Michigan, New York Times reported.Who are there in his family members?Although there are very less information about his private space, but his connection with Donald Trump is surely on every internet posts. Boulos' son Michael is married to Tiffany Trump in 2022. Boulos has recently focused on garnering Arab American support for Trump's campaign, particularly in Michigan. Sources indicate he has also facilitated communications between Trump and Palestinian President Mahmoud Abbas.","summary":"President-elect Trump has appointed Massad Boulos, Lebanese-born and Tiffany Trump's father-in-law, as Senior Advisor for Arab and Middle Eastern affairs. Boulos, a legal expert and peace advocate, aims to strengthen U.S. interests in the region. Previously, Trump offered a role to Charles Kushner, Ivanka's father-in-law.","url":"https://timesofindia.indiatimes.com/world/us/who-is-massad-boulos-donald-trumps-pick-for-adviser-on-arab-middle-eastern-affairs/articleshow/115879553.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115879654/115879654.jpg","video":null,"publish_date":"2024-12-02 00:20:32","author":"Toi World Desk","authors":["Toi World Desk"],"language":"en","category":"politics","source_country":"IN","sentiment":0.22},{"id":269531602,"title":"Bernie Sanders praises DOGE boss Elon Musk over defense spending","text":"Bernie Sanders has praised Elon Musk over plans by the tech billionaire’s new Department of Government Efficiency (DOGE) to cut defense spending.\n\nThe veteran Democratic Senator, from Vermont, tweeted criticism for the department on Sunday, claiming that it had managed to “lose track of billions.”\n\n“Elon Musk is right. The Pentagon, with a budget of $886 billion, just failed its 7th audit in a row. It’s lost track of billions,” he wrote. “Last year, only 13 senators voted against the Military Industrial Complex and a defense budget full of waste and fraud. That must change.”\n\nMusk responded to Sanders’s post on Sunday with two American flag emojis.\n\nThe Vermont Senator isn’t the only Democratic lawmaker who has indicated they would be open to working with DOGE on reducing defense spending. Democratic Congressman Ro Khanna recently called out “waste, fraud and abuse” by the Department of Defense, also noting its failed audits.\n\n“When it comes to cutting waste, fraud, and abuse and opening the 5 primes to more competition, there are Democrats on [the House Armed Services Committee] who will work with @elonmusk and @DOGE,” Khanna wrote in a post on X.\n\nCongress has mandated that the Defense Department must pass an audit by fiscal year 2028.\n\nDonald Trump previously named the SpaceX boss and former GOP presidential primary candidate Vivek Ramaswamy to head his government efficiency effort.\n\nSanders and Musk have in fact found common ground previously, with both men having shown support for making diabetes and weight loss drugs like Ozempic and Wegovy less expensive.\n\n\"Elon Musk, not one of my great political allies, recently posted on Twitter, and I quote ‘solving obesity reduces the risk of other diseases especially diabetes and improves quality of life, we do need to make appetite inhibitors available to anyone who wants them.’ Mr Musk is right.”\n\nResponding to a video of Sanders’s remarks, Musk wrote on X, “I really am with Bernie on this one.”\n\nHowever, Sanders has frequently criticized Musk for his vast accumulation of wealth, his millions in donations to Trump’s 2024 campaign and his acceptance of government contracts to fund his company SpaceX.","summary":"The veteran Democratic Senator, from Vermont, tweeted criticism for the department on Sunday, claiming it had managed to ‘lose track of billions’","url":"https://www.independent.co.uk/news/world/americas/us-politics/bernie-sanders-elon-musk-doge-defense-b2657049.html","image":"https://static.independent.co.uk/2024/11/21/00/ISRAEL-EEUU_06505.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/Iwd2iBBM-OhrQWqOm.mp4","publish_date":"2024-12-02 00:17:57","author":"Mike Bedigan","authors":["Mike Bedigan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.037},{"id":269530208,"title":"When The Left Freaks Out I Get More Excited About Trumps Second Term N4934753","text":"The hysteria from the left over Trump’s potential second term is enough to make any conservative cheer. The latest meltdown centers on Trump’s announcement that he will nominate Kash Patel as FBI director. We knew the meltdown would come last week when it was first leaked that Patel was likely to be tapped.\n\nNaturally, the left is trashing him. He’s been dismissed as a loyalist and a children’s book author—anything to push the narrative he’s not qualified for the role. They spin apocalyptic yarns about how he’ll destroy the bureau’s “independence.”\n\nTake MSNBC political analyst Tim Miller, for instance. He declared Patel “the most dangerous nominee that we’ve seen yet to our democracy.” Tom Nichols went even further, calling the pick “preposterous and yet extraordinarily dangerous.” \n\nNEW: Staff writer for The Atlantic Tom Nichols is freaking out on MSNBC over the nomination of Kash Patel as Director of the FBI and claims he is “as dangerous as it gets” because “he believes in nothing except serving Donald Trump.”“Patel is about as dangerous as it gets.”… pic.twitter.com/3xeI96BqoS— RedWave Press (@RedWave_Press) December 1, 2024\n\nTheir reaction tells you everything you need to know.\n\nFrank Figliuzzi, a former FBI assistant director, slammed Patel’s plan to downsize the FBI headquarters by 7,000 employees, calling the proposal “ignorant.” He warned on MSNBC that such a shift would “make America less safe, not more safe,” painting a grim picture of diminished global capabilities and field office mismanagement. He also predicted a “total hijacking of the federal law enforcement system,” claiming Trump would use the FBI to target his political enemies.\n\nFrank Figliuzzi on Kash Patel: \"This so-called axe he has to grind is really Donald Trump's axe, and he seems quite willing to wield it in whatever direction.\" pic.twitter.com/OhIYPQQOrY— The Post Millennial (@TPostMillennial) December 1, 2024\n\nFormer Deputy FBI Director Andrew McCabe chimed in with his own brand of hyperbole, comparing Patel’s potential leadership to the FBI’s “pre-Watergate” days. McCabe warned that this was a “terrible development” for both the agency and the nation, predicting Trump would turn the FBI into a tool for his “political agenda.”\n\nJUST IN: Former deputy FBI director Andrew McCabe rushes to CNN to whine about how \"dangerous\" Trump's nomination of Kash Patel is, says it's \"terrible\" for the \"men and women\" of the FBI.Amazing.\"It's a terrible development for the men and women of the FBI and also for… pic.twitter.com/QbArxg3rd3— Collin Rugg (@CollinRugg) December 1, 2024\n\nBut here’s the part the media conveniently ignores: Kash Patel is no lightweight. He played a major role in exposing the Democrats’ fake Russian collusion narrative. During the first Trump administration, Patel served in several key roles, including chief of staff at the Department of Defense, deputy director of National Intelligence, and senior director for counterterrorism at the National Security Council.\n\nIn announcing Patel’s nomination, Trump said that the FBI on Patel’s watch will “end the growing crime epidemic in America, dismantle the migrant criminal gangs, and stop the evil scourge of human and drug trafficking across the Border.\" He added, \"Kash will work under our great Attorney General, Pam Bondi, to bring back Fidelity, Bravery, and Integrity to the FBI.”\n\nThat's exactly what the left is worried about.","url":"https://pjmedia.com/matt-margolis/2024/12/01/when-the-left-freaks-out-i-get-more-excited-about-trumps-second-term-n4934753","image":"https://media.townhall.com/cdn/hodl/2024/94/ce186717-ee78-4241-b121-a4c82f829596.png","video":null,"publish_date":"2024-12-02 00:17:32","author":"Matt Margolis","authors":["Matt Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.116},{"id":269530204,"title":"John Bolton Is So Upset About Kash Patel He May Need Psychiatric Help N4934756","text":"It’s a glorious time to be alive. \n\nWith Trump’s pick of Kash Patel to be FBI director, the deeply threatened Beltway elites are howling more loudly than ever. No one more imitating a stuck pig more convincingly than John Bolton, the establishment Republican’s establishment Republican, who has decided that the Patel appointment is a good time to try out his sky-is-falling act. And who knows? He might end up being more successful with it than he was with his diplomatic career.\n\nFox News reported Sunday that Bolton, who has been enraged at Trump ever since he was fired from the first Trump administration for advocating that the U.S. get involved in more endless and unnecessary wars, sent a statement about the Patel appointment to Kristin Welker of NBC’s \"Meet the Press.\" Welker wrote on X: “Trump’s former National Security Advisor John Bolton tells @NBCNews: ‘Trump has nominated Kash Patel to be his Lavrenty Beria. Fortunately, the FBI is not the NKVD. The Senate should reject this nomination 100-0.’”\n\nKash Patel is Beria now? This was shocking despite that fact that reckless, overheated, hysterical, and defamatory rhetoric about Donald Trump has become commonplace. The Democrats have been relentlessly smearing Trump as an “insurrectionist” ever since their fake “insurrection” of Jan. 6, and before that, painted him without a shred of evidence as a foreign agent, a pawn of Vladimir Putin. All that was bad enough, but in his shot at Patel, Bolton went even farther. In the febrile mind of the failed National Security Adviser, Trump is not only a threat to “our democracy” and a catspaw of the Russians; he is nothing less than a new Stalin. \n\nBeria, you see, was the head of the NKVD, the Soviet secret police and one of the precursors to the KGB. Beria was the terrifying edge of Stalin’s regime as Uncle Joe consolidated his power, eliminated his Bolshevik rivals, and waged brutal war against his own people as he solidified the hold of the Soviet tyranny over the nations he controlled. Beria, always acting with Stalin’s approval, was responsible for the massacre of 22,000 Poles in the Katyn Forest in 1940.\n\nThat same year, Beria sent hundreds of thousands of Poles, Lithuanians, Latvians, Estonians, and Romanians to Siberia, or just directly to prison camps, for the crime of having the wrong ethnicity; Stalin wanted to fill his new territories with Russians. Beria was behind the purge of officers from the Red Army who were suspected of being insufficiently loyal to the Soviet state. He was also behind the institutionalized terrorizing of the people of the Soviet Union, who could no longer be sure, no matter how loyal they were and how hard they worked, that they could avoid the knock on the door at 4 a.m. and a trip to the Gulag. That was how Stalin kept his people in line and ensured that they would be eager to demonstrate their loyalty to the Workers’ Paradise.\n\nBeria was a ruthless killer, a remorseless enforcer for a brutal and conscienceless tyrant who thought no more of the mass murder of his own people than he did of what he was going to have for breakfast on any given morning.\n\nThat, in Bolton's mind, is Kash Patel. Now, this sort of thing is the height of irrationality, and so to subject such an unhinged claim to rational analysis is to dignify it beyond any attention it actually deserves, but since John Bolton was once a respected member of the foreign policy establishment, a brief explanation is in order. John Bolton apparently wants you to believe that if he gets his way, Trump will become a new Stalin, and his Beria, Patel, will be put to work not cleaning out the desperately corrupt and thoroughly politicized FBI, but rounding up Democrats and Never Trumpers for the new American Gulags, where they will get a bullet to the back of the neck for opposing the great leader.\n\nIt’s Official — Trump Names Deep State Foe Kash Patel FBI Director\n\nOf all the hysteria we have seen from foes of Donald Trump, John Bolton’s wins the prize. With his statements on Kash Patel, Bolton has won the prize. He is far and away the most crazed sufferer of Trump Derangement Syndrome in the nation and the world today. He is in urgent need of psychiatric help. We can only hope that he gets it. \n\nWhat is really happening is that the elites are looking at the derailment of the gravy train. With almost every new appointment, Trump is making it clear that he is absolutely serious about taking on the deep state and draining the swamp. The howls of the elites who assumed they were made men and could never be ousted, and who now face the very real prospect of exactly that, make Trump’s appointments all the sweeter. Who will emerge victorious from the great struggle that is about to begin between the bureaucratic elites and the people is anybody’s guess. At very least, however, we can be grateful that finally the battle has been joined.","url":"https://pjmedia.com/robert-spencer/2024/12/01/john-bolton-is-so-upset-about-kash-patel-he-may-need-psychiatric-help-n4934756","image":"https://media.townhall.com/cdn/hodl/2018/136/ac84f123-51b4-4ba2-95f4-ad3ceeb5982e.jpg","video":null,"publish_date":"2024-12-02 00:17:32","author":"Robert Spencer","authors":["Robert Spencer"],"language":"en","source_country":"us","sentiment":-0.402}]}