{"offset":0,"number":50,"available":10210,"news":[{"id":345795796,"title":"Thailand, Cambodia to hold talks to end deadly clashes","text":"The leaders of Thailand and Cambodia will attend mediation talks over their deadly border conflict in Malaysia, even as both sides accused each other of launching fresh artillery strikes across contested areas.\n\nTalks are scheduled to begin at 5pm AEST, with acting Prime Minister Phumtham Wechayachai leading the Thai negotiating team, the government announced in a statement.\n\nMalaysia, which chairs the ASEAN regional co-operation forum, has informed the Thai government that Cambodian Prime Minister Hun Manet would also be attending the talks, the statement said.\n\nTensions between Thailand and Cambodia have intensified since the late-May killing of a Cambodian soldier during a brief border skirmish. Border troops on both sides were reinforced amid a full-blown diplomatic crisis that brought Thailand's fragile coalition government to the brink of collapse.\n\nHostilities resumed on Thursday and, within just four days, escalated into the worst fighting between the Southeast Asian neighbours in more than a decade.\n\nThe death toll has risen above 30, including 13 civilians in Thailand and eight in Cambodia, while authorities report that more than 200,000 people have been evacuated from border areas.\n\nMonday's talks come after Malaysian Prime Minister Anwar Ibrahim last week proposed a ceasefire and US President Donald Trump said on Saturday that the two leaders had agreed to work on a ceasefire.\n\nSecretary of State Marco Rubio said State Department officials were in Malaysia to assist peace efforts.\n\n\"We want this conflict to end as soon as possible,\" he said.\n\nBangkok and Phnom Penh have each accused the other side of sparking last week's hostilities.\n\nCambodia's Defence Ministry said Thailand had shelled and launched ground assaults on Sunday morning at a number of points along the border. The ministry's spokesperson said heavy artillery was fired at historic temple complexes.\n\nThe Thai army said Cambodian forces had fired shots into several areas, including near civilian homes, on Sunday, and were mobilising long-range rocket launchers.\n\n\"The situation remains tense and Cambodian troops may be preparing intensified military operations to inflict maximum damage in the final stages before negotiations,\" the army said in an update.\n\nIn the Thai province of Sisaket, Reuters reporters heard shelling throughout Sunday and said it was unclear which side of the border it was on.\n\nA government health clinic about 10km from the border had shattered windows, collapsed walls and exposed wiring. Local media reported it was hit by artillery on Saturday, two days after the building and surrounding neighbourhood was evacuated.\n\nThailand and Cambodia have bickered for decades over undemarcated points along their 817km land border, with ownership of the ancient Hindu temples Ta Moan Thom and the 11th century Preah Vihear central to the disputes.\n\nPreah Vihear was awarded to Cambodia by the International Court of Justice in 1962, but the situation worsened in 2008 after Cambodia attempted to list it as a UNESCO World Heritage site. Skirmishes over several years brought at least a dozen deaths.\n\nCambodia said in June it had asked the International Court of Justice to resolve its disputes with Thailand. Bangkok says it has never recognised the court's jurisdiction and prefers a bilateral approach.","summary":"Thailand and Cambodia have agreed to hold talks in Malaysia in an attempt to negotiate an end to a conflict that has lasted four days.","url":"https://thewest.com.au/news/conflict/thailand-cambodia-to-hold-talks-to-end-deadly-clashes-c-19496460","image":"https://images.thewest.com.au/publication/C-19496460/56efbbed049f6903e9397fefab3cecf9535aae8c-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-07-28 00:58:34","author":"Shoon Naing","authors":["Shoon Naing"],"language":"en","source_country":"au","sentiment":-0.207},{"id":345796868,"title":"US officials in Malaysia to help in Cambodia-Thailand talks, says Rubio","text":"WASHINGTON: United States Secretary of State Marco Rubio said State Department officials are in Malaysia to assist peace efforts, with Cambodia and Thailand scheduled to begin talks on Monday (Jul 28) in hopes of a ceasefire.\n\nPresident Donald Trump and Rubio were engaged with their counterparts for each country and were monitoring the situation very closely, Rubio said in a statement released by the State Department late on Sunday in the US.\n\n\"We want this conflict to end as soon as possible,\" he said. \"State Department officials are on the ground in Malaysia to assist these peace efforts.\"\n\nThe leaders of Thailand and Cambodia were scheduled to attend mediation talks over their deadly border conflict in Malaysia on Monday, the Thai government said, as both sides accused each other of launching fresh artillery strikes across contested areas.\n\nTensions between Thailand and Cambodia have intensified since the late-May killing of a Cambodian soldier during a brief border skirmish. Border troops on both sides were reinforced amid a full-blown diplomatic crisis that brought Thailand's fragile coalition government to the brink of collapse.\n\nHostilities resumed on Thursday and, within just four days, escalated into the worst fighting between the Southeast Asian neighbours in more than a decade.\n\nThe death toll has risen above 30, including 13 civilians in Thailand and eight in Cambodia, while authorities report that more than 200,000 people have been evacuated from border areas.\n\nRubio, in separate phone calls on Sunday with Cambodian Foreign Minister Prak Sokhonn and Thai Foreign Minister Maris Sangiampongsa, urged both countries to \"de-escalate tensions immediately\" and agree to a ceasefire with each other, a US State Department spokesperson said in a statement.\n\nRubio also reiterated US President Trump’s desire for peace and the importance of an immediate ceasefire. \n\n\"The United States is prepared to facilitate future discussions in order to ensure peace and stability between Thailand and Cambodia.\"","summary":"\"We want this conflict to end as soon as possible,\" says US Secretary of State Marco Rubio","url":"https://www.channelnewsasia.com/asia/cambodia-thailand-ceasefire-talks-malaysia-us-officials-5261816","image":"https://dam.mediacorp.sg/image/upload/s--hpluAzfB--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2025/07/28/ap25208369844707.jpg?itok=gkd7qi2L","video":null,"publish_date":"2025-07-28 00:50:00","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":0.214},{"id":345796462,"title":"Rubio says US officials are in Malaysia to help in Cambodia-Thailand talks","text":"Marco Rubio said he and President Donald Trump were actively engaging with counterparts from both countries and closely monitoring the situation. (AFP pic)\nWASHINGTON: US secretary of state Marco Rubio said state department officials were in Malaysia to assist peace efforts as Cambodia and Thailand were scheduled to begin talks there on Monday in hopes for a ceasefire.\nPresident Donald Trump and Rubio were engaged with their counterparts for each country and were monitoring the situation very closely, Rubio said in a statement released by the state department late on Sunday in the US and early Monday in Asia.\n\"We want this conflict to end as soon as possible,\" he said. \"State department officials are on the ground in Malaysia to assist these peace efforts.\"\nThe leaders of Thailand and Cambodia were scheduled to attend mediation talks over their deadly border conflict in Malaysia on Monday, the Thai government said, as both sides accused each other of launching fresh artillery strikes across contested areas.\nTensions between Thailand and Cambodia have intensified since the late-May killing of a Cambodian soldier during a brief border skirmish.\nBorder troops on both sides were reinforced amid a full-blown diplomatic crisis that brought Thailand's fragile coalition government to the brink of collapse.\nHostilities resumed on Thursday and, within just four days, escalated into the worst fighting between the Southeast Asian neighbours in more than a decade.\nThe death toll has risen above 30, including 13 civilians in Thailand and eight in Cambodia, while authorities report that more than 200,000 people have been evacuated from border areas.\nTrump said on Sunday he believed both Thailand and Cambodia wanted to settle their differences after he told the leaders of both countries that he would not conclude trade deals with them unless they ended their fighting.","summary":"The US secretary of state urges an end to the deadly border conflict as both sides trade blame over fresh artillery strikes.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/07/28/rubio-says-us-officials-are-in-malaysia-to-help-in-cambodia-thailand-talks","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/04/730ff8e3-marco-rubio-27032025.webp","video":null,"publish_date":"2025-07-28 00:49:46","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.142},{"id":345796982,"title":"US, China to resume tariff talks in effort to extend truce","text":"STOCKHOLM: Senior US and Chinese negotiators meet in Stockholm on Monday to tackle longstanding economic disputes at the centre of the countries’ trade war, aiming to extend a truce keeping sharply higher tariffs at bay.\n\nChina is facing an August 12 deadline to reach a durable tariff agreement with President Donald Trump’s administration, after Beijing and Washington reached a preliminary deal in June to end weeks of escalating tit-for-tat tariffs.\n\nWithout an agreement, global supply chains could face renewed turmoil from duties exceeding 100%.\n\nThe Stockholm talks, led by US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng, take place a day after European Commission President Ursula von der Leyen meets Trump at his golf course in Scotland to try to clinch a deal that would likely see a 15% baseline tariff on most EU goods.\n\nTrade analysts on both sides of the Pacific say the discussions in the Swedish capital are unlikely to produce any breakthroughs but could prevent further escalation and help create conditions for Trump and Chinese President Xi Jinping to meet later this year.\n\nPrevious US-China trade talks in Geneva and London in May and June focused on bringing US and Chinese retaliatory tariffs down from triple-digit levels and restoring the flow of rare earth minerals halted by China and Nvidia H20 AI chips and other goods halted by the United States.\n\nSo far, the talks have not delved into broader economic issues. They include US complaints that China’s state-led, export-driven model is flooding world markets with cheap goods, and Beijing’s complaints that US national security export controls on tech goods seek to stunt Chinese growth.\n\n“Stockholm will be the first meaningful round of US-China trade talks,” said Bo Zhengyuan, Shanghai-based partner at China consultancy firm Plenum.\n\nTrump has been successful in pressuring some other trading partners, including Japan, Vietnam and the Philippines, into deals accepting higher US tariffs of 15% to 20%.\n\nHe said there was a 50-50 chance that the US and the 27-member European Union could also reach a framework trade pact, adding that Brussels wanted to “make a deal very badly”.\n\nTwo of Trump’s top trade officials, Commerce Secretary Howard Lutnick and US Trade Representative Jamieson Greer, will attend the Scotland talks and then travel to Stockholm.\n\nAnalysts say the US-China negotiations are far more complex and will require more time. China’s grip on the global market for rare earth minerals and magnets, used in everything from military hardware to car windshield wiper motors, has proved to be an effective leverage point on US industries.\n\nIn the background of the talks is speculation about a possible meeting between Trump and Xi in late October.\n\nTrump has said he will decide soon whether to visit China in a landmark trip to address trade and security tensions. A new flare-up of tariffs and export controls would likely derail any plans for a meeting with Xi.","summary":"STOCKHOLM: Senior US and Chinese negotiators meet in Stockholm on Monday to tackle longstanding economic disputes at the centre of the countries’ trade war, aiming to extend a truce keeping sharply higher tariffs at bay.\n\n\n\nChina is facing an August 12 deadline to reach a durable tariff agreement with President Donald Trump’s administration, after Beijing and Washington reached a preliminary deal in June to end weeks of escalating tit-for-tat tariffs.\n\n\n\nWithout an agreement, global supply chains could face renewed turmoil from duties exceeding 100%.\n\n\n\nThe Stockholm talks, led by US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng, take place a day after European Commission President Ursula von der Leyen meets Trump at his golf course in Scotland to try to clinch a deal that would likely see a 15% baseline tariff on most EU goods.\n\n\n\nTrade analysts on both sides of the Pacific say the discussions in the Swedish capital are unlikely to produce any breakthroughs but could prevent further esc","url":"https://www.brecorder.com/news/40374809/us-china-to-resume-tariff-talks-in-effort-to-extend-truce","image":"https://i.brecorder.com/large/2025/07/6886a0f94410a.jpg","video":null,"publish_date":"2025-07-28 00:42:56","author":"Reuters,Us Treasury Secretary","authors":["Reuters","Us Treasury Secretary"],"language":"en","category":"politics","source_country":"pk","sentiment":0.279},{"id":345796980,"title":"Fed poised to hold off on rate cuts, defying Trump pressure","text":"WASHINGTON: The US central bank is widely expected to hold off slashing interest rates again at its upcoming meeting, as officials gather under the cloud of an intensifying pressure campaign by President Donald Trump.\n\nPolicymakers at the independent Federal Reserve have kept the benchmark lending rate steady since the start of the year as they monitor how Trump’s sweeping tariffs are impacting the world’s biggest economy.\n\nWith Trump’s on-again, off-again tariff approach — and the levies’ lagged effects on inflation — Fed officials want to see economic data from this summer to gauge how prices are being affected.\n\nWhen mulling changes to interest rates, the central bank — which meets on Tuesday and Wednesday — seeks a balance between reining in inflation and the health of the jobs market.\n\nBut the bank’s data-dependent approach has enraged the Republican president, who has repeatedly criticized Fed Chair Jerome Powell for not slashing rates further, calling him a “numbskull” and “moron.”\n\nMost recently, Trump signaled he could use the Fed’s $2.5 billion renovation project as an avenue to oust Powell, before backing off and saying that would be unlikely.\n\nTrump visited the Fed construction site on Thursday, making a tense appearance with Powell in which the Fed chair disputed Trump’s characterization of the total cost of the refurbishment in front of the cameras.\n\nBut economists expect the Fed to look past the political pressure at its policy meeting.\n\n“We’re just now beginning to see the evidence of tariffs’ impact on inflation,” said Ryan Sweet, chief US economist at Oxford Economics.\n\n“We’re going to see it (too) in July and August, and we think that’s going to give the Fed reason to remain on the sidelines,” he told AFP.\n\nSince returning to the presidency in January, Trump has imposed a 10 percent tariff on goods from almost all countries, as well as steeper rates on steel, aluminum and autos.\n\nThe effect on inflation has so far been limited, prompting the US leader to use this as grounds for calling for interest rates to be lowered by three percentage points.\n\nCurrently, the benchmark lending rate stands at a range between 4.25 percent and 4.50 percent.\n\nTrump also argues that lower rates would save the government money on interest payments, and floated the idea of firing Powell. The comments roiled financial markets.\n\n“Powell can see that the administration floated this trial balloon” of ousting him before walking it back on the market’s reaction, Sweet said.\n\n“It showed that markets value an independent central bank,” the Oxford Economics analyst added, anticipating Powell will be instead more influenced by labor market concerns.\n\nPowell’s term as Fed chair ends in May 2026.\n\nAnalysts expect to see a couple of members break ranks if the Fed’s rate-setting committee decides for a fifth straight meeting to keep interest rates unchanged.\n\nSweet cautioned that some observers may spin dissents as pushback on Powell but argued this is not necessarily the case.\n\n“It’s not out-of-line or unusual to see, at times when there’s a high degree of uncertainty, or maybe a turning point in policy, that you get one or two people dissenting,” said Nationwide chief economist Kathy Bostjancic.\n\nFed Governor Christopher Waller and Vice Chair for Supervision Michelle Bowman have both signaled openness to rate cuts as early as July, meaning their disagreement with a decision to hold rates steady would not surprise markets.","summary":"WASHINGTON: The US central bank is widely expected to hold off slashing interest rates again at its upcoming meeting, as officials gather under the cloud of an intensifying pressure campaign by President Donald Trump.\n\n\n\nPolicymakers at the independent Federal Reserve have kept the benchmark lending rate steady since the start of the year as they monitor how Trump’s sweeping tariffs are impacting the world’s biggest economy.\n\n\n\nWith Trump’s on-again, off-again tariff approach — and the levies’ lagged effects on inflation — Fed officials want to see economic data from this summer to gauge how prices are being affected.\n\n\n\nWhen mulling changes to interest rates, the central bank — which meets on Tuesday and Wednesday — seeks a balance between reining in inflation and the health of the jobs market.\n\n\n\nBut the bank’s data-dependent approach has enraged the Republican president, who has repeatedly criticized Fed Chair Jerome Powell for not slashing rates further, calling him a “numbskull” and “moron.”\n\n\n\nMost rece","url":"https://www.brecorder.com/news/40374811/fed-poised-to-hold-off-on-rate-cuts-defying-trump-pressure","image":"https://i.brecorder.com/large/2025/07/6886a15538e43.jpg","video":null,"publish_date":"2025-07-28 00:42:56","author":"AFP,President Donald Trump","authors":["AFP","President Donald Trump"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.176},{"id":345791658,"title":"\"Burned through all of their goodwill\": Asmongold criticises Donald Trump for delays in release of the Epstein Files","text":"Political commentator Zack \"Asmongold\" recently opined on the delays in the release of the documents related to Jeffrey Epstein and his ongoing criminal case (regarding the sexual abuse of minors) under the presidency of Donald Trump. The President had promised to release the files while campaigning for the United States general elections held in 2024.However, despite Trump winning the election and subsequently taking office, the majority of the files remain closed to public view, with the President's seeming hesitancy to release the files raising eyebrows among political pundits.Addressing these concerns during his broadcast, Asmongold said:\"Oh wow, okay, is sh** gonna happen? The answer is probably f**king not, right? It's the same song and dance. Yes, I don't want to hear about how bad the thing is that you heard about behind closed doors that you can't talk about. I want to hear about the thing that you heard about behind closed doors, and I want the people that are doing it to go to jail.\"He then went on to claim that the current uncertainty about the release of files relating to the criminal proceedings against Jeffrey Epstein and Ghislaine Maxwell is eroding the faith and goodwill of the people of the United States:\"Like, again, I think they have burned through all of their goodwill and all of people's faith because of the delays on the Epstein files and the way Trump has acted regarding the Epstein files.\"\"How long is it going to take?\": Asmongold talks about the release of the files related to investigations into Jeffrey EpsteinJeffrey Epstein is currently one of the most hotly debated topics in United States politics. A large chunk of this discussion is over the public disclosure of files and documents that have been unearthed as part of the criminal investigations that have taken place regarding the exploitation of minors at Epstein's hands and those of his partner, Ghislaine Maxwell.As Trump had made the release of the files a major aspect of his presidential campaign, the failure to deliver on the promise, despite the Trump administration being in power for over six months, has even ardent supporters of the POTUS asking questions about when the documents will be made available.Talking about how the process of releasing the files being stretched longer than anticipated has left him irritated, Asmongold stated:\"Again, Trump did not champion releasing the Epstein files, but he appointed multiple people, including his own vice president, to come on and talk about the Epstein files. So yeah, that's it... Yeah, I just don't want to hear that or see that bullsh**. I think it's very f**king annoying, man. And so yeah, there it is.\"After a viewer pointed out that the Trump administration has been in power for only half a year, Asmongold responded, saying:\"They've been in office less than six months? Well, how long is it going to take? They've only got four years. And so yeah, they've got to push it pretty fast. Did you sign an NDA? Just fucking talk. This song and dance is bullshit. I'm sick of it. Yeah.\"Recently, Asmongold reacted to and expressed support for Trump's reported plans to institutionalize individuals with mental illnesses who \"pose a risk to themselves or the public.\"","summary":"Political commentator Zack \"Asmongold\" recently opined on the delays in the release of the documents related to Jeffrey Epstein and his ongoing criminal case (regarding the sexual abuse of minors) und","url":"https://www.sportskeeda.com/us/streamers/news-burned-goodwill-asmongold-criticises-donald-trump-delays-release-epstein-files","image":"https://staticg.sportskeeda.com/editor/2025/07/bf3a7-17536560221691-1920.jpg","video":null,"publish_date":"2025-07-28 00:41:39","author":"Atharv Kapoor","authors":["Atharv Kapoor"],"language":"en","category":"politics","source_country":"in","sentiment":-0.644},{"id":345791952,"title":"The EU - US Trade deal 27 July 2025 and why it is bad for Europe and a disaster for Ireland!","text":"OK so now we know.\n\nLove him or hate him but Donald J Trump has won this hands down.\n\nIf I read this right there are no tariffs imposed on the USA but there will be on EU exports into America.\n\nWe are also committed to buying vast amounts of...","url":"https://politics.ie/threads/the-eu-us-trade-deal-27-july-2025-and-why-it-is-bad-for-europe-and-a-disaster-for-ireland.292394/","image":"https://politics.ie/data/avatars/l/57/57517.jpg?1592117009","video":null,"publish_date":"2025-07-28 00:36:55","author":"Catapulta","authors":["Catapulta"],"language":"en","source_country":"ie","sentiment":-0.245},{"id":345794372,"title":"From Dialogue to Strategy: Trump’s Shift in Russian War Plan","text":"President Donald Trump’s approach with Russian President Vladimir Putin pivoted drastically this month when, for the first time since returning to the White House, he not only confirmed his support for Ukraine in a NATO arms agreement but issued an ultimatum to the Kremlin chief.\n\nThe warning came in a clear message: Enter into a peace deal with Ukraine or face stiff international sanctions on its top commodity, oil sales.\n\nWhile the move has been championed by some, it has been questioned by others who debate whether it will be enough to deter Putin’s war ambitions in Ukraine. One security expert is arguing the plan will work, but it might take years to be effective.\n\n“Ukraine shouldn’t be restricted merely to shooting down ‘arrows’,” Hardie said. “An optimal approach will combine both offense and defense. Ukraine needs to be able to hit the ‘archer’ and the factories that make the ‘arrows.’\n\n“Putin will continue his unprovoked war so long as he believes it’s sustainable and offers a pathway to achieving his goals,” Hardie argued. “By shoring up Ukraine’s defense of its skies and enabling Ukraine to inflict growing costs on Russia’s war machine, as well as pressuring the Russian economy and exhausting Russia’s offensive potential on the ground, we may be able to change that calculus.”\n\nBut Fleitz, who serves as vice chair of the America First Policy Institute’s Center for American Security, said he believes this war will only be brought to an end when an armistice agreement is secured. \n\n“I think there’s probably going to be an armistice where both sides will agree to suspend the fighting,” Fleitz said. “Someday, we will find a line where both nations will agree to stop fighting.”\n\nUltimately, he believes this will happen by Ukraine agreeing not to join NATO for a certain period of time, though with Moscow’s understanding that Kyiv will be heavily armed by Western allies. \n\n“I think there’s a way to do this where Russia wouldn’t be concerned about growing Western European influence in Ukraine, and Ukraine would not be worried that Russia will invade once a ceasefire or armistice is declared,” he added. “Maybe this is a pipe dream, but I think that’s the most realistic way to stop the fighting.\n\n“We know from history conflicts like this take time; peacemaking takes time,” Fleitz said. “I think that over time, Trump is going to have an effect on Putin.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump’s approach with Russian President Vladimir Putin pivoted drastically this&#8230;\n\n\nThis Post: From Dialogue to Strategy: Trump&#8217;s Shift in Russian War Plan first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/from-dialogue-to-strategy-trumps-shift-in-russian-war-plan/","image":"https://internewscast.com/wp-content/uploads/2025/07/From-talk-to-tactics-Trump-pivots-on-Russia-strategy-to.jpg","video":null,"publish_date":"2025-07-28 00:34:21","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.16},{"id":345794444,"title":"The EU trade agreement — with its favorable terms for the US — proves Trump’s a great dealmaker","text":"President Donald Trump prides himself on his dealmaking skills, and with the agreement he reached Sunday on European trade, he’s got a right to be proud.\n\nThe deal calls for at least $1.35 trillion in European investments and purchases of US energy and military equipment.\n\nAnd while European tariffs on many US exports will drop to zero, European goods will face 15% duties.\n\nPlus, neither side will slap any duties at all on “a number of strategic products,” including aircraft and aircraft parts, certain chemicals, semiconductor equipment, critical raw materials and more.\n\nThis is a great deal for both sides, and avoids a trade war that would’ve involved 44% of the world’s economy.\n\n“I think it’s the biggest deal ever made,” boasted Trump — and it certainly was big: The European Union, which includes 27 countries, is America’s largest trading partner, with total trade of nearly $2 trillion last year.\n\nAnd make no mistake: These were no easy negotiations; Trump reached terms with European Commission President Ursula von der Leyen after talks in Scotland she described as “very difficult.”\n\nOn Friday, Trump put the chances of agreement at 50-50.\n\nBut Von der Leyen praised the prez as a tough dealmaker; Trump said he thought both sides “wanted to make a deal,” and that it would “bring us very close together.”\n\nHmm: Just a few months ago, his critics blasted his tariff program — predicting practically every disaster but the full collapse of the worldwide economy.\n\nYet Trump has now secured key trade deals with Japan, the United Kingdom, Indonesia, Vietnam, the Philippines, China (at least partially) — and now the EU.\n\nThat’s going to bring much stability to the markets and relief for businesses trying to plan ahead.\n\nSure, there’s more work to be done: Trump’s “Liberation Day” tariffs kick in Friday for nations that lack a deal.\n\nBut his accomplishment in rebalancing international trade to America’s benefit are already enormously impressive.\n\nEven his critics ought to give him some hearty props here.","summary":"Trump secures a $1.35T EU trade deal slashing tariffs and boosting US exports.","url":"https://nypost.com/2025/07/27/opinion/the-eu-trade-agreement-with-its-favorable-terms-for-us-proves-trumps-a-great-dealmaker/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/u-s-president-donald-trump-108839368-e1753662825159.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/tjZP1YQf-RyIcpnTz.mp4","publish_date":"2025-07-28 00:34:17","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":0.158},{"id":345791004,"title":"World News | US and China to Talk in Stockholm on Trade with Eye on Trump-Xi Summit Later This Year","text":"Washington, Jul 28 (AP) When top US and Chinese officials meet in Stockholm, they are almost certain to agree to at least leaving tariffs at the current levels while working toward a meeting between their presidents later this year for a more lasting trade deal between the world's two largest economies, analysts say. Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng are set to hold talks for the third time this year — this round in the Swedish capital, nearly four months after President Donald Trump upset global trade with his sweeping tariff proposal, including an import tax that shot up to 145% on Chinese goods. Also Read | US Plane Crash: Beech 95-B55 Baron Aircraft Carrying 3 People Crashes off California Coast, Search Underway. “We have the confines of a deal with China,” Trump said Friday before leaving for Scotland. Bessent told MSNBC on Wednesday that the two countries after talks in Geneva and London have reached a “status quo,” with the U.S. taxing imported goods from China at 30% and China responding with a 10% tariff, on top of tariffs prior to the start of Trump's second term. Also Read | Iran Supreme Leader Ayatollah Ali Khamenei 'Spends Day Sleeping and Using Drugs', Says Mossad-Linked X Account. “Now we can move on to discussing other matters in terms of bringing the economic relationship into balance,” Bessent said. He was referring to the U.S. running a USD 295.5 billion trade deficit last year. The US seeks an agreement that would enable it to export more to China and shift the Chinese economy more toward domestic consumer spending. The Chinese embassy in Washington said Beijing hopes “there will be more consensus and cooperation and less misperception” coming out of the talks. With an eye on a possible leaders' summit, Stockholm could provide some answers as to the timeline and viability of that particular goal ahead of a possible meeting between Trump and Chinese leader Xi Jinping. “The meeting will be important in starting to set the stage for a fall meeting between Trump and Xi,” said Wendy Cutler, a former U.S. trade negotiator and now vice president at the Asia Society Policy Institute. “Beijing will likely insist on detailed preparations before they agree to a leaders' meeting.” In Stockholm, the two sides are likely to focus on commercial announcements to be made at a leaders' summit as well as agreements to address “major irritants,” such as China's industrial overcapacity and its lack of control over chemicals used to make fentanyl, also to be announced when Xi and Trump should meet, Cutler said. Sean Stein, president of the US-China Business Council, said Stockholm could be the first real opportunity for the two governments to address structural reform issues including market access in China for US companies. In Stockholm, Beijing will likely demand the removal of the 20% fentanyl-related tariff that Trump imposed earlier this year, said Sun Yun, director of the China program at the Washington-based Stimson Center. This round of the US-China trade dispute began with fentanyl, when Trump in February imposed a 10% tariff on Chinese goods, citing that China failed to curb the outflow of the chemicals used to make the drug. The following month, Trump added another 10% tax for the same reason. Beijing retaliated with extra duties on some U.S. goods, including coal, liquefied natural gas, and farm products such as beef, chicken, pork and soy. In Geneva, both sides climbed down from three-digit tariffs rolled out following Trump's “Liberation Day” tariffs in April, but the U.S. kept the 20% “fentanyl” tariffs, in addition to the 10% baseline rate — to which China responded by keeping the same 10% rate on US products. These across-the-board duties were unchanged when the two sides met in London a month later to negotiate over non-tariff measures such as export controls on critical products. The Chinese government has long protested that American politicians blame China for the fentanyl crisis in the US but argued the root problem lies with the U.S. itself. Washington says Beijing is not doing enough to regulate precursor chemicals that flow out of China into the hands of drug dealers. In July, China placed two fentanyl ingredients under enhanced control, a move seen as in response to US pressure and signaling goodwill. Gabriel Wildau, managing director at the consultancy Teneo, said he doesn't expect any tariff to go away in Stockholm but that tariff relief could be part of a final trade deal. “It's possible that Trump would cancel the 20% tariff that he has explicitly linked with fentanyl, but I would expect the final tariff level on China to be at least as high as the 15-20% rate contained in the recent deals with Japan, Indonesia, Vietnam,” Wildau said. America's trade imbalance with China has decreased from a peak of $418 billion in 2018, according to the Census Bureau. But China has found new markets for its goods and as the world's dominant manufacturer ran a global trade surplus approaching USD 1 trillion last year — somewhat larger than the size of the US overall trade deficit in 2024. And China's emergence as a manufacturer of electric vehicles and other emerging technologies has suddenly made it more of a financial and geopolitical threat for those same industries based in the US, Europe, Japan and South Korea. “Some enterprises, especially manufacturing enterprises, feel more deeply that China's manufacturing capabilities are too strong, and Chinese people are too hardworking. Factories run 24 hours a day,” Chinese Premier Li Qiang said on Thursday. “Some people think this will cause some new problems in the balance of supply and demand in world production.” “We see this problem too,” Li said. Bessent also said the Stockholm talks could address Chinese purchases of Russian and Iranian oil. However, Wildau of Teneo said China could demand some US security concessions in exchange, such as a reduced US military presence in East Asia and scaled-back diplomatic support for Taiwan and the Philippines. This would likely face political pushback in Washington. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   When top US and Chinese officials meet in Stockholm, they are almost certain to agree to at least leaving tariffs at the current levels while working toward a meeting between their presidents later this year for a more lasting trade deal between the world's two largest economies, analysts say.","url":"https://www.latestly.com/agency-news/world-news-us-and-china-to-talk-in-stockholm-on-trade-with-eye-on-trump-xi-summit-later-this-year-7026454.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-28 00:34:07","author":null,"language":"en","source_country":"in","sentiment":-0.234},{"id":345792280,"title":"Thailand-Cambodia War: Here Are the Hot Spots in the Border Area","text":"TEMPO.CO, Jakarta - The Thailand-Cambodian War broke out on Thursday, July 24, 2025, with the death toll reaching 33 as of Sunday, including 13 civilians in Thailand and eight in Cambodia.Moreover, more than 200,000 people have been evacuated from the border areas of both countries, as reported by Antara on Sunday, July 27, 2025.According to Al Jazeera, armed conflict erupted on Thursday, July 24, 2025 in the border area near the Preah Vihear Temple, with both sides accusing each other of initiating gunfire, stemming from the border dispute and the competition for historical sites.The border dispute arose from the French colonial period in 1907, where the demarcation lines claimed by both countries overlapped. Cambodia based its territorial claims on the French-demarcated border, while Thailand deemed the lines inaccurate.As per the Security Council Report, the dispute involves a 817-kilometer border that has yet to be fully agreed upon.Meanwhile, the competition for historical sites, especially at the Preah Vihear Temple, an 11th-century Hindu complex claimed by both countries. In 1962, the International Court of Justice (ICJ) ruled that the temple belonged to Cambodia. However, Thailand continued to claim areas around it. In 2000, the two countries agreed to establish a Joint Boundary Commission (JBC) to settle the overlapping claims, but no agreement has been reached.The recent escalation of the conflict began on July 16, 2025, when a Thai soldier lost his leg due to a landmine explosion while patrolling in the Chong Bok area, Nam Zuen district, Ubon Ratchathani, Thailand. A second explosion occurred on July 23, 2025, causing injuries to five Thai soldiers around the Chong An Ma point, located in Ubon Ratchathani province, with one soldier seriously injured and losing a leg.In response to the landmine explosions, Thailand immediately recalled its ambassador from Cambodia and closed border checkpoints at several locations, including Chong An Ma, Chong Sa-ngam, Chong Chom, and Chong Sai Takoo. Additionally, Ta Moan Thom and Ta Kwai temples ceased operations. Subsequently, an armed conflict occurred on Thursday morning near the Prasat Ta Moan Thom Temple, Surin Province, Thailand.Battles between Thailand and Cambodia have occurred in 12 locations along the disputed border, precisely between Surin and Sisaket provinces in Thailand and Oddar Meanchey and Preah Vihear in Cambodia, as stated by a Thai military official on Friday, July 25, 2025.Malaysian Foreign Minister Mohamad Hasan, based on Bernama news, stated on Sunday, July 27, 2025, that both Thailand and Cambodia agreed for Malaysia to mediate in the conflict. \"They have full confidence in Malaysia and have asked me to be the mediator,\" Mohamad said.Cambodian Prime Minister Hun Manet and Thai Acting Prime Minister Phumtham Wechayachai are expected to arrive in Malaysia on Monday night for ceasefire negotiations proposed by Malaysian Prime Minister Anwar Ibrahim, as chairman of the ASEAN regional forum, on Friday, July 26, 2025.United States President Donald Trump also expressed on Saturday, July 27, 2025, that both leaders agreed to pursue a ceasefire. \"Both sides want an immediate ceasefire and peace. They agreed to meet soon to arrange a ceasefire and, ultimately, peace,\" he wrote in a post on Truth Social regarding the solution to the Thailand-Cambodian war.Adinda Jasmine, Dewi Rina Cahyani, and Muhammad Nafis Wirasaputra contributed to this article.Editor's Choice: Malaysia Mediates Peace Talks Between Thailand and CambodiaClick here to get the latest news updates from Tempo on Google News","summary":"The conflict between Thailand and Cambodia that broke out on Thursday, July 24, 2025 along 12 locations along the border has claimed the lives of 33 people.","url":"https://en.tempo.co/read/2033226/thailand-cambodia-war-here-are-the-hot-spots-in-the-border-area","image":"https://statik.tempo.co/data/2025/07/25/id_1415777/1415777_720.jpg","video":null,"publish_date":"2025-07-28 00:30:05","author":"Zulkifli Ramadhani","authors":["Zulkifli Ramadhani"],"language":"en","category":"politics","source_country":"id","sentiment":-0.286},{"id":345795446,"title":"The Greasiest of ALL TIME [Sick]","text":"Skip to content\n\nTry Ads-Free Fark\n\nIt's Not News, It's Fark\n\nHow To FarkLog In | Sign Up »\n\nForgot password?\n\n Turn on javascript (or enable it for Fark) for a better user experience.\n\nIf you can read this, either the style sheet didn't load or you have an older browser that doesn't support\nstyle sheets. Try clearing your browser cache and refreshing the page.\n\n Discussion\n\n Entertainment\n\n The Greasiest of ALL TIME (bsky.app)\n\n More: Sick, com\n\n1376 clicks;posted toMain »on 27 Jul 2025 at8:30 PM(52 minutes ago) | Favorite | Watch | share: Copy Link\n\n 50 Comments \n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\nbearded clamorer \n\n(7) Funniest\n\n4 hours ago\n\nBenevolent Misanthrope \n\n(6) Funniest\n\nquestion_dj \n\n(2) Funniest\n\n169th Cousin \n\n(0) Funniest\n\nNoticed his complection hasn't changed much. Any more coffee grounds and he'll be ICEd up.\n\nNorth_Central_Positronics \n\n(19) Funniest\n\nOf all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWe've been f*cked for a while now.\n\nfragMasterFlash \n\n(0) Funniest\n\nAre we certain that isn't a very coked up DJT Jr wearing his daddy as a skin suit?\n\nSensei Can You See \n\n(0) Funniest\n\n34 minutes ago\n\nNorth_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWho are you talking about? Trump or Biden?\n\n(2) Funniest\n\n33 minutes ago\n\nNorth_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWe've been f*cked for a while now.\n\nAccidentally? At this point it's a power move.\n\nand also accidentally\n\ncapt.snicklefritz \n\n(18) Funniest\n\n32 minutes ago\n\nSensei Can You See: North_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWho are you talking about? Trump or Biden?\n\nOk dad, back to bed with you.\n\nPsychopompous \n\n(4) Funniest\n\n32 minutes ago\n\n(1) Funniest\n\n31 minutes ago\n\nC'mon, now, let's stop shaming the President about his physical appearance because we're better than th-\n\nHAHAHAHA I JUST COULDN'T I COULDN'T FSCK THAT FSCKING PIECE OF WHALE DUNG*\n\n*Cant go much lower.\n\nDon't Troll Me Bro! \n\n(7) Funniest\n\n34 minutes ago\n\nThat combover is still the funniest damn thing. Most guys have hair loss as we age. It starts in high school for some unfortunate guys, and by 40 is pretty obvious for almost all of us. Just roll with it, ya vain bastard; you're not fooling anyone.\n\n(2) Funniest\n\n32 minutes ago\n\n(2) Funniest\n\n32 minutes ago\n\nSo virile, so manly...\n\nsmilingcorpse \n\n(13) Funniest\n\n35 minutes ago\n\nSensei Can You See: North_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWho are you talking about? Trump or Biden?\n\nYou know Bidens not president, right?\n\nMissedThePoint \n\n(2) Funniest\n\n34 minutes ago\n\nWill it, or can it, catch fire?\n\n(1) Funniest\n\n33 minutes ago\n\nI'm still annoyed that he never followed through with his campaign promise from the first time around.\n\nHe said that he would find a new hairstyle, because the current one took so much time.\n\n/wonders how much time he spends between hair styling, doing his own makeup, and golfing\n//but hey, Obama needed to get back in the office and stop golfing\n///and Obama wasn't even having the US Government pay full price for secret service agents to stay at his own golf courses\n\nsum bum on a park bench \n\n(5) Funniest\n\n32 minutes ago\n\n169th Cousin: [Fark user image 425x313]\nNoticed his complection hasn't changed much. Any more coffee grounds and he'll be ICEd up.\n\n(3) Funniest\n\n31 minutes ago\n\nHe's just making sure the \"Pedo looks exactly like you'd expect\" headline works for fark.\n\n/Pencil mustache next week?\n\nsinko swimo \n\n(0) Funniest\n\n35 minutes ago\n\nbet he has a how-to poster in his bathroom\n\nsum bum on a park bench \n\n(0) Funniest\n\n35 minutes ago\n\nMrtraveler01 \n\n(8) Funniest\n\n34 minutes ago\n\nSensei Can You See: North_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWho are you talking about? Trump or Biden?\n\nBiden's senility seems quaint compared to Trump's.\n\nBilly Liar \n\n(1) Funniest\n\n34 minutes ago\n\nThe Irresponsible Captain \n\n(3) Funniest\n\n34 minutes ago\n\n169th Cousin: [Fark user image image 425x313]\nNoticed his complection hasn't changed much. Any more coffee grounds and he'll be ICEd up.\n\nHonestly, I prefer ebony.\n\n(0) Funniest\n\n33 minutes ago\n\nHe's going to need to invest in many more gallons of whatever that orange glop is that he smears on his face every morning. It now needs to also cover his entire balding head.\n\n(0) Funniest\n\n32 minutes ago\n\nYou sure about that now?\n\nCircusdog320 \n\n(0) Funniest\n\n32 minutes ago\n\n(0) Funniest\n\n32 minutes ago\n\nMojongo: [Fark user image image 850x966]\n\nDonald Trump Wig Reveal - Full Video\n\n/bad title for the video\n//looks more like a combover\n///and this is from 2018, I think\n\nTommyDeuce \n\n(2) Funniest\n\n31 minutes ago\n\nHis staff people really Farking hate him, don't they?\n\n(0) Funniest\n\n31 minutes ago\n\nYou are supreme, the chicks'll cream for grease lightning....go go go go go go go go...\n\n(2) Funniest\n\nless than a minute ago\n\nTommyDeuce: His staff people really Farking hate him, don't they?\n\nHe does his own hair and makeup. But you're right they hate him because they're not telling him\n\nTwowheelinTim \n\n(2) Funniest\n\nless than a minute ago\n\nsmilingcorpse: Sensei Can You See: North_Central_Positronics: Of all the leaders in the world, we have the smelly kid who can't dress himself and accidently sh*ts his pants once an hour.\n\nWho are you talking about? Trump or Biden?\n\nYou know Bidens not president, right?\n\nIt's a troll. It thrives or responses. Best to just ignore it.\n\n(1) Funniest\n\nless than a minute ago\n\nDon't Troll Me Bro!: That combover is still the funniest damn thing. Most guys have hair loss as we age. It starts in high school for some unfortunate guys, and by 40 is pretty obvious for almost all of us. Just roll with it, ya vain bastard; you're not fooling anyone.\n\nAt my late 60's I'm still fortunate enough to have all of my original hair. Unfortunately it's also growing out of places where I would rather it didn't. I have to trim my eyebrows every now and then when a hair starts getting into my field of vision; really annoying. And removing ear hair just doesn't work well with all those convolutions.\n\nStill, if you're balding, go with it (but do wear a hat in the sun).\n\n/ My dad had eyebrows that would keep his shoes dry in the rain.\n\n(0) Funniest\n\nless than a minute ago\n\n/he wishes he had that much hair\n\nMorgothsDishwasher \n\n(2) Funniest\n\nless than a minute ago\n\nSome foreign leader who REALLY wants to freak out Trump needs to look at him, pause for a moment, and then ask \"Is there something wrong with your hair?\" It's obviously something he worries about, and I'd love to see his reaction if he thinks that he doesn't look perfect in front of the camera. It would be well worth the tariffs it would generate.\n\nlittle big man \n\n(0) Funniest\n\nless than a minute ago\n\n(3) Funniest\n\nless than a minute ago\n\nDude. Seriously. Keep it short come it all forward. Embrace the thin hair. It isn't going to get any thicker. It is what it is. I haven't even bothered combing today.\n\nwatching the trump bubble grow \n\n(2) Funniest\n\nless than a minute ago\n\n(1) Funniest\n\nless than a minute ago\n\n(0) Funniest\n\nless than a minute ago\n\nAnd now for the \"what the hell is that?!\" Frontal\n\n(0) Funniest\n\nless than a minute ago\n\nEven Rudy Giuliani is all: DUDE!... Wtf!?\n\nAnotherBluesStringer \n\n(1) Funniest\n\nless than a minute ago\n\nIf you think that is crazy, wait til I tell you that he also raped small girls.\n\nAny Pie Left \n\n(1) Funniest\n\nless than a minute ago\n\nGeez he is just a few more steps away from the full Londo Molari. Man, that is THIN. It needs some of that spray on hair from Ron Popeil. And he is super vain about it, easy to rile over it.\n\noldfarthenry \n\n(0) Funniest\n\nless than a minute ago\n\nHe got confused at lunch & wore a greasy KFC bucket on the back nine?\n\nabhorrent1 \n\n(1) Funniest\n\nless than a minute ago\n\nThe Irresponsible Captain \n\n(1) Funniest\n\nless than a minute ago\n\nCaelistis: [Fark user image image 850x917]\n\nThere's also the matter of his legs.\n\n(0) Funniest\n\nless than a minute ago\n\nEpstein seemed to hsve a decent head of hair. I wonder how trump felt about Epsteins hair. I wonder how Epstein felt about Trump's hair. Imagine Trump and Epstein giving a news conference about Trump and Epstein's hair.\n\nBennie Crabtree \n\n(0) Funniest\n\nless than a minute ago\n\nBiledriver \n\n(0) Funniest\n\nless than a minute ago\n\nFlappyhead \n\n(0) Funniest\n\nless than a minute ago\n\nOneiros: Mojongo: [Fark user image image 850x966]\n\n[YouTube video: Donald Trump Wig Reveal - Full Video]\n\n/bad title for the video\n//looks more like a combover\n///and this is from 2018, I think\n\nIt's basically an illusion created by hairpins, tape and spray. He'd probably look fine with a normal haircut but that would mean admitting a flaw.\n\nDisplayed 50 of 50 comments\n\nEnable JavaScript for Fark in order to vote for entries.\n\nLog in (at the top of the page) to enable voting.\n\nView Voting Results:SmartestandFunniest\n\nRedisplay/refresh comments\n\nIf you're having problems voting, quoting, or posting comments, try disabling any browser add-ons that might disable Javascript (NoScript, AdBlock, etc).See our FAQ.\n\n Forgot password?\n\nCreate an account to make comments\n\nRemember me\n\nIf you can see this, something's wrong with your browser's CSS support. (Or you're a spambot.)\n\nIf you are using the NoScript browser extension, you may have problems posting comments,\nespecially if they contain images.For a fix, see\nthis FAQ entry.If you still have problems, contact Farkback.\n\nBefore adding a comment, please take a minute to review our posting rules and our legal/privacy policy.\nBy commenting, you agree to these terms.\nYou might also want to take a look at our FAQ.\n\nWant more news before we break it? Try\n\nSee what's behind the green door\nand help keep the tap flowing\n\nlearn more | sign up\n\nSupport Fark\n\nSign up for the Fark NotNewsletter!\n\nHeadlines of the Month\n\nFark NotNewsletter\n\nTotalFark signup\nBareFark signup\nPurchase FarkUnits\n\nPurchase OhFark\n\nTop Comments\n\nTop Submitters\n\nTop Smart Comments\n\nTop Sources/Topics\n\nTop Funny Comments\n\nPress/Publicity\n\nLink Voting\n\nSports Forum\n\nFandom Forum\n\nEntertainment Forum\n\nPolitics Forum\n\nFark Parties\n\nFark Party Forum\n\nPS/Photo Browser\n\nPhotoshop Forum\n\nFarktography Forum\n\nDiscussion/TF Live Forum\n\nTop Commented\n\nTop Commented ▼\n\nTop Commented\n\nTop Clicked\n\nMy Recent Commented\n\nRecent Mentions\n\nJavascript is required to view headlines in widget.\n\nLinks are submitted by members of the Fark community.\n\nWhen community members submit a link, they also write a custom headline for the story.\n\nOther Farkers comment on the links. This is the number of comments. Click here to read them.\n\nYou need to create an account to submit links or post comments.\n\nClick here to submit a link.\n\nAlso on Fark\n\nThe Greasiest of ALL TIME ( bsky.app ) » (50 comments)\n\nWhy do Americans still accept checks? ( yahoo.com ) » (12 comments)\n\nAfter 21 stages TdF foregone conclusion concludes in Paris ( theguardian.com ) » (0 comments)\n\nBrit, American and Scandinavian knowledge workers have chosen Lisbon to settle in as digital nomads, taking in salaries in pounds, dollars and kroner while living posh and wealthy tax-free lifestyles in sunny Portugal. Should they feel shame? ( theguardian.com ) » (5 comments)\n\nA 'Grand Unified Theory' of math just got a bit closer. Which is like half, or ⁷/₂₈₁ ( quantamagazine.org ) » (2 comments)\n\nEntertainment\n\nNot gravity, not TNT, not even corporate cowardice and greed. Nothing can kill Wile E. Coyote ( hollywoodreporter.com ) » (4 comments)\n\nOld man wants to show you his Star Wars toys ( msn.com ) » (16 comments)\n\nIf there's not enough food on the ground, you better learn to climb trees ( aol.com ) » (1 comment)\n\nIn which an intrepid Slate reporter investigates whether restaurants go easy on the spicy for Mayonnaise-Americans ( slate.com ) » (20 comments)\n\nTrump botches a simple question - would you pardon the second worst human trafficker in American history? ( huffpost.com ) » (7 comments)\n\nFark :: Main | Discussion | Sports | Business | STEM | Entertainment | Fandom | D'awww | Food | Politics\n\nTotal Fark :: TotalFark | TF Live | TF Advice | TF Discussion | Commented | Top Voted | Greenlit\n\nFArQ :: About Us | Quick Answers | Posting Rules | Farkisms\n\nContests :: Photoshop | Farktography | Caption\n\nBuy Fark :: Fark Book | Fark Store\n\nSubmit a Link »\n\nCopyright © 1999 - 2025 Fark, Inc | Last updated: Jul 27 2025 21:22:54\n\nContact Us via Farkback | Report a bug/error msg | Terms of service/legal/privacy policy | Do Not Sell or Share My Personal Information\n\nRuntime: 0.171 sec (171 ms)","summary":"[link] [50 comments]","url":"https://www.fark.com/comments/13755966","image":"https://usrimg-full.fark.net/y/yL/fark_yLhQYuMUEMoSAoG3H0DFOOqhdc8.jpg?AWSAccessKeyId=JO3ELGV4BGLFW7Y3EZXN&Expires=1754280000&Signature=vPzJVCLND3C6lX9g2V%2FCbixZYJ0%3D","video":null,"publish_date":"2025-07-28 00:30:00","author":null,"language":"en","source_country":"us","sentiment":-0.118},{"id":345791026,"title":"World News | Powerful Sister of North Korean Leader Kim Rejects Appeasement Overture by South's New President","text":"Seoul, Jul 28 (AP) The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Korea's new liberal government, saying Monday that North Korea has no interests in talks with South Korea no matter what proposal its rival offers. Kim Yo Jong's comments suggest again that North Korea, now preoccupied with its expanding cooperation with Russia, has no intentions of returning to diplomacy with South Korea and the U.S. anytime soon. But experts said North Korea could change its course if it thinks it cannot maintain the same booming ties with Russia when the Russia-Ukraine war nears an end. Also Read | US Plane Crash: Beech 95-B55 Baron Aircraft Carrying 3 People Crashes off California Coast, Search Underway. “We clarify once again the official stand that no matter what policy is adopted and whatever proposal is made in Seoul, we have no interest in it and there is neither a reason to meet nor an issue to be discussed with” South Korea, Kim Yo Jong said in a statement carried by state media. It's North Korea's first official statement on the government of South Korean President Lee Jae Myung, which took office in early June. In an effort to improve badly frayed ties with North Korea, Lee's government has halted anti-Pyongyang frontline loudspeaker broadcasts, taken steps to ban activists from flying balloons with propaganda leaflets across the border and repatriated North Koreans who were drifted south in wooden boats months earlier. Also Read | Iran Supreme Leader Ayatollah Ali Khamenei 'Spends Day Sleeping and Using Drugs', Says Mossad-Linked X Account. Kim Yo Jong called such steps “sincere efforts” by Lee's government to develop ties. But she said the Lee government won't be much different from its predecessors, citing what it calls “their blind trust” to the military alliance with the U.S. and attempt to “stand in confrontation” with North Korea. She mentioned the upcoming summertime South Korea-U.S. military drills, which North Korea views as an invasion rehearsal. North Korea has been shunning talks with South Korea and the U.S. since leader Kim Jong Un's high-stakes nuclear diplomacy with President Donald Trump fell apart in 2019 due to wrangling over international sanctions. North Korea has since focused on building more powerful nuclear weapons targeting its rivals. North Korea now prioritizes cooperation with Russia by sending troops and conventional weapons to support its war against Ukraine, likely in return for economic and military assistance. South Korea, the U.S. and others say Russia may even give North Korea sensitive technologies that can enhance its nuclear and missile programs. Since beginning his second term in January, Trump has repeatedly boasted of his personal ties with Kim Jong Un and expressed intent to resume diplomacy with him. But North Korea hasn't publicly responded to Trump's overture. In early 2024, Kim Jong Un ordered the rewriting of the constitution to remove the long-running state goal of a peaceful Korean unification and cement South Korea as an “invariable principal enemy.” That caught many foreign experts by surprise because it was seen as eliminating the idea of shared statehood between the war-divided Koreas and breaking away with his predecessors' long-cherished dreams of peacefully achieving a unified Korea on the North's terms. Many experts say Kim likely aims to guard against South Korean cultural influence and bolster his family's dynastic rule. Others say Kim wants legal room to use his nuclear weapons against South Korea by making it as a foreign enemy state, not a partner for potential unification which shares a sense of national homogeneity. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Korea's new liberal government, saying Monday that North Korea has no interests in talks with South Korea no matter what proposal its rival offers.","url":"https://www.latestly.com/agency-news/world-news-powerful-sister-of-north-korean-leader-kim-rejects-appeasement-overture-by-souths-new-president-7026447.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-07-28 00:24:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.127},{"id":345792266,"title":"Sanction Israel and recognise Palestine: here are the steps Australia should take next on Gaza | Donald Rothwell","text":"The Albanese government has given its clearest statement yet on the legality of Israel’s conduct in Gaza. Anthony Albanese told the ABC at the weekend that it was a breach of international law and a breach of humanity. Evidence of Israel’s violations of international law has been compelling for some time. Examples include the indiscriminate targeting of the Palestinian population, a failure to apply the principle of distinction between Hamas and Gazan residents, and a breach of its Geneva convention obligations to provide food, medical supplies and aid to civilians.\n\nIt is rare for an Australian prime minister to make such unambiguous statements on international law matters, especially with respect to the conduct of a friend such as Israel. These comments are the latest in a series of observations over the past year, whether they have taken the form of joint prime ministerial statements with Canada and New Zealand, or the statement issued on Friday which said: “Gaza is in the grip of a humanitarian catastrophe. Israel’s denial of aid and the killing of civilians, including children, seeking access to water and food cannot be defended or ignored.”\n\nThe time has come for the Albanese government to do more than just issue statements decrying breaches of international law. Ample scope exists under Australian law to impose autonomous sanctions on Israel to make clear its objections to the ongoing Gaza conflict. On 10 June Australia joined Canada, New Zealand, Norway and the United Kingdom in sanctioning Itamar Ben-Gvir and Bezalel Smotrich for inciting violence against Palestinians in the West Bank.\n\nIf those two Israeli ministers can be sanctioned for inciting serious abuses of Palestinian human rights, what further steps can be taken against Israeli ministers responsible for directing actions in direct violation of international law?\n\nAustralia has imposed autonomous sanctions in relation to Russia in response to the “Russian threat to the sovereignty and territorial integrity of Ukraine”. There is no legal reason why similar sanctions cannot be approved with respect to Israel’s threat to Palestine and Palestinians.\n\nIsrael’s conduct in Gaza has also placed the spotlight on Australia’s position on the recognition of a Palestinian state. The prime minister also made clear at the weekend that Australia will not recognise Palestine while Hamas is in power in Gaza, and that Australia will not recognise Palestine as a “gesture”.\n\nNevertheless, President Emmanuel Macron’s announcement that France will recognise Palestine at the September meeting of the United Nations general assembly will continue to place a spotlight on the Albanese government’s response given the momentum towards Palestinian recognition over the past year. About 147 states now recognise Palestine. Those that do not are predominantly from Europe in addition to Australia, Canada, New Zealand and the United States.\n\nFour traditional criteria are applied to recognition of a new state. First, a defined territory. Palestine comprises the West Bank, Gaza and parts of Jerusalem. While those borders are well known they are contested by Israel. However, contested borders cannot be used as an effective block and many countries have disputed borders, as is evidenced by the conflict between Cambodia and Thailand.\n\nSecond, there must be a permanent population which is satisfied by the Palestinian peoples who predominantly occupy Gaza, the West Bank and Jerusalem.\n\nThird, there must be a government which is met by the Palestinian Authority. While the PA may have limited capacity to control affairs in Gaza as that territory is under Israeli occupation an allowance can be made for that exceptional situation.\n\nFinally, there must be evidence of the ability to enter into international relations. That is occurring through the PA’s engagement with UN institutions including the general assembly and the international criminal court, and through the many other states that recognise and engage with Palestine. That Palestine has yet to attain the formal status of a UN member is not determinative of its status. Switzerland only joined the UN in 2002 after a long period of remaining distant due to its desire to maintain neutrality.\n\nAny decision by the Albanese government to recognise Palestine would only come after cabinet endorsement. Unlike other decisions to recognise new states such as Timor-Leste or South Sudan, Australia’s recognition of Palestine will generate fierce domestic political debate.\n\nAlbanese has made clear that recognition of Palestine is conditional on Hamas having no ongoing role. Yet in the short term it remains improbable that Hamas will be completely removed from Gaza or as a force in Palestinian politics. Any recognition of Palestine by Australia could include a special condition which made clear it would not politically recognise an Hamas-led Palestinian government. This would be a break from Australian recognition policy towards new states but would acknowledge the exceptional nature of the Palestinian question and that Australia would not tolerate any form of Hamas Palestinian government.\n\nAnthony Albanese insists that Australian foreign policy is made in Canberra and not overseas. However, with respect to both sanctioning Israel over Gaza and eventually recognising Palestine there is every prospect that Australia will seek to avoid any Trump administration fallout in the form of increased unilateral tariffs on Australian exports.","summary":"The time has come for the Albanese government to do more than just issue statements decrying breaches of international law\n\nThe Albanese government has given its clearest statement yet on the legality of Israel’s conduct in Gaza. Anthony Albanese told the ABC at the weekend that it was a breach of international law and a breach of humanity. Evidence of Israel’s violations of international law has been compelling for some time. Examples include the indiscriminate targeting of the Palestinian population, a failure to apply the principle of distinction between Hamas and Gazan residents, and a breach of its Geneva convention obligations to provide food, medical supplies and aid to civilians.\n\nIt is rare for an Australian prime minister to make such unambiguous statements on international law matters, especially with respect to the conduct of a friend such as Israel. These comments are the latest in a series of observations over the past year, whether they have taken the form of joint prime ministerial statements ","url":"https://www.theguardian.com/commentisfree/2025/jul/28/gaza-australia-government-should-sanction-israel-recognise-palestine-state","image":"https://i.guim.co.uk/img/media/92412dbdf97c20416a4d76e810ffacdc5a4821c6/130_0_4876_3903/master/4876.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=","video":null,"publish_date":"2025-07-28 00:20:35","author":"Donald Rothwell","authors":["Donald Rothwell"],"language":"en","category":"politics","source_country":"us","sentiment":0.083},{"id":345796732,"title":"US-China set to meet with extension of tariff pause on the cards","text":"Top economic officials from the United States and China are set to renew negotiations Monday -- with an extension of lower tariff levels on the cards -- as President Donald Trump's trade policy enters a critical week.\n\nTalks between the world's top two economies are slated to happen over two days in the Swedish capital Stockholm, and they come as other countries are also rushing to finalise deals with Washington.\n\nFor dozens of trading partners, failing to strike an agreement in the coming days means they could face significant tariff hikes on exports to the United States come Friday, August 1.\n\nThe steeper rates, threatened against partners like Brazil and India, would raise the duties their products face from a \"baseline\" of 10 percent now to levels up to 50 percent.\n\nTariffs imposed by the Trump administration have already effectively raised duties on US imports to levels not seen since the 1930s, according to data from The Budget Lab research centre at Yale University.\n\nFor now, all eyes are on discussions between Washington and Beijing as a delegation including US Treasury Secretary Scott Bessent meets a Chinese team led by Vice Premier He Lifeng in Sweden.\n\nWhile both countries in April imposed tariffs on each other's products that reached triple-digit levels, US duties this year have temporarily been lowered to 30 percent and China's countermeasures slashed to 10 percent.\n\nBut the 90-day truce, instituted after talks in Geneva in May, is set to expire on August 12.\n\nSince the Geneva meeting, the two sides have convened in London to iron out disagreements.\n\n China progress? \n\n\"There seems to have been a fairly significant shift in (US) administration thinking on China since particularly the London talks,\" said Emily Benson, head of strategy at Minerva Technology Futures.\n\n\"The mood now is much more focused on what's possible to achieve, on warming relations where possible and restraining any factors that could increase tensions,\" she told AFP.\n\nTalks with China have not produced a deal but Benson said both countries have made progress, with certain rare earth and semiconductor flows restarting.\n\n\"Secretary Bessent has also signalled that he thinks a concrete outcome will be to delay the 90-day tariff pause,\" she said. \"That's also promising, because it indicates that something potentially more substantive is on the horizon.\"\n\nThe South China Morning Post, citing sources on both sides, reported Sunday that Washington and Beijing are expected to extend their tariff pause by another 90 days.\n\nTrump has announced pacts so far with the European Union, Britain, Vietnam, Japan, Indonesia and the Philippines, although details have been sparse.\n\nAn extension of the US-China deal to keep tariffs at reduced levels \"would show that both sides see value in continuing talks\", said Thibault Denamiel, a fellow at the Centre for Strategic and International Studies.\n\nUS-China Business Council President Sean Stein said the market is not anticipating a detailed readout from Stockholm: \"What's more important is the atmosphere coming out.\"\n\n\"The business community is optimistic that the two presidents will meet later this year, hopefully in Beijing,\" he told AFP. \"It's clear that on both sides, the final decision-maker is going to be the president.\"\n\nSweden's Prime Minister Ulf Kristersson said both countries' willingness to meet was a \"positive development\".\n\n Far from ideal \n\nFor others, the prospect of higher US tariffs and few details from fresh trade deals mark \"a far cry from the ideal scenario\", said Denamiel.\n\nBut they show some progress, particularly with partners Washington has signalled are on its priority list like the EU, Japan, the Philippines and South Korea.\n\nThe EU unveiled a pact with Washington on Sunday while Seoul is rushing to strike an agreement, after Japan and the Philippines already reached the outlines of deals.\n\nBreakthroughs have been patchy since Washington promised a flurry of agreements after unveiling, and then swiftly postponing, tariff hikes targeting dozens of economies in April.\n\nDenamiel warned of overlooking countries that fall outside Washington's priority list.\n\nSolid partnerships are needed, he said, if Washington wants to diversify supply chains, enforce advanced technology controls, and tackle excess Chinese capacity.\n\nSource: AFP","summary":"Top economic officials from the United States and China are set to renew negotiations Monday -- with an extension of lower tariff levels on the cards -- as President Donald Trump's trade policy enters a critical week.","url":"https://www.legit.ng/business-economy/economy/1666338-us-china-set-meet-extension-tariff-pause-cards/","image":"https://cdn.legit.ng/images/1200x675/7d45b15322773879.jpeg?v=1","video":null,"publish_date":"2025-07-28 00:16:04","author":"Bayo Olupohunda","authors":["Bayo Olupohunda"],"language":"en","category":"politics","source_country":"ng","sentiment":0.172},{"id":345796734,"title":"State of play in Trump's tariffs, threats and delays","text":"Dozens of economies including India, Canada and Mexico face threats of higher tariffs Friday if they fail to strike deals with Washington.\n\nHere is a summary of duties President Donald Trump has introduced in his second term as he pressures allies and competitors alike to reshape US trade relationships.\n\n Global tariffs \n\nUS \"reciprocal\" tariffs -- imposed under legally contentious emergency powers -- are due to jump from 10 percent to various steeper levels for a list of dozens of economies come August 1, including South Korea, India and Taiwan.\n\nThe hikes were to take effect July 9 but Trump postponed them days before imposition, marking a second delay since their shock unveiling in April.\n\nA 10 percent \"baseline\" levy on most partners, which Trump imposed in April, remains in place.\n\nHe has also issued letters dictating tariff rates above 10 percent for individual countries, including Brazil, which has a trade deficit with the United States and was not on the initial list of higher \"reciprocal\" rates.\n\nSeveral economies -- the European Union, Britain, Vietnam, Japan, Indonesia and the Philippines -- have struck initial tariff deals with Washington, while China managed to temporarily lower tit-for-tat duties.\n\nCertain products like pharmaceuticals, semiconductors and lumber are excluded from Trump's \"reciprocal\" tariffs, but may face separate action under different authorities.\n\nThis has been the case for steel, aluminum, and soon copper. Gold and silver, alongside energy commodities, are also exempted.\n\nExcluded too are Mexico and Canada, hit with a different set of tariffs, and countries like Russia and North Korea as they already face sanctions.\n\n Canada, Mexico \n\nCanadian and Mexican products were hit by 25 percent US tariffs shortly after Trump returned to office, with a lower rate for Canadian energy. Trump targeted both neighbors over illegal immigration and fentanyl trafficking, also invoking emergency powers.\n\nBut trade negotiations have been bumpy. This month, Trump said Canadian goods will face a higher 35 percent duty from August 1, and Mexican goods will see a 30 percent level.\n\nProducts entering the United States under the USMCA North American free trade pact, covering large swaths of goods, are expected to remain exempt -- with Canadian energy resources and potash, used as fertilizer, to still face lower rates.\n\n China focus \n\nTrump has also taken special aim at China. The world's two biggest economies engaged in an escalating tariffs war this year before their temporary pullback.\n\nThe countries imposed triple-digit duties on each other at one point, a level described as a trade embargo.\n\nAfter high level talks, Washington lowered its levies on Chinese goods to 30 percent and Beijing slashed its own to 10 percent.\n\nThis pause is set to expire August 12, and officials will meet for further talks on Monday and Tuesday in the Swedish capital Stockholm.\n\nThe US level is higher as it includes a 20 percent tariff over China's alleged role in the global fentanyl trade.\n\nBeyond expansive tariffs on Chinese products, Trump ordered the closure of a duty-free exemption for low-value parcels from the country. This adds to the cost of importing items like clothing and small electronics.\n\n Autos, metals \n\nTrump has targeted individual business sectors too, under more conventional national security grounds, imposing a 25 percent levy on steel and aluminum imports which he later doubled to 50 percent.\n\nThe president has unveiled plans for a 50 percent tariff on copper imports starting August 1 as well and rolled out a 25 percent tariff on imported autos, although those entering under the USMCA can qualify for a lower rate.\n\nTrump's auto tariffs impact vehicle parts too, but new rules ensure automakers paying vehicle tariffs will not also be charged for certain other duties.\n\nHe has ongoing investigations into imports of lumber, semiconductors, pharmaceuticals and critical minerals that could trigger further duties.\n\n Legal challenges \n\nSeveral legal challenges have been filed against the tariffs Trump invoked citing emergencies.\n\nThe US Court of International Trade ruled in May that the president had overstepped his authority, but a federal appeals court has allowed the duties to remain while it considers the case.\n\nIf these tariffs are ultimately ruled illegal, companies could possibly seek reimbursements.\n\nSource: AFP","summary":"Dozens of economies including India, Canada and Mexico face threats of higher tariffs Friday if they fail to strike deals with Washington. - Global tariffs - US \"reciprocal\" tariffs -- imposed under legally contentious emergency powers -- are due to jump from 10 percent to various steeper levels for a list of dozens of economies come August 1, including South Korea, India and Taiwan.","url":"https://www.legit.ng/business-economy/economy/1666336-state-play-trumps-tariffs-threats-delays/","image":"https://cdn.legit.ng/images/1200x675/694fbef02442dfdc.jpeg?v=1","video":null,"publish_date":"2025-07-28 00:14:04","author":"Bayo Olupohunda","authors":["Bayo Olupohunda"],"language":"en","category":"politics","source_country":"ng","sentiment":0.18},{"id":345793908,"title":"Trump Announces U.S.-Europe Trade Deal Framework: Major Tariff Shift Coming July 27 | N18G | News18","text":"Last Updated:July 28, 2025, 05:43 IST Videos\n\nA breakthrough in global trade—Donald Trump has announced a new framework trade deal between the United States and Europe, set to be finalized on July 27th. This agreement could reshape transatlantic commerce, with expected tariff shifts, market access improvements, and strategic supply chain developments.Watch this Global special report on what’s inside the agreement, who benefits, and what challenges lie ahead. Mobile App - https://onelink.to/desc-youtube","summary":"A breakthrough in global trade—Donald Trump has announced a new framework trade deal between the United States and Europe, set to be finalized on July 27th. This agreement could reshape transatlantic commerce, with expected tariff shifts, market access improvements, and strategic supply chain developments.Watch this Global special report on what’s inside the agreement, who benefits, and what challenges lie ahead. Mobile App - https://onelink.to/desc-youtube","url":"https://www.news18.com/videos/trump-announces-u-s-europe-trade-deal-framework-major-tariff-shift-coming-july-27-n18g-news18-9467597.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/1753661762_a43812c0-e904-4caa-80b5-7b5d458ff6f2.jpeg","video":null,"publish_date":"2025-07-28 00:13:17","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":0.119},{"id":345793214,"title":"‘I work hard so my children will not struggle the way I do’: Irish aid supports enterprising women in Sri Lanka","text":"She is one of thousands of Sri Lankan women who have taken on the role of family’s breadwinner through skills that they have repurposed over several years.\n\nWomen in Sri Lanka have resorted to setting up businesses in their own homes to support their families and cover day-to-day expenses, in an economic climate which has seen great destitution and poverty following the 2022 economic crisis that swamped the country.\n\nInflation, near depletion of foreign reserves, shortages of medical supplies, and the increase in prices of basic commodities, including food, began in 2019. This was followed by the covid pandemic, leading to the 2022 protests which saw Sri Lankan citizens throw out the Rajapaksa government.\n\nRenuka: 'I work at all hours of the day'\n\nFor Renuka, her work sewing and creating items for cricket uniform kits is her only source of income.\n\nThe Maradana native said she makes between 90,000 and 200,000 rupees (€253-€563) a month and says most of this money goes towards the costs of food, bills, and extra grinds classes for her two children who are currently sitting their O-Levels and A-Levels — the equivalent of the Junior Cert and Leaving Cert. \n\nShe also supports her bedridden mother and the medical expenses of her younger sister.\n\n“I work at all hours of the day — sometimes I could be working very late into the night if I have a big order that I need to get through,” Renuka told the Irish Examiner.\n\n“My kids go to bed, and I would be working with my sewing machine until maybe 1am or 2am.\n\n“Sometimes I find myself cutting all the fabric shapes out on the floor here — you can still see the marks from the knife — and then I may fall asleep on the ground.\n\n“My children then, who wake up will come in and see me asleep on the floor with no pillow, no blanket, and then give out to me saying: ‘You should not be working that late.’ ”\n\nRenuka’s home is a small two-bedroom house with a red-clay floor. Her living room also acts as a kitchen, and her sewing machine sits right next to the front door, in front of the kitchen sink.\n\n“My dream is to send my children abroad, to make sure that they don’t suffer as I do here in Sri Lanka,” she said.\n\n I will struggle, and I will do as much as I can. I will try to bring as much money home so that when they finish school and then get a degree, they will not struggle the way that I do now.\n\n“At some point in my life I would also like to open up a shop selling sports kits. That has always been my dream, for the past 25 years.”\n\nRenuka said she has always been sewing since before her children were born.\n\n“When I was heavily pregnant with my son, 18 years ago, I was sewing all the orders which would fit into gallon bags, and carrying them by myself to the shops to give it to them.\n\n“They would wonder, ‘how are you carrying these all by yourself,’ and I would say: ‘It’s all OK, I can do this.’\n\n“I really struggled for the past few years. Things were really difficult, I would go seeking help, any kind of support that I could get, crying because I needed to support my two children and make sure that they get through their education.”\n\nDisabled sisters run their own business\n\nSumeda, 37, and her sisters, Kamani and Kumudu, set up a small business selling bags to tourist companies and tourist shops across the country.\n\nAll three sisters have muscular dystrophy and are wheelchair users. They were living in a home for disabled people after their mother died.\n\nHowever, after learning how to sew and paint, they decided they wanted to set up a business to support their independent living and to live freely in their own home.\n\nAfter receiving support from Sarvodaya, a Sri Lankan NGO, they were able to get land and a home where they can continue working their business. Sumeda said: \n\n The work that we do here has allowed us to feel independent, pay our bills, buy our food, and look after each other. \n\n“I have always loved to sew, and just because I am disabled does not mean I cannot do it.\n\n“Each of us does a different task. My sister Kumudu paints the art on the bags. My other sister Kamani adds the zips and handles to it.\n\n“We all do different things, but we do this together.”\n\nSumeda hopes that one day their business will take off and allow them to eventually purchase a wheelchair-accessible van.\n\nThe sisters smiled as they spoke to the Irish Examiner about their passion for creating. They moved to Godagama after leaving the home for disabled people in Rajagiriya.\n\n“One day, we hope that we can live well enough and not worry about anything else,” Sumeda said.\n\nLatha: 'I love what I am doing'\n\nMeanwhile, in Kolonnawa near the Kelaniya river, Latha, 42, works hard every day designing handbags, backpacks, and travel bags for eager customers who place orders of between 100-300 items.\n\nOriginally from Matale in the Central Province north of Kandy, Latha says she makes 100,000 rupees (€281) a month from her business.\n\n“After paying our food, our bills, and my daughters’ education fees, their school travel fees, nothing is left over,” the mother of three said.\n\n“I love what I am doing. I wake up at 5am every morning, get everything in the house done before I start working. And some nights I do not finish until 1am or 2am, and then I am up again. It’s constant.\n\n“My husband helps me transport the items wherever they need to go, like to the Petta markets, the fairs across different areas, and even up north to Jaffna. It is a great help.”\n\nLatha said that when she first started out, when she wanted to get into the business at first, she was told she needed over 500,000 rupees (€1,407) as a downpayment.\n\n“I sold two of my gold bangles for 260,000 rupees [€732], and pawned my sister’s two bangles for a similar amount,” she said.\n\nHowever, she was at a loss after that, after the deal fell apart and she lost her money because the plan did not come to fruition.\n\nNow, she works from her home, with another woman in her employ, and has already begun teaching some of her neighbours how to sew bags as well.\n\n“My dream is to own a bigger place so that my family and I can thrive there. This means that I can hire more people and we can carry out more orders,” Latha said.\n\nImpact of Trump's defunding of USAID\n\nProject manager and deputy executive director for Sarvodaya, JMM Niswi, said that Latha, Sumeda, and Renuka and her sisters are examples of thousands of women across the country who start small businesses out of their homes to support their families.\n\nSarvodaya supports many women across Sri Lanka and, following a “due process screening” and applications, it provides what these women need to help them carry out their business.\n\nHowever, Mr Niswi raised concerns about Donald Trump’s freezing of US aid, which the organisation and many others across the country benefited from. Since 1956, the US has provided over $2bn (€1.69bn) in development assistance to the country.\n\n After it was frozen in March this year, we had to stop three projects and terminate contracts of 22 staff members. \n\n\"Talented, very talented, staff who we could not fund anymore,” he said.\n\n“Some 18% to 20% of projects within our organisation were funded by USAid. Now we have been informed that it may take more than three years before we see anything come our way.\n\n“These women that we support need continuous progress. It’s not just that we get grants to give them, say, for example, a sewing machine — we also support them through promoting themselves, how to market, how to sell, and how to compete with corporate markets.\n\n“If we lose this funding, then we would have to pause those supports, which could lead to these women and their work being put on hold, which could lead to them to become disheartened, lose hope, and all the effort that we have put in for them to progress will be lost.”\n\nMr Niswi added that while they are looking elsewhere for funding, it is difficult to get anything at all.\n\n“We are looking to European funding, but they are much more lengthy and specific and very likely to get your proposals rejected,” he said. “Sri Lanka, unlike other countries, does not have a culture of funding its homegrown NGOs, and I do not think it ever will.”\n\nIreland’s humanitarian and development work \n\nWhen asked, the Department of Foreign Affairs said it is continuing to “closely assess the immediate and long-term impact of funding cuts from the US and other countries”.\n\n“The impact of these cuts are being felt across many countries. We are continuing to work with our partners, including civil society and multilateral partners, to assess the impact of funding cuts,” a spokesperson said.\n\nMinister of state Neale Richmond said that “at a time when humanitarian needs are rising globally, the impact of funding cuts from the US and elsewhere are having a severe impact.”\n\n The budget for Irish Aid is at record levels and we are going to continue to invest in supporting the people in the world left furthest behind.\n\n“The impact of Ireland’s humanitarian and development work around the world is something Irish people should feel very proud about.\n\n“Through our embassy in India, Ireland has supported civil society organisations in Sri Lanka. Most recently we supported Misean Cara’s work to strengthen the rights of women and children.”\n\nMr Richmond said this work is “vital” and that its embassy in India remains “engaged in Sri Lanka and, along with EU partners, we are monitoring political developments and human rights of vulnerable people”.\n\n This reporting was facilitated by a grant from the Simon Cumbers Fund","summary":"'Irish Examiner' journalist Imasha Costa meets women in Sri Lanka who set up their own businesses with support from Irish aid","url":"https://www.irishexaminer.com/news/spotlight/arid-41674973.html","image":"https://www.irishexaminer.com/cms_media/module_img/9440/4720286_16_seoimage1x1_Women_2bbusinesses_20Sri_20Lanka_20SC_3b_20Sumeda_2c_2037_20is_20one_20of_20three_20sisters_20who_20set_20up_20their_20small_20business_1_.jpg","video":null,"publish_date":"2025-07-28 00:07:00","author":"Imasha Costa,Irishexaminer.com","authors":["Imasha Costa","Irishexaminer.com"],"language":"en","source_country":"ie","sentiment":0.034},{"id":345793916,"title":"Epstein Files Unveil Shocking New Revelations | DOJ, Maxwell, Trump Reactions | N18G | News18","text":"Last Updated:July 28, 2025, 05:35 IST Videos\n\nExplosive new details have emerged from the recently unsealed Jeffrey Epstein files, revealing key names, connections, and a deeper understanding of the Epstein-Maxwell network. The Department of Justice is reportedly reviewing these documents, with Ghislaine Maxwell once again at the center of the scandal.This comes amid growing public demand for transparency and accountability. Watch this special report for reactions from the DOJ, political leaders including Donald Trump, and legal experts. News18 Mobile App - https://onelink.to/desc-youtube","summary":"Explosive new details have emerged from the recently unsealed Jeffrey Epstein files, revealing key names, connections, and a deeper understanding of the Epstein-Maxwell network. The Department of Justice is reportedly reviewing these documents, with Ghislaine Maxwell once again at the center of the scandal.This comes amid growing public demand for transparency and accountability. Watch this special report for reactions from the DOJ, political leaders including Donald Trump, and legal experts. News18 Mobile App - https://onelink.to/desc-youtube","url":"https://www.news18.com/videos/epstein-files-unveil-shocking-new-revelations-doj-maxwell-trump-reactions-n18g-news18-9467595.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/1753661463_0b6a9d2c-b3b6-4c67-8d90-9877dd01f10a.jpeg","video":null,"publish_date":"2025-07-28 00:05:45","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":0.257},{"id":345793966,"title":"Return of meme stock mania has traders on alert for market froth","text":"TIL CreativesWhen GameStop and AMC Entertainment captured the world's attention.\n\nThe reemergence of meme stock mania last week has professional investors facing a quandary: ride the excitement of retail traders or take it as the latest warning sign that the frothy markets are due for a pullback.The speculative stocks caught up in the frenzy this week, like Opendoor Technologies and Kohl's, gave up some of their gains as the week went on, but most are still trading at their highest levels in months. The broader S&P 500 Index and Nasdaq 100 Index are doing even better, sitting at all-time highs after charging back from the early April selloff set off by President Donald Trump's tariff announcements.There are indicators that investors are abandoning restraint and betting on further gains. The amount that investors are borrowing to buy stocks on the New York Stock Exchange, known as margin debt, has exceeded the tech-bubble highs to reach a new record, according to data from the Financial Industry Regulatory Authority. But signs of fatigue are creeping in. The latest meme stock rally seemed to lose steam after just a few days, and Bitcoin, one of the most visible symbols of the speculative fever, has recently fallen back from its record highs. Some Wall Street trading desks have been urging clients to scoop up discounted protection against possible losses. The current run has stretched valuations, with the S&P 500 trading at nearly 23 times forward earnings, well above the ten-year average of around 18, signalling that stocks have gotten significantly more expensive. \"I'm seeing it and just starting to just tuck my horns in a little bit,\" said Eric Diton, president and managing director of the Wealth Alliance. \"I'm longer-term bullish, but I'm just short-term cautious. I really think we're overdue for some kind of a pullback again because of the excessive speculation.\"Live EventsFor help in navigating the volatility, some market watchers are looking for comparisons with the most famous meme stock moment back in January 2021, when GameStop and AMC Entertainment captured the world's attention. That buying was fuelled by retail traders who were flush with stimulus checks and stuck at home, swapping tips on social media. It came after a banner year in the markets, in 2020, but ended up being only the beginning of an even bigger rally in 2021, when the S&P 500 rose another 27%. There was, though, eventually a reckoning in 2022 when the index plunged 19%, notching the worst yearly performance since the great financial crisis. (You can now subscribe to our ETMarkets WhatsApp channel)\n\nRead More News onmeme stock maniamarket frothretail tradersS&P 500 Indexmargin debtBitcoin\n\n(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...moreless\n\n(You can now subscribe to our ETMarkets WhatsApp channel)Read More News onmeme stock maniamarket frothretail tradersS&P 500 Indexmargin debtBitcoin(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2025, Share Market on Budget 2025 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .) Subscribe to ET Prime and read the Economic Times ePaper Online.and Sensex Today. Top Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price...moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"Meme stock enthusiasm has returned, creating uncertainty for professional investors. Stocks like Opendoor Technologies and Kohl's experienced gains. The S&P 500 and Nasdaq 100 indices reached record highs. Investors are borrowing heavily to buy stocks. Some analysts suggest caution due to high valuations. Comparisons are being drawn to the GameStop and AMC surge of 2021.","url":"https://economictimes.indiatimes.com/markets/stocks/news/return-of-meme-stock-mania-has-traders-on-alert-for-market-froth/articleshow/122942108.cms","image":"https://img.etimg.com/thumb/msid-122942156,width-1200,height-630,imgsize-2278215,overlay-etmarkets/articleshow.jpg","video":null,"publish_date":"2025-07-28 00:04:35","author":"President Donald Trump","authors":["President Donald Trump"],"language":"en","source_country":"in","sentiment":-0.406},{"id":345792012,"title":"Who’s Lt Col Matthew Lohmeier? Ex-Space Force Anti-‘Woke’ Officer Appointed Air Force Undersecretary","text":"Lt Col Matthew Lohmeier, once removed from his command post for publicly slamming what he called “neo-Marxist” ideology within the US military, is now officially its second-highest civilian in the Air Force. The Senate confirmed him on Thursday by a razor-thin 52–46 vote, with every Republican voting in favour and nearly every Democrat opposing. Three years ago, Lohmeier had been sidelined by the very institution he now helps lead. In 2021, he was sacked as commander of the 11th Space Warning Squadron after appearing on a podcast to promote Irresistible Revolution, his self-published book claiming Marxist thought was being “infused” into the armed forces through critical race theory and diversity training. That move cost him his uniform, but it didn’t end his war. From Fired Officer To Civilian Boss: A Turnaround Rooted In Trumpworld Politics Donald Trump, in a January post on Truth Social, had made it clear Lohmeier wasn’t just another appointee. “Matthew will work with the GREAT Secretary of Defence nominee Pete Hegseth to end the devastating ‘woke’ policies that have destroyed our Military,” Trump wrote. “We will make our Country STRONG AGAIN.” Lohmeier’s rise from public exile to the undersecretary’s chair is emblematic of a larger project underway inside the Republican defence establishment — one aimed at purging progressive cultural frameworks from the military’s bureaucratic core. His appointment now puts him in charge of shaping Air Force and Space Force personnel policy, budget, installations, and management — essentially the nerve centre of everyday operations. “Un-American And Divisive”: What Lohmeier Said That Sparked His 2021 Firing Back in 2021, Lohmeier told podcast host L. Todd Wood that critical race theory and diversity initiatives were “un-American and divisive” and that they threatened the cohesion and readiness of the military. He argued that instead of unifying troops under a common flag, these policies were creating tribal camps based on identity. The Air Force didn’t see it that way. Within days, Lohmeier was relieved of command. While the Pentagon opened an investigation, it ultimately closed it after he voluntarily separated from service that September. His dismissal, however, made him a darling of conservative media. The book topped Amazon’s political nonfiction charts, and Lohmeier began touring with groups like Turning Point USA and The Heritage Foundation. Democrats Warn Of Politicisation; Lohmeier Refuses To Commit To Recusal From Space Force Matters During his May 1 Senate hearing, Democrats challenged Lohmeier on whether his past political activism would bleed into his new job. When Senator Mazie Hirono asked if he would recuse himself from cases involving his former commanders, like Gen. Stephen Whiting or Maj. Gen. Devin Pepper — Lohmeier didn’t offer a direct yes. He instead promised to treat “all people fairly according to the law.” “That is totally not reassuring,” Hirono shot back, visibly unsatisfied. For many Democrats, Lohmeier’s history of vocal dissent while in uniform — something service members are trained to avoid — makes him an ideologically risky figure in an office that demands discretion and neutrality. The Culture War Has Arrived In The Air Force’s Civilian Ranks While Republican senators cheered his confirmation as a “course correction,” Democratic lawmakers warned that Lohmeier’s elevation could deepen political fault lines within the military bureaucracy. “This goes against decades of tradition in keeping civilian defence leadership apolitical,” said Sen. Jack Reed, the Armed Services Committee chair. For them, Lohmeier is not a rule-breaker, he’s a whistleblower who refused to play along. He’s expected to work closely with Pete Hegseth, Trump’s nominee for Defence Secretary, to execute a top-down ideological reset of the Pentagon if Trump wins a second term in November. What happens next remains to be seen. Get Latest News Live on Times Now along with Breaking News and Top Headlines from US News and around the World.","summary":"Former Space Force officer Lt Col Matthew Lohmeier, who was fired in 2021 for criticising diversity and critical race theory in the military, has now been confirmed as the Air Force Undersecretary. His appointment marks a dramatic return, signalling a deeper Republican-led push to overhaul perceived “woke” culture within defence institutions.","url":"https://www.timesnownews.com/world/us/us-news/whos-lt-col-matthew-lohmeier-ex-space-force-anti-woke-officer-appointed-air-force-undersecretary-article-152359562","image":"https://images.timesnownews.com/thumb/msid-152359602,thumbsize-58704,width-1280,height-720,resizemode-75/152359602.jpg","video":null,"publish_date":"2025-07-28 00:04:27","author":"Yuvraj Tyagi","authors":["Yuvraj Tyagi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.182},{"id":345790168,"title":"US and China to talk in Stockholm on trade with eye on Trump-Xi summit later this year","text":"When top U.S. and Chinese officials meet in Stockholm, they are almost certain to agree to at least leaving tariffs at the current levels while working toward a meeting between their presidents later this year for a more lasting trade deal between the world's two largest economies, analysts say.\n\nTreasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng are set to hold talks for the third time this year — this round in the Swedish capital, nearly four months after President Donald Trump upset global trade with his sweeping tariff proposal, including an import tax that shot up to 145% on Chinese goods.\n\n“We have the confines of a deal with China,” Trump said Friday before leaving for Scotland.\n\nBessent told MSNBC on Wednesday that the two countries after talks in Geneva and London have reached a “status quo,” with the U.S. taxing imported goods from China at 30% and China responding with a 10% tariff, on top of tariffs prior to the start of Trump's second term.\n\n“Now we can move on to discussing other matters in terms of bringing the economic relationship into balance,” Bessent said. He was referring to the U.S. running a $295.5 billion trade deficit last year. The U.S. seeks an agreement that would enable it to export more to China and shift the Chinese economy more toward domestic consumer spending.\n\nThe Chinese embassy in Washington said Beijing hopes “there will be more consensus and cooperation and less misperception” coming out of the talks.\n\nWith an eye on a possible leaders' summit, Stockholm could provide some answers as to the timeline and viability of that particular goal ahead of a possible meeting between Trump and Chinese leader Xi Jinping.\n\n“The meeting will be important in starting to set the stage for a fall meeting between Trump and Xi,” said Wendy Cutler, a former U.S. trade negotiator and now vice president at the Asia Society Policy Institute. “Beijing will likely insist on detailed preparations before they agree to a leaders’ meeting.”\n\nIn Stockholm, the two sides are likely to focus on commercial announcements to be made at a leaders’ summit as well as agreements to address “major irritants,” such as China's industrial overcapacity and its lack of control over chemicals used to make fentanyl, also to be announced when Xi and Trump should meet, Cutler said.\n\nSean Stein, president of the U.S.-China Business Council, said Stockholm could be the first real opportunity for the two governments to address structural reform issues including market access in China for U.S. companies.\n\nWhat businesses will be seeking coming out of Stockholm would largely be “the atmosphere” — how the two sides characterize the discussions. They will also look for clues about a possible leaders’ summit because any real deal will hinge on the two presidents meeting each other, he said. \n\n Fentanyl-related tariffs are likely a focus for China \n\nIn Stockholm, Beijing will likely demand the removal of the 20% fentanyl-related tariff that Trump imposed earlier this year, said Sun Yun, director of the China program at the Washington-based Stimson Center. \n\nThis round of the U.S.-China trade dispute began with fentanyl, when Trump in February imposed a 10% tariff on Chinese goods, citing that China failed to curb the outflow of the chemicals used to make the drug. The following month, Trump added another 10% tax for the same reason. Beijing retaliated with extra duties on some U.S. goods, including coal, liquefied natural gas, and farm products such as beef, chicken, pork and soy.\n\nIn Geneva, both sides climbed down from three-digit tariffs rolled out following Trump's “Liberation Day” tariffs in April, but the U.S. kept the 20% “fentanyl” tariffs, in addition to the 10% baseline rate — to which China responded by keeping the same 10% rate on U.S. products. These across-the-board duties were unchanged when the two sides met in London a month later to negotiate over non-tariff measures such as export controls on critical products.\n\nThe Chinese government has long protested that American politicians blame China for the fentanyl crisis in the U.S. but argued the root problem lies with the U.S. itself. Washington says Beijing is not doing enough to regulate precursor chemicals that flow out of China into the hands of drug dealers.\n\nIn July, China placed two fentanyl ingredients under enhanced control, a move seen as in response to U.S. pressure and signaling goodwill.\n\nGabriel Wildau, managing director at the consultancy Teneo, said he doesn't expect any tariff to go away in Stockholm but that tariff relief could be part of a final trade deal.\n\n“It’s possible that Trump would cancel the 20% tariff that he has explicitly linked with fentanyl, but I would expect the final tariff level on China to be at least as high as the 15-20% rate contained in the recent deals with Japan, Indonesia, Vietnam,” Wildau said.\n\n US wants China to dump less, buy less oil from Russia and Iran \n\nChina's industrial overcapacity is as much a headache for the United States as it is for the European Union. Even Beijing has acknowledged the problem but suggested it might be difficult to address.\n\nAmerica’s trade imbalance with China has decreased from a peak of $418 billion in 2018, according to the Census Bureau. But China has found new markets for its goods and as the world’s dominant manufacturer ran a global trade surplus approaching $1 trillion last year — somewhat larger than the size of the U.S. overall trade deficit in 2024. And China’s emergence as a manufacturer of electric vehicles and other emerging technologies has suddenly made it more of a financial and geopolitical threat for those same industries based in the U.S., Europe, Japan and South Korea.\n\n“Some enterprises, especially manufacturing enterprises, feel more deeply that China’s manufacturing capabilities are too strong, and Chinese people are too hardworking. Factories run 24 hours a day,” Chinese Premier Li Qiang said on Thursday when hosting European Commission President Ursula von der Leyen in Beijing. “Some people think this will cause some new problems in the balance of supply and demand in world production.”\n\n“We see this problem too,” Li said.\n\nBessent also said the Stockholm talks could address Chinese purchases of Russian and Iranian oil. However, Wildau of Teneo said China could demand some U.S. security concessions in exchange, such as a reduced U.S. military presence in East Asia and scaled-back diplomatic support for Taiwan and the Philippines. This would likely face political pushback in Washington.\n\nThe Stockholm talks will be “geared towards building a trade agreement based around Chinese purchase commitments and pledges of investment in the U.S. in exchange for partial relief from U.S. tariffs and export controls,” Wildau said. \n\nHe doubts there will be a grand deal. Instead, he predicts “a more limited agreement based around fentanyl.”\n\n“That,” he said, “is probably the preferred outcome for China hawks in the Trump administration, who worry that an overeager Trump might offer too much to Xi.”\n\nAssociated Press writer Paul Wiseman contributed to this report","summary":"U.S. and Chinese officials are meeting in Stockholm to discuss trade tariffs and a potential summit between their leaders","url":"https://www.independent.co.uk/news/world/americas/donald-trump-china-stockholm-beijing-xi-jinping-b2797045.html","image":"https://static.independent.co.uk/2025/07/26/06/China_US_Trade_Talks_04425.jpg?width=1200","video":null,"publish_date":"2025-07-28 00:03:52","author":"Didi Tang","authors":["Didi Tang"],"language":"en","source_country":"gb","sentiment":-0.068},{"id":345794250,"title":"Silly season symbolised by butter price beat-up","text":"Reading Time: 3 minutes\n\nThe media fixation on the price of butter makes me think there’s nothing else of importance happening in the agricultural space. True, it’s the low season for primary production – but there are still a number of important things happening in the real world, some of them really positive.\n\nThe sheer amount of whingeing about the butter price and the government’s inability to do anything about it makes me wonder if the popular media really can find nothing better to publicise than the aggrieved reactions of people who must find something to blame for the high cost of living. \n\nThat anybody could possibly imagine a conversation between Finance Minister Nicola Willis and Fonterra CEO Miles Hurrell would have produced anything other than a statement of the facts determining the butter price is absolutely baffling. \n\nOn reflection I think it’s just the media jumping on a populist bandwagon that is guaranteed to attract lots of feedback, making them believe that’s what drives audience and market share. \n\nThere is so much that is positive about high prices for our export-destined primary produce, not least the contribution to New Zealand’s GDP and balance of payments, but unfortunately these aren’t sensational enough to gain the attention of readers, listeners or viewers. \n\nThe other main topic guaranteed to produce a strong reaction, bordering on fanaticism, is agriculture’s unavoidable contribution to climate change and seemingly slow progress towards meeting emissions reduction targets. \n\nThe fact that methane is a relatively short-lived gas with emissions reducing because of decreasing livestock numbers fails to gain traction with the public.\n\nFew mainstream media interviewers are prepared to do the hard work involved in researching the true facts, as it is much easier to pander to those who propound a popularly held, if ill-informed, viewpoint. \n\nThe choice of interviewee often appears to be driven by the wish for an opinion that conforms to the media outlet’s view of the topic or that of its audience.\n\nThe important topics attracting attention include the impact of tariffs, improving trade relationships, sustainability of commodity pricing (which I confess to doubting in a recent column), belief in the potential for increased dairy and meat production, processing capacity rationalisation, carbon farming and regional economic growth.\n\nUnited States President Donald Trump’s real or threatened tariffs on a wide range of countries so far appears to have benefited New Zealand’s export prices and trade relationships. The free trade agreement with the United Arab Emirates, FTA negotiations with India, and Canada’s sudden agreement to honour its obligation to remove quotas on our dairy products under the terms of CPTPP are all recent trade successes.\n\nOur trade relationships with China, the European Union and United Kingdom are flourishing in the new environment of uncertainty where countries other than the US wish to insulate themselves against Trump’s heavy-handed attempts at bullying. \n\nIn addition, our trade with the US is bolstered by strong demand for our exports, particularly beef ,of which there is a cyclical shortage there. The net result is a sustainably high price for our production for which the inevitable corollary is a high domestic price, which lifts the food inflation rate. \n\nThe success of dairy also seems to be sustainable and spread across the whole range, not just whole milk powder, but also butter, cheese and skim milk powder, which points to the potential for greater production, which reached “peak cow” about five years ago. \n\nThe challenge will be to increase dairy production sustainably, instead of wholesale conversions based on irrigation offtake.\n\nThe positive performance of the rural economy has driven regional growth in the South Island, as evidenced by Kiwibank’s latest annual regional report, although tourism and construction have also contributed. \n\nThe report notes continued farmer caution despite improved earnings, although these will feed into increased spending.\n\nOn the negative side, there is a high level of global uncertainty, caused by regional wars and Trump’s unpredictability, which threaten trade patterns. New Zealand must navigate its course cautiously between commitments to our two major export trading partners, China and the US, but there is always the fear we will be faced with making an unpalatable choice between trade and security.\n\nOn the domestic front the adverse effect of forestry conversions, fuelled by carbon farming incentives, will continue to take pastoral land, regardless of this government’s changes to the Emissions Trading Scheme and land use classes. \n\nIt would be a tragedy if New Zealand were no longer able to produce enough meat and dairy to satisfy growing demand from high value markets because of artificially incentivised mass plantings of pine trees.\n\nThe last item on the list of challenges is orderly rationalisation of meat processing capacity. There is no argument there are too many plants, especially South Island sheep processing facilities. \n\nThere is little incentive for a North Island beef processor to share the pain, but something has to happen. The immediate question concerns the future of Alliance – who might buy it and why? \n\nThe silly season has some serious topics more deserving of attention than the butter price.","summary":"Allan Barber points out that a high butter price is actually a good thing for New Zealand.\n\n\nThe post Silly season symbolised by butter price beat-up appeared first on Farmers Weekly.","url":"https://www.farmersweekly.co.nz/opinion/silly-season-symbolised-by-butter-price-beat-up/","image":"https://www.farmersweekly.co.nz/wp-content/uploads/2022/06/butter-1.jpg.jpg","video":null,"publish_date":"2025-07-28 00:01:20","author":"Allan Barber","authors":["Allan Barber"],"language":"en","source_country":"nz","sentiment":0.176},{"id":345793910,"title":"Trump: Israel Has A Big Decision To Make | Gaza Escalation Or Ceasefire? | Israel Gaza Latest|  N18G","text":"Last Updated:July 28, 2025, 05:31 IST Videos\n\nFormer U.S. President Donald Trump has issued a stark warning to Israel, stating that the country has a “big decision to make” amid growing global pressure over the Gaza offensive.While speaking at a Florida town hall, Trump hinted at rising divisions within the U.S.-Israel alliance and said the time has come for Israel to decide whether to escalate or de-escalate the conflict. Mobile App - https://onelink.to/desc-youtube","summary":"Former U.S. President Donald Trump has issued a stark warning to Israel, stating that the country has a “big decision to make” amid growing global pressure over the Gaza offensive.While speaking at a Florida town hall, Trump hinted at rising divisions within the U.S.-Israel alliance and said the time has come for Israel to decide whether to escalate or de-escalate the conflict. Mobile App - https://onelink.to/desc-youtube","url":"https://www.news18.com/videos/trump-israel-has-a-big-decision-to-make-gaza-escalation-or-ceasefire-israel-gaza-latest-n18g-9467593.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/1753661047_79cf43c1-5f4d-4742-91c9-cece4d4800a7.jpeg","video":null,"publish_date":"2025-07-28 00:01:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.434},{"id":345790176,"title":"Lindsey Graham spars with NBC anchor over Tulsi Gabbard's new Russiagate allegations","text":"NBC \"Meet the Press\" host Kristen Welker asked Sen. Lindsey Graham, R-S.C., if he was trying to \"distract from the Epstein matter\" during a heated exchange on Sunday over Trump administration allegations that former President Obama may have directed the U.S. intelligence agencies to implicate Trump in the Russiagate scandal. \"You’re trying to sweep this stuff under the rug, and that’s not right!\" Graham said. The argument erupted over the recent allegations lodged by Director of National Intelligence Tulsi Gabbard. Gabbard claimed that declassified intelligence documents and a declassified 2020 House Intelligence Committee report revealed that in the waning days of the Obama administration, the then-president ordered U.S. intel agencies to alter their assessment of Russia’s attempts to interfere in the election specifically to help elect Donald Trump. The DNI director said that the intelligence agencies had originally concluded that Russia was not trying to help Trump get elected. Gabbard alleged that the agencies in fact had evidence that Putin expected Hillary Clinton to win the presidency. Gabbard alleged that this was tantamount to a \"treasonous conspiracy.\" DNI GABBARD CLAIMS ‘DEEP STATE ACTORS’ DIDN’T WANT TRUMP-RUSSIA INFORMATION TO 'SEE THE LIGHT OF DAY' \"The treasonous conspiracy that we have now released to the American people — the complicity, the deflection, and the silence of politicians, of the mainstream media, and of those directly implicated into this speaks volumes,\" Gabbard told Fox & Friends. President Trump called for Obama and others to face \"very severe consequences\" for attempting to \"rig the election.\" Obama issued a rare official response to Trump, blasting the claims as \"bizarre\" and a \"weak attempt at distraction.\" \"The bizarre allegations are ridiculous and a weak attempt at distraction. Nothing in the document issued last week undercuts the widely accepted conclusion that Russia worked to influence the 2016 presidential election but did not successfully manipulate any votes,\" he said. \"These findings were affirmed in a 2020 report by the bipartisan Senate Intelligence Committee, led by then-Chairman Marco Rubio,\" a spokesperson for Obama said. Welker claimed that she had spoken to Republican former CIA officer Susan Miller, who categorically denied Gabbard’s claims. The NBC anchor also pointed to a Trump-appointed special counsel, John H. Durham, who she claimed concluded in 2023 that there was no political interference in the Russiagate probe. She also played a clip of Graham himself saying in 2017 that the Russians interfered in the election to embarrass Hillary Clinton. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE \"There's only one person in Washington that I know of that has any doubt about what Russia did in our election and is President Trump,\" Graham said at the time. The South Carolina senator replied that Gabbard’s report contained information that hadn’t previously been disclosed, and that the allegations warranted a special counsel investigation. \"Well, what I am saying is that you left a lot out here… The Mueller investigation was crooked and rotten to the core. The Washington Post and the New York Times got a Pulitzer Prize for reporting on Trump's campaign's relationship with Russia. It was all B.S.,\" Graham said. Graham said he isn’t calling for former President Obama to be prosecuted for treason, but said that a special counsel should look into whether the former president ordered the intelligence report to be changed because he didn’t like the outcome. He lamented that so many lives got turned upside down by the Mueller investigation, and accused Welker of trying to sweep the administration’s findings \"under the rug.\" \"For years and months and days and weeks, people had their lives turned upside down, chasing the Mueller narrative that Trump was in bed with the Russians, that the Trump campaign was colluding with the Russian… You’re trying to sweep this stuff under the rug and that’s not right,\" he said. CLICK HERE TO GET THE FOX NEWS APP","summary":"Political tensions rise as Trump and Graham question Mueller investigation&apos;s integrity on Russian election interference, while Obama defends intelligence findings.","url":"https://www.foxnews.com/media/lindsey-graham-spars-nbc-anchor-over-tulsi-gabbards-new-russiagate-allegations","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/07/931/523/AP22186666103217.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-28 00:00:57","author":"David Spector","authors":["David Spector"],"language":"en","category":"politics","source_country":"us","sentiment":-0.195},{"id":345790846,"title":"Japan pitches Tokyo as new UN hub while US steps back from world stage","text":"As the United States increasingly retreats from global leadership, Japan is positioning itself to fill the void with Tokyo Governor Yuriko Koike’s proposal that the United Nations shift some of its operations to the Japanese capital.\nKoike returned to Japan on Sunday following an official visit to the US, where she addressed the Johns Hopkins School of International Studies in Washington and highlighted Tokyo’s emergence as a major player on the world stage.\nDuring her visit, she also met with policy experts at the Hudson Institute think tank, where Tokyo’s drive to become a sustainable metropolis was high on the agenda.\nOn Thursday, Koike held a 15-minute meeting with UN Secretary General Antonio Guterres at the organisation’s headquarters in New York. There, she proposed that more of the UN’s offices be relocated to cities elsewhere in the world, including Tokyo.\n“Tokyo would like to provide various types of support [to the UN],” Koike told reporters after the meeting, highlighting the city’s advantages over other locations, such as “public safety, security and now, with the weak yen, there are other positive aspects to life”.\nGuterres acknowledged that his office had “received offers of cooperation from various countries and regions”, but declined to elaborate on the Japanese proposal or whether it might be pursued further.\n\n“Japan has for many years been a big contributor to the UN and there are already some facilities here, such as the UN University and an office of the UN High Commissioner for Refugees,” said Ben Ascione, an assistant professor of international relations at Tokyo’s Waseda University.\n“It is obviously very early days and I see this as Koike sounding Guterres out at this stage,” he said, noting several reasons why both Japan’s national government and Tokyo’s metropolitan authorities were likely seeking a higher international profile.\n“Firstly, something like this brings prestige and recognition,” Ascione told This Week in Asia. “Japan has long placed importance on the UN’s functions and has a history of a UN-centred foreign policy.”\nHe pointed to Article 9 of the Japanese constitution, which renounces war as a means of settling disputes and aligns closely with the UN’s mandate to resolve international issues through dialogue.\n“And that is perhaps even more important at a time when the present US administration is undermining the international order that previous administrations built,” Ascione said.\n“We are in a period of international chaos with [American President Donald] Trump pulling the US out of all kinds of international organisations and causing more chaos with trade tariffs.”\n\nIn mid-July, Trump announced that the US would again be withdrawing from the UN Educational, Scientific and Cultural Organisation. The US had previously left Unesco in 2017, during Trump’s first presidency, but rejoined under Joe Biden.\nIn a statement on Tuesday, Audrey Azoulay, Unesco’s director general, said: “This decision contradicts the fundamental principles of multilateralism and may affect first and foremost our many partners in the United States of America.”\nAzoulay said she expected a response similar to that of 2017, when the agency “stepped up its efforts to take action wherever its mission could contribute to peace and demonstrated the pivotal nature of its mandate”.\nAscione argued that US instability had made Japan an “attractive proposition” for hosting some of the UN’s operations at a moment when the organisation was striving to maintain global and regional stability.\n“Japan also wants to be seen as a leading peacemaker and stabiliser in the East Asia region and while these plans are tentative at the moment, I think it would be good if it did happen,” he added.\nJapan wants to be seen as a leading peacemaker and stabiliser in the East Asia region\nBen Ascione, international-relations professor\nJapan has recently made other moves to raise its diplomatic profile, including last year’s proposal for Tokyo to host a planned Asia branch of the International Criminal Court, which is headquartered in The Hague.\nBeyond its desire for a greater role in international decision-making, Japan is also concerned about how rivals – notably China – have gained influence in global institutions.\nTokyo’s anxiety dates back to the early 2010s, when Chinese officials came to lead four of the UN’s 15 principal agencies: the Food and Agriculture Organisation, the UN Industrial Development Organisation, the International Telecommunication Union and the International Civil Aviation Organisation.\nNine of these 15 UN agencies also have Chinese deputies. Beijing has further been accused of wielding influence over UN departments through proxy candidates it supports, such as Tedros Ghebreyesus, now serving a second term as director general of the World Health Organization.","summary":"As the United States increasingly retreats from global leadership, Japan is positioning itself to fill the void with Tokyo Governor Yuriko Koike’s proposal that the United Nations shift some of its operations to the Japanese capital.\nKoike returned to Japan on Sunday following an official visit to the US, where she addressed the Johns Hopkins School of International Studies in Washington and highlighted Tokyo’s emergence as a major player on the world stage.\nDuring her visit, she also met with...","url":"https://www.scmp.com/week-asia/politics/article/3319740/japan-pitches-tokyo-new-un-hub-us-steps-back-world-stage","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/07/27/53129cca-7510-4162-bb87-dcd4000f08a7_94b2801f.jpg","video":null,"publish_date":"2025-07-28 00:00:15","author":"Julian Ryall","authors":["Julian Ryall"],"language":"en","source_country":"cn","sentiment":0.157},{"id":345790178,"title":"Florida county school board chair deletes comments celebrating Hulk Hogan's death as 'one less MAGA'","text":"Florida county school board chair Sarah Rockwell apologized for Facebook comments celebrating legendary wrestler Hulk Hogan’s death on Thursday as \"one less MAGA\" in the world. \"Oh did Hulk die? I didn’t even know. Good. One less MAGA in the world,\" Rockwell’s since-deleted comment read. In a follow-up comment, Rockwell added, \"[H]e worked with the McMahons to union bust professional wrestling. [H]e’s never been a good guy. I feel absolutely nothing about his death.\" KENTUCKY SCHOOL OFFICIAL RESIGNS AFTER ALLEGEDLY CALLING TO 'SHOOT REPUBLICANS' ON SOCIAL MEDIA After her comments went viral on social media, Rockwell deleted and apologized for them on her official school board Facebook account. \"A few days ago, I made a cruel and flippant comment from my personal Facebook account on a friend’s post regarding the death of Hulk Hogan,\" she wrote on Saturday. \"I deeply regret making that comment and have since removed it. I want to make it very clear that I never have and never will wish harm on anyone regardless of whether we share political views. While I strongly disagree with some of the comments Hulk Hogan made, that is no excuse for my comment.\" Rockwell added, \"I also sincerely apologize for the way my comment has eroded confidence in my ability to represent all students, families, and staff in Alachua County. I want to assure all of you that the best interests of our children and our public schools are at the center of everything I do as a board member. I hope I have shown that by my record of advocacy for children, families, and staff members throughout Alachua County. Again, I apologize for the hurt and distrust I have caused with my insensitive comment. I will continue to do the hard work of putting our children and schools first. I hope that I can earn back your trust.\" IOWA SCHOOL BOARD MEMBER GETS RIPPED FOR SAYING PUBLIC EDUCATION IS 'NOT TO TEACH KIDS WHAT PARENTS WANT’ Fox News Digital reached out to Rockwell and Alachua County Public Schools for comment. Hogan, whose real name is Terry Bollea, died at age 71 after suffering cardiac arrest at his home in Clearwater, Florida. He was a six-time WWE champion, won the Royal Rumble twice and was inducted into the WWE Hall of Fame as an individual in 2005 and as a member of the NWO in 2020. He was also a six-time world heavyweight champion in WCW as well as the IWGP champion in New Japan Pro-Wrestling once. CLICK HERE TO GET THE FOX NEWS APP At the Republican National Convention last year, Hogan endorsed President Donald Trump for another term by ripping off his shirt to expose a sleeveless \"Trump Vance Make America Great Again\" shirt.","summary":"Alachua County School Board chair Sarah Rockwell apologized and deleted a controversial Facebook post cheering legendary wrestler Hulk Hogan’s death.","url":"https://www.foxnews.com/media/florida-county-school-board-chair-deletes-comments-celebrating-hulk-hogans-death-one-less-maga","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Hulk-Hogan3.jpg?ve=1&tl=1","video":null,"publish_date":"2025-07-28 00:00:01","author":"Lindsay Kornick","authors":["Lindsay Kornick"],"language":"en","source_country":"us","sentiment":-0.285},{"id":345791824,"title":"How Trump wants the US to cash in on mineral-rich DR Congo's peace deal","text":"Under the peace deal, DR Congo and Rwanda agreed to launch a \"security co-ordination mechanism\" within 30 days of the 27 June deal.\n\nMr Verelst said that a ceasefire was expected to take effect on Tuesday, followed by the DR Congo government and the M23 signing a comprehensive peace agreement by 18 August, building on the \"declaration of principles\" they had already negotiated.\n\nDR Congo-based International Crisis Group (ICG) think-tank analyst Onesphore Sematumba said the US and Qatar were getting deals struck in \"record time\" since Trump's rise to the US presidency in January. \n\nMr Sematumba said their intervention came after various Africa-led mediation efforts had \"failed to get the parties to sign even a single document\" since 2022. \n\n\"Regional players do not have the same leverage to influence Kigali and Kinshasa,\" he added.\n\n\"But between the signing of an agreement and the achievement of peace, the road can be long, and it will be long in this case,\" Mr Sematumba warned. \n\nOne key question is whether the M23 will give up the territory under its control, as demanded by Tshisekedi's government.\n\nMr Sematumba said the M23 had agreed to \"state authority\" being established across DR Congo, however, the rebels have also said they would not give up a \"single centimetre\" of land. \n\n\"Personally, I think the transition should be gradual, and for certain areas there should be some kind of co-management. But everything will depend on the tact of the mediators, and their ability to break the ice,\" Mr Sematumba added.\n\nHe said the success of the peace initiative also hinged on what the agreement called the \"lifting of defensive measures\" by Rwanda, widely interpreted to mean the withdrawal of its troops from eastern DR Congo.\n\nWhile Rwanda denies backing the M23, it says it wants to wipe out the FDLR, a militia born from those who carried out the 1994 genocide in Rwanda and then fled into DR Congo. Rwanda has accused the Congolese army of working with the FDLR.\n\nThe peace deal spells out that the FDLR should be \"neutralised\", however this has been attempted several times over the past three decades.\n\n\"For Rwanda, the neutralisation of the FDLR is a precondition for the withdrawal of its forces, while DR Congo says the two must be achieved simultaneously,\" Mr Sematumba pointed out, saying that mediators would have to find a solution as these issues had led to the failure of previous peace initiatives.\n\n\"Just by following the different interpretations given by the parties to the texts signed, you can sense all the difficulties that lie ahead,\" Mr Sematumba said. \n\nProf Mostert agreed that diplomacy on its own could not achieve peace, and a broader initiative was needed.\n\n\"You build peace by transforming pain. That takes more than diplomacy. It takes dialogue, decentralised participation and dignifying people's experiences,\" she said.\n\n\"That's why I believe it is important that the dealmakers and the lawmakers remain aware of historical traumas, including decades of resource exploitation,\" Prof Mostert added.\n\nSo if he wants the peace to hold for long enough for US companies to profit, Donald Trump may have to keep the pressure on for some time to come.","summary":"The US president is spearheading an ambitious but controversial deal to end a long-running conflict.","url":"https://www.bbc.com/news/articles/cew0vzl7rwjo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/af90/live/9ffb6dd0-6876-11f0-af20-030418be2ca5.jpg","video":null,"publish_date":"2025-07-27 23:59:52","author":"Farouk Chothia","authors":["Farouk Chothia"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.092},{"id":345788014,"title":"US, EU Reach Agreement on Tariffs","text":"Edinburgh, July 27 (QNA) - The United States and the European Union have reached a framework trade agreement under which a 15 percent tariff will be imposed on most EU goods, according to an announcement made on Sunday.\n\nThe agreement was finalized following talks in Scotland between European Commission President Ursula von der Leyen and US President Donald Trump.\n\nSpeaking to reporters after the meeting, President Trump described the deal as \"the biggest ever made,\" while von der Leyen noted that the 15 percent tariffs would apply \"across all sectors,\" adding that the agreement is expected to bring greater stability to transatlantic trade relations.\n\nAs part of the deal, the European Union has also committed to investing USD 600 billion in the United States and to purchasing substantial quantities of American energy and military equipment.\n\nEarlier this month, on July 12, President Trump had threatened to impose a 30 percent tariff on EU imports starting August 1, after weeks of unsuccessful negotiations with key US trade partners on reaching a comprehensive deal.\n\nIn response, the EU had prepared retaliatory tariffs on EUR 93 billion (USD 109 billion) worth of US goods, which it planned to implement should the US move forward with its proposed 30 percent duties. (QNA)","summary":"Edinburgh, July 27 (QNA) - The United States and the European Union have reached a framework trade agreement under which a 15 percent tariff will be imposed on most EU goods, according to an announcement made on Sunday.","url":"https://qna.org.qa/en/news/news-details?id=us-eu-reach-agreement-on-tariffs&date=28/07/2025","image":"https://cdn.qna.org.qa/media/4a0m13vg/qna-eu-ukr-26-6-2023.jpg?width=1200&height=900&v=1db4b59c68f8a70","video":null,"publish_date":"2025-07-27 23:55:16","author":null,"language":"en","category":"politics","source_country":"qa","sentiment":0.115},{"id":345789358,"title":"Houthis announce ‘new phase’ of attacks on Israel-linked ships","text":"Yemen’s Houthi rebels have threatened to attack all commercial vessels connected to Israeli ports, regardless of their country of origin.\n\nThe armed group has been targeting ships in the Bab el Mandeb Strait, a vital maritime route linking the Red Sea and the Indian Ocean, in what it describes as an act of solidarity with Palestinians in Gaza.\n\nMilitary spokesman Ameen Hayyan announced the escalation in a televised address, describing it as a “new phase” of the group’s campaign.\n\n“This phase includes targeting all ships belonging to any company that deals with the ports of the Israeli enemy, regardless of the nationality of that company, and in any location within the reach of our armed forces,” he said.\n\nHayyan also urged countries to sever ties with Israel and pressure it to lift the “blockade” of Gaza.\n\nAccording to Reuters, the Houthis have attacked more than 100 vessels in the Red Sea since November 2023, sinking four ships, seizing one, and killing at least eight sailors. Earlier this month, the group seized and sank the Liberian-flagged Greek-owned bulkers Eternity C and Magic Seas.\n\nThe Houthis have also launched ballistic missiles at Israeli cities, most of which have been intercepted. In response, Israel has intensified airstrikes in Yemen, hitting Houthi-linked targets and port infrastructure, including a series of strikes on Monday.\n\n“Yemen will be treated like Tehran. The Houthis will pay heavy prices for firing missiles at the State of Israel,” Israeli Defense Minister Israel Katz said.\n\nIn May, the Houthis reached an Omani-mediated ceasefire with the US, ending a series of strikes ordered by President Donald Trump.","summary":"The Houthis have promised to expand attacks on commercial shipping in response to Israel’s war in Gaza \nRead Full Article at RT.com","url":"https://www.rt.com/news/622069-houthis-yemen-israel-new-phase/","image":"https://mf.b37mrtl.ru/files/2025.07/article/6886bb382030277222158765.jpg","video":null,"publish_date":"2025-07-27 23:52:28","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.186},{"id":345794458,"title":"Progs have abandoned progressivism, Columbia’s ‘message of hope’ and other commentary","text":"Liberal: Progs Have Abandoned Progressivism \n\n“Today’s progressives aren’t really progressive in the true sense of the term,” contends The Liberal Patriot’s Ruy Teixeira.\n\n“The quintessential moral commitment of midcentury progressives was to make American society truly colorblind.”\n\nNow, progs “favor color-conscious remedies like affirmative action.”\n\nThey view “merit and objective measures of achievement . . . with suspicion.” \n\nProgressives used to be steadfast defenders of free speech,” but now, they inflate free expression “with ‘violence’ and ‘harm’ and making people feel ‘unsafe.’”\n\nAnd they “prize goals like fighting climate change, procedural justice, and protecting identity groups above prosperity.”\n\n“So can today’s progressives be considered ‘progressive’ when they don’t really support free speech, cultural pluralism and the open society? They cannot and voters, especially working class voters, are unlikely to consider them so.” \n\nCampus watch: Columbia’s ‘Message of Hope’ \n\n“Because Trump took a stand — and took the heat from progressives and the news media — things may finally change for the better at Columbia,” prays USA Today’s Nicole Russell.\n\n“Columbia University has agreed to pay [a] $200 million fine to the federal government to settle accusations that the school failed to protect Jewish students from antisemitism on campus.”\n\nTrump was “standing against a culture on university campuses that promoted progressive values to the exclusion of dissenting opinions”: “Conservative students were shunned. And Jewish students were targeted because of Israel’s defense of its citizens.”\n\n“Institutions that accept taxpayer dollars must be held accountable.”\n\n“This is a win for Trump, a scathing reprimand of higher education and a message of hope for American Jews.” \n\nEconomy: Middle Class’ Historic Gains \n\n“Six months into his second term, President Donald Trump is delivering on his promise to create another middle-class economic boom,” cheers W.J. Lee at the Association of Mature American Citizens.\n\nIndeed, “a new Treasury Department report reveals that middle-class and blue-collar workers are experiencing real-wage gains not seen in nearly 60 years”: From December 2024 to May 2025, average hourly earnings for middle-class workers rose 1.7%, outpacing inflation.\n\nThat “translates to the most impressive half-year real-wage gain at the outset of a presidency” since Richard Nixon’s 0.8% increase almost six decades ago.\n\n“The only other time it came close to that? Eight years ago, during Trump’s first term.” \n\nFrom the right: Climate Alarms Fall Flat \n\n“The climate alarmists regularly seize on weather events they believe will help them exploit their narrative” but “ignore contradictory information,” quips the Issues & Insights editorial board.\n\nExamples? “The Northwest Passage is experiencing its third-highest level of sea ice extent in the last two decades,” despite Al Gore’s 2009 warning that “the Arctic polar ice cap could be gone during summer within five to seven years.”\n\nSimilarly, “efforts to attribute the deadly Texas flood . . . to human carbon dioxide emissions have been debunked,” and though “a Tampa, Fla., meteorologist blamed ‘climate change’ . . . for 90-degree days having doubled in the city,” the average number of days reaching 95°F or higher in the state of Florida has not increased since 1895. \n\nScience beat: Fund University Research Locally \n\n“Given the Trump administration’s funding cuts to the National Institutes of Health and the National Science Foundation, the US must rethink how it endows innovation at American universities,” argue Thomas D. Lehrman and George Gilder at The Wall Street Journal.\n\nPublicly funded university research “has fostered such innovations as the Global Positioning System, cancer therapies, recombinant DNA, and magnetic resonance imaging, or MRI.”\n\nThat history shows that “US technological leadership depends on creativity from our campuses.” States looking “to lead in research and innovation should follow the school-choice playbook and establish a class of nonprofit organizations.”\n\nIt falls on state leaders to support and “accelerate the scientific research essential to competing with global rivals and inventing lifesaving technologies.” \n\n— Compiled by The Post Editorial Board","summary":"“Today’s progressives aren’t really progressive in the true sense of the term,” contends The Liberal Patriot’s Ruy Teixeira.","url":"https://nypost.com/2025/07/27/opinion/progs-have-abandoned-progressivism-columbias-message-of-hope-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/07/newspress-collage-dhslmpy5l-1753655081045.jpg?quality=75&strip=all&1753645723&w=1200","video":null,"publish_date":"2025-07-27 23:50:05","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":0.101},{"id":345796466,"title":"US, China to resume tariff talks in effort to extend truce","text":"Chinese vice premier He Lifeng shakes hands with US treasury secretary Scott Bessent during a meeting in June. (Xinhua/AP pic)\nSTOCKHOLM: Senior US and Chinese negotiators meet in Stockholm on Monday to tackle longstanding economic disputes at the centre of a trade war between the world's top two economies, aiming to extend a truce keeping sharply higher tariffs at bay.\nChina is facing an Aug 12 deadline to reach a durable tariff agreement with president Donald Trump's administration after Beijing and Washington reached a preliminary deal in June to end weeks of escalating tit-for-tat tariffs.\nWithout an agreement, global supply chains could face renewed turmoil from duties exceeding 100%.\nThe Stockholm talks, led by US treasury secretary Scott Bessent and Chinese vice premier He Lifeng, come right on the heels of Trump's biggest trade deal yet, with the EU accepting a 15% tariff on its goods exports to the US and agreeing to make significant EU purchases of US energy and military equipment.\nThat deal struck with European Commission President Ursula von der Leyen on Sunday in Scotland also calls for US$600 billion in investments in the US by the EU, Trump told reporters.\nNo similar breakthrough is expected in the US-China talks, but trade analysts said that another 90-day extension of a tariff and export control truce struck in mid-May was likely.\nAn extension of that length would prevent further escalation and help create conditions for a potential meeting between Trump and Chinese President Xi Jinping in late October or early November.\nSpokespersons for the White House and US trade representative's office did not immediately respond to requests for comment on a South China Morning Post report quoting unnamed sources as saying the two sides would refrain from introducing new tariffs or take other steps that could escalate the trade war for another 90 days.\nTrump's administration is poised to impose new sectoral tariffs that will impact China, including on semiconductors, pharmaceuticals, ship-to-shore cranes and other products.\n\"We're very close to a deal with China. We really sort of made a deal with China, but we'll see how that goes,\" Trump told reporters before his meeting with von der Leyen, providing no further details.\nDeeper issues\nPrevious US-China trade talks in Geneva and London in May and June focused on bringing US and Chinese retaliatory tariffs down from triple-digit levels and restoring the flow of rare earth minerals halted by China and Nvidia's H20 AI chips and other goods halted by the US.\nSo far, the talks have not delved into broader economic issues. They include US complaints that China's state-led, export-driven model is flooding world markets with cheap goods and Beijing's complaints that US national security export controls on tech goods seek to stunt Chinese growth.\n\"Stockholm will be the first meaningful round of US-China trade talks,\" said Bo Zhengyuan, Shanghai-based partner at China consultancy firm Plenum.\nTrump has been successful in pressuring some other trading partners, including Japan, Vietnam and the Philippines, into deals accepting higher US tariffs of 15% to 20%.\nAnalysts say the US-China negotiations are far more complex and will require more time. China's grip on the global market for rare earth minerals and magnets, used in everything from military hardware to car windshield wiper motors, has proved to be an effective leverage point on US industries.\nTrump-Xi meeting?\nIn the background of the talks is speculation about a possible meeting between Trump and Xi in late October.\nTrump has said he will decide soon whether to visit China in a landmark trip to address trade and security tensions. A new flare-up of tariffs and export controls would likely derail any plans for a meeting with Xi.\n\"The Stockholm meeting is an opportunity to start laying the groundwork for a Trump visit to China,\" said Wendy Cutler, vice president at the Asia Society Policy Institute.\nBessent has already said he wants to work out an extension of the Aug 12 deadline to prevent tariffs snapping back to 145% on the US side and 125% on the Chinese side.\nStill, China will likely request a reduction of multi-layered US tariffs totalling 55% on most goods and further easing of US high-tech export controls, analysts said. Beijing has argued that such purchases would help reduce the US trade deficit with China, which reached US$295.5 billion in 2024.\nChina is currently facing a 20% tariff related to the US fentanyl crisis, a 10% reciprocal tariff, and 25% duties on most industrial goods imposed during Trump's first term.\nBessent has also said he would discuss with He the need for China to rebalance its economy away from exports toward domestic consumer demand. The shift would require China to put an end to a protracted property crisis and boost social safety nets to encourage household spending.\nMichael Froman, a former US trade representative during Barack Obama's administration, said such a shift has been a goal of US policymakers for two decades.\n\"Can we effectively use tariffs to get China to fundamentally change their economic strategy? That remains to be seen,\" said Froman, now president of the Council on Foreign Relations think tank.","summary":"A lasting tariff agreement is due by Aug 12, or global supply chains may face duties over 100%.","url":"https://www.freemalaysiatoday.com/category/business/2025/07/28/us-china-to-resume-tariff-talks-in-effort-to-extend-truce","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/06/5bf4280c-scott-bessent-1.jpg","video":null,"publish_date":"2025-07-27 23:37:13","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.002},{"id":345789678,"title":"America in Photos: Late Show Closure, President Trump Meets Filipino President, Extreme Heat Across the Country","text":"Visitors walk through Muir Woods National Monument, Calif., on July 24, 2025. The National Park Service has removed an exhibit at Muir Woods National Monument that aimed to highlight previously untold narratives. Muir Woods is the first National Park to remove an exhibit after President Donald Trump issued an executive order to eliminate a distorted narrative that the President says was being spread through the national parks, monuments and other federal institutions in the United States. Justin Sullivan/Getty Images","summary":"Notable moments from the past week in America.","url":"https://www.theepochtimes.com/article/america-in-photos-late-show-closure-president-trump-meets-filipino-president-extreme-heat-across-the-country-5893051","image":"https://img.theepochtimes.com/assets/uploads/2025/07/27/id5893055-GettyImages-2226854091-LSedit-300x180.jpg","video":null,"publish_date":"2025-07-27 23:34:32","author":"Epoch Times Staff","authors":["Epoch Times Staff"],"language":"en","category":"politics","source_country":"us","sentiment":-0.056},{"id":345796436,"title":"The money fight that will shape Europe’s future","text":"“Money makes the world go around,” sings the showgirl Sally Bowles in Cabaret, the iconic musical set against the backdrop of the Weimar Republic’s decadence. Money will certainly shape Europe’s future, as political leaders across the continent are forced to make painful decisions about how to allocate public funds in an increasingly unstable world.\nThree urgent priorities are set to strain Europe’s public finances over the next few years. The first – and most obvious – is defense. The push to boost military spending is primarily a response to Russian president Vladimir Putin’s aggression, compounded by US president Donald Trump’s relentless criticism of America’s Nato allies. Together, these pressures have made strengthening Europe’s defense posture a strategic necessity.\nThe second, and arguably more urgent, priority is to support Ukraine in its fight against Russia. If Ukraine’s defenses were to collapse, a revanchist Russia would likely go on a rampage. Ensuring that Ukraine can continue to defend itself will require European governments to go beyond their existing defense-spending commitments.\nAnd lastly, there is the lengthy process of producing the European Union’s next multiyear budget, which will cover the period from 2028 to 2034. The European Commission has already presented its proposal, but the real challenge lies ahead, as member states and the European Parliament must go through internal negotiations before agreeing on the final numbers.\nThe commission’s proposal includes increased funding for security, global commitments, and competitiveness, as well as additional support for Ukraine. Although these priorities have been widely supported, the reallocation of resources needed to fund them has been the subject of fierce debate. It is safe to say the commission is headed for a bruising political showdown before a consensus is reached.\nDespite the intensity of these budgetary battles, the commission’s proposed budget amounts to just 1.26% of the combined gross national income (GNI) of the EU’s 27 member states. While that is up from 1.13% today, the net increase is relatively modest once debt-servicing costs from the bloc’s post-Covid-19 borrowing spree are factored in.\nWhen it comes to defense, however, the numbers are far more significant. Across Europe, defense budgets have grown by roughly one-third in recent years, with most of Nato’s European members spending around 2% of their gross domestic product (GDP) or nearing that benchmark.\nBut even that is no longer enough. At the June Nato summit in The Hague, members pledged to spend 3.5% of GDP on defense by 2035, with an additional 1.5% earmarked for loosely defined defense- and security-related investments.\nThe extra 1.5% seems to have been designed to appease Trump, who has repeatedly called for European allies to boost military spending to 5% of GDP. Much of this additional spending is expected to rely on creative accounting rather than actual new funding.\nSupporting Ukraine through the war and the country’s eventual reconstruction will also require a substantial financial commitment. While estimates vary, US$100 billion per year, for example, would amount to just over 0.4% of the combined GDP of the EU and the UK – significant but far from unmanageable.\nAt some point within the 2028-35 budget window, the cost of rebuilding Ukraine will need to be addressed. Some studies have estimated the cost of reconstruction at around US$500 billion, though this figure includes areas that may remain under Russian control for the foreseeable future. Much will also depend on whether security guarantees and the prospect of Ukraine’s EU accession can foster an environment conducive to large-scale private investment.\nOf course, new demands may emerge, placing additional strain on Europe’s finances. Several European governments, for example, have already slashed development aid or diverted part of it to support Ukraine. While this may have been a necessary short-term response to Russia’s invasion, its long-term consequences remain unclear.\nCurrently, only Norway, Sweden, and Denmark meet the United Nations target of allocating 0.7% of GNI to development assistance. Following the Trump administration’s dramatic foreign-aid cuts and the shutdown of the US Agency for International Development (USAID), there is a strong case for Europe to fill the void. A more desperate world will be more volatile and less secure, making development a strategic imperative as well as a moral one.\nMeeting all of these commitments will not be easy, especially for governments already grappling with high deficits and rising public debt. My guess is that Northern European countries will reach Nato’s 3.5% of GDP defense spending target well before 2035, while Southern European countries – with the exception of Greece – will likely fail to meet it.\nWith France, Italy, and Spain all heading for elections by 2027, the political appetite for the spending cuts needed to increase defense budgets will likely remain limited.\nThis trend is already evident in the distribution of aid to Ukraine. In the first four months of 2025, the Nordic countries contributed US$6.8 billion, the UK provided US$5.3 billion, and Germany put up US$760 million, while Spain and Italy gave only a fraction of those amounts.\nThe irony is that the EU member states often labelled as “frugal” are the ones actually willing to provide funding to advance the bloc’s agreed-upon priorities. Meanwhile, the less frugal countries prefer to call for more borrowing, even though they have limited room to do so themselves.\nThese tensions are now driving the intensifying battle over Europe’s finances. There is a stark contrast between Nato’s swift approval of large spending pledges and the EU’s wrangling over far smaller amounts.\nWhatever the outcome, the coming fiscal fight will test how able and willing Europe’s leaders are to confront the serious security challenges ahead.\n\nCarl Bildt is a former prime minister and foreign minister of Sweden.\nThe views expressed are those of the writer and do not necessarily reflect those of FMT.","summary":"Military spending, the war in Ukraine, and EU's multiyear budget are set to strain Europe’s public finances over the next few years.","url":"https://www.freemalaysiatoday.com/category/opinion/2025/07/28/the-money-fight-that-will-shape-europes-future","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/6aa473af-european-parliament-epa-images-pic-25725.webp","video":null,"publish_date":"2025-07-27 23:30:39","author":"Carl Bildt","authors":["Carl Bildt"],"language":"en","category":"politics","source_country":"my","sentiment":-0.028},{"id":345796444,"title":"AS gesa gencatan senjata ketika wakil Thai-Kemboja ke Malaysia hadiri rundingan damai","text":"Jurucakap Jabatan Negara AS berkata Washington sedia memudah cara perbincangan pada masa depan bagi menjamin keamanan dan kestabilan antara Thailand dan Kemboja. (Gambar EPA Images)\nKUALA LUMPUR: Setiausaha Negara Amerika Syarikat (AS), Marco Rubio menggesa Kemboja dan Thailand meredakan ketegangan serta bersetuju melaksanakan gencatan senjata susulan pertikaian sempadan berterusan.\nJurucakap Jabatan Negara AS, Tammy Bruce, berkata Rubio sudah menghubungi Timbalan Perdana Menteri merangkap Menteri Luar Kemboja, Prak Sokhonn bagi menekankan kepentingan gencatan senjata serta-merta.\n\"Setiausaha Rubio mengulangi hasrat Presiden (Donald) Trump melihat keamanan tercapai serta kepentingan gencatan senjata segera.\n\"AS bersedia memudah cara perbincangan pada masa depan bagi menjamin keamanan dan kestabilan antara Thailand dan Kemboja,\" kata Bruce dalam kenyataan di laman rasmi jabatan itu.\nBruce berkata, Rubio turut menyampaikan mesej sama kepada Menteri Luar Thailand, Maris Sangiampongsa, sambil menegaskan kesediaan Washington membantu memudahkan dialog dan usaha damai antara kedua-dua negara.\nDalam perkembangan terbaharu, Bernama melaporkan Kerajaan Thailand mengesahkan akan menghadiri rundingan damai serantau di Malaysia hari ii bagi membincangkan konflik sempadan semakin meruncing dengan Kemboja.\nJurucakap Kerajaan Thailand, Jirayu Huangsap, berkata Perdana Menteri Malaysia, Anwar Ibrahim, selaku pengerusi Asean ketika ini mempelawa kepimpinan Thailand bagi membincangkan konflik Thailand-Kemboja.\nDelegasi Thailand dijadualkan berlepas dari Pangkalan Tentera Udara Diraja Thailand kira-kira 10.30 pagi, manakala mesyuarat dijadualkan berlangsung pada 3 petang (waktu Malaysia).\nPertikaian sempadan antara kedua-dua negara memuncak 25 Julai lalu, mencetuskan pertempuran bersenjata di kawasan sempadan utara Kemboja.\nPertempuran terbaharu itu dilaporkan mengorbankan lebih 20 nyawa di pihak Thailand.\nPada masa sama, pihak berkuasa Kemboja memaklumkan lima anggota tentera dan lapan orang awam terbunuh, manakala ribuan penduduk dipindahkan di kedua-dua belah sempadan.\nKetegangan antara Thailand dan Kemboja meningkat sejak 28 Mei lepas susulan insiden konfrontasi antara anggota tentera dekat kawasan sempadan Preah Vihear dipertikaikan, mengakibatkan kematian seorang tentera Kemboja.\nKedua-dua negara jiran Asia Tenggara itu telah lama tidak bersependapat mengenai jajaran sepanjang 817km sempadan belum dimuktamadkan, yang terus menjadi punca ketegangan dan tekanan diplomatik.","summary":"Jurucakap Jabatan Negara AS berkata Marco Rubio sudah menghubungi timbalan perdana menteri Kemboja bagi menekankan kepentingan gencatan senjata serta-merta.","url":"https://www.freemalaysiatoday.com/category/bahasa/tempatan/2025/07/28/as-gesa-gencatan-senjata-ketika-wakil-thai-kemboja-ke-malaysia-hadiri-rundingan-damai","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/432dc62d-thailand-cambodia-disputes-epa-images-pic-280725-1.webp","video":null,"publish_date":"2025-07-27 23:30:28","author":"Bernama","authors":["Bernama"],"language":"en","source_country":"my","sentiment":0.576},{"id":345796458,"title":"Israel announces daily pauses in Gaza fighting as aid airdrops begin","text":"A military transport aircraft airdrops humanitarian aid over Gaza City, with parachutes deploying midair to deliver urgently needed supplies. (AP pic)\nGAZA: Israel on Sunday announced a halt in military operations for 10 hours a day in parts of Gaza and new aid corridors as Jordan and the UAE airdropped supplies into the enclave, where images of starving Palestinians have alarmed the world.\nIsrael has been facing growing international criticism, which the government rejects, over the humanitarian crisis in Gaza, and indirect ceasefire talks in Doha between Israel and the Palestinian militant group Hamas have broken off with no deal in sight.\nUS President Donald Trump, on a visit to Scotland, said Israel would have to make a decision on its next steps in Gaza, and said he did not know what would happen after the collapse of ceasefire and hostage-release negotiations with Hamas.\nMilitary activity will stop daily from 10am to 8pm (0700-1700 GMT) until further notice in Al-Mawasi, a designated humanitarian area along the coast, in central Deir al-Balah and in Gaza City, to the north.\nThe military said designated secure routes for convoys delivering food and medicine will also be in place between 6am and 11pm starting from Sunday.\nThe United Nations food aid agency needs quick approvals by Israel for its trucks to move into Gaza if it is to take advantage of Israel's planned humanitarian pauses in fighting, a senior World Food Programme official said on Sunday.\nUnited Nations aid chief Tom Fletcher said on Sunday that some movement restrictions appeared to have been eased by Israel in Gaza on Sunday after Israel decided to “support a one-week scale-up of aid.”\nInitial reports indicate that more than 100 truckloads of aid were collected from crossings to be transported into Gaza, Fletcher said in a statement.\n“This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis,” he said.\nIn their first airdrop in months, Jordan and the UAE parachuted 25 tonnes of aid into Gaza on Sunday, a Jordanian official said, but added that it was not a substitute for delivery by land.\nPalestinian health officials in Gaza City said at least 10 people were injured by falling aid boxes.\nWork on a UAE project to run a new pipeline that will supply water from a desalination facility in neighbouring Egypt to around 600,000 Gazans along the coast would also begin in a few days, the Israeli military said.\nDozens of Gazans have died of malnutrition in recent weeks, according to the Gaza Health Ministry in the Hamas-run enclave.\nThe ministry reported six new deaths over the past 24 hours due to malnutrition, bringing the total deaths from malnutrition and hunger since the war began in 2023 to 133, including 87 children.\nOn Saturday, a 5-month-old baby, Zainab Abu Haleeb, died of malnutrition at Nasser Hospital, health workers said.\n\"Three months inside the hospital and this is what I get in return, that she is dead,\" said her mother, Israa Abu Haleeb, as the baby's father held their daughter's body wrapped in a white shroud.\nThe Egyptian Red Crescent said it was sending more than 100 trucks carrying over 1,200 metric tonnes of food to southern Gaza on Sunday. Some had been looted in the area of Khan Younis after entering Gaza, residents said.\nAid groups said last week there was mass hunger among Gaza's 2.2 million people, and international alarm over the humanitarian situation has increased.\nA group of 25 states including Britain, France and Canada last week said Israel's denial of aid was unacceptable.\nThe military's spokesperson said Israel was committed to international law and monitors the humanitarian situation daily. Brigadier General Effie Defrin said there was no starvation in Gaza, but appeared to acknowledge conditions were critical.\n\"When we start approaching a problematic line (threshold) then the IDF works to let in humanitarian aid,\" he said. \"That's what happened over the weekend.\"\nIsrael cut off aid to Gaza from the start of March to pressure Hamas into giving up dozens of hostages it still holds, and reopened aid with new restrictions in May.\nIsrael says it has been allowing in aid but must prevent it from being diverted by militants and blames Hamas for the suffering of Gaza's people.\nHope, uncertainty\nMany Gazans expressed some relief at Sunday's announcement, but said fighting must end.\n\"People are happy that large amounts of food aid will come into Gaza,\" said Tamer Al-Burai, a business owner. \"We hope today marks a first step in ending this war that burned everything up.\"\nHealth officials at Al-Awda and Al-Aqsa Hospitals in central Gaza said Israeli firing killed at least 17 people waiting for aid trucks. Israel's military said it fired warning shots at suspects endangering troops and was unaware of any casualties.\nPrime Minister Benjamin Netanyahu said Israel would continue to allow the entry of humanitarian supplies whether it is fighting or negotiating a ceasefire and vowed to press on with the campaign until \"complete victory\".\nHamas said Israel was continuing its military offensive.\n\"What is happening isn't a humanitarian truce,\" said Hamas official Ali Baraka.\nThe war began on Oct 7, 2023, when Hamas-led fighters stormed southern Israel, killing 1,200 people, mostly civilians, and taking 251 hostages back to Gaza, according to Israeli tallies.\nSince then, Israel's offensive has killed nearly 60,000 people in Gaza, mostly civilians, according to Gaza health officials, reduced much of the enclave to ruins and displaced nearly the entire population.","summary":"Military operations will halt from 10am to 8pm, and aid routes reopen as images of starving Palestinians fuel global outrage.","url":"https://www.freemalaysiatoday.com/category/world/2025/07/28/israel-announces-daily-pauses-in-gaza-fighting-as-aid-airdrops-begin","image":"https://media.freemalaysiatoday.com/wp-content/uploads/2025/07/cbdcbf06-gaza-air-drop.jpg","video":null,"publish_date":"2025-07-27 23:29:12","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"my","sentiment":-0.127},{"id":345788604,"title":"Houthis to attack all ships that work with Israeli ports","text":"Saree added that this “escalation,” which is part of the Houthis’ fourth phase of its naval blockade against Israel, is designed to pressure Israel to “halt its aggression and lift the blockade on the Gaza Strip.”\n\n“The actions of the Yemeni Armed Forces express our moral and humanitarian commitment to the injustice against the brotherly Palestinian people, and all our military operations will cease immediately upon the cessation of aggression against Gaza and the lifting of the blockade,” Saree’s statement said.\n\nThe Houthis’ new phase marks a renewal of their attacks on shipping in the Red Sea following the start of the war in Gaza between Israel and Hamas in 2023.\n\nThose attacks largely stopped following a U.S. bombing campaign against the rebel group in March of this year, after which a ceasefire was announced by President Donald Trump in mid-May.\n\nBut that ceasefire was seemingly violated in early July, when the rebel group attacked two ships, one of which resulted in the deaths of three crew members and the kidnapping of others.\n\nThe United States’s response to that violation was muted. The State Department condemned the attacks, but no military response was launched.\n\nGRAHAM SUGGESTS ISRAEL TAKE GAZA BY FORCE AND ‘START OVER’ LIKE US DID IN TOKYO AND BERLIN\n\nPressure is only increasing in the region, however, as Israel now faces accusations of starving the civilian population in Gaza amid its military campaign to eliminate Hamas.\n\nThe international pressure on Israel has led to it establishing a “humanitarian pause” in its fighting to allow aid to surge into Gaza, as well as the resumption of airdrops of food.","summary":"The Yemeni Houthis have announced they will attack all ships that works with Israeli ports, regardless of their nationality or destination. In a statement on Sunday, Houthi spokesman Yahya Saree warned that if companies continue to work with Israeli ports, their ships would be targeted &#8220;anywhere that can be reached or within the reach of [&#8230;]","url":"https://www.washingtonexaminer.com/news/world/3483538/houthis-to-attack-ships-that-work-with-israeli-ports/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2025/07/houthis-renew-attacks-red-sea-shipping.webp","video":null,"publish_date":"2025-07-27 23:20:57","author":"Zach LaChance","authors":["Zach LaChance"],"language":"en","category":"politics","source_country":"US","sentiment":-0.182},{"id":345790118,"title":"Wilders to Macron: Create New Palestinian State in Southern France -- 'Happy Suicide!’","text":"Dutch right-wing leader Geert Wilders delivered a fierce rebuke to French President Emmanuel Macron’s decision to recognize a Palestinian state, sarcastically suggesting that southern France could become the new Palestinian state while declaring “Good luck Emmanuel Macron and France! Happy suicide!” in a provocative social media post that gained massive international attention.\n\nWilders’ post on X reached over 5 million views by Sunday, featuring a map of southern France alongside his sardonic suggestion that the region could serve as the new Palestinian homeland. “Here will be the new Palestinian State. Big parts of France are already islamic anyway,” the Party for Freedom (PVV) leader wrote. “The Netherlands will close its borders immediately.”\n\nThe Dutch politician’s response came after Macron announced Thursday that France would formally recognize Palestinian statehood at the next United Nations General Assembly meeting in September. Israeli Prime Minister Benjamin Netanyahu had already condemned the French decision as a “surrender to terror,” warning that “a Palestinian state in these conditions would be a launch pad to annihilate Israel — not to live in peace beside it.”\n\nIn a separate post, Wilders accused France of rewarding terrorism, stating: “France rewards the Islamic terrorists of Hamas for their October 7th massacre by recognizing the ‘Palestinian state.’ The Netherlands must NEVER do that. Moreover, there is already a Palestinian state we have recognized, and that is Jordan. Jordan = Palestine!”\n\nThe “Jordan is Palestine” position has been central to Wilders’ approach to Middle East policy since his rise to prominence. Following his landslide electoral victory in 2023 — winning 37 of 150 parliamentary seats in what was described as one of the most significant political upheavals in the Netherlands since World War II — Arab states condemned his proposals to relocate Palestinians to Jordan.\n\nWilders has long maintained that the conflict between Palestinians and Israel could be resolved through recognition of Jordan as a Palestinian state. In 2016, he criticized then-President Barack Obama and Secretary of State John Kerry, demanding they “stop bashing Israel about settlements” while proclaiming that “Judea and Samaria belong to Israel” and “Jordan = Palestine.”\n\nThe argument stems from historical and demographic realities: Jordan was created from 77 percent of the original British Mandate for Palestine, and a majority of its population is ethnically Palestinian. Many fled or were expelled during the 1948 Arab-Israeli War and the 1967 Six-Day War, with Jordan being the only Arab country to fully integrate Palestinian refugees.\n\nKnown for his unwavering support of Israel, Wilders has consistently positioned the Jewish state as the West’s first line of defense against Islamic extremism. During a heated Dutch parliamentary debate earlier this year following the collapse of his coalition government, he warned: “If Jerusalem falls, Athens, Paris, or Amsterdam are next.”\n\n“The fact that our mothers in the West can sleep peacefully is because the mothers of Israeli soldiers lie awake,” Wilders said during that parliamentary session, calling Israel “the only democracy in the Middle East” and stating that the Israel Defense Forces were “fighting our battle” against Iranian proxies Hamas and Hezbollah.\n\nIsraeli leadership has repeatedly praised Wilders’ steadfast support. Netanyahu responded to the Dutch leader’s parliamentary defense of Israel by declaring: “Thank you Geert Wilders! You are a true friend of Israel!” to which Wilders replied: “Proud to be your friend, Israel and @netanyahu!”\n\nPresident Trump offered a more measured but skeptical response to Macron’s announcement. “Look, he’s a different kind of a guy,” Trump said Friday. “He’s okay — he’s a team player pretty much. He’s a good dude, but what he says doesn’t matter. It’s not going to change anything. The statement doesn’t carry any weight.”\n\nSecretary of State Marco Rubio took a stronger stance, saying the United States “strongly rejects” Macron’s plan, calling it a “reckless decision” that serves as a “slap in the face” to victims of the October 7, 2023 Hamas attack on Israeli civilians.\n\nThe diplomatic fallout continued as Israel summoned France’s deputy ambassador for a formal reprimand on Sunday over Macron’s announcement. Foreign Ministry director general Eden Bar-Tal called in Mikaël Griffon at ministry headquarters in Jerusalem to express Israel’s displeasure with the French position.\n\nWilders, who has lived under constant security protection for years due to death threats over his criticism of Islam, built his political career on opposing what he views as European accommodation of Islamic influence. Often compared to President Trump and dubbed “the Dutch Donald Trump” by local press, he has promised to halt asylum seeker influx and proposed a referendum for the Netherlands to leave the European Union.\n\nThe massive engagement with Wilders’ anti-Macron post demonstrates his continued ability to frame debates on immigration, Islam, and Israel in ways that resonate across Europe and beyond, particularly as European nations find themselves increasingly divided over Middle East policy.","summary":"Dutch right-wing leader Geert Wilders delivered a fierce rebuke to French President Emmanuel Macron's decision to recognize a Palestinian state, sarcastically suggesting that southern France could become the new Palestinian state while declaring \"Good luck Emmanuel Macron and France! Happy suicide!\" in a provocative social media post that gained massive international attention.\n\n\nThe post Wilders to Macron: Create New Palestinian State in Southern France &#8212; &#8216;Happy Suicide!’ appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/07/27/wilders-to-macron-create-new-palestinian-state-in-southern-france-happy-suicide/","image":"https://media.breitbart.com/media/2025/07/wilders-macron-640x335.jpg","video":null,"publish_date":"2025-07-27 23:18:04","author":"Joshua Klein","authors":["Joshua Klein"],"language":"en","category":"politics","source_country":"US","sentiment":0.248},{"id":345792426,"title":"Trump says US gave $60 million for food in Gaza - then complains he didn’t get a thank you","text":"US president Donald Trump has complained that nobody has thanked him for sending millions in aid to help people suffering from starvation in Gaza.\n\nSpeaking in Turnberry in Scotland alongside European Commission president Ursula von der Leyen, Mr Trump was asked if Israel should be doing more to get aid into Gaza.\n\nMr Trump claimed that, two weeks ago, the US gave $60 million (£45 million) worth of food to the Palestinians in Gaza, adding that he deserved to be thanked for this.\n\n“You know, we gave $60 million two weeks ago and nobody even acknowledged it, for food,” he said.\n\n“And you really want at least someone to say ‘thank you’. No other country gave anything. It makes you feel a little bad when nobody talks about it.”\n\nHe said that “none of the European countries have given anything”, before adding that “it would be nice to get at least a ‘thank you’.”\n\nMr Trump did not specify where these funds have come from or to whom they have been sent, but last month, The Guardian revealed that the US had authorised a $30m grant to the controversial GHF.\n\nThe Israeli military on Sunday began a limited pause in fighting in three populated areas of Gaza for 10 hours a day, part of measures including airdrops as concerns grow over surging hunger and as Israel faces international criticism over its conduct in the 21-month war.\n\nThe military said the “tactical pause” in Gaza City, Deir al-Balah and Muwasi, three areas with large populations, would increase humanitarian aid entering the territory. The pause runs from 10:00 am to 8:00 pm daily until further notice.\n\nJordan and the United Arab Emirates have already parachuted aid into the Gaza Strip as Israel relents to pressure against the GHF being the sole supplier of food. Other aid organisations have accused the GHF and Israel of weaponising aid.\n\nTrump did not say whether he believed there was no point trying to restart ceasefire talks between Israel and Hamas, which Sir Keir Starmer will press him on during their bilateral meeting on Monday.\n\nIt was put to him that the UK Prime Minister would ask him about negotiations between the two countries. Asked whether he was saying there was no point in trying to restart talks, the US president said: “We’re meeting about a lot of things. We have our trade deal and it’s been a great deal.\n\n“It’s good for us. It’s good for them and good for us. I think the UK is very happy, they’ve been trying for 12 years to get it and they got it, and it’s a great trade deal for both, works out very well.\n\n“We’ll be discussing that. I think we’re going to be discussing a lot about Israel. They’re very much involved in terms of wanting something to happen. He’s doing a very good job, by the way.”\n\nHe added that he was “not in a good mood” as he sat down with Ms von der Leyen at the top of their bilateral meeting in Scotland.\n\nIt was put to him by journalists that he seemed in a good mood as he was questioned about the likelihood of the US and EU striking a trade deal.\n\nHe replied: “I’m actually not in a good mood, but I will tell you I think the chances are, yeah, I think Ursula would say, probably 50-50, of making a deal. I’d like to make a deal, I think it’s good for both, but yeah, I’d say 50-50.”\n\nHe said there were “three or four sticking points that I’d rather not get in(to)” before his talks with the President of the European Commission.\n\nAsked why he was in a bad mood and whether it was related to his day playing golf, Mr Trump said: “No, the golf was beautiful. Golf can never be bad… But no, I think I look forward to this meeting. You know, we’ve had a hard time with trade with Europe, very hard time, and I’d like to see it resolved. But if it isn’t we’ll, you know, have tariffs.”\n\nHe said “we’ll probably know in about an hour” whether a deal can be struck.","url":"https://uk.news.yahoo.com/trump-says-us-gave-60-170624173.html","image":"https://s.yimg.com/ny/api/res/1.2/ElAvIJuqxVYwqQ9AtKoJ.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTI0MDA7aD0xNjAwO2NmPXdlYnA-/https://media.zenfs.com/en/the_independent_577/f154710337d39a5575a6b9e45c056ae7","video":"","publish_date":"2025-07-27 23:13:00","author":"Tom Watling","authors":["Tom Watling"],"language":"en","category":"politics","source_country":"gb","sentiment":0.034},{"id":345793068,"title":"EU and US agree trade deal, with 15% tariffs for European exports to America","text":"The United States and European Union have reached a trade deal framework, ending a months-long standoff between two of the world's biggest economic partners.\n\nAfter make-or-break negotiations between President Donald Trump and European Commission President Ursula Von der Leyen in Scotland, the pair agreed to a US tariff on all EU goods of 15%.\n\nThat is half the 30% import tax rate Trump had threatened to implement starting on Friday. He said the 27-member bloc would open its markets to US exporters with zero per cent tariffs on certain products.\n\nVon der Leyen also hailed the deal, saying it would bring stability for both allies, who together account for almost a third of global trade.\n\nTrump has wielded tariffs against major US trade partners in a bid to reorder the global economy and trim the American trade deficit.\n\nAs well as the EU, he has struck tariff agreements with the UK, Japan, Indonesia, the Philippines and Vietnam, although he has not achieved his goal of \"90 deals in 90 days\".\n\nSunday's agreement was announced after private talks between Trump and Von der Leyen at his Turnberry golf course in South Ayrshire.\n\nTrump - who is on a five-day visit to Scotland - said following their brief meeting: \"We have reached a deal. It's a good deal for everybody.\"\n\n\"It's going to bring us closer together,\" he added.\n\nVon der Leyen also hailed it as a \"huge deal\", after \"tough negotiations\".\n\nTrump said the EU would boost its investment in the US by $600bn (£446bn), including American military equipment, and spend $750bn on energy.\n\nThat investment over the next three years in American liquified natural gas, oil and nuclear fuels would, Von der Leyen said, help reduce European reliance on Russian power sources.\n\nSome goods will not attract any tariffs, including aircraft and plane parts, certain chemicals and some agricultural products. A separate deal on semiconductors may be announced soon.\n\nBut a 50% US tariff Trump has implemented on steel and aluminium globally would stay in place, he said.\n\n\"I want to thank President Trump personally for his personal commitment and his leadership to achieve this breakthrough,\" Von der Leyen said.\n\n\"He is a tough negotiator, but he is also a dealmaker.\"\n\nBoth sides can paint this agreement as something of a victory.\n\nFor the EU, the tariffs could have been worse: it is not as good as the UK's 10% tariff rate, but is the same as the 15% rate that Japan negotiated last week.\n\nFor the US it equates to the expectation of roughly $90bn of tariff revenue into government coffers – based on last year's trade figures, plus there's hundreds of billions of dollars of investment now due to come into the US.\n\nOne thing is clear: Trump is celebrating after striking the largest trade deal in history.\n\nWhile there is a lot of upside for the US in this deal, it is less clear what the EU gains.\n\nIt was notable that Von der Leyen spoke about \"rebalancing\" the trading relationship.\n\nPreviously the EU has argued the relationship is not out of balance as the EU buys far more services from America than it sells to them.\n\nIt sounded as though Von der Leyen was deliberately speaking Trump's language in order to seal the agreement.\n\nIt came after the US president finished 18 holes at the Turnberry resort with guests and family, including his son Eric, amid showery conditions.\n\nTrade in goods between the EU and US totalled about $976bn last year. The US imported about $606bn in goods from the EU and exported around $370bn in 2024.\n\nThat imbalance, or trade deficit, is a sticking point for Trump. He says trade relationships like this mean the US is \"losing\".\n\nIf he had followed through on tariffs against Europe, import taxes would have been levied on products from Spanish pharmaceuticals to Italian leather, German electronics and French cheese.\n\nThe EU had said it was prepared to retaliate with tariffs on US goods including car parts, Boeing planes and beef.\n\nEuropean leaders cautiously welcomed the deal.\n\nThe Irish Prime Minister, the Taoiseach Micheál Martin, noted the fact that tariffs would still be higher than before, making trade \"more expensive and more challenging\".\n\nAmong EU countries, Ireland is the most reliant on the US as an export market.\n\nGermany's Chancellor Friedrich Merz posted on X that a trade conflict would have hit Germany hard.\n\n\"Stable and predictable trade relations with market access benefit everyone on both sides of the Atlantic, businesses and consumers alike,\" he added.\n\nItalian Prime Minister Giorgia Meloni welcomed the deal, but said she needed to see the details, Italy's Ansa news agency reported.\n\nBritish Prime Minister Keir Starmer plans his own meeting with Trump at Turnberry on Monday.\n\nThe US president will be in Aberdeen on Tuesday, where his family has another golf course and is opening a third next month.\n\nThe president and his sons plan to help cut the ribbon on the new fairway.","summary":"The United States and European Union have reached a trade deal framework, ending a months-long standoff between two of the world's biggest economic partners.","url":"https://www.myjoyonline.com/eu-and-us-agree-trade-deal-with-15-tariffs-for-european-exports-to-america/","image":"https://www.myjoyonline.com/wp-content/uploads/2025/07/image-1898.png","video":null,"publish_date":"2025-07-27 23:06:00","author":"Abubakar Ibrahim,Bbc 06pm","authors":["Abubakar Ibrahim","Bbc 06pm"],"language":"en","source_country":"gh","sentiment":-0.019},{"id":345792428,"title":"Starmer to raise Gaza ceasefire and UK steel tariffs in Trump meeting","text":"Sir Keir Starmer is expected to raise the prospect of reviving ceasefire talks between Israel and Hamas and the future of tariffs on British steel as he meets Donald Trump in Scotland.\n\nThe Prime Minister will travel to Ayrshire, where the US president is staying at his Turnberry golf resort, for wide-ranging discussions on trade and the Middle East as international alarm grows over starvation in Gaza.\n\nThe two leaders have built a rapport on the world stage despite their differing political backgrounds, with Mr Trump praising Sir Keir for doing a “very good job” in office ahead of their talks on Monday.\n\nBut humanitarian conditions in Gaza and uncertainty over US import taxes on key British goods in America threaten to complicate their bilateral meeting.\n\nPeace talks in the Middle East came to a standstill last week after Washington and Israel recalled negotiating teams from Qatar, with White House special envoy Steve Witkoff blaming Hamas for a “lack of desire” to reach an agreement.\n\nSince then, Israel has promised military pauses in three populated areas of Gaza to allow designated UN convoys of aid to reach desperate Palestinians.\n\nBut the UK, which is joining efforts to airdrop aid into the enclave and evacuate children in need of medical assistance, has said that access to supplies must be “urgently” widened.\n\nIn his talks with Mr Trump, Sir Keir will “welcome the President’s administration working with partners in Qatar and Egypt to bring about a ceasefire in Gaza”, Number 10 said.\n\n“He will discuss further with him what more can be done to secure the ceasefire urgently, bring an end to the unspeakable suffering and starvation in Gaza and free the hostages who have been held so cruelly for so long.”\n\nThe leaders will also talk “one-on-one about advancing implementation of the landmark Economic Prosperity Deal so that Brits and Americans can benefit from boosted trade links between their two countries”, it said.\n\nThe agreement signed at the G7 summit last month slashed trade barriers on goods from both countries.\n\nBut tariffs for the steel industry, which is of key economic importance to the UK, were left to stand at 25% rather than falling to zero as originally agreed.\n\nConcerns had previously been raised that the sector could face a levy of up to 50% – the US’s global rate – unless a further agreement was made by July 9, when Mr Trump said he would start implementing import taxes on America’s trading partners.\n\nBut that deadline has been and gone without any concrete update on the status of UK steel.\n\nDowning Street said that both sides are working “at pace” to “go further to deliver benefits to working people on both sides of the Atlantic” and to give UK industry “the security it needs”.\n\nThe two leaders are also expected to discuss the war in Ukraine, which Number 10 said would include “applying pressure” on Vladimir Putin to end the invasion, before travelling on together for a private engagement in Aberdeen.\n\nIt comes after Mr Trump announced he had agreed “the biggest deal ever made” between the US and the European Union after meeting Ursula von der Leyen for high-stakes talks at Turnberry on Sunday.\n\nAfter a day playing golf, the US leader met the President of the EU Commission to hammer out the broad terms of an agreement that will subject the bloc to 15% tariffs on most of its goods entering America.\n\nThis is lower than a 30% levy previously threatened by the US president.\n\nThe agreement will include “zero for zero” tariffs on a number of products including aircraft, some agricultural goods and certain chemicals, as well as EU purchases of US energy worth 750 billion dollars (£558 billion) over three years.\n\nSpeaking to journalists on Sunday about his meeting with Sir Keir, Mr Trump said: “We’re meeting about a lot of things. We have our trade deal and it’s been a great deal.\n\n“It’s good for us. It’s good for them and good for us. I think the UK is very happy, they’ve been trying for 12 years to get it and they got it, and it’s a great trade deal for both, works out very well.\n\n“We’ll be discussing that. I think we’re going to be discussing a lot about Israel.\n\n“They’re very much involved in terms of wanting something to happen.\n\n“He’s doing a very good job, by the way.”\n\nMr Trump’s private trip to the UK comes ahead of a planned state visit in September.","url":"https://uk.news.yahoo.com/starmer-raise-gaza-ceasefire-uk-230150431.html","image":"https://s.yimg.com/ny/api/res/1.2/G75Rl9suzlTy2V4_Q2RevA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQ7Y2Y9d2VicA--/https://media.zenfs.com/en/pa_viral_news_uk_120/89ce8171fca0bc40c37c36b5afe293cb","video":"","publish_date":"2025-07-27 23:01:50","author":"Nina Lloyd, Pa Political Correspondent","authors":["Nina Lloyd, Pa Political Correspondent"],"language":"en","category":"politics","source_country":"gb","sentiment":0.174},{"id":345792130,"title":"Starmer to raise Gaza ceasefire and UK steel tariffs in Trump meeting","text":"Sir Keir Starmer is expected to raise the prospect of reviving ceasefire talks between Israel and Hamas and the future of tariffs on British steel as he meets Donald Trump in Scotland.\n\nThe Prime Minister will travel to Ayrshire, where the US president is staying at his Turnberry golf resort, for wide-ranging discussions on trade and the Middle East as international alarm grows over starvation in Gaza.\n\nThe two leaders have built a rapport on the world stage despite their differing political backgrounds, with Mr Trump praising Sir Keir for doing a “very good job” in office ahead of their talks on Monday.\n\nBut humanitarian conditions in Gaza and uncertainty over US import taxes on key British goods in America threaten to complicate their bilateral meeting.\n\nPeace talks in the Middle East came to a standstill last week after Washington and Israel recalled negotiating teams from Qatar, with White House special envoy Steve Witkoff blaming Hamas for a “lack of desire” to reach an agreement.\n\nSince then, Israel has promised military pauses in three populated areas of Gaza to allow designated UN convoys of aid to reach desperate Palestinians.\n\nBut the UK, which is joining efforts to airdrop aid into the enclave and evacuate children in need of medical assistance, has said that access to supplies must be “urgently” widened.\n\nIn his talks with Mr Trump, Sir Keir will “welcome the President’s administration working with partners in Qatar and Egypt to bring about a ceasefire in Gaza”, Number 10 said.\n\n“He will discuss further with him what more can be done to secure the ceasefire urgently, bring an end to the unspeakable suffering and starvation in Gaza and free the hostages who have been held so cruelly for so long.”\n\nThe leaders will also talk “one-on-one about advancing implementation of the landmark Economic Prosperity Deal so that Brits and Americans can benefit from boosted trade links between their two countries”, it said.\n\nThe agreement signed at the G7 summit last month slashed trade barriers on goods from both countries.\n\nBut tariffs for the steel industry, which is of key economic importance to the UK, were left to stand at 25% rather than falling to zero as originally agreed.\n\nConcerns had previously been raised that the sector could face a levy of up to 50% – the US’s global rate – unless a further agreement was made by July 9, when Mr Trump said he would start implementing import taxes on America’s trading partners.\n\nBut that deadline has been and gone without any concrete update on the status of UK steel.\n\nDowning Street said that both sides are working “at pace” to “go further to deliver benefits to working people on both sides of the Atlantic” and to give UK industry “the security it needs”.\n\nThe two leaders are also expected to discuss the war in Ukraine, which Number 10 said would include “applying pressure” on Vladimir Putin to end the invasion, before travelling on together for a private engagement in Aberdeen.\n\nIt comes after Mr Trump announced he had agreed “the biggest deal ever made” between the US and the European Union after meeting Ursula von der Leyen for high-stakes talks at Turnberry on Sunday.\n\nAfter a day playing golf, the US leader met the President of the EU Commission to hammer out the broad terms of an agreement that will subject the bloc to 15% tariffs on most of its goods entering America.\n\nThis is lower than a 30% levy previously threatened by the US president.\n\nThe agreement will include “zero for zero” tariffs on a number of products including aircraft, some agricultural goods and certain chemicals, as well as EU purchases of US energy worth 750 billion dollars (£558 billion) over three years.\n\nSpeaking to journalists on Sunday about his meeting with Sir Keir, Mr Trump said: “We’re meeting about a lot of things. We have our trade deal and it’s been a great deal.\n\n“It’s good for us. It’s good for them and good for us. I think the UK is very happy, they’ve been trying for 12 years to get it and they got it, and it’s a great trade deal for both, works out very well.\n\n“We’ll be discussing that. I think we’re going to be discussing a lot about Israel.\n\n“They’re very much involved in terms of wanting something to happen.\n\n“He’s doing a very good job, by the way.”\n\nMr Trump’s private trip to the UK comes ahead of a planned state visit in September.","summary":"Sir Keir Starmer is expected to raise the prospect of reviving ceasefire talks between Israel and Hamas and the future of tariffs on British steel as he meets Donald Trump in Scotland. The Prime Minister will travel to Ayrshire, where the US president is staying at his Turnberry golf resort, for wide-ranging discussions on trade [&#8230;]\n\n\nThe post Starmer to raise Gaza ceasefire and UK steel tariffs in Trump meeting appeared first on Jersey Evening Post.","url":"https://jerseyeveningpost.com/morenews/uknews/2025/07/28/starmer-to-raise-gaza-ceasefire-and-uk-steel-tariffs-in-trump-meeting/","image":"https://i0.wp.com/jerseyeveningpost.com/wp-content/uploads/2025/07/2.80682961-scaled.jpg?fit=2560%2C1440&ssl=1","video":null,"publish_date":"2025-07-27 23:01:50","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.174},{"id":345785786,"title":"Starmer to raise Gaza ceasefire and UK steel tariffs in Trump meeting","text":"Sir Keir Starmer is expected to raise the prospect of reviving ceasefire talks between Israel and Hamas and the future of tariffs on British steel as he meets Donald Trump in Scotland.\n\nThe Prime Minister will travel to Ayrshire, where the US president is staying at his Turnberry golf resort, for wide-ranging discussions on trade and the Middle East as international alarm grows over starvation in Gaza.\n\nThe two leaders have built a rapport on the world stage despite their differing political backgrounds, with Mr Trump praising Sir Keir for doing a “very good job” in office ahead of their talks on Monday.\n\nBut humanitarian conditions in Gaza and uncertainty over US import taxes on key British goods in America threaten to complicate their bilateral meeting.\n\nPeace talks in the Middle East came to a standstill last week after Washington and Israel recalled negotiating teams from Qatar, with White House special envoy Steve Witkoff blaming Hamas for a “lack of desire” to reach an agreement.\n\nSince then, Israel has promised military pauses in three populated areas of Gaza to allow designated UN convoys of aid to reach desperate Palestinians.\n\nBut the UK, which is joining efforts to airdrop aid into the enclave and evacuate children in need of medical assistance, has said that access to supplies must be “urgently” widened.\n\nIn his talks with Mr Trump, Sir Keir will “welcome the President’s administration working with partners in Qatar and Egypt to bring about a ceasefire in Gaza”, Number 10 said.\n\n“He will discuss further with him what more can be done to secure the ceasefire urgently, bring an end to the unspeakable suffering and starvation in Gaza and free the hostages who have been held so cruelly for so long.”\n\nThe leaders will also talk “one-on-one about advancing implementation of the landmark Economic Prosperity Deal so that Brits and Americans can benefit from boosted trade links between their two countries”, it said.\n\nThe agreement signed at the G7 summit last month slashed trade barriers on goods from both countries.\n\nBut tariffs for the steel industry, which is of key economic importance to the UK, were left to stand at 25% rather than falling to zero as originally agreed.\n\nConcerns had previously been raised that the sector could face a levy of up to 50% – the US’s global rate – unless a further agreement was made by July 9, when Mr Trump said he would start implementing import taxes on America’s trading partners.\n\nBut that deadline has been and gone without any concrete update on the status of UK steel.\n\nDowning Street said that both sides are working “at pace” to “go further to deliver benefits to working people on both sides of the Atlantic” and to give UK industry “the security it needs”.\n\nThe two leaders are also expected to discuss the war in Ukraine, which Number 10 said would include “applying pressure” on Vladimir Putin to end the invasion, before travelling on together for a private engagement in Aberdeen.\n\nIt comes after Mr Trump announced he had agreed “the biggest deal ever made” between the US and the European Union after meeting Ursula von der Leyen for high-stakes talks at Turnberry on Sunday.\n\nAfter a day playing golf, the US leader met the President of the EU Commission to hammer out the broad terms of an agreement that will subject the bloc to 15% tariffs on most of its goods entering America.\n\nThis is lower than a 30% levy previously threatened by the US president.\n\nThe agreement will include “zero for zero” tariffs on a number of products including aircraft, some agricultural goods and certain chemicals, as well as EU purchases of US energy worth 750 billion dollars (£558 billion) over three years.\n\nSpeaking to journalists on Sunday about his meeting with Sir Keir, Mr Trump said: “We’re meeting about a lot of things. We have our trade deal and it’s been a great deal.\n\n“It’s good for us. It’s good for them and good for us. I think the UK is very happy, they’ve been trying for 12 years to get it and they got it, and it’s a great trade deal for both, works out very well.\n\n“We’ll be discussing that. I think we’re going to be discussing a lot about Israel.\n\n“They’re very much involved in terms of wanting something to happen.\n\n“He’s doing a very good job, by the way.”\n\nMr Trump’s private trip to the UK comes ahead of a planned state visit in September.","summary":"The leaders will meet for wide-ranging discussions on trade and the Middle East as international alarm grows over conditions in Gaza.","url":"https://www.standard.co.uk/news/politics/keir-starmer-gaza-ayrshire-israel-trump-b1240263.html","image":"https://static.standard.co.uk/2025/07/28/00/11273294835a7fab49d83413ecc38d3dY29udGVudHNlYXJjaGFwaSwxNzUzNzM5MTgy-2.80682961.jpg?width=1200","video":null,"publish_date":"2025-07-27 23:01:50","author":"Nina Lloyd","authors":["Nina Lloyd"],"language":"en","category":"politics","source_country":"GB","sentiment":0.174},{"id":345789966,"title":"Israel announces daily pauses in Gaza fighting as aid airdrops begin","text":"Israel on Sunday announced a halt in military operations for 10 hours a day in parts of Gaza and new aid corridors as Jordan and the United Arab Emirates airdropped supplies into the enclave, where images of starving Palestinians have alarmed the world.\n\nIsrael has been facing growing international criticism, which the government rejects, over the humanitarian crisis in Gaza, and indirect ceasefire talks in Doha between Israel and the Palestinian militant group Hamas have broken off with no deal in sight.\n\nU.S. President Donald Trump, on a visit to Scotland, said Israel would have to make a decision on its next steps in Gaza, and said he did not know what would happen after the collapse of ceasefire and hostage-release negotiations with Hamas.\n\nMilitary activity will stop daily from 10 a.m. to 8 p.m. (0700-1700 GMT) until further notice in Al-Mawasi, a designated humanitarian area along the coast, in central Deir al-Balah and in Gaza City, to the north.\n\nThe military said designated secure routes for convoys delivering food and medicine will also be in place between 6 a.m. and 11 p.m. starting from Sunday.\n\nThe United Nations food aid agency needs quick approvals by Israel for its trucks to move into Gaza if it is to take advantage of Israel's planned humanitarian pauses in fighting, a senior World Food Programme official said on Sunday.\n\nUnited Nations aid chief Tom Fletcher said on Sunday that some movement restrictions appeared to have been eased by Israel in Gaza on Sunday after Israel decided to “support a one-week scale-up of aid.”\n\nInitial reports indicate that more than 100 truckloads of aid were collected from crossings to be transported into Gaza, Fletcher said in a statement.\n\n“This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis,” he said.\n\nIn their first airdrop in months, Jordan and the United Arab Emirates parachuted 25 tons of aid into Gaza on Sunday, a Jordanian official said, but added that it was not a substitute for delivery by land.\n\nPalestinian health officials in Gaza City said at least 10 people were injured by falling aid boxes.\n\nWork on a UAE project to run a new pipeline that will supply water from a desalination facility in neighbouring Egypt to around 600,000 Gazans along the coast would also begin in a few days, the Israeli military said.\n\nDozens of Gazans have died of malnutrition in recent weeks, according to the Gaza Health Ministry in the Hamas-run enclave.\n\nThe ministry reported six new deaths over the past 24 hours due to malnutrition, bringing the total deaths from malnutrition and hunger since the war began in 2023 to 133, including 87 children.\n\nOn Saturday, a 5-month-old baby, Zainab Abu Haleeb, died of malnutrition at Nasser Hospital, health workers said.\n\n\"Three months inside the hospital and this is what I get in return, that she is dead,\" said her mother, Israa Abu Haleeb, as the baby's father held their daughter's body wrapped in a white shroud.\n\nThe Egyptian Red Crescent said it was sending more than 100 trucks carrying over 1,200 metric tons of food to southern Gaza on Sunday. Some had been looted in the area of Khan Younis after entering Gaza, residents said.\n\nAid groups said last week there was mass hunger among Gaza's 2.2 million people, and international alarm over the humanitarian situation has increased.\n\nA group of 25 states including Britain, France and Canada last week said Israel's denial of aid was unacceptable.\n\nThe military's spokesperson said Israel was committed to international law and monitors the humanitarian situation daily. Brigadier General Effie Defrin said there was no starvation in Gaza, but appeared to acknowledge conditions were critical.\n\n\"When we start approaching a problematic line (threshold) then the IDF works to let in humanitarian aid,\" he said. \"That's what happened over the weekend.\"\n\nIsrael cut off aid to Gaza from the start of March to pressure Hamas into giving up dozens of hostages it still holds, and reopened aid with new restrictions in May.\n\nIsrael says it has been allowing in aid but must prevent it from being diverted by militants and blames Hamas for the suffering of Gaza's people.\n\nHOPE, UNCERTAINTY\n\nMany Gazans expressed some relief at Sunday's announcement, but said fighting must end.\n\n\"People are happy that large amounts of food aid will come into Gaza,\" said Tamer Al-Burai, a business owner. \"We hope today marks a first step in ending this war that burned everything up.\"\n\nHealth officials at Al-Awda and Al-Aqsa Hospitals in central Gaza said Israeli firing killed at least 17 people waiting for aid trucks. Israel's military said it fired warning shots at suspects endangering troops and was unaware of any casualties.\n\nPrime Minister Benjamin Netanyahu said Israel would continue to allow the entry of humanitarian supplies whether it is fighting or negotiating a ceasefire and vowed to press on with the campaign until \"complete victory\".\n\nHamas said Israel was continuing its military offensive.\n\n\"What is happening isn't a humanitarian truce,\" said Hamas official Ali Baraka.\n\nThe war began on October 7, 2023, when Hamas-led fighters stormed southern Israel, killing 1,200 people, mostly civilians, and taking 251 hostages back to Gaza, according to Israeli tallies.\n\nSince then, Israel's offensive has killed nearly 60,000 people in Gaza, mostly civilians, according to Gaza health officials, reduced much of the enclave to ruins and displaced nearly the entire population.\n\n© (c) Copyright Thomson Reuters 2025.","summary":"Israel on Sunday announced a halt in military operations for 10 hours a day in parts of Gaza and new aid corridors as Jordan and the United Arab…","url":"https://japantoday.com/category/world/israel-announces-daily-pauses-in-gaza-fighting-as-aid-airdrops-begin3","image":"https://media.japantoday.com/img/store/4a/d7/1e964cfb43a439437f21dece2866015d9c3b/tag-reuters/_w1700.jpeg","video":null,"publish_date":"2025-07-27 23:00:51","author":"Japan Today Editor","authors":["Japan Today Editor"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.128},{"id":345788810,"title":"Room for one more on Mount Rushmore? (Trump wants to know.)","text":"President Donald Trump has made no secret of his fondness for Mount Rushmore and his desire to join its rock-star lineup.\n\nDuring his first term, Trump told Kristi Noem — then a U.S. representative from South Dakota, now the secretary of the Department of Homeland Security — that his “dream” was to be on Mount Rushmore. She later gave Trump a model of Mount Rushmore with his face on it.\n\nThe idea has resurfaced since Trump returned to office. A member of Congress from Florida sponsored a bill in January to “direct the Secretary of the Interior to arrange for the carving of the figure of President Donald J. Trump on Mount Rushmore National Memorial.” It was referred to the House Committee on Natural Resources, which has yet to act on it.\n\nIn March, Interior Secretary Doug Burgum said in an interview with Lara Trump, Donald Trump’s daughter-in-law, that “they definitely have room” for Trump’s face on Mount Rushmore.\n\nWait. Is this possible?\n\nAs with all things Trump, it can be hard to decipher the difference between everyday rhetoric and future action. But those in charge of the memorial are taking such overtures seriously.\n\nThe National Park Service, which oversees Mount Rushmore National Memorial, and which is led by Burgum, has cited two reasons that more faces cannot be added. First, it considers Mount Rushmore to be a completed work of art. Second, there is no room. “The carved portion of Mount Rushmore has been thoroughly evaluated, and there are no viable locations left for additional carvings,” the park service said in a statement.\n\nThose are the frames for the debate, now and in the future. One is philosophical. The other is geological. One is a question of should; the other is a question of could.\n\nMount Rushmore is a cultural touchstone, American shorthand for the best of the best. “Who belongs on your Mount Rushmore?” is the opening to a debate on any niche subject, as if we might carve such a monument to athletes, musicians or writers.\n\nBut the real thing is about presidents. Gutzon Borglum, the sculptor who designed the carvings and oversaw their construction for 14 years, starting in 1927, chose the four presidents and their precise locations.\n\nWhat would he make of Trump? And where would he put him?\n\nBorglum had quite an imagination. Historical photos show that Mount Rushmore, more bluff than peak, was a jumble of weathered rock formations that stood out among South Dakota’s Black Hills. The southeast face had promise and great light.\n\nBorglum and his crew dynamited the old, eroded rock to uncover more solid surfaces beneath. Nearly half a million tons were removed from the mountain. Most of it still lies at the base.\n\nWhat had been a shallow and pocked tableau was rendered even thinner — something best seen from above or behind. A narrow, natural canyon behind the faces provided access for Borglum’s crews and equipment.\n\nThe faces we see today are deep into the rock that Borglum first encountered. George Washington, carved first, is about 20 feet behind the original surface. Theodore Roosevelt is 75 feet back.\n\nInconsistency in the rock forced Borglum to change his design nine times during construction. One of his initial plans was for three faces: Thomas Jefferson, Abraham Lincoln and, in the middle, Washington.\n\nWorkers spent 18 months on Jefferson’s face to Washington’s right, but Borglum decided that the rock was not good enough. Among the problems: a web of fractures, rendering the area too fragile.\n\nCrews removed Jefferson’s face, smoothed the rock to make it blend and started working on a new Jefferson, over Washington’s other shoulder. Lincoln moved, too, and Roosevelt was squeezed in between, the left eye against a major crack.\n\nClose-ups reveal many of the frailties that Borglum had to overcome — frailties that might derail anyone’s ambitions for carving more faces.\n\nIn the end, Borglum concluded that for a grand sculpture, there was enough workable landscape for only four 60-foot-tall sculptures, which were neatly framed by imperfect rock.\n\nNow, the subject of what’s really possible is being raised again.\n\nIt was a historian named Doane Robinson who dreamed of carved faces in the Black Hills as a way to draw tourists. He envisioned Western heroes, like Wild Bill Hickok and Sacagawea, on spires along a winding road in an area called the Needles. They probably would have looked like giant Pez dispensers.\n\nBorglum was recruited. Already an accomplished sculptor, he became enamored of the broader canvas of Mount Rushmore, named for a New York lawyer who was scouting tin mines in 1885. “A mountain of granite rock that rose above the neighboring peaks,” Charles Rushmore described it then.\n\nBorglum soon homed in on memorializing former presidents to represent the nation’s first 150 years.\n\nNow the United States is a year from turning 250, and those who wish to preserve the memorial are nervous about the motivations of those who might change it.\n\n“You wouldn’t add another face to Borglum’s Mount Rushmore just like you wouldn’t add one to da Vinci’s ‘Last Supper,’” said Dan Wenk, who was the superintendent of Mount Rushmore National Memorial from 1985 to 2001. “But I recognize that these types of ideas are no longer off the table.”\n\nIn the past, some have pushed for Franklin D. Roosevelt, others for John F. Kennedy. The strongest push, before now, was in the 1990s for Ronald Reagan.\n\nThe thought of amending Mount Rushmore faded until Trump suggested himself. It’s a provocative idea. Historians recently ranked him as one of the worst presidents in American history, while the four on Mount Rushmore are all in the top five.\n\nBut plenty are taking Trump’s Mount Rushmore ambitions at 60-foot-face value. Theoretically, the president could direct his administration to carve his face there. Given his penchant for chipping away at norms, who’s to say that Trump wouldn’t figure out a way to chip away at Mount Rushmore?\n\n“Fortunately, from my view, and not just for Trump but anybody else,” Wenk said, “they’re fighting against the reality of the rock.”\n\nStanding in front of Mount Rushmore, as about 2.5 million visitors do every year, it’s easy to imagine where additional faces might be carved.\n\nCould another face go there? Or there? Or even over there?\n\nThe answer, again and again, is no, according to geologists and those who have studied Mount Rushmore closely. Or, at least, probably not. Barring some inventive approach — holograms, anyone? — a new face is unlikely.\n\nBorglum’s visions for Mount Rushmore were denied by the secrets inside the rock. Most of Mount Rushmore is granite — Harney Peak Granite, named for the tallest mountain in the Black Hills — but it has veins of other types of less-carvable rock.\n\nFor example, Borglum’s early plans called for torsos, not just faces, of the presidents. But those were scrubbed when he discovered the dark, flaky, layered schist below the lighter-colored granite, unsuitable for carving.\n\nHarder to see throughout the sculpture are veins of large crystals, called pegmatite, too large and weak to be carved as finely as Borglum had hoped.\n\nHe worked around veins of rose quartz, including one that forced Borglum to move Roosevelt tight against Jefferson and narrow his face. Those weaker crystals are why Lincoln’s hair was left unruly, one of many places where the rock was not suited for delicate sculpting.\n\nThe trickiest thing about carving on Mount Rushmore, though, might be the tangled web of fissures, cracks and flakes of various sizes and depths. Many are visible. Look closely at the faces. Some presidents look like scarred victims of a knife fight.\n\nPark rangers note that the reason Jefferson appears to be peering into the distance, beyond the horizon, is not because he represented expansion of a young nation. Rather, flaws in the rock in Jefferson’s right cheek forced Borglum to tilt Jefferson’s head back and to the left, so that fractures would cut under his nose, not across it.\n\nThose cracks also left a hole in Jefferson’s lip, the one place on the mountain where a piece of granite was added to fill a gap.\n\nBeginning in 1989, scientists assessed the stability of the rock and mapped 144 fractures and other discontinuities on and around the four faces. The intersection of fractures creates blocks, or large chunks, not unlike the pieces of glass in a shattered windshield.\n\nIn 1998, a network of gauges was strung across Mount Rushmore to monitor the cracks and blocks. The worry is less about seismic activity (unusual in the area) and more about rock movement during freeze-thaw cycles, both seasonally and from night to day. Horizontal cracks are mostly sealed to keep water out, while vertical cracks are left open to let water drain.\n\n“One of the concerns about an additional face is that you could activate these fractures,” said Paul Nelson, a geomechanical engineer who spent years overseeing the Rock Block Monitoring System at Mount Rushmore. “If you remove material, you could be removing support.”\n\nIn other words, he pointed out, a new face next to Lincoln might cost Abe his nose. Nelson concluded that it would be “extremely difficult, if not impossible, to carve an additional face on Mount Rushmore.”\n\nSome of those limitations can be seen from where most visitors notice a polished sculpture.\n\nIn this era, imaginations are being stretched and no idea can be dismissed, including at Mount Rushmore. Could smaller versions of presidential heads be carved around the current ones? Maybe, though no one is proposing a 10-foot Trump head sitting on Washington’s lapel or anywhere else.\n\nCould a premade carving be attached to Mount Rushmore? If portions of the rock are not strong enough to be carved, they are likely not strong enough to hold something. A cubic foot of granite weighs about 170 pounds. Another material, if it could be adhered, would age differently, beyond other issues.\n\nWhat about changing one of the current faces into someone new? Not impossible, but those who want to see Mount Rushmore protected take solace in knowing that all four presidents on it remain popular and in good standing.\n\nPerhaps more likely than a fifth president on Mount Rushmore are other ideas already in motion. Trump has proposed a National Garden of American Heroes, a sculpture garden to honor 250 Americans. His administration already has a list of potential honorees, but not a place for them. South Dakota officials are pitching the Black Hills as a home, within view of Mount Rushmore.\n\nAnother group is proposing a sculpture garden and learning center in the Black Hills, aimed at “preserving all chapters of the American story” that might align with the president’s vision.\n\nMaybe a monument to Trump will be a showpiece of one of those nearby projects, rather than on Mount Rushmore itself.\n\nRobin Borglum Kennedy hopes so. She is the granddaughter of Gutzon Borglum and the daughter of Lincoln Borglum, who helped his father carve Mount Rushmore and served as the memorial’s first superintendent. She was born in 1941, the year the sculpture was considered complete.\n\nBorglum Kennedy (no, no relation) is vehemently against any changes to the mountain, now or deep into the future. She sees Mount Rushmore as a historical memorial more than a political one. Her grandfather, after all, chose four men who were already dead.\n\n“It was conceived as a tribute to the ideals of America,” she said, “not to any one man.”\n\nBut that’s a matter of philosophy, not science.\n\nThis article originally appeared in The New York Times.\n\n© 2025 The New York Times Company","summary":"President Donald Trump has made no secret of his fondness for Mount Rushmore and his desire to join its rock-star lineup.","url":"https://www.staradvertiser.com/2025/07/27/breaking-news/room-for-one-more-on-mount-rushmore-trump-wants-to-know/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_MOUNT-RUSHMORE-1.jpg","video":null,"publish_date":"2025-07-27 23:00:00","author":"New York Times","authors":["New York Times"],"language":"en","source_country":"US","sentiment":0.362},{"id":345789322,"title":"Johnson Blasts Massie and Khanna’s ‘Reckless’ Epstein File Discharge Petition","text":"House Speaker Mike Johnson stated during an interview on “Meet the Press” Sunday that House Republicans are working to release all “credible” information on the Epstein files, while protecting their victims’ identities.\n\n“Let me be absolutely clear, as we have been from the very beginning,” Johnson said. “House Republicans insist upon the release of all credible evidence and information related to Epstein in any way. However, we are also insisting on the protection of innocent victims, and our concern is that the [Thomas] Massie and [Ro] Khanna discharge petition is reckless in its drafting and presentation.”\n\nThe House Speaker emphasized the importance of the word “credible,” arguing that victims’ names and reputations should be protected from false and misleading information within the files. Johnson then accused Rep. Massie, R-Ky., and Rep. Khanna, D-Calif., of pushing the release of the Department of Justice’s files and ignoring the victims’ safety.\n\nMassie and Khanna introduced the Epstein Files Transparency Act on July 15, advancing a discharge petition that, once it reached the necessary 218 signatures in the House, would force the release of the Department of Justice’s documents related to the Epstein files, thereby bypassing House leadership.\n\n“Our main concern here, though, is the protection of the innocent victims. These are minors in many cases who are subjected to unspeakable crimes. Abject evil. They’ve already suffered great harm. We do not need their names being unmasked. The Massie and Khanna discharge petition does not have adequate protections, for example, in the way that it was drafted,” Johnson explained.\n\n“They cite that they don’t want child abuse, sex abuse information uncovered, but they cite the wrong provision of the federal code, and so it makes it unworkable. It requires the DOJ to release grand jury testimony. They are prohibited by law from doing so. It is not the right approach.”\n\nWhen asked about Epstein associate Ghislaine Maxwell receiving a possible pardon, Johnson said that “she should have a life sentence,” but ultimately that’s a decision for President Donald Trump to make.\n\n“He [Trump] said he had not adequately considered that. I won’t get in front of him. That’s not my lane. My lane is to help direct and control the House of Representatives and to use every tool within our arsenal to get to the truth,” Johnson said.\n\n“I’m going to say this as clearly and plainly and repeatedly as I can over and over. We are for maximum disclosure. We want all transparency. I trust the American people. I and the House Republicans believe that they should have all this information to be able to determine what they will. But we have to protect the innocent. And that’s the only safeguard here that we’ve got to be diligent about, and I’m insistent upon doing so.”","summary":"House Speaker Mike Johnson stated during an interview on &#8220;Meet the Press&#8221; Sunday that House Republicans are working to release all &#8220;credible&#8221; information on the... Read More\n\n\nThe post Johnson Blasts Massie and Khanna&#8217;s &#8216;Reckless&#8217; Epstein File Discharge Petition appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/07/27/mike-johnson-emphasizes-transparency/","image":"https://www.dailysignal.com/wp-content/uploads/2025/07/GettyImages-2225454903-scaled-e1753652902640.jpg","video":null,"publish_date":"2025-07-27 23:00:00","author":"Lorenzo Prieto","authors":["Lorenzo Prieto"],"language":"en","category":"politics","source_country":"us","sentiment":-0.78},{"id":345791348,"title":"Israeli strikes kill 63 in Gaza despite ‘pauses’, as hunger crisis deepens","text":"Israeli forces have killed at least 63 people across Gaza, hours after the military announced it would begin “pausing” attacks for 10 hours daily in some areas to allow humanitarian aid to pass through.\n\nOn Sunday, the Israeli army said it would temporarily halt military activity each day from 10am to 8pm (07:00-17:00 GMT) in parts of central and northern Gaza, including al-Mawasi, Deir el-Balah and Gaza City. It also pledged to open designated aid corridors for food and medical convoys between 6am and 11pm.\n\nBut hours into the first day of the “humanitarian pauses”, Israeli air raids resumed.\n\n“There was an air strike on Gaza City, and this is one of the areas that was designated as a safe area, and where the Israeli forces are going to halt their military operations,” Al Jazeera’s Hind Khoudary reported from Deir el-Balah.\n\n“According to Palestinians in that area, a bakery was targeted.”\n\nThe bombardment comes as global outcry grows over the worsening humanitarian disaster in Gaza inflicted by Israel.\n\nFamine deaths rise\n\nGaza’s Ministry of Health reported that six more Palestinians, including two children, died from hunger-related causes in the past 24 hours, pushing the number of starvation deaths to 133 since October 2023.\n\nAmong the dead was five-month-old Zainab Abu Haleeb, who succumbed to malnutrition at Nasser Hospital.\n\n“Three months inside the hospital, and this is what I get in return, that she is dead,” said her mother, Israa Abu Haleeb, as the child’s father cradled her small body wrapped in a white shroud.\n\nThe World Food Programme (WFP) said on Sunday that one in three Gaza residents has gone days without eating, and nearly 500,000 people are suffering from “famine-like conditions”. The World Health Organization also warned last week that more than 20 percent of pregnant and breastfeeding women are malnourished.\n\nFalestine Ahmed, a mother in Gaza, told Al Jazeera she lost one-third of her body weight.\n\n“I used to weigh 57kg [126 pounds], now I weigh 42kg [93 pounds], and both my son and I have been diagnosed with severe malnutrition,” she said. “We barely have any food at home, and even when it’s available, it’s far too expensive for us to afford.”\n\nIsrael has authorised new corridors for aid, while the United Arab Emirates and Jordan have airdropped supplies into the territory. However, deliveries have been fraught with danger and are far too few.\n\nAl Jazeera’s Hani Mahmoud reported that one aid drop injured nearly a dozen people. “Eleven people were reported with injuries as one of these pallets fell directly on tents in that displacement site near al-Rasheed Road.”\n\nDespite the mounting evidence of extreme hunger, Israel continues to deny that famine exists in Gaza. The Israeli military insists it is working to improve humanitarian access.\n\nBut scenes of desperation contradict official claims. “I’ve come all this way, risking my life for my children. They haven’t eaten for a week,” said Smoud Wahdan, a mother searching for flour, speaking to Al Jazeera. “At the very least, I’ve been looking for a piece of bread for my children.”\n\nAnother displaced mother, Tahani, said that her cancer-stricken child was among those suffering. “I came to get flour, to look for food to feed my children. I wish God’s followers would wake up and see all these people. They are dying.”\n\nAid groups overwhelmed\n\nLiz Allcock, the head of protection for Medical Aid for Palestinians, told Al Jazeera that she has never seen Gaza in such a state. “The scale of starvation and the number of people you see walking around who are literally skin and bones [is shocking]… Money really has no value here when there is nothing to buy,” she said.\n\n“All of Gazan society – no matter who they are – is suffering from critical food shortages,” she added, warning that one-quarter of the population is at risk of acute malnutrition.\n\nThe United Nations says aid deliveries can only succeed if Israel approves the rapid movement of convoys through its checkpoints.\n\nUN aid chief Tom Fletcher noted that while some restrictions appeared to have eased, the scale of the crisis required far more action.\n\n“This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis,” he said.\n\nDiplomatic pressure builds\n\nFrench President Emmanuel Macron said on Sunday that he discussed the Gaza situation with his Turkish and Egyptian counterparts and plans to co-host a conference in New York City next week focused on securing a two-state solution.\n\n“We cannot accept that people, including large numbers of children, die of hunger,” he said.\n\nMacron confirmed that France would soon recognise Palestinian statehood, joining more than 140 UN member states.\n\nAustralian Prime Minister Anthony Albanese said in an interview that Israel’s blockade of aid amounts to a violation of “humanity and morality”.\n\n“Quite clearly, it is a breach of international law to stop food being delivered, which was a decision that Israel made in March,” he told ABC News. However, he added that Australia was not ready to recognise Palestinian statehood “imminently”.\n\nIn the United States, Secretary of State Marco Rubio said that ceasefire talks led by President Donald Trump’s envoy, Steve Witkoff, are making “a lot of progress”.\n\n“We’re optimistic and hopeful that any day now, we will have a ceasefire agreement,” Rubio told Fox News, suggesting that half of the remaining Israeli captives may be released soon.\n\nGaza’s Health Ministry said that 88 Palestinians were killed and 374 wounded in Israeli attacks over the past 24 hours alone.\n\nSince Israel’s war on Gaza began in October, at least 59,821 Palestinians have been killed and more than 144,000 injured.\n\nDespite talk of pauses and diplomacy, the violence continues to escalate.","url":"https://www.yahoo.com/news/articles/israeli-strikes-kill-63-gaza-225454675.html","image":"https://s.yimg.com/ny/api/res/1.2/6f6RYrII9JyxmPyulSJfPg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTE1NDA7aD0xMDI4O2NmPXdlYnA-/https://media.zenfs.com/en/al_jazeera_289/08c0364dd654e0858a67a3178cc057ba","video":null,"publish_date":"2025-07-27 22:54:54","author":"Al Jazeera","authors":["Al Jazeera"],"language":"en","category":"politics","source_country":"us","sentiment":-0.285},{"id":345790032,"title":"Israeli strikes kill 63 in Gaza despite ‘pauses’, as hunger crisis deepens","text":"Israeli forces have killed at least 63 people across Gaza, hours after the military announced it would begin “pausing” attacks for 10 hours daily in some areas to allow humanitarian aid to pass through.\n\nOn Sunday, the Israeli army said it would temporarily halt military activity each day from 10am to 8pm (07:00-17:00 GMT) in parts of central and northern Gaza, including al-Mawasi, Deir el-Balah and Gaza City. It also pledged to open designated aid corridors for food and medical convoys between 6am and 11pm.\n\nBut hours into the first day of the “humanitarian pauses”, Israeli air raids resumed.\n\n“There was an air strike on Gaza City, and this is one of the areas that was designated as a safe area, and where the Israeli forces are going to halt their military operations,” Al Jazeera’s Hind Khoudary reported from Deir el-Balah.\n\n“According to Palestinians in that area, a bakery was targeted.”\n\nThe bombardment comes as global outcry grows over the worsening humanitarian disaster in Gaza inflicted by Israel.\n\nFamine deaths rise\n\nGaza’s Ministry of Health reported that six more Palestinians, including two children, died from hunger-related causes in the past 24 hours, pushing the number of starvation deaths to 133 since October 2023.\n\nAmong the dead was five-month-old Zainab Abu Haleeb, who succumbed to malnutrition at Nasser Hospital.\n\n“Three months inside the hospital, and this is what I get in return, that she is dead,” said her mother, Israa Abu Haleeb, as the child’s father cradled her small body wrapped in a white shroud.\n\nThe World Food Programme (WFP) said on Sunday that one in three Gaza residents has gone days without eating, and nearly 500,000 people are suffering from “famine-like conditions”. The World Health Organization also warned last week that more than 20 percent of pregnant and breastfeeding women are malnourished.\n\nFalestine Ahmed, a mother in Gaza, told Al Jazeera she lost one-third of her body weight.\n\n“I used to weigh 57kg [126 pounds], now I weigh 42kg [93 pounds], and both my son and I have been diagnosed with severe malnutrition,” she said. “We barely have any food at home, and even when it’s available, it’s far too expensive for us to afford.”\n\nIsrael has authorised new corridors for aid, while the United Arab Emirates and Jordan have airdropped supplies into the territory. However, deliveries have been fraught with danger and are far too few.\n\nAl Jazeera’s Hani Mahmoud reported that one aid drop injured nearly a dozen people. “Eleven people were reported with injuries as one of these pallets fell directly on tents in that displacement site near al-Rasheed Road.”\n\nDespite the mounting evidence of extreme hunger, Israel continues to deny that famine exists in Gaza. The Israeli military insists it is working to improve humanitarian access.\n\nBut scenes of desperation contradict official claims. “I’ve come all this way, risking my life for my children. They haven’t eaten for a week,” said Smoud Wahdan, a mother searching for flour, speaking to Al Jazeera. “At the very least, I’ve been looking for a piece of bread for my children.”\n\nAnother displaced mother, Tahani, said that her cancer-stricken child was among those suffering. “I came to get flour, to look for food to feed my children. I wish God’s followers would wake up and see all these people. They are dying.”\n\nAid groups overwhelmed\n\nLiz Allcock, the head of protection for Medical Aid for Palestinians, told Al Jazeera that she has never seen Gaza in such a state. “The scale of starvation and the number of people you see walking around who are literally skin and bones [is shocking]… Money really has no value here when there is nothing to buy,” she said.\n\n“All of Gazan society – no matter who they are – is suffering from critical food shortages,” she added, warning that one-quarter of the population is at risk of acute malnutrition.\n\nThe United Nations says aid deliveries can only succeed if Israel approves the rapid movement of convoys through its checkpoints.\n\nUN aid chief Tom Fletcher noted that while some restrictions appeared to have eased, the scale of the crisis required far more action.\n\n“This is progress, but vast amounts of aid are needed to stave off famine and a catastrophic health crisis,” he said.\n\nDiplomatic pressure builds\n\nFrench President Emmanuel Macron said on Sunday that he discussed the Gaza situation with his Turkish and Egyptian counterparts and plans to co-host a conference in New York City next week focused on securing a two-state solution.\n\n“We cannot accept that people, including large numbers of children, die of hunger,” he said.\n\nMacron confirmed that France would soon recognise Palestinian statehood, joining more than 140 UN member states.\n\nAustralian Prime Minister Anthony Albanese said in an interview that Israel’s blockade of aid amounts to a violation of “humanity and morality”.\n\n“Quite clearly, it is a breach of international law to stop food being delivered, which was a decision that Israel made in March,” he told ABC News. However, he added that Australia was not ready to recognise Palestinian statehood “imminently”.\n\nIn the United States, Secretary of State Marco Rubio said that ceasefire talks led by President Donald Trump’s envoy, Steve Witkoff, are making “a lot of progress”.\n\n“We’re optimistic and hopeful that any day now, we will have a ceasefire agreement,” Rubio told Fox News, suggesting that half of the remaining Israeli captives may be released soon.\n\nGaza’s Health Ministry said that 88 Palestinians were killed and 374 wounded in Israeli attacks over the past 24 hours alone.\n\nSince Israel’s war on Gaza began in October, at least 59,821 Palestinians have been killed and more than 144,000 injured.\n\nDespite talk of pauses and diplomacy, the violence continues to escalate.","summary":"Israel attacks &#039;safe zones&#039; in Gaza as six more Palestinians, including two children, die from malnutrition.","url":"https://www.aljazeera.com/news/2025/7/27/israeli-strikes-kill-63-in-gaza-despite-pauses-as-hunger-crisis-deepens?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/07/GettyImages-2226314408-1753607953-e1753609040804.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-07-27 22:54:54","author":"Al Jazeera,Apps Support","authors":["Al Jazeera","Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.285},{"id":345791834,"title":"‘I’m going to bomb the plane!’ Watch man on flight to Scotland threaten Trump with death while president is in Scotland","text":"Chaos erupted in the sky Sunday as a deranged man on a flight to Scotland threatened to blow up the plane and “send a message” of death to Donald Trump while the U.S. president is in Scotland.\n\n“I’m going to bomb the plane! Death to America! Death to Trump!” the 41-year-old man screamed before fellow passengers tackled him to the floor of easyJet flight 609 from London to Glasgow.\n\nThe harrowing incident took place about 8 a.m., an hour after departure from London’s Luton Airport.\n\nOne passenger told the London newspaper The Sun: “He literally came out of the toilet shouting ‘Allahu Akbar’ (God is great) with his hands above his head. Then he said ‘I’ve got a bomb, I’ve got a bomb’ – at this point, people were confused.”\n\nBREAKING: A Middle Eastern man on a flight to Scotland had to be RESTRAINED after he made B0MB threats and called for President Trump to be KlLLED\nTrump is currently in Scotland\n“ALLAHU AKHBAR! DE*TH TO TRUMP!”\nTrump was right: Europe has been INVADED! pic.twitter.com/w0UN91F3lF\n— Nick Sortor (@nicksortor) July 27, 2025\n\n“I thought he was joking, I mean, it’s a weird joke.”\n\n“He pushed the airline staff and was being aggressive towards them. He was a big guy, about six foot, and they were these petite women,” the passenger added.\n\n“When he pushed them, that’s when things changed. At that point, one guy managed to grab him from behind and pull him down, then everyone jumped on top of him.\n\n“He was fighting a bit on the floor, but at this point, he knew he’d f***ked up.”\n\nIs the news we hear every day actually broadcasting messages from God? The answer is an absolute yes! Find out how!\n\n“The pilot announced he was making an emergency landing and took the plane down so quickly,” he continued.\n\n“Everyone who wasn’t restraining him was told to sit down. The three guys pinning him down, they landed whilst pinning him down. It was incredible.\n\n“I’ve never seen that before. The airline staff, they were all girls, they were really shaken up by it, but they were super professional.”\n\n“Some of the passengers were crying because they were shaken up. It was just a bit surreal.”\n\nPresident Trump was just an hour away from Glasgow at his Turnberry golf course, as he announced new trade deals with the European Union.\n\nEasyJet confirmed police arrested a suspect whose name has not been released after the plane was forced to make an emergency landing.\n\n“Flight EZY609 from Luton to Glasgow this morning was met by police on arrival in Glasgow, where they boarded the aircraft and removed a passenger due to their behavior onboard,” the company indicated.\n\n“The safety and wellbeing of our customers and crew is always easyJet’s highest priority.”\n\nFollow Joe on X @JoeKovacsNews","summary":"'He was fighting a bit on the floor, but at this point, he knew he'd f***ed up'","url":"https://www.wnd.com/2025/07/im-going-bomb-plane-watch-man-flight-scotland/","image":"https://www.wnd.com/wp-content/uploads/2025/07/muslim-easyjet-floight-plane-trump-allahu-akhbar-20250727-jpg.jpg","video":null,"publish_date":"2025-07-27 22:53:46","author":"Joe Kovacs","authors":["Joe Kovacs"],"language":"en","category":"politics","source_country":"us","sentiment":-0.406},{"id":345790114,"title":"Islamic State-Backed Rebels Attack Catholic Church in Congo, Nearly Three Dozen Dead","text":"The death toll has risen to at least 34 people in a savage attack by Islamic State-backed rebels on a Catholic church in the eastern Congo on Sunday, according to a local leader.\n\nDieudonne Duranthabo, a civil society coordinator in Komanda, in the Ituri province, told The Associated Press (AP) that the attackers, armed with guns and machetes, stormed the church in Komanda town at around 1 a.m.\n\nThe rampage also extended to several houses and shops that were torched.\n\n“The bodies of the victims are still at the scene of the tragedy, and volunteers are preparing how to bury them in a mass grave that we are preparing in a compound of the Catholic church,” Duranthabo told AP.\n\nVideo footage from the scene posted on Aljazeera shows burning structures and bodies on the floor of the church.\n\nReportedly at least five other people were murdered in an earlier attack on the nearby village of Machongani.\n\nThe Allied Democratic Force (ADF) is believed to be the perpetrators of both attacks in the Democratic Republic of the Congo (DRC).\n\nThe ADF is a rebel group that historically has operated along the border between Uganda and Congo. It was formed in Uganda in the late 1990s following alleged discontent with President Yoweri Museveni.\n\nAccording to CNN:\n\nIn 2002, following military assaults by Ugandan forces, the group moved its activities to neighboring DRC and has since been responsible for the killings of thousands of civilians. In 2019, it pledged allegiance to the Islamic State. The ADF’s leadership conceives of an Islamist government in the East African country.\n\nAs Breitbart News reported, Congo recently made news in the White House when President Donald Trump hosted Foreign Ministers of Rwanda and the Democratic Republic of the Congo to sign a historic peace agreement, ending years of conflict between those two countries.\n\nApparently, Congo security forces were in the area at the time of the Ituri province attack on Sunday.\n\n“We are truly disappointed because it is incredible that such a situation could occur in a town where all the security officials are present,” Duranthabo said. “Some citizens have started fleeing the area and are heading towards Bunia.”\n\nBunia is the capital city of the Ituri province about 45 miles from the Ugandan border.\n\nContributor Lowell Cauffiel is the best-selling author of Below the Line and nine other crime novels and nonfiction titles. See lowellcauffiel.com for more.","summary":"The death toll has risen to at least 34 people in a savage attack by Islamic State-backed rebels on a Catholic church in the eastern Congo on Sunday, according to a local leader.\n\n\nThe post Islamic State-Backed Rebels Attack Catholic Church in Congo, Nearly Three Dozen Dead appeared first on Breitbart.","url":"https://www.breitbart.com/africa/2025/07/27/rebels-attack-catholic-church-in-congo-nearly-three-dozen-dead/","image":"https://media.breitbart.com/media/2025/07/GettyImages900069270-640x335.jpg","video":null,"publish_date":"2025-07-27 22:48:03","author":"Islamic State,Lowell Cauffiel","authors":["Islamic State","Lowell Cauffiel"],"language":"en","source_country":"US","sentiment":-0.034}]}