{"offset":0,"number":50,"available":6357,"news":[{"id":259983286,"title":"Trump says America 'can't be taken advantage of any longer,' hints at possible SMA renegotiation","text":"Former President Donald Trump said Wednesday that America \"cannot be taken advantage of any longer in trade and in the military,\" reinforcing speculation that he could demand renegotiation of a recent defense cost-sharing deal with Seoul if he returns to office.\n\nThe Republican presidential candidate made the remarks during a televised town hall event hosted by Fox News, falsely claiming that South Korea does not pay for the stationing of the 28,500-strong US Forces Korea.\n\n\"South Korea ... We have 42,000 soldiers there. They don't pay,\" Trump said, apparently referring to 28,500 USFK service members.\n\n\"I made them pay. Everyone raised hell, and Biden took the deal, and he said they don't pay anymore, and they're a rich country. No ... we have to start. We cannot be taken advantage of any longer in trade, in the military,\" he added.\n\nIt remains uncertain about what he meant by saying, \"We have to start.\" But his remark added to expectations that he could call for renegotiation of the defense cost-sharing deal, called the Special Measures Agreement, which Seoul and Washington reached earlier this month.\n\nUnder the latest SMA to last through 2030, Seoul is to pay 1.52 trillion won ($1.14 billion) in 2026, up from 1.4 trillion won in 2025. The deal links an annual increase in Seoul's SMA contributions to the Consumer Price Index.\n\nIn a separate event on Tuesday, Trump said that South Korea would be paying $10 billion a year for the stationing of USFK if he was in the White House, as he described the Asian ally as a \"money machine.\"\n\nIn response, an official at Seoul's foreign ministry stressed that the latest SMA was a product of bilateral efforts to produce \"a reasonable outcome.\"\n\nSeoul and Washington launched their SMA negotiations in April -- earlier than usual -- amid concerns that Trump could drive a hard bargain over burden sharing in a way that could cause tensions in the bilateral alliance amid growing North Korean military threats. (Yonhap)\n\nDespite the conclusion of the monthslong negotiations this month, concerns about potential SMA renegotiation have lingered.\n\nSince 1991, Seoul has partially shouldered costs under the SMA for Korean USFK workers, the construction of military facilities and other logistical support.","summary":"Former President Donald Trump said Wednesday that America &quot;cannot be taken advantage of any longer in trade and in the military,&quot; reinforcing speculation that he could demand renegotiation of a recent defense cost-sharing deal with Seoul if he returns to office. The Republican presidential candidate made the remarks during a televised town hall event hosted by Fox News, falsely claiming that South Korea does not pay for the stationing of the 28,500-strong US Forces Korea. &quot;South K","url":"https://www.koreaherald.com/view.php?ud=20241017050140","image":"https://res.heraldm.com/content/image/2024/10/17/20241017050143_0.jpg","video":null,"publish_date":"2024-10-17 00:44:00","author":"Yonhap","authors":["Yonhap"],"language":"en","source_country":"kr","sentiment":-0.328},{"id":259983018,"title":"Judge declares Georgia election rules created by Trump supporters as invalid","text":"A Georgia judge invalidated several new election rules on Wednesday, calling the measures approved by the state’s Republican-controlled election board “unconstitutional” and in violation of state law.\n\nThe ruling, handed down by Fulton County Superior Court Judge Thomas Cox, applies to a hand-count rule for Election Day ballots and rules tied to the certification of results.\n\nCox wrote that the five-member board, which includes three officials lauded by former President Donald Trump, “had no authority to implement these rules,” and that the measures were “illegal, unconstitutional, and void.”\n\nThe Georgia Secretary of State’s Office and the state election board did not immediately respond to requests for comment Wednesday night.\n\nFollow live updates on the 2024 election\n\nCox’s ruling comes a day after Fulton County Superior Court Judge Robert McBurney blocked the rule requiring that ballots be hand-counted on Election Day which critics have argued would stir delays in reporting the final results. The judge also ruled that the state’s county election boards could not refuse to certify election results.\n\nVoters in the battleground state, which Trump narrowly lost to President Joe Biden in 2020, began heading to the polls for in-person early voting on Tuesday. An election official at the secretary of state’s office said that more than 300,000 ballots had been tallied after polls closed on the first day, breaking the record set on the first day of early voting in the 2020 contest.","summary":"A Georgia judge invalidated several new election rules on Wednesday, calling the&#8230;","url":"https://internewscast.com/news/us/judge-declares-georgia-election-rules-created-by-trump-supporters-as-invalid/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Judge-invalidates-Georgia-election-rules-crafted-by-800x430.jpg","video":null,"publish_date":"2024-10-17 00:37:09","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.415},{"id":259983062,"title":"Kamala Harris avoids questions about Biden's mental decline: 'Joe Biden is not on the ballot'","text":"Vice President Kamala Harris was confronted with questions about her knowledge of President Biden's mental decline during her interview Wednesday with Fox News' Bret Baier. \"You told many interviewers that Joe Biden was on his game, that ran around circles on his staff. When did you first notice that President Biden's mental faculties appeared diminished?\" Baier asked. After a brief pause to the question, Harris continued touting Biden's ability in office. \"Joe Biden, I have watched from the Oval Office to the Situation Room, and he has the judgment and the experience to do exactly what he has done in making very important decisions on behalf of the American people,\" Harris said. KAMALA HARRIS REPEATEDLY PIVOTS TO TRUMP WHEN GRILLED ON IMMIGRATION RECORD IN FOX NEWS INTERVIEW \"There were no concerns raised?\" Baier followed. \"Bret, Joe Biden is not on the ballot… and Donald Trump is,\" Harris responded. The \"Special Report\" anchor then cited comments made by actor George Clooney, who said in the now-infamous New York Times op-ed that the president wasn't the same Joe Biden he once knew after spending time with him at a fundraiser earlier this year. HARRIS RIPPED FOR RESURFACED CLAIMS PRAISING BIDEN'S FITNESS AMID AGE CONCERNS: ‘COMPLICIT IN A COVERUP’ \"You met with him at least once a week for three-and-a-half years. You didn't have any concerns?\" Baier pressed. \"I think the American people have a concern about Donald Trump,\" Harris responded. \"Which is why the people who know him best, including leaders of our national security community have all spoken out, even people who worked for him in the Oval Office, worked with him in the Situation Room and have said he is unfit and dangerous and should never be President of the United States again, including his former vice president, which is why the job was open for him to choose another running mate. So that is a fact. That is a fact.\" KAMALA HARRIS DODGES COLBERT'S QUESTION ON WHAT ‘MAJOR CHANGES’ SHE'D BRING VERSUS BIDEN PRESIDENCY CLICK HERE TO GET THE FOX NEWS APP President Biden's critics have long drawn scrutiny towards his mental acuity throughout his presidency, which was flatly rejected by Democrats and members of the legacy media. However, that all changed following Biden's disastrous performance in the CNN presidential debate against former President Trump, resulting in his dramatic exit from the 2024 race and the sudden emergence of Harris at the top of the Democratic ticket.","summary":"During her interview with Fox News&apos; Bret Baier, Vice President Kamala Harris was pressed about whether she had concerns about President Biden&apos;s mental acuity before his 2024 exit.","url":"https://www.foxnews.com/media/kamala-harris-avoids-questions-about-bidens-mental-decline-joe-biden-not-ballot","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/kamalafox.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-17 00:30:07","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","source_country":"us","sentiment":0.11},{"id":259983082,"title":"Harris Declares on Fox: ‘My Presidency Will Not Be a Continuation of Joe Biden’s’","text":"When Vice President Kamala Harris sat down with Fox News host Bret Baier, the tone was immediately set. Baier spent a majority of the interview interrupting and talking over Harris as she pushed back to finish her answers. The pair clashed on immigration, Donald Trump’s ongoing threats against those who oppose him, and her support of President Joe Biden.\n\n At point, Baier rolled a clip of Harris being asked on The View what she would have differently than Biden over the past three and a half years, and replying, “There is nothing that comes to mind — and I’ve been a part of most of the decisions that have had impact.”\n\n When addressing Baier on Wednesday, Harris said, “Let me be very clear: My presidency will not be a continuation of Joe Biden’s presidency.”\n\n “Like every new president that comes into office, I will bring my life experiences, my professional experiences, and fresh and new ideas,” she continued. “I represent a new generation of leadership. For example, I am someone who has not spent the majority of my career in Washington, D.C. I invite ideas, whether it be from the Republicans who are supporting me, who were just on stage with me minutes ago, and the business sector and others who can contribute to the decisions that I make.”\n\n Earlier in the interview, Baier also asked Harris how many undocumented immigrants had crossed into the United States during Biden’s administration. After Harris acknowledged immigration was “a topic of discussion that people want to rightly have,” Baier cut in to claim it was 6 million people.\n\n “Let me just finish. I’ll get you a question I promise you to answer,” Harris shot back, adding that Biden’s first proposed piece of legislation after being sworn in was “a bill to fix our immigration system.” Although the U.S. Citizenship Act of 2021 was signed by Biden on his first day of office, Baier pointed out that the bill died despite Democrats controlling the House and Senate.\n\n “We recognized from day one that — on the point of this being your first question — it is a priority for us as a nation and for the American people, and our focus has been on fixing a problem,” Harris said, referencing the White House’s efforts to bolster resources at entry points at the border and increasing penalties for illegal crossings.\n\n Harris also called out Trump and his allies for blocking a bipartisan immigration bill in order to fuel the border crisis and boost Trump‘s campaign for the presidency. “[Trump] preferred to run on a problem instead of fixing a problem,” said the vice president. “In this election, this is rightfully a discussion that the American people want to have, and what they want are solutions. They want the President of the United States who is not playing political games with the issue.”","summary":"The vice president and Fox News' Bret Baier sparred for much of the interview. At one point, Harris pushed back and told the anchor, \"I’m Not Finished\"","url":"https://www.rollingstone.com/politics/politics-news/kamala-harris-fox-news-bret-baier-presidency-biden-1235135525/","image":"https://www.rollingstone.com/wp-content/uploads/2024/10/harris-fox-news-presidency-biden.jpg","video":null,"publish_date":"2024-10-17 00:26:28","author":"Althea Legaspi,Charisma Madarang","authors":["Althea Legaspi","Charisma Madarang"],"language":"en","source_country":"us","sentiment":0.057},{"id":259982046,"title":"Donald Trump ahead of Kamala Harris by 2 points nationally — swing from just a month ago: Fox News poll","text":"Former President Donald Trump is ahead of Vice President Kamala Harris in the presidential contest, 50-48% according to a new Fox News national survey. That’s a reversal from last month when Harris had a narrow advantage.\n\nHarris, however, is ahead by 6 points among voters from the seven key battleground states and the candidates tie 49% each among voters in close counties (where the Joe Biden-Trump 2020 margin was less than 10 points). Trump’s advantage comes from a larger share in counties he won by more than 10 points in 2020 (64-35%) than Harris has in counties Biden won by more than 10 points (58-39%).\n\nThat raises the question of whether the Democrat could win the Electoral College while losing the national popular vote. In 2000 and 2016, it was the GOP candidate who lost the popular vote but won the Electoral College.\n\nTrump’s 2-point edge among likely voters falls well within the margin of error. The results are identical among the larger group of registered voters. Last month, Harris was up by 2 points (50-48%) among both likely and registered voters. \n\nThis analysis uses registered voter results for apples-to-apples trend comparisons.\n\nThese are Trump’s best numbers since Harris became the nominee in August. The movement toward him mainly comes from an increase in support among White voters, who now favor him by 10 points, up from 4 points last month and 6 points in August. He is also at record highs among voters 65 and over (49%) and those with a college degree (48%). \n\nAt the same time, Harris receives her lowest support since becoming the nominee among Black voters (67%), college graduates (49%), voters 65 and over (47%), and Whites with a college degree (46%). \n\nYet on the surface, the race has stayed within a small range. In August, Trump was ahead by 1 point, then Harris was up by 2 points in September, and now Trump has a 2-point edge. \n\n“Overall, the movement toward Trump is subtle but potentially consequential, especially if he is making gains among college-educated voters,” says Democratic pollster Chris Anderson, who conducts Fox News surveys with Republican Daron Shaw. “However, the race has been well within the margin of error for three months and the outcome will likely hinge on which side is more effective at getting their voters to the polls as opposed to persuasion.” \n\nThe 20-point gender gap remains, as men back Trump and women go for Harris.\n\nThe good news for Harris is she gets 52% of new voters (those who haven’t voted in the last two presidential elections) and 20% non-MAGA Republicans.\n\nShe is also maintaining her double-digit lead over Trump among independents. That keeps the contest close, as each candidate receives backing from over 9 in 10 of their respective partisans. On the other hand, more voters nationally identify as Republican than Democrat, and that is what gives Trump the edge in this race.\n\nWhile the vice president gets majority support among Hispanics (52%) and voters under age 30 (54%), both numbers trail President Joe Biden’s support in 2020 according to the Fox News Voter Analysis election survey (6 in 10 from each group). \n\nFor Trump, the good news is that he improved on every issue and character trait since September. And a majority remembers his time in office positively: 53% approve of the job he did as president. That is 4 points higher than he ever received while in office. Fully 93% of Republicans approve as do 74% of non-MAGA Republicans and 45% of independents.\n\nBy comparison, currently only 40% of voters approve of Biden’s job performance, which matches previous lows in November 2023 and July 2022. \n\nOnly slightly more, 43%, approve of the government’s response to recent hurricanes, with most Democrats approving and most Republicans and independents disapproving.\n\nThe economy continues to outrank all other issues, as 40% say it is the most important issue in deciding their choice for president. Less than half as many prioritize immigration and abortion, and far fewer cite issues such as election integrity, health care, climate change, guns, crime, and foreign policy.\n\nSeven in 10 view the economy negatively. The 30% who rate conditions positively is up from a low of 17% in 2022, and close to the 33% who felt good about the economy at the end of Trump’s term. Half of Democrats give positive ratings while majorities of Republicans and independents rate economic conditions negatively.\n\nOverall, 44% say they are falling behind financially, which is worse by 17 points compared to three years ago when only 27% felt that way. Some 13% feel they are getting ahead financially, while 43% are holding steady. \n\nTrump is seen as better than Harris at handling the economy (by 8 points). He also bests her on immigration (+15), crime (+8), and guns (+6). With the expanding conflict in the Middle East, it is noteworthy Trump is favored by 13 points on Israel and the war, up from a 7-point lead in September. He has improved his standing on every issue compared to September, mostly by small margins.\n\nMore voters trust Harris to handle abortion (by 14 points), climate change (+12), and health care (+8). The two candidates are rated about evenly on taxes (Trump +4), Supreme Court nominations (Trump +1), and election integrity (Harris +3). \n\n“Sometimes, elections are simple,” says Shaw. “In three weeks, we may be wondering how we thought the sitting vice president would win when only two in five voters think the incumbent administration has done a good job and only one in seven say they are getting ahead financially.”\n\nDemocrats and Republicans prioritize the issues differently, with the widest gap (28 points) on immigration. There’s an 18-point gap on abortion and 15 points on the economy.\n\nSome 12% of Democrats see Trump as better at handling the economy and 18% feel that way about immigration, while 17% of Republicans trust Harris more on abortion and climate change.\n\nTrump is helped by more voters saying they know a great deal about where he stands on their priority issues than they do about Harris (57% vs. 44%). Fully 78% of Republicans feel they know a great deal about Trump’s stances while 65% of Democrats say the same about Harris.\n\nLess than half believe Trump (43%) and Harris (48%) are honest and trustworthy, though Trump’s number is a personal best. Voters are also more likely to see him as a strong leader (55% vs. 47% for Harris) and “up to the job” of president (53% vs. 50%). Harris has an edge on having the mental soundness to be president (54% vs. 52% for Trump), but here again Trump is at a personal best. \n\nHarris has lost ground on some key characteristics. She was seen as better at helping the middle class by 9 points in September and that has declined to 4 points now. Her 5-point edge on “fighting for people like you” is now 2 points, and her 6-point advantage on “protecting personal rights and freedoms” has disappeared as the candidates are tied. \n\nVoters also narrowly see Trump as the one bringing needed change and protecting free speech, both traits where Harris was favored last month. \n\nThe race continues to be more about Trump than Harris, as most of his backers say their vote is for him rather than against Harris. Among Harris supporters, two-thirds describe their vote as for her, but one-third say it is against Trump. For comparison, in May, nearly half of Biden supporters said their vote was mainly against Trump. Among Trump supporters, 80% say they are voting for him rather than against Harris (18%).\n\nWhen saying in their own words what one issue or factor was motivating them to get out and vote this year, the top response from Harris supporters is dislike of the other candidate, followed by protecting democracy, and abortion. For those backing Trump, the economy and immigration are the top two motivators, followed by candidate characteristics. Among men, it’s dislike of the other candidate, the economy, and traits (in that order), while for women the economy and abortion tie as the top motivator, followed by candidate traits. \n\nPoll-Pourri\n\nAs red and blue states become shades of purple it is tough to know what level of a popular vote suggests a win in the Electoral College. In 2016, Hillary Clinton got more votes nationally by a 2-point margin but lost the Electoral College (by 77 electoral votes), while Joe Biden had a 4-point advantage in the popular vote and won the Electoral College (by 74). \n\nAbout one-third of voters overall and one-third of women say Harris becoming the first female president matters to their vote. Among the 17% saying it matters a great deal, 80% back Harris.\n\nAbout 3 in 10 voters say they check news multiple times a day and they favor Trump by 10 points. At the other end of the spectrum, 1 in 10 say they don’t pay attention to news, and these disengaged voters favor Trump by 16 points. The 57% who follow news regularly but not constantly back Harris by 6 points.\n\nMost of each candidate’s backers feel certain of their vote, and two-thirds of both Harris’ and Trump’s supporters say they are “extremely” motivated to vote. \n\nConducted October 11-14, 2024 under the direction of Beacon Research (D) and Shaw & Company Research (R), this Fox News survey includes interviews with a sample of 1,110 registered voters randomly selected from a national voter file. Respondents spoke with live interviewers on landlines (129) and cellphones (719) or completed the survey online after receiving a text (262). Results based on both the full registered voter sample and the subsample of 870 likely voters have a margin of sampling error of ±3 percentage points. Sampling error associated with results among subgroup is higher. In addition to sampling error, question wording and order can influence results. Weights are generally applied to age, race, education, and area variables to ensure the demographics of respondents are representative of the registered voter population. Sources for developing weight targets include the American Community Survey, Fox News Voter Analysis, and voter file data. Likely voters are based on a probabilistic statistical model that relies on past vote history, interest in the current election, age, education, race, ethnicity, church attendance, and marital status.","summary":"Former President Donald Trump is ahead of Vice President Kamala Harris in the presidential contest, 50-48% according to a new Fox News national survey.","url":"https://nypost.com/2024/10/16/us-news/donald-trump-ahead-of-kamala-harris-by-2-points-nationally-swing-from-just-a-month-ago-fox-news-poll/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-iu42j6d9v-1729120201827.jpg?quality=75&strip=all&1729105879&w=1200","video":"https://cdn.jwplayer.com/videos/6kp5yesf-RyIcpnTz.mp4","publish_date":"2024-10-17 00:20:15","author":"Fox News","authors":["Fox News"],"language":"en","category":"politics","source_country":"us","sentiment":0.138},{"id":259982630,"title":"Judge on Jan. 6 suggests Trump could be liable for Capitol riot","text":"The Washington, D.C. judge overseeing former President Donald Trump’s election subversion case has warned him that he might face criminal consequences for the actions of Jan. 6 rioters – even absent any kind of direct encouragement on his part.\n\nIn a 50-page order, U.S. District Judge Tanya Chutkan on Thursday dispensed with various outstanding motions intent on prying information away from the government. In a mixed-bag ruling, the court granted Trump’s requests in part – and denied them in part.\n\nLikely unexpected by the defense was the court musing about the relative strength of one of the government’s cornerstone arguments. Namely, the idea that Trump himself bears responsibility for the unprecedented attack on the U.S. Capitol Complex.\n\n“It is entirely conceivable, for instance, that Defendant could share responsibility for the events of January 6 without such express authorization of rioters’ criminal actions,” Chutkan mused.","summary":"Left: Special counsel Jack Smith turns from the podium after speaking about&#8230;","url":"https://internewscast.com/crime/judge-on-jan-6-suggests-trump-could-be-liable-for-capitol-riot/","image":"https://internewscast.com/wp-content/uploads/2024/10/Jan-6-judge-says-Trump-may-be-responsible-for-Capitol-800x430.jpg","video":null,"publish_date":"2024-10-17 00:18:41","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.411},{"id":259982036,"title":"Harris distances herself from Biden, bashes Trump in tense Fox News interview","text":"Kamala Harris on Wednesday distanced herself from President Joe Biden and bashed her Republican presidential rival Donald Trump in a heated interview with Fox News anchor Brett Baier.\n\n“Let me be very clear, my presidency will not be a continuation of Joe Biden’s presidency,” Harris said on the conservative news network, after Baier pressed her on whether the vice president would do anything differently than the incumbent.\n\n“And like every new president that comes in to office, I will bring my life experiences, my professional experiences, and fresh and new ideas,” the Democratic nominee said.\n\nThe 26-minute interview was focused heavily on the issue of immigration, and Harris again blamed Trump for killing a bipartisan bill aimed at addressing the crisis at the southern border.\n\nThe interview was tense from the first exchange, when Baier repeatedly interrupted Harris’ opening answer about immigration. “You have to let me finish please … I’m in the middle of responding to the point you’re raising, and I’d like to finish,” Harris said early on.","summary":"Vice President and Democratic presidential candidate Kamala Harris arrives for a campaign event at the Dort Financial Center in Flint, Michigan, October 4, 2024.  Geoff Robins &#124; Afp &#124; Getty Images Kamala Harris on Wednesday distanced herself from President Joe Biden and bashed her Republican presidential rival Donald Trump in a heated interview with Fox &#8230;\n\n\nThe post Harris distances herself from Biden, bashes Trump in tense Fox News interview appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/us-news/harris-distances-herself-from-biden-bashes-trump-in-tense-fox-news-interview/","image":"https://image.cnbcfm.com/api/v1/image/108043823-1728221671355-gettyimages-2175885786-AFP_36JA973.jpeg?v=1729121241&w=1920&h=1080","video":null,"publish_date":"2024-10-17 00:17:27","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","category":"politics","source_country":"us","sentiment":-0.165},{"id":259983096,"title":"\"Not the words I would use\": Vance goes all-in on Trump's 2020 election denial","text":"After dodging the question for weeks, Donald Trump running mate JD Vance finally admitted where he stands on the question of whether or not the former president lost the 2020 election. \n\nDuring a rally in Pennsylvania on Wednesday, Vance said that he doesn't believe Trump lost to President Joe Biden in the last election. The Ohio senator gave his take on that contest after being asked about it by a reporter in the crowd. \n\n“I’ve answered this question directly a million times,” Mr. Vance said, per the New York Times. “No. I think there are serious problems in 2020. So did Donald Trump lose the election? Not by the words that I would use.”\n\nThat belief, shared by many Trump supporters, animated a slew of legal challenges from Trump and led to the storming of the U.S. Capitol by a right-wing mob on Jan. 6. Trump himself is currently on trial for a range of election interference charges related to his attempts to disrupt the certification of Biden's victory. \n\nThough Vance has previously shared that he thought the election was stolen from Trump, he's refused to stand behind that claim since being tagged as a vice presidential candidate. Vance ducked the question from Democratic vice presidential nominee Tim Walz at their debate earlier this month, a move that Walz called a \"damning non-answer.\"\n\nHe continued to side-step the topic in an interview with the New York Times, which asked Vance to share his thoughts on 2020 five times in a single interview.","summary":"After ducking the question for weeks, JD Vance admitted that he believes Trump didn't lose the 2020 election","url":"https://www.salon.com/2024/10/16/not-the-words-i-would-use-vance-goes-all-in-on-2020-denial/","image":"https://mediaproxy.salon.com/width/1200/height/675/<?= https://media2.salon.com/2024/08/jd-vance-2166169106jpg.jpg ?>","video":null,"publish_date":"2024-10-17 00:12:33","author":"Alex Galbraith","authors":["Alex Galbraith"],"language":"en","category":"politics","source_country":"us","sentiment":-0.311},{"id":259981736,"title":"Harris campaign defends against plagiarism accusations, expert suggests claims are valid.","text":"WASHINGTON – Democratic presidential candidate Kamala Harris’ campaign is dismissing accusations that she and a co-author plagiarized parts of a 2009 book on the U.S. criminal justice system as a desperate attempt by “rightwing operatives” to distract voters.\n\nPlagiarism experts and academics who reviewed the claims said several were benign or could not be proven, and others were more due to careless writing than malicious intent.\n\nThe allegations surrounding the book, “Smart on Crime: A Career Prosecutor’s Plan to Make Us Safer,” surfaced Monday when conservative activist Christopher Rufo posted an article on his Substack platform that listed a handful of passages he said were copied from other sources without any or adequate attribution.\n\n“Taken in total, there is certainly a breach of standards here,” Rufo wrote. “Harris and her co-author duplicated long passages nearly verbatim without proper citation and without quotation marks, which is the textbook definition of plagiarism.”\n\nJames Singer, a spokesman for the Harris campaign, said in an emailed statement that the plagiarism allegations represent a partisan attack on a book Harris co-authored more than a decade ago.\n\n“Rightwing operatives are getting desperate as they see the bipartisan coalition of support Vice President Harris is building to win this election, as (former president Donald) Trump retreats to a conservative echo chamber refusing to face questions about his lies,” Singer wrote. “This is a book that’s been out for 15 years, and the vice president clearly cited sources and statistics in footnotes and endnotes throughout.”\n\nRufo’s article cited a new study of Harris’ 248-page book by Stefan Weber, an Austrian academic known in Europe as a “plagiarism hunter.” Among the findings, the book plagiarized a section from a Wikipedia article and made up a childhood anecdote that originated with Martin Luther King Jr., according to Weber.\n\nTrump’s running mate, Ohio Republican Sen. JD Vance, seized on the allegations to needle Harris.\n\n“Hi, I’m JD Vance. I wrote my own book, unlike Kamala Harris, who copied hers from Wikipedia,” he wrote on X. Vance’s 2016 memoir, Hillbilly Elegy recounts his blue-collar upbringing in Kentucky and Ohio.\n\nThe allegation involving King centers on a story Harris said her mother told her about a time when she was fussing as a toddler. Her mother, according to the book, asked her what was wrong and what she wanted. “I wailed back, ‘Fweedom,’” Harris wrote. Weber said Harris appropriated the anecdote, without attribution, from an interview King gave in 1965.\n\nBut other plagiarism experts questioned the severity of the claims. Jonathan Bailey, a consultant and publisher of the website Plagiarism Today, said in a Tuesday post that the King story allegation first arose in early 2021 and couldn’t be proven based on available evidence. But several other plagiarism accusations are more troublesome, he said, including Weber’s allegation that Harris’ book copied and pasted, without citation, a section of a Wikipedia article.\n\nBut the patterns in the book point to “sloppy writing habits, not a malicious intent to defraud,” he said.\n\n“Though some of the passages, such as the Wikipedia one, are sloppy to the point of negligence, when you look at the portion of the book involved, the nature of the issues, and the citations provided, negligence remains more likely than malice in my eyes,” Bailey wrote.\n\nMiguel Roig, a psychology professor at St. John’s University in New York who studies plagiarism in the sciences, said the lapses described by Weber meet the definition of plagiarism. But, he added, context is important. The problematic passages amount to a small total of the overall book and “hardly seems like an attempt to defraud,” he said.\n\n“Any time minor issues like these occur, the offending authors should simply acknowledge the obvious errors, apologize, and make corrections where feasible, and just move on,” Roig said.\n\nHarris wrote “Smart on Crime” when she was the district attorney for San Francisco. The book spelled out her ideas for improving public safety and making the criminal justice system more effective. In 2010, a year after the book was published, she was elected attorney general of California.\n\nHarris’ co-author, Joan O’C. Hamilton, works as a book collaborator and ghostwriter, according to her website.\n\nWeber, the plagiarism researcher in Austria, said in an email that much of the work to check Harris’s book was done by an associate whom he did not identify. But he said the associate was “driven by personal choice and interest, not by political motivations.” This was Weber’s first “international case,” he said.\n\nHe also said he was unaware until the Harris review had been released that Trump, the Republican presidential nominee, had published books.\n\n“Every scientist can feel free to check the books of Donald Trump or whomsoever as we did it with Kamala Harris,” Weber said.\n\nDebora Weber-Wulff, a professor of media and computing at Berlin University of Applied Sciences in Germany and no relation to Weber, sided with Bailey’s assessment and said the book’s publisher would have to decide whether any problems justify removing it from sales. Any legal action is unlikely because the original author of the plagiarized content would have to pursue a potentially costly lawsuit.\n\n“No one in their right mind would invite a suit like this,” Weber-Wulff said. “Only the lawyers profit.”","summary":"WASHINGTON – Democratic presidential candidate Kamala Harris&#8217; campaign is dismissing accusations that&#8230;","url":"https://internewscast.com/local-news/harris-campaign-defends-against-plagiarism-accusations-expert-suggests-claims-are-valid/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Harris-campaign-calls-plagiarism-claims-a-partisan-700x430.jpg","video":null,"publish_date":"2024-10-17 00:09:19","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.459},{"id":259981658,"title":"Georgia judge blocks rule for hand counting ballots","text":"A Georgia judge has blocked a new rule requiring ballots submitted on election day to be counted by hand after polls close, marking a victory for Democrats and voting rights groups concerned about potential disruptions to the US presidential election.\n\nFulton County Superior Court Judge Robert McBurney issued his decision just a day after he ruled that county election officials must certify election results by the legal deadline, preventing any refusal to certify based on unfounded concerns of fraud. \n\nThe hand-count rule, introduced by the State Election Board, was intended to mandate that three poll workers manually count ballots after voting ended. \n\nHowever, McBurney ruled that the measure was introduced too late and lacked sufficient guidelines, training, or budget provisions, creating the risk of “administrative chaos” in an election just weeks away. \n\nThe rulings have been hailed by Democratic groups and the Harris campaign as crucial to ensuring the election runs smoothly and on time, especially as early in-person voting began in the state. \n\nThey argue that the hand-count rule was designed to delay election results and undermine confidence in the outcome, especially if former President Donald Trump were to lose to Vice President Kamala Harris in the upcoming presidential election. \n\nMcBurney’s rulings follow concerns that Trump-endorsed State Election Board rules could be used to block or delay certification, echoing the former president’s attempts to overturn the 2020 election results. \n\nThe judge emphasised that nothing in Georgia law permits county election officials to refuse certification or decide whether fraud has occurred, with their role limited to sharing concerns with the appropriate authorities.\n\nThe decision comes amidst a wave of lawsuits over new election rules passed by the State Election Board since August, further complicating the run-up to next month’s presidential election.\n\nGeorgia was one of the Trump campaign’s top targets for spurious lawsuits and false claims of widespread fraud after the former president lost it to Joe Biden in 2020, but their efforts came to nothing.\n\nTrump himself is facing a criminal indictment in the state over his efforts to pressure state officials to “find” enough votes to flip the state his way.","summary":"The ruling ensures election results will be certified on time, marking a victory for Democrats and voting rights groups who feared delays could undermine the election process. ADVERTISEMENT A Georgia judge has blocked a new rule requiring ballots submitted on election day to be counted by hand after polls close, marking a victory for Democrats &#8230;\n\n\nThe post Georgia judge blocks rule for hand counting ballots appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/europe/georgia-judge-blocks-rule-for-hand-counting-ballots/","image":"https://static.euronews.com/articles/stories/08/79/50/46/1200x675_cmsv2_2933ac80-55fc-5b3d-bd35-20d604ec2c46-8795046.jpg","video":null,"publish_date":"2024-10-17 00:08:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.32},{"id":259981920,"title":"Harris and Trump transition efforts reflect different approaches to governing","text":"WASHINGTON — In a drab office suite just blocks from the White House, seasoned political operatives are drawing up detailed plans for a government in waiting. Another identical suite in the same government building is dark and idle.\n\nVice President Kamala Harris and former President Donald Trump are running markedly different transition efforts to be ready for the potential responsibility of taking over the federal government. It’s a below-the-radar effort for now that will snap into sharp focus as soon as a winner is declared.\n\nBut already, their approaches speak to their divergent thinking about governing.\n\nHARRIS’ TRANSITION EFFORT IS GOING BY THE BOOK\n\nHarris’ team is being led by the former U.S. ambassador to the Association of Southeast Asian Nations. Yohannes Abraham served as executive director of the Biden-Harris transition in 2020 and is running a meticulous operation.\n\nThe team reached an agreement with the Biden administration to use government office space and other resources and to begin vetting potential key national security hires. As a precondition, the team released an ethics plan and promised to cap donations at $5,000 and release a list of donors.\n\nTrump, by contrast, has assembled a team of friends and family that includes former Democratic presidential candidates Robert F. Kennedy Jr. and Tulsi Gabbard, as well as his adult sons, Donald Trump Jr. and Eric Trump, and his running mate, JD Vance. It is being co-chaired by Cantor Fitzgerald CEO Howard Lutnick and Linda McMahon, the former wrestling executive who formerly led Trump’s Small Business Administration.\n\nTrump has thus far eschewed federal support for his transition team. His aides have yet to reach the required agreements with the General Services Administration, which manages federal property, and the White House on federal office space, technology support and security clearance procedures.\n\nWhile aides say they expect an agreement soon, others suspect it may only come after Election Day if Trump is victorious. Part of the holdup, according to a person familiar with the matter, who spoke on the condition of anonymity to discuss private deliberations, stems from the congressionally mandated ethics requirements and private contribution limits set by the Presidential Transition Act.\n\nThat act, which is meant to ensure that all major party nominees are ready to assume the presidency on Inauguration Day, calls on the GSA to secure an agreement with eligible candidates by Sept. 1 and for the White House to reach one by Oct. 1. Both dates have long passed.\n\nTrump reached similar agreements with the Obama administration in 2016 during his first White House run, but the law was modified after the 2020 election to put limits on private contributions to the transition effort and to tighten ethics rules.\n\nA Biden administration official said the White House “is actively working with the Trump transition team” to complete an agreement.\n\nTRUMP’S TRANSITION TEAM IS CHARTING ITS OWN COURSE\n\nEven if Trump isn’t following the government’s proposed roadmap, his transition work is moving forward. Their primary focus so far has been on personnel.\n\nA number of allied outside groups, including the America First Policy Institute, where McMahon serves as chair of the board, have spent years assembling policy guides, model executive orders and legislation aimed at giving future Republican administrations a head start.\n\nThe Heritage Foundation has also assembled extensive policy plans and a personnel database under its “Project 2025\" banner, but Trump has distanced himself from and criticized the effort as Democrats have seized on its more extreme proposals.\n\nTrump and his campaign are particularly distrustful of the current administration, accusing them of launching investigations and indictments in order to hobble his election chances.\n\nFollowing a pair of assassination attempts, Trump has accused President Biden of failing to provide him with sufficient Secret Service resources, forcing his campaign to reschedule and cancel rallies. Aides have also accused the administration of reacting too passively to ongoing threats against Trump from Iran.\n\nTrump’s transition co-chairs said in a statement that they expect to sign all the recommended memos of understanding soon.\n\nIn a statement, Lutnick and McMahon said that Trump-Vance transition attorneys “continue to constructively engage” with the Biden administration toward the required agreements, which they expect to sign. They said “any suggestion to the contrary is false and intentionally misleading.”\n\nThey also said all transition staff are required to sign their own ethics pledge.\n\nDELAYS COULD MAKE IT HARDER TO CONFIRM KEP PERSONNEL FOR TRUMP\n\nThe foot-dragging by Trump’s team has ramifications not only for the peaceful transfer of power but also potentially for national security.\n\nOnly after the agreements are in place can the transition team send the FBI the names of potential appointees so that the agency can begin the time-consuming process of vetting them for top-secret security clearances before Election Day.\n\nHarris’ team is well on its way to lining up agency review teams – teams of ex-government officials and policy experts who would do top-to-bottom assessments of federal agencies to determine how to align their activities with Harris’ agenda.\n\nIf she wins, Harris will run the first same-party presidential transition since 1989, when George H.W. Bush took over from Ronald Reagan.\n\nCustomarily, all the political appointees in the departing administration will be expected to offer their resignations so Harris can choose whom to retain and replace. The ability to retain officials could be an asset, especially if Republicans take control of the Senate. Keeping some officials who were already confirmed under Biden could limit messy personnel fights on Capitol Hill.\n\nTrump’s decision to delay participating in the federally supported transition program exposes his team and national security to risk, said Max Stier, CEO of the Partnership for Public Service, which offers nonpartisan advice on transition best practices.\n\nBy foregoing federal support now, Stier predicted, Trump as president-elect would have a more difficult time bringing staff on board and scaling up the massive enterprise needed to steer the government in a new direction.\n\nBecause of the delay, Trump is also missing out on top-of-the-line government cybersecurity support at a time when his campaign has already been the victim of a cyberattack by Iran.\n\nThe end result “is who’s going to be actually ready to keep us safe and run our government effectively,” Stier said.\n\nBOTH TRANSITION TEAMS ARE KEEPING THEIR HEADS DOWN FOR NOW\n\nFor all the differences between the Trump and Harris efforts, there are some common strategies: Neither team plans to make personnel decisions before Nov. 5. And both teams are lying low so as not to tempt fate or distract from their candidates ahead of Election Day.\n\n“There is no transition without a successful campaign, and that’s where the focus is,” a Harris transition spokesperson said on the condition of anonymity to discuss the matter. “Consistent with precedent and responsible best practice, the transition is laying the foundation to be ready.”\n\nLutnick, one of Trump’s transition co-chairs, told the Associated Press that he has been pulling together lists of candidates for Trump to consider. He said he doesn’t talk about the process with the notoriously superstitious former president.\n\n“What I do is paint. I consider myself a mosaic painter,” Lutnick said. “I go and find the greatest candidates for the role.” He said his goal is to find about “eight amazing candidates” who can win Senate confirmation for each job opening that he can later bring to Trump.\n\nHe said he’s following the model he used in rebuilding Cantor Fitzgerald after 9/11, when the investment banking company lost 658 employees, including top talent, in the attack on the World Trade Center. He said he learned from that experience that the best way to hire the best people was through word of mouth.\n\n“You go to world-class people who you know and say, ‘Help me. Send me people that you vouch for,’” he said.\n\nLutnik said this year’s operation is “about as different as possible” from the 2016 effort that was first led by former New Jersey Gov. Chris Christie. After he won, Trump fired Christie, tossed out his plans and gave the job to Vice President-elect Mike Pence.\n\nIn an interview with The Financial Times, Lutnick said he would steer clear of the Heritage Foundation’s Project 2025 transition work.\n\n“Project 2025 is an absolute zero for the Trump-Vance transition,” the billionaire told the paper. “You can use another term – radioactive.”\n\nDonald Trump Jr., who has not been involved in the team’s day-to-day work but is expected to step up his involvement after the election, has said he views his primary role as vetoing those who are not deemed loyal to his father’s agenda.","summary":"The vice president and former president are running markedly different transition efforts to be ready for the potential responsibility of taking over the federal government.","url":"https://www.centralmaine.com/2024/10/16/harris-and-trump-transition-efforts-reflect-different-approaches-to-governing/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/10/APTOPIX_Election_2024_Harris_33613.jpg?w=1000","video":null,"publish_date":"2024-10-17 00:07:04","author":"Zeke Miller And Jill Colvin,ZEKE MILLER and JILL COLVIN - Associated Press","authors":["Zeke Miller And Jill Colvin","ZEKE MILLER and JILL COLVIN - Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.109},{"id":259981614,"title":"Harris launches new push to win GOP support in Pennsylvania","text":"Harris launches new push to win GOP support in Pennsylvania\n The Harris campaign has started a new outreach push to target Republicans looking for an alternative to former President Donald Trump. Robert Costa reports.","summary":"The Harris campaign has started a new outreach push to target Republicans looking for an alternative to former President Donald Trump. Robert Costa reports.","url":"https://www.cbsnews.com/video/harris-launches-new-push-to-win-gop-support-in-pennsylvania/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/16/7b79e4ae-23bb-473f-8927-3fc867be598c/thumbnail/1200x630/171d02d3b665c68c25351121106d2729/1016-en-costa.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":null,"publish_date":"2024-10-17 00:06:00","author":null,"language":"en","source_country":"US","sentiment":0.12},{"id":259981622,"title":"Trump claims to be the \"father of IVF\"","text":"Trump claims to be the \"father of IVF\"\n In an all-female town hall Tuesday night, former President Donald Trump made several false and strange statements, including that he was the \"father of\" in vitro fertilization. Nikole Killion reports on how his campaign is responding to his claims.","summary":"In an all-female town hall Tuesday night, former President Donald Trump made several false and strange statements, including that he was the \"father of\" in vitro fertilization. Nikole Killion reports on how his campaign is responding to his claims.","url":"https://www.cbsnews.com/video/trump-claims-to-be-the-father-of-ivf/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/16/dd20c5a2-bf81-4a71-88f6-400b241c4e7b/thumbnail/1200x630/05bd5c8e3695a3466e47101c92271635/1016-en-killion.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":null,"publish_date":"2024-10-17 00:06:00","author":null,"language":"en","source_country":"US","sentiment":-0.664},{"id":259981262,"title":"California commission that approves rocket launches is anti-Elon Musk, claims SpaceX lawsuit","text":"Elon Musk‘s SpaceX rocket company has sued the California Coastal Commission, alleging in federal court that the panel’s members are biased because of the billionaire owner’s conservative political views, according to papers obtained Wednesday.\n\nThe lawsuit, filed Tuesday in Los Angeles, alleges “unconstitutional overreach” by the commission after members criticized Musk’s political leanings during a meeting about whether to approve more frequent SpaceX launches off the California coastline.\n\n“Rarely has a government agency made so clear that it was exceeding its authorized mandate to punish a company for the political views and statements of its largest shareholder and CEO,” SpaceX alleges in the 45-page lawsuit.\n\nMusk contends the commission, which regulates the use of land and water in the state’s coastal zone, unfairly asserted its powers by rejecting an application by the U.S. Space Force on behalf of SpaceX to increase the number of annual Falcon 9 rocket launches from 36 to 50 at the Vandenberg Space Force Base.\n\nFalcon 9 is a reusable, two-stage rocket designed and manufactured by SpaceX for the safe transport of people and payloads into Earth orbit and beyond, according to the company’s website.\n\nA request for comment left with a spokesperson for the California Coastal Commission was not immediately answered.\n\nThe lawsuit accuses the commission of violating the First Amendment’s protection against government discrimination based on political speech.\n\nMusk reportedly gave a pro-Donald Trump super PAC at least $75 million for Trump’s presidential re-election bid. Musk has also appeared on the campaign trail with Trump this year.\n\nIn July, Musk threatened to relocate SpaceX’s Hawthorne headquarters to Texas over a California law signed by Gov. Gavin Newsom that prohibits schools from informing parents if their child changes gender identity.","summary":"The company is alleging in federal court that the commission's members are biased because of the billionaire owner's conservative political views.","url":"https://www.ocregister.com/2024/10/16/california-commission-that-approves-rocket-launches-is-anti-elon-musk-claims-spacex-lawsuit/","image":"https://www.ocregister.com/wp-content/uploads/2024/09/OCR-Z-TESLA-MUSK.jpg?w=1024","video":null,"publish_date":"2024-10-17 00:05:39","author":"City News Service","authors":["City News Service"],"language":"en","source_country":"US","sentiment":0.013},{"id":259981586,"title":"Kamala Harris’ Fox News Interview Opens With Testy Exchange and Interruptions From Host","text":"Vice President Kamala Harris opened her first interview on Fox News with a heated exchange with host Bret Baier on Wednesday evening, as he repeatedly interrupted her answer to his question regarding the Biden administration’s handling of what he called “illegal” migrants at the U.S.-Mexico border.\n\n “How many illegal immigrants would you estimate your administration has released into the country over the last three and a half years?” the Special Report with Bret Baier host asked the vice president at the top of the one-on-one interview.\n\n Harris thanked him for the question because, she said, it’s an important matter for a number of voters. She then told Baier, “You know what I’m going to talk about” before she was interrupted by the host, who demanded an estimate from the presidential candidate. \n\n “But do you — just — a number. Do you think it’s 1 million? 3 million?” he asked.\n\n “Brett, let’s just get to the point,” Harris responded.\n\n The two continued to spar as Harris attempted to answer the question, which is a top issue for many in this election cycle, but the Fox News host refused to allow her to speak. \n\n “You have to let me finish,” she said at one point, evoking her famous shut-down of Mike Pence’s interruptions during the 2020 vice presidential debate when she told him, “I’m speaking.”\n\n Later, Harris was asked a question that very few Americans likely care about this election cycle when he questioned if she supports “using taxpayer dollars to help prison inmates or detained illegal aliens to transition to another gender.” She answered in the affirmative on the matter when filling out a questionnaire as a senator and has become a talking point of conservatives as Harris comes within reach of the presidency. \n\n “I will follow the law, and it’s a law that Donald Trump actually followed, you’re probably familiar with it now,” Harris said. “It’s a public report that under Donald Trump’s administration, these surgeries were available on a medical necessity basis to people in the federal prison system.”\n\n As the interview closed, Harris touched on her rival’s harsh statements about and insults toward U.S. military personnel and commented on the one-sided nature of the interview with the Fox host.\n\n “I would like that we would have a conversation that is grounded in a full assessment of the facts,” Harris told Baier. “This interview is supposed to be about the choices that your viewers should be presented about this election, and the contrast is important.”\n\n It was questioned why Harris would bother with a sit-down interview at Fox News, whose bias toward the GOP and blatant distortion of facts has become notorious and gotten them nearly sued into oblivion. Why this is was made abundantly clear during their first interview with a Democratic presidential candidate in eight years on Wednesday. Ahead of the interview, her spokesman told the Associated Press why the campaign was giving it a shot.\n\n Harris campaign spokesman Ian Sams told the outlet, “The vice president, Governor Walz and our campaign believe it is important to speak to all Americans, wherever they are getting their information or entertainment, so they can hear directly from us — not through a filter — who Vice President Harris is, what she stands for and what she’s running to do.”","summary":"The vice president again had to ask to be allowed to finish her answer, this time to a baiting question about the number of \"illegal\" immigrants the Biden administration let cross the border.","url":"https://www.hollywoodreporter.com/news/politics-news/kamala-harris-fox-news-interview-bret-baier-1236033741/","image":"https://www.hollywoodreporter.com/wp-content/uploads/2024/10/Kamala-Harris-Fox-news-interview-publicity-H-2024.jpg","video":null,"publish_date":"2024-10-17 00:04:19","author":"Kevin Dolak","authors":["Kevin Dolak"],"language":"en","source_country":"US","sentiment":-0.335},{"id":259981772,"title":"'Illegal, unconstitutional and void': Georgia judge strikes down new election rules after legal fights","text":"A Georgia judge struck down several rules recently passed by the State Elections Board (SEB) on Wednesday, measures that were a subject of fierce debate between Trump and Harris surrogates in the key battleground. Fulton County Superior Court Judge Thomas A. Cox ruled the new provisions \"illegal, unconstitutional and void\" in an opinion released Wednesday evening, according to multiple outlets. It comes hours after he weighed two lawsuits on the rules – one led by the Georgia Democratic Party, and a second by civil rights groups which also included current and former GOP state officials. One of the measures – a requirement for all ballots to be hand counted by three county election officials after they had been machine tabulated to ensure the totals match – has become a political lightening rod in recent weeks. GEORGIA GOP CHAIR SHARES 2-PRONGED ELECTION STRATEGY AS TRUMP WORKS TO WIN BACK PEACH STATE That rule was temporarily blocked in a separate ruling made Tuesday night challenging the SEB’s new measures. Fulton County Superior Court Judge Robert McBurney did not take issue with the rule’s intent but argued it would be untenable to implement at this late stage. Cox’s ruling invalidates that measure, while also invalidating a rule directing county officials to conduct a \"reasonable inquiry\" before certifying election results, and giving them the ability \"to examine all election related documentation created during the conduct of elections.\" TRUMP VS HARRIS ROUND 2? VOTERS IN KEY GA COUNTY REVEAL IF THEY WANT SECOND DEBATE Cox also blocked new signature and photo ID requirements for people dropping off absentee ballots for others. The rules were passed last month in a 3-2 vote by the Republican majority on the elections board. Democrats had accused the GOP officials of trying to sow doubt and chaos in the elections process, while supporters of the rule changes said they were necessary guardrails to ensure voter confidence. In the wider-ranging of the two cases on Wednesday, led by Eternal Vigilance Action, a group founded by former GOP state legislator Scot Turner, the plaintiffs argued the SEB was out of its scope of authority in levying the new rules. \"Three members of the state election board, kind of like Napoleon, they put a crown on their head and say, ‘We are the emperors of election,’\" the plaintiffs’ lawyer said. \"No, that is not the way our system of government works.\" GEORGIA DEMS CHAIR REVEALS MESSAGE TO UNDECIDED GOP VOTERS AS HARRIS WORKS TO BUILD BROAD BASE But the defendants and supporting groups, including attorneys for the Georgia Republican Party, argued the state’s General Assembly gave the SEB the scope to craft such rules. \"They don't say which one of those statutes should be found unconstitutional because, remember, to rule in favor of the plaintiffs here, you're going to have to find that the General Assembly's grant of authority to the agency was unconstitutional,\" said a lawyer for the GOP. \"They don't say which one of the three powers we have that they violated, could be all three of them, could be one of the three. And if it's a constitutional challenge, you can't have something that's that vague to bring into a court to ask you to declare it to be unconstitutional.\" CLICK HERE TO GET THE FOX NEWS APP Both former President Donald Trump and Vice President Kamala Harris’ campaigns have dedicated significant time and resources to Georgia, which President Biden won by less than 1% in 2020. Harris’ campaign lauded the Tuesday ruling that blocked the hand-counting ballots rule, declaring, \"Our democracy is stronger thanks to this decision.\" Fox News Digital reached out to both the Trump and Harris campaigns for comment. The Associated Press contributed to this report.","summary":"A Georgia judge struck down an array of rules passed by the GOP-majority State Elections Board last month.","url":"https://www.foxnews.com/politics/illegal-unconstitutional-void-georgia-judge-strikes-down-new-election-rules-after-legal-fights","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/georgia-harris-trump.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-17 00:00:02","author":"Elizabeth Elkind","authors":["Elizabeth Elkind"],"language":"en","category":"politics","source_country":"US","sentiment":-0.253},{"id":259981712,"title":"Trump Didn't Seem to Care Much About Fainting Audience Members: \"It's Ok. We Lose Weight\"","text":"During a recent town hall in Oaks, Pennsylvania, Donald Trump had to pause his speech midway after a few attendees fainted due to excessive heat. Trump made several remarks about the situation, but based on his comments, it was surprising to see that he didn’t seem particularly concerned about the fainting attendees. Later in the event, Trump also paused the Q&A session and shifted the atmosphere by playing music.\n\nAs the first person received medical attention, Trump took a moment to thank both the early-arriving rally-goers and the doctors on hand. However, after the second person fainted, Trump paused his speech and said, \"Personally I enjoy this, you know. We lose weight. We can do this, lose four or five pounds, it's OK with me.\" Noem added to this, \"Kamala Harris isn't doing this.\" Trump laughed at Kristi Noem's joke about the building not having an air conditioner, agreeing that in today’s economy, it wouldn't be affordable. As reported by Newsweek, Trump then questioned, \"Would anybody else like to faint? Please raise your hand.\"\n\nTrump later requested to open the doors of the hall to let in some air but was informed that it wasn't possible due to security concerns. He then informed everyone present that both the people receiving treatment were doing fine. However, rather than going back to the Q&A session, Trump transformed the event into an unplanned musical concert. He began with one of his favorite songs, Luciano Pavarotti's Ave Maria. For the next 40 minutes, the former president swayed to the music on stage while some attendees began to leave early, as reported by The Independent.\n\nAccording to a Trump representative, the former president turned the town hall event into a musical concert to lighten everyone's mood and make them feel more joyful. Another Trump spokesman, Steven Cheung, commented on Twitter, attributing the fainting to the audience's sheer excitement. At the Pennsylvania town hall, he described the scene as a \"total lovefest\". Similar opinions regarding the incident were later expressed by Trump on his Truth Social platform. He wrote, \"We started playing music while we waited, and just kept it going. So different, but it ended up being a GREAT EVENING!\"\n\nMeanwhile, Kamala HQ, the rapid-response team for Harris's campaign, didn’t hold back on their critique. They claimed that Trump was looking lost, confused, and frozen on stage. Democrat Eric Swalwell, D-Calif., also shared his thoughts on X (formerly Twitter). He termed the situation \"sad\" for the former president and offered his sympathies. He continued by saying that Trump appeared to be \"brain dead\" and he urged his family to intervene and get him some assistance. Trump's aides, however, presented a different image. They maintained that his move had delighted the crowd in the swing state. According to USA Today, they said that Harris and the Democrats were taking cheap shots as they were afraid of losing.","summary":"“It ended up being a GREAT EVENING,” Donald Trump wrote about his Monday’s town hall in Oaks, Pennsylvania.","url":"https://www.inquisitr.com/trump-didnt-seem-to-care-much-about-fainting-audience-members-its-ok-we-lose-weight","image":"https://dab57h0r8ahff.cloudfront.net/720305/uploads/0c50f2b0-8b79-11ef-8336-d7d9a2f090cd_1200_630.jpeg","video":null,"publish_date":"2024-10-17 00:00:00","author":"INQUISITR,Simran Kumari","authors":["INQUISITR","Simran Kumari"],"language":"en","source_country":"US","sentiment":-0.044},{"id":259981272,"title":"Harris distances herself from Biden, bashes Trump in tense Fox News interview","text":"On whether she owes an apology to the families of three women killed by undocumented immigrants:\n\n\"I think we've had a broken immigration system, transcending, by the way, Donald Trump's administration — even before. Let's all be honest about that. I have no pride in saying that this is a perfect immigration system. I've been clear. I think we all are that it needs to be fixed.\"\n\nOn a new Trump ad about taxpayer dollars being used for gender reassignment\n\n\"I think [Trump] spent $20 million on those ads, trying to create a sense of fear in the voters, because he actually has no plan in this election that is about focusing on the needs of the American people. $20 million, on that ad, on an issue that as it relates to the biggest issues that affect the American people, is really quite remote. And again, his policy was no different.\"\n\nOn ways she is different from Biden\n\n\"I represent a new generation of leadership. I, for example, am someone who has not spent the majority of my career in Washington, DC. I invite ideas, whether it be from the Republicans who are supporting me, who were just on stage with me minutes ago, and the business sector, and others who can contribute to the decisions that I make.\"\n\nOn Trump's rhetoric to voters\n\n\"He's the one who talks about an enemy within, within, an enemy within, talking about the American people. Suggesting he would turn the American military on the American people. You and I both know that he has talked about turning the American military on the American people. He has talked about going after people who are engaged in peaceful protest. He has talked about locking people up because they disagree with him. This is a democracy, and in a democracy, the President of the United States, in the United States of America, should be willing to be able to handle criticism without saying he would lock people up for doing it.\"\n\nOn whether Trump is fit to serve as president\n\n\"Over the last decade, it is clear to me and certainly the Republicans who are on stage with me, the former chief of staff to the president, Donald Trump, former defense secretaries, national security adviser and his vice president, one, that he is unfit to serve, that he is unstable, that he is dangerous. And that people are exhausted with someone who professes to be a leader who spends full time demeaning and engaging in personal grievances and it being about him and American people.\"","summary":"Democratic presidential nominee Kamala Harris bashed Donald Trump in a tense interview with Fox News anchor Bret Baier while distancing herself from Joe Biden.","url":"https://www.cnbc.com/2024/10/16/harris-trump-biden-fox-news-interview.html","image":"https://image.cnbcfm.com/api/v1/image/108043823-1728221671355-gettyimages-2175885786-AFP_36JA973.jpeg?v=1729121241","video":null,"publish_date":"2024-10-16 23:59:46","author":"Kevin Breuninger","authors":["Kevin Breuninger"],"language":"en","category":"politics","source_country":"US","sentiment":-0.03},{"id":259980944,"title":"Harris’ interview with Fox News is marked by testy exchanges over immigration and more","text":"WASHINGTON (AP) — Vice President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy positions while asserting that if elected, she would not represent a continuation of Joe Biden’s presidency.\n\nHarris’ interview with Fox’s Bret Baier marked her first foray onto the network, which is popular with conservative viewers, as she looked to broaden her o utreach to GOP-leaning voters with less than three weeks until Election Day. Her nearly-30 minute sitdown with Baier repeatedly grew heated, with the two talking over each other, as he pressed her on immigration and her changing policy stances since her first run for president in 2020.\n\nWhen Baier kept talking as Harris tried to respond to his challenges on immigration, Harris told him, “May I please finish. … You have to let me finish please.”\n\nHarris tried repeatedly to pivot the conversation to attacking Donald Trump. But she also had plenty to say about herself.\n\nA week after saying she couldn’t think of any move made by Biden that she would have done differently, Harris asserted that “My presidency will not be a continuation of Joe Biden’s presidency.”\n\nHarris did not offer specifics, but said, “Like every new president that comes into office, I will bring my life experiences, and my professional experiences and fresh and new ideas.”\n\nAsked to clarify her assertion that she wants to “turn the page,” though Democrats currently hold the White House, Harris said she is running on “turning the page from the last decade in which we have been burdened with the kind of rhetoric coming from Donald Trump.”\n\nOn immigration, Harris expressed regret over the deaths of women who were killed by people who were detained and then released after crossing into the U.S. illegally during the Biden administration, but she criticized Trump for his role in blocking a bipartisan immigration bill earlier this year that would have boosted border funding.\n\n“I am so sorry for her loss, sincerely,” Harris said after Baier played footage of the mother of Jocelyn Nungaray blaming Biden and Harris for her daughter’s death.\n\nHarris indicated she no longer supports decriminalizing crossing the border illegally, as she did in 2019.\n\n“That was five years ago and I am very clear that I will follow the law,” she said. She gave the same answer about proposals to allow those in the U.S. illegally to get driver’s licenses and subsidized healthcare.\n\nOf Trump, she said, “People are exhausted with someone who professes to be a leader and who spends full time demeaning and engaging in personal grievances.” She added, “He’s not stable.”\n\nShe also sought to focus Fox viewers on Trump’s talk of “the enemy within” and threats to punish political rivals.\n\nBaier challenged Harris over her attestations to Biden’s mental stamina after his disastrous debate with Trump in June that forced his exit from the 2024 presidential race and her elevation to the top of the ticket. She again defended Biden, but added, “Joe Biden is not on the ballot and Donald Trump is.”\n\nTrump’s campaign spokesperson Karoline Leavitt said Harris was “angry, defensive, and once again abdicated any responsibility for the problems Americans are facing.” She added, that if “Kamala can’t handle the pressure of an interview with Fox News—she certainly can’t handle the pressure of being president of the United States.”\n\nPushing back against Baier’s line of questioning at times, Harris at one point told her interviewer, “I would like if we could have a conversation that is grounded in a full assessment of the facts.”\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — Vice President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy...","url":"https://wsvn.com/news/politics/harris-interview-with-fox-news-is-marked-by-testy-exchanges-over-immigration-and-more/","image":"https://wsvn.com/wp-content/uploads/sites/2/2024/10/241013_Kamala_Harris_North_Carolina_rally.png","video":null,"publish_date":"2024-10-16 23:58:07","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.364},{"id":259981022,"title":"Newspaper headlines: ‘Bogus £40bn black hole’ and ‘Tuchel takes hotseat’","text":"I paper Thursday’s national newspaper front pages were sent out before news broke of the death of One Direction star Liam Payne in Argentina. “Benefits to rise £1.50 a week” the I reports on its front page, adding that Chancellor Rachel Reeves faces a “Labour backlash”. The paper says Reeves is under pressure to restructure the system for calculating benefits. It also features a picture of England’s new manager, Thomas Tuchel, with the caption “2026 trophy success” is his only goal. The Times “Reeves will raise capital gains tax on share sales,” reports The Times. The paper quotes a source saying that the revenue from increasing capital gains tax would be in the “low billions”. A picture of Kate Moss, at the Victoria’s Secret catwalk show in New York, is also leading the front with the caption “winging it”. Daily Express The Daily Express leads on the Budget , saying Reeves is “accused over ‘bogus’ £40 billion black hole”. It reports that senior Tories have said that the chancellor is inventing the shortfall to justify “hammering taxpayers”. Daily Mail The Daily Mail also leads on more Budget criticism with the headlines “business fury at Reeves plan” and “bosses warn it would hit jobs and pay”. It adds that both the chancellor and the prime minister have “insisted the rise would not break Labour’s manifesto pledge”. It also carries a “royal world exclusive” that “Harry and Meghan buy a seaside home in Portugal”. Daily Telegraph Reeves is “poised to launch the biggest Budget tax raid in history”, reports The Daily Telegraph. It is also running with a repoert that Russia is suspected of placing an incendiary device on a plane to the UK. British counter-terrorism police are “investigating after the parcel containing the device caught fire”, it reports. Guardian “Russia suspected after device put on flight caused UK warehouse fire” is the splash on The Guardian. The paper says an inquiry is looking at whether spies planted the parcel to explode mid-air. A large picture of Thomas Tuchel is also on the front, with the caption “Tuchel takes hotseat as England manager”. Metro “Devastating” the Metro front page reads alongside a picture of a badly damaged block of flats in Newcastle. It reports a seven-year-old boy died and six more people were taken to hospital after a blast tore through a row of six properties divided into two flats each. The paper says a gas leak is suspected of causing the explosion. Daily Mirror “Beyond a joke” is the headline on the Daily Mirror front page. It carries an allegation that a black crew member quit Mrs Brown’s Boys after Brendan O’Carroll made an “n-word gag”. Financial Times “Advent primes bid for Tate and Lyle” says the Financial Times. The US-based firm is preparing a takeover offer that would acquire the London-listed group, it says, with an offer expected to exceed £2.8bn. It also reports that Donald Trump received a campaign “boost” as Elon Musk donated $75m and “more graduates vie for fewer jobs” as AI makes it easier to apply for jobs at speed. The Sun The Sun splashes on Tuchel news, with the headline “there’s a trophy missing in the England cabinet”. It reports that the German football manager says he wants to help the England team win more trophies and bag the 2026 World Cup. Daily Star “You are ‘aving a giraffe!” is the headline that leads the Daily Star. The paper reports that actor Danny Dyer keeps toilet roll in his fridge to “protect his delicate bottle and glass”.","summary":"I paper Thursday&#8217;s national newspaper front pages were sent out before news broke of the death of One Direction star Liam Payne in Argentina. &#8220;Benefits to rise £1.50 a week&#8221; the I reports on its front page, adding that Chancellor Rachel Reeves faces a &#8220;Labour backlash&#8221;. The paper says Reeves is under pressure to restructure &#8230;\n\n\nThe post Newspaper headlines: &#8216;Bogus £40bn black hole&#8217; and &#8216;Tuchel takes hotseat&#8217; appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/newspaper-headlines-bogus-40bn-black-hole-and-tuchel-takes-hotseat/","image":"https://ichef.bbci.co.uk/news/1024/branded_news/6ef9/live/22c2e210-8c0f-11ef-b6b0-c9af5f7f16e4.jpg","video":null,"publish_date":"2024-10-16 23:57:04","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":-0.152},{"id":259981194,"title":"Kamala Harris Dodges Questions About Involvement in Concealing Biden’s Cognitive Decline in Intense Fox News Interview","text":"KAMALA Harris has swerved questions about President Joe Biden’s reported cognitive decline in a fiery sit-down interview with Fox News.\n\nThe presidential hopeful spoke with Bret Baier in a 30-minute prime-time segment.\n\nBaier came in hot, immediately grilling Harris about immigration, transgender issues, and how she would distinguish herself from Biden.\n\nToward the end of the interview, he questioned, “When did you first notice that President Biden’s mental faculties appeared diminished?”\n\nHarris mumbled about Biden’s “experience and judgment” before stopping the answer short by saying “Joe Biden isn’t on the ballot.”\n\n“I think the American people have a concern about Donald Trump,” she said in a glaring deflection.\n\n“People who worked for him […] have said he is unfit and dangerous and should never be president of the United States ever again.”\n\nThe surprising response came after Baier criticized her for how she described a past president who almost half of the population wish to see return to the White House, according to polls.\n\n“Are they misguided the 50%? Are they stupid?” he said.\n\n“Oh God, I would never say that about the American people.” the vice president responded in a shocking U-turn.\n\nWhen questioned about immigration, Harris admitted that the system was “flawed.”\n\nThe two debated the hot-button issue, with Baier bringing up crimes committed by illegal immigrants, like the murder of Rachel Morin.\n\n“Those are tragic cases. There’s no question about that,” Harris responded.\n\n“We need more judges. We need to process these cases faster.”\n\nBaier pressed her on her previous statements where she supported decriminalizing illegal border crossing, but she shut him down and reversed her stance.\n\n“I do not believe in decriminalizing border crossings,” she said.\n\nBaier also grilled Harris on her support of transgender inmates getting gender-reassignment surgery.\n\nHarris simply said she wishes to follow federal law, which, under Trump, allowed for several prisons to provide gender-affirming treatments, The New York Times reported.\n\nThe vice president was questioned about her struggle to distinguish herself from Biden, to which she said she was a “new generation of leadership.”\n\n“My presidency will not be a continuation of Joe Biden’s presidency,” she said.\n\nShe went on to tout her plan for a $25,000 tax credit given to first-time homebuyers and a $50,000 tax break for small business owners.\n\nHarris continually bashed Trump despite being questioned about her current role in the White House and slammed the former president for bringing her “personal grievances” into politics.\n\n“People are tired of that,” she said.\n\n‘FUNDAMENTALLY FLAWED’\n\nIn an analysis exclusively given to The U.S. Sun, political commentator Gianno Caldwell blasted Harris for using “every attempt to dodge Bret Baier’s questions.”\n\n“Her sales pitch to the American people is fundamentally flawed,” Caldwell, an analyst who founded a bipartisan political consulting firm, said.\n\n“If she has all of these great ideas, why hasn’t she implemented them over the last three-plus years?”\n\nCaldwell said Harris’ performance showed she “isn’t a presidential candidate who will serve with conviction and honesty.\n\n“Her attempts before millions of Americans failed to show a vision for Americans who are suffering over an economy, border, or inflation she created as a partner with Joe Biden or her tie-breaking vote for the $1.9T American Rescue Plan,” he said.\n\nCaldwell said America does not have the budget to back Harris’ policies.\n\n“Democrat economists warned her it would cause inflation, and it did.\n\n“That’s who Kamala Harris is and would govern as president. We cannot afford that as a country.”\n\nMEDIA BLITZ\n\nHarris’ interview comes in the midst of a media blitz to make a last-minute appeal to voters.\n\nLast week, she sat down with Stephen Colbert for the Late Show to guzzle a beer and slam Trump for “gaslighting Americans.”\n\nAnd days earlier, she made the bizarre choice to record an episode of Alex Cooper’s podcast Call Her Daddy, despite the show’s racy history.\n\nThe U.S. Sun previously spoke with a political expert who analyzed Harris’ appearances and said he didn’t believe they would sway voters.\n\n“It’s not enough just to show up on these platforms,” Matt Terrill, former chief of staff for Marco Rubio’s presidential campaign, warned.\n\n“Voters care about substance, and what voters care about right now is: ‘Where do these candidates stand?’\n\n“And, what is their plan on affordability – namely housing, healthcare, food, and fuel?\n\n“Where do they stand, and what is their plan for border security?”\n\nHarris has struggled to distinguish her vision for America from President Joe Biden’s, but last month, she boldly said she offers “a new generation of leadership.”\n\n“My focus is very much on what we can do over the next 10, 20 years to catch up to the 21st century again.\n\n“Americans want a leader who brings us together as Americans and not someone who professes to be a leader who is trying to have us point our fingers at each other.”\n\nStill, Americans appear to be almost evenly divided between Harris and Trump as Election Day nears.\n\nThe latest polling from FiveThirtyEight showed Harris ahead of Trump by just over two percentage points.\n\nBut the polls have not yet been updated following her Fox News appearance.","summary":"KAMALA Harris has swerved questions about President Joe Biden&#8217;s reported cognitive decline&#8230;","url":"https://internewscast.com/news/kamala-harris-dodges-questions-about-involvement-in-concealing-bidens-cognitive-decline-in-intense-fox-news-interview/","image":"https://internewscast.com/wp-content/uploads/2024/10/Kamala-Harris-refuses-to-answer-questions-about-her-role-in-800x430.jpg","video":null,"publish_date":"2024-10-16 23:55:07","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.428},{"id":259981616,"title":"How Trump's campaign is explaining his \"father of IVF\" comments","text":"How Trump's campaign is explaining his \"father of IVF\" comments\n Former President Donald Trump spoke about in vitro fertilization during a Fox News town hall with an all-female audience that aired Wednesday. Vice President Kamala Harris also spoke with Fox News in an interview that aired the same day, as both campaigns seek to drive voter turnout 20 days before Election Day. CBS News senior White House and political correspondent Ed O'Keefe reports.","summary":"Former President Donald Trump spoke about in vitro fertilization during a Fox News town hall with an all-female audience that aired Wednesday. Vice President Kamala Harris also spoke with Fox News in an interview that aired the same day, as both campaigns seek to drive voter turnout 20 days before Election Day. CBS News senior White House and political correspondent Ed O'Keefe reports.","url":"https://www.cbsnews.com/video/how-trumps-campaign-explaining-father-ivf-comments/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/10/16/f6e3e851-b52e-4a38-be3f-05df799ad4c0/thumbnail/1200x630/d2009638d5a27d053da366f8941ca2ad/cbsn-fusion-how-trumps-campaign-explaining-father-ivf-comments-thumbnail.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":null,"publish_date":"2024-10-16 23:54:00","author":null,"language":"en","category":"politics","source_country":"US","sentiment":-0.138},{"id":259982612,"title":"Harris’s risky Fox interview turns combative over immigration and Biden’s health","text":"The 25-minute sitdown with anchor Bret Baier was contentious from start to finish in what amounted to one of the first times the vice president has given an interview on an adversarial network.\n\nThe interview was dominated by immigration, with Harris repeatedly sidestepping questions from how many illegal immigrants she estimates the Biden administration has released into the country to whether she and Biden regret repealing former President Donald Trump‘s “Remain in Mexico” policy, which forced most asylum-seekers to wait outside the United States for their applications to be processed.\n\n“You have to let me finish,” Harris told Baier during one of several interruptions as she discussed immigration proposals Biden had put forward while in office.\n\nAt another point, Baier asked Harris whether she and Biden owed the families of Rachel Morin, Jocelyn Nungaray, and Laken Riley, three women allegedly killed by illegal immigrants, an apology for their policies.\n\n“I can’t imagine the pain that the families of those victims have experienced for a loss that should not have occurred,” Harris said.\n\nAlthough Harris acknowledged the families’ loss, she did not respond to a question about when she recognized the border situation was a crisis.\n\n“We’ve had a broken immigration system, transcending, by the way, Donald Trump’s administration, even before,” she said. “Let’s all be honest about that. I have no pride in saying that this is a perfect immigration system. I’ve been clear.”\n\nThe second section of the interview covered Harris’s past policy positions, including whether illegal border crossings should be decriminalized, a stance she held during her 2020 presidential campaign.\n\n“I do not believe in decriminalizing border crossings, and I’ve not done that as vice president,” she said. “I will not do that as president.”\n\nWith the campaign being amplified by television ads, Harris was also asked about her support for taxpayer-funded sex reassignment surgeries for prisoners in 2019, a position that Trump has highlighted in battleground TV spots.\n\n“I will follow the law, and it’s a law that Donald Trump actually followed,” she said. “That ad is a little like throwing stones when you live in a glass house.”\n\nIn another standout moment, Harris was pushed for the third time in the past week to distinguish herself from Biden, as a majority of voters tell pollsters the country is headed in the wrong direction. Last week, Harris did not have a reaction prepared when she was posed the same question by ABC’s The View.\n\n“Let me be very clear: My presidency will not be a continuation of Joe Biden’s presidency,” she said. “I will bring my life experiences, my professional experiences, and fresher, new ideas. I represent a new generation of leadership.”\n\nBaier additionally asked Harris when she first understood Biden was having problems because of his age and mental acuity. Harris has publicly remained loyal to Biden, despite replacing him as the 2024 Democratic presidential nominee this summer.\n\n“Joe Biden, I have watched from the Oval Office to the Situation Room, and he has the judgment and the experience to do what he has done,” she said.\n\nThe wide-ranging interview covered the economy and foreign policy, too, with Harris defending the Biden administration’s posture toward Tehran and her assessment during last week’s CBS 60 Minutes interview that Iran is the country’s “greatest adversary.”\n\nHarris’s interview on a right-leaning network comes after she appeared earlier Wednesday in Pennsylvania where George Washington crossed the Delaware River during the American Revolutionary War, with more than 100 Republicans, including former Illinois Republican Rep. Adam Kinzinger, in attendance.\n\nIn an address that appealed to patriotism and national unity, Harris spoke about putting country over party and told pro-rule-of-law Republicans, “There is a place for you in this campaign.” The vice president also reiterated her criticism of Trump for warning of “the enemy from within” in a recent interview.\n\nImportantly, her Wednesday campaign stop was also in Bucks, one of Pennsylvania’s most competitive counties. Biden won it by 4 percentage points in 2020, former Secretary of State Hillary Clinton by less than a point in 2016, and former President Barack Obama by about 2 points in 2012.\n\nCLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINER\n\nHarris is appealing to Republicans to make up for a lack of support among minority voters who have traditionally cast ballots for Democrats, including black and Latino men, with events this month with former Wyoming Republican Rep. Liz Cheney and Arizona Republicans in Scottsdale.\n\nMeanwhile, Trump appeared on Fox News earlier Wednesday to pitch himself to female voters during a female-only town hall. A Trump interview with Univision is scheduled to be broadcast later Wednesday night.","summary":"Vice President Kamala Harris was grilled over her shifting views on immigration and relationship with President Joe Biden during a Wednesday interview with Fox News. The 25-minute sitdown with anchor Bret Baier was contentious from start to finish in what amounted to one of the first times the vice president has given an interview on [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3192119/harris-fox-interview-immigration-biden-health/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Baier-Harris.webp","video":null,"publish_date":"2024-10-16 23:52:08","author":"Naomi Lim","authors":["Naomi Lim"],"language":"en","category":"politics","source_country":"US","sentiment":-0.48},{"id":259980602,"title":"Donald Trump makes his view on abortion clear for everyone in the US at Georgia Town Hall","text":"Donald J. Trump, one time big city Democrat has come out as the social moderate he’s always been.\n\nIn a Fox News “Town Hall” that aired Wednesday morning, Trump sat down with Harris Faulkner and a group of friendly female voters in Georgia to help boost his appeal to the crucial demographic.\n\nIn a recent Fox News poll Kamala Harris is ten points ahead of Trump among women.\n\nSure, he’s been cast by the left as a Handmaiden’s villain, but his positions on abortion – much to the chagrin of Republican Pro Life wing – are nuanced.\n\nThe 45th president — who appointed three Supreme Court Justices who voted to overturn Roe v Wade, which sent the issue of abortion back to the states — said some state abortion bans are “too tough.” And that he supports exceptions for “rape, incest, life of the mother.”\n\nIn his own hyperbolic Trumpian vernacular, he declared his unequivocal support for In vitro Fertilization, by calling himself “the father of IVF.”\n\nTrump defies easy characterization – remember he remade the Republican Party in his likeness (for better or for worse).\n\nAnd it was important for him to at least answer these questions from real women. The GOP has struggled with their messaging a post-Roe world, and it’s allowed the left to doggedly pursue female voters using fear mongering messaging about reproductive rights – frequently twisting the truth.\n\nWhy else would Tim Walz lie and lie about him and his wife using IVF?\n\nThe Town Hall also tackled other topics, like border safety, the economy and child care costs. Because women aren’t just single issue voters who eat pro-abortion slogans for breakfast.\n\nWe care about the cost of housing and sky high grocery bills. We worry we have so many unvetted illegal immigrants in the country, sucking away government resources and a sense of security and safety (even as ABC host Martha Raddatz poo poos this concern). We worry that the left has allowed biological men into female spaces.\n\nOne woman asked Trump what he’d do about keeping trans athletes out of girl’s sports.\n\nHe said, “You just ban it.” which is a great slogan but hardly a viable path to action.\n\nIt is, however, refreshing for a candidate to at least acknowledge that biological men do not belong in women’s sports.\n\nMany on the left simply don’t have the cojones to take this obvious position and call out truths that until maybe eight years ago would have been pretty banal.\n\nIt’s unclear if any of this will resonate outside of the MAGA echo chamber. But at least it all came straight from his mouth, not though a dem messaging machine.","summary":"Surprise! Donald J. Trump, one time big city Democrat has come out as the social moderate he’s always been. In a Fox News &#8220;Town Hall&#8221; that aired Wednesday morning, Trump sat down with Harris Faulkner and a group of friendly female voters in Georgia to help boost his appeal to the crucial demographic. In a...","url":"https://nypost.com/2024/10/16/opinion/trump-makes-his-view-on-abortion-clear-at-fox-town-hall/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/trump-town-hall.jpg?quality=75&strip=all&1729098144&w=1200","video":null,"publish_date":"2024-10-16 23:51:07","author":"Kirsten Fleming","authors":["Kirsten Fleming"],"language":"en","category":"politics","source_country":"us","sentiment":0.042},{"id":259983022,"title":"More on \"Invasion,\" the Alien Enemies Act, and the Political Question Doctrine","text":"In a previous post, I argued that Donald Trump's plan to use the Alien Enemies Act of 1798 as a tool for peacetime mass deportation is illegal, but also noted that courts might nonetheless refuse to invalidate the plan, because they might (wrongly) conclude that the issue is a \"political question\" that judges are not allowed to consider. The Alien Enemies Act gives the president the power to detain and deport migrants when there \"is a declared war between the United States and any foreign nation or government, or any invasion or predatory incursion is perpetrated, attempted, or threatened against the territory of the United States by any foreign nation or government.\" In that event, the president can detain or remove \"all natives, citizens, denizens, or subjects of the hostile nation or government, being of the age of fourteen years and upward, who shall be within the United States and not actually naturalized.\"\n\nIn a post at the Originalism Blog, Michael Ramsey—a leading scholar of constitutional foreign affairs law—largely agrees with my analysis. But he suggests the political question issue is more easily resolved than I thought:\n\nI think the analysis can be more simple. The question, in my view, isn't whether there is an invasion (which indeed might be a political question, even under the original concept of political questions), but whether it—whatever it is—is \"perpetrated … by any foreign nation or government.\" Since that's clearly not the case, for the reasons Professor Somin says, a court would simply be called on to enforce the statute as written, which is comfortably within the judicial power.\n\nFocusing on the words \"foreign nation or government\" could indeed be an alternative way to reject the argument that the issue here is a political question. Prof. Ramsey is absolutely right about that. But I worry that, if courts rule that the definition of \"invasion\" is a political question, they could say the same thing about the issues of whether the perpetrator of supposed invasion qualifies as a \"nation or government\" and whether that entity was in fact the true perpetrator.\n\nThe political question doctrine is, as I have previously argued, an incoherent mess; Michael Ramsey is no fan of it either. But, precisely because of the doctrine's vagueness and incoherence, judges have a lot of discretion on how to apply it. A court wishing to use the doctrine to avoid the issues raised by the use of the Alien Enemies Act as a tool of peacetime deportation might well be able to find a way to do so. Such a ruling would be a grave error, but not one completely barred by current precedent.","summary":"Legal scholar Michael Ramsey points out another way courts could reject Trump's plan to use the act as a tool for peacetime mass deportation.","url":"https://reason.com/volokh/2024/10/16/more-on-invasion-the-alien-enemies-act-and-the-political-question-doctrine/","image":"https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2024/10/Alien-and-Sedition-Acts.webp","video":null,"publish_date":"2024-10-16 23:46:12","author":"Ilya Somin,Jacob Sullum","authors":["Ilya Somin","Jacob Sullum"],"language":"en","category":"politics","source_country":"US","sentiment":-0.201},{"id":259980658,"title":"Trump hits airwaves with Fox News, Univision town halls","text":"Trump hits airwaves with Fox News, Univision town halls\n The presidential candidates are attempting to reach as many voters as they can with less than three weeks until Election Day. Former President Donald Trump appeared in two televised town halls and Vice President Kamala Harris held a rally in Bucks County, Pennsylvania, after sitting for a Fox News interview. CBS News' Robert Costa and Nikole Killion report.","summary":"The presidential candidates are attempting to reach as many voters as they can with less than three weeks until Election Day. Former President Donald Trump appeared in two televised town halls and Vice President Kamala Harris held a rally in Bucks County, Pennsylvania, after sitting for a Fox News interview. CBS News' Robert Costa and Nikole Killion report.","url":"https://www.cbsnews.com/video/trump-hits-airwaves-fox-news-univision-town-halls/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/16/dcc469ba-4882-4057-bcc1-d79870f0ddab/thumbnail/1200x630/b673874e580d46de6d2bb3dc9e0896a2/trump.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":null,"publish_date":"2024-10-16 23:45:00","author":null,"language":"en","source_country":"US","sentiment":-0.84},{"id":259982610,"title":"Misogyny against Harris is social media’s fault: Mark Cuban","text":"While appearing on The View on Wednesday, Cuban was asked by the daytime talk show’s co-host Joy Behar about a gender divide and misogyny facing Harris in contrast to former President Donald Trump.“Let’s just talk about this massive gender divide that we keep hearing about. I think there’s a lot of misogyny out there. I would say if she were a man, she would be like, [Trump would] have 10% and she’d have 90. So, what’s your thoughts?” Behar asked Cuban.\n\n“I think it’s driven by social media,” the billionaire businessman said. “I think that algorithms kind of give you more of what you’ve already seen. And for men, I’ve got three teenagers and my son and their friends — you know, it starts with sports and then it’s something aggressive.”\n\nHe added, “Then it turns into Donald Trump saying this, this, this, and this. Like, I went and did a podcast and the host was, who was a Trump fan. I’m like, ‘Why do you support him?’ He was like, ‘He’s gangsta.’ I’m like, ‘You want a gangster for president?'”\n\n“Just the way the algorithms in social media work, whether it’s YouTube, TikTok, Instagram, whatever it is, they give you more of the same, and it just reinforces it,” Cuban also explained. “And we live in, you know, kids in particular, they live in a meme generation. And that’s what they see all the time, and that’s what’s reinforcing it. And it’s not like they’re going out there, ‘Well, let me just confirm that what I’m seeing is actually the facts.'”\n\nIn addition to Cuban, fellow Shark Tank host Kevin O’Leary, who has expressed conservative economic views, appeared on The View to discuss the show’s success. \n\n“Mark, I’ve been seeing you on a lot of different shows talking politics, and you’re quite good at it, I must give it to you. You’re supporting Vice President Harris,” Behar praised.\n\nThe View audience applauded loudly as Cuban joined in, clapping his hands in response to the statement of his support for the vice president. He turned to O’Leary and clapped loudly in his ear. O’Leary laughed in reaction.\n\nCuban made his wealth in the Big Tech world by selling his software company MicroSolutions to CompuServe, founding the audio streaming service Broadcast.com, and becoming an owner of the Dallas Mavericks.\n\nHe recently announced that he plans to leave Shark Tank to spend more time with his children.","summary":"Shark Tank co-host Mark Cuban, a vocal supporter of Vice President Kamala Harris, blamed social media and its algorithms for misogyny toward the Democratic presidential nominee. While appearing on The View on Wednesday, Cuban was asked by the daytime talk show&#8217;s co-host Joy Behar about a gender divide and misogyny facing Harris in contrast to [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3192373/misogyny-kamala-harris-social-media-mark-cuban/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/10/Mark-Cuban.webp","video":null,"publish_date":"2024-10-16 23:44:20","author":"Heather Hunter","authors":["Heather Hunter"],"language":"en","category":"politics","source_country":"US","sentiment":-0.153},{"id":259980660,"title":"Harris says her presidency \"will not be a continuation\" of Biden's","text":"Washington — In a contentious interview with Fox News on Wednesday, Vice President Kamala Harris was pressed on immigration policy and her differences with President Biden as she tries to broaden her appeal to Republican and independent voters ahead of Election Day. \"Let me be very clear, my presidency will not be a continuation of Joe Biden's presidency,\" the Democratic nominee declared, adding that she will bring \"fresh and new ideas.\" The nearly 30-minute interview was tense from the start, with Fox News' Bret Baier and Harris often interrupting each other after the anchor asked a question about undocumented migrants. \"May I finish responding, please? You have to let me finish, please,\" Harris said as Baier interjected to note that some migrants who were released from custody went on to commit crimes. \"I'm in the middle of responding to the point you're raising and I'd like to finish.\" Baier played a clip of the mother of 12-year-old Jocelyn Nungaray saying she believes the border policies of the Biden administration are responsible for her daughter's death in Texas. Two undocumented men from Venezuela are charged in her death. \"So do you owe them an apology?\" Baier asked. \"I am so sorry for her loss,\" Harris said. \"I am so sorry for her loss, sincerely. But let's talk about what is happening right now with an individual who does not want to participate in solutions.\" Harris was referring to a bipartisan measure that would have been the first comprehensive border security policy overhaul in decades. After months of negotiations, Republicans and Democrats reached a compromise in February that would have given the president far-reaching powers to restrict unlawful border crossings and tightened asylum rules. But Republicans ultimately pulled their support for it after former President Donald Trump announced his opposition. \"We've had a broken immigration system, transcending, by the way, Donald Trump's administration, even before. Let's all be honest about that. I have no pride in saying that this is a perfect immigration system,\" she said. \"It needs to be fixed.\" Harris also reversed a position she held in 2019, saying Wednesday, \"I do not believe in decriminalizing border crossings, and I've not done that as vice president. I will not do that as president.\" The vice president also appeared earlier in the day at a campaign event in Pennsylvania, a battleground state, with more than 100 Republicans who have endorsed her in an effort to court disaffected Republicans who are put off by Trump's refusal to accept his loss in the 2020 election and his vows for retribution against his political opponents. Former Rep. Adam Kinzinger, who was part of the House committee that investigated the Jan. 6, 2021, attack on the U.S. Capitol, was among the Republicans supporting Harris at the rally as she noted that in a typical election year their presence would be unusual. \"But not in this election,\" Harris said at the rally. \"Because at stake in this race are the democratic ideals that our founders and generations of Americans before us have fought for. At stake in this election is the Constitution of the United States.\" She called Trump \"increasingly unstable and unhinged\" and said he is \"seeking unchecked power\" as she reminded rally attendees that some former Trump administration officials have sounded the alarm about his fitness for office. \"No matter your party, no matter who you voted for the last time, there is a place for you in this campaign,\" she said. Harris also repeated her pledge to appoint a Republican to her Cabinet and establish a bipartisan council to recommend solutions for the most pressing issues facing the country if she wins.","summary":"The nearly 30-minute interview with Fox News was tense from the start.","url":"https://www.cbsnews.com/news/kamala-harris-fox-news-interview/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/10/16/73112a70-2619-444d-84e7-8ea08bb53b97/thumbnail/1200x630g4/2233c3a017cb20f54675dd4b633b54be/gettyimages-2178062836.jpg?v=edba3a63b5392b4c81ae19d894992d91","video":"https://prod.vodvideo.cbsnews.com/cbsnews/vr/hls/3269881_hls/master.m3u8","publish_date":"2024-10-16 23:42:11","author":"Caitlin Yilek","authors":["Caitlin Yilek"],"language":"en","source_country":"US","sentiment":-0.208},{"id":259980394,"title":"Kamala Harris lacks any solutions for the border crisis","text":"Kamala Harris refuses to discuss the border issue, avoids sharing the real facts about it, and lacks a solution for addressing the border challenges.\n\nThat’s the main takeaway from Fox News’ Bret Baier’s incisive questioning Wednesday night, which exposed Harris as an angry partisan with no other platform than “blame Donald Trump.”\n\nFinally facing an interviewer who wasn’t giving her hugs and cookies, Harris tried monologuing an irrelevant answer about the flood of illegal immigrants.\n\nWhen Baier called her out, she bristled, said “let me finish” and then continued to not answer the question.\n\nShe refused to take any responsibility. Admitted no errors.\n\nTen million people that we know of have crossed the border since Joe Biden and Kamala Harris took office and have been allowed to stay.\n\nMillions more came in unseen.\n\nWhy were so many allowed?\n\nWere they vetted?\n\nHow are we going to pay for it all?\n\nWill it continue if she’s president?\n\nBaier pointed out that 79% of Americans feel the country is on the wrong track, and it follows that Biden and Harris are responsible for that.\n\n“You’ve been in office for 3½ years,” Baier said.\n\n“And Donald Trump has been running for office since . . . ,” Harris answered.\n\n“But you’ve been the person holding the office, Madam Vice President.”\n\n“C’mon, you and I both know what I’m talking about,” she said.\n\n“I actually don’t,” Baier said, “what are you talking about?”\n\nShe didn’t explain.\n\nDoes anyone know?","summary":"Kamala Harris refuses to discuss the border issue, avoids sharing the real&#8230;","url":"https://internewscast.com/news/us/kamala-harris-lacks-any-solutions-for-the-border-crisis/","image":"https://internewscast.com/wp-content/uploads/2024/10/Kamala-Harris-clearly-has-ZERO-answers-for-the-border-crisis-800x430.jpg","video":null,"publish_date":"2024-10-16 23:41:35","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.213},{"id":259980286,"title":"Harris deflects on border, Iran and Biden decline during bad-tempered Fox News interview","text":"WASHINGTON — Vice President Kamala Harris angrily dodged questions on border policy, Iran and President Biden’s fitness for office in an contentious interview with Fox News host Bret Baier — as more polls showed her losing the initiative in the race for the White House.\n\nThe 26-minute interview with the Democratic nominee kicked off with a tense grilling by Baier on immigration policy — with Harris repeatedly refusing to say that terminating former President Donald Trump’s “Remain in Mexico” policy was a mistake.\n\nBaier’s first question schooled Harris about the effects of the current administration’s more permissive policies, which allow many illegal border-crossers to await asylum rulings inside the US, before asking how many migrants had been allowed into the US after crossing illegally.\n\nWhen Harris declined to offer a figure, Baier said “it’s a rough estimate of six million people released into the country” before pressing her: “Looking back, do you regret the decision to terminate ‘Remain in Mexico’ at the beginning of your administration?”\n\nHarris began to deploy standard campaign-trail talking points, insisting that the administration’s “first bill, practically within hours of taking the oath, was a bill to fix our immigration system.”\n\nBaier interjected, “it was essentially a pathway to citizenship” for illegal immigrants already in the country.\n\n“May I finish responding, please? But you have to let me finish, please,” the veep said sternly.\n\n“You had the White House and the House and the Senate and they didn’t bring up that bill,” Baier said.\n\n“I’m in the middle to responding to the point that you’re raising and I’d like to finish,” she reprimanded. We recognized from day one … it is a priority for us as a nation … and our focus has been on fixing a problem.”\n\nBaier noted that the bill cited by Harris would have allowed 1.8 million asylum-seekers who illegally crossed the border into the country each year and that six Senate Democrats voted against it.\n\n“Jocelyn Nungaray, Rachel Morin, Laken Riley, they are young women who were brutally assaulted and killed by some of the men who were released at the beginning of the administration, well before a negotiated bipartisan bill,” Baier pressed.\n\n“Former President Clinton actually referred to Laken Riley Sunday campaigning for you in Georgia, saying if those men had been properly vetted, Laken Riley probably would not have been killed…This is a specific policy decision by your administration to release these men into the country. So what I’m saying to you, do you owe those families really an apology?”\n\nHarris replied, without accepting blame for the tragedies, “I can’t imagine the pain that the families of those victims have experienced for a loss that should not have occurred.”\n\n“It was a policy decision in the early part of your administration,” Baier pressed, before playing a clip of Nungaray’s mother testifying to Congress this year that “I believe the Biden-Harris administration’s open border policies are responsible for the death of my daughter.”\n\n“I feel awful for what she and her family have experienced,” Harris said.\n\nBaier pivoted into questioning the vice president on her support in 2019 as a Democratic presidential primary candidate for decriminalizing border crossings.\n\n“I do not believe in decriminalizing border crossings and I’ve not done that as vice president. I will not do that as president,” Harris said, confirming her policy evolution on the matter.\n\nWhen pressed on her 2019 support for taxpayer-funded gender reassignment surgeries for federal prisoners, including illegal immigrants, Harris countered that “I will follow the law, and it’s a law that Donald Trump actually followed.”\n\nWhen Baier pointed out that there were no such surgeries under Trump, Harris countered, “well, you know, you gotta take responsibility for what happened in your administration” — triggering a deluge of online commentary about her own refusal to do so.\n\nLater in the interview, Harris dodged questions on whether she believes that it’s time to tighten the enforcement of oil sanctions against Iran and about when she realized that Biden, 81, appeared to be in cognitive decline, which prompted the Democratic mutiny that forced him to relinquish the party’s nomination on July 21.\n\n“Critics say that you either relaxed or failed to enforce sanctions on Iran, allowing all of this money to flow into Iran, like billions in oil profits,” Baier said.\n\n“Let’s go back to Donald Trump, who pulled out of, who pulled out of the deal that would have actually put Iran in check,” Harris countered, referring to the 45th president’s decision to end the Obama-era nuclear deal and instead ramp up sanctions on Tehran.\n\nHarris and Baier talked over each other as the journalist said, “Madam vice president, all of this money that has gone in the past few years, critics say that it goes to Hezbollah, Hamas and the Houthis.”\n\nThe vice president said, “I would like that we would have a conversation that is grounded in full assessment of the facts.”\n\nA bipartisan coalition of 62 House members — including Democrats Adam Schiff and Eric Swalwell of California — in January asked Biden to fully enforce US sanctions on Iranian oil exports after sales surged, now roughly tripling Iran’s annual export levels in 2019 or 2020.\n\n“Iran now exports more than 1.4 million barrels of crude oil daily, over 80% of which goes to China. From February 2021 to October 2023, the regime has taken at least $88 billion from these illicit oil exports,” wrote the group. “Iran is deriving significant economic benefits from pervasive sanctions evasion, with Iran’s annual economic growth increasing by more than four percent and net foreign currency reserves up by 45[%].”\n\nHarris also refused to address when she noticed that Biden was slowing cognitively. \n\n“When did you first notice that President Biden’s mental faculties appeared diminished?” Baier asked.\n\n“Joe Biden, I have watched him from the Oval Office to the Situation Room, and he has the judgment and experience to do exactly what he has done in making very important decisions on behalf of the American people. Bret, Joe Biden is not on the ballot,” she deflected.\n\nBaier pressed: “You met with him at least once a week for three and a half years. You didn’t have any concerns?”\n\nHarris redirected, “I think the American people have a concern about Donald Trump, which is why the people who know him best, including leaders of our national security community, have all spoken out.”\n\nThe Democratic nominee is currently trailing Trump in swing states Arizona, Georgia, Michigan, Nevada, North Carolina and Pennsylvania while only narrowly leading in Wisconsin, according to the RealClearPolitics average of recent polls.","summary":"\"You gotta take responsibility for what happened in your administration,\" Harris said, triggering a deluge of online commentary about her own refusal to do so.","url":"https://nypost.com/2024/10/16/us-news/harris-deflects-on-border-iran-and-biden-decline-during-bad-tempered-fox-news-interview/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/kamala-harris-fox-news-interview-91746468.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/BqbGKB9y-RyIcpnTz.mp4","publish_date":"2024-10-16 23:41:19","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.517},{"id":259981654,"title":"Harris defends Biden’s mental fitness (VIDEO)","text":"Vice President Kamala Harris has defended the mental fitness of US President Joe Biden during a contentious interview with Fox News.\n\nBiden suspended his re-election campaign in July amid the growing concerns about his age and mental decline and named Harris as his successor. \n\nHost Bret Baier asked Harris on Wednesday when did she “first notice that President Biden’s mental faculties appeared diminished.” \n\nThe vice president replied that she had watched Biden’s actions “from the Oval Office to the Situation Room.” \n\n“He has the judgment and experience to do exactly what he has done in making very important decisions on behalf of the American people,” the VP insisted. \n\nWhen Baier tried to ask a follow-up question, Harris interrupted and pivoted to attacking her Republican rival, former President Donald Trump, whom she repeatedly called “unstable.” “Joe Biden is not on the ballot, and Donald Trump is,” she said, adding that the American people “have a concern” about Trump’s aptitude to lead the country again.\n\nWhile initially reluctant to step down, Biden finally withdrew his candidacy after a disastrous televised debate with Trump, where he appeared confused and often struggled to finish sentences. Harris has since praised Biden, describing his decision to leave the race as “one of the most courageous” that a president could make.","summary":"Vice President Kamala Harris has refused to admit that Joe Biden’s mental health has been declining \nRead Full Article at RT.com","url":"https://www.rt.com/news/605829-harris-defends-biden-mental-state/","image":"https://mf.b37mrtl.ru/files/2024.10/article/67104e9c85f5406f4646aa75.jpg","video":null,"publish_date":"2024-10-16 23:41:04","author":null,"language":"en","category":"politics","source_country":"ru","sentiment":-0.04},{"id":259981952,"title":"Harris spars with Fox News host and says she would not be a 'continuation' of Biden","text":"WASHINGTON — In a combative interview with Fox News, Kamala Harris said in the most emphatic terms to date that, if she wins the election, she would pursue an independent presidency that would not be a repeat of President Joe Biden’s nearly four years in office. “My presidency would not be a continuation of Joe Biden’s presidency,” Harris told interviewer Bret Baier, an anchor with Fox News. “And like every new president that comes to office, I will bring my life experiences and professional experiences” to the job. “I represent a new generation of leadership.” Harris’s declaration comes after she faced criticism over her recent interview on ABC’s “The View,” in which she could not identify any policy differences she’s had with Biden since serving as his vice president. Given Biden’s unpopularity in public opinion polls, Harris’s answer drew criticism that her tenure would be merely a Biden sequel. NBC News reported that Harris' campaign was looking for a chance for her to put more space between the two of them. On Tuesday, Biden appeared to give her his blessing to do so, saying she would \"cut her own path\" as president. Harris took the rare step of appearing on the conservative network in hopes of appealing to Republican and independent voters who don’t normally tune into the more mainstream news sources. In a race with Republican Donald Trump that is too close to call, Harris is looking to make a case to voters who are not part of the Democratic coalition but who aren’t sold on four more years of Trump. The interview was possibly the most contentious of Harris’s campaign: both she and Baier had something to prove. Fox News’ conservative viewership wanted to see a hard-hitting interview while Harris needed to look strong and show the level of authority that Americans expect of a commander-in-chief. The two frequently talked over and past one another, as Baier sought to pin her down on issues including the border, the economy and any misgivings she might have about Biden’s fitness for office. Harris held her ground and insisted that she be allowed to finish her sentences, while Baier pressed for short, clear answers that would enable him to cover maximum ground. \"I'm in the middle of responding to the point you're raising, and I'd like to finish,\" Harris, as she parried one of his questions about immigration. Harris became the nominee after Biden dropped out of the race amid sluggish poll numbers and concerns among Democrats that, at 81, he was showing signs of infirmity that made him unelectable. Biden's frailties had been an issue for years, but received renewed attention following a dismal debate performance in June against Trump. Baier pressed Harris on whether she had noticed that Biden was diminished. She countered by saying Biden has been up to the job and quickly pivoted to Trump, casting him as the one who can't meet the demands of the presidency. \"Joe Biden is not on the ballot,\" she said. \"Trump is.\" She cited former Trump senior officials who've said he's unfit to serve as president. \"I think the American people have concerns about Donald Trump,\" she said. Baier sought to elicit answers on what Trump has sought to amke the overriding campaign issue: border security. He mentioned crimes that have been committed by illegal immigrants under the Biden-Harris administration’s watch. While voicing sympathy for victims and conceding the immigration system is broken, Harris said that Congress had worked out a bipartisan bill aimed at strengthening border security that Trump derailed through his influence with GOP lawmakers. She also blamed Congress for failing to pass a comprehensive immigration bill that Biden unveiled on the first day of his presidency in 2021 that would have that was aimed at both clamping down on illegal immigration and offering a path to citizenship for the millions of Americans living in the country illegally. Polls show that voters see Harris as an agent of change. \"You've been vice president for three-and-a-half years,\" Baier said \"What are you turning the page from?\" Harris mentioned Trump, who has either run for president or served in the job steadily since 2015. She said she wanted to move past \"the decade in which we've been burned from the kind of rhetoric that Donald Trump\" has used to \"divide our country and have Americans literally point fingers at each other.\" If Trump is so flawed, why do so many Americans support his candidacy, Baier asked. Does she believe voters are dumb? \"I've never said that,\" Harris said. Turning back to Trump, she said, \"He's the one who tends to demean and belittle the American people.\" She mentioned Trump's repeated mention of \"the enemy within\" that lurks within the U.S. and voiced concern that Trump would use the U.S. military to deal with such nebulous threats.","summary":"In a combative interview with Fox News, Kamala Harris said in the most emphatic terms to date that, if she wins the election, she would pursue an independent presidency that would not be a repeat of President Joe Biden’s nearly four years in office.","url":"https://www.nbcnews.com/politics/2024-election/harris-spars-fox-news-host-says-not-continuation-biden-rcna175742","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-10/241016-kamala-harris-se-405p-a3ac5a.jpg","video":null,"publish_date":"2024-10-16 23:38:42","author":"Peter Nicholas","authors":["Peter Nicholas"],"language":"en","source_country":"us","sentiment":-0.057},{"id":259980758,"title":"Harris Calls on Republican Voters to Put ‘Country First’ as Trump Woos Latino Voters","text":"WASHINGTON CROSSING, Pa. (AP) — Surrounded by more than 100 former Republican officeholders and officials, Democrat Kamala Harris urged GOP voters on Wednesday to put “country first” and abandon Donald Trump.\n\nThe Democratic presidential candidate made her case to Republican voters that the patriotic choice was her party in next month’s election because Trump is “unstable” and “unhinged” and would eviscerate democratic norms if given a second White House term.\n\n“America must heed this warning,” said Harris, speaking at a rally near where Gen. George Washington led hundreds of troops across the Delaware River to a major victory in the Revolutionary War.\n\nJoined by the former lawmakers and government officials for a rally in the Philadelphia suburbs, Harris said, “Anyone who tramples on our democratic values as Donald Trump has, anyone who has called for the ‘termination’ of the Constitution of the United States as Donald Trump has, must never again stand behind the seal of the president of the United States.”\n\nThe rally was part of Harris’ effort to appeal to a swath of Republican voters in battleground states that she believes still can be swayed.\n\nWith 20 days to go, Harris is hoping to tear away any Republican or on-the-fence voter by warning that Trump is looking to govern with “unchecked power.” She has pledged to nominate a Republican to her Cabinet and create a bipartisan council to advise her on policy matters if elected.\n\nMeanwhile, Trump addressed Latino voters in Miami, Florida. It’s a group that historically has leaned Democratic but that Republicans have made inroads with.\n\nTrump is walking a tightrope as he looks to woo Latino voters.\n\nOn Wednesday, he defended his call for mass deportation of immigrants who are in the U.S. illegally, even as he nodded to a need for immigrant labor during a town hall-style event on Univision, the nation’s largest Spanish-language network.\n\n“We want workers, and we want them to come in, but they have to come in legally, and they have to love our country,” the Republican presidential candidate said during the event, scheduled to air Wednesday evening. Trump was answering the question of Jorge Velásquez, a farm worker who said most people doing such jobs are undocumented and suggested, if they’re deported, food prices will increase.\n\nTrump then returned to his criticism of Harris for being a critical player in the Biden administration’s that presided over an influx of migrants with criminal backgrounds.\n\nThe event featured pointed questions for Trump, about his wife Melania’s support for abortion rights, noted in her new memoir, and about the Jan. 6, 2021, siege of the U.S. Capitol by his supporters who breached the building in an attempt to stop the certification of the 2020 election results.\n\n“Your own vice president doesn’t want to support you now,” said Ramiro Gonzalez, of Tampa, Florida, a Republican who said he was no longer registered with the party but wanted to give Trump the chance to win him back. Gonzalez was referring to former Vice President Mike Pence, who has disavowed Trump in light of Jan. 6.\n\nTrump’s response: “Hundreds of thousands of people come to Washington. They didn’t come because of me. They came because of the election. They thought the election was a rigged election. That’s why they came.”\n\n“That was a day of love from the standpoint of the millions,” Trump told Gonzalez.\n\nHarris was in Bucks County, a vote-rich stretch of suburban Philadelphia where Democrats have held a narrow advantage in recent presidential elections. Her advisers believe she needs to improve her margins in Philadelphia and surrounding suburbs to win the state’s 19 electoral votes.\n\nHarris was joined for her rally by former Reps. Barbara Comstock of Virginia, Jim Greenwood of Pennsylvania, Mickey Edwards of Oklahoma and Adam Kinzinger of Illinois as well as Republican officials from every administration going back to Ronald Reagan.\n\n“No matter your party, no matter who you voted for last time, there is a place for you in this campaign,” Harris said. “The coalition we have built has room for everyone who is ready to turn the page on the chaos and instability of Donald Trump.”\n\nSeveral of the GOP surrogates said that supporting a Democrat felt awkward but was necessary due to Trump’s rejection of electoral norms and his support of the rioters who tried to stop the certification of his 2020 election loss to President Joe Biden.\n\n“You know, Donald Trump may be running as a Republican, but the truth is, he does not share those long held Republican values of supporting democracy, of standing for the rule of law, and a faithfulness to the Constitution as a Republican,” Kinzinger said. “That saddens me.”\n\nHarris tapped a couple, Pennsylvania farmers Bob and Kristina Lange who had previously backed Trump, to introduce her at the rally. Bob twice voted for Trump and Kristina backed him in 2016.\n\n“Never in a million years did either of us think that we’d be standing here supporting a Democrat,” Kristina Lange said. “But we’ve had enough. We’ve had enough.”\n\nSome of the rallygoers who have voted Republican in the past said they were looking for the party to rewind to its fiscal conservative roots.\n\n“We need more Republicans to stand up and say, ‘This is not what our party is about, this is not what we are about,’” said Sarah Larson, 53, of East Rockhill Township, who last voted for a Republican presidential candidate in 2008 when John McCain was at the top of the ticket. “It’s not what we recognize anymore as Republican values – which is less government, more freedom – right now.”\n\nWhile in Pennsylvania, Harris conducted an interview with Fox News’ Bret Baier in which the two sparred over immigration policy and her shifting policy positions over the years, among other things. A week after saying she couldn’t think of any move made by Biden that she would have done differently, Harris asserted that “My presidency will not be a continuation of Joe Biden’s presidency.”\n\nTrump and Harris also campaigned in Pennsylvania Monday, when the Republican was in nearby Oaks while Harris was on the opposite end of the state in Erie County, among Pennsylvania’s most closely divided counties over the past two presidential contests.\n\nHarris’ simplest path toward the 270-vote winning threshold in the Electoral College is by carrying a trio of northern battleground states, Michigan, Pennsylvania and Wisconsin. Harris campaigned in Detroit Tuesday and planned to campaign in three Wisconsin cities Thursday.","summary":"WASHINGTON CROSSING, Pa. (AP) — Surrounded by more than 100 former Republican officeholders and officials, Democrat Kamala Harris urged GOP&#8230; Continue reading Harris Calls on Republican Voters to Put &#8216;Country First&#8217; as Trump Woos Latino Voters\n\n\nThe post Harris Calls on Republican Voters to Put &#8216;Country First&#8217; as Trump Woos Latino Voters appeared first on The National Herald.","url":"https://www.thenationalherald.com/harris-calls-on-republican-voters-to-put-country-first-as-trump-woos-latino-voters/","image":"https://www.thenationalherald.com/wp-content/uploads/2024/10/harris-rep.jpg","video":null,"publish_date":"2024-10-16 23:38:36","author":"Antonis","authors":["Antonis"],"language":"en","category":"politics","source_country":"us","sentiment":-0.337},{"id":259980962,"title":"Trinidad and Tobago Trump supporters to host US election watch party","text":"KRISTEN-LE CHELLE WINCHESTER\n\nA TT Donald Trump supporter is rallying local backers of US presidential candidate, urging them to stand united on election night on November 5 in support of his re-election bid.\n\nTrump, a former president and current presidential candidate for the US Republican Party, will square off against the Democratic Party's candidate, sitting US vice president Kamala Harris.\n\nFormer US and TT journalist Eve George, the event's organiser, emphasised the significance of the planned watch party, describing it as a historical moment.\n\nSpeaking with Newsday by phone on October 16, George said, “This is history being created in our country, and there is nobody in our country that has ever done this.\n\n“That night is going to be etched in our nation's history forever.”\n\nGeorge said she was supportive of the Republican candidate’s policies, specifically highlighting the reintegration of religious studies into the schools' curriculum.\n\n“We support the stand that he has made for Christianity and bringing God and the bible back into schools. There are a lot of policies that he has made that we support as the more conservative-thinking people in society.\n\n“We decided we wanted to do something and bring the supporters of President Trump in TT together to just celebrate that night and have a nice evening together while looking at the elections as it's open.\n\n“So far, we have had mostly people who are those that belong to the business society. They are more supporters of President Trump because they understand the policies that he made to make the American economy the highest ever recorded in history.”\n\nGeorge sharply criticised the media’s portrayal of Trump, accusing them of deliberately “demonising” him in their coverage.\n\n“Every morning I would turn on my television to all these stations and the first thing you see when you flip is just complete hatred for a man. As a journalist, I said to myself this is not journalism and this is not responsible reporting. It is pure hatred.”\n\nA flyer promoting the event and featuring Trump's \"Make America Great Again (MAGA)\" campaign slogan has been circulated on social media and has generated widespread attention.\n\nGeorge said she began sharing the flyer three days ago to a few friends, and since its dissemination, she has received numerous calls.\n\n“Since the brochure has been out, people have been constantly calling. Some people are in shock because they do not believe this is actually happening in our country. They cannot believe there are people who are brave enough to stand up and do something like this.\n\n“Persons in the hierarchies of society called, and different persons from embassies and associations affiliated with certain groups have called to see if this is actually happening in Trinidad.”\n\nThe watch party will be open to the public but Trump supporters are preferred, said George. It will be held on November 5 at No 5 Cipriani Boulevard, Port of Spain, at 8 pm.\n\nShe said the building will be decorated to resemble a Trump campaign office and where food and drinks will be for purchase. Complimentary MAGA hats will be available to all supporters.\n\nUS 2024 presidential elections \n\nThe Republican party’s candidate Donald Trump and the Democratic party’s Kamala Harris vie for the POTUS (President of the the United States) title.\n\nAt the time of this publication, BBC News reported Harris as having a national polling average of 49 per cent while Trump was polling at 46 per cent.\n\nThe candidates met on the presidential debate stage in Philadelphia on September 10 to discuss key election topics relating to the economy, immigration and border security, abortion and foreign policy.","summary":"KRISTEN-LE CHELLE WINCHESTER\n\n\nA TT Donald Trump supporter is rallying local backers of US presidential candidate, urging them to stand united on election night on November 5 in support of his re-election bid.\n\n\nTrump, a former president and current presidential candidate for the US Republican Party, will square off against the Democratic Party's candidate, sitting US vice president Kamala Harris.\n\n\nFormer US and TT journalist Eve George, the event's organiser, emphasised the significance of the planned watch party, describing it as a historical moment.\n\n\nSpeaking with Newsday by phone on October 16, George said, “This is history being created in our country, and there is nobody in our country that has ever done this.\n\n\n“That night is going to be etched in our nation's history forever.”\n\n\nGeorge said she was supportive of the Republican candidate’s policies, specifically highlighting the reintegration of religious studies into the schools' curriculum.\n\n\n“We support the stand that he has made for Christianity ","url":"https://newsday.co.tt/2024/10/16/trinidad-and-tobago-trump-supporters-to-host-us-election-watch-party/","image":"https://newsday.co.tt/wp-content/uploads/2024/10/23508155.jpg","video":null,"publish_date":"2024-10-16 23:36:29","author":"Newsday Reporter","authors":["Newsday Reporter"],"language":"en","source_country":"tt","sentiment":-0.08},{"id":259979936,"title":"Kamala Harris and Brett Baier Go Toe-to-Toe in First Interview","text":"Vice President Kamala Harris sat down Wednesday for what turned out to be a fiery and contentious interview with Fox News host Bret Baier.It was Harris' first interview with the network since becoming the Democratic nominee, and it comes as part of her final push to reach independent and undecided voters before Election Day.During Wednesday's interview, Harris and Baier went toe-to-toe on everything from immigration, to transgender rights, to Donald Trump's threats to \"lock people up.\"ImmigrationIn an initial volley, Baier grilled Harris on the number of undocumented immigrants who were allowed into the country under the Biden administration.Baier interrupted Harris repeatedly as she tried to answer the question, until Harris finally cut in: \"May I please finish?\" she asked.\"Yes, ma'am,\" the Fox News host responded.Harris went on to highlight steps that the Biden immigration has taken to reform the immigration system, and she pointed out former President Donald Trump's role in sinking a bipartisan immigration reform bill earlier this year that Republicans spent months advocating for.Immigration is a top campaign issue heading into the election, and Trump has consistently had more voter support on the issue compared to Harris.The former president has leaned into that support, dubbing Harris the Biden administration's \"border czar\" and laying the blame at her feet for what he describes as \"migrant crime.\"Fact-checkers have pointed out, however, that Harris was not the \"border czar\"; instead, she served as a liaison to Central American nations and was charged with helping work with those countries to address the root causes for illegal immigration.DemocracyHarris doubled down on a key pillar of her campaign: highlighting the potential risks of a second Trump term and its effect on democracy and the rule of law.She accused Trump of being unable to \"handle criticism\" and said the Republican nominee's threats to \"lock people up.\"\"You and I both know that he has talked about turning the American military on the American people,\" Harris said to Baier.\"I think the American people have concerns about Donald Trump,\" Harris added, pointing to a number of former Trump administration officials and Republicans who have called him unfit for office — and many of whom have endorsed Harris.Gender-Affirming CareTrump and his surrogates launched a media blitz zeroing in on Harris and down-ballot Democrats' support for gender-affirming care.One campaign ad that the Trump campaign released in battleground states declared: \"Kamala is for they/them. President Trump is for you.\"The Trump campaign has been especially critical of gender-affirming care for inmates — but as multiple media outlets have reported, U.S. prisons offered such care during the Trump presidency as well.Harris pointed that out on Wednesday.\"I will follow the law,\" she said, adding that federal regulations require equal access to medical care.","summary":"Harris and Baier sat down for a highly-anticipated interview in which they discussed immigration, healthcare, and Trump.","url":"https://www.newsweek.com/kamala-harris-bret-bair-fox-interview-takeaways-1970314","image":"https://d.newsweek.com/en/full/2497265/kamala-harris-hispanic-voter-surge-poll-election.jpg","video":null,"publish_date":"2024-10-16 23:36:10","author":"Lima Abdullah","authors":["Lima Abdullah"],"language":"en","source_country":"us","sentiment":-0.302},{"id":259982822,"title":"Harris campaign calls plagiarism claims a partisan attack. Expert says it was 'sloppy writing'","text":"Democratic presidential candidate Kamala Harris' campaign is dismissing accusations that she and a co-author plagiarized parts of a 2009 book on the U.S. criminal justice system as a desperate attempt by “rightwing operatives” to distract voters. \n\nPlagiarism experts and academics who reviewed the claims said several were benign or could not be proven, and others were more due to careless writing than malicious intent. \n\nThe allegations surrounding the book, “Smart on Crime: A Career Prosecutor’s Plan to Make Us Safer,” surfaced Monday when conservative activist Christopher Rufo posted an article on his Substack platform that listed a handful of passages he said were copied from other sources without any or adequate attribution. \n\n“Taken in total, there is certainly a breach of standards here,” Rufo wrote. “Harris and her co-author duplicated long passages nearly verbatim without proper citation and without quotation marks, which is the textbook definition of plagiarism.”\n\nJames Singer, a spokesman for the Harris campaign, said in an emailed statement that the plagiarism allegations represent a partisan attack on a book Harris co-authored more than a decade ago.\n\n“Rightwing operatives are getting desperate as they see the bipartisan coalition of support Vice President Harris is building to win this election, as (former president Donald) Trump retreats to a conservative echo chamber refusing to face questions about his lies,” Singer wrote. “This is a book that’s been out for 15 years, and the vice president clearly cited sources and statistics in footnotes and endnotes throughout.” \n\nRufo's article cited a new study of Harris’ 248-page book by Stefan Weber, an Austrian academic known in Europe as a “plagiarism hunter.” Among the findings, the book plagiarized a section from a Wikipedia article and made up a childhood anecdote that originated with Martin Luther King Jr., according to Weber. \n\nTrump’s running mate, Ohio Republican Sen. JD Vance, seized on the allegations to needle Harris.\n\n“Hi, I’m JD Vance. I wrote my own book, unlike Kamala Harris, who copied hers from Wikipedia,” he wrote on X. Vance's 2016 memoir, Hillbilly Elegy recounts his blue-collar upbringing in Kentucky and Ohio.\n\nThe allegation involving King centers on a story Harris said her mother told her about a time when she was fussing as a toddler. Her mother, according to the book, asked her what was wrong and what she wanted. “I wailed back, ‘Fweedom,’” Harris wrote. Weber said Harris appropriated the anecdote, without attribution, from an interview King gave in 1965.\n\nBut other plagiarism experts questioned the severity of the claims. Jonathan Bailey, a consultant and publisher of the website Plagiarism Today, said in a Tuesday post that the King story allegation first arose in early 2021 and couldn't be proven based on available evidence. But several other plagiarism accusations are more troublesome, he said, including Weber's allegation that Harris' book copied and pasted, without citation, a section of a Wikipedia article.\n\nBut the patterns in the book point to “sloppy writing habits, not a malicious intent to defraud,\" he said.\n\n“Though some of the passages, such as the Wikipedia one, are sloppy to the point of negligence, when you look at the portion of the book involved, the nature of the issues, and the citations provided, negligence remains more likely than malice in my eyes,” Bailey wrote.\n\nMiguel Roig, a psychology professor at St. John’s University in New York who studies plagiarism in the sciences, said the lapses described by Weber meet the definition of plagiarism. But, he added, context is important. The problematic passages amount to a small total of the overall book and “hardly seems like an attempt to defraud,” he said.\n\n“Any time minor issues like these occur, the offending authors should simply acknowledge the obvious errors, apologize, and make corrections where feasible, and just move on,” Roig said.\n\nHarris wrote “Smart on Crime\" when she was the district attorney for San Francisco. The book spelled out her ideas for improving public safety and making the criminal justice system more effective. In 2010, a year after the book was published, she was elected attorney general of California. \n\nHarris' co-author, Joan O'C. Hamilton, works as a book collaborator and ghostwriter, according to her website. \n\nWeber, the plagiarism researcher in Austria, said in an email that much of the work to check Harris's book was done by an associate whom he did not identify. But he said the associate was “driven by personal choice and interest, not by political motivations.” This was Weber's first “international case,” he said.\n\nHe also said he was unaware until the Harris review had been released that Trump, the Republican presidential nominee, had published books.\n\n“Every scientist can feel free to check the books of Donald Trump or whomsoever as we did it with Kamala Harris,” Weber said.\n\nDebora Weber-Wulff, a professor of media and computing at Berlin University of Applied Sciences in Germany and no relation to Weber, sided with Bailey's assessment and said the book's publisher would have to decide whether any problems justify removing it from sales. Any legal action is unlikely because the original author of the plagiarized content would have to pursue a potentially costly lawsuit.\n\n“No one in their right mind would invite a suit like this,” Weber-Wulff said. \"Only the lawyers profit.”","summary":"Democratic presidential candidate Kamala Harris’ campaign is dismissing accusations that she and a co-author plagiarized parts of a 2009 book on the U.S. criminal justice system as a desperate attempt by “rightwing operatives” to distract voters ahead of next month’s election","url":"https://www.independent.co.uk/news/ap-donald-trump-jd-vance-hillbilly-elegy-jonathan-bailey-b2630638.html","image":"https://static.independent.co.uk/2024/10/17/00/Election_2024_Harris_67275.jpg?width=1200","video":null,"publish_date":"2024-10-16 23:35:52","author":"Richard Lardner","authors":["Richard Lardner"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.463},{"id":259980022,"title":"“Expressed Differently: Choosing My Words Carefully”","text":"WILLIAMSPORT, Pa. — In his most direct answer yet about the 2020 election results since he joined the Republican presidential ticket, Sen. JD Vance of Ohio appeared to say Wednesday that he does not believe Donald Trump lost the last presidential election.\n\nFielding questions from reporters after he spoke at a rally in central Pennsylvania, Vance was pressed about recent appearances in which he has declined directly to say whether or not Trump lost his re-election bid against Joe Biden.\n\n“What message do you think it sends to independent voters when you do not directly answer the question: Did Donald Trump lose in 2020?” a reporter asked Vance.\n\n“First of all, on the election of 2020, I’ve answered this question directly a million times: No. I think there are serious problems in 2020. So, did Donald Trump lose the election? Not by the words that I would use,” Vance said.\n\nHe went on to admonish the media for focusing on the last election rather than on the issues that he said voters care about, like the cost of living or the southern border, adding that he “couldn’t care less if you agree or disagree with me on this issue.”\n\n“What verifiably I know happened is that in 2020, large technology companies censored Americans from talking about things like the Hunter Biden laptop,” Vance said, a nod to comments he makes in interviews and campaign trail appearances suggesting censorship cost Trump “millions” of votes in 2020. \n\n“Now, let’s take that as a baseline reality. Even the journalists who constantly fact-check me admit that’s real. You could say — well, let’s say your view is that happened and we still think Trump lost, or that happened and we think that means Trump won,” Vance said. “Who cares? It happened. Censorship is bad, and that’s the substance of what we’re focused on.”\n\nLater, at his second campaign stop of the day, in Wilmington, North Carolina, Vance doubled down on his remark when another reporter asked him about his answer earlier in the afternoon.\n\n“I’ve answered this question 10 times recently,” Vance said. “I think that Big Tech rigged the election in 2020. That’s my view. And if you disagree with me, that’s fine.”\n\nGiven a chance to ask a follow-up question, the reporter asked: “Why did you answer the question now? Why did you say ‘no’ when you didn’t say it before?”\n\n“I have given this answer to this question for literally years,” Vance said, once again taking the media to task.\n\n“Do your job and focus on the problems the American people care about, rather than bull—- from four years ago.”\n\nRepresentatives for Vance did not respond to a request for comment.\n\nThough he has long questioned the election’s results, Vance has been cautious in public appearances in saying definitively whether Trump won or lost four years ago — a stark contrast to Trump, who continues to say the election was stolen, even as voters are already casting their ballots in this year’s contest. \n\nEven before Vance was nominated to join the Republican presidential ticket, he cast similar doubts about the results and said he would not have certified the election results had he been in the Senate on Jan. 6, 2020. \n\n“If I had been vice president, I would have told the states like Pennsylvania, Georgia and so many others that we needed to have multiple slates of electors, and I think the U.S. Congress should have fought over it from there,” Vance said in an interview on ABC News’ “This Week” in February, before he joined Trump’s presidential ticket. \n\nOne of his most notable answers as the vice presidential nominee, however, came on the vice presidential debate stage this month, when his Democratic counterpart, Minnesota Gov. Tim Walz, pressed him about the outcome of the 2020 election. \n\n“Did he lose the 2020 election?” Walz asked. \n\n“Tim, I’m focused on the future,” Vance replied before he pivoted to again deride censorship on social media.\n\nMore recently, in a recent interview with The New York Times’ “The Interview” podcast, Vance declined five times to explicitly say whether Trump lost the 2020 election, pointing once more to censorship and posing a question to the show’s host: “Did big technology companies censor a story that independent studies have suggested would have cost Trump millions of votes?”\n\nLater at in his event in Williamsport, in response to a follow-up question about what he would need to see in November to say the 2024 election is secure, Vance said he is “not worried about it” because a lot of work has been done to “make sure that every legal ballot is cast and every legal ballot is counted.”","summary":"WILLIAMSPORT, Pa. — In his most direct answer yet about the 2020&#8230;","url":"https://internewscast.com/news/us/expressed-differently-choosing-my-words-carefully/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Not-by-the-words-I-would-use-800x430.jpg","video":null,"publish_date":"2024-10-16 23:35:16","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.381},{"id":259980928,"title":"Harris campaign calls plagiarism claims a partisan attack. Expert says it was ‘sloppy writing’ - The Associated Press","text":"WASHINGTON (AP) — Democratic presidential candidate Kamala Harris’ campaign is dismissing accusations that she and a co-author plagiarized parts of a 2009 book on the U.S. criminal justice system as a desperate attempt by “rightwing operatives” to distract voters. \n\nPlagiarism experts and academics who reviewed the claims said several were benign or could not be proven, and others were more due to careless writing than malicious intent. \n\nThe allegations surrounding the book, “Smart on Crime: A Career Prosecutor’s Plan to Make Us Safer,” surfaced Monday when conservative activist Christopher Rufo posted an article on his Substack platform that listed a handful of passages he said were copied from other sources without any or adequate attribution. \n\n“Taken in total, there is certainly a breach of standards here,” Rufo wrote. “Harris and her co-author duplicated long passages nearly verbatim without proper citation and without quotation marks, which is the textbook definition of plagiarism.”\n\nJames Singer, a spokesman for the Harris campaign, said in an emailed statement that the plagiarism allegations represent a partisan attack on a book Harris co-authored more than a decade ago.\n\n“Rightwing operatives are getting desperate as they see the bipartisan coalition of support Vice President Harris is building to win this election, as (former president Donald) Trump retreats to a conservative echo chamber refusing to face questions about his lies,” Singer wrote. “This is a book that’s been out for 15 years, and the vice president clearly cited sources and statistics in footnotes and endnotes throughout.” \n\nRufo’s article cited a new study of Harris’ 248-page book by Stefan Weber, an Austrian academic known in Europe as a “plagiarism hunter.” Among the findings, the book plagiarized a section from a Wikipedia article and made up a childhood anecdote that originated with Martin Luther King Jr., according to Weber. \n\nTrump’s running mate, Ohio Republican Sen. JD Vance, seized on the allegations to needle Harris.\n\n“Hi, I’m JD Vance. I wrote my own book, unlike Kamala Harris, who copied hers from Wikipedia,” he wrote on X. Vance’s 2016 memoir, Hillbilly Elegy recounts his blue-collar upbringing in Kentucky and Ohio.\n\nThe allegation involving King centers on a story Harris said her mother told her about a time when she was fussing as a toddler. Her mother, according to the book, asked her what was wrong and what she wanted. “I wailed back, ‘Fweedom,’” Harris wrote. Weber said Harris appropriated the anecdote, without attribution, from an interview King gave in 1965.\n\nBut other plagiarism experts questioned the severity of the claims. Jonathan Bailey, a consultant and publisher of the website Plagiarism Today, said in a Tuesday post that the King story allegation first arose in early 2021 and couldn’t be proven based on available evidence. But several other plagiarism accusations are more troublesome, he said, including Weber’s allegation that Harris’ book copied and pasted, without citation, a section of a Wikipedia article.\n\nBut the patterns in the book point to “sloppy writing habits, not a malicious intent to defraud,” he said.\n\n“Though some of the passages, such as the Wikipedia one, are sloppy to the point of negligence, when you look at the portion of the book involved, the nature of the issues, and the citations provided, negligence remains more likely than malice in my eyes,” Bailey wrote.\n\nMiguel Roig, a psychology professor at St. John’s University in New York who studies plagiarism in the sciences, said the lapses described by Weber meet the definition of plagiarism. But, he added, context is important. The problematic passages amount to a small total of the overall book and “hardly seems like an attempt to defraud,” he said.\n\n“Any time minor issues like these occur, the offending authors should simply acknowledge the obvious errors, apologize, and make corrections where feasible, and just move on,” Roig said.\n\nHarris wrote “Smart on Crime” when she was the district attorney for San Francisco. The book spelled out her ideas for improving public safety and making the criminal justice system more effective. In 2010, a year after the book was published, she was elected attorney general of California. \n\nHarris’ co-author, Joan O’C. Hamilton, works as a book collaborator and ghostwriter, according to her website. \n\nWeber, the plagiarism researcher in Austria, said in an email that much of the work to check Harris’s book was done by an associate whom he did not identify. But he said the associate was “driven by personal choice and interest, not by political motivations.” This was Weber’s first “international case,” he said.\n\nHe also said he was unaware until the Harris review had been released that Trump, the Republican presidential nominee, had published books.\n\n“Every scientist can feel free to check the books of Donald Trump or whomsoever as we did it with Kamala Harris,” Weber said.\n\nDebora Weber-Wulff, a professor of media and computing at Berlin University of Applied Sciences in Germany and no relation to Weber, sided with Bailey’s assessment and said the book’s publisher would have to decide whether any problems justify removing it from sales. Any legal action is unlikely because the original author of the plagiarized content would have to pursue a potentially costly lawsuit.\n\n“No one in their right mind would invite a suit like this,” Weber-Wulff said. “Only the lawyers profit.”","summary":"Harris campaign calls plagiarism claims a partisan attack. Expert says it was ‘sloppy writing’  The Associated Press","url":"https://apnews.com/article/kamala-harris-book-plagiarism-claim-d89b9b93282e00b49ea68852308e8e6c","image":"https://dims.apnews.com/dims4/default/9c00e47/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F5b%2Fe2424ca73da849fe655bc453e6a5%2F89e5ae65168c4851b52da05532eef4df","video":null,"publish_date":"2024-10-16 23:35:00","author":"Richard Lardner","authors":["Richard Lardner"],"language":"en","category":"politics","source_country":"us","sentiment":-0.459},{"id":259979524,"title":"Kamala Harris clearly has ZERO answers for the border crisis","text":"Kamala Harris doesn’t want to talk about the border, she doesn’t want to tell the truth about the border and, most important, she doesn’t have an answer for the border.\n\nThat’s the main takeaway from Fox News’ Bret Baier’s incisive questioning Wednesday night, which exposed Harris as an angry partisan with no other platform than “blame Donald Trump.”\n\nFinally facing an interviewer who wasn’t giving her hugs and cookies, Harris tried monologuing an irrelevant answer about the flood of illegal immigrants.\n\nWhen Baier called her out, she bristled, said “let me finish” and then continued to not answer the question.\n\nShe refused to take any responsibility. Admitted no errors.\n\nTen million people that we know of have crossed the border since Joe Biden and Kamala Harris took office and have been allowed to stay. \n\nMillions more came in unseen.\n\nWhy were so many allowed? \n\nWere they vetted? \n\nHow are we going to pay for it all? \n\nWill it continue if she’s president? \n\nBaier pointed out that 79% of Americans feel the country is on the wrong track, and it follows that Biden and Harris are responsible for that.\n\n“You’ve been in office for 3½ years,” Baier said.\n\n“And Donald Trump has been running for office since . . . ,” Harris answered.\n\n“But you’ve been the person holding the office, Madam Vice President.”\n\n“C’mon, you and I both know what I’m talking about,” she said.\n\n“I actually don’t,” Baier said, “what are you talking about?”\n\nShe didn’t explain. \n\nDoes anyone know?","summary":"Kamala Harris doesn’t want to talk about the border, she doesn’t want to tell the truth about the border and, most important, she doesn’t have an answer for the border.","url":"https://nypost.com/2024/10/16/opinion/kamala-harris-clearly-has-zero-answers-for-the-border-crisis/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/10/FOXNK.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-10-16 23:34:33","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":259979386,"title":"Housing remains Massachusetts voters’ top issue, more saying state is on ‘wrong track’: UMass Amherst/WCVB poll","text":"Housing remains a top issue for Massachusetts voters ahead of this year’s election, according to a new poll released by UMass Amherst and WCVB, as more residents report the state is on the “wrong track.”\n\nWhen asked what the most important problem facing the state is, residents overwhelmingly point to “‘housing’ but also mention economic related concerns such as ‘cost,’ ‘inflation,’ ‘affordable’ and ‘economy,’ ” said Tatishe Nteta, UMass Amherst professor of political science and director of the poll.\n\nThe latest UMass Amherst/WCVB poll showed an upswing in the number of respondents, 41%, saying the state is on the “wrong track,” the most in four years and a 5% increase from the last poll in May.\n\nThe poll surveyed 700 Massachusetts voters from Oct. 3 to 10.\n\nAmong the biggest issues facing Massachusetts, poll respondents reported housing, immigration, the economy, costs and inflation.\n\nNational concerns remained high, with 58% saying the country is on the “wrong track” and 28% saying its headed in the “right direction,” similar to results in the May poll. Three out of four respondents also expressed concerns about violence associated with the presidential elections.\n\n“Even in the solidly blue Bay State, there is clear concern about the state of the national economy and the direction of the country,” said poll co-director and political science associate professor Alexander Theodoridis. “In this environment, it is no surprise that both Kamala Harris and Donald Trump are jockeying to position themselves as the change candidate in this year’s presidential election.”\n\nElected officials, including Gov. Maura Healey, Sens. Ed Markey and Elizabeth Warren, and Kamala Harris, retained high approval ratings well over 50%.\n\nRespondents reported mixed blame for the housing crisis, with interest rates ranking worst, 22%, followed by landlords, local governments, the state Legislature and housing contractors and builders.\n\nThe state’s “right to shelter” migrant policy also remains an issue for voters, but the policy retains strong support in the state. Fifty-seven percent of voters expressed support for the policy and 25% expressed opposition, compared to 61% approval and 22% opposition in May.\n\nVoters were evenly split on the Healey administration’s change to the law limiting the number of families the state will grant shelter and the length they can remain in the shelter system. Respondents were evenly split on the impact, with 38% reporting the change was better for taxpayers and 38% saying it was worse.\n\n“Interestingly, while many have painted the right to shelter law as unpopular, we find majoritarian support for the law across gender, generational, educational, class and racial groups,” Nteta said, noting sole majority opposition among Republicans and Trump supporters. … “(I)t remains likely that the right to shelter will remain a fixture of the state’s response to immigration for the foreseeable future.”","summary":"Housing remains a top issue for Massachusetts voters ahead of this year's election, according to a new poll released by UMass Amherst and WCVB, as more residents report the state is on the \"wrong track.\"","url":"https://www.bostonherald.com/2024/10/16/housing-remains-massachusetts-voters-top-issue-more-saying-state-is-on-wrong-track-umass-amherst-wcvb-poll/","image":"https://www.bostonherald.com/wp-content/uploads/2019/05/umassce004-e1556898216518.jpg?w=1024","video":null,"publish_date":"2024-10-16 23:31:01","author":"Grace Zokovitch","authors":["Grace Zokovitch"],"language":"en","category":"politics","source_country":"US","sentiment":-0.189},{"id":259981642,"title":"Harris grilled on immigration in combative Fox interview","text":"WASHINGTON CROSSING, Pennsylvania >> Democratic Vice President Kamala Harris was grilled in a TV interview on Wednesday on the Biden administration’s efforts to tackle a surge in illegal immigration at the southern border, and laid the blame on Republicans for failing to pass a border bill. In a combative interview with Fox News host Bret Baier, Harris was asked to defend the administration’s early decision to reverse some of Republican rival Donald Trump’s restrictive policies, and to respond to a mother who testified in Congress about the loss of her child at the hands of an illegal immigrant.\n\n“I’m so sorry for her loss, but let’s talk about what is happening right now,” Harris said.\n\nHarris said Trump told Republicans to reject a bipartisan immigration bill because “he preferred to run on a problem instead of fixing a problem.” The interview was part of a direct appeal by Harris on Wednesday to Republican voters in this year’s U.S. presidential election, as she highlighted Republican support for her campaign in a battleground county in Pennsylvania before appearing on conservative-leaning Fox News.\n\nHarris was asked in the Fox News interview about her recent comment that there was “not a thing” she would change about the actions of the Biden administration, responding: “let me be very clear, my presidency will not be a continuation of Joe Biden’s presidency,” but she did not elaborate. Earlier, in Bucks County, outside of Philadelphia, Harris emphasized Trump’s attempt to overturn his election loss four years ago, when he lost the White House to current President Joe Biden.\n\nHarris said Trump’s actions violated the U.S. Constitution and, if given the chance, he will violate it again.\n\n“He refused to accept the will of the people and the results of a free and fair election. He sent a mob, an armed mob, to the United States Capitol, where they violently assaulted police officers, law enforcement officials and threatened the life of his own vice president,” Harris said. Over 100 Republicans joined Harris in Bucks County, including Adam Kinzinger, a former congressman and member of the committee that investigated the Jan. 6 attack on the U.S. Capitol by supporters of then-President Trump.\n\n“No matter your party, no matter who you voted for last time, there is a place for you in this campaign,” Harris said. Harris led Republican candidate Trump by a marginal 46% to 43% in a recent Reuters poll.\n\nTrump on Wednesday will participate in a town hall hosted by Univision. And Fox News aired a separate Trump town hall with an all-women audience.\n\nHarris has previously attempted to court voters disillusioned by Trump. Earlier this month, former Republican congresswoman Liz Cheney, daughter to former Vice President Dick Cheney, urged voters to put country over party and vote for Harris, saying that Trump was not fit to lead the U.S.\n\nShe reiterated on Wednesday her pledge to nominate a Republican for her cabinet, if elected.\n\nHarris’ speech took place near where George Washington and thousands of American soldiers crossed the Delaware River, setting up for a Revolutionary War victory over British troops, and came as early voting began in the area on Tuesday.\n\nBiden beat Trump in Bucks County by about 17,000 votes in the 2020 election, while former Secretary of State Hillary Clinton beat Trump in the 2016 election by under 3,000 votes, according to county data.\n\nThis summer, Republicans overtook Democrats in the number of voter registrations for the first time in a generation. Republicans currently have some 3,500 more voters in the county than Democrats, according to the latest data. She is also weighing joining the podcaster Joe Rogan, whose show reaches millions of men across the political spectrum, and who has joked that a “puppet master” was behind Harris’ strong debate performance against Trump.","summary":"WASHINGTON CROSSING, Pennsylvania >> Democratic Vice President Kamala Harris was grilled in a TV interview on Wednesday on the Biden administration&#8217;s efforts to tackle a surge in illegal immigration at the southern border, and laid the blame on Republicans for failing to pass a border bill. In a combative interview with Fox News host Bret Baier, Harris was asked to defend the administration&#8217;s early decision to reverse some of Republican rival Donald Trump&#8217;s restrictive policies, and to respond to a mother who testified in Congress about the loss of her child at the hands of an illegal immigrant.","url":"https://www.staradvertiser.com/2024/10/16/breaking-news/harris-grilled-on-immigration-in-combative-fox-interview/","image":"https://www.staradvertiser.com/wp-content/uploads/2024/10/web1_20241016_brk_tru02.jpg","video":null,"publish_date":"2024-10-16 23:30:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"US","sentiment":-0.136},{"id":259980420,"title":"'Apprentice' Star Says Donald Trump Losing 'to a Woman of Color Would be Devastating to His Ego’","text":"Author and reality star Omarosa Manigault Newman has recently announced her support for Kamala Harris. Given her past connection with Donald Trump, many were shocked by her choice. Newman is a former contestant of The Apprentice, who went on to become one of Trump's favorites. Later, at the Trump White House, she oversaw the communications division of the Office of Public Liaison. In 2017 she left her job and published her controversial memoir, titled- Unhinged: An Insider's Account of the Trump White House.\n\nAccording to a Variety article, while showing her support for Kamala, Newman said, \"Donald Trump has been defeated before, and I think what’s grating on his nerves the most is that this [next] defeat may come at the hands of a woman of color. He reserves his most vitriolic attacks for women of color. To lose to a woman of color would be devastating to his ego.\" She also feels that a victory for Harris would represent a powerful and transformative moment for young black girls and boys, as it would mark the first time a woman holds the position of commander in chief. “But to get this close is still so significant,\" she added, as reported by The Hill.\n\nThe reality star continued, \"I believe the nation will choose the leader they need at this time, and I believe that that leader is Vice President Kamala Harris.\" The interviewer then asked her about Trump's unrealized potential. Newman claimed that while writing her memoir, Unhinged, she gave this some thought. She said that Trump lost an opportunity to be a great leader who might have led the country into a better future, Talking about Trump's rambling, she said that anyone can see that his vocabulary is limited. He rambles and often says things that seem to come out of nowhere.\n\nIn her 2018 memoir Unhinged, Newman recalled her experiences from the Trump White House. She portrayed the former president as both 'racist' and 'mentally impaired', as reported by The Independent. Trump's campaign later took legal action against Newman. They claimed that Newman breached a non-disclosure agreement. Although Trump lost the case in September 2021, the two sides continued to argue over the details of the settlement. Newman has since expressed her concerns that a second Trump administration could be even more extreme and unrestrained than the first.\n\nTrump has previously encountered criticism from the author for his racial relations tactics. Earlier this year, Trump claimed that millions of immigrants brought in by Joe Biden were taking on \"black jobs.\" According to USA Today, Newman called Trump's comments outrageous and claimed that people are starting to understand that he would not be able to handle the country's racial issues. She was perhaps one of the most well-known Black personalities in the Trump White House.","summary":"Given her past connection with Donald Trump, many were shocked by her choice.","url":"https://www.inquisitr.com/apprentice-star-says-donald-trump-losing-to-a-woman-of-color-would-be-devastating-to-his-ego","image":"https://dab57h0r8ahff.cloudfront.net/720387/uploads/2829e6a0-8bb9-11ef-9ef4-b3f1461c8cc8_1200_630.jpeg","video":null,"publish_date":"2024-10-16 23:30:00","author":"INQUISITR,Simran Kumari","authors":["INQUISITR","Simran Kumari"],"language":"en","category":"politics","source_country":"US","sentiment":-0.285},{"id":259979570,"title":"Harris Talks About Using Taxes for Gender Reassignment Surgery for Inmates: I Will Consider it, Similar to Trump, but it’s not a priority and could be causing anxiety.","text":"During an interview with the Fox News Channel’s “Special Report” on Wednesday, 2024 Democratic presidential candidate Vice President Kamala Harris responded to a question on if she still supports taxpayer dollars paying for gender transition surgeries for federal prisoners or detained migrants by stating that she’ll “follow the law” just as her Republican opponent, former President Donald Trump did during her administration to provide such surgeries, when medically needed to those in the federal prison system and Trump is “trying to create a sense of fear in the voters…on an issue that, as it relates to the biggest issues that affect the American people, it’s really quite remote.”\n\nHost Bret Baier asked, “So, are you still in support of using taxpayer dollars to help prison inmates or detained illegal aliens to transition to another gender?”\n\nHarris answered, “I will follow the law. And it’s a law that Donald Trump actually followed. You’re probably familiar with, now, it’s a public report, that, under Donald Trump’s administration, these surgeries were available to — on a medical necessity basis — to people in the federal prison system. And I think, frankly, that ad from the Trump campaign is a little bit of like throwing stones when you’re living in a glass house.”","summary":"During an interview with the Fox News Channel’s “Special Report” on Wednesday,&#8230;","url":"https://internewscast.com/news/harris-talks-about-using-taxes-for-gender-reassignment-surgery-for-inmates-i-will-consider-it-similar-to-trump-but-its-not-a-priority-and-could-be-causing-anxiety/","image":"https://internewscast.com/wp-content/uploads/2024/10/rewrite-this-title-Harris-on-Tax-Funded-Sex-Changes-Ill-Do.jpg","video":null,"publish_date":"2024-10-16 23:29:15","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.055},{"id":259979618,"title":"Harris’ interview with Fox News is marked by testy exchanges over immigration and more","text":"By ZEKE MILLER\n\nWASHINGTON (AP) — Vice President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy positions while asserting that if elected, she would not represent a continuation of Joe Biden’s presidency.\n\nHarris’ interview with Fox’s Bret Baier marked her first foray onto the network, which is popular with conservative viewers, as she looked to broaden her outreach to GOP-leaning voters with less than three weeks until Election Day. Her nearly-30 minute sit-down with Baier repeatedly grew heated, with the two talking over each other, as he pressed her on immigration and her changing policy stances since her first run for president in 2020.\n\nWhen Baier kept talking as Harris tried to respond to his challenges on immigration, Harris told him, “May I please finish. … You have to let me finish please.”\n\nHarris tried repeatedly to pivot the conversation to attacking Donald Trump. But she also had plenty to say about herself.\n\nA week after saying she couldn’t think of any move made by Biden that she would have done differently, Harris asserted that “My presidency will not be a continuation of Joe Biden’s presidency.”\n\nHarris did not offer specifics, but said, “Like every new president that comes into office, I will bring my life experiences, and my professional experiences and fresh and new ideas.”\n\nAsked to clarify her assertion that she wants to “turn the page,” though Democrats currently hold the White House, Harris said she is running on “turning the page from the last decade in which we have been burdened with the kind of rhetoric coming from Donald Trump.”\n\nOn immigration, Harris expressed regret over the deaths of women who were killed by people who were detained and then released after crossing into the U.S. illegally during the Biden administration, but she criticized Trump for his role in blocking a bipartisan immigration bill earlier this year that would have boosted border funding.\n\n“I am so sorry for her loss, sincerely,” Harris said after Baier played footage of the mother of Jocelyn Nungaray blaming Biden and Harris for her daughter’s death.\n\nHarris indicated she no longer supports decriminalizing crossing the border illegally, as she did in 2019.\n\n“That was five years ago and I am very clear that I will follow the law,” she said. She gave the same answer about proposals to allow those in the U.S. illegally to get driver’s licenses and subsidized healthcare.\n\nShe also sought to focus Fox viewers on Trump’s talk of “the enemy within” and threats to punish political rivals.\n\nBaier challenged Harris over her attestations to Biden’s mental stamina after his disastrous debate with Trump in June that forced his exit from the 2024 presidential race and her elevation to the top of the ticket. She again defended Biden, but added, “Joe Biden is not on the ballot and Donald Trump is.”\n\nTrump’s campaign spokesperson Karoline Leavitt said Harris was “angry, defensive, and once again abdicated any responsibility for the problems Americans are facing.” She added, that if “Kamala can’t handle the pressure of an interview with Fox News—she certainly can’t handle the pressure of being president of the United States.”\n\nPushing back against Baier’s line of questioning at times, Harris at one point told her interviewer, “I would like if we could have a conversation that is grounded in a full assessment of the facts.”","summary":"Her nearly-30 minute sit-down with Baier repeatedly grew heated as he pressed her on immigration and her changing policy stances since her first run for president in 2020.","url":"https://www.bostonherald.com/2024/10/16/kamala-harris-fox-news-interview/","image":"https://www.bostonherald.com/wp-content/uploads/2024/10/Election_2024_Harris_64297.jpg?w=1024","video":null,"publish_date":"2024-10-16 23:26:51","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":-0.304},{"id":259980666,"title":"Harris’ interview with Fox News is marked by testy exchanges over immigration and more","text":"By ZEKE MILLER\n\nWASHINGTON (AP) — Vice President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy positions while asserting that if elected, she would not represent a continuation of Joe Biden’s presidency.\n\nHarris’ interview with Fox’s Bret Baier marked her first foray onto the network, which is popular with conservative viewers, as she looked to broaden her outreach to GOP-leaning voters with less than three weeks until Election Day. Her nearly-30 minute sit-down with Baier repeatedly grew heated, with the two talking over each other, as he pressed her on immigration and her changing policy stances since her first run for president in 2020.\n\nWhen Baier kept talking as Harris tried to respond to his challenges on immigration, Harris told him, “May I please finish. … You have to let me finish please.”\n\nHarris tried repeatedly to pivot the conversation to attacking Donald Trump. But she also had plenty to say about herself.\n\nA week after saying she couldn’t think of any move made by Biden that she would have done differently, Harris asserted that “My presidency will not be a continuation of Joe Biden’s presidency.”\n\nHarris did not offer specifics, but said, “Like every new president that comes into office, I will bring my life experiences, and my professional experiences and fresh and new ideas.”\n\nAsked to clarify her assertion that she wants to “turn the page,” though Democrats currently hold the White House, Harris said she is running on “turning the page from the last decade in which we have been burdened with the kind of rhetoric coming from Donald Trump.”\n\nOn immigration, Harris expressed regret over the deaths of women who were killed by people who were detained and then released after crossing into the U.S. illegally during the Biden administration, but she criticized Trump for his role in blocking a bipartisan immigration bill earlier this year that would have boosted border funding.\n\n“I am so sorry for her loss, sincerely,” Harris said after Baier played footage of the mother of Jocelyn Nungaray blaming Biden and Harris for her daughter’s death.\n\nHarris indicated she no longer supports decriminalizing crossing the border illegally, as she did in 2019.\n\n“That was five years ago and I am very clear that I will follow the law,” she said. She gave the same answer about proposals to allow those in the U.S. illegally to get driver’s licenses and subsidized healthcare.\n\nShe also sought to focus Fox viewers on Trump’s talk of “the enemy within” and threats to punish political rivals.\n\nBaier challenged Harris over her attestations to Biden’s mental stamina after his disastrous debate with Trump in June that forced his exit from the 2024 presidential race and her elevation to the top of the ticket. She again defended Biden, but added, “Joe Biden is not on the ballot and Donald Trump is.”\n\nTrump’s campaign spokesperson Karoline Leavitt said Harris was “angry, defensive, and once again abdicated any responsibility for the problems Americans are facing.” She added, that if “Kamala can’t handle the pressure of an interview with Fox News—she certainly can’t handle the pressure of being president of the United States.”\n\nPushing back against Baier’s line of questioning at times, Harris at one point told her interviewer, “I would like if we could have a conversation that is grounded in a full assessment of the facts.”","summary":"Her nearly-30 minute sit-down with Baier repeatedly grew heated as he pressed her on immigration and her changing policy stances since her first run for president in 2020.","url":"https://www.sandiegouniontribune.com/2024/10/16/kamala-harris-fox-news-interview/","image":"https://www.sandiegouniontribune.com/wp-content/uploads/2024/10/Election_2024_Harris_64297.jpg?w=1024","video":null,"publish_date":"2024-10-16 23:26:51","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"US","sentiment":-0.304},{"id":259981958,"title":"Confronted by a Republican voter about the Jan. 6 riot, Trump says 'nothing' was done wrong that day","text":"Donald Trump on Wednesday shrugged off the idea that his conduct on Jan. 6, 2021, should cost him the backing of Republican voters after a former supporter confronted him at a televised town hall and said he would not cast a ballot for the former president because of his actions that day. In his response at the Univision event, Trump also distanced himself from the attack on the Capitol while minimizing the damage done by a mob of his supporters. \"Nothing done wrong at all,\" Trump said in a lengthy response after a Republican voter from Florida said he had lost his vote because of his responses to the riot and the Covid pandemic. The voter also questioned why he should support Trump when so many people who held high positions in his administration, including former Vice President Mike Pence, weren't backing him this year. Trump said only \"a very small portion\" don't support him. \"But because it’s me, somebody doesn’t support they get a little publicity,\" he said. \"The vice president, I disagree with him on what he did. I totally disagreed with him on what he did,\" Trump said, apparently referring to Pence's refusal to comply with his demands that he prevent Congress from certifying Joe Biden’s election win on Jan. 6. He then argued that the thousands of supporters who went to Washington for Jan. 6 were not there because of him, even though he tweeted on Dec. 19, 2020: “Big protest in D.C. on January 6th. Be there, will be wild.” \"They didn't come because of me,\" Trump said Wednesday. \"They came because of the election. They thought the election was a rigged election, and that's why they came.\" In 2020, and in the years since then, Trump has falsely claimed that the election was stolen. Many of those charged in the Jan. 6 riot have cited his election lies. On Wednesday, Trump described how some of the people who went to hear him speak outside the White House on Jan. 6 then \"went down to the Capitol.\" Trump did not mention that he had asked them to do so and that he had indicated he would join them. \"We’re going to walk down to the Capitol, and we’re going to cheer on our brave senators and congressmen and women. And we’re probably not going to be cheering so much for some of them, because you’ll never take back our country with weakness. You have to show strength, and you have to be strong,\" he told the crowd on Jan. 6. \"We have come to demand that Congress do the right thing and only count the electors who have been lawfully slated.\" He added, \"I know that everyone here will soon be marching over to the Capitol building to peacefully and patriotically make your voices heard.\" Trump, as he has done before, leaned into his reference to the latter remark at the town hall. \"I said 'peacefully and patriotically.' Nothing done wrong at all,\" he said at the taped town hall, which is set to air at 10 p.m. ET. His attorneys have also highlighted the \"peacefully and patriotically\" line from his fiery speech in federal court filings in Washington, where he is defending himself against charges that he tried to illegally overturn the election results, including by provoking the assault on the Capitol. Prosecutors have taken a different view. The \"defendant willfully caused his supporters to obstruct and attempt to obstruct the proceeding by summoning them to Washington, D.C., and then directing them to march to the Capitol to pressure the Vice President and legislators to reject the legitimate certificates and instead rely on the fraudulent electoral certificates,” special counsel Jack Smith’s team countered in a filing Wednesday. Trump has pleaded not guilty to the charges against him in Washington and in another election interference case in Georgia. At the town hall, Trump also called Jan. 6, when rioters who delayed the electoral vote count for hours injured over 140 police officers, as \"a day of love.\" \"There were no guns down there. We didn’t have guns. The others had guns, but we didn’t have guns. And when I say we, these are people that walked down — this was a tiny percentage of the overall which nobody sees and nobody, nobody shows. But that was a day of love,\" he said. Testimony before the House Jan. 6 committee alleged Trump was aware that many in the crowd were armed with an array of weapons, including guns, before the march to the Capitol. Among rioters who were proven to have carried firearms are Christopher Alberts, who was sentenced to seven years in prison; Mark Mazza, who carried two guns and was sentenced to five years in federal prison; and Guy Reffitt, who was sentenced to seven years behind bars. Another defendant awaiting trial fired his weapon into the air twice at the start of the assault, according to prosecutors. In an interview with Bloomberg editor-in-chief John Micklethwait on Tuesday, Trump said the number of people who went to the Capitol was \"very, very small,\" putting the total number at 500 to 700. \"Not one of those people had a gun,\" he said. He also described the scene at his speech that day as \"love and peace, and some people went to the Capitol, and a lot of strange things happened there.\" More than 1,500 people have been charged in connection with the storming of the Capitol, according to the Justice Department. About 1,100 have been convicted, with sentences ranging from a few days of incarceration to 22 years in federal prison. Trump has referred to the Jan. 6 rioters as “political prisoners,” “hostages,” and “unbelievable patriots” and said he would pardon at least “a large portion” of them as one of his first acts in office if he is elected in November.","summary":"At the Univision town hall, Trump also referred to the attack on the Capitol, which saw more than 140 police officers assaulted, as a \"day of love.\"","url":"https://www.nbcnews.com/politics/2024-election/trump-says-nothing-was-done-wrong-jan-6-republican-voter-confronts-rcna175755","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-03/240308-jan6-ch-1626-7e8cb6.jpg","video":null,"publish_date":"2024-10-16 23:25:19","author":"Dareh Gregorian,Nnamdi Egwuonwu","authors":["Dareh Gregorian","Nnamdi Egwuonwu"],"language":"en","category":"politics","source_country":"us","sentiment":-0.549},{"id":259979406,"title":"Kamala Harris repeatedly pivots to Trump when grilled on immigration record in Fox News interview","text":"Vice President Kamala Harris repeatedly dodged several questions about her administration's immigration record and instead pivot to former President Trump during an interview with Fox News' Bret Baier. Baier began the interview Wednesday by asking Harris how many illegal immigrants were released by the Biden administration into the country. \"Well, I'm glad you raised the issue of immigration, because I agree with you,\" Harris responded. It is a topic of discussion that people want to rightly have. And you know what I'm going to talk about-\" \"But just a number,\" Baier pressed. \"Do you think it's 1 million? 3 million?\" \"Bret, let's just get to the point, ok?\" Harris said. \"The point is that we have a broken immigration system that needs to be repaired.\" LAKEN RILEY ACT SPONSOR BLASTS BILL CLINTON'S CLAIM ABOUT GEORGIA STUDENT'S DEATH After Baier invoked DHS estimated that 6 million illegal immigrants had been released into the country, he then pressed her about the Biden administration's decision to reverse Trump-era policies like Remain in Mexico and how that decision is linked to the release of violent criminals. \"So looking back, do you regret the decision to terminate Remain in Mexico at the beginning of your administration?\" Baier asked. Harris responded by highlighting the Biden administration's first legislative push, which was immigration reform, and accused Trump of killing a bipartisan immigration bill. KAMALA HARRIS DODGES COLBERT'S QUESTION ON WHAT ‘MAJOR CHANGES’ SHE'D BRING VERSUS BIDEN PRESIDENCY The \"Special Report\" anchor then turned to the high-profile murders of Jocelyn Nungaray, Rachel Morin and Lake Riley, all victims at the hands of violent illegal immigrants who entered the country during the Biden administration. \"This is a specific policy decision by your administration to release these men into the country,\" Baier said. \"So what I'm saying to you, do you owe those families an apology?\" \"Let me just say- first of all, those are tragic cases. There's no question about that. There's no question about that,\" Harris said. \"And I can't imagine the pain that the families of those victims have experienced for a loss that should not have occurred. So that is true. It is also true that if [the border security bill] had actually been passed nine months ago, it would be nine months that we would have had more border agents at the border, more support for the folks who are working around the clock trying to hold it all together to ensure that no future harm would occur.\" KAMALA HARRIS TELLS ‘THE VIEW’ SHE CAN'T THINK OF ANYTHING SHE WOULD HAVE DONE DIFFERENTLY FROM BIDEN \"Madam Vice President, it was a policy decision in the early part of your administration,\" Baier later pressed before turning to testimony from Jocelyn Nungaray's mother, who said the Biden-Harris administration was responsible for her daughter's murder. \"So do you owe them an apology is what I'm saying,\" Baier again asked. \"I will tell you that I'm so sorry for her loss. I'm so sorry for her loss. Sincerely. But let's talk about what is happening right now with an individual who does not want to participate in solutions,\" Harris responded. \"Let's talk about that as well. In all fairness, I told you I feel awful for what she and her family have experienced.\" CLICK HERE TO GET THE FOX NEWS APP \"You said repeatedly that the border was secure, when in your mind, did it start becoming a crisis?\" Baier then asked. \"We've had a broken immigration system transcending, by the way, Donald Trump's administration, even before. Let's all be honest about that,\" Harris said. \"I have no pride in saying that this is a perfect immigration system. I've been clear. I think we all know that it needs to be fixed. We need more- I was just down at the border talking with border agents… we need more judges. We need to process those cases faster. We need the support for cases that should be prosecuted. They need more resources, and Congress, ultimately, is the only place that that's going to get fixed, Bret. That's how this system works.\" When Baier asked Harris if she still supports taxpayer-funded transgender surgeries for illegal immigrants who are in custody, Harris pivoted to Trump. \"I will follow a law. A law that Donald Trump actually followed. You're probably familiar with now, it's a public report, that under Donald Trump's administration, these surgeries were available to, on a medical necessity basis, to people in the federal prison system. And I think, frankly, that ad from the Trump campaign is a little bit of like throwing, you know, stones when you are living in a glass house,\" she responded.","summary":"During her interview with Fox News&apos; Bret Baier, Vice President Kamala Harris repeatedly dodged questions about her administration&apos;s immigration record.","url":"https://www.foxnews.com/media/kamala-harris-repeatedly-pivots-trump-when-grilled-immigration-record-fox-news-interview","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/931/523/baierharris.jpg?ve=1&tl=1","video":null,"publish_date":"2024-10-16 23:22:29","author":"Joseph Wulfsohn","authors":["Joseph Wulfsohn"],"language":"en","category":"politics","source_country":"US","sentiment":-0.32},{"id":259983320,"title":"Peso depreciates against US dollar for third straight day","text":"The Mexican peso continued to depreciate against the US dollar on Wednesday morning, losing ground for a third consecutive day to reach an exchange rate of almost 20 pesos to the greenback.\n\nAt 5 p.m. Mexico City time, one dollar was trading at 19.91 pesos, according to Bloomberg.\n\nThe peso closed at 19.69 to the dollar on Tuesday, according to the Bank of Mexico.\n\nDonald Trump’s tariff threats, a general strengthening of the dollar and a lower growth forecast for the Mexican economy from the International Monetary Fund are among the reasons why the peso has depreciated this week after closing at around 19.30 to the greenback last Friday.\n\nIn an interview at the Economic Club of Chicago on Tuesday, former president Trump repeated his threat to impose hefty tariffs on vehicles imported to the United States from Mexico if he wins the Nov. 5 presidential election in the U.S.\n\nHe even cited a figure of 2,000%, although in subsequent remarks he only went as high as 300%.\n\n“I’m going to put the highest tariff in history, meaning I’m going to stop them from ever selling a car into the United States,” said the Republican Party presidential candidate, who also asserted that “the most beautiful word in the dictionary is tariff.”\n\n“… China is building massive auto plants in Mexico. And they’re going to build them, and they’re going to take those cars and sell them into the United States,” he said.\n\nForeign exchange news website FX Street reported that the peso “depreciated over 1.60% against the US dollar on Tuesday after Donald Trump threatened to whack prohibitory tariffs on Mexican-made autos entering the US market.”\n\nFX Street reported that the peso also “depreciated in early trading on Wednesday as the US dollar strengthened amid a mixed market mood with falling U.S. Treasury yields.”\n\nThe peso has depreciated significantly since the comprehensive victory of President Claudia Sheinbaum and the ruling Morena party at Mexico’s June 2 elections.\n\nA major factor in the currency’s decline in recent months has been concern over the government’s judicial reform, which was approved by a Morena-dominated Congress in September and signed into law by former president Andrés Manuel López Obrador just before he left office.\n\nSince the peso reached its strongest position this year — 16.30 to the dollar in April — the Mexican currency has depreciated by more than 18%.\n\nLast month it depreciated to above 20 to the dollar for the first time since October 2022.\n\nWith reports from El Economista, Aristegui Noticias and FX Street","summary":"The peso continues to falter versus the US dollar this week after closing at around 19.30 pesos to the greenback on Friday.\n\n\nThe post Peso depreciates against US dollar for third straight day appeared first on Mexico News Daily","url":"https://mexiconewsdaily.com/news/peso-depreciates-against-us-dollar/","image":"https://mexiconewsdaily.com/wp-content/uploads/2024/10/marco-antonio-casique-reyes-4VryY2jhQAI-unsplash.jpg","video":null,"publish_date":"2024-10-16 23:22:22","author":"MND Staff","authors":["MND Staff"],"language":"en","source_country":"mx","sentiment":-0.331},{"id":259981868,"title":"Harris' interview with Fox News is marked by testy exchanges over immigration and more","text":"WASHINGTON - \n\n U.S. Vice-President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy positions while asserting that if elected, she would not represent a continuation of Joe Biden's presidency.\n\n The information you need to know, sent directly to you: Download the CTV News App \n\n Harris’ interview with Fox’s Bret Baier marked her first foray onto the network, which is popular with conservative viewers, as she looked to broaden her outreach to GOP-leaning voters with less than three weeks until Election Day. Her nearly-30 minute sitdown with Baier repeatedly grew heated, with the two talking over each other, as he pressed her on immigration and her changing policy stances since her first run for president in 2020.\n\n When Baier kept talking as Harris tried to respond to his challenges on immigration, Harris told him, \"May I please finish. ... You have to let me finish please.”\n\n Harris tried repeatedly to pivot the conversation to attacking Donald Trump. But she also had plenty to say about herself.\n\n A week after saying she couldn’t think of any move made by Biden that she would have done differently, Harris asserted that “My presidency will not be a continuation of Joe Biden’s presidency.”\n\n Harris did not offer specifics, but said, “Like every new president that comes into office, I will bring my life experiences, and my professional experiences and fresh and new ideas.”\n\n Asked to clarify her assertion that she wants to “turn the page,” though Democrats currently hold the White House, Harris said she is running on “turning the page from the last decade in which we have been burdened with the kind of rhetoric coming from Donald Trump.”\n\n This combination photo shows Vice-President Kamala Harris, left, at the White House in Washington, July 22, 2024, and Republican presidential candidate former President Donald Trump at an event July 26, 2024, in West Palm Beach, Fla. (AP Photo)\n\n On immigration, Harris expressed regret over the deaths of women who were killed by people who were detained and then released after crossing into the U.S. illegally during the Biden administration, but she criticized Trump for his role in blocking a bipartisan immigration bill earlier this year that would have boosted border funding.\n\n “I am so sorry for her loss, sincerely,” Harris said after Baier played footage of the mother of Jocelyn Nungaray blaming Biden and Harris for her daughter's death.\n\n Harris indicated she no longer supports decriminalizing crossing the border illegally, as she did in 2019.\n\n America Votes: Latest U.S. election news and analysis from a Canadian perspective \n\n “That was five years ago and I am very clear that I will follow the law,” she said. She gave the same answer about proposals to allow those in the U.S. illegally to get driver's licenses and subsidized healthcare.\n\n Of Trump, she said, “People are exhausted with someone who professes to be a leader and who spends full time demeaning and engaging in personal grievances.\" She added, \"He’s not stable.\"\n\n She also sought to focus Fox viewers on Trump's talk of \"the enemy within” and threats to punish political rivals.\n\n Baier challenged Harris over her attestations to Biden's mental stamina after his disastrous debate with Trump in June that forced his exit from the 2024 presidential race and her elevation to the top of the ticket. She again defended Biden, but added, “Joe Biden is not on the ballot and Donald Trump is.”\n\n Trump's campaign spokesperson Karoline Leavitt said Harris was “angry, defensive, and once again abdicated any responsibility for the problems Americans are facing.” She added, that if \"Kamala can’t handle the pressure of an interview with Fox News—she certainly can’t handle the pressure of being president of the United States.”\n\n Pushing back against Baier's line of questioning at times, Harris at one point told her interviewer, “I would like if we could have a conversation that is grounded in a full assessment of the facts.”","summary":"U.S. Vice-President Kamala Harris engaged in a combative first interview with Fox News on Wednesday, sparring on immigration policy and shifting policy positions while asserting that if elected, she would not represent a continuation of Joe Biden's presidency.","url":"https://www.ctvnews.ca/world/harris-interview-with-fox-news-is-marked-by-testy-exchanges-over-immigration-and-more-1.7076187","image":"https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/16/kamala-harris-fox-news-interview-1-7076201-1729120659244.jpg","video":null,"publish_date":"2024-10-16 23:22:11","author":"The Associated Press,Zeke Miller","authors":["The Associated Press","Zeke Miller"],"language":"en","source_country":"CA","sentiment":-0.361},{"id":259979740,"title":"A man arrested with guns outside a Trump rally in California is suing the sheriff - The Associated Press","text":"LAS VEGAS (AP) — A Nevada man who was arrested over the weekend with guns at a security checkpoint outside a Donald Trump rally in the southern California desert has filed a lawsuit accusing the sheriff of falsely characterizing his arrest as a thwarted assassination attempt for his own personal gain.\n\nThe man, identified as 49-year-old Vem Miller of Las Vegas, had been driving an unregistered black SUV with a “homemade” license plate when he was stopped by deputies assigned to the rally in Coachella, east of Los Angeles, Riverside County Sheriff Chad Bianco said Sunday at a news conference.\n\nMiller had a shotgun, loaded handgun, ammunition and several fake passports in his vehicle, Bianco said. Miller was released the same day on $5,000 bail.\n\nThe lawsuit filed Tuesday in U.S. District Court in Nevada says Bianco lied about the fake passports, and that he “created a narrative so as to be viewed as a ‘heroic’ Sheriff who saved Presidential candidate Trump.” It names as defendants the sheriff, the Riverside County Sheriff’s Department and a sheriff’s deputy.\n\nA call to the sheriff’s executive office for comment Wednesday was deferred to the department’s communications office, which did not respond to an email. The Associated Press also emailed Miller’s lawyer, Sigal Chattah, for comment.\n\nSecurity is very tight at Trump rallies following two recent assassination attempts. Last month, a man was indicted on an attempted assassination charge after authorities said he staked out the former president for 12 hours and wrote of his desire to kill him. The Florida arrest came two months after Trump was shot and wounded in the ear during a campaign rally in Pennsylvania.\n\nBianco said that Miller also claimed to be a journalist, but that it was unclear if he had the proper credentials. Deputies noticed the interior of the vehicle was “in disarray” and a search uncovered the weapons and ammo, along with multiple passports and driver licenses with different names, Bianco said.\n\nMiller’s lawsuit accuses the sheriff’s department of illegally searching the SUV. It also says that he willingly disclosed to officers at the checkpoint that he had weapons but intended to leave them in the vehicle.\n\nMiller is scheduled to appear in court in January in the weapons case. He was arrested on suspicion of possessing a loaded firearm and possession of a high-capacity magazine, according to online records.","summary":"A man arrested with guns outside a Trump rally in California is suing the sheriff  The Associated Press","url":"https://apnews.com/article/trump-rally-arrest-lawsuit-coachella-california-dd6aa7104d3cb6c4e9a3a7509d3c4307","image":"https://dims.apnews.com/dims4/default/a1199fe/2147483647/strip/true/crop/4640x2610+0+242/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fff%2Fad%2F7cd981775655d97a7614f2a69743%2F9a4ceaa19ae24db59b86de434fc0c1e9","video":null,"publish_date":"2024-10-16 23:22:00","author":"Hurricane Helene","authors":["Hurricane Helene"],"language":"en","source_country":"us","sentiment":-0.346}]}