{"offset":0,"number":50,"available":11605,"news":[{"id":272752146,"title":"Kyodo News Digest: Dec. 13, 2024","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nSouth Korea's Yoon defends martial law decree, denies insurrection charge\n\nSEOUL - South Korean President Yoon Suk Yeol on Thursday said he declared martial law last week to defend constitutional order, while denying accusations of inciting an insurrection.\n\nYoon's televised address came as a probe continues into his short-lived martial law decree on Dec. 3 that has sparked fury across the country.\n\nWAKAYAMA, Japan - A Japanese court on Thursday acquitted a 28-year-old woman of murdering her wealthy elderly husband who called himself the \"Don Juan\" of the western Japan area where he lived, ruling it could not discount that he may have mistakenly taken a lethal dose of illegal stimulant drugs.\n\nSaki Sudo was charged with causing 77-year-old Kosuke Nozaki to ingest a lethal amount of a stimulant on May 24, 2018, just months after they got married, according to the indictment. Sudo denied the charges, saying she did not kill her former husband.\n\nJapan big makers' confidence improves to 14 in Dec. from 13: BOJ\n\nTOKYO - Business confidence among major Japanese manufacturers improved to 14 in December from 13 three months earlier, the Bank of Japan's Tankan survey showed Friday.\n\nThe sentiment index for companies such as carmakers and technology companies was higher than the average market forecast of 12 in a Kyodo News survey.\n\nTOKYO - A Russia-linked hacking group e-mailed multiple executives of Japanese publisher Kadokawa Corp. that it had received $2.98 million in cryptocurrency from the firm after it was hit by a massive cyberattack in June, a company source said Thursday.\n\nAn investigation by security firm Unknown Technologies Inc. commissioned by Kyodo News found online records of a transaction worth $2.98 million made the same month. The hacking group, purporting to be the Russia-linked BlackSuit ransomware gang, ultimately leaked the stolen information.\n\nChina vows proactive fiscal steps, looser monetary policy for 2025\n\nBEIJING - China has pledged to implement more proactive fiscal steps and looser monetary policy next year to maintain stable economic growth, state-run media said Thursday, as the world's second-largest economy braces for more tensions with the United States under incoming president Donald Trump.\n\nAt a two-day annual meeting through Thursday to craft economic plans for 2025, the Chinese leadership has called for \"more proactive macroeconomic policies\" including the issuance of more bonds, allowing an increase in the budget deficit and cutting interest rates in a timely manner.\n\nTrump selected as Time's Person of the Year for 2nd time\n\nNEW YORK - Republican U.S. President-elect Donald Trump has been selected as Time's Person of the Year, the magazine said Thursday, marking the second time for the polarizing figure to be given the title.\n\nThe 78-year-old Republican was chosen after a tumultuous year in which he was found guilty on felony charges in a New York court over falsifying business records, survived an assassination attempt in Pennsylvania and decisively defeated his Democratic opponent Vice President Kamala Harris in the Nov. 5 election.\n\nTOKYO - The Japanese government and ruling parties are arranging to raise the income cap on earnings by a householder's dependent offspring to qualify householders for tax deductions to 1.50 million yen ($9,900) from 1.03 million yen, possibly starting next year, sources close to the matter said Thursday.\n\nThe plan comes as the ruling bloc, led by Prime Minister Shigeru Ishiba's Liberal Democratic Party, has accepted several demands from an opposition party whose cooperation it is seeking in parliament after the coalition lost its majority in the House of Representatives in October's general election.\n\nTOKYO - The Japan Football Association on Thursday named Dane Nils Nielsen as the first foreign manager of the women's national team.\n\nThe 53-year-old takes up the role vacated by Futoshi Ikeda, who led Nadeshiko Japan to the quarterfinals of both the 2023 World Cup and this summer's Paris Olympics. Nielsen previously managed Denmark's women's national team as well as that of Switzerland.\n\nVideo: All Nippon Airways plane to promote 2025 World Expo","summary":"Photo taken on Nov. 12, 2024, shows Christmas trees decorated with crystal glass set up for displa...","url":"https://english.kyodonews.net/news/2024/12/6dfd9acddbe2-kyodo-news-digest-dec-13-2024.html","image":"https://img.kyodonews.net/english/public/images/posts/f4cf8de32aea8297bd4f97e9209847cf/photo_l.jpg","video":null,"publish_date":"2024-12-13 01:17:03","author":null,"language":"en","source_country":"jp","sentiment":-0.287},{"id":272751520,"title":"Tribes help boost Lake Mead water supply, hope for lame duck passage of $5B federal water act","text":"By Jeniffer Solis Nevada Current\n\nSince 2021, a handful of Colorado River Basin tribes have significantly boosted water supply in Lake Mead through voluntary contributions, helping stabilize a crucial reservoir that 25 million people rely on.\n\nThe consequences of a two-decade drought in the west and a shrinking river have given tribes leverage in negotiations over how the river’s water is managed, and persuaded the federal government to pay tribes to conserve water while funding millions in additional infrastructure. \n\nMore conservation arrangements with tribes were reached last week, after tribes met with the Bureau of Reclamation during the annual Colorado River Water Users Association conference to extend water-saving agreements that will conserve another 43,000 acre feet of water in Lake Mead, or enough water to serve about 14,000 households for a year.\n\nThe San Carlos Apache Tribe in southeastern Arizona agreed to leave 30,000 acre feet in Lake Mead in exchange for $12 million from the federal government. The Fort Yuma Quechan Indian Tribe along the Arizona-California border also signed an agreement to conserve 13,000 acre feet of Lake Mead water for $5.2 million.\n\nThose investments build on other historic water-saving agreements with Colorado River Basin tribes in recent years designed to boost water levels in Lake Mead. \n\nLast year, the Gila River Indian Community in Arizona received $50 million from the Inflation Reduction Act in exchange for agreeing to leave 125,000 acre feet of water in Lake Mead, adding about two feet of water to the reservoir. The Gila River Indian Community committed to similar water savings this year and in 2025 for an additional $100 million in funding, conserving enough water to supply half a million homes.\n\nIn September, the Gila River Indian Community also received $107 million from the Inflation Reduction Act for three separate water conservation infrastructure projects, after agreeing to leave an additional 73,000 acre-feet of water in Lake Mead over the next decade.\n\nDuring the annual Colorado River Water Users Association conference last week, the Bureau of Reclamation also announced an agreement with the Colorado River Indian Tribes to fund a $5 million study on constructing a new reservoir that could save up to 35,000 acre feet for the tribe, and help them develop their water rights.\n\nAdditionally, the Bureau of Reclamation announced $21.5 million in funding from the Inflation Reduction Act last week to help the White Mountain Apache Tribe in Arizona plan and design a rural water delivery system.\n\nThe Biden administration committed more than $6 billion to support water infrastructure in Tribal communities between the Bipartisan Infrastructure Law and Inflation Reduction Act, but any future funding will likely depend on what President-elect Donald Trump chooses to do with unspent funds.\n\nDuring the campaign Trump said he would claw back unspent IRA funding.\n\nLooking to the lame duck\n\nTribal communities also hope Congress passes and the president signs into law substantial federal water project legislation before the new Congress is sworn in and Trump is inaugurated.\n\nThe $5 billion Northeastern Arizona Indian Water Rights Settlement Act that would secure water rights for the Navajo Nation, Hopi Tribe and San Juan Southern Paiute Tribe.\n\nThe federal legislation authorizes $5 billion to acquire, build, and maintain essential water development and delivery projects, including a $1.75 billion distribution pipeline. The three tribes would also be guaranteed access to over 56,000 acre-feet of Colorado River water and specific groundwater rights protections.\n\nNavajo Nation President Buu Nygren emphasized the urgency of the Northeastern Arizona Indian Water Rights Settlement. Nygren said he hopes basin states will support and advocate for the settlement, which could boost its chances of passing before a new administration takes the White House next month. \n\nHowever, some Colorado River Basin states have expressed concerns about the settlement and its impact on water use and future management, a fact Nygren acknowledged. \n\n“I was hoping to come in today that we have some consensus, but there’s one underlying issue that we’re trying to resolve,” Nygren said.\n\nDuring a press event last week, New Mexico’s representative on Colorado River matters, Estevan Lopez, said the Upper Basin states are concerned the settlement would allow tribes to lease water from the Upper Basin to the Lower Basin.\n\n“When you move water across the basin boundary, that has always required a seven state consensus,” Lopez said.\n\n“We feel it’s imperative that we need to have an actual consensus among the states if that’s going to move forward,” Lopez said.\n\nLower Basin states — Nevada, Arizona, and California — and Upper Basin states — Colorado, New Mexico, Utah, and Wyoming — have been at odds for months over how to manage the river after current management rules expire in 2026.\n\nTribal leaders noted that water settlement bills have historically been passed during lame duck congressional sessions, meaning that if it does not pass now, the legislation will have to effectively restart the process anew in the next Congress.\n\nNygren said he is still hopeful Congress can pass the water settlement bill during the lame duck session, as either a stand-alone bill or as part of a larger package, and urged the seven basin states to support the settlement.\n\n“We’ve got a Congress that’s willing, that’s excited. All we gotta do is come to consensus, and then we put it in Congress’s hands. It would be a great celebration to see President Biden sign off on that within the next couple of weeks,” Nygren said.\n\nGov. Stephen Roe Lewis of the Gila River Indian Community echoed Nygren’s optimism.\n\n“I remain ever hopeful that we will be celebrating the first anniversary of the Northern Arizona settlement next year,” he said \n\nLewis added he is not pessimistic about the Trump administration if the settlement fails to come together before Biden steps down, noting that the Drought Contingency Plan in 2019, which stabilized the Colorado River through voluntary reductions and increased conservation, was authorized when Trump was president in 2019.\n\n“I remain hopeful that [the Trump administration] will help us finish this journey that we’re on for those new guidelines. I’m also not worried about Congress stepping up and providing the new authority and funding that we may need to implement the kinds of ideas that we see are necessary,” Lewis said.\n\n“All that is possible,” he said.","url":"https://ictnews.org/news/tribes-help-boost-lake-mead-water-supply-hope-for-lame-duck-passage-of-5b-federal-water-act-","image":"https://ictnews.org/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjExMzI3NTc5NTc4MTgwNzY3/dsc06024-2048x1365.jpg","video":null,"publish_date":"2024-12-13 01:11:04","author":"Nevada Current","authors":["Nevada Current"],"language":"en","category":"politics","source_country":"us","sentiment":-0.067},{"id":272751398,"title":"Spicey Deep Dish Pie Fight: Homan v Chicago","text":"President-elect Trump's designated border czar, Tom Homan, is a man of action and unfiltered speechcraft. Those are two truisms you can take to the bank.\n\nMr Homan is taking to his designated office like Brer Rabbit to a briar patch - begging to be thrown in. He can handle the brambles like nobody's business. \n\nLEMME AT 'EM\n\nSince getting tapped as Trump's guy, he has been issuing pugnacious promises of punitive penalties to follow if the simple federal rules of cooperation with Trump plans for stanching and reversing the illegal immigration hordes swamping the country are, if not embraced, at least not physically impeded by soft-hearted sanctuary cities and counties.\n\nHoman has been like an evangelist for change, traveling the country while spreading the gospel of deportation plans for those who swarmed our wide-open borders, with ringing condemnations of those who facilitated the crisis and those who continue to harbor illegals.\n\nThis is exactly what we need! Tom Homan, absolutely destroy AOC with nothing but factspic.twitter.com/W0cuMuXOmI— Johnny Midnight ⚡️ (@its_The_Dr) December 10, 2024\n\nHe has little patience for sanctuary mentalities... \n\n60 minutes: Is there a way to carry out mass deportation without separating families?Tom Homan: \"Of course there is. Families can be deported together.\"Put Tom Homan in charge of ICE! pic.twitter.com/fcS48fKu41— Tim Young (@TimRunsHisMouth) November 6, 2024\n\n...when we have spent the past almost four years being subjected to the largest immigration surge in American history, almost all of it illegal.\n\nThe US has seen its largest surge in immigration in its history under the Biden Administration — surpassing the Ellis Island-era migration boom that changed the face of the nation forever, according to a shocking new analysis.An average of 2.4 million immigrants per year poured into the US between 2021 and 2024, according to the Congressional Budget Office. About 60% of the migrants crossed into the US illegally, a Goldman Sachs analysis found.The total net migration during the Biden administration is expected to reach more than 8 million — exceeding even the pace of new arrivals to the US during the 1850s when the portion of foreign-born residents exploded, according to a New York Times analysis.\n\nTrump has appointed the hard-nosed, no-nonsense Homan border czar for a reason. As AOC found out, he can quote the laws he is enforcing, in chapter and verse - laws that have been flouted through the whole of the Biden era to the detriment of every American citizen.\n\nBut you've got to start the deportations somewhere, and somewhere with a big problem would be best because then you show that the administration means business...not that anyone doubts the two of them.\n\nBut blue cities don't convince easily until things become uncomfortable for them.\n\nNew York might have been a good starting point at one time, but Mayor Eric Adams has had a come-to-Jesus awakening lately. He's willing to work with Trump on any manner of issues, including the illegals, within the framework of what state law allows and even then some. Trump is nothing if not magnanimous, so he's graciously leaving that city alone.\n\nBut somebody else isn't as smart as Adams and tries hard multiple times every single day to prove he's the country's worst mayor.\n\nEarlier this month, Chicago's Brandon Johnson was doubling and tripling down on the city's 'sanctuary status' and his job as mayor 'protecting the families' and 'Chicago values.'\n\nMass deportation alert: 🚨Chicago, Illinois, Mayor Brandon Johnson reaffirms his commitment to Chicago to keep it a sanctuary city and push back against President Trump’s mass deportation operations.“We will not bend or break,” Mayor Brandon Johnson said.Yet over 51,000… pic.twitter.com/xcSzcvWfpj— Tom Homan - Border Czar Commentary and News (@TomHoman_) December 2, 2024\n\nJohnson had the over-sized ego of the Illinois governor talking smack as his backup.\n\nIL Gov. Pritzker: \"I will do everything that I can to protect our undocumented immigrants. They are residents of our state.\" pic.twitter.com/7f1Fp7ZgkY— Julio Rosas (@Julio_Rosas11) November 14, 2024\n\nYeah, well. Guess what? Decision's been made on where it all starts.\n\nPresident-elect Donald Trump's border czar Tom Homan has revealed that the nation's largest mass deportation effort will begin in Chicago.Homan, 63, the former acting head of Immigration and Customs Enforcement during Trump's first term, laid out his plans to remove migrants who illegally crossed the southern border.\n\nHoman, appearing at a GOP fundraiser in the city on Monday, used what local media described as 'salty language' to first explain why Chicago was in such a dire state...\n\nTom Homan in Chicago: \"Chicago is in trouble because your mayor SUCKS and your governor SUCKS\"🤣🤣🤣🤣 pic.twitter.com/mSiZazUzoH— 🇺🇸 ʟᴇғᴛ ᴄᴏᴀˢᴛ ᴠᴀɢʀᴀɴᴛ 🇺🇸 (@Baklava_USA) December 12, 2024\n\n...and then proceeded to lay down the law about the planned deportations and how he expected the mayor to conduct himself.\n\nBorder Czar Tom Homan's tough words on Chicago Mayor: \"We're going to start right here in Chicago, Illinois. If your Chicago mayor doesn't want to help, he can step aside. But if he impedes us if he knowingly harbors or conceals an illegal alien I will prosecute him.\" pic.twitter.com/xi62dvyoBA— Real Mac Report (@RealMacReport) December 11, 2024\n\nHoman did lay out elements of the deportation scheme as they are envisioning it right now.\n\n...Migrants who have committed crimes while in the United States will be the first to be targeted - followed by legal migrants, including asylum seekers and those who entered the US with humanitarian parole under the Biden Administration. Homan said on Monday he would work on verifying the status of asylum seekers and arrest anyone who is found to be harboring criminal migrants.He also reiterated that there is no plan in place to separate families, though he suggested 'it may happen. 'My goal is to enforce the law, but if you put yourself in that position, it may happen,' the incoming border czar said. 'But there's no plan in this administration right now to separate families.''However, we're going to enforce the law. So if you put yourself in that position it's on you,' he said, declaring that parents of Dreamers - the children of migrants born in the United States - have two options.'You can either take a child home with your or they just stay here,' Homan said. 'But you don't get a pass.'...He also said those who do not qualify for asylum through the courts system would be ordered to be deported.'If we don't, what the hell are we doing? Shut down immigration court?' he asked, rhetorically.'There's no more consequences. We have to remove them if the law requires.' ...'So it's not a sweep, it's not an uncontrolled operation. It's a very targeted operation.'\n\nThe enterprising grifters at the Chicago Teachers Union issued a social media fit of the vapors. Fewer illegals would impact their very fat bottom line, that's true and what a pity if they lost out.\n\nChicago doesn’t need to be afraid of Homan, the criminals who happen to be illegal aliens need to be afraid.Not sure what CTU has to do with the immigration system, maybe sit this one out. https://t.co/QfyP4KD61Q— Libs Of Chicago (@Libs_OfChicago) December 10, 2024\n\nA froggy progressive Democratic congresswoman challenged Homan to 'be ready to meet the resistance' and...what was that I was saying about chapter and verse?\n\n...\"Message received. Please review 18 USC 111 and also see 8 USC 1324 (iii),\" Homan told Fox News Digital in an interview on Wednesday. \"Game on.\"He was referring to two laws, one prohibiting impeding a federal law enforcement officer and the other prohibiting the harboring or concealing of illegal immigrants from immigration officers. \"So, message received, please review this statute and that statute and game on,\" he said.\n\nNow, I'm not sure she got the message, but HO, BOY. It sounds like Gov Pritzker might have, even as he kept up the bad boy bluster.\n\n...Illinois Gov. JB Pritzker on Wednesday said he believes \"violent criminals\" living in the U.S. illegally should be deported, but pushed back against incoming border czar Tom Homan’s threats of mass deportations.The remarks came during a press conference, with the governor reacting to Homan’s statement made in Chicago Tuesday. While speaking in the sanctuary city, Homan called on Chicago Mayor Brandon Johnson, who is vocally opposed to the incoming border czar's plans, to get out of his way....\"We have laws that protect undocumented immigrants, and I'm going to make sure to follow the law,” the governor said. “I'm concerned that the Trump administration and his lackeys aren't going to follow the law, but I will.\"The Prairie State governor added, however, he is in alignment with Homan over threats noncitizens convicted of \"violent\" crimes pose to his state and the nation. These individuals, he said, do not belong in the country and should be deported.\n\n'Trump lackeys' - oh, nice touch, gov. \n\nLet's talk budgets for a moment, shall we? After a $357M surplus this year, Illinois is facing deficits of $384M in 2025 and $625M in 2026, while Mayor Snowflake is looking at being short $229M in 2024 and a whopping $982.4M (!) for next year. Yeah - almost a billion dollars short of cash.\n\nSure, guys. Hang tough.\n\nYou don't need that stinkin' federal cash.\n\nChicago is bleeding out. All the feds have to do is invoke some non-cooperation argle-bargle, and the city is housing, feeding, and handing out cha-ching to their 50K+ illegals all on their own dime.\n\nI'd bet this is probably why Pritzker's moderating his rhetoric a tad. He's a little sharper on the uptake than Johnson, but not by much.\n\nWe have to see if someone can take Johnson aside and get him cooled down long enough to convince him to ixnay the social justice warrior act for a little bit.\n\nEither way, Homan's been kind enough to let them know he's coming and what he will do when he arrives.\n\nPretty much all up to them whether to play ball or not, and it's going to be entertaining af if they don't.\n\nWhatever happens, it will be 'message sent' to the rest of the sanctuaries.","url":"https://hotair.com/tree-hugging-sister/2024/12/12/spicey-deep-dish-pie-fight-homan-v-chicago-n3797827","image":"https://media.townhall.com/cdn/hodl/2018/127/1bf78099-7136-4b23-a4fd-66cbda635013.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","source_country":"us","sentiment":-0.201},{"id":272751388,"title":"Mark Zuckerberg’s One Million Dollar Reparation","text":"Mark Zuckerberg thinks he can use his money to get on the right side of history. We just learned that the META mogul has donated $1 million to Donald J. Trump’s inaugural fund.\n\nThis news comes weeks after we found out that the little lizard traveled to Florida to dine with Trump at Mar-a-Lago and the proud feminist Justin Trudeau.\n\nFacebook co-founder and Meta CEO Mark Zuckerberg’s Meta Platforms (DBA: Meta, formerly named Facebook, Inc.) has kicked in a cool million dollars to President-elect Donald Trump’s inaugural fund. This was Zuckerberg’s latest attempt to make amends with the incoming president, after admitting to Congress that Facebook censored users at the request of the Biden-Harris administration. – Red State\n\nIs Zuck really trying to make amends with his almost offensive offer of just one million dollars? Of course, to you and me, that’s a lot of dough, but considering Mark funneled millions of dollars through Facebook to support Biden, I mean, come on, man.","url":"https://hotair.com/headlines/2024/12/12/mark-zuckerbergs-one-million-dollar-reparation-n3797833","image":null,"video":null,"publish_date":"2024-12-13 01:11:03","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","source_country":"us","sentiment":-0.592},{"id":272751384,"title":"Biden Admin Rushing to Auction Off Border Wall Materials to Stump Trump","text":"However low your opinion of the Biden administration and the folks in charge of the border (I am looking at you, Alejandro Mayorkas), you still think too highly of them. \n\nIf you think they are scumsucking demons, you are getting close but not there yet. Traitors to America and the American people? Certainly so. \n\nRead the full story from @JamesLalino for The Daily Wire. https://t.co/nl1KVr6m2m— Daily Wire (@realDailyWire) December 12, 2024\n\nThe latest outrage is reported by The Daily Wire, which consistently does excellent reporting. They have uncovered that the Biden administration is rushing to auction off materials at ridiculously low prices that Trump bought to build the border wall.\n\nThe Biden administration is using its final weeks to haul a massive amount of border wall materials away from the southern border to be sold off in a government auction, an apparent effort to hinder President-elect Donald Trump’s effort to secure the border, The Daily Wire has learned.Videos obtained exclusively by The Daily Wire from a U.S. Customs and Border Patrol agent show unused sections of the wall being hauled away on the back of flatbed trucks from a section of the border just south of Tucson, a hotspot for illegal crossings during the Biden administration. The agent estimates that up to half a mile per day of unused border wall is being moved.“They are taking it from three stations: Nogales, Tucson, and Three Points,” the border patrol agent, who was granted anonymity to speak freely, told The Daily Wire. “The goal is to move all of it off the border before Christmas.”Trump made clear during his campaign that he intends to finish construction of the border wall, making use of the materials that have remained untouched at the border since President Joe Biden took office in 2021. If the material brought to the border during his first term is sold off, it will significantly delay any progress on one of Trump’s flagship campaign promises at the border.\n\nThe Biden administration had already abandoned these materials in the desert just as they had abandoned the construction of the border wall, and now that Trump is coming back into office, they are rushing to deny him the materials--already purchased and ready to go--to continue border wall construction. \n\nIt is not uncommon for administrations to try to lock in their policies before turning over power, but this is another level of obstruction of the voters' will. The border and illegal immigration were key elements of the campaign and important reasons why Trump won. Usually, an administration's attempt to lock in policies has to do with regulations or policies that people mostly don't know or care about, but this is very different. \n\nThis is directly thwarting the will of the electorate. The message that the voters want the border closed and the wall built couldn't have been clearer. Biden (Mayorkas?) is intentionally making it harder and more expensive to accomplish a goal voters made overwhelmingly clear want done. \n\nThis is outrageous and a big \"screw you\" not to Trump but to the American electorate. And it won't change the policies or the plans to build the wall, but only make doing so more expensive and onerous to the taxpayer. \n\nThe long-time border patrol agent has seen political fights play out over the border before, and believes that the Biden administration is trying to stymie Trump’s ability to quickly secure the border as soon as he returns to office.“When Trump comes back, and he wants to start the border wall all over again, the whole entire funding fight is gonna happen again,” the agent said. “That’s their play. He’s gonna have to fight for this — again.”The Customs and Border Protection Agency referred The Daily Wire to the U.S. Army Corps of Engineers, saying the latter had jurisdiction over the materials until they are erected. From there, The Daily Wire was referred to the Defense Logistics Agency, where an official said the standing policy is to refer all media requests on this to the public affairs team at the Office of the Secretary of Defense. A member of the public affairs team declined to respond to inquiries.Trump is expected to use an executive order to unlock funds to restart construction of the border wall that was halted under Biden, with anticipation that it could be one of his day-one actions.Crane, the Arizona congressman, says the last-minute fire sale by the Biden administration is “a direct affront to the will of the people.”\n\nSabotaging Trump is bad enough, although given how sociopathic many people in politics are, it's not enough to shock. I have seen some pretty awful things over the years. But this stands out because it is so clearly aimed at thwarting the will of most Americans, not just Trump himself. \n\nJanuary 20th can't come soon enough. Biden may have checked out, but clearly his minions have not and are determined to sabotage America as much as possible before Trump assumes office.","url":"https://hotair.com/david-strom/2024/12/12/biden-admin-rushing-to-auction-off-border-wall-materials-to-stump-trump-n3797834","image":"https://media.townhall.com/cdn/hodl/2023/132/75849bf2-796a-4370-adb7-a093d3d990ae.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"David Strom","authors":["David Strom"],"language":"en","category":"politics","source_country":"us","sentiment":-0.283},{"id":272751386,"title":"Dems New Obsession: Guacamole","text":"Millennials famously love avocado toast. Over the years, I have seen countless stories about avocado toast, which tells you everything you need to know about contemporary life: young people who complain about not having enough money spending ungodly amounts on what I assume is a tasty and healthy snack, but hardly the key to a satisfying life. \n\nTaylor Lorenz famously bitched about a costly delivery of avocado toast to her New York City apartment, not because the cost was outrageous but because the avocado was not spread on the bread properly. She wanted us to sympathize, but most of us gasped at the price. \n\nOh that Taylor Lorenz person is the $22 avocado toast lady. I thought the name was familiar. pic.twitter.com/sv0YrzCMUr— joe (@joekv) March 10, 2021\n\nWell, the obsession with avocados (which I like too!) is getting even more out of hand. Along with a whole host of Twitter/X posters, the biggest line of attack on Trump's tariff threats is that the supply of guacamole will be restricted. \n\nThe great avocado apocalypse is upon us. \n\nAre you ready for guacamole to become a luxury item? That’s one possible outcome of Donald Trump’s immigration and tariff policies, the economist Rebecca Patterson writes.Read: https://t.co/h54gLf2RpB— New York Times Opinion (@nytopinion) December 11, 2024\n\nI should reveal a dirty little secret: I have two tubs of guacamole in my fridge right now that I picked up at Trader Joe's yesterday. I am a guacamole fanboi and am always willing to splurge to get that side of guac when I go Mexican. I even cook with avocado oil at times, as I am trying to cut down on seed oils. \n\nI'm trying to depict peak whiteness.It involves a lot of avocado toast. pic.twitter.com/fSUrqlmgaM— Carl (@HistoryBoomer) December 1, 2023\n\nSo I am sensitive to the avocado crisis to come. But COME ON FOLKS! The price of avocados is more often affected by weather and season than whatever tariff may or may not come, and if a temporary spike in the cost of avocados is the price we pay for a better trade deal with Mexico and especially a closed border, I am ready to make the sacrifice for God and country. \n\nAre you ready for guacamole to become a luxury item?Donald Trump’s first term is a reminder of the financial damage a trade war can create. After the United States in 2018 imposed tariffs on a range of countries, Canada, China, the European Union, India, Mexico and Turkey struck back against American exports. The Agriculture Department says the retaliation raised the price of farm goods from the United States; that in turn contributed to a decline in export revenues of $27 billion in 2018 and 2019.Now we’re settling in to watch the same movie again. Hours after Mr. Trump’s late November Truth Social post threatening a new round of tariffs, Mexico’s president, Claudia Sheinbaum, responded, “For every tariff, there will be a response in kind.” Just as a reminder to the incoming administration, about two-thirds of vegetables and almost half of fruit and nut imports to the United States come from Mexico. And how many avocados? Ninety percent.It’s not just tariffs. American farmers and ranchers, many of whom have supported Mr. Trump, would struggle to find enough workers if he delivers on his vow to deport millions of undocumented immigrants. And financial aid from Washington to offset the damage might not be forthcoming, given the giant size of the federal deficit.\n\nWhat's most striking to me about this line of reasoning is that the liberal case for open borders and bowing to the desires of Mexicans and South Americans is that we need Brown people to do our tougher jobs, such as picking fruits and vegetables, mowing our lawns, and preparing our meat. \n\nSecure Borders > Avocado ToastWho's with me? pic.twitter.com/KUi7msPflp— Kingsley Wilson (@KingsleyCortes) December 12, 2024\n\nYou know, the \"jobs Americans won't do.\" It really is an argument that the elite class wants an underclass to do the work they consider beneath them. These are the people who view anybody who does what Mike Rowe calls \"Dirty Jobs\" as an underclass and who apparently are worried that white people might have to get paid a higher wage than an illegal immigrant who looks less like them and is willing to work for less money. \n\nCall it the \"who will pick the cotton?\" line of reasoning--the same reasoning an earlier group of Democrats appealed to when defending slavery. \n\nI get math isn’t the Left’s strong suit, but if my choice is to pay an extra $12-24 a year for avocados versus my much higher share of the $150 billion spent on illegals, I’ll take the $5 avocado, please. https://t.co/iYHJaY4MtL— Amy Curtis 🇮🇱 (@RantyAmyCurtis) November 27, 2024\n\nI'll let you in on another secret: one summer during college, I picked sweet corn in Massachusetts, and indeed the job sucked. It turns out that the June and July dew on cornstalks is really COLD and unpleasant, but the pay was good, and I did it until I came down with mono and couldn't do much at all other than moan and whine in those few hours I was awake. \n\nIf a labor shortage really does develop, there are legal ways to rectify that and to ensure mutual benefit to the workers, the employers, and the country. No need for cartels to smuggle people in and no need to make legitimate workers who want a better life to hide in the shadows or work for lower wages than they deserve. \n\nOur current arrangement is hideously unethical--most people involved are exploiters or being exploited, with 300,000 unaccompanied minors lost to God knows where in the US. If tariffs or threats of tariffs can change Mexico's behavior then I am willing to pay another few dollars to get my avocado fix--especially since the price bump will be temporary. \n\nI don't know whether liberals actually think that pointing to the great avocado crisis to come will be persuasive to Trump supporters or whether they really see this as a crisis for themselves. I doubt the latter if buying avocado toast at $22 is a regular occurrence. I can assure you that a little of that $22 was the price of an avocado. \n\nThere is so much wrong with this line of thinking, both economically and especially morally. Americans are not inclined to see crime skyrocket, cities be overrun, and welfare spending skyrocket just to get cheaper avocado toast. \n\nBut apparently New York Times readers are.","url":"https://hotair.com/david-strom/2024/12/12/dems-new-obsession-guacamale-n3797826","image":"https://media.townhall.com/cdn/hodl/2016/223/13d51417-2258-426b-b496-ef6fd5b2d3e7.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"David Strom","authors":["David Strom"],"language":"en","category":"sports","source_country":"us","sentiment":0.306},{"id":272751382,"title":"The Left is in a Murderous Mood","text":"When the murder of healthcare CEO Brian Thompson, I expected there would be a few Antifa sickos who would be cheering him on. What I didn't expect is how widespread that sentiment would be. It's not just weirdos like Taylor Lorenz who are saying this it's lots of people on the left. Many of them are trying to make this guy into a folk hero. He's being called The Adjuster by fans on TikTok. And people are eagerly raising money for his legal defense.\n\nSupporters started a GiveSendGo page to raise funds to cover his legal fees after GoFundMe took down pages set up for him.Hundreds of donors have so far raised over $35,000 for the accused killer and even sent messages calling him a hero. \n\nActually, as I look at it now, they fundraising total is up over $48,000. People are leaving messages like these:\n\nLuigi brave American hero. Thank you Luigi. We love you Luigi.America is behind you, Luigi, you absolutely deserve the best legal representation money can buy.Thank you for standing up to the evil oligarchs and plutocrats that control our country and control both political parties. Sadly so many of us feel helpless to enact change in this evil corporatocracyFree The Adjuster!He is a national hero! We love your courage for being a true Martyr. You are not alone brother!The wealthy and privileged should be made to feel a little nervous at all times. Thank you sir, for doing your part.Desperate times call for desperate measures. Thank you for your sacrifice, for fighting our battles. Stay strong, you are not alone.Hero.Luigi is a national hero, and Biden should pardon him and give him the Presidential Medal of Freedom.What is worth more than money or gold? Luigi Mangione. A hero of our time.Doing the right thing in this world is hard. It takes a special kind of person to sacrifice their freedom for the wellbeing of others. Salutations to you buddy 👍👍Innocentthank you for your service to our countryDeny. Defend. Depose.Luigi is excising justice in an extreme way. Yet he set a line for all other CEOs to have a fear.Thank you Luigi for the courage to do what’s right!I can has more dead CEOs?This is but the beginning of a revolution that has been a long time in coming. Its up all of us to pick up the torch and carry it forward.\n\nI could go on and on but you get the idea. Lots of these people see this as the start of a revolution. They are cheering for more blood. A political science professor told the AP this isn't just support for vigilantism, it's support for domestic terrorism.\n\nRegina Bateson, an assistant political science professor at the University of Colorado at Boulder, has studied vigilantism, the term to which Shapiro alluded. She doesn’t see this case as a good fit for the word, she says, because the victim wasn’t linked to any specific crime or offense. As she sees it, it’s more akin to domestic terrorism.But Bateson views the threats against election workers, prosecutors and judges ticking up — plus the assassination attempts against President-elect Donald Trump this past summer — as possible signs that personal grievances or political agendas could erupt. “Americans are voicing more support for — or at least understanding of — political violence,” she said.\n\nThis is part of a trend. There were two assassination attempts against president-elect Trump. And there were other death threats which resulted in people being arrested. Then there were a series of threats aimed at people selected to be part of Trump's cabinet. Rep. Marjorie Taylor Greene received a bomb threat just this week.\n\nElon Musk, not surprisingly, saw a spike in death threats against him this year. \n\nDangerous times ahead.Two people (separate occasions) have already tried to kill me in the past 8 months. They were arrested with guns about 20 mins drive from Tesla HQ in Texas.— Elon Musk (@elonmusk) July 14, 2024\n\nI'm going to come right out and say it. I think the left's fanboy response to a cold-blooded murder in New York is part of a larger desire for murderous action that seems to be growing. In 2016, the left lost the presidential election but they were full of fight and spite and determined to take Trump down with protests, with investigations and with lawfare. This year there's a lot less fight and a lot more dejection and some seem to see violence as the only way to fix this problem. They are supporting it and organizing themselves around it. \n\nSimply put, one way to ensure there are more assassinations is to set up a social reward for carrying them out. That's what the left is doing right now. It's not just about Luigi Mangione. It's about setting the stage for more people like him.\n\nUpdate: Not since OJ Simpson has a murderer had this much merch.\n\nAs of Tuesday, thegoodshirts.com is selling a $29 black T-shirt featuring a collage of photos of Mangione surrounded by bullets that appear to be engraved with “Deny, Defend, Depose” — the words police say were written on the casings of the bullets that killed Thompson and that echo a phrase insurers use to avoid paying claims. You can find more T-shirts, hoodies, and stickers featuring the slogan “Deny, Defend, Depose” all over Etsy. Over on Sivelos, a different shirt takes a culture buff’s approach, referencing Mangione’s Italian American heritage via a memorable line from The Sopranos: “IN THIS HOUSE LUIGI MANGIONE IS A HERO, END OF STORY.” Tee Shirt Palace allows customers to deck their furry friends out in Mangione paraphernalia by way of a “FREE LUIGI” doggie bandana emblazoned with the alleged assassin’s face, or to buy a red wearable blanket with the same design","url":"https://hotair.com/john-s-2/2024/12/12/the-left-is-in-a-murderous-mood-n3797829","image":"https://media.townhall.com/cdn/hodl/2024/345/f656e9e3-eda7-4baa-96ea-7d1cf716b006.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"John Sexton","authors":["John Sexton"],"language":"en","source_country":"us","sentiment":-0.089},{"id":272751372,"title":"CNN Poll: Mar-a-Lago's a Honeymoon Hotel","text":"So ... who's up for another poll? I know, I know -- the election has been over for more than a month now. But something tells me that readers might not mind a deep dive into another poll result in this case. \n\nEarlier today, Time Magazine announced that they had selected Donald Trump as their Person of the Year. A new poll from CNN shows that a significant majority of Americans have made him their man of the moment, anyway. In every issue set, voters are expressing high confidence in Trump -- as CNN noted yesterday on air:\n\nA CNN poll says Americans overwhelmingly support Trump and his transition moves.Let me repeat that... a CNN poll.The tide has turned. pic.twitter.com/MTizvmHmHg— Tim Young (@TimRunsHisMouth) December 11, 2024\n\nMost Americans expect President-elect Donald Trump to do a good job upon his return to the White House next month (54%) and a majority approves of how he’s handling the presidential transition so far (55%), according to a new CNN Poll conducted by SSRS.Trump won the presidency last month amid broad disapproval of President Joe Biden’s handling of the job and deeply negative feelings about the state of the country and the economy. Almost 7 in 10 Americans in the new poll think Trump will be able to bring change to the country (68%), though only about half of Americans (48%) say they think it will be change for the better.\n\nWe'll get to the specific issue sets in a moment, but this result is worth noting. The actual split on the direction of this change is 48/20, which means only one in five Americans think Trump will change things for the worse while a near-majority believes matters will improve. Diving into the crosstabs, more Democrats expect no change (48%) than negative change (39%), which gives one a sense of why Democrats may seem more resigned to another season of MAGA than after the 2016 election. It also demonstrates just how ineffective the Protection Racket Media hysteria turned out to be, even among the most sympathetic audience. \n\nGiven Trump's limited popularity in the political sphere over the past decade, these positive numbers are especially interesting. \n\nCNN senses a shift in the mood in terms of right/wrong direction overall, too:\n\nThe country’s mood appears to have lifted somewhat following Trump’s win, at least in part due to the type of shifting partisan sentiments often seen in the wake of elections where the presidency changes partisan hands. Most overall still say that things in the country are going badly (61%), but the share who say things are going “very badly” stands at just 15%, the lowest in CNN polling since May 2018. The 38% who say things in the country are going well is the highest since December 2021.\n\nThis appears to be an outlier in post-election polling, at least thus far. The RCP aggregation on right/wrong direction hasn't changed significantly since the election. In fact, it hasn't changed much at all for the past two years. CNN's 38% for right direction (or its equivalent) is 12 points higher than the current RCP average, although the 61% wrong-direction result is almost identical. If this is a real shift, it suggests more enthusiasm for Trump than just simply a dissatisfaction with the Biden status quo. \n\nNow, let's dig into the confidence numbers. Before I list the net results, bear in mind that CNN conducted this poll after Trump had announced his choices for all of the Cabinet officials as well as most of the top-tier advisory positions in the new administration. All of these choices have had a great deal of debate and commentary, and most of the choices have gotten significant criticism in the media and among Democrats. \n\nWith that in mind ...\n\nAs CNN notes, these numbers are generally lower than for other presidents transitioning into office. However, there are two key differences. First off, Trump has already been president, and these numbers are significantly better than his approval ratings during any point in his first term. Second, none of Trump's predecessors had both his political opposition and the entire media industry calling them a threat to democracy, a fascist, and/or a national-security risk. \n\nGiven the larger political climate around Trump and this election, these results look like a strong endorsement for Trump, perhaps even stronger than the election results. It points to a a honeymoon phase at the very least, and arguably a validation of claims to a mandate as Trump launches his new administration. It also highlights and caps off a remarkable political comeback, one without parallel in modern American history.","url":"https://hotair.com/ed-morrissey/2024/12/12/cnn-poll-mar-a-lagos-a-honeymoon-hotel-n3797830","image":"https://media.townhall.com/cdn/hodl/2024/347/afe036a4-5f60-4cb5-b65c-5cfb83feef6a.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","source_country":"us","sentiment":-0.126},{"id":272751374,"title":"National Mood Shift Since Trump’s Win Is Reviving America’s Lost Vigor","text":"The other day, a former student wrote me regarding post-Election Day events.\n\n“I just feel like a tide has shifted and that it feels more like the Reagan ’80s than at any point in my life,” he marveled.\n\nIt’s not just that Donald Trump is the once and future president, while Kamala Harris has already shuffled off to the Mike Dukakis Home for Embarrassingly Failed Democratic Candidates, where she can share box wine and catty remarks with Hillary Clinton. \n\nIt’s that the entire energy of the nation, and maybe the world, has changed overnight.\n\nFrom the Daniel Penny exoneration, to the reopening of the Notre Dame cathedral in Paris before all the leaders of the West — including Donald Trump, but notably excluding Joe Biden — to the triumphant flights of Starship and a sudden shift in relations with previously difficult neighbor countries like Mexico and Canada, these last few weeks have felt like one big shout of “We’re back, baby!”","url":"https://hotair.com/headlines/2024/12/12/national-mood-shift-since-trumps-win-is-reviving-americas-lost-vigor-n3797814","image":null,"video":null,"publish_date":"2024-12-13 01:11:03","author":"Beege Welborn","authors":["Beege Welborn"],"language":"en","category":"politics","source_country":"us","sentiment":-0.356},{"id":272751370,"title":"Politico: Dems Get Strange New Respect For ...","text":"Strange new respect, or just political brown-nosing? Is there any difference between the two?\n\nFor the past two-plus years, ever since he raised the potential purchase of Twitter, the Left has demonized Elon Musk nearly non-stop. That hit a fever pitch almost two years ago to the day when Musk began to release the Twitter Files and exposed government censorship on social media and Big Tech platforms, and only increased when Musk began supporting Donald Trump. The Left has painted him as All That Is Wrong in Politics and Culture for two solid years.\n\nHow has that worked out for them? Badly enough that they're now trying to kiss and make up, Politico reports today. And where that kiss is aimed, you can probably guess:\n\nRo Khanna is trading texts with Elon Musk. Josh Shapiro took a call from him. And John Fetterman has compared him to the superhero Tony Stark.As President-elect Donald Trump prepares to install Musk as the federal government’s cutter-in-chief, some ambitious Democrats are taking a warmer approach to the billionaire businessman than their party leaders have in the past as he has become one the most influential people on the planet. ...The relationship between Democrats and Musk has been icy for the past few years. President Joe Biden said Musk’s ties to other countries were “worthy of being looked at” and attacked him as a one-time “illegal worker.” Musk, in turn, called Biden and Vice President Kamala Harris each a “puppet.” Liberals also laughed off Musk’s purchase of X and his efforts to turn out the vote for Trump — with vice presidential nominee and Minnesota Gov. Tim Walz mocking him for “skipping like a dipshit” on stage at a rally.\n\nLet's just note that all of the above examples are essentially cases of projection. Having the crime boss of Biden Inc complain of ties to foreign countries would be akin to having John Gotti complain about the Genovese family. It also serves as an example of how Biden and Democrats weaponized their offices to at least threaten their political opponents. The Protection Racket Media deflected that back to Trump when he pointed out that the same precedents could be used when Republicans took office, but Democrats have conducted this political corruption for the past four years first. \n\nAs for Tim Walz' comments, no one more exemplified \"dips***\" than himself during the campaign. He strutted and danced around the stage like a faded burlesque queen trying desperately to sell her expiring wares. Walz' only substantive contribution to the 2024 campaign was to personify Kamala Harris' utter incompetence and poor judgment. \n\nNow that they got smoked by Trump and Musk, at least a few Democrats have learned the costs of demonizing one of the world's most successful and influential figures. Others remain in full hostile positions, arguing -- incoherently, of course -- that the attempt to reduce government bureaucracy is an oligarchical project:\n\nSome Democrats remain deeply skeptical of Musk, who is one of several billionaires and tech leaders Trump has tapped to staff his administration. They see Musk as an oligarch, and are concerned about his plans to slash the federal government with entrepreneur Vivek Ramaswamy as incoming co-leaders of Trump’s Department of Government Efficiency.“I reserve the right to be surprised, but this looks to me like a coming kleptocracy, in which all these billionaires are running the government in order to rig the rules,” said Sen. Chris Murphy (D-Conn.). “So I’m pretty fucking skeptical that this is a legitimate effort.”\n\nHmmmm. Getting Big Tech billionaires to censor and suppress dissent through government pressure seems pretty oligarchical to me. Reducing the power of government to prevent intrusions on rights, and especially to reduce costs, leans more in the direction of liberty in my estimation. YMMV, but it's worth noting that voters elected Trump to office and sent Democrats out of the Senate majority for a reason, and Murphy might want to think that through a little more.\n\nEssentially, though, this is a class struggle for Democrats and a measure of how much control their Marxist-extremist wing will have on the party going forward. The hard Left in control of the party sees Musk as a class enemy, not just for his entrepreneurial wealth and success but also for failing to put it in service to The Party. Demonizing Musk was always a deeply stupid idea and essentially forced him into Trump's orbit. If Democrats continue that attack, then they will essentially become the BlueSky Party -- a bubble of radicals whose revolution will keep eating itself and shrinking its influence accordingly as they force more and more people to oppose them.","url":"https://hotair.com/ed-morrissey/2024/12/12/politico-dems-get-strange-new-respect-for-n3797822","image":"https://media.townhall.com/cdn/hodl/2024/330/ebe6fddf-72f2-4973-9e8d-148169f788b6.jpg","video":null,"publish_date":"2024-12-13 01:11:03","author":"Ed Morrissey","authors":["Ed Morrissey"],"language":"en","category":"politics","source_country":"us","sentiment":0.007},{"id":272752138,"title":"New Zealand pleads with Trump to spare ally from fresh tariffs: ‘please don’t do that’","text":"New Zealand believes it should be exempt from any sweeping US tariffs that president-elect Donald Trump might impose when he takes office and has instructed officials to make its case, Finance Minister Nicola Willis said.\n“Our starting position is please don’t do that,” Willis said in an interview on Thursday in Wellington. “The job that we’ve tasked our diplomats with is to put New Zealand’s absolute best foot forward.”\nTrump has threatened across-the-board tariffs on both US friends and foes, specifically targeting China but including 10 per cent duties on the rest of the world. While New Zealand is a tiny trading partner from Washington’s perspective, the US is New Zealand’s second-largest export market.\nTrump’s rationale for imposing tariffs starts with the fact that the US imports more than it exports so has a trade deficit. But Willis said the US-New Zealand trade relationship is “rather balanced” and has grown significantly in recent years.\nIn the year through September, New Zealand exported NZ$15.8 billion (US$9 billion) of goods and services to the US and imported NZ$11.3 billion from it. While some tariffs are applied, they are relatively small. New Zealand beef exports into the US, for example, currently attract tariffs of less than 1 per cent.\n“The US likes what we are selling, they like our wine, they like our dairy products,” Willis said. “We think that given the strong partnership that’s existed for many years between our two countries, there’s every reason for that to continue.”\nThe US also has dozens of trading relationships around the world and “I don’t think anyone would see that New Zealand is the most obvious one on their radar when they first come to office,” she said.\n\nAsked what New Zealand would do, if anything, should the new US administration impose tariffs on its goods, Willis declined to speculate.\n“How they choose to approach their own tariff regime is something that we don’t have detailed insight into at this time,” she said. “Of course our diplomats are thinking through scenarios, but as I say, we have a very strong, close, valuable relationship with the United States and it will always be our endeavour to continue to build that relationship to the value of both partners.”\nThe last thing Willis needs is a hit to trade as she tries to lift the economy out of recession and get the government’s books back into surplus.\nThe Treasury Department will publish its half-year economic and financial update next week, which is expected to show weaker growth and bigger deficits than previously forecast, as well as a later return to surplus than the 2028 projection in the May budget.\nWillis declined to be drawn on the financial outlook but acknowledged that the government may have to borrow more.\n“We will update our bond issuance programme at the half-year update, and it is the case that when the government has declining revenue relative to what it has been forecasting, that can require more borrowing,” she said. “That’s a major driver for why we are working so hard to get the books back in balance.”","summary":"The finance minister urged the incoming administration to exempt Wellington from any new levies, highlighting the balanced trade ties between the two sides.","url":"https://www.scmp.com/news/asia/australasia/article/3290586/new-zealand-pleads-trump-spare-ally-new-tariffs-please-dont-do","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2024/12/13/9c141ece-ab8c-42d9-86c0-9e2767586efb_38428b47.jpg","video":null,"publish_date":"2024-12-13 01:10:50","author":"Bloomberg","authors":["Bloomberg"],"language":"en","source_country":"cn","sentiment":0.027},{"id":272750558,"title":"Trump calls NK role in Russia's war 'complicating' factor, says he gets along 'very well' with Kim","text":"US President-elect Donald Trump has said that Pyongyang's involvement in Russia's war in Ukraine is a \"very complicating\" factor, while boasting about his personal ties with North Korean leader Kim Jong-un.\n\nTrump made the remarks in an interview with US magazine TIME published Thursday as he commented on issues related to Russia's war in Ukraine and instability in the Middle East.\n\n\"When North Korea gets involved, that's another element that's a very complicating factor,\" Trump said during the interview with the magazine that chose him as the 2024 TIME Person of the Year.\n\n\"And I know Kim Jong Un, I get along very well with Kim Jong Un. I'm probably the only one he's ever really dealt with. When you think about it, I am the only one he's ever dealt with,\" he added.\n\nAsked if he will abandon Ukraine, Trump said, \"I want to reach an agreement, and the only way you're going to reach an agreement is not to abandon.\"\n\nSpeculation has lingered that after Trump takes office on Jan. 20, he could seek to revive his personal diplomacy with Kim. But it remains uncertain whether Pyongyang could accede to diplomatic feelers from Washington amid its deepening military alignment with Moscow. (Yonhap)","summary":"US President-elect Donald Trump has said that Pyongyang&#039;s involvement in Russia&#039;s war in Ukraine is a &quot;very complicating&quot; factor, while boasting about his personal ties with North Korean leader Kim Jong-un. Trump made the remarks in an interview with US magazine TIME published Thursday as he commented on issues related to Russia&#039;s war in Ukraine and instability in the Middle East. &quot;When North Korea gets involved, that&#039;s another element that&#039;s a very compli","url":"https://www.koreaherald.com/view.php?ud=20241213050008","image":"https://res.heraldm.com/content/image/2024/12/13/20241213050001_0.jpg","video":null,"publish_date":"2024-12-13 01:06:04","author":"Yonhap","authors":["Yonhap"],"language":"en","category":"politics","source_country":"kr","sentiment":-0.039},{"id":272750520,"title":"Chevrolet’s Scott Bell interview; Trump makes pick for FTC chair","text":"Scott Bell, Chevrolet’s global vice president, joins the show to talk about the brand’s EV transition, plans for 2025 and more. President-elect Donald Trump makes his pick to steer the Federal Trade Commission. Plus, used-car prices continue to come down.","url":"https://www.autonews.com/podcasts/daily-drive/an-dailydrive-scott-bell-chevy-interview/","image":"https://cloudfront-us-east-1.images.arcpublishing.com/crain/XKZHG5B4DRHVBM72DWOU7WGYY4.jpg","video":null,"publish_date":"2024-12-13 01:06:03","author":null,"language":"en","source_country":"us","sentiment":0.34},{"id":272750224,"title":"Should the executive have the power to pardon? - Premium","text":"Should the executive power of clemency rest with the legislature to avert misuse?\r\n\nSanjay Hegde: Vesting clemency powers in the legislature could prove equally susceptible to corruption and majority rule. Historically, the power to pardon originated from the British monarchy as an attribute of sovereignty, enabling the king to absolve any wrongdoing. Even today, the Constitution acknowledges scenarios where it is imperative to trust a high officeholder to judiciously exercise such discretionary authority when required. \n\n Also read | Biden commutes roughly 1,500 sentences and pardons 39 people in biggest single-day act of clemency\n\nAlok Prasanna Kumar: I agree. During the debates on the U.S. Constitution, Alexander Hamilton, the first Secretary of the Treasury, acknowledged that the exercise of clemency is inherently political and cannot be reduced to a purely legal process. He argued that this power should be vested in a single constitutional officeholder, instead of being subjected to the whims of collective discretion. He also pointed out that the power of pardon introduced an element of mercy, which he believed was necessary to temper the rigours of the criminal justice system. He saw it as a means for true justice to prevail in cases where the law could not account for circumstances or moral factors beyond the scope of judicial proceedings.\n\n Should an independent clemency commission replace the existing system to ensure more objective and informed decision-making?\r\n\nAlok Prasanna Kumar: Even if an independent clemency commission were established, its advice would not be binding on the President. While the President may seek a range of information to make a reasoned decision, as former President Harry Truman famously stated, “the buck stops here.” Transparency is important, and in today’s age of social media and a free press, the public will likely be aware of the reasons behind a presidential decision. However, that does not guarantee that every decision will be immediately acceptable to the public at large. \n\nWhat are the controversies around pardoning power?| Explained\n\nSanjay Hegde: The public doesn’t always agree with clemency decisions. One of the most notable examples is when U.S. President Gerald Ford pardoned his predecessor, Richard Nixon. He believed that the country had endured enough during the Watergate scandal and that the matter should be put to rest, as Nixon had already been punished by losing the presidency. He felt that a criminal trial would only prolong the nation’s agony. At the time, special prosecutor Leon Jaworski chose not to challenge this decision.\n\n In contrast, the clemency system in India has not been widely abused. Former Presidents such as A.P.J. Abdul Kalam and Pratibha Patil have only sat on files, exercising a pocket veto whenever they disagreed with government advice. The pardon jurisdiction for non-capital offences has rarely been exercised.\r\n\n Would expanding the scope of judicial review over executive clemency decisions prevent potential overreach or misuse?\r\n\nSanjay Hegde: I don’t think the U.S. will ever adopt such a system. President-elect Donald Trump has expressed an inclination to pardon rioters involved in the January 6, 2021, Capitol attack. There are also speculations that President Biden may pre-emptively pardon several individuals before he demits office. I doubt the judiciary will step in to second-guess the President’s authority in these matters.\n\n In India, both the President and the Governor act on the aid and advice of the Cabinet. In fact, the Supreme Court in Epuru Sudhakar v. State of Andhra Pradesh (2006) affirmed that a Governor’s grant of pardon could be challenged in court if it was found to be mala fide or based on irrelevant considerations.\n\nAlok Prasanna Kumar: I don’t believe that clemency decisions can be judicially reviewable. The concept of mercy is inherently subjective, and there cannot be one inalienable understanding of it. We also have to understand that constitutional functionaries inevitably bring their personal biases to bear on these decisions. While courts, as seen in India, may intervene in instances of procedural violations, there are no definitive legal benchmarks to determine what constitutes an appropriate exercise of clemency. Ultimately, it is unreasonable to assert that mercy should have one fixed meaning under the Constitution, or that clemency should be confined to a specific category of political cases.\n\n Should U.S. Congress play a greater role in the process? For instance, the Protecting Our Democracy Act, reintroduced in Congress last year, mandates the White House disclose all materials the President relies on when exercising clemency powers.\r\n\nSanjay Hegde: Even if Congress were to pass a law, it could only serve to guide the process. Clemency powers are unique — they speak to the inherent humanity shared by both the one who grants mercy and the one who receives it. There may be cases where a penalty has been imposed and the legal process is complete, yet new evidence emerges that calls for reconsideration. It is impossible to legislate strict standards, especially since they would never be binding. We have seen this discretionary authority play out when President Andrew Johnson pardoned Dr. Samuel Alexander Mudd, the physician who treated John Wilkes Booth’s broken leg after he assassinated Abraham Lincoln.\n\nAlok Prasanna Kumar: No law can entirely prevent its misuse. If someone in a position of authority is determined to break the law, there is little the law itself can do to stop them. While mechanisms can be put in place to ensure that such actions have stringent repercussions, total prevention is impossible to attain. For instance, we see police officers routinely abuse their powers of arrest.\n\n When it comes to clemency, defining what constitutes abuse or misuse is challenging, especially when the power itself is not clearly defined. For example, in 20 years, one might argue that granting clemency to Hunter Biden was one of the best decisions made by Joe Biden. We lack the foresight to deem such decisions egregiously wrong at this moment.\r\n\n What reforms are necessary in India’s clemency process, and what lessons can be drawn from the Hunter Biden case?\r\n\nSanjay Hegde: Given the nature of the power, one can at best have guidelines. However, ultimately executive discretion has to be trusted. We have seen our former Presidents exhibit varied views regarding the death penalty. One can also see how gubernatorial discretion played out in the release of A.G. Perarivalan, one of the convicts in the Rajiv Gandhi assassination case. The Governor obstructed his release despite the Tamil Nadu government’s recommendation. Ultimately, the Supreme Court had to intervene and order his release. The use of clemency powers in the case also signified the closing of a long and painful chapter. While public curiosity may lead to second-guessing these decisions, it is often not in the greater public interest to do so.\n\nAlok Prasanna Kumar: I believe comprehensive reforms are needed in the system of release of convicts. The Supreme Court is already cognisant of a batch of petitions on this issue. We need to prioritise reformative justice. Reformation is only achievable when individuals are given the assurance that, through good behaviour and genuine repentance, they may earn an early release — serving, for instance, seven years instead of 14. While these convicts have been incarcerated for legitimate reasons, the state must focus on their rehabilitation, as some of them have the potential to become valuable members of society. We should expedite processes like parole and remission, ensuring mercy extends beyond just death penalty cases. \n\nListen to the conversation in The Hindu Parley podcast","url":"https://www.thehindu.com/opinion/op-ed/should-the-executive-have-the-power-to-pardon/article68978702.ece","image":"https://th-i.thgim.com/public/incoming/ggsuim/article68978703.ece/alternates/LANDSCAPE_1200/IMG_FILE_PHOTO__FILE_PHO_2_1_B3DLP0C2.jpg","video":null,"publish_date":"2024-12-13 01:04:03","author":"Joe Biden. We","authors":["Joe Biden. We"],"language":"en","source_country":"in","sentiment":-0.23},{"id":272750106,"title":"Trump offers support for dockworkers union by saying ports shouldn’t install more automated systems","text":"WASHINGTON (AP) - President-elect Donald Trump on Thursday voiced his support for the dockworkers union before their contract expires next month at Eastern and Gulf Coast ports, saying that any further \"automation\" of the ports would harm workers.\n\nThe incoming president posted on social media that he met Harold Daggett, the president of the International Longshoreman’s Association, and Dennis Daggett, the union’s executive vice president.\n\n\"I've studied automation, and know just about everything there is to know about it,\" Trump posted. \"The amount of money saved is nowhere near the distress, hurt, and harm it causes for American Workers, in this case, our Longshoremen. Foreign companies have made a fortune in the U.S. by giving them access to our markets. They shouldn't be looking for every last penny knowing how many families are hurt.\"\n\nThe International Longshoremen's Association has until Jan. 15 to negotiate a new contract with the U.S. Maritime Alliance, which represents ports and shipping companies.","url":"https://news.net/news/trump-offers-support-for-dockworkers-union-by-saying-ports-shouldnt-install-more-automated-systems/","image":"https://dymlcaxjpm5z9.cloudfront.net/wp-content/uploads/2024/12/13204742/Trump_21653-scaled.jpg","video":null,"publish_date":"2024-12-13 01:03:03","author":"Josh Boak","authors":["Josh Boak"],"language":"en","category":"politics","source_country":"au","sentiment":-0.267},{"id":272749738,"title":"Musk becomes first-ever person worth US$400bn","text":"The Tesla and SpaceX CEO’s net worth skyrocketed to US$439,2 billion on Wednesday — an increase of about US$50 billion in just one day, according to Bloomberg figures.\n\nThe jump comes after an insider share sale at SpaceX boosted the space exploration company to a US$350 billion valuation, making it the most valuable private startup in the world. \n\nMusk is believed to own about 42 percent of the firm, NBC News reported.\n\nPrior to the massive boost on Wednesday, Musk’s net worth had already soared by an unmatched US$155 billion this year, placing him at US$384 billion as of market close on Tuesday, according to the Bloomberg Billionaires Index.\n\nThe index, which has not yet been publicly updated to reflect the latest jump, on Tuesday showed Musk US$140 billion ahead of the world’s second richest person, Amazon founder Jeff Bezos, who’s worth US$244 billion.\n\nThe jump comes after the world’s richest person broke his wealth record of about US$340 billion in late November, which had stood for just over three years.\n\nMusk’s soaring wealth also piggybacks on the postelection rally for Tesla stock. Tesla’s stock has soared nearly 71 percent so far this year. Its market cap is US$1,23 trillion.\n\nThe stock has surged since Donald Trump’s victory in the US presidential election, as investors wagered the electric vehicle maker would benefit from Musk’s close ties to the president-elect.\n\nMark Malek, Siebert’s chief investment officer, previously told BI that “some sort of premium has been placed on the stock as a result of Musk’s very public involvement in Trump’s campaign.”\n\nTesla could continue to make further gains. Analysts at Bank of America said in a note last week that a recent visit to the Austin factory gave them “increased confidence that TSLA is well-positioned to grow in 2025+ with its core EV business launch of its robotaxi offering, and longer-term from its investments in Optimus.” -Business Insider Africa","url":"https://www.herald.co.zw/musk-becomes-first-ever-person-worth-us400bn/","image":"https://www.herald.co.zw/wp-content/uploads/sites/2/2023/02/Untitled-5-3-200x200.jpg","video":null,"publish_date":"2024-12-13 01:01:04","author":"The Herald","authors":["The Herald"],"language":"en","source_country":"zw","sentiment":0.046},{"id":272749726,"title":"Gold will shine in bearish year ahead for commodities","text":"Tensions between the US and China may weigh on energy and commodities markets next year, while the outlook remains bright for gold, ING Groep NV said.\n\nPresident-elect Donald Trump’s pledges to slap tariffs on trading partners, and possible retaliation, could roil markets including oil, metals and agriculture as traders also look to stimulus measures from China to boost consumption, the lender said in its 2025 outlook.\n\n“We see large parts of the complex edging lower in 2025 with relatively comfortable supply and demand balances,” Warren Patterson and Ewa Manthey said in the report. \n\n“The potential for an escalation in trade tensions is a downside risk, while markets are waiting to see if and when Chinese support measures feed their way into commodity markets.”\n\nWhile Trump is unlikely to move the needle much on US oil production, crude is set to come under pressure from strong non-OPEC supply growth, and ING sees Brent slipping to an average of US$71 a barrel next year, from current levels around US$74. \n\nMeanwhile, new US LNG export plants are likely to lift domestic demand and prices while allowing Europe to more easily offset Russian supplies, leading to lower natural gas prices in the region assuming a normal winter.\n\nGold is set to continue this year’s streak of hitting consecutive records on geopolitical concerns, ING said, with prices averaging US$2 760 an ounce in 2025 from current levels of around US$2 713. \n\nMost of the buying will come from central banks looking to diversify their foreign reserves, while increased trade and geopolitical friction could add to bullion’s haven appeal. The outlook for industrial metals is murkier, with trade moves, potential changes to Biden’s climate laws and Chinese demand all likely to play a role, ING said. – Bloomberg","url":"https://www.herald.co.zw/gold-will-shine-in-bearish-year-ahead-for-commodities/","image":"https://www.herald.co.zw/wp-content/uploads/sites/2/2024/12/Donald-Trump-200x200.jpg","video":null,"publish_date":"2024-12-13 01:01:04","author":"The Herald","authors":["The Herald"],"language":"en","source_country":"zw","sentiment":0.166},{"id":272749830,"title":"Seoul vows unhindered preparations for US policy shifts amid political turmoil","text":"Korea's trade ministry said Tuesday it will work closely with related government agencies and local businesses to avoid any disruptions in preparing for the launch of the new U.S. administration amid ongoing domestic political turmoil.\n\nTrade Minister Cheong In-kyo discussed such strategies with trade and international relations experts in Seoul, a week after President Yoon Suk Yeol declared martial law, which was lifted just six hours later following a National Assembly vote to end it.\n\nDuring the meeting, participants reviewed Seoul's progress in preparing for the incoming Donald Trump administration, which has hinted at shifts in Washington's trade policies, including the imposition of sweeping tariffs of at least 10 percent on all imported goods.\n\n\"The government is drawing up countermeasures for key issues while closely monitoring the new U.S. government's cabinet and policy directions,\" Cheong said.\n\n\"The cutting-edge industries and supply chains of the two countries are closely connected through South Korea's massive investment. Based on this, we will seek to maintain the mutually beneficial cooperative relationship and minimize negative impacts on our companies,\" he added.\n\nThe ministry also vowed to maintain coordination with other government organizations to ensure that uncertainties sparked by the domestic political situation do not hinder such preparations.\n\nExperts at the meeting, meanwhile, noted that the second Trump administration is expected to bring significant changes compared to the first term, calling for the government to make thorough preparations.\n\nProfessor Lee Seung-joo of Chung-Ang University advised the government to adopt a \"transactional approach\" based on its networks in Washington to effectively address potential changes in U.S. trade policies. (Yonhap)","summary":"Korea&apos;s trade ministry said Tuesday it will work closely with related government agencies and local businesses to avoid any disruptions in preparing for the launch of the new U.S. administration amid ongoing domestic political turmoil.","url":"https://nation.lk/online/seoul-vows-unhindered-preparations-for-us-policy-shifts-amid-political-turmoil-287717.html","image":"https://img.koreatimes.co.kr/upload/thumbnailV2/c58dc1c2c17a416587bc975f1398a99b.jpg","video":null,"publish_date":"2024-12-13 01:00:25","author":null,"language":"en","category":"politics","source_country":"lk","sentiment":0.014},{"id":272750056,"title":"Man breaks world record by eating meat and potato pie in 17 seconds","text":"A man has been crowned as the new world pie-eating champion after eating a meat and potato pie in 17 seconds flat. \n\nMichael Chant, 43, beat the previous record holder Martin Appleton-Clare, who ate his pie in 23 seconds, at the event in Wigan, Manchester.\n\nStar of Channel 5’s ’22 Kids and Counting’, Noel Radord, supplied the pies for the competition.\n\nAfter claiming his trophy, Michael, of nearby Bury, said: ‘I’ve wanted to compete for a while but Covid stopped it for a couple of years and this was the first time since then I could enter.\n\n‘I saw the previous quickest was 23 seconds and I thought I could probably eat two in that time. I’d been eating them in 12 seconds in practice, but these pies must be a bit bigger.’\n\nMichael romped to victory after managing to finish his first pie in 15 seconds, but bosses said he’d dropped some filling on the floor, so he was forced to eat a second.\n\nHe’s already planning to enter next year’s competition, and said he shared his technique with the other entrants so they can have a ‘good battle’ next time.\n\n‘He just picked it up and ate it from his hand. What I do is slap the bottom of the pie so it lifts from the foil and spin it round. That way you can eat it quicker,’ he said.\n\n‘I’m going to watch my son’s nativity play and let him know his dad is a world champion.’\n\nTwo competitors were disqualified for eating too slowly. Dave Johnson, 54, and Gareth Jones, 49, both of Wigan, were red-carded after saying the pies were ‘too tasty’ to eat quickly.\n\nChampionship organiser Tony Callaghan said: ‘There were scandals all over the place – we had pies from outside Wigan, a winner not from Wigan and I dropped the trophy. Other than that, it was a very successful event and we love having something like this just before Christmas.’\n\nTony runs Harry’s Bar, which hosts the championship each year. He said he plans to send a meat and potato pie to Hallstatt Memory of Mankind in Austria.\n\nThe competition has been held annually in Wigan – where locals are known as pie eaters – since 1992.\n\nSome say the nickname comes from local miners ‘eating humble pie’ after going back to work during the general strike in 1926.\n\nGet in touch with our news team by emailing us at [email protected].\n\nFor more stories like this, check our news page.\n\nArrow MORE: Boy suffers life-changing illness after 50 are poisoned at market town kebab shop\n\nArrow MORE: Donald Trump joins exclusive club enjoyed by Hitler, Stalin, Khrushchev and Khomeini\n\nArrow MORE: Treat them to over £70 of best-selling Laneige skincare for just £35 with this Boots edit","summary":"Michael Chant finished his pies and headed off to see his son in the Nativity play (Picture: SWNS) A man has been crowned as the new world pie-eating champion after eating a meat and potato pie in 17 seconds flat. Michael Chant, 43, beat the previous record holder Martin Appleton-Clare, who ate his pie in &#8230;\n\n\nThe post Man breaks world record by eating meat and potato pie in 17 seconds appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/uk/man-breaks-world-record-by-eating-meat-and-potato-pie-in-17-seconds/","image":"https://metro.co.uk/wp-content/uploads/2024/12/SEC_232976972-3db2_1734019769.jpg?quality=90&strip=all&w=1200&h=630&crop=1","video":null,"publish_date":"2024-12-13 00:59:08","author":"Evelyn Blackwell","authors":["Evelyn Blackwell"],"language":"en","source_country":"us","sentiment":0.08},{"id":272748680,"title":"China to issue more debt, boost consumption in 2025","text":"SHENZHEN - China will allow more government spending and step up efforts to get its people to spend more in a bid to boost its economy in 2025, as the prospect of a heightened trade war with the US looms.\n\nThe country will increase its budget deficit, issue more bonds and cut interest rates, state media reported as the country’s leaders concluded an annual meeting on Dec 12 to set the economic agenda for the year ahead.\n\nThe meeting also listed, at the top of policymakers’ tasks for 2025, the need to “vigorously boost consumption”, according to a readout from national broadcaster CCTV on the Central Economic Work Conference held in Beijing from Dec 11 to 12.\n\nThe task of boosting consumption was listed second in 2024, behind innovation in science and technology. \n\nThe meeting, attended by senior party and government officials, including President Xi Jinping, said China should maintain stable growth, employment and prices in the year ahead, while helping people’s incomes grow in step with the economy. \n\nIts pro-growth message was the latest in a series of signals that China will ramp up support for an economy that faces growing external headwinds. \n\nWhile the readout expressed confidence in China’s trajectory and said the country was on track to fulfil its economic targets this year, it also acknowledged that “the unfavourable impact of changes in the external environment has deepened, and the running of China’s economy still faces many difficulties and challenges”.\n\nChina’s outlook on trade – a bright spot and key growth driver amid depressed domestic demand – is clouded by the prospect of a stiffer trade war following US President-elect Donald Trump’s return to the White House in January.\n\nTrump has pledged to impose additional 10 per cent tariffs on Chinese imports as soon as he takes office, and had earlier said he would levy duties of 60 per cent or more on these goods.\n\nAgainst this backdrop, boosting domestic demand has become an even more pressing priority.\n\nThe country has to “vigorously boost consumption” and “expand domestic demand in all respects”, the meeting said.\n\nPolicymakers are to take special measures to boost consumption, step up existing programmes, including one that incentivises upgrades of consumer goods and industrial equipment, and spur investment through government spending, it added.\n\nThe meeting also echoed the Politburo’s call on Dec 9 for “more proactive” fiscal policy and “moderately loose” monetary policy – language that is unusually strong, with the latter signalling the first relaxation of monetary policy in more than a decade.\n\nThe tone set by the 24-man party elite suggests that “policymakers are willing to do extraordinary things to offset the external shocks”, economist Larry Hu from financial services group Macquarie wrote in a note on Dec 9.\n\n“But how much they will do in 2025 will depend on two things: Their GDP (gross domestic product) target and the new US tariffs.”\n\nThe Central Economic Work Conference did not shed light on what China’s growth targets for 2025 would be, as is the norm. These are typically revealed at the annual parliamentary meetings, or Two Sessions, held in March. \n\nDr Zhang Zhiwei, president and chief economist of Pinpoint Asset Management, said the messages sent by the work conference and preceding Politburo meeting were positive.\n\n“I think the shift of policy this week is clearly more significant than that (which) took place in the last week of September,” he added, referring to an earlier Politburo meeting and an accompanying spate of stimulus measures.\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you.","url":"https://www.straitstimes.com/asia/china-to-issue-more-debt-boost-consumption-in-2025","image":"https://cassette.sphdigital.com.sg/image/straitstimes/0bd1727e4c36de90b0c01d19daf3b3efbe988c977ff8bbb893a7d744146f718b","video":null,"publish_date":"2024-12-13 00:56:03","author":"Joyce Zk Lim","authors":["Joyce Zk Lim"],"language":"en","source_country":"sg","sentiment":0.164},{"id":272748666,"title":"Childhood vaccines, deportations: Highlights from Trump’s interview with Time magazine","text":"WEST PALM BEACH - US President-elect Donald Trump discussed childhood vaccines, his deportation plans and Ukraine's use of US-supplied missiles in a lengthy Time magazine interview published on Dec 12. \n\nHere are some notable things Trump said, according to the interview transcript:\n\nUkraine’s use of US-supplied missiles\n\nTrump criticised Ukraine's use of US-supplied missiles for attacks deep into Russian territory.\n\n\"I disagree very vehemently with sending missiles hundreds of miles into Russia. Why are we doing that? We're just escalating this war and making it worse. That should not have been allowed to be done.\"\n\n\"Now they're doing not only missiles, but they're doing other types of weapons. And I think that's a very big mistake, very big mistake.\"\n\nTrump said he will not abandon Ukraine, however. \"I want to reach an agreement, and the only way you're going to reach an agreement is not to abandon,\" he said.\n\nEnding childhood vaccination programmes\n\nTrump said he could end some childhood vaccinations if he thinks they are dangerous.\n\n\"It could if I think it's dangerous, if I think they are not beneficial, but I don't think it's going to be very controversial in the end,\" he said.\n\nTrump said he will listen to the views of Mr Robert F. Kennedy Jr., his nominee for secretary of the Department of Health and Human Services. Mr Kennedy has sown doubts over the safety and efficacy of vaccines for years, including asserting a link between vaccines and autism.\n\nWhen asked about the connection between vaccines and autism, Trump said he will want to see test results and numbers. \n\n\"The autism rate is at a level that nobody ever believed possible. If you look at things that are happening, there's something causing it,\" he said.\n\nUsing the military to deport migrants\n\nTrump said he will use the military to deport migrants, but only to the extent the law allows. The Posse Comitatus Act prohibits the use of the military for domestic law enforcement.\n\n\"It doesn't stop the military if it's an invasion of our country, and I consider it an invasion of our country,\" Trump said.\n\n\"I think in many cases, the sheriffs and law enforcement is going to need help. We'll also get National Guard. We'll get National Guard, and we'll go as far as I'm allowed to go, according to the laws of our country.\"\n\nTrump also vowed to send migrants back to the country they came from and said he will impose tariffs on the countries that don't agree to accept the migrants.\n\n\"I'll get them into every country, or we won't do business with those countries,\" he said.\n\nBuilding more detention camps\n\nTrump said he will build more detention camps if needed. \n\n\"Whatever it takes to get them out. I don't care. Honestly, whatever it takes to get them out,\" he said.\n\n\"Again, I'll do it absolutely within the confines of the law, but if it needs new camps, but I hope we're not going to need too many because I want to get them out, and I don't want them sitting in camp for the next 20 years.\"\n\nRestoring policy of separating families\n\nTrump said he doesn't think he will need to go back to separating families. \n\n\"I don't believe we'll have to, because we will send the whole family back to the country,\" he said. \"I would much rather deport them together, yes, than separate.\"\n\nWar in the Middle East\n\nTrump said the war in the Middle East will get solved and that he trusts nobody, including Israel's Prime Minister Benjamin Netanyahu.\n\n\"I think the Middle East is going to get solved. I think it's more complicated than the Russia-Ukraine (war), but I think it's easier to solve,\" Trump said.\n\nHe also said he doesn't just support a two-state solution but whatever will bring lasting peace.\n\nAsked if he will allow Israel to annex the West Bank, Trump said, \"I will — what I'm doing and what I'm saying again, I'll say it again, I want a long-lasting peace.\"\n\nAbortion pills\n\nTrump said he is committed to making sure the Food and Drug Administration does not strip women's ability to access abortion pills.\n\n\"That would be my commitment. Yeah, it's always been my commitment,\" he said.\n\nPardoning Jan 6 defendents\n\nTrump said he will pardon defendants involved in the Jan 6, 2021 Capitol attack on a \"case-by-case\" basis on his first day in office on Jan 20, \"maybe (in) the first nine minutes.\"\n\n\"We're going to look at each individual case, and we're going to do it very quickly, and it's going to start in the first hour that I get into office. And a vast majority of them should not be in jail.\"\n\nClosing Department of Education\n\nTrump said he wants to \"move education back to the states\" and wants a \"virtual closure\" of the Department of Education in Washington.\n\n\"We're at the bottom of every list in terms of education, and we're at the top of the list in terms of the cost per pupil, and we want to move them back to the states, and we'll spend half the money on a much better product.\" \n\nSenate filibuster\n\nTrump said he would keep in place the Senate rule known as the filibuster, which requires 60 of its 100 members to agree to pass most legislation, a threshold the new Republican-majority Senate will not clear with Republican votes alone.\n\nTrump noted the filibuster rule would make it difficult for his administration to overturn some Biden-era policies. But when asked if he intended to keep the filibuster in place, Trump responded that he did.\n\n\"So I have respect for the filibuster,\" Trump said.\n\nRecess appointments\n\nTrump did not commit to using recess appointments to install his picks for top administration posts if he cannot get them approved by the Senate. A recess appointment is an appointment by the president when the Senate is in recess.\n\n\"I really don't care how they get them approved, as long as they get them approved,\" he said. REUTERS\n\nJoin ST's Telegram channel and get the latest breaking news delivered to you.","url":"https://www.straitstimes.com/world/united-states/childhood-vaccines-deportations-highlights-from-trumps-interview-with-time","image":"https://cassette.sphdigital.com.sg/image/straitstimes/40be7e2a6a2d3146e3fa950e781c3d578f22a11034325558363a28a7b3d148eb","video":null,"publish_date":"2024-12-13 00:56:03","author":null,"language":"en","source_country":"sg","sentiment":-0.345},{"id":272748114,"title":"GOP rep calls to strip power from DC and for Black Lives Matter Plaza to be 'paved over'","text":"One House Republican who has long sought to curtail Washington, D.C.'s sovereignty is now pushing for President-elect Donald Trump to help him not only tighten Congress' screws on D.C.'s elected government, but also wants to erase one of the city's most high-profile racial justice monuments.\n\nAccording to the Daily Caller, Rep. Andrew Clyde (R-Ga) is planning to introduce a bill to further put the nation's capital city even further under the thumb of Congress by drastically transforming the \"home rule\" policy that currently governs the city. And he told the publication he's also seeking to eliminate Black Lives Matter Plaza on 16th and K Street Northwest, reverting the street back to its initial design.\n\nAs Destination D.C. (the official tourism website for Washington, D.C.) notes on its website, Black Lives Matter Plaza was inspired in the wake of the nationwide protests that followed the killings of George Floyd in Minneapolis, Minnesota and Breonna Taylor in Louisville, Kentucky at the hands of police. After a massive protest at Lafayette Square was met with tear gas and a violent response by riot police, local artists painted the phrase \"Black Lives Matter\" on the street across from the White House. D.C. Mayor Muriel Bowser and the D.C. City Council made the installation permanent and blocked the road from non-pedestrian traffic.\n\nREAD MORE: (Opinion) Gun store-owning House Republican demands arming teachers during hearing on Uvalde school shooting\n\n\"I would think that that is something that we should do. You have a street that is blocked off. It should not be blocked off. You have businesses that are negatively affected by it and they shouldn’t be negatively affected by it,\" Clyde said. \"The Black Lives Matter movement in and of itself should be All Lives Matter, not just Black Lives Matter, but All Lives Matter.\"\n\n\"So in that respect, I don’t agree with this. And the fact that the city spent almost $5 million on it is an incredible waste of money. And then to maintain it, another waste of money,\" he added. \"So, honestly, the street needs to go back to the way it was, which is a public thoroughfare and the Black Lives Matter wording needs to be paved over.\"\n\nClyde pointed out that Article 1, Section 8, Clause 17 of the U.S. Constitution gives Congress jurisdiction over D.C. Currently, Congress has a time limit to strike any laws that the city passes. But under Clyde's legislation, no legislation D.C.'s elected government passes would go into effect without the explicit blessing of Congress. D.C. has run afoul of Congress in the past, as a ballot measure legalizing recreational marijuana within city limits was overridden by Congress.\n\n\"President Trump said that he planned on cleaning up the city,\" Clyde told the Caller. \"We’re going to help him do that.\"\n\nREAD MORE: Republican loses it at Rep. Jamie Raskin when he's cornered for calling January 6 a 'normal tourist visit'\n\nClick here to read the Caller's full report.","summary":"One House Republican who has long sought to curtail Washington, D.C.'s sovereignty is now pushing for President-elect Donald Trump to help him not only tighten Congress' screws on D.C.'s elected government, but also wants to erase one of the city's most high-profile racial justice monuments.\n\nAccording to the Daily Caller, Rep. Andrew Clyde (R-Ga) is planning to introduce a bill to further put the nation's capital city even further under the thumb of Congress by drastically transforming the \"home rule\" policy that currently governs the city. And he told the publication he's also seeking to eliminate Black Lives Matter Plaza on 16th and K Street Northwest, reverting the street back to its initial design.\n\nAs Destination D.C. (the official tourism website for Washington, D.C.) notes on its website, Black Lives Matter Plaza was inspired in the wake of the nationwide protests that followed the killings of George Floyd in Minneapolis, Minnesota and Breonna Taylor in Louisville, Kentucky at the hands of police. Aft","url":"https://www.alternet.org/gop-rep-dc/","image":"https://www.alternet.org/media-library/image.png?id=55307585&width=1200&height=600&coordinates=0%2C99%2C0%2C99","video":null,"publish_date":"2024-12-13 00:54:00","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"us","sentiment":0.051},{"id":272747740,"title":"Time Magazine names Donald Trump person of the year for second time","text":"NEW YORK: Time Magazine on Thursday named US President-elect Donald Trump its \"person of the year,\" marking the second time he has won the accolade, in acknowledgement of the mogul´s stunning political comeback.\n\nTrump, who defeated Vice President Kamala Harris in the November 5 election, adorns the magazine's title cover sporting his distinctive red tie and striking a commanding pose.\n\n\"For marshaling a comeback of historic proportions, for driving a once-in-a-generation political realignment, for reshaping the American presidency and altering America's role in the world, Donald Trump is Time's 2024 — Person of the Year,\" the magazine said.\n\nThis year saw Trump convicted on charges of business fraud and nearly assassinated twice — and will end with him preparing to return to the White House with Republican majorities in both chambers of Congress.\n\n\"We are witnessing a resurgence of populism, a widening mistrust in the institutions that defined the last century, and an eroding faith that liberal values will lead to better lives for most people. Trump is both agent and beneficiary of it all,\" the magazine added.\n\nTrump rang the opening bell at the New York Stock Exchange to applause from traders on Thursday, flanked by his wife Melania Trump and Vice President-elect JD Vance, with his Time Magazine cover displayed prominently behind him.\n\nIn remarks before the markets opened, Trump sounded a note of caution about the promises he made on the campaign trail to bring down stubbornly high US grocery prices.\n\n\"It's hard to bring things down once they're up,\" Trump says. \"You know, it's very hard.\"\n\nThe magazine's award, given out annually, is an acknowledgement of the year's most influential figure. Past winners include Taylor Swift and Volodymyr Zelensky — and Trump himself, in 2016, after his shock defeat of Hillary Clinton.\n\nMock versions of Time Magazine covers featuring Trump were displayed prominently in several of the president-elect's members clubs ahead of his first \"person of the year\" title in 2016.\n\nTrump influence\n\nHaving dominated the news events of 2024, Trump's influence is set to continue when he assumes the presidency in January.\n\nThis time around, Trump is promising mass expulsions of undocumented immigrants and major tariffs that threaten to shake up not just the US economy, but those of key trade partners.\n\nHe´s cast doubt on continued support for Ukraine in its fight against the Russian invasion, and has already become something of a shadow president, feting foreign leaders at his Mar-a-Lago estate in Florida.\n\nHis comeback was unthinkable a few years ago.\n\nAfter his supporters stormed the US Capitol in an attempt to overturn his 2020 election loss, it seemed like Republicans might be ready to wash their hands of the brash outsider who had taken over the party.\n\nCriminal cases were launched over his efforts to overturn the 2020 election, and he was found liable in civil court for sexual abuse. He remains a polarising figure in US and world politics.\n\nYet none of that prevented him from rising back up to the top of the Republican ticket, and then going on to win in the general election against Harris.\n\nHarris was among those shortlisted for the award, alongside Mexican President Claudia Sheinbaum, Israeli Prime Minister Benjamin Netanyahu and Russian economist Yulia Navalnaya, the widow of late opposition leader Alexei Navalny.","url":"https://www.thenews.com.pk/latest/1260931-time-magazine-names-donald-trump-person-of-the-year-for-second-time","image":"https://www.thenews.com.pk/assets/uploads/updates/2024-12-12/l_1260931_104644_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":0.2},{"id":272747738,"title":"Biden grants clemency to nearly 1,500 people: White House","text":"WASHINGTON: Outgoing US President Joe Biden said on Thursday he had commuted the sentences of nearly 1,500 people and pardoned 39 others, in what the White House called the largest single-day act of clemency in the nation´s history.\n\n“America was built on the promise of possibility and second chances,” Biden said in a statement announcing the action. “As president, I have the great privilege of extending mercy to people who have demonstrated remorse and rehabilitation.”\n\nThe White House said the nearly 1,500 people granted commuted sentences -- “the most ever in a single day” -- had been serving them at home for at least one year.\n\n“These commutation recipients, who were placed on home confinement during the Covid pandemic, have successfully reintegrated into their families and communities and have shown that they deserve a second chance,” Biden said.\n\nThe American Civil Liberties Union (ACLU), which had launched a campaign urging Biden to take such action, praised the move in a statement.\n\n“We are thrilled that President Biden has allowed people to remain with their families and communities, where they belong,” said Cynthia W. Roseberry, director of policy and government affairs at the ACLU´s Justice Division.\n\nThe mass clemency was announced over a week after the president pardoned his son Hunter, something he had previously promised not to do, prompting outrage from both Republican opponents and many Democratic allies.\n\nHunter Biden pleaded guilty in a tax evasion trial in September and was facing up to 17 years in prison. He had separately been convicted of federal gun charges, for which he was facing 25 years in prison.\n\nThe president´s controversial pardon of his son followed in the footsteps of his predecessors, who also gave reprieves on their way out the door to family and well-connected allies.\n\nBill Clinton, for example, granted a pardon on his last day in office to his half-brother Roger, who had served time in prison on drug charges, while Donald Trump pardoned his son-in-law´s wealthy father, Charles Kushner.\n\nThe White House said those getting relief from the president on Thursday included a “a decorated military veteran and pilot who spends much of his time helping his fellow church members.”\n\nA nurse “who has led emergency response for several natural disasters” and an addiction counsellor “who volunteers his time” were also singled out for relief.\n\n“Together, these actions build on the President´s record of criminal justice reform to help reunite families, strengthen communities, and reintegrate individuals back into society,” the White House said.\n\n“The president has issued more sentence commutations at this point in his presidency than any of his recent predecessors at the same point in their first terms.”","url":"https://www.thenews.com.pk/print/1261089-biden-grants-clemency-to-nearly-1-500-people-white-house","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261089_042255_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.276},{"id":272747734,"title":"FBI did not send undercover operatives to join Jan 6 attack, says watchdog","text":"WASHINGTON: The FBI did not send undercover agents to participate in the Jan 6, 2021, attack on the US Capitol and did not authorise its informants to enter the building or engage in violence, the US Justice Department’s internal watchdog said on Thursday.\n\nThe findings by Justice Department Inspector General Michael Horowitz run counter to far-right conspiracy theories by supporters of President-elect Donald Trump who have repeatedly made baseless claims suggesting that FBI operatives were secretly involved in the Capitol riot.\n\nOne such false claim pertained to James Ray Epps, an Arizona man who entered the Capitol that day. Epps, who was charged last year with a misdemeanor for entering a restricted building or grounds, was falsely accused by Trump’s supporters and by former Fox News host Tucker Carlson of being an undercover government informant.\n\nHorowitz’s report comes a little more than a month before Trump will be sworn in for his second term as president. He has pledged to grant clemency to many of the people who stormed the Capitol as soon as his first day in office.","url":"https://www.thenews.com.pk/print/1261087-fbi-did-not-send-undercover-operatives-to-join-jan-6-attack-says-watchdog","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261087_042019_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.26},{"id":272747730,"title":"European troops in Ukraine could guarantee future peace deal: Kyiv","text":"KYIV, Ukraine: The deployment of European troops in Ukraine could help guarantee a future deal aimed at securing peace in the nearly three-year war with Russia, a senior Kyiv official said on Thursday.\n\nPolish Prime Minister Donald Tusk and French President Emmanuel Macron discussed the idea of stationing foreign troops in Ukraine in case of a ceasefire during talks on Thursday, Tusk said, although he cautioned Warsaw was not currently planning such a move.\n\nThe discussions come as US President-elect Donald Trump pushes for a quick ceasefire to end the fighting once he enters office next month.\n\nA senior Ukrainian official told AFP that Kyiv was open to “all ideas” that could help guarantee future peace, including “military contingents” being deployed in Ukraine.\n\nRussian President Vladimir “Putin always breaks the ceasefire, he has done so dozens of times, not only in Ukraine. That´s why we need guarantees, and the presence of military contingents can be one of them,” the source told AFP.\n\n“This conversation is now being conducted by the Europeans. Macron is obviously the leader of this idea,” the source added.\n\nMacron did not mention the possibility of foreign peacekeepers in his statement to journalists on his visit to Warsaw on Thursday.\n\nBut he has previously floated the idea of Western troops being sent to Ukraine, saying in February boots on the ground could not be ruled out.\n\nAsked about the proposal on Monday, Ukrainian President Volodymyr Zelensky said: “Frankly, we can think and work on Emmanuel (Macron)´s position.”","url":"https://www.thenews.com.pk/print/1261082-european-troops-in-ukraine-could-guarantee-future-peace-deal-kyiv","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261082_041237_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.133},{"id":272747708,"title":"Musk’s net worth tops $400bn, Forbes billionaires list shows","text":"WASHINGTON: Tesla CEO Elon Musk’s net worth crossed $400 billion on Thursday, the Forbes real-time billionaires list showed, boosted by a nearly 71 percent surge in the automaker’s shares this year and the soaring valuation of his rocket company SpaceX.\n\nMusk is Tesla’s largest shareholder with about a 13 percent stake in the company. The EV maker’s shares rose to a record high of $424.9 on Wednesday, extending a rally that kicked off following the Nov5 election.\n\nHis net worth was also boosted by an insider share sale of SpaceX, which Musk heads. The rocket company and its investors agreed to purchase as much as $1.25 billion of its common shares, Bloomberg News reported on Tuesday.\n\n“What’s really crazy about this is that almost no investors wanted to sell shares even at a $350B valuation!” Musk wrote in a reply to a post on X referring to the Bloomberg report.\n\nHe added that SpaceX has reduced the number of shares it bought back from employees in order to bring in some new investors.\n\nTesla investors have pinned their hopes on Musk’s relationship with President-elect Donald Trump, hoping the billionaire’s role in shaping the incoming Republican administration’s policy agenda would benefit the automaker.\n\nBesides Tesla, Musk also heads brain technology startup Neuralink. Both SpaceX and Neuralink rely heavily on government regulation and policy and could benefit from a business-friendly administration.\n\nMusk, who spent over a quarter of a billion dollars to help Trump win the election, also owns social media site X and tunnel builder The Boring Company.","url":"https://www.thenews.com.pk/print/1261084-musk-s-net-worth-tops-400bn-forbes-billionaires-list-shows","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261084_041504_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":"Rueters","authors":["Rueters"],"language":"en","source_country":"pk","sentiment":-0.343},{"id":272747698,"title":"Biden grants clemency to nearly 1,500 people, most ever in a day","text":"Outgoing US President Joe Biden said on Thursday he had commuted the sentences of nearly 1,500 people and pardoned 39 others, in what the White House called the largest single-day act of clemency in the nation's history.\n\n\"America was built on the promise of possibility and second chances,\" Biden said in a statement announcing the action. \"As President, I have the great privilege of extending mercy to people who have demonstrated remorse and rehabilitation.\"\n\nWith their days in power ticking down, lame-duck presidents often issue a flurry of such acts of clemency, which are only applicable to federal crimes.\n\nThe White House said the nearly 1,500 people granted commuted sentences — \"the most ever in a single day\" — had been serving them at home for at least one year.\n\n\"These commutation recipients, who were placed on home confinement during the COVID pandemic, have successfully reintegrated into their families and communities and have shown that they deserve a second chance,\" Biden said.\n\nThe American Civil Liberties Union (ACLU), which had launched a campaign urging Biden to take such action, praised the move in a statement.\n\n\"We are thrilled that President Biden has allowed people to remain with their families and communities, where they belong,\" said Cynthia W. Roseberry, director of policy and government affairs at the ACLU's Justice Division.\n\nThe mass clemency was announced over a week after the president pardoned his son Hunter, something he had previously promised not to do, prompting outrage from both Republican opponents and many Democratic allies.\n\nHunter Biden pleaded guilty in a tax evasion trial in September and was facing up to 17 years in prison. He had separately been convicted of federal gun charges, for which he was facing 25 years in prison.\n\nThe president's controversial pardon of his son followed in the footsteps of his predecessors, who also gave reprieves on their way out the door to family and well-connected allies.\n\nBill Clinton, for example, granted a pardon on his last day in office to his half-brother Roger, who had served time in prison on drug charges, while Donald Trump pardoned his son-in-law´s wealthy father, Charles Kushner.\n\nThe White House said those getting relief from the president on Thursday included a \"a decorated military veteran and pilot who spends much of his time helping his fellow church members.\"\n\nA nurse \"who has led emergency response for several natural disasters\" and an addiction counsellor \"who volunteers his time\" were also singled out for relief.\n\n\"Together, these actions build on the President´s record of criminal justice reform to help reunite families, strengthen communities, and reintegrate individuals back into society,\" the White House said.\n\n\"The President has issued more sentence commutations at this point in his presidency than any of his recent predecessors at the same point in their first terms.\"","url":"https://www.thenews.com.pk/latest/1260938-biden-grants-clemency-to-nearly-1500-people-most-ever-in-a-day","image":"https://www.thenews.com.pk/assets/uploads/updates/2024-12-12/l_1260938_114307_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":-0.237},{"id":272747694,"title":"Time Magazine names Trump person of the year for second time","text":"NEW YORK: Time Magazine on Thursday named US President-elect Donald Trump its “person of the year,” marking the second time he has won the accolade in acknowledgement of the mogul´s stunning political comeback.\n\nTrump, who defeated Vice President Kamala Harris in the November 5 election, adorns the magazine´s title cover sporting his distinctive red tie and striking a pensive pose.\n\n“For marshaling a comeback of historic proportions, for driving a once-in-a-generation political realignment, for reshaping the American presidency and altering America´s role in the world, Donald Trump is Time´s 2024 - Person of the Year.”\n\nThis year saw Trump convicted on charges of business fraud and nearly assassinated twice -- and will end with him preparing to return to the White House with Republican majorities in both chambers of Congress.\n\n“We are witnessing a resurgence of populism, a widening mistrust in the institutions that defined the last century, and an eroding faith that liberal values will lead to better lives for most people. Trump is both agent and beneficiary of it all,” the magazine said in a statement.\n\nThe award, given out annually, is an acknowledgement of the year´s most influential figure. Past winners include Taylor Swift and Volodymyr Zelensky -- and Trump himself, in 2016, after his shock defeat of Hillary Clinton.","url":"https://www.thenews.com.pk/print/1261085-time-magazine-names-trump-person-of-the-year-for-second-time","image":"https://www.thenews.com.pk/assets/uploads/akhbar/2024-12-13/l_1261085_041638_updates.jpg","video":null,"publish_date":"2024-12-13 00:52:03","author":null,"language":"en","category":"politics","source_country":"pk","sentiment":0.375},{"id":272752060,"title":"Trump reiterates plan to conduct mass deportations of undocumented migrants","text":"Trump reiterates plan to conduct mass deportations of undocumented migrants\n President-elect Donald Trump was named Time magazine's Person of the Year on Thursday, and in an interview with the magazine, he reiterated a campaign pledge to begin mass deportations of undocumented migrants when he takes office next month. He also indicated he could try to use the military and local law enforcement to carry that out, saying, \"I will go up to the maximum level of what the law allows.\" Nikole Killion reports.","summary":"President-elect Donald Trump was named Time magazine's Person of the Year on Thursday, and in an interview with the magazine, he reiterated a campaign pledge to begin mass deportations of undocumented migrants when he takes office next month. He also indicated he could try to use the military and local law enforcement to carry that out, saying, \"I will go up to the maximum level of what the law allows.\" Nikole Killion reports.","url":"https://www.cbsnews.com/video/trump-reiterates-plan-to-conduct-mass-deportations-of-undocumented-migrants/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/12/13/ca5edcd8-deef-442d-92ba-9c91192a1d3d/thumbnail/1200x630/04529cd2f5b04c6d9882ada116b1b30a/1212-en-killion.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-13 00:52:00","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.476},{"id":272747424,"title":"Huckabee ready to ‘witness a level of history’ as ambassador to Israel, former governor tells Little Rock Chamber","text":"Former Arkansas Gov. Mike Huckabee, nominated by President-elect Donald Trump to be the next U.S. ambassador to Israel, was keynote speaker Thursday as the Little Rock Regional Chamber of Commerce celebrated its 159th annual meeting.","url":"https://www.arkansasonline.com/news/2024/dec/12/huckabee-ready-to-witness-a-level-of-history-as/?business","image":"https://wehco.media.clients.ellingtoncms.com/img/news/tease/2024/12/12/121224_Huckabee_1sv_tease_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4","video":null,"publish_date":"2024-12-13 00:51:03","author":"Andrew Moreau","authors":["Andrew Moreau"],"language":"en","category":"politics","source_country":"us","sentiment":0.036},{"id":272747278,"title":"Browse the Archive","text":"President-elect Donald Trump’s threat to impose punitive tariffs on imports from Canada and Mexico (and China) has, unsurprisingly, provoked near panic among Canadian elites who have long considered themselves to be trusted junior partners of the United States.\n\nThere is a widespread sense that the liberal economic order is on the verge of collapse, potentially leaving Canada alone and adrift, a minnow in a sea of competing national powers.\n\nIt is instructive to recall the great Canadian debate over free trade with the US in the mid to late 1980s when fears of American protectionism prompted a hotly debated major shift of Canadian economic policy away from interventionism to hands off neoliberalism.\n\nLeft nationalist critics of the deal such as University of Toronto economists Steven Clarkson and Mel Watkins presciently argued that the loss of economic sovereignty was not worth the price since the US would never allow itself to be bound by the rules. Multilateralism through the General Agreement on Tariffs and Trade (later renamed the World Trade Organization) was not perfect, but still tempered the crudest forms of American protectionism.\n\nLong before Donald Trump was re-elected, the US managed trade with Canada in sensitive sectors such as lumber, threatened to unilaterally invoke the national security exemption when it deemed it necessary, and under both the Trump and Biden administrations, rejected the dispute settlement process at the WTO.\n\nIn retrospect, the much lauded rules based trading system was full of holes, and it is not about to return.\n\nEvery crisis is an opportunity, and, as in the 1980s, the right in Canada has quickly seized on the rise of US protectionism to promote its own policy agenda. Particularly instructive is a commentary in the online publication The Hub by Rudyard Griffiths and Sean Speer, a former senior economic adviser to Steven Harper.\n\nThey argue convincingly that Canada needs to recognize Trump’s serious intent to strip out Canadian production and jobs, and propose that Canada should respond preemptively by boosting the long-term competitiveness of Canadian capital. An all too familiar list of policy recommendations includes deep cuts to corporate taxes, ditching the Trudeau government’s higher taxes on capital gains, deregulation of business across the board, watering down environmental rules and reviews, and ending supply management in agriculture.\n\nIn a similar vein the major business organizations, notably the Business Council of Canada, are calling for an expansion of energy extraction, the dismantling of the tepid Liberal climate change plan, and a major boost to defence spending tied to a militarized industrial strategy. They are also, more stealthily, supporting spending cuts to finance the security agenda while still reducing the federal deficit and debt.\n\nWhat Griffiths and Speer call “Plan B” is generally supported by Pierre Poilievre and the Conservative premiers. Meanwhile, the Liberals and centre-left opinion seem to believe that Trump can be appeased by a “Team Canada” lobbying effort spearheaded by political and corporate elites, and modest negotiated changes to border security and other irritants.\n\nFor their part, the NDP has recently focused on transactional so-called pocket book issues, and has at best advocated a modestly redistributive social investment and fair tax agenda while largely ignoring the deep structural problems of the Canadian economy.\n\nIt has been almost 40 years since there was major debate in Canada about our relations with the US. While the FTA was implemented after the 1988 election, a majority of voters supported a more active role by governments in shaping economic development.\n\nToday we are confronted with the very serious probability that the free trade era has come to an end and that the trade deals now in place will be revoked or simply ignored. We badly need to develop and debate alternatives.\n\nSome serious questions must be raised and responded to by a now far weaker political left. What use could we make of the policy levers we surrendered in the 1988 FTA, such as the energy and public procurement rules, sensible limits on intellectual property rights, and regulation of foreign investment? When it comes to trade, what scope is there for more independent economic development strategies? How should Canada position itself relative to the economic competition between the US and China?\n\nAs during the original free trade battle, coalitions on the left must fight the nakedly self-interested appeasement strategy pursued by Canadian business elites and right-wing think tanks. A progressive response to the Trump threat should also stress, as during the COVID crisis, social solidarity and emergency support for workers and industries harmed by punitive tariffs. But, looking ahead to future crises, Canadian progressives should also consider what is needed to build a more self-reliant, resilient and fairer national economy fit for the new international disorder.\n\nAndrew Jackson is the former chief economist at the Canadian Labour Congress.\n\nScott Sinclair is the former senior researcher on trade and investment at the Canadian Centre for Policy Alternatives.","url":"https://canadiandimension.com/articles/view/canada-and-the-new-world-disorder","image":"https://canadiandimension.com/images/articles/_resized/Donald_Trump_(53951825672).jpg","video":null,"publish_date":"2024-12-13 00:50:03","author":"Gage Skidmore","authors":["Gage Skidmore"],"language":"en","source_country":"ca","sentiment":0.077},{"id":272746598,"title":"Emergence of the new Syria","text":"The revolution in Syria has achieved its goal, but everything is just beginning. The primary goal of the revolution was to topple the Assad regime. For 13 years, it came very close to toppling the regime from time to time, but what could not be achieved in 13 years was realized in 12 days, and the 61-year-old Baathist regime collapsed. The one responsible for 13 years of tears and bloodshed had to flee the country and seek refuge in Russia.\r\rMuch will be written about the revolution; many stories will be told. But the most important thing is how the future of Syria will be built from now on. Many dynamics will shape Syria’s future.\n\r\rInternal dynamics\r\rIn terms of internal dynamics, the rapid collapse of the regime constitutes an important starting point. Given that the Hayat Tahrir al-Sham (HTS) played a leading role in the overthrow of the regime, the transitional administration will also be dominated by the HTS. The peaceful transfer of power to the opposition by Syrian Prime Minister Mohammed Jalali, who remained the only symbolic representative of the regime in Damascus, ensured a relatively smooth start to the transition period. However, the top priority in Syria is to ensure security after the fall of the regime. To achieve full security, the military conflicts in the current controlled areas must be completely ended, and daily life must be made safe.\r\rGiven that the opposition controls more territory than it did during the revolution, ensuring security in Syria’s most populous cities, such as Damascus, Aleppo, Hama and Homs, is critical for the transition. However, in critical cities such as Daraa, Suveyda, Latakia and Tartous, the primary issue for building a smooth transition is establishing a sustainable security environment. Consensus on the formation of a civilian government and the continued functioning of state institutions is also critical to the stability of the transition. However, Israel’s growing appetite for the Golan Heights, the ambiguous behavior of the U.S.-backed opposition, and the YPG/PKK’s opportunistic approach raise the possibility of a resumption of military conflicts. Even though Iranian-backed militias have left Syria, the possibility that they have left behind asymmetric elements also points to the fragile nature of the security environment.\n\r\rAnother important point to be considered alongside security is that the transitional government should develop and implement an inclusive governance model for Syria’s political reconstruction process. It is clear that the HTS has transformed itself. However, there are still divergent views on many issues within the new administration. At this point, coordination and coexistence between different groups are crucial. The consensus between the Syrian interim government, the HTS, and other groups in the transition process will be the most critical issue in the reconstruction process. It does not seem possible for the PKK/YPG to continue with a territorial claim in this transition process. At a time when the support of the U.S. is vital, the PKK/YPG’s continued position on maximalist demands will cause the transition process in Syria to be painful in the northeast of Syria. Building inclusiveness to keep ethnic and sectarian diversity together should be an indispensable criterion for the new era in Syria.\r\r\r\rPolitical arrangements, which have many topics, can only be discussed during the transition period on a stable ground. These include the structure of the state, new security sector arrangements, power sharing, building a political system and free elections. Syria can only enter a democratic and conflict-free period in which the territorial integrity of Syria will be ensured if arrangements are made for governance and state structure that is not tied to territorial zones. The reconstruction of the security sector is among the most critical issues. Military groups must dissolve themselves and restructure under an interim defense ministry to be established in the coming period to eliminate potential conflicts.\r\rRegional dynamics\r\rFor regional actors, Türkiye’s role has become even more important. It is not possible to understand Türkiye’s role by focusing only on the last 12 days. Türkiye’s role can be more clearly understood by looking at the past 13 years. Ankara’s unwavering hosting of Syrian refugees, creating the military and diplomatic conditions to protect Idlib against the regime’s operations, and limiting and weakening the YPG, especially in the fight against terrorism, made a strong ground for the opposition’s 12-day success.\n\r\rTürkiye has a much more critical role to play in the new process. Türkiye is likely to lead efforts to stabilize northern Syria, secure its borders, and facilitate the return of refugees. Ankara’s ability to mediate and rebuild trust between the incoming government and the different factions will also help shape the political character of Syria’s future. If Türkiye succeeds in preventing YPG/PKK separatism, it could emerge as a dominant stabilizing force in the region. Another priority for Türkiye is to implement a multilateral method to shape regional and global diplomacy and ensure Syria’s territorial integrity. Ankara will continue to coordinate with Moscow and Tehran, even though Russia and Iran are much weakened in Syria.\r\rOne of the most critical regional actors in Syria is Israel. However, it is doubtful how much Israel wants to remain loyal to Syria’s territorial integrity. The reasons for this are obvious. Israel is keeping a Damascus-centered geopolitical narrative alive and is considering expansion into Syria. The creation of a new military situation in the Golan Heights is the most obvious evidence of this. The new government, which Netanyahu securitizes with the so-called radicals argument, also provides Israel with new legitimacy. The U.S.’ open support for Israel’s possible engagement in Syria also strengthens the possibility of Israel becoming a destabilizing actor in Syria. The only option to balance Israel is to keep the regional diplomacy dynamic against a possible fait accompli.\r\rIran’s position in the new Syria is highly questionable. Iran is aware that it is weakening and losing its depth in Lebanon and Syria. The collapse of the Syrian front, the most important pillar of the proxy doctrine based on territorial expansion and territorial control, may lead Iran to turn to asymmetric elements in Syria. Iran's Supreme Leader Ali Khamenei's framing of the opposition’s success as part of the U.S. and Israeli support is the most important sign of this.\r\rIt is clear that there is confusion in the Arab countries. It is understood that they will accept the new status quo even if they are not happy with the overthrow of the regime. The critical issue is to develop a new relationship model with Damascus to support the transition process and be part of the process to build a sustainable order in Syria. The way to do this is to work together with Türkiye to put maximum effort into building a stable Syria. At this point, the creation of a new diplomatic platform could be the first step toward coordination.\r\rInternational dynamics\r\rIn the new era, the U.S. priorities in Syria include Israel’s security, the continued existence of the PKK/YPG and the fight against Daesh. The weakening influence of Russia and Iran may make it easier for the U.S. to accept the new status quo and cooperate with it. The current balance on the ground may also facilitate U.S. President Donald Trump’s withdrawal from Syria. Considering that the pre-Nov. 27 plans and possible scenarios no longer have any meaning for the Washington administration, we can say that the new Syria will not be seen as a priority for the U.S. in the Middle East. Still, it is worth being cautious. There are many opportunities for Türkiye and the U.S. to build a new Syria without the PKK/YPG. It is almost impossible for a strategy built on the PKK/YPG to work in the new Syria.\r\rIt is also clear that Russia is in the midst of a reassessment in Syria. Moscow has had to revise its priorities while analyzing the causes of the new situation. Russia will not have the same position in the new Syria as before, and the smartest approach is to focus on the political process and establish relations with the new administration. It is very likely to use U.N. Resolution 2254 and the Astana format to increase its diplomatic depth.\r\r\r\rThe new Syria is one of the biggest geopolitical ruptures of the Arab Spring. The revolution has achieved its primary objective but establishing a new order in Syria is fraught with challenges. The lessons of Libya, Egypt, Yemen and Tunisia are fraught with political and social tragedy. Tunisia and Egypt chose to continue by building new authoritarianism on institutionalized systems. Yemen and Libya were not able to exit the process of political and military conflict over non-institutionalized structures, nor were they able to establish an order. Syria is an exception. It was a regime with a long civil war and a very different practice of institutionalization.\r\rIf those who succeeded in the revolution build a sustainable model and establish a new order in Syria, the new Syria has the opportunity to produce new results in the geopolitics of the Middle East. The only way to do this is to build a just, democratic and sustainable order. There is no model for this yet. And it will not be easy to build it.","url":"https://www.dailysabah.com/opinion/columns/emergence-of-the-new-syria","image":"https://idsb.tmgrup.com.tr/ly/uploads/images/2024/12/12/thumbs/1200x675/359194.jpg","video":null,"publish_date":"2024-12-13 00:46:03","author":"Murat Yeşiltaş","authors":["Murat Yeşiltaş"],"language":"en","source_country":"tr","sentiment":0.345},{"id":272746596,"title":"European powers say Ukraine's path into NATO 'irreversible'","text":"Ukraine's path to eventual NATO membership is \"irreversible,\" seven European foreign policy chiefs declared during a meeting in Berlin on Thursday, promising enhanced military and economic support.\r\rThe foreign ministers of Britain, France, Germany, Italy, Poland and Spain, and the EU's foreign policy chief pledged to provide Ukraine with viable security guarantees should negotiations on a cease-fire take place after U.S. President-elect Donald Trump takes office.\n\r\r\"We will continue to support Ukraine on its irreversible path to full Euro-Atlantic integration, including NATO membership,\" they said in a joint declaration after meeting their Ukrainian counterpart.\r\r\"Ukraine must prevail,\" they stressed in a so-called Berlin Declaration.\n\r\r\"We are committed to providing Ukraine with ironclad security guarantees, including reliable long-term provision of military and financial support.\"\r\rGermany's Foreign Minister Annalena Baerbock hosted the meeting as Ukraine's fight against Russia's invasion has raged for more than 1,000 days and into its third winter, with Kyiv's troops under heavy pressure.\r\rThe group came together to discuss steps to strengthen Ukraine in the event that Trump was to cut back military aid to Kyiv after taking office on Jan. 20 and push for a cease-fire with Russia, as he has indicated.\r\rThe top diplomats vowed to \"remain steadfast in our solidarity\" and \"continue to support Ukraine in its right of self-defense against Russian aggression.\"\n\r\rTrump has said solving the Ukraine crisis would be his top priority, but there are fears in Kyiv that he could try to force big concessions on Ukraine in return for a cease-fire.\r\rThe European ministers meeting in Berlin stressed: \"There can be no negotiations about peace in Ukraine without Ukrainians and without Europeans by their side.\"\r\rThey vowed to \"stand united with our European and transatlantic partners to think and act big on European security.\"\r\rThe group also said they would \"continue to support Ukraine on its path towards accession to the European Union.\"\r\rAhead of the meeting, Baerbock said: \"Here in this circle, we are unanimous. Ukraine needs tough security guarantees.\"\r\rThe guarantees for Kyiv would send a \"clear message,\" the foreign minister said. \"We stand up for the security and future of our European continent.\"\r\rPotential peacekeeping mission\r\rEU's foreign affairs chief, Kaja Kallas, said more needs to be done to support Ukraine in its defense against Russia.\r\r\"We have to do more to strengthen Ukraine on the battlefield,\" she stated. \"The stronger they are on the battlefield, the stronger they are behind negotiations.\r\r\"And, of course, it's up to Ukraine to say when they are ready to sit around any negotiation table,\" Kallas added.\r\rBaerbock and Kallas did not answer questions about the participation of German or European soldiers in a possible peacekeeping mission in Ukraine.\r\rEarlier in December, Baerbock refused to rule out the prospect, drawing criticism in Germany.\r\rUkrainian Foreign Minister Andrii Sybiha called for \"strong sanctions\" on Moscow.\r\r\"[Russian President Vladimir] Putin understands only force. That is why I am here,\" Sybiha said.\r\r\"And we do really hope that this established format will strengthen our joint efforts to achieve our strategic goal: just, comprehensive, long-lasting peace in Ukraine,\" he added.\r\rThe European Commission has meanwhile offered its support in the discussions about a peacekeeping mission to secure a possible future cease-fire in Ukraine.\r\rThe EU is prepared to coordinate efforts in this direction, said a spokesperson for Kallas in Brussels.\r\rRepresentatives of several NATO states have been holding confidential talks for weeks on how a possible future cease-fire in Ukraine could be monitored, sources told Deutsche Presse-Agentur (dpa).\r\rMacron calls for cooperation with US\r\rFrench President Emmanuel Macron was also meeting Polish Prime Minister Donald Tusk in Warsaw on Thursday to discuss European support for Ukraine under the new U.S. administration.\r\rFollowing the talks, Macron called for close cooperation between Europe and the United States in efforts to end the war in Ukraine on terms acceptable to Kyiv.\r\r\"We must work very closely with the Americans and, of course, with Ukraine to find a way that takes into account the interests of Ukraine, its sovereignty, as well as the interests of the Europeans and their security,\" he said.\r\rHe called for \"a peace negotiated by the Ukrainians and which offers them lasting security.\"\r\rMacron also noted the importance of coordination between European countries in formulating security guarantees for Ukraine after a possible peace deal with Russia.\r\rHe did not explicitly address the possibility of stationing a peacekeeping force with foreign soldiers in Ukraine.\r\rHowever, Tusk rejected media reports that Poland wanted to participate in a peacekeeping force after the war. \"At the moment, we are not planning any such actions,\" he said.\r\rUnconfirmed media reports had previously stated that the talks could include such considerations.\r\rThe Polish newspaper Rzeczpospolita cited an expert from the French Institute of International Relations as saying that a mission could consist of five brigades with a total of around 40,000 soldiers, with Poland potentially taking command of one of them.\r\rPolish Defense Minister Wladyslaw Kosiniak-Kamysz said on Tuesday: \"The deployment of Polish soldiers in Ukraine is currently out of the question.\"\r\rWhile the topic \"appears in publications,\" there is no official confirmation of the intention to station European troops in Ukraine, he said.\r\rTusk made it clear that Warsaw provides military aid to its neighbor and also maintains the most important logistical hub for Western military aid to Kyiv.\r\rIn addition, he noted that his country is still investing considerable resources to protect the external border of the EU and NATO with Russia and its ally Belarus, with 10,000 Polish soldiers stationed at the border.","url":"https://www.dailysabah.com/world/europe/european-powers-say-ukraines-path-into-nato-irreversible","image":"https://idsb.tmgrup.com.tr/ly/uploads/images/2024/12/12/thumbs/1200x675/359265.jpg","video":null,"publish_date":"2024-12-13 00:46:03","author":"Agencies","authors":["Agencies"],"language":"en","category":"politics","source_country":"tr","sentiment":0.074},{"id":272746686,"title":"My Turn: America dodged a bullet","text":"Now that Vice President Kamala Harris will never be President Harris, she should do America a favor and become a recluse so we won’t have to hear that cackle ever again.\n\nHonestly, this woman has been bizarre from the get-go. She’s never made any sense when she opens her mouth (check out the videos on YouTube of Harris over the years; like Joe Biden, she just gets worse). Throughout her ill-fated campaign, she would never answer a question, as you may recall; instead, she’d drone on about how she grew up in a middle-class family. Where were the fact-checkers? Mamala kept saying we need to lift each other up, yet she was always putting Donald Trump down. She proved time and time again that she was unfit to be commander-in-chief (Biden is unfit as well, but that’s another story). For years, she refused to go to the border, but found the time to visit a Planned Parenthood clinic and chat with a bewildered Oprah Winfrey (for a fee).\n\nNow, if Harris had won, can you imagine her meeting with Vladimir Putin? Heck, she couldn’t even handle being interviewed by Joe Rogan. But Trump goes on his podcast for three hours, then wins the election. Now the future looks bright again.\n\nBut according to a recent column by Rev. Julie G. Olmsted, “This election was a devastation for many. I have not observed anything but sorrow, worry and great anxiety for the future,” [Recorder, Dec. 7]. It’s so ridiculous that liberals are experiencing “great anxiety” over Trump (who’s already been president, wasn’t a dictator, and protected us). When Trump was in the White House, Americans enjoyed peace and prosperity, and liberals are still upset that he was successful and popular. The writer should stop observing liberals and observe Republicans for a change, as she’d discover that we are filled with joy and are optimistic about the next four years.\n\nThe writer goes on to say that, “We cannot continue to belittle, demean and dehumanize those with whom we disagree.” I agree wholeheartedly. So when are liberals gonna stop insulting Republicans? Remember when failed presidential candidate Hillary Clinton called Trump supporters ”deplorables”? How about when failed vice-presidential candidate Tim Walz called the GOP “weird”? And let’s not forget that Joe Biden called Republicans “garbage” just days before Trump defeated Harris.\n\nCertainly there’s been plenty of anger and hate directed at Trump supporters on a near daily basis in this newspapers. Perhaps one or two grumpy liberal writers will be in a better mood next year, but since Democrats will soon be losing their grip on power, I’m not holding my breath.\n\nBut I do have a big smile on my face because liberals are worried and outraged over Trump’s decisive victory this holiday season. When are liberals not worried and outraged? I’m just very, very thankful that Kamala will forever be known as a failed presidential candidate. I can hear Trump now — “Bye bye.”\n\nSherry Cowdrey lives in Shelburne Falls.","url":"https://recorder.com/Letter-to-the-editor-58422824","image":"https://recorder.com//attachments/84/47565284.jpg","video":null,"publish_date":"2024-12-13 00:46:03","author":"Sherry Cowdrey","authors":["Sherry Cowdrey"],"language":"en","category":"politics","source_country":"us","sentiment":-0.435},{"id":272746666,"title":"William M . Coli: Reality check","text":"The recent election by plurality, not majority, of Donald Trump to a second term is indeed a reality, albeit a sad one. It boggles the mind that people such a recent letter writer could feel that the Biden-Harris administration “has plunged our nation into chaos” [“Wants more of Trump's America,” Recorder, Dec. 11]. If the writer would get off the internet and Fox News and instead use reliable sources of factual information, he would know that serious crimes are down by double digits everywhere, over the last four years Biden-Harris has created over 16 million new jobs, has tamed raging inflation caused by Trump‘s failure to deal with the pandemic that killed 1.2 million Americans, has brought inflation down to just over the feds target of 2%, has restored manufacturing jobs to states all over the country, has good relations with our allies, and has not relied on a clown car full of appointees to important positions.\n\nWhile the economy may not be robust for 100% of working Americans, it is the envy of the world, with unemployment hovering around 4%, the lowest in many many years, and an amazingly strong job creation record as recently as last week. We now can look forward to true chaos while Trump‘s deluded supporters do their dance. Stay tuned for cuts to veterans benefits, cuts to Medicare Medicaid and Social Security, increased prices because of Trump‘s bizarre assumption that tariffs cost the importing country rather than the American consumer. If Trump‘s voters believed his lies about being for the working person perhaps they can help me understand why his nominees to important positions are all billionaires. Maybe someday these folks will join us on earth rather than stay in whatever bizarre reality they are currently living in.\n\nWilliam M . Coli","url":"https://recorder.com/Letter-to-the-editor-58413031","image":"https://recorder.com//attachments/54/46204954.jpg","video":null,"publish_date":"2024-12-13 00:46:03","author":null,"language":"en","category":"sports","source_country":"us","sentiment":-0.127},{"id":272746640,"title":"Biden aides in Middle East in diplomatic push for Syria, Gaza","text":"US Secretary of State Antony Blinken has arrived in Jordan, launching a crisis tour of the Middle East following the removal of Syrian President Bashar al-Assad.\n\nThe outgoing US diplomat, who is calling for an “inclusive” process to form Syria’s next government that protects minorities, touched down in the Red Sea city of Aqaba on Thursday, heading straight to a meeting with King Abdullah II before a trip to Turkiye later in the day.\n\nBlinken’s trip comes days after opposition forces launched a lightning offensive spearheaded by Hayat Tahrir al-Sham (HTS), a group formerly affiliated with al-Qaeda, ending five decades of brutal rule by the al-Assad family.\n\nAnnouncing the trip, the State Department said Blinken would call for a Syria that is not “a base of terrorism or posing a threat to its neighbours” – a nod to the concerns of Israel and Turkiye.\n\nSince al-Assad’s flight to Russia on Sunday, Israel has attacked Syria hundreds of times, hitting airports, air defence facilities and other infrastructure, and deploying its military to the buffer zone along the occupied Golan Heights separating Syria and Israel since 1974.\n\nTurkiye, for its part, has funded Syrian rebel fighters – known as the Syrian National Army (SNA) – to battle the Kurdish-led, US-backed Syrian Democratic Forces (SDF), pushing the group out of the northeastern city of Manbij.\n\nAnkara views the SDF, which has carved out self-ruled territory in the country’s east, as a “terrorist” group and wants to reduce its presence near its borders.\n\nBlinken’s diplomatic push on Syria comes as leaders of the Group of Seven (G7) major democracies issued a statement emphasising that al-Assad should be held accountable for his crimes.\n\nIn parallel with Blinken’s tour, National Security Adviser Jake Sullivan will meet Israeli leaders in Jerusalem on Thursday and then travel to Qatar and Egypt.\n\nBoth Blinken and Sullivan will be trying to make progress towards a deal to end the 14-month war in Gaza and win the release of the remaining captives held there by Palestinian armed group Hamas.\n\nThe Biden administration hopes that the recent ceasefire agreement between Israel and Iran-backed Lebanese armed group Hezbollah, combined with the removal of Tehran ally al-Assad could help build momentum towards a Gaza deal after months of unsuccessful diplomacy.\n\nThe high-level tours could help shape Biden’s legacy in the Middle East in the last weeks of his term before former President Donald Trump returns to the White House on January 20.\n\nHowever, it is unclear whether Biden has enough leverage in the region to secure major deals before he leaves office.\n\nHamas wants an end to the war before the captives are released but Netanyahu has insisted that it reserves the right to carry out military operations. Israel also does not want Hamas to govern Gaza.\n\nTrump warned last week there would be “hell to pay” in the Middle East if captives held in Gaza were not released before his January inauguration.\n\nOn Tuesday, White House national security spokesperson John Kirby applied pressure for a deal, saying Hamas was “increasingly isolated” and should realise the “cavalry is not coming to rescue them”.","url":"https://haitigazette.com/biden-aides-in-middle-east-in-diplomatic-push-for-syria-gaza/","image":"https://haitigazette.com/app/uploads/2024/11/2024-10-07T092442Z_177567009_RC2LFAAJU2T3_RTRMADP_3_ISRAEL-PALESTINIANS-1728413294-wbAelr.jpeg","video":null,"publish_date":"2024-12-13 00:46:03","author":"Hayat Tahrir","authors":["Hayat Tahrir"],"language":"en","category":"politics","source_country":"ht","sentiment":0.039},{"id":272746632,"title":"Kyiv ups call for air defences as Trump warns aid to Ukraine could be cut","text":"Ukraine’s president has sharply raised his demand for air defence systems, highlighting how much Russia has intensified the air war in recent months.\n\nVolodymyr Zelenskyy on Tuesday said Ukraine needed a dozen additional Patriot systems to insulate its economy from the war.\n\n“Ten or twelve additional Patriot systems for Ukraine will ensure [that]… no [glide bombs], no missiles, any ballistic missile etc. will be able to hit the civilian infrastructure of Ukraine, the energy sector, our hospitals, schools, universities,” Zelenskyy posted on the Telegram messaging app.\n\n“People will return to normal life, and from abroad too. Children will go to schools, universities. The economy will work.”\n\nIn April Zelenskyy had said Ukraine needed a minimum of seven Patriot systems to provide air cover, but Russia has since raised the number of missiles, drones and huge glide bombs launched against Ukraine.\n\nLast week, Zelenskyy said, Russia used almost 500 glide bombs, whose warhead ranges from 250kg (550lbs) to three tonnes, more than 400 strike drones, and almost 20 missiles of various types against Ukraine’s front lines and civilian infrastructure.\n\n“This daily terror and this war cannot remain the problem of one people,” he said.\n\nLast June, the United States prioritised delivery of newly built Patriot systems to Ukraine, putting its original customers on a delayed delivery timeline. During the NATO summit in July, partners agreed to provide Ukraine with five additional Patriot systems.\n\nZelenskyy has said much more military help is needed if Ukraine is to wrest back control of its skies and immunise its civilian population against Russia’s campaign.\n\nIn recent days, he said the first five operational Danish F-16s were already helping to shoot down incoming missiles, while a second batch of Danish F-16s arrived in Ukraine on Sunday. More are expected from Norway and the Netherlands in 2025, and Zelenskyy is in talks with French President Emmanuel Macron to speed up the delivery of Mirage jets early in the year.\n\nA second plank of Zelenskyy’s strategy in the air war has been counterattacking Russia using long-range unmanned aerial vehicles.\n\nOn Wednesday, Ukraine’s general staff said their drones had struck a Russian oil depot in Bryansk, which they described as “a loading point of the Druzhba oil pipeline, the main function of which is the reception, storage, distribution and shipment of diesel fuel to tanker trucks and rail transport. It is actively used to supply the Russian occupation army.”\n\nOn Friday, Ukrainian Defense Minister Rustem Umyerov said Ukraine would build more than 30,000 deep strike drones next year, calling them part of “a techno-army”.\n\nUkraine has already unveiled the Palyanytsia drone-missile, capable of travelling hundreds of kilometres. On Saturday Zelenskyy revealed that the Ukrainian-built, 700km-range (435-mile) Peklo drone-missile had entered mass production, and the first batch had been delivered to the armed forces.\n\nThese weapons are part of a domestic defence industry Ukraine has been building up for the past year. Ukraine’s Ministry of Defense said it had licensed 120 new weapons in November alone, 90 percent of them of Ukrainian design.\n\nThis industrial buildup, along with a ramping up of capacity in Europe’s munitions factories, may have made a difference on the front lines.\n\nDmitry Voloshyn, a spokesman for the Khortytsia group of forces in Donetsk, said Ukraine had reduced Russia’s artillery advantage from 1:5 at the beginning of the war to 1:3.\n\nNot everyone agrees.\n\n“I think 1:3 is the [artillery] ratio in some areas where Russians are not advancing, but in areas where the Russians have the firepower to support operations it’s 6:1,” Oleksandr Danylyuk, an associate fellow at the Royal United Services Institute, told Al Jazeera.\n\nBut where Ukraine cares to become as autonomous as possible is in long-range weapons, to avoid the usage restrictions that encumber Western missiles.\n\nEven though US President Joe Biden last month allowed the use of US ATACMS missiles up to 300km (185 miles) inside Russia, their availability is an issue. The United Kingdom and France have bolstered stocks somewhat with their 200km-range (125-mile) Storm Shadow, but Germany has refused to provide any of its 600 Taurus missiles which have a 500km range (310 miles) – a policy with which the opposition Christian Democratic Union (CDU) disagrees.\n\n“By imposing such range restrictions, we are effectively compelling you to fight with one hand tied behind your back,” CDU leader Friedrich Merz said during a visit to Kyiv on Monday.\n\nOn Saturday, Macron set up a trilateral meeting in Paris with Zelenskyy and US President-elect Donald Trump, who pushed Zelenskyy towards declaring a ceasefire but offered no security guarantees.\n\nThe next day, Trump told NBC in an interview that he was open to reducing military aid to Ukraine and pulling the US out of NATO.\n\n“Possibly,” he said, when asked if Kyiv should prepare for less aid from the US.\n\nTrump has previously pledged to end the Ukraine war quickly, but unlike US President Biden has not upheld Ukraine’s territorial integrity as a priority. It was Zelenskyy’s first meeting with Trump since the November 5 election. The pair did not make a joint statement.\n\nOn Monday, however, Zelenskyy said he would “soon” organise a meeting of what he considered an essential core of European countries as a coordination group for aid to Ukraine.\n\n“Our approach to this group includes, at a minimum, Germany, France, the United Kingdom, Italy, and Poland. We also hope Denmark and other partners will join,” Zelenskyy said.\n\nThe absence of any reference to the US, whose incoming head of state he had just met, was pointed.\n\nAgainst the threat of a decline in the US military presence in Europe, Ukraine’s foreign intelligence service reported there were talks among EU members to set up a 500bn-euro ($525bn) defence fund to finance Ukrainian defence and European military expansion for a decade. The European Commission floated the idea of a 100bn-euro ($105bn) defence bond early this year to no effect.\n\nUkraine’s diplomatic overtures for weaponry took place against a slow Russian advance on the ground in Ukraine’s east during the past week, and a Russian humiliation in Syria.\n\nRussia made marginal gains south and east of Pokrovsk, a town it has been trying to capture since the summer. On Tuesday its troops advanced inside Kurakhove and seized the settlement’s grain elevator. Both towns are in the eastern region of Donetsk, and Russia has devoted enormous manpower to capturing them.\n\nOn the day of Russia’s advance inside Kurakhove, for example, Ukraine’s general staff reported 208 combat clashes across the front, 98 of them towards Pokrovsk and Kurakhove.\n\nThis ratio of attacks has reflected Russian priorities for weeks.\n\nKonstantyn Mashovets, a Ukrainian war analyst, said Russia had devoted at least half the personnel of its central and eastern military districts to seizing the villages of Pokrovsk and Kurakhove, as well as two villages on the Donetsk-Zaporizhia border, Velika Novosilka and Vremivka.\n\nVoloshyn, the spokesman for the Khortytsia group of forces defending the area, said Russia had assigned 70,000 soldiers to Pokrovsk and 35,000-36,000 to Kurakhove.\n\nThese lines of attack were mutually reinforcing, with pressure on Velika Novosilka and Vremivka designed to cut off lines of supply to Pokrovsk and Kurakhove, said Bogdan Petrenko, a spokesman for the 48th separate artillery brigade fighting in Vremivka.\n\nThe manpower Russia was expending on these four villages was reflected in heightened Russian losses.\n\nThere were about 3,000 Russian dead and wounded – almost a brigade’s worth – over two weeks in Pokrovsk alone, reported Serhiy Tsekhotsky, an officer of the 59th separate mechanized brigade fighting for the town.\n\nOleksandr Pavlyuk, commander of ground forces, estimated Russian casualties for the previous week across the front at 11,240 – a daily average of more than 1,600, tolls Al Jazeera was unable to independently verify.\n\nDespite its enormous efforts in Ukraine, Russia’s standing on the world stage diminished last week, as it was forced to evacuate bases in Syria that had been used to prop up the government of Bashar al-Assad.\n\nThe opposition Hayat Tahrir al-Sham (HTS) group took control of Aleppo on November 30 after a short fight, despite Russian air attacks against rebel command posts and troop concentrations.\n\nBy December 4, HTS had consolidated its control over the city sufficiently to begin marching on Hama, which fell the following day, followed by Homs on December 7. Damascus toppled on Sunday, December 8.\n\nAs opposition forces closed in, Russia withdrew.\n\nSatellite images taken on December 9 showed that all Russian ships and submarines had left the port of Tartous.\n\n“The Russians are also transferring the remnants of their weapons and military equipment from Syria by military aircraft from the Hmeimim airbase,” Ukraine’s military intelligence GUR said.\n\nThe leadership change in Syria has brought the end of Russia’s standing military presence in the Mediterranean for now.\n\nThe GUR said, “The likely loss of Russia’s military bases in Tartous and Hmeimim will finalise the Kremlin’s defeat in the Middle East.”","url":"https://haitigazette.com/kyiv-ups-call-for-air-defences-as-trump-warns-aid-to-ukraine-could-be-cut/","image":"https://haitigazette.com/app/uploads/2024/11/2024-11-15T161446Z_1802421949_RC2BKS9YD1YR_RTRMADP_3_UKRAINE-CRISIS-GERMANY-RUSSIA-1731688068-LUcaC6.jpeg","video":null,"publish_date":"2024-12-13 00:46:03","author":null,"language":"en","category":"politics","source_country":"ht","sentiment":-0.029},{"id":272746630,"title":"Why are mysterious drones flying over New Jersey?","text":"The night skies over New Jersey have come alight as dozens of mystery drones have been spotted flying over the state, including near United States President-elect Donald Trump’s golf course in the town of Bedminster.\n\nThe drones, which some residents say appear larger than hobbyist drones – those used for recreational purposes – have been spotted almost every night flying over the northeastern US state since November 18 and were initially sighted near the Picatinny Arsenal, a US military research and manufacturing facility.\n\nSo, who is flying these drones and what are they doing above New Jersey?\n\nWhen and where have the drones been spotted?\n\nIn a post on Facebook on December 4, cautioning residents of Florham Park, a borough in New Jersey, about the drones, chief of police Joseph Orlando wrote: “Over the past two weeks, the (drone) sightings have been occurring nightly…beginning just after sunset and lasting well into the early morning hours.” He described the appearance of the drones as “nefarious in nature”.\n\nHe also noted that the drones are flying above critical infrastructure such as water reservoirs, electric transmission lines, train stations, police departments and military installations.\n\nOn December 5, New Jersey governor Phil Murphy wrote on social media platform X, that “there is no known threat to the public at this time.”\n\nThen, on Monday, Murphy told local media that the number of sightings had increased in December. He said there were 49 sightings of drones over the state on Sunday, December 8, alone. But he added that some sightings might have been duplicates.\n\nBut some residents including New Jersey Assemblywoman Dawn Fantasia, continue to be on edge.\n\n“We know nothing. PERIOD. To state that there is no known or credible threat is incredibly misleading, and I informed all officials of that sentiment,” she wrote on X.\n\nWho is operating the drones?\n\nAt the moment, no one in the US, including the Pentagon and the Federal Bureau of Investigation (FBI), has been able to answer this question.\n\nIn an interview with Fox News on Wednesday, US congressman Jeff Van Drew said “high-ranking sources” had informed him that “Iran was behind the drones.\n\n“That mothership… is off the East Coast of the United States of America. They’ve launched drones into everything that we can see or hear,” he said.\n\nHowever, deputy Pentagon Press Secretary Sabrina Singh told reporters at a news briefing in Washington, DC, on Wednesday this week: “There is absolutely no truth to that.\n\n“There is no Iranian ship off the coast of the United States, and there’s no so-called mothership launching drones towards the United States,” she said. She added that, according to the Pentagon’s initial assessment, the drones have not been launched by any “foreign entity”.\n\nRepublican Tony Gonzales called the situation “madness” at a Congress hearing on Tuesday in Washington, DC after Robert Wheeler, the FBI assistant director, told Congress at a hearing focusing on the drone case, that the agency did not have any answers on who is behind the flights.\n\n“The bureau is actively investigating the situation….we do not attribute that [the drones] to an individual or a group yet. But I don’t have an answer of who’s responsible…,” Wheeler said.\n\nWhat do the drones appear to be doing?\n\nIt is perfectly legal to fly drones in New Jersey, but there are conditions.\n\nAccording to local government rules, “drones are permitted in New Jersey for recreational and commercial use but are subject to FAA (Federal Aviation Administration) regulations.” Drones must weigh less than 55 pounds at the time they take off.\n\nThere has been no confirmation of whether these drones are larger than this, but Al Jazeera’s Kristen Saloomey, reporting from New York, told viewers: “Mysterious drones as large as a car, which first seemed as a local anamoly, are now capturing the attention of officials.”\n\nIt remains unclear what the purpose of these dozens of large drones flying over the state is.\n\nFollowing a meeting with state police and Homeland Security officials on Wednesday, Assemblywoman Fantasia wrote on X that the drones appeared large (up to 1.8 metres – 6ft – in diameter) and were operating in an “uncoordinated manner”. She added that they sometimes travel with their lights turned off, making them difficult to detect and are flying in an unrestricted airspace.\n\n“(They) appear to avoid detection by traditional methods (e.g., helicopters, radio frequencies),” she wrote on X.\n\nThe FAA states that all drones flown at night should be equipped with “anti-collision lights visible from at least three statute miles”.\n\nFantasia added that at the meeting, authorities noted that the drones fly for “extended periods (6-7 hours) and over a distance of 15 miles (24km)”, prompting further questions about the drones’ technology and intent.\n\nWhile US Federal authorities scramble for answers about where the drones have been launched from and what their purpose is, residents in New Jersey have been posting videos of the drone sightings on social media.\n\nSome locals are referring to them as “UFOs” (unidentified flying objects) from space, while others questioned if they were jets leaving streams in the sky and pursuing something. Some also told local media channels that they’re “probably being launched from China”.\n\nWhat will happen now?\n\nAmid the various conspiracy theories, Congressman Van Drew told Fox News on December 10 that “gaps in our (US) airspace are being exploited, and because of it, the safety of Americans is at risk.”\n\nUS Senator Cory Booker, who represents New Jersey, wrote on X that he had sent a letter to the FBI and the Departments of Transportation and Homeland Security, demanding “continued transparency and vigilance” while investigations take place.\n\nAl Jazeera’s Saloomey reported that local police in New Jersey have launched their own drones in a bid to obtain more information about the mysterious drones. But she added that, right now, “there are more questions than answers.”\n\nWith frustration over the unanswered questions about the drones mounting, some residents and officials have also called on the US military to get involved and shoot down the drones.\n\nHowever, US laws do not permit this unless authorities identify a specific threat to the public from the drones, which is not the case as yet.\n\nThe FBI has asked all residents to report drone sightings directly to the agency and also to send it photographs or videos by email, which the agency says will help their investigation. The US coastguard is also assisting the agency in its investigation.\n\nMeanwhile, the White House has said it is closely monitoring the situation and assured residents that they are not in danger.\n\nNo, it is not the first time mysterious flying objects have appeared in the air.\n\nIn February, residents in Montana, a landlocked Western US State, spotted a huge balloon in the sky. It proceeded to traverse across the US, including over some sensitive military sites. After investigations, Pentagon officials revealed it was a Chinese surveillance balloon which was shot down by a US fighter jet.\n\nThe Pentagon added that the balloon did not collect any sensitive information, but Beijing expressed regret over Washington’s response and claimed the balloon was a “civilian airship” which was conducting meteorological research.","url":"https://haitigazette.com/why-are-mysterious-drones-flying-over-new-jersey/","image":"https://haitigazette.com/app/uploads/2024/12/2024-12-07T185934Z_2055350840_RC2HKBA6GEJ1_RTRMADP_3_USA-TRUMP-FRANCE-1733647583-lQAOzx.jpeg","video":null,"publish_date":"2024-12-13 00:46:03","author":null,"language":"en","source_country":"ht","sentiment":-0.254},{"id":272746622,"title":"Donald Trump nommé « Personnalité de l’année 2024 » par le magazine Time","text":"Le magazine Time a désigné Donald Trump « Personnalité de l’année 2024 », saluant son influence déterminante sur la politique américaine et le rôle mondial des États-Unis.\n\nLe magazine Time a désigné jeudi le président élu des États-Unis, Donald Trump, « Personnalité de l’année », soulignant son impact profond sur la politique américaine ainsi que le rôle des États-Unis dans le monde.\n\n« Pour avoir orchestré un retour historique, mené un réalignement politique unique en son genre, remodelé la présidence américaine et modifié la place de l’Amérique sur la scène mondiale, Donald Trump est la Personnalité de l’année 2024 », a écrit Sam Jacobs, rédacteur en chef de Time, dans une lettre adressée aux lecteurs.\n\nLe magazine avait déjà attribué ce titre à Trump en 2016, après sa première victoire à l’élection présidentielle. En 2020, il avait désigné le président démocrate Joe Biden et la vice-présidente Kamala Harris « Personnalités de l’année », après leur victoire contre Trump. L’année dernière, la pop star Taylor Swift avait été couronnée.\n\nLe dernier numéro de Time consacré à la « Personnalité de l’année » propose une interview approfondie de Trump, réalisée le 25 novembre dans sa station balnéaire de Mar-a-Lago, en Floride.\n\nÀ lire aussi","url":"https://haitigazette.com/donald-trump-nomme-personnalite-de-lannee-2024-par-le-magazine-time/","image":"https://haitigazette.com/app/uploads/2024/12/3b60082b-399c-4328-b7d3-abc562ed3356-e1734040049981-NFdLoL.jpeg","video":null,"publish_date":"2024-12-13 00:46:03","author":null,"language":"en","category":"politics","source_country":"ht","sentiment":0.803},{"id":272751930,"title":"Time Magazine names Donald Trump person of the year for second time","text":"New York - Time Magazine on Thursday named U.S. President-elect Donald Trump its 'person of the year,' marking the second time he has won the accolade, in acknowledgement of the mogul's stunning political comeback.Trump, who defeated Vice President Kamala Harris in the Nov. 5 election, adorns the magazine's title cover sporting his distinctive red tie and striking a commanding pose.'For marshaling a comeback of historic proportions, for driving a once-in-a-generation political realignment, for reshaping the American presidency and altering America's role in the world, Donald Trump is Time's 2024 — Person of the Year,' the magazine said.","summary":"This year saw Donald Trump convicted on charges of business fraud and nearly assassinated twice — and will end with him preparing to return to the White House.","url":"https://www.japantimes.co.jp/news/2024/12/13/world/trump-person-of-year-again/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2024/12/13/439890.JPG?v=3.1","video":null,"publish_date":"2024-12-13 00:45:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":0.372},{"id":272748458,"title":"More Dem leaders get behind Trump’s deportation plans","text":"to top close Video This video is playing in picture-in-picture.\n\nThe Evening Edit December 12, 2024 02:16 \n\n More Dem leaders get behind Trump’s deportation plans \n Rep. Debbie Lesko, R-Ariz., discusses President-elect Donald Trump’s immigration agenda on ‘The Evening Edit.’\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags WHAT TO WATCHSHOWSTHE EVENING EDIT | LATEST EPISODESTHE EVENING EDITPOLITICS","summary":"Rep. Debbie Lesko, R-Ariz., discusses President-elect Donald Trump’s immigration agenda on ‘The Evening Edit.’","url":"https://www.foxbusiness.com/video/6365924306112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/ad1dce16-98d9-4e3a-a140-f0d96b6f05ce/73cf627b-ab2b-484f-8c72-ba7f7380f009/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2024-12-13 00:39:25","author":null,"language":"en","category":"politics","source_country":"us","sentiment":-0.374},{"id":272750902,"title":"Why Christopher Wray’s Resignation May Signal a Shift in FBI Tradition","text":"Christopher A. Wray had considered resigning as F.B.I. director before. More than once, confronted with angry demands from President Donald J. Trump and his allies, he contemplated calling it quits.\n\nWhen Mr. Wray on Wednesday announced his intent to do so, it was because he believed staying on the job into a second Trump term risked significant disruptions to the work force and its mission.\n\nMr. Trump had already declared his plan to replace him with Kash Patel, a tough-talking loyalist who has vowed to force out bureau leaders and empty its Washington headquarters.\n\nIn conceding to the reality of raw power, Mr. Wray’s voluntary departure could usher in a new era at the nation’s premier law enforcement agency, one in which the job of director is more of a political post that changes with the administration. For decades, F.B.I. directors have been appointed to 10-year terms to insulate them from the shifting winds of politics. Few F.B.I. directors stay a full decade, and the circumstances of Mr. Wray’s departure after seven years suggest that insulation has worn thin.","summary":"Mr. Wray’s voluntary departure could usher in a new era at the nation’s premier law enforcement agency, one in which the job of director changes with the administration.","url":"https://www.nytimes.com/2024/12/12/us/politics/christopher-wray-fbi.html","image":"https://static01.nyt.com/images/2024/12/12/multimedia/12DC-WRAY-ghwc/12DC-WRAY-ghwc-facebookJumbo.jpg","video":null,"publish_date":"2024-12-13 00:39:02","author":"Devlin Barrett","authors":["Devlin Barrett"],"language":"en","source_country":"us","sentiment":-0.082},{"id":272744762,"title":"Ontario Premier Doug Ford threatens to cut off fuel to the United States if Trump tariffs Canada.","text":"We will go to the extent of cutting off their energy, going down to Michigan, going down to New York State and over to Wisconsin\n\nOntario Premier Doug Ford threatens to cut off fuel to the United States if Trump tariffs Canada.\n\n News on the Net Eric Daugherty @EricLDaugh——Bio and Archives--December 12, 2024\nNews in Brief | CFP Comments | Reader Friendly | Subscribe | Email Us\n\nOntario Premier Doug Ford threatens to cut off fuel to the United States if Trump tariffs Canada.\n\n\"We need to be ready to fight [on] January the 20th.\"\n\n\"We will go to the extent of cutting off their energy, going down to Michigan, going down to New York State and over to Wisconsin.\"\n\n\"I don't want this to happen, but my number one job is to protect Ontario, Ontarians and Canadians as a whole since we're the largest province.\"\n\n\"Let's see what happens as we move forward. But we'll use every tool in our toolbox, including cutting them off energy that we're sending down there.\"\n\nNews on the Net——Bio and Archives\nNews from around the world\n\nSupport Canada Free Press\n\nundefinedBIack Fragility Goes Off the Rails As DEI is Coming To An End...Harry Sisson is learning the hard way 😂 Liberal Hivemind...One more lit fuse they’re handing Donald Trump. Inflation jumps to 3.8% annualized on the CPI....We Lie To You News: He's Dead Now, Who Benefits? News Update...Jordan Peterson with RFK Jr on being inside Trump's inner circle...The Pete Hegseth situation just took an interesting turn- Liberal Hivemind...","url":"https://www.canadafreepress.com/article/ontario-premier-doug-ford-threatens-to-cut-off-fuel-to-the-united-states-if-trump-tariffs-canada","image":"https://canadafreepress.com/images/uploads/videoford121224.jpg","video":null,"publish_date":"2024-12-13 00:35:03","author":"Bio And Archives","authors":["Bio And Archives"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.247},{"id":272744612,"title":"Biden pardons 39 people, commutes sentences of 1,500 others","text":"Moves come after Biden signed unconditional pardon for his son.President says he will take more steps in the weeks ahead.List primarily includes Americans placed under home confinement.\n\nOutgoing US President Joe Biden said on Thursday that he was pardoning 39 people convicted of non-violent crimes and commuting the sentences of nearly 1,500 others who were serving long prison terms.\n\nThe moves come over a week after the president signed an unconditional pardon for his son Hunter.\n\nOfficials said last week that the White House was listening to demands for Biden to extend the same grace to thousands of people wronged by the US judicial system.\n\nThe commutations on Thursday were announced for those who were placed on home confinement during the COVID-19 pandemic.\n\nBiden said these people would have received shorter sentences if charged under today's laws, policies and practices.\n\nSources had told Reuters last week that the pardons being discussed included those convicted of nonviolent drug offenses and people identified by civil rights groups as unjustly incarcerated.\n\n\"As president, I have the great privilege of extending mercy to people who have demonstrated remorse and rehabilitation, restoring opportunity for Americans to participate in daily life and contribute to their communities, and taking steps to remove sentencing disparities for non-violent offenders, especially those convicted of drug offenses,\" Biden said.\n\nThe president added that he will take more steps in the weeks ahead and that his administration will continue reviewing clemency petitions.\n\nUS Representative Ayanna Pressley of Massachusetts, one of the leading Democrats behind a letter to Biden last month urging him to issue clemency to Americans with nonviolent offenses, commended the president for taking \"meaningful and historic action.\"\n\nHer statement noted that he could take further steps to exercise his power during his remaining 39 days in office.\n\nThe White House said that the clemencies granted by Biden were the most ever in a single day.\n\nThe list primarily includes Americans placed under home confinement during the COVID-19 pandemic to mitigate the spread of the virus, experts say, rather than many individuals civil rights groups have been advocating for.\n\n\"We do think he can pardon more people — specifically people who are currently incarcerated and might have lower sentences if they were convicted today,\" said Tierra Bradford, senior program manager at The Leadership Conference on Civil and Human Rights.\n\nUS President-elect Donald Trump, who takes office on Jan 20, has said that he would act on his first day in office to pardon rioters involved in the January 6, 2021, Capitol attack, further building expectations for a broad granting of clemency.","url":"https://www.geo.tv/latest/579293-biden-pardons-39-people-commutes-sentences-of-1500-others","image":"https://www.geo.tv/assets/uploads/updates/2024-12-12/l_579293_113305_updates.jpg","video":null,"publish_date":"2024-12-13 00:35:03","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":-0.059},{"id":272744610,"title":"Time magazine names President-elect Trump 'Person of the Year'","text":"NEW YORK: Time magazine named US President-elect Donald Trump its \"Person of the Year\" on Thursday, citing his deep impact on American politics and the country's role in the world.\n\n\"For marshaling a comeback of historic proportions, for driving a once-in-a-generation political realignment, for reshaping the American presidency and altering America's role in the world, Donald Trump is Time's 2024 Person of the Year,\" Time Editor-in-Chief Sam Jacobs wrote in a letter to readers.\n\nThe news magazine had previously bestowed the \"Person of the Year\" title to Trump in 2016 after his first presidential election victory. It named Democratic President Joe Biden and Vice President Kamala Harris \"Person of the Year\" in 2020 after they defeated Trump. Pop star Taylor Swift received the title last year.\n\nThe latest \"Person of the Year\" issue features a wide-ranging interview with Trump conducted on November 25 at his Mar-a-Lago resort in Florida.\n\nIn it, Trump sharply criticised Ukraine's use of US-supplied missiles deep into Russian territory. He also said he will have a \"big discussion\" about ending childhood vaccination programs with Robert F Kennedy Jr, his nominee to run the Department of Health and Human Services, and that his new administration could scrap some vaccines.\n\nTo commemorate the Time selection, Trump rang the opening bell of the New York Stock Exchange, where he was cheered.\n\nHe was joined by Kennedy, wife Melania, daughters Ivanka and Tiffany, Vice President-elect JD Vance and Scott Bessent, Trump's pick for Treasury Secretary. Business leaders including Goldman Sachs Chief Executive David Solomon and Citigroup Chief Executive Jane Fraser were also present.\n\nIn remarks to CNBC at the NYSE, Trump repeated his plans to boost domestic oil drilling and to lower corporate taxes to 15% for US-made products.\n\nThe bell ringing signifies the start of the trading day at the world's largest stock exchange and is considered an honour. It has historically been reserved for company executives celebrating an initial public offering or other major corporate milestones, but celebrities and politicians like Ronald Reagan, Nelson Mandela and Arnold Schwarzenegger have also rung it.","url":"https://www.geo.tv/latest/579281-time-magazine-names-president-elect-trump-person-of-the-year","image":"https://www.geo.tv/assets/uploads/updates/2024-12-12/l_579281_104217_updates.jpg","video":null,"publish_date":"2024-12-13 00:35:03","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"pk","sentiment":0.247},{"id":272745450,"title":"Tom Morello Issues Challenge to Donald Trump After Fake Springsteen Diss","text":"Tom Morello has issued a public challenge to Donald Trump after seeing a posting online disrespecting Bruce Springsteen, but it appears the President Elect’s posting was a fake.\n\nWhat Tom Morello Responded To\n\nEarlier this week, a social media post purported to be from Donald Trump’s Truth Social account began circulating. It stated, “Recently Melania took Baron, A GREAT GUITARIST, to see overrated, communist singer, Bruce Springstern. NOT IMPRESSED!!!”\n\nThe post was picked up by the X social media account @PopularLiberal, who noted, “Wow! Did the model conman dad really misspell his son’s name, or am I seeing things? How can you make that mistake That’s hilarious! Classic….”\n\nREAD MORE: Tom Morello Recalls the Day He Started Working on Rage Against the Machine’s First Riffs\n\nThe tweet has amassed over 430,000 views at press time, and apparently one of them was Morello who felt inclined to respond.\n\nMorello Issues a Public Challenge\n\nTom Morello has sat in with Bruce Springsteen’s E Street Band in the past and has a long-running friendship with the musician. Earlier this week, Morello told Loudwire Nights host Chuck Armstrong that he’s currently working on his first album. “It’ll incorporate everything from the big riffage of Rage and Audioslave and Prophets of Rage to the stuff on the Nightwatchman end of the spectrum and there’s some kind of Springsteen Darkness on the Edge of Town and there’s some Battle of Los Angeles on it,” he revealed. So it’s not too much of a surprise that the guitarist felt compelled to respond to the slight of Springsteen.\n\nIn a posting on the X social media platform, the Rage Against the Machine guitarist commented, “My 13 year old son Roman will step forward to defend @springsteen’s honor and destroy Barron in a guitar competition. Just name the time and place!!!”\n\nMorello’s challenge has amassed over 435,000 views after being issued this morning (Dec. 12).\n\nThe Problem With Trump’s Post\n\nWhile the supposed Trump social media post has made the rounds this week, AOL has debunked the post as a fraud, with no credible news reports that Trump had commented on his wife and son attending the concert and no such statement found on his Truth Social account.\n\nSo, even though there are Trump Guitars, we don’t really know if Trump thinks his son is a “GREAT GUITARIST” and without the boast or the diss being legit, there’s probably no need for the challenge.","summary":"Tom Morello has issued a public challenge to Donald Trump after seeing a posting online disrespecting Bruce Springsteen, but it appears the President Elect&#8217;s posting was a fake. What Tom Morello Responded To Earlier this week, a social media post purported to be from Donald Trump&#8217;s Truth Social account began circulating. It stated, &#8220;Recently Melania &#8230;\n\n\nThe post Tom Morello Issues Challenge to Donald Trump After Fake Springsteen Diss appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/entertainment/music-news/tom-morello-issues-challenge-to-donald-trump-after-fake-springsteen-diss/","image":"https://townsquare.media/site/366/files/2024/12/attachment-Tom-Morello-Donald-Trump-Bruce-Springsteen.jpg?w=1200&q=75&format=natural","video":null,"publish_date":"2024-12-13 00:34:07","author":"Ashleigh Durden","authors":["Ashleigh Durden"],"language":"en","category":"politics","source_country":"us","sentiment":0.195},{"id":272744524,"title":"Trump claims Biden lost track of over 300,000 migrant children. Here’s a fact check.","text":"President-elect Donald Trump claimed in his Person of the Year interview with Time magazine this week that President Biden’s administration lost track of more than 300,000 migrant children who crossed the border unaccompanied, saying many of them are in danger or dead. But experts say he’s distorting the facts.\n\n“We have 325,000 children here during Democrats — and this was done by Democrats — who are right now slaves, sex slaves or dead,” Trump said. “And what I will be doing will be trying to find where they are and get them back to their parents.”\n\nTrump repeated similar claims on the campaign trail, and Republicans, including Trump’s appointed “border czar” Tom Homan, have echoed similar figures as they call for increased border security. \n\nBut immigration experts tell CBS News these claims are misleading and misrepresent government data. Additionally, they say while some unaccompanied minors have become victims of trafficking or other crimes, the government safely releases most of these children to vetted sponsors — often a family member — while their immigration cases play out. \n\nPossible origins of the number\n\nRepublicans began making claims that more than 300,000 unaccompanied children had been “lost” after the Department of Homeland Security released a report in August which showed that Immigration and Customs Enforcement, or ICE, did not serve notices to appear in court to 291,000 children between fiscal year 2019 and May 2024.\n\nAdditionally, 32,000 unaccompanied children failed to show up for immigration court dates from fiscal year 2019 to 2023. \n\nNotably, around half of this period occurred when Trump was president. The report did not specify the number of children who missed court appearances under each administration.\n\nWhile the DHS report stated that children who do not attend their court hearings can be at a higher risk of being trafficked or exploited, it did not say that the total 323,000 children referenced are unaccounted for or missing. \n\nThe Trump transition team did not respond to a request for clarification on Trump’s claims.\n\nExperts point to ICE’s “missing paperwork problem” \n\nIn response to the DHS report, ICE said delays in issuing court notices to some of 291,000 unaccompanied children may stem from some being eligible to apply for asylum or legal status. In some cases, that process might be allowed to play out before ICE sends them a court date to begin removal proceedings.\n\n“This is not a ‘missing kids’ problem; it’s a ‘missing paperwork’ problem,” said Jonathan Beier, an associate director of research at the Acacia Center for Justice’s Unaccompanied Children Program, which helps represent migrant children.\n\nIn the cases of the 32,000 minors who missed immigration court dates, experts on immigration law explained that these minors could miss court for numerous reasons, including that they did not receive their notice to appear because ICE did not have their correct address on file.\n\nSometimes there are communication failures between ICE and other government agencies — including the Department of Health and Human Services, which is entrusted with finding children living arrangements with a shelter or sponsor while they await legal proceedings. \n\n“I think for the most part, many of these children have been placed with loving family members,” said Raul Pinto, deputy legal director for transparency at the American Immigration Council.\n\nWhat we know about claims that unaccompanied children face dangers\n\nTrump also claimed in the interview that hundreds of thousands of children who crossed the border unaccompanied are “now slaves, sex slaves or dead.” There is no evidence of anything like this scale of abuse.\n\nBy law, after unaccompanied minors from foreign countries are detained at the border, they’re quickly turned over to the care Department of Health and Human Services’ Office of Refugee Resettlement, which aims to place children in “the least restrictive setting that is in the best interests of the child.” \n\nThe office attempts to release children to sponsors, which can include parents, relatives and guardians, and federal policy dictates that the government vet these sponsors via interviews or background checks. \n\nDespite these safeguards, some migrant children have ended up in unsafe situations, though the exact number is not known. \n\nIt’s also protocol for the refugee resettlement office to follow up with sponsors around 30 days after the child’s release, but a percentage of these phone calls have gone unanswered during the Biden and Trump administrations. \n\nBoth Republicans and Democrats have previously cited these missed calls to make claims that unaccompanied children were lost by those administrations. However, unanswered calls do not necessarily equate to these children being missing or in danger, experts say.\n\n“It does not mean that the child’s in an unsafe place. It means someone didn’t answer the phone,” said Jennifer Podkul, chief of global policy and advocacy for Kids in Need of Defense, an organization providing legal representation for unaccompanied children.","summary":"President-elect Donald Trump claimed in his Person of the Year interview with Time magazine this week that President Biden&#8217;s administration lost track of more than 300,000 migrant children who crossed the border unaccompanied, saying many of them are in danger or dead. But experts say he&#8217;s distorting the facts. &#8220;We have 325,000 children here during &#8230;\n\n\nThe post Trump claims Biden lost track of over 300,000 migrant children. Here&#8217;s a fact check. appeared first on WorldNewsEra.","url":"https://worldnewsera.com/news/politics/trump-claims-biden-lost-track-of-over-300000-migrant-children-heres-a-fact-check/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/13/92a94a39-d354-498e-aa48-46f0f19110c1/thumbnail/1200x630g2/7633e1439a85653efe8e7fc62c004e61/gettyimages-2189597754.jpg?v=564e83c5974b3893ba1bcac5fe5947af","video":null,"publish_date":"2024-12-13 00:32:26","author":"Cathy Biank","authors":["Cathy Biank"],"language":"en","category":"politics","source_country":"us","sentiment":-0.308},{"id":272744294,"title":"B.C. Premier Eby does not rule out cutting power to U.S.","text":"B.C. Premier David Eby did not rule out pulling the plug on energy exports south of the border as part of retaliatory tariffs if they can't be avoided. \n\n\"I'm not sure what the disconnect is when I say that nothing is off the table,\" Eby said during an unrelated announcement in Langley Thursday (Dec. 12). \"We are prepared to support retaliatory tariffs and response to the United States that gets their attention to help them understand what the consequences would be for British Columbians and what the consequence would be for Americans.\"\n\nEby's comments come following Wednesday's meeting of the provincial premiers and territorial leaders with Prime Minister Justin Trudeau. Canada's First Ministers met for the second time to discuss the country's response to threats from president-elect Donald Trump to impose tariffs of 25 per cent on all Canadian goods.\n\nOntario Premier Doug Ford has said that that province would withhold energy exports to neighbouring American states. Eby sent comparable signals. \n\nEby said B.C. sells power to Washington State, Oregon and California during peak demand times.\n\n\"We sold a billion dollars worth of electricity to those states last year,\" he said. \"In other words, people (and companies) in those western states will be 25 per cent more on top of the existing cost of electricity, so it is not an insignificant amount of electricity.\" \n\nEby acknowledged that B.C. is a net importer of energy, but B.C. imports that power at a \"much lower cost\" when western states have excess power. \n\nEby added that B.C. is also a major supplier of critical minerals as well manufactured parts. \n\n\"When I say nothing is off the table, nothing is off the table – I mean it,\" Eby said.\n\n\"We will not stop until we are assured that the Americans fully understand how inter-tied we are and the consequences visited on British Columbians will not just be felt by British Columbians. They will also be felt by Americans. But we are going to do it as part of an integrated effort because it's going to hurt British Columbians, it's going to hurt Americans.\"","url":"https://www.vicnews.com/news/bc-premier-eby-does-not-rule-out-cutting-power-to-us-7705629","image":"https://www.bpmcdn.com/f/files/todayinbc/2024-december/eby_power.jpg","video":null,"publish_date":"2024-12-13 00:32:03","author":"Wolf Depner","authors":["Wolf Depner"],"language":"en","source_country":"ca","sentiment":-0.14},{"id":272744274,"title":"Trump brushes off Ontario threat to pull U.S. energy plug as booze ban pondered","text":"Incoming U.S. president Donald Trump is brushing off Ontario’s threat to restrict electricity exports in retaliation for sweeping tariffs on Canadian goods, as the province floats the idea of effectively barring sales of American alcohol. \n\nOn Wednesday, Premier Doug Ford said Ontario is contemplating restricting electricity exports to Michigan, New York state and Minnesota if Trump follows through on a threat to impose a 25 per cent tariff on imports from Canada.\n\n“That’s OK if he that does that. That’s fine,” Trump told American network CNBC when asked Thursday about Ford’s remarks on the floor of the New York Stock Exchange.\n\n“The United States is subsidizing Canada and we shouldn’t have to do that,” Trump added.\n\n“And we have a great relationship. I have so many friends in Canada, but we shouldn’t have to subsidize a country,” he said, claiming this amounts to more than US$100 billion annually in unspecified subsidies.\n\nMeanwhile, an official in the Ford government says it’s considering restricting the Liquor Control Board of Ontario from buying American-made alcohol. The province says the Crown agency is the largest purchaser of alcohol in the world.\n\nThe province also says it could restrict exports of Canadian critical minerals required for electric-vehicle batteries, and bar American companies from provincial procurement.\n\nFord doubled down Thursday on the idea of cutting off energy exports. The province says that in 2013, Ontario exported enough energy to power 1.5 million homes in those three states.\n\n“It’s a last resort,” Ford said. “We’re sending a message to the U.S. (that if) you come and attack Ontario, you attack livelihoods of people in Ontario and Canadians, we are going to use every tool in our tool box to defend Ontarians and Canadians. Let’s hope it never comes to that.”\n\nOntario Energy Minister Stephen Lecce said the province would rather have co-operation with the U.S., but has mechanisms to “end power sale into the U.S. market” the day Trump takes office on Jan. 20.\n\nAlberta Premier Danielle Smith ruled out following suit.\n\n“Under no circumstances will Alberta agree to cut off oil and gas exports,” she said. “Our approach is one of diplomacy, not threats.”\n\nMichael Sabia, president and CEO of Hydro-Québec, said “it’s not our current intention” to cut off Quebec’s exports to Massachusetts or New York state, but he conceded it might be possible.\n\n“Our intention is to respect those contracts, both because they’re legally binding, but also because it’s part of, in our view, a sound relationship with the United States,” he said. “It’s a questionable instrument to use in a trade conflict.”\n\nManitoba Premier Wab Kinew would not directly say whether Manitoba would threaten to withhold hydroelectric exports.\n\n“We are preparing our list and starting to think through what those options should look like,” he said. “I’m not going to make specific news today about items that we’re looking at.”\n\nKinew added that some premiers felt retaliatory measures wouldn’t work in a call Trudeau held Wednesday.\n\nNewfoundland and Labrador Premier Andrew Furey said “we have no interest in stopping” the export of energy to the U.S., adding that a trade war would hurt both countries.\n\n“We hope it is just bluster; we’re preparing as if it is not,” he said.\n\nCanada supplies more oil to the U.S. than any other country. About 60 per cent of U.S. crude oil imports are from Canada, and 85 per cent of U.S. electricity imports as well.\n\nCanada sold $170 billion worth of energy products last year to the U.S. It also has 34 critical minerals and metals the Pentagon is eager for.\n\nTrump has threatened to impose a 25 per cent tax on all products entering the United States from Canada and Mexico unless they stem the flow of migrants and drugs.\n\nCanadian officials have said it is unfair to lump Canada in with Mexico.\n\nU.S. customs agents seized 43 pounds of fentanyl at the Canadian border last fiscal year, compared with 21,100 pounds at the Mexican border.\n\nCanada since has promised more border security spending to address Trump’s border concerns. Ford said that will include more border and police officers, as well as drones and sniffer dogs.\n\nThis report by The Canadian Press was first published Dec. 12, 2024.\n\n— With files from The Associated Press, Liam Casey in Toronto, Lisa Johnson in Edmonton and Steve Lambert in Winnipeg.\n\nDylan Robertson, The Canadian Press","url":"https://www.vicnews.com/news/trump-brushes-off-ontario-threat-to-pull-us-energy-plug-as-booze-ban-pondered-7705367","image":"https://www.bpmcdn.com/f/files/shared/feeds/gps/2024/12/web1_20241212151212-20241212131228-9fb2278e4ac860937e07454d4efb3e94d05f2e5238cb2bc6a4848c98dab0c09e.jpg","video":null,"publish_date":"2024-12-13 00:32:03","author":"The Canadian Press","authors":["The Canadian Press"],"language":"en","source_country":"ca","sentiment":-0.201}]}