{"offset":0,"number":50,"available":11465,"news":[{"id":351715062,"title":"In Peace Letter To Putin, First Lady Melina Asks Him To 'Protect Children Around The Globe'","text":"Russian President Vladimir Putin met his US counterpart Donald Trump. Following the meeting, the US President described his talks with Russian President Vladimir Putin as “productive,” stating that “many points were agreed upon” and only “very few” remain unresolved — a remark that seemed to hint at progress toward a possible resolution of the Ukraine conflict.\nMeanwhile, as the Ukraine-Russia conflict continues, First Lady Melania Trump has written a “peace letter” to Putin, asking him “it is time” to protect children and future generations around the globe, according to Fox News.\nIn a heartfelt message addressed to the Russian president, the first lady opened with a universal reflection on childhood.\n“Dear President Putin,” the first lady’s letter begins. “Every child shares the same quiet dreams in their heart, whether born randomly into a nation’s rustic countryside or a magnificent city-center. They dream of love, possibility, and safety from danger.”\nShe stressed the shared duty of both parents and world leaders in protecting future generations.\n“As parents, it is our duty to nurture the next generation’s hope,” the letter continued. “As leaders, the responsibility to sustain our children extends beyond the comfort of a few.”\nThe message further urged for a collective pursuit of global dignity and peace.\n“Undeniably, we must strive to paint a dignity-filled world for all—so that every soul may wake to peace, and so that the future itself is perfectly guarded,” read the letter.\nIt concluded with a reminder of the shared innocence that transcends political and geographic boundaries.\n“A simple yet profound concept, Mr. Putin, as I am sure you agree, is that each generation’s descendants begin their lives with a purity—an innocence which stands above geography, government, and ideology.”\nThe letter was handed to Putin by President Trump himself before the Alaska Talks begin.","summary":"In a heartfelt message addressed to the Russian president, the first lady opened with a universal reflection on childhood.","url":"https://www.news18.com/world/in-peace-letter-to-putin-first-lady-melina-asks-him-to-protect-children-around-the-globe-9509798.html","image":"https://images.news18.com/ibnlive/uploads/2025/08/firstladymelina-2025-08-4d7d624da1c7e46c0a0b966f13d8b2dc.jpg","video":null,"publish_date":"2025-08-17 01:36:36","author":"Anushka Vats,News18","authors":["Anushka Vats","News18"],"language":"en","source_country":"in","sentiment":0.519},{"id":351715330,"title":"Trump's bombshell but subtle gesture to Putin that everyone missed... it could be his most ingenious move yet: MARK HALPERIN","text":"The Anchorage summit between Donald Trump and Vladimir Putin, which opened with so much expectation, pomp and ceremony, ended in uncertainty.\n\nWas their dialogue a failure that will bring the world more war? Or was it the first stone laid on a fragile path toward peace?\n\nAfter several hours of private conversation between the American president and the Russian leader, the answer remains opaque.\n\nNeither man, nor their top advisers, chose to disclose any substance of what was discussed in Alaska.\n\nThat silence has left a vacuum and, as vacuums in geopolitics tend to do, it filled instantly with speculation — much of it leaning toward fizzle.\n\nCommentators in Washington, Brussels, and Kyiv rushed to declare the summit inconclusive at best, dangerous at worst.\n\nAnd yet, something more subtle may have bubbled beneath the surface.\n\nTrump, in his post-meeting interview with Fox News host Sean Hannity, suggested that there had been forward motion - even if the road ahead remains clouded.\n\n'We didn't get there, but we have a very good chance of getting there,' Trump said before departing for DC. The president called the session 'extremely productive' and insisted that 'many points were agreed to.'\n\nWhat those points are remains a secret. But given Trump's nature - proud, combative, chatty, dynamic - one can interpret his words with optimism as well as agita.\n\nThe president did announce one tangible piece of news on social media early Saturday: Ukrainian president Volodymyr Zelensky will come to Washington for a Monday meeting with him.\n\nThat is a development worth watching.\n\nIf it leads to a triangular dialogue - Trump, Putin and Zelensky - it could begin to reshape the grim geometry of a war that has dragged on far too long.\n\nWhile Trump initially told Hannity that plans for a direct three-way negotiation were not raised in Alaska, he later suggested that the possibility was indeed on the table.\n\nPutin, meanwhile, floated the intriguing suggestion that the next round of discussions might take place in Moscow.\n\nTo be sure, the staging of the summit itself was significant.\n\nPutin arrived to the pageantry and signs of respect he relishes, all provided by his American counterpart: a rolled-out red carpet, a flyover, a shared motorcade ride in the presidential limo and warm words in front of global cameras.\n\nTrump even publicly referred to his Russian colleague as 'Vladimir' — a blink-and-you-miss-it gesture of comradery and esteem that did not go unnoticed.\n\nFurthermore, after the private meeting between the leaders, Putin broke the norms of the occasion by speaking first - and for more than twice as long as Trump (eight minutes to the American president's three.)\n\nTrump's brief remarks were restrained and subdued. No questions were taken and there was no background briefing for the White House press corps.\n\nSuch a symbolic elevation of Putin, along with Trump's uncharacteristic reticence and reference to Russia as the world's number two country, went down hard in parts of Europe and the U.S.\n\nFor those across the world who view Putin uncompromisingly as a murderous, marauding dictator, Trump's plaudits seemed almost a rehabilitation of the Russian strongman - an invite, at least for a day, back into the community of nations and polite company from which Putin was expelled after starting the war against his neighbor.\n\nThe Russian state media, naturally, lapped it all up.\n\nYet if superficial flattery of Putin is part of a potential peace package, an end to this brutal, miserable and poisonous conflict, is the cost as high as outraged pundits suggested Friday night?\n\nBecause, what has made the Alaskan summit particularly curious, is the now clear ambition to skip over talk of a ceasefire and go directly to a comprehensive settlement - another bit of news Trump shared in his Saturday morning Truth Social posting.\n\nCutting to the chase is certainly Trumpian in style - single-minded, impatient and unconventional.\n\nSome critics are interpreting the president's post as a hint that Trump is siding with, or caving to, Putin's desire to walk away with amplified territorial gains.\n\nOther observers are nursing hope that an accelerated timeline might bypass an unstable, temporary truce between Ukraine and Russia and increase the chance of a permanent peace.\n\nThere are reasons for skepticism and concern among those who worry the American president will sell out Ukraine.\n\nTrump offered no new sanctions, no public threats, no clear evidence of leverage.\n\nFor a president famous for belligerence, bluster, and oversharing, this restraint was striking.\n\nTrump's comments to Hannity were vague. When asked if Russia might gain more territory or Ukraine might receive stronger security guarantees, Trump said, 'Those are points that we negotiated, and those are points that we largely have agreed on.'\n\nBut what does 'largely agreed on' mean, when armies remain on the battlefield, drones hum in the air and civilians are dying every day?\n\nOne could dismiss it all as just another Trump show - long on theatrics and short on substance.\n\nBut there is another way to read the Anchorage encounter.\n\nWhatever else one thinks of Trump, he is the first leader to sit down with Putin and come away with even the possibility of a continuing dialogue about peace.\n\nZelensky's visit to the White House is not a formality; it is a hinge moment.\n\nTrump still has sanctions and, perhaps, British peacekeeping ground troops in his back pocket.\n\nDuring the summit, Trump's performance was striking, even incongruous.\n\nHe gave Putin respect but put an emphasis on efficacy. He cut short his own remarks, but signaled seriousness by placing Zelensky next on his agenda. He revealed almost nothing, but in his atypical discretion, hinted at a path forward.\n\nThere is no guarantee of success. Ending wars never comes easily, and in this case, the obstacles are immense.\n\nUkraine has lost thousands of lives and much of its territory; Russia has suffered sanctions, isolation, and massive reputational harm.\n\nNeither side is eager to concede. And yet, if Trump can move the discussion from entrenched stalemate to a search for comprehensive peace, he will have taken a step toward fulfilling his campaign promise to end this particular 'forever war.'\n\nTrump has put himself at the center of the Ukrainian-Russian dialogue.\n\nHe has made promises, put his ego on the line, risked his reputation. And Trump truly wants the killing to stop.\n\nAt the moment, the true impact of the Anchorage summit remains a mystery.\n\nBut in the realm of global politics, mystery, and prudence, can be more useful than audacious declarations.\n\nMysteries leave space for maneuver, for recalibration, for hope. Trump and Putin left Alaska without a deal, but perhaps with an outline of one.","summary":"The Anchorage summit between Donald Trump and Vladimir Putin, which opened with so much expectation, pomp and ceremony, ended in uncertainty.","url":"https://www.dailymail.co.uk/news/article-15006511/Trump-subtle-gesture-Putin-MARK-HALPERIN.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/01/101291303-0-image-m-15_1755392126257.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/16/2144776124397601344/1024x576_MP4_2144776124397601344.mp4","publish_date":"2025-08-17 01:20:35","author":"Editor,Mark Halperin","authors":["Editor","Mark Halperin"],"language":"en","category":"politics","source_country":"gb","sentiment":0.193},{"id":351713020,"title":"US halts visitor visas from Gaza used for medical trips","text":"The State Department's policy shift comes after far right activist Laura Loomer wrote a series of posts on X criticising the visa programme and urging the Trump administration to \"shut this abomination down.\"\n\nIn subsequent posts on X Saturday, Loomer took credit for the shift and thanked Secretary of State Marco Rubio for temporarily halting the visas.\n\nThe Palestinian Children's Relief Fund says it has evacuated 169 children from Gaza in 2024 as part of its treatment abroad programme, bringing them to the Middle East, Europe, South Africa, and the US for care.\n\nTwo and a half years into a war that followed Hamas' 7 October 2023 attack on Israel, Gaza has seen much of its medical infrastructure damaged and now faces dramatic food shortages.\n\nHumanitarian groups have alleged that an Israeli blockade beginning in March has prevented non-governmental organisations from delivering sufficient food into Gaza. The Israeli government says its rules on aid are intended to prevent the food from being taken by Hamas.\n\nUN-backed food security organisations, humanitarian groups, and journalists reporting within Gaza have warned of famine conditions in Gaza.\n\nIn late July, the BBC joined international news outlets Agence France-Presse, the Associated Press, and Reuters in issuing a public statement warning that journalists in Gaza faced starvation.\n\n\"For many months, these independent journalists have been the world's eyes and ears on the ground in Gaza. They are now facing the same dire circumstances as those they are covering,\" the outlets wrote.\n\nIn July, US President Donald Trump said there was \"real starvation\" in Gaza, but his administration has remained solidly behind Israeli Prime Minister Benjamin Netanyahu.","url":"https://www.bbc.com/news/articles/cwy1prn125do","image":"https://ichef.bbci.co.uk/news/1024/branded_news/06ba/live/dda25b30-7af0-11f0-83cc-c5da98c419b8.jpg","video":null,"publish_date":"2025-08-17 00:58:28","author":"Kayla Epstein","authors":["Kayla Epstein"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.381},{"id":351713076,"title":"‘Nuisance tariffs’: Chalmers’ shot at Trump","text":"Nuisance tariffs are import taxes that, while generating some government revenue, are considered inefficient and burdensome.\n\nThe Treasurer last year removed some 500 duties on a range of everyday items, including toothbrushes, women’s health products and fridges.\n\nIn a thinly veiled shot at Donald Trump, he said on Sunday “there are good reasons to swim against the tide a bit when it comes to tariffs”.\n\n“Some of these nuisance tariffs in our economy risk doing more harm than good, and tariffs are essentially a tax on the workers and families of the country that levies them,” Mr Chalmers told Sky News. \n\n“So we’ve made a heap of progress abolishing 500 nuisance tariffs, working closely with (Trade Minister) Don Farrell and other colleagues to do that.”\n\nHe went on to say the Albanese government was “very proud of that progress that we’ve been able to make unilaterally, because tariffs push up compliance costs on business”. \n\n“They risk pushing up prices for workers and families as well,” Mr Chalmers said.\n\n“If I can build consensus and momentum to go further on that, I would like to, but I’ll do that in a way that works closely with Don Farrell, conscious of the negotiations that he has under way.\n\n“But I think we’ve shown a willingness and enthusiasm to cut those nuisance tariffs.\n\n“I would like to go further, if I can. They do often do more harm than good, and so we approach the challenge in that light.”\n\nHis comments come as trade talks with the US drag on.\n\nWhile Australia managed to avoid an increase in US tariffs earlier this month, exports are still subject to blanket 10 per cent levies.\n\nSome sectors, such as steel and aluminium, have rates of up to 50 per cent.\n\nThe US President has also threatened to slap imposts of 250 per cent on foreign pharmaceuticals – a move that would hit Australian producers hard.\n\nThe Albanese government has repeatedly labelled tariffs “economic self-harm”.\n\nMr Chalmers did not specify which products he considered slumped with nuisance tariffs, but he did say “there’s hundreds”.\n\n“In those first 500 that we abolished, there were a lot of instances where it costs more actually to levy the tariff than to the benefit that we get from it,” he said. \n\n“So I’m not prepared to put a number on any additional steps that we might be prepared to take, but this has been a pretty constant interest of mine.”","summary":"Jim Chalmers has taken a thinly veiled shot at Donald Trump, flagging action on Australian tariffs.","url":"https://www.news.com.au/national/politics/jim-chalmers-flags-action-on-nuisance-tariffs-in-thinly-veiled-shot-at-trump/news-story/934199e7c5136bc586c72947edac2166?from=rss-basic","image":"https://content.api.news/v3/images/bin/7f23a9cbc413f4bf41702f5350b5b039","video":null,"publish_date":"2025-08-17 00:56:50","author":null,"language":"en","source_country":"au","sentiment":-0.192},{"id":351715264,"title":"States move to send hundreds of National Guard members to Washington (World)","text":"Three states moved to deploy hundreds of members of their National Guard to the nation’s capital as part of the Trump administration’s effort to overhaul policing in Washington through a federal crackdown on crime and homelessness.\n\nWest Virginia said it was deploying 300 to 400 Guard troops, while South Carolina pledged 200 and Ohio says it will send 150 in the coming days.\n\nThe moves announced Saturday came as protesters pushed back on federal law enforcement and National Guard troops fanning out in the heavily Democratic city following President Donald Trump's executive order federalizing local police forces and activating about 800 District of Columbia National Guard members.\n\nBy adding outside troops to join the existing Guard deployment and federal law enforcement officers, Trump is exercising even tighter control over the city. It’s a power play that the president has justified as an emergency response to crime and homelessness, even though city officials have noted that violent crime is lower than it was during Trump’s first term in office.\n\nSo far, National Guard members have played a limited role in law enforcement in D.C. and it’s unclear why additional troops are needed. They have been seen patrolling at landmarks like the National Mall and Union Station and assisting with crowd control.\n\nA protest against Trump’s intervention drew scores to Dupont Circle on Saturday before a march to the White House, about 1.5 miles away. Demonstrators assembled behind a banner that said, “No fascist takeover of D.C.,” and some in the crowd held signs saying, “No military occupation.”\n\nTrump was at his Virginia golf club after Friday’s summit with Russian President Vladimir Putin in Alaska.\n\nProtest pushes back on federal officers in Washington\n\nMorgan Taylor, one of the organizers who coordinated Saturday's protest, said they were hoping to spark enough backlash to Trump’s actions that the administration would be forced to pull back on its crime and immigration agenda.\n\n“It’s hot, but I’m glad to be here. It’s good to see all these people out here,” she said. “I can’t believe that this is happening in this country at this time.”\n\nFueling the protests were concerns about Trump overreach and that he had used crime as a pretext to impose his will on Washington.\n\nJohn Finnigan, 55, was taking a bike ride when he ran into the protest in downtown Washington. The real estate construction manager who has lived in the capital for 27 years said Trump's moves were “ridiculous” because crime is down.\n\n“Hopefully, some of the mayors and some of the residents will get out in front of it and try and make it harder for it to happen in other cities,” Finnigan said.\n\nJamie Dickstein, a 24-year-old teacher, said she was “very uncomfortable and worried” for the safety or her students given the “unmarked officers of all types” now roaming Washington and detaining people.\n\nDickstein said she turned out to the protest with friends and relatives to “prevent a continuous domino effect going forward with other cities.”\n\nNational Guard is coming to DC from West Virginia, South Carolina and Ohio\n\nGov. Patrick Morrisey, R-W.Va., announced Saturday that he was sending a contingent of 300 to 400 Guard troops to Washington, while South Carolina Gov. Henry McMaster authorized the deployment of 200 of his state's National Guardsmen and Ohio Gov Mike DeWine said his state would send 150 military police at the request of the U.S. Defense Department.\n\n“West Virginia is proud to stand with President Trump in his effort to restore pride and beauty to our nation’s capital,” Morrisey said.\n\nThe West Virginia activation suggests the administration sees the need for additional manpower after the president personally played down the need for Washington to hire more police officers.\n\nMaj. Gen. James Seward, West Virginia's adjutant general, said in a statement that members of the state's National Guard “stand ready to support our partners in the National Capital Region” and that the troops' “unique capabilities and preparedness make it an invaluable partner in this important undertaking.”\n\nFederal law enforcement in Washington draws mixed reactions\n\nFederal agents have appeared in some of the city’s most highly trafficked neighborhoods, garnering a mix of praise, pushback and alarm from local residents and leaders across the country.\n\nCity leaders, who are obliged to cooperate with Trump’s order under the federal laws that direct the district’s local governance, have sought to work with the administration, though they have bristled at the scope of the president’s takeover.\n\nOn Friday, the administration reversed course on an order that aimed to place the head of the Drug Enforcement Administration as an “emergency police commissioner” after the district’s top lawyer sued to contest.\n\nAfter a court hearing, Trump's attorney general, Pam Bondi, issued a memo that directed the Metropolitan Police Department to cooperate with federal immigration enforcement regardless of any city law.\n\nCity officials say they are evaluating how to best comply.\n\nIn his order Monday, Trump declared an emergency due to the “city government’s failure to maintain public order.” He said that impeded the “federal government’s ability to operate efficiently to address the nation’s broader interests without fear of our workers being subjected to rampant violence.”\n\nIn a letter to city residents, Mayor Muriel Bowser, a Democrat, wrote that “our limited self-government has never faced the type of test we are facing right now.”\n\nShe added that if Washington residents stick together, “we will show the entire nation what it looks like to fight for American democracy — even when we don’t have full access to it.”","summary":"Three states moved to deploy hundreds of members of their National Guard to the nation&rsquo;s capital as part of the Trump administration&rsquo;s effort to overhaul policing in Washington through a federal crackdown on crime and homelessness.\n\nWest Virginia said it was deploying 300 to 400 Guard ...","url":"https://www.castanet.net/news/World/567087/States-move-to-send-hundreds-of-National-Guard-members-to-Washington","image":"https://www.castanet.net/content/cp/2025/8/595ab95d484d84c312a2526af0ee001be4e1d7e9ad7ba20790746e33b93c3e1c.jpg","video":null,"publish_date":"2025-08-17 00:42:00","author":"Matt Brown And Mike Pesoli, The Associated Press - Aug 16, 2025 / 5:42 Pm | Story: 567087","authors":["Matt Brown And Mike Pesoli, The Associated Press - Aug 16, 2025 / 5:42 Pm | Story: 567087"],"language":"en","source_country":"ca","sentiment":-0.259},{"id":351713616,"title":"Ukrainian sniper reportedly breaks world record with 13,000-foot kill shot against Russian forces: report","text":"A Ukrainian sniper unit on Thursday reportedly broke the world record for the longest confirmed sniper kill, eliminating Russian troops from a distance of more than 13,000 feet (4,000 meters). The shot, fired by a Ukrainian-produced rifle and aided by artificial intelligence and drone guidance, left two Russian soldiers dead in the area of Pokrovsk, Ukraine, the Kyiv Post reported. \"The record-breaking shot was made on Aug. 14, 2025, using artificial intelligence under the guidance of [an unmanned aerial vehicle] complex with a 14.5 mm alligator rifle,\" said military journalist Yuri Butusov, according to the Kyiv Post. RUSSIA BOMBARDS UKRAINE HOURS BEFORE KEY MEETING ON TRUMP NATO WEAPONS DEAL The shooting took place amid increased Russian attacks in the area surrounding Pokrovsk, which was once a city with more than 60,000 residents, the Post reported. TOP UKRAINIAN SPY GUNNED DOWN IN KYIV AMBUSH ATTACK: REPORT The previous world record belonged to a 58-year-old Ukrainian sniper who eliminated a target from a distance of around 12,400 feet (3,800 meters), the outlet added. The record-breaking shot reportedly took place a day before President Donald Trump's closely-watched summit Friday with Russian President Vladimir Putin. FOUR KILLED IN RUSSIAN ATTACKS ON UKRAINE AS MOSCOW CONTINUES TO RETALIATE FOR KYIV'S DRONE STRIKE Putin, who spoke first in a joint press conference held by the two world leaders, described the talks as a \"constructive atmosphere of mutual respect.\" Ukrainian President Volodymyr Zelenskyy is scheduled to meet with Trump in Washington, D.C., Monday. CLICK HERE TO GET THE FOX NEWS APP Zelenskyy said in a post on X that he and Trump will \"discuss all of the details regarding ending the killing and the war.\"","summary":"A Ukrainian sniper unit reportedly broke a world record with a 13,000-foot kill shot of Russian troops using a Ukrainian-made rifle aided by artificial intelligence.","url":"https://www.foxnews.com/world/ukrainian-sniper-reportedly-breaks-world-record-13000-foot-kill-shot-against-russian-forces-report","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/front-line-town-pokrovsk-in-donetsk-oblast-2.jpg","video":"https://www.foxnews.com/video/6376996701112","publish_date":"2025-08-17 00:39:06","author":"Sophia Compton","authors":["Sophia Compton"],"language":"en","source_country":"US","sentiment":-0.167},{"id":351714148,"title":"What US First Lady Melania Trump wrote in her 'peace letter' to Putin","text":"ANIUS First Lady pens 'peace letter' to Putin, urges protection of children, future generations\n\nUS First Lady Melania Trump wrote a \"peace letter\" to Russian President Vladimir Putin, urging him that \"it is time\" to protect children and future generations around the world, Fox News reported on Saturday (local time). US President Donald Trump hand-delivered the letter to Putin before their summit in Alaska on Friday (local time), as reported by Fox News. Immediately after receiving it, Putin read the letter in front of the American and Russian delegations. \"Dear President Putin,\" the letter began. \"Every child shares the same quiet dreams in their heart, whether born randomly into a nation's rustic countryside or a magnificent city-center. They dream of love, possibility, and safety from danger.\"\"As parents, it is our duty to nurture the next generation's hope. As leaders, the responsibility to sustain our children extends beyond the comfort of a few,\" it read. The First Lady further wrote, \"Undeniably, we must strive to paint a dignity-filled world for all--so that every soul may wake to peace, and so that the future itself is perfectly guarded. A simple yet profound concept, Mr. Putin, as I am sure you agree, is that each generation's descendants begin their lives with a purity--an innocence which stands above geography, government, and ideology.\" Live EventsThe letter noted that \"in today's world, some children are forced to carry a quiet laughter, untouched by the darkness around them--a silent defiance against the forces that can potentially claim their future.\"\"Mr. Putin, you can singlehandedly restore their melodic laughter,\" she added. \"In protecting the innocence of these children, you will do more than serve Russia alone--you serve humanity itself,\" as reported by Fox News. \"Such a bold idea transcends all human division, and you, Mr. Putin, are fit to implement this vision with a stroke of the pen today. It is time,\" the letter concluded. (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onMelania TrumpVladimir Putinpeace letterchildren protectionUS First Lady\n\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onMelania TrumpVladimir Putinpeace letterchildren protectionUS First Lady(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"First Lady Melania Trump penned a \"peace letter\" to Russian President Vladimir Putin, urging him to prioritize the protection of children and future generations globally.","url":"https://economictimes.indiatimes.com/news/international/global-trends/what-us-first-lady-melania-trump-wrote-in-her-peace-letter-to-putin/articleshow/123340570.cms","image":"https://img.etimg.com/thumb/msid-123340599,width-1200,height-630,imgsize-11948,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-17 00:38:29","author":"Sectionswhat Us First Lady Melania Trump Wrote In Her 'peace Letter' To Putinanilast Updated: Aug 17","authors":["Sectionswhat Us First Lady Melania Trump Wrote In Her 'peace Letter' To Putinanilast Updated: Aug 17"],"language":"en","category":"politics","source_country":"in","sentiment":0.567},{"id":351715254,"title":"US suspends visas for Gazans after far-right influencer posts","text":"The state department halted all Gaza visitor visas, citing a review of recent medical-humanitarian permits issued. (US state department/Facebook pic)\nWASHINGTON: The US government said Saturday it is suspending visitor visas for Gazans after a far-right influencer with the ear of president Donald Trump complained that wounded Palestinians had been allowed to seek medical treatment in the US.\nThe announcement came one day after a series of furious social media posts by Laura Loomer, who is known for promoting racist conspiracy theories and claiming that the 9/11 terrorist attacks were an inside job.\n\"All visitor visas for individuals from Gaza are being stopped while we conduct a full and thorough review of the process and procedures used to issue a small number of temporary medical-humanitarian visas in recent days,\" the state department, which is led by Marco Rubio, wrote on X.\nIn a series of posts on X Friday, Loomer called on the state department to stop giving visas to Palestinians from Gaza who she said were \"pro-HAMAS... affiliated with the Muslim Brotherhood and funded by Qatar,\" without providing evidence.\nLoomer's target was the US-based charity HEAL Palestine, which said last week it had helped 11 critically wounded Gazan children – as well as their caregivers and siblings – arrive safely in the US for medical treatment.\nIt was \"the largest single medical evacuation of injured children from Gaza to the US\", the charity said on its website.\n'Dangerous and inhumane' \n\"Truly unacceptable,\" Loomer wrote in another X post. \"Someone needs to be fired at @StateDept when @marcorubio figures out who approved the visas.\"\n\"Qatar transported these GAZANS into the US via @qatarairways,\" she said. Qatar is \"literally flooding our country with jihadis\", she added.\nLoomer said she had spoken to the staff of Republican Tom Cotton, who chairs the Senate intelligence committee, adding that they were \"also looking into how these GAZANS got visas to come into the US.\"\nRepublican congressman Randy Fine explicitly commended Loomer after the visa change was announced, in a sign of her sway over some US policy.\n\"Massive credit needs to be given to @LauraLoomer for uncovering this and making me and other officials aware. Well done, Laura,\" Fine wrote on X.\nThe Palestine Children's Relief Fund, a US-based charity, called on the Trump administration to \"reverse this dangerous and inhumane decision\".\nOver the last 30 years the charity has evacuated thousands of Palestinian children to the US for medical care, it said in a statement.\n\"Medical evacuations are a lifeline for the children of Gaza who would otherwise face unimaginable suffering or death due to the collapse of medical infrastructure in Gaza.\"\nThough Loomer holds no official position, she wields significant power and is reported to have successfully pushed for the dismissal of several senior US security officials she deemed disloyal to Trump.\nIn July, Loomer took aim at a job offer made to a highly qualified Biden-era official for a prestigious position at the West Point military academy. The Pentagon rescinded the offer one day later.\nTrump also fired the head of the highly sensitive national security agency, Timothy Haugh, and his deputy Wendy Noble in April at the apparent urging of Loomer, after she met with the president at the White House.\n\"No other content creator or journalist has gotten as many Biden holdovers fired from the Trump admin!\" Loomer posted on X Saturday.","summary":"The announcement came after Laura Loomer, a known racist, urged the state department online to deny visas to Gazans.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/17/us-suspends-visas-for-gazans-after-far-right-influencer-posts","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2024/11/54fcafa9-us-state-department-facebook.webp","video":null,"publish_date":"2025-08-17 00:28:57","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.226},{"id":351710938,"title":"World News | Astronaut Shubhanshu Shukla Arrives in Delhi","text":"New Delhi [India], August 17 (ANI): India's astronaut Group Captain Shubhanshu Shukla, who returned to Earth on July 15 after completing NASA's Axiom-4 (AX-4) space mission, arrived in New Delhi in the early hours of Sunday. Shukla was received at the airport by Union Minister of State for Science and Technology Jitendra Singh and Delhi Chief Minister Rekha Gupta. Also Read | US, Russia Trade Grew 20% Under President Donald Trump Administration, Says Vladimir Putin.\nHis wife, Kamna Shukla, was also present. Union Minister Singh and CM Gupta greeted her ahead of Shukla's arrival. Shukla was part of NASA's Axiom-4 Space Mission, which took off from NASA's Kennedy Space Centre in Florida, US, on June 25. He returned to Earth on July 15, splashing down off the coast of California. He became the first Indian in 41 years to travel to space. Also Read | EAM S Jaishankar, UK Foreign Secretary David Lammy Hold Telephonic Conversation, Discuss Ukraine and Key Global Issues.\nAhead of his return to India, Shukla shared an emotional note on X, reflecting on his year-long training and the bonds he built during the mission. \"As I sit on the plane to come back to India I have a mix of emotions running through my heart. I feel sad leaving a fantastic group of people behind who were my friends and family for the past one year during this mission. I am also excited about meeting all my friends, family and everyone in the country for the first time post mission. I guess this is what life is - everything all at once,\" he wrote.\nHe added, \"Goodbyes are hard but we need to keep moving in life. As my commander @astro_peggy fondly says, 'the only constant in spaceflight is change'. I believe that applies to life as well. I guess at the end of the day -\"Yun hi chala chal rahi - jeevan gaadi hai samay pahiya\". Shukla's journey was part of the Axiom Space (AX-04) mission, launched on June 25 aboard SpaceX's Falcon rocket. The Dragonfly spacecraft docked with the ISS on June 26, where Shukla spent 18 days conducting a series of scientific experiments in microgravity.\nThe mission, conducted in collaboration with NASA and SpaceX, was aimed at gaining practical experience for India's Gaganyaan human spaceflight programme. According to ISRO, Shukla carried out multiple experiments aboard the ISS and the Space Shuttle, making significant contributions to India's space research. The learnings from Shukla's mission will directly support India's Gaganyaan project, which will begin with an unmanned flight later this year, followed by two more unmanned missions. Eventually, an Indian astronaut will be sent into space for 2-7 days aboard the Gaganyaan spacecraft. The mission also highlighted growing India-US space cooperation. During Prime Minister Narendra Modi's visit to the United States, ISRO and NASA signed an agreement enabling an Indian astronaut to travel to the ISS under a US mission. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Shukla was received at the airport by Union Minister of State for Science and Technology Jitendra Singh and Delhi Chief Minister Rekha Gupta.","url":"https://www.latestly.com/agency-news/world-news-astronaut-shubhanshu-shukla-arrives-in-delhi-7062415.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250816213345.jpg","video":null,"publish_date":"2025-08-17 00:28:20","author":null,"language":"en","source_country":"in","sentiment":0.047},{"id":351709780,"title":"Zelensky Caught Between Trump and Putin During U.S. Visit","text":"Ukraine’s future as a sovereign nation is hanging in the balance after the superpower summit between Vladimir Putin and Donald Trump.\n\nCritics cautioned that other global leaders might be unable to stop Volodymyr Zelensky from being ensnared ‘with his head in a vice’ by the American and Russian leaders during his upcoming visit to Mr. Trump at the White House.\n\nDiplomatic insiders revealed that Friday’s discussions in Alaska laid the groundwork for a potential agreement where Ukraine could be expected to forfeit significant portions of the Donbas region in the eastern part of the nation, including areas currently held by Kyiv.\n\nIn return, president Zelensky would receive ‘Nato-style’ protection from Western countries for what remained of his territory.\n\nHe is preparing to fly to Washington for a showdown with Mr Trump, at which he is expected to be told to retreat from the battlegrounds.\n\nSources indicate that Mr. Zelensky has stated he will not concede Donetsk, a focal point of conflict with Moscow since 2014, yet he is reportedly ‘open to discussing territorial matters.’ \n\nLast night, Boris Johnson urged Sir Keir Starmer to spearhead international efforts to prevent Ukraine from being divided following what he termed a ‘vomit-inducing’ session in Alaska.\n\nMr. Trump has informed Mr. Zelensky and European Union leaders that the negotiations would necessitate them abandoning their ceasefire demands, effectively allowing Putin to maintain his assaults on the country until an agreement is reached.\n\n Sir Keir will hold a so-called ‘coalition of the willing’ telephone meeting with French president Emmanuel Macron and German chancellor Friedrich Merz this afternoon to discuss the role of European peacekeepers in a post-conflict Ukraine.\n\nYesterday, President Trump wrote on his Truth Social platform: ‘The best way to end the horrific war between Russia and Ukraine is to go directly to a Peace Agreement, which would end the war, and not a mere Ceasefire Agreement, which often times do not hold up.\n\n‘President Zelensky will be coming to [Washington] DC, the Oval Office, on Monday afternoon. If all works out, we will then schedule a meeting with president Putin.’\n\nLast night, former British defence minister Tobias Ellwood told The Mail on Sunday that he feared Mr Zelensky was walking into a trap in the White House. \n\nHe said: ‘He will be asked to put his head in a vice, with Vladimir Putin pushing from one side and Donald Trump from the other.\n\n‘The Ukrainian president will be presented with a ‘take it or leave it’ deal: surrender territory to Russia or face the blame for wrecking peace.\n\n‘And if Mr Zelensky refuses, Trump will walk away, declaring that America is done with the talks.\n\n‘It’s the classic gangster deal – one you can’t refuse. Except he must.’\n\nMr Johnson, writing in today’s MoS, describes the summit as ‘the most vomit-inducing episode in all the tawdry history of international diplomacy’. \n\nHe says: ‘Imagine how it felt to be one of those embattled heroes in a dug-out near Pokrovsk, fighting for your country’s freedom, and to hear the President of the United States – the ex officio team captain of the Free World – refer to Vladimir Putin as ‘the boss’. Retch.\n\n‘Think of the tens of thousands of Ukrainian widows and orphans.\n\n‘Think of the maimed and mutilated; think of the Ukrainian civilians living in daily and nightly terror of Putin’s bombs and missiles still raining down, even though the so-called negotiations were taking place in Alaska.’\n\nBut he adds: ‘Like so many of the most objectionable pieces of historic diplomacy, that meeting was also, of course, justifiable and even essential.\n\n‘Puke-making though it was, Trump was right to try. He was right to meet Putin, because if millions of Ukrainians were watching with horror at the red-carpet rehabilitation of the Russian tyrant, they were also watching with hope… One day this war will end with a peace that protects Ukrainian freedom; but as Trump said in Alaska, the Europeans – led by Britain – will have to step up.’\n\nThe proposed deal was greeted with dismay in Ukraine. Volodymyr Dubovyk, a professor of international relations in Odesa, described it as ‘a nothing-burger with a sour aftertaste’.\n\nHe said: ‘As a Ukrainian, it was pretty disgusting to see what was going on, all this red carpet, all this clapping and smiles and being chummy.’\n\n Reform UK leader Nigel Farage, a long-time ally of Mr Trump, said of the US President: ‘At least he is trying to find peace.’\n\nBut former Tory defence secretary Ben Wallace hit out at the 1980’s-style ‘pantomime’ of the summit between the two leaders.\n\nHe said: ‘Putin got what he wanted and I think President Trump got a trip to Alaska.’\n\nPresident Trump rolled out the red carpet for Putin and gave himself a get-out clause… it’s time to stand by Zelensky\n\nBy Former Defence Minister Tobias Ellwood \n\nRather than arrest President Putin for war crimes, President Trump rolled out the red carpet and brought the isolated dictator in from the cold.\n\nMost commentary claims the rashly organised summit was a total win for Putin – who basked in the international limelight but left agreeing to nothing.\n\nTrump got what he wanted: an off-ramp, a get-out clause.\n\nBy hosting these summits, knocking heads together, and proposing a ‘final’ peace deal, he has created a stage where, if talks collapse, he can blame Zelensky.\n\nI fear that at tomorrow’s meeting at the White House, Zelensky will be walking into a trap.\n\nHe will be asked to put his head in a vice – Vladimir Putin pushing from one side, Donald Trump from the other.\n\nThe Ukrainian president will be presented with a ‘take it or leave it’ deal: surrender territory to Russia or face the blame for wrecking peace.\n\nAnd if Zelensky refuses, Trump will walk away, declaring America is done with the talks. It’s the classic gangster deal – one you can’t refuse.\n\nExcept he must – for the sake of his country and for the sake of international justice.\n\nThe stakes could not be higher for Europe.\n\nGlobal security is never in a good place when America retreats into isolationism and drifts out of step with Europe.\n\nYet here we have an invaded sovereign state potentially abandoned, while Trump sees no harm in doing business – minerals included – with the enemy.\n\nThis is not the America we know and love.\n\nTrump’s geo-strategic blind spot is believing this is just about Ukraine.\n\nEurope knows better.\n\n The Russian threat – increasingly backed by China – is far larger.\n\nA deal that cements Russia’s gains will only buy Putin time to re-arm, regroup, and strike again.\n\nHistory is clear on what happens when bullies are appeased: more war.\n\nAnd it won’t stay confined to Europe.\n\nIt’s time to stand by Zelensky.\n\nHe is going to need our help.\n\nIf we don’t, it will be us who need help next.\n\n• Former Tory MP Tobias Ellwood was Defence Minister from 2017 to 2019.","summary":"Internewscast Journal\n\nInternewscast\n\n\nUkraine&#8217;s future as a sovereign nation is hanging in the balance after&#8230;\n\n\nThis Post: Zelensky Caught Between Trump and Putin During U.S. Visit first appeared on Internewscast Journal","url":"https://internewscast.com/news/zelensky-caught-between-trump-and-putin-during-u-s-visit/","image":"https://internewscast.com/wp-content/uploads/2025/08/Zelensky-in-Trump-Putin-vice-as-he-flies-out-to-US.jpg","video":null,"publish_date":"2025-08-17 00:26:17","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.274},{"id":351710750,"title":"PETER HITCHENS: You may not like it, but we have lived peaceful lives because of squalid deals like this one","text":"All aboard HMS Humbug for another round of ignorant bloviation, empty moralising and hypocrisy. \n\nPutin is Hitler, we are all Winston Churchill, if we don't stand up now there'll be Russian tanks in Bexley before we know what hit us, etc etc. \n\nWe must grieve that the USA has wearied of financing and arming one of the stupidest, most pointless wars in human history.\n\nLet's all disapprove, from a safe distance. Here they all come, retired generals with growly voices, ancient doddering spooks who never came in from the Cold War, bloodthirsty Blairite veterans of Iraq.\n\nBeside them march politicians who somehow never learned any real history, but picked up something about Munich during their A-levels, and world affairs commentators who never ventured east of Frinton.\n\nThey all want war without end in Ukraine. Many of them give off the rich, sickly perfume of high moral purity. \n\nThey do not know, or have forgotten that this country took part in a bloodstained illegal invasion of Iraq in 2003, that it helped violently to rearrange the borders of Yugoslavia, that it crazily bombed Libya in 2011 (so triggering mass migration which has never stopped since). \n\nSome of them actually helped to destabilise Syria so that it now has an Al Qaeda government presiding over the blood, graves and rubble created by our 'ethical foreign policy'.\n\nWell, I believe the Ukrainian army is now accepting volunteers from almost anywhere, of nearly any age. It needs to. \n\nMany of that country's own young men flee abroad, or bribe greedy officials for exemptions, or go into hiding lest they are dragged off to the front by snatch squads employed by their martial law state.\n\nFor them, the claims that Ukraine is a vibrant western democracy sound pretty thin.\n\nSo my first response to these jingoes is to say: 'If you are so keen, please go and fight in the war you like so much. \n\nPerhaps you might free some press-ganged young man to go home and be a husband and father, instead of cannon fodder'.\n\nBut that would be a bit emotional. Let's try facts and logic instead.\n\nThere is a very serious argument against this war. All grown-ups in world affairs are well aware of it. \n\nIt was from the start a rash, cynical adventure. Ukraine has been used. You can only say the truth if you are a keen supporter of the conflict.\n\n For instance, the noted American Russia hawk, Robert Kagan, has correctly stated in the elite magazine Foreign Affairs that Russia was provoked into war. \n\nHe did not say this justified the invasion, for it doesn't. He just stated as a fact that 'although it is obscene to blame the United States for Putin's inhumane attack on Ukraine, to insist that the invasion was entirely unprovoked is misleading'.\n\nLikewise Leon Panetta, former CIA chief and US Defence Secretary, admitted the Ukraine conflict was a proxy war between Russia. Nato and the USA. If I said this, I would be denounced as a 'Putin apologist'. But he can say it, and he did.\n\nBefore Ukraine suddenly became independent in 1991, the West was not all that keen on its existence. In June 1990, Margaret Thatcher wanted to bolster Moscow in the region and was dismissive and chilly to Ukrainian nationalists. \n\nShe briskly batted away a question about opening a British embassy in Kiev.\n\nThis, she explained, was as likely as Britain opening an embassy in California or Quebec. 'I can see you are trying to get me involved in your politics!', she scolded her questioner. Those Tory war enthusiasts who claim to admire her now might ponder this.\n\nA year later, in August 1991, President George HW Bush refused even to meet campaigners for Ukrainian independence. \n\nHe didn't like the look of them and said 'Americans will not support those who seek independence in order to replace a far-off tyranny with a local despotism. They will not aid those who promote a suicidal nationalism based upon ethnic hatred'.\n\nHe feared an outbreak of ancient tensions in Ukraine, which has a recent history of deep, dangerous ethnic passions, as all informed people know. \n\nIt might be a bit early to say he was wrong. But the collapse of the USSR, following a failed KGB coup in Moscow, followed within weeks.\n\nSuddenly there was an independent Ukraine whether anyone liked it or not, within borders designed by the Communist Party of the Soviet Union. And some high policy-makers in the USA wanted to use this new country as a battering-ram against Russia.\n\nIn 1997, the former Secretary of State Zbigniew Brzezinski claimed that 'Ukraine, a new and important space on the Eurasian chessboard, is a geopolitical pivot because its very existence as an independent country helps to transform Russia'.\n\nHe argued: 'However, if Moscow regains control over Ukraine, with its 52 million people and major resources as well as its access to the Black Sea, Russia automatically again regains the wherewithal to become a powerful imperial state, spanning Europe and Asia.'\n\nThis is the origin of the strange belief that ramshackle Russia, with its scrap-metal mercenary army and an economy the size of Italy is poised to march on Berlin, and then push Nato into the sea at Dunkirk.\n\nUkraine, in its peaceful and surprisingly democratic period from 1991 to 2014, was a county increasingly divided between its fervent, nationalist west and its more neutral Moscow-oriented east. Its then government was not all that keen to be used as a proxy by Washington.\n\nBut in February 2014, the legitimately elected Ukrainian President Viktor Yanukovych was overthrown by a violent ultra-nationalist mob. This was made up of the sort of people the British and American elite classes would normally call 'fascists'.\n\nThe remnants of the country's parliament violated their own constitution to ratify this squalid putsch. Then the USA and Britain endorsed their lawless action. And that, not the invasion of 2022, was the start of the filthy, dismal war we now see.\n\nIt has not worked out well for anyone, least of all for poor Ukraine. \n\nThe vast new graveyards can be seen from space, Russian bombardment has mangled its key infrastructure as well as killing many innocents, and its cities are full of widows, orphans and maimed and disfigured men. For whose good? Who will stop this?\n\nDonald Trump, whom I greatly dislike, at least has the sense to see that this has gone on long enough and is benefiting nobody at all. \n\nHe wants to end it, partly because he knows his supporters are sick of America's forever wars and partly because he wants a Nobel Peace Prize.\n\nIf, to do so, he has to hold his nose and treat the sinister tyrant Vladimir Putin as an equal, so that he can bring peace, then he will not be the first democratic leader to do such a thing. \n\nJFK met the dubious Khrushchev, Nixon met the ghastly mass murderer Mao Zedong, Churchill drank brandy, deep into the night, with the unspeakable despot Stalin.\n\nYou and I may not like this, but millions of us have lived peaceful prosperous lives because of squalid, despicable deals made by men of power.","summary":"All aboard HMS Humbug for another round of ignorant bloviation, empty moralising and hypocrisy.","url":"https://www.dailymail.co.uk/debate/article-15007387/PETER-HITCHENS-Peaceful-lives-squalid-deals-Trump-Putin-Ukraine.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/00/101290203-0-image-a-77_1755388434651.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/16/3540749709410586383/1024x576_MP4_3540749709410586383.mp4","publish_date":"2025-08-17 00:25:50","author":"Editor,Peter Hitchens","authors":["Editor","Peter Hitchens"],"language":"en","source_country":"GB","sentiment":-0.285},{"id":351714152,"title":"How rich is Donbas? The Ukrainian coal and mineral hub that Putin wants to end the war","text":"NYT News ServiceA Ukrainian soldier with the 53rd Mechanized Brigade in the back of a fast-moving truck stays on the lookout for Russian drones in the city of Kostyantynivka, Ukraine.\n\nThe fate of Ukraine’s eastern Donbas region, its coal-rich, heavily industrialised heartland, has become the core bargaining chip in talks between Vladimir Putin and Donald Trump in Alaska.Following his summit in Alaska with Vladimir Putin, Donald Trump informed Ukraine's leader on Saturday, August 16, that Putin had proposed freezing the frontlines in other areas if Kyiv agreed to withdraw from the eastern regions of Donetsk and Luhansk, the two regions that make up the coal-rich region of Donbas, according to a source familiar with the discussions, as reported by the Jerusalem Post.However, in his recent statements, Zelensky dismissed the notion of abandoning Donbas, the collective term for the Donetsk and Luhansk regions.If it happens, that would give Moscow control of almost the entire Donbas, a region that has been contested since Russia’s first invasion in 2014.Why Donbas mattersLive EventsDonbas. short for the Donets Coal Basin, is Ukraine’s industrial powerhouse, stretching across the Donetsk and Luhansk regions. It holds vast coal reserves, once fuelling much of Ukraine’s energy grid and steel production. Before the war, metallurgy and mining made the region a key driver of Ukraine’s economy.“Control of Donbas gives Russia a massive economic and military advantage,” says Elina Beketova to The Independent, a fellow at the Centre for European Policy Analysis. “It’s not just resources, it’s a fortress line Ukraine has built up for years. If it falls, Russia can push deeper west unhindered.”According to Yaroslav Trofimov, the Chief Foreign Affairs Correspondent of The Wall Street Journal, surrendering the fortifications of northern Donbas in exchange for Putin’s pinky promise not to invade for the third time would be suicidal for Ukraine, unless Trump is willing to send US troops to protect Ukraine the way they protect South Korea.How rich is Donbas?Donbas is exceptionally rich in natural resources, making it a crucial economic and strategic hub for Ukraine. According to the 2025 CIRSD report \"The Mineral Wars,\" the Donbas and Crimea regions collectively host significant coal deposits, natural gas fields, and critical minerals. Within months of Russia's invasion in 2022, Moscow controlled over $12.5 trillion worth of Ukrainian mineral and gas assets. Donbas alone contains more than 56 per cent of Ukraine’s hard coal reserves, among the largest in the world and valued at approximately $12 trillion. It is rich in critical minerals such as lithium (important for batteries and green technologies), tantalum, cesium, and strontium, which are essential for the green energy and defense sectors.Beyond its mineral wealth, the Donbas also plays a pivotal role in agriculture, with its water resources sustaining farming operations across southern Ukraine and supplying Crimea, a region suffering from chronic water scarcity. A region under siegeSince 2014, Russia has steadily entrenched its hold. Today, nearly 88 per cent of Donbas is occupied by Moscow’s forces, including almost all of Luhansk and three-quarters of Donetsk. Ukraine still holds about 6,600 sq km of territory, but fierce Russian offensives continue around cities like Pokrovsk.The war has devastated Donbas’s coal industry. In 2014 alone, production dropped by more than 22 per cent compared with the previous year. Yet the region remains central to Moscow’s ambitions, not only for its economic output but also for its geography. Defensive lines in Donetsk have long blocked Russia’s advance into central Ukraine.(You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onDonbasUkraine coal reservesPutin Ukraine conflictdonbas importanceHow Rich is DonbasDonetsk Luhansk regionscoal industry UkraineRussian occupation of Donbasagriculture in Donbasstrategic importance of Donbas\n\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onDonbasUkraine coal reservesPutin Ukraine conflictdonbas importanceHow Rich is DonbasDonetsk Luhansk regionscoal industry UkraineRussian occupation of Donbasagriculture in Donbasstrategic importance of Donbas(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates....moreless\n\nExplore More Stories123","summary":"In Alaska, Donald Trump and Vladimir Putin discussed the fate of Ukraine's Donbas region, with Trump reportedly considering Putin's proposal to freeze frontlines in exchange for Kyiv withdrawing from Donetsk and Luhansk. Zelensky has dismissed abandoning Donbas, a region rich in coal and critical minerals, control of which would give Russia a significant economic and military advantage.","url":"https://economictimes.indiatimes.com/news/international/us/how-rich-is-donbas-the-ukrainian-coal-and-mineral-hub-that-putin-wants-to-end-the-war/articleshow/123340392.cms","image":"https://img.etimg.com/thumb/msid-123340393,width-1200,height-630,imgsize-324032,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-08-17 00:18:40","author":"Sectionshow Rich Is Donbas? The Ukrainian Coal And Mineral Hub That Putin Wants To End The Warglobal","authors":["Sectionshow Rich Is Donbas? The Ukrainian Coal And Mineral Hub That Putin Wants To End The Warglobal"],"language":"en","category":"politics","source_country":"in","sentiment":0.39},{"id":351710934,"title":"World News | Trump, Putin May Have Agreed to Outlines of Deal in Alaska: Former Diplomat Fabian","text":"New Delhi [India], August 17 (ANI): Former diplomat KP Fabian has said that though there was no deal concerning Ukraine conflict during summit meeting between US President Donald Trump and Russian President Vladimir Putin in Alaska, it is possible that the two leaders \"have agreed on the outlines of a deal\" which they would not like to publicise for diplomatic reasons.\nIn an interview with ANI, Fabian said there could not have been any final deal at the meeting. Also Read | US, Russia Trade Grew 20% Under President Donald Trump Administration, Says Vladimir Putin.\n\"Well, I think we have to understand the situation correctly. No ceasefire agreement was expected, and therefore, there could not have been any final deal. Why is it so? Because Putin is insisting on agreement on certain matters, the root cause of the war and Russia's security concerns. Now, till now, Ukraine President Volodymyr Zelenskyy and his European supporters have not agreed to meet those conditions. And if they believed, that is, Zelensky and his European supporters believed that Trump was going to tell Putin, either you agree to a ceasefire tomorrow or sanctions on you, well, they were in a make-believe world. They do not understand Trump,\" Fabian said.\n\"So, now, it is possible that there will be another meeting, and Putin has proposed Moscow, a meeting where Zelensky also will be invited, but Trump also will be there. And then another thing we have to understand is that though there was no deal, it is quite possible that Trump and Putin have agreed on the outlines of a deal, which naturally they would not like to publicise for good diplomatic reasons,\" he added.\nAlso Read | EAM S Jaishankar, UK Foreign Secretary David Lammy Hold Telephonic Conversation, Discuss Ukraine and Key Global Issues.\nHe said there is more pressure on Ukraine. \"As we all know, Ukraine is losing, there are deserters, people are leaving the army, and Russia is capturing more and more territory, so either Ukraine agrees to a ceasefire as is on basis, or after two months, Ukraine will have to sign on the dotted line.\"\nTrump said on Saturday that the meeting with Putin\"went really well\". He also held a telephonic call with Ukrainian President Zelenskyy, several European leaders and the Secretary General of NATO and highlighted that it was determined by all that a peace agreement is the best way going forward. The US President wrote on Truth Social, \"A great and very successful day in Alaska! The meeting with President Vladimir Putin of Russia went very well, as did a late night phone call with President Zelenskyy of Ukraine, and various European Leaders, including the highly respected Secretary General of NATO. It was determined by all that the best way to end the horrific war between Russia and Ukraine is to go directly to a Peace Agreement, which would end the war, and not a mere Ceasefire Agreement, which often times do not hold up.\" He also shared that Ukrainian President Zelenskyy will be coming to Washington DC on Monday and said that if things work out then a meeting would be scheduled with Russian President Vladimir Putin. \"President Zelenskyy will be coming to D.C., the Oval Office, on Monday afternoon. If all works out, we will then schedule a meeting with President Putin. Potentially, millions of people's lives will be saved. Thank you for your attention to this matter!\"\nRussia's top economic envoy, Kirill Dmitriev, said the US received Russia \"very well\" in Alaska and that the two countries would continue building relations despite \"resistance.\" \"The US-Russia summit in Alaska has definitely been productive,\" Dmitriev said, adding that there were \"lots of issues that we discussed and many we agreed on,\" as quoted by CNN.\nAnswering q query on media reports of Pakistan Army officers and senior civilian officials paying respects at the grave of a Lashkar-e-Taiba (LeT) terrorist eliminated in Operation Sindoor, Fabian said terror attacks in India have been supported by the Pakistan Army. \"I don't see how and why our media should get shocked or surprised about it. I have always maintained that if you want to designate one person who is behind Pahalgam terror attack, his name is Asim Munir, the Army Chief of Pakistan. So, whatever terrorist attacks are taking place from Pakistan, Pakistan has the full support and full ownership of the Pakistan military. And that gets again and again exhibited when military officers and civilian officers go and honour people, persons whom we consider as terrorists,\" he said. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  Former diplomat KP Fabian has said that though there was no deal concerning Ukraine conflict during summit meeting between US President Donald Trump and Russian President Vladimir Putin in Alaska, it is possible that the two leaders &quot;have agreed on the outlines of a deal&quot; which they would not like to publicise for diplomatic reasons.","url":"https://www.latestly.com/agency-news/world-news-trump-putin-may-have-agreed-to-outlines-of-deal-in-alaska-former-diplomat-fabian-7062405.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250816202716.jpg","video":null,"publish_date":"2025-08-17 00:16:19","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.082},{"id":351713624,"title":"Swarthmore responds to lawsuit alleging it put trans athlete back on women's track team after NCAA rule change","text":"Swarthmore College has responded to a lawsuit filed by transgender track and field athlete Evelyn Parts that alleges the school removed Parts from the women's team after the NCAA changed its rules to prohibit males from competing in women's sports, but later added Parts back to the team despite the new rules. Parts filed the lawsuit this week, becoming the third trans athlete in the span of a month to sue a U.S. college for being removed from a women's team. Swarthmore provided a statement to Fox News Digital in response to Parts' lawsuit and the specific allegations of adding Parts back to the team after the NCAA changed its rules. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"Swarthmore deeply values our transgender community members and the many ways they enrich campus life. We offer numerous resources to create a welcoming, supportive and inclusive environment for transgender individuals. We recognize that this is an especially difficult and painful time for members of the transgender community, including student-athletes,\" the statement said. \"We worked to support Evie Parts in a time of rapidly evolving guidance, while balancing the ability for other members of the women’s track team to compete in NCAA events. Given the pending litigation, we will not comment any further.\" FORMER UPENN SWIMMER REFLECTS ON BEING TEAMMATES WITH LIA THOMAS Parts alleged the school said Parts could no longer compete on the women's team in February, the same month the NCAA changed its gender eligibility policy after President Donald Trump signed the \"Keeping Men Out of Women's Sports\" executive order. Parts' lawsuit also claims the trans athlete was \"fully reinstated\" to the Swarthmore women's track team April 11. Parts claims to have been allowed to compete on the women’s team until graduating in May, even after the policy changes and Trump's executive order went into effect. Parts is listed as the winner of the women's 10,000 meters at the Bill Butler Invitational in April and as a participant in the Paul Donahue Invite that same month and the Centennial Championships in early May, according to the athlete's Swarthmore Athletics page. Parts' attorney, Susie Cirilli, previously provided a statement to Fox News Digital addressing the lawsuit. \"We stand by the allegations in the complaint. As stated in the complaint, the NCAA is a private organization that issued a bigoted policy. Swarthmore chose to follow that policy and disregard federal and state law,\" Cirilli said. Swarthmore would not be the first school to allow a biological male to compete in women's sports after the NCAA rule change, if the allegations are true. Ithaca College in New York admitted to allowing a trans athlete to compete in a Division III rowing competition in March. The trans athlete competed in the Cayuga Duals, but only in the third varsity eight event, which is not factored into NCAA championship qualification. Ithaca provided a statement to Fox News Digital saying the trans athlete's participation was due to a \"misunderstanding\" by the coaching staff. CLICK HERE TO GET THE FOX NEWS APP The NCAA provided a statement to Fox News Digital addressing Ithaca's breach of policy. \"The policy is clear that there are no waivers available, and students assigned male at birth may not compete on a women’s team with amended birth certificates or other forms of ID,\" the NCAA said. \"If competition occurs, the team will be considered a mixed team and not eligible to compete against women’s teams. Ithaca stated their intent to adhere to the policy, which allows for practice opportunities, and the NCAA appreciates Ithaca’s responsiveness.\" The NCAA did not indicate whether results from the event would be voided or if Ithaca would face any consequences. Former President Joe Biden had an executive order in place that protected the rights of trans athletes to compete in women's sports, and the NCAA's previous policy enabled trans athletes. The participation of former University of Pennsylvania trans swimmer Lia Thomas and former San Jose State trans volleyball player Blaire Fleming prompted multiple lawsuits against those institutions and the NCAA, led by Riley Gaines, Brooke Slusser and multiple former UPenn women's swimmers. Trans athlete Sadie Schreiner, who Cirilli is also representing in a lawsuit against Princeton University, was previously allowed to compete for Rochester Institute of Technology's (RIT) women's track and field team for two years before the February NCAA rule change. Former RIT women's track runner Caroline Hill joined Gaines' lawsuit against the NCAA, citing her experience competing with and sharing a locker room with Schreiner. Trump's Department of Education has already taken action against multiple universities over incidents of trans inclusion in women's sports prior to Trump's executive order. The DOE reached an agreement with UPenn over Thomas' participation in women's swimming in early July. The university agreed to expunge the trans athlete's records and apologize to all the female athletes affected by Thomas' presence on the women's team. Earlier in August, the DOE reached an agreement with Wagner College for a similar resolution regarding former trans fencer Redmond Sullivan. The DOE's investigation into San Jose State over the Fleming controversy is ongoing. Fox News Digital has reached out to the NCAA for comment on Parts' lawsuit. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Swarthmore College responded to a lawsuit that alleges it removed a trans athlete from a women&apos;s team to comply with NCAA policy but then reinstated that athlete.","url":"https://www.foxnews.com/sports/womens-volleyball-activists-react-california-high-school-team-forfeiting-opponent-trans-athlete","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/swarthmore-college-trans-athlete-lawsuit.jpg","video":"https://www.foxsports.com/watch/wildmoka_41406990514","publish_date":"2025-08-17 00:10:47","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"US","sentiment":-0.252},{"id":351708788,"title":"Dricus Du Plessis vs Khamzat Chimaev - UFC 319: Live score and round-by-round updates as Stillknocks aims to defend his UFC Middleweight Championship","text":"Sunderland 3-0 West Ham: Graham Potter's major mistake, the Hammers star schooled by ex-Arsenal midfielder - and why Mackems new boys already look like £130m well spent\n\nYour ultimate club-by-club guide to the new Premier League season: Daily Mail Sport predicts where EVERY team will finish\n\nErling Haaland pokes fun at Noni Madueke's infamous social media post ahead of Man City's clash with Wolves\n\nAntoine Semenyo breaks silence with powerful statement online after being racially abused by a Liverpool fan during Bournemouth's clash at Anfield\n\nNottingham Forest confirm £37.5m signing of Omari Hutchinson from Ipswich as England U21 international joins on five-year deal to take summer spending to £100m\n\nDiogo Jota's emotional widow takes in Wolves' incredible tributes to Liverpool star as his ex team-mates fight back tears during minute's applause\n\nWayne Rooney hits back at claims about his intelligence as Man United and England legend gives candid interview\n\nPep Guardiola admits fears over Man City squad as he sounds warning to club chiefs despite 4-0 win over Wolves\n\nMatch of the Day viewers give verdict on first show without Gary Lineker as Wayne Rooney is criticised by fans after his debut as a regular following £800,000 deal\n\nFootball condemns racist abuse aimed at Antoine Semenyo: Bournemouth captain speaks out, manager reveals star was asked if he wanted to play on - and Liverpool release statement as player breaks silence\n\nMan United legend's son captains Red Devils Under 16 side in overseas friendly - one week after fellow football nepo baby Kai Rooney made his debut for the Under 19s\n\nFootball rallies around teenage star, 16, who suffered vile trolling mocking her unveiling photos on what should have been happiest day of her life\n\nMarcus Rashford's LaLiga future is decided as Barcelona finally announce squad list for the new season - after club chiefs 'took emergency financial action' amid player registration crisis\n\nMichelle Obama weighs in on Caitlin Clark-Angel Reese rivalry after WNBA racism investigation\n\nWNBA superstar Sophie Cunningham leaves fans stunned with wild comment about Caitlin Clark's 'smell'\n\nPlastic surgeon reveals secrets of Cristiano Ronaldo's changing face, including a painful oral procedure... and how he avoided the 'Tom Brady mistake'\n\nWrexham confirm record '£10m' signing of former Premier League striker - as Hollywood-owned club continue summer spree\n\nJamie Carragher gives major reason why Liverpool 'WON'T win the league' unless they fix glaring flaw - after conceding twice to Bournemouth\n\nRevealed: 'The one Jadon Sancho demand holding up £20m Man United sale' despite the forward being frozen out by Ruben Amorim\n\nLiverpool's new signings graded: How Hugo Ekitike, Florian Wirtz, Jeremie Frimpong and Milos Kerkez got on in their Premier League debuts for the champions against Bournemouth\n\nCosteen Hatzi opens up on public breakup with tennis firebrand Nick Kyrgios and what she regrets about their time together\n\nLiverpool 4-2 Bournemouth PLAYER RATINGS: Which new Reds signing was 'ineffective'? Whose shaky showing left fans with their 'hearts in their mouths?' And whose brilliance will 'DELIGHT' Arne Slot?\n\nMohamed Salah breaks down in tears as Liverpool pay emotional tribute to Diogo Jota and stars dedicate goals to late team-mate in Bournemouth win\n\nWayne Rooney's son Kai, 15, is named in matchday squad for Man United's first Under-18 game of the season - as he is bumped up THREE age groups\n\nThierry Henry gives his honest verdict on Viktor Gyokeres after his £64m move to Arsenal after a mixed pre-season\n\nFans are convinced Travis Kelce's outfit is a nod to girlfriend Taylor Swift as he arrives for first NFL game since podcast broke the internet\n\nAlexander Isak is on STRIKE at Newcastle United - CRAIG HOPE reveals what will happen next, the four options open to the club and the one certainty in Liverpool's pursuit\n\nEberechi Eze asks to SIT OUT of Crystal Palace's Premier League opener against Chelsea amid Tottenham talks\n\nChelsea legend SPLITS from his wife of 26 years: Premier League icon shares emotional update on social media\n\nFlorian Wirtz's bid to 'lure' ANOTHER friend to Liverpool from Bayer Leverkusen - as top defender opens up on being 'courted'\n\nFans go wild for new Dallas Cowboys cheerleader as rookie shares stunning photos after making the team\n\nAntoine Semenyo breaks silence after he was allegedly racially abused against Liverpool - as he responds to ANOTHER vile racist comment from sick troll\n\nBournemouth star reports racist abuse by Liverpool fan as new footage shows moment supporter is thrown OUT of Anfield by police after 'despicable' incident\n\nCristiano Ronaldo forks out for £270,000-worth of gifts including a Porsche and luxury handbags to celebrate proposing to long-time girlfriend Georgina Rodriguez with massive SEVEN-FIGURE diamond ring\n\nChampionship club confirm Brandon Williams signing - as former Manchester United star bids to rebuild his career\n\nMarseille's explosive meltdown: English star in 'heated argument' with Adrien Rabiot - while Roberto De Zerbi accuses his men of having 'SMALL BALLS' in furious tirade after opening-day defeat\n\nNottingham Forest launch surprise swoop for Manchester City star following £30m James McAtee deal as Nuno Espirito Santo's side ramp up late transfer spree\n\nNewcastle renew interest in PSG star as club continue striker search amid Alexander Isak's attempt to force move to Liverpool\n\nLiverpool's new hero, the crisis they MUST spend money to fix - and Bournemouth star shows big clubs what they are missing in 4-2 defeat by Arne Slot's champions\n\nEmma Raducanu reveals how she feels about Carlos Alcaraz dating rumours ahead of hotly anticipated Mixed Doubles pairing - and what she thought of bizarre Cam Norrie romance question\n\nPep Guardiola breaks silence on Ederson's omission from Man City squad against Wolves after European side made approach for star\n\nJadon Sancho's awkward substitution! £250,000-per-week Man United outcast gets a VERY prominent tattoo of new girlfriend's name - while she watches him have tribute to his ex covered up at the same session\n\nNewcastle dominated Aston Villa thanks to two star performances but still fired blanks - Alexander Isak's absence cost them dearly, writes CRAIG HOPE\n\nEddie Howe gives update on Alexander Isak saga with wantaway forward looking to secure Liverpool move as Newcastle boss admits it has been a 'distraction'\n\nWWE legend Mick Foley's daughter reveals she sustained life-changing injuries after rollercoaster accident\n\nOlivia Dunne sizzles in new bikini-clad snap from lakeside vacation after backing Taylor Swift in NFL fan feud\n\nHow Manchester City and Pep Guardiola got the 'fire in the belly' back: Erling Haaland's targets, the stars with most to prove, Hugo Viana's immediate impact and the truth about Gianluigi Donnarumma and Rodrygo\n\nPaul Merson sends Benjamin Sesko warning to Man United and reveals who could be the 'gamechanger' in the Premier League title race\n\nGisele Bundchen is 'furious' that ex-husband Tom Brady took a 'petty' shot at her with brutal parenting remarks\n\nLiverpool are the Premier League champions but do they have the best kits this season? Where does YOUR club rank among the 40 home and away top-flight strips?\n\nRevealed: Surprising real identity of glamorous former Miss England contestant's sporting hero grandfather\n\nTransgender runner sues NCAA and college over track ban in wake of Donald Trump's executive order","summary":"Follow Daily Mail Sport's live blog for the latest score, round-by-round updates and undercard results from UFC 319 as Dricus Du Plessis vs Khamzat Chimaev headline event.","url":"https://www.dailymail.co.uk/sport/mma/article-15003803/Dricus-Du-Plessis-vs-Khamzat-Chimaev-UFC-319-Live-Result.html","image":"https://i.dailymail.co.uk/1s/2025/08/15/15/101257871-0-image-m-9_1755268334031.jpg","video":null,"publish_date":"2025-08-17 00:08:08","author":"Editor,Will Griffee","authors":["Editor","Will Griffee"],"language":"en","source_country":"jp","sentiment":0.201},{"id":351710932,"title":"World News | US Team Not Coming to India for Next Round of Trade Negotiations: Govt Sources","text":"New Delhi [India], August 17 (ANI): The US team is not coming to India for the next round of bilateral trade negotiations, according to government sources. The team was scheduled to arrive on August 25 for the sixth round of negotiations. Also Read | US, Russia Trade Grew 20% Under President Donald Trump Administration, Says Vladimir Putin.\n\"US Trade team not coming to India for the next round of trade negotiations. The US team was scheduled to visit India on 25th August for the 6th round of negotiations,\" government sources told ANI. Five rounds of negotiations have already been held, with the last round taking place from July 14-18, 2025, in Washington DC. India and the US are discussing tariff concessions and market access in key sectors, aiming to finalise an interim deal. Also Read | EAM S Jaishankar, UK Foreign Secretary David Lammy Hold Telephonic Conversation, Discuss Ukraine and Key Global Issues.\nThe talks cover various areas, including market access, Sanitary and Phytosanitary Measures (SPS), Technical Barriers to Trade (TBT), digital trade, customs, and trade facilitation. Officials from both sides have engaged in in-depth talks, making progress towards crafting a balanced agreement with early wins. On whether the US team is coming for negotiations scheduled in the last week of August, Commerce Secretary Sunil Barthwal said, \"Closer to the date, which is the end of the last week of August, we will be able to know how that round will be progressing.\" Commenting on US BTA negotiations, he said, \"Our Bilateral Trade talks negotiations with the United States are going on. We are engaged. Bilateral deliberations are happening at different levels. One is at the negotiating team's level. Another one happens at the minister's level. Third, happens at the diplomatic level, and we also engage with different industries of the US, companies and everybody to look into their issues. So this negotiation is happening across various channels.\" \"These negotiations are happening and we are engaged. The US is a very important partner for us. For the US, India is also an important partner,\" he added. During Prime Minister Narendra Modi's visit to Washington, DC, a Joint Statement was issued setting the goal to expand bilateral trade to USD 500 billion by 2030, and to pursue a Bilateral Trade Agreement (BTA) toward that end. Both countries aim to conclude the first tranche of the BTA by fall 2025. India and the US have set a target to double their trade to USD 500 billion by 2030. India is seeking improved market access for its goods and services, while the US is pushing for greater market access in key sectors. Addressing concerns over the impact of US tariffs on Indian exports earlier, a senior government official said that the government is closely monitoring the sectors most exposed to the US market and is working with key stakeholders to assess vulnerabilities. \"We are in touch with the stakeholders. We understand which sectors are more exposed to us, and our commodity divisions are in discussions with various EPCs. The Minister has also taken meetings with the EPCs, particularly with those sectors which are labour-intensive. I have also taken a meeting with our officials, who are talking to the EPCs, trying to understand their exposure to the US,\" the official said. Highlighting the varying levels of export dependence, the official explained, \"There are other companies which are more diversified, which are not only exporting to the US, but also exporting to the EU, exporting to the UK, exporting to other countries. Now, companies are also involved in standardising their exports; they may face some challenges that they are identifying, but they are also looking at other possibilities for diversification. And therefore, you know, our focus on this diversification and this export promotion mission is very, very important.\" US President Donald Trump has said there will be no trade negotiations with India until a dispute over tariffs is resolved, following his administration's decision to double tariffs on Indian imports.\nWhen pressed by ANI at the Oval Office, whether he expected talks to resume in light of the new 50 per cent tariff.\n\"No, not until we get it resolved,\" he replied. The White House on Wednesday issued an Executive Order imposing an additional 25 percentage points in tariffs on Indian goods, raising the total levy to 50 per cent. The administration cited national security and foreign policy concerns, pointing specifically to India's ongoing imports of Russian oil.\nThe order claims that these imports, whether direct or via intermediaries, present an \"unusual and extraordinary threat\" to the United States and justify emergency economic measures. In early August, the US imposed a 25 per cent tariff on most Indian goods, effective August 7, with exemptions for pharmaceuticals, electronics, semiconductors, and energy products. But US President Donald Trump further imposed an additional 25 per cent tariff on India, making the total imposition at 50 per cent. According to US officials, the initial 25% tariff came into effect on 7 August. The additional levy will take effect in 21 days and apply to all Indian goods entering US ports -- with exceptions for items already in transit and certain exempt categories. The order also provides flexibility for the president to modify the measures, depending on changing geopolitical circumstances or retaliatory actions by India or other nations. Prime Minister Narendra Modi responded defiantly during a speech at the MS Swaminathan Centenary International Conference in New Delhi, signalling that New Delhi would not back down in the face of economic pressure. \"For us, the interest of our farmers is our top priority,\" PM Modi said. \"India will never compromise on the interests of farmers, fishermen and dairy farmers. I know we will have to pay a heavy price for it, and I am ready for it. India is ready for it.\" India has consistently pushed back against opening sensitive sectors such as agriculture and dairy to international competition, citing the potential impact on millions of rural livelihoods. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  &quot;US Trade team not coming to India for the next round of trade negotiations. The US team was scheduled to visit India on 25th August for the 6th round of negotiations,&quot; government sources told ANI.","url":"https://www.latestly.com/agency-news/world-news-us-team-not-coming-to-india-for-next-round-of-trade-negotiations-govt-sources-7062396.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250816194753.jpg","video":null,"publish_date":"2025-08-17 00:06:20","author":null,"language":"en","category":"politics","source_country":"in","sentiment":0.291},{"id":351710952,"title":"World News | Earthquake of Magnitude 4.9 Strikes Afghanistan","text":"Kabul [Afghanistan], August 17 (ANI): An earthquake of magnitude 4.9 rocked Afghanistan late on Saturday night, the National Center for Seismology (NCS) said in a statement. As per the NCS, the earthquake took place at a shallow depth of 10km, making it susceptible to aftershocks. Also Read | US, Russia Trade Grew 20% Under President Donald Trump Administration, Says Vladimir Putin.\nIn a post on X, the NCS said, \"EQ of M: 4.9, On: 16/08/2025 23:05:03 IST, Lat: 36.83 N, Long: 71.01 E, Depth: 10 Km, Location: Afghanistan.\" https://x.com/NCS_Earthquake/status/1956774604703494161\nAlso Read | EAM S Jaishankar, UK Foreign Secretary David Lammy Hold Telephonic Conversation, Discuss Ukraine and Key Global Issues.\nEarlier on August 13, another earthquake of magnitude 4.2 struck the region at a depth of 10km.\nIn a post on X, the NCS said, \"EQ of M: 4.2, On: 13/08/2025 13:53:54 IST, Lat: 35.66 N, Long: 69.12 E, Depth: 10 Km, Location: Afghanistan.\"\nhttps://x.com/NCS_Earthquake/status/1955549479530115124\nEarlier on August 8, an earthquake of magnitude 4.3 struck the region at a depth of 10km.\nIn a post on X, the NCS said, \"EQ of M: 4.3, On: 08/08/2025 01:45:15 IST, Lat: 31.58 N, Long: 67.19 E, Depth: 10 Km, Location: Afghanistan.\"\nhttps://x.com/NCS_Earthquake/status/1953554978032992586\nShallow earthquakes are generally more dangerous than deep earthquakes. This is because the seismic waves from shallow earthquakes have a shorter distance to travel to the surface, resulting in stronger ground shaking and potentially more damage to structures and greater casualties.\nThe United Nations Office for the Coordination of Humanitarian Affairs (UNOCHA), Afghanistan, noted that the country remains highly vulnerable to natural disasters, including seasonal flooding, landslides and earthquakes.\nThese frequent earthquakes in Afghanistan cause damage to vulnerable communities, which are already grappling with decades of conflict and under-development and have left them with little resilience to cope with multiple simultaneous shocks, UNOCHA noted.\nAfghanistan has a history of powerful earthquakes, and the Hindu Kush Mountain range is a geologically active area where quakes occur every year, according to the Red Cross.\nAfghanistan sits on numerous fault lines between the Indian and the Eurasian tectonic plates, with a fault line also running directly through Herat. (ANI) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.  As per the statement, the earthquake took place at a shallow depth of 10km, making it susceptible to aftershocks.","url":"https://www.latestly.com/agency-news/world-news-earthquake-of-magnitude-4-9-strikes-afghanistan-7062391.html","image":"https://st1.latestly.com/wp-content/uploads/2025/08/ANI-20250816184400.jpg","video":null,"publish_date":"2025-08-17 00:00:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.098},{"id":351705812,"title":"US President Trump proposes Aug. 22 for trilateral summit meeting with Russia, Ukraine","text":"WASHINGTON, August 17. /TASS/. US President Donald Trump expects to hold a trilateral summit meeting with Russia and Ukraine as early as August 22, US-based Axios web portal reported citing its sources.\n\nAccording to the web portal, during a telephone call with Ukraine’s Vladimir Zelensky and European leaders after his meeting with Russian President Vladimir Putin in Alaska on August 15, Trump announced that \"he wants to organize a trilateral summit with Putin and Zelensky as early as next Friday [August 22].\"\n\nThe New York Times reported earlier, citing sources, that following his meeting with Putin, the US leader proposed negotiating a peace deal under which Ukraine would give up the rest of the Donbass region to Russia, including areas not liberated by Russian troops, in a phone call with European leaders. A ceasefire in the rest of Ukraine at present-day battlefronts and security guarantees, both for Kiev and Europe, would be offered in return.\n\nOn August 15, Putin and Trump met at the Elmendorf-Richardson military base in Alaska. Their talks lasted approximately three hours, including a one-on-one conversation in the American leader’s limousine en route to the main negotiation venue, as well as a subsequent small-group discussion involving three participants on either side.\n\nThe Russian delegation included Kremlin Aide Yury Ushakov and Foreign Minister Sergey Lavrov, while the American side was represented by Secretary of State Marco Rubio and Special Presidential Envoy Steve Witkoff. In a statement to the media following the talks, Putin said they mostly focused on resolving the Ukraine conflict.\n\nTrump described his summit with Putin as \"very productive.\" Later, he called Vladimir Zelensky, EU leaders, NATO Secretary General Mark Rutte, and European Commission President Ursula von der Leyen. After the summit and the phone calls, Trump stated that Ukraine and Russia should go straight to agreeing on a final peace deal as he dropped his demand for a ceasefire.\n\nTrump and Zelensky are due to have a meeting in the White House on August 18. The US leader said that if talks with Zelensky are a success, another meeting with Putin will be scheduled.","summary":"According to the web portal, during a telephone call with Vladimir Zelensky and European leaders after his meeting with Russian President Vladimir Putin in Alaska on August 15, US leader announced that \"he wants to organize a trilateral summit with Putin and Zelensky as early as next Friday\"","url":"https://tass.com/world/2003671","image":"https://tass.com/img/blocks/common/tass_logo_share_eng.png","video":null,"publish_date":"2025-08-16 23:50:07","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.04},{"id":351709774,"title":"Mamdani Expands His Campaign Strategy for Upcoming New York City Election","text":"Moderate Democrats have been wary of progressive upstart-turned-party-nominee Zohran Mamdani since before he secured the Democratic nomination for New York City mayor in June.\n\nBut Mamdani, the self-proclaimed Democratic socialist, has made efforts to widen his tent in recent weeks.\n\nOn Monday, he met with business leaders and gave a speech at an African Methodist Church, seeking to appeal to demographics that have been lukewarm, and even outright resistant, toward him.\n\nLast month, he agreed to condemn the phrase “globalize the intifada,” something that angered moderate parts of the New York electorate. And, a day earlier, he said he was open to keeping Jessica Tisch as police commissioner, a move that could upset his far-left base.\n\nPolitical observers say there’s evidence Mamdani’s efforts to consolidate support with a move toward the center are succeeding.\n\n“He’s getting more endorsements slowly. He’s getting more meetings. And people and industries are looking to gear up for a Mamdani administration,” said New-York based Republican strategist Susan Del Percio, who worked for former New York Gov. Andrew Cuomo, an opponent of Mamdani’s, as a special adviser in 2014. “It’s just a recognition of, ‘This is who I’m probably going to be working with in six months.’”\n\n“They’re giving it to Mamdani or they’re not supporting anyone else, which is by default, giving it to Mamdani,” Del Percio added.\n\nA Siena College poll out Tuesday showed Mamdani leading the field of candidates for New York City’s mayorship with 44% of the vote. Cuomo, who is running as an independent, trailed with 25% of the vote, followed by Republican candidate Curtis Sliwa with 12%. Mayor Eric Adams, who is also running as an independent, had 7%.\n\nDespite Mamdani’s hefty lead, Cuomo is still putting up a fight.\n\nLast week, Cuomo went after Mamdani in a viral statement on the social platform X, lambasting his rival for living in a rent-controlled apartment. \n\n“Somewhere last night in New York City, a single mother and her children slept at a homeless shelter because you, assemblyman @ZohranKMamdani, are occupying her rent controlled apartment,” the statement read. “You grew up rich and married an even wealthier woman. You’ve had weddings on 3 continents. You own property in LGTBQIA+ murderous Uganda. You make $142,000 a year plus stipends, and your wife works too, meaning you together likely make well over $200,000.”\n\n“We are in the middle of a historic affordability crisis. Millions of low income New Yorkers need this apartment and an apartment like it. Yet your apartment remains rented to rich people who don’t need it,” Cuomo’s statement continued. “Today, I am calling on you to move out immediately and give your affordable housing back to an unhoused family who need it. Leaders must show moral clarity. Time to move out.”\n\nCuomo’s attacks come as Democratic party leaders, including Senate Minority Leader Chuck Schumer (N.Y.), House Minority Leader Hakeem Jefferies (N.Y.) and New York Gov. Kathy Hochul, have notably withheld endorsements from Mamdani their party’s nominee.\n\nPolitical observers say that up until his victory in June’s Democratic primary, Mamdani’s brand diverged from establishment figures like Schumer, Jefferies and Hochul and was centered on resisting big money interests.\n\nWith the general election in November inching closer, they say he has to open himself up.\n\n“Because it’s New York City, he’ll have to talk to corporate America, and he’ll have to talk to real estate because that is part of the economic foundation of our city,” said Democratic strategist Basil Smikle, who served as executive director of the New York State Democratic Party.\n\n“He’s going to have to find some common ground that gives them the opportunity to say that he’s a fair broker, and he would be able to say that he’s delivering for the voters with and staying true to his main base.”\n\nStrategists say Mamdani is making these efforts both to steer endorsements away from his competitors and to lay the groundwork for operational success as mayor. \n\nAt the same time, some strategists say he will also have to make political inroads with his weakest demographics to secure a victory in November.\n\n“Just by definition, you have to … do addition to win elections, and I’d be surprised if he wasn’t doing that,” Democratic strategist Joel Payne said. “The one part of the electorate that he could do a market improvement with would be working class, particularly African American, voters, who are a more traditional Democratic constituency.”\n\n“The pitch might sound a little different, but the notes are going to be the same,” Payne added. “Those folks care about bottom line economic issues, just like the people that boosted him and his primary campaign.”\n\nSome political observers say Mamdani can get away with his current base because enough voters want new blood and the rest of the electorate remains divided over the three other candidates in this race.\n\n“He’s being helped by a somewhat crowded field with other legitimate candidates,” said Grant Reeher, the director of Syracuse University’s Campbell Public Affairs Institute. “In addition, there’s no question that most voters are dissatisfied with the status quo, and he is definitely a change candidate.”\n\nReeher added that any new traction Mamdani manages to gain “probably boils down to how unpalatable Andrew Cuomo seems to the more mainstream Democrats.”\n\nAnd while Mamdani has begun talking to the more moderate Democratic establishment and is trying to expand his base regardless of whether he needs to strategists say a long and bumpy road awaits the mayoral hopeful.\n\n“He’s not ready for prime time. He’s got to be doing everything he can to get ready for it, and it’s going to be really hard,” Del Percio said. “He will … be a topic for national scrutiny.”\n\n“You’ve never seen a president go after a city and then add that it’s Donald Trump and New York City with an inexperienced unknown,” Del Percio added. “That gives me the chills.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nModerate Democrats have been wary of progressive upstart-turned-party-nominee Zohran Mamdani since before&#8230;\n\n\nThis Post: Mamdani Expands His Campaign Strategy for Upcoming New York City Election first appeared on Internewscast Journal","url":"https://internewscast.com/local-news/mamdani-expands-his-campaign-strategy-for-upcoming-new-york-city-election/","image":"https://internewscast.com/wp-content/uploads/2025/08/rewrite-this-title-Mamdani-moves-to-widen-his-tent-ahead.jpg","video":null,"publish_date":"2025-08-16 23:47:11","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":0.081},{"id":351714146,"title":"West Virginia governor to deploy National Guard troops to Washington","text":"West Virginia Gov. Patrick Morrisey is deploying 300 to 400 National Guard troops to the District of Columbia at the request of the Trump administration, the governor’s office said today.\n\nThe deployment is “a show of commitment to public safety and regional cooperation” and will include providing equipment and specialized training alongside the “approximately 300-400 skilled personnel as directed,” Morrisey’s office said in a statement.\n\nDrew Galang, a spokesperson for Morrisey, said the state’s National Guard received the order to send equipment and personnel to D.C. late on Friday and was working to organize the deployment.\n\nEarlier this week, President Donald Trump said he was deploying hundreds of National Guard troops to Washington and temporarily taking over the city’s police department to curb what he depicted as a crime and homelessness emergency in the nation’s capital.\n\nA White House official said today that more National Guard troops would be called in to Washington to “protect federal assets, create a safe environment for law enforcement officials to carry out their duties when required, and provide a visible presence to deter crime.”\n\nA U.S. official, speaking on the condition of anonymity, said a formal order was expected to go out that would authorize National Guard troops in D.C. to carry firearms.\n\nThe official said this order would affect mostly military police officers with sidearms.\n\nReuters has previously reported that the National Guard troops would have weapons nearby, such as in their vehicles.\n\nThe White House said today that D.C. National Guard members have conducted patrols on foot and in vehicles around the National Mall and Union Station. The White House said the National Guard troops are not making arrests at this time, and that they may be armed.\n\nAccording to U.S. Justice Department data, violent crime in 2024 hit a 30-year low in Washington, technically a self-governing federal district under the jurisdiction of the U.S. Congress.\n\nDistrict of Columbia officials and the Trump administration negotiated a deal on Friday to keep D.C. Mayor Muriel Bowser’s appointed police chief, Pamela Smith, in charge of the police department after D.C. Attorney General Brian Schwalb filed a lawsuit to block the federal takeover of the department.\n\nTrump, a Republican who has suggested he could take similar actions in other Democratic-controlled cities, has sought to expand the powers of the presidency in his second term, inserting himself into the affairs of major banks, law firms and elite universities.\n\nIt is not clear how the administration could deploy National Guard troops elsewhere. A federal judge in San Francisco is expected in the coming weeks to issue a ruling on whether Trump violated the law by deploying National Guard troops to Los Angeles in June without the approval of California Gov. Gavin Newsom.\n\nThe National Guard serves as a militia that answers to the governors of the 50 states except when called into federal service. The D.C. National Guard, however, reports directly to the president.","summary":"West Virginia Gov. Patrick Morrisey is deploying 300 to 400 National Guard troops to the District of Columbia at the request of the Trump administration, the governor&#8217;s office said today.","url":"https://www.staradvertiser.com/2025/08/16/breaking-news/west-virginia-governor-to-deploy-national-guard-troops-to-washington/","image":"https://www.staradvertiser.com/wp-content/uploads/2025/08/web1_2025-08-13T010853Z_176172869_RC206GAZ9YJT_RTRMADP_3_USA-TRUMP-CRIME.jpg","video":null,"publish_date":"2025-08-16 23:47:00","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"us","sentiment":-0.22},{"id":351705600,"title":"Desperate Ukrainians beg the US not to sell them out... as Putin's missiles continue to rain down and Trump goes for a round of golf, a sense of doom descends of Kyiv","text":"Ukranians voiced fears for their country's future last night as Volodymyr Zelensky prepared to meet Donald Trump at the White House, urging Europe not to 'sell' them out.\n\nAmid anger at seeing the red carpet rolled out for Vladimir Putin in Alaska, many citizens spoke of growing concern that tomorrow's talks in Washington could result in catastrophe for Ukraine.\n\nThose fears were heightened further yesterday when Mr Trump said the country should make a deal with Putin to end the war because 'Russia is a very big power, and they're not'. He then left the White House to play a round of golf.\n\nKyiv's allies have welcomed Mr Trump's efforts but vowed to back Ukraine and tighten sanctions on Russia. European leaders have also been invited to attend tomorrow's talks.\n\nThe red-carpet treatment in Alaska on Friday and the lack of any concrete decisions for Ukraine felt like a betrayal for many who have borne enormous suffering since Russia's full-scale invasion.\n\nFor Oleksandr R, 25, a border guard deployed in Serebryansky Forest in the Luhansk region, watching Putin provoked a visceral reaction. \n\nHe said: 'It was sickening to see the man responsible for my father's death – and for the lives of so many comrades on the battlefield, the man who believes bombing children's hospitals is a way to wage war – greeted with handshakes, smiles and a red carpet by the leader of the free world.\n\n'To hear them speak about our land – the soil for which so many of us have bled – as though they were two merchants haggling at a bazaar was hard to stomach.\n\n'We will not sell out, none of us will – from the regular soldier to the top command, I am certain.'\n\nTens of thousands of Ukrainian servicemen have been killed and wounded while thousands of civilians have died in Russian strikes.\n\nA fifth of the country is under occupation, making normal life impossible.\n\nOn Ukrainian social media, doctored images of Putin and Trump walking down a red carpet strewn with dead Ukrainian bodies have been widely shared.\n\nPriest Theodosii Alisov, 29, an abbot of the Orthodox Church of Ukraine, said he was 'terrified' by the prospect of appeasing the man responsible for more than three years of war in his homeland.\n\nHe said: 'Putin the butcher takes joy in slaughtering thousands of innocents to pursue his deranged ambitions.\n\n'And to see him listened to as if he were not spouting madness, as if he were rational and his arguments carried weight – that was terrifying. I can only hope Europe takes a principled stand and does not sell us out.'\n\nAfter urging Ukraine to accept a peace deal with Russia, the US President was yesterday seen waving to the crowd outside the White House as he was driven to Trump National Golf Club in Sterling, Virginia.\n\n Volodymyr Dubovyk, professor of international relations in Odesa, said Mr Zelensky faced a challenging meeting with Mr Trump tomorrow, adding: 'It's very difficult for Zelensky, he is staring at a menu of bad options. \n\n'Trump might well say: 'Okay, Volodymyr, why don't you withdraw? It's the way to peace, to stop the killing of millions and so on.'\n\nBut Halyna, 87, who cannot give her full name out of fear for relatives in her hometown of Mariupol, insisted she backed Mr Trump to secure a deal. \n\nShe said: 'After Trump's talks with Putin, I was once again convinced that right now there is no chance for a just victory. \n\n'But if this is not stopped now, I don't know what will happen. Trump is cunning, but smart. I believe he can force Putin into a deal that benefits us.\n\n'But we also must agree to very, very painful compromises. Otherwise, this will not end well.' \n\nRecalling Mariupol, which she was forced to flee in 2022, she said: 'I've already accepted that before I die I will not see my Mariupol again. \n\n'That's why we must save our youth. We will still have time in the future to take back what's ours. Putin is not forever, and justice always finds its way.'\n\nOlha, who also cannot give her full name for fear of reprisals, said she hoped for peace but feared the occupied territories will be traded away.\n\nShe said: 'The people who remain under occupation, how can they feel? Terrible. My relatives, who are still in the occupied territories, don't understand what is happening. They don't see any concrete actions aimed at liberating them, at returning those territories.'\n\nMeanwhile, the Ukrainian military yesterday said it had pushed Russian forces back by more than a mile on part of the Sumy front in northern Ukraine.\n\nThe country's general staff said on Facebook: 'Ukrainian soldiers continue active combat actions to destroy the enemy and liberate our settlements.'\n\nIt added that fighting was raging near the villages of Oleksiivka and Yunakivka, which lie three miles and four miles from the border. Russian troops last week advanced up to six miles in Ukraine's east.\n\nServicewoman Maria K, 38, said the resolve of Ukraine's armed forces was undiminished: 'We work without days off or holidays. We sleep three, at best four hours a day. We have a war here and we will continue to fight.","summary":"Amid anger at seeing the red carpet rolled out for Vladimir Putin in Alaska , many citizens spoke of growing concern that tomorrow's talks in Washington could result in catastrophe for Ukraine.","url":"https://www.dailymail.co.uk/news/article-15007297/Desperate-Ukrainians-beg-Putin-missiles-US-Trump-golf.html","image":"https://i.dailymail.co.uk/1s/2025/08/16/23/101280153-0-Volodymyr_Dubovyk_professor_of_international_relations_in_Odesa_-a-21_1755384959736.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/16/2144776124397601344/1024x576_MP4_2144776124397601344.mp4","publish_date":"2025-08-16 23:46:44","author":"Andy Jehring,Editor","authors":["Andy Jehring","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.302},{"id":351715240,"title":"Hurricane Erin intensifies offshore, lashes Caribbean with rain","text":"Hurricane Erin has reached the highest level on the Saffir-Simpson scale just over 24 hours after becoming a Category 1 hurricane. (NOAA/AP pic)\nWASHINGTON: Hurricane Erin rapidly strengthened offshore to a \"catastrophic\" Category 5 storm on Saturday, as rain lashed Caribbean islands and weather officials warned of possible flash floods and landslides.\nThe first hurricane of what is expected to be a particularly intense Atlantic season, Erin is expected to drench Caribbean islands with rain and strong winds but not make landfall.\nThe US national hurricane center (NHC) said in its latest report the storm's maximum sustained winds had increased to 160 miles (255km) per hour.\nIt was located about 135 miles (215km) northwest of Anguilla in the northern Leeward Islands, an area that includes the US and British Virgin Islands.\nA flash flood warning was issued for Saint Thomas and Saint John in the US Virgin Islands as outer rain bands from Erin swept across, according to the US national weather service.\nTropical storm watches were in effect for St Martin, St Barthelemy, Sint Maarten and the Turks and Caicos Islands.\n\"Erin is now a catastrophic Category 5 hurricane,\" the NHC announced earlier Saturday, denoting highly dangerous storms with sustained wind speeds above 157 mph.\nThe storm reached the highest level on the Saffir-Simpson scale just over 24 hours after becoming a Category 1 hurricane, a rapid intensification that scientists say has become more common due to global warming.\nThe hurricane's centre is expected to move over the weekend just north of the northern Leeward Islands, the Virgin Islands and Puerto Rico.\nIt is then forecast to pass east of the Turks and Caicos Islands and the southeastern Bahamas on Sunday night before weakening.\nThe storm could drench the islands with as much as six inches (15cm) of rain in isolated areas, the NHC said.\n\"Continued rapid strengthening is expected today, followed by fluctuations in intensity through the weekend,\" the agency said in an earlier report.\nIt also warned of \"locally considerable flash and urban flooding, along with landslides or mudslides.\"\nClimate hazard \nSwells generated by Erin will affect portions of the northern Leeward Islands, Virgin Islands, Puerto Rico, Hispaniola and the Turks and Caicos Islands through the weekend.\nThose swells will spread to the Bahamas, Bermuda and the US East Coast early next week, creating \"life-threatening surf and rip currents\", the NHC said.\nThe hurricane is expected to turn northwest on Saturday night, then turn northward early next week. It is expected to weaken from Monday.\nWhile meteorologists have expressed confidence that Erin will remain well off the US coastline, they said the storm could still cause dangerous waves and erosion in places such as North Carolina.\nThe Atlantic hurricane season, which runs from June until late November, is expected to be more intense than normal, US meteorologists predict.\nSeveral powerful storms wreaked havoc in the region last year, including Hurricane Helene, which killed more than 200 people in the southeastern United States.\nThe national oceanic and atmospheric administration – which operates the NHC – has been subject to budget cuts and layoffs as part of US President Donald Trump's plans to greatly reduce the size of the federal bureaucracy, leading to fears of lapses in storm forecasting.\nHuman-driven climate change – namely, rising sea temperatures caused by the burning of fossil fuels – has increased both the possibility of the development of more intense storms and their more rapid intensification, scientists say.","summary":"NHC figures show the storm’s maximum sustained winds have climbed to 160 miles (255km) per hour.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/17/hurricane-erin-intensifies-offshore-lashes-caribbean-with-rain","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/08/9a550840-hurricane-erin-17082025.webp","video":null,"publish_date":"2025-08-16 23:37:02","author":"AFP","authors":["AFP"],"language":"en","category":"environment","source_country":"my","sentiment":-0.166},{"id":351708212,"title":"Laura Loomer takes victory lap after State Department halts visitor visas for Gaza","text":"Far-right activist Laura Loomer is taking a victory lap for a new State Department policy decision: halting all visitor visas from Gaza. \n\nThe State Department announced Saturday it was stopping the visas for people from Gaza, one day after Loomer posted a series of videos capturing alleged flights bringing people from the territory to the United States. She questioned why they were allowed into the country, and demanded that whoever approved their visas be fired.\n\n“All visitor visas for individuals from Gaza are being stopped while we conduct a full and thorough review of the process and procedures used to issue a small number of temporary medical-humanitarian visas in recent days,” the State Department said in a statement Saturday.\n\nIn a social media post, the conservative firebrand celebrated the department’s decision as “fantastic news,” noting that it was made “following the release of my reports yesterday exposing flights of GAZANS arriving at airports all across the US.”\n\nShe added: “Hopefully all GAZANS will be added to President Trump’s travel ban. There are doctors in other countries. The US is not the world’s hospital!”\n\nThe Independent has asked the State Department whether Loomer had any influence on the decision.\n\nThroughout the day Friday, Loomer posted videos allegedly showing people from Gaza arriving at airports across the U.S., including Seattle, St. Louis, San Francisco, and Houston, in the past few weeks. The videos were originally posted by HEAL Palestine, a nonprofit dedicated to delivering urgent and long-term support to Palestinian children and families.\n\nThe videos, posted by HEAL Palestine’s Instagram account, show children coming to the U.S. for medical treatment. More than 60,000 Palestinians have been killed in Israel’s war in Gaza since Hamas’ attack on October 7, 2023, according to Gaza’s Health Ministry last month.\n\nVisitor visas are nonimmigrant visas for persons who want to enter the U.S. temporarily. The B-1 visa covers business, and the B-2 visa is for tourism which includes medical treatment, according to the State Department.\n\nIn one heart-wrenching example, a 14-year-old girl, who arrived in San Francisco this month, was injured when a school that her displaced family was using as shelter was bombed. “She sustained second-and third-degree burns across her body and face, shrapnel wounds to her head and leg, and is still living with embedded fragments,” the nonprofit wrote in an August 6 post. The child also suffers from malnutrition, weighing just 20 kilograms, or 44 pounds.\n\nThe Independent has asked the nonprofit for comment on Loomer’s posts.\n\n“Who from the State Department is assisting ‘Heal Palestine’?” Loomer wrote in a Friday social media post. “Why are any Islamic invaders coming into the U.S. under the Trump admin?”\n\nShe continued: “This is a national security threat. We didn’t vote for more Islamic immigration into the United States. Who signed off on these visas? They should be fired.”\n\nLoomer’s posts picked up some traction, including from GOP members of Congress.\n\nTexas Republican Rep. Chip Roy remarked Friday: “Deeply concerned about the incoming flights - including to Texas - allegedly filled with folks from Gaza as reported by @LauraLoomer. Inquiring.”\n\nFlorida Republican Congressman Randy Fine similarly said he was “troubled” by Loomer’s report. “If true, this is absolutely unacceptable. My office will be working with the relevant authorities to confirm the truth, understand how it happened, and seek immediate expulsion,” he wrote on X Friday.\n\nAfter the State Department’s announcement Saturday, Fine gave Loomer a pat on the back. “Massive credit needs to be given to @LauraLoomer for uncovering this and making me and other officials aware. Well done, Laura,” he wrote on X.\n\nThe far-right activist seems to have some sway within the Trump administration as a pattern seems to have emerged. Not long after Loomer makes an online complaint, a change seems to happen within the administration.\n\nLast month, Loomer boasted after Maurene Comey, who prosecuted Jeffrey Epstein’s former girlfriend and sex offender, Ghislaine Maxwell, and music mogul Sean “Diddy” Combs, was fired from the Justice Department. \n\nAfter she was terminated, Loomer took a victory lap, writing on X: “This comes 2 months after my pressure campaign on Pam Blondi [sic] to fire Comey’s daughter and Comey’s son-in-law from the DOJ.”\n\nIn May, Loomer urged President Donald Trump to pick a new nominee for surgeon general after she called his pick, Janette Nesheiwat, “not ideologically aligned with Donald Trump or his admin’s health initiatives.” The president later withdrew Nesheiwat’s nomination.\n\nIn April, Loomer met with Trump, urging him to fire members of the National Security Council who had been disloyal to him. Not long after, the president terminated several NSC staff.\n\nIt’s not clear how much Loomer’s demands played a role in the decisions. Asked how many staffing decisions she’s had a hand in, Loomer told the New York Times last month: “I don’t even know…I really enjoy and take great pleasure in humiliating people who suck at their job.”","summary":"‘There are doctors in other countries. The US is not the world’s hospital!’ the far-right activist said","url":"https://www.independent.co.uk/news/world/americas/us-politics/laura-loomer-gaza-visas-state-department-b2808984.html","image":"https://static.independent.co.uk/2025/08/16/20/48/Laura-Loomer-is-taking-credit-for-the-State-Departments-decision-to-halt-visitor-visas-for-people-fr.jpeg?width=1200","video":"https://cdn.jwplayer.com/videos/pbgxCa61-OhrQWqOm.mp4","publish_date":"2025-08-16 23:36:18","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","category":"politics","source_country":"gb","sentiment":0.038},{"id":351707716,"title":"W.V. deploys National Guard to capital, which maintains police control","text":"Aug. 16 (UPI) -- The Trump administration won't take control of the Washington police force, but more military personnel are being deployed to make the nation's capital safer for residents, workers and visitors.\n\nWest Virginia Gov. Patrick Morrisey on Saturday announced he is deploying between 300 and 400 of the state's National Guard members to Washington to help \"restore cleanliness and safety.\"\n\n\"West Virginia is proud to stand with President [Donald] Trump in his effort to restore pride and beauty to our nation's capital,\" Morrisey said.\n\nHe called the deployment a \"show of cooperation to public safety and regional cooperation\" that \"aligns with our values of service and dedication to our communities.\"\n\nThe W.V. National Guard will remain under the command of Adj. Gen. Maj. Jim Seward while deployed in the nation's capital.\n\nMorrisey's deployment order comes after Justice Department and Washington police officials on Friday agreed the capital would maintain control of its police force of 3,200 officers.\n\nU.S. Columbia District Judge Ana Reyes, during an emergency hearing on Friday, encouraged attorneys for the Justice Department and District of Columbia to negotiate a short-term agreement to temporarily stop the Drug Enforcement Administration from taking control of the city's police force.\n\nThe resulting compromise agreement will continue while Reyes considers arguments made by the Justice Department and capital attorneys, who filed the federal case on Friday.\n\nReyes suggested Attorney General Pam Bondi and the Trump administration likely exceeded the authority that is provided by the 1973 Home Rule Act, which made Washington a self-governed federal district.\n\nPresident Joe Biden appointed Reyes to the court in 2023.\n\n\"A hostile takeover of our police force is not going to happen,\" District of Columbia Attorney General Brian Schwalb said during a Friday news conference.\n\nCapital Police Chief Pamela Smith \"remains in control of the police department under the supervision of our mayor,\" Schwalb said.\n\nBondi said the Justice Department will continue working with local officials to address concerns of criminal activity in Washington.\n\n\"We remain committed to working with Mayor [Muriel] Bowser, who is dedicated to ensuring the safety of residents, workers and visitors in Washington,\" Bondi said.\n\nBondi on Thursday said an \"emergency police commissioner\" would approve the city's Metropolitan Police Department policies and ensure the police force helps with federal law enforcement make immigration-related arrests, The Hill reported.\n\nBondi had appointed DEA Administrator Terrence Cole to oversee the Washington MPD, but his appointment is on hold and might not happen.\n\nThe Trump administration's effort to police Washington's streets and control its police force caused concern among many of its younger residents.\n\n\"I understand public safety is important, but they look more like they're bullying us than being our community guardians,\" a 16-year-old named Ali told NPR. \"It's hard not to feel intimidated.\"\n\nAnother 16-year-old named Makayla blamed a relatively small group of juveniles for causing trouble that triggered the federal intervention in the capital.\n\n\"As a teenager, you want to go out and enjoy yourself,\" she told NPR. \"But all y'all want to do is fight.\"\n\nTrump cited juvenile crime as a tipping point in his decision to have his administration intervene in capital policing to make it safer for all for residents, workers and visitors.","summary":"The Trump administration won't take control of the Washington police force, but more military personnel are being deployed there to ensure safety for all.","url":"https://www.upi.com/Top_News/US/2025/08/16/washington-police/9331755385819/","image":"https://cdnph.upi.com/sv/ph/og/upi/9331755385819/2025/1/e8cbd28418e238dec7eef5460e87b603/v1.5/WV-deploys-National-Guard-to-capital-which-maintains-police-control.jpg","video":null,"publish_date":"2025-08-16 23:33:53","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","category":"politics","source_country":"us","sentiment":-0.062},{"id":351704768,"title":"Australians are choosing to travel to Asia over the US. It’s not because of Trump","text":"Australian Travel Industry Association chief executive Dean Long said that while US President Donald Trump had some dampening impact on Australian business travel to the US, there was little effect on visits for leisure.\n\n“It’s not having as big an impact as we originally anticipated,” he said, noting instances of Australians being stopped at the US border were consistent with the pre-Trump era.\n\n“There’s definitely been some loss of business events, but in the leisure market, people still want to go do things they can only do in the US.”\n\nLong said the more popular Asian destinations were those where costs had not risen dramatically over the past few years, as well as those that had experienced favourable exchange rate movements.","summary":"Japan, China and Vietnam are fast becoming the top travel destinations, while visits to the US remain below pre-pandemic levels.","url":"https://www.smh.com.au/politics/federal/australians-are-choosing-to-travel-to-asia-over-the-us-it-s-not-because-of-trump-20250815-p5mnb7.html","image":"https://static.ffx.io/images/$zoom_0.3064%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/9bcdf7309dd74ce7e08473479f3d00f046f70784","video":null,"publish_date":"2025-08-16 23:30:00","author":"Millie Muroi","authors":["Millie Muroi"],"language":"en","category":"politics","source_country":"au","sentiment":0.133},{"id":351713394,"title":"A quick Russia-Ukraine peace deal may be ‘worth more than a ceasefire’: German Chancellor Merz","text":"Berlin, Aug 16 (SocialNews.XYZ) A quick peace deal between Russia and Ukraine may be \"worth more than a ceasefire\", German Chancellor Friedrich Merz said.\n\nMerz said in an interview with German broadcaster ZDF on Saturday that after US President Donald Trump meets with Ukrainian President Volodymyr Zelensky on Monday, a trilateral meeting with Russian President Vladimir Putin should be held \"as soon as possible\" to reach a peace agreement.\n\n\"If that works out, it's worth more than a ceasefire that could possibly last for weeks without further progress in political and diplomatic efforts,\" he added.\n\nMerz said that it was \"good news\" that there were no territorial negotiations between Putin and Trump without Ukraine and the rest of Europe.\n\nEurope will play a role in Trump's talks with Zelensky on Monday, he said.\n\nA White House official told CNN that multiple European leaders have been invited to the talks.\n\nHowever, \"for the time being\" Trump will still play the decisive role in the conflict, Merz said.\n\n\"The American President, who then also has the power, both militarily and via appropriate sanctions and tariffs, to ensure that Russia moves more than it is currently doing,\" he added.\n\nThe German leader also said that he is pleased that the US is ready to participate in security guarantees for Ukraine.\n\n\"Now there are security guarantees on the table,\" he said, \"And the good news is that America is prepared to participate in such security guarantees and is not leaving it to the Europeans alone.\"\n\nThe German government and other European governments had insisted, ahead of the meeting between Trump and Putin in Alaska on Friday, that an immediate ceasefire must mark the beginning of a peace process in Ukraine.\n\nTrump had also supported this position but abandoned it, as he made clear after the summit.\n\nThe Russian side was evidently not prepared for a ceasefire, Merz said.\n\nHe criticized Russia for continuing to attack Ukraine during the talks between Trump and Putin.\n\n\"I find that particularly disrespectful,\" he added.\n\nTrump had briefed the most important European heads of state and government on Saturday morning about his conversation with Putin.\n\nAccording to Merz, the discussions also touched on possible territorial concessions to Russia.\n\nRussia appears willing to conduct negotiations along the current front lines rather than administrative borders, Merz told the broadcaster.\n\n\"That is a significant difference,\" the German Chancellor said.\n\nUntil now, Russia has been claiming territories it does not even militarily occupy.\n\nIn his talks with Putin, Trump did not question a single one of the five core points previously established by the Europeans and Ukrainian President Volodymyr Zelensky, Merz said.\n\n\"That is a good result,\" he added.\n\nThis means Trump and Putin did not discuss territorial issues over the heads of Ukraine and the Europeans.\n\nSource: IANS","summary":"Berlin, Aug 16 (SocialNews.XYZ) A quick peace deal between Russia and Ukraine may be \"worth more than a ceasefire\", German Chancellor Friedrich Merz said. Merz said in an interview with German broadcaster ZDF on Saturday...\n\n\nThe post A quick Russia-Ukraine peace deal may be &#8216;worth more than a ceasefire&#8217;: German Chancellor Merz appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/08/16/a-quick-russia-ukraine-peace-deal-may-be-worth-more-than-a-ceasefire-german-chancellor-merz/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/08/17/202508173483292.jpg?fit=653%2C486&quality=80&zoom=1&ssl=1?v=1755391206","video":null,"publish_date":"2025-08-16 23:27:34","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":-0.063},{"id":351706422,"title":"Putin wins Ukraine concessions in Alaska but did not get all he wanted","text":"MOSCOW - In a few short hours in Alaska, Vladimir Putin managed to convince Donald Trump that a Ukraine ceasefire was not the way to go, stave off U.S. sanctions, and spectacularly shatter years of Western attempts to isolate the Russian president.Outside Russia, Putin was widely hailed as the victor of the Alaska summit while at home, Russian state media cast the U.S. president as a prudent statesman, even as critics in the West accused him of being out of his depth.Russian state media made much of the fact that Putin was afforded a military fly-over, that Trump waited for him on the red carpet, and then let the Russian president ride with him in the back of the 'Beast,' the U.S. presidential limousine.","summary":"U.S. President Donald Trump did not give Putin the economic reset he wanted as the Russian economy shows signs of strain amid the grinding war and tough sanctions.","url":"https://www.japantimes.co.jp/news/2025/08/17/world/politics/putin-trump-meeting-analysis/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/08/17/488004.JPG?v=3.1","video":null,"publish_date":"2025-08-16 23:27:00","author":"Andrew Osborn,Web Master","authors":["Andrew Osborn","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.136},{"id":351705324,"title":"Russia’s Lavrov discusses Alaska summit’s outcome with Turkish, Hungarian counterparts","text":"Russia’s foreign ministry said Sergei Lavrov and his Turkish and Hungarian counterparts discussed the results of the Russia–US meeting in Alaska. (AP pic)\nMOSCOW: Russian foreign minister Sergei Lavrov held calls on Saturday with his Turkish and Hungarian counterparts, the Russian foreign ministry said, hours after a summit between the US and Russian presidents yielded no deal on ending the war in Ukraine.\nPresident Donald Trump, who hosted President Vladimir Putin in Alaska on Friday for bilateral talks aimed at ending the war that Russia launched with a full-scale invasion on Ukraine in early 2022, said that Kyiv should make a deal with Moscow because \"Russia is a very big power, and they're not.\"\nThe phone call between Lavrov and Turkish foreign minister Hakan Fidan took place at Turkey's initiative, the Russian foreign ministry said in a statement on its website.\n\"The foreign ministers exchanged views on the outcomes of the high-level Russia–US meeting held in Alaska on Aug 15,\" the ministry said in its short statement.\nTurkey has tried to keep diplomatic channels open to both sides during the war, acting as a Nato member, a partner for both Russia and Ukraine, and a potential mediator.\nLavrov also held a call with Hungarian foreign minister Peter Szijjarto, the Russian foreign ministry said, in which \"the parties discussed issues related to the Ukrainian crisis in the context of the outcomes of the Russia–US summit.\"\nHungary has maintained close ties with Russia throughout the war, often opposing EU sanctions and continuing energy cooperation with Moscow, and drawing criticism from Western allies of Kyiv.\nHungarian Prime Minister Viktor Orban said on Saturday after the Putin-Trump meeting that \"the world is a safer place than it was yesterday,\" while other European leaders reiterated in their joint statement that \"it will be up to Ukraine to make decisions on its territory.\"","summary":"Turkey is pursuing open diplomacy with both Moscow and Kyiv, while Hungary is keeping close ties with Russia.","url":"https://www.freemalaysiatoday.com/category/world/2025/08/17/russias-lavrov-discusses-alaska-summits-outcome-with-turkish-hungarian-counterparts","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2024/12/23bfbcbd-ap24208261077289_1600x1000.webp","video":null,"publish_date":"2025-08-16 23:24:14","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"my","sentiment":0.325},{"id":351707596,"title":"In the Kremlin's school of diplomacy, negotiations are there to divide and weaken the enemy, writes military expert BOB SEELY","text":"As he flies back to Moscow, Vladimir Putin will be quietly beaming. \n\nWhile the Alaska summit may have achieved little of substance, the Russian dictator accomplished his most important immediate aim, to break out of his diplomatic isolation and regain psychological influence over US President Donald Trump.\n\nTrump wore a broad smile as if he was hosting an old friend, not a tyrant whose supporters regularly threaten nuclear armageddon against the West and who clearly sees the US – and the UK – as Russia’s historic enemies.\n\nWith further sanctions looming, Putin needed to re-engage with Trump, and it appears he’s done so successfully. \n\nWhile little seems to have been agreed between the two leaders, Putin walks away with his military pounding Ukraine, and the threat of sanctions on ice.\n\nThe Russian president’s long-term aim is to force a humiliating peace on Kyiv, so that Ukraine’s social cohesion fractures. \n\nPutin will then use non-military tactics to weaken the country further while he prepares for a new round of conflict against Ukraine or, potentially, the Baltic republics and the West.\n\n In the Kremlin’s school of diplomacy, ceasefires and negotiations are devices to psychologically weaken and divide the enemy – not a way to peace.\n\nChina, meanwhile, continues to build up an almost colonial relationship over Russia, buying its energy at discount – and benefiting enormously from the war’s continuation.\n\nPresident Volodymyr Zelensky cannot accept a peace that breaks Ukraine’s morale and leaves it unable to defend itself but he must not give Trump the opportunity to walk away, or worse, lift sanctions unilaterally. \n\nThe nations of Europe are, in the short term, big losers.\n\nPoorly led, divided and unable to defend themselves let alone Ukraine, they have been all but sidelined. \n\nAgain, this suits Putin’s narrative. But perhaps history will show the biggest loser is Donald Trump. \n\nHis desire for peace is genuine, but he is in danger of being used by Putin to fulfil Russia’s agenda in Ukraine, and in so doing, undermining the cohesion and strength of the West and democracy’s undoubted moral power. \n\nToday, the ‘coalition of the willing’ – Germany, France and the UK – will meet by phone to discuss potential security guarantees should a deal be struck, reminding the US, perhaps pitifully, of its importance to any future negotiations. \n\nThen, tomorrow, Trump will meet Zelensky in Washington to outline a ‘peace’ plan that will almost certainly force major land concessions from the Ukrainians, something that Zelensky has said his country cannot do and which threatens to divide his nation.\n\nHowever, Moscow is under greater pressure than before – according to some economic forecasts, \n\nRussia is running out of money. There may be a logic for a deal now that was absent before.\n\nIt’s likely that Putin’s demands are too great for Ukraine to stomach.\n\nThe world will find out tomorrow if there is a path to a deal, or if the conflict, the most bloody in Europe since the Second World War, will trundle on, swallowing thousands more lives as it goes.\n\nDr Bob Seely MBE is the author of The New Total War.","summary":"Trump wore a broad smile as if he was hosting an old friend, not a tyrant whose supporters regularly threaten nuclear armageddon against the West.","url":"https://www.dailymail.co.uk/debate/article-15007351/Kremlins-school-diplomacy-negotiations-US-Ukraine.html","image":"https://i.dailymail.co.uk/1s/2025/08/17/00/101290207-0-image-a-65_1755386185705.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/16/2144776124397601344/1024x576_MP4_2144776124397601344.mp4","publish_date":"2025-08-16 23:19:34","author":"Editor,Rob Seely Military Expert","authors":["Editor","Rob Seely Military Expert"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.066},{"id":351713392,"title":"Zelensky’s Chief of Staff thanks Melania Trump for writing to Putin about protecting Ukrainian children","text":"Kyiv, Aug 17 (SocialNews.XYZ) Andriy Yermak, the Chief of Staff for Ukrainian President Volodymyr Zelensky, has thanked the US' First Lady Melania Trump for calling on Russia's President Vladimir Putin to save deported Ukrainian children.\n\n\"The return of Ukrainian children abducted by Russia should be a key condition for any peace agreement,\" Yermak wrote in a post on social media on Saturday.\n\nYermak said that he was \"grateful\" to Melania Trump for her letter to Russian President Putin, in which she called on the leader to \"singlehandedly restore\" children's \"melodic laughter\".\n\nMore than 35,000 Ukrainian children have been abducted during the war and taken to over 100 locations in Russia and Russian-occupied territory, according to the Ukraine Conflict Observatory, an effort led by Yale's Humanitarian Research Lab.\n\nMelania Trump had penned a letter to Putin, which was hand-delivered by US President Donald Trump in Anchorage, Alaska, on Friday, calling on him to protect children and \"nurture the next generation's hope\" as his war on Ukraine continues.\n\n\"We must strive to paint a dignity-filled world for all -- so that every soul may wake to peace, and so that the future itself is perfectly guarded. A simple yet profound concept, Mr. Putin, as I am sure you agree, is that each generation's descendants begin their lives with a purity -- an innocence which stands above geography, government, and ideology,\" the First Lady wrote.\n\nMelania Trump said Putin \"can singlehandedly restore children's \"melodic laughter\", adding that \"in protecting the innocence of these children, you will do more than serve Russia alone — you serve humanity itself. Such a bold idea transcends all human division, and you, Mr. Putin, are fit to implement this vision with a stroke of the pen today. It is time.\"\n\n\"Every child shares the same quiet dreams in their heart, whether born randomly into a nation's rustic countryside or a magnificent city-centre. They dream of love, possibility, and safety from danger,\" she wrote in a letter, dated August 15, to the Russian leader.\n\n\"As parents, it is our duty to nurture the next generation's hope. As leaders, the responsibility to sustain our children extends beyond the comfort of a few,\" the First Lady said in the one-page letter.\n\nPresident Trump delivered the letter to Putin ahead of their high-stakes summit in Alaska, a White House official told the media on Saturday.\n\nMelania Trump was not at Joint Base Elmendorf-Richardson near Anchorage, where the nearly three-hour-long huddle between US and Russian officials took place.\n\nSince the start of the war in late February 2022, Russia has abducted thousands of Ukrainian children, forcibly transferring them to Russia, attempting to assign them Russian citizenship and have them attend schools in Russia.\n\nThe United Nations criticised Russia in March for the suffering the children in Ukraine have endured because of the war, which has been ongoing for about three-and-a-half years.\n\nRussia has previously argued that it has been shielding kids from the conflict areas.\n\nMore than 19,000 children were deported from Ukraine to Russia, adding that the actual number could be far higher, according to a Ukrainian government tracker.\n\nZelensky told reporters on Tuesday, ahead of the Trump-Putin summit, that Moscow has been stonewalling talks on the return of Ukrainian children.\n\nUkraine's leader said that while occasional transfers have taken place, with the assistance of other nations, Kyiv has not been able to strike a wide-ranging agreement with Russia on the matter.\n\n\"That is why we wanted to get certain matters settled in this trilateral track: ceasefire, an all-for-all exchange, and the return of children,\" Zelensky said.\n\n\"This is something everyone benefits from: President Trump benefits, the Russians lose nothing, the Ukrainians lose nothing. It's a fair compromise.\"\n\nSource: IANS","summary":"Kyiv, Aug 17 (SocialNews.XYZ) Andriy Yermak, the Chief of Staff for Ukrainian President Volodymyr Zelensky, has thanked the US' First Lady Melania Trump for calling on Russia's President Vladimir Putin to save deported Ukrainian children....\n\n\nThe post Zelensky&#8217;s Chief of Staff thanks Melania Trump for writing to Putin about protecting Ukrainian children appeared first on Social News XYZ.","url":"https://www.socialnews.xyz/2025/08/16/zelenskys-chief-of-staff-thanks-melania-trump-for-writing-to-putin-about-protecting-ukrainian-children/","image":"https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2025/08/17/202508173483291.jpg?fit=664%2C411&quality=80&zoom=1&ssl=1?v=1755390606","video":null,"publish_date":"2025-08-16 23:15:18","author":"Gopi","authors":["Gopi"],"language":"en","category":"politics","source_country":"in","sentiment":0.186},{"id":351703920,"title":"ESPN will ‘no longer proceed’ with Spike Lee’s Colin Kaepernick docuseries: ‘It’s not coming out’","text":"Director Spike Lee’s multi-part documentary series for ESPN Films about former NFL quarterback Colin Kaepernick, who sparked a national debate when he protested racial injustice nearly a decade ago, will not be released, the filmmaker and ESPN said.\n\n“ESPN, Colin Kaepernick and Spike Lee have collectively decided to no longer proceed with this project as a result of certain creative differences,” ESPN said in a statement to Reuters on Saturday.\n\n“Despite not reaching finality, we appreciate all the hard work and collaboration that went into this film.”\n\nLee told Reuters on Friday that the series was not going to be released.\n\n“It’s not coming out. That’s all I can say,” Lee said on the red carpet ahead of the Harold and Carole Pump Foundation dinner, a fundraiser for cancer research and treatment, in Beverly Hills, California.\n\nAsked why, the Oscar-winning director declined to elaborate, citing a nondisclosure agreement.\n\n“I can’t. I signed a nondisclosure. I can’t talk about it.”\n\nKaepernick played for the San Francisco 49ers from 2011 to 2016. He ignited a national debate in 2016 when he knelt during the U.S. national anthem to protest systemic racism and police brutality.\n\nThe 37-year-old athlete has not played in the NFL since that season. Many experts believed his political activism, which triggered a movement that drew the ire of U.S. President Donald Trump, was the key reason teams were wary of signing him.\n\nHe later filed a collusion grievance against team owners, which was settled with the league in 2019.\n\nA representative for Kaepernick said the player had no comment about the docuseries on Saturday.\n\nProduction on the series began in 2022, with Walt Disney-owned ESPN touting it as a “full, first-person account” of Kaepernick’s journey that would feature extensive interviews with the player.\n\nIn September, Puck News reported the project faced delays amid disagreements between Kaepernick and Lee over the direction of the film, and that ESPN Chairman Jimmy Pitaro was open to allowing the filmmakers to shop it elsewhere.","summary":"Lee told Reuters on Friday that the series was not going to be released.","url":"https://nypost.com/2025/08/16/sports/espn-wont-release-spike-lees-colin-kaepernick-docuseries/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-k93rsdv2a-1755383775431.jpg?quality=75&strip=all&1755369396&w=1200","video":null,"publish_date":"2025-08-16 23:12:37","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.14},{"id":351711786,"title":"Marlow: Investigation Season—Lawfare Judge Boasberg's Russiagate Connection Revealed","text":"United States District Court for the District of Columbia Chief Judge James Boasberg is well known to this audience for ordering illegal aliens to remain in the United States despite the Trump administrations clearly lawful effort to deport them under the Aliens Enemies Act.\n\nYet, he also has an important connection to the Russiagate hoax that reveals the scope of the lawfare superstructure that is trying to dismantle MAGA, which I document in my book Breaking the Law.\n\nJust like the rest of the Russiagate conspirators, Boasberg ought to be investigated for it.\n\nIn March of 2025, after the ACLU and the Soros-linked legal advocacy group Democracy Forward filed suits on behalf of five Venezuelans destined for deportation, Boasberg ordered “any plane containing these folks that is going to take off or is in the air needs to be returned to the United States.”\n\nBoasberg accused Trump of “possible defiance” of the court order, inflaming national debate. Trump did nothing of the sort. The illegal aliens were long out of the country by the time Boasberg gave the order, and Boasberg has no jurisdiction in El Salvador.\n\nBoasberg was waging an attack on the democratically elected president of the United States to try to preserve non-existent rights for illegal alien gang members, treating Donald Trump as the real criminal.\n\nThis should not be a surprise considering that Boasberg, who was appointed by Obama in 2010, is known for left-wing rulings and bias against President Trump. This includes his connection to the Russia collusion hoax.\n\nWhile presiding over the Foreign Intelligence Surveillance Act (FISA) Court, Judge Boasberg ruled that former FBI attorney Kevin Clinesmith, one of the top conspirators in the Russiagate hoax, shouldn’t get prison time. Clinesmith admitted he tampered with evidence to say that Trump campaign adviser Carter Page was “not a source” for the Central Intelligence Agency when Page very much had been. Clinesmith’s forgery extended the FBI’s unlawful and unethical surveillance of the Trump campaign. Boasberg’s decision to let Clinesmith skate is lawfare and Trump Derangement Syndrome at the same time.\n\nAn investigation into this seemingly impossible ruling could reveal important details about how the conspiracy to push the bogus Russia collusion hoax on the public bled into our legal apparatus.\n\nThe Clinesmith ruling is part of Boasberg’s pattern of judicial activism. For example, he had ruled for the release of migrants from detention facilities in Trump’s first term; he approved the use of warrantless surveillance against American citizens despite evidence of improper data collection; and he ordered the Trump administration to empty the Dakota Access Pipeline pending an environmental review, among other rulings that favored Democrat causes.\n\nHis politicking has persisted into the second Trump administration. Recently, the Federalist obtained a memo revealing Boasberg’s predisposition against Trump. Boasberg advanced, without evidence, that Trump cold create a constitutional crisis.\n\nIronically, it’s “President Boasberg” who is the real threat in this regard.\n\nBoasberg took on four “Trump cases” in the early weeks of the second Trump administration, blocking and stalling the president’s first wave of executive actions. One such case was a high-profile lawsuit alleging that Defense Secretary Pete Hegseth, Secretary of State Marco Rubio, National Security Advisor Michael Waltz, and others violated the Federal Records Act by using the encrypted messaging app Signal to discuss military strikes against Houthi terrorists.\n\nJudge Boasberg, who is blatantly predisposed to ruling against the president of the United States, has had an outsized amount of “Trump cases” assigned to him.\n\nThis reveals that there is not equal justice under the law in America at this time.\n\nThe Russiagate and lawfare investigations have begun, and Boasberg is clearly a party to both injustices against President Trump. It is time to hold him to account.\n\nThis article was adapted from portions of Breaking the Law.\n\nBreaking the Law: Exposing the Weaponization of America’s Legal System Against Donald Trump, which has been hailed by President Trump as a “must read” book, is available in hardcover, eReader format, and as an audiobook read by the author himself.\n\nAlex Marlow is the editor-in-chief of Breitbart News, a three-time New York Times bestselling author, and the host of “The Alex Marlow Show” podcast produced weekdays by Breitbart News and Salem Podcast Network. You can subscribe to the podcast on YouTube, Rumble, Apple Podcasts, and Spotify. You can follow Alex on Facebook, Instagram, and X at @AlexMarlow.","summary":"Chief Judge James Boasberg's connection to the Russiagate hoax reveals the scope of the lawfare superstructure that is targeting President Donald Trump and trying to dismantle his MAGA movement.\n\n\nThe post Marlow: Investigation Season—Lawfare Judge Boasberg&#8217;s Russiagate Connection Revealed appeared first on Breitbart.","url":"https://www.breitbart.com/politics/2025/08/16/marlow-investigation-season-lawfare-judge-boasbergs-russiagate-connection-revealed/","image":"https://media.breitbart.com/media/2025/08/James-Boasberg-getty-640x335.png","video":null,"publish_date":"2025-08-16 23:12:07","author":"Alexander Marlow,President Trump","authors":["Alexander Marlow","President Trump"],"language":"en","category":"politics","source_country":"US","sentiment":-0.194},{"id":351710904,"title":"Zelenskyy prepares for fresh White House visit – as Putin issues first comments after summit | World News","text":"Volodymyr Zelenskyy has said he is preparing for his meeting with Donald Trump – as Vladimir Putin issued his first comments following the US-Russia talks on the war in Ukraine.\n\nThe Ukrainian president will fly to Washington DC for the next stage of talks on Monday, which could pave the way for a three-way meeting alongside the Russian leader, Mr Trump has said.\n\nIt comes following a high-profile summit between the US president and Mr Putin, held in Alaska on Friday.\n\nThe US president had heavily previewed the talks, threatening sanctions for Russia should there be no agreement on a ceasefire.\n\nBut a short news briefing following the summit ended with no mention of a ceasefire, no agreement on how to end the war, and little clarity about the next steps.\n\nOn Saturday, Mr Trump appeared to change his stance on what he hopes to achieve from the talks, indicating he wants a permanent peace settlement rather than a ceasefire, and announced the follow-up meeting with Mr Zelenskyy.\n\nIn a post on X, the Ukrainian president said he was grateful for the invitation and added: “It is important that everyone agrees there needs to be a conversation at the level of leaders to clarify all the details and determine which steps are necessary and will work.”\n\nHowever, he said Russia had rebuffed “numerous calls for a ceasefire and has not yet determined when it will stop the killing”, which “complicates the situation”.\n\nMr Zelenskyy continued: “If they lack the will to carry out a simple order to stop the strikes, it may take a lot of effort to get Russia to have the will to implement far greater – peaceful coexistence with its neighbours for decades.\n\n“But together we are working for peace and security. Stopping the killing is a key element of stopping the war.”\n\nThe Ukrainian president’s last visit to the White House earlier this year descended into a fiery spat with Mr Trump and his vice president JD Vance that saw him leave early.\n\nMr Putin issued his first statement on Saturday afternoon following the Friday’s summit, describing the talks as “timely and quite useful” – but said the “removal” of what he calls the “root causes” of the crisis “must underlie the settlement”.\n\nHe continued: “We definitely respect the US administration’s position which wants the hostilities to stop as soon as possible. So do we, and we would like to move forward with settling all issues by peaceful means.\n\n“The conversation was very frank and substantive, which, in my view, moves us closer towards making necessary decisions.”\n\nRead more:Analysis: Putin was pulling the stringsKey takeaways from Sky correspondentsBody language expert unpacks the summit\n\nIn calls on Saturday, Mr Trump told Mr Zelenskyy that the Russian leader had offered to freeze frontlines elsewhere if Kyiv agreed to withdraw from the eastern Donetsk and Luhansk regions, a person familiar with the matter told the Reuters news agency.\n\nUS envoy Steve Witkoff told Ukraine’s leader that Mr Putin had said there could be no ceasefire without this, and that the Russian president could pledge not to launch any new aggression against Ukraine as part of an arrangement.\n\nMeanwhile, European leaders who make up the “coalition of the willing” are set to hold a conference call tomorrow ahead of the crunch talks between Mr Trump and Mr Zelenskyy.\n\nIn a statement on Saturday, Prime Minister Keir Starmer said the US leader’s efforts had “brought us closer than ever before to ending Russia’s illegal war in Ukraine” and that his leadership “in pursuit of an end to the killing should be commended”.\n\nHe said he supported the next phase of talks, but added: “In the meantime, until (Putin) stops his barbaric assault, we will keep tightening the screws on his war machine with even more sanctions.”","summary":"Volodymyr Zelenskyy has said he is preparing for his meeting with Donald Trump &#8211; as Vladimir Putin issued his first comments following the US-Russia talks on the war in Ukraine. The Ukrainian president will fly to Washington DC for the next stage of talks on Monday, which could pave the way for a three-way meeting [&#8230;]\n\n\nThe post Zelenskyy prepares for fresh White House visit &#8211; as Putin issues first comments after summit | World News appeared first on Ghana Latest News.","url":"https://ghananewss.com/zelenskyy-prepares-for-fresh-white-house-visit-as-putin-issues-first-comments-after-summit-world-news/","image":"https://e3.365dm.com/25/08/768x432/skynews-putin-trump-summit-in-alaska_6992296.jpg?20250816012341","video":null,"publish_date":"2025-08-16 23:11:27","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":0.118},{"id":351706132,"title":"Quorum-breaking Texas Democrats join anti-Trump protest in Millennium Park","text":"Marissa Muñoz and Alex Ferro were visiting downtown Chicago on Saturday from Kenosha, Wisconsin, when they stopped at an anti-Trump rally in Millennium Park.\n\nThe 24-year-olds say they’re troubled by the efforts of the GOP in Texas to flip five Democratic congressional seats in favor of Republicans to bolster their narrow majority in the House and help promote President Donald Trump’s agenda.\n\n“I think it’s ridiculous,” Muñoz said.\n\nFerro, her boyfriend, agreed.\n\n“It’s a very scary time to live in right now.”\n\nThey were among a couple of hundred people attending the Fight the Trump Takeover rally. It was one of many nationwide protests against redistricting efforts in Texas.\n\nA handful of Texas House Democrats were at the rally. They stood on the edge of the fountain in Millennium Park as the crowd applauded them. The group fled to Chicago on Aug. 3 to stop Texas’ Republican-led Legislature from passing a redrawn congressional map that could give the GOP more House seats after the 2026 midterm elections.\n\nDemocratic state Rep. Gene Wu, the Texas House minority leader, said their goal was to stop the GOP from stripping away every American’s voting rights.\n\n“What the Republicans are doing is they’re trying to rig the system,” Wu said. “If they take this away from us, there is no hope.”\n\nProtesters in Chicago offered a variety of reasons for why they showed up Saturday.\n\nFor Ferro, the Trump administration’s mass deportation policy has changed the mood at the McDonald’s where he works. He said that ever since Trump returned to the White House, some of his Latina coworkers have stopped showing up for their shifts out of fear that immigration agents could detain or deport them.\n\n“We’re trying to get rid of people that belong here, that help us, that help the community,” he said. Instead, “we should be after a lot of our politicians who are taking people’s rights away.”\n\nSandra Fallico Miller, a 63-year-old physician from suburban Park Ridge, was among several protesters who came to the rally with a Ukrainian flag.\n\n“I’m here to fight for democracy,” she said. “Ukraine is one of the few lasting democracies that’s getting demolished by Russia, and the United States should be standing with Ukraine as well.”\n\nMiller said she wasn’t surprised by Trump’s latest move to back a plan to cede Ukrainian-controlled territory to Russia after a meeting Friday with Russian President Vladimir Putin in Alaska.\n\n“I would have predicted it to be even worse,” Miller said. “I was expecting him to give away everything, including Alaska.”\n\nMiller said she was more fearful of the current political climate in Washington than she has ever been in her lifetime.\n\n“My daughters and granddaughters now have less human rights than I had all my life,” Miller said. “The fact that our Congress is not doing anything and we don’t have checks and balances is not normal. The fact that we are attacking our judiciary, attacking our press, none of this is normal. I have honestly never been afraid in my life until this time.”\n\nMiller believes the Trump administration is flouting the Constitution, which is why she says Democrats should stop playing by the rules as well.\n\n“I’m against gerrymandering,” she said. “But we have to win to be able to protect our country, and so I’m in the mindset now that if we have to just temporarily gerrymander certain states to combat this, then I think it’s the right thing to do at this time.”\n\nAnna Savchenko is a reporter for WBEZ. You can reach her at asavchenko@wbez.org.","url":"https://chicago.suntimes.com/2025/08/16/texas-democrats-join-chicago-anti-trump-protest","image":"https://cst.brightspotcdn.com/dims4/default/938b4d0/2147483647/strip/false/crop/1024x736+0+0/resize/1024x736!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9a%2Fb7%2F0dbd27054305b70ac2b2449d5b45%2Fgene-w","video":null,"publish_date":"2025-08-16 23:07:50","author":"Anna Savchenko | WBEZ","authors":["Anna Savchenko | WBEZ"],"language":"en","category":"politics","source_country":"us","sentiment":-0.262},{"id":351702688,"title":"European leaders back Ukraine after Trump-Putin talks","text":"Top European leaders have reaffirmed their support for Ukraine’s sovereignty and territorial integrity following U.S. President Donald Trump’s meeting with Russian President Vladimir Putin in Alaska on Friday.\n\nIn a joint statement on Saturday, European Commission President Ursula von der Leyen, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz, British Prime Minister Keir Starmer, Finnish President Alexander Stubb, Polish Prime Minister Donald Tusk and European Council President Antonio Costa said Trump had briefed them and Ukrainian President Volodymyr Zelensky on the outcome of the Alaska talks.\n\nThe leaders welcomed Trump’s declaration that Washington was ready to provide “ironclad security guarantees” for Ukraine and expressed support for a potential trilateral summit involving Trump, Zelensky and Putin with European backing.\n\n“No limitations should be placed on Ukraine’s armed forces or on its cooperation with third countries. Russia cannot have a veto against Ukraine’s pathway to the EU and NATO,” the statement read.\n\nThey stressed that Ukraine alone must decide on its territory, and that international borders “must not be changed by force.” The statement also pledged continued European sanctions and economic pressure against Russia as long as the war continues.\n\nTrump described his meeting with Putin as “very productive,” saying the two sides had agreed on “many points” but acknowledged no formal deal had been reached.","summary":"Top European leaders have reaffirmed their support for Ukraine’s sovereignty and territorial integrity following U.S. President Donald Trump’s meeting with Russian President Vladimir Putin in Alaska on Friday. In a joint statement on Saturday, European Commission President Ursula von der Leyen, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz, British [&#8230;]\n\n\nThe post European leaders back Ukraine after Trump-Putin talks appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/08/16/european-leaders-back-ukraine-after-trump-putin-talks/","image":"https://b843437.smushcdn.com/843437/wp-content/uploads/2021/04/EU-flags-696x433.jpg?lossy=2&strip=1&webp=1","video":null,"publish_date":"2025-08-16 23:05:25","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":0.03},{"id":351703632,"title":"Trump vowed DC takeover multiple times on 2024 campaign trail: 'He's keeping his promise'","text":"Though the move by the Trump administration this week to federalize the nation's capital in the name of public safety has drawn controversy, previous comments by the president show the bold action was a direct campaign promise. Hundreds of National Guard troops and federal agents were deployed to deter crime and \"beautify\" the city after President Donald Trump federalized the Metropolitan Police Department on Monday. While coordination with the federal government came after former DOGE employee ‘Big Balls’ was violently beaten in Washington, D.C., the commanding step was promised on multiple occasions during Trump's presidential campaign in 2024. \"Americans overwhelmingly elected President Trump because of his commonsense policies that are hugely popular with the American public–including restoring law and order. Making DC Safe Again and stopping violent crime is something President Trump pledged to do and now he’s keeping his promise,\" White House spokeswoman Abigail Jackson told Fox News Digital. \"Democrat politicians who oppose this move are suffering from a severe case of Trump Derangement Syndrome and it is just one of the many reasons why their approval rating is hitting record lows. Meanwhile, Americans from all backgrounds and communities can applaud efforts to stop violent crime.\" ‘RADICAL’ DC OFFICIALS TREATED OFFICERS ‘LIKE CRAP,’ POLICE LEADER SAYS – 7 ATTACKS THAT LED TO TRUMP TAKEOVER Following the January 2024 murder of Mike Gill, a Republican who worked under the Obama and Trump administrations, in Washington, D.C., Trump posted on Truth Social noting the violence was unacceptable. \"Wonderful and brilliant Mike Gill, a highly respected member of the Trump Administration, was ruthlessly and viciously shot in the head during a carjacking in Washington D.C.,\" Trump posted on Truth Social Sunday morning. \"His family and friends are devastated. The Federal Government must take over D.C.\" Gill was shot in broad daylight on Jan. 29, 2024 while sitting in his car parked just a few blocks north of the National Mall. He was waiting to pick his wife up from work when an armed carjacker opened fire. He suffered a gunshot wound to the head and died three days later. At a campaign event in Las Vegas, Trump doubled down on the promise to restore law and order in the capital. \"We’re going to federalize it,\" he said. \"We’re going to have the toughest law enforcement in the country.\" Former Republican House Speaker Newt Gingrich also weighed in on the topic following Gill's death, calling on Congress to \"take back control.\" \"Mike Gill’s death from attack by a carjacker on 14th street in downtown Washington while picking his wife up from work is one more example of why Congress needs to take back control of our national capital,\" Gingrich wrote in an X post. I SUPPORT TRUMP TAKING CONTROL OF DC POLICE — THE CONSTITUTION IS ON HIS SIDE Mayor Muriel Bowser said violent crime in D.C. is at a 30-year low, but city data shows robberies and homicides spiked after the pandemic. D.C. records show gun violence jumped 460% downtown, while homicides rose up to 500% in neighborhoods like Southwest/Waterfront and H Street. CLICK HERE TO GET THE FOX NEWS APP Trump has 30 days of temporary emergency control of the capital under current law, and warned he could declare a national emergency to prolong it if Congress resists. \"You can't have 30 days,\" he said during a news conference at the Kennedy Center. \"We're going to do this very quickly, but we're going to want extensions. I don't want to call a national emergency, but if I have to, I will.\" The White House did not immediately respond to Fox News Digital's request for comment.","summary":"Trump fulfills campaign promise by federalizing D.C. with 30-day emergency control, cracking down on crime in the nation&apos;s capital.","url":"https://www.foxnews.com/politics/trump-vowed-dc-takeover-multiple-times-2024-campaign-trail-hes-keeping-his-promise","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/09/Trump92624.jpg","video":"https://www.foxnews.com/video/6376896905112","publish_date":"2025-08-16 23:03:30","author":"Alexandra Koch","authors":["Alexandra Koch"],"language":"en","source_country":"US","sentiment":-0.043},{"id":351710108,"title":"PM to speak with allies, amid reports Trump mulling Russian land grab in Ukraine","text":"Sir Keir Starmer will meet European allies on Sunday, amid reports Donald Trump favours a Russian land grab in Ukraine to end the war.\n\nThe Prime Minister, French President Emmanuel Macron and German Chancellor Friedrich Merz will host the coalition of the willing on Sunday afternoon.\n\nThe video conference of allies who plan to keep the peace in Ukraine comes ahead of Volodymyr Zelensky’s White House meeting with Donald Trump on Monday.\n\nThe one-on-one in the Oval Office could pave the way for a three-way meeting alongside Russian leader Mr Putin, the US President has said.\n\nThe Russian and American leaders met on Friday at a military base in Anchorage, Alaska, for a summit to broker an end to the war in Ukraine.\n\nSeveral news outlets have cited sources which claimed that during the negotiations Mr Putin demanded full control of Donetsk and Luhansk – two occupied Ukrainian regions – as a condition for ending the war.\n\nIn exchange, he would give up other Ukrainian territories held by Russian troops.\n\nOther outlets reported that Mr Trump is inclined to support the plan, and will speak to Mr Zelensky about it on Monday when they meet in the Oval Office.\n\nSir Keir commended Mr Trump’s “pursuit of an end to the killing” following a phone call with the US President, Mr Zelensky and Nato allies on Saturday morning.\n\nBut he insisted Ukraine’s leader must not be excluded from future talks to broker a peace in Ukraine.\n\nThe Prime Minister and European leaders appeared increasingly confident that Mr Trump will offer a “security guarantee” of air support to back up allied troops on the ground in Ukraine, should they be deployed to keep the peace.\n\nBut Mr Trump also appeared to have a change of heart on what he wants to achieve from the talks, indicating that he wants a permanent peace settlement rather than a ceasefire, echoing the sentiment of Mr Putin.\n\nThe Alaska summit was “timely” and “useful”, Mr Putin said after he left.\n\nExperts have warned the face-to-face summit has risked legitimising the Russian leader, who has been made a pariah by the international community for invading Ukraine.\n\nUkraine’s President Mr Zelensky warned Russia may ramp up its strikes against his country in the coming days “in order to create more favourable political circumstances for talks with global actors”.","summary":"The Prime Minister, France’s Emmanuel Macron and Germany’s Friedrich Merz will host the coalition of the willing on Sunday afternoon.","url":"https://www.standard.co.uk/news/politics/donald-trump-vladimir-putin-keir-starmer-russian-ukraine-b1243294.html","image":"https://static.standard.co.uk/2025/08/17/00/4fea8ea129e055cf9baf899cdaf51785Y29udGVudHNlYXJjaGFwaSwxNzU1NDY4NTYw-2.81251232.jpg?width=1200","video":null,"publish_date":"2025-08-16 23:01:41","author":"David Lynch","authors":["David Lynch"],"language":"en","category":"politics","source_country":"gb","sentiment":0.119},{"id":351703124,"title":"PM to speak with allies, amid reports Trump mulling Russian land grab in Ukraine","text":"Sir Keir Starmer will meet European allies on Sunday, amid reports Donald Trump favours a Russian land grab in Ukraine to end the war.\n\nThe Prime Minister, French President Emmanuel Macron and German Chancellor Friedrich Merz will host the coalition of the willing on Sunday afternoon.\n\nThe video conference of allies who plan to keep the peace in Ukraine comes ahead of Volodymyr Zelensky’s White House meeting with Donald Trump on Monday.\n\nThe one-on-one in the Oval Office could pave the way for a three-way meeting alongside Russian leader Mr Putin, the US President has said.\n\nThe Russian and American leaders met on Friday at a military base in Anchorage, Alaska, for a summit to broker an end to the war in Ukraine.\n\nSeveral news outlets have cited sources which claimed that during the negotiations Mr Putin demanded full control of Donetsk and Luhansk – two occupied Ukrainian regions – as a condition for ending the war.\n\nIn exchange, he would give up other Ukrainian territories held by Russian troops.\n\nOther outlets reported that Mr Trump is inclined to support the plan, and will speak to Mr Zelensky about it on Monday when they meet in the Oval Office.\n\nSir Keir commended Mr Trump’s “pursuit of an end to the killing” following a phone call with the US President, Mr Zelensky and Nato allies on Saturday morning.\n\nBut he insisted Ukraine’s leader must not be excluded from future talks to broker a peace in Ukraine.\n\nThe Prime Minister and European leaders appeared increasingly confident that Mr Trump will offer a “security guarantee” of air support to back up allied troops on the ground in Ukraine, should they be deployed to keep the peace.\n\nBut Mr Trump also appeared to have a change of heart on what he wants to achieve from the talks, indicating that he wants a permanent peace settlement rather than a ceasefire, echoing the sentiment of Mr Putin.\n\nThe Alaska summit was “timely” and “useful”, Mr Putin said after he left.\n\nExperts have warned the face-to-face summit has risked legitimising the Russian leader, who has been made a pariah by the international community for invading Ukraine.\n\nUkraine’s President Mr Zelensky warned Russia may ramp up its strikes against his country in the coming days “in order to create more favourable political circumstances for talks with global actors”.","url":"https://uk.news.yahoo.com/pm-speak-allies-amid-reports-230141211.html","image":"https://s.yimg.com/ny/api/res/1.2/nP_cWmfwmmbKGbVd3i0YJw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTQ7Y2Y9d2VicA--/https://media.zenfs.com/en/pa_viral_news_uk_120/23fdfc28e676f646af392ce9f88f3cc6","video":"","publish_date":"2025-08-16 23:01:41","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":0.119},{"id":351707606,"title":"Sir Keir Starmer to meet with 'coalition of the willing' ahead of crunch Trump-Zelensky White House showdown as world leaders push for peace deal in Ukraine","text":"Sir Keir Starmer to meet with 'coalition of the willing' ahead of crunch Trump-Zelensky White House showdown as world leaders push for peace deal in Ukraine\n\nREAD MORE: Zelensky 'in Trump-Putin vice' as he flies out to US \n\nBy SHANNON MCGUIGAN, NEWS REPORTER\n\nPublished: 23:50 BST, 16 August 2025 | Updated: 00:01 BST, 17 August 2025\n\nSir Keir Starmer is set to meet with Emmanuel Macron and Friedrich Merz ahead of Zelensky and Trump's talks at the White House next week, as world leaders push for a peace deal in Ukraine. \n\nThe Prime Minister will hold talks with the European leaders in a meeting of the coalition of the willing on Sunday afternoon.\n\nA day later, on Monday, Ukrainian President Volodymyr Zelensky is scheduled to meet with Donald Trump in the Oval Office in Washington DC. \n\nThe one-on-one in the Oval Office could pave the way for a three-way meeting alongside Russian leader Mr Putin, the US president has said.\n\nIt comes as Ukraine's future as a sovereign nation hangs in the balance after the US President's meeting with Vladimir Putin yesterday, which left Kremlin delegates grinning. \n\nCritics have warned that other world leaders were powerless to prevent Zelensky from being caught ‘with his head in a vice’ by the American and Russian leaders when he visits Trump at the White House. \n\nDiplomatic sources said that Friday’s summit in Alaska had paved the way for a deal in which Ukraine would be expected to surrender large swathes of the Donbas region in the east of the country, including areas currently controlled by Kyiv.\n\nSeveral news outlets have cited sources, which claimed Putin demanded full control of Donetsk and Luhansk, two occupied Ukrainian regions, and, in exchange he would give up other Ukrainian territories held by Russian troops.\n\nSir Keir Starmer is set to meet with Western allies, ahead of Zelensky and Trump's talks at the White House next week, as world leader push for a peace deal in Ukraine \n\nA day later, on Monday, Ukrainian President Volodymyr Zelensky is scheduled to meet with Donald Trump in the Oval Office in Washington DC\n\nThe world leaders shook hands with one another ahead of the meeting, which has left Kremlin officials 'beaming'\n\nIn return, President Zelensky would receive ‘Nato-style’ protection from Western countries for what remained of his territory. \n\nElsewhere, the coalition of the willing, which is made up of over 30 nations, is prepared to deter Russian aggression by placing troops on the ground once the Ukraine war is over. \n\nThe meeting, which is expected to take place at approximately 2pm UK time, comes on the heels of Trump's summit in Alaska with his Russian counterpart Vladimir Putin.\n\nAnd although Trump hoped to score a peace deal following talks at the military base in Anchorage, both he and Putin walked away without an agreement on how to bring the conflict to an end. \n\nIn a press conference, Trump declared 'there's no deal until there's a deal', adding there were 'many, many points that we agreed on', however, they failed to yield an immediate result on one issue, he branded 'the most significant'. \n\n'We didn't get there, but we have a very good chance of getting there,' he added, without divulging any specifics.\n\nThere was no mention of a ceasefire from either Trump or Putin during the press conference which followed after their near three-hour meeting. \n\nFollowing the summit, the US president told Fox News it was now up to the Ukrainian to 'make a deal' to end the war. \n\nThe Prime Minister will hold talks with France's Emmanuel Macron and Germany's Friedrich Merz in a meeting of the coalition of the willing on Sunday afternoon\n\nCritics warned that other world leaders were powerless to prevent Volodymyr Zelensky (pictured) from being caught 'with his head in a vice' by the American and Russian leaders when he visits Mr Trump at the White House\n\nTrump pats Putin on the back during the press conference where he said 'many, many points that we agreed on' but said there was one issue - 'the most significant' - that they hadn't cracked.\n\nUS President Donald Trump and Russian President Vladimir Putin deliver a joint press conference after participating in a US-Russia summit on Ukraine\n\nPresident Donald Trump boards Air Force One as he departs Joint Base Elmendorf-Richardson on August 15, 2025\n\nSmiles and 'great progress' - but no deal as Trump and Putin try to hash out Ukraine peace pact\n\nAnd while Sir Keir commended Trump's 'pursuit of an end to the killing' following a phone call with the US president, Zelensky and Nato allies on Saturday morning, he insisted the Ukrainian leader must not be excluded from future peace talks. \n\nThe Prime Minister and European leaders appeared increasingly confident that Mr Trump will offer a 'security guarantee' of air support to back up allied troops on the ground in Ukraine.\n\nThe Prime Minister welcomed 'the openness of the United States, alongside Europe, to provide robust security guarantees to Ukraine as part of any deal'.\n\n'This is important progress and will be crucial in deterring Putin from coming back for more,' he added.\n\nBut Mr Trump also appeared to have a change of heart on what he wants to achieve from the talks, indicating that he wants a permanent peace settlement rather than a ceasefire.\n\nYesterday, President Trump wrote on his Truth Social platform: ‘The best way to end the horrific war between Russia and Ukraine is to go directly to a Peace Agreement, which would end the war, and not a mere Ceasefire Agreement, which often times do not hold up.\n\n‘President Zelensky will be coming to [Washington] DC, the Oval Office, on Monday afternoon. If all works out, we will then schedule a meeting with president Putin.’\n\nTrump walks behind Russian President Putin as they prepare to address a press conference in Alaska\n\nPutin greeted Trump by saying 'Good afternoon, dear neighbour - very good to see you in good health and to see you alive.'\n\nWriting on his Truth Social platform, the US president said: 'The best way to end the horrific war between Russia and Ukraine is to go directly to a peace agreement, which would end the war, and not a mere ceasefire agreement, which often times do not hold up.'\n\nFollowing the summit, Dr Neil Melvin, director of international security at the Royal United Services Institute (Rusi), said: 'Vladimir Putin came to the Alaska summit with the principal goal of stalling any pressure on Russia to end the war.\n\n'He will consider the summit outcome as mission accomplished.'\n\nBut, experts have warned the face-to-face summit has risked legitimising the Russian leader, after he has been made a pariah by the international community for years.\n\nZelensky has also warned the Kremlin may ramp up airstrikes against Ukraine over the coming days in a bid 'to create more favourable political circumstances for talks with global actors'.\n\nKyiv's troops are 'defending our positions along the entire front line', he added on social media site X.\n\nMr Zelensky had earlier insisted a ceasefire must include an end to fighting on land, in the sea and the air, as well as the return of all prisoners of war and captured civilians, including children.\n\nSanctions on Moscow 'should be strengthened if there is no trilateral meeting or if Russia tries to evade an honest end to the war', Mr Zelensky added.\n\nPutin appeared shocked when a B-2 Bomber flew over his head after being greeted by Trump\n\nPresident Donald Trump (left) guides Russian President Vladimir Putin (right) toward the Beast, the presidential limo on August 15\n\nBREAKING NEWS\n\nZelensky to meet Trump in Washington after Putin peace talks end with no deal\n\nHowever, last night, former British defence minister Tobias Ellwood told The Mail on Sunday that he feared Mr Zelensky was walking into a trap in the White House. \n\nHe said: ‘He will be asked to put his head in a vice, with Vladimir Putin pushing from one side and Donald Trump from the other.\n\n‘The Ukrainian president will be presented with a “take it or leave it” deal: surrender territory to Russia or face the blame for wrecking peace.\n\n‘And if Mr Zelensky refuses, Trump will walk away, declaring that America is done with the talks.\n\n‘It’s the classic gangster deal – one you can’t refuse. Except he must.’\n\nMr Johnson, writing in today’s MoS, describes the summit as ‘the most vomit-inducing episode in all the tawdry history of international diplomacy’.\n\nHe says: ‘Imagine how it felt to be one of those embattled heroes in a dug-out near Pokrovsk, fighting for your country’s freedom, and to hear the President of the United States – the ex officio team captain of the Free World – refer to Vladimir Putin as “the boss”. Retch.\n\n‘Think of the tens of thousands of Ukrainian widows and orphans.\n\n‘Think of the maimed and mutilated; think of the Ukrainian civilians living in daily and nightly terror of Putin’s bombs and missiles still raining down, even though the so-called negotiations were taking place in Alaska.’\n\nBut he adds: ‘Like so many of the most objectionable pieces of historic diplomacy, that meeting was also, of course, justifiable and even essential.\n\nMr Johnson, writing in today's MoS, describes the summit as 'the most vomit-inducing episode in all the tawdry history of international diplomacy'. Pictured: Sir Keir Starmer and Zelensky on August 14\n\nReform UK leader Nigel Farage, a long-time ally of Mr Trump, said of the US President: 'At least he is trying to find peace'\n\n‘Puke-making though it was, Trump was right to try. He was right to meet Putin, because if millions of Ukrainians were watching with horror at the red-carpet rehabilitation of the Russian tyrant, they were also watching with hope... One day this war will end with a peace that protects Ukrainian freedom; but as Trump said in Alaska, the Europeans – led by Britain – will have to step up.’\n\nThe proposed deal was greeted with dismay in Ukraine. Volodymyr Dubovyk, a professor of international relations in Odesa, described it as ‘a nothing-burger with a sour aftertaste’.\n\nHe said: ‘As a Ukrainian, it was pretty disgusting to see what was going on, all this red carpet, all this clapping and smiles and being chummy.’\n\nReform UK leader Nigel Farage, a long-time ally of Trump, said of the US President: ‘At least he is trying to find peace.’\n\nBut former Tory defence secretary Ben Wallace hit out at the 1980’s-style ‘pantomime’ of the summit between the two leaders.\n\nHe said: ‘Putin got what he wanted and I think President Trump got a trip to Alaska.’\n\nAlaskaUkraineKeir StarmerRussia\n\nShare or comment on this article:\nSir Keir Starmer to meet with 'coalition of the willing' ahead of crunch Trump-Zelensky White House showdown as world leaders push for peace deal in Ukraine\n\nAdd comment","summary":"Sir Keir Starmer is set to meet with Western allies, ahead of Zelensky and Trump's talks at the White House next week, as world leader push for a peace deal in Ukraine. ","url":"https://www.dailymail.co.uk/news/article-15007213/Keir-Starmer-coalition-willing-trump-zelenksy-white-house-talks.html","image":"https://i.dailymail.co.uk/1s/2025/08/16/23/101289701-0-The_Prime_Minister_will_hold_talks_with_France_s_Emmanuel_Macron-a-38_1755384489115.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/08/16/8771044395526212222/1024x576_MP4_8771044395526212222.mp4","publish_date":"2025-08-16 23:01:25","author":"Editor,Shannon McGuigan","authors":["Editor","Shannon McGuigan"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.032},{"id":351703628,"title":"World-renowned hostage negotiator explains to The New York Times how Trump displays empathy","text":"World-renowned hostage negotiator Chris Voss spoke with The New York Times’ David Marchese in a Saturday podcast interview, where he discussed how President Donald Trump demonstrates empathy. Voss, a former longtime hostage negotiator for the FBI, was asked by Marchese whether he believes Trump and his administration \"demonstrate empathy.\" \"I think he has a highly evolved understanding of how other people see things,\" he replied. EX-MSNBC HOST PRAISES TRUMP'S POLITICAL INSTINCTS, ABILITY TO CONNECT TO COUNTRY CULTURALLY Marchese followed up on the hostage negotiator's response, asking, \"What makes you say that?\" According to Voss, Trump's decision to bomb Iran's nuclear sites rather than taking out the nation's leader revealed to the hostage negotiator the president’s empathetic side. \"The reporting was that Israel was thinking about trying to take out the Iranian leader and that Trump was against that. Now, my view is that’s smart for a number of reasons. First of all, if you agree to take out the head of a country, you’re declaring there’s open season and fair is fair, which means they’re free to come after you,\" he explained. \"To me, there’s a sense of empathy there. Not necessarily agreeing, not being on their side, but if empathy is understanding how somebody sees it, I think he has a highly evolved sense of it.\" CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE Following Voss' response, Marchese immediately switched the topic of conversation to immigration, asking the hostage negotiator if Trump \"has a highly evolved sense of empathy when it comes to understanding how other people 'see it' on immigration?\" \"Yeah, and then I think he’s making a calculation based on what he needs to move forward,\" Voss replied. \"I don’t think he is oblivious to how people see things, and to lack empathy is to be oblivious. Now, what decisions that causes you to make is a whole separate issue.\" Marchese insisted that he needed to \"stick with empathy and Trump and immigration,\" asking Voss to help him understand \"how the way ICE functions is the result of a remotely empathetic understanding of other people.\" Voss contended that he's \"not on the ground with those guys\" and that he's unaware of \"what kind of orders are being given,\" but noted that \"the system breaks down\" when orders aren't followed. Marchese pressed the hostage negotiator on his response, asking Voss, \"if you think the thing is wrong, you probably should say, ‘I’m not doing it,’ right?\" CLICK HERE TO GET THE FOX NEWS APP \"There are really tough questions about that as an individual. I’m seeing it from a distance,\" Voss responded. \"I’m not in a position to be able to offer an informed opinion on it, and yeah, I’m dodging your question.\" Marchese acknowledged Voss' reluctance to go any further, ending the exchange on the topic.","summary":"FBI hostage negotiator Chris Voss told The New York Times on Saturday that President Trump demonstrates empathy, citing his Iran policy decisions and immigration approach.","url":"https://www.foxnews.com/media/world-renowned-hostage-negotiator-tells-new-york-times-podcast-how-trump-displays-empathy","image":"https://static.foxnews.com/foxnews.com/content/uploads/2024/10/donald-trump.jpg","video":"https://www.foxnews.com/video/6374836316112","publish_date":"2025-08-16 23:00:03","author":"Marc Tamasco","authors":["Marc Tamasco"],"language":"en","category":"politics","source_country":"US","sentiment":-0.13},{"id":351703634,"title":"Hundreds arrested as Trump’s Washington, DC, crime crackdown hits full stride","text":"The Trump administration’s crackdown on violent crime in Washington, D.C., has already netted more than 240 arrests and taken 38 guns off the streets, a White House official told Fox News. The show of force has swept up gang members, robbery suspects and immigration violators. On Friday alone, 52 people were arrested, including 28 illegal immigrants, while three guns were seized. Federal teams also cleared 25 homeless encampments, and officials said those removals were carried out without confrontations or arrests. EXPERT FLIPS SCRIPT ON DEMS PUSHING 'CHERRY-PICKED' CRIME STATS TO RESIST TRUMP'S DC CRACKDOWN White House deputy chief of staff for policy Stephen Miller hailed the scale of the operations and said the numbers are \"breathtaking.\" \"We have seen a record number of violent offenders, bad guys, gang members and all kinds of threats to public safety removed off the streets as well as their illegal weapons that they've been using to terrorize the citizens of this city,\" Miller told \"Fox News Live.\" \"Additionally, we have seen over 70 homeless encampments that have scarred and disfigured the public streets of this city, dismantled and thrown away and the homeless cleared from those encampments. At the same time, we have the National Park Service going around and getting rid of the gang graffiti that has been left untouched by this city for decades.\" The operation began quietly Aug. 7 with the launch of the \"Making D.C. Safe and Beautiful\" task force created by President Donald Trump in March through an executive order. He escalated it Aug. 11 by temporarily seizing federal control of the Metropolitan Police Department (MPD) under emergency powers in the Home Rule Act, the first such move in U.S. history. WOMAN GUNNED DOWN IN 'SAFE' DC NEIGHBORHOOD AS TRUMP LAUNCHES FEDERAL POLICE TAKEOVER The order puts the MPD under federal authority for up to 30 days, unless Congress extends it, and 800 National Guard troops were deployed. In all, 22 multi-agency teams with more than 1,800 personnel were deployed across all seven police districts as the president vowed to aggressively \"take our capital back.\" \"We have a capital that’s very unsafe. … Something’s out of control. But we’re going to put it in control very quickly,\" Trump said Monday. Other arrests included drug distribution, weapons violations and outstanding warrants. Police also detained suspects accused of fleeing law enforcement, reckless driving, assault with a dangerous weapon and kidnapping. The D.C. National Guard carried out roving patrols on foot and in vehicles around the National Mall and Union Station last night. While they remain armed, the officials stressed they are not making arrests, instead securing federal assets and providing cover for police. Trump began floating the idea of federalizing D.C. law enforcement after the brutal beating of a former Department of Government Efficiency (DOGE) employee during an alleged attempted carjacking in Washington’s Logan Circle. He then moved to ramp up his crackdown on Monday, invoking the Home Rule Act. CLICK HERE TO GET THE FOX NEWS APP Democrats and local officials pushed back, noting MPD and the U.S. Attorney’s Office report violent crime is at a 30-year low, down 35% from 2023 to 2024. FBI data for the same period shows a much smaller decrease of around 9%, highlighting a substantial gap between local and federal statistics. The discrepancy stems from differences in how crimes are classified and reported to federal databases. D.C. Mayor Muriel Bowser described the federal action as \"unsettling and unprecedented,\" while Democrats have introduced a joint resolution in an effort to put the brakes on the federal takeover of police.","summary":"The Trump administration’s crackdown on violent crime in Washington, D.C., has already netted more than 240 arrests and seized 38 guns off the streets, a White House official said.","url":"https://www.foxnews.com/politics/hundreds-arrested-as-trumps-washington-dc-crime-crackdown-hits-full-stride","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/08/dc-crime-sweep.jpg","video":"https://www.foxnews.com/video/6376994188112","publish_date":"2025-08-16 22:57:44","author":"Michael Dorgan","authors":["Michael Dorgan"],"language":"en","category":"politics","source_country":"US","sentiment":-0.07},{"id":351715342,"title":"Russia's Lavrov discusses Alaska summit's outcome with Turkish, Hungarian counterparts","text":"Aug 17 (Reuters) - Russian Foreign Minister Sergei Lavrov held calls on Saturday with his Turkish and Hungarian counterparts, the Russian foreign ministry said, hours after a summit between the U.S. and Russian presidents yielded no deal on ending the war in Ukraine.\n\nPresident Donald Trump, who hosted President Vladimir Putin in Alaska on Friday for bilateral talks aimed at ending the war that Russia launched with a full-scale invasion on Ukraine in early 2022, said that Kyiv should make a deal with Moscow because \"Russia is a very big power, and they're not.\"\n\nAdvertisement · Scroll to continue\n\nThe phone call between Lavrov and Turkish Foreign Minister Hakan Fidan took place at Turkey's initiative, the Russian foreign ministry said in a statement on its website.\n\n\"The foreign ministers exchanged views on the outcomes of the high-level Russia–U.S. meeting held in Alaska on August 15,\" the ministry said in its short statement.\n\nTurkey has tried to keep diplomatic channels open to both sides during the war, acting as a NATO member, a partner for both Russia and Ukraine, and a potential mediator.\n\nLavrov also held a call with Hungarian Foreign Minister Peter Szijjarto, the Russian foreign ministry said, in which \"the parties discussed issues related to the Ukrainian crisis in the context of the outcomes of the Russia–U.S. summit.\"\n\nAdvertisement · Scroll to continue\n\nHungary has maintained close ties with Russia throughout the war, often opposing EU sanctions and continuing energy cooperation with Moscow, and drawing criticism from Western allies of Kyiv.\n\nHungarian Prime Minister Viktor Orban said on Saturday after the Putin-Trump meeting that \"the world is a safer place than it was yesterday,\" while other European leaders reiterated in their joint statement that \"it will be up to Ukraine to make decisions on its territory.\"\n\nAd Break Coming Up \n\n NEXT StayNext\n\nOffEnglish \n\n 180p288p360p480p540p576p720pHD1080pHDAuto (180p) \n\nAbout ConnatixV603631 \nAbout ConnatixV603631 \n\nContinue watchingafter the adVisit Advertiser websiteGO TO PAGE\n\nReporting by Lidia Kelly in Melbourne; Editing by Matthew Lewis\n\nPurchase Licensing Rights","summary":"","url":"https://www.reuters.com/world/europe/russias-lavrov-discusses-alaska-summits-outcome-with-turkish-hungarian-2025-08-16/","image":"https://www.reuters.com/resizer/v2/KJXRRBTLDVNHHFZUAQXMSKU67I.jpg?auth=2b6b2062585fe75afdb9489b05ca13b27c264a101ecc6efe956b85c8a85359fa&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-08-16 22:52:12","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"gb","sentiment":0.203},{"id":351705222,"title":"Ukraine-Russia war latest: Kyiv ‘pushes Russian forces back’ hours after Putin asks Trump for Donetsk surrender","text":"The Ukrainian military has claimed to have pushed Russia’s forces back by about 1.2 miles on part of the Sumy front in northern Ukraine.\n\n\"Ukrainian soldiers continue active combat actions to destroy the enemy and liberate our settlements,\" the Ukrainian general staff said.\n\nIt comes as Vladimir Putin has demanded Ukraine surrender the eastern Donetsk and Luhansk provinces as one condition for ending the war.\n\nThe Russian leader told Donald Trump that he would be prepared to stop fighting on the rest of the frontline if Ukraine gave in to the demand.\n\nThe concessions were discussed at the summit of the two leaders in Alaska on Friday, which ended with no peace deal despite nearly three hours of talks. Sources very close to the meeting told The Independent the dramatic move appears to have been endorsed by Mr Trump as a means to bring an end to the war. \n\nMeanwhile, Sir Keir Starmer will speak to western allies on Sunday ahead of Volodymyr Zelensky’s White House meeting with Donald Trump.\n\nThe prime minister, France’s Emmanuel Macron and Germany’s Friedrich Merz will host the meeting of the coalition of the willing on Sunday afternoon.","summary":"Kyiv's troops say they have advanced up to 1.2 miles, repelling Russian troops on the northern Sumy front","url":"https://www.independent.co.uk/news/world/europe/ukraine-russia-war-latest-updates-trump-putin-meeting-b2808985.html","image":"https://static.independent.co.uk/2025/08/16/20/45/SEI262290539.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/16W584kc-4VHSaSK0.mp4","publish_date":"2025-08-16 22:51:22","author":"Andrew Feinberg,Holly Evans and Jabed Ahmed","authors":["Andrew Feinberg","Holly Evans and Jabed Ahmed"],"language":"en","category":"politics","source_country":"gb","sentiment":0.174},{"id":351701954,"title":"Trump reverses on the need for a ceasefire before a potential peace deal ending the war in Ukraine","text":"By Samya Kullab , John Leicester and Emma Burrows | Associated Press\n\nKYIV, Ukraine — U.S. President Donald Trump reversed course in the wake of his meeting with Russian leader Vladimir Putin to say an overall peace agreement — not the ceasefire that he has long championed — is the next step in ending the 3 1/2-year war in Ukraine.\n\nIn talks with European allies after Friday’s summit in Alaska, Trump said Putin reiterated that he wants the key Donetsk and Luhansk regions that make up the Donbas. But Putin appeared open to the possibility of halting the stalemate in two other regions, Zaporizhzhia and Kherson, with a freeze along the front lines.\n\nThat is according to European officials familiar with the calls who spoke on condition of anonymity to discuss the talks at a U.S. military base between the American and Russian presidents. Ukrainian President Volodymyr Zelenskyy has previously rejected giving up the territory in the Donbas.\n\nThe aftermath of the summit offered little clarity about the next steps, other than Trump’s commitment for more meetings, including with Zelenskyy at the White House on Monday. It was unclear among those briefed on the exchanges whether Trump saw Putin’s desire for the Donbas as acceptable, with Trump’s blunt but elliptical way of speaking only adding to a sense of confusion.\n\nThe White House had yet to provide a public summary of the calls as Trump golfed on Saturday with his special envoy Steve Witkoff and Fox News anchor Bret Baier at his Virginia golf club. The most transparent takeaway was Trump’s abrupt reversal on a ceasefire, raising questions of how peace talks can proceed if attacks continue.\n\nTrump’s abandoning a ceasefire as a requirement for further negotiations aligns him with a position held by Putin. The Russian leader has long said Moscow is not interested in a temporary truce and is seeking a long-term settlement that takes the Kremlin’s interests into account.\n\nTrump says he is focused on a peace accord, not a ceasefire\n\nAfter the calls with Zelenskyy and European leaders, Trump said Saturday on social media that “it was determined by all that the best way to end the horrific war between Russia and Ukraine is to go directly to a Peace Agreement, which would end the war, and not a mere Ceasefire Agreement, which often times do not hold up.”\n\nGerman Chancellor Friedrich Merz told ZDF television that Trump said “Russia seems to be prepared to conduct the negotiations based on the so-called line of contact and not the administrative boundaries.” It was unclear from the comments how issues pertaining to the Donbas had been resolved.\n\nZelenskyy has previously refused to withdraw from the remaining 30% of the Donetsk region that Ukraine controls. He says that would be unconstitutional and the territory could be used as a staging ground for later Russian attacks.\n\nIn a statement after the Trump call, major European leaders did not address whether a peace deal was preferable to a ceasefire, saying they “welcomed President Trump’s efforts to stop the killing in Ukraine, end Russia’s war of aggression, and achieve just and lasting peace.”\n\nPutin’s view on his summit with Trump\n\nPutin on Saturday described his talks with Trump as “very frank.”\n\n“We, of course, respect the position of the American administration, which sees the need for a speedy end to military actions,” he said at the follow-up meeting at the Kremlin, a clip of which was posted to the Kremlin’s Telegram channel. “We would like to move to resolving all issues by peaceful means.”\n\nPutin has “broken out of international isolation” and “wasn’t in the least challenged” by Trump, who also ignored an arrest warrant issued for Putin by the International Criminal Court, said Laurie Bristow, who was British ambassador to Russia from 2016 to 2020. But the U.S. isn’t a member of the court and thus doesn’t have an obligation to arrest him.\n\nZelenskyy gears up for a White House meeting\n\nZelenskyy, who was not invited to Alaska for the summit, said he had a “long and substantive” conversation with Trump early Saturday and that they would “discuss all of the details regarding ending the killing and the war” on Monday.\n\nIt will be Zelenskyy’s first visit to the United States since Trump berated him publicly for being “disrespectful” during an extraordinary Oval Office meeting in February.\n\nTrump confirmed the White House meeting and said that “if all works out, we will then schedule a meeting with President Putin.”\n\nZelenskyy reiterated the importance of involving European leaders, who also were not at the summit, “to ensure reliable security guarantees together with America.”\n\n“We also discussed positive signals from the American side regarding participation in guaranteeing Ukraine’s security,” he said.\n\nThe Ukrainian leader did not elaborate, but he has previously said European partners put on hold a proposal to establish a foreign troop presence in Ukraine to deter Russian aggression because it lacked an American backstop.\n\nIn apparent effort to bolster Zelenskyy’s hand before the White House meeting, France, the United Kingdom and Germany will co-host a video call Sunday of “coalition of the willing” nations that could help monitor and uphold any deal to end fighting, French President Emmanuel Macron’s office said.\n\nEuropeans urge security guarantees for Ukraine\n\nThe French, German, Italian, British, Finnish, Polish and European Union leaders said “Ukraine must have ironclad security guarantees” and they welcomed U.S. readiness to provide them.\n\n“It will be up to Ukraine to make decisions on its territory,” their statement said. “International borders must not be changed by force.”\n\nDuring an interview with Fox News Channel before returning to Washington, Trump insisted the onus might be on Zelenskyy “to get it done,” but that there also would be some involvement from European nations.\n\nEU foreign policy chief Kaja Kallas said “the harsh reality is that Russia has no intention of ending this war anytime soon,” noting that Moscow launched new attacks on Ukraine even as the delegations met.\n\n“Putin continues to drag out negotiations and hopes he gets away with it. He left Anchorage without making any commitments to end the killing,” she said.\n\nUkrainian and Russian forces are fighting along a 1,000-kilometer (620-mile) front line. Since spring, Russian troops have accelerated their gains, capturing the most territory since the opening stages of the war.\n\nQuestions on a trilateral meeting\n\nZelenskyy voiced support for Trump’s proposal for a meeting with the U.S. and Russia. He said that “key issues can be discussed at the level of leaders, and a trilateral format is suitable for this.”\n\nBut Putin’s foreign affairs adviser, Yuri Ushakov, told Russian state television Saturday that a possible three-way meeting “has not been touched upon yet” in U.S.-Russia discussions.\n\nZelenskyy wrote on X that he told Trump “sanctions should be strengthened if there is no trilateral meeting or if Russia tries to evade an honest end to the war.“\n\nFiona Hill, Trump’s former senior adviser on Russia, told The Associated Press that the U.S. president has met his match because “Putin is a much bigger bully than Trump is.”\n\n“He’s run out of his persuasive powers with Putin,” said Hill, adding that Trump has “plenty” of coercive powers to use against the Russian leader but “he doesn’t want to use them.”\n\n“Ukrainians want peace for sure, and Putin wants pieces of Ukraine,” she said. “Very large pieces.”\n\nLeicester reported from Paris and Burrows from London. Associated Press writers Geir Moulson in Berlin, Elise Morton in London and Josh Boak in Washington contributed to this report.","summary":"In talks with European allies after Friday’s summit in Alaska, Trump said Putin reiterated that he wants the key Donetsk and Luhansk regions that make up the Donbas.","url":"https://www.mercurynews.com/2025/08/16/trump-reverses-on-the-need-for-a-ceasefire-before-a-potential-peace-deal-ending-the-war-in-ukraine/","image":"https://www.mercurynews.com/wp-content/uploads/2025/08/Trump_Putin_77308.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-16 22:45:41","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.219},{"id":351705328,"title":"Canada moves to halt strike as hundreds of flights grounded","text":"Canada’s labour minister said Air Canada might require five to 10 days to normalise services after the disruption. (EPA Images pic)\nTORONTO: The Canadian government intervened Saturday to end a strike by Air Canada cabin crew members that saw hundreds of flights cancelled and triggered summer travel chaos for the carrier's 130,000 daily passengers.\nCanada's largest airline, which flies directly to 180 cities worldwide, had stopped all operations after some 10,000 flight attendants began industrial action fuelled by a wage dispute just after midnight on Saturday.\nHours later, Canada's labour policy minister, Patty Hajdu, moved to invoke a legal provision that would halt the strike and force both sides into binding arbitration.\n\"This is not a decision that I have taken lightly. The potential for immediate negative impact on Canadians and our economy is simply too great,\" Hajdu told journalists.\nHowever, she said it could still take five to 10 days for Air Canada to resume regular services after the disruption.\nThe airline had earlier urged customers not to go to the airport if they have a ticket for Air Canada or its lower-cost subsidiary Air Canada Rouge.\nIt said flights by Air Canada Express, which are operated by a third party, would not be impacted by the walkout.\nThe Canadian Union of Public Employees (CUPE), which is representing the workers, said its members would remain on strike until the government formally issues an order that they return to work.\n\"Please remember there is only a referral, we are still in a legal position to strike and will continue to do so, we must show the company we are in control of this,\" the union's Air Canada branch wrote on Facebook.\nIn a separate statement, CUPE slammed the Canadian government's intervention as \"rewarding Air Canada's refusal to negotiate fairly by giving them exactly what they wanted.\"\n\"This sets a terrible precedent,\" it added. \"This will only ensure that the unresolved issues will continue to worsen by kicking them down the road.\"\nUnpaid groundwork \nIn addition to wage increases, the union says it wants to address uncompensated ground work, including during the boarding process.\nRafael Gomez, who heads the University of Toronto's Center for Industrial Relations, told AFP it is \"common practice, even around the world\" to compensate flight attendants based on time spent in the air.\nHe said the union had built an effective communication campaign around the issue, creating a public perception of unfairness.\nAn average passenger, not familiar with common industry practice, could think, \"'I'm waiting to board the plane and there's a flight attendant helping me, but they're technically not being paid for that work,'\" he said, speaking before the strike began.\n\"That's a very good issue to highlight,\" Gomez said, adding that gains made by Air Canada employees could impact other carriers.\nAir Canada detailed its latest offer in a Thursday statement, specifying that under the terms, a senior flight attendant would, on average, make C$87,000 (US$65,000) by 2027.\nCUPE has described Air Canada's offers as \"below inflation (and) below market value\".\nThe union has also rejected requests from the federal government and Air Canada to resolve outstanding issues through independent arbitration.\nCanada's economy, though showing resilience, has begun feeling the effects of US President Donald Trump's trade war, with his tariffs hitting crucial sectors like auto, aluminium and steel.\nIn a statement issued before the strike began, the Business Council of Canada warned an Air Canada work stoppage could add further pain.\n\"At a time when Canada is dealing with unprecedented pressures on our critical economic supply chains, the disruption of national air passenger travel and cargo transport services would cause immediate and extensive harm to all Canadians,\" it said.","summary":"The country’s top airline suspended operations as 10,000 flight attendants went on strike over pay from midnight Saturday.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/08/17/canada-moves-to-halt-strike-as-hundreds-of-flights-grounded","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1067/https://media.freemalaysiatoday.com/wp-content/uploads/2024/09/01af60be-air-canada-boeing-737-8-max-220921.webp","video":null,"publish_date":"2025-08-16 22:37:13","author":"AFP","authors":["AFP"],"language":"en","source_country":"my","sentiment":-0.398},{"id":351713764,"title":"In letter to Putin, US first lady asks him to consider the children in push to end war in Ukraine","text":"WASHINGTON — Melania Trump took the unique step of crafting a letter that calls for peace in Ukraine, having her husband President Donald Trump hand-deliver it to Russian President Vladimir Putin during their Friday meeting in Alaska.\n\nThe letter did not specifically name Ukraine, which Putin’s forces invaded in 2022, but beseeched him to think of children and “an innocence which stands above geography, government, and ideology.” Nor did the American first lady discuss the fighting other than to say to Putin that he could “singlehandedly restore” the “melodic laughter” of children who have been caught in the conflict.\n\n“In protecting the innocence of these children, you will do more than serve Russia alone — you serve humanity itself,” she wrote on White House stationery.\n\nA copy of the letter was first obtained by Fox News Digital and later posted on social media by supporters of the U.S. president, including Attorney General Pam Bondi.\n\nThe first lady said that Putin could help these children with the stroke of a pen.\n\nPutin’s invasion of Ukraine has resulted in Russia taking Ukrainian children out of their country so that they can be raised as Russian. The Associated Press documented the grabbing of Ukrainian children in 2022, after which the International Criminal Court said it had issued an arrest warrant for Putin for war crimes, accusing him of personal responsibility for the abductions of children from Ukraine.","summary":"Melania Trump took the unique step of crafting a letter that calls for peace in Ukraine, having her husband President Donald Trump hand-deliver it to Russian President Vladimir Putin.","url":"https://www.twincities.com/2025/08/16/in-letter-to-putin-us-first-lady-asks-him-to-consider-the-children-in-push-to-end-war-in-ukraine/","image":"https://www.twincities.com/wp-content/uploads/2025/08/Trump_Putin_Relationship_28718_5cb674.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-08-16 22:35:39","author":"Josh Boak","authors":["Josh Boak"],"language":"en","category":"politics","source_country":"us","sentiment":-0.011},{"id":351705594,"title":"Sir Keir Starmer accused of 'Houdini-like contortions' to avoid rebuking Peter Mandelson over 'flagrant breach' of diplomatic rules","text":"Sir Keir Starmer was accused last night of ‘Houdini-like contortions’ to avoid rebuking Peter Mandelson over a ‘flagrant breach’ of diplomatic service rules.\n\nThe Prime Minister faced pressure to explain how Lord Mandelson, now UK ambassador to the US, had not flouted clear political impartiality rules by speaking at a Labour party fundraiser.\n\nThe accusations came after the Mail on Sunday revealed that the ex-Labour Cabinet Minister had spoken at an event earlier this summer to raise money for Labour MPs’ Gregor Poynton and Imogen Walker, wife of Sir Keir’s chief of staff Morgan McSweeney.\n\nLabour responded at the time by insisting that Lord Mandelson, chosen over career diplomats by Sir Keir to be his man to deal with Donald Trump, had attended the event ‘in a personal capacity’ and did not play ‘any formal role in it’.\n\nBut the row dramatically escalated yesterday after the Government appeared to suggest that the manner of Lord Mandelson’s appointment would affect how strict diplomatic service rules were applied.\n\nSir Oliver Robbins, the Foreign Office permanent under-secretary, insisted that the code – which requires diplomats to observe ‘political impartiality’ – would be applied against the ‘backdrop’ that Lord Mandelson was directly appointed by Ministers.\n\nIn a letter sent to Tory frontbencher Richard Holden last month, Sir Oliver insisted that Lord Mandelson – who is currently ‘on leave of absence’ from the House of Lords - was ‘aware of his obligations under the Code’.\n\nHe then added: ‘Lord Mandelson was directly appointed to the role by Ministers to take advantage of his political experience and skill, and he and I will continue to apply the Code against that backdrop.’\n\nHowever, the Tories reacted in fury last night, with sources suggesting the Labour peer had only escaped punishment because of his party-political links.\n\nThey filed formal complaints against both Lord Mandelson and Sir Oliver.\n\nAlex Burghart, Shadow Chancellor of the Duchy of Lancaster, said: ‘This is a flagrant breach of the Diplomatic Code from Peter Mandelson.\n\n‘Whatever his party-political allegiances, he is now the UK's ambassador to Washington and the rules still apply to him.’\n\nMr Burghart added: ‘Keir Starmer is guilty of Houdini-like contortions to make it appear that everything is above board.\n\n‘It is not.\n\n‘As with so many of the PM's promises, his pledge in Opposition to clean up politics was worthless.’\n\nYesterday, the Mail on Sunday asked Foreign Office officials to point to the relevant part of the code which would exempt Lord Mandelson’s appearance at the fundraiser.\n\nA Government spokesperson replied: ‘It is for the Department to oversee and manage the implementation of this code for its staff, exactly as it would be for other government departments with the Civil Service Code.\n\n‘The Permanent Secretary has exercised his role in relation to the matter and set this out in his letter.’","summary":"The Prime Minister faced pressure to explain how Lord Mandelson, now UK ambassador to the US, had not flouted clear political impartiality rules by speaking at a Labour party fundraiser.","url":"https://www.dailymail.co.uk/news/article-15007253/Sir-Keir-Starmer-accused-Houdini-like-contortions.html","image":"https://i.dailymail.co.uk/1s/2025/08/16/23/101287901-0-image-a-51_1755383409205.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/05/29/8282702132168573929/1024x576_MP4_8282702132168573929.mp4","publish_date":"2025-08-16 22:32:42","author":"Brendan Carlin,Editor","authors":["Brendan Carlin","Editor"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.093},{"id":351697368,"title":"Turkish Leader Hopes Alaska Summit Paves Way for Enduring Peace Between Russia, Ukraine","text":"Ankara, August 16 (QNA) - The summit that convened US President Donald Trump and his Russian counterpart Vladimir Putin in Alaska had generated a new momentum for the efforts of halting the Russia-Ukraine war, said Turkish President Recep Tayyip Erdogan.\n\nErdogan added that he is hopeful the new stage will constitute an enduring peace with the participation of Ukrainian President Volodymyr Zelenskyy as well.\n\nPosting on his account on social media platforms on Saturday, Erdogan emphasized that Turkiye is ready to provide all forms of support to achieve peace between Russia and Ukraine. (QNA)","summary":"Ankara, August 16 (QNA) - The summit that convened US President Donald Trump and his Russian counterpart Vladimir Putin in Alaska had generated a new momentum for the efforts of halting the Russia-Ukraine war, said Turkish President Recep Tayyip Erdogan.","url":"https://qna.org.qa/en/news/news-details?id=turkish-leader-hopes-alaska-summit-paves-way-for-enduring-peace-between-russia-ukraine&date=16/08/2025","image":"https://cdn.qna.org.qa/media/5lcdbj2f/qna-erdugan-7-10-2022.jpg?width=1200&height=900&v=1db4a7ef984db50","video":null,"publish_date":"2025-08-16 22:31:00","author":"Israeli Gunfire","authors":["Israeli Gunfire"],"language":"en","category":"politics","source_country":"qa","sentiment":0.436},{"id":351697364,"title":"Saudi Arabia Backs Efforts to Resolve Russia-Ukraine Crisis Through Peaceful Means","text":"Riyadh, August 16 (QNA) - The Kingdom of Saudi Arabia has expressed its backing of all diplomatic efforts to resolve the Russia-Ukraine crisis through peaceful means and achieve peace between the two countries.\n\nThe Kingdom welcomed the Alaska Summit that convened US President Donald Trump and Russian President Vladimir Putin, the Saudi Ministry of Foreign Affairs said in a statement.\n\nThe statement further underscored the Kingdom's unwavering support for the path of diplomatic dialogue as a means to resolve all international disputes and conflicts. (QNA)","summary":"Riyadh, August 16 (QNA) - The Kingdom of Saudi Arabia has expressed its backing of all diplomatic efforts to resolve the Russia-Ukraine crisis through peaceful means and achieve peace between the two countries.","url":"https://qna.org.qa/en/news/news-details?id=saudi-arabia-backs-efforts-to-resolve-russia-ukraine-crisis-through-peaceful-means&date=16/08/2025","image":"https://cdn.qna.org.qa/media/uuviqd3h/qna_saudia-fm0801202024.jfif?width=1200&height=900&v=1db4f058d0f9100","video":null,"publish_date":"2025-08-16 22:31:00","author":"Israeli Gunfire","authors":["Israeli Gunfire"],"language":"en","category":"politics","source_country":"qa","sentiment":0.379},{"id":351705318,"title":"Germany proposes Trump-Putin-Zelensky summit be held in Europe","text":"After his ceasefire talks with Vladimir Putin faltered, Donald Trump declared a new focus on achieving lasting peace in Ukraine. (AFP pic)\nBERLIN: A three-way summit US President Donald Trump has mooted with Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin could take place in Europe, Germany's leader suggested on Saturday.\n\"I think that such a three-way meeting will take place,\" German Chancellor Friedrich Merz said in an interview with TV networks NTV and RTL, according to an advance transcript AFP obtained.\n\"The date and place are still to be worked out. We have proposed that a place could be found in Europe,\" he said.\nTrump, in the wake of his Friday summit with Putin in Alaska to speak about Ukraine, said he and European leaders wanted to see another summit take place, this time with a seat at the table for Zelensky.\nAfter his talk with Putin failed to make headway on a ceasefire in Ukraine, Trump shifted his stance to say he was now keen on securing a full peace agreement.\nOne challenge for Putin to step foot in Europe is that there is an International Criminal Court arrest warrant out for him over the alleged mass abduction of Ukrainian children during the war.\nThe US is not a party to the ICC, and Hungary – an EU country ruled by prime minister Viktor Orban, who is friendly with both Trump and Putin – is in the process of withdrawing from the ICC's founding treaty.\nMerz suggested that a European venue for the possible summit \"should maybe be a place where discussions might take place on a permanent basis\", but he did not specify any country or city.\n\"Those are detailed issues. They will only be clarified in coming days, or even coming weeks,\" he said.","summary":"After meeting Vladimir Putin in Alaska, Donald Trump said European leaders want another summit with Ukraine included.","url":"https://www.freemalaysiatoday.com/category/highlight/2025/08/17/germany-proposes-trump-putin-zelensky-summit-be-held-in-europe","image":"https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=scale-down,dpr=1,width=1600,height=1000/https://media.freemalaysiatoday.com/wp-content/uploads/2025/03/a9829980-zelensky-trump-putin-combo-pic-march-2025.webp","video":null,"publish_date":"2025-08-16 22:29:01","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"my","sentiment":-0.006}]}