{"offset":0,"number":50,"available":10419,"news":[{"id":327474366,"title":"US man charged for framing immigrant in fake plot to kill Trump","text":"Prosecutors in Milwaukee have charged a man with four felonies for attempting to frame an undocumented immigrant he is accused of assaulting, by sending forged letters in the immigrant’s name with a threat to kill Donald Trump.\n\nThe handwritten, forged letters were mailed to Wisconsin’s attorney general, Milwaukee police and US Immigration & Customs Enforcement (Ice). The story received a flood of media attention and was highlighted by the White House and Trump’s allies, but appears to have been a hoax.\n\nWISN-TV, an ABC affiliate in Milwaukee, reported on Monday that a criminal complaint alleges Demetric Scott admitted to investigators he wrote the letters threatening to kill the president in the name of Ramon Morales-Reyes, whom he was previously charged with assaulting.\n\nRelated: Undocumented man accused of making threat to Trump’s life may be victim of frame-up\n\nAmong those who fell for the hoax were Kristi Noem, the homeland security secretary, who released a statement praising immigration officers for arresting Morales-Reyes on 22 May, one day after the forged letter was received by an Ice field intelligence officer.\n\n“Thanks to our ICE officers, this illegal alien who threatened to assassinate President Trump is behind bars,” Noem said in a press release. Her department also released to news agencies an image of the handwritten note in light blue ink, expressing anger over Trump’s deportations and threatening to shoot him in the head with a rifle at a rally. Noem also shared the letter on X along with a photo of Morales-Reyes, and the White House also shared it on its social media accounts.\n\n“We are tired of this president messing with us Mexicans – we have done more for this country than you white people – you have been deporting my family and I think it is time Donald J. Trump get what he has coming to him,” the letter said. “I will self deport myself back to Mexico but not before I use my 30 yard 6 to shoot your precious president in the head – I will see him at one of his big ralleys.”\n\nBut the claim soon began to unravel.\n\nLast week, one of Morales-Reyes’ children told an immigrant rights group that he could not have written the letters since he cannot read or write in Spanish, let alone English.\n\nAs part of the investigation, officials asked Morales-Reyes for a handwriting sample and concluded his handwriting and the threatening letter didn’t match and that the threat was not credible, a source familiar with the investigation told the Associated Press.\n\nScott is currently in Milwaukee county jail, charged with armed robbery and aggravated battery. Prosecutors said Morales-Reyes is the victim in that case; he was allegedly assaulted in September 2023 with a box cutter during an attempted theft of his bike. As the case prepared to go to trial, Ice this month received the letter threatening to assassinate Trump.\n\nAccording to a transcript of a phone call prosecutors say Scott made while awaiting trial for assaulting Morales-Reyes, Scott framed Morales-Reyes to keep him from testifying against him. “If he gets picked up by Ice,” Scott allegedly said in the call, “there won’t be a jury trial, so they will probably dismiss it that day. That’s my plan.”\n\nMorales-Reyes works as a dishwasher in Milwaukee, where he lives with his wife and three children. He had recently applied for a U visa, which is carved out for people in the country illegally who become victims of serious crimes, according to his attorney.\n\nMorales-Reyes remains in Ice detention at a facility in Juneau, Wisconsin.\n\nJosé Olivares and Associated Press contributed reporting","url":"https://uk.news.yahoo.com/us-man-charged-framing-immigrant-005602203.html","image":"https://media.zenfs.com/en/theguardian_763/46d73b93ff020eaca273ea7577ce0bf4","video":null,"publish_date":"2025-06-03 00:56:02","author":"Robert Mackey","authors":["Robert Mackey"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.374},{"id":327474120,"title":"Walmart and Target workers are sharing pics of price increases amid Trump’s trade war","text":"Workers at Walmart and Target have been sharing evidence of price hikes that they believe to be caused by Donald Trump's tariffs.\n\nSince announcing his \"Liberation Day\" import taxes at the start of April, Trump has repeatedly raged at companies not to raise their prices — including Walmart, Ford, and Mattel.\n\n\"Walmart should STOP trying to blame Tariffs as the reason for raising prices,\" he posted last month. \"Between Walmart and China they should, as is said, ‘EAT THE TARIFFS,’ and not charge valued customers ANYTHING. I’ll be watching, and so will your customers!\"\n\nBut on Reddit boards dedicated to the two U.S. retail giants, eagle-eyed workers have also been tracking the situation.\n\n\"I work in Toys and we had about 600 price changes in the last couple days... EVERYTHING went up,\" one user posted last week. \"Most things went up $4, but the bigger toys like RCs and hover boards jumped a whole $40-50. It's f***ing crazy.\"\n\nAnother said: \"I work apparel and we've had to start tearing off the parts on the price tags where they had the original price, 'cause majority went up $5-$10 more.\"\n\nOne photo posted by a Walmart worker early May showed a toddler's ring-stacking toy increasing from $5.88 to $19.97 — a 240 percent increase. The toy is currently listed online for $8.23.\n\nMeanwhile, a Target worker uploaded a snap of them replacing the $9.99 tag on a six-foot phone charging cable with a new tag for $17.99, jacking up its price by 80 per cent.\n\nOther examples reported by Business Insider and Buzzfeed News, posted by both workers and customers, showed a dinosaur toy rising 38 percent from $39.92 to $55; a fishing reel jumping 45 percent from $57.37 to $83.26; a tablet computer climbing 23 percent from $79 to $97; and a roll of tape more than doubling from $4.24 to $9.94.\n\nBoth Walmart and Target executives have warned that they might soon have to raise prices due to Trump's tariffs on imported goods, which make it more expensive for companies to source products or components from other countries.\n\n\"We’re wired for everyday low prices, but the magnitude of these increases is more than any retailer can absorb,\" Walmart's chief financial officer told CNBC last month. \n\nIt's not clear whether either retailer is raising prices systematically across the board, and inflation figures for April showed little impact from Trump's tariffs. The Independent has asked Walmart and Target for comment.\n\nRetailers regularly change prices for all kinds of reasons, such as seasonal sales, temporary supply chain glitches, extreme weather due to global warming, or simple errors.\n\nNevertheless, many store workers on Reddit said they were seeing unusual numbers of price changes in their departments — a labor-intensive process for stores that have not implemented electronic price displays, since every label must be replaced by hand.\n\n\"Tons of price changes today,\" reported one Walmart worker in April. \"It’s been like that since the tariff stuff started,\" another replied.\n\n\"Been doing price change everyday for the past four months or so, and seeing everything going up all at once is really making me sad,\" said a Target worker in late May. \"I just feel terrible putting all these ridiculously high prices up.\"\n\nSome shared screenshots purportedly from their companies' internal apps, or photos of the giant stacks of tags they were sorting through, claiming there had been thousands or even tens of thousands of changes at their store.\n\n\"What the actual F?\" posted one Walmart worker in late April, alongside a screenshot showing 5,000 price changes that day alone.\n\nAnother worker responded wryly: \"Slow day?\"","summary":"‘I just feel terrible putting all these ridiculously high prices up,’ said one worker on Reddit","url":"https://www.independent.co.uk/news/world/americas/us-politics/walmart-target-tariffs-price-rises-b2762397.html","image":"https://static.independent.co.uk/2025/05/18/15/Companies-Tariff_Impact_00876.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/xDPS1eAw-4VHSaSK0.mp4","publish_date":"2025-06-03 00:53:46","author":"Io Dodds","authors":["Io Dodds"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.301},{"id":327472444,"title":"Russia sets out punitive terms at peace talks with Ukraine","text":"ISTANBUL - Russia told Ukraine at peace talks on Monday that it would only agree to end the war if Kyiv gives up big new chunks of territory and accepts limits on the size of its army, according to a memorandum reported by Russian media.The terms, formally presented at negotiations in Istanbul, highlighted Moscow's refusal to compromise on its longstanding war goals despite calls by U.S. President Donald Trump to end the 'bloodbath' in Ukraine.Ukraine has repeatedly rejected the Russian conditions as tantamount to surrender.","summary":"The terms highlighted Moscow's refusal to compromise on its longstanding war goals despite calls by U.S. President Donald Trump to end the \"bloodbath\" in Ukraine.","url":"https://www.japantimes.co.jp/news/2025/06/03/world/politics/russia-terms-peace-talks-ukraine/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/06/03/472844.JPG?v=3.1","video":null,"publish_date":"2025-06-03 00:49:00","author":"Huseyin Hayatsever,Tom Balmforth,Vladimir Soldatkin,Web Master","authors":["Huseyin Hayatsever","Tom Balmforth","Vladimir Soldatkin","Web Master"],"language":"en","category":"politics","source_country":"JP","sentiment":-0.359},{"id":327472442,"title":"U.S. pushes countries for best offers as tariff deadline looms","text":"The administration of U.S. President Donald Trump wants countries to provide their best offer on trade negotiations by Wednesday as officials seek to accelerate talks with multiple partners ahead of a self-imposed deadline in just five weeks, according to a draft letter to negotiating partners.The draft, from the office of the United States Trade Representative (USTR), provides a window into how Trump plans to bring to a close unwieldy negotiations with dozens of countries that kicked off on April 9 when he paused his 'Liberation Day' tariffs for 90 days until July 8 after stock, bond and currency markets revolted over the sweeping nature of the levies.The document suggests an urgency within the administration to complete deals against its own tight deadline. While officials such as White House economic adviser Kevin Hassett have repeatedly promised that several agreements were nearing completion, so far only one agreement has been reached with a major U.S. trading partner: Britain. Even that limited pact was more akin to a framework for ongoing talks than a final deal.","summary":"It will evaluate the responses, to be submitted by Wednesday, within days and offer \"a possible landing zone.\"","url":"https://www.japantimes.co.jp/news/2025/06/03/world/politics/us-best-offers-tariff-deadline/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/06/03/472845.JPG?v=3.1","video":null,"publish_date":"2025-06-03 00:46:00","author":"Jarrett Renshaw,Web Master","authors":["Jarrett Renshaw","Web Master"],"language":"en","source_country":"JP","sentiment":-0.246},{"id":327470836,"title":"Jesse Watters Quotes Maya Angelou to Prove Democrats Should Go to the Gym to Get More Manly | Video","text":"Jesse Watters quoted Maya Angelou to support his theory that Democrats should go to the gym more to get manlier and feel better about themselves.\n\nOn Monday’s episode of “The Five,” Watters talked about the difference in physique between senators John Thune and Chuck Schumer. He hypothesized that if more Democrats hit the gym they’d feel better about themselves and more people would want to follow them.\n\n“I saw Senator Thune at the gym. The man is jacked, the guy is in great shape and he lifts hard,” Watters said. “You look at Schumer, he’s built like a woman. Men do not want to be led by the party of women. Men want to be led by other men so Democrats need to become men, and then they can persuade men. But they have to lift first.”\n\nHe continued: “There’s a quote by Maya Angelou, ‘People will forget what you said, people will forget what you did, but people will never forget how you made them feel.’ People don’t like the way they feel around Democrats because Democrats don’t like the way they feel. If they lifted they’d feel better and then everyone around them would feel better.”\n\nThe group on the show were also commenting on recent headlines that Minnesota governor Tim Walz urged Democrats to “bully the s–t” out of President Donald Trump and how that may be the wrong tactic.\n\n“Maybe it’s time for us to be a little meaner,” the former vice presidential candidate said at the South Carolina Democrat Party’s annual convention. “Maybe it’s time for us to be a little more fierce because we have to ferociously push back on this.”\n\nWalz added: “When it’s a bully like Donald Trump, you bully the s–t out of him.”","summary":"\"Men want to be led by other men, so Democrats need to become men and then they can persuade men,\" the host adds\n\n\nThe post Jesse Watters Quotes Maya Angelou to Prove Democrats Should Go to the Gym to Get More Manly | Video appeared first on TheWrap.","url":"https://www.thewrap.com/jesse-watters-maya-angelou-quote-democrats-gym/","image":"https://www.thewrap.com/wp-content/uploads/2025/06/JesseWatters.jpg","video":null,"publish_date":"2025-06-03 00:41:39","author":"Jacob Bryant","authors":["Jacob Bryant"],"language":"en","category":"politics","source_country":"US","sentiment":0.209},{"id":327471068,"title":"'Up your game': Columnist says GOP senator broke 'one of the top rules of damage control'","text":"When Sen. Joni Ernst (R-Iowa) doubled down on her infamous \"we all are going to die\" comment on her Instagram account, she made several major mistakes that could prove harmful in next year's election.\n\nThat's according to the New York Times' Michelle Cottle, who used her Monday column to tear into the Iowa Republican for her viral faux \"apology\" video. Ernst — who is running for reelection to a third term in November of 2026 — sarcastically \"apologized\" for her remarks at a town hall last week in which she responded to constituents who yelled at her that the GOP's massive proposed cuts to Medicaid would kill people by saying, \"we all are going to die.\"\n\n\"I assumed that everyone in the auditorium understood that, yes, we are all going to perish from this earth,\" she said. \"So I apologize. And I'm really, really glad that I did not have to bring up the subject of the Tooth Fairy as well.\"\n\nREAD MORE: 'Who's going to tell him?' Senate GOP leader slammed for comment about low-income Americans\n\n\"Joni, Joni, Joni. You have been in the Senate for a while now. You should know one of the top rules of damage control is that when you’ve done something stupid, you shouldn’t prolong the drama by drawing attention to it. Unless your last name is Trump. But yours, Senator Ernst, clearly is not.\" Cottle wrote of Ernst's video, which she called \"so cringe.\"\n\nCottle contrasted Ernst's video with Trump's style of politics, and opined that the Iowa senator \"failed\" because she was \"trying so hard to be clever and witty\" with an \"awkward mishmash of insulting sarcasm and tongue-in-cheek proselytizing.\" She added that Ernst's video demonstrated what makes Trump's barbs so memorable, while that others who try to emulate him almost always fall flat.\n\n\"Like Ernst, I get that we are in an era of never-back-down politics, where brutality is seen as strength and regret is for losers,\" Cottle wrote. \"But Donald Trump is the ultimate showman. He delivers his hateful rhetoric with a dash of panache. He keeps his insults simple. Most important, he never looks as though he’s trying too hard.\"\n\n\"This shtick is harder to pull off than most people realize — or can ever hope to achieve,\" she added. \"But if you’re going to embrace the childish nihilism of MAGA, Senator Ernst, you really need to up your game.\"\n\nREAD MORE: 'Off to a great start': Experts mock Trump's FEMA chief after stunning admission\n\nClick here to read Cottle's full New York Times column (subscription required).","summary":"When Sen. Joni Ernst (R-Iowa) doubled down on her infamous \"we all are going to die\" comment on her Instagram account, she made several major mistakes that could prove harmful in next year's election.\n\nThat's according to the New York Times' Michelle Cottle, who used her Monday column to tear into the Iowa Republican for her viral faux \"apology\" video. Ernst — who is running for reelection to a third term in November of 2026 — sarcastically \"apologized\" for her remarks at a town hall last week in which she responded to constituents who yelled at her that the GOP's massive proposed cuts to Medicaid would kill people by saying, \"we all are going to die.\"\n\n\"I assumed that everyone in the auditorium understood that, yes, we are all going to perish from this earth,\" she said. \"So I apologize. And I'm really, really glad that I did not have to bring up the subject of the Tooth Fairy as well.\"\n\nREAD MORE: 'Who's going to tell him?' Senate GOP leader slammed for comment about low-income Americans\n\n\"Joni, Joni, Joni. ","url":"https://www.alternet.org/joni-ernst-damage-control/","image":"https://www.alternet.org/media-library/image.png?id=60356042&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-06-03 00:38:45","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","source_country":"US","sentiment":-0.056},{"id":327474152,"title":"With Tinder Implementing Height Filter, Is Weight Filter Just Around The Corner?","text":"Short kings everywhere were dealt a crushing blow this past weekend, as the popular dating app Tinder rolled out a new filter allowing women to pick and choose their men based on how they measure up. No, not in that way, you pervs (although that's probably next on the list). Now, listen, I'm a married man and haven't been on dating apps for over half a decade, but someone has to stand up for the sub-6-foot crowd! It is rather interesting that we are introducing height filters to the masses, while filters for other physical characteristics, like weight – something you can actually control – remain too taboo to be even uttered in more than a hushed tone, lest the body-positivity crowd finds out where you work and gets you fired. I get it, people have preferences. I'm a leggy 5-foot-10 (6 feet in cowboy boots, I swear), so it's not like I'm Mr. Tall, Dark, and Handsome. If I had a dog in the fight, I wouldn't exactly be in favor of the height filter being used on me, but all is fair in love and dating apps, I suppose. Some (most) women enjoy their men a little on the taller side. That's all fine and dandy. But can we at least level the playing field a little? If Stacy wants a man who's 6-2 making six-figures, surely Chad can set his preferences to \"girls who can fit into a size 5 dress.\" However, as one of my coworkers astutely pointed out, weight filters can be a tricky tactic. Someone who weighs 150 pounds and is 5-1 is going to look a lot different from someone who weighs that same 150 at 5-8. Or, as she so eloquently opined, \"Donald Trump and Derrick Henry might both weigh 240 (allegedly) but those ... those are not the same.\" It's not a perfect system, but it's a start. But why stop at weight? Let's really revolutionize the dating app game! Why not have an eye color, shoe size, or even an income filter? What do you think? Is a height filter out of bounds? What filters would you like to see implemented in the future? Email me at austin.perry@outkick.com. This married 32-year-old wants to live vicariously through you crazy Tinder-ers!","summary":"Short kings everywhere were dealt a crushing blow this past weekend, as the popular dating app Tinder rolled out a new filter allowing women to pick and choose their men based on height.","url":"https://www.outkick.com/culture/tinder-implementing-height-filter-weight-filter-around-corner","image":"https://static.outkick.com/www.outkick.com/content/uploads/2024/04/April-and-Amelia-Maddison-OnlyFans-millionaires.jpg","video":null,"publish_date":"2025-06-03 00:30:47","author":"Austin Perry","authors":["Austin Perry"],"language":"en","source_country":"us","sentiment":0.199},{"id":327468860,"title":"Kyodo News Digest: June 3, 2025","text":"The following is the latest list of selected news summaries by Kyodo News.\n\nJapan PM may seek snap election if no-confidence submitted\n\nTOKYO - Japanese Prime Minister Shigeru Ishiba may dissolve the House of Representatives for a snap general election if the main opposition party submits a no-confidence motion, a source close to the government leadership said Monday.\n\nIshiba, whose coalition holds a minority in the lower house, could take the move before any no-confidence motion is put to a vote in the chamber, the source said. If such a motion is submitted and approved, the prime minister must dissolve the lower house or the Cabinet must resign en masse within 10 days.\n\nTOKYO - Japanese baseball legend Shigeo Nagashima, who rose to stardom for his on-field exploits during the country's era of rapid economic growth in the 1960s and 1970s, died Tuesday, the Yomiuri Shimbun newspaper said. He was 89.\n\nNagashima, who was a key player of the Yomiuri Giants team that achieved nine consecutive Central League and Japan Series titles from 1965 to 1973 and later managed the club, was a charismatic figure whose popularity transcended sports.\n\nWhite House says Trump \"likely\" to speak with China's Xi this week\n\nWASHINGTON - U.S. President Donald Trump is \"likely\" to speak with Chinese leader Xi Jinping this week, the White House said Monday, amid renewed trade tensions between the two countries.\n\nThe prospect for such talks, mentioned to reporters by White House spokeswoman Karoline Leavitt, comes after China hit back at the United States over alleged violations of a temporary bilateral trade agreement reached in mid-May in Geneva.\n\nSouth Koreans begin voting in presidential election\n\nSEOUL - South Koreans began voting Tuesday in a presidential election to choose a successor to ousted President Yoon Suk Yeol, whose imposition of martial law deeply divided the nation and sent shockwaves across the country.\n\nMore than 14,000 polling stations opened at 6 a.m. and will close at 8 p.m. Of over 44 million eligible voters, about 34.7 percent have already cast ballots during early voting on Thursday and Friday.\n\nJapan crafts basic plan to support \"employment ice age\" generation\n\nTOKYO - The government on Tuesday mapped out a basic framework to support people in their 40s to 50s who fell victim to Japan's \"employment ice age,\" with a focus on easing retirement anxieties.\n\nOne key element is to provide \"safety net public housing,\" operated in a way that prevents aging people from being denied a home.\n\nTOKYO - Japan's revenue from a departure tax collected from travelers in fiscal 2024 hit a record high amid an influx in the number of visitors, the Finance Ministry said Monday.\n\nAlthough revenue from the tax for the full fiscal year, which runs from April to March, has yet to be calculated with final receipts gathered by the end of May, the total has already reached 48.1 billion yen ($34 billion), eclipsing the previous record of 44.3 billion yen in fiscal 2019, it said. The full total will be announced later.\n\nU.N. official looks to Japan as leader in disaster resilience efforts\n\nGENEVA - The focus of work related to natural disaster recovery must shift from rapid rebuilding to long-term resilience and inclusivity, and Japan can play a leading role in such efforts, according to the chief of the U.N. Office for Disaster Risk Reduction.\n\n\"We must stop building back fast with big promises and start building back better and more resilient,\" said Kamal Kishore, special representative of the U.N. secretary general for disaster risk reduction, in a recent interview with Kyodo News.\n\nSYDNEY - A Japanese footballer playing on an Australian A-League team has been arrested for alleged involvement in a betting scandal, Australian authorities said.\n\nRiku Danzaki, 25, a midfielder for Melbourne-based A-League club Western United, is suspected of deliberately receiving yellow cards during matches to manipulate betting outcomes, local media said.\n\nVideo: Dance troupe from West Bank performs at Osaka Expo's Palestine day","summary":"Art Aquarium Museum Ginza holds an exhibition in Tokyo's Ginza shopping district on May 31, 2025, ...","url":"https://english.kyodonews.net/news/2025/06/837cf2f7f308-kyodo-news-digest-june-3-2025.html","image":"https://img.kyodonews.net/english/public/images/posts/7b153fd85cdbeb7750a90468c861bc13/photo_l.jpg","video":null,"publish_date":"2025-06-03 00:26:35","author":null,"language":"en","source_country":"jp","sentiment":-0.03},{"id":327474372,"title":"Suspect charged with federal hate crime in attack on Colorado rally for Israeli hostages","text":"A man has been charged with a federal hate crime and multiple other felonies after he allegedly used a makeshift flamethrower and incendiary devices to attack a crowd of people who were raising awareness for Israeli hostages in Gaza, injuring 12 victims.\n\nMohamed Sabry Soliman, 45, is alleged to have shouted “Free Palestine” as he attacked the crowd on Sunday. The FBI said Soliman told police he planned the attack for a year and had specifically targeted what he described as the “Zionist group”, the Associated Press reported.\n\nAt a press conference on Monday the Boulder county district attorney said Soliman would be prosecuted for a federal hate crime and 16 counts of attempted murder. If convicted, he would be jailed for the rest of his life, with a cumulative of more than 600 years.\n\nAt the press conference, US attorney for the district of Colorado said in a statement that Soliman had resorted to molotov cocktails when he wasn’t able to obtain a gun. There were at least 16 unused molotov cocktails recovered from the scene, according to the US attorney’s office, district of Colorado.\n\nAn FBI affidavit said Soliman – upon confessing to Sunday’s attack after his arrest – told the police he would do it again.\n\nOfficials said there was no indication that the attack was associated with any group. NBC reported Soliman was an Egyptian national, and the White House claimed Soliman was in the US without legal status.\n\nFour women and four men between 52 and 88 years old, including a woman that a Department of Justice official said was a survivor of the Holocaust, were transported to hospitals, Boulder police said, with injuries ranging from minor to “very serious”. Four additional victims had minor injuries but were not hospitalized.\n\nThe attack took place on the Pearl Street Mall, close to the University of Colorado, during an event organized by Run for Their Lives, a group which aims to draw attention to the people taken hostage following Hamas’s 2023 attack on Israel.\n\nSoliman is alleged to have thrown a device into a group of people who had assembled in a pedestrianized zone for the peaceful rally. The Boulder police chief, Stephen Redfearn, said the department received calls at about 1.26pm local time on Sunday of a man with a weapon near a downtown courthouse and that people were being set on fire.\n\nBrooke Coffman, a 19-year-old University of Colorado student, told Reuters she saw four women lying or sitting on the ground with burns on their legs. One of them appeared to have been badly burned on most of her body and had been wrapped in a flag by someone, Coffman said.\n\nShe said she saw a man whom she presumed to be the attacker holding a glass bottle of clear liquid and shouting.\n\n“Everybody is yelling: ‘Get water, get water,’” Coffman said.\n\nAlex Osante, from San Diego, told the Associated Press he was having lunch on a restaurant patio across the pedestrian mall when he heard the crash of a bottle breaking on the ground, a “boom” sound followed by people yelling and screaming.\n\nIn a video of the scene filmed by Osante, people could be seen pouring water on a woman lying on the ground who Osante said had been burned during the attack.\n\nAfter the initial attack, Osante said the suspect went behind some bushes and then re-emerged and threw a molotov cocktail but appeared to accidentally set himself on fire as he threw it. The man then took off his shirt and what appeared to be a bulletproof vest before the police arrived. The man dropped to the ground and was arrested without any apparent resistance in the video that Osante filmed.\n\nThe justice department said one of the victims was a Holocaust survivor.\n\n“She endured the worst evil in human history. She came to America seeking safety,” said Leo Terrell, a senior counsel on civil rights in the justice department. “This is all caused by the same type of hatred: antisemitism.” Terrell, who leads the Trump administration’s antisemitism taskforce, was criticized in March after he shared a post by a white supremacist.\n\nMark Michalek, the FBI special agent in charge of the Denver field office, identified Soliman as the lone suspect.\n\n“It is clear that this is a targeted act of violence and the FBI is investigating this as an act of terrorism,” Michalek told a press conference, citing witnesses.\n\nKash Patel, the director of the FBI, described the incident as a “targeted terror attack”, and Colorado’s attorney general, Phil Weiser, said it appeared to be “a hate crime given the group that was targeted”.\n\nSoliman is due to appear in court at 1.30pm local time on Monday, according to Boulder county jail records. He is being held on a $10m bond. Law enforcement officials said Soliman was also injured and was taken to the hospital to be treated, but did not elaborate on the nature of his injuries.\n\nOn his Truth Social platform Monday, Donald Trump said the attack “will not be tolerated in the United States of America”. The US president also said acts of terrorism “will be prosecuted to the fullest extent of the law”.\n\nIn a post on X, Stephen Miller, the White House deputy chief of staff for policy, described Soliman as an “illegal alien” who had overstayed his tourist visa. Miller criticized Joe Biden’s presidential administration, whom he said had given Soliman a work permit.\n\nCNN, citing law enforcement officials, reported that Soliman arrived in the US in August 2022 as a non-immigrant visitor. It reported that the officials said he was granted a work authorization in March 2023, which expired at the end of March this year, more than two months into Trump’s presidency.\n\nSoliman had previously applied for asylum in the US, CNN reported. He was denied a visa to enter the country in 2005.\n\nMiller said the attack was further evidence of the need to “fully reverse” what he described as “suicidal migration”.\n\nIn his Truth post, Trump linked Soliman’s presence in the US to “Biden’s ridiculous Open Border Policy, which has hurt our country so badly”.\n\nTricia McLaughlin, assistant secretary for public affairs at the Department of Homeland Security, said Soliman was “illegally in our country”.\n\n“He entered the country in August 2022 on a B2 visa that expired on February 2023. He filed for asylum in September 2022,” McLaughlin said.\n\nThe attack comes amid heightened tensions over Israel’s war on Gaza, which in the US has spurred both an increase in both antisemitic and anti-Muslim hate crimes.\n\nIt follows the fatal shooting of two Israeli embassy employees in Washington DC who had attended an event hosted by the American Jewish Committee, an advocacy group that fights antisemitism and supports Israel.\n\nConservative supporters of Israel have branded pro-Palestinian protests as antisemitic, and Donald Trump’s administration has detained several protesters of the war without charge, while cutting off funding to elite US universities where protests against Israel’s war on Gaza have taken place.\n\nHamas launched an attack on Israel on 7 October 2023, killing about 1,200 people. It is still holding 58 hostages in Gaza, of whom 20 are believed to be still alive. Israel responded to the attack by launching a bombing campaign on Gaza which has killed more than 54,000 people.\n\nThe Israeli prime minister, Benjamin Netanyahu, said in a statement that the Colorado victims were attacked “simply because they were Jews” and that he trusted US authorities would prosecute “the cold blood perpetrator to the fullest extent of the law”.","url":"https://uk.news.yahoo.com/suspect-charged-multiple-felonies-attack-125757173.html","image":"https://media.zenfs.com/en/theguardian_763/86af4477a81d4fdae5cdaa09acd6d39c","video":null,"publish_date":"2025-06-03 00:26:03","author":"Adam Gabbatt And Agencies","authors":["Adam Gabbatt And Agencies"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.381},{"id":327469110,"title":"Harvard in court seeking end to US funding cuts","text":"Harvard University has asked a federal US judge to issue a summary judgment ruling to unfreeze $US2.5 billion ($A3.9b) in funding blocked by President Donald Trump's administration, which it says is illegal.\n\nHarvard's filing in the US District Court in Boston on Monday said that it had received 957 orders since April 14 to freeze funding for research pertaining to national security threats, cancer and infectious diseases and more since the country's oldest and wealthiest school rejected a White House list of demands.\n\nTrump has said he is trying to force change at Harvard - and other top-level universities across the US - because in his view they have been captured by leftist \"woke\" thought and become bastions of anti-Semitism.\n\nThe Trump administration did not immediately respond to a request for comment.\n\nUS District Judge Allison Burroughs has set arguments for July 21 on Harvard's motion for summary judgment, which is a request for a judge to decide a dispute without a trial to determine material facts.\n\nHarvard sued the Trump administration in April, alleging the funding freeze violated the school's right to free speech and was arbitrary and capricious.\n\nIn Monday's court filing, Harvard detailed the terminated grants, including $US88 million ($A136 million) for research into pediatric HIV, $US12 million ($A18 million) for increasing Defense Department awareness of emerging biological threats and $US8 million ($A12 million) to better understand dark energy.\n\nThe school said ending the funding would destroy ongoing research into cancer treatments, infectious disease and Parkinson's.\n\nThe Trump administration has opened numerous investigations into Harvard.\n\nSome are looking at threats against Jewish students and faculty after pro-Palestinian protests broke out following the October 7, 2023 Hamas attack on Israel and subsequent Israeli military actions in Gaza.\n\nOther investigations are probing whether Harvard discriminates based on sex and gender, along with the school's ties to foreign governments and international students.\n\nThe Trump administration revoked Harvard's ability to enrol international students last month, which a judge temporarily blocked after Harvard sued in a separate case.\n\nHarvard and other universities say Trump's attacks are threats to freedom of speech and freedom of academics, as well as threats to the schools' very existence.","summary":"Harvard University is seeking to unfreeze $3.9 billion in US federal funding, saying it stymies research on national security, cancer and other diseases.","url":"https://thewest.com.au/news/crime/harvard-in-court-seeking-end-to-us-funding-cuts-c-18903656","image":"https://images.thewest.com.au/publication/C-18903656/67c5778e54ae0ebc85eb9f08eca21bb1208b8ed8-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-06-03 00:21:54","author":"President Donald Trump,Tom Hals","authors":["President Donald Trump","Tom Hals"],"language":"en","category":"politics","source_country":"au","sentiment":0.031},{"id":327470774,"title":"The mother hoping to forge a global multi-million pound empire by championing women who refuse sex before marriage, stay at home and have babies - and buy her £142 milkmaid dresses","text":"Brittany Hugoboom, editor and co-founder of the glossy magazine Evie, arrives with a big smile on her face – and it's hard to interpret it as anything other than a smile of defiance.\n\nEvie – and Hugoboom – are controversial even in Donald Trump's US for their anti-feminist positions. Swipe past the professional fashion shoots and the celebrity gossip, and this is a magazine that advocates no sex before marriage, takes a stand against the Pill, and says feminism is making women depressed.\n\nVariously dubbed the Conservative Cosmo and the Tradwife's Bible, the online magazine has 100 million views per month, including a growing audience in the UK – according to Hugoboom – but is accused by critics of fundamentally undermining women's rights.\n\nHugoboom says she and Evie represent 'a resurgence of values and aspirations' that a huge section of the female population has been missing after decades of 'harmful' women's media.\n\nTo be fair, in the flesh, the glamorous 33-year-old former model and mother of two is nothing like my mental image of a 'tradwife' and certainly isn't dressed as some throwback 1950s hausfrau.\n\nToday, she's wearing a mini dress by the Indian designer Hemant & Nandita, with glimpses of glittery, sequinned Victoria's Secret bra straps at her shoulders. She's also sporting thick black Wolford tights and Doc Martens boots and there's a chunky diamond ring on her finger.\n\nMoreover, we're talking at a studio in buzzy and urban Brooklyn, New York, not a windswept prairie in Utah or Ohio. Still, the philosophy feels very 'surrendered' to me.\n\n'I think women want a softer life, a beautiful life, rather than feeling all this pressure to do things like a man,' Hugoboom tells me.\n\nWomen, she says, want to 'reclaim their femininity'. Yes, they can work – but lots of us have 'girlboss' burnout. Single women are fed up with casual sex and being shamed for wanting to meet The One, get married, stay at home and have babies. 'Natural' birth control is better than the Pill.\n\nCritics say it's an old narrative that threatens to reduce women and make their lives smaller. Furthermore, detractors say it's an example of how misinformation and hard-Right ideas can be made more appealing if they are hidden among make-up tips, sex life advice – albeit for 'married women only' – and surprisingly sexy fashion shoots for a magazine that thinks women should be virgins on their wedding night.\n\nIndeed, some commentators on social media have gone further, claiming Evie and its editor are positively 'dangerous'. Hugoboom laughs when I put this to her. 'I'm not dangerous. It's bizarre, because there are so many other magazines for women out there and nobody ever calls them out for their Left-wing slant.\n\n'We want to empower women and give them media that reflects their values rather than confusing and shaming them. And 95 per cent of our content isn't political.'\n\nCertainly, there are articles that might run in any other women's magazine. And then there are headlines like 'Want your husband to get you pregnant? Cook him these ten dishes'.\n\nAnd: 'Three surprisingly common ways women disrespect their husbands (without meaning to)'.\n\nThere's an article by a (male) sociology professor that claims 'women's independence and gender equality is a factor in the long-term decline in marriage'. Hillary Clinton is referred to as the 'twice-failed' presidential candidate (the website endorsed President Trump for his second term).\n\nEvie has also run criticisms of no-fault divorce and the IVF industry (largely on the grounds that IVF encourages women to leave having children till later).\n\nHugoboom founded the magazine in 2019 with her husband Gabriel, 33, who has accompanied his wife to our meeting but has so far remained in the background. The couple have two daughters, aged one and three.\n\nBut it's not just a mag, it turns out – Evie is an entire concept. An empire of hyper-femininity, if you like. There's the release of the Raw Milkmaid Dress, for example, which is modelled by Hugoboom and features a corseted body, cinched waist and leg slit (Hugoboom, we're told, has a 32G bust). Described as '100 per cent feminine energy', the dress originally came in five colours, cost $189 (£142) and was advertised with the phrase: 'Warning: Wearing this dress may get you arrested for being too hot.'\n\n'It sold out within the week, except for size small in white,' shrugs Hugoboom.\n\nThere's also a female wellness app called 28, which encourages women to track their menstrual cycle instead of taking the Pill or using other birth control methods. The couple have their own femtech company, which is backed to the tune of £1.5m by Trump-supporting tech titan Peter Thiel.\n\n'A lot of young women are getting off the Pill because of side-effects,' says Hugoboom. 'It's the first time in history where perfectly healthy women are taking a pill every single day – my doctor tried to prescribe it to me for acne.\n\n'Women are being prescribed it for all sorts of reasons and having horrible side-effects. Every person reacts differently, and I think if some women have issues with it, they shouldn't be told that it's all in their heads – they should be taken seriously.'\n\nIt's ironic, of course, that Hugoboom runs two businesses, because another theme in her magazine is that women feel too much pressure to keep up with men in the workplace.\n\n'Girl-boss feminism? I think women are over it,' she says. 'It's in our nature to have more of a work-life balance than men. I think men sometimes make themselves sick trying to succeed and become CEOs, and I don't think women have the same drive.\n\n'Why are we putting women in a box where they have to wear a pantsuit and go to an office and act like a man? Why can't women want love and romance and find joy in babies and all the little things?'\n\nEvie has a staff of ten and Hugoboom is in charge of the editorial side, while her husband does the business and operations side. They work together on an annual print copy.\n\nAs the couple has recently moved from Miami to New York, they usually order food or eat out, but she likes to cook when she has the chance.\n\nAre household tasks evenly divided between husband and wife, I wonder? 'He takes out the garbage and stuff like that, and I suppose I do the rest,' she says.\n\nIt's one of the few occasions when she sounds like every other thirtysomething woman. Almost everything else she says has an edge of controversy.\n\nThanks to weight-loss drugs such as Ozempic and Mounjaro, for example, the body positive movement, which encouraged women to accept themselves no matter their size or shape, has now run its course, Hugoboom thinks.\n\n'It proves that the body positivity movement was a coping mechanism because the second they [the drugs] came out, people rushed to get them.'\n\nOne of Evie's cover models is Hannah Neeleman, the former Julliard-trained ballet dancer who spearheaded the tradwife phenomenon. She and her husband Daniel, the son of the founder of the JetBlue airline, live with their large brood of children on a 328-acre farm in Utah and have 10 million followers online. Famously Neeleman won the Mrs America title 12 days after giving birth to her youngest – and eighth – child.\n\nIs she the ultimate Evie woman? 'I think she could be,' says Hugoboom, animatedly. 'I think she's incredible and beautiful and extremely inspiring. I couldn't do what she does, but I respect her.\n\n'I started following her after she'd had her eighth baby and did the beauty pageant. I'd just had my second baby, and I certainly could not have competed in a beauty pageant. She reminds me of a Jane Austen heroine… she's obviously a very strong and joyful woman.'\n\nHugoboom says she is not a 'tradwife' and points out that she and her husband established their magazine before the term emerged.\n\n'I think being a tradwife is more of a privilege. If you live somewhere in middle America the family might be able to live off the husband's salary but in New York or LA, unless your husband was extremely rich, you couldn't.'\n\nOf course, the same applies in the UK – even if a woman wanted to adhere to strictly traditional gender roles, realistically most households require two incomes to pay the bills.\n\nOf all the subjects we talk about, Hugoboom is most animated when we talk about marriage. She and her husband met at college, when they were both 18. Both came from Catholic families – she is one of four children, and he is one of eight. They got engaged in front of the Vatican in Rome.\n\nThere's plenty of advice about sex in Evie, but it is all in the context of marriage. Headlines include: 'I'm a virgin, how do I make my wedding night go smoothly?' and 'The art of oral sex: a wife's guide'.\n\nWas Hugoboom a virgin when she met her husband-to-be? 'I was,' she says, looking rather startled by the question.\n\nShe thinks few people nowadays have a positive view of marriage. In 2023 she posted on X about her sixth wedding anniversary, describing being whisked away by her husband to a luxury hotel and a bed strewn with rose petals, and being presented with jewellery and Agent Provocateur lingerie.\n\n'It went viral in a bad way, and it was mostly men saying the whole thing was unrealistic. I'm tired of seeing marriage and motherhood being promoted as a ball-and-chain situation where the wife is naggy and wears an ugly sweatshirt because the baby's puked on her.\n\n'I believe in committed love and always working to improve your marriage and not letting it go stale, and Evie readers believe that, too.'\n\nHer husband, she continues, is 'the greatest man on the planet'. 'He's a romantic, and the most courageous person I've ever met. He doesn't care what people think of him. He's fearless. He's an excellent hunter [of white-tailed deer]. I could go on and on about him.'\n\nLike George Clooney and his wife Amal, they rarely row, she says. 'We're very ying and yang. Neither of us is highly emotional. He's more extroverted while I'm more introverted.'\n\nAnd besides, her husband has no faults at all, except perhaps the fact 'he hates germs and he hates rats, so he won't take the subway'.\n\n'How does she keep the spark alive?', I force myself to ask. 'I like to dress sexy around the house,' she replies, adding that she will wear a dress with a bit of cleavage. Every couple wants love and romance, I suggest, but surely that's often lost in the day-to-day grind? 'Yes, but you can choose every day to be grateful for the little things. I'm annoyingly optimistic.'\n\nGabriel sounds like a paragon of virtue, so we call him over. Tall and bearded, he's friendly but clearly intensely focused on the couple's mission and does not seem bothered that it is attracting so much disapproval from the mainstream female universe.\n\n'We're looking at building a feminine media empire – a podcast division, getting into fiction and non-fiction, and we're in talks with some studios and production companies about scripted and unscripted shows,' he says.\n\n'I think Evie has a unique voice to serve a demographic that hasn't been served in America for decades and we're very excited about the future.'\n\nWhat does he think about the criticism levelled at him and his wife and Evie? 'Criticism? What criticism?' he jokes. 'I think there's a lot of people who had an agenda [against us] right from the very beginning.'\n\nMenstrual cycle apps, milkmaid dresses, podcasts… I wonder if Hugoboom sees herself as the next Gwyneth Paltrow. 'Selling those candles? she interjects, referring to the famous Goop candle called This Smells Like My Vagina.\n\n'I love Gwyneth Paltrow. I love Goop. She's beautiful and fascinating and does things that no one else has done. I have a lot of respect for her but, no, I don't imagine us selling candles like that.'\n\nAnother woman she admires is First Lady Melania Trump. In March, the whole family was invited to the White House for Women's History Month. 'I think Melania is beautiful,' she says. 'I'd love to have her on the cover of Evie…\n\n'I'm writing a book right now,' she reveals. 'It will be about women being able to rediscover their femininity and use it for whatever end is best for them.'\n\nShe will also continue building her empire with her husband, and adding to her family of two girls. 'I'd like two boys but I'm going to wait a year or so,' she says.\n\nHugoboom claims Evie is spearheading a major cultural shift and says she takes the responsibility seriously. Plenty of people would take issue with that analysis, of course – yet the backlash against Diversity, Equity and Inclusion and, by extension, feminism – in the US at least – is undeniable.\n\nDoes she feel she's harshly judged? 'Yes, but so are the Kardashians and so is Hannah Ballerina Farm [Hannah Neeleman] and everyone in the spotlight. I think beauty and charm are some of the most powerful tools women can utilise and they're fed up with this ugliness agenda.\n\n'They're being told that femininity is a weakness and it's not. My critics don't keep me awake at night. Only my babies do.","summary":"Brittany Hugoboom, editor and co-founder of the glossy magazine Evie, arrives with a big smile on her face - and it's hard to interpret it as anything other than a smile of defiance.","url":"https://www.dailymail.co.uk/femail/article-14773421/Feminism-making-depressed-Natural-birth-control-better-Pill-women-girlboss-burnout-mum-conservative-dubbed-Tradwifes-Bible.html","image":"https://i.dailymail.co.uk/1s/2025/06/02/21/98973073-0-image-m-95_1748894465704.jpg","video":null,"publish_date":"2025-06-03 00:20:16","author":"Barbara McMahon,Editor","authors":["Barbara McMahon","Editor"],"language":"en","source_country":"gb","sentiment":0.096},{"id":327471516,"title":"Lone wolf attacks in Boulder and D.C. highlight the difficulties in securing public spaces","text":"BOULDER, Colo. — Once again, the war in Gaza has come home to America. A man using what police called a \"makeshift flamethrower\" launched a gruesome attack on demonstrators in Boulder on Sunday, raising questions about why security wasn't stronger in the wake of an earlier attack in Washington, D.C. Run for Their Lives, the organization behind the long-standing demonstration that advocated for the return of Israeli hostages, had anticipated that its members would have safety concerns. The group offered principles to make the events safer, including \"don't protest,\" \"be polite and peaceful\" and \"don't disturb your neighbors.\" \"Focus on humanity,\" the guidance on its website says. \"This is about innocent children, women, the elderly, and other civilians being held by terrorists—not about the war.\" The Boulder chapter of Run for Their Lives has been holding regular demonstrations demanding that Hamas release the hostages seized during the terrorist attack on Israel on Oct. 7, 2023. Kyle and Elizabeth Shorter, who live in a Denver suburb and were taking their wedding pictures in Boulder when the attack happened, said the Run for Their Lives demonstrators had become fixtures on the street. “Every time we’ve come up here the past couple of years, they’ve always been here,” said Elizabeth Shorter, 26. “They’ve never been aggressive or chanting, just simply walking.” And that, an expert said, could make them harder to protect from a terrorist. “Usually, there is a regular detail assigned to protect protesters,” said Brian Higgins, who teaches at the John Jay College of Criminal Justice in New York City and runs a security consulting firm called Group 77. “But it’s not uncommon for a mindset to set in that, as time goes on and nothing out of the ordinary happens, that there’s no need to be on high alert.” Higgins, who said he wasn’t aware of what security measures Boulder police had in place Sunday, was taken aback by video that showed the attacker threatening people before police intervened. “That shouldn’t have happened,” Higgins said. “That raises questions for me about how much security there was at this protest.” Police Chief Stephen Redfearn said his department is aware of events taking place later in the month and will plan to provide additional security coverage. “We want to ensure that people feel comfortable and safe in this community,” he told reporters on Monday. Shira Weiss, global coordinator for Run for Their Lives, said that some chapters have long relied on protection from local police or private security but that it's \"really the individual group leader’s decision how and when they want to use security.\" And while some local chapters have paused to \"recompose themselves and give themselves space to heal\" after the Boulder attack, others have said, \"We won’t stop; we’re going to be right back out there next week,\" Weiss said. “We obviously keep reiterating to our group leaders that safety is the No. 1 priority,” she said. Although clearly frightened by what she witnessed, attack survivor Lisa Turnquist, 66, said she won't be deterred from speaking out against Hamas and on behalf of the Israeli hostages. \"This is when we have to get up and we have to stand out and push back,\" said Turnquist, who spoke to a reporter outside the historic Boulder County Courthouse, where the attack happened. \"We just want the hostages home.\" A dozen people were injured Sunday, eight of whom remain hospitalized, authorities said. Initial calls to police reported people \"being set on fire,\" and officers found multiple victims with burns and other injuries, Boulder's police chief told reporters. Egyptian national Mohamed Sabry Soliman, 45, has been charged with attempted murder and a hate crime, among other offenses. The attack happened just 11 days after two Israeli Embassy workers were gunned down outside the Capital Jewish Museum in Washington. In both the Boulder and the Washington attacks, the attackers are alleged to have yelled the same thing: “Free Palestine.” Security experts who spoke with NBC News questioned how the man in Boulder was able to allegedly launch such an attack downtown even amid heightened awareness after the Washington killings. Higgins said his security clients include several major Jewish organizations. And ever since the killings of Israeli Embassy workers Yaron Lischinsky and Sarah Milgrim on May 22, they have been adding extra layers of security, he said. “Given what’s going on out there and the agitation out there, my recommendation is that there should be an elevated level of security at all Gaza protests,” Higgins said. Run for Their Lives has been holding regular demonstrations outside the county courthouse on Pearl Street since Hamas launched a bloody surprise attack on Israel and took 250 hostages. That spawned an Israeli invasion of Gaza that has left more than 54,000 people dead, many of them women and children, according to the Gaza Health Ministry. Michael Alcazar, a former hostage negotiator with the New York Police Department who also teaches at John Jay, said Pearl Street is a soft target for a terrorist attack. He said the attacker was able to approach the demonstrators because they didn’t appear to be protected. “The police chief dropped the ball not having a uniform presence over there,” Alcazar said. “Is the police chief not aware of what’s going in the world?” The Boulder Police Department didn't immediately respond to requests for comment. The Anti-Defamation League said it had been in contact with local law enforcement in Boulder. “We feel at ADL like many across the country feel, which is just vulnerability and both sadness and anger at the violence that we’ve seen,” said Oren Segal, the Anti-Defamation League’s senior vice president for counterextremism and intelligence. “This is a wake-up call — not just for the Jewish community.\" The FBI also said in a statement that \"our goal is always to get ahead of any threats.\" \"We have long warned that lone actors or small groups of conspirators present a great challenge to law enforcement because there may not be a lot of clues about their intentions,\" it said. An affidavit alleged that Soliman, a married father of five, had been planning the attack for over a year and was waiting for one of his daughters to graduate before he set his alleged plan into motion. It didn't specify where his daughter was graduating from. Soliman told investigators during his arrest interview that he researched how to make Molotov cocktails on YouTube, according to the affidavit. It alleged that he was also unrepentant about the attack, saying he would do it again to stop Israel from taking over “our land,” referring to the Palestinian territories. Elias Rodriguez, the Chicagoan charged with the deaths of Lischinsky and Milgrim, was also motivated by the Gaza war, authorities said. He told police when he was arrested, “I did it for Palestine, I did it for Gaza,” according to court records and published reports. In his first comments since the attack, President Donald Trump condemned the \"horrific\" incident Monday on Truth Social. Earlier, White House deputy chief of staff Stephen Miller sought to shift blame onto the Biden administration for allowing Soliman in the country. “He was granted a tourist visa by the Biden Administration and then he illegally overstayed that visa,” Miller said Sunday on X. “In response, the Biden Administration gave him a work permit.” Tricia McLaughlin, a spokesperson for the Department of Homeland Security, amplified that on X, saying that Soliman \"is illegally in our country\" and that he applied for asylum in September 2022. McLaughlin later told NBC News that Soliman's asylum claim was pending and that while his visa had expired, he hadn't yet exhausted all legal routes to stay in the United States. Deon J. Hampton reported from Boulder, Alicia Victoria Lozano reported from Los Angeles and Elizabeth Chuck and Corky Siemaszko from New York City.","summary":"Once again, the war in Gaza has come home to America.","url":"https://www.nbcnews.com/news/us-news/lone-wolf-attacks-boulder-dc-highlight-difficulties-securing-public-sp-rcna210369","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2025-06/250602-boulder-attack-vl-1245p-81957c.jpg","video":null,"publish_date":"2025-06-03 00:19:08","author":"Alicia Victoria Lozano,Corky Siemaszko,Deon J. Hampton,Elizabeth Chuck","authors":["Alicia Victoria Lozano","Corky Siemaszko","Deon J. Hampton","Elizabeth Chuck"],"language":"en","source_country":"na","sentiment":0.221},{"id":327474370,"title":"Trump news at a glance: US-China trade relations falter amid fragile trade truce","text":"President Donald Trump had this May hailed a “total reset” of US-China relations, but trade relations between the world’s two-largest economies have faltered since, highlighting the fragility of the truce.\n\nThe US is now complaining that China not delivered on its promises to roll back restrictions on the export of key critical minerals, with Trump saying on Friday that China had “totally violated” the agreement.\n\nChina has also hit back, with its commerce ministry saying this week that China “is determined to safeguard its rights and interests”. It also denied the accusation it had undermined the 12 May agreement.\n\nHere are the key stories at a glance:\n\nChina accuses US of ‘seriously violating’ trade truce\n\nChina has accused the US of “seriously violating” the fragile US-China detente that has been in place for less than a month since the two countries agreed to pause the trade war that risked upending the global economy.\n\nOAN reporter fired after criticizing Hegseth\n\nA pro-Donald Trump journalist says she was fired from her job after criticizing the president’s secretary of defense, Pete Hegseth, over his attempts to restrict media access at the Pentagon.\n\n20 Planned Parenthood clinics shutter this year\n\nAt least 20 Planned Parenthood clinics across seven states have shuttered since the start of 2025 or have announced plans to close soon – closures that come amid immense financial and political turbulence for the reproductive health giant as the United States continues to grapple with the fallout from the end of Roe v Wade.\n\nTrump officials open up millions of acres in Alaska to drilling and mining\n\nMillions of acres of Alaska wilderness will lose federal protections and be exposed to drilling and mining in the Trump administration’s latest move to prioritize energy production over the shielding of the US’s open spaces.\n\nUS leaders condemn attack on Colorado rally for Israeli hostages\n\nPolitical leaders across the US have condemned what they describe as a horrific, antisemitic attack in Boulder, Colorado, after a man allegedly used a makeshift flamethrower and incendiary devices to target people at a rally calling for the release of the hostages held by Hamas.\n\nTrump pardons shark divers\n\nDonald Trump has pardoned two south Florida shark divers convicted of theft for freeing 19 sharks and a giant grouper from a fisherman’s longline several miles from shore. Pardons for Tanner Mansell and John Moore Jr were signed on Wednesday. They had been convicted in 2022 of theft of property within special maritime jurisdiction.\n\nWhat else happened today:\n\nTrump administration officials sparked a huge protest in a Boston suburb after immigration agents detained a high school student while they were seeking his father.US senator Joni Ernst triggered fierce criticism after making light of voters’ fears that Republican Medicaid cuts could prove fatal.Massachusetts Institute of Technology barred its 2025 class president from attending her graduation ceremony after she delivered a speech condemning the war in Gaza and criticizing the university’s ties to Israel.\n\nCatching up? Here’s what happened on 1 June 2025.","url":"https://uk.news.yahoo.com/trump-news-glance-us-china-001639966.html","image":"https://media.zenfs.com/en/theguardian_763/502f9730c86e094dc23375ab9dfcbda3","video":null,"publish_date":"2025-06-03 00:16:39","author":null,"language":"en","category":"politics","source_country":"gb","sentiment":-0.074},{"id":327471842,"title":"Trump, pushing for Ciattarelli, says New Jersey 'ready to pop out of blue horror show'","text":"TRENTON, N.J. (AP) — President Donald Trump on Monday implored voters in New Jersey’s primary for governor to support Republican Jack Ciattarelli when early in-person voting begins Tuesday and said the state was ready for a change after years of Democratic control.\n\nThe president, who has golf clubs around the state and frequently stays at his Bedminster property, announced his endorsement for Ciattarelli last month.\n\nOn Monday, Trump held a telephone rally for the candidate, a former state lawmaker who transformed from a critic to vocal backer of the president. The phone call lasted about 10 minutes, with the president saying that voters will decide whether New Jersey remains a “high-tax, high-crime sanctuary state.”\n\n“New Jersey is ready to pop out of that blue horror show and really get in there and vote for somebody that’s going to make things happen,” the president said.\n\nTrump’s call for early voting echoed the pitch he made to voters in the 2024 presidential election.\n\nCiattarelli said his first executive order if elected would be to end any sanctuary policies for immigrants in the country illegally. Currently, the state attorney general has directed local law enforcement not to assist federal agents in civil immigration matters.\n\nThere is no legal definition for sanctuary city policies, but they generally limit cooperation by local law enforcement with federal immigration officers.\n\nCiattarelli also said the attorney general he appoints if he wins won’t be bringing lawsuits against the White House. New Jersey’s current attorney general has pursued several high-profile challenges to the president’s agenda, including a case challenging Trump’s order calling for the end of birthright citizenship.\n\nCiattarelli is running against former radio talk host Bill Spadea, state Sen. Jon Bramnick, former Englewood Cliffs Mayor Mario Kranjac and a southern New Jersey contractor named Justin Barbera.\n\nEarly in-person voting begins Tuesday and goes through Sunday. Primary day is June 10, though voters have been sending mail-in ballots in since late April.\n\nThough the primary isn’t over, Ciattarelli hinted at what attacks against his eventual Democratic challenger in the general election might be, saying the party’s eight years in the governorship and more than two decades of power in the legislature have been a failure.\n\nThe Democratic field isn’t set. There’s a six-way contest between Reps. Josh Gottheimer and Mikie Sherrill; Mayors Ras Baraka of Newark and Steven Fulop of Jersey City; former state Senate President Steve Sweeney; and teacher’s union president Sean Spiller.\n\nNew Jersey tilts Democratic in presidential and Senate elections in particular, and the party has a roughly 800,000 voter registration advantage over Republicans. But independents make up a significant bloc as well, and voters have tended to alternate between Democratic and Republican administrations for governor.","summary":"TRENTON, N.J. (AP) — President Donald Trump on Monday implored voters in New Jersey’s primary for governor to support Republican Jack Ciattarelli when early in-person voting begins Tuesday and said the state was ready for a change after years of…","url":"https://www.thestar.com/news/world/united-states/trump-pushing-for-ciattarelli-says-new-jersey-ready-to-pop-out-of-blue-horror-show/article_f69871db-a9f7-5271-9039-875f1bc11860.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/8/bc/8bc839e7-4cc1-5963-a1bf-d219ce4f3fd6/683e3e85a2bf6.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-06-03 00:11:04","author":"Mike Catalini The Associated Press","authors":["Mike Catalini The Associated Press"],"language":"en","source_country":"ca","sentiment":-0.237},{"id":327470432,"title":"Ukraine and Russia agree to swap dead and wounded troops but report no progress toward ending war","text":"Representatives of Russia and Ukraine met Monday for their second round of direct peace talks in just over two weeks, but aside from agreeing to swap thousands of their dead and seriously wounded troops, they made no progress toward ending the 3-year-old war, officials said.The talks unfolded a day after a string of stunning long-range attacks by both sides, with Ukraine launching a devastating drone assault on Russian air bases and Russia hurling its largest drone attack of the war against Ukraine.At the negotiating table, Russia presented a memorandum setting out the Kremlin’s terms for ending hostilities, the Ukrainian delegation said.Defense Minister Rustem Umerov, who led the Ukrainian delegation, told reporters that Kyiv officials would need a week to review the document and decide on a response. Ukraine proposed further talks on a date between June 20 and June 30, he said.After the talks, Russian state news agencies Tass and RIA Novosti published the text of the Russian memorandum, which suggested that Ukraine withdraw its forces from the four regions that Russia annexed in September 2022 but never fully captured as a condition for a ceasefire.As an alternate way of reaching a truce, the memorandum presses Ukraine to halt its mobilization efforts and freeze Western arms deliveries, conditions were suggested earlier by Russian President Vladimir Putin. The document also suggests that Ukraine stop any redeployment of forces and ban any military presence of third countries on its soil as conditions for halting hostilities.The Russian document further proposes that Ukraine end martial law and hold elections, after which the two countries could sign a comprehensive peace treaty that would see Ukraine declare its neutral status, abandon its bid to join NATO, set limits on the size of its armed forces and recognize Russian as the country's official language on par with Ukrainian.Ukraine and the West have previously rejected all those demands from Moscow.RELATED STORY | Russia and Ukraine swap hundreds of prisoners, hours after Moscow's largest missile-and-drone attackIn other steps, the delegations agreed to swap 6,000 bodies of soldiers killed in action and to set up a commission to exchange seriously wounded troops.Kyiv officials said their surprise drone attack Sunday damaged or destroyed more than 40 warplanes at air bases deep inside Russia, including the remote Arctic, Siberian and Far East regions more than 7,000 kilometers (4,300 miles) from Ukraine.The complex and unprecedented raid, which struck simultaneously in three time zones, took over a year and a half to prepare and was “a major slap in the face for Russia’s military power,\" said Vasyl Maliuk, the head of the Ukrainian security service, who led its planning.Zelenskyy called it a “brilliant operation” that would go down in history. The effort destroyed or heavily damaged nearly a third of Moscow’s strategic bomber fleet, according to Ukrainian officials.Russia on Sunday fired the biggest number of drones — 472 — at Ukraine since its full-scale invasion in 2022, Ukraine’s air force said, in an apparent effort to overwhelm air defenses. That was part of a recently escalating campaign of strikes in civilian areas of Ukraine.U.S.-led efforts to push the two sides into accepting a ceasefire have so far failed. Ukraine accepted the proposed truce, but the Kremlin effectively rejected it. Recent comments by senior officials in both countries indicate they remain far apart on the key conditions for stopping the war.The previous talks on May 16 in the same Turkish city were the first direct peace negotiations since the early weeks of Moscow’s 2022 invasion. Turkish President Recep Tayyip Erdogan said the fact that the two sides met again Monday was an achievement in itself amid the fierce fighting.“The fact that the meeting took place despite yesterday’s incident is an important success in itself,” he said in a televised speech.Zelenskyy said during a trip to Lithuania on Monday that a new release of prisoners of war was being prepared after the Istanbul meeting. The May 16 talks also led to a swap of prisoners, with 1,000 on both sides being exchanged.During the talks, Zelenskyy said, the Ukrainian delegation handed over a list of nearly 400 abducted children. Russia responded by proposing to “work on up to 10 children.”\"That’s their idea of addressing humanitarian issues,” Zelenskyy said Monday during an online briefing with journalists.The International Criminal Court issued an arrest warrant in 2023 for Putin and the country’s commissioner for children’s rights, Maria Lvova-Belova, accusing them of abducting children from Ukraine.The head of the Russian delegation, Vladimir Medinsky, an aide to Putin, said Kyiv had made a “show” out of the topic and that children would be returned if their parents or guardians could be located.Zelenskyy also told journalists that the Russian side said it was ready for a two- to three-day ceasefire to collect bodies from the battlefield, not a full ceasefire.\"I think they’re idiots, because the whole point of a ceasefire is to prevent people from being killed in the first place. So you can see their mindset — it’s just a brief pause in the war for them,” he added.The relentless fighting has frustrated U.S. President Donald Trump’s goal of bringing about a quick end to the war. A week ago, he expressed impatience with Putin as Moscow pounded Kyiv and other Ukrainian cities with drones and missiles for a third straight night. Trump said on social media that Putin “has gone absolutely CRAZY!”Ukraine was triumphant after targeting the distant Russian air bases. The official Russian response was muted, with the attack getting little coverage on state-controlled television. The Russia-1 television channel on Sunday evening spent a little over a minute on it with a brief Defense Ministry statement read out before images shifted to Russian drone strikes on Ukrainian positions.Zelenskyy said the setbacks for the Kremlin would help force it to the negotiating table, even as its pursues a summer offensive on the battlefield.“Russia must feel what its losses mean. That is what will push it toward diplomacy,” he said Monday in Vilnius, Lithuania, meeting with leaders from the Nordic nations and countries on NATO’s eastern flank.Ukraine has occasionally struck air bases hosting Russia’s nuclear-capable strategic bombers since early in the war, prompting Moscow to redeploy most of them to the regions farther from the front line.Because Sunday's drones were launched from trucks close to the bases in five Russian regions, military defenses had virtually no time to prepare for them.Many Russian military bloggers chided the military for its failure to build protective shields for the bombers despite previous attacks, but the large size of the planes makes that challenging.The attacks were “a big blow to Russian strategic air power” and exposed significant vulnerabilities in Moscow’s military capabilities, said Phillips O’Brien, a professor of strategic studies at the University of St. Andrews in Scotland.Edward Lucas, a senior fellow at the Washington-based Center for European Policy Analysis, called it “the most audacious attack of the war” and \"a military and strategic game-changer.”“Battered, beleaguered, tired and outnumbered, Ukrainians have, at minimal cost, in complete secrecy, and over vast distances, destroyed or damaged dozens, perhaps more, of Russia’s strategic bombers,” he said.Fierce fighting has continued along the roughly 1,000-kilometer (620-mile) front line, and both sides have hit each other’s territory with deep strikes.Russian forces shelled Ukraine’s southern Kherson region, killing three people and wounding 19 others, including two children, regional officials said Monday.Also, a missile strike and shelling around the southern city of Zaporizhzhia killed five people and wounded nine others, officials said.","summary":"Russia and Ukraine met Monday for their second round of direct peace talks in just over two weeks, agreeing to trade the dead and wounded but making little progress toward ending the war.","url":"https://www.scrippsnews.com/world/europe/ukraine-and-russia-agree-to-swap-dead-and-wounded-troops-but-report-no-progress-toward-ending-war","image":"https://ewscripps.brightspotcdn.com/dims4/default/491a3d7/2147483647/strip/true/crop/1568x823+0+169/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fc0%2F36%2F3cd7778843c6badd7dfe4dc45d9b%2Fap25153435099991.jpg","video":null,"publish_date":"2025-06-03 00:10:40","author":"AP via Scripps News Group","authors":["AP via Scripps News Group"],"language":"en","category":"politics","source_country":"us","sentiment":-0.169},{"id":327468670,"title":"Face facts, Team Trump: Iran doesn’t want a nuke deal","text":"Iran’s rulers are proving they have no intention of denuclearizing the easy way, no matter how many carrots Team Trump dangles to get them on board.\n\nOn Monday, after five rounds of talks, Iran was set to reject a US proposal that reportedly allowed the country to keep up low-level uranium enrichment for an unspecified amount of time.\n\nNo such details of the deal are confirmed, and the White House refuses to comment while talks may continue — but it’s plainly time to quit giving an inch. \n\nIt’s bad enough that the administration seemingly backed off on its insistence that any uranium enrichment was a “red line”; forcing Iran to get rid of its full existing stockpile of highly enriched uranium and end all enrichment going forward should be the bare minimum.\n\nTrusting Iran to stick to enrichment below 3%, for supposedly “civilian purposes,” is madness. \n\nOn Saturday, The International Atomic Energy Agency, a UN watchdog group, revealed that Iran seriously ramped up production of 60%-enriched uranium this year, boosting its stores from 274 kilograms to 408 kilograms since February.\n\nThat’s enough to crank out a single nuke within two weeks — and up to 10 within months if Iran continues enrichment, which Iranian Foreign Minister Seyed Abbas Araghchi said will happen “with or without a deal.” \n\nPresident Donald Trump has been firm on two things from the start: Iran will not have a nuke on his watch, but he prefers a deal to the alternative — blowing up centrifuges, an option he’s kept on the table if Iran’s leaders refuse to bend.\n\nIt sure looks like they’re not bending.\n\nNo one can say Trump hasn’t given diplomacy a serious chance; he even told Israeli Prime Minister Benjamin Netanyahu not to bomb Iran while discussions were ongoing, since striking a deal “could save a lot of lives.”\n\nBut Iran has just been buying time, while sprinting full-speed toward a nuke: Hardly the behavior of a regime that wants to get a deal done.\n\nWith its proxies across the Middle East decimated, Iran’s rulers plainly figure going nuclear is the best way to guarantee their own safety and start turning the tide back. \n\nThe prez was rightly also clear that a deal must come fast, or it’d be Plan B; Tehran is hoping it can still stall long enough by stringing Trump’s negotiators along until it’s too late. \n\nNo more overtures. No more compromises. No more fruitless talks. \n\nShow Iran what’s behind Door No. 2.","summary":"Iran's rulers are proving they have no intention of denuclearizing the easy way, no matter how many carrots Team Trump dangles to get them on board.","url":"https://nypost.com/2025/06/02/opinion/its-time-for-team-trump-to-face-facts-iran-doesnt-want-a-nuke-deal/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/newspress-collage-8otyrykze-1748908871168.jpg?quality=75&strip=all&1748894565&w=1200","video":"https://cdn.jwplayer.com/videos/SG8bvIvU-RyIcpnTz.mp4","publish_date":"2025-06-03 00:07:13","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"us","sentiment":-0.447},{"id":327473012,"title":"China says US has ‘severely violated’ tariffs truce","text":"China says the US has “severely violated” their trade truce and that it will take strong measures to defend its interests.\n\nChina’s Ministry of Commerce said Washington has “seriously undermined” the agreement reached during talks in Geneva last month, when both countries lowered tariffs on goods imported from each other.\n\nThe spokesperson added that US actions have also severely violated the consensus reached during a phone call in January between China’s leader, Xi Jinping and President Donald Trump.\n\nThe comments come after Trump said on Friday that China had “totally violated its agreement with us”.\n\nThe US President did not give details but Trade Representative Jamieson Greer later said China had not been removing non-tariff barriers as agreed under the deal.\n\nUnder the trade truce struck in May at a meeting in Geneva, the US lowered tariffs imposed on goods from China from 145% to 30%. China’s retaliatory tariffs on US goods dropped from 125% to 10%.\n\nOn Monday, Beijing said US violations of the agreement included stopping sales of computer chip design software to Chinese companies, warning against using chips made by Chinese tech giant Huawei, and cancelling visas for Chinese students.\n\nThe deal reached in Geneva came as a surprise to many analysts as it seemed that the two sides were incredibly far apart on many trade issues.\n\nThis showed that during face-to-face talks Washington and Beijing can reach agreements.\n\nBut as the rhetoric is once again ratcheting up, the fragility of the current truce has been highlighted and gives an indication of just how challenging it may be to reach a longer-term trade deal.\n\nAlthough the fresh accusations may suggest that talks between Washington and Beijing are not going well, two top White House officials suggested on Sunday that Trump and Xi could hold talks soon.\n\nTreasury Secretary Bessent told CBS News, the BBC’s US news partner, that details of the trade will be “ironed out” once Xi and Trump speak, but he did not say exactly when that conversation is expected to happen.\n\nNational Economic Council Director Kevin Hassett told ABC News that the two leaders are expected to talk this week and “both sides have expressed a willingness to talk”.\n\n“The bottom line is that we’ve got to be ready in case things don’t happen the way we want,” Hassett said of the expected talks.\n\nBut the Chinese side prefers agreements to be done at a lower level first before they reach the desk of the president.\n\nLast week, Trump announced the US would double its current tariffs on steel and aluminium from 25% to 50%, starting on Wednesday.\n\nSpeaking at a rally in Pittsburgh, Pennsylvania on Friday, Trump said the move would help boost the local steel industry and national supply, while reducing reliance on China.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.\n\nDISCLAIMER: The Views, Comments, Opinions, Contributions and Statements made by Readers and Contributors on this platform do not necessarily represent the views or policy of Multimedia Group Limited.","summary":"China says the US has &#8220;severely violated&#8221; their trade truce and that it will take strong measures to defend its interests. China&#8217;s Ministry of Commerce said Washington has &#8220;seriously undermined&#8221; the agreement reached during talks in Geneva last month, when both countries lowered tariffs on goods imported from each other. The spokesperson added that US [&#8230;]\n\n\nThe post China says US has &#8216;severely violated&#8217; tariffs truce appeared first on Ghanamma.com.","url":"https://www.ghanamma.com/2025/06/03/china-says-us-has-severely-violated-tariffs-truce/","image":"https://www.ghanamma.com/wp-content/uploads/2025/06/image-83-1068x600.png","video":null,"publish_date":"2025-06-03 00:04:08","author":"Ghana News","authors":["Ghana News"],"language":"en","category":"politics","source_country":"gh","sentiment":-0.514},{"id":327469994,"title":"Defamation trial starts in Denver over 2020 election claims, pitting ex-Dominion executive against MyPillow CEO","text":"The defamation trial against MyPillow CEO and prominent election denier Mike Lindell began in Denver Monday with the selection of a jury to hear a case over whether Lindell made “false allegations of criminal conduct on a scale unprecedented in American history.”\n\nThat is how his conduct is characterized in a lawsuit brought by Eric Coomer, a Colorado resident and former director of product strategy and security for Dominion Voting Systems. Coomer alleges that Lindell and his companies have “gone out of their way to target” Coomer in their pursuit of the repeatedly debunked conspiracy theory that the 2020 presidential election was “stolen” from President Donald Trump when he lost to Joe Biden.\n\nCoomer filed his lawsuit in Denver District Court in April 2022, and it was later transferred to federal court. The suit says Coomer was defamed by Lindell and suffered severe emotional and physical distress as a result. \n\nThe trial is set to last two weeks, with opening arguments set for Tuesday morning. U.S. District Court Judge Nina Wang is overseeing the case. Monday was largely relegated to jury selection, as attorneys for each side sought to suss out bias by prospective jurors.\n\nQuestions included where jurors get their news, which social media platforms they use, if they have negative feelings about Trump or his Make America Great Again movement, and their opinions of the Jan. 6, 2021, riot at the U.S. Capitol and of Lindell’s company, MyPillow.\n\nFollowing Trump’s 2020 election loss, Denver-based Dominion Voting Systems, a voting machine company that supplies equipment to many counties, became central to a conspiracy theory positing that the election was rigged against Trump. \n\nDominion, as a company, has filed multiple lawsuits over allegations that it was involved in election rigging. It settled one lawsuit against Fox News for nearly $800 million. The conspiracists also targeted Coomer specifically after Colorado podcaster Joe Oltmann named “Eric, the Dominion guy” on his program. \n\nLindell, a Trump ally and media figure, then ran with the allegations on his platforms, according to Coomer’s lawsuit.\n\nCoomer said he can no longer work in the election industry, after more than 15 years, because of “unwarranted distrust inspired by Defendants’ lies,” according to the lawsuit. Coomer alleges he has faced “frequent credible death threats and the burden of being made the face of an imagined criminal conspiracy of unprecedented scope in American history.”\n\n“(Lindell) has claimed, without evidence, that Dr. Coomer committed treason and that he should turn himself into the authorities,” Coomer’s complaint against Lindell states.\n\nAhead of the trial’s start, Lindell spoke to supporters and the media on Monday morning. He argued that the lawsuit was “frivolous” and that he had never even heard of Coomer — but he also didn’t step back from his claims about election fraud. \n\nOn the courthouse steps ahead of jury selection, he said electronic voting machines should be melted down and turned into prison bars.\n\n“As long as the outcome, whatever it is, leads to getting to paper ballots, hand-counted, like 132 other countries that banned electronic voting machines — if we can get there, I would sacrifice everything. And I have,” Lindell said. “This is the end goal.” \n\nHe also cast the trial as a biblical fight between good and evil. His news conference ended with about two dozen supporters praying over him. Several carried signs calling to “Free Tina Peters,” the former Mesa County Clerk who’s serving time in prison for convictions related to providing unauthorized access to election machines following the 2020 election and giving a security badge to a man associated with Lindell.\n\nCoomer is asking for a retraction of all defamatory remarks made by Lindell and monetary damages.\n\nStay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"A voting systems industry player's defamation trial against MyPillow CEO and prominent election denier Mike Lindell began in Denver Monday with jury selection. It's expected to last two weeks.","url":"https://www.denverpost.com/2025/06/02/mike-lindell-eric-coomer-dominion-election-conspiracy-defamation-lawsuit-trump/","image":"https://www.denverpost.com/wp-content/uploads/2025/06/TDP-L-LINDELL_1063.jpg?w=1024&h=683","video":null,"publish_date":"2025-06-03 00:02:52","author":"Nick Coltrain","authors":["Nick Coltrain"],"language":"en","category":"politics","source_country":"us","sentiment":-0.3},{"id":327470280,"title":"World News | Ukraine and Russia Agree to Swap Dead and Wounded Troops but Report No Progress Toward Ending War","text":"Istanbul, Jun 2 (AP) Representatives of Russia and Ukraine met Monday for their second round of direct peace talks in just over two weeks, but aside from agreeing to swap thousands of their dead and seriously wounded troops, they made no progress toward ending the 3-year-old war, officials said. The talks unfolded a day after a string of stunning long-range attacks by both sides, with Ukraine launching a devastating drone assault on Russian air bases and Russia hurling its largest drone attack of the war against Ukraine. Also Read | Israel-Hamas War: 3 Killed As Israel Defence Forces Open Fire a Kilometer Away From Gaza Aid Site, Health Officials Say. At the negotiating table, Russia presented a memorandum setting out the Kremlin's terms for ending hostilities, the Ukrainian delegation said. Defense Minister Rustem Umerov, who led the Ukrainian delegation, told reporters that Kyiv officials would need a week to review the document and decide on a response. Ukraine proposed further talks on a date between June 20 and June 30, he said. Also Read | Gautam Adani-Led Adani Group Faces New Probe in US Over Alleged Iranian LPG Imports: Report. After the talks, Russian state news agencies Tass and RIA Novosti published the text of the Russian memorandum, which suggested that Ukraine withdraw its forces from the four regions that Russia annexed in September 2022 but never fully captured as a condition for a ceasefire. As an alternate way of reaching a truce, the memorandum presses Ukraine to halt its mobilisation efforts and freeze Western arms deliveries, conditions were suggested earlier by Russian President Vladimir Putin. The document also suggests that Ukraine stop any redeployment of forces and ban any military presence of third countries on its soil as conditions for halting hostilities. The Russian document further proposes that Ukraine end martial law and hold elections, after which the two countries could sign a comprehensive peace treaty that would see Ukraine declare its neutral status, abandon its bid to join NATO, set limits on the size of its armed forces and recognise Russian as the country's official language on par with Ukrainian. Ukraine and the West have previously rejected all those demands from Moscow. In other steps, the delegations agreed to swap 6,000 bodies of soldiers killed in action and to set up a commission to exchange seriously wounded troops. Kyiv officials said their surprise drone attack Sunday damaged or destroyed more than 40 warplanes at air bases deep inside Russia, including the remote Arctic, Siberian and Far East regions more than 7,000 kilometres (4,300 miles) from Ukraine. The complex and unprecedented raid, which struck simultaneously in three time zones, took over a year and a half to prepare and was \"a major slap in the face for Russia's military power,\" said Vasyl Maliuk, the head of the Ukrainian security service, who led its planning. Zelenskyy called it a \"brilliant operation\" that would go down in history. The effort destroyed or heavily damaged nearly a third of Moscow's strategic bomber fleet, according to Ukrainian officials. Russia on Sunday fired the biggest number of drones — 472 — at Ukraine since its full-scale invasion in 2022, Ukraine's air force said, in an apparent effort to overwhelm air defences. That was part of a recently escalating campaign of strikes in civilian areas of Ukraine. Hopes low for peace prospects US-led efforts to push the two sides into accepting a ceasefire have so far failed. Ukraine accepted the proposed truce, but the Kremlin effectively rejected it. Recent comments by senior officials in both countries indicate they remain far apart on the key conditions for stopping the war. The previous talks on May 16 in the same Turkish city were the first direct peace negotiations since the early weeks of Moscow's 2022 invasion. Turkish President Recep Tayyip Erdogan said the fact that the two sides met again Monday was an achievement in itself amid the fierce fighting. \"The fact that the meeting took place despite yesterday's incident is an important success in itself,\" he said in a televised speech. Zelenskyy said during a trip to Lithuania on Monday that a new release of prisoners of war was being prepared after the Istanbul meeting. The May 16 talks also led to a swap of prisoners, with 1,000 on both sides being exchanged. During the talks, Zelenskyy said, the Ukrainian delegation handed over a list of nearly 400 abducted children. Russia responded by proposing to \"work on up to 10 children.\" \"That's their idea of addressing humanitarian issues,\" Zelenskyy said Monday during an online briefing with journalists. The International Criminal Court issued an arrest warrant in 2023 for Putin and the country's commissioner for children's rights, Maria Lvova-Belova, accusing them of abducting children from Ukraine. The head of the Russian delegation, Vladimir Medinsky, an aide to Putin, said Kyiv had made a \"show\" out of the topic and that children would be returned if their parents or guardians could be located. Zelenskyy also told journalists that the Russian side said it was ready for a two- to three-day ceasefire to collect bodies from the battlefield, not a full ceasefire. \"I think they're idiots, because the whole point of a ceasefire is to prevent people from being killed in the first place. So you can see their mindset — it's just a brief pause in the war for them,\" he added. The relentless fighting has frustrated US President Donald Trump's goal of bringing about a quick end to the war. A week ago, he expressed impatience with Putin as Moscow pounded Kyiv and other Ukrainian cities with drones and missiles for a third straight night. Trump said on social media that Putin \"has gone absolutely CRAZY!\" Ukraine upbeat after strikes on air bases Ukraine was triumphant after targeting the distant Russian air bases. The official Russian response was muted, with the attack getting little coverage on state-controlled television. The Russia-1 television channel on Sunday evening spent a little over a minute on it with a brief Defense Ministry statement read out before images shifted to Russian drone strikes on Ukrainian positions. Zelenskyy said the setbacks for the Kremlin would help force it to the negotiating table, even as it pursues a summer offensive on the battlefield. \"Russia must feel what its losses mean. That is what will push it toward diplomacy,\" he said Monday in Vilnius, Lithuania, meeting with leaders from the Nordic nations and countries on NATO's eastern flank. Ukraine has occasionally struck air bases hosting Russia's nuclear-capable strategic bombers since early in the war, prompting Moscow to redeploy most of them to the regions farther from the front line. Because Sunday's drones were launched from trucks close to the bases in five Russian regions, military defences had virtually no time to prepare for them. Many Russian military bloggers chided the military for its failure to build protective shields for the bombers despite previous attacks, but the large size of the planes makes that challenging. The attacks were \"a big blow to Russian strategic air power\" and exposed significant vulnerabilities in Moscow's military capabilities, said Phillips O'Brien, a professor of strategic studies at the University of St. Andrews in Scotland. Edward Lucas, a senior fellow at the Washington-based Center for European Policy Analysis, called it \"the most audacious attack of the war\" and \"a military and strategic game-changer.\" \"Battered, beleaguered, tired and outnumbered, Ukrainians have, at minimal cost, in complete secrecy, and over vast distances, destroyed or damaged dozens, perhaps more, of Russia's strategic bombers,\" he said. Front-line fighting and shelling grinds on Fierce fighting has continued along the roughly 1,000-kilometre (620-mile) front line, and both sides have hit each other's territory with deep strikes. Russian forces shelled Ukraine's southern Kherson region, killing three people and wounding 19 others, including two children, regional officials said Monday. Also, a missile strike and shelling around the southern city of Zaporizhzhia killed five people and wounded nine others, officials said. (AP) (This is an unedited and auto-generated story from Syndicated News feed, LatestLY Staff may not have modified or edited the content body)","summary":"Get latest articles and stories on World at LatestLY.   Representatives of Russia and Ukraine met Monday for their second round of direct peace talks in just over two weeks, but aside from agreeing to swap thousands of their dead and seriously wounded troops, they made no progress toward ending the 3-year-old war, officials said.","url":"https://www.latestly.com/agency-news/world-news-ukraine-and-russia-agree-to-swap-dead-and-wounded-troops-but-report-no-progress-toward-ending-war-6901190.html","image":"https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News.jpg","video":null,"publish_date":"2025-06-03 00:00:09","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.182},{"id":327474098,"title":"Under pressure on the battlefield, Ukraine turns to drones to hurt Russia","text":"Ukraine carried out its largest drone attack inside Russia on Sunday, targeting at least four military airports in four different regions (across four time zones) in the world’s largest country. Unnamed officials of the Security Services of Ukraine (SBU), the country’s spy agency, have claimed that the attacks “destroyed” more than 40 Russian warplanes, including strategic bombers that can carry nuclear missiles, causing damages amounting to $7 billion. President Volodymyr Zelenskyy claimed in a social media post that the attack, which followed a Russian strike at a military training base in Ukraine, killing at least 12 soldiers, produced “an absolutely brilliant result”.\n\nWhile the Ukrainian claims of destroying Russian strategic bombers are not independently confirmed, Russia’s Ministry of Defence stated that five regions came under drone attacks and that several aircraft in two bases, one close to the border with Norway and the other in Siberia, “caught fire”. It said the fire was extinguished, other attacks were repelled and that there were no casualties. Russia also saw two bridges collapse in Kursk and Bryansk regions, both close to the Ukrainian border, killing at least seven people and wounding 76 others. Russian officials say explosives were used to destroy the bridges. All this happened when Russian and Ukrainian officials were preparing to sit together for direct peace talks in Istanbul on Monday.\n\nAirfields hit\n\nAccording to Ukrainian claims, the four regions that were attacked are: Ryazan, Ivanov, Murmansk, and Irkutsk. The Olenya air base in Murmansk, close to the Norwegian border, is around 1,900 km from the frontline. Belaya airbase in the Siberian region of Irkutsk is 4,300 km away from Ukraine. Russian officials said Amur, close to the Chinese border, also came under attack, which was repelled. The attacks on these bases demonstrate Ukraine’s growing capability to hit deep inside Russia using cheap drones and innovate tactics, most likely involving undercover operatives.\n\nPer the Ukrainian version, the attack was in the plans for about one and a half years. SBU officials say Ukraine had secretly transported ‘first-person view’ drones (FPVs transmit a live video feed from their front camera to a pilot’s screen) into Russian territory on trucks. Drones were kept in wooden containers on trucks, which were moved closer to the targets undetected. On Sunday, the wooden containers were opened remotely, and the FPV drones, attached with explosives, were launched into the airfields. The Russian Defence Ministry has confirmed that the drones that hit Olenya and Belaya were launched “from the immediate vicinity” of the airfields. Mr. Zelenskyy wrote in his social media post that “our people involved in preparing the Operation were withdrawn from Russian territory in time”.\n\nThis seeks to rewrite the rules of warfare. Traditionally, countries try to attack faraway enemy bases using surface-to-surface or air-to-surface long-range missiles. Ukraine lacks the capacity to mount such an aerial attack against Russia. So it turned to drones, which it was manufacturing at an industrial scale ever since the war broke out in February 2022. Ukraine claimed to have made 2.2 million drones in 2024, and aims to make 4.5 million this year. Drones play the central role in Ukraine’s counterattack strategy.\n\nAmong the planes that were “destroyed” are Russian Tu-95, Tu-22M3 and A-50, according to the SBU. The Tu-95 bombers, which carry guided cruise missiles, can hit targets from thousands of kilometres afar. The A-50 are early warning jets that detect enemy aircraft and missiles, and feed intel on Russian fighter planes. “Russian strategic bombers are all burning delightfully,” claimed Vasily Malyuk, the SBU chief, after the attack. Russia’s fleet of strategic bombers is reportedly small — it operates less than 90 Tu-22s, Tu-95s and Tu-160s. (Tu-160 is Russia’s most advanced strategic bomber). If Ukraine’s claims of destroying some “30%” of Russian bombers are true, it’s a heavy blow to President Vladimir Putin and his forces.\n\nEven if Ukraine is exaggerating Russia’s losses, the fact that it carried out such a massive attack deep inside Russian territory can be seen as a tactical setback for Moscow. If Ukraine were planning such an elaborate attack for months, there would be questions on why the Russian intelligence failed to detect and deter them. \n\nRussia’s military bloggers were quick to term June 1 a “dark day” in the history of Russian aviation. Some others, especially the nationalist sections, called it “Russia’s Pearl Harbour” and demanded a similar response from the Kremlin to that of the U.S. during the Second World War. Mr. Putin, who has faced criticism at home from the nationalist sections for “not doing enough” in the war, is likely to come under greater pressure to retaliate heavily.\n\nBattlefield vulnerabilities\n\nBut the Ukrainian attack doesn’t mask the country’s battlefield vulnerabilities. Russia has launched a Spring offensive in the Sumy region, where its forces are making incremental advances. The Russian army took 507 sq km in May, against 379 sq. km in April and 240 square km in March, according to data from the U.S.-based Institute for the Study of War. From June 2024 to May 2025, Russia gained a total of 5,107 sq. km (less than one per cent of Ukrainian territory before the war), while Ukrainian forces only regained 85 sq. km. Ukraine has not taken any major territorial gains since its Kherson offensive in late 2022. It’s a gamble in Russia’s Kursk region failed as Russia captured swathes of territories in Ukraine’s east last year and then pushed Ukrainian troops out of Kursk with help from North Korea. In recent months, Russia has stepped up air strikes and drone attacks across Ukraine, straining the country’s already weak air defences. But despite the weaknesses on the ground, Kyiv remains defiant and audacious as the latest attack shows.\n\nWhat is to be seen is how the Ukrainian attacks are going to impact U.S. President Donald Trump’s push to end the war. When Russia carried out drone attacks in Ukraine late last month, Mr. Trump had said “Putin had gone absolutely crazy” and that “Putin is playing with fire”. But on his watch, Ukraine, America’s ally, has carried out its most ambitious attack on Russia, that too on the eve of peace talks. The Istanbul talks are set to proceed as per plans. Both the Russian and Ukrainian delegations are in Turkiye. But the Russian response to the Ukrainian attack is almost guaranteed, which could further complicate the diplomatic process.","summary":"Ukraine claimed its Sunday attacks destroyed over 40 Russian warplanes, including nuclear-capable bombers; Russia says the strikes were repelled with no casualties; the attack was in the works for 18 months, says Kyiv; the strike came as both sides were preparing for peace talks in Istanbul ","url":"https://www.thehindu.com/news/international/under-pressure-on-the-battlefield-ukraine-turns-to-drones-to-hurt-russia/article69649519.ece","image":"https://th-i.thgim.com/public/incoming/ikpzeq/article69650366.ece/alternates/LANDSCAPE_1200/2025-06-02T103257Z_1834392109_RC21UEAC7991_RTRMADP_3_UKRAINE-CRISIS-AIR-DEFENCE.JPG","video":null,"publish_date":"2025-06-03 00:00:00","author":"Stanly Johny","authors":["Stanly Johny"],"language":"en","category":"politics","source_country":"in","sentiment":-0.001},{"id":327471522,"title":"Merc, Skoda-VW may make in India, Tesla to stay away: Musk’s electric car co only interested in setting up sales outlets, says Kumaraswamy","text":"New Delhi: India Monday unveiled the guidelines for investment under its electric vehicle scheme that will allow carmakers to import 8,000 units at concessional import tariff if they set up a manufacturing facility in the country. The window for receiving formal requests will open soon.Elon Musk’s Tesla is keen on setting up sales outlets but not to make cars in India while Mercedes Benz, and Skoda-Volkswagen, and Hyundai, and Kia have shown interest in manufacturing EVs under the scheme, Union Heavy Industries Minister HD Kumaraswamy said Monday.“This will enhance India’s status as a global EV manufacturing hub… applications window for seeking sops to open shortly,” the minister said, adding that beneficiaries will need to start domestic production within three years.Benefits under the Scheme to Promote Manufacturing of Electric Passenger Cars in India (SPMEPCI) are contingent on a company agreeing to invest and manufacture EVs in the country. Approved applicants will be allowed to import Completely Built-up Units (CBUs) of electric four wheelers with a minimum import value of $35,000 at reduced customs duty of 15% for five years and would be required to make a minimum investment of Rs 4,150 crore.POSITIVE RESPONSEEurope’s Mercedes Benz, Skoda-Volkswagen (VW), South Korean Hyundai, and Kia have held talks with the Centre regarding the scheme, Kumaraswamy said shortly after norms for the scheme were notified.“The future of mobility will be electric. SAVWIPL is closely monitoring the development of EV-related policies in India and is thoroughly assessing their implications. Based on this, we define the appropriate next steps in line with our longterm strategy,” a Skoda Auto Volkswagen India Pvt Ltd spokesperson said.“We fully support and remain committed to initiatives that lead to a sustainable and self-sufficient battery electric vehicle ecosystem in India,” the spokesperson added. Mercedes, Kia and Hyundai did not respond to queries from ET on their plans with regard to the scheme.TESLATesla is said to be testing the waters for its electric vehicles (EVs) in India by importing some cars. The company has been in discussions with the Indian government and has in the past flagged its high import tariffs for cars. Founder Elon Musk was expected to visit India in April last year and announce the company’s plans, but the trip was called off.Responding to a query on Tesla’s possible India plans, Kumaraswamy said the US-headquartered EV maker has not shown interest in manufacturing domestically. “Tesla only wants to open showrooms and sell imported cars,” he said.TRUMP TARIFFSAsked about the impact of US President Donald Trump's newest plan to raise import tariffs on steel, Kumaraswamy said it will have minimal impact on India.Trump announced in May last week that tariffs on imported steel and aluminium will double to 50% after June 4. “The only concern is for consignments on the way since they will attract higher duty if they don’t reach before June 4,” he said.","summary":"India's new EV scheme allows carmakers to import 8,000 units at reduced tariffs if they establish local manufacturing. Mercedes-Benz, Skoda-Volkswagen, Hyundai, and Kia have expressed interest, while Tesla seeks only to open showrooms. The scheme aims to boost India's EV manufacturing hub status, requiring domestic production within three years and a minimum investment of Rs 4,150 crore.","url":"https://economictimes.indiatimes.com/industry/renewables/merc-skoda-vw-may-make-in-india-tesla-to-stay-away-musks-electric-car-co-only-interested-in-setting-up-sales-outlets-says-kumaraswamy/articleshow/121580095.cms","image":"https://img.etimg.com/thumb/msid-121580094,resizemode-4,width-1200,height-900,imgsize-238743,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-06-03 00:00:00","author":"Et Bureau","authors":["Et Bureau"],"language":"en","category":"politics","source_country":"in","sentiment":-0.26},{"id":327464176,"title":"Suspect in Colorado fire attack planned for a year, FBI says","text":"Mr Soliman said he had been watching YouTube videos on how to make Molotov cocktails, according to the affidavit. \n\nInvestigators say he told them he learned to shoot a gun in hope of obtaining a concealed-carry permit, but ended up using Molotov cocktails because his immigration status prevented him from accessing firearms.\n\nMr Soliman drove from his home in Colorado Springs to Boulder, arriving five minutes before their meeting and waiting for the group, according to court documents. He allegedly said he bought petrol on his way to the attack. \n\nAccording to the FBI, throughout the interview, Mr Soliman said he hated Zionists and targeted them because they need to stop taking over \"our land\", which he said was a reference to the Palestinian territories. \n\nMr Soliman allegedly told officials he left his iPhone hidden in a desk drawer with messages to his family, wife and five children. His wife later brought the iPhone to officials, according to court documents. \n\nLaw enforcement officials said on Monday there was no previous indication that the defendant was a threat. \n\n\"We fully intended to hold Mr Soliman accountable for his actions, and these charges are the first step,\" Acting US Attorney for the District of Colorado J Bishop Grewell told a press conference on Monday. \n\nMr Soliman moved to Colorado Springs three years ago and previously spent 17 years living in Kuwait.\n\nIn 2022, Mr Soliman arrived in California on a non-immigrant visa that expired in February 2023, multiple sources have told CBS News.\n\nHomeland security officials said he filed for asylum a month after arriving, but did not provide details about the outcome of that immigration case or whether it was resolved.\n\nPresident Donald Trump's deputy chief of staff for policy, Stephen Miller, said on X that Mr Soliman was given a work permit by the Biden administration after he had overstayed his visa.\n\n\"In light of yesterday's horrific attack, all terrorists, their family members, and terrorist sympathizers here on a visa should know that under the Trump administration we will find you, revoke your visa, and deport you,\" US Secretary of State Marco Rubio said on X.\n\nMr Soliman has been working as a food delivery driver for Uber since 2023, a company spokesperson told CBS. \n\nAccording to the company, when he began working for them, he met all Uber requirements, including passing a criminal and driving history background check, providing a photo ID and holding a valid Social Security number.\n\nTrump said in a social media post that attacks like the one Mr Soliman allegedly carried out would not be tolerated. \n\n\"This is yet another example of why we must keep our Borders SECURE, and deport Illegal, Anti-American Radicals from our Homeland,\" he said.\n\nThe Jewish community in the US has faced a series of attacks by assailants citing the Israel-Gaza war.\n\nLast month two Israel Embassy aides were shot and killed outside Washington's Capital Jewish Museum. Witnesses said the assailant shouted \"Free Palestine\". \n\nIn April, a man set fire to the residence of Pennsylvania Governor Josh Shapiro, who is Jewish. The suspect said the arson was retaliation for Israeli attacks on Palestinians.","url":"https://www.bbc.com/news/articles/cy8ng0g4k2no","image":"https://ichef.bbci.co.uk/news/1024/branded_news/9631/live/8b920b70-3fda-11f0-b74d-91fa6007fac5.jpg","video":null,"publish_date":"2025-06-02 23:49:09","author":"Madeline Halpert","authors":["Madeline Halpert"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.319},{"id":327471910,"title":"Harvard Asks Judge to Unfreeze $2.5 Billion in Blocked Research Funds Amid Ongoing Battle With Trump Administration","text":"Harvard University is fighting back in court after the Trump administration froze $2.5 billion in research funding, a move the university claims is illegal and politically motivated. In a legal filing on Monday, Harvard asked a federal judge in Boston to issue a summary judgment to release the blocked money without needing a full trial.\nThis legal request is part of a broader lawsuit Harvard filed in April, accusing the Trump administration of violating the university’s rights to free speech and acting in an arbitrary and unfair way.\nNearly 1,000 Projects Affected\nHarvard’s filing details the severe impact the freeze has had on its research programs. According to the university, since April 14, it has received 957 separate orders from the government demanding a freeze on funding. These funds were supposed to support crucial research into national security, cancer, infectious diseases, and more.\nSome of the blocked grants include:\n$88 million for pediatric HIV research\n$12 million to help the Defense Department detect new biological threats\n$8 million to study dark energy in space\nHarvard warned that the freeze could destroy vital scientific work, including ongoing studies on cancer, Parkinson’s disease, and emerging infectious diseases.\nTrump’s Pressure on Universities\nPresident Donald Trump has made it clear that he wants to overhaul what he calls “woke” elite institutions like Harvard. He’s accused the university—and others like it—of promoting leftist ideologies and fostering antisemitism on campus.\nThe funding freeze is one of several actions the Trump administration has taken against Harvard. In Monday’s court filing, Harvard pointed out that it was targeted after it refused to comply with a White House list of demands. The administration has not publicly released the contents of that list.\nWhile the Trump administration did not immediately respond to requests for comment, Trump has said he wants to “force change” at elite schools across the country.\nJudge Will Hear Arguments in July\nThe case is being overseen by U.S. District Judge Allison Burroughs, who has scheduled oral arguments for July 21. A summary judgment would allow her to rule on the case without a full trial, as long as she finds there are no major facts in dispute.\nIf Harvard wins, the blocked funding could be released immediately, helping restart critical research programs that have been on hold for months.\nInvestigations Into Harvard Continue\nAlongside the funding freeze, the Trump administration has launched multiple investigations into Harvard. Some are focused on whether the university has adequately protected Jewish students and faculty, particularly after pro-Palestinian protests erupted on campus following the October 7, 2023 Hamas attack on Israel and Israel’s response in Gaza.\nOther probes are examining:\nAlleged discrimination based on sex and gender\nThe university’s ties to foreign governments\nHarvard’s treatment of international students\nLast month, the administration revoked Harvard’s authority to enroll international students, though a judge has temporarily blocked that action after Harvard filed another lawsuit.\nUniversities Say Free Speech Is Under Threat\nHarvard and other major universities have argued that these aggressive moves from the Trump administration are attacks on academic freedom and free speech. They say the pressure campaign puts the future of higher education at risk and undermines the independence of research and teaching in the U.S.\n“This is not just about Harvard,” a university spokesperson said previously. “It’s about protecting the freedom of all academic institutions to pursue knowledge without political interference.”\nALSO READ: Trump Administration To Mandate Social Media Screening For All Foreign Students, Puts New Student Visa Interviews On Hold","summary":"Harvard University is fighting back in court after the Trump administration froze $2.5 billion in research funding, a move the university claims is illegal and politically motivated. In a legal filing on Monday, Harvard asked a federal judge in Boston to issue a summary judgment to release the blocked money","url":"https://www.newsx.com/world/harvard-asks-judge-to-unfreeze-2-5-billion-in-blocked-research-funds-amid-ongoing-battle-with-trump-administration/","image":"https://www.newsx.com/wp-content/uploads/2025/04/ASHISH-WEBSITE-13-6.webp","video":null,"publish_date":"2025-06-02 23:48:03","author":"Srishti Mukherjee","authors":["Srishti Mukherjee"],"language":"en","category":"politics","source_country":"in","sentiment":-0.253},{"id":327468674,"title":"Democratic Party’s horrendous polling leaves CNN data guru in disbelief: ‘Are you kidding me?’ ","text":"Shock polling showing Democrats still languishing behind Republicans on economic issues stunned CNN analyst Harry Enten on Monday. \n\nEnten, the network’s number cruncher, marveled at Democrats’ inability to close the gap with Republicans — in what is typically the most important issue for voters — despite recession jitters, stock market volatility and President Trump pressing forward with his unpopular tariff plan. \n\n“You’d expect that Democrats would have this massive lead on the economy — it ain’t so! It ain’t so!” Enten said as he unveiled new CNN polling showing the GOP still holds a massive advantage over Dems. \n\nRepublicans led Democrats by eight points when asked which party was “closer to your economic views” in the May survey, released Sunday. \n\nEnten noted that the survey was “still within the margin of error” of a November 2023 CNN poll showing Republicans with an 11-point advantage over Democrats. \n\n“How is that possible, Democrats!?” the CNN analyst said. \n\n“How is it possible after all the recession fears? After the stock market’s been doing all of this, after all the tariffs that Americans are against, and Republicans still hold an eight-point lead on the economy? Are you kidding me!?” Enten continued. \n\nThe data guru pointed out that other polls are even more brutal for Democrats, including the latest Reuters/Ipsos poll, which shows Republicans widening their margins on economic issues under Trump. \n\n“Party with a better economic plan? Well, in May of 2024, just before Donald Trump was re-elected president, Republicans had a nine-point advantage. Look at where we are now in May 2025 — the advantage actually went up by three points,” Enten explained. “Now, Republicans have a 12-point advantage when it comes to the party with a better economic plan.\n\n“Again, this is after months of supposed economic uncertainty in which the stock market’s been going bonkers, in which tariff wars that Americans are against have been going on. And yet, despite all of that, the Democrats are down by 12 points on the economy.”\n\nBut nothing “speaks to Democratic problems on the economy better than” polls asking voters to choose which is the party of the middle class — a poll question that has traditionally given Democrats a “huge advantage” over Republicans, according to Enten. \n\n“In our latest CNN poll, among registered voters, ‘Which is the party of the middle-class?’ — It is tied!” the shocked analyst revealed. \n\nEnten noted that in 1989, polling showed Democrats with a 23-point advantage, which dropped to a 17-point lead in 2016 and a four-point edge in 2022. \n\n“This, I think, speaks to Democratic ills more than anything else,” Enten argued. “They have traditionally been the party of the middle class. No more!” \n\n“Donald Trump and the Republican Party have taken that mantle away … Republicans have completely closed the gap.”","summary":"Enten, the network’s number cruncher, marveled at Democrats’ inability to close the gap with Republicans — in what is typically the most important issue for voters — despite recession jitters, stock market volatility and President Trump pressing forward with his unpopular tariff plan. ","url":"https://nypost.com/2025/06/02/us-news/democratic-partys-horrendous-polling-leaves-cnn-data-guru-in-disbelief-are-you-kidding-me/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/cnn-s-harry-enten-marveled-105765488.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/IreCkEki-RyIcpnTz.mp4","publish_date":"2025-06-02 23:45:37","author":"Victor Nava","authors":["Victor Nava"],"language":"en","source_country":"us","sentiment":-0.468},{"id":327464490,"title":"Trump open to joining Istanbul peace talks with Putin and Zelenskyy amid Ukraine war deadlock","text":"US President Donald Trump is open to attending a potential peace summit in Istanbul with Russian President Putin and Ukrainian President Zelenskyy, signaling a possible US diplomatic role in ending the war. The announcement came as Russia and Ukraine held a second round of peace talks in Istanbul, agreeing on a prisoner exchange but failing to secure a ceasefire. Russia again rejected Ukraine's proposal for an unconditional halt to hostilities.","summary":"","url":"https://economictimes.indiatimes.com/news/international/world-news/trump-open-to-joining-istanbul-peace-talks-with-putin-and-zelenskyy-amid-ukraine-war-deadlock/videoshow/121582399.cms","image":"https://img.etimg.com/thumb/msid-121582399,width-1070,height-580,overlay-economictimes/videoshow.jpg","video":"https://img.etimg.com/photo/msid-121582399,imgsize-72744.cms","publish_date":"2025-06-02 23:41:01","author":"Et Online","authors":["Et Online"],"language":"en","category":"politics","source_country":"in","sentiment":-0.54},{"id":327474192,"title":"We want to protect Medicaid for the truly needy, says Rep. Claudia Tenney","text":"We want to protect Medicaid for the truly needy, says Rep. Claudia Tenney | Fox Business Video\n\nto top close\n\nThis video is playing in picture-in-picture.\n\nThe Evening Edit\n\nJune 02, 2025\n\nWe want to protect Medicaid for the truly needy, says Rep. Claudia Tenney\n\nRep. Claudia Tenney, R-N.Y., discusses the Senate's concerns with President Donald Trump's 'big, beautiful bill' on 'The Evening Edit.'\n\nCopy to clipboard\nCopy to clipboard\n\nWHAT TO WATCH\n\nTHE EVENING EDIT | LATEST EPISODES\n\nTHE EVENING EDIT\n\nNOW - 9:30 PM\n\nFox Business Channel\n\nHow America Works\n\n9:00 PM - 10:00 PM\n\nHow America Works\n\n10:00 PM - 11:00 PM\n\nHow America Works\n\n11:00 PM - 12:00 AM\n\nFox News Channel\n\n9:00 PM - 10:00 PM\n\n10:00 PM - 11:00 PM\n\nFox News @ Night\n\n11:00 PM - 12:00 AM\n\nFox Weather Channel\n\nFox Weather\n\nLive Stream\n\nFox News Radio\n\nFOX News Radio Live Channel Coverage\n\nLive Stream","summary":"Rep. Claudia Tenney, R-N.Y., discusses the Senate&apos;s concerns with President Donald Trump&apos;s &apos;big, beautiful bill&apos; on &apos;The Evening Edit.&apos;","url":"https://www.foxbusiness.com/video/6373802338112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/af7dac86-ff86-4a3f-b5d7-0f331b0e014f/c74e536d-30fc-4d13-8117-04b3c642fa1c/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 23:40:40","author":null,"language":"en","source_country":"us","sentiment":0.13},{"id":327472072,"title":"High school girls stage protest after trans athlete wins 2nd straight state track championship","text":"Veronica Garcia's state championship is being met with tons of backlash. Garcia, a senior at East Valley High School in Spokane, Washington, took home the girls' 400-meter 2A state title on Saturday. Garcia is a transgender female. Garcia, according to the Seattle Times, was heckled before the race and was booed after it. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM But the criticism did not end on Saturday. With students back at school after the weekend, high school girls decided to take matters into their own hands. Numerous girls from Tumwater High School in Tumwater protested during school hours with a large banner sign that read, \"This is not a walk out (sic). We are not going anywhere.\" Other signs read \"XX,\" \"protest female sports\" and other similar messages. The Washington Interscholastic Activities Association (WIAA) issued the following statement to Fox News Digital: \"The WIAA continues to proudly represent the 225,000+ student-participants across the state. The Association is aware of the protest by Tumwater HS students.\" The Tumwater girls' team finished in third place in the meet. Reese Heryford finished in 15th place in a preliminary run for the 400 meters, failing to be in the necessary top eight to qualify for the final. Garcia said the boos were \"expect[ed].\" DEPT OF EDUCATION LABELS JUNE AS 'TITLE IX MONTH' IN WAKE OF TRANS ATHLETES WINNING GIRLS' COMPETITIONS \"I’ll be honest, I kind of expect it,\" Garcia told the Seattle Times. \"But it maybe didn’t have their intended effect. It made me angry, but not angry as in I wanted to give up, but angry as in I’m going to push. \"I’m going to put this in the most PG-13 way. I’m just going to say it’s a damn shame they don’t have anything else better to do. I hope they get a life. But oh well. It just shows who they are as people.\" Garcia, who ran the race in 55.70 seconds, won by over a full second. That time would have been the slowest by any boy, even in the preliminary rounds. Garcia also won a state championship last year and complained about the lack of sportsmanship from fellow competitors. Garcia's victory came roughly a week after the Quilcene School District in Washington voted, 3-2, to keep sports competition based on athletes' birth gender, a move that defies state law. The WIAA, enacted in 2007, allows transgender students to participate based on their gender identity. CLICK HERE TO GET THE FOX NEWS APP President Donald Trump signed an executive order in February to keep biological boys out of girls' and women's sports, but Washington State Superintendent of Public Instruction Chris Reykdal, who once said it would be \"inaccurate\" to say there are only two genders, said the order defies state law. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"After Veronica Garcia, a trans athlete, won a Washington state track championship, girls at Tumwater High School protested the victory.","url":"https://www.foxnews.com/sports/high-school-girls-stage-protest-after-trans-athlete-wins-2nd-straight-state-track-championship","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/tumwater-hs.png?ve=1&tl=1","video":null,"publish_date":"2025-06-02 23:34:17","author":"Ryan Morik","authors":["Ryan Morik"],"language":"en","category":"sports","source_country":"US","sentiment":-0.173},{"id":327468948,"title":"El Salvador’s Bukele Says He Doesn’t Care If He’s Called a Dictator","text":"El Salvador’s President Nayib Bukele declared Sunday that he “doesn’t care” if people call him a dictator, amid mounting criticism over recent arrests of human rights activists and actions against NGOs. In a nationally televised speech from the National Theater marking the first year of his second term, Bukele defended his government’s hardline policies, his alignment with Donald Trump on deportations, and his offensive against humanitarian organizations.\n\nThe president accused NGOs in the country of defending gang members and engaging in political activism. He also lashed out at international organizations and the media, claiming they are part of an “organized attack” on his administration. “You know what? I don’t care if they call me a dictator. I’d rather be called a dictator than see Salvadorans being killed in the streets,” Bukele said, referencing criticisms of his heavy-handed security policies.\n\nAt 43, Bukele governs with near-total control after winning re-election with 85% support, thanks to his gang crackdown, which brought violence in El Salvador to historic lows through a state of exception allowing mass detentions without court orders. His administration is under fire for the May 18 arrest of Ruth López, an NGO lawyer who investigated alleged government corruption and supported victims of the state of exception and families of 252 Venezuelans deported from the U.S. and jailed in El Salvador.\n\n“They say we imprison human rights defenders, dissidents, regime critics… You can’t touch them. Every corrupt opposition figure arrested becomes a political prisoner. Now working at an NGO means impunity,” Bukele mocked.\n\nDefending Murderers\n\nProsecutors accuse López of embezzlement dating back to her time advising the electoral tribunal a decade ago. But local and international organizations – including Amnesty International and Human Rights Watch – claim the arrest is part of a campaign to silence dissent and suppress human rights work.\n\nTwo other activists who supported a rural protest were also arrested in May, and in February, Fidel Zavala, a leader of the Human and Community Rights Defense Unit (UNIDEHC), was detained for alleged gang ties. NGOs say Bukele is using the state of exception—imposed three years ago—to target critics, with over 86,000 alleged gang members or collaborators detained. They claim about 400 people have died in prison and thousands of innocent people remain jailed.\n\n“These so-called defenders of democracy want us to be unable to punish murderers, all in the name of a supposed ideal of human rights that only protects criminals,” Bukele stated. According to him, gangs have killed approximately 200,000 Salvadorans over the past 30 years. Bukele also defended the Foreign Agents Law, modeled after Russia and Nicaragua, which requires NGOs to register and pay a 30% tax on foreign funds.\n\nDeported Criminals\n\nA key ally of Trump’s anti-immigration policies, Bukele in March received and jailed 252 Venezuelans and 36 Salvadorans deported from the U.S., accused—without evidence—of criminal activity. At the National Theater, Bukele criticized Democratic lawmakers who visited El Salvador to request access to detainees, especially Kilmar Ábrego, a Salvadoran deported “by mistake” despite having legal protection.\n\n“Foreign congresspeople come knocking on prison doors demanding we release criminals. What gives them the right? It’s always the self-declared defenders of democracy who don’t believe in our democracy,” said Bukele. Known for his theatrical flair, Bukele orchestrated a full production to record and share footage of the deportees entering the Terrorism Confinement Center (Cecot) with shaved heads and in chains.\n\nCritics accuse him of authoritarianism. His re-election has been widely questioned as unconstitutional but was made possible by a favorable court ruling. “In this first year of an unconstitutional second term, we are seeing an authoritarian escalation. This is the consolidation of a dictatorship,” said Ingrid Escobar, director of the NGO Socorro Jurídico Humanitario.","summary":"El Salvador’s President Nayib Bukele declared Sunday that he &#8220;doesn&#8217;t care&#8221; if people call him a dictator, amid mounting criticism over recent arrests of human rights activists and actions against NGOs. In a nationally televised speech from the National Theater marking the first year of his second term, Bukele defended his government’s hardline policies, his [&#8230;]\n\n\nThe post El Salvador&#8217;s Bukele Says He Doesn’t Care If He’s Called a Dictator appeared first on The Tico Times | Costa Rica News | Travel | Real Estate.","url":"https://ticotimes.net/2025/06/02/el-salvadors-bukele-says-he-doesnt-care-if-hes-called-a-dictator","image":"https://ticotimes.net/wp-content/uploads/2025/06/el-salvador-bukele-side.jpg","video":null,"publish_date":"2025-06-02 23:34:00","author":"Tico Times","authors":["Tico Times"],"language":"en","category":"politics","source_country":"cr","sentiment":0.073},{"id":327474186,"title":"Sen. Marsha Blackburn: We owe it to Americans to make Trump's 2017 tax cuts permanent","text":"to top close Video This video is playing in picture-in-picture.\n\nKudlow June 02, 2025 07:14 \n\n Sen. Marsha Blackburn: We owe it to Americans to make Trump's 2017 tax cuts permanent \n Sen. Marsha Blackburn, R-Tenn., weighs in on holdouts against passing President Donald Trump's 'big, beautiful bill' on 'Kudlow.'\n Facebook Twitter Email Copy to clipboard Copy to clipboard \n\nTags POLITICSWHAT TO WATCHSHOWSKUDLOWKUDLOW | LATEST EPISODESV-VIDEOSCONGRESSTAXES","summary":"Sen. Marsha Blackburn, R-Tenn., weighs in on holdouts against passing President Donald Trump&apos;s &apos;big, beautiful bill&apos; on &apos;Kudlow.&apos;","url":"https://www.foxbusiness.com/video/6373803795112","image":"https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/11733f1d-83cf-47e2-9439-6cb222393855/d61e96e8-dc7e-4bc6-95a5-e5b89dab2302/1280x720/match/1024/512/image.jpg?ve=1&tl=1","video":null,"publish_date":"2025-06-02 23:33:10","author":null,"language":"en","category":"politics","source_country":"us","sentiment":0.06},{"id":327466114,"title":"Trump appears to undercut US proposal to Iran, declaring he won’t allow any uranium enrichment","text":"WASHINGTON (AP) — President Donald Trump on Monday appeared to undercut a proposal that was offered by his special envoy to Iran, saying he will insist that Tehran fully dismantle its nuclear enrichment program as part of any deal to ease crushing sanctions.\n\nTrump and Steve Witkoff, who is leading the negotiations for the U.S., have repeatedly offered inconsistent public messages about whether Iran would be allowed to retain the capacity to enrich uranium to lower levels for civilian purposes. The Trump administration maintains that it will not allow Iran to develop a nuclear weapon.\n\nThe negotiations have been framed by Trump as both countries’ best chance to avoid direct military conflict over Iran’s nuclear program. Tehran, which denies seeking a nuclear weapon, has insisted that it will not agree to any deal that fully scraps its enrichment program.\n\n“Under our potential Agreement — WE WILL NOT ALLOW ANY ENRICHMENT OF URANIUM!” Trump wrote on social media. The White House didn’t elaborate on the post.\n\nTrump’s post comes after media reports that Witkoff’s latest proposal to Tehran would allow Iran to retain low levels of enrichment for civilian uses like nuclear medicine and commercial power if it agrees to shut down its heavily protected underground sites for a period of time. The U.S. and Iran have engaged in several rounds of direct nuclear talks for the first time in years.\n\nSenior officials — including Witkoff and Trump himself — have said within the last few weeks that Iran would not be able to keep enriching uranium at any level.\n\nThe proposal, reported by Axios and confirmed by two U.S. officials, called for the creation of a regional consortium to handle uranium enrichment for civilian uses — a plan first studied more than a decade ago in negotiations that led to the 2015 Iran nuclear deal.\n\nTrump was sharply critical of that agreement — which also allowed set limits on uranium enrichment but permitted Iran to maintain such a capacity — and withdrew the U.S. from it in 2017 during his first term.\n\nThe officials spoke to The Associated Press on condition of anonymity to discuss private diplomatic negotiations.\n\nThe International Atomic Energy Agency found that Iran has further increased its stockpile of uranium enriched to near weapons-grade levels since its last update in February, according to a confidential report released by the U.N. nuclear watchdog on Saturday.\n\nIran has maintained that its nuclear program is for peaceful purposes only, but Iranian officials have increasingly suggested that Tehran could pursue an atomic bomb.\n\n“President Trump has made it clear that Iran can never obtain a nuclear bomb,” White House press secretary Karoline Leavitt said in a statement before Trump’s post. “Special Envoy Witkoff has sent a detailed and acceptable proposal to the Iranian regime, and it’s in their best interest to accept it. Out of respect for the ongoing deal, the Administration will not comment on details of the proposal to the media.”\n\nThe proposal that Trump appeared to undercut on Monday evening included significant concessions by the administration certain to anger Israel along with pro-Israel lawmakers in the United States.\n\nSeveral of the main points were essentially the same or very similar to conditions outlined in the 2015 nuclear deal.\n\nEarly iterations of that agreement negotiated by the Obama administration also suggested the possibility of a regional consortium that would put Iranian uranium enrichment above a certain level under the control of Iran and its neighbors. The idea was scrapped, however, because of Gulf Arab nations’ objections and Iranian suspicions of the ultimate aims of the consortium.\n\nPeople who were involved in the 18-month negotiations for the 2015 deal reacted immediately to reports that the Trump administration might allow Iran to continue with an enrichment program at any level, particularly after senior officials repeatedly said Iran would not be able to retain such programs.\n\n“This proposal poses a moment of truth for critics of previous Iran nuclear negotiations/agreements (and) those who have called for a no-enrichment, full-dismantlement deal,” Dan Shapiro, Obama’s former ambassador to Israel, wrote on X. “Will they hold Trump to the same standard?”\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — President Donald Trump on Monday appeared to undercut a proposal that was offered by his special envoy to Iran, saying he will...","url":"https://wsvn.com/news/politics/trump-appears-to-undercut-us-proposal-to-iran-declaring-he-wont-allow-any-uranium-enrichment/","image":"https://wsvn.com/wp-content/uploads/sites/2/2025/05/250504_Trump_waving.png","video":null,"publish_date":"2025-06-02 23:28:49","author":"Associated Press,Kevin Boulandier","authors":["Associated Press","Kevin Boulandier"],"language":"en","source_country":"us","sentiment":-0.321},{"id":327462202,"title":"Trump Hands Republican Senators New Deadline on 'Big, Beautiful Bill'","text":"President Donald Trump issued a new statement regarding the House-passed bill he has dubbed the \"big, beautiful bill,\" calling on Republican Senators to work on getting it passed and to his desk before the Fourth of July.Newsweek reached out to Republican Senate Leader John Thune's office for comment via email Monday.Why It MattersThe bill touted by Trump is a key avenue for Republicans to push forward the White House agenda following sweeping GOP election victories in November.Conservative Republicans have historically favored deep budget cuts while centrist-leaning Republicans have been more inclined to keep certain programs for the benefit of voters in their respective states.Infighting within the party could put the bill in peril due to the narrow majorities the GOP has in both chambers of Congress and the united front Democrats have against the legislation.What To KnowIn a post on X, formerly Twitter, the president touted the bill and what he calls a \"Historic Opportunity to turn our Country around after four disastrous years under Joe Biden.\"Trump noted the proposed tax cuts, permitting for energy, a new air traffic control system, new southern border wall construction and more.Concluding, the president issued a message to Republican lawmakers saying, \"With the Senate coming back to Washington today, I call on all of my Republican friends in the Senate and House to work as fast as they can to get this Bill to MY DESK before the Fourth of JULY. Thank you for your attention to this matter!\"In a follow-up post, the president also doubled down in part on previous comments, saying that \"there will be NO CUTS to Social Security, Medicare, or Medicaid. In fact, they will be saved from the incompetence of the Democrats. The Democrats, who have totally lost their confidence and their way, are saying whatever comes to mind — Anything to win!\"According to Punchbowl News Reporter Andrew Desiderio on X earlier on Monday, Thune spoke about getting the reconciliation bill to Trump's desk by the national holiday.\"THUNE says goal is for House to take up & pass whatever the Senate produces on reconciliation — so it's on Trump's desk by July 4 — tho he acknowledged Johnson's fragile majority,\" Desiderio said.Thune reportedly said, according to Desiderio, that the Senate will attempt to find more savings and make permanent some of the proposed tax provisions.This is a developing story that will be updated with additional information.","summary":"President Trump said he'd like the bill on his desk before the July 4th holiday in a new post on Monday.","url":"https://www.newsweek.com/trump-hands-republican-senators-new-deadline-big-beautiful-bill-2080076","image":"https://d.newsweek.com/en/full/2655494/donald-trump.jpg","video":null,"publish_date":"2025-06-02 23:26:52","author":"Anna Commander","authors":["Anna Commander"],"language":"en","category":"politics","source_country":"US","sentiment":0.078},{"id":327472806,"title":"Monday, June 2. Russia’s War On Ukraine: News And Information From Ukraine","text":"TOPSHOT - Head of the Ukrainian delegation and Ukraine's Defence Minister Rustem Umerov (L) speaks, ... More flanked by Ukraine's Deputy Foreign Minister Sergiy Kyslytsya (C), during a press conference after a second meeting of direct talks between Ukrainian and Russian delegations, at the Ciragan Palace, in Istanbul, on June 2, 2025. Ukrainian and Russian delegations have begun a second round of peace talks in Istanbul, where they are set to exchange plans for how they want to end the three-year war. (Photo by Adem ALTAN / AFP) (Photo by ADEM ALTAN/AFP via Getty Images)\nAFP via Getty Images\n\nDispatches from Ukraine. Day 1,195.\n\nUkraine Carries Out Historic Drone Strike on Strategic Russian Airbases\n\nOn June 1, Ukraine launched one of its most audacious and effective drone strikes since the start of Russia’s invasion, targeting four air bases deep inside Russia with 117 first-person-view (FPV) drones. Codenamed operation “Spider’s Web,” and meticulously planned over 18 months, the attack struck remote airbases in Siberia and the Russian Far East, approximately 3,400 miles from Ukraine’s eastern border and previously considered out of Ukraine’s reach. Prior to this strike, airfields at these remote locations, where Russia nuclear capable, long-range bombers are based, were considered nearly impervious to attack.\n\nUkrainian intelligence revealed that the drones were covertly smuggled into Russia, concealed within civilian trucks, and remotely activated. Russia’s defense ministry said that multiple aircraft were set ablaze and characterized the assault as a “terrorist attack” despite the strikes being directed at military targets during wartime.\n\nThe head of the Security Service of Ukraine, Vasyl Malyuk, said a day after the strike that 41 enemy aircraft were destroyed. Other assessments, however, including one by BBC News Ukraine, tallied a more modest number, upward of 11 destroyed jets.\n\nDespite inconsistency in the number of enemy aircraft reported destroyed, Ukraine’s President Volodymyr Zelenskyy praised the operation as a turning point, calling it “brilliant” and “perfectly prepared” in a Telegram social media post soon after the attack. “These are Ukrainian actions that will definitely be in history textbooks,” he continued.\n\nMORE FOR YOU\n\nApple iOS 26 For iPhone: Coming Next Week, A New Era For The iPhone\n\nMicrosoft’s Bad News—500 Million Windows Users Must Now Decide\n\nPixel 10 Pro Pricing Will Define Android’s Future\n\nThis operation, which cost Ukraine approximately several hundred thousand to several million dollars, at most, to execute, may have cost Russia as much as $7 billion in lost military assets, according to Ukrainian government estimates. The loss of even a single strategic aircraft, however, is invaluable to Russia, as the country has not produced such planes since the collapse of the Soviet Union and has lost some critical technologies needed to develop new ones.\n\nIn addition to the blow to Russia’s air power, the aftermath of the recent Ukrainian strike, hailed by some as Russia’s “Pearl Harbor,” may still be unfolding. Ukraine has, at least temporarily, neutralized the narrative of a stalemate in the war, exposed Moscow’s vulnerabilities, and weakened the Russian delegation’s position in the latest round of bilateral peace talks, held on June 2.\n\nUkraine’s most complex special operation on Russian territory to date, while hailed as a major success, also carried notable risks. According to an article by The Economist, a senior Ukrainian official, who spoke anonymously, acknowledged that the operation could potentially alienate some Western partners.\n\nAdditionally, skepticism remains in Kyiv about the feasibility of repeating such an attack, as Russian forces are expected to analyze the remnants of the drones and develop more effective countermeasures, including electronic jamming, as noted by an anonymous Ukrainian military communications specialist in reporting by Forbes Ukraine.\n\nRussia-Ukraine Peace Talks\n\nRussia and Ukraine met in Istanbul, Turkey, for just over an hour on June 2, marking only the second round of direct talks since 2022. Moscow presented stringent demands, including Kyiv’s surrender of Crimea and four southeastern regions, three of which are only partly under Russian control, restrictions on Ukraine’s military, and recognition of Russian sovereignty, terms Ukraine rejected as unacceptable. Ukrainian President Zelenskyy previously reaffirmed that Ukrainian forces will not withdraw from any territories of Ukraine.\n\nThe two sides agreed to prisoner exchanges and to each return the bodies of 6,000 deceased enemy soldiers, but no ceasefire or peace breakthrough emerged. Turkey’s President Recep Tayyip Erdogan called for a summit involving Russian President Vladimir Putin, Zelenskyy, and U.S. President Donald Trump, though U.S. mediation efforts show little progress.\n\nRussia’s Attacks on Ukraine\n\nBetween May 30 and June 2, Russian forces launched a series of deadly attacks across southern and northeastern Ukraine, killing at least seven civilians. In the southern regions of Kherson and Zaporizhzhia, artillery and drone strikes killed four civilians, including a child. Meanwhile, three residents were killed in Russian attacks on Ukraine’s northeastern Kharkiv oblast, or province.\n\nA Russian missile struck a Ukrainian military training facility on June 1, leaving at least 12 servicemembers dead and more than 60 injured despite an air raid alert that had sent most personnel into shelters during the attack. No mass gatherings were reported at the facility. Ukrainian authorities have launched an investigation to assess accountability and vowed consequences for any security lapses. Ukrainian Ground Forces Commander Mykhailo Drapatyi resigned following the deadly strike, citing a sense of personal responsibility.\n\nOn June 1, two railway bridges collapsed in Russia’s southwestern Bryansk and Kursk regions. In Bryansk, a road overpass bridge collapsed, sending multiple vehicles plunging onto a passenger train bound for Moscow; seven people were killed and more than 70 others injured. Authorities determined an explosion caused the collapse and opened a criminal investigation. In Kursk, a freight train derailed after a bridge fell, injuring a crew member. The Kremlin blamed Ukraine in both cases.\n\nGot a tip? Share confidential information with Forbes.\n\nEditorial StandardsReprints & Permissions","summary":"Dispatches from Ukraine. Day 1,195.","url":"https://www.forbes.com/sites/katyasoldak/2025/06/02/monday-june-2-russias-war-on-ukraine-news-and-information-from-ukraine/","image":"https://imageio.forbes.com/specials-images/imageserve/683e320b830505aec553c8ce/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-06-02 23:25:40","author":"Adem Altan,Forbes Staff,Katya Soldak","authors":["Adem Altan","Forbes Staff","Katya Soldak"],"language":"en","category":"politics","source_country":"US","sentiment":0.016},{"id":327468654,"title":"Drones: the newest twist in warfare — as Ukraine’s hit on Russia just showed","text":"Ukraine may not have “the cards,” as President Donald Trump put it, but it does have drones. \n\nThey were used to great effect over the weekend in an audacious attack within Russia that has focused the world’s attention on a revolution in warfare. \n\nA badly outmanned and outgunned country just reached far inside its adversary’s territory to destroy or damage hugely expensive, nuclear-capable strategic aircraft with low-cost drones basically indistinguishable from ones available on Amazon. \n\nIt’s not quite David versus Goliath, because the Russian giant is not going to be felled by the blow, but the diplomatic and psychological impact of the raid could be profound, as Ukraine seeks to demonstrate to the West its staying power. \n\nFor creativity and outsized effect with widely available devices, the Ukrainian attack is in the same league as Israel’s beeper attack on Hezbollah operatives in Lebanon last year.\n\nBoth operations also carry a message about new vulnerabilities — to a compromised supply chain and to surprise drone attack — that should make us take notice. \n\nWe’ve just watched the equivalent of aviation legend Billy Mitchell’s demonstration in 1921 when he had US planes sink a former German battleship, in a display of the emerging potency of air power.\n\nOperation Spider Web, as the Ukrainians called it, combined Mission Impossible-style intrigue — the drones were secreted within Russia and some of them launched from containers attached to trucks, unbeknownst to the drivers — with clever technical innovation. \n\nThe attacks spanned several time zones and hit 41 Russian aircraft, according to the Ukrainians. \n\nThe operation was the latest iteration of an ever-evolving, cat-and-mouse drone war between Ukraine and Russian.\n\nThe Ukraine war is essentially a war of attrition, yet it is anything but static, as the means of waging it is changing almost by the week.\n\nOffensive innovation is met with defensive counter-move, triggering another change on offense.\n\nDrones are vulnerable to electronic jamming? Then, they’ll be controlled by massive spools of fiber optic cable.\n\nDrones threaten supply routes? Then, the roads will be covered with netting.\n\nDrones are targeted by drones? Then, the drones will carry their own anti-drone cages. \n\nDrones have, in some ways, replaced artillery. Estimates are that drones now inflict about 70% of casualties on both sides, and there are literally millions of them.\n\nRussia deployed roughly 4 million drones last year, and Ukraine about 1.5 million. \n\nWe have much to learn from all this. After last weekend, every commander of a US base should be thinking anew about potential vulnerability to drone attack, and it’s not hard to imagine the Chinese utilizing drones to execute a wide-ranging strike in the Western Pacific if Beijing goes after Taiwan.\n\nThe United States, once a leader in drone technology when it used Predators and the like to take out enemies in the War on Terror, hasn’t kept up with the adaptations happening in the Ukraine war.\n\nInevitably, our own processes are our worst enemy.\n\nAs Nathan Ecelbarger, head of the US National Drone Association writes, the system for acquiring drones “remains deeply flawed, overly bureaucratic and resistant to innovation.”\n\nAnd military policies regarding the integration of drones haven’t been updated in more than a decade.\n\n“Squad leaders,” he notes, “shouldn’t have to be Federal Aviation Administration, Federal Communications Commission and Department of Defense policy experts to get their hands on emerging drone technologies.”\n\nWe’ll have to focus more on defenses, too, whether early detection or counter-drone capabilities.\n\nThe problem with using missiles to defeat drones is the asymmetry in expense — a SM-2 missile costs millions, whereas a Houthi drone costs thousands.\n\nAnd drone swarms could overcome a battery of missiles. \n\nThis is the reason technologies being developed by next-generation defense firms like Epirus, working on a directed energy counter-measure, are so important to fund and, one hopes, deploy. \n\nWhat’s happening in the Ukraine war isn’t an exception, but the rule of human conflict. Whoever takes the technological leap ahead in war-fighting capability often prevails, while the laggard is left to contemplate his castle reduced to rubble or his fleet sent to the bottom of the ocean. \n\nTwitter: @RichLowry","summary":"Ukraine may not have “the cards,” as President Donald Trump put it, but it does have drones.  They were used to great effect over the weekend in an audacious attack within Russia that has focused the world’s attention on a revolution in warfare.  A badly outmanned and outgunned country just reached far inside its adversary’s...","url":"https://nypost.com/2025/06/02/opinion/drones-the-new-twist-in-warfare-as-ukraines-hit-on-russia-shows/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/20250530_zaa_t113_088-e1748906435738.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/kN6pTTOg-RyIcpnTz.mp4","publish_date":"2025-06-02 23:24:45","author":"Rich Lowry","authors":["Rich Lowry"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013},{"id":327471808,"title":"Trump appears to undercut US proposal to Iran, declaring he won't allow any uranium enrichment","text":"WASHINGTON (AP) — President Donald Trump on Monday appeared to undercut a proposal that was offered by his special envoy to Iran, saying he will insist that Tehran fully dismantle its nuclear enrichment program as part of any deal to ease crushing sanctions.\n\nTrump and Steve Witkoff, who is leading the negotiations for the U.S., have repeatedly offered inconsistent public messages about whether Iran would be allowed to retain the capacity to enrich uranium to lower levels for civilian purposes. The Trump administration maintains that it will not allow Iran to develop a nuclear weapon.\n\nThe negotiations have been framed by Trump as both countries’ best chance to avoid direct military conflict over Iran’s nuclear program. Tehran, which denies seeking a nuclear weapon, has insisted that it will not agree to any deal that fully scraps its enrichment program.\n\n“Under our potential Agreement — WE WILL NOT ALLOW ANY ENRICHMENT OF URANIUM!” Trump wrote on social media.\n\nAddressing the seeming contradiction, a White House official said Trump was speaking the “cold, hard truth.” The official said the terms the U.S. gave the Iranians were “very tough” and would make it impossible for them to obtain a nuclear bomb.\n\nTrump’s post comes after media reports that Witkoff’s latest proposal to Tehran would allow Iran to retain low levels of enrichment for civilian uses like nuclear medicine and commercial power if it agrees to shut down its heavily protected underground sites for a period of time. The U.S. and Iran have engaged in several rounds of direct nuclear talks for the first time in years.\n\nSenior officials — including Witkoff and Trump himself — have said within the last few weeks that Iran would not be able to keep enriching uranium at any level.\n\nThe proposal, reported by Axios and confirmed by a U.S. official, called for the creation of a regional consortium to handle uranium enrichment for civilian uses — a plan first studied more than a decade ago in negotiations that led to the 2015 Iran nuclear deal.\n\nTrump was sharply critical of that agreement — which also allowed set limits on uranium enrichment but permitted Iran to maintain such a capacity — and withdrew the U.S. from it in 2017 during his first term.\n\nThe officials spoke to The Associated Press on condition of anonymity to discuss private diplomatic negotiations.\n\nThe International Atomic Energy Agency found that Iran has further increased its stockpile of uranium enriched to near weapons-grade levels since its last update in February, according to a confidential report released by the U.N. nuclear watchdog on Saturday.\n\nIran has maintained that its nuclear program is for peaceful purposes only, but Iranian officials have increasingly suggested that Tehran could pursue an atomic bomb.\n\n“President Trump has made it clear that Iran can never obtain a nuclear bomb,” White House press secretary Karoline Leavitt said in a statement before Trump’s post. “Special Envoy Witkoff has sent a detailed and acceptable proposal to the Iranian regime, and it’s in their best interest to accept it. Out of respect for the ongoing deal, the Administration will not comment on details of the proposal to the media.”\n\nThe proposal that Trump appeared to undercut on Monday evening included significant concessions by the administration certain to anger Israel along with pro-Israel lawmakers in the United States.\n\nSeveral of the main points were essentially the same or very similar to conditions outlined in the 2015 nuclear deal.\n\nEarly iterations of that agreement negotiated by the Obama administration also suggested the possibility of a regional consortium that would put Iranian uranium enrichment above a certain level under the control of Iran and its neighbors. The idea was scrapped, however, because of Gulf Arab nations’ objections and Iranian suspicions of the ultimate aims of the consortium.\n\nPeople who were involved in the 18-month negotiations for the 2015 deal reacted immediately to reports that the Trump administration might allow Iran to continue with an enrichment program at any level, particularly after senior officials repeatedly said Iran would not be able to retain such programs.\n\n“This proposal poses a moment of truth for critics of previous Iran nuclear negotiations/agreements (and) those who have called for a no-enrichment, full-dismantlement deal,” Dan Shapiro, Obama’s former ambassador to Israel, wrote on X. “Will they hold Trump to the same standard?”","summary":"WASHINGTON (AP) — President Donald Trump on Monday appeared to undercut a proposal that was offered by his special envoy to Iran, saying he will insist that Tehran fully dismantle its nuclear enrichment program as part of any deal to…","url":"https://www.thestar.com/news/world/united-states/trump-appears-to-undercut-us-proposal-to-iran-declaring-he-wont-allow-any-uranium-enrichment/article_5639d39c-c7f2-5a83-9fd8-338d168a9034.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/b/ae/bae851c1-a986-59c0-bb38-10a628eef510/683e32cf1ba94.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-06-02 23:19:58","author":"Zeke Miller And Matthew Lee The Associated Press","authors":["Zeke Miller And Matthew Lee The Associated Press"],"language":"en","source_country":"ca","sentiment":-0.248},{"id":327467818,"title":"Trump appears to undercut US proposal to Iran, declaring he won't allow any uranium enrichment - AP News","text":"WASHINGTON (AP) — President Donald Trump on Monday appeared to undercut a proposal that was offered by his special envoy to Iran, saying he will insist that Tehran fully dismantle its nuclear enrichment program as part of any deal to ease crushing sanctions.\n\nTrump and Steve Witkoff, who is leading the negotiations for the U.S., have repeatedly offered inconsistent public messages about whether Iran would be allowed to retain the capacity to enrich uranium to lower levels for civilian purposes. The Trump administration maintains that it will not allow Iran to develop a nuclear weapon. \n\nThe negotiations have been framed by Trump as both countries’ best chance to avoid direct military conflict over Iran’s nuclear program. Tehran, which denies seeking a nuclear weapon, has insisted that it will not agree to any deal that fully scraps its enrichment program.\n\n“Under our potential Agreement — WE WILL NOT ALLOW ANY ENRICHMENT OF URANIUM!” Trump wrote on social media. \n\nAddressing the seeming contradiction, a White House official said Trump was speaking the “cold, hard truth.” The official said the terms the U.S. gave the Iranians were “very tough” and would make it impossible for them to obtain a nuclear bomb. \n\nTrump’s post comes after media reports that Witkoff’s latest proposal to Tehran would allow Iran to retain low levels of enrichment for civilian uses like nuclear medicine and commercial power if it agrees to shut down its heavily protected underground sites for a period of time. The U.S. and Iran have engaged in several rounds of direct nuclear talks for the first time in years.\n\nSenior officials — including Witkoff and Trump himself — have said within the last few weeks that Iran would not be able to keep enriching uranium at any level.\n\nThe proposal, reported by Axios and confirmed by a U.S. official, called for the creation of a regional consortium to handle uranium enrichment for civilian uses — a plan first studied more than a decade ago in negotiations that led to the 2015 Iran nuclear deal. \n\nTrump was sharply critical of that agreement — which also allowed set limits on uranium enrichment but permitted Iran to maintain such a capacity — and withdrew the U.S. from it in 2017 during his first term.\n\nThe officials spoke to The Associated Press on condition of anonymity to discuss private diplomatic negotiations.\n\nThe International Atomic Energy Agency found that Iran has further increased its stockpile of uranium enriched to near weapons-grade levels since its last update in February, according to a confidential report released by the U.N. nuclear watchdog on Saturday.\n\nIran has maintained that its nuclear program is for peaceful purposes only, but Iranian officials have increasingly suggested that Tehran could pursue an atomic bomb.\n\n“President Trump has made it clear that Iran can never obtain a nuclear bomb,” White House press secretary Karoline Leavitt said in a statement before Trump’s post. “Special Envoy Witkoff has sent a detailed and acceptable proposal to the Iranian regime, and it’s in their best interest to accept it. Out of respect for the ongoing deal, the Administration will not comment on details of the proposal to the media.”\n\nThe proposal that Trump appeared to undercut on Monday evening included significant concessions by the administration certain to anger Israel along with pro-Israel lawmakers in the United States. \n\nSeveral of the main points were essentially the same or very similar to conditions outlined in the 2015 nuclear deal. \n\nEarly iterations of that agreement negotiated by the Obama administration also suggested the possibility of a regional consortium that would put Iranian uranium enrichment above a certain level under the control of Iran and its neighbors. The idea was scrapped, however, because of Gulf Arab nations’ objections and Iranian suspicions of the ultimate aims of the consortium.\n\nPeople who were involved in the 18-month negotiations for the 2015 deal reacted immediately to reports that the Trump administration might allow Iran to continue with an enrichment program at any level, particularly after senior officials repeatedly said Iran would not be able to retain such programs.\n\n“This proposal poses a moment of truth for critics of previous Iran nuclear negotiations/agreements (and) those who have called for a no-enrichment, full-dismantlement deal,” Dan Shapiro, Obama’s former ambassador to Israel, wrote on X. “Will they hold Trump to the same standard?”","summary":"Trump appears to undercut US proposal to Iran, declaring he won't allow any uranium enrichment  AP News","url":"https://apnews.com/article/trump-witkoff-iran-nuclear-israel-881df1c858361798040913c043802c24","image":"https://dims.apnews.com/dims4/default/258830c/2147483647/strip/true/crop/5481x3083+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F21%2Ffaf275427500e80aa91a761c39a0%2F492ef251c134465c9733399d1ec08ebe","video":null,"publish_date":"2025-06-02 23:19:00","author":"Matthew Lee,Zeke Miller","authors":["Matthew Lee","Zeke Miller"],"language":"en","source_country":"us","sentiment":-0.248},{"id":327462760,"title":"Trump says US will not allow Iran enrich 'any' uranium under nuclear deal","text":"US President Donald Trump said Monday Iran would not enrich uranium under any potential nuclear deal. Since April, Tehran and Washington have held five rounds of talks to replace the 2015 pact Trump quit in 2018. A new agreement has yet to be finalised.\n\nUS President Donald Trump on Monday ruled out allowing Iran to enrich uranium under any nuclear deal between the foes -- as Tehran defended what it said was its \"peaceful\" pursuit of fuel for power generation.\n\nUranium enrichment has remained a key point of contention in five rounds of talks since April to ink a new accord to replace the deal with major powers that Trump abandoned during his first term in 2018.\n\n\"Under our potential Agreement -- WE WILL NOT ALLOW ANY ENRICHMENT OF URANIUM!\" Trump said on his Truth Social network, after the Axios news outlet said Washington's offer would let Tehran enrich some of the nuclear fuel.\n\nRepublican Trump also blamed predecessor Joe Biden for the current situation, saying that the Democrat \"should have stopped Iran a long time ago from 'enriching.'\"\n\nAxios said the latest proposal that Washington had sent Tehran on Saturday would allow limited low-level uranium enrichment on Iranian soil, for an amount of time that has yet to be determined.\n\nIran has insisted that Iran has \"nothing to hide\" on its nuclear program.\n\nThe IAEA report showed that Iran has ramped up production of uranium enriched up to 60 percent -- close to the roughly 90 percent level needed for atomic weapons.\n\nRead more on FRANCE 24 EnglishRead also:Iran carried out secret nuclear programme, has amassed more near weapons-grade uranium, IAEA saysUS-Iran nuclear talks mark 'some' progress, mediator Oman says","url":"https://uk.news.yahoo.com/trump-says-us-not-allow-231708407.html","image":"https://media.zenfs.com/en/france_24_english_articles_100/7dad37c1ea63a483fe251a9ec475871f","video":null,"publish_date":"2025-06-02 23:17:08","author":"France 24","authors":["France 24"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.504},{"id":327466890,"title":"3 Ladera Ranch residents among this year’s West Point academy grads","text":"A service night at Tesoro High School and the impression a U.S. Military Academy West Point recruiter made on Amnita Kaur was enough to put her on a path to becoming an Army officer and among a small percentage of cadets chosen to go to medical school on the Army’s dime.\n\nKaur, who just days ago earned the title of 2nd lieutenant while graduating with 1,002 cadets from West Point, said the military academy schooling is giving her an opportunity few others get.\n\n“The amount of opportunity and trust they’ve put into us,” she said of the academy staff. “I’m going to medical school, but a lot of my classmates will go to basic officer courses, they’ll go to Ranger school, Airborne and within a year, they could be in charge of a platoon — 30 to 40 soldiers.”\n\n“West Point, the way it’s structured; they’ve put us through physical, mental and emotional challenges,” she added. “And hopefully, we as a class and graduates can step up to the plate and be those lieutenants that those soldiers deserve.”\n\nKaur, 21, is one of three Ladera Ranch residents in that West Point graduating class, along with Alex Vollmond and Justin Rogers. All three are also Tesoro High grads.\n\nVollmond, 23, heads to Fort Sill, Oklahoma, for field officer artillery training, and Rogers, 23, heads to Fort Novosel, Alabama, to fly helicopters.\n\nAt West Point, cadets undergo a four-year program, preparing them to commission as Army officers. President Donald Trump gave the keynote address at the recent graduation; it was titled “Together We Thrive.”\n\n“Instead of stock options … you chose honor and you chose sacrifice,” Trump said. “Instead of business suits and dress shoes, you chose muddy boots and fatigues and keeping yourselves in shape — because West Point cadets don’t just have the brightest minds, you also have the bravest hearts and the noblest souls.”\n\nAfter their five years of active duty, graduates are required to serve an additional three years in the reserves, for a total eight-year commitment to the military.\n\nNow back home, Kaur will have some time to relax before heading off to medical school, where she hopes to specialize in general surgery. After four years and earning her medical degree, she’ll be promoted to captain and then spend another six years in residency in a military hospital.\n\nDespite having no family connection to military service, Kaur said her application to the service academy was “intrinsically motivated.”\n\n“My dad took me to one of the service nights a congressman hosted in my freshman year,” she said. “From that moment I saw the servicemember there with his uniform and just the pride he had in his military career, I applied. I didn’t know much about the school, didn’t know if I would make it through basic training, but I think one day at a time, it worked out, and it was the best 27-month experience I could have asked for.”\n\nIt’s the “being part of something bigger than herself” that resonates most with her, Kaur said.\n\n“Having a genuine sense of purpose and pride in what you do,” she added. “You wake up every morning and there is a mission that is noble and honorable, and you get to put your best foot forward and advance the whole team.”\n\nShe also said she had few opportunities to come home during her four years in the academy, but she met many supportive people along the way.\n\n“There’s no way I would have been able to make it through those four years without the friends I made along the way, the mentors I have,” she said. “There are so many I look up to and know they’re just one phone call away. That sense of family and having someone to lean on is really important and special.”","summary":"This year 1,002 cadets graduated from the Army academy, which prepares them to commission as Army officers.","url":"https://www.ocregister.com/2025/06/02/3-ladera-ranch-residents-among-this-years-west-point-academy-grads/","image":"https://www.ocregister.com/wp-content/uploads/2025/06/16x9_OCR-L-WESTPOINT-0601-03.jpg?w=715&h=403","video":null,"publish_date":"2025-06-02 23:14:11","author":"Erika I. Ritchie","authors":["Erika I. Ritchie"],"language":"en","source_country":"us","sentiment":0.119},{"id":327463074,"title":"Trump pulls Jared Isaacman nomination to lead NASA days before vote","text":"June 2 (UPI) -- Just days before the U.S. Senate was set to hold a confirmation vote, President Donald Trump withdrew Jared Isaacman's nomination for NASA administrator, citing \"prior associations.\"\n\nWhile the White House did not reveal specifics about why the nomination was being pulled, spokesperson Liz Huston confirmed Monday that the administration is looking for a new candidate to lead the agency.\n\n\"The administrator of NASA will help lead humanity into space and execute President Trump's bold mission of planting the American flag on the planet Mars,\" Huston said. \"It's essential that the next leader of NASA is in complete alignment with President Trump's America First agenda and a replacement will be announced directly by President Trump soon.\"\n\nOn Saturday, Trump revealed in a post on Truth Social that he was withdrawing the nomination \"after a thorough review of prior associations,\" without providing more details.\n\n\"I am hereby withdrawing the nomination of Jared Isaacman to head NASA. I will soon announce a new nominee, who will be mission aligned and will put America First in space,\" Trump said.\n\nIsaacman was expected to be confirmed this week after Senate Majority Leader John Thune, R-S.D., filed cloture on the nomination May 22. Several Democratic members of the Senate Commerce Committee had voted with Republicans in April to favorably report the nomination to the full Senate.\n\nIsaacman, a commercial astronaut and billionaire businessman with ties to SpaceX, led the first all-civilian space flight into orbit and had received the endorsement of 28 former NASA astronauts. Sen. Tim Sheehy, R-Mont., criticized the administration's decision to pull his nomination.\n\n\"Astronaut and successful businessman Isaacman was a strong choice by President Trump to lead NASA,\" Sheet wrote in a post on X. \"I was proud to introduce Jared at his hearing and strongly oppose efforts to derail his nomination.\"\n\nNASA released details Friday about its proposed fiscal year 2026 budget, which includes 25% cuts to the space agency's overall spending. In April, Isaacman criticized reports that science funding could be cut by nearly 50%, saying it \"does not appear to be an optimal outcome.\"\n\nAfter Trump's weekend post, Isaacman -- who was nominated last December -- thanked the president and the Senate \"who supported me throughout this journey.\"\n\n\"The past six months have been enlightening and, honestly, a bit thrilling. I have gained a much deeper appreciation for the complexities of government and the weight our political leaders carry,\" Isaacman wrote Saturday in a post on X.\n\n\"I have not flown my last mission -- whatever form that may ultimately take -- but I remain incredibly optimistic that humanity's greatest spacefaring days lie ahead. I'll always be grateful for this opportunity and cheering on our president and NASA as they lead us on the greatest adventure in human history.\"","summary":"Just days before the U.S. Senate was set to hold a confirmation vote, President Donald Trump withdrew Jared Isaacman's nomination for NASA administrator, citing \"prior associations.\"","url":"https://www.upi.com/Top_News/US/2025/06/02/white-house-withdraws-nasa-administrator-nomination/7451748904183/","image":"https://cdnph.upi.com/ph/st/th/7451748904183/2025/upi/ac032ff791630e1f98aa9ff62782a7f5/v1.2/Trump-pulls-Jared-Isaacman-nomination-to-lead-NASA-days-before-vote.jpg","video":null,"publish_date":"2025-06-02 23:12:12","author":"Sheri Walsh","authors":["Sheri Walsh"],"language":"en","category":"politics","source_country":"US","sentiment":-0.007},{"id":327472658,"title":"Cramer says 'be ready for disappointment' as the White House continues to shape market action","text":"CNBC's Jim Cramer reviewed Monday's market action, chalking up the day's performance to expectations about the White House's next move. He advised that investors prepare for turbulence, even as some on Wall Street continue to have optimism about President Donald Trump's impact on big business.\n\n\"We have to be ready for disappointment, because we've seen it over and over and over again,\" he said. \"This administration is perfectly willing to disappoint the stock market…to advance their agenda, and it's foolish that you should believe otherwise.\"\n\nAccording to Cramer, the past two sessions have been shaped by changing notions of trade relations between the U.S. and China. After opening lower on Monday, stocks managed to finish in the green by close. Cramer said Wall Street was encouraged after a senior White House official told CNBC that Trump is set to meet with Chinese President Xi Jinping very soon.\n\nCramer remarked that with one report, \"the market did an entire 180.\" He speculated about whether the president is content to have \"a genuine trade peace with China,\" even as investors are largely hopeful Trump will change course and loosen restrictions on semiconductor exports to the country.\n\nBut Cramer noted that there are still broader fears pushing a number of stocks down. Dell reported a strong quarter last week. According to Cramer, shares later dipped in part because investors worried about the administration's push to squeeze federal contractors — many of whom buy equipment from the company. Government contractor Booz Allen Hamilton has also seen its stock get crushed, he continued. New tariffs have also spurred the declines of many U.S. outfits with major suppliers abroad, including Gap and Apple, Cramer added.\n\n\"We're always one posting, one whisper away from rallying or declining,\" Cramer said. \"As long as we recognize that the President's in control of the stock market — at least, when he wants to be — we can make sense of this tape.\"\n\nThe White House did not immediately respond to request for comment.","summary":"CNBC's Jim Cramer reviewed Monday's market action, chalking up the day's performance to expectations about the White House's next move.","url":"https://www.cnbc.com/2025/06/02/cramer-be-ready-for-disappointment-as-white-house-shapes-market-action.html","image":"https://image.cnbcfm.com/api/v1/image/106349569-1579719779301img_3342r.jpg?v=1697236638","video":"https://pdl-iphone-cnbc-com.akamaized.net/VCPS/Y2025/M06D02/7000378077/2ED3-MM-A-BLOCK-SHORT-0602225_L.mp4","publish_date":"2025-06-02 23:10:25","author":"Julie Coleman","authors":["Julie Coleman"],"language":"en","category":"politics","source_country":"US","sentiment":-0.251},{"id":327460536,"title":"Poland Elects National Conservative as New President","text":"Poland’s national conservative leader, Karol Nawrocki, has won the presidency of Poland, according to election results on Monday. In a narrow race, Nawrocki defeated Rafal Trzaskowski of the left-wing Civic Platform Party to become the country’s new head of state. \n\nThe president-elect had been endorsed by President Donald Trump.\n\nIn Poland’s parliamentary system, the president has the ability to veto legislation from the Sejm, Poland’s lower house of its Parliament (which in turn can be overturned by a three-fifths majority vote). He also serves as the commander in chief of the nation’s armed forces. \n\nHowever, he does not set much of the governing agenda for the country. The prime minister is the head of government, who runs Poland’s Cabinet, and is confirmed by a vote of the Sejm, which means he is typically the leader of the preeminent party of Poland’s parliament.\n\nIf the past is any indication, Nawrocki may be on a collision course with Poland’s current prime minister, Donald Tusk, who has made greater integration with Europe a cornerstone of his foreign policy. \n\n“Mr. Nawrocki’s election is yet another sign that Europeans are waking up and rejecting the anti-civilizational efforts of the global Left, especially mass migration. Hopefully, he’ll work closely with other patriotic parties to reverse the decades of decline mainstream parties have overseen across Europe,” Wilson Beaver, a senior policy adviser for defense budgeting at The Heritage Foundation, told The Daily Signal. \n\nThe Daily Signal also spoke with Nile Gardiner, the director of the Margaret Thatcher Center for Freedom at The Heritage Foundation, about what the Polish election means for the U.S.\n\n“So, what the election does, it puts a break on the pro-EU agenda of [Polish Prime Minister] Donald Tusk,” Gardiner said.\n\nNawrocki, who ran for president as an independent, was nevertheless endorsed by the right-wing Law and Justice Party of Poland, which stands in opposition to the current Polish prime minister. \n\n“The Polish people really want to preserve Poland’s culture, its traditions, and Polish sovereignty,” Gardiner said. \n\nHe noted that Poland is a major military ally to the U.S. and a rising power in Europe. \n\n“Poland is already moving toward spending close to 5% of GDP on defense, which is above any other country in the NATO alliance right now. And so what happened in Poland really matters for the United States,” Gardiner told The Daily Signal. \n\nAnthony Kim, the Jay Kingham research fellow in international economic affairs, editor of the Index of Economic Freedom, and manager of global engagement at the Margaret Thatcher Center for Freedom also weighed in.\n\n“As a net security contributor and a valuable partner of Washington in Europe, Warsaw is and will continue to be an important gateway for America’s economic and security engagement with central and eastern European countries,” Kim told the Daily Signal.","summary":"Poland’s national conservative leader, Karol Nawrocki, has won the presidency of Poland, according to election results on Monday. In a narrow race, Nawrocki defeated Rafal... Read More\n\n\nThe post Poland Elects National Conservative as New President appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/06/02/poland-elects-national-conservative-new-president/","image":"https://www.dailysignal.com/wp-content/uploads/2025/06/25.06.02_Poland.jpg","video":null,"publish_date":"2025-06-02 23:10:00","author":"Fellow Lawmaker,Jacob Adams","authors":["Fellow Lawmaker","Jacob Adams"],"language":"en","category":"politics","source_country":"us","sentiment":0.094},{"id":327462666,"title":"Administración de Trump publica lista de 'jurisdicciones santuario' en Illinois que considera obstruyen a ICE","text":"El Departamento de Seguridad Nacional (DHS) ha publicado una lista de “jurisdicciones santuario” que incluye siete ciudades y 96 condados en Illinois que la administración de Trump considera que obstruyen la realización de la inmigración, mientras intenta aumentar la presión sobre las comunidades que cree que están en el camino de la agenda de deportaciones masivas del presidente.\n\nBerwyn, Chicago, Evanston, Oak Park, Skokie, St. Joseph y Urbana están todas incluidas en la lista.\n\nEl departamento publicó el jueves una lista de las jurisdicciones y dijo que cada una recibirá una notificación formal de que el gobierno las ha considerado no conformes y si se cree que están infringiendo alguna ley penal federal. La lista fue publicada en el sitio web del departamento.\n\n“Estos políticos de las ciudades santuario están poniendo en peligro a los estadounidenses y a nuestras fuerzas del orden para proteger a criminales ilegales violentos”, dijo la secretaria del DHS, Kristi Noem, en un comunicado de prensa.\n\nLa administración de Trump ha atacado repetidamente a comunidades, estados y jurisdicciones que, según dice, no están haciendo lo suficiente para ayudar al Servicio de Inmigración y Control de Aduanas (ICE) en su intento de cumplir con las promesas de campaña del presidente Donald Trump de remover a millones de personas que se encuentran en el país ilegalmente.\n\nLa lista fue compilada utilizando una serie de factores, incluyendo si las ciudades o localidades se identificaron a sí mismas como ciudades santuario, qué tan bien han cooperado con los funcionarios federales encargados de hacer cumplir las leyes de inmigración, si tenían restricciones sobre compartir información con agentes de inmigración o si tenían alguna protección legal para las personas en el país ilegalmente, según el departamento.\n\nTrump firmó una orden ejecutiva el 28 de abril que requiere que la secretaria de Seguridad Nacional y el fiscal general publiquen una lista de estados y jurisdicciones locales que consideren que están obstruyendo las leyes federales de inmigración. La lista debe ser actualizada regularmente.\n\nLos departamentos y agencias federales, trabajando con la Oficina de Administración y Presupuesto, tendrían la tarea de identificar subvenciones o contratos federales con esos estados o jurisdicciones locales que el gobierno federal identificó como “jurisdicciones santuario” y suspender o terminar el dinero, según la orden ejecutiva.\n\nSi se notifica a las “jurisdicciones santuario” y la administración de Trump determina que “continúan desafiando”,” entonces el fiscal general y la secretaria de Seguridad Nacional pueden realizar los “remedios legales y medidas de aplicación” que consideren necesarias para hacer que cumplan.\n\nNo existe una definición específica o legal de lo que constituye una “jurisdicción santuario”. Con frecuencia el término se utiliza para referirse a agencias de aplicación de la ley, estados o comunidades que no cooperan con la ejecución de agentes de inmigración.\n\nAlgunas ciudades se opusieron después de encontrarse en la lista.\n\nEl alcalde de Baltimore, Brandon Scott, dijo en X que Baltimore “no es una ciudad santuario”, señalando que Baltimore no controla las cárceles de la ciudad. Las cárceles son un área clave donde ICE coopera con las autoridades locales de aplicación de la ley para que puedan ser notificadas cuando los inmigrantes vayan a ser liberados.\n\nPero Scott también dijo que la Municipalidad no se disculpaba por ser una “ciudad acogedora” y que se estaba preparando para litigar si era necesario para proteger a la comunidad inmigrante de la ciudad y el dinero que recibe del gobierno federal.\n\n“Estamos mejor gracias a nuestros vecinos inmigrantes, y no estamos dispuestos a traicionarlos en esta administración”, enfatizó Scott.\n\nEn una declaración en X, el gobierno de Las Vegas dijo que no estaban seguros de por qué DHS los incluyó en la lista y que esperaban “aclarar este malentendido”. La Municipalidad dijo que las instalaciones de aplicación de la ley y cárceles allí cumplen con la ley federal.\n\nICE hace cumplir las leyes de inmigración en todo el país, pero frecuentemente busca ayuda estatal y local para alertar a las autoridades federales sobre inmigrantes buscados para deportación y mantener a esa persona hasta que los oficiales federales tomen custodia.\n\nUna de las maneras en que la administración busca involucrar al apoyo estatal y local es\n\na través de acuerdos 287(g) con agencias locales de aplicación de la ley. Esos acuerdos permiten a las agencias locales de aplicación de la ley asumir algunas funciones de inmigración y expandir enormemente las capacidades de ICE. El número de esos acuerdos se ha disparado en cuestión de meses bajo la administración de Trump.\n\nICE cuenta con aproximadamente 6,000 oficiales de cumplimiento de la ley, un número que se ha mantenido en gran medida estático durante años, que son capaces de encontrar, arrestar y remover a los inmigrantes que están buscando. Al depender de la aplicación de la ley local, puede aumentar rápidamente el número de personal disponible para ayudar a realizar la agenda de deportaciones masivas de Trump.\n\nLas comunidades que no cooperan con ICE a menudo dicen que lo hacen porque los inmigrantes se sienten más seguros al presentarse si son testigos o víctimas de un crimen. Y argumentan que el cumplimiento de la inmigración es una tarea federal, y necesitan enfocar sus limitados recursos en combatir el crimen.\n\n“Las políticas de santuario son legales y nos hacen a todos más seguros”, dijo una coalición de funcionarios locales de todo el país y una organización sin fines de lucro llamada Public Rights Project en un comunicado el jueves. Dicen que la lista es una táctica de miedo diseñada para amenazar a los gobiernos locales a cooperar con ICE.\n\nLa administración de Trump ya ha tomado una serie de pasos dirigidos a estados y comunidades que no cooperan con ICE y ha enfrentado resistencia en las cortes. Una orden ejecutiva emitida por Trump instruye al fiscal general y a la secretaria de Seguridad Nacional a retener fondos federales de las jurisdicciones santuario. Otra instruye a las agencias federales a asegurarse de que los pagos a los gobiernos estatales y locales no “favorezcan las llamadas políticas de ‘santuario’ que buscan proteger a los ilegales de la deportación”.\n\nTraducido por La Voz Chicago con inteligencia artificial (AI)","url":"https://chicago.suntimes.com/la-voz/2025/06/02/administracion-trump-publica-lista-jurisdicciones-santuario-en-illinois-que-cree-obstruyen-ice","image":"https://cst.brightspotcdn.com/dims4/default/8b99b8b/2147483647/strip/true/crop/4000x2283+0+191/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F27%2Fac%2Fb7bb2a404f6da5c7f0f58312222c%2Fap25","video":null,"publish_date":"2025-06-02 23:07:23","author":"Rebecca Santana | AP","authors":["Rebecca Santana | AP"],"language":"en","category":"politics","source_country":"us","sentiment":1},{"id":327457448,"title":"Trump’s art of the steel deal, Don’s sensible national-park cuts and other commentary","text":"From the right: Trump’s Art of the Steel Deal\n\n“Nippon Steel is buying US Steel for $15 billion and has agreed to let the American company remain American-operated” in a Trump-approved deal that “addressed concerns about national security while securing economic gains for the nation,” cheers the Washington Examiner’s editorial board.\n\n“Local unions have overwhelmingly backed the deal,” which lets Nippon Steel become “the world’s second-largest steel producer, allowing it to compete with China‘s Baowu Steel Group, and gaining access to the American market, one of the world’s largest.”\n\nGov. Josh Shapiro (D-Pa.) called the bargain a “ ‘BFD’ that he supports enthusiastically.”\n\nWow: “How often do the terms of a corporate merger unite Republicans, Democrats, and union leaders, while creating tens of thousands of jobs and reducing the market dominance of the nation’s greatest geopolitical foe?”\n\nLibertarian: Don’s Sensible National-Park Cuts\n\n“Why should the National Park Service be funding so many sites,” including some that aren’t national parks? “And what would happen if some of those properties were transferred to state or tribal management?” asks Reason’s Liz Wolfe.\n\n“The Trump administration is asking those sensible questions, and is proposing to cut $1.2 billion from the agency’s budget” by turning over some niche sites to local management.\n\n“It’s always been unclear to me why we expect taxpayers across the country to pay for the upkeep and management of” sites “they will never visit and have never heard of.”\n\nSome may end up closing without federal funding, “but if there’s no political will within the state to fund these sites, maybe that’s a sign . . . that they shouldn’t continue to be publicly operated.”\n\nLabor beat: Cali’s $30 Minimum-Wage Oops\n\nLos Angeles is “on track” to miss out on hosting the 2028 Summer Olympics, thanks to “a new $30 minimum wage for hotel and airport workers passed at the behest of the city’s hospitality unions,” laments Michael Saltsman at The Wall Street Journal.\n\nLA’s Olympic bid promised “enough hotel rooms for athletes, spectators and officials” at given rates, but eight hotels have now pulled out, “citing the unworkable economics,” and a development that would create 395 rooms was canned.\n\nAll of which means less tax revenue for Los Angeles. Meanwhile, California wants $40 billion from Uncle Sam to help LA recover from the wildfires.\n\nCongress should condition aid “on a moratorium on any mandates, including the $30 minimum wage, that would put recovery and taxpayer dollars at risk.”\n\nFrom the left: Ignoring the Media’s ‘Original Sin’\n\nThe Jake Tapper-Alex Thompson book “Original Sin” details how President Biden’s team “concealed his cognitive and physical decline,” but “shifts blame to Democrats, ignoring how the media aided the cover-up,” grumbles Nolan Higdon at The Hill.\n\n“Credibility in journalism — hard to earn, easy to lose — once demanded rigorous objectivity.” No doubt, the media’s “abandonment of objectivity accelerated with Donald Trump’s rise.”\n\nDespite Tapper’s own efforts to portray “himself as deceived” and “positioning his book as a reckoning,” it “evades the real question: did this cover-up begin before the election?”\n\n“The answer is yes — and Tapper was part of it.” The public won’t buy journalists’ supposed return to “objectivity” because the media’s lost credibility “isn’t easily reclaimed.”\n\nConservative: RIP, Monetary Hero Stanley Fischer\n\nCommentary’s Seth Mandel celebrates the “great warrior of monetary policy,” Stanley Fischer, dead at 81, who “saved Israel’s economy twice.”\n\nFirst his advice helped end the Jewish State’s mid-1980s inflationary spiral with a bipartisan plan that “cut government, negotiated limits with the uber-powerful Histadrut labor union, and reined in Israel’s money-printing habits.”\n\nAnd, as “the governor of the Bank of Israel” when “the global financial crisis hit,” he deftly manipulated the value of the shekel “to stabilize investment” without putting “stress on Israel’s exports.”\n\nHe was so impressive “that several Arab states backed him in an unsuccessful bid to lead the IMF in 2011,” though “he was an Israeli citizen and Israel’s top financial figure at the time.” \n\n— Compiled by The Post Editorial Board","summary":"“Nippon Steel is buying US Steel for $15 billion and has agreed to let the American company remain American-operated” in a Trump-approved deal that “addressed concerns about national security while securing economic gains for the nation,” cheers the Washington Examiner’s editorial board.","url":"https://nypost.com/2025/06/02/opinion/trumps-art-of-the-steel-deal-dons-sensible-national-park-cuts-and-other-commentary/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/irvin-works-west-mifflin-pennsylvania-105594323-e1748900184607.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-06-02 23:07:20","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"zm","sentiment":0.155},{"id":327458424,"title":"Mama June Shannon, Who Dealt with Her Own Legal Battles, Hopes Todd and Julie Chrisley 'Learned Something' from Prison (Exclusive)","text":"Mama June Shannon has some advice for the Chrisleys.\n\n In an exclusive interview with PEOPLE, the reality star, 45, reacted to President Donald Trump pardoning Todd and Julie Chrisley on May 27. Though she was happy that they'd be returning to their family, she had a word of advice after going through her own legal troubles.\n\n Todd, 56, and his wife Julie, 52, were serving a combined 19 years in prison after being convicted of tax evasion and bank fraud. The reality television couple reported to prison in January 2023. In a video shared to Instagram, their daughter Savannah Chrisley revealed that Trump had called her personally to inform her of their pardons after months of trying to appeal their case.\n\n \"I've told many people that the Chrisleys, they can be good people and they're funny people and I love them all. And I love grandma [Faye],\" she said, before referencing her own legal battles. \"But now that they are getting totally pardoned, just like myself, I didn't go to jail. I just had to be good for a year.\"\n\n Shannon added that she hoped the couple \"learned something\" from their \"little slap on the wrist.\"\n\n \"This slap on the wrist may not be a slap on the wrist next time,\" she added.\n\n Shannon was arrested in March 2019 for being in possession of a controlled substance after she allegedly had crack cocaine and a crack pipe on her. Her boyfriend at the time, Eugene Edward \"Geno\" Doak, was also arrested. Geno faced charges for third-degree domestic violence, possession of a controlled substance and possession of drug paraphernalia.\n\n Following the incident, Shannon's daughter Lauryn \"Pumpkin\" Efird took custody of her youngest, Alana \"Honey Boo Boo\" Thompson. At the time, Thompson was just 14.\n\n After their March arrests, Shannon and Doak were hit with felony charges. The grand jury indictment in Alabama stated that Shannon \"did unlawfully posses a controlled substance, to-wit: Cocaine\" and \"did unlawfully posses with intent to use to inject, ingest, inhale or otherwise introduce into the human body, drug paraphernalia, to wit: a pipe.\"\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n Although the paraphernalia was a misdemeanor charge, the drug possession charge was a felony.\n\n The following month, both Shannon and Doak pled not guilty to the charges against them. Shannon was reportedly sentenced to 100 hours of community service.","summary":"In March 2019, Shannon was arrested for being in possession of a controlled substance after she allegedly had crack cocaine and a crack pipe on her","url":"https://people.com/mama-june-shannon-hopes-todd-and-julie-chrisley-learned-something-from-prison-exclusive-11746822","image":"https://people.com/thmb/jlY0KAdnL8K32nvpGntBVpOVw-I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x247:736x249)/mama-june-shannon-new-york-2025-julie-todd-chrisley-E3-Chophouse-Nashville-Grand-Opening-Party-2019-060225-d7185c48cfc749","video":null,"publish_date":"2025-06-02 23:07:16","author":"Dory Jackson,Esther Kang","authors":["Dory Jackson","Esther Kang"],"language":"en","source_country":"US","sentiment":-0.164},{"id":327464366,"title":"Fema chief tells staff he did not know US has hurricane season","text":"Staff of the Federal Emergency Management Agency were left baffled on Monday after the head of the US disaster agency said during a briefing that he had not been aware the country has a hurricane season, according to four sources familiar with the situation.\n\nThe US hurricane season officially began on Sunday and lasts through November. The National Oceanic and Atmospheric Administration forecast last week that this year’s season is expected to bring as many as 10 hurricanes.\n\nThe remark was made by David Richardson, who has led Fema since early May. It was not clear to staff whether he meant it literally, as a joke, or in some other context.\n\nA spokesperson for the Department of Homeland Security, Fema’s parent agency, said the comment was a joke and that Fema was prepared for hurricane season.\n\nThe spokesperson said that under homeland security secretary Kristi Noem and Richardson “Fema is shifting from bloated, DC-centric dead weight to a lean, deployable disaster force that empowers state actors to provide relief for their citizens”.\n\nRichardson said during the briefing that there would be no changes to the agency’s disaster response plans despite having told staff to expect a new plan in May, the sources told Reuters.\n\nRichardson’s comments come amid widespread concern that the departures of a raft of top Fema officials, staff cuts and reductions in hurricane preparations will leave the agency ill-prepared for a storm season forecast to be above normal.\n\nHurricanes kill dozens of people and cost hundreds of millions of dollars annually across a swath of US states every year. The storms have become increasingly more destructive and costly due to the effects of climate change.\n\nRichardson’s comment purporting ignorance about hurricane season spread among agency staff, spurring confusion and reigniting concern about his lack of familiarity with Fema’s operations, said three sources.\n\nRichardson, who has no disaster response experience, said during Monday’s briefing, a daily all-hands meeting held by phone and videoconference, that he will not be issuing a new disaster plan because he does not want to make changes that might counter the Fema review council, the sources said.\n\nDonald Trump created the council to evaluate Fema. Its members include Noem, governors and other officials.\n\nIn a 15 May staff town hall, Richardson said a disaster plan, including tabletop exercises, would be ready for review by 23 May.\n\nThe back-and-forth on updating the disaster plan and a lack of clear strategic guidance have created confusion for Fema staff, said one source.\n\nRichardson has evoked his military experience as a former marine artillery officer in conversations with staff.\n\nBefore joining Fema, he was assistant secretary at the homeland security department’s office for countering weapons of mass destruction, which he has told staff he will continue to lead.\n\nRichardson was appointed as the new chief of Fema last month after his predecessor, Cameron Hamilton, was abruptly fired.\n\nHamilton had publicly broken with Trump over the future of the agency, but sources told Reuters that Trump allies had already been maneuvering to oust him because they were unhappy with what they saw as Hamilton’s slow-moving effort to restructure Fema.\n\nTrump has said Fema should be shrunk or even eliminated, arguing states can take on many of its functions, as part of a wider downsizing of the federal government. About 2,000 full-time Fema staff, one-third of its total, have been terminated or voluntarily left the agency since the start of the Trump administration in January.\n\nDespite Noem’s prior comments that she plans to eliminate Fema, in May she approved Richardson’s request to retain more than 2,600 short-term disaster response and recovery employees whose terms were set to expire this year, one of the sources said, confirming an earlier report by NBC News.\n\nThose short-term staff make up the highest proportion of Fema employees, about 40%, and are a pillar of the agency’s on-the-ground response efforts.\n\nFema recently sharply reduced hurricane training and workshops for state and local emergency managers due to travel and speaking restrictions imposed on staff, according to prior Reuters reporting.","summary":"Staff reportedly baffled after remark from David Richardson – but spokesperson says comment was a joke\n\nStaff of the Federal Emergency Management Agency were left baffled on Monday after the head of the US disaster agency said during a briefing that he had not been aware the country has a hurricane season, according to four sources familiar with the situation.\n\nThe US hurricane season officially began on Sunday and lasts through November. The National Oceanic and Atmospheric Administration forecast last week that this year’s season is expected to bring as many as 10 hurricanes.\n\n Continue reading...","url":"https://www.theguardian.com/us-news/2025/jun/02/fema-us-hurricane-season","image":"https://i.guim.co.uk/img/media/b5f8c5bbab37092c75b36c19f678239fdf002e1d/325_0_2917_2334/master/2917.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGV","video":null,"publish_date":"2025-06-02 23:05:50","author":"Reuters","authors":["Reuters"],"language":"en","source_country":"us","sentiment":-0.13},{"id":327460958,"title":"Trumpworld’s Court Philosopher","text":"We’re conducting a health check on American democracy. In a new section that we’re calling “How Bad Is It?” we’ll be taking stock of the latest threats to civic life, with context from our experts—starting with Ronan Farrow on Elon Musk’s alleged drug use. But, first, how the blogger Curtis Yarvin became one of America’s most influential illiberal thinkers. Plus:\n• The fight for guns in Lebanon\n• Riding the Knicks rollercoaster\n• The nineteenth-century enemy of marriage\n\nStaff writer\nThe frantic search to identify the draftsmen behind the Trump Administration’s intellectual blueprint can often seem like a fool’s errand—not least because the President is driven by whim and vendetta. Those around him, however, take ideas seriously, including the radical proposals of the neo-reactionary writer Curtis Yarvin.\nNearly two decades ago, Yarvin began composing a sprawling apologia for an authoritarian takeover of the United States on his self-described “anti-democracy blog,” where he called for “liquidating” the government, abolishing the press, and putting a C.E.O.-king in charge of the country. In 2022, he presciently outlined a plan for Donald Trump to appoint a strike force of “ninjas” to parachute into government agencies and shut them down. But this mission would not be limited to D.C., Yarvin said. The organs of civil society—Harvard, the Times, N.G.O.s—would also need to be destroyed.\nWhen I first heard about Yarvin, around 2015, from my roommate (a programmer who enjoyed reading political theory as a hobby; he has since become a historian), the blogger’s ideas seemed far-fetched, even comical. Now Vice-President J. D. Vance, the Palantir co-founder Peter Thiel, and the venture capitalist Marc Andreessen are among his most prominent fans. For a piece in this week’s issue, I spent dozens of hours in the past six months interviewing Yarvin—along with his family, friends, exes, former classmates, colleagues, and interlocutors—to better understand how a crankish software engineer, posting under the nom de internet Mencius Moldbug, became one of the country’s most influential illiberal thinkers. Yarvin often performs a pantomime of thinking, stitching his arguments together in a Trumpian fashion and jumping to conclusions that he proclaims as self-evident. A few weeks ago, he told me that “the right way for the international community to respond to Kim Jung Un” would be for Silicon Valley to buy North Korea for a hundred billion dollars—a deal that would be “done in a week, what an amazing property, it’s obvious when you think about it.”\nGiven the embrace of his ideas by some of the country’s most powerful figures, I expected to find Yarvin in triumphant spirits when I met him the weekend before Trump’s Inauguration. Instead, I was struck by the dismissive, almost contemptuous tone in which he spoke of the new Administration, as though a cult band he’d been following for years had suddenly gone mainstream. What many Americans view as a constitutional crisis, Yarvin regards as weak tea. Trump, he contends, has not gone nearly far enough.\nRead “Curtis Yarvin’s Plot Against America” »\n\nElon Musk was “using drugs far more intensely than previously known,” as he was working closely with Trump’s Presidential campaign last year, the Times reported on Friday. Sources allege that Musk was using ketamine, Ecstasy, psychedelic mushrooms, and Adderall. (“To be clear, I am NOT taking drugs!” Musk wrote this weekend on X.) Musk recently left the Trump Administration, stepping away from his role as the head of the Department of Governmental Efficiency.\nHow bad is it? We reached out to Ronan Farrow, whose reporting, on how the U.S. government came to rely on Musk, included some of the earliest explicit reporting about what people around Musk described as excessive drug use, going beyond a recreational context and prompting concerns about his state of mind at work.\n“It’s very bad, but not in the way you might think,” he told us. “The bigger story isn’t about Musk or his psychopharmacology. It’s about the model of power we’ve built around him, and how public institutions are increasingly being replaced by private individuals operating without accountability. We’re seeing how that can put key functions of the state in the hands of individuals with erratic judgment.\n“The current Administration essentially designed DOGE to outsource government functions to billionaires,” he continued. “It has also granted Peter Thiel’s Palantir expanded access to personal data, raising surveillance concerns. It is trying to deepen the government’s reliance on private prison companies. We’re not just tolerating this model—we’re designing systems that rely on it.”\n\nIsraeli forces continue to occupy five hilltops in southern Lebanon, in violation of the ceasefire agreement, and have been destroying entire villages in the country. Rania Abouzeid reports on how the Lebanese Army is trying to assert its authority. Read the story »\n\nVinson Cunningham on the New York Knicks\nJames Marcus on how Margaret Fuller set minds on fire\nFrom 2024: Luke Mogelson on battling under a canopy of drones in Ukraine\n\nToday’s Crossword Puzzle: It appears many times in Christian Marclay’s art film “The Clock”—six letters.\nLaugh Lines No. 22: Heaven. Test your knowledge of classic New Yorker cartoons.\n\nP.S. In 1970, Anthony Hiss sent a dispatch from New York City’s first pride parade. “Would you believe it! It looks like an invading army. It’s a gay Woodstock,” one marcher exclaimed, adding, “And after all those years I spent in psychotherapy!” 🌈\nHannah Jocelyn contributed to today’s edition.","summary":"Curtis Yarvin plots against America. Plus: Ronan Farrow on what Elon Musk’s alleged drug use means for DOGE—and for the rest of us.","url":"https://www.newyorker.com/newsletter/the-daily/trumpworlds-court-philosopher","image":"https://media.newyorker.com/photos/66bbc14a3a338ff378df3b0c/16:9/w_1184,h_666,c_limit/newsletter-flagship-daily-header2.png","video":null,"publish_date":"2025-06-02 23:05:00","author":"Ava Kofman","authors":["Ava Kofman"],"language":"en","category":"politics","source_country":"us","sentiment":-0.013},{"id":327463406,"title":"‘Time of Great Opportunity’ for U.S. and India: Usha Vance","text":"The U.S. India relationship is in a phase of “great opportunity”, U.S. Second Lady Usha Vance has said. Ms. Vance, whose parents are from Andhra Pradesh, said that she had a personal relationship with India as she had family ties to the country and had visited India as she was growing up.\n\n“So that’s always been a relationship that I’ve personally thought of as very important,” Ms Vance said, during a Monday evening discussion at the U.S.-India Strategic Partnership Forum’s (USISPF) Leadership Summit in Washington DC. \n\n“The way that I think about it more broadly is I think this is a time of great opportunity. And I think if my husband [ U.S. Vice President J. D. Vance] were here, he’d say the same thing,” Ms Vance said, adding that historically , the two countries’ goals and needs had not always been in alignment. Ms Vance suggested, however, that in the next four years and beyond there was an opportunity, which she linked to the people to people ties. The relationship has generally enjoyed strong bipartisan support in Washington.\n\nIndia and the U.S. are in the throes of negotiating the first phase of a Bilateral Trade Agreement, with U.S. trade negotiators in India this week for talks. U.S. President Donald Trump had threatened to impose ‘reciprocal tariffs’ on the U.S.’s trade partners, with India being subject to a 26% rate , potentially. \n\nDuring the discussion with USISPF Chairman John Chambers, which did not venture further into political topics, Ms. Vance spoke about how she met her husband at Yale Law School, their family’s recent visit to India and their interactions with Prime Minister Narendra Modi. She also spoke about her program to promote reading among children in the U.S.","summary":"ndia and the U.S. are in the throes of negotiating the first phase of a Bilateral Trade Agreement, with U.S. trade negotiators in India this week for talks.","url":"https://www.thehindu.com/news/international/time-of-great-opportunity-for-us-and-india-usha-vance/article69650504.ece","image":"https://th-i.thgim.com/public/incoming/wkcrsz/article69368580.ece/alternates/LANDSCAPE_1200/AFP_37MT3ZP.jpg","video":null,"publish_date":"2025-06-02 23:03:47","author":"Sriram Lakshman","authors":["Sriram Lakshman"],"language":"en","source_country":"in","sentiment":0.112},{"id":327463698,"title":"Paramount Global nominates three board directors as Skydance merger awaits approval - TradingView","text":"Paramount Global PARA nominated three new directors on Monday, seeking to boost its board strength to seven as it awaits regulatory approval for its $8.4 billion merger with Skydance Media. \n\nParamount nominated Mary Boies, counsel to Boies Schiller Flexner LLP, Charles Ryan, co-founder and general partner of Almaz Capital, and Roanne Sragow Licht, former justice and adjunct professor at Boston University and Roger Williams University. \n\nU.S. President Donald Trump filed a $10 billion lawsuit against Paramount-owned CBS News in October, alleging that the network deceptively edited an interview with then-vice president and presidential candidate Kamala Harris, to \"tip the scales in favor of the Democratic Party\" in the election.\n\nTrump's lawsuit is seen as a major roadblock to the Paramount-Skydance merger, according to some analysts. \n\nThe merger requires approval from the U.S. Federal Communications Commission, which has authority over the transaction because it needs to approve the transfer of the broadcast television licenses held by CBS.\n\nParamount, chaired by Shari Redstone, reportedly offered $15 million to settle the suit.\n\nTrump raised his claim for damages to $20 billion in February.\n\nThe Wall Street Journal reported last week that the company wanted to ensure it had a full board in place in case its negotiations with Trump to settle his lawsuit fell through.\n\nParamount is scheduled to hold its annual stockholder meeting on July 2.","summary":"Paramount Global nominates three board directors as Skydance merger awaits approval  TradingView","url":"https://www.tradingview.com/news/reuters.com,2025:newsml_L3N3S51CC:0-paramount-global-nominates-three-board-directors-as-skydance-merger-awaits-approval/","image":"https://s.tradingview.com/static/images/illustrations/news-story.jpg","video":null,"publish_date":"2025-06-02 23:03:17","author":"Shari Redstone","authors":["Shari Redstone"],"language":"en","source_country":"gb","sentiment":-0.036},{"id":327461384,"title":"Trade secretary Jonathan Reynolds to push for exemption on steel tariffs in crunch meeting with US officials","text":"Trade secretary Jonathan Reynolds is meeting US officials on Tuesday as the UK faces a race against time to prevent Donald Trump bringing in new tariffs on steel.\n\nEarlier this month, a UK-US trade deal was unveiled that should have exempted Britain from steel tariffs; however, the move has yet to be implemented, and the details are still being worked out ahead of a formal deal.\n\nOn Tuesday in Paris, Mr Reynolds and US trade representative Jamieson Greer are expected to discuss implementing the agreement.\n\nIt comes amid uncertainty about the future of Mr Trump’s tariffs after a US court last week ruled many of them unlawful, before an appeals court reinstated the levies pending a further hearing.\n\nLast week also saw Mr Trump announce that he would double tariffs on steel to 50 per cent, starting on Wednesday, and it remains unclear how the UK would be affected by his declaration.\n\nMr Reynolds’ visit to Paris is part of a three-day trip, during which he is expected to meet other trade ministers and attend a G7 ministerial meeting before heading to Brussels for meetings with his EU counterparts.\n\nDuring the trip, the trade secretary will argue that the UK is a dependable partner in an era of increasing global volatility.\n\nHe said: “Our deals with the US, EU and India are proof that the UK is the most connected country in the world to do business. Along with our modern industrial strategy, our Plan for Change is making the UK a safe, stable bet in uncertain times.\n\n“We recognise our relationship with G7 allies and EU counterparts must continue to evolve and deliver a better trading environment for our businesses and exporters.\n\n“That’s why we want to wipe away costly, business-blocking barriers and open up opportunities to grow our economy, create jobs and put more money in people’s pockets.”\n\nAndrew Griffith, Conservative shadow business secretary, said: “Labour told the British public we had a deal with the US – but one month on, there is no deal in sight, meaning British businesses and workers continue to suffer because of Labour’s failed negotiations.\n\n“After snatching the winter fuel payment, lying about not increasing taxes, and misleading the public by saying the US trade deal was done, the public will rightly not trust a word Labour says.\n\n“As all the other political parties wrangle over how to spend more taxpayers’ money, only the Conservatives are committed to being responsible with the public finances.”","summary":"The UK struck a deal with Washington for import taxes on its steel to be removed weeks ago, but its implementation has not been finalised","url":"https://www.independent.co.uk/news/uk/politics/trump-tariffs-uk-jonathan-reynolds-paris-b2762348.html","image":"https://static.independent.co.uk/2025/06/02/18/Trump_01671.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/HDTwTlte-4VHSaSK0.mp4","publish_date":"2025-06-02 23:02:31","author":"Alex Ross","authors":["Alex Ross"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.012},{"id":327457732,"title":"Liberal news outlet mocked for reporting on ‘mysterious’ drop in fentanyl flowing across border","text":"The Washington Post is being mocked online and by the White House for \"pathetic\" reporting on what the liberal-leaning news outlet calls a \"mysterious\" decline in fentanyl flowing across the border. Fentanyl is a dangerous drug that is often trafficked into the United States across the southern and northern borders by cartels and other criminal elements. In 2024, fentanyl was linked to the death of 48,422 persons in the United States, according to the CDC. During his campaign, President Donald Trump vowed to wage a war against fentanyl traffickers through increased border security and by cracking down on illegal immigration. Since taking office, Trump has deployed U.S. troops to the southern border, targeted cartels and transnational criminal groups as \"foreign terrorist organizations\" and hit cartel leaders with sanctions. According to the Center for Immigration Studies (CIS), the U.S. law enforcement seizures of fentanyl, which the group explains is a \"key indicator of broader total smuggling at and between the southern border’s ports of entry,\" have dropped 50% since the November election. CIS states that this significant decline indicates a \"greater decline in total fentanyl smuggling.\" BONDI ANNOUNCES ONE OF LARGEST FENTANYL SEIZURES IN US HISTORY The Washington Post reports on this decline, stating that U.S. seizures at the southern border are down by almost 30 percent compared with the same period in 2024. The outlet, however, states that the drop \"represents something of a mystery.\" \"After years of confiscating rising amounts of fentanyl, the opioid that has fueled the most lethal drug epidemic in American history, U.S. officials are confronting a new and puzzling reality at the Mexican border. Fentanyl seizures are plummeting,\" wrote the Post. Among the possible reasons listed by the outlet are cartels finding other ways to smuggle the drug into the U.S., cartel internal strife, ingredient shortages and a possible decline in demand. Though baffled by the reason for the decline, The Washington Post posited that \"public health authorities are concerned that the Trump administration’s budget cuts could hurt programs that have promoted overdose antidotes and addiction treatment.\" SOME FENTANYL DEALERS WOULD BE CHARGED WITH FELONY MURDER UNDER NEW BILL The article was widely mocked by conservatives online. Rep. Tom Tiffany, R-Wis., commented on X, \"The Washington Post is reporting a ‘mysterious drop’ in fentanyl seizures at the southern border. Mystery solved! The Trump effect is working.\" Charlie Kirk, a popular conservative influencer, also commented, saying: \"Four months into the Trump administration, The Washington Post is marveling at the ‘mysterious’ drop in fentanyl seizures on the Mexican border … Is the Post simply lying, or are their reporters as dumb as the people they're writing propaganda for?\" CLICK HERE FOR MORE IMMIGRATION COVERAGE The Department of Homeland Security's official X account also replied, commenting: \"It’s no mystery. On day one, [President] Trump closed our borders to drug traffickers.\" DHS said that \"from March 2024 to March 2025 fentanyl traffic at the southern border fell by 54%.\" \"The world has heard the message loud and clear,\" said DHS. WHISTLEBLOWER ACCUSES BIDEN ADMIN OF LEAVING THOUSANDS OF MIGRANT CHILD TRAFFICKING REPORTS UNINVESTIGATED Several top White House spokespersons also weighed in. White House Press Secretary Karoline Leavitt simply called the Post \"pathetic,\" and White House Communications Director Steven Cheung said: \"They can’t stand that President Trump’s strong border policies have led to a DECREASE in fentanyl coming into the U.S.\" CLICK HERE TO GET THE FOX NEWS APP Abigail Jackson, another White House spokeswoman, told Fox News Digital that \"the drop in fentanyl seizures at the border is only a mystery to Washington Post reporters suffering from Trump-Derangement Syndrome.\" \"As of March, fentanyl traffic at the Southern Border had fallen by more than half from the same time last year – while Joe Biden’s open border was still terrorizing America,\" said Jackson. \"Everyone else knows the simple truth: President Trump closed our border to illegal drug traffickers and Americans are safer because of it.\" The Washington Post did not immediately respond to a request by Fox News Digital for comment.","summary":"A liberal newspaper is being mocked online and by the White House for “pathetic&quot; reporting on what the outlet calls a “mysterious&quot; decline in fentanyl flowing across the border.","url":"https://www.foxnews.com/politics/liberal-news-outlet-mocked-reporting-mysterious-drop-fentanyl-flowing-across-border","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/06/931/523/fentanyl-border.png?ve=1&tl=1","video":null,"publish_date":"2025-06-02 23:01:34","author":"Peter Pinedo","authors":["Peter Pinedo"],"language":"en","category":"politics","source_country":"us","sentiment":0.206},{"id":327456660,"title":"Trade Secretary to push for timeline on US tariff exemption","text":"Trade Secretary Jonathan Reynolds is set to meet US officials on Tuesday as the UK aims to set a timeline for its exemption from President Donald Trump’s tariffs.\n\nSir Keir Starmer and Mr Trump announced the broad terms of an agreement last month that would exempt the UK from some of the US president’s tariffs on steel and cars while increasing market access for other goods.\n\nThe Prime Minister hailed the announcement as a major achievement, saying the UK was the first nation to reach such an agreement with Mr Trump.\n\nBut the details are still being worked out ahead of a formal deal, and the Government hopes for an agreement within weeks.\n\nMr Reynolds is expected to discuss implementing the deal during talks with US trade representative Jamieson Greer in Paris on Tuesday, where he is attending a meeting of the OECD.\n\nThat meeting comes amid uncertainty about the future of Mr Trump’s tariffs after a US court last week ruled many of them unlawful, before an appeals court reinstated the levies pending a further hearing.\n\nLast week also saw Mr Trump announce that he would double tariffs on steel to 50%, starting on Wednesday, and it remains unclear how the UK would be affected.\n\nMr Reynolds’s visit to Paris is part of a three-day trip, during which he is expected to meet other trade ministers and attend a G7 ministerial meeting before heading to Brussels for meetings with his EU counterparts.\n\nDuring the trip, the Trade Secretary will argue that the UK is a dependable partner in an era of increasing global volatility.\n\nHe said: “Our deals with the US, EU and India are proof that the UK is the most connected country in the world to do business. Along with our modern industrial strategy, our Plan for Change is making the UK a safe, stable bet in uncertain times.\n\n“We recognise our relationship with G7 allies and EU counterparts must continue to evolve and deliver a better trading environment for our businesses and exporters.\n\n“That’s why we want to wipe away costly, business-blocking barriers and open up opportunities to grow our economy, create jobs and put more money in people’s pockets.”\n\nAndrew Griffith, Conservative shadow business secretary, said: “Labour told the British public we had a deal with the US – but one month on there is no deal in sight, meaning British businesses and workers continue to suffer because of Labour’s failed negotiations.\n\n“After snatching the winter fuel payment, lying about not increasing taxes, and misleading the public by saying the US trade deal was done, the public will rightly not trust a word Labour says.\n\n“As all the other political parties wrangle over how to spend more taxpayers money, only the Conservatives are committed to being responsible with the public finances.”","summary":"Sir Keir Starmer and Donald Trump announced the broad terms of an agreement last month.","url":"https://www.standard.co.uk/news/politics/jonathan-reynolds-donald-trump-keir-starmer-prime-minister-paris-b1230908.html","image":"https://static.standard.co.uk/2025/06/03/00/30-e411567fe7da4591a108389ed54f038a.jpg?width=1200","video":null,"publish_date":"2025-06-02 23:01:00","author":"Christopher McKeon","authors":["Christopher McKeon"],"language":"en","category":"politics","source_country":"gb","sentiment":0.022}]}