{"offset":0,"number":50,"available":19790,"news":[{"id":381002100,"title":"Trump escalates fight with Fed Chair Powell, telling: ‘If you don’t get it fixed fast, I’m going to…’","text":"US President Donald Trump on Wednesday intensified his attacks on Federal Reserve Chair Jerome Powell, accusing him of moving too slowly on interest rate cuts. “I’ll be honest, I’d love to fire his ass,” Trump said while speaking at a Saudi Arabia-backed investment forum at the Kennedy Center in Washington.Trump has long criticised Powell—whom he nominated during his first term—for keeping rates “too high,” a stance he says is slowing economic momentum.Pressure on Treasury Secretary BessentAt the event, Trump publicly urged Treasury Secretary Scott Bessent to expedite the search for Powell’s successor.“You’ve got to work on him, Scott. The only thing Scott’s blowing it on is the Fed,” Trump told Bessent, who was in the audience. In another pointed remark—delivered with a hint of humour—Trump added: “The rates are too high, Scott, and if you don’t get it fixed fast, I’m going to fire your ass.”Powell’s term as Fed chair ends in May, while his term as governor runs until 2028.Successor expected before ChristmasBessent, who is leading the selection process, told Fox News on Tuesday that Trump is set to meet the three finalists after Thanksgiving, with a new Fed chair likely to be announced before Christmas.Trump said his administration has “great names” under consideration, though he again acknowledged Bessent has declined to be considered for the role.Trump reiterated at the forum that Bessent “does not want the job” despite the president’s repeated praise for him.Powell pushes backTrump has frequently accused Powell of incompetence and mismanagement, including claiming that the Fed’s renovation project is billions over budget. Powell rejects those allegations, saying Trump is falsely including costs from a separate central bank office completed five years ago.Five finalistsBessent has identified five finalists for the Fed’s top post:Kevin Hassett, White House economic adviserKevin Warsh, former Fed governorChristopher Waller, current Fed governorMichelle Bowman, Fed vice chair for supervisionRick Rieder, BlackRock executive","url":"https://www.livemint.com/news/us-news/trump-escalates-fight-with-fed-chair-powell-telling-if-you-don-t-get-it-fixed-fast-i-m-going-to-11763665050096.html","image":"https://www.livemint.com/lm-img/img/2025/11/20/1600x900/logo/USA-TRUMP-FED-0_1763665561037_1763665575563.JPG","video":null,"publish_date":"2025-11-21 19:07:53","author":"Ravi Hari","authors":["Ravi Hari"],"language":"en","category":"politics","source_country":"in","sentiment":-0.02},{"id":381002104,"title":"US representative will attend G20 handover in South Africa but wont take part in talks","text":"JOHANNESBURG (AP) — A representative from the U.S. Embassy in South Africa will attend the formal handover ceremony at the end of this weekend's Group of 20 summit in Johannesburg, but Washington still won't take part in any talks, a White House official said Thursday.The official, who wasn't authorized to speak publicly and spoke on condition of anonymity, was responding to comments by South Africa's president that the United States had indicated that it had a “change of mind” over its boycott at the “11th hour.”U.S. President Donald Trump announced this month that no U.S. government official would attend the two-day meeting of world leaders from rich and developing countries in South Africa's biggest city.Trump cited his claims that South Africa is violently persecuting the country's white Afrikaner minority farmers as the reason for the U.S. boycott. Those statements by Trump have been widely rejected.The U.S. is due to take over the rotating presidency of the G20 from South Africa, and a formal handover ceremony is traditional at the end of each summit.President Cyril Ramaphosa previously expressed disappointment that the U.S. boycott would mean that he hands over to an “empty chair” at the end of the summit.On Thursday, South Africa's leader said that he welcomed U.S. participation at Africa's first G20 summit “in one shape or form or another” and viewed the late communication as a “pleasing” change of approach from the world's biggest economy.“The United States is a member of the G20, they are an original member of the G20, so they have the right to be here,” Ramaphosa said. “And all we are seeking to do is looking at the practicalities ... for them to participate.”Ramaphosa had also addressed the U.S. boycott — which threatens to undermine the summit — earlier Thursday, when he said that the G20 meeting would issue a joint declaration, despite pressure from Washington not to issue one.A South African G20 official said earlier this week that the U.S. had sent diplomatic communication to South Africa advising that that there should be no declaration adopted at the summit, because the U.S. wasn't there and therefore there would be no consensus.Instead, the U.S. wants a toned-down statement from South Africa only to cap the summit, which is a culmination of more than 120 meetings that Africa’s most advanced economy has hosted since it took over the G20’s rotating presidency for this year.Speaking to reporters after an earlier speech, Ramaphosa said: “We will have a declaration. The talks are going extremely well. I’m confident we are moving towards a declaration, and they are now just dotting the i’s and crossing the t’s.”“Without the United States, the whole process of the G20 is moving forward. We will not be bullied. We will not agree to be bullied.”Other leaders have expressed hope that the summit results in a declaration. German Chancellor Friedrich Merz said Wednesday that he hopes for “joint decisions,\" but conceded that “that is not entirely certain.\"Trump has repeatedly targeted South Africa for criticism since he returned to office. He held a tense meeting with Ramaphosa at the White House in May, when he confronted South Africa’s leader with baseless claims of widespread violence against Afrikaners, who are descendants of Dutch, French and German settlers who first came to South Africa in the 17th century.The U.S. president has repeated his claims in the leadup to the G20 that Ramaphosa’s Black-led government is pursuing racist anti-white policies against Afrikaners.The G20 is a bloc made up of 19 nations, including the richest but also the top developing economies, the European Union and the African Union. The bloc is meant to bring developed and developing nations together to find solutions to global problems.South Africa, which is the first African nation to hold the rotating presidency, is hoping to use its summit to make progress on issues especially affecting poor countries. That includes mitigating the impact of climate change and weather-related disasters, easing debt burdens for developing countries and confronting global wealth inequality.European Commission President Ursula von der Leyen and European Council President António Costa met with Ramaphosa on Thursday in Johannesburg and expressed support for South Africa's agenda.The U.S. has previously derided South Africa’s priorities for the group, with U.S. Secretary of State Marco Rubio skipping a G20 foreign ministers meeting in February and dismissing South Africa’s priorities as being about diversity, equity and inclusion and climate change.Rubio said that he wouldn't waste U.S. taxpayer money on that agenda.Other leaders are also skipping the G20 summit, including Chinese leader Xi Jinping, Russian President Vladimir Putin and Argentine President Javier Milei, but they have sent delegations to represent them in the talks.“The only country that is not in the room is the United States and, of course, it is their choice not to be in the room,” Xolisa Mabhongo, a South African ambassador to the G20, told national broadcaster SABC this week.___Michelle L. Price reported from Washington.___Follow AP’s coverage of the G20 summit in South Africa: https://apnews.com/hub/g20-summit","url":"https://www.livemint.com/politics/us-representative-will-attend-g20-handover-in-south-africa-but-wont-take-part-in-talks-11763663465859.html","image":"https://www.livemint.com/lm-img/img/2025/11/20/1600x900/logo/Politics_1545994646567_1763663468840.jpg","video":null,"publish_date":"2025-11-21 18:31:05","author":"List.metadata.agency","authors":["List.metadata.agency"],"language":"en","category":"politics","source_country":"in","sentiment":-0.382},{"id":381064226,"title":"Florida carries out state&#8217;s 17th execution of the year","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis undated and unlocated handout image released by the Florida Department of Corrections shows death row inmate Richard Randolph. Randolph, 63, is convicted of the 1988 rape and murder of his former store manager and is to be executed by lethal injection in Florida on November 20, 2025. He is to be put to death at 6:00 pm (2300 GMT) at a state prison in the town of Raiford. Randolph was sentenced to death in 1989 for the murder of Minnie McCollum, the manager of a convenience store where he once worked. (Photo by Florida Department of Corrections / AFP) \n\n International News, Latest News \n\nNovember 20, 2025\n\n\n\n\n Florida carries out state’s 17th execution of the year \n\n\n\n\n\n\n\nMIAMI, United States (AFP)—A 63-year-old man convicted of the 1988 rape and murder of his former store manager was executed by lethal injection Thursday in the US state of Florida.\n\nRichard Randolph was put to death at 6:12 pm (2312 GMT) at a state prison in the town of Raiford, the Florida Department of Corrections said in a statement.\n\nRandolph was sentenced to death in 1989 for the murder of Minnie McCollum, the manager of a convenience store where he once worked.\n\nHe raped and murdered the 62-year-old McCollum after she caught him trying to break into the store’s safe, according to court documents.\n\nFlorida has carried out more executions this year — 17 — than any other US state.\n\nThere have been five each in Alabama and Texas.\n\nWith Randolph’s execution, there have now been 44 executions in the United States to date in 2025 — the most since 2010, when 46 inmates were put to death.\n\nThirty-six of this year’s executions have been carried out by lethal injection, three by firing squad and five by nitrogen hypoxia. This last method involves pumping nitrogen gas into a face mask, causing the prisoner to suffocate.\n\nThe use of nitrogen gas as a method of capital punishment has been denounced by United Nations experts as cruel and inhumane.\n\nThe death penalty has been abolished in 23 of the 50 US states, while three others — California, Oregon and Pennsylvania — have moratoriums in place.\n\nPresident Donald Trump is a proponent of capital punishment and, on his first day in office, called for an expansion of its use “for the vilest crimes.”\n\n\n\n\n\n\n\n\nTags: execution lethal injection Richard Randolph \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n 48-hour curfew extended in Kingston Eastern police division \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica—The 48-hour curfew that was imposed in the Kingston Eastern police division has been extended. The curfew will continue from 6:00 pm... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n WRA reports groundwater levels in Content, Manchester, slowly receding after flooding \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica—The Water Resources Authority (WRA) says groundwater levels in Content, Manchester, which caused flooding in the community, are now ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t intensifying support for pregnant and lactating women to safeguard mothers and newborns \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica—The Government is intensifying its efforts to support pregnant and lactating women, ensuring they receive the guidance, care, and es... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Former Brazil midfielder Fernandinho retires at 40 \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n RIO DE JANEIRO, Brazil (AFP) —Fernandinho, a defensive midfielder who won five league titles with Manchester City and six with Shakhtar Donetsk, said ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Four arrested in US in scheme to smuggle AI chips to China \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n WASHINGTON, United States (AFP)—Two Chinese nationals and two Americans have been arrested for allegedly illegally exporting cutting-edge Nvidia chips... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Gov’t in discussion with JPS on securing funding for Hurricane Melissa recovery—Vaz \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica—Minister of Science, Energy, Telecommunications and Transport Daryl Vaz says the government is in discussion with the Jamaica Public... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n YeCats launches mobile classroom in Black River to support children after Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST ELIZABETH, Jamaica — In a step toward restoring educational stability after the devastating effects of Hurricane Melissa, the YeCats Mobile Resourc... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/20/florida-carries-states-17th-execution-year/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/000_84N77ZR.jpg","video":null,"publish_date":"2025-11-21 05:05:10","author":null,"language":"en","category":"politics","source_country":"jm","sentiment":-0.027},{"id":381031260,"title":"Reid, Pinnock and co-accused to return to court in February","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn this file photo Ruel Reid arrives at the Kingston and St Andrew Parish Court, Thursday, October 16, for his fraud trial. (Photo: Garfield Robinson) \n\n Latest News, News \n\nBY DANA MALCOLM Observer online reporter malcolmd@jamaicaobserver.com \n November 20, 2025\n\n\n\n\n Reid, Pinnock and co-accused to return to court in February \n\n\n\n\n\n\n\nKINGSTON, Jamaica — The trial of former Education Minister Ruel Reid, former Caribbean Maritime University President Fritz Pinnock and their three co-accused will continue with more witness testimonies when it resumes in February 2026.\n\nCourt adjourned on Thursday just after a statement from Reid’s former driver, who is now deceased, was accepted into evidence with some redactions.\n\nSo far, the prosecution has called three witnesses of a proposed 92 as they attempt to prove that Reid, Pinnock, Reid’s wife Sharen Reid, their daughter Sharelle Reid and Councillor Kim Brown Lawrence took part in a scheme that siphoned off over $25 million from the Caribbean Maritime University and the Ministry of Education.\n\nThe trial began on October 7th, following an unexpected absence of the then Judge Vaughn Facey on October 6th.\n\nSenior Parish Judge Sanchia Burrell took over the case, allowing matters to begin in earnest.\n\nThroughout the trial, some members of the defence have raised issues of admissibility, pointing to how some of the information that the prosecution wishes to use in the trial was obtained.\n\nOn multiple occasions, members of the defence have made submissions requesting that the trial be effectively discontinued; so far, none have been successful.\n\nThe case dates back to 2019 when the accused were arrested following public calls for an investigation into the ministry and the university.\n\nCrown prosecutors outlined allegations that between March 2016 and October 2019, the five accused participated in the $25 million scheme, with others unknown, in which money was paid over to bank accounts either owned or controlled by the accused or handed over to them in cash.\n\nProsecutors allege that the money came from fraudulent payments made for work that was never done or services which were never provided to either the ministry or the university.\n\nThe accused have maintained their innocence throughout, pleading not guilty to all the charges on the 35-count indictment. The accused are not subject to all of the charges, rather are charged with different counts, some jointly, resulting in a total of 35. Reid is subject to the most charges, having been named in over 30 counts.\n\nBail for the accused was extended until court resumes in February.\n\n\n\n\n\n\n\n\nTags: Fritz Pinnock Ruel Reid Trial \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Antigua’s PM says Jamaica can bounce back bigger and better \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST JAMES, Jamaica—Prime Minister of Antigua and Barbuda, Gaston Browne, says Jamaica and its people can bounce back bigger and better from Hurricane M... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Derek Walcott Library added to UNESCO world register \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n CASTRIES, St Lucia (CMC) — The Derek Walcott Library at the Sir Arthur Lewis Community College in St Lucia has been officially inscribed on the United... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n EOJ suspends replacement ID card fees following Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica —The Electoral Office of Jamaica (EOJ) says it has suspended the fee for registered electors to replace their Voter ID card, followi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n AWE Summit marks Global Entrepreneurship Week with road to recovery focus \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n In celebration of Global Entrepreneurship Week, the Youth-For-Development Network (YFDN), in partnership with the Academy for Women Entrepreneurs (AWE... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump floats death penalty for ‘seditious’ Democrats \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump on Thursday evoked the death penalty for Democratic lawmakers who urged the military to refu... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Voters’ list publication delayed to December 20 due to Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica — The Electoral Office of Jamaica (EOJ) has pushed back the release of the upcoming voters’ list from November 30, 2025 to December ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Child dies after JUTC bus incident in Vineyard Town; police probe underway \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST CATHERINE, Jamaica — The Jamaica Urban Transit Company (JUTC) has confirmed that one of its buses was involved in a fatal incident in Vineyard Town... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/20/reid-pinnock-co-accused-return-court-february/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/10/10b0e0c6b2e1570db3dfe21f87a43ef0.jpg","video":null,"publish_date":"2025-11-21 01:16:32","author":"By Dana Malcolm Observer Online Reporter","authors":["By Dana Malcolm Observer Online Reporter"],"language":"en","source_country":"jm","sentiment":0.1},{"id":381066580,"title":"Trump shares bizarre AI-generated video playing soccer with Ronaldo inside Oval Office","text":"READ MORE: Secret reasons Cristiano Ronaldo was desperate to meet Trump\n\nBy OLIVER SALT, US ASSISTANT SPORTS EDITOR\n\nPublished: 01:08 GMT, 21 November 2025 | Updated: 01:08 GMT, 21 November 2025\n\nDonald Trump followed up his high-profile meeting with Cristiano Ronaldo by posting a bizarre AI-generated video of them playing soccer together inside the Oval Office.\n\nRonaldo, considered by some the greatest soccer player of all time, made a surprise appearance at the White House on Tuesday night for a glitzy black-tie dinner hosted by the President.\n\nAfter dining with some of the most powerful executives on the globe, the five-time Champions League winner and his fiancee Georgina Rodriguez were also pictured enjoying a stroll with Trump on the White House grounds the following day.\n\nThe couple were invited into the Oval Office to continue the conversation and grab some photo opportunities, which quickly went viral on social media.\n\nAnd one day after the pictures were shared, Trump shared an AI video of him and Ronaldo hilariously kicking a soccer ball around in his working space on Truth Social.\n\nHe also wrote: 'Ronaldo is a GREAT GUY. Loved meeting him at the White House. Really smart, and cool!!! President DJT'.\n\nDonald Trump followed up meeting Ronaldo by posting an AI video of them playing soccer\n\nCristiano Ronaldo and fiancee Georgina Rodriguez visited the White House earlier this week\n\nPlastic surgeon reveals secrets of Ronaldo's changing face, including a painful oral procedure\n\nAfter Trump welcomed Ronaldo during his speech at the black-tie event on Tuesday evening, the White House shared video the next morning of the two men walking side by side along with Rodriguez, next to The Presidential Walk of Fame. 'Two GOATS,' the footage was captioned, adding: 'CR7 x 45/47'.\n\nSpeaking Tuesday night, Trump also thanked Ronaldo for earning him some extra adoration from his soccer-obsessed son, Barron. And now, according to expert lip-reader NJ Hickling, he confided in the ex-Real Madrid and Manchester United superstar about his 19-year-old's sporting abilities.\n\n'He doesn’t play at all. It’s a shame, really. It’s a great sport,' Trump appears to say. 'You know, it takes a great player to play football.'\n\nIt's unclear which 'football' Trump is discussing. He would naturally refer to the American version, which he's a huge fan of, but has also been known to call soccer 'football' in the company of Europeans such as Ronaldo. And given how he laughed at the comment, it's possible he is reacting to Trump complimenting him.\n\nRonaldo late thanked Trump for hosting him, writing on Instagram: 'Thank you Mr. President for your invitation and for the warm welcome you and the First Lady gave me and my future wife. \n\n'Each of us has something meaningful to give, and I stand ready to do my part as we inspire new generations to build a future defined by courage, responsibility and lasting peace.'\n\nTrump said at Tuesday's dinner: 'This room is loaded up with the biggest leaders in the world - business, sports. My son is a big fan of Ronaldo... Barron got to meet him and I think he respects his father a little bit more now - just the fact that I introduced you.' \n\nRonaldo's meeting with the controversial President left some of his loyal fans uncomfortable\n\nThe trip to Washington was the first time Ronaldo has been pictured publicly in the United States since a 2017 rape allegation, which he has always vehemently denied.\n\nNot all of his fans were thrilled to see him cozying up to someone as controversial as Trump, with some saying it was a sad moment in the career of the 40-year-old.\n\n'Been following and praising the GOAT (greatest of all time) since 2006,' one fan commented on his Instagram post showing him strolling down the Presidential Walk of Fame with Trump.\n\n'I have never seen him take an L (loss), let alone an L of this magnitude in my life. Incredibly sad day.'\n\nAnother fan wrote: 'If you needed more proof that Messi is better, now you don’t have to question it ever again.'\n\nGeorgina RodriguezCristiano RonaldoWhite House\n\nShare or comment on this article:\nTrump shares bizarre AI-generated video playing soccer with Ronaldo inside Oval Office\n\nAdd comment","summary":"Ronaldo, considered by some the greatest soccer player of all time, made a surprise appearance at the White House on Tuesday night for a glitzy black-tie dinner hosted by the President.","url":"https://www.dailymail.co.uk/sport/football/article-15310109/trump-ronaldo-soccer-oval-office.html","image":"https://i.dailymail.co.uk/1s/2025/11/20/17/104053779-0-image-m-72_1763660248743.jpg","video":null,"publish_date":"2025-11-21 01:08:59","author":"Editor,Oliver Salt","authors":["Editor","Oliver Salt"],"language":"en","category":"politics","source_country":"gb","sentiment":0.433},{"id":381014842,"title":"Antigua’s PM says Jamaica can bounce back bigger and better","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGaston Browne (JIS photo) \n\n Latest News, News \n\nNovember 20, 2025\n\n\n\n\n Antigua’s PM says Jamaica can bounce back bigger and better \n\n\n\n\n\n\n\nST JAMES, Jamaica—Prime Minister of Antigua and Barbuda, Gaston Browne, says Jamaica and its people can bounce back bigger and better from Hurricane Melissa, just as his country did after the catastrophic Hurricane Irma in 2017.\n\n“Across our small Caribbean nation, we stand with Jamaica. We are not new to hurricanes, but we know they can be deeply disruptive. When we faced Irma, our sister island, Barbuda, was decimated, yet we did not crumble. We rebuilt, we rose, and we rebuilt bigger and better,” he said.\n\nSpeaking while on a tour of some affected areas in Westmoreland on November 17, the prime minister reminded that his country’s response to the devastation illustrates what is possible when Caribbean nations unite.\n\nNoting that Antigua and Barbuda’s commitment to Jamaica is concrete, Prime Minister Browne said that linesmen from his country are already on the ground assisting with recovery efforts.\n\nHe also confirmed a financial contribution to Jamaica’s relief and recovery programmes. In addition, he said that the Antigua and Barbuda Defence Force would deploy soldiers to Jamaica to support recovery work.\n\nBrowne encouraged the Jamaican people to persevere, stressing the Caribbean’s collective resilience.\n\n“We, as Caribbean people, have always faced trials together, and this too shall pass,” he added.\n\nHe urged international development and financial institutions to provide financing at concessionary rates to support resilient reconstruction, noting that the cost of inaction would be measured in lives and livelihoods.\n\nBrowne said that his country’s experience demonstrates that rebuilding can be an opportunity to build back better.\n\n“Antigua and Barbuda is now significantly better than before. And to literally rebuild bigger and better – this is the path for Jamaica, as well, and for all our Caribbean brothers and sisters,” he said.\n\n“We are a small country, but our solidarity is mighty. We will do whatever we can to assist Jamaica and its people, and we will continue to advocate for resilient rebuilding across the Caribbean,” the prime minister said.\n\n\n\n\n\n\n\n\n\nTags: Gaston Browne Hurricane Melissa Jamaica \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, Regional \n\n\n\n\n\n\n\n\n\n Derek Walcott Library added to UNESCO world register \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n CASTRIES, St Lucia (CMC) — The Derek Walcott Library at the Sir Arthur Lewis Community College in St Lucia has been officially inscribed on the United... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n EOJ suspends replacement ID card fees following Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica —The Electoral Office of Jamaica (EOJ) says it has suspended the fee for registered electors to replace their Voter ID card, followi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n AWE Summit marks Global Entrepreneurship Week with road to recovery focus \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n In celebration of Global Entrepreneurship Week, the Youth-For-Development Network (YFDN), in partnership with the Academy for Women Entrepreneurs (AWE... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump floats death penalty for ‘seditious’ Democrats \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump on Thursday evoked the death penalty for Democratic lawmakers who urged the military to refu... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Voters’ list publication delayed to December 20 due to Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica — The Electoral Office of Jamaica (EOJ) has pushed back the release of the upcoming voters’ list from November 30, 2025 to December ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Child dies after JUTC bus incident in Vineyard Town; police probe underway \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST CATHERINE, Jamaica — The Jamaica Urban Transit Company (JUTC) has confirmed that one of its buses was involved in a fatal incident in Vineyard Town... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Accused phone thief claims he was trying to fund mother’s eye surgery \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST JAMES, Jamaica — A man who was hauled before the court for allegedly stealing three phones has painted himself as a concerned son who was simply tr... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/20/antiguas-pm-says-jamaica-can-bounce-back-bigger-better/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/brownie-222-532x1024.jpg","video":null,"publish_date":"2025-11-21 01:07:53","author":null,"language":"en","category":"sports","source_country":"jm","sentiment":0.261},{"id":381065234,"title":"Meek NYC business leaders must resist ‘Stockholm syndrome’ — and stand up to Mamdani","text":"I was a bit shaken when I turned on CNBC’s “Squawk Box” shortly after Election Day. \n\nThere was Kathy Wylde, the longtime director of the Partnership for New York City, cheerleading for Mamdani-nomics.\n\nShe claimed the political adversaries of Mayor-elect Zohran Mamdani had exaggerated the case against him and his policies, blaming “political ads” and AI for widespread concern over his socialist proclivities. \n\n“I don’t think the rhetoric of the campaign will continue,” Wylde insisted. \n\n“I’m very hopeful that he’s gonna be a positive force in the city.”\n\n“He doesn’t sound like a socialist to me,” she declared.\n\nThe Partnership is a group of prominent Manhattan business leaders and major employers who advocate for a healthy and prosperous local economy. \n\nIts members should be deeply worried about where New York is headed.\n\nMost of the policy ideas Mandani advocates risk urban decline, fiscal chaos and a mass exodus of business interests from the city. \n\nYet Wylde said Partnership members are open to Mamdani’s agenda to raise taxes on businesses, give services away for free, freeze rents and create government-run grocery stores. \n\nShe isn’t the only one touting the new regime: At a recent Manhattan real-estate conference, developers were applauding the Mamdani era. \n\n“New York City is back,” boasted Scott Richler, CEO of RXR, a major real-estate firm. \n\nHe said investors “feel the energy, they have the conviction, and they have every right” to feel good about the city’s future. \n\nMeanwhile, other prominent business figures are expressing dismay — including the Partnership’s new incoming CEO, Steven Fulop, currently the mayor of Jersey City. \n\nFulop this week called Mamdani’s proposed corporate tax increases “absolute suicide for NYC, and an absolute dream” for neighboring New Jersey\n\nThese two radically different perspectives reflect deep divisions within the New York City business community. \n\nWho’s right?\n\nThe natural temptation for New York business leaders is to keep your head down, keep your mouth shut, and make peace with the incoming mayor — then hope and pray for the best.\n\nThat’s sometimes called Stockholm Syndrome: Learning to love your oppressor. \n\nHere we go again: Business groups tried this appeasement strategy under Mayor Bill de Blasio.\n\nDe Blasio, who ran on a “tale of two cities” narrative of economic inequality, coddled unions, got the state to hike NYC’s minimum wage, and caved without a whimper when Democratic Socialist Alexandria Ocasio-Cortez led the charge to drive out a job-generating Amazon headquarters in Queens.\n\nRather than standing up to de Blasio’s anti-business stances, too many influential business voices only enabled him, failing to mount any meaningful opposition.\n\nA better approach for those who truly care about the future of America’s premier financial capital is to warn the public — often and loudly — against policies that will strangle New York’s economic vitality.\n\nThat finally happened in 2020, seven years into de Blasio’s mayoralty, when more than 150 major business leaders got fed up.\n\nThey joined together to protest “widespread anxiety” over New York’s “security and livability” as pandemic restrictions ground on — warning that the mayor’s laxity on quality-of-life issues would harm the city’s economic prospects.\n\nIt didn’t halt de Blasio’s war-on-business policies, but it slowed him down. \n\nThe city’s lurch toward big-government socialism is taking its toll. \n\nOver the past decade, 2 million New Yorkers have fled the state, taking with them some $500 billion in cumulative income.\n\nThe poor have suffered the most from the loss of wealth and job creators. \n\nFulop and other business leaders must take a firm stand in defense of the free enterprise system that once built their city into a global powerhouse.\n\nThey must explain to voters how Mamdani’s radical tax-redistribution policies, which would give New York the highest corporate taxes in the country, are the enemy of prosperity.\n\nRent controls create housing shortages.\n\nGovernment-run enterprises drive out private investment.\n\nSeizing the means of production is a recipe for economic collapse, as history has demonstrated time and again from the Soviet Union to Venezuela. \n\nEmployers shouldn’t expect President Donald Trump or anyone else in Washington to bail out the city from the bad policy choices it keeps making. \n\nIf the job creators and the business leaders of Manhattan won’t use their voices and financial resources to defend the city and help make New York great again, who will?\n\nFulop has promised to do just that. \n\nBut right now he’s a lonely voice of reason. \n\nStephen Moore, co-founder of Unleash Prosperity, has served as a senior economic advisor to President Donald Trump.","summary":"The natural temptation is to keep your head down, keep your mouth shut and make peace with the incoming mayor — then hope and pray for the best. Bad idea.","url":"https://nypost.com/2025/11/20/opinion/meek-nyc-business-leaders-must-resist-mamdani-stockholm-syndrome/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/ZHEMDD.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-11-21 01:02:07","author":"Stephen Moore","authors":["Stephen Moore"],"language":"en","category":"politics","source_country":"us","sentiment":-0.03},{"id":381066766,"title":"US posts solid job growth in September, but unemployment rate rises","text":"AgenciesRepresentational image.\n\nU.S. employment growth accelerated in September, but the labor market remained sluggish and failed to keep pace with new job-seekers as employers dealt with fallout from import tariffs and integrated artificial intelligence into some positions. The jobless rate rose to 4.4%, its highest level in four years, from 4.3% in August, the Labor Department said in its closely watched employment report on Thursday. The August payrolls data was revised to show employers shedding jobs for the second time this year, underscoring the labor market softness.Other data from the Labor Department showed layoffs stayed low in mid-November, suggesting the job market remained stuck in what economists and policymakers call a \"no-hire, no-fire\" state.Some economists viewed the rise in the jobless rate as bolstering the argument for another Federal Reserve interest rate cut next month, while others said the better-than-expected job growth suggested the U.S. central bank should stay pat, especially since policymakers would not get another employment report before the December 9-10 meeting.\"The upside surprise in this report is positive, but it likely dampens prospects for a rate cut in December,\" said Olu Sonola, head of U.S. economic research at Fitch Ratings. \"The slight uptick in the unemployment rate complicates the narrative - pick your poison, stronger job growth or rising unemployment, because the good news may not be as good after all.\"Nonfarm payrolls increased by 119,000 jobs after a downwardly revised drop of 4,000 in August, the Labor Department's Bureau of Labor Statistics said. Economists polled by Reuters had forecast 50,000 jobs would be added after a previously reported gain of 22,000 in August. The survey of establishments also showed job growth in July was downgraded by 7,000 to 72,000 positions.Live EventsThe report was initially due on October 3, but was delayed by the shutdown of the federal government. The 43-day shutdown, the longest in U.S. history, forced the BLS to cancel the release of October's report as no data was collected for the household survey to calculate the unemployment rate for that month. October nonfarm payrolls will instead be combined with November's employment report now due on December 16, the BLS said.The delay, however, boosted the establishment survey collection rate to a higher-than-usual 80.2% as businesses self-reported electronically during the shutdown, the BLS said. Low collection rates have accounted for big revisions to payrolls data.Stocks on Wall Street were trading lower. The dollar was steady against a basket of currencies. U.S. Treasury yields mostly fell.Job gains in September were partially flattered by difficulties adjusting for workers leaving their summer jobs, resulting in higher payroll counts in the leisure and hospitality industry as well as retail industry.The healthcare sector continued to lead employment growth, adding 43,000 jobs in September, mostly in ambulatory services and at hospitals. Employment at restaurants and bars increased by 37,000 jobs, with overall leisure and hospitality payrolls rising by 47,000. Retailers added 13,900 positions. But the transportation and warehousing industry lost more than 25,000 jobs, while manufacturing shed a further 6,000 positions. Professional and business services payrolls decreased, with temporary help services accounting for the bulk of the drop.Federal government employment dropped by another 3,000 jobs, bringing the total losses since January to 97,000. That number is expected to surge as tens of thousands of workers who took buyouts dropped off government payrolls at the end of September.MEDIAN DURATION OF UNEMPLOYMENT RISESThe labor market has lost significant momentum this year, as evidenced by sharp downward revisions to nonfarm payroll counts. Economists and policymakers blame the slowdown on reduced supply and demand for workers. Others blamed the Trump administration's trade policy for creating an uncertain economic environment that had hamstrung the ability of businesses, especially small enterprises, to hire. Heading into the economic data blackout, the BLS had estimated that about 911,000 fewer jobs were created in the 12 months through March than previously reported. A reduction in immigration that started during the final year of former President Joe Biden's term and has accelerated since President Donald Trump's return to the White House this year has depleted labor supply.Economists estimate the economy needs to create less than 100,000 jobs per month to keep up with growth in the working-age population, though the rise in the unemployment rate in August and September suggests the break-even rate could be higher.\"The unemployment rate has trended higher, but for the 'right' reasons because labor force participation is rising even faster than the solid gains in employment,\" said Stephen Stanley, chief U.S. economist at Santander U.S. Capital Markets.\"This is very far from the results one would expect if the labor market were spiraling downward.\"The household survey from which the unemployment rate is derived showed 470,000 people entered the labor force in September, but household employment only increased by 251,000. There has been a steady rise in the number of people who have permanently lost their jobs, which persisted in September.Fewer people reported working part-time for economic reasons, but many were holding more than one job.Though there were a drop in the number of those experiencing long bouts of unemployment, the ranks of people out of work for up to 26 weeks swelled. That change pushed the median duration of joblessness to 10.0 weeks from 9.8 weeks in August.The rising integration of artificial intelligence is also eroding demand for labor, with most of the hit landing on entry-level positions, and locking recent college graduates out of work. Economists said AI was fueling jobless economic growth.The unemployment rate for college graduates increased to 2.8% from 2.7% in August. Wages continued to grow at a brisk clip, advancing by 3.8% in the 12 months through September, matching the gain in August. This trend should help underpin a moderate pace of consumer spending and keep the economy afloat.\"These changes complicate traditional interpretations of job numbers, but also point toward a labor market undergoing gradual, not chaotic, transformation,\" said Sung Won Sohn, a finance and economics professor at Loyola Marymount University. \"The key question for the year ahead is whether the economy can maintain this delicate equilibrium.\"(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama, Andrea Ricci and Paul Simao)Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News ontrumplabor departmentwhite houseloyola marymount universityblsfitch ratingsbureau of labor statisticsanother federal reservesung won sohn\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News ontrumplabor departmentwhite houseloyola marymount universityblsfitch ratingsbureau of labor statisticsanother federal reservesung won sohn(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"America's job growth picked up in September. However, the labor market showed signs of weakness. The jobless rate climbed to its highest in four years. This slowdown is linked to import tariffs and the integration of artificial intelligence. Job gains were seen in healthcare and leisure. Transportation and manufacturing sectors lost jobs. The economy faces a delicate balance ahead.","url":"https://economictimes.indiatimes.com/news/international/world-news/us-posts-solid-job-growth-in-september-but-unemployment-rate-rises/articleshow/125474924.cms","image":"https://img.etimg.com/thumb/msid-125474932,width-1200,height-630,imgsize-68292,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-21 01:01:57","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.455},{"id":381066560,"title":"Trump’s Ukraine peace plan would include ceding territory to Russia, NATO freeze","text":"President Donald Trump's plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv's military, according to a draft proposal obtained by The Associated Press.\n\n The proposal would also prevent the future expansion of NATO, a significant victory for Moscow, which views the alliance as a potential threat.\n\n In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine. There would also be a path to reintegrating Russia in the global economy, including the future lifting of sanctions.\n\n The country would also return to what was formerly known as the Group of 8, which includes many of the world's biggest economies.","summary":"In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine","url":"https://www.thehindu.com/news/international/trumps-ukraine-peace-plan-would-include-ceding-territory-to-russia-nato-freeze/article70305898.ece","image":"https://th-i.thgim.com/public/incoming/3591mq/article70305900.ece/alternates/LANDSCAPE_1200/2025-10-27T104713Z_164253508_RC29KHAV07O0_RTRMADP_3_UKRAINE-CRISIS-RUSSIA-MISSILES.JPG","video":null,"publish_date":"2025-11-21 01:01:09","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"in","sentiment":-0.041},{"id":381065332,"title":"Trump Floats Death Penalty For 'Seditious' Democrats","text":"Washington: US President Donald Trump on Thursday evoked the death penalty for Democratic lawmakers who urged the military to refuse illegal orders, calling them traitors and accusing them of \"seditious behavior.\" Democrats immediately slammed the \"absolutely vile\" threats against the six senators and representatives, who made the comments in a video posted on X on Tuesday. \"This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP???,\" Trump said on Truth Social. He then added in a later post: \"SEDITIOUS BEHAVIOR, punishable by DEATH!\" Trump also reposted a message from a user urging him to \"hang them\" and saying that the first US president, George Washington, would have done the same. The Democratic lawmakers all have service backgrounds and included Senator Mark Kelly, a former member of the Navy and NASA astronaut, and Senator Elissa Slotkin, who served with the CIA in Iraq. \"You can refuse illegal orders,\" they said in the video, accusing Trump of \"pitting our uniformed military and intelligence community professionals against American citizens.\" They did not specify which orders they were referring to, but Trump has ordered the National Guard into multiple US cities, in many cases against the wishes of local officials, in a bid to bring allegedly rampant unrest under control. Abroad, Trump has ordered strikes on a series of alleged drug-smuggling vessels in the Caribbean Sea and eastern Pacific Ocean that have left more than 80 people dead and which experts say are illegal. 'Lighting a match' The Democratic Party reacted furiously to Trump's comments. \"Trump just called for the death of Democratic elected officials. Absolutely vile,\" the party posted on its official X account, above a repost of Trump's earlier comment. The lawmakers in the video vowed not to be deterred by Trump's threats, saying they were \"veterans and national security professionals who love this country\" and had sworn an oath to defend the US constitution. \"That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation,\" they said. Democratic Senate Minority leader Chuck Schumer accused Trump of fanning the flames of violence. \"When Donald Trump uses the language of execution and treason, some of his supporters may very well listen. He is lighting a match in a country soaked with political gasoline,\" Schumer said in a speech on the Senate floor. But Republican House Speaker Mike Johnson told reporters in Congress that the Democratic lawmakers' initial call to refuse orders was \"wildly inappropriate. It is very dangerous.\" The White House and Pentagon chief Pete Hegseth have both previously slammed the message from the Democratic lawmakers. Trump previously evoked the death penalty in 2023 in relation to his former top US military officer Mark Milley, who became an outspoken critic of the president. After Milley told journalist Bob Woodward that he had secretly called his Chinese counterpart amid tensions after Trump supporters stormed the US Capitol in January 2021, Trump said \"in times gone by, the punishment would have been DEATH!\" Trump's death penalty comments came as he faces perhaps the most political pressure since his return to the White House in January. In recent weeks his grip on the Republican party has been shaken by the scandal over disgraced financier Jeffrey Epstein, and by off-year elections in New York, New Jersey and Virginia in which Democrats scored major wins.","summary":"Trump also reposted a message from a user urging him to \"hang them\" and saying that the first US president, George Washington, would have done the same","url":"https://www.deccanchronicle.com/world/trump-floats-death-penalty-for-seditious-democrats-1918529","image":"https://www.deccanchronicle.com/h-upload/2025/11/21/1980947-aa-5958411.webp","video":null,"publish_date":"2025-11-21 01:00:51","author":"AFP","authors":["AFP"],"language":"en","category":"politics","source_country":"in","sentiment":-0.114},{"id":381066190,"title":"FirstUp: Modi to attend G20 summit in South Africa, Trump to meet Mamdani… The headlines of the day","text":"It is set to be a busy Friday with several events lined up for the day.\nFirstly, Prime Minister Narendra Modi will be attending the G20 summit in South Africa. Meanwhile, US President Donald Trump will meet New York mayor-elect Zohran Mamdani today.\nPortugal’s President Marcelo Rebelo De Sousa visits Monaco. In India, the Supreme Court is set to hear a petition seeking the postponement of the special intensive revision (SIR). Meanwhile, the 74th Miss Universe Finale will take place today in Bangkok, Thailand.\nSTORY CONTINUES BELOW THIS AD Here’s all that is set to take place throughout the day.\nModi to attend G20 summit in South Africa Prime Minister Narendra Modi will be visiting Johannesburg from November 21 to attend the 20th G20 Leaders’ Summit hosted by South Africa. This will be the fourth consecutive G20 Summit held in the Global South.\nAt the Summit, PM Modi will put forth India’s perspectives on the G20 agenda. The three sessions of the Summit include “Inclusive and Sustainable Economic Growth Leaving No One Behind: Building our economies, the role of trade, financing for development and the debt burden”, “A Resilient World – the G20’s Contribution: Disaster Risk Reduction, Climate Change, Just Energy Transitions, Food Systems” and “A Fair and a Just Future for All: Critical Minerals; Decent Work; Artificial Intelligence”. He is expected to speak in all three sessions of the Summit, the Ministry of External Affairs said.\nMore from Explainers New day, Trump’s new claim on India-Pakistan ceasefire: ‘PM Modi called me to say…’ Royal welcome, then a royal denial… Takeaways from Trump’s meeting with Saudi’s MBS Trump to meet Mamdani US president Donald Trump is set to meet New York City mayor-elect Zohran Mamdani today at the White House. The meeting comes days after the two exchanged barbs during the campaign of the recently concluded NYC mayoral polls.\nAnnouncing the meeting on his Truth Social account, Donald Trump said that Mamdani has asked for a meeting. “Communist Mayor of New York City, Zohran “Kwame” Mamdani, has asked for a meeting. We have agreed that this meeting will take place at the Oval Office on Friday, November 21st. Further details to follow!” Trump said on his Truth Social post on Wednesday.\nThis combination of pictures shows Democratic candidate for Mayor of New York City Zohran Mamdani (left) and US President Donald Trump in Washington, DC (right). AFP The meeting carries a lot of weight because it marks their first encounter since Mamdani’s election. The fact that Mamdani, who is an immigrant with Indian roots, just pulled off a major victory in the New York mayoral race makes this an even more interesting and personal first meeting.\nQuick Reads View All Inside Operation Lyari, Pakistan’s crackdown on gangs, which inspired Ranveer Singh’s ‘Dhurandhar' Could Russia’s mysterious spy ship near UK waters trigger conflict? Portugal’s President Marcelo Rebelo De Sousa to visit Monaco Portugal’s President Marcelo Rebelo de Sousa will undertake an official visit to Monaco today. The two-day visit will begin on November 20 and will go till November 23.\nThe primary goal of the visit is to reinforce cooperation between the two nations, with a particular focus on shared environmental priorities. Both leaders share a strong interest in ocean conservation and biodiversity, an area that has been a significant point of convergence in their diplomatic discussions.\nSC to hear petition against Kerala SIR The Supreme Court is expected to hear the Kerala government’s petition seeking postponement of the special intensive revision (SIR) of the state’s electoral rolls today.\nA view of Supreme Court of India building in New Delhi. File photo/PTI The state is urgently appealing to the court to make the ECI delay the scheduled voter revision. Why? They argue that having the massive revision effort overlap with the busy local body elections in Kerala is a bad decision that will severely stretch administrative resources and risk complete collapse.\nSTORY CONTINUES BELOW THIS AD 74th Miss Universe finale The 74th Miss Universe final is scheduled to take place today at the Impact Challenger Hall in Pak Kret near Bangkok, Thailand. The theme for this year’s is “The Power of Love” and will see over 100 contestants from around the globe competing for the coveted crown.\nThe pageant will be live-streamed on the official Miss Universe YouTube channel and is also available on platforms like Peacock and Telemundo in select regions. More than 100 delegates are participating this year. A notable contestant is Manika Vishwakarma, representing India, who is aiming to become the fourth Indian woman to win the title.\nWith inputs from agencies","url":"https://www.firstpost.com/explainers/firstup-modi-to-attend-g20-summit-in-south-africa-trump-to-meet-mamdani-the-headlines-of-the-day-13952506.html","image":"https://images.firstpost.com/uploads/2025/11/FirstUp-1-86-2025-11-ab37719bebf23f71954140c485ac0704.jpg?im=FitAndFill=(1200,675)","video":null,"publish_date":"2025-11-21 01:00:46","author":"Fp Explainers","authors":["Fp Explainers"],"language":"en","category":"politics","source_country":"in","sentiment":0.52},{"id":381065232,"title":"US Coast Guard denies claim it will stop classifying swastikas as hate symbols: ‘Categorically false’","text":"The US Coast Guard denied claims it’s revising its policies to reclassify hate symbols, including the swastika and nooses, as “potentially divisive” symbols — slamming the suggestion as “categorically false.” \n\nThe claim, first reported by the Washington Post on Thursday afternoon, picks apart the Coast Guard’s “Harassing Behavior Prevention, Response, and Accountability” manual that was approved this month.\n\nThe military branch flatly denied the outlet’s report that it was planning to reclassify its list of hate symbols.\n\n“The claims that the U.S. Coast Guard will no longer classify swastikas, nooses or other extremist imagery as prohibited symbols are categorically false,” Admiral Kevin Lunday, acting commandant of the US Coast Guard, wrote in a statement on X. “These symbols have been and remain prohibited in the Coast Guard per policy. Any display, use or promotion of such symbols, as always, will be thoroughly investigated and severely punished.”\n\n“The Coast Guard remains unwavering in its commitment to fostering a safe, respectful and professional workplace. Symbols such as swastikas, nooses and other extremist or racist imagery violate our core values and are treated with the seriousness they warrant under current policy.”\n\nThe Coast Guard harassment manual lists six major changes coming to its policies.\n\nThe Washington Post’s report largely revolves around the fourth listed change, which states that “[t]he terminology ‘hate incident’ is no longer present in policy,” and the subsequent removal of the term “hate symbol” from the policies, which isn’t directly addressed under the major changes.\n\nInstead, typical hate symbols like nooses, swastikas, and “any symbols or flags co-opted or adopted by hate-based groups” are relegated under “potentially divisive symbols and flags,” according to the policy.\n\nThe US Department of Homeland Security, which oversees the Coast Guard and published the new policy document on its own website, accused the Washington Post of “making things up” in a post on X.\n\nIn a meeting with America’s top generals and admirals in late September, Secretary of War Pete Hegseth promised a sweeping overhaul of the military’s policies that were creating “division.”\n\n“More leadership changes will be made. Of that, I’m certain,” Hegseth said.\n\nWhile the Coast Guard is not a part of the Department of War, it has been aligning its policies to meet several of Hegseth’s demands. \n\nMany didn’t buy into the Coast Guard or DHS’s responses.\n\n“Welcome to Donald Trump’s America, where swastikas are no longer considered hate symbols. This is unacceptable. Jewish Americans are less safe when antisemitic hate is normalized by our government,” the Jewish Democratic Council of America said in a statement to Haaretz.\n\nMassachusetts Sen. Ed Markey, a Democrat, said that the shift is “disgusting” and a gross attempt to “normalize hate.” \n\n“Swastikas, nooses, Confederate flags are symbols of hate,” he plainly told the outlet.\n\nThe new policies laid out in the text will take effect on Dec. 15, according to the document.","summary":"“The claims that the U.S. Coast Guard will no longer classify swastikas, nooses or other extremist imagery as prohibited symbols are categorically false.\"","url":"https://nypost.com/2025/11/20/us-news/us-coast-guard-denies-claim-it-will-stop-classifying-swastikas-as-hate-symbols-categorically-false/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/Untitled-1-2025-11-20T183106.161.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/2v7lehgM-RyIcpnTz.mp4","publish_date":"2025-11-21 01:00:37","author":"Caitlin McCormack","authors":["Caitlin McCormack"],"language":"en","source_country":"us","sentiment":-0.477},{"id":381067128,"title":"Federal judge rules Trump's troop surge to DC is illegal","text":"A federal judge sided Thursday with the attorney general in Washington, D.C., who sued against the National Guard deployment ordered by President Donald Trump.\n\nThe president ordered a deployment of troops into D.C. to quell the violent crime rampant in the area, but many on the left have accused him of militarizing the streets in order to intimidate his political opponents.\n\n'This unprecedented federal overreach is not normal, or legal. It is long past time to let the National Guard go home — to their everyday lives, their regular jobs, their families, and their children.'\n\nOn Thursday, U.S. District Judge Jia Cobb ruled that the president had exceeded his presidential authority but gave the administration 21 days to appeal the ruling.\n\nCobb said that Trump could not deploy troops for \"non-military, crime-deterrence missions in the absence of a request from the city's civil authorities.\"\n\n\"Normalizing the use of military troops for domestic law enforcement sets a dangerous precedent, where the President can disregard states' independence and deploy troops wherever and whenever he wants — with no check on his military power,\" D.C. Attorney General Brian Schwalb said after the ruling.\n\nWhite House Deputy Chief of Staff Stephen Miller excoriated the ruling.\n\n\"Judicial despotism is one of the gravest hazards we face to the functioning and endurance of our Republic,\" he wrote on social media. \"No district judge can steal for himself the powers of the Commander-in-Chief.\"\n\nThe president has sent National Guard members to other cities to combat crime and faced other challenges in court from his opponents and local government officials.\n\nWhite House spokeswoman Abigail Jackson said Schwalb's lawsuit was \"nothing more than another attempt — at the detriment of D.C. residents — to undermine the president's highly successful operations to stop violent crime in D.C.\"\n\nRELATED: DC Dems are furious at Mayor Bowser for admitting Trump's troops are lowering crime\n\n\"This unprecedented federal overreach is not normal, or legal. It is long past time to let the National Guard go home — to their everyday lives, their regular jobs, their families, and their children,\" Schwalb added.\n\nD.C. Mayor Muriel Bowser admitted that the surge had helped decrease violent crime in the district, but she was widely criticized by other Democrats for saying it publicly. \n\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!","url":"https://www.theblaze.com/news/trump-surge-dc-judge-rules","image":"https://www.theblaze.com/media-library/federal-judge-rules-trump-s-troop-surge-to-dc-is-illegal.jpg?id=62221344&width=1200&height=600&coordinates=0%2C167%2C0%2C167","video":null,"publish_date":"2025-11-21 01:00:09","author":"Carlos Garcia","authors":["Carlos Garcia"],"language":"en","category":"politics","source_country":"us","sentiment":0.02},{"id":381066768,"title":"Zelenskiy says he is ready to work on US-backed plan to end war in Ukraine","text":"Getty ImagesUkriane's President Volodymyr Zelensky \n\nPresident Volodymyr Zelenskiy said after talks with a top U.S. Army official on Thursday he was ready to work with Washington on a plan to end the war in Ukraine, and he expects to discuss it with President Donald Trump in coming days.European countries are pushing back against the U.S.-backed plan, which sources said would require Kyiv to give up more land and partially disarm, conditions long seen by Ukraine's allies as tantamount to capitulation.But Zelenskiy, whose office said he had received a draft of the plan, said after meeting U.S. Army Secretary Daniel Driscoll in Kyiv that Ukraine and Washington would work together on elements of it.KYIV READY FOR 'CONSTRUCTIVE' WORK\"Our teams - Ukraine and the USA - will work on the points of the plan to end the war,\" Zelenskiy wrote on Telegram. \"We are ready for constructive, honest and prompt work.\"Live EventsZelenskiy's office did not comment directly on the content of the 28-point plan, which has not been published, but said he had \"outlined the fundamental principles that matter to our people\".\"In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,\" it said.White House Press Secretary Karoline Leavitt told a news briefing that Secretary of State Marco Rubio and U.S. special envoy Steve Witkoff had been quietly working on the plan for about a month and Trump supports the plan.\"It's a good plan for both Russia and Ukraine, and we believe that it should be acceptable to both sides,\" she said.She said the U.S. engaged equally with the Ukrainians and the Russians on the text.Zelenskiy's office said Driscoll had presented him with the plan only on Thursday, and several sources told Reuters and other media outlets that the plan was the fruit of backchannel conversations between Witkoff and Kirill Dmitriev, the special envoy of Russian President Vladimir Putin.In a message on X on Wednesday, Rubio said the U.S. \"will continue to develop a list of potential ideas for ending this war based on input from both sides of this conflict\" and that peace will require concessions from both Kyiv and Moscow.Zelenskiy, who met Driscoll alone then with the full U.S. delegation, agreed to move quickly towards agreement and signing of a plan, said Colonel Dave Butler, U.S. army chief of public affairs.The United States, he said, wanted to ensure that this is \"a good plan for the Ukrainian people.\"The U.S. ambassador to Kyiv, Julie Davis, said the talks were \"remarkably constructive.\" All participants \"share President Trump's vision to end this war\" and wanted to move forward quickly, she said.The acceleration in U.S. diplomacy comes at an awkward time for Kyiv, with its troops on the back foot on the battlefield and Zelenskiy's government undermined by a corruption scandal. Parliament fired two cabinet ministers on Wednesday.GENERAL SAYS RUSSIA CONTROLS KUPIANSKMoscow played down any new U.S. initiative.\"Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,\" Kremlin spokesman Dmitry Peskov said.He said Russia had nothing to add beyond the position Putin laid out at a summit with Trump in August, adding that any peace deal must address the \"root causes of the conflict\", a phrase Moscow has long used to refer to its demands.With another winter approaching in the nearly four-year-old war, Russian troops occupy almost one-fifth of Ukraine and are slowly advancing while bombarding Ukrainian energy supplies and cities as the cold winter sets in.The Kremlin said Putin had visited the command post of the Russian forces' \"West\" grouping on Thursday, where he met the chief of Russia's general staff, Valery Gerasimov, and other top military brass.Gerasimov told Putin Russian forces had taken control of the Ukrainian city of Kupiansk, a city Moscow sees as an important target in its westward push through central and eastern Ukraine.Ukraine's military denied Russian claims it controls Kupiansk in northeastern Ukraine or 70% of the ruined railway hub of Pokrovsk in eastern Ukraine.Reuters could not independently verify either statement, although video released by Russia's defence ministry on Thursday showed its troops moving freely through the southern part of Pokrovsk, patrolling deserted streets lined with charred apartment blocks.'PEACE CANNOT BE CAPITULATION,' SAYS FRANCEEuropean Union foreign ministers meeting in Brussels did not comment in detail about the U.S. plan, but indicated they would not accept demands for Kyiv to make punishing concessions.\"Ukrainians want peace - a just peace that respects everyone's sovereignty, a durable peace that can't be called into question by future aggression,\" said French Foreign Minister Jean-Noel Barrot. \"But peace cannot be a capitulation.\" Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onZelenskiy Ukraine US planend war in UkraineRussia Ukraine conflictUkraine Washington negotiationspeace negotiations Ukraine RussiaTrump Zelenskiy talksEU foreign ministers UkraineUkraine corruption scandal\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onZelenskiy Ukraine US planend war in UkraineRussia Ukraine conflictUkraine Washington negotiationspeace negotiations Ukraine RussiaTrump Zelenskiy talksEU foreign ministers UkraineUkraine corruption scandal(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nPrime ExclusivesInvestment IdeasStock Report PlusePaperWealth Edition123View all Stories","summary":"Ukraine's President Zelenskiy will work with the U.S. on a peace plan. This comes as European nations resist U.S. proposals that could force Kyiv to cede territory. Russia claims control of Kupiansk. France states peace cannot be capitulation. U.S. officials believe the plan is acceptable to both sides.","url":"https://economictimes.indiatimes.com/news/defence/zelenskiy-says-he-is-ready-to-work-on-us-backed-plan-to-end-war-in-ukraine/articleshow/125474903.cms","image":"https://img.etimg.com/thumb/msid-125474909,width-1200,height-630,imgsize-79784,overlay-etdefence/articleshow.jpg","video":null,"publish_date":"2025-11-21 00:57:16","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":0.11},{"id":381067456,"title":"School Assembly News Headlines Today (Nov 21): Top National, International & Sports Updates + Thought of the Day","text":"If you’re a student on the lookout for news headlines to read out in your school assembly, you’re at the right place! We’ve compiled a list of the most important national, international, and sports-related news items to keep students well-informed about the latest events happening both within the country and across the world. National News SC Says Governor Can Reserve Bill Passed Again by Assembly for President’s ConsiderationWomen’s Representation Still Low in Regulatory Bodies: Supreme Court JudgeIndian Ocean Region’s Security Is a Shared Responsibility: Doval at Colombo ConclaveIndia Strengthening Pandemic Preparedness: NaddaDelhi Court Sends Four Accused in Red Fort Bomb Blast Case to 10-Day NIA CustodyFoodgrains Output Rises 8% to Record 357.73 Million Tonnes in 2024-25: Government DataRupee Falls 20 Paise Against the US DollarIFFI Festival Opens with Dazzling Parade Showcasing India’s CultureFour School Principals Selected for Prestigious Derozio Awards for Excellence in EducationUS President’s Son Donald Trump Jr. Visits Vantara Sanctuary Also Read | Will Schools Observe Guru Tegh Bahadur's Martyrdom Day Holiday on Nov 24th or 25th? International News India to Highlight Key Issues of the Global South at the G20: MEA OfficialCurrent Multilateral System Faces Barriers Hindering Transformative Policies: G20 ReportUS to Attend but Not Participate in Deliberations at the South Africa G20 SummitIndia and Israel Sign Terms to Formally Begin FTA NegotiationsDRDO and France’s DGA Sign Pact for Joint Defence InnovationsJaishankar Highlights Expansion in India-Australia CooperationChina Supplying Submarines to Pakistan; India Monitoring the Situation: Navy Vice ChiefUK’s COVID Lockdown Delay Caused 23,000 Excess Deaths: Inquiry FindsTrump Extends Tariff Relief on Coffee, Fruit, and Beef Imports from BrazilNearly 100 Tourists Rescued from Leaking Boat Near Popular Thai IslandPakistan PM Welcomes US Panel’s Report on May Conflict; China Calls It ‘Disinformation’Bhupender Yadav Meets Ministers from China, Cuba, Germany and Denmark on COP SidelinesReliance Stops Use of Russian Oil at Export-Only Refinery to Comply with EU Sanctions Sports News Women Boxers Shine with Seven Gold Medals; India Bags 20 in TotalPranavi Creates History, Defeats Male Golfers to Win IGPL MumbaiSpain Defeats Czech Republic to Reach Davis Cup SemifinalsIndia A Outclass Oman A; India B Lose to FranceZimbabwe Registers Biggest Win Over Sri Lanka in T20 Tri-SeriesLakshya and Shetty Reach Australian Open Badminton Quarters; Prannoy ExitsAnahat and Joshna Enter Indian Open Squash SemifinalsLahiri Fires 63; Caleb Surratt Leads at PIF Saudi InternationalArunachal Poised to Become a Nursery of Sporting Champions: KhanduRyan Williams Gets FIFA Approval; Eligible for Indian Team SelectionEast Bengal Approaches PM for Support in Reviving Indian FootballItaly Must Beat Northern Ireland, Then Wales or Bosnia, to Qualify for the World CupPlaying XI: Sudharsan Likely to Edge Out Padikkal; Axar and Nitish Compete for Spots Thought of the Day The first step is always the hardest, but also the most important. पहला कदम हमेशा कठिन होता है, लेकिन सबसे ज़रूरी भी। Recommended | Delhi Schools to be Equiped with AI-enabled Learning in Five Years","summary":"Take a look at the major national, international, and sports highlights of the day. You may use it in the school assembly on November 21, 2025.","url":"https://www.timesnownews.com/education/school-assembly-news-headlines-today-nov-21-top-national-international-sports-updates-thought-of-the-day-g20-summit-ind-vs-sa-test-pm-modi-trump-article-153182933","image":"https://images.timesnownews.com/thumb/msid-153182937,thumbsize-38528,width-1280,height-720,resizemode-75/153182937.jpg","video":null,"publish_date":"2025-11-21 00:56:45","author":"TN Education Desk","authors":["TN Education Desk"],"language":"en","source_country":"in","sentiment":0.156},{"id":381066762,"title":"Fire disrupts COP30 climate talks as UN chief urges deal","text":"APFlames engulf pavilions at the COP30 U.N. Climate Summit, Thursday, Nov. 20, 2025, in Belem, Brazil.\n\nTalks at the COP30 climate summit in Brazil were disrupted on Thursday after a fire broke out in the venue, triggering an evacuation just as negotiators were hunkering down to try to land a deal to strengthen international climate efforts. United Nations Secretary-General Antonio Guterres had appealed earlier in the day for a deal from the summit in the Amazon city of Belem, welcoming calls from some for clarity on the hotly disputed subject of weaning the world off fossil fuels.There are less than 24 hours until the scheduled end of the summit to find a consensus among nearly 200 participating countries. Host nation Brazil has framed a deal as a crucial step towards ramping up international climate action and demonstrating that there is broad support to accelerate turning decades of promises and pledges from COP summits into action.Shortly after lunchtime, however, security footage showed flames breaking out at an exhibition pavilion and spreading rapidly up an internal fabric shell that lined the walls and ceiling of the building, before being extinguished.Thirteen people were treated for smoke inhalation at the venue, organizers said. The local fire service said it was probably caused by electrical equipment, likely a microwave, and was controlled within six minutes. Thousands of delegates were evacuated as security staff formed a human barrier across the hallway.DRAFTING DOCUMENTS, DEADLINES MISSEDNegotiations were not expected to resume until Friday morning, a source told Reuters. Consultations between the presidency and negotiating blocs could continue on Thursday night, subject to safety assessments at the venue.The summit already missed a self-imposed Wednesday deadline to secure agreement among the countries present on issues including how to increase climate finance and shift away from fossil fuels.Live EventsBrazil circulated a draft proposal for part of the COP30 deal among some governments on Thursday, which did not include a roadmap on transitioning away from fossil fuels.Emissions from burning fossil fuels trap heat in the earth's atmosphere and are by far the biggest contributor to warming.The draft proposal, seen by Reuters, included other elements for a deal. It said countries would call to triple the financing available to help nations adapt to climate change by 2030, from 2025 levels. However, it did not specify whether this money would be provided directly by wealthy governments, or other sources including development banks or the private sector.Brazil's COP30 presidency did not immediately respond to a request for comment on the draft text.Some negotiators said they had been working on the draft text shortly before the COP venue was evacuated due to the fire. Others said it had not been shared with them.It is common at COP summits for the presidency to thrash out a text with small groups of countries, before bringing all governments together to greenlight the final deal.FOSSIL FUEL RIFTThe two-week negotiation has become hung up on two issues - the future of fossil fuels and the delivery of climate finance - that expose criss-crossing fault lines between negotiating blocs from rich Western countries, oil producers and smaller states most vulnerable to climate change.Taking their cue from Brazil, dozens of countries including both developed and developing nations have mounted a push for a roadmap setting out how countries should transition away from fossil fuels.Others, including some fossil fuel-producing nations, are resisting.The COP28 climate summit in 2023 agreed, after protracted discussion, to a transition, but nations have not mapped out how - or when - it will happen. \"I am perfectly convinced that a compromise is possible,\" Guterres said.ADAPTING TO CHANGEAnother major sticking point in the negotiations is a reluctance among some richer nations to guarantee financing to help poorer countries adapt to a changing climate, according to three sources involved in the talks.Developing countries are already deeply mistrustful of a $300 billion climate finance pledge made last year at the COP29 conference in Baku, particularly as the United States withdraws from climate cooperation under President Donald Trump. Some existing climate finance has been directed to strange projects, including some that are funneling billions of dollars back to rich nations, according to previous Reuters reporting.\"Right now, our people are losing their lives and livelihoods from storms of unprecedented strength which are being caused by warming seas,\" said Steven Victor, Minister of Agriculture, Fisheries and the Environment for the Pacific island nation of Palau.\"If we leave Belem without a transformative outcome on adaptation for the world's most vulnerable, it will be a failure,\" he said.European officials have said they agree adaptation financing is important, but that they were not authorized to agree to new targets.Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onCOP30 climate talksUN climate summitfossil fuelsclimate financeBrazil climate conferenceAntonio Guterresclimate change adaptationfire evacuation COP30\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onCOP30 climate talksUN climate summitfossil fuelsclimate financeBrazil climate conferenceAntonio Guterresclimate change adaptationfire evacuation COP30(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\nExplore More Stories123","summary":"COP30 climate summit talks in Brazil faced disruption after a fire broke out at the venue. Delegates were evacuated as negotiators worked to finalize a deal on climate action. Key issues like fossil fuel transition and climate finance remain points of contention. The summit aims to accelerate climate promises into action.","url":"https://economictimes.indiatimes.com/news/international/world-news/fire-disrupts-cop30-climate-talks-as-un-chief-urges-deal/articleshow/125474878.cms","image":"https://img.etimg.com/thumb/msid-125474893,width-1200,height-630,imgsize-50502,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-21 00:52:09","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.366},{"id":381065160,"title":"David Ellison's rapport with Trump could give him an edge in the Warner Bros. Discovery bidding war","text":"Don&apos;t bet against Paramount Skydance CEO David Ellison — especially if he has President Donald Trump on his side.Paramount made a bid for all of Warner Bros. Discovery in time for the media conglomerate&apos;s self-imposed Thursday deadline&comma; according to The New York Times. Comcast and Netflix are also bidding for the streaming and studios side of WBD&comma; The Times reported.Spokespeople for Paramount and WBD declined to comment. Spokespeople for Comcast and Netflix didn&apos;t respond to requests for comment.A Paramount-WBD deal would be the largest media tie-up since Disney bought Fox&apos;s TV and movie studio in 2019. While mega-mergers of that magnitude are rare&comma; legal experts say that Ellison&apos;s apparent rapport with Trump may help Paramount get around antitrust concerns.\"If we were talking about this a year ago&comma; there&apos;s no way&comma;\" said Corey Martin&comma; an entertainment lawyer at Granderson Des Rochers in Los Angeles. \"But we&apos;re not under a Biden administration.\"Trump said in June that the then-incoming Paramount CEO was \"great\" and would \"do a great job\" at the media company. More recently&comma; Ellison was invited to a White House dinner for Mohammed bin Salman&comma; the Crown Prince of Saudi Arabia&comma; on Tuesday night. Ellison&apos;s father&comma; the billionaire Oracle cofounder Larry Ellison&comma; has been a closer supporter of Trump for years.David Ellison has said he doesn&apos;t want to \"politicize our company in any way&comma; shape&comma; or form.\" Despite this stance&comma; his move to appoint the anti-woke media entrepreneur Bari Weiss as the top editor at Paramount&apos;s CBS News made waves in the worlds of politics and media.Paramount is the most logical bidder for WBD because it has the clearest path on the financing and regulatory fronts&comma; and is the most motivated to make a deal&comma; Raymond James media analyst Ric Prentiss wrote in a mid-November note.WBD put a for-sale sign on itself in late October&comma; after CEO David Zaslav said it had received \"unsolicited interest\" from multiple suitors. It appears Paramount&comma; Comcast&comma; and Netflix are most interested&comma; though only Paramount seems to have the appetite to swallow all of WBD&comma; which is separating its studio and streamer from its cable networks.Rival Comcast is spinning off most of its cable TV assets&comma; so adding more networks from WBD wouldn&apos;t make sense. Its stagnant stock price and high debt load may also limit how much it&apos;s able to bid without an equity partner&comma; Raymond James&apos; Prentiss wrote.Another negative factor: Trump has expressed disdain for Comcast CEO Brian Roberts&comma; as well as for MSNBC (which Comcast is spinning off) and NBC News.The fit between Comcast and WBD \"on paper&comma; is nearly perfect&comma;\" media analyst Craig Moffett wrote in a mid-November note. But the MoffettNathanson cofounder also said \"the regulatory&sol;political impediments to an acquisition could prove to be insurmountable.\"And while Netflix has the financial firepower to compete with Paramount in a bid&comma; it has no interest or need for legacy TV networks. Co-CEO Ted Sarandos said the company is \"choosy\" about dealmaking on its latest earnings call.Netflix \"is merely doing its due diligence\" on WBD and \"would not pay a premium to the current price in a competitive bidding process&comma;\" MoffettNathanson&apos;s Robert Fishman wrote last week.Plus&comma; the streaming giant could run into regulatory roadblocks&comma; either in the US or abroad.Morgan Stanley&apos;s Ben Swinburne said in a Wednesday note that Netflix had the \"smallest synergy opportunity&comma;\" meaning cost savings from a WBD deal&comma; \"and perhaps the toughest regulatory path.\"Wall Street&apos;s excitement isn&apos;t shared by Hollywood creatives and some Paramount employees.A Paramount marketing strategy staffer expressed concern that a merger would lead to more layoffs&comma; although they said they had grown accustomed to cuts.\"Everyone at Paramount is used to it&comma; in a sinister kind of way&comma;\" this person said of layoffs. Ellison&apos;s company laid off 1&comma;000 staffers in late October&comma; and a person familiar with Paramount&apos;s plans told Business Insider that about 1&comma;000 more cuts are coming&comma; though the timeline on that is unclear.Industry analysts say a merger of Paramount and Warner Bros. would be challenging to get through in a normal regulatory environment&comma; as a consolidated studio could potentially pay creatives less while raising prices.Antitrust regulators typically focus on how a merger of two powerful companies could impact the labor market and their pricing power over consumers. However&comma; Martin&comma; the entertainment lawyer&comma; said much of that conventional analysis \"is out the window\" in the second Trump administration&comma; in which personal relationships play a larger role.Trump&apos;s apparent goodwill toward Paramount and Ellison&comma; along with his administration&apos;s M&A-friendly stance&comma; has legal experts feeling rosy about the chances of Paramount&apos;s WBD bid.\"There&apos;s room for some optimism by the companies that they would be able to consummate this merger if they wanted to&comma;\" said Ray Seilie&comma; an entertainment litigator at Los-Angeles-based law firm Kinsella Holley Iser Kump Steinsapir.If WBD splits itself next summer&comma; the two companies couldn&apos;t get acquired for two years without incurring significant tax penalties. That could delay any bidding process until 2028&comma; when it&apos;s unclear who will control Congress and have the inside track to the White House.In other words&comma; Paramount Skydance might be thinking it&apos;s \"now or never\" to get a deal done for the WBD assets&comma; Seilie said.While Hollywood may complain about one firm controlling the Paramount Pictures and Warner Bros. studios&comma; Ellison&apos;s plea to the Trump administration may be simple&comma; legal experts said: buying WBD is the only way to survive when competing against deep-pocketed tech giants in a cutthroat industry.\"It&apos;s possible that the way things are right now are unsustainable&comma; and they need this merger in order to effectively compete against Netflix&comma;\" Seilie said.Pairing Paramount+ with HBO Max and Warner Bros. could make Paramount a streaming superpower.By bidding on WBD&comma; Ellison can \"take advantage of a much larger opportunity to redefine Paramount&apos;s future&comma;\" MoffettNathanson analyst Robert Fishman wrote.","summary":"David Ellison's Paramount Skydance wants to buy Warner Bros. Discovery. A pairing of their streamers could challenge Netflix and Disney.","url":"https://www.businessinsider.com/paramount-wbd-bid-david-ellison-trump-warner-bros-comcast-netflix-2025-11","image":"https://i.insider.com/68debef55dbc4fd10daa0f97?width=1200&format=jpeg","video":null,"publish_date":"2025-11-21 00:52:06","author":"James Faris","authors":["James Faris"],"language":"en","source_country":"US","sentiment":0.051},{"id":381066754,"title":"Trump signs order to remove tariffs from Brazilian beef, coffee","text":"U.S. President Donald Trump on Thursday removed his 40% tariffs on Brazilian food products, including beef, coffee, cocoa and fruits that were imposed in July to punish Brazil over the prosecution of its former president, Trump ally Jair Bolsonaro. The move follows a similar order by the administration last Friday to remove tariffs on several agricultural products from other countries as the White House makes a U-turn on some tariffs that have increased the cost of food in the United States.The order will affect Brazilian imports to the U.S. on or after November 13 and may require a refund of the duties collected on those goods while the tariffs were still being charged, according to the text of the order released by the White House.Brazil normally supplies a third of the coffee used in the United States, the world's largest coffee drinker, and has more recently become an important supplier of beef, particularly the type that is used to make burgers.U.S. retail coffee prices rose as much as 40% this year due to the tariffs and other market factors such as weather-induced production shortfalls. Live EventsRising food prices are a major factor behind Trump's declining approval ratings, which have fallen to their lowest since his return to power, a Reuters/Ipsos poll found. \"You can expect some thousands of bags of Brazilian coffee that were sitting in bonded warehouses to start moving quickly to U.S. roasters,\" said commodities analyst Judith Ganes, president of J. Ganes Consulting.Bonded warehouses are storage facilities where importers can leave products without paying import duties.Several importers stored products in those facilities after the heavy Brazilian tariffs were announced, while they waited for an eventual revision of the duties.\"The decision (to lift Brazil tariffs) shows the effectiveness of the trade negotiations,\" said Brazilian beef industry group ABIEC, adding it will continue to work to increase its share in the market.Trump's executive order on Thursday did not mention the actions against Brazilian authorities involved in the prosecution and conviction of former President Jair Bolsonaro for plotting a coup to remain in power after losing the 2022 election.Brazil's Supreme Court Justice Alexandre de Moraes and his wife were sanctioned through the Global Magnitsky Act, while other justices and some ministers had their U.S. visas revoked.Brazil's President Luiz Inacio Lula da Silva said on Thursday he was glad that the 40% tariff was removed.(Reporting by Ismail Shakil and Marcelo Teixeira; additional reporting by Rodrigo Viga and Fabio Teixeira; Editing by Lincoln Feast)Add as a Reliable and Trusted News Source Add Now!\n (You can now subscribe to our Economic Times WhatsApp channel)\n\nRead More News onTrump removes tariffs on Brazilian beefimpact of tariffs on coffee pricesBrazil food tariffs liftedU.S. coffee imports from BrazilJair Bolsonaro prosecution tariffsBrazilian beef market shareU.S. retail coffee prices riseTrump's approval ratings\n\n(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless\n\n(You can now subscribe to our Economic Times WhatsApp channel)Read More News onTrump removes tariffs on Brazilian beefimpact of tariffs on coffee pricesBrazil food tariffs liftedU.S. coffee imports from BrazilJair Bolsonaro prosecution tariffsBrazilian beef market shareU.S. retail coffee prices riseTrump's approval ratings(Catch all the Business News, Breaking News and Latest News Updates on The Economic Times.) Subscribe to The Economic Times Prime and read the ET ePaper online....moreless","summary":"President Donald Trump has lifted tariffs on Brazilian food imports. This move impacts beef, coffee, cocoa, and fruits. The tariffs, imposed in July, had increased food costs in the US. The White House is reversing some tariff decisions. This action is expected to allow Brazilian coffee and beef to flow into the US market more freely.","url":"https://economictimes.indiatimes.com/news/international/global-trends/trump-signs-order-to-remove-tariffs-from-brazilian-beef-coffee/articleshow/125474866.cms","image":"https://img.etimg.com/thumb/msid-125474874,width-1200,height-630,imgsize-137842,overlay-economictimes/articleshow.jpg","video":null,"publish_date":"2025-11-21 00:50:26","author":"Martin Shwenk Leade","authors":["Martin Shwenk Leade"],"language":"en","category":"politics","source_country":"in","sentiment":-0.006},{"id":381066028,"title":"Federal judge orders release of 16 migrants detained in Idaho raid, citing due process violations","text":"By REBECCA BOONE\n\nBOISE, Idaho (AP) — A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month.\n\nU.S. District Judge B. Lynn Winmill ruled Wednesday that keeping the migrants jailed without bond violated their due process rights, and he ordered that they be released while they wait for their immigration cases to be resolved. Many of them have lived in the U.S. for decades and lacked any criminal history, Winmill noted. Some are married to U.S. citizens or have children who are U.S. citizens, according to court documents.\n\nIn an e-mailed statement to The Associated Press, the Department of Homeland Security said Immigration and Customs Enforcement agents lawfully arrested the detainees during the raid, and added that “an activist judge is ordering lawbreakers to roam free.”\n\n“The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country,” the department said.\n\nThe Oct. 19 raid at the privately operated outdoor track in Wilder was led by the FBI as part of an investigation into suspected illegal gambling. More than 200 officers from at least 14 agencies, including U.S. Immigrations and Customs Enforcement and Border Patrol, participated in the raid, detaining around 400 people for hours, including many U.S. citizens.\n\nWitnesses described aggressive tactics, including zip-tying children or separating young kids from their parents for an hour or more. Homeland Security Secretary Kristi Noem, whose agency oversees Border Patrol and ICE, denied that children were zip-tied. FBI spokesperson Sandra Barker initially said no restraints or rubber bullets were used on children but later amended that statement, replacing “children” with “young children.”\n\nThe raid resulted in only a handful of gambling-related arrests, while 105 people were arrested on suspicion of immigration violations. Many of them signed voluntary agreements to leave the country before they were able to talk to immigration lawyers, said Nikki Ramirez-Smith, an immigration attorney whose firm is representing 15 of the people released this week.\n\nJust 18 people detained in the raid have sought their release in the federal courts in Idaho, according to online court records. One of them had that request initially dismissed after a judge found that they did not include enough detail in their court filing, but the judge also gave them 30 days to try again. Another person is now pursuing release through a different federal court after they were transferred to a detention facility in a different state.\n\nThe federal judge in Idaho said that nearly all of his colleagues who have faced similar requests from immigration detainees have come to the same conclusion: That non-citizens who are detained while already present in the United States are entitled to due process rights.\n\n“Treating the detention of noncitizens stopped at or near the border differently from noncitizens who reside within the country is not an anomaly. Instead, it reflects the long-recognized distinction in our immigration laws and the Constitution that due process protections apply to noncitizens residing within the country but not those stopped at or near the border,” Winmill wrote.\n\nRamirez-Smith said Winmill’s release orders do “a great job of putting into perspective what the issues are.”\n\n“They’ll just stay home with their families, and we’ll file the applications for relief in immigration court, and they’ll get a court hearing. Those trial dates will probably be years out,” she said, because of a hefty backlog of more than 3 million cases in immigration courts.\n\nStill, President Donald Trump has taken steps to reduce the backlog, instructing judges during his first term to deny entire categories of asylum claims such as for victims of gang or domestic violence.\n\nDuring his current term, the Trump administration has fired dozens of immigration judges, and authorized about 600 military lawyers to work as temporary immigration judges. The administration has also frequently turned what would normally be routine immigration hearings into deportation traps, with government lawyers quickly dismissing asylum cases so the migrants who sought asylum can be immediately arrested in the courthouse halls.","summary":"The raid at the outdoor track was part of an investigation into suspected illegal gambling.","url":"https://www.bostonherald.com/2025/11/20/immigration-gambling-raid/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/Immigration_Gambling_Raid_20626.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-21 00:49:22","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.244},{"id":381066628,"title":"Federal judge orders release of 16 migrants detained in Idaho raid, citing due process violations","text":"By REBECCA BOONE\n\nBOISE, Idaho (AP) — A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month.\n\nU.S. District Judge B. Lynn Winmill ruled Wednesday that keeping the migrants jailed without bond violated their due process rights, and he ordered that they be released while they wait for their immigration cases to be resolved. Many of them have lived in the U.S. for decades and lacked any criminal history, Winmill noted. Some are married to U.S. citizens or have children who are U.S. citizens, according to court documents.\n\nIn an e-mailed statement to The Associated Press, the Department of Homeland Security said Immigration and Customs Enforcement agents lawfully arrested the detainees during the raid, and added that “an activist judge is ordering lawbreakers to roam free.”\n\n“The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country,” the department said.\n\nThe Oct. 19 raid at the privately operated outdoor track in Wilder was led by the FBI as part of an investigation into suspected illegal gambling. More than 200 officers from at least 14 agencies, including U.S. Immigrations and Customs Enforcement and Border Patrol, participated in the raid, detaining around 400 people for hours, including many U.S. citizens.\n\nWitnesses described aggressive tactics, including zip-tying children or separating young kids from their parents for an hour or more. Homeland Security Secretary Kristi Noem, whose agency oversees Border Patrol and ICE, denied that children were zip-tied. FBI spokesperson Sandra Barker initially said no restraints or rubber bullets were used on children but later amended that statement, replacing “children” with “young children.”\n\nThe raid resulted in only a handful of gambling-related arrests, while 105 people were arrested on suspicion of immigration violations. Many of them signed voluntary agreements to leave the country before they were able to talk to immigration lawyers, said Nikki Ramirez-Smith, an immigration attorney whose firm is representing 15 of the people released this week.\n\nJust 18 people detained in the raid have sought their release in the federal courts in Idaho, according to online court records. One of them had that request initially dismissed after a judge found that they did not include enough detail in their court filing, but the judge also gave them 30 days to try again. Another person is now pursuing release through a different federal court after they were transferred to a detention facility in a different state.\n\nThe federal judge in Idaho said that nearly all of his colleagues who have faced similar requests from immigration detainees have come to the same conclusion: That non-citizens who are detained while already present in the United States are entitled to due process rights.\n\n“Treating the detention of noncitizens stopped at or near the border differently from noncitizens who reside within the country is not an anomaly. Instead, it reflects the long-recognized distinction in our immigration laws and the Constitution that due process protections apply to noncitizens residing within the country but not those stopped at or near the border,” Winmill wrote.\n\nRamirez-Smith said Winmill’s release orders do “a great job of putting into perspective what the issues are.”\n\n“They’ll just stay home with their families, and we’ll file the applications for relief in immigration court, and they’ll get a court hearing. Those trial dates will probably be years out,” she said, because of a hefty backlog of more than 3 million cases in immigration courts.\n\nStill, President Donald Trump has taken steps to reduce the backlog, instructing judges during his first term to deny entire categories of asylum claims such as for victims of gang or domestic violence.\n\nDuring his current term, the Trump administration has fired dozens of immigration judges, and authorized about 600 military lawyers to work as temporary immigration judges. The administration has also frequently turned what would normally be routine immigration hearings into deportation traps, with government lawyers quickly dismissing asylum cases so the migrants who sought asylum can be immediately arrested in the courthouse halls.","url":"https://www.courant.com/2025/11/20/immigration-gambling-raid/","image":"https://www.courant.com/wp-content/uploads/2025/11/Immigration_Gambling_Raid_20626.jpg?w=1024&h=682","video":null,"publish_date":"2025-11-21 00:49:22","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"us","sentiment":-0.244},{"id":381066512,"title":"Federal judge orders release of 16 migrants detained in Idaho raid, citing due process violations","text":"By REBECCA BOONE\n\nBOISE, Idaho (AP) — A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month.\n\nU.S. District Judge B. Lynn Winmill ruled Wednesday that keeping the migrants jailed without bond violated their due process rights, and he ordered that they be released while they wait for their immigration cases to be resolved. Many of them have lived in the U.S. for decades and lacked any criminal history, Winmill noted. Some are married to U.S. citizens or have children who are U.S. citizens, according to court documents.\n\nIn an e-mailed statement to The Associated Press, the Department of Homeland Security said Immigration and Customs Enforcement agents lawfully arrested the detainees during the raid, and added that “an activist judge is ordering lawbreakers to roam free.”\n\n“The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country,” the department said.\n\nThe Oct. 19 raid at the privately operated outdoor track in Wilder was led by the FBI as part of an investigation into suspected illegal gambling. More than 200 officers from at least 14 agencies, including U.S. Immigrations and Customs Enforcement and Border Patrol, participated in the raid, detaining around 400 people for hours, including many U.S. citizens.\n\nWitnesses described aggressive tactics, including zip-tying children or separating young kids from their parents for an hour or more. Homeland Security Secretary Kristi Noem, whose agency oversees Border Patrol and ICE, denied that children were zip-tied. FBI spokesperson Sandra Barker initially said no restraints or rubber bullets were used on children but later amended that statement, replacing “children” with “young children.”\n\nThe raid resulted in only a handful of gambling-related arrests, while 105 people were arrested on suspicion of immigration violations. Many of them signed voluntary agreements to leave the country before they were able to talk to immigration lawyers, said Nikki Ramirez-Smith, an immigration attorney whose firm is representing 15 of the people released this week.\n\nJust 18 people detained in the raid have sought their release in the federal courts in Idaho, according to online court records. One of them had that request initially dismissed after a judge found that they did not include enough detail in their court filing, but the judge also gave them 30 days to try again. Another person is now pursuing release through a different federal court after they were transferred to a detention facility in a different state.\n\nThe federal judge in Idaho said that nearly all of his colleagues who have faced similar requests from immigration detainees have come to the same conclusion: That non-citizens who are detained while already present in the United States are entitled to due process rights.\n\n“Treating the detention of noncitizens stopped at or near the border differently from noncitizens who reside within the country is not an anomaly. Instead, it reflects the long-recognized distinction in our immigration laws and the Constitution that due process protections apply to noncitizens residing within the country but not those stopped at or near the border,” Winmill wrote.\n\nRamirez-Smith said Winmill’s release orders do “a great job of putting into perspective what the issues are.”\n\n“They’ll just stay home with their families, and we’ll file the applications for relief in immigration court, and they’ll get a court hearing. Those trial dates will probably be years out,” she said, because of a hefty backlog of more than 3 million cases in immigration courts.\n\nStill, President Donald Trump has taken steps to reduce the backlog, instructing judges during his first term to deny entire categories of asylum claims such as for victims of gang or domestic violence.\n\nDuring his current term, the Trump administration has fired dozens of immigration judges, and authorized about 600 military lawyers to work as temporary immigration judges. The administration has also frequently turned what would normally be routine immigration hearings into deportation traps, with government lawyers quickly dismissing asylum cases so the migrants who sought asylum can be immediately arrested in the courthouse halls.","summary":"The raid at the outdoor track was part of an investigation into suspected illegal gambling.","url":"https://www.ocregister.com/2025/11/20/immigration-gambling-raid/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/Immigration_Gambling_Raid_20626.jpg?w=150&strip=all","video":null,"publish_date":"2025-11-21 00:49:22","author":"Associated Press,Gqlshare","authors":["Associated Press","Gqlshare"],"language":"en","category":"politics","source_country":"US","sentiment":-0.244},{"id":381066748,"title":"Asian stocks sink as US jobs fail to clear rate outlook, tech hammered","text":"(Corrects typographical error in headline)\n\nBy Stella Qiu\n\nSYDNEY :Asian shares extended a global rout on Friday as the much anticipated U.S. jobs data failed to provide clarity on interest rates, with investors returning to dumping riskier assets even after Nvidia's earnings dazzled. \n\nJapan's Nikkei tumbled 2 per cent on Friday, Australia's resources-heavy shares slid 1.4 per cent, while South Korea plunged almost 4 per cent.\n\nWall Street dived overnight as jitters over inflated tech stock prices returned after temporary relief from Nvidia's stellar forecasts, resulting in the Nasdaq's widest one-day swing since April 9 when President Donald Trump's \"Liberation Day\" tariffs spooked markets. \n\nData showed the U.S. economy added more jobs than expected in September, but a rise in the unemployment rate and downward revisions to prior months painted an ambiguous picture for the Federal Reserve as it considers whether a cut in interest rates is needed next month to bolster the labor market.\n\nTreasury yields fell as futures moved to imply a 40 per cent probability of a U.S. rate cut in December, up from 30 per cent a day earlier, but still not enough to convince investors of a December move, with the next payrolls numbers available only after the Fed meeting.\n\n\"The markets had plenty to be positive about and initially Nvidia’s banging quarterly results meant Wall Street burst out of the gates. The U.S. jobs data was probably as good as you could have hoped for too,\" said Kyle Rodda, a senior analyst at Capital.com.\n\n\"However, the momentum simply was not there to carry the rally through, with the passing of two critical risk events – both with positive outcomes, no less – not enough to kill the bearishness gripping the markets currently.\"\n\nThere are now more concerns about financial market stability among Fed officials, including the potential for a sharp drop in asset prices, as they debate when and even whether to cut interest rates further.\n\nCleveland Fed President Beth Hammack warned on Thursday that cutting rates further right now carries a wide range of risks for the economy. Fed Governor Lisa Cook sees a risk of outsized asset price declines. \n\nIn the currency markets, the dollar jumped on the risk-sensitive commodity currencies, hitting a three-month high on the Aussie and a fresh seven-month top on the kiwi. \n\nIt was steady at 157.50 yen, after scaling a new 10-month peak of 157.9 overnight, as traders stayed on high alert for intervention from Japanese authorities given the yen's recent rapid fall. \n\nData showed Japan's core consumer prices rose 3 per cent in October, keeping alive expectations of a near-term interest rate hike. However, prospects of economic stimulus from Japan's new government, led by Prime Minister Sanae Takaichi, have undermined the yen. \n\nThe government is set to unveil an economic stimulus package worth over 20 trillion yen, the biggest since COVID-19, on Friday.\n\nTreasuries rose overnight as investors raised bets for a Fed cut next month. Two-year Treasury yields slipped 1 basis point to 3.545 per cent, having fallen 4 basis points overnight, while the 10-year yield was steady at 4.092 per cent, after easing 3 bps overnight.\n\nOil prices fell in early trade. U.S. West Texas Intermediate crude dropped 0.9 per cent to $58.47, and was down 2.7 per cent this week.\n\nSpot gold prices were flat at $4,077 per ounce, having been little moved overnight.","summary":"","url":"https://www.channelnewsasia.com/business/asian-stocks-sink-us-jobs-fail-clear-rate-outlook-tech-hammered-5481556","image":"https://dam.mediacorp.sg/image/upload/s--tp_rgnzA--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2025-11-21T011105Z_1_LYNXMPELAK01Y_RTROPTP_3_CHINA-STOCKS-CLOSE.JPG?itok","video":null,"publish_date":"2025-11-21 00:47:59","author":null,"language":"en","category":"politics","source_country":"sg","sentiment":-0.246},{"id":381066036,"title":"Federal judges uphold several North Carolina US House districts drawn by Republicans","text":"By GARY D. ROBERTSON\n\nRALEIGH, N.C. (AP) — Federal judges on Thursday upheld several U.S. House districts that North Carolina Republicans drew in 2023 that helped the GOP gain additional seats the following year. They rejected accusations the lines unlawfully fractured and packed Black voters to weaken their voting power. \n\nThe order by three judges — all of whom were nominated to the bench by GOP presidents — didn’t rule on changes made last month to the 1st Congressional District that are designed to unseat Democratic Rep. Don Davis in 2026. \n\nThat alteration, completed at the urging of President Donald Trump as part of an ongoing national mid-decade redistricting fray, is still being considered by the panel. The judges heard arguments in Winston-Salem but didn’t immediately rule on whether they would block now the use of the 1st District and the adjoining 3rd District for next year’s election while more legal arguments are made. Candidate filing for the 2026 elections is set to begin Dec. 1. \n\nMany allegations made by the state NAACP, Common Cause and voters cover both 2023 and 2025 changes, in particular claims of voter dilution and racial discrimination violating the U.S. Constitution and Voting Rights Act. \n\nThe 2023 map turned a 7-7 North Carolina delegation into one in which Republicans won 10 of the 14 seats in 2024. Three Democrats chose not to seek reelection, saying it was essentially impossible to get reelected under the recast lines.\n\nThursday’s ruling by 4th U.S. Circuit Court of Appeals Judge Allison Rushing and District Judges Thomas Schroeder and Richard Myers rejected claims that GOP legislators drew lines in 2023 so skewed for Republicans that many Black voters could not elect their preferred candidates.\n\n“We conclude that the General Assembly did not violate the Constitution or the VRA in its 2023 redistricting,” they wrote in a 181-page order. \n\nThe judges convened a trial several months ago hearing testimony for a pair of lawsuits that challenged portions of maps redrawn in 2023. Thursday’s decision focused on five congressional districts: three in the Greensboro region and two in and around Charlotte, as well as three state Senate districts. The judges also upheld the Senate districts.\n\nThe plaintiffs argued Republicans split and weakened the Greensboro region’s concentrated Black voting population within multiple U.S. House districts. Then-Rep. Kathy Manning, a Greensboro Democrat, decided not to run again last year because her district shifted to the right. They also cited what they called packing Black voting-age residents into a Charlotte-area congressional district that helped Republican Tim Moore win an adjoining district.\n\nAttorneys for Republican leaders argued that lawfully partisan — and not racial — considerations helped inform decision-making on the 2023 map. They pointed out that no information on the racial makeup of regions were used in drawing the lines. A 2019 U.S. Supreme Court decision essentially neutered legal claims of illegal partisan gerrymandering going forward.\n\nThe judges’ order favoring the GOP lawmakers said “the circumstances surrounding the plans’ enactment and the resulting district configurations and composition are consistent with the General Assembly’s non-racial motivations, which included traditional districting criteria, North Carolina law, and partisan performance.”\n\nThe ruling can be appealed to the U.S. Supreme Court. Spokespeople for Republican legislative attorneys didn’t immediately respond late Thursday to requests for comment. A lawyers group representing the state NAACP and others said it was disappointed with the ruling.\n\nStill at issue are the changes made to the 1st and 3rd Districts that GOP legislators said are designed to create an 11-3 seat majority in 2026. Davis continues a line of Black representatives elected from the 1st District going back more than 30 years. But he won his second term by less than 2 percentage points. \n\nNorth Carolina is among several states where Trump has pushed for mid-decade map changes ahead of the 2026 elections. This week, a federal court blocked Texas from using a GOP-engineered map.","summary":"By GARY D. ROBERTSON RALEIGH, N.C. (AP) &#8212; Federal judges on Thursday upheld several U.S. House districts that North Carolina Republicans drew in 2023 that helped the GOP gain additional seats the following year. They rejected accusations the lines unlawfully fractured and packed Black voters to weaken their voting power. The order by three judges [&#8230;]","url":"https://www.bostonherald.com/2025/11/20/federal-judges-uphold-several-north-carolina-us-house-districts-drawn-by-republicans/","image":"https://www.bostonherald.com/wp-content/uploads/2025/11/Election_2026-Redistricting_North_Carolina_44641-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-21 00:46:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.26},{"id":381066514,"title":"Federal judges uphold several North Carolina US House districts drawn by Republicans","text":"By GARY D. ROBERTSON\n\nRALEIGH, N.C. (AP) — Federal judges on Thursday upheld several U.S. House districts that North Carolina Republicans drew in 2023 that helped the GOP gain additional seats the following year. They rejected accusations the lines unlawfully fractured and packed Black voters to weaken their voting power. \n\nThe order by three judges — all of whom were nominated to the bench by GOP presidents — didn’t rule on changes made last month to the 1st Congressional District that are designed to unseat Democratic Rep. Don Davis in 2026. \n\nThat alteration, completed at the urging of President Donald Trump as part of an ongoing national mid-decade redistricting fray, is still being considered by the panel. The judges heard arguments in Winston-Salem but didn’t immediately rule on whether they would block now the use of the 1st District and the adjoining 3rd District for next year’s election while more legal arguments are made. Candidate filing for the 2026 elections is set to begin Dec. 1. \n\nMany allegations made by the state NAACP, Common Cause and voters cover both 2023 and 2025 changes, in particular claims of voter dilution and racial discrimination violating the U.S. Constitution and Voting Rights Act. \n\nThe 2023 map turned a 7-7 North Carolina delegation into one in which Republicans won 10 of the 14 seats in 2024. Three Democrats chose not to seek reelection, saying it was essentially impossible to get reelected under the recast lines.\n\nThursday’s ruling by 4th U.S. Circuit Court of Appeals Judge Allison Rushing and District Judges Thomas Schroeder and Richard Myers rejected claims that GOP legislators drew lines in 2023 so skewed for Republicans that many Black voters could not elect their preferred candidates.\n\n“We conclude that the General Assembly did not violate the Constitution or the VRA in its 2023 redistricting,” they wrote in a 181-page order. \n\nThe judges convened a trial several months ago hearing testimony for a pair of lawsuits that challenged portions of maps redrawn in 2023. Thursday’s decision focused on five congressional districts: three in the Greensboro region and two in and around Charlotte, as well as three state Senate districts. The judges also upheld the Senate districts.\n\nThe plaintiffs argued Republicans split and weakened the Greensboro region’s concentrated Black voting population within multiple U.S. House districts. Then-Rep. Kathy Manning, a Greensboro Democrat, decided not to run again last year because her district shifted to the right. They also cited what they called packing Black voting-age residents into a Charlotte-area congressional district that helped Republican Tim Moore win an adjoining district.\n\nAttorneys for Republican leaders argued that lawfully partisan — and not racial — considerations helped inform decision-making on the 2023 map. They pointed out that no information on the racial makeup of regions were used in drawing the lines. A 2019 U.S. Supreme Court decision essentially neutered legal claims of illegal partisan gerrymandering going forward.\n\nThe judges’ order favoring the GOP lawmakers said “the circumstances surrounding the plans’ enactment and the resulting district configurations and composition are consistent with the General Assembly’s non-racial motivations, which included traditional districting criteria, North Carolina law, and partisan performance.”\n\nThe ruling can be appealed to the U.S. Supreme Court. Spokespeople for Republican legislative attorneys didn’t immediately respond late Thursday to requests for comment. A lawyers group representing the state NAACP and others said it was disappointed with the ruling.\n\nStill at issue are the changes made to the 1st and 3rd Districts that GOP legislators said are designed to create an 11-3 seat majority in 2026. Davis continues a line of Black representatives elected from the 1st District going back more than 30 years. But he won his second term by less than 2 percentage points. \n\nNorth Carolina is among several states where Trump has pushed for mid-decade map changes ahead of the 2026 elections. This week, a federal court blocked Texas from using a GOP-engineered map.","summary":"By GARY D. ROBERTSON RALEIGH, N.C. (AP) &#8212; Federal judges on Thursday upheld several U.S. House districts that North Carolina Republicans drew in 2023 that helped the GOP gain additional seats the following year. They rejected accusations the lines unlawfully fractured and packed Black voters to weaken their voting power. The order by three judges [&#8230;]","url":"https://www.ocregister.com/2025/11/20/federal-judges-uphold-several-north-carolina-us-house-districts-drawn-by-republicans/","image":"https://www.ocregister.com/wp-content/uploads/2025/11/Election_2026-Redistricting_North_Carolina_44641-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-11-21 00:46:38","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":-0.26},{"id":381064818,"title":"\"We have a Communist coming\": White House ahead of Trump-Mamdani meet","text":"Washington, DC [US], November 21 (ANI): White House Press Secretary Karoline Leavitt on Thursday (local time) said that President Donald Trump is willing to “meet anyone” and try to do “what is right” on behalf of the American people, as New York City mayor-elect Zohran Mamdani is set to meet Trump in the Oval Office, at the White House, on Friday.Trump described Mamdani as a “communist”“… The President issued a statement that the Mayor-elect will be coming to the Oval Office tomorrow, so our teams are arranging those details… It speaks volumes that tomorrow we have a Communist coming to the White House, because that’s who the Democrat Party elected as the Mayor of the largest city in the country,” Leavitt told reporters during a briefing.The White House Press Secretary claimed that New York City is turning much more “Left” than the President even anticipated.“It’s very telling but it also speaks to the fact that President Trump is willing to meet with anyone and talk to anyone and try to do what’s right on behalf of the American people, whether they live in blue states or red states or blue cities and the city which is becoming much more Left than the President ever anticipated in his many years of living in New York himself,” she added.Earlier on Wednesday (local time), US President Donald Trump announced that New York City’s mayor-elect, Zohran “Kwame” Mamdani, is scheduled to meet him at the Oval Office on Friday.In a Truth Social post, Trump wrote, “Communist Mayor of New York City, Zohran ‘Kwame’ Mamdani, has asked for a meeting. We have agreed that this meeting will take place at the Oval Office on Friday, November 21st. Further details to follow!” The announcement follows months of sharp public exchanges between the two.According to The New York Times, Mamdani’s team recently reached out to the White House to seek a meeting focused on New York’s affordability crisis, signalling a shift in tone after their confrontational campaign season.During his campaign, Mamdani had described Trump as a threat to democracy and said he alone had the “backbone” to challenge him. (ANI)","summary":"","url":"https://www.news18.com/agency-feeds/we-have-a-communist-coming-white-house-ahead-of-trump-mamdani-meet-9721856.html","image":"https://images.news18.com/ibnlive/uploads/2025/05/News18_India_Section_Default_Image_1600x900-2025-05-b4faf46d67a95708181b01e36cf20c4b.jpg","video":null,"publish_date":"2025-11-21 00:45:02","author":"News18","authors":["News18"],"language":"en","category":"politics","source_country":"in","sentiment":-0.156},{"id":381065660,"title":"Trump floats death penalty for 'seditious' Democrats","text":"WASHINGTON: US President Donald Trump suggested on Thursday that Democratic lawmakers who urged the military to refuse illegal orders could be executed, calling them traitors and accusing them of \"seditious behavior.\"\n\nDemocrats immediately slammed Trump's \"absolutely vile\" threats against the six senators and representatives, who made the comments in a video posted on X on Tuesday.\n\n\"This is really bad, and Dangerous to our Country. Their words cannot be allowed to stand. SEDITIOUS BEHAVIOR FROM TRAITORS!!! LOCK THEM UP???\" Trump said on Truth Social.\n\nHe then added in a later post: \"SEDITIOUS BEHAVIOR, punishable by DEATH!\"\n\nThe 79-year-old also reposted a message from a user urging him to \"hang them\" and saying that the first US president, George Washington, would have done the same.\n\nThe Democratic lawmakers all have backgrounds in the military or intelligence services and included Senator Mark Kelly, a former member of the Navy and NASA astronaut, and Senator Elissa Slotkin, who served with the CIA in Iraq.\n\n\"You can refuse illegal orders,\" they said in the video, accusing Trump of \"pitting our uniformed military and intelligence community professionals against American citizens.\"\n\nThey did not specify which orders they were referring to, but Trump has ordered the National Guard into multiple US cities, in many cases against the wishes of local officials, in a bid to bring allegedly rampant unrest under control.\n\nAbroad, Trump has ordered strikes on a series of alleged drug-smuggling vessels in the Caribbean Sea and eastern Pacific Ocean that have left more than 80 people dead and which experts say are illegal.\n\n- 'Lighting a match' -\n\nWhite House Press Secretary Karoline Leavitt later walked back Trump's suggestion, saying that the president did not want to see members of Congress executed.\n\nShe still lashed out at the lawmakers, saying: \"Why aren't you talking about what these members of Congress are doing to encourage and incite violence?\"\n\nThe Democratic Party reacted furiously to Trump's remarks.\n\n\"Trump just called for the death of Democratic elected officials. Absolutely vile,\" the party posted on its official X account.\n\nThe lawmakers in the video vowed not to be deterred by Trump's threats, saying they were \"veterans and national security professionals who love this country\" and had sworn an oath to defend the US constitution.\n\n\"That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation,\" they said.\n\nDemocratic Senate Minority Leader Chuck Schumer accused Trump of fanning the flames of violence among his supporters.\n\n\"He is lighting a match in a country soaked with political gasoline,\" Schumer said in a speech on the Senate floor.\n\nTrump previously evoked the death penalty in 2023 in relation to his former top US military officer Mark Milley, who became an outspoken critic of the president.\n\nAfter Milley told journalist Bob Woodward that he had secretly called his Chinese counterpart amid tensions after Trump supporters stormed the US Capitol in January 2021, Trump said \"in times gone by, the punishment would have been DEATH!\"\n\nTrump's death penalty comments came as he faces perhaps the most political pressure since his return to the White House in January.\n\nIn recent weeks his grip on the Republican party has been shaken by the scandal over disgraced financier Jeffrey Epstein, and by off-year elections in New York, New Jersey and Virginia in which Democrats scored major wins. - AFP","url":"https://www.thestar.com.my/news/world/2025/11/21/trump-floats-death-penalty-for-039seditious039-democrats","image":"https://apicms.thestar.com.my/uploads/images/2025/11/21/3632819.jpg","video":null,"publish_date":"2025-11-21 00:44:00","author":"The Star Online","authors":["The Star Online"],"language":"en","category":"politics","source_country":"my","sentiment":-0.119},{"id":381063842,"title":"US plan for Ukraine war would cede territory to Russia","text":"US President Donald Trump&apos;s plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv&apos;s military, according to a draft proposal obtained by The Associated Press. The proposal would also prevent the future expansion of NATO, a significant victory for Moscow, which views the alliance as a potential threat. In addition, $US100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine. There would also be a path to reintegrating Russia in the global economy, including the future lifting of sanctions. The country would also return to what was formerly known as the Group of 8, which includes many of the world&apos;s biggest economies. According to a person familiar with the matter, the emerging framework includes promises from Moscow that it will make no further attacks, something White House officials view as a concession by Russian President Vladimir Putin. He has repeatedly justified the war by claiming Ukraine was a state created artificially by Soviet leaders. The framework also includes economic incentives for both sides. Earlier, Ukrainian President Volodymyr Zelenskiy pledged to work with Washington and expected to discuss the plan with Trump in coming days. But Zelenskiy, whose office said he had received a draft, said after meeting US Army Secretary Daniel Driscoll in Kyiv that Ukraine and Washington would work together on elements of it. \"Our teams - Ukraine and the USA - will work on the points of the plan to end the war,\" Zelenskiy wrote on Telegram. \"We are ready for constructive, honest and prompt work.\" Zelenskiy&apos;s office did not comment directly on the content of the 28-point plan, which has not been published, but said he had \"outlined the fundamental principles that matter to our people\". \"In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,\" it said. White House Press Secretary Karoline Leavitt told a news briefing that Secretary of State Marco Rubio and US special envoy Steve Witkoff had been quietly working on the plan for about a month and Trump supports the plan. She said the US engaged equally with the Ukrainians and the Russians on the text. Zelenskiy&apos;s office said Driscoll had presented him with the plan only on Thursday, and several sources told Reuters and other media outlets that the plan was the fruit of backchannel conversations between Witkoff and Kirill Dmitriev, the special envoy of Putin. In a message on X, Rubio said the US \"will continue to develop a list of potential ideas for ending this war based on input from both sides of this conflict\" and that peace will require concessions from both Kyiv and Moscow. The acceleration in US diplomacy comes at an awkward time for Kyiv, with its troops on the back foot on the battlefield and Zelenskiy&apos;s government undermined by a corruption scandal. Moscow played down any new US initiative. \"Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,\" Kremlin spokesman Dmitry Peskov said. He said Russia had nothing to add beyond the position Putin laid out at a summit with Trump in August, adding that any peace deal must address the \"root causes of the conflict\", a phrase Moscow has long used to refer to its demands. With another winter approaching in the nearly four-year-old war, Russian troops occupy almost one-fifth of Ukraine and are slowly advancing while bombarding Ukrainian energy supplies and cities as the cold winter sets in. with DPA and AP Australian Associated Press","url":"https://www.goulburnpost.com.au/story/9116703/us-plan-for-ukraine-war-would-cede-territory-to-russia/","image":"/images/transform/v1/crop/frm/silverstone-feed-data/549bc400-12ed-4032-83d2-e02ab3ec5f01.jpg/r0_0_800_600_w800_h600_fmax.jpg","video":null,"publish_date":"2025-11-21 00:42:38","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"au","sentiment":-0.085},{"id":381014844,"title":"Derek Walcott Library added to UNESCO world register","text":"Latest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\nLatest News\n\nInternational News\n\nNorth & East\n\nEnvironment\n\nSocial Love\n\nHorse Racing\n\nWorld Champs\n\nCommonwealth Games\n\nFIFA World Cup 2022\n\nEntertainment\n\nArt & Culture\n\nTuesday Style\n\nFood Awards\n\nJOL Takes Style Out\n\nDesign Week JA\n\nBlack Friday\n\nRelationships\n\nClassifieds\n\nMotor Vehicles\n\nPlace an Ad\n\nJobs & Careers\n\nStudy Centre\n\nJnr Study Centre\n\nAdvertorial\n\nSupplements\n\n\n\n\n\n\n\nInternational News\n\nFood Awards\n\nEntertainment\n\nWorld Champs\n\nCareer & Education\n\nEnvironment\n\nAdvertorial\n\nSupplements\n\nClassifieds\n\nDesign Week\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDerek Walcott (Photo: CMC) \n\n Latest News, Regional \n\nNovember 20, 2025\n\n\n\n\n Derek Walcott Library added to UNESCO world register \n\n\n\n\n\n\n\nCASTRIES, St Lucia (CMC) — The Derek Walcott Library at the Sir Arthur Lewis Community College in St Lucia has been officially inscribed on the United Nations Educational, Scientific and Cultural Organisation (UNESCO) Memory of the World Regional Register for Latin America and the Caribbean.\n\nThe announcement was made during the programme’s annual regional meeting held recently in Lima and Cusco, Peru.\n\nOut of 71 nominations from 15 countries, 29 were approved, including the submission for the Derek Walcott Library.\n\nThe Memory of the World Programme safeguards documentary heritage that is at risk of being forgotten, damaged or lost. The inscription recognises the cultural, historical and literary value of Sir Derek Alton Walcott’s personal collection, which offers a rare, intimate look into the mind and influences of the Nobel Laureate.\n\nThe Derek Walcott Library brings together Sir Derek’s original bookshelves: works he authored, titles gifted by peers and collaborators, and a broad range of materials that reflect his engagement with Caribbean literature, art, theatre, history and world cultures.\n\nThe collection, donated to the college in 2020 by Sigrid Nama, stands as a preserved record of Walcott’s creative world and the wider literary conversations that shaped him.\n\nThe Saint Lucia National Commission for UNESCO also acknowledged Kathy Birch-McDiarmed, head librarian of the Hunter J Francois Library, who now serves as vice president of the Memory of the World Committee for Latin America and the Caribbean.\n\nHer continued work supports the protection and promotion of documentary heritage across the region.\n\nThe commission says the inscription reinforces the importance of preserving the Derek Walcott Library and the literary memory it holds for the Caribbean and beyond.\n\n\n\n\n\n\n\n\nTags: Derek Walcott Library Scientific and Cultural Organisation St Lucia United Nations Educational \n\n\n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n0 Comments · Make a comment\n\n\n\n\n ALSO ON JAMAICA OBSERVER\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n EOJ suspends replacement ID card fees following Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica —The Electoral Office of Jamaica (EOJ) says it has suspended the fee for registered electors to replace their Voter ID card, followi... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness, Latest News \n\n\n\n\n\n\n\n\n\n AWE Summit marks Global Entrepreneurship Week with road to recovery focus \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n In celebration of Global Entrepreneurship Week, the Youth-For-Development Network (YFDN), in partnership with the Academy for Women Entrepreneurs (AWE... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nInternational News, Latest News \n\n\n\n\n\n\n\n\n\n Trump floats death penalty for ‘seditious’ Democrats \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n WASHINGTON, United States (AFP)—US President Donald Trump on Thursday evoked the death penalty for Democratic lawmakers who urged the military to refu... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Voters’ list publication delayed to December 20 due to Hurricane Melissa \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica — The Electoral Office of Jamaica (EOJ) has pushed back the release of the upcoming voters’ list from November 30, 2025 to December ... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Child dies after JUTC bus incident in Vineyard Town; police probe underway \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST CATHERINE, Jamaica — The Jamaica Urban Transit Company (JUTC) has confirmed that one of its buses was involved in a fatal incident in Vineyard Town... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Accused phone thief claims he was trying to fund mother’s eye surgery \n\n\n\n\n\n\n\nNovember 20, 2025 \n\n\n ST JAMES, Jamaica — A man who was hauled before the court for allegedly stealing three phones has painted himself as a concerned son who was simply tr... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\nLatest News, News \n\n\n\n\n\n\n\n\n\n Dunbeholden FC brings hope to Russia, Westmoreland \n\n\n\n\n BY KEDIESHA PERRY Observer writer \n\n\n\nNovember 20, 2025 \n\n\n KINGSTON, Jamaica — The Dunbeholden Football Club joined in relief efforts to help those affected in the western region of the island on Sunday. Membe... \n\n\n\n\n {\"jamaica-observer\":\"Jamaica Observer\"} \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOUSE RULES\n\n\n\nWe welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. \n\nPlease understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. \n\nWe ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. \n\nPlease do not write in block capitals since this makes your comment hard to read. \n\nPlease don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com. \n\nIf readers wish to report offensive comments, suggest a correction or share a story then please email:community@jamaicaobserver.com. \n\nLastly, read our Terms and Conditions and Privacy Policy \n\n\n\n\n\n\n Recent Posts\n\n\n\n\n Archives\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlease enable JavaScript to view the poll powered by Disqus.\n\n\n\n\n\n\n\n\n Recent Posts\n\n\n\n\n\n\n\n\n \n\n\n\n\n Archives\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBreaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean\n\n\n\n\nFeatured Tags\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntertainment\n\n\n\nEntertainment\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJamaica Observer,© All Rights Reserved\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrivacy Policy\n\n\nEditorial Code of Conduct","url":"https://www.jamaicaobserver.com/2025/11/20/derek-walcott-library-added-unesco-world-register/","image":"https://www.jamaicaobserver.com/jamaicaobserver/news/wp-content/uploads/sites/4/2025/11/Derek-walcott.jpg","video":null,"publish_date":"2025-11-21 00:42:20","author":null,"language":"en","source_country":"jm","sentiment":0.68},{"id":381062948,"title":"Trump Plan To End Ukraine War Would Cede Territory To Russia","text":"WASHINGTON (AP) — President Donald Trump’s plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv’s military, according to a draft proposal obtained Thursday by The Associated Press.\n\nWashington and Moscow worked together on the draft, which Ukrainian President Volodymyr Zelenskyy discussed with a U.S. representative Thursday. If enacted, it would resolve a conflict that began nearly four years ago by requiring significant concessions from Kyiv and European leaders.\n\nFor example, the proposal would not only bar Ukraine from joining NATO but would also prevent the alliance’s future expansion. Such a step would be a significant victory for Moscow, which views NATO as a threat.\n\nRussian President Vladimir Putin would also gain ground that he has been unable to win on the battlefield. Under the draft, Moscow would hold all the eastern Donbas region, even though approximately 14% still remains in Ukrainian hands.\n\nThere would be a path to lifting sanctions on Russia and returning the country to what was formerly known as the Group of 8, which includes many of the world’s biggest economies.\n\nRussia would commit to making no future attacks, something the White House views as a concession. In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine.\n\nHowever, handing over territory to Russia would be deeply unpopular in Ukraine. It also would be illegal under Ukraine’s constitution. Zelenskyy has repeatedly ruled out such a possibility.\n\nSecretary of State Marco Rubio and U.S. special envoy Steve Witkoff have been quietly working on the peace plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House press secretary Karoline Leavitt said Thursday. Witkoff and Kirill Dmitriev, a close adviser to Putin, have been key to drafting the proposal.\n\nIn other developments, Russia’s chief military officer, Gen. Valery Gerasimov, announced that Moscow’s forces had taken full control of Kupiansk in Ukraine’s Kharkiv region, although he also said some Ukrainian troops remained in the city.\n\nThe general staff for Ukraine’s armed forces denied Gerasimov’s claims and said Kyiv’s forces remained in control of Kupiansk.\n\nMadhani reported from Washington. Associated Press journalists Sam McNeil in Brussels, Samya Kullab in Kyiv and Katie Marie Davies in Manchester, England, contributed to this report.\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine","url":"https://www.huffpost.com/entry/russia-ukraine-war-trump_n_691fb3bae4b044849523b14a?origin=home-politics-feed-unit","image":"https://img.huffingtonpost.com/asset/691fb4a8170000ce859c65b8.jpeg?cache=w7TwjnkIx3&ops=1778_1000","video":null,"publish_date":"2025-11-21 00:40:03","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.17},{"id":381062946,"title":"Trump Plan To End Ukraine War Would Cede Territory To Russia","text":"WASHINGTON (AP) — President Donald Trump’s plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv’s military, according to a draft proposal obtained Thursday by The Associated Press.\n\nWashington and Moscow worked together on the draft, which Ukrainian President Volodymyr Zelenskyy discussed with a U.S. representative Thursday. If enacted, it would resolve a conflict that began nearly four years ago by requiring significant concessions from Kyiv and European leaders.\n\nFor example, the proposal would not only bar Ukraine from joining NATO but would also prevent the alliance’s future expansion. Such a step would be a significant victory for Moscow, which views NATO as a threat.\n\nRussian President Vladimir Putin would also gain ground that he has been unable to win on the battlefield. Under the draft, Moscow would hold all the eastern Donbas region, even though approximately 14% still remains in Ukrainian hands.\n\nThere would be a path to lifting sanctions on Russia and returning the country to what was formerly known as the Group of 8, which includes many of the world’s biggest economies.\n\nRussia would commit to making no future attacks, something the White House views as a concession. In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine.\n\nHowever, handing over territory to Russia would be deeply unpopular in Ukraine. It also would be illegal under Ukraine’s constitution. Zelenskyy has repeatedly ruled out such a possibility.\n\nSecretary of State Marco Rubio and U.S. special envoy Steve Witkoff have been quietly working on the peace plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House press secretary Karoline Leavitt said Thursday. Witkoff and Kirill Dmitriev, a close adviser to Putin, have been key to drafting the proposal.\n\nIn other developments, Russia’s chief military officer, Gen. Valery Gerasimov, announced that Moscow’s forces had taken full control of Kupiansk in Ukraine’s Kharkiv region, although he also said some Ukrainian troops remained in the city.\n\nThe general staff for Ukraine’s armed forces denied Gerasimov’s claims and said Kyiv’s forces remained in control of Kupiansk.\n\nMadhani reported from Washington. Associated Press journalists Sam McNeil in Brussels, Samya Kullab in Kyiv and Katie Marie Davies in Manchester, England, contributed to this report.\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine","url":"https://www.huffpost.com/entry/russia-ukraine-war-trump_n_691fb3bae4b044849523b14a?origin=home-whats-happening-unit","image":"https://img.huffingtonpost.com/asset/691fb4a8170000ce859c65b8.jpeg?cache=w7TwjnkIx3&ops=1778_1000","video":null,"publish_date":"2025-11-21 00:40:03","author":null,"language":"en","category":"politics","source_country":"au","sentiment":-0.17},{"id":381061438,"title":"‘Punishable by death’: Trump suggests ‘seditious’ Democrats should be executed","text":"US President Donald Trump on Thursday accused half a dozen Democratic lawmakers of sedition “punishable by DEATH” after the lawmakers - all veterans of the armed services and intelligence community - called on US military members to uphold the Constitution and defy “illegal orders”.\nThe 90-second video was first posted early Tuesday from Senator Elissa Slotkin’s X account. In it, the six lawmakers - Slotkin, Arizona Senator Mark Kelly, and Representatives Jason Crow, Chris Deluzio, Maggie Goodlander and Chrissy Houlahan - speak directly to US service members, whom Slotkin acknowledges are “under enormous stress and pressure right now”.\n“The American people need you to stand up for our laws and our Constitution,” Slotkin wrote in the X post. Along with the Michigan senator, the other lawmakers appearing in the video are seen as possible future aspirants for higher office, who now, thanks to the video’s wide exposure, have elevated their own political profiles.\nTrump on Thursday reposted messages from others about the video, amplifying it with his own words. It marked another flashpoint in the political rhetoric that at times has been thematic in his administrations, as well as among some in his Maga base. Some Democrats accused him of acting like a king and trying to distract from the soon-to-be-released files about disgraced financier and sexual abuser Jeffrey Epstein.\n\nEarlier this morning, President Trump threatened me and a group of service and veteran Members of Congress with arrest, trial, and death by hanging.\nHere’s my response: pic.twitter.com/jIZYrQTlP7\n— Sen. Elissa Slotkin (@SenatorSlotkin) November 20, 2025\n\nWith pieces of dialogue spliced together from different members, the lawmakers introduce themselves and their background. They go on to say the Trump administration “is pitting our uniformed military against American citizens”. They call for service members to “refuse illegal orders” and “stand up for our laws”.\nThe lawmakers conclude the video by encouraging service members: “Don’t give up the ship”, a War of 1812-era phrase attributed to a US Navy captain’s dying command to his crew.\nAlthough the lawmakers did not mention specific circumstances in the video, its release comes as the Trump administration continues attempts at deployment of National Guard troops into US cities for various roles, although some have been pulled back, and others held up in court.\nTroops, especially uniformed commanders, have a specific obligation to reject an order that’s unlawful, if they make that determination.\nHowever, while commanders have military lawyers on their staffs to consult with in helping make such a determination, rank-and-file troops who are tasked with carrying out those orders are rarely in a similar position.\nBroad legal precedence holds that just following orders, colloquially known as the “Nuremberg defence” as it was used unsuccessfully by senior Nazi officials to justify their actions under Adolf Hitler, does not absolve troops.\n\nHowever, the US military legal code, known as the Uniform Code of Military Justice or UCMJ, will punish troops for failing to follow an order should it turn out to be lawful. Troops can be criminally charged with Article 90 of the UCMJ, wilfully disobeying a superior commissioned officer, and Article 92, failure to obey an order.\nOn Thursday, Trump reposted to social media an article about the video, adding his own commentary that it was “really bad, and Dangerous to our Country”.\n“SEDITIOUS BEHAVIOR FROM TRAITORS!!!” Trump went on. “LOCK THEM UP???” He called for the lawmakers’ arrest and trial, adding in a separate post that it was “SEDITIOUS BEHAVIOR, punishable by DEATH.”\nTrump also reposted more than a dozen comments from other accounts criticizing Democrats, including one that stated: “HANG THEM GEORGE WASHINGTON WOULD !!”\nAsked during a White House briefing on Thursday about the intent of Trump’s messages, press secretary Karoline Leavitt instead honed in on the Democrats’ message, which she posited “perhaps is punishable by law”. Leavitt went on to say that any incitement to “defy the chain of command, not to follow lawful orders” is “a very dangerous thing for sitting members of Congress to do, and they should be held accountable, and that’s what the president wants to see”.\nDemocrats were swift to react to Trump’s words, with Senate Democratic Leader Chuck Schumer warning in a floor speech that the president was “lighting a match in a country soaked with political gasoline”.\nSpeaker Mike Johnson said he did not believe Trump was calling for violence in the social media posts, saying Trump was merely “defining a crime”, and calling the Democrats’ video “wildly inappropriate”.\n\n“Think of the threat that is to our national security and what it means for our institution,” Johnson added.\nTrump’s allies balked at the video. On Wednesday on Fox News, White House deputy chief of staff Stephen Miller called the messaging “insurrection - plainly, directly, without question” and said it represented “a general call for rebellion from the CIA and the armed services of the United States, by Democrat lawmakers”.\nOn X, Defence Secretary Pete Hegseth commented on the video Tuesday as “Stage 4 TDS”, referring to “Trump Derangement Syndrome” - a term used by Trump to describe voters so angry and opposed to him that they are incapable of seeing any good in what he does.\nPentagon spokesperson Sean Parnell challenged the theory that illegal orders were being issued.\n“Our military follows orders, and our civilians give legal orders,” Parnell told Associated Press on Thursday. “We love the Constitution. These politicians are out of their minds.”\nTrump previously evoked the death penalty in 2023 in relation to his former top US military officer Mark Milley, who became an outspoken critic of the president.\nAfter Milley told journalist Bob Woodward that he had secretly called his Chinese counterpart amid tensions after Trump supporters stormed the US Capitol in January 2021, Trump said “in times gone by, the punishment would have been DEATH!”\nAdditional reporting by Agence France-Presse","summary":"US President Donald Trump on Thursday accused half a dozen Democratic lawmakers of sedition “punishable by DEATH” after the lawmakers - all veterans of the armed services and intelligence community - called on US military members to uphold the Constitution and defy “illegal orders”.\nThe 90-second video was first posted early Tuesday from Senator Elissa Slotkin’s X account. In it, the six lawmakers - Slotkin, Arizona Senator Mark Kelly, and Representatives Jason Crow, Chris Deluzio, Maggie...","url":"https://www.scmp.com/news/world/united-states-canada/article/3333614/punishable-death-trump-suggests-seditious-democrats-should-be-executed","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/11/21/a3f22030-73cb-4c0c-9e0d-bec2e1c1fa09_48401489.jpg","video":null,"publish_date":"2025-11-21 00:38:43","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.269},{"id":381062230,"title":"Chiefs coach fires back at Trump's criticism of NFL kickoff rule: 'I hope he hears it'","text":"Kansas City Chiefs special teams coordinator Dave Toub reacted to President Donald Trump’s criticism of the NFL’s new kickoff on Thursday as the team preps for their game against the Indianapolis Colts. Trump has been vocal about his dislike for the NFL’s kickoff rule, which were made permanent this year. The most recent criticism came when he appeared on \"The Pat McAfee Show\" last week, calling it \"terrible.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM \"He doesn’t even know what he’s looking at,\" Toub said when asked about it during his media availability. \"He has no idea what’s going on with the kickoff rule. Take that for what it’s worth. And I hope he hears it.\" Trump was on the ESPN show for a Veterans Day special and had more critiques of the rules. \"I think it’s so terrible. I think it’s so demeaning, and I think it hurts the game. It hurts the pageantry,\" Trump said. \"I’ve told that to (NFL Commissioner) Roger Goodell, and I don’t think it’s any safer. I mean, you still have guys crashing into each other.\" In September, the president called the dynamic kickoff rule \"sissy football.\" TRAVIS KELCE WANTS CHIEFS TO 'PUT ALL THE SELFISH S---' ASIDE AS PLAYOFF CHANCES DWINDLE \"The NFL has to get rid of that ridiculous looking new Kickoff Rule,\" he wrote on Truth Social. \"How can they make such a big and sweeping change so easily and quickly. It’s at least as dangerous as the ‘normal’ kickoff, and looks like hell. \"The ball is moving, and the players are not, the exact opposite of what football is all about. ‘Sissy’ football is bad for America, and bad for the NFL! Who comes up with these ridiculous ideas? It’s like wanting to ‘roll back’ the golf ball so it doesn’t go (nearly!) as far. Fortunately, college football will remain the same, hopefully forever!!\" The NFL has said the dynamic kickoff system is safer and has produced more kickoff returns. CLICK HERE TO DOWNLOAD THE FOX NEWS APP The rule stated that the ball is kicked from the 35-yard line, but every player on the kicking team must wait at the 40 until the ball hits the ground or is touched by a returner inside the 20-yard line. The Associated Press contributed to this report.","summary":"Kansas City Chiefs special teams coordinator Dave Toub fired back at President Donald Trump&apos;s criticism of the NFL&apos;s dynamic kickoff rules on Thursday.","url":"https://www.foxnews.com/sports/chiefs-coach-fires-back-trumps-criticism-nfl-kickoff-rule-i-hope-he-hears-it","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/11/trum-chiefs-coach-112025-1.jpg","video":null,"publish_date":"2025-11-21 00:37:23","author":"Ryan Gaydos","authors":["Ryan Gaydos"],"language":"en","source_country":"US","sentiment":-0.466},{"id":381065128,"title":"'I'm very let down': 3-time Trump voter in swing state says cost of living 'gotten worse'","text":"In the pivotal swing state of Pennsylvania — which President Donald Trump won last year — voters in one swing county are growing increasingly frustrated with Trump's handling of the economy.\n\nCNN correspondent John King reported Thursday from Bethlehem, Pennsylvania, which covers both Lehigh and Northampton Counties. He described it as a \"blue-collar\" community full of people \"living paycheck to paycheck.\" Jenique Jones – a three-time Trump voter who runs a local business helping financially distressed residents repair their credit – told King that her clients' financial situations have become more dire under Trump's second term.\n\n\"My husband lost all of his overtime. My kids' daycare went up. Can't afford the cost of food. Using credit cards for everyday expenses. No money left after their bills are paid,\" Jones said when asked to describe what kinds of stories she hears on a daily basis. \"Pretty much just a whole bunch of financial mess.\"\n\nWhen King mentioned that the United States \"changed presidents at the beginning of the year,\" Jones acknowledged that Trump has \"absolutely not\" followed through on his campaign promises to make Americans' daily lives more affordable.\n\n\"I'm definitely waiting for him to fix it,\" she said. \"I'm very let down by that. Very, very let down, because I feel like it's only gotten worse.\"\n\nKing also spoke with local barbershop owner Ronald Corales, who is another three-time Trump voter. Like Jones, Corales acknowledged that costs are still high, but is actively encouraging people to have patience with the administration. \n\n\"We don't really see it at the moment. Like I said, I think we have to give him some time.\" \n\n\"You hear there, 'give him some more time,' from a three-time Trump voter,\" King observed. \"We met many Trump voters who say, 'let's try to be patient,' but they also say costs have not gone down as the president promised.\"\n\nKing's report comes on the heels of a Fox News poll released this week, which found that large majorities of respondents say daily necessities like groceries, housing, healthcare and utilities have either somewhat or significantly increased in cost under Trump's leadership.\n\nWatch the segment below:\n\n - YouTube www.youtube.com","summary":"In the pivotal swing state of Pennsylvania — which President Donald Trump won last year — voters in one swing county are growing increasingly frustrated with Trump's handling of the economy.\n\nCNN correspondent John King reported Thursday from Bethlehem, Pennsylvania, which covers both Lehigh and Northampton Counties. He described it as a \"blue-collar\" community full of people \"living paycheck to paycheck.\" Jenique Jones – a three-time Trump voter who runs a local business helping financially distressed residents repair their credit – told King that her clients' financial situations have become more dire under Trump's second term.\n\n\"My husband lost all of his overtime. My kids' daycare went up. Can't afford the cost of food. Using credit cards for everyday expenses. No money left after their bills are paid,\" Jones said when asked to describe what kinds of stories she hears on a daily basis. \"Pretty much just a whole bunch of financial mess.\"\n\nWhen King mentioned that the United States \"changed presidents at th","url":"https://www.alternet.org/trump-voter-costs/","image":"https://www.alternet.org/media-library/image.png?id=62221342&width=1200&height=600&coordinates=0%2C100%2C0%2C100","video":null,"publish_date":"2025-11-21 00:36:42","author":"Carl Gibson","authors":["Carl Gibson"],"language":"en","category":"politics","source_country":"US","sentiment":-0.588},{"id":381065312,"title":"Why Democrats are warning about Trump giving illegal orders","text":"President Donald Trump has yet again suggested that his political opponents deserve to be executed. And yet again, he’s basing this argument on a rather novel legal theory and a dubious interpretation of the facts. A half-dozen congressional Democrats cut a video this week urging members of the military not to obey unlawful orders that Trump might issue. Trump then responded by issuing a series of social media posts suggesting these members had committed sedition and possibly even deserved to die. Trump went from saying they should be arrested, to re-posting someone who said George Washington would “HANG THEM,” to saying “SEDITIOUS BEHAVIOR, punishable by DEATH!” White House press secretary Karoline Leavitt clarified Thursday that Trump does not, in fact, want members of Congress put to death. But she otherwise stood by the idea that these members were acting dangerously and undermining the commander in chief. She said the members were urging members of the military to “defy the chain of command.” “They are literally saying to 1.3 million active-duty servicemembers to defy the chain of command – not to follow lawful orders,” Leavitt said. But that is not what they were literally saying. In fact, the members were not urging anyone to disobey “lawful orders.” They explicitly referred in the video only to unlawful orders – and repeatedly so. The other problem is that “defying the chain of command” isn’t just something military servicemembers are allowed to do in such cases; it’s something they’re often required to do. The section of Article 92 of the Uniform Code of Military Justice dealing with failing to obey orders states that members can only be sanctioned for disobeying lawful orders. And servicemembers are generally obligated to not follow orders that are “manifestly unlawful.” If there’s a potentially more legitimate objection to Democrats’ video, it’s that they’re erecting a straw man – basically that they’re inventing out of whole cloth the prospect of Trump issuing illegal orders, in order to make military servicemembers hesitant to abide his orders. This is the argument that some of Trump’s allies have gone for on Fox News. “If you can’t name the unlawful orders that these guys are bringing up in their video, you know, that just shows me that you don’t have the courage to even call out what you’re talking about,” Republican Rep. Eli Crane of Arizona said. Fox News anchor Martha MacCallum in a separate segment pressed Democratic Rep. Jason Crow, one of the lawmakers in the video, repeatedly on the same subject. “What specific order from the commander in chief that we are asking our military to carry out are you objecting to?” MacCallum said. “This is very, very vague.” But it’s not as if this is a prospect Democrats have invented out of whole cloth. Trump has given them plenty to work with, including some things Crow mentioned in the interview. Trump has repeatedly proposed doing things – with the military and otherwise – that appear to be illegal. People who served with him have said he suggested illegal action. And Trump is certainly testing the bounds of the law with his use of the military even as we speak. The big example right now is Trump’s strikes on alleged drug vessels in the Caribbean Sea and the Pacific Ocean – strikes that have killed more than 80 people without a legal process. CNN has reported that both the United Nations and top allies like the United Kingdom regard the strikes as illegal extrajudicial killings. Republican Sen. Rand Paul of Kentucky has echoed those claims, while other GOP senators have questioned their legality as well. The administration has also declined to publicly detail its legal justification, even as the Justice Department has produced a classified legal opinion authorizing the strikes. It has released survivors of the strikes who, if they had been kept in US custody, could have forced it to defend itself in court. Also, a top commander who CNN has reported raised questions about the legality of the strikes is now retiring early. There is a very real question about whether the servicemembers involved in those strikes are carrying out illegal orders. And the administration has proactively avoided a more robust legal process that could settle that question. But that’s hardly all. Here are some other key data points: It’s certainly provocative for Democrats to raise this issue like they have. But it’s not as if they’ve conjured it out of thin air.","url":"https://edition.cnn.com/2025/11/20/politics/hang-democrats-trump-seditious-behavior","image":"https://media.cnn.com/api/v1/images/stellar/prod/c-ap25322669272824.jpg?c=16x9&q=w_800,c_fill","video":null,"publish_date":"2025-11-21 00:33:18","author":"Aaron Blake","authors":["Aaron Blake"],"language":"en","category":"politics","source_country":"us","sentiment":-0.523},{"id":381061306,"title":"Visa prioritaire pour la Coupe du Monde 2026 : les États-Unis lancent le FIFA PASS  - Haiti Gazette – Daily","text":"Les États-Unis annonce un système de visa accéléré pour les fans grâce au FIFA PASS\n\nLes États-Unis ont officiellement annoncé le lancement du FIFA PASS, un dispositif inédit qui permettra aux détenteurs de billets de la Coupe du Monde 2026 d’obtenir un rendez-vous prioritaire pour leur entretien de visa américain. Une mesure exceptionnelle dévoilée lors d’une conférence de presse à la Maison-Blanche, en présence du président Donald Trump, du secrétaire d’État Marco Rubio et du président de la FIFA, Gianni Infantino.\n\nConcrètement, les supporters ayant acheté un billet officiel d’un match se déroulant sur le sol américain pourront accéder à une plateforme en ligne dédiée afin de demander un créneau d’entretien accéléré dans les ambassades et consulats américains. Le dispositif ne garantit pas l’obtention du visa, mais il ouvre un accès rapide à l’étape la plus difficile : obtenir une date d’entretien. Les contrôles de sécurité habituels, l’analyse des dossiers et la décision finale des officiers consulaires restent inchangés.\n\nPour répondre à l’afflux attendu des visiteurs internationaux, Washington prévoit de mobiliser plus de 400 agents supplémentaires dans ses services consulaires. Selon les estimations, les délais d’entretien pourraient être réduits à moins de soixante jours dans la majorité des pays, une réduction considérable alors que certaines ambassades se trouvent actuellement saturées plusieurs mois à l’avance.\n\nVoir cette publication sur Instagram\n\nLe FIFA PASS ne s’applique qu’aux détenteurs de billets pour des matchs disputés aux États-Unis. Les supporters devront fournir un ticket authentifié et un identifiant FIFA avant de pouvoir accéder à la procédure accélérée. Pour les pays comme Haïti, où la demande de visa est traditionnellement élevée, le système représente une opportunité notable pour les fans désireux d’assister à la première Coupe du Monde jamais organisée simultanément par trois pays : les États-Unis, le Canada et le Mexique.\n\nL’enjeu dépasse le sport. Les États-Unis anticipent entre 5 et 10 millions de visiteurs internationaux, avec un impact économique estimé à plus de 30 milliards de dollars. Dans ce contexte, le FIFA PASS apparaît comme un outil de gestion logistique permettant d’éviter la paralysie du système consulaire, tout en renforçant le contrôle des flux migratoires.\n\nPour les supporters haïtiens, l’accès prioritaire constitue une chance, mais pas une garantie. Le billet ouvre la porte au rendez-vous, pas au visa lui-même. Il faudra donc préparer soigneusement les documents, anticiper les démarches et suivre les instructions officielles du portail FIFA.\n\nÀ lire aussi","url":"https://haitigazette.com/visa-prioritaire-pour-la-coupe-du-monde-2026-les-etats-unis-lancent-le-fifa-pass/","image":"https://haitigazette.com/app/uploads/2025/11/Cover.J7-1200-x-630-px-339-boL4rn.jpg","video":null,"publish_date":"2025-11-21 00:32:52","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":0.309},{"id":381061298,"title":"Zelenskyy ready to work on US-backed plan to end Russia-Ukraine war  - Haiti Gazette – Daily Haiti News","text":"Ukrainian President Volodymyr Zelenskyy has said he’s willing to work with the United States on a plan to end Russia’s war on Ukraine, despite pushback from European allies who say that the US-backed plan heavily favours Russia.\n\nZelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with US President Donald Trump in the coming days.\n\nHis office did not comment directly on the contents of the plan, which has not been published, but the Ukrainian leader had “outlined the fundamental principles that matter to our people”.\n\n“In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,” Zelenskyy’s office said.\n\nSeveral media outlets reported that the 28-point plan involves Ukraine ceding territory and weapons. Citing an unnamed US official with “direct knowledge”, Axios reported the plan would give Russia parts of eastern Ukraine that Moscow does not currently control, in exchange for a US security guarantee for Ukraine and Europe against future Russian aggression.\n\nUS Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on the plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House Press Secretary Karoline Leavitt confirmed on Thursday.\n\nShe declined to comment on details of the emerging proposal, but said Trump has been briefed on it and supports it.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” Leavitt said.\n\nZelenskyy confirmed later that he discussed the plan with US Army Secretary Daniel Driscoll in Kyiv.\n\n“Our teams – Ukraine and the USA – will work on the points of the plan to end the war,” Zelenskyy wrote on Telegram without commenting directly on the plan. “We are ready for constructive, honest and prompt work.”\n\nRussia appeared to play down any new US initiative.\n\n“Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,” Kremlin spokesman Dmitry Peskov said.\n\nWhile Zelenskyy has signalled he is willing to work with the Trump administration on a ceasefire, Kyiv’s European allies have expressed scepticism.\n\n“Ukrainians want peace – a just peace that respects everyone’s sovereignty, a durable peace that can’t be called into question by future aggression,” French Foreign Minister Jean-Noel Barrot said during a meeting of European Union foreign ministers in Brussels. “But peace cannot be a capitulation.”\n\nEU foreign policy head Kaja Kallas said any peace proposal would need support from Europe and Ukraine to move forward, with Polish Foreign Minister Radoslaw Sikorski saying that Europe – whose security is “at stake” – expects to be consulted on any potential deal.\n\n“I hope it’s not the victim that has restrictions on its ability to defend itself put on, but it’s the aggressor,” he said.\n\nZelenskyy is facing pressure to join the US-backed diplomatic initiative as Ukrainian troops continue to lose ground to Russian forces in the country’s east.\n\nRussian President Vladimir Putin claimed in October that Russian forces had seized almost 5,000 square kilometres (1,930sq miles) of Ukraine this year.\n\nOn September 25, the Institute for the Study of War, a Washington-based think tank, independently assessed the real figure to be closer to 3,434sq km (1,325sq miles).\n\nRussia’s General Staff said Thursday that Moscow’s forces had seized the northeastern Ukrainian city of Kupiansk and controlled large sections of the towns of Pokrovsk and Vovchansk – a claim Ukraine vigorously denied.\n\n“The General Staff of Ukraine’s armed forces hereby announces that Kupiansk is under the control of Ukraine’s defence forces,” the Ukrainian General Staff said in a late evening bulletin.\n\n“Also untrue are statements suggesting that 80 percent of Vovchansk in the Kharkiv region has been captured and 70 percent of the city of Pokrovsk.”\n\nThis week, a devastating Russian aerial assault on Ternopil in western Ukraine killed at least 26 people and wounded dozens more, Interior Minister Ihor Klymenko confirmed Thursday.\n\nZelenskyy said on Thursday that 22 people were still missing at the site of Wednesday’s attack on Ternopil when Moscow unleashed 476 drones and 48 missiles across Ukraine. The attack damaged energy infrastructure across seven Ukrainian regions, prompting nationwide restrictions on power consumption.\n\n“Every brazen attack against ordinary life indicates that the pressure on Russia [to stop the war] is insufficient,” Zelenskyy said on Telegram.\n\nThe bombardment coincided with Zelenskyy’s visit to Turkiye aimed at reviving peace talks with Russia following his European diplomatic mission.\n\n“We count on the strength of Turkish diplomacy, on [how] it’s understood in Moscow,” Zelenskyy said after his meeting on Wednesday with Turkish President Recep Tayyip Erdogan.","url":"https://haitigazette.com/zelenskyy-ready-to-work-on-us-backed-plan-to-end-russia-ukraine-war/","image":"https://haitigazette.com/app/uploads/2025/11/AFP__20251119__84GP963__v2__HighRes__UkraineRussiaConflictWar-1763622715-s0FWVK.jpg","video":null,"publish_date":"2025-11-21 00:32:38","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":-0.262},{"id":381061300,"title":"Russia-Ukraine war: List of key events, day 1,366  - Haiti Gazette – Daily Haiti News","text":"Ukrainian President Volodymyr Zelenskyy’s office said he had “officially received a draft plan from the American side, which, according to the American side, can intensify diplomacy” to end Russia’s war on Ukraine.\n\nPresident Zelenskyy also said, in a post on Facebook, that he had discussed “options for achieving real peace”, as well as “sequencing of our work and formats for dialogue [and] new impulses for diplomacy”, during a meeting with United States Secretary of the Army Daniel Driscoll in Kyiv on Thursday.\n\nZelenskyy’s office said the Ukrainian president had “agreed to work on the points of the plan in such a way that it would provide a dignified end to the war” during his meeting with Driscoll.\n\nZelenskyy’s updates followed news reports that the US and Russia have drafted a new framework to end the Russia-Ukraine war, including a 28-point plan from US President Donald Trump.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” White House Press Secretary Karoline Leavitt said.","url":"https://haitigazette.com/russia-ukraine-war-list-of-key-events-day-1366/","image":"https://haitigazette.com/app/uploads/2025/11/2025-11-20T131018Z_390524552_RC2TJJ9Q7AQE_RTRMADP_3_UKRAINE-CRISIS-ATTACK-TERNOPIL-MISSING-1763683765-Cr5X6o.jpg","video":null,"publish_date":"2025-11-21 00:32:36","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"ht","sentiment":0.175},{"id":381060192,"title":"School Assembly News Headlines For November 21: Top National, International & Others News","text":"News Headlines for School Assembly, November 21st: From the eruption of Mount Semeru, one of Indonesia’s tallest peaks, to Jaishankar reiterating India’s support for the development and welfare of the people of Afghanistan, here are the top news highlights for November 21st.\nTop National News:\n– Early signs of radicalisation were evident in the behaviour of Umar Un Nabi, the doctor who later carried out a suicide car bombing in Delhi, during his time at Government Medical College (GMC) Anantnag.\n– The family of the Class 10 student from a prominent private school in Delhi, who died by suicide earlier this week, has alleged that he was subjected to prolonged humiliation by his teachers.\nTop International News:\n– US President Donald Trump announced that New York City Mayor-elect Zohran Mamdani will meet him at the White House on Friday.\n– More than 900 residents have been evacuated following the eruption of Mount Semeru, one of Indonesia’s tallest peaks.\n– External Affairs Minister S Jaishankar on Thursday reiterated India’s support for the development and welfare of the people of Afghanistan during his meeting with Afghan Taliban’s Commerce and Industry Minister Alhaj Nooruddin Azizi.\nTop Sports News:\n– Moroccan superstar Achraf Hakimi has been named the African Player Of The Year for 2025, following a stellar year with both his club and country.\nTop Business News:\n– Indian equity markets closed higher on Thursday, with the benchmark Sensex and Nifty50 nearing their record highs last seen in September 2024, driven by strong buying in Financials and Oil & Gas stocks.\n– Reserve Bank of India (RBI) Governor Sanjay Malhotra on Thursday said the central bank does not target any specific exchange rate level for the rupee, attributing the recent weakness of the domestic currency to strong demand for the US dollar.\n– Union Finance and Corporate Affairs Minister Nirmala Sitharaman on Tuesday chaired the 10th Pre-Budget Consultation with representatives of trade unions and labour organisations as the government begins preparations for the Union Budget 2026-27.\nTop Education News\n– Groups affiliated with the Rashtriya Swayamsevak Sangh (RSS) have launched protests in the Jammu region, demanding that the Shri Mata Vaishnodevi Institute of Medical Excellence revoke the admission list for its first batch of students, 90% of whom are Muslims from Kashmir.","summary":"School Assembly News Headlines For November 21st: Check top national, international, education, business and sports news for school assembly.","url":"https://www.news18.com/education-career/school-assembly-news-headlines-on-november-21-top-national-international-sports-business-education-updates-9721420.html","image":"https://images.news18.com/ibnlive/uploads/2025/11/schools-30-2025-11-392c2cc253c768d973b753d3854bd6d9.jpg","video":null,"publish_date":"2025-11-21 00:30:53","author":"Education And Careers Desk,News18,Sukanya Nandy","authors":["Education And Careers Desk","News18","Sukanya Nandy"],"language":"en","source_country":"in","sentiment":0.23},{"id":381061432,"title":"Zelenskyy ready to work on US-backed plan to end Russia-Ukraine war  - Dominica Gazette – Dominica &amp;","text":"Ukrainian President Volodymyr Zelenskyy has said he’s willing to work with the United States on a plan to end Russia’s war on Ukraine, despite pushback from European allies who say that the US-backed plan heavily favours Russia.\n\nZelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with US President Donald Trump in the coming days.\n\nHis office did not comment directly on the contents of the plan, which has not been published, but the Ukrainian leader had “outlined the fundamental principles that matter to our people”.\n\n“In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,” Zelenskyy’s office said.\n\nSeveral media outlets reported that the 28-point plan involves Ukraine ceding territory and weapons. Citing an unnamed US official with “direct knowledge”, Axios reported the plan would give Russia parts of eastern Ukraine that Moscow does not currently control, in exchange for a US security guarantee for Ukraine and Europe against future Russian aggression.\n\nUS Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on the plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House Press Secretary Karoline Leavitt confirmed on Thursday.\n\nShe declined to comment on details of the emerging proposal, but said Trump has been briefed on it and supports it.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” Leavitt said.\n\nZelenskyy confirmed later that he discussed the plan with US Army Secretary Daniel Driscoll in Kyiv.\n\n“Our teams – Ukraine and the USA – will work on the points of the plan to end the war,” Zelenskyy wrote on Telegram without commenting directly on the plan. “We are ready for constructive, honest and prompt work.”\n\nRussia appeared to play down any new US initiative.\n\n“Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,” Kremlin spokesman Dmitry Peskov said.\n\nWhile Zelenskyy has signalled he is willing to work with the Trump administration on a ceasefire, Kyiv’s European allies have expressed scepticism.\n\n“Ukrainians want peace – a just peace that respects everyone’s sovereignty, a durable peace that can’t be called into question by future aggression,” French Foreign Minister Jean-Noel Barrot said during a meeting of European Union foreign ministers in Brussels. “But peace cannot be a capitulation.”\n\nEU foreign policy head Kaja Kallas said any peace proposal would need support from Europe and Ukraine to move forward, with Polish Foreign Minister Radoslaw Sikorski saying that Europe – whose security is “at stake” – expects to be consulted on any potential deal.\n\n“I hope it’s not the victim that has restrictions on its ability to defend itself put on, but it’s the aggressor,” he said.\n\nZelenskyy is facing pressure to join the US-backed diplomatic initiative as Ukrainian troops continue to lose ground to Russian forces in the country’s east.\n\nRussian President Vladimir Putin claimed in October that Russian forces had seized almost 5,000 square kilometres (1,930sq miles) of Ukraine this year.\n\nOn September 25, the Institute for the Study of War, a Washington-based think tank, independently assessed the real figure to be closer to 3,434sq km (1,325sq miles).\n\nRussia’s General Staff said Thursday that Moscow’s forces had seized the northeastern Ukrainian city of Kupiansk and controlled large sections of the towns of Pokrovsk and Vovchansk – a claim Ukraine vigorously denied.\n\n“The General Staff of Ukraine’s armed forces hereby announces that Kupiansk is under the control of Ukraine’s defence forces,” the Ukrainian General Staff said in a late evening bulletin.\n\n“Also untrue are statements suggesting that 80 percent of Vovchansk in the Kharkiv region has been captured and 70 percent of the city of Pokrovsk.”\n\nThis week, a devastating Russian aerial assault on Ternopil in western Ukraine killed at least 26 people and wounded dozens more, Interior Minister Ihor Klymenko confirmed Thursday.\n\nZelenskyy said on Thursday that 22 people were still missing at the site of Wednesday’s attack on Ternopil when Moscow unleashed 476 drones and 48 missiles across Ukraine. The attack damaged energy infrastructure across seven Ukrainian regions, prompting nationwide restrictions on power consumption.\n\n“Every brazen attack against ordinary life indicates that the pressure on Russia [to stop the war] is insufficient,” Zelenskyy said on Telegram.\n\nThe bombardment coincided with Zelenskyy’s visit to Turkiye aimed at reviving peace talks with Russia following his European diplomatic mission.\n\n“We count on the strength of Turkish diplomacy, on [how] it’s understood in Moscow,” Zelenskyy said after his meeting on Wednesday with Turkish President Recep Tayyip Erdogan.","url":"https://dominicagazette.com/zelenskyy-ready-to-work-on-us-backed-plan-to-end-russia-ukraine-war/","image":"https://dominicagazette.com/app/uploads/2025/11/AFP__20251119__84GP963__v2__HighRes__UkraineRussiaConflictWar-1763622715-ZCE6NY.jpg","video":null,"publish_date":"2025-11-21 00:30:50","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"dn","sentiment":-0.262},{"id":381064120,"title":"Trump plan to end Ukraine war would cede territory to Russia","text":"WASHINGTON (AP) — President Donald Trump's plan for ending the war in Ukraine would cede territory to Russia and limit the size of Kyiv's military, according to a draft proposal obtained Thursday by The Associated Press.\n\nWashington and Moscow worked together on the draft, which Ukrainian President Volodymyr Zelenskyy discussed with a U.S. representative Thursday. If enacted, it would resolve a conflict that began nearly four years ago by requiring significant concessions from Kyiv and European leaders.\n\nFor example, the proposal would not only bar Ukraine from joining NATO but would also prevent the alliance's future expansion. Such a step would be a significant victory for Moscow, which views NATO as a threat. \n\nRussian President Vladimir Putin would also gain ground that he has been unable to win on the battlefield. Under the draft, Moscow would hold all the eastern Donbas region, even though approximately 14% still remains in Ukrainian hands. \n\nThere would be a path to lifting sanctions on Russia and returning the country to what was formerly known as the Group of 8, which includes many of the world's biggest economies. \n\nRussia would commit to making no future attacks, something the White House views as a concession. In addition, $100 billion in frozen Russian assets would be dedicated to rebuilding Ukraine. \n\nHowever, handing over territory to Russia would be deeply unpopular in Ukraine. It also would be illegal under Ukraine’s constitution. Zelenskyy has repeatedly ruled out such a possibility.\n\nSecretary of State Marco Rubio and U.S. special envoy Steve Witkoff have been quietly working on the peace plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House press secretary Karoline Leavitt said Thursday. Witkoff and Kirill Dmitriev, a close adviser to Putin, have been key to drafting the proposal.\n\nIn other developments, Russia’s chief military officer, Gen. Valery Gerasimov, announced that Moscow’s forces had taken full control of Kupiansk in Ukraine’s Kharkiv region, although he also said some Ukrainian troops remained in the city.\n\nThe general staff for Ukraine’s armed forces denied Gerasimov’s claims and said Kyiv’s forces remained in control of Kupiansk.\n\nMadhani reported from Washington. Associated Press journalists Sam McNeil in Brussels, Samya Kullab in Kyiv and Katie Marie Davies in Manchester, England, contributed to this report.\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine\n\nIllia Novikov, Aamer Madhani And Chris Megerian, The Associated Press","url":"https://www.oakvillenews.org/world-news/trump-plan-to-end-ukraine-war-would-cede-territory-to-russia-11520573","image":"https://www.vmcdn.ca/f/files/shared/feeds/cp/2025/11/e5ca60f578a172ac06d79dfeeffd9b6f7be4158f669d076d52f336686e997a04.jpg","video":null,"publish_date":"2025-11-21 00:30:23","author":"The Associated Press","authors":["The Associated Press"],"language":"en","category":"politics","source_country":"ca","sentiment":-0.164},{"id":381065076,"title":"Zelenskyy ready to work on US-backed plan to end Russia-Ukraine war  - Grenada Chronicle – Daily Grenada And","text":"Ukrainian President Volodymyr Zelenskyy has said he’s willing to work with the United States on a plan to end Russia’s war on Ukraine, despite pushback from European allies who say that the US-backed plan heavily favours Russia.\n\nZelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with US President Donald Trump in the coming days.\n\nHis office did not comment directly on the contents of the plan, which has not been published, but the Ukrainian leader had “outlined the fundamental principles that matter to our people”.\n\n“In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,” Zelenskyy’s office said.\n\nSeveral media outlets reported that the 28-point plan involves Ukraine ceding territory and weapons. Citing an unnamed US official with “direct knowledge”, Axios reported the plan would give Russia parts of eastern Ukraine that Moscow does not currently control, in exchange for a US security guarantee for Ukraine and Europe against future Russian aggression.\n\nUS Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on the plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House Press Secretary Karoline Leavitt confirmed on Thursday.\n\nShe declined to comment on details of the emerging proposal, but said Trump has been briefed on it and supports it.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” Leavitt said.\n\nZelenskyy confirmed later that he discussed the plan with US Army Secretary Daniel Driscoll in Kyiv.\n\n“Our teams – Ukraine and the USA – will work on the points of the plan to end the war,” Zelenskyy wrote on Telegram without commenting directly on the plan. “We are ready for constructive, honest and prompt work.”\n\nRussia appeared to play down any new US initiative.\n\n“Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,” Kremlin spokesman Dmitry Peskov said.\n\nWhile Zelenskyy has signalled he is willing to work with the Trump administration on a ceasefire, Kyiv’s European allies have expressed scepticism.\n\n“Ukrainians want peace – a just peace that respects everyone’s sovereignty, a durable peace that can’t be called into question by future aggression,” French Foreign Minister Jean-Noel Barrot said during a meeting of European Union foreign ministers in Brussels. “But peace cannot be a capitulation.”\n\nEU foreign policy head Kaja Kallas said any peace proposal would need support from Europe and Ukraine to move forward, with Polish Foreign Minister Radoslaw Sikorski saying that Europe – whose security is “at stake” – expects to be consulted on any potential deal.\n\n“I hope it’s not the victim that has restrictions on its ability to defend itself put on, but it’s the aggressor,” he said.\n\nZelenskyy is facing pressure to join the US-backed diplomatic initiative as Ukrainian troops continue to lose ground to Russian forces in the country’s east.\n\nRussian President Vladimir Putin claimed in October that Russian forces had seized almost 5,000 square kilometres (1,930sq miles) of Ukraine this year.\n\nOn September 25, the Institute for the Study of War, a Washington-based think tank, independently assessed the real figure to be closer to 3,434sq km (1,325sq miles).\n\nRussia’s General Staff said Thursday that Moscow’s forces had seized the northeastern Ukrainian city of Kupiansk and controlled large sections of the towns of Pokrovsk and Vovchansk – a claim Ukraine vigorously denied.\n\n“The General Staff of Ukraine’s armed forces hereby announces that Kupiansk is under the control of Ukraine’s defence forces,” the Ukrainian General Staff said in a late evening bulletin.\n\n“Also untrue are statements suggesting that 80 percent of Vovchansk in the Kharkiv region has been captured and 70 percent of the city of Pokrovsk.”\n\nThis week, a devastating Russian aerial assault on Ternopil in western Ukraine killed at least 26 people and wounded dozens more, Interior Minister Ihor Klymenko confirmed Thursday.\n\nZelenskyy said on Thursday that 22 people were still missing at the site of Wednesday’s attack on Ternopil when Moscow unleashed 476 drones and 48 missiles across Ukraine. The attack damaged energy infrastructure across seven Ukrainian regions, prompting nationwide restrictions on power consumption.\n\n“Every brazen attack against ordinary life indicates that the pressure on Russia [to stop the war] is insufficient,” Zelenskyy said on Telegram.\n\nThe bombardment coincided with Zelenskyy’s visit to Turkiye aimed at reviving peace talks with Russia following his European diplomatic mission.\n\n“We count on the strength of Turkish diplomacy, on [how] it’s understood in Moscow,” Zelenskyy said after his meeting on Wednesday with Turkish President Recep Tayyip Erdogan.","url":"https://grenadachronicle.com/zelenskyy-ready-to-work-on-us-backed-plan-to-end-russia-ukraine-war/","image":"https://grenadachronicle.com/app/uploads/2025/11/AFP__20251119__84GP963__v2__HighRes__UkraineRussiaConflictWar-1763622715-E6sK2Z.jpg","video":null,"publish_date":"2025-11-21 00:30:15","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"gd","sentiment":-0.262},{"id":381061324,"title":"Zelenskyy ready to work on US-backed plan to end Russia-Ukraine war  - Dominican Republic Post – Caribbean","text":"Ukrainian President Volodymyr Zelenskyy has said he’s willing to work with the United States on a plan to end Russia’s war on Ukraine, despite pushback from European allies who say that the US-backed plan heavily favours Russia.\n\nZelenskyy’s office on Thursday confirmed that he had received a draft of the plan, and that he would speak with US President Donald Trump in the coming days.\n\nHis office did not comment directly on the contents of the plan, which has not been published, but the Ukrainian leader had “outlined the fundamental principles that matter to our people”.\n\n“In the coming days, the President of Ukraine expects to discuss with President Trump the existing diplomatic opportunities and the key points required to achieve peace,” Zelenskyy’s office said.\n\nSeveral media outlets reported that the 28-point plan involves Ukraine ceding territory and weapons. Citing an unnamed US official with “direct knowledge”, Axios reported the plan would give Russia parts of eastern Ukraine that Moscow does not currently control, in exchange for a US security guarantee for Ukraine and Europe against future Russian aggression.\n\nUS Secretary of State Marco Rubio and US special envoy Steve Witkoff have been quietly working on the plan for a month, receiving input from both Ukrainians and Russians on terms that are acceptable to each side, White House Press Secretary Karoline Leavitt confirmed on Thursday.\n\nShe declined to comment on details of the emerging proposal, but said Trump has been briefed on it and supports it.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” Leavitt said.\n\nZelenskyy confirmed later that he discussed the plan with US Army Secretary Daniel Driscoll in Kyiv.\n\n“Our teams – Ukraine and the USA – will work on the points of the plan to end the war,” Zelenskyy wrote on Telegram without commenting directly on the plan. “We are ready for constructive, honest and prompt work.”\n\nRussia appeared to play down any new US initiative.\n\n“Consultations are not currently under way. There are contacts, of course, but there is no process that could be called consultations,” Kremlin spokesman Dmitry Peskov said.\n\nWhile Zelenskyy has signalled he is willing to work with the Trump administration on a ceasefire, Kyiv’s European allies have expressed scepticism.\n\n“Ukrainians want peace – a just peace that respects everyone’s sovereignty, a durable peace that can’t be called into question by future aggression,” French Foreign Minister Jean-Noel Barrot said during a meeting of European Union foreign ministers in Brussels. “But peace cannot be a capitulation.”\n\nEU foreign policy head Kaja Kallas said any peace proposal would need support from Europe and Ukraine to move forward, with Polish Foreign Minister Radoslaw Sikorski saying that Europe – whose security is “at stake” – expects to be consulted on any potential deal.\n\n“I hope it’s not the victim that has restrictions on its ability to defend itself put on, but it’s the aggressor,” he said.\n\nZelenskyy is facing pressure to join the US-backed diplomatic initiative as Ukrainian troops continue to lose ground to Russian forces in the country’s east.\n\nRussian President Vladimir Putin claimed in October that Russian forces had seized almost 5,000 square kilometres (1,930sq miles) of Ukraine this year.\n\nOn September 25, the Institute for the Study of War, a Washington-based think tank, independently assessed the real figure to be closer to 3,434sq km (1,325sq miles).\n\nRussia’s General Staff said Thursday that Moscow’s forces had seized the northeastern Ukrainian city of Kupiansk and controlled large sections of the towns of Pokrovsk and Vovchansk – a claim Ukraine vigorously denied.\n\n“The General Staff of Ukraine’s armed forces hereby announces that Kupiansk is under the control of Ukraine’s defence forces,” the Ukrainian General Staff said in a late evening bulletin.\n\n“Also untrue are statements suggesting that 80 percent of Vovchansk in the Kharkiv region has been captured and 70 percent of the city of Pokrovsk.”\n\nThis week, a devastating Russian aerial assault on Ternopil in western Ukraine killed at least 26 people and wounded dozens more, Interior Minister Ihor Klymenko confirmed Thursday.\n\nZelenskyy said on Thursday that 22 people were still missing at the site of Wednesday’s attack on Ternopil when Moscow unleashed 476 drones and 48 missiles across Ukraine. The attack damaged energy infrastructure across seven Ukrainian regions, prompting nationwide restrictions on power consumption.\n\n“Every brazen attack against ordinary life indicates that the pressure on Russia [to stop the war] is insufficient,” Zelenskyy said on Telegram.\n\nThe bombardment coincided with Zelenskyy’s visit to Turkiye aimed at reviving peace talks with Russia following his European diplomatic mission.\n\n“We count on the strength of Turkish diplomacy, on [how] it’s understood in Moscow,” Zelenskyy said after his meeting on Wednesday with Turkish President Recep Tayyip Erdogan.","url":"https://dominicanrepublicpost.com/zelenskyy-ready-to-work-on-us-backed-plan-to-end-russia-ukraine-war/","image":"https://dominicanrepublicpost.com/app/uploads/2025/11/AFP__20251119__84GP963__v2__HighRes__UkraineRussiaConflictWar-1763622715-7ZDlmu.jpg","video":null,"publish_date":"2025-11-21 00:30:11","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"do","sentiment":-0.262},{"id":381060302,"title":"Trump needs to remind Mamdani that Gotham is not above the rest of the country","text":"When President Donald Trump sits down with Mayor-elect Zohran Mamdani, he needs to remind him that American values — and laws — still hold in Gotham.\n\nProtesting in front of a synagogues — or any house of prayer — and heckling and blocking entry is un-American and illegal, violating others’ rights to freedom of worship, to assembly, to free speech and much more. \n\nYet the city saw just such an ugly spectacle Wednesday night outside Park East Synagogue: “We need to make them scared,” one agitator kept saying.\n\nMamdani’s not yet in charge of the NYPD but he needs to know that the Trump administration won’t let thugs trample on New Yorkers’ civil rights.\n\nLong precedent allows federal troops to protect the civil rights of minorities; Trump should warn the mayor-to-be that he’ll do his duty by his home town if mobs keep assaulting synagogues in Mamdani’s New York.\n\nThe president should also stomp on all “follow international law” nonsense: The International Criminal Court has no jurisdiction in America; saying you’ll enforce its warrant for the arrest of Israel’s Benjamin Netanyahu is a barely bad joke.\n\nHowever loud the applause the idea brings at Democratic Socialist confabs, only an idiot would order the NYPD to battle with the federal agents who protect foreign heads of state.\n\nHe should be waking up to basic facts such as: Cities are legal creations of their state governments, and the states are subordinate to Washington; mayors just don’t get to make up their own laws.\n\nDoes Mamdani love Gotham as he says? \n\nThe prez should remind him that running a city isn’t about dorm-room thought experiments: The job is first and foremost about collecting the trash and fighting the rats; teaching the kids and securing the streets and subways — and keeping the town open for business.\n\nScreaming “Tax the rich!” may satisfy the new mayor’s fans, but he’s likely already realizing the risks of losing the 30,000 highest-earning tax filers who already provide the city with 40% of its income-tax revenue.\n\nWe expect the face-to-face will also see Mamdani walking back his vows to be Trump’s “worst nightmare”: This city relies on the feds for far too much to make that sustainable. \n\nThe mayor-elect — and all New Yorkers — need Trump more than the other way ’round.\n\nFinally, Trump should instruct Mamdani in a fundamental truth of democratic politics: Opponents not only can get along, they have to — or everything falls apart.","summary":"When President Donald Trump sits down with Mayor-elect Zohran Mamdani, he needs to remind him that American values — and laws — still hold in Gotham.","url":"https://nypost.com/2025/11/20/opinion/trump-needs-to-remind-mamdani-that-gotham-is-not-above-the-rest-of-the-country/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/11/newspress-collage-4b810clq8-1763683490002.jpg?quality=75&strip=all&1763665509&w=1200","video":"https://cdn.jwplayer.com/videos/snnxLiQY-RyIcpnTz.mp4","publish_date":"2025-11-21 00:29:53","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","category":"politics","source_country":"zm","sentiment":-0.19},{"id":381063192,"title":"Federal judge orders release of 16 migrants detained in Idaho raid, citing due process violations","text":"BOISE, Idaho (AP) — A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month.\n\nU.S. District Judge B. Lynn Winmill ruled Wednesday that keeping the migrants jailed without bond violated their due process rights, and he ordered that they be released while they wait for their immigration cases to be resolved. Many of them have lived in the U.S. for decades and lacked any criminal history, Winmill noted. Some are married to U.S. citizens or have children who are U.S. citizens, according to court documents.\n\nIn an e-mailed statement to The Associated Press, the Department of Homeland Security said Immigration and Customs Enforcement agents lawfully arrested the detainees during the raid, and added that “an activist judge is ordering lawbreakers to roam free.”\n\n“The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country,” the department said.\n\nThe Oct. 19 raid at the privately operated outdoor track in Wilder was led by the FBI as part of an investigation into suspected illegal gambling. More than 200 officers from at least 14 agencies, including U.S. Immigrations and Customs Enforcement and Border Patrol, participated in the raid, detaining around 400 people for hours, including many U.S. citizens.\n\nWitnesses described aggressive tactics, including zip-tying children or separating young kids from their parents for an hour or more. Homeland Security Secretary Kristi Noem, whose agency oversees Border Patrol and ICE, denied that children were zip-tied. FBI spokesperson Sandra Barker initially said no restraints or rubber bullets were used on children but later amended that statement, replacing “children” with “young children.”\n\nThe raid resulted in only a handful of gambling-related arrests, while 105 people were arrested on suspicion of immigration violations. Many of them signed voluntary agreements to leave the country before they were able to talk to immigration lawyers, said Nikki Ramirez-Smith, an immigration attorney whose firm is representing 15 of the people released this week.\n\nJust 18 people detained in the raid have sought their release in the federal courts in Idaho, according to online court records. One of them had that request initially dismissed after a judge found that they did not include enough detail in their court filing, but the judge also gave them 30 days to try again. Another person is now pursuing release through a different federal court after they were transferred to a detention facility in a different state.\n\nThe federal judge in Idaho said that nearly all of his colleagues who have faced similar requests from immigration detainees have come to the same conclusion: That non-citizens who are detained while already present in the United States are entitled to due process rights.\n\n“Treating the detention of noncitizens stopped at or near the border differently from noncitizens who reside within the country is not an anomaly. Instead, it reflects the long-recognized distinction in our immigration laws and the Constitution that due process protections apply to noncitizens residing within the country but not those stopped at or near the border,” Winmill wrote.\n\nRamirez-Smith said Winmill’s release orders do “a great job of putting into perspective what the issues are.”\n\n“They’ll just stay home with their families, and we’ll file the applications for relief in immigration court, and they’ll get a court hearing. Those trial dates will probably be years out,” she said, because of a hefty backlog of more than 3 million cases in immigration courts.\n\nStill, President Donald Trump has taken steps to reduce the backlog, instructing judges during his first term to deny entire categories of asylum claims such as for victims of gang or domestic violence.\n\nDuring his current term, the Trump administration has fired dozens of immigration judges, and authorized about 600 military lawyers to work as temporary immigration judges. The administration has also frequently turned what would normally be routine immigration hearings into deportation traps, with government lawyers quickly dismissing asylum cases so the migrants who sought asylum can be immediately arrested in the courthouse halls.","summary":"BOISE, Idaho (AP) — A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month.","url":"https://www.thestar.com/news/world/united-states/federal-judge-orders-release-of-16-migrants-detained-in-idaho-raid-citing-due-process-violations/article_40d98c2c-4a00-5169-ad69-c253b6e3a4a8.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/8/ff/8ff028c2-fdbf-5bb2-b20e-df73d536797e/691fb3b558b53.image.jpg?crop=1620%2C851%2C0%2C114&resize=1200%2C630&order=crop%2Cresize","video":null,"publish_date":"2025-11-21 00:28:57","author":"Rebecca Boone The Associated Press","authors":["Rebecca Boone The Associated Press"],"language":"en","category":"politics","source_country":"CA","sentiment":-0.254},{"id":381061736,"title":"Federal judge orders release of 16 migrants detained in Idaho raid, citing due process violations","text":"A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month. \n\nU.S. District Judge B. Lynn Winmill ruled Wednesday that keeping the migrants jailed without bond violated their due process rights, and he ordered that they be released while they wait for their immigration cases to be resolved. Many of them have lived in the U.S. for decades and lacked any criminal history, Winmill noted. Some are married to U.S. citizens or have children who are U.S. citizens, according to court documents.\n\nIn an e-mailed statement to The Associated Press, the Department of Homeland Security said Immigration and Customs Enforcement agents lawfully arrested the detainees during the raid, and added that “an activist judge is ordering lawbreakers to roam free.” \n\n\"The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country,” the department said.\n\nThe Oct. 19 raid at the privately operated outdoor track in Wilder was led by the FBI as part of an investigation into suspected illegal gambling. More than 200 officers from at least 14 agencies, including U.S. Immigrations and Customs Enforcement and Border Patrol, participated in the raid, detaining around 400 people for hours, including many U.S. citizens. \n\nWitnesses described aggressive tactics, including zip-tying children or separating young kids from their parents for an hour or more. Homeland Security Secretary Kristi Noem, whose agency oversees Border Patrol and ICE, denied that children were zip-tied. FBI spokesperson Sandra Barker initially said no restraints or rubber bullets were used on children but later amended that statement, replacing “children” with “young children.”\n\nThe raid resulted in only a handful of gambling-related arrests, while 105 people were arrested on suspicion of immigration violations. Many of them signed voluntary agreements to leave the country before they were able to talk to immigration lawyers, said Nikki Ramirez-Smith, an immigration attorney whose firm is representing 15 of the people released this week. \n\nJust 18 people detained in the raid have sought their release in the federal courts in Idaho, according to online court records. One of them had that request initially dismissed after a judge found that they did not include enough detail in their court filing, but the judge also gave them 30 days to try again. Another person is now pursuing release through a different federal court after they were transferred to a detention facility in a different state.\n\nThe federal judge in Idaho said that nearly all of his colleagues who have faced similar requests from immigration detainees have come to the same conclusion: That non-citizens who are detained while already present in the United States are entitled to due process rights. \n\n“Treating the detention of noncitizens stopped at or near the border differently from noncitizens who reside within the country is not an anomaly. Instead, it reflects the long-recognized distinction in our immigration laws and the Constitution that due process protections apply to noncitizens residing within the country but not those stopped at or near the border,” Winmill wrote.\n\nRamirez-Smith said Winmill's release orders do “a great job of putting into perspective what the issues are.\" \n\n“They’ll just stay home with their families, and we’ll file the applications for relief in immigration court, and they’ll get a court hearing. Those trial dates will probably be years out,” she said, because of a hefty backlog of more than 3 million cases in immigration courts.\n\nStill, President Donald Trump has taken steps to reduce the backlog, instructing judges during his first term to deny entire categories of asylum claims such as for victims of gang or domestic violence. \n\nDuring his current term, the Trump administration has fired dozens of immigration judges, and authorized about 600 military lawyers to work as temporary immigration judges. The administration has also frequently turned what would normally be routine immigration hearings into deportation traps, with government lawyers quickly dismissing asylum cases so the migrants who sought asylum can be immediately arrested in the courthouse halls.","summary":"A federal judge has ordered the release of 16 people detained by immigration officials during an FBI-led raid at a rural Idaho racetrack last month","url":"https://www.independent.co.uk/news/idaho-one-fbi-boise-kristi-noem-b2869562.html","image":"https://static.independent.co.uk/2025/11/21/00/Immigration_Gambling_Raid_20626.jpg?width=1200","video":null,"publish_date":"2025-11-21 00:27:52","author":"Rebecca Boone","authors":["Rebecca Boone"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.258},{"id":381067662,"title":"Russia-Ukraine war: List of key events, day 1,366","text":"Ukrainian President Volodymyr Zelenskyy’s office said he had “officially received a draft plan from the American side, which, according to the American side, can intensify diplomacy” to end Russia’s war on Ukraine.\n\nPresident Zelenskyy also said, in a post on Facebook, that he had discussed “options for achieving real peace”, as well as “sequencing of our work and formats for dialogue [and] new impulses for diplomacy”, during a meeting with United States Secretary of the Army Daniel Driscoll in Kyiv on Thursday.\n\nZelenskyy’s office said the Ukrainian president had “agreed to work on the points of the plan in such a way that it would provide a dignified end to the war” during his meeting with Driscoll.\n\nZelenskyy’s updates followed news reports that the US and Russia have drafted a new framework to end the Russia-Ukraine war, including a 28-point plan from US President Donald Trump.\n\n“It is a good plan for both Russia and Ukraine, and we believe it should be acceptable to both sides. And we are working hard to get it done,” White House Press Secretary Karoline Leavitt said.","summary":"Here are the key events from day 1,366 of Russia’s war on Ukraine.","url":"https://www.aljazeera.com/news/2025/11/21/russia-ukraine-war-list-of-key-events-day-1366?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/11/2025-11-20T131018Z_390524552_RC2TJJ9Q7AQE_RTRMADP_3_UKRAINE-CRISIS-ATTACK-TERNOPIL-MISSING-1763683765.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-11-21 00:26:06","author":"Apps Support,Lyndal Rowlands","authors":["Apps Support","Lyndal Rowlands"],"language":"en","category":"politics","source_country":"QA","sentiment":0.175},{"id":381062068,"title":"Future Made in Australia: US aluminium producer Century Aluminum complains to Donald Trump about Australian subsidies","text":"WorldNorth AmericaTrade wars\n\nWashington | One of America’s largest aluminium producers says billions in subsidies to help Australian rivals decarbonise are unfairly handing them an advantage in global markets.Century Aluminum has urged US President Donald Trump’s top trade official to register the Albanese government’s $22.7 billion Future Made in Australia industrial policy, which aims to encourage onshore manufacturing, in its annual report on foreign trade barriers.Loading...Jessica Gardner is The Australian Financial Review’s United States correspondent. She was previously deputy editor - news. Connect with Jessica on Twitter. Email Jessica at jgardner@afr.com or Subscribe to save articleEmailLinkedInTwitterFacebookSubscribe to gift this articleGift 5 articles to anyone you choose each month when you subscribe.Subscribe nowAlready a subscriber? License articleFollow the topics, people and companies that matter to you.Find out moreRead MoreTrade warsTrump diplomacyTrump's White HouseTrump's AmericaProductivity CommissionWeekend FinAFR Weekend\n\nFetching latest articlesThis lawyer has collected more than 600 broochesHannah TattersallPrices for this under-the-radar watch brand are surgingWhy your mascara and skincare should be in a time capsuleAustralia’s 50 highest-paid CEOs in 2025 revealedPatrick DurkinWhy more company directors need to speak outWhy this CEO insists on 2 referee checks, and often does them herselfAn MJ Bale shorts-suit and a new IWC watch to ring in summerEugenie KellyWhy Mount Gambier’s rock-star grapes are worth travelling forForget the typical Euro hustle – Bordeaux is a place to pauseInside Australia’s most expensive country estateGreg BearupThe moment that led to a $750m coal fortune and a Ferrari obsessionLaundys sell pub on NSW’s Central Coast for $18.5 million","url":"https://www.afr.com/world/north-america/pm-s-future-made-in-australia-unfair-us-aluminium-giant-says-20251121-p5nhbm","image":"https://static.ffx.io/images/$zoom_0.1576%2C$multiply_4%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/7aa18a6c5132734c135dfb0a5f3274f5f5d458f1","video":null,"publish_date":"2025-11-21 00:26:01","author":"Jessica Gardner","authors":["Jessica Gardner"],"language":"en","category":"politics","source_country":"au","sentiment":0.118},{"id":381063054,"title":"\"We have a Communist coming\": White House renews attack on NYC mayor-elect Mamdani before meeting Trump","text":"Washington, DC [US], November 21 (ANI): White House Press Secretary Karoline Leavitt on Thursday (local time) said that President Donald Trump is willing to \"meet anyone\" and try to do \"what is right\" on behalf of the American people, as New York City mayor-elect Zohran Mamdani is set to meet Trump in the Oval Office, at the White House, on Friday.\n\nWhite House also renewed the attack on Mamdani ahead of his meeting, describing him as a \"communist\".\n\n\"... The President issued a statement that the Mayor-elect will be coming to the Oval Office tomorrow, so our teams are arranging those details... It speaks volumes that tomorrow we have a Communist coming to the White House, because that's who the Democrat Party elected as the Mayor of the largest city in the country,\" Leavitt told reporters during a briefing.\n\nThe White House Press Secretary claimed that New York City is turning much more \"Left\" than the President even anticipated.\n\n\"It's very telling but it also speaks to the fact that President Trump is willing to meet with anyone and talk to anyone and try to do what's right on behalf of the American people, whether they live in blue states or red states or blue cities and the city which is becoming much more Left than the President ever anticipated in his many years of living in New York himself,\" she added.\n\nEarlier on Wednesday (local time), US President Donald Trump announced that New York City's mayor-elect, Zohran \"Kwame\" Mamdani, is scheduled to meet him at the Oval Office on Friday.\n\nIn a Truth Social post, Trump wrote, \"Communist Mayor of New York City, Zohran 'Kwame' Mamdani, has asked for a meeting. We have agreed that this meeting will take place at the Oval Office on Friday, November 21st. Further details to follow!\" \n\nThe announcement follows months of sharp public exchanges between the two.\n\nAccording to The New York Times, Mamdani's team recently reached out to the White House to seek a meeting focused on New York's affordability crisis, signalling a shift in tone after their confrontational campaign season.\n\nDuring his campaign, Mamdani had described Trump as a threat to democracy and said he alone had the \"backbone\" to challenge him. (ANI)","url":"https://aninews.in/news/world/us/we-have-a-communist-coming-white-house-ahead-of-trump-mamdani-meet20251121055557","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251121002538.jpg","video":null,"publish_date":"2025-11-21 00:25:57","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.112},{"id":381064858,"title":"\"We have a Communist coming\": White House renews attack on NYC mayor-elect Mamdani before meeting Trump","text":"Washington, DC [US], November 21 (ANI): White House Press Secretary Karoline Leavitt on Thursday (local time) said that President Donald Trump is willing to \"meet anyone\" and try to do \"what is right\" on behalf of the American people, as New York City mayor-elect Zohran Mamdani is set to meet Trump in the Oval Office, at the White House, on Friday.\n\nWhite House also renewed the attack on Mamdani ahead of his meeting, describing him as a \"communist\".\n\n\"... The President issued a statement that the Mayor-elect will be coming to the Oval Office tomorrow, so our teams are arranging those details... It speaks volumes that tomorrow we have a Communist coming to the White House, because that's who the Democrat Party elected as the Mayor of the largest city in the country,\" Leavitt told reporters during a briefing.\n\nThe White House Press Secretary claimed that New York City is turning much more \"Left\" than the President even anticipated.\n\n\"It's very telling but it also speaks to the fact that President Trump is willing to meet with anyone and talk to anyone and try to do what's right on behalf of the American people, whether they live in blue states or red states or blue cities and the city which is becoming much more Left than the President ever anticipated in his many years of living in New York himself,\" she added.\n\nEarlier on Wednesday (local time), US President Donald Trump announced that New York City's mayor-elect, Zohran \"Kwame\" Mamdani, is scheduled to meet him at the Oval Office on Friday.\n\nIn a Truth Social post, Trump wrote, \"Communist Mayor of New York City, Zohran 'Kwame' Mamdani, has asked for a meeting. We have agreed that this meeting will take place at the Oval Office on Friday, November 21st. Further details to follow!\" \n\nThe announcement follows months of sharp public exchanges between the two.\n\nAccording to The New York Times, Mamdani's team recently reached out to the White House to seek a meeting focused on New York's affordability crisis, signalling a shift in tone after their confrontational campaign season.\n\nDuring his campaign, Mamdani had described Trump as a threat to democracy and said he alone had the \"backbone\" to challenge him. (ANI)","url":"https://www.aninews.in/news/world/us/we-have-a-communist-coming-white-house-ahead-of-trump-mamdani-meet20251121055557","image":"https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20251121002538.jpg","video":null,"publish_date":"2025-11-21 00:25:57","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.112},{"id":381060890,"title":"Video Calling for Military to Ignore Orders From Commander in Chief Undermines Good Order and Discipline","text":"Six Democrat congressmen recently released a video directed at members of the U.S. military and intelligence communities imploring them to “refuse illegal orders” from President Donald Trump. As former members of the military and intelligence community, they should be ashamed of themselves and retract their insubordinate, ignorant, and politically motivated diatribe.\n\nThe video, posted earlier this week, was created by Sen. Elissa Slotkin, D-Mich., Sen. Mark Kelly, D-Ariz., Rep. Chris Deluzio, D-Pa., Rep. Maggie Goodlander, D-N.H., Rep. Chrissy Houlahan, D-Pa., and Rep. Jason Crow, D-Colo.\n\nOne might expect that their military experience would make them more cautious, not less, about encouraging service members to reflexively doubt the legality of orders from America’s commander in chief. But that’s exactly what they did.\n\n“We know you are under enormous stress and pressure right now,” intoned Slotkin. “This administration is pitting our uniformed military and intelligence community professionals against American citizens,” Kelly, Slotkin, and Crow added. \n\nReally? How?\n\nThese claims are simply false, no matter how fearful the tone. Military recruiting and morale are at historic highs. If service members are truly under “enormous stress,” why are retention and recruitment numbers soaring?\n\n“Like us, you all swore an oath to protect and defend this Constitution,” the congressmen contend in the video. “Right now, the threats to our Constitution aren’t just coming from abroad but from right here at home.”\n\nReally? How exactly? They don’t say. \n\nThey add that the “laws are clear” that members of the military “can” and “must” refuse illegal orders and that no one has to carry out orders that “violate the law or our Constitution.” \n\nEveryone in the military knows that, but what does that have to do with anything?\n\nThroughout the short video, they never mention a single Trump administration order—or even a policy area—which they believe violates the Constitution. This vagueness reveals the real purpose of the video—political theater and yet another example of Trump Derangement Syndrome\n\nKelly claims “this administration is pitting” the military against citizens.” Where is that happening, because if it is, I’m against it too. Crickets.\n\nIs this about immigration enforcement? The deployment of National Guard troops to the border or in blue cities to assist federal immigration officers? They don’t say. \n\nWhen Crow was interviewed by Fox News’ Martha McCallum about the video he participated in and asked what specific orders that Trump issued to the military that are illegal, Crow couldn’t name one. \n\nThe reality is that the military already has robust systems in place to handle questions about the legality of orders and uses that system every day.\n\nService members are required to follow lawful orders. If they do not follow a lawful general order, or a specific order, they can—and often are—court-martialed under the Uniform Code of Military Justice (UCMJ) for a violation of Article 92, Failure to Obey an Order or Regulation. \n\nIf or when they are in doubt about an order’s legality (a rarity), service members can—and do—consult with a uniformed lawyer, called a judge advocate general officer. I know, because I served as a Navy JAG for 30 years and retired as a two-time commanding officer with rank of captain. \n\nThe president doesn’t pick up the phone and call a service member and order him to carry out a mission. Military orders flow through multiple levels—from the president to the secretary of defense, through the joint chiefs, to combatant commanders, to senior officers and eventually to units and individual service members. At each level, uniformed lawyers review orders and establish standing rules of engagement and specific rules of engagement for a particular mission. \n\nThese congressmen know this, but that apparently didn’t matter to them. \n\nMoreover, military personnel are already trained—and the Department of Defense Law of War manual clearly states—that military personnel have a duty not to comply with orders that are clearly illegal.\n\nHistory certainly provides instructive examples of genuinely unlawful orders. The My Lai Massacre during the Vietnam War, where Army Lt. William Calley ordered his soldiers to kill unarmed civilians stands as a clear case where subordinates should have refused, as the order was patently unlawful under the laws of war and the Uniform Code of Military Justice. \n\nIf this video was produced by a bunch of rag tag college students or Marxist professors, no one would care.\n\nThat’s not what happened here. These lawmakers’ actions and words undermine good order and discipline in the armed forces by encouraging U.S. military personnel to question the orders of the commander in chief of the armed forces for no good reason, based on nothing more than mere political disagreement.\n\nThe video is full of dishonorable statements from people who should know better. By calling on service members to resist Trump’s orders, they are essentially asking military members to make political judgments about which policies to implement—a direct assault on civilian control of the military.\n\nThe Democrat congressmen should withdraw the video and apologize. They are undermining the authority of the commander in chief of the armed forces—an authority constitutionally vested in the president.\n\nIf anyone is violating their oath to “support and defend the Constitution,” it is them. Encouraging military personnel to disregard legitimate presidential authority based on unspecified, partisan grievances doesn’t protect the Constitution—it subverts it.","summary":"Six Democrat congressmen recently released a video directed at members of the U.S. military and intelligence communities imploring them to “refuse illegal orders” from President... Read More\n\n\nThe post Video Calling for Military to Ignore Orders From Commander in Chief Undermines Good Order and Discipline appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/11/20/video-calling-for-military-ignore-orders-from-undermines-good-order-and-discipline/","image":"https://www.dailysignal.com/wp-content/uploads/2025/11/251120_Trump_Salutes.jpg","video":null,"publish_date":"2025-11-21 00:25:15","author":"Cully Stimson","authors":["Cully Stimson"],"language":"en","category":"politics","source_country":"us","sentiment":-0.316}]}