{"offset":0,"number":50,"available":21239,"news":[{"id":283930804,"title":"Trump’s ‘Golden Age’–Will His Fast-Paced Orders Hold Up?","text":"Jan-25-2025\n\nPresident Donald Trump wasted no time undoing executive orders from the Biden administration. From closing down the southern border to leaving the World Health Organization, the 47th president is determined to usher in an age of prosperity for Americans. But can his orders hold up? Will he need congressional approval? And what a...","summary":"President Donald Trump wasted no time undoing executive orders from the Biden administration. From closing down the southern border to leaving the World Health Organization, the 47th president is determined to usher in an age of prosperity for Americans. But can his orders hold up? Will he need congressional approval? And what about legal challenges? [&#8230;]","url":"https://www.theepochtimes.com/epochtv/trumps-golden-age-will-his-fast-paced-orders-hold-up-5798882","image":"https://img.theepochtimes.com/assets/uploads/2025/01/26/id5798891-IR_EXECUTIVE-ORDERS_HD_TN-2.jpg","video":null,"publish_date":"2025-01-26 01:00:38","author":"Arleen Richards","authors":["Arleen Richards"],"language":"en","source_country":"us","sentiment":-0.058},{"id":283930156,"title":"Astonishing reason why Dana White stopped Conor McGregor vs Logan Paul from happening","text":"EXCLUSIVEAstonishing reason why Dana White stopped Conor McGregor vs Logan Paul from happening\n\nREAD MORE: McGregor and Paul join forces to watch Trump's inauguration\n\nBy RUSS WEAKLAND and OLIVER SALT\n\nPublished: 00:33 GMT, 26 January 2025 | Updated: 00:49 GMT, 26 January 2025\n\nDana White blocked Conor McGregor's proposed boxing exhibition against Logan Paul because of his hatred for the WWE superstar's brother Jake, a source has told DailyMail.com.\n\nMcGregor, who has not competed in the UFC for three-and-a-half years, was recently in talks over a potential $250million showdown with Logan in Mumbai, India later this year.\n\nThe highly-anticipated event was reportedly set to involve India's billionaire Ambani family, despite their involvement never being confirmed publicly.\n\nHowever, McGregor revealed earlier this week that negotiations are now over because the UFC refused to approve the bout.\n\nGiven he is still under contract, the Irishman is unable to take part in combat events away from the MMA promotion without its blessing.\n\nAnd while many would assume the UFC's decision to reject the exhibition is due to their desire to see McGregor back in an Octagon, DailyMail.com understands that White's deep dislike for Logan's younger brother is the reason it isn't happening.\n\nDana White stopped Conor McGregor (right) from fighting Logan Paul (left) because of his hatred for the WWE superstar's brother Jake (center), a source has told DailyMail.com\n\nWhite's deep dislike for Jake Paul meant he had no intention of letting McGregor face Logan\n\nConor McGregor and Logan Paul join forces to watch Trump's inauguration\n\nThe UFC president has traded insults with Jake Paul in the media for years, with the YouTuber-turned-boxer frequently accusing him of underpaying his fighters and treating them inadequately.\n\nDana has also been highly critical of Jake's foray into boxing, including when he took on a 58-year-old Mike Tyson back in November.\n\n'Dana White hates Jake Paul,' a source told DailyMail.com after McGregor revealed the UFC blocked his proposed fight against Logan. \n\n'There is a constant tumultuous attitude towards each other, and they have a never-ending feud because Jake continues to call out Dana on how he treats his fighters and how they get paid. \n\n'And for Dana's part, he thinks Jake is making the world of boxing a complete joke. He hates the popularity Jake has received. Dana hated the Tyson fight and just hates everything Jake has given boxing. Dana thinks it is a complete joke.'\n\n'Conor and Logan put together their fight by themselves. All the money and the hype would go through them, and that is a no go for Dana,' the source continued.\n\n'He would have potentially considered it to be done if it wasn't Logan, but Dana's hate for Jake is the fuel that was needed to instantly say no. Dana doesn't want the Paul brothers to benefit financially ever if it takes away from his own bottom line. \n\n'The feud runs deep and will remain petty. It will be a cold day in hell before Dana and the Paul brothers are on the same page.\n\nMcGregor was in talks over a potential $250m boxing showdown with Logan in Mumbai\n\nBut White, his boss at the UFC, blocked the fight due to his dislike for Logan's brother Jake\n\nThe UFC president still has McGregor under contract, with two fights remaining on his deal\n\n'The only thing they all agree on is Donald Trump. But even the president couldn't get Dana White and the Paul brothers in any type of agreement to work together if he wanted, that is how deep this goes.'\n\nSpeaking to the press after the pair were seen at Donald Trump's inauguration together, McGregor emphasized that he has no control over the situation despite his desire to fight Logan.\n\nThe former two-weight UFC champion claimed both he and Logan, who enjoyed an exhibition with Floyd Mayweather in 2021, were ready to fight under the TKO banner, which oversees both the UFC and WWE, before the UFC pulled the plug.\n\n'The UFC just aren't into it,' McGregor said. 'The offer was there on the table, in writing, both athletes we'll say—he's not a fighter—but whatever, both athletes under the TKO banner. UFC, WWE, both rising up. \n\n'The stock price of TKO Holding Group through the roof. New market in India opened up and booming. It was business savvy and business sense to make the fight happen, or should I say, the glorified spar happen.'\n\nIndiaLogan PaulUFC FightingJake PaulWWE\n\nShare or comment on this article:\nAstonishing reason why Dana White stopped Conor McGregor vs Logan Paul from happening\n\nAdd comment","summary":"McGregor, who has not competed in the UFC for three-and-a-half years, was recently in talks over a potential $250million showdown with Logan in Mumbai, India later this year.","url":"https://www.dailymail.co.uk/sport/mma/article-14325527/conor-mcgregor-logan-paul-dana-white-ufc-boxing.html","image":"https://i.dailymail.co.uk/1s/2025/01/25/22/94517035-0-image-m-12_1737843557545.jpg","video":null,"publish_date":"2025-01-26 00:49:50","author":"Editor,Oliver Salt,Russ Weakland","authors":["Editor","Oliver Salt","Russ Weakland"],"language":"en","category":"sports","source_country":"gb","sentiment":-0.398},{"id":283931794,"title":"President Donald Trump is shaping Canada's race to find a leader","text":"President Donald Trump is shaping Canada's race to find a leader Canada's ruling party leadership race is being shaped by President Trumps threat to impose tariffs - with every candidate pitching themselves as the leader who can face him down.\n\n President Donald Trump is shaping Canada's race to find a leader\n\n January 25, 20257:34 PM ET\n\n Heard on All Things Considered\n\n Sheena Rossiter\n\n President Donald Trump is shaping Canada's race to find a leader\n\n Canada's ruling party leadership race is being shaped by President Trumps threat to impose tariffs - with every candidate pitching themselves as the leader who can face him down.","summary":"Canada's ruling party leadership race is being shaped by President Trumps threat to impose tariffs - with every candidate pitching themselves as the leader who can face him down.","url":"https://www.npr.org/2025/01/25/nx-s1-5270909/president-donald-trump-is-shaping-canadas-race-to-find-a-leader","image":"https://media.npr.org/include/images/facebook-default-wide.jpg","video":null,"publish_date":"2025-01-26 00:34:26","author":"President Trumps,Sheena Rossiter","authors":["President Trumps","Sheena Rossiter"],"language":"en","category":"politics","source_country":"us","sentiment":0.164},{"id":283931748,"title":"Senate confirms Noem as Trump’s homeland security secretary","text":"WASHINGTON (AP) — The Senate confirmed Kristi Noem as homeland security secretary on Saturday, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and President Donald Trump’s plans to clamp down on illegal immigration.\n\nRepublicans kept the Senate working Saturday to install the latest member of Trump’s national security team on a 59-34 vote.\n\nDefense Secretary Pete Hegseth was also confirmed in a dramatic tie-breaking vote Friday night, joining Secretary of State Marco Rubio and CIA Director John Ratcliffe. The Senate will next vote Monday evening on Scott Bessent’s confirmation as treasury secretary.\n\nNoem, a Trump ally who was in her second term as governor, received seven votes from Democrats. Republicans, who already held the votes necessary to confirm her, have expressed confidence in her determination to lead border security and immigration enforcement.\n\nIn a statement afterward, she pledged “to secure our southern border and fix our broken immigration system” while working to “detect and prevent terror threats and will deliver rapid assistance and disaster relief to Americans in crisis.”\n\nNoem was scheduled to be sworn in by Vice President JD Vance on Saturday afternoon, but that was called off after she was delayed, according to a person familiar with the events who was not authorized to discuss them and spoke on condition of anonymity.\n\nThe homeland security secretary oversees U.S. Customs and Border Protection, Immigration and Customs Enforcement and Citizenship and Immigration Services. Beyond those agencies, the department is also responsible for securing airline transportation, protecting dignitaries, responding to natural disasters and more.\n\nSenate Majority Leader John Thune, R-S.D., said Friday that “fixing this crisis and restoring respect for the rule of law is one of President Trump and Republicans’ top priorities. And it’s going to require a decisive and committed leader” at the department.\n\nDemocrats are split on how to handle border enforcement and immigration under Trump, with some warming to his hard-line stand.\n\nStill, Senate Democratic leader Chuck Schumer of New York, as well as most other Democrats, voted against Noem. He pointed to “bipartisan solutions to fix the mess at our border,” adding that Noem “seems headed in the wrong direction.”\n\nTrump is planning major changes to how the department functions, including involving the military in immigration enforcement and reshaping the Federal Emergency Management Agency. Those plans will immediately put Noem in the spotlight after the new president visited recent disaster sites in North Carolina and California on Friday.\n\nDuring her Senate hearing, Noem was repeatedly asked by Democratic senators whether she would administer disaster aid to states even if Trump asked her not to.\n\nNoem avoided saying she would defy the president, but told lawmakers, “I will deliver the programs according to the law and that it will be done with no political bias.”\n\nSix people cycled through as homeland security secretary during Trump’s first four years in office.\n\nNoem, who held her state’s lone U.S. House seat for eight years before becoming governor in 2019, has risen in the GOP by tacking closely with Trump. At one point, she was even under consideration to be his running mate.\n\nHer political stock took a momentary dip, however, when she released a book last year containing an account of her killing her hunting dog, as well as a false claim that she once met with North Korean leader Kim Jong Un.\n\nFollowing her confirmation, she was succeeded as South Dakota governor by Lt. Gov. Larry Rhoden, a rancher and former state House member who was elected alongside Noem in 2018.\n\nNoem will be tasked with delivering on Trump’s favorite issue, border security. The president’s goals of deporting millions of people who entered the country illegally could put Noem, with her experience governing a rural state and growing up on a farm, in a difficult position. In South Dakota, many migrants, some in the country without permanent legal status, power the labor-heavy jobs that produce food and housing.\n\nShe has so far pledged to faithfully execute the president’s orders and copied his talk of an “invasion” at the U.S. border with Mexico.\n\nNoem joined other Republican governors who sent National Guard troops to Texas to assist Operation Lone Star, which sought to discourage migrants. Her decision was especially criticized because she accepted a $1 million donation from a Tennessee billionaire to cover some of the deployment cost.\n\nShe said she opted to send National Guard troops “because of this invasion,” adding that “it is a war zone down there.”\n\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)","summary":"WASHINGTON (AP) — The Senate confirmed Kristi Noem as homeland security secretary on Saturday, putting the South Dakota governor in charge of a sprawling agency...","url":"https://whdh.com/news/senate-confirms-noem-as-trumps-homeland-security-secretary/","image":"https://whdh.com/wp-content/uploads/sites/3/2021/09/Noem.jpg?quality=60&strip=color","video":null,"publish_date":"2025-01-26 00:34:25","author":"Associated Press,Owen Boss","authors":["Associated Press","Owen Boss"],"language":"en","category":"politics","source_country":"us","sentiment":-0.114},{"id":283930414,"title":"Rachel Reeves eyes commuter town boom to boost home ownership and salvage economy","text":"Rachel Reeves has bet her economic credentials on a commuter town boom in a hope it will spark growth in the UK. \n\nThe chancellor is set to make a major announcement on planning reform amid questions about her own future in the Treasury and economic indicators putting Britain on the brink of a crisis.\n\nAhead of a speech later this week, the chancellor promised to “take an axe to red tape that slows down approval of infrastructure projects” – plans which Angela Rayner said would “make home ownership dream a reality for millions”. \n\nThe chancellor revealed new plans for more houses near commuter train stations, in what the government said was “bold reform of the planning system to deliver on the Plan for Change for working people”. \n\nShe also announced that environmental assessments for building homes and infrastructure will be replaced with a new, simpler system. \n\nThe latest attempt to boost growth comes as recent rises in borrowing costs threaten her economic plans, while leaders in the business sector continue to voice concerns over upcoming tax rises in April from her autumn Budget.\n\nWhile the prime minister insists he will keep Ms Reeves in post, with the economy on the brink of a recession and business confidence in the government at its worst point since the Covid pandemic, there have been growing questions over her position. \n\nThe chancellor is expected to use a speech on growth this week to support the proposed third runway at Heathrow airport and to endorse expansion at Gatwick and Luton.\n\nIt comes as part of a government push to cut red tape and stop “blockers” to its plans to build 1.5 million new homes over five years and secure 150 decisions on major infrastructure projects by the end of the parliament.\n\nSo far, according to Treasury estimates, it has taken 13 planning decisions and approved nine nationally significant infrastructure projects including airports, energy farms and housing developments.\n\nThe chancellor said Environmental Impact Assessments would be replaced by Environmental Outcome Reports as she turns to “avenues that others have shied away from” to kickstart the economy by cutting red tape and speeding up planning application approvals.\n\nThe Treasury described the current assessments as “voluminous and costly documents” and said the outcome reports will save developers time and money by being “simpler and much clearer... Whilst still protecting the environment.”\n\nNew additions to a list of organisations which developers must consult by law when relevant, such as the Environment Agency and the Forestry Commission, are also being halted while a review takes place.\n\nCouncils must ask statutory consultees for their views on planning applications relevant to them from a list which includes Historic England, Natural England and some parish-level bodies.\n\nBut the government now wants the default answer to be yes for development plans in key areas, such as “high potential locations” near commuter transport hubs.\n\nResponding to the announcement, deputy prime minister and housing secretary Angela Rayner said the government is going “even further to make the dream of homeownership a reality for millions and fix the housing crisis we inherited for good”.\n\n“From day one I have been clear that bold action is needed to remove the blockers who put a chokehold on growth. That’s why we are putting growth at the heart of our planning system.\n\n“Growth means higher wages, better living standards, families raising their children in safer homes, and the next generation taking their first steps onto the housing ladder”, Ms Rayner said.\n\nThe Planning and Infrastructure Bill, which aims to remove barriers which prevent construction, and to get projects approved faster, will be introduced to parliament in spring, Ms Reeves confirmed.\n\nA working paper with further detail on the bill is being published on Sunday.\n\nThe chancellor said: “I am fighting every single day in our mission to kickstart the economy, deliver on our Plan for Change, and make working people better off. That includes avenues that others have shied away from.\n\n“Too often the answer to new development has been ‘no’. But that is the attitude that has stunted economic growth and left working people worse off. We need to do things differently and that journey began as soon as I started at the Treasury in July. These are our next steps and I can say for certain, there is more to come.”\n\nThe latest announcement comes after Ms Reeves said the UK needs to learn from Donald Trump by being more positive and showing off its strengths, signalling a shift in approach to Britain’s faltering economy.\n\nThe chancellor said people should be “shouting from the rooftops” and banging the drum for the UK following her trip to the World Economic Forum in Davos this week, where she met global investors in her latest attempt to boost the economy after new figures showed only slight growth.\n\nThe remarks are a change in tune for the under-pressure chancellor, who has previously been accused of “talking Britain down”.","summary":"Chancellor promises ‘bold reform of the planning system to deliver on the Plan for Change for working people’","url":"https://www.independent.co.uk/news/uk/politics/rachel-reeves-economic-growth-speech-b2686314.html","image":"https://static.independent.co.uk/2025/01/25/00/SEI237046142.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/ly23eZMH-4VHSaSK0.mp4","publish_date":"2025-01-26 00:33:44","author":"Millie Cooke","authors":["Millie Cooke"],"language":"en","source_country":"gb","sentiment":-0.069},{"id":283931792,"title":"Taking stock of President Trump's busy first week in office","text":"Taking stock of President Trump's busy first week in office In his first week back in office, President Donald Trump took action on things from immigration and the economy to health, foreign policy and many pardons.\n\n Taking stock of President Trump's busy first week in office\n\n January 25, 20257:32 PM ET\n\n Heard on All Things Considered\n\n Domenico Montanaro\n\n Jason Fuller\n\n Pien Huang\n\n Taking stock of President Trump's busy first week in office\n\n In his first week back in office, President Donald Trump took action on things from immigration and the economy to health, foreign policy and many pardons.","summary":"In his first week back in office, President Donald Trump took action on things from immigration and the economy to health, foreign policy and many pardons.","url":"https://www.npr.org/2025/01/25/nx-s1-5271511/taking-stock-of-president-trumps-busy-first-week-in-office","image":"https://media.npr.org/include/images/facebook-default-wide.jpg","video":null,"publish_date":"2025-01-26 00:32:24","author":"Domenico Montanaro","authors":["Domenico Montanaro"],"language":"en","category":"politics","source_country":"us","sentiment":0.285},{"id":283929780,"title":"Donald Trump Teases Possible Backtrack on Policy He Just Enacted","text":"President Donald Trump announced that he would consider rejoining the World Health Organization (WHO) if someone were to \"clean it up a little\" and the U.S. were to contribute significantly less money to the agency.Newsweek reached out to the WHO and White House for comment by email on Saturday evening.Why It MattersTrump signed a raft of executive orders during his first week back in office, including a declaration to exit the WHO, which he criticized for \"mishandling\" the COVID-19 pandemic and \"unfairly\" asking for what he deemed to be an excessive amount of money from the U.S.Speaking to the Vegas crowd on Saturday, he told the Vegas crowd that the U.S. contributed $500 million to the WHO while China only contributes $39 million. He argued that the sums didn't make sense considering the U.S. has a much smaller population than China - 339 million people compared to 1.4 billion people, respectively.NPR, examining the amount each country contributed, determined that the U.S. paid closer to $706 million (into two pools in which the U.S. contributed $264 million and $442 million for 2024-2025) compared to China's $184 million (into two pools in which China contributed $181 million and $2.4 million).What To KnowTrump made the surprise comment at his Las Vegas rally, which capped a frantic week that included visits on Friday to both the North Carolina and Los Angeles disaster areas, where hurricane and wildfire damage remained fresh.The rally was mainly intended as a \"Thank You\" to voters after he upset expectations and won Nevada in the 2024 U.S. presidential election. The state had voted for Barack Obama twice, Hillary Clinton and Joe Biden in the previous elections.Seemingly unprompted, Trump revealed that he would consider a return to the WHO, but that he would need to do so at a lower amount – mentioning $39 million, which he believes is the amount China pays – and if \"they ... clean it up.\"\"They offered me at $39 million, they said 'We'll let you back in for $39 million,' they're going to reduce it from [$500 million] to [$39 million], and I turned them down, because it became so popular I didn't know if it would be well received even at [$39 million],\" Trump said.\"But maybe we would consider doing it again, I don't know, maybe we would. They'd have to clean it up a bit,\" Trump said.What People Are SayingThe World Health Organization (WHO) this week in a statement said: \"The World Health Organization regrets the announcement that the United States of America intends to withdraw from the Organization. WHO plays a crucial role in protecting the health and security of the world's people, including Americans, by addressing the root causes of disease, building stronger health systems, and detecting, preventing and responding to health emergencies, including disease outbreaks, often in dangerous places where others cannot go.\"Adding, later in the statement: \"We hope the United States will reconsider and we look forward to engaging in constructive dialogue to maintain the partnership between the USA and WHO, for the benefit of the health and well-being of millions of people around the globe.\"Former MI6 chief Sir John Sawers told CNN's Christiane Amanpour this week: \"What happens when the United States withdraws from these agencies [like the World Health Organization] is it actually hands a gift to China. It just makes it much easier for China to assert itself.\"What Happens NextTrump has already withdrawn the U.S. from the WHO, but these comments repeat the pattern that Trump's allies have insisted upon that most threats, particularly monetary ones, are done for the sake of negotiations.As such, the WHO could respond to Trump and ask what standards would satisfy the president to bring the U.S. back into the fold.","summary":"President Donald Trump discussed his thoughts on the World Health Organization, expanding on some of the reasons he withdrew from the agency.","url":"https://www.newsweek.com/donald-trump-teases-possible-backtrack-policy-he-just-enacted-2020935","image":"https://d.newsweek.com/en/full/2573624/donald-trump-nevada-politics-rally.jpg","video":null,"publish_date":"2025-01-26 00:19:50","author":"Peter Aitken","authors":["Peter Aitken"],"language":"en","category":"politics","source_country":"US","sentiment":-0.053},{"id":283925040,"title":"US Marines begin arriving at border with Mexico following Donald Trump’s immigration crackdown","text":"Dramatic footage released by the Trump administration shows Marines arriving at the US border with Mexico after the President ordered a crackdown on illegal immigration.\n\nA video shared on social media by Dan Scavino, Donald Trump’s deputy chief of staff, shows troops marching into helicopters before those choppers touch down next to the border walls.\n\nWatch the footage in the video player at the top of this page\n\nThe video also shows the troops unloading their gear from the helicopters while conferring with local authorities.\n\nThe soldiers are part of an immediate deployment of 1500 troops to the border to help with constructing barriers.\n\nActing defence secretary Robert Salesses said the troop deployment was “just the beginning”.\n\n“In short order, the department will develop and execute additional missions in cooperation with DHS, federal agencies, and state partners to address the full range of threats outlined by the President at our nation’s borders,” Salesses said.\n\nOn Thursday, government officials said the administration was also prepared to send as many as 2000 additional troops if needed.\n\nOfficials said the troops would not be undertaking law enforcement at this stage. Any future decision on this would be made by the White House, they said.\n\nThe active duty forces will join roughly 2500 US National Guard and Reserve forces already there. Until this deployment, there were no active duty troops working along the roughly 3200km border.\n\nThe deployment, coming in Trump’s first week in office, was an early step in his long-touted plan to expand the use of the military along the border.\n\nIn one of his first orders on Monday, Trump directed the defence secretary to come up with a plan to “seal the borders” and repel “unlawful mass migration”.\n\n“This is something President Trump campaigned on,” said White House press secretary Karoline Leavitt.\n\n“The American people have been waiting for such a time as this — for our Department of Defence to actually implement homeland security seriously. This is a No.1 priority for the American people.”\n\nTrump said during his inaugural address on Monday that “I will declare a national emergency at our southern border. All illegal entry will immediately be halted, and we will begin the process of returning millions and millions of criminal aliens back to the places in which they came”.\n\nMilitary personnel have been sent to the border almost continuously since the 1990s to help address migration. drug trafficking and transnational crime.\n\n— With Associated Press","summary":"The video shows Marines arriving at the US border with Mexico after President Donald Trump ordered a crackdown on illegal immigration.","url":"https://thewest.com.au/politics/donald-trump/us-marines-begin-arriving-at-border-with-mexico-following-donald-trumps-immigration-crackdown-c-17510695","image":"https://images.thewest.com.au/publication/C-17510695/f41fba54c44efa77a3269bf513aed46a4db93cec-16x9-x0y7w1732h974.jpg?imwidth=1200","video":null,"publish_date":"2025-01-26 00:08:37","author":"David Johns","authors":["David Johns"],"language":"en","category":"politics","source_country":"au","sentiment":-0.148},{"id":283925596,"title":"US agencies told to fire diversity staff; gender-neutral 'X' passports stopped","text":"The Trump administration on Friday directed federal agencies to start terminating staffers working in positions related to diversity programmes, after placing them on paid leave earlier this week. \"Each agency, department, or commission head shall take action to terminate, to the maximum extent allowed by law, all DEI, DEIA, and 'environmental justice' offices and positions within 60 days,\" said a memo from the US Office of Personnel Management, referring to jobs aimed at boosting \"diversity, inclusion and accessibility.\"Earlier this week Trump had ordered govt agency heads to submit a written plan for reducing employees in DEI offices by Friday. The reference to environmental justice is new, however.117567408The state department said the US has ceased issuing passports with a gender-neutral 'X' option, following President Donald Trump's order limiting government recognition of transgender identity.The move rolls back the option first introduced under former president Joe Biden's administration and leaves an unknown number of people awaiting further guidance on the fate of their pending applications and already issued passports. Trump, shortly after taking office on Monday, signed an executive order requiring federal agencies to only give the option of male or female, as part of an array of actions aimed at quickly reversing policies enacted by his predecessor.On Saturday, the Senate confirmed Kristi Noem as homeland security secretary, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and Trump's plans to clamp down on illegal immigration. Noem, a Trump ally who is in her second term as governor, received some support from Democrats on the Senate Homeland Security and Governmental Affairs Committee when it voted 13-2 to advance her nomination earlier in the week. Republicans, who already hold the votes necessary to confirm her, have also expressed confidence in her determination to lead border security and immigration enforcement. afp","summary":"The Trump administration has directed federal agencies to terminate diversity programme staff within 60 days. The move includes halting the issuance of gender-neutral 'X' passports and scaling back environmental justice roles. Kristi Noem has been confirmed as homeland security secretary, tasked with enhancing border security and immigration enforcement.","url":"https://timesofindia.indiatimes.com/world/us/us-agencies-told-to-fire-diversity-staff-gender-neutral-x-passports-stopped/articleshow/117567395.cms","image":"https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-117567399/117567399.jpg","video":null,"publish_date":"2025-01-26 00:04:29","author":null,"language":"en","source_country":"in","sentiment":-0.117},{"id":283927158,"title":"CIA believes COVID-19 came from a lab, but evidence is inconclusive","text":"WASHINGTON — The CIA now believes the virus responsible for the COVID-19 pandemic most likely originated from a laboratory, according to an assessment released Saturday that points the finger at China even while acknowledging that the spy agency has “low confidence” in its own conclusion.\n\nThe finding is not the result of any new intelligence, and the report was completed at the behest of the Biden administration and former CIA Director William Burns. It was declassified and released Saturday on the orders of President Donald Trump’s pick to lead the agency, John Ratcliffe, who was sworn in Thursday as director.\n\nThe nuanced finding suggests the agency believes the totality of evidence makes a lab origin more likely than a natural origin. But the agency’s assessment assigns a low degree of confidence to this conclusion, suggesting the evidence is deficient, inconclusive or contradictory.\n\nEarlier reports on the origins of COVID-19 have split over whether the coronavirus emerged from a Chinese lab, potentially by mistake, or whether it arose naturally. The new assessment is not likely to settle the debate. In fact, intelligence officials say it may never be resolved, due to a lack of cooperation from Chinese authorities.\n\nThe CIA “continues to assess that both research-related and natural origin scenarios of the COVID-19 pandemic remain plausible,” the agency wrote in a statement about its new assessment.\n\nInstead of new evidence, the conclusion was based on fresh analyses of intelligence about the spread of the virus, its scientific properties and the work and conditions of China’s virology labs.\n\nLawmakers have pressured America’s spy agencies for more information about the origins of the virus, which led to lockdowns, economic upheaval and millions of deaths. It’s a question with significant domestic and geopolitical implications as the world continues to grapple with the pandemic’s legacy.\n\nRepublican Sen. Tom Cotton of Arkansas, chairman of the Senate Intelligence Committee, said Saturday he was “pleased the CIA concluded in the final days of the Biden administration that the lab-leak theory is the most plausible explanation” and he commended Ratcliffe for declassifying the assessment.\n\n“Now, the most important thing is to make China pay for unleashing a plague on the world,” Cotton said in a statement.\n\nChina’s embassy in Washington did not immediately return messages seeking comment. Chinese authorities have in the past dismissed speculation about COVID’s origins as unhelpful and motivated by politics.\n\nWhile the origin of the virus remains unknown, scientists think the most likely hypothesis is that it circulated in bats, like many coronaviruses, before infecting another species, probably racoon dogs, civet cats or bamboo rats. In turn, the infection spread to humans handling or butchering those animals at a market in Wuhan, where the first human cases appeared in late November 2019.\n\nSome official investigations, however, have raised the the question of whether the virus escaped from a lab in Wuhan. Two years ago a report by the Energy Department concluded a lab leak was the most likely origin, though that report also expressed low confidence in the finding.\n\nThe same year then-FBI Director Christopher Wray said his agency believed the virus “most likely” spread after escaping from a lab.\n\nRatcliffe, who served as director of national intelligence during Trump’s first term, has said he favors the lab leak scenario, too.\n\n“The lab leak is the only theory supported by science, intelligence, and common sense,” Ratcliffe said in 2023.\n\nThe CIA said it will continue to evaluate any new information that could change its assessment.","summary":"The assessment released Saturday points at China while acknowledging that the CIA has “low confidence” in its own conclusion.","url":"https://www.oregonlive.com/nation/2025/01/cia-believes-covid-19-came-from-a-lab-but-evidence-is-inconclusive.html","image":"https://www.oregonlive.com/resizer/v2/ZNDTFUIIONFOLJ5BQDM4NLTDJI.jpg?auth=6d1b9c153d8f8da3b2e3801f0327bd02217f31ac53cc804fed098da42799f2a8&width=1280&quality=90","video":null,"publish_date":"2025-01-26 00:01:42","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.279},{"id":283928056,"title":"Rachel Reeves sets sights on deal with Donald Trump to avoid massive trade tariffs","text":"Rachel Reeves has said she wants to do a deal with Donald Trump to avoid tariffs that would hike up prices. \n\n The new President has been threatening to slap taxes on imports to the US, and has singled out countries like Canada, Mexico and China as targets. The Chancellor insisted Mr Trump was worried about countries running massive trade surpluses with America, which the UK is not.\n\nBut she warned that barriers to trade would put up prices for ordinary people in the US as well as the UK. Ms Reeves told the Sunday Mirror: “President Trump wants to do deals around the world.\n\n“The UK economy is not the economy that has caused problems for President Trump. He's worried about countries that are running massive trade surpluses with the US - that is not the UK that is doing that.\n\n“So I will make the case that having free and open trade between our two great countries is incredibly important. There are a million British people who work for American firms but there are also a million Americans who work for British firms.\n\n“I don't think it's in either our interests to put up barriers to trade that will put up prices for working people in America and in Britain, and will make it harder for two countries that are closely entwined to trade with each other.\"\n\nAsked if she thinks she can do a deal with Trump, she said: “That's the plan.”\n\nIn 2023, the US was the UK's largest import and export partner for services, and the UK's largest export partner and second largest import partner for goods.\n\nThe UK imported £57.9billion of goods from the US - around 10% of all goods imports - and exported £60.4billion of goods - 15.3% of all goods exports, according to the latest figures from the Office for National Statistics.","summary":"US President Donald Trump has been threatening to slap tariffs on imports to the US, sparking fears the UK could be hit by higher taxes on trade, driving up prices at home","url":"https://www.mirror.co.uk/news/politics/rachel-reeves-sets-sights-deal-34552510","image":"https://i2-prod.mirror.co.uk/incoming/article34552656.ece/ALTERNATES/s1200/0_EXCLUSIVE-MAIN-copy.jpg","video":null,"publish_date":"2025-01-26 00:01:00","author":"Lizzy Buchan","authors":["Lizzy Buchan"],"language":"en","category":"politics","source_country":"gb","sentiment":0.078},{"id":283925036,"title":"Trump confirms halting aid to foreign countries","text":"WASHINGTON, January 26. /TASS/. New US President Donald Trump has confirmed on Saturday that he has put on hold Washington's aid to foreign nations.\n\n\"On day one, I directed every member of my cabinet to march all power at their disposal to defeat inflation and bring down the cost of daily life. We want to bring prices down. I imposed a federal hiring freeze, a federal regulation freeze, a foreign aid freeze,\" he said during a rally in Las Vegas, Nevada.\n\nAmong other measures aimed at tackling inflation, Trump also listed the creation of a new US agency, DOGE (Department of Government Efficiency), charged with boosting the efficiency of the US government.\n\nEarlier, Politico wrote that US Secretary of State Marco Rubio had halted spending on most existing foreign aid grants for 90 days. According to the newspaper, the document leaves \"room for interpretation and does provide some exceptions.\" Military funding programs for Israel and Egypt will continue, but assistance to Ukraine, Jordan, and Taiwan will likely be suspended. Any decisions to continue, alter, or cease foreign aid funding programs will be made upon review by the Secretary of State. Reuters later reported that the United States Agency for International Development (USAID) had put projects related to providing help to Ukraine on hold.","summary":"Among other measures aimed at tackling inflation, Trump also listed the creation of a new US agency, Department of Government Efficiency, charged with boosting the efficiency of the US government","url":"https://tass.com/world/1904233","image":"https://tass.com/img/blocks/common/tass_logo_share_ru.png","video":null,"publish_date":"2025-01-26 00:00:27","author":"Tass","authors":["Tass"],"language":"en","category":"politics","source_country":"ru","sentiment":-0.03},{"id":283927522,"title":"The Cold Civil War Is Over. We Won.","text":"The civilizational inflection point in our cold civil war happened sometime between Donald Trump’s second inaugural address on Monday and the end of his new presidency’s second day on Tuesday. At some indeterminate moment between Monday’s soaring midday speech, in which the first nonconsecutive two-term president in over 130 years artfully took a sledgehammer to the entire Obama-Biden era legacy without so much as uttering the men’s names, and Tuesday’s epochal executive order coming as close as legally possible to banning wokeism throughout the republic, the war ended. And as with the English capturing New Amsterdam from Peter Stuyvesant and the Dutch centuries prior, it happened without firing a single shot.\n\nThe maestro of Mar-a-Lago is known to fancy the Village People hit “Y.M.C.A.,” but perhaps the more apropos tune to blast at 1600 Pennsylvania Avenue this week is Queen’s anthem, “We Are the Champions.”\n\nLet’s take a step back.\n\nBarack Obama, a Chicago radical in the Saul Alinsky/Bill Ayers mold, declared war on America during his 2008 presidential campaign. We know he declared war because he more or less said it: He vowed on Feb. 19, 2008, to “fundamentally transform America,” and one does not seek to “fundamentally transform” that which he loves and seeks to conserve. If that Freudian slip was our cold civil war’s Fort Sumter, then Obama’s presidency that followed was the extended opening campaign. Indeed, Obama did “fundamentally transform” America: He passed the nation’s largest new entitlement program since the Great Society, maligned cops and soured race relations, helped constitutionalize same-sex marriage, realigned our Middle East interests toward the fanatical Iranian regime, and more.\n\nThe first Trump presidency was, in many ways, the American people’s reaction to the rise of the woke Obama-era Democratic Party. The first Trump administration, for all its occasional internal dysfunction, brought a welcome course correction back toward normalcy and sanity: The economy was revving, the border was secure, and there were no new foreign wars. The tweets may have been a bit “mean,” for the pearl-clutchers who care about such things, but on an objective basis, things were really going quite well. That is, until the Wuhan virus arrived, St. George Floyd the Martyr had his fateful traffic encounter with Derek Chauvin, and the “Great Awokening” kicked into lightspeed.\n\nJoe Biden won a questionable election and proceeded to weaponize COVID-19 vaccines, the Jan. 6, 2021, U.S. Capitol jamboree, race, religion and so much more to finish the job once and for all against the Americans Obama so aptly demeaned as “bitter” clingers and Hillary Clinton ridiculed as “deplorables.” The Biden presidency, which saw both a vice president and a Supreme Court justice selected solely due to their status as “women of color,” embodied Peak Woke. And true to their antebellum race-centric partisan forebears, race-centric Biden-era “DEI” Democrats fought hard–a four-year-long Pickett’s Charge.\n\nBut it’s now all over. Trump won America’s cold civil war by adapting an old Reaganite mantra from the days of the actual Cold War against the Soviet Union. The Gipper proclaimed his bold Cold War strategy, differentiating himself from Henry Kissinger and the detente crowd, with this memorable line: “We win and they lose.” It is hardly an exaggeration to say that mentality, and that national policy, won the Cold War.\n\nAt some point during his four years in the political wilderness–perhaps around the time Biden and Jack Smith tried to incarcerate him, or perhaps around the time an assassin came within millimeters of murdering him on national television–Trump decided to adapt Ronald Reagan’s succinct victory formulation. The result? This astonishing first week of the second Trump term.\n\nThe apotheosis–the coup de grace for the woke beast–was Trump’s bombshell Tuesday evening executive order, “Ending Illegal Discrimination and Restoring Merit-Based Opportunity.” In one fell swoop, Trump purged the crux of wokeism–the neo-Marxist dichotomy of dueling “oppressed” and “oppressor” classes euphemistically known as so-called “diversity, equity and inclusion”–from American public and private life. Diversitycrats from the deep state to the Fortune 100 boardroom to the Ivy League all now face the same reality: Get out before it’s too late. Get out before the lawsuits start. Get out before Trump reprises his old “The Apprentice” TV role and yells, “You’re fired!”\n\nAnd so, the mass resignations have commenced. They will only accelerate from here. It’s all over. Hallelujah!\n\nIn his 1951 farewell address to Congress, Douglas MacArthur said that “in war, there is no substitute for victory.” Maybe it’s time for Trump to add a bust of MacArthur in the Oval Office, right next to the recently returned bust of Winston Churchill. Like the 45th and 47th president, those two men know a thing or two about winning.\n\nCOPYRIGHT 2025 CREATORS.COM\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"The civilizational inflection point in our cold civil war happened sometime between Donald Trump’s second inaugural address on Monday and the end of his new... Read More\n\n\nThe post The Cold Civil War Is Over. We Won. appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/01/25/the-cold-civil-war-is-over-we-won/","image":"https://www.dailysignal.com/wp-content/uploads/2025/01/donaldcivilwar.jpg","video":null,"publish_date":"2025-01-26 00:00:00","author":"Josh Hammer","authors":["Josh Hammer"],"language":"en","category":"sports","source_country":"us","sentiment":0.141},{"id":283929778,"title":"What Is the Mexico City Policy? Trump's Abortion Policy Change Explained","text":"President Donald Trump signed an executive order on Friday reinstating and significantly expanding the \"Mexico City Policy.\"The policy cuts off U.S. aid to any foreign organization that provides abortion services, counseling, or advocacy, marking the most extensive version of these restrictions since its creation in 1984.Newsweek contacted a Trump spokesperson via email on Saturday for comment.Why It MattersThe expansion transforms a $600 million family planning policy into a sweeping $12 billion restriction affecting global health assistance across multiple sectors.Organizations now face an unprecedented choice—either cease all abortion-related services, including counseling and advocacy, or lose crucial U.S. health assistance funding. This affects not just reproductive health services, but also critical programs for HIV/AIDS treatment, malaria prevention, maternal health, and childhood disease prevention.The impact extends beyond direct health care provision. Organizations must now certify they will not use funding from any source—including non-U.S. donors—for abortion-related services if they wish to receive U.S. assistance. This requirement will force health care providers to either significantly modify their services or seek alternative funding sources, potentially creating gaps in essential health services in vulnerable communities.Historical ContextThe \"Mexico City Policy\" originated at a 1984 United Nations (U.N.) conference where former Republican President Ronald Reagan first announced these restrictions on U.S. foreign aid, according to the Kaiser Family Foundation (KFF).For 41 years, the policy has served as a partisan touchpoint in American politics, with each party taking opposite stances. Every newly elected Democratic president has rescinded it, while every Republican president has reinstated it.Critics dubbed it the \"global gag rule\" because it restricts not just services but also speech—organizations cannot even discuss abortion with patients using any funding source.The U.S. has been sued in the past over the policy, though the lawsuits have been unsuccessful. The Planned Parenthood Federation of America sued the U.S. Agency for International Development in 1987 in an attempt to reverse the rule. The U.S. Supreme Court later dismissed the case.In 1989, the U.S. Court of Appeals for the District of Columbia ruled that the Mexico City Policy didn't violate constitutional rights to freedom of speech after the government was sued by the DKT Memorial Fund.Prior to Trump's expansion, the policy specifically targeted family planning programs. However, Trump's new directive explicitly extends these restrictions \"to global health assistance furnished by all departments or agencies,\" marking the broadest interpretation in the policy's history.Policy ImplementationTrump's expansion fundamentally changes how the policy works. According to KFF analysis, the restrictions now apply to assistance through three key departments:\nU.S. Agency for International Development (USAID)\nDepartment of State, including global HIV/AIDS programs\nDepartment of Defense (newly included under expansion)\nThis represents a significant broadening from the original policy, which only affected family planning assistance through USAID.Real-World ImpactThe policy's effects are already visible in vulnerable communities.MSI Reproductive Choices, formerly known as Marie Stopes International, a global healthcare provider, told National Public Radio (NPR) that it had to shut down 21 of its 22 mobile contraceptive clinics in Madagascar after losing U.S. funding, eliminating access to free contraceptives in many areas.Newsweek contacted MSI Reproductive Choices via email on Saturday for comment.What People Are SayingElyssa Koren, legal communications director for ADF International, an advocacy group that opposes abortion rights, told NPR: \"It prioritizes what developing countries actually need, which is real development assistance not the promotion of coercive or controversial agendas.\"Elizabeth Sully, principal research scientist at the Guttmacher Institute, told NPR that the policy \"silences what organizations can even say about abortion in their own countries.\"What Happens NextGlobal health organizations now face difficult choices about their operations and funding sources. Many will need to either modify their services or seek alternative funding to maintain operations.The policy's expanded scope means even organizations primarily focused on non-reproductive health services must evaluate their activities and partnerships.Health care providers and researchers will continue monitoring the policy's impact on global health outcomes, particularly in regions most dependent on U.S. aid.","summary":"Trump expands Reagan-era abortion policy, cutting billions in global health aid to groups that provide abortion services.","url":"https://www.newsweek.com/mexico-city-policy-trump-abortion-policy-change-explained-2020915","image":"https://d.newsweek.com/en/full/2573621/donald-trump.jpg","video":null,"publish_date":"2025-01-26 00:00:00","author":"Adeola Adeosun","authors":["Adeola Adeosun"],"language":"en","category":"politics","source_country":"US","sentiment":0.001},{"id":283926532,"title":"Lauren Sanchez’s response to the harsh criticism of her inauguration attire uncovered by insiders","text":"Insiders have revealed how Lauren Sanchez really felt about the brutal backlash she faced over her inauguration outfit.\n\nThe former journalist, 55, wore a plunging white Alexander McQueen pants suit to Donald Trump’s swear-in, and the sultry ensemble caused quite a stir on social media.\n\nShe left her jacket unbuttoned on top, showcasing a lace corset underneath and flaunting her ample cleavage.\n\nThe bold wardrobe choice sent social media into a frenzy, with one person branding it as ‘obscene’ and another urging, ‘Put them away for one day.’\n\nAfterwards, Fox News journalist Megyn Kelly even launched a scathing attack against Lauren.\n\nNow, a source has told Page Six how Jeff Bezos’ fiancée reacted to the barrage of criticism, and they insisted that she was completely unbothered by it.\n\n‘Lauren just doesn’t give a s**t,’ the insider said. ‘She does what she wants.’\n\nImmediately after the inauguration kicked off, many people took to X to share their thoughts on Lauren’s risqué ensemble.\n\n‘Good grief, Lauren Sanchez. Put them away for one day,’ one disgusted user urged. \n\n‘Lauren Sanchez is wearing a bra,’ wrote another shocked user. \n\n‘Just when I was luxuriating in the beauty and class of @FLOTUS45, in walks Lauren Sanchez wearing only a bra,’ slammed someone else. \n\n‘Lauren Sanchez complete inappropriate dress today,’ another agreed. ‘Really, a bra plainly visible? Today is NOT a night club event. Show some class and dignity.’ \n\nOn her Sirius XM show, The Megyn Kelly Show, conservative commentator Megyn accused Lauren of dressing ‘like a hooker’ at the inauguration.\n\n‘Have some dignity and some respect for your setting in your circumstances,’ she scathed. \n\n‘No one should be talking about your t**s. Sorry,’ the host continued in a furious tirade she posted on her Instagram account. \n\nMegyn called the fashion moment ‘absurd’ and said people ‘should be talking about the inauguration’ rather than Lauren’s clothing choices.\n\nLauren herself has stayed tight-lipped about the backlash, however, she did hit the like button on a few supportive posts about her look on Instagram. \n\nThe mother-of-three sat with her soon-to-be-husband Jeff at the event, as well as Meta CEO Mark Zuckerberg, and his wife, Priscilla Chan, as well as Google CEO Sundar Pichai and businessman Elon Musk.\n\nWhile some people slammed Lauren for her outfit, others seemed like they couldn’t get enough – like tech guru Mark.\n\nSome people suggested that the Facebook founder was slightly too interested in her chest after footage that showed him appearing to look down at her cleavage went viral.\n\n‘Mark having a hard time focusing,’ wrote one person on X afterwards. \n\n‘Mark Zuck keeps looking at Jeff Bezos’ [fiancée],’ said someone else.\n\n‘Zuck is enjoying the view from above,’ a third user added.\n\n‘Mark, eyes up,’ another person simply penned, while a different user theorized, ‘After this, Mark could have problems at home.’ \n\nAn insider told The Sun afterwards that Jeff doesn’t have a problem with the attention that Lauren gets from others. \n\n‘The thing with Jeff that nobody realizes is he’s essentially a massive nerd and always has been – that’s why he’s been so successful as a businessman,’ the source told the outlet. \n\n‘When he first got with Lauren he finally felt like the cool, popular kid at school, the hunky quarterback with a hot cheerleader on his arm.\n\n‘He loves going out with her looking smoking hot. He loves the looks other men give Lauren, it makes him feel powerful that she chose him.’ \n\nFor the balls later on in the even, Lauren switched into a stunning Dolce & Gabbana peach couture gown. \n\nThe ethereal dress boasted draped soft tulle sleeves with an elegant bodice that cinched in at the waist. \n\nShe accessorized with chandelier earrings dripping with pearls that were made by Lorraine Schwartz, who has created bespoke pieces for celebrities including Beyoncé, Blake Lively and Kim Kardashian.","summary":"Internewscast Journal\n\nInternewscast\n\n\nInsiders have revealed how Lauren Sanchez really felt about the brutal backlash&#8230;\n\n\nThis Post: Lauren Sanchez&#8217;s response to the harsh criticism of her inauguration attire uncovered by insiders first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/lauren-sanchezs-response-to-the-harsh-criticism-of-her-inauguration-attire-uncovered-by-insiders/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Insiders-reveal-how-Lauren-Sanchez-reacted-to.jpg","video":null,"publish_date":"2025-01-25 23:53:47","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.098},{"id":283923006,"title":"Braison Cyrus Speaks Out After Brother Trace Shares Concerned Post About Dad Billy Ray (Exclusive)","text":"Braison Cyrus is speaking out for the first time since his brother Trace Cyrus shared an open letter of concern addressed to their dad Billy Ray Cyrus following his inauguration performance.\n\n The 30-year-old music producer told PEOPLE that he has no ill will toward either his dad or siblings amid the Cyrus family's apparent strain.\n\n \"I don't have any bad feelings toward anyone in my family,\" Braison says.\n\n On Wednesday, Jan. 22, Trace — whom Billy Ray, 63, adopted in 1993 after marrying his now-ex-wife Tish Cyrus — shared the candid open letter to his dad on Instagram, writing that he and the rest of his siblings \"barely recognize\" him and were worried about him.\n\n \"It seems this world has beaten you down and it’s become obvious to everyone but you. You may be upset with me for posting this but I really could care less at this point,\" Trace, 35, wrote in part.\n\n Trace also referenced his sisters Brandi Cyrus, 37 — whom Billy Ray also adopted in 1993 — Miley Cyrus, 32, and Noah Cyrus, 25. Billy Ray also shares son Christopher Cody Cyrus, 32, with ex-girlfriend Kristin Luckey and son Braison with Tish, whom he divorced in 2022.\n\n \"Me and the girls have been genuinely worried about you for years but you’ve pushed all of us away,\" he wrote in his open letter.\n\n \"We are all hanging on to memories of the man we once knew & hoping for the day he returns. You’re not healthy Dad & everyone is noticing it,\" Trace continued in part.\n\n \"We haven’t talked in a while but I’m over a year and half clean from alcohol. Guess what? I feel amazing,\" he added. \"I don’t know what you’re struggling with exactly but I think I have a pretty good idea & I’d love to help you if you would open up and receive the help. You know how to reach me. Till that day comes I will continue to pray for you.\"\n\n Trace did not mention his dad's performance at Donald Trump's Liberty Inaugural Ball on Jan. 20 in the letter. At the event, Billy Ray experienced technical difficulties as he sang \"Achy Breaky Heart\" and his Lil Nas X collaboration \"Old Town Road,\" causing confusion and concern for audience members.\n\n Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories.\n\n On Friday, Jan. 24, a Cyrus family source told PEOPLE that the family is trying to work through their differences.\n\n “They got through the drama of 2024, and it's a new year,” the insider told PEOPLE. “Miley and Noah and Braison and Tish, they don't want to be this Cyrus family feud. This is not enjoyable for them.”\n\n Braison also recently praised his musician dad in a statement as he expressed excitement for Billy Ray's new record, which his son produced.\n\n “I've spent this past year getting to know my dad better than I ever have,” Braison said of working on his dad's forthcoming album. “I’ve heard stories, jokes and songs that I don’t think anyone else has.\"\n\n \"It’s an opportunity to tell my dad’s story through music and I’m fortunate to be able to take it. Music, stories and family are the most important things to my dad, so to bring the two together is a full circle endeavor,\" he added.","summary":"Braison and Billy Ray are currently collaborating on the 'Achy Breaky Heart' star's new album","url":"https://people.com/braison-cyrus-speaks-out-after-brother-trace-shares-concerned-post-about-dad-billy-ray-exclusive-8780520","image":"https://people.com/thmb/KsfLxiPtzmVmHMDijqVC3IlSq60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(738x227:740x229)/braison-billy-ray-cyrus-12525-ba0099e5b9814841a17e6a792327adc2.jpg","video":null,"publish_date":"2025-01-25 23:51:02","author":"Charlotte Phillipp,Rachel DeSantis","authors":["Charlotte Phillipp","Rachel DeSantis"],"language":"en","source_country":"US","sentiment":-0.214},{"id":283927352,"title":"Trace Cyrus claims dad Billy Ray Cyrus threatened legal action after family expressed concern over singer’s health","text":"Trace Cyrus claims his father, Billy Ray Cyrus, threatened to take legal action against him after he and other family members expressed concern for the “Achy Breaky Heart” singer’s health following his dad’s “embarrassing” performance at President Donald Trump’s post-inauguration Liberty Ball earlier this week.\n\n“Dad my message was beyond loving. I could have been extremely honest about a lot more but I don’t want to put your business out there like that. But for you to threaten me with legal action for wanting you to get help is a disgrace,” the Metro Station guitarist wrote on Instagram Saturday. \n\nThe 35-year-old went even further, telling his dad that “Pappy” (who is presumably Billy Ray’s father and Trace’s grandfather) is “looking down” on him with “such disappointment.”\n\nHe concluded, “You should be ashamed of yourself. I will always love you but I no longer respect you as a man. Everyone close to you is terrified to tell you how they really feel. I’m not. Get help.”\n\nEarlier this week, Trace sent a message to his dad — one that was “signed off” on by his siblings, including Miley — saying they are “genuinely worried” for the country singer and wanting him to seek help.\n\n“Since my earliest memories all I can remember is being obsessed with you and thinking you were the coolest person ever. I wanted to be just like you. The day you adopted me was the happiest day of my life,” Trace started.\n\n“Sadly the man that I wanted so desperately to be just like I barely recognize now. It seems this world has beaten you down and it’s become obvious to everyone but you,” he continued\n\n“Me and the girls have been genuinely worried about you for years but you’ve pushed all of us away.”\n\n“Noah desperately has wanted you to be a part of her life and you haven’t even been there for her. That’s your baby girl. She deserves better. Somehow just like me she still idolizes you though. We are all hanging on to memories of the man we once knew & hoping for the day he returns,” he added.\n\nWhile a majority of Trace’s siblings all agreed on the letter’s contents, his brother Braison showed his support for Billy Ray via his Instagram Stories, claiming their dad was “happy” and “healthy.”\n\n“I’ve spent the last year getting to know my dad better than I ever have,” the 30-year-old, who is producing Billy Ray’s forthcoming album, said. “After he spent a week in the hospital in the fall, I’m grateful that my dad is happy, healthy and ready to make this record.”\n\nTrace seemed to be unfazed by Braison’s response, saying, “Braison I can help you too. Damn. Man up boys.”","summary":"\"I will always love you but I no longer respect you as a man,\" Trace said of his father on Saturday.","url":"https://pagesix.com/2025/01/25/celebrity-news/trace-cyrus-claims-dad-billy-ray-cyrus-threatened-legal-action-after-family-expressed-concern-over-singers-health/","image":"https://pagesix.com/wp-content/uploads/sites/3/2025/01/97340307.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2025-01-25 23:50:54","author":"BreAnna Bell","authors":["BreAnna Bell"],"language":"en","source_country":"us","sentiment":-0.247},{"id":283921926,"title":"Facing up to the rise of global fascism and a new left project","text":"By Gurnam Singh | Opinion |\n\nWhether he was invoking the imagery of ancient Rome or the dark legacy of Nazi Germany, the underlying message behind Elon Musks recent salute at the Trump inauguration rally remains clear. It aligns with a broader authoritarian impulse that has been increasingly visible across the world and a glorification of dictatorship.\n\nAt a time when democracy is under threat in multiple regions, when populist strongmen continue to erode institutions, and when free speech is under siege from both state and corporate powers, such gestures cannot be dismissed as mere theatrics. They serve as reminders of how easily the ideals of democracy and freedom can be undermined when influential figures lend credence to authoritarian aesthetics.\n\nGrowing up as a Black/Asian youth in the UK during the 1970s, I experienced firsthand the hatred of the extreme right. This reality drew me to left-wing movements, particularly communist and Marxist groups. Although I never formally joined the Communist Party of Great Britain, I found ideological alignment with the International Marxist Group (IMG), which had broken away from the party in the 1960s.\n\nFrom the age of 16, I immersed myself in leftist literature, frequenting radical bookshops and reading the New Left Review, which was closely associated with the IMG. Though I cannot recall formally joining the group, I actively engaged with its ideas and distributed magazines like Socialist Challenge and Black Liberation and Socialism. Influential figures such as Tariq Ali helped shape my political consciousness, and to this day, my worldview remains deeply influenced by those formative years.\n\nAt the heart of the IMG’s ideology was the belief that capitalism is an inherently exploitative system that must be replaced by socialism. I understood communism as a vision for a classless society in which wealth and resources are collectively owned and distributed based on need. Inspired by the writings of Karl Marx and Friedrich Engels, I saw the potential for a world where workers had control over their own destinies, free from capitalist exploitation.\n\nHowever, as time passed, my faith in the communist project waned. The petty squabbles, betrayals, and ultimate failure of the grand revolutionary dream led me to question its viability. The historical record, from the Soviet Union to Maoist China, is littered with systemic failures, internal contradictions, and authoritarian tendencies that undermined the very principles of worker-led democracy.\n\nLeftist thinkers like Antonio Gramsci, Rosa Luxemburg, and Slavoj Žižek have long critiqued these failures. Luxemburg warned of authoritarian tendencies within Leninism, which she feared could suppress democracy within the workers’ movement itself. Gramsci highlighted the left’s failure to challenge capitalism’s cultural hegemony, leading to its political marginalisation. More recently, Žižek has pointed out that leftist movements often succumb to cycles of self-defeat, prioritising ideological purity over practical coalition-building.\n\nToday, these critiques are more relevant than ever. The left remains deeply fragmented, engaged in internal debates rather than united action. Meanwhile, the far right is surging globally, with figures like Donald Trump using nationalism and fear to consolidate power. Modern oligarchs like Elon Musk manipulate economic and technological forces, shaping public discourse and eroding democratic institutions.\n\nThe rise of authoritarianism is not a distant threat; it is unfolding before our eyes. Yet too many on the left remain ensnared in historical debates instead of addressing the immediate crisis. If history teaches us anything, it is that fascism thrives when progressives are divided. The 1930s serve as a stark warning of what happens when the left fails to mobilise against reactionary forces.\n\nThe failures of 20th century communism should not lead to inaction, nor should they deter us from fighting for justice. Economic equality, workers’ rights, racial justice, and environmental sustainability remain urgent priorities. However, we will not achieve these goals by engaging in ideological purity tests. The left must recognise that while traditional communist models have faltered, and perhaps now part of history, the core struggle against violence, exploitation and injustice remains as vital as ever.\n\nThis is not just a call to communists or socialists, it is a call to all who believe in collectivism, democracy, human rights, and a sustainable future. Our challenge is not to rebuild the Soviet Union, but to forge a broad, progressive alliance capable of resisting the tide of authoritarianism. The world cannot afford another historical failure this time, the stakes are even higher. The left must unite, or risk irrelevance in the face of resurgent fascism.\n\nGurnam Singh is an academic activist dedicated to human rights, liberty, equality, social and environmental justice. He is an Associate Professor of Sociology at University of Warwick, UK. He can be contacted at Gurnam.singh.1@warwick.ac.uk\n\n* This is the opinion of the writer and does not necessarily represent the views of Asia Samachar.\n\nRELATED STORY:\n\nThe Demise of the Akali Dal and the Badal Dynasty: What Next for the Panth? (Asia Samachar, 5 Aug 2024)\n\nASIA SAMACHAR is an online newspaper for Sikhs / Punjabis in Southeast Asia and beyond. You can leave your comments at our website, Facebook, Twitter, and Instagram. We will delete comments we deem offensive or potentially libelous. You can reach us via WhatsApp +6017-335-1399 or email: asia.samachar@gmail.com. For obituary announcements, click here","summary":"By Gurnam Singh &#124; Opinion &#124; Whether he was invoking the imagery of ancient Rome or the dark legacy of Nazi Germany, the underlying message behind Elon Musks recent salute at the Trump inauguration rally remains clear. It aligns with a broader authoritarian impulse that has been increasingly visible across the world and a glorification of","url":"http://asiasamachar.com/2025/01/26/facing-up-to-the-rise-of-global-fascism-and-a-new-left-project/","image":"http://asiasamachar.com/wp-content/uploads/2025/01/elon-musk_nazi-stye-salute_1.jpg","video":null,"publish_date":"2025-01-25 23:48:13","author":"Asia Samachar,Gurnam Singh","authors":["Asia Samachar","Gurnam Singh"],"language":"en","category":"politics","source_country":"my","sentiment":0.114},{"id":283926368,"title":"Hundreds take to the streets in Chicago to protest Trump's first week","text":"Hundreds took to Chicago’s streets Saturday in River North to protest Donald Trump’s first week in office.\n\nA coalition of more than 65 groups advocating for various causes came together at the protest and march, which had been rescheduled from Monday, the day of President Trump’s inauguration, due to frigid temperatures. Groups that had pushed for a ceasefire in Gaza were in lockstep with LGBTQ+ and immigrant rights groups as they protested Trump’s actions in the early days of his second term.\n\nThe president has signed a flurry of executive orders in his first week on immigration — including a blitz of immigration policies attempting to change where U.S. Immigration and Customs Enforcement can detain people and trying to end humanitarian parole programs — to fulfill his campaign promises of mass deportations, though some are already facing court injunctions. \n\nTrump’s border czar, Tom Homan, had said Chicago would be targeted for immigration enforcement, and media reports leaked of plans for large-scale immigration raids last week in Chicago, which have yet to materialize but continue to stoke fear.\n\n“Ceasefire was just our first demand; this isn’t over,” said organizer Jinan Chehade. “The system that backs genocide is the same one that builds walls. … This isn’t the time to back down. We’ve seen what can happen in a week. Together we fight, and together we’ll tear down every wall of oppression.”\n\nAfter rallying at Water Tower Place in Streeterville for an hour and a half, the group marched south down Michigan Avenue to bring chants of “Say it loud, say it clear, immigrants are welcome here,” across the river from Trump Tower.\n\nLeslie Ochoadieta, a 19-year-old resident of the north suburbs, said she came to the protest with her sister and cousin to be a voice for her parents, who came to the U.S. from Mexico more than 20 years ago. When she was in elementary school, her father was going through immigration court proceedings, instilling fear that has stayed with her since.\n\n“What if I come out of this courtroom without my dad?” Ochoadieta recalled.\n\nWhile her parents are in the middle of the immigration process and have their paperwork in order, there still has been a fear of being detained by immigration enforcement.\n\n“It gets worse every year; a lot of people don’t know what we feel,” Ochoadieta said. “I know my parents know their rights; we printed out their cards. [But also] we have their locations, we take them to work — we’re living in fear.”\n\nElizabeth Lopez, 33, of Hanover Park, took to the streets on behalf of her family, who are from Mexico, to make sure their voices were heard — specifically her undocumented relatives who have grappled with the fear of being deported for as long as she can remember.\n\nLopez said her family has felt the same fear Ochoadieta’s had, and it had only worsened in the week since Trump returned to the White House promising “mass deportations.”\n\n“It has affected our lives since I was a kid,” Lopez said. “[Now] they aren’t going to work. It breaks my heart; people shouldn’t have to live with this. They’re scared. It’s just constant.”\n\nShe said she even feared for herself because of Trump’s — so far empty — threats to end birthright citizenship for babies of non-citizens and unauthorized immigrants born in the United States, but that speaking on behalf of her relatives was important enough to protest and march.\n\n“We’re not alone in this,” Lopez said. “Do not give up. There’s a lot of people willing to fight. … [And] I’m tired of being quiet. This isn’t something I’ll back down on.”","url":"https://chicago.suntimes.com/politics/donald-trump/2025/01/25/hundreds-take-to-the-streets-in-river-north-to-protest-trumps-first-week-this-isnt-the-time-to-back-down","image":"https://cst.brightspotcdn.com/dims4/default/8cb84f1/2147483647/strip/true/crop/6000x3425+0+287/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F69%2F1b%2Fac0bb81d44739ec218bcd40d2f3b%2Fdsc-","video":null,"publish_date":"2025-01-25 23:32:55","author":"Violet Miller","authors":["Violet Miller"],"language":"en","category":"politics","source_country":"us","sentiment":-0.248},{"id":283927594,"title":"The Limits Of Madman Theory","text":"… How Trump’s Unpredictability Could Hurt His Foreign Policy\n\nEven though they have al-ready witnessed four years of a Donald Trump presi-dency, analysts have little certainty about how Trump plans to approach most countries in his second term. That’s exactly how he likes it. Since first running for pres-ident in 2016, Trump has positioned himself as an unpredictable leader and argued that doing so strength-ens U.S. foreign policy. During his first campaign, Trump argued, “We must as a nation be more un-predictable.” At a dinner in 2018, when discussing negotiations with North Korea, he called himself a “madman”—only partially tongue in cheek. Asked during his 2024 campaign how he would respond to a Chinese blockade of Taiwan, Trump responded, “I won’t have to, because [Xi Jinping] respects me and he knows I’m fucking crazy.”\n\nOther politicians and commen-tators have made similar claims. “Trump is, as his detractors and his supporters would say, unpredict-able,” Vice President JD Vance said in June. “I am 100 percent certain that unpredictability redounded to the benefit of the United States.” The Washington Post columnist Shadi Hamid recently argued that Trump’s madman strategy pressured Israel to accept a Gaza cease-fire. And a report from the America First Pol-icy Institute claimed that Putin did not invade Ukraine during Trump’s first term because “Putin could not be sure how Trump would respond.”\n\nTrump’s first term was, indeed, an exercise in unpredictability. He threatened North Korean leader Kim Jong Un with “fire and fury like the world has never seen.” But he then became the first American president to meet a North Korean leader and declared that the two “fell in love.” He dropped the U.S. military’s largest conventional bomb on militants in Afghanistan yet also started peace talks with the Taliban. He ordered a strike on Iran and then canceled it. He imposed tariffs on some American allies, such as Canada, while spar-ing others, such as Australia, often for no rhyme or reason. According to Axios, during trade negotiations with South Korea, Trump ordered his negotiating team to say, in refer-ence to him, “This guy’s so crazy he could pull out any minute.”\n\nTrump is hardly the first lead-er to explicitly embrace an erratic foreign policy. For decades, heads of state around the world have de-ployed what is known as madman theory: the idea that by acting in a highly volatile way, they can frighten opponents into conceding. During the Cold War, for instance, some strategists suggested that by appearing unstable, a U.S. leader might prompt communist states to take U.S. nuclear threats more seriously.\n\nBut Trump should be careful when it comes to madman theory, because scholarship suggests that it is very difficult to wield success-fully. In fact, it is rare that a reputa-tion for madness actually pays off internationally. Modern leaders and heads of state who have tried to seem mad often fail to convince their adversaries. Others succeed, only to find that their reputation for madness persuades opponents that they cannot be trusted to maintain peace. Trump will thus need to walk a fine line, persuading other states that he is mad enough to make good on his threats yet stable enough to stand by the agreements he makes. History suggests that won’t be easy.\n\nCrazy Like A Fox\n\nThe basics of madman theory date at least to 1517, when the politi-cal philosopher Niccolo Machiavelli argued that, under certain circum-stances, “it is a very wise thing to simulate madness.” But the modern notion was developed during the mid-twentieth century, when the advent of nuclear weapons posed a novel challenge for threat credi-bility. Because nuclear war would result in mutually assured destruc-tion for both sides and conventional conflict could easily escalate to the nuclear level, the U.S. and Soviet governments had strong disincen-tives to fight each other. This meant that threats by one against the other could easily be dismissed. Why, after all, would a leader of either country do something potentially suicidal in response to nonexistential threats?\n\nThe answer: by being crazy. A rational U.S. president or Soviet premier would seek to avoid a nu-clear confrontation at all costs. But a “convincingly mad” one, as the RAND defense strategist Daniel Ell-sberg put it in a 1959 lecture, could credibly threaten large risks. Other experts agreed. The economist and nuclear theorist Thomas Schelling wrote that a “paradox of deterrence is that it does not always help to be, or to be believed to be, fully rational, cool-headed, and in control of one-self.” The military theorist Herman Kahn argued that when dealing with a nuclear-armed leader who appears to be “stark, staring mad,” opponents must either yield to his demands or “accept the possibility of being annihilated.”\n\nThese strategists’ ideas soon gained a prominent adherent: U.S. President Richard Nixon. In fact, ac-cording to the memoirs of former White House Chief of Staff H. R. Haldeman, Nixon gave the concept its name. “I call it the Madman The-ory, Bob,” the incoming president said in 1968, when discussing how to compel North Vietnam to surren-der. “I want the North Vietnamese to believe that I’ve reached the point that I might do anything to stop the war.” Nixon suggested that his ad-visers could “slip the word” to the North Vietnamese that “we can’t restrain him when he’s angry—and he has his hand on the nuclear but-ton.” Shortly after entering office, Nixon and his National Security Ad-viser Henry Kissinger attempted to do just that. Following Kissinger’s instructions while visiting Moscow, the White House adviser Leonard Garment told Soviet officials that Nixon was “a dramatically disjoint-ed personality” who was “capable of barbaric cruelty,” “more than a little paranoid,” and “predictably unpredictable.”\n\nOther international leaders have also tried to put the theory into prac-tice. In the 1950s and 1960s, Soviet Premier Nikita Khrushchev delib-erately cultivated an image of in-sanity that, at least initially, some U.S. officials believed. Secretary of State John Foster Dulles said that Khrushchev was “obviously intoxicated much of the time,” “es-sentially emotional,” and “could be expected to commit irrational acts” without considering the con-sequences. Saddam Hussein was also viewed as a madman by foreign leaders, although there is no evi-dence that he cultivated this reputa-tion deliberately. A 1991 psychologi-cal profile by a U.S. analyst said that the Iraqi dictator’s personality was characterized by “messianic ambi-tion for unlimited power, absence of conscience, unconstrained ag-gression, and a paranoid outlook.” U.S. President Ronald Reagan called Libyan leader Muammar al-Qaddafi a “mad clown” and an “unpredict-able fanatic.” Reagan’s defense sec-retary, Caspar Weinberger, believed that Qaddafi possibly suffered “from an incurable venereal disease” that caused “occasional bouts of mad-ness exhibiting hysteria, bragga-docio, and extreme theatricalism.”\n\nMore recently, Russian President Vladimir Putin has developed a rep-utation for madness after invading Ukraine. In February 2022, Marco Rubio, then a senator and now the secretary of state, said that Putin appeared “to have some neuro/ physiological health issues”— warning that the Kremlin’s risk calculus had changed in danger-ous ways. Former British Prime Minister Boris Johnson said that Putin may be “an irrational actor” and “thinking illogically” about the effects of sanctions and the risks of war. Putin’s repeated threats to use nuclear weapons have only played into this idea.\n\nAssessments of North Korea’s Kim Jong Un have also raised ques-tions about madness. When asked in a 2017 television interview if the United States could rely on mutually assured destruction to deter North Korea, then National Security Ad-viser H. R. McMaster said that he was unwilling to “bet the farm, or a U.S. city” on Kim’s rationality. In a leaked 2017 conversation with then Philippine President Rodrigo Dute-rte, even the unpredictable Trump expressed uncertainty about wheth-er deterrence would work with the North Korean leader because Kim “could be crazy.”\n\nIs It Bad To Be Mad?\n\nMadman theory may be popular, but historically it has done little for its adherents. Nixon failed to per-suade the North Vietnamese and their Soviet allies of his madness, and he ultimately had to withdraw from Vietnam. During the Soviet Union’s efforts to seize control over all Berlin, Khrushchev threatened to use nuclear weapons and of-ten seemed to lose control of his emotions when meeting Western officials—yelling, gesturing, and turning red in the face. Yet he was unable to compel the United States to retreat. He later blinked during a standoff with Washington over placing nuclear missiles in Cuba, pulling them from the island. Sadd-am’s and Qaddafi’s perceived mad-ness led them to worse fates: they were removed from power by U.S. military interventions and then killed. Putin’s nuclear threats have succeeded at limiting Western mil-itary assistance to Kyiv, but only to a point. After strict initial restric-tions, Washington and its allies are now providing the Ukrainians with many kinds of advanced weap-ons, including long-range missiles, tanks, and fighter jets.\n\nThe most obvious reason for this shoddy track record is that it is hard for any leader, and especially lead-ers of nuclear-armed countries, to convince adversaries that their be-havior is fundamentally irrational. But plenty of leaders do manage to cultivate a reputation for insta-bility or extreme unpredictability, and they still fail. That is because by engaging in such behavior, lead-ers have trouble persuading oppo-nents that they will stand by any commitments. Persuading leaders of foreign governments to yield to a demand, after all, requires not just convincing them that resisting will be punished. It also requires convincing them that yielding will actually prevent punishment.\n\nConsider, for example, Putin’s threats to retaliate against the West for supporting Ukraine. In addition to invoking Russia’s nuclear arsenal, they feature threats to conventional-ly directly attack NATO countries. In November, for example, Putin said he might strike “the military facilities of those countries that allow their weapons to be used against our facili-ties.” Yet despite such drastic threats, Putin has failed to change Western policy. One reason might be that Western analysts doubt that Putin is prepared to strike a nuclear-armed adversary (NATO). But equally im-portant may be their doubts that complying with Putin’s demands will lead to peace. Russia hawks in the West have repeatedly argued that if Putin prevails in Ukraine he will hardly stop there; he will go on to attack other countries, including NATO members. The West, they say, is thus better off resisting Putin now than later.\n\nIt is hard for leaders who style themselves as mad to resolve this paradox. Leaders with a reputa-tion for unpredictability—or who encourage the perception that they might do almost anything, regard-less of the consequences—often struggle to make credible guaran-tees. So do leaders whose notoriety is based on abnormal or distorted preferences, such as ones associat-ed with fanaticism or extremism. Saddam’s insatiable appetite for conquest, for example, made him appear inherently drawn to con-flict. As a result, any promise he made of peace rang hollow. Such concerns underlay the George W. Bush administration’s fear that Iraq would inevitably attack if it obtained weapons of mass destruc-tion, helping justify its decision to invade the country.\n\nContinues in FOREIGN AFFAIRS (www.foreignaffairs.com), January 24, 2025.","summary":"&#8230; How Trump’s Unpredictability Could Hurt His Foreign Policy Even though they have al­ready witnessed four years of a Donald Trump presi­dency, analysts have little certainty about how Trump plans to approach most countries in his second term. That’s exactly how he likes it. Since first running for pres­ident in 2016, Trump has positioned himself [&#8230;]","url":"https://independent.ng/the-limits-of-madman-theory/","image":"https://independent.ng/wp-content/uploads/Trump-29.jpg","video":null,"publish_date":"2025-01-25 23:32:00","author":"Roseanne McManus","authors":["Roseanne McManus"],"language":"en","source_country":"ng","sentiment":-0.188},{"id":283919604,"title":"US Stops Issuing Gender-Neutral &#8216;X&#8217; Passports As Per Trump&#8217;s Directive","text":"The United States has stopped issuing passports with a gender-neutral “X” option following an executive order from President Donald Trump limiting government recognition of transgender identities.\nThe State Department announced that, in line with the executive order, the issuance of US passports will now reflect the individual's biological sex as defined in the order. This move reverses the option initially introduced under former President Joe Biden's administration, leaving many awaiting guidance on their pending applications and previously issued passports.\nA State Department spokesperson stated, “The department is no longer issuing US passports with X markers” and has “suspended processing of all applications seeking a different sex marker than that defined by the terms in the Executive Order.” They also mentioned that guidance regarding previously issued X sex marker passports is forthcoming, with updates to be posted on the department's travel website.\nShortly after taking office, President Trump signed an executive order mandating federal agencies to offer only male or female sex markers, asserting that “a person's sex is unchangeable.” This action is part of a broader effort to reverse policies from the previous administration, including initiatives promoting racial equity and protecting LGBTQ+ rights.\nThe State Department issued its first passport with a gender-neutral “X” designation in October 2021, following a lengthy legal battle by an intersex individual from Colorado. Regular processing for “X” passports began in early 2022. While the department has not disclosed how many \"X\" passports have been issued or requested, a study by UCLA Law School's Williams Institute estimated that over 16,000 people might apply for one annually.\nOn the campaign trail, Trump frequently criticized transgender policies, particularly regarding women's sports and medical care for minors, as part of his broader attack on diversity, equity, and inclusion (DEI) initiatives. On Monday, Trump ordered an immediate suspension of federal DEI programs, anti-discrimination policies, and recognition of transgender identities. These decisions have drawn sharp criticism from rights groups and are expected to face legal challenges.\nAlthough the federal government has rolled back the \"X\" option, many states still allow gender-neutral designations on drivers' licenses. Several other countries, including Australia, Canada, and Germany, also issue identification with an \"X\" gender marker.\nThe halt in issuing gender-neutral 'X' passports marks a significant shift in US policy regarding the recognition of transgender and non-binary identities. The decision has sparked a debate on the rights of individuals to have their gender identity accurately reflected in official documents. As the legal challenges unfold, the outcome will have far-reaching implications for the LGBTQ+ community and the broader fight for equality and recognition.\nThe international community will also be closely watching these developments, as the US policy shift may influence other countries' approaches to gender identity recognition. The ongoing dialogue and legal battles will shape the future of gender identity policies and the rights of transgender and non-binary individuals in the US and beyond.\nALSO READ: Thai Police Arrest British Man After Wife's Body Found In Yorkshire Dales","summary":"The US stops issuing gender-neutral &#8216;X&#8217; passports under President Trump&#8217;s directive, reversing previous policies and sparking debate on transgender rights and recognition.","url":"https://www.newsx.com/world/us-stops-issuing-gender-neutral-x-passports-as-per-trumps-directive/","image":"https://www.newsx.com/wp-content/uploads/2025/01/trumpppp-1.webp","video":null,"publish_date":"2025-01-25 23:31:09","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","category":"politics","source_country":"in","sentiment":-0.03},{"id":283931128,"title":"White House in talks to have Oracle, US investors take over TikTok, NPR reports - Reuters","text":"SummaryCompaniesTrump administration working on plan to tap Oracle, US investors to take over TikTok, NPR saysUnder reported deal, TikTok's Chinese owner ByteDance will have minority stakeNPR says terms of deal could change\n\nWASHINGTON, Jan 25 (Reuters) - The administration of U.S. President Donald Trump is working on a plan to save TikTok that involves tapping software company Oracle (ORCL.N), opens new tab and a group of outside investors to effectively take control of the app's global operations, National Public Radio reported on Saturday.\n\nUnder the deal being negotiated by the White House, TikTok's China-based owner, ByteDance, would retain a minority stake in the company, but the app's algorithm, data collection and software updates would be overseen by Oracle, which already provides the foundation of TikTok's Web infrastructure, NPR reported.\n\nAdvertisement · Scroll to continue\n\nThe NPR report cited two people with knowledge of the talks. The White House and Oracle had no immediate comment.\n\nThe short video app used by 170 million Americans was taken offline temporarily for users shortly before a law that said it must be sold by its Chinese owner ByteDance on national security grounds, or be banned, took effect on Jan. 19.\n\nTrump, after taking office a day later, signed an executive order seeking to delay by 75 days the enforcement of the law that was put in place after U.S. officials warned that under ByteDance, there was a risk of Americans' data being misused.\n\nAdvertisement · Scroll to continue\n\nThe possible deal reported by NPR would mean that American investors would own a majority stake in TikTok. However, the report added that the terms of the deal could change and are still being hammered out.\n\n\"The goal is for Oracle to effectively monitor and provide oversight with what is going on with TikTok,\" a person directly involved in the talks but not authorized to speak publicly was quoted as saying by NPR.\n\n\"ByteDance wouldn't completely go away, but it would minimize Chinese ownership.\"\n\nOther potential investors who are engaged in the talks include Microsoft (MSFT.O), opens new tab, NPR reported.\n\nOfficials from Oracle and the White House held a meeting on Friday about a potential deal, and another meeting has been scheduled for next week, NPR reported.\n\nOracle was interested in a TikTok stake \"in the tens of billions,\" but the rest of the deal is in flux, the NPR report cited the source as saying.\n\nTrump has said he \"would like the United States to have a 50% ownership position in a joint venture\" in TikTok.\n\nNPR cited another source as saying that appeasing Congress is seen as a key hurdle by the White House.\n\nFree speech advocates have opposed TikTok's ban under a law passed by the U.S. Congress and signed by former President Joe Biden.\n\nThe company says U.S. officials misstated its ties to China, arguing its content recommendation engine and user data are stored in the United States on cloud servers operated by Oracle while content moderation decisions that affect American users are also made in the U.S.\n\nReporting by Kanishka Singh in Washington; Editing by Matthew Lewis and Chizu Nomiyama\n\nXFacebookLinkedinEmailLinkPurchase Licensing Rights\n\nKanishka SinghThomson ReutersKanishka Singh is a breaking news reporter for Reuters in Washington DC, who primarily covers US politics and national affairs in his current role. His past breaking news coverage has spanned across a range of topics like the Black Lives Matter movement; the US elections; the 2021 Capitol riots and their follow up probes; the Brexit deal; US-China trade tensions; the NATO withdrawal from Afghanistan; the COVID-19 pandemic; and a 2019 Supreme Court verdict on a religious dispute site in his native India.EmailX","summary":"White House in talks to have Oracle, US investors take over TikTok, NPR reports  Reuters","url":"https://www.reuters.com/markets/deals/white-house-talks-have-oracle-us-investors-take-over-tiktok-npr-reports-2025-01-25/","image":"https://www.reuters.com/resizer/v2/BIPOISXMQZIFZGALRWYNETLT4M.jpg?auth=fd65ed8f1b0c086ecdf0956de2e58defdc45dde7eb2ab8fe6146bb6e17520a49&height=1005&width=1920&quality=80&smart=true","video":null,"publish_date":"2025-01-25 23:24:36","author":"Kanishka Singh","authors":["Kanishka Singh"],"language":"en","source_country":"gb","sentiment":-0.335},{"id":283919018,"title":"Trump dismisses at least 12 inspectors general in controversial move overnight","text":"President Donald Trump on Friday fired at least 12 inspectors general in the federal government, a senior White House official confirmed to NBC News.\n\nThe move did not affect the inspectors general for the Justice Department or the Department of Homeland Security.\n\nWhen asked why the inspectors general were fired, the official said the move was an effort by the president to let go of parts of the past Biden administration that don’t “align” with the new Trump administration.\n\n“We’re cleaning house of what doesn’t work for us and going forward,” the official said.\n\nThe legal justification for the firings is murky, given that Congress strengthened protections for inspectors general from undue terminations when it amended the Inspector General Act in 2022.\n\nThe law requires a 30-day notification window between the White House informing Congress of its intent to fire an inspector general and that inspector general being removed from on-duty status. The White House must also provide substantive reasons for why the inspector general is being removed.\n\nWhen asked whether the White House was concerned about the legality of the firings, given the required 30-day congressional notice for each inspector general, the official said a lot of these decisions happen with “legal counsel looking over them.” The official added that they were checking with the White House counsel’s office but didn’t think the administration had broken any laws.\n\nThe firings were first reported by The New York Times and The Washington Post.\n\nInspectors general are typically considered to be independent figures within government agencies. They are tasked with conducting objective audits within their agency and they are expected to investigate allegations of waste, fraud and abuse of power within their departments.\n\nIn response to the firings, Hannibal “Mike” Ware, the head of the Council of the Inspectors General on Integrity and Efficiency, sent a letter to his fellow inspectors general asking them to tell him if they were terminated and informing them that his council “is coordinating a response to the White House and wants to account for all the PAS IG’s that have received a notification.”\n\nNBC News confirmed that Ware also sent a letter on behalf of CIGIE to the White House and to lawmakers on Capitol Hill about the firings.\n\nIn the letter, Ware addressed the legality of the firings, writing, “At this point, we do not believe the actions taken are legally sufficient to dismiss Presidentially Appointed, Senate Confirmed Inspectors General.”\n\nSeparately, Ware released a statement arguing that “removals inconsistent with the law are a significant threat to the actual and perceived independence of IGs.”\n\n“IGs are not immune from removal,” he added. “However, the law must be followed to protect independent government oversight for America.”\n\nWare was among the inspectors general whom Trump fired on Friday. The Department of Education confirmed to NBC News that its department’s inspector general was also among those fired on Friday.\n\nSen. Chuck Grassley, R-Iowa, the chair of the Senate Judiciary Committee also noted that Trump’s decision did not abide by the firing process laid out in federal legislation. The senator led the push to protect inspectors general in the 2022 update to federal law.\n\n“There may be good reason the IGs were fired. We need to know that if so. I’d like further explanation from President Trump. Regardless, the 30 day detailed notice of removal that the law demands was not provided to Congress,” Grassley told NBC News in a statement.\n\nTrump’s move also drew swift condemnation from Democrats on Friday night and early Saturday.\n\nIn a speech on the Senate floor Saturday morning, Schumer called the firings a “chilling purge,” saying, “Yesterday, in the dark of night, President Trump fired at least 12 independent inspector generals at important federal agencies across the administration. This is a chilling purge, and it’s a preview of the lawless approach Donald Trump and his administration are taking far too often as he’s becoming president.”\n\nSchumer added, “These dismissals are possibly in violation of federal law, which requires Congress to have 30 days notice of any intent to fire inspectors general.”\n\nDanielle Brian, the executive director of the nonprofit and nonpartisan Project on Government Oversight, also raised concerns about the legality of the firings and Trump’s desire to get rid of “checks and balances.”\n\n“It’s clear that this move demonstrates that this White House is really keen on removing checks and balances, and this was their one tool about rooting out waste and fraud and they shot themselves in the foot,” Brian told NBC News.\n\n“I am still not convinced they will get away with this,” she added.\n\nIn a post on X, Sen. Elizabeth Warren, D-Mass., also called the firings a “purge” and added, “President Trump is dismantling checks on his power and paving the way for widespread corruption.”\n\nIn a statement, Rep. Gerry Connolly, D-Va., the top Democrat on the House Oversight Committee, also slammed Trump’s decision, calling it a “Friday night coup” and “an attack on transparency and accountability.”","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Donald Trump on Friday fired at least 12 inspectors general in&#8230;\n\n\nThis Post: Trump dismisses at least 12 inspectors general in controversial move overnight first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/trump-dismisses-at-least-12-inspectors-general-in-controversial-move-overnight/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-Trump-fires-at-least-12-inspectors-general.jpg","video":null,"publish_date":"2025-01-25 23:22:53","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.41},{"id":283919014,"title":"Florida Man Arrested for Allegedly Threatening Trump on Facebook; Secret Service Looking Into Case","text":"The Secret Service is investigating after a Florida man was arrested in West Palm Beach and charged with calling for the assassination of President Donald Trump on Facebook.\n\nWest Palm Beach local Shannon Depararro Atkins, 46, was arrested after allegedly threatening the life of the president, West Palm Beach Police Chief Tony Araujo confirmed during a press conference Saturday.\n\nAtkins is charged with felony intimidation, drug possession and smuggling contraband in a county detention facility, according to jail records. \n\nThe Secret Service was notified and is reviewing the case to determine if there will be federal charges, the department said.\n\n“The U.S. Secret Service does not comment on matters involving protective intelligence,” the agency wrote in an email to Fox News Digital on Saturday. “What we can say, is that the Secret Service investigates all threats against our protectees.”\n\nAuthorities confirmed the FBI was also involved in the investigation.\n\nAraujo said, in today’s climate, people cannot make threats, even jokingly.\n\n“We have incident after incident, example after example, of when these threats become real – and we take these very seriously,” he said. “Did we avert something – you never know. I do know that we developed probable cause, we arrested Mr. Atkins, and he’s going to have to answer the charges.”\n\nAtkins was issued a $5,000 bond for the drug charges, but bond was denied for the threats against Trump, according to jail records.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe Secret Service is investigating after a Florida man was arrested in&#8230;\n\n\nThis Post: Florida Man Arrested for Allegedly Threatening Trump on Facebook; Secret Service Looking Into Case first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/florida-man-arrested-for-allegedly-threatening-trump-on-facebook-secret-service-looking-into-case/","image":"https://internewscast.com/wp-content/uploads/2025/01/Florida-man-arrested-for-allegedly-calling-for-Trump-assassination-on.png","video":null,"publish_date":"2025-01-25 23:18:48","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.557},{"id":283917402,"title":"12 Paths To Leadership: Your Leadership Repertoire","text":"WASHINGTON, DC - MAY 31: U.S. President Joe Biden delivers remarks on former U.S. President Donald ... [+] Trump’s guilty verdict in his hush-money trial before speaking on the Middle East at the White House on May 31, 2024 in Washington, DC. Biden said Trump had a fair trial and an impartial jury found him guilty on all 34 counts and added it is dangerous for anyone to say the trial was rigged. (Photo by Chip Somodevilla/Getty Images)\nGetty Images\n\nIt’s a funny thing about one-term presidents. On the one hand, four years just doesn’t seem like enough time to make good on campaign promises, especially when mid-term elections of one-third of Senate and all of the Congress are again up for grabs.\n\nOn the other hand, if you’ve got the leadership skills, the vision, and the determination – and you have the leadership repertoire – anything, it seems, is possible.\n\nCase in point. We’ve just witnessed one of the most successful, productive single-term presidencies in history. Granted, Joe Biden had a 50-plus year run-up to his four years in the White House, but still, they were nearly incomparable. Abraham Lincoln comes to mind.\n\nLeadership Repertoire\n\nIn my 15 years of teaching two graduate leadership course at Fairleigh Dickinson University plus my 27 years of consulting to leadership in 25 industries, my research showed me that an aspiring leader can have all the leaderships skills and styles imaginable, but without an idea of how to reach any single goal or an overall level, skills and styles alone won’t do it. A leader needs a repertoire.\n\n12 Paths to Leadership\n\nWille Mays, many fans’ choice for baseball’s “G.O.A.T.”, even those of us whose teams played against him, could beat you five ways, a phenomenon known as a “five tool player”: hit, hit with power, run, field, throw. That was Willie’s repertoire. Here was Joe Biden’s:\n\n· Winning supporters\n\n· Solving problems\n\n· Building coalitions\n\n· Negotiating solutions\n\n· Affecting relationships\n\n· Establishing standards\n\n· Offering ideas\n\n· Inspiring effort\n\n· Uniting rivals\n\n· Utilizing charisma\n\n· Sparking emotions\n\n· Setting examples\n\nHistory will judge.\n\nHistory, not political situational transactions, will confirm or deny my premise about a leader’s path to success – and about Joe Biden’s journey along that path.\n\nFollow me on LinkedIn. Check out my website.\nEditorial StandardsForbes Accolades","summary":"An aspiring leader can have all the leaderships skills and styles imaginable, but without an idea of how to reach any single goal or an overall level, skills and styles alone won’t do it. A leader needs a repertoire.","url":"https://www.forbes.com/sites/eliamdur/2025/01/25/12-paths-to-leadership-your-leadership-repertoire/","image":"https://imageio.forbes.com/specials-images/imageserve/67956ec5afd52a411b5207f9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2025-01-25 23:11:46","author":"Chip Somodevilla,Contributor,Eli Amdur","authors":["Chip Somodevilla","Contributor","Eli Amdur"],"language":"en","category":"politics","source_country":"US","sentiment":0.348},{"id":283927038,"title":"More DEI fallout: Air Force scraps course that used videos of Tuskegee Airmen and female WWII pilots","text":"WASHINGTON (AP) — The Air Force has removed training courses with videos of its storied Tuskegee Airmen and the Women Airforce Service Pilots, or WASPs — the female World War II pilots who were vital in ferrying warplanes for the military — to comply with the Trump administration’s crackdown on diversity, equity and inclusion initiatives.\n\nThe videos were shown to Air Force troops as part of DEI courses they took during basic military training.\n\nIn a statement, the Air Force confirmed the courses with those videos had been removed and said it “will fully execute and implement all directives outlined in the Executive Orders issued by the President, ensuring that they are carried out with utmost professionalism, efficiency and in alignment with national security objectives.”\n\nThe problem may not be with the historical videos themselves, but that they were used in Air Force basic military training DEI coursework. However, the lack of clearer guidance has sent the Air Force and other agencies scrambling to take the broadest approach to what content is removed to make sure they are in compliance.\n\nThe Tuskegee Airmen, known as the “Red Tails” were the nation’s first Black military pilots who served in a segregated WWII unit and their all-Black 332nd Fighter Group had one of the lowest loss records of all the bomber escorts in the war.\n\nThey flew P-47 Thunderbolt, P-51 Mustang and other fighters to escort American bombers on dangerous missions over Germany. Before the fighter escorts began accompanying the slow and heavy U.S. bombers, losses were catastrophic due to getting dive-bombed by German aircraft.\n\nPresident George W. Bush awarded the Tuskegee Airmen the Congressional Gold Medal in a ceremony at the Capitol Rotunda in 2007.\n\nIn 2020, in his State of the Union address, President Donald Trump announced he had promoted one of the last surviving Tuskegee Airmen, Charles McGee, to brigadier general. McGee died in 2022 at age 102.\n\nThe WASPs contributed to World War II by learning to fly and ferry new bombers off the assembly lines to airfields where they were needed to ship off to war — freeing up male pilots to focus on combat missions overseas. They earned the right to be buried in Arlington National Cemetery just in the last decade.\n\nThe Air Force, like other branches, has recently tried to broaden the number of people they reach to consider military careers like aviation that historically have had few minority service members in their ranks.\n\nCopyright 2024 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.","summary":"WASHINGTON (AP) — The Air Force has removed training courses with videos of its storied Tuskegee Airmen and the Women Airforce Service Pilots, or WASPs — the...","url":"https://wsvn.com/news/us-world/more-dei-fallout-air-force-scraps-course-that-used-videos-of-tuskegee-airmen-and-female-wwii-pilots/","image":"https://wsvn.com/wp-content/uploads/sites/2/2018/10/181012-tuskegee-airmen.jpg?quality=60&strip=color","video":null,"publish_date":"2025-01-25 23:11:26","author":"Associated Press,Rubén Rosario","authors":["Associated Press","Rubén Rosario"],"language":"en","source_country":"us","sentiment":-0.343},{"id":283919020,"title":"CIA Suggests COVID Likely Originated from a Lab but Has Limited Confidence in Conclusion","text":"WASHINGTON — The CIA now believes the virus responsible for the COVID-19 pandemic most likely originated from a laboratory, according to an assessment released Saturday that points the finger at China even while acknowledging that the spy agency has “low confidence” in its own conclusion.\n\nThe finding is not the result of any new intelligence, and the report was completed at the behest of the Biden administration and former CIA Director William Burns. It was declassified and released Saturday on the orders of President Donald Trump’s pick to lead the agency, John Ratcliffe, who was sworn in Thursday as director.\n\nThe nuanced finding suggests the agency believes the totality of evidence makes a lab origin more likely than a natural origin. But the agency’s assessment assigns a low degree of confidence to this conclusion, suggesting the evidence is deficient, inconclusive or contradictory.\n\nEarlier reports on the origins of COVID-19 have split over whether the coronavirus emerged from a Chinese lab, potentially by mistake, or whether it arose naturally. The new assessment is not likely to settle the debate. In fact, intelligence officials say it may never be resolved, due to a lack of cooperation from Chinese authorities.\n\nThe CIA “continues to assess that both research-related and natural origin scenarios of the COVID-19 pandemic remain plausible,” the agency wrote in a statement about its new assessment.\n\nInstead of new evidence, the conclusion was based on fresh analyses of intelligence about the spread of the virus, its scientific properties and the work and conditions of China’s virology labs.\n\nLawmakers have pressured America’s spy agencies for more information about the origins of the virus, which led to lockdowns, economic upheaval and millions of deaths. It’s a question with significant domestic and geopolitical implications as the world continues to grapple with the pandemic’s legacy.\n\nRepublican Sen. Tom Cotton of Arkansas, chairman of the Senate Intelligence Committee, said Saturday he was “pleased the CIA concluded in the final days of the Biden administration that the lab-leak theory is the most plausible explanation” and he commended Ratcliffe for declassifying the assessment.\n\n“Now, the most important thing is to make China pay for unleashing a plague on the world,” Cotton said in a statement.\n\nChina’s embassy in Washington did not immediately return messages seeking comment. Chinese authorities have in the past dismissed speculation about COVID’s origins as unhelpful and motivated by politics.\n\nWhile the origin of the virus remains unknown, scientists think the most likely hypothesis is that it circulated in bats, like many coronaviruses, before infecting another species, probably racoon dogs, civet cats or bamboo rats. In turn, the infection spread to humans handling or butchering those animals at a market in Wuhan, where the first human cases appeared in late November 2019.\n\nSome official investigations, however, have raised the the question of whether the virus escaped from a lab in Wuhan. Two years ago a report by the Energy Department concluded a lab leak was the most likely origin, though that report also expressed low confidence in the finding.\n\nThe same year then-FBI Director Christopher Wray said his agency believed the virus “most likely” spread after escaping from a lab.\n\nRatcliffe, who served as director of national intelligence during Trump’s first term, has said he favors the lab leak scenario, too.\n\n“The lab leak is the only theory supported by science, intelligence, and common sense,” Ratcliffe said in 2023.\n\nThe CIA said it will continue to evaluate any new information that could change its assessment.","summary":"Internewscast Journal\n\nInternewscast\n\n\nThe conclusion was based on fresh analyses of intelligence about the spread&#8230;\n\n\nThis Post: CIA Suggests COVID Likely Originated from a Lab but Has Limited Confidence in Conclusion first appeared on Internewscast Journal","url":"https://internewscast.com/news/cia-suggests-covid-likely-originated-from-a-lab-but-has-limited-confidence-in-conclusion/","image":"https://internewscast.com/wp-content/uploads/2025/01/rewrite-this-title-The-CIA-believes-COVID-most-likely-originated.jpg","video":null,"publish_date":"2025-01-25 23:09:39","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.279},{"id":283923326,"title":"Trump doubles down on dumping tip tax in Sin City visit","text":"Camera IconA visit to Las Vegas has capped off a frenzied first week in office for President Donald Trump. (AP PHOTO) Credit: AAP\n\nTrump doubles down on dumping tip tax in Sin City visit\n\nNandita BoseReutersJanuary 26, 2025 7:07AM","summary":"A frenzied first week for Donald Trump has ended with a stop in Las Vegas where the US president has doubled down on an election pledge to dump taxes on tips.","url":"https://www.perthnow.com.au/politics/trump-doubles-down-on-dumping-tip-tax-in-sin-city-visit-c-17510555","image":"https://images.perthnow.com.au/publication/C-17510555/7df65ffe6a0b2ac4043c299837d545502b8fbd46-16x9-x0y0w1280h720.jpg?imwidth=1200","video":null,"publish_date":"2025-01-25 23:07:28","author":"Nandita Bose,Nandita Bosereuters","authors":["Nandita Bose","Nandita Bosereuters"],"language":"en","source_country":"AU","sentiment":-0.418},{"id":283922902,"title":"Sudden restrictions sow uncertainty among HHS, NIH staffers","text":"Jan. 25 (UPI) -- A government-wide hiring freeze and halt to funding of travel, meetings and communications have officials at the National Institutes of Health concerned about potentially negative impacts.\n\nThe hiring freeze, imposed by President Donald Trump on Tuesday, affects all federal government agencies, but the restrictions on travel, meetings and communications are specific to the Department of Health and Human Services and the NIH.\n\nThe NIH has about 20,000 researchers and staff on its payroll who work at 27 centers and institutions across the country, but Trump temporarily has frozen funding that many need to travel, meetings and communications for what are called \"study sections.\"\n\nThe sudden freeze on federal funding has NIH officials and researchers worried about the effects on medical and biotechnology research. Many also are concerned they won't have funding to pay lab workers and continue experiments.\n\nThe federal government annually provides researchers with more than $31 billion for scientific research to help cure human diseases and make other medical advancements.\n\nThe sudden halt in funding makes it difficult for researchers to continue undertaking scientific studies, and the HHS on Friday announced a one-week communications ban through Feb. 1.\n\nThe communications ban includes publishing regulations, grant announcements, social media posts, guidance documents, press releases and other forms of communications through next week.\n\nThe ban also cancels planned speaking engagements through Feb. 1.\n\nThe one-week pause in communications is intended to enable a new team at HHS and the NIH to establish a new process for reviewing and prioritizing federally funded studies.\n\nThe pause temporarily halts reviews and approvals of grant-funding requests at the 24 grant-making entities controlled by the NIH.\n\nThe Trump administration is not the first to temporarily halt communications and funding during transitional periods.\n\nPresident Barack Obama limited attendance at meetings scheduled to discuss scientific matters.\n\nObama's imposed limits continued those placed by President George W. Bush.\n\nA travel ban, though, is unusual and applies to all but return trips to initial points of departure for affected personnel.","summary":"A government-wide hiring freeze and halt to funding of travel, meetings and communications have officials at the National Institutes of Health concerned about potentially negative impacts.","url":"https://www.upi.com/Health_News/2025/01/25/hhs-nih-temporary-restrictions/6091737843675/","image":"https://cdnph.upi.com/ph/st/th/6091737843675/2025/i/17378459215197/v1.2/Sudden-restrictions-sow-uncertainty-among-HHS-NIH-staffers.jpg","video":null,"publish_date":"2025-01-25 23:06:38","author":"Mike Heuer","authors":["Mike Heuer"],"language":"en","source_country":"us","sentiment":-0.182},{"id":283922600,"title":"Danica Patrick Reveals Stance On Donald Trump's Anthony Fauci Decision","text":"Former NASCAR and IndyCar driver Danica Patrick has voiced her support for the decision by President Donald Trump to revoke the security detail for Dr. Anthony Fauci.As Trump returns to office after winning the 2024 election, one of his policies includes cutting the budget for security details that were previously granted to government officials, including Fauci.Patrick's approval of this move comes as she and others highlight what they see as financial gains made by Fauci during the Covid-19 pandemic, finding Trump's decision fair and just.More News: Dale Earnhardt Jr.'s One-Word Response To Kasey Kahne's NASCAR ReturnAnthony Fauci, who was a central figure during the COVID-19 pandemic, had received a security detail due to the threats he faced during his time leading public health responses.However, President Trump, during his second term, decided to withdraw the reported $15 million security detail for Fauci. This move was part of a larger pattern of budget cuts affecting several former officials.Trump's rationale for this decision was simple: government officials cannot expect lifelong security at the taxpayers' expense. According to Trump, individuals like Fauci, who amassed wealth during their tenure, have the means to protect themselves. Trump stated:\"You can't have a security detail for the rest of your life because you work for government. It's very standard.\"This decision has sparked a mix of support and concern. Supporters include Danica Patrick, who, through an Instagram story, made her agreement with the decision clear with a simple message: \"Damn right.\"More News: Kasey Kahne Speaks Out On NASCAR Return After Shock RCR AnnouncementFauci was the director of the National Institute of Allergy and Infectious Diseases (NIAID) and played a vital role in the U.S. government's response to COVID-19. His guidance on public health measures like masking and school closures faced criticism from various quarters.Supporters of the security detail removal argue that government funds should focus elsewhere, such as alleviating rising costs for everyday items. This perspective aligns with a broader desire among some to redirect funds towards more pressing economic concerns.More News: NASCAR Chief Reveals Staggering Goal For Contentious Electric PrototypePublic opinions remain divided. Supporters of Fauci's public health strategies have shared their concerns about his safety without the government's security coverage. In response to the security revocation, Fauci has reportedly arranged his own protective measures, indicating he takes the remaining threats seriously enough to invest personally in his protection.For the latest NASCAR news, head over to Newsweek Sports.","summary":"Danica Patrick supports Donald Trump's decision to revoke Anthony Fauci's government-funded security detail.","url":"https://www.newsweek.com/sports/racing/danica-patrick-reveals-stance-donald-trumps-anthony-faucis-decision-2020927","image":"https://d.newsweek.com/en/full/2573618/danica-patrick.jpg","video":null,"publish_date":"2025-01-25 23:06:04","author":"Lydia Mee","authors":["Lydia Mee"],"language":"en","category":"politics","source_country":"US","sentiment":0.165},{"id":283922682,"title":"Trump plays Vegas: President basks in laughter turning rally from policy talk to improv comedy performance","text":"President Donald Trump arrived in Las Vegas, a city known for its unique shows, and delivered a speech-turned-comedy show of his own.\n\nTrump began his speech like he began most of his campaign rallies: boasting about his own success before disparaging the Biden administration.\n\nAfter becoming president on Monday, Trump said he’s “been moving with urgency and historic speed to fix every single calamity of the Biden administration,” referring to the raft of executive orders that he’s signed and Biden-era policies that he’s reversed.\n\nBut before long, his infamous scowl — so persistent that it even appeared in his official portrait — was completely erased, replaced by a white-toothed grin. Trump seemed to be having fun as his first week back in office came to a close — while many Americans are anxious about what his onslaught of orders could mean for them.\n\nThe 78-year-old Republican regaled the Circa Resort & Casino crowd with stories and jokes. The way he delivered his remarks fell somewhere in between that of a stand-up comic and a dinner party guest. He paused for laughter like a comedian familiar with timing but gossiped about his predecessor as if they had gone to middle school together.\n\nAt one point, he shared what a world leader allegedly divulged to him about trying to get in touch with then-President Joe Biden last year.\n\nThe anonymous world leader was told the then-president would phone back in two months. “Two months?” Trump told the crowd. “Yeah, it’s his schedule, he’s extremely busy sleeping.” The audience roared in laughter.\n\n“So two months comes along and there’s no call and they say, ‘He didn’t call,’” the president said, pausing as he broke into laughter himself. “These stories are not very exaggerated, I’ll tell ya.”\n\nHis followers burst into applause. Trump was feeding off the crowd.\n\nBut his lighthearted jabs stood in stark contrast to the stack of executive orders he signed this week that are poised to disrupt the very functioning of the country. From ending birthright citizenship to withdrawing from the Paris Climate Treaty to his assaults on reproductive health care, his orders have the potential for sweeping consequences. Experts and advocates have warned about how these actions could impact the American people. Lawsuits are already underway to challenge some of these moves.\n\nBut in the Las Vegas casino on Saturday, there was no shred of fear; Trump and his supporters seemed nothing short of thrilled at the start of a new era.\n\nHe eventually told the crowd what they came to the rally to hear: “No tax on tips!”\n\n“If you’re a restaurant worker, a server, a valet, a bellhop or one of my caddies…I go through caddies like candy. If I play badly, I blame my caddies…Or any other worker who relies on tips for income, your tips will be 100 percent yours,” he promised. He was renewing a vow made in Sin City in June, when he promised to exclude tips from federal taxes.\n\nIn Nevada, a quarter of the typical restaurant workers’ pay came from tips, he said. “That’s a lot. You haven’t been reporting them for the last 10 years,” the president said.\n\n The “deal” is that there’ll be no taxes on tips, “but we’re gonna go after you viciously for all the money you didn’t report for the last 10, 15…” Trump joked, laughing along with his supporters.\n\nAt one point he even quipped that the idea for no tax on tips came from a “young, beautiful waitress” in one of his hotel restaurants. But he interrupted himself, saying he couldn’t describe her that way because now, calling a woman beautiful marks “the end of your political career...You’re probably not even supposed to say young.” \n\nEarlier, he bragged about getting rid of the “woke crap” during his first week.\n\nBut he was only getting started. He asked the waitress to repeat her idea of cutting taxes on tips. He recalled telling her: “Thank you very much, you just won the election for me,” Trump said in a joke that absolutely slaughtered this crowd.\n\nBut this crowd also cheered when Trump announced that the “heroes of ICE” have been arresting migrants across the country. The agency arrested nearly 600 people on Friday alone. These arrests come in the wake of Trump’s anti-immigration policies ordered this week.\n\nHe ended the speech in a familiar fashion: robotically shifting his arms to the Village People’s Y.M.C.A. to the smiles of the crowd.","summary":"The newly-sworn in president was feeding off of the Las Vegas crowd’s energy, cracking jokes like he was holding his own improv show, as the backdrop of uncertainty following his stack of controversial executive orders this week plagues many Americans, Kelly Rissman reports","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-vegas-speech-tips-immigration-jokes-b2686399.html","image":"https://static.independent.co.uk/2025/01/25/22/SEI237355397.jpg?quality=75&width=1200&auto=webp","video":"https://cdn.jwplayer.com/videos/cSww52L4-4VHSaSK0.mp4","publish_date":"2025-01-25 23:05:33","author":"Kelly Rissman","authors":["Kelly Rissman"],"language":"en","source_country":"gb","sentiment":-0.043},{"id":283919004,"title":"Donald Trump threatens popular MSNBC anchor with being taken off the air soon in harsh late-night criticism","text":"President Trump issued a brutal takedown of MSNBC’s Rachel Maddow, vowing that she would soon ‘be off the air’. \n\nIn a late-night post to his Truth Social account, the commander-in-chief said: ‘Wow! Rachel Maddow has horrible ratings. She’ll be off the air very soon. \n\n‘MSNBC IS CLOSE TO DEATH. CNN HAS REACHED THE BOTTOM. This is a good thing. They are the Enemy of the people!’ \n\nTrump’s remarks came after Maddow compared him to Cuban dictator Fidel Castro on Wednesday. \n\nThe outspoken liberal was speaking about Trump’s recent January 6 pardons when she made the remark.\n\nMaddow, MSNBC’S top dog in terms of ratings, kicked off a on air rant that started with complaints about Stewart Rhodes, freed founder of the far-right Oath Keepers.\n\nRhodes, like several others, was convicted of seditious conspiracy for his part in the insurrection. \n\n The 2021 riot saw more than 100 cops injured, and Maddow – despite one being a supporter of ‘defunding the police’ – was unwilling to let that slide. \n\nAfter singling out Rhodes specifically, she told viewers: ‘There are rumors circulating that Trump had wanted to bring his felons – had wanted to bring these guys who violently attacked police and were convicted for it – all to the White House too.\n\n‘That’s the sort of thing that probably sounded great at a Trump rally,’ she continued, seemingly ad-libbing at this point. \n\n‘Probably sounded like it was something the people wanted, when you were stewing about stuff like this at a Trump rally.\n\n‘At one of your Fidel Castro, Castro-esque, you know, three and a half hour long rambly speeches,’ she continued, quickly offering the juxtaposition. \n\nShe could not help but add: ‘Where most of the people left before you were halfway through it.’\n\nMaddow had also taken issues with the attendance of tech billionaires at Trump’s inauguration earlier this week. \n\nFigures including Mark Zuckerberg, Jeff Bezos, Elon Musk and Apple’s Tim Cook had been invited to the ceremony. \n\nSpeaking on air, she had said: ‘How is this happening in America?’, while her co-host Chris Hayes likened him to a ‘cult leader’. \n\nThe network has been struggling with viewership, with the former president of the company Rashida Jones resigning earlier this month. \n\nInsiders told Variety that Jones decided to leave after ‘an intense cycle’, with Maddow set to return to a five-night hosting schedule after viewership saw them lose ground to rivals CNN and Fox News. \n\nMaddow had previously reduced her hosting duties to one night per week, but resumed her five-night schedule for the first 100 days of Trump’s presidency in hopes of drawing in lost viewers. \n\nLast month the new bosses of the media firm that oversees MSNBC started making it clear they want more Republican voices on the left-wing network.\n\nIt came weeks after the CEO is said to have slashed Rachel Maddow’s pay by some $5million, after she agreed to stay with the network for another five years.\n\nShe had reportedly been earning a $30million salary for her weekly show – the second highest paid anchor in television news after Sean Hannity at Fox News who pulls in $45million. \n\nFrom the day after the 2024 election, MSNBC has averaged around 603,000 total viewers in primetime – compared to 3.2 million for Fox News. \n\nAccording to Nielsen data, seen by Adweek, MSNBC’s primetime lineup averaged around 758,000 viewers for the week of January 13.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Trump issued a brutal takedown of MSNBC&#8217;s Rachel Maddow, vowing that&#8230;\n\n\nThis Post: Donald Trump threatens popular MSNBC anchor with being taken off the air soon in harsh late-night criticism first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/donald-trump-threatens-popular-msnbc-anchor-with-being-taken-off-the-air-soon-in-harsh-late-night-criticism/","image":"https://i.dailymail.co.uk/1s/2025/01/25/14/94506255-14324513-image-a-14_1737817152696.jpg","video":null,"publish_date":"2025-01-25 23:04:35","author":"Internewscast","authors":["Internewscast"],"language":"en","category":"politics","source_country":"us","sentiment":-0.387},{"id":283927520,"title":"Trump Was Right to Yank Security Clearances of the 51 ‘Spies Who Lie’","text":"Amid the tsunami of good that Donald J. Trump has unleashed since returning to the presidency, one wave deserves sustained applause. As I suggested last September, Trump revoked the security clearances of the 51 intelligence operatives who intimated that Hunter Biden’s laptop from hell was mere Kremlin propaganda. \n\nThese “Spies Who Lie,” as the New York Post dubbed them, earned this rebuke—at least. The federal government granted them secret clearances to help protect U.S. national security, not perpetrate blatant election interference and turbocharge censorship.\n\nThe New York Post’s Oct. 14, 2020, exposé discussed the laptop and its extensive evidence of the Biden crime family’s elaborate global shakedowns. In short, Hunter and Joe Biden’s brother Jim swapped access to “the Big Guy” for a Porsche, jewelry, a Chinese-financed shopping spree, countless other luxuries, and $30 million in cash payments, House Government Oversight Chairman James Comer, a Republican from Kentucky, estimates. \n\nAfter consulting Biden-Harris campaign aide Antony Blinken (who became secretary of state), former acting CIA director Michael Morell invited 50 other former intelligence officers to sign an open letter that trivialized the New York Post’s exclusive for containing “all the classic earmarks of a Russian information operation.” These spies had no evidence to support this Big Lie. \n\nDemocrats then used the ex-spies’ letter to browbeat Facebook, Twitter (now X), and other social-media platforms into hiding the laptop from hell. In fact, Twitter (pre-Elon Musk) froze the New York Post’s account for 15 days! \n\nFederal agents also twisted arms in Silicon Valley to bury the New York Post’s dispatch. \n\n“The FBI warned us about a potential Russian disinformation operation about the Biden family and Burisma,” Facebook founder Mark Zuckerberg wrote House Judiciary Chairman Jim Jordan, R-Ohio, on Aug. 26, 2024. After the New York Post’s scoop emerged, Zuckerberg explained, “We sent that story to fact-checkers for review and temporarily demoted it while waiting for a reply. It’s since been made clear that the reporting was not Russian disinformation, and in retrospect, we shouldn’t have demoted the story.” \n\nMeanwhile, during his final, Oct. 22, 2020, debate against Trump, Joe Biden invoked the ex-spies’ fake letter to smear the New York Post’s true story as “a bunch of garbage.” The pro-Biden media lapped this up and used the “garbage” line to conceal the New York Post’s story even further.\n\nTeam 51’s abuse of their secret clearances proved highly effective. \n\nAccording to a Nov. 24, 2020, Media Research Center/Polling Company survey of 1,750 Biden voters in seven swing states, 45.1% knew nothing about Hunter’s laptop. Among these voters, 9.4% said that this fact would have shifted their support to Trump, a third-party contender, or none of the above. \n\nHad Biden lost 4.2% of his votes, Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin would have slipped from his fingers and into Trump’s hands. This would have given Trump 311 Electoral College votes and four more years in the Oval Office. Imagine: Trump would have completed his second term Monday, rather than commence it. \n\nTeam 51 includes such luminaries as former director of national intelligence James Clapper and ex-CIA directors John Brennan, Michael Hayden, and Leon Panetta. They and others have savored book contracts, TV deals, and lucrative consulting arrangements. In short, these snakes have suffered zero consequences for deceiving the American people as they conducted their most solemn civic duty: choosing the president of the United States. \n\n“The signatories willfully weaponized the gravitas of the Intelligence Community to manipulate the political process and undermine our democratic institutions,” Trump’s executive order states. “This fabrication of the imprimatur of the Intelligence Community to suppress information essential to the American people during a Presidential election is an egregious breach of trust reminiscent of a third world country.” \n\nPresident Trump fired a torpedo into the hull of the USS Deep State. He had every right to rescind these scoundrels’ security clearances. This special privilege is intended to keep the American people safe, free, and prosperous—not to spread lies, bamboozle voters, and steal elections.\n\nWe publish a variety of perspectives. Nothing written here is to be construed as representing the views of The Daily Signal.","summary":"Amid the tsunami of good that Donald J. Trump has unleashed since returning to the presidency, one wave deserves sustained applause. As I suggested last September, Trump revoked... Read More\n\n\nThe post Trump Was Right to Yank Security Clearances of the 51 ‘Spies Who Lie’ appeared first on The Daily Signal.","url":"https://www.dailysignal.com/2025/01/25/trump-right-yank-security-clearances-51-spies-who-lie/","image":"https://www.dailysignal.com/wp-content/uploads/2025/01/HunterBiden.jpg","video":null,"publish_date":"2025-01-25 23:03:37","author":"Deroy Murdock","authors":["Deroy Murdock"],"language":"en","source_country":"us","sentiment":-0.348},{"id":283919942,"title":"Coronavirus likely originated in Chinese laboratory, CIA claims in 'low confidence' report","text":"The CIA believes that coronavirus probably originated from a Chinese laboratory, it has been revealed. \n\nA spokesperson for the agency shared the suspicion on Saturday, despite the evidence not being new. \"CIA assesses with low confidence that a research-related origin of the Covid-19 pandemic is more likely than a natural origin based on the available body of reporting,\" they said in the announcement on Saturday. \n\nThey added: \"CIA continues to assess that both research-related and natural origin scenarios of the Covid-19 pandemic remain plausible.\" Earlier reports on how the virus began left experts divided on whether it was manmade or natural. Sadly, the new assessment is not likely to settle the debate.\n\nDespite pointing the finger at China, they acknowledged that the US spy agency has \"low confidence\" in its own conclusion.\n\nThe finding is not the result of any new intelligence, and the report was completed at the behest of the Biden administration and former CIA director William Burns. It was declassified and released on Saturday on the orders of US President Donald Trump’s choice to lead the agency. It comes after John Ratcliffe was sworn in on Thursday as the director of the CIA. \n\nHowever, the agency’s assessment assigns a low degree of confidence to this conclusion, suggesting the evidence is deficient, inconclusive, or contradictory. Earlier reports on the origins of Covid-19 were split over whether the coronavirus emerged from a Chinese lab, potentially by mistake, or whether it arose naturally. The new assessment is not likely to settle the debate.\n\nIn fact, intelligence officials say it may never be resolved, due to a lack of cooperation from Chinese authorities. Instead of new evidence, the conclusion was based on fresh analyses of intelligence about the spread of the virus, its scientific properties and the work and conditions of China’s virology labs. Legislators have pressured America’s spy agencies for more information about the origins of the virus, which led to lockdowns, economic upheaval and millions of deaths.\n\nWhile the origin of the virus remains unknown, scientists think the most likely hypothesis is that it circulated in bats, like many coronaviruses, before infecting another species, probably racoon dogs, civet cats or bamboo rats. In turn, the infection spread to humans handling or butchering those animals at a market in Wuhan, where the first human cases appeared in late November 2019.\n\nSome official investigations, however, have raised the the question of whether the virus escaped from a lab in Wuhan. Two years ago a report by the US Department of Energy concluded a lab leak was the most likely origin, though that report also expressed low confidence in the finding.\n\nMr Ratcliffe, who served as director of national intelligence during Mr Trump’s first term, has said he favours the lab leak scenario. “The lab leak is the only theory supported by science, intelligence, and common sense,” Mr Ratcliffe said in 2023. The CIA “will continue to evaluate any available credible new intelligence reporting or open-source information that could change CIA’s assessment,” the agency spokesperson said.","summary":"The CIA has revealed that coronavirus may have originated from a lab in China following an assessment of evidence. The report was completed at the behest of the Biden administration","url":"https://www.mirror.co.uk/news/world-news/coronavirus-likely-originated-chinese-laboratory-34553533","image":"https://i2-prod.mirror.co.uk/incoming/article34553540.ece/ALTERNATES/s1200/0_COVID-19-named-by-WHO-for-Novel-coronavirus-NCP-concept-Doctor-or-lab-technician-in-PPE-suit-holdin.jpg","video":null,"publish_date":"2025-01-25 23:00:53","author":"David Klepper,Monica Charsley","authors":["David Klepper","Monica Charsley"],"language":"en","source_country":"gb","sentiment":-0.426},{"id":283920786,"title":"Man, 46, arrested over ‘threatening to kill Trump’ after sharing ‘violent’ social media posts against President","text":"A FLORIDA man has been arrested after cops accused him of making \"violent\" threats against President Donald Trump on social media.\n\nShannon Atkins, 46, allegedly wrote on Facebook a day before Trump's inauguration: \"America needs one good bullet to be saved.\"\n\nSeveral others disturbing online posts were also uncovered from January 19, according to West Palm Beach police.\n\nReportedly referencing the Republican, one said: “I’ve been banned from X because I said I hope and pray someone kills him.\n\n“History is supposed to repeat itself. We haven’t had an assassination in years.”\n\nA further concerning post from the same account allegedly belonging to Atkins read: “Bullets please. Please Jesus! Save America”.\n\nThe caption was in response to an image of a meme which described inauguration day as a “day of mourning for USA”.\n\nShortly before his eventual arrest, Atkins also reposted a meme showing Trump with his late first wife Ivanka.\n\nA line above the image read: “I hope they get back together soon.”\n\nWest Palm Beach Police Chief Tony Araujo said at a news conference: “That gives you a flavor of some of the posts that this gentleman posted.\"\n\nHe added that the posts showed a “violent rhetoric\".\n\nAtkins was caught and detained on Friday night after a tip off to the FBI threat center, police said in a news release.\n\nHe was tracked down at around 7:30pm as officers conducted a traffic stop.\n\nHe was in possession of three bags of cocaine at the time of his arrest, officers said. \n\nAlong with the drug charge he also faces one count of written or electronic threats to kill, do bodily injury, or conduct a mass shooting or an act of terrorism which is a second-degree felony. \n\nHe was being held without bond as of Saturday at the Palm Beach County Sheriff’s Main Detention Center.\n\nAtkins allegedly admitted he was behind the social media posts but claimed he was “joking”.\n\nPolice chief Araujo responded by saying: “Folks, this is not a joke. Nothing of that sort is a joke.\n\n“In today’s climate, you really can’t say things like this. \n\n\"We have incident after incident, example after example of when these threats become real. And we take these very seriously.\"\n\nAtkins is believed to live just a few miles from Trump's Mar-a-Lago home in Palm Beach.\n\nHe has voted Democratic since 2008, according to registration records.\n\nThe Secret Service are now set to determine whether they pursue additional, federal charges, West Palm Beach police said.\n\nIt comes as a second man has also been arrested over alleged threats to Trump's life.\n\nThe FBI said 23-year-old Douglas Thrams from Goshen, Indiana made a series of TikTok videos urging attacks on the government.\n\nIn one, Thrams said Trump needed to be killed, according to an FBI agent in a court filing.\n\nHe has been charged with using interstate commerce to make threats.\n\nThe FBI and Secret Service have been on high alert for months after Trump was the victim of two separate assassination plots in 2024.\n\nOne saw the president shot in the ear by shooter Thomas Crooks at a pre-election rally in Pennsylvania.\n\nA second attempt on his life was narrowly avoided when Ryan Routh was seen by a Secret Service agent hiding in the bushes with a rifle at the Trump International Golf Club in Florida.","summary":"","url":"https://www.thesun.ie/news/14600130/man-arrested-threatening-trump-shannon-atkins/","image":"https://www.thesun.ie/wp-content/uploads/sites/3/2025/01/newspress-collage-7pwd3w8kn-1737845797954.jpg?1737846052&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-01-25 22:59:27","author":"Georgie English","authors":["Georgie English"],"language":"en","category":"politics","source_country":"ie","sentiment":-0.374},{"id":283921768,"title":"Man, 46, arrested over ‘threatening to kill Trump’ after sharing ‘violent’ social media posts against President","text":"A FLORIDA man has been arrested after cops accused him of making \"violent\" threats against President Donald Trump on social media.\n\nShannon Atkins, 46, allegedly wrote on Facebook a day before Trump's inauguration: \"America needs one good bullet to be saved.\"\n\nSeveral others disturbing online posts were also uncovered from January 19, according to West Palm Beach police.\n\nReportedly referencing the Republican, one said: “I’ve been banned from X because I said I hope and pray someone kills him.\n\n“History is supposed to repeat itself. We haven’t had an assassination in years.”\n\nA further concerning post from the same account allegedly belonging to Atkins read: “Bullets please. Please Jesus! Save America”.\n\nThe caption was in response to an image of a meme which described inauguration day as a “day of mourning for USA”.\n\nShortly before his eventual arrest, Atkins also reposted a meme showing Trump with his late first wife Ivanka.\n\nA line above the image read: “I hope they get back together soon.”\n\nWest Palm Beach Police Chief Tony Araujo said at a news conference: “That gives you a flavor of some of the posts that this gentleman posted.\"\n\nHe added that the posts showed a “violent rhetoric\".\n\nAtkins was caught and detained on Friday night after a tip off to the FBI threat center, police said in a news release.\n\nHe was tracked down at around 7:30pm as officers conducted a traffic stop.\n\nHe was in possession of three bags of cocaine at the time of his arrest, officers said. \n\nAlong with the drug charge he also faces one count of written or electronic threats to kill, do bodily injury, or conduct a mass shooting or an act of terrorism which is a second-degree felony. \n\nHe was being held without bond as of Saturday at the Palm Beach County Sheriff’s Main Detention Center.\n\nAtkins allegedly admitted he was behind the social media posts but claimed he was “joking”.\n\nPolice chief Araujo responded by saying: “Folks, this is not a joke. Nothing of that sort is a joke.\n\n“In today’s climate, you really can’t say things like this. \n\n\"We have incident after incident, example after example of when these threats become real. And we take these very seriously.\"\n\nAtkins is believed to live just a few miles from Trump's Mar-a-Lago home in Palm Beach.\n\nHe has voted Democratic since 2008, according to registration records.\n\nThe Secret Service are now set to determine whether they pursue additional, federal charges, West Palm Beach police said.\n\nIt comes as a second man has also been arrested over alleged threats to Trump's life.\n\nThe FBI said 23-year-old Douglas Thrams from Goshen, Indiana made a series of TikTok videos urging attacks on the government.\n\nIn one, Thrams said Trump needed to be killed, according to an FBI agent in a court filing.\n\nHe has been charged with using interstate commerce to make threats.\n\nThe FBI and Secret Service have been on high alert for months after Trump was the victim of two separate assassination plots in 2024.\n\nOne saw the president shot in the ear by shooter Thomas Crooks at a pre-election rally in Pennsylvania.\n\nA second attempt on his life was narrowly avoided when Ryan Routh was seen by a Secret Service agent hiding in the bushes with a rifle at the Trump International Golf Club in Florida.","summary":"","url":"https://www.thesun.co.uk/news/33008167/man-arrested-threatening-trump-shannon-atkins/","image":"https://www.thesun.co.uk/wp-content/uploads/2025/01/newspress-collage-7pwd3w8kn-1737845797954.jpg?1737846024&strip=all&quality=100&w=1920&h=1080&crop=1","video":null,"publish_date":"2025-01-25 22:59:27","author":"Georgie English","authors":["Georgie English"],"language":"en","category":"politics","source_country":"gb","sentiment":-0.374},{"id":283919972,"title":"Crowd caught on camera going wild after Trump stops by Las Vegas casino floor: 'USA! USA!'","text":"President Donald Trump shocked gamblers in Las Vegas when he unexpectedly dropped by a casino floor on Saturday. Prior to the surprise visit, Trump had addressed thousands of supporters at the Circa Resort and Casino in Sin City on Saturday afternoon. Photos and video show Trump strolling around the casino floor after the speech, while surrounded by security. The crowd began chanting \"USA! USA!\" as Trump walked past the slot machines. The president was also seen briefly interacting with enthused gamblers. TRUMP VOWS TO DELIVER ON 'NO TAX ON TIPS' CAMPAIGN PROMISE DURING LAS VEGAS SPEECH: '100% YOURS' The president also naturally walked up to a craps table where a game was in progress, telling a player to \"throw the dice.\" When journalists shouted questions at Trump, a craps player scolded the press pool and told them, \"I'm rolling here.\" Trump told a gambler that he was \"doing a good job\" before leaving. TRUMP NOMINATES HEAD OF HIS PERSONAL SECURITY DETAIL, SEAN CURRAN, TO LEAD SECRET SERVICE: 'A GREAT PATRIOT' Trump also said thank you to staff workers holding water trays, shortly after his speech focused on reducing federal taxes for hospitality workers with his \"no tax on tips\" campaign promise. \"Any worker who relies on tips [as] income, your tips will be 100% yours,\" Trump said to a cheering audience during the speech. CLICK HERE TO GET THE FOX NEWS APP \"Nationwide, over four million workers depend on tip income, including an estimated 700,000 single moms…here in Nevada…think of it, a quarter of the typical restaurant workers' pay comes from tips. I didn't know that,\" he added. Fox News' Sarah Tobianski and Sophia Compton contributed to this report.","summary":"President Trump walked through a casino floor Saturday shortly following a speech at the Circa Resort and Casino in Las Vegas, delighting supporters.","url":"https://www.foxnews.com/politics/crowd-caught-camera-wild-trump-stops-las-vegas-casino-floor-usa-usa","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/trump-casino-2.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-25 22:59:12","author":"Andrea Margolis","authors":["Andrea Margolis"],"language":"en","category":"politics","source_country":"us","sentiment":0.005},{"id":283916738,"title":"Trudeau’s cabinet lines up behind Carney, as Canada seeks to counter Trump","text":"The senior ranks of Prime Minister Justin Trudeau’s cabinet have made their choice on who they believe should replace him as Canada’s prime minister – and they are throwing their weight behind Mark Carney.\nCarney has secured the backing of Foreign Affairs Minister Melanie Joly, Environment Minister Steven Guilbeault, Energy Minister Jonathan Wilkinson and Labour Minister Steven MacKinnon. He will receive a public endorsement from Industry Minister Francois-Philippe Champagne on Sunday, a person close to Champagne said.\nThe support shows that many ministers believe the former central banker is the best bet to counter US President Donald Trump’s trade threats and boost the Liberal Party’s electoral fortunes. They also strengthen Carney’s position in Quebec, traditionally a crucial bastion of Liberal support.\nJoly, Guilbeault, MacKinnon and Champagne are all from the French-speaking province. Carney, 59, who grew up in Alberta, has been working daily with aides on improving his French-language skills, according to people familiar with the matter.\nThat will matter a lot if he wins the Liberal leadership contest, becomes prime minister and heads into a general election, where he would be up against Pierre Poilievre, a fierce and fluently bilingual debater who leads the Conservative Party, and Yves-Francois Blanchet, leader of the Bloc Quebecois.\n\nJoly, speaking with reporters on Thursday, said it “was a difficult choice” to back Carney over Chrystia Freeland, the former finance minister who entered the race last week.\nJoly said she chose Carney due to his proven ability to handle big crises such as Brexit, which unfolded while he was governor of the Bank of England, and the 2008 global financial crisis, which erupted shortly before he became governor of the Bank of Canada.\nGuilbeault, a former Greenpeace activist, said he believes Carney is best placed to manage Trump and to steer Canada’s economy through an energy transition in the years ahead. “I’ve known him and I trust him and I have great faith in his abilities,” he said.\nThe backing of Quebec ministers is important for the credibility of Carney’s campaign – his first attempt at winning political office – as there are still questions about how well he can speak French without a script in front of him.\n“It should be a source of concern for the Liberals, who badly need Quebec in the next election,” said Jeremy Ghio, a Montreal-based consultant who previously worked as an aide to Joly.\nNo Liberal leader from outside Quebec has won a general election in Canada since 1965. The Bloc Quebecois, a party that represents Quebec’s interests in Ottawa and promotes the province’s independence, is doing well in public opinion polls and appears set to take seats from the Liberals.\nQuebec will have 78 of the 343 seats up for grabs in the House of Commons in an election that may happen as early as May.\nBut in addition to improving his French, Carney can help himself in Quebec by spending time on the ground there and through policy stances, Ghio said.\nHe pointed to the tactics of former Conservative prime minister Stephen Harper, an Albertan. His French was far from perfect, but in 2006 his government passed a parliamentary motion recognising Quebec as a nation within Canada, which helped the Conservatives build support there.\n\nFreeland, who is seen as Carney’s main opponent in the leadership race and is a more fluent French speaker, was Trudeau’s deputy prime minister for five years and was seen by many as the most powerful member of his cabinet.\nA handful of ministers have endorsed her, including Justice Minister Arif Virani and Health Minister Mark Holland. Like Freeland, they represent districts in greater Toronto.\nTransport Minister Anita Anand, who has a seat in a Toronto suburb, appeared on a video on Saturday wearing a Canadian hockey jersey to announce she is backing Carney.\nIt was Freeland’s scathing resignation as finance minister on December 16 that triggered the events that led to Trudeau’s decision to step down and call a leadership race. The prime minister will leave after his successor is chosen on March 9.\nHer resignation created chaos in the government, as she quit just hours before she was scheduled to deliver a fiscal and economic update to parliament, leaving Trudeau scrambling to find an emergency replacement as finance minister.\nShe did it in part because Trudeau had been talking privately about moving her to a different job within cabinet and asking Carney to be finance minister.\nThere are still some bitter feelings within Trudeau’s cabinet over the way Freeland pushed the government into disarray in December, say some senior Liberals who spoke on condition of they not be identified.\nOthers say Freeland is too associated with the unpopular prime minister after nine years in his cabinet, and the Liberals would be better off choosing a leader with less political baggage.\nFreeland told reporters she’s “grateful to the colleagues who have been supporting me”, and pointed out she also has the backing of multiple regional caucus chairs who play a role in party organising.","summary":"The former central banker has already secured the backing of the country’s foreign, energy, environment, transport and labour ministers.","url":"https://www.scmp.com/news/world/united-states-canada/article/3296303/trudeaus-cabinet-lines-behind-carney-canada-seeks-counter-trump","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/26/36f37798-8d68-45cf-9fc5-42c2ce79ef05_c54d57bc.jpg","video":null,"publish_date":"2025-01-25 22:57:34","author":"Bloomberg","authors":["Bloomberg"],"language":"en","category":"politics","source_country":"cn","sentiment":0.283},{"id":283918204,"title":"MSNBC Mocks Red State Voters as Trump Weighs Scrapping FEMA","text":"Skip to Main Content\n\nNewsletters\n\nCSCHEAT SHEET\nNEWSLETTERS\n\nCheat Sheet\n\nManage Newsletters\nSubscription Offers\n\nMSNBC Mocks Red State Voters as Trump Weighs Scrapping FEMA\n\n‘TORNADO ALLEY’\n\nThe Republican president floated the idea earlier this week, of scrapping federal support for states impacted by natural disasters. \n\nPublished Jan. 25 2025 5:57PM EST \n\nMSNBC /MSNBC \n\nGot a tip? Send it to The Daily Beast here.\nTrending Now\n\nTrumplandMelania Brings Back Fashion Trend—And It Isn’t Hats\n\nAmethyst Martinez\n\nElectionsMitch McConnell Almost Sinks Hegseth With Dramatic ‘No’ Vote\n\nJuliegrace Brufke\n\nMediaStephen A. Smith’s Trump Take Stuns Bill Maher’s Live Audience\n\nPoliticsTrump Fired Highest-Ranking Woman in Military at His Ball\n\nGrace Harrington\n\nPoliticsADL Changes Its Tune on Elon Musk Amid Salute Backlash\n\nEmell Derra Adolphus\n\nTrending Now\n\nTrumplandMelania Brings Back Fashion Trend—And It Isn’t Hats\n\nAmethyst Martinez\n\nElectionsMitch McConnell Almost Sinks Hegseth With Dramatic ‘No’ Vote\n\nJuliegrace Brufke\n\nMediaStephen A. Smith’s Trump Take Stuns Bill Maher’s Live Audience\n\nPoliticsTrump Fired Highest-Ranking Woman in Military at His Ball\n\nGrace Harrington\n\nPoliticsADL Changes Its Tune on Elon Musk Amid Salute Backlash\n\nEmell Derra Adolphus\n\nADVERTISEMENT\n\nADVERTISEMENT\n\nBACK TO TOP ↑\n\nCheat Sheet\n\nSUBSCRIPTIONCROSSWORDNEWSLETTERSPODCASTS\n\nGET THE APP\n\nCode of Ethics & Standards\n\nTerms & conditions\nCopyright & Trademark\n\nCookie Settings\n© 2024 The Daily Beast Company LLC","summary":"MSNBC  / MSNBCHosts of MSNBC’s flagship weekend show mocked MAGA voters in red states affected by a spate of recent storms as President Donald Trump floated the possibility of scrapping federal support for states altogether.\n\nVisiting North Carolina on Friday, where local communities were ravaged by Hurricane Helene last September, the Republican president said, “I think we’re going to recommend that FEMA [the Federal Emergency Management Agency] go away,” suggesting he’d prefer to see the agency’s responsibilities taken over by individual states. \n\nRead more at The Daily Beast.","url":"https://www.thedailybeast.com/msnbc-mocks-tornado-alley-red-states-over-president-donald-trumps-plans-to-scrap-fema/","image":"https://www.thedailybeast.com/resizer/v2/Z7KFDJKXTJEH7CTEFFUD252HOU.png?smart=true&auth=4e87481b8d3cdbfdf8841fc3dc77b1048d016507f6b116bc493bf965f18d0753&width=1440&height=1080","video":null,"publish_date":"2025-01-25 22:57:17","author":"Will Neal","authors":["Will Neal"],"language":"en","category":"politics","source_country":"us","sentiment":0.079},{"id":283923092,"title":"Trump administration reportedly negotiating an Oracle takeover of TikTok","text":"The Trump administration is negotiating a deal that would see Oracle take over TikTok alongside new U.S. investors, according to a report in NPR.\n\nLawmakers passed a bill last year forcing Chinese parent company ByteDance to either sell TikTok or see it banned in the U.S. The app briefly went dark before the law took effect on January 20 — until incoming President Donald Trump said he would issue an executive order delaying the ban.\n\nAt the time, Trump also outlined his “initial thought” on a deal to save TikTok — creating “a joint venture between the current owners and/or new owners whereby the U.S. gets a 50% ownership.” \n\nNPR’s reporting suggests that a deal is now shaping up where Oracle would take control of TikTok’s global operations while ByteDance retains a minority stake.\n\nTrump tried to force TikTok to sell during his first term, with Oracle emerging as a potential buyer. While that didn’t happen, TikTok later said it shifted all its U.S. traffic to Oracle servers. And at a press conference on Tuesday, Trump said he’d be open to either X owner Elon Musk or Oracle chairman Larry Ellison buying the app.\n\nMeanwhile, some of the senators who supported the ban-or-sell bill have expressed confusion about Trump’s plans and said the law requires ByteDance to fully divest.","summary":"The Trump administration is negotiating a deal that would see Oracle take over TikTok alongside new U.S. investors, according to a report in NPR. Lawmakers passed a bill last year forcing Chinese parent company ByteDance to either sell TikTok or see it banned in the U.S. The app briefly went dark before the law took [&#8230;]\n\n\n© 2024 TechCrunch. All rights reserved. For personal use only.","url":"https://techcrunch.com/2025/01/25/trump-administration-reportedly-negotiating-an-oracle-takeover-of-tiktok/","image":"https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2193522171.jpg?w=1024","video":null,"publish_date":"2025-01-25 22:56:28","author":"Anthony Ha","authors":["Anthony Ha"],"language":"en","category":"politics","source_country":"us","sentiment":-0.346},{"id":283919976,"title":"Riley Gaines tears into WNBA star, who gave Caitlin Clark black eye, for wearing anti-Trump shirt","text":"WNBA player DiJonai Carrington invited a flurry of backlash for wearing a shirt that said \"The F--- Donald Trump Tour,\" and conservative influencer Riley Gaines was quick to jump in. Carrington showed off the shirt Friday, while walking into Wayfair Arena in Miami, Florida. Carrington is most known for her interactions with women's basketball phenom Caitlin Clark during Clark's rookie WNBA season in 2024. Carrington infamously gave Clark a black eye by poking her with her fingernails during a game between Clark's Indiana Fever and Carrington's Connecticut Sun in the first round of the playoffs in September. Carrington laughed with Fever teammate Marina Mabrey after the incident. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Gaines made light of this in her first critique of Carrington Saturday. \"So, you’re telling me the same girl who deliberately gouged Caitlin Clark in the eye then laughed about it also wore a hoodie that said, \"The F--- Donald Trump Tour\"?! I'm shocked,\" Gaines wrote in a post on X. Carrington has said she didn't intentionally poke Clark in the eye and that she wasn't laughing about the incident. But Gaines felt no reservations about implying Carrington's poke at Clark was intentional and that she laughed about it afterward. Gaines followed up with another critique of the Sun player and even brought LeBron James into the conversation. \"What has Donald Trump done to make your life worse? Keep LeBron off the court,\" Gaines wrote on X in response to a photo of Carrington wearing the shirt. Carrington provoked Clark fans prior to the eye-poking incident with multiple statements berating Clark and her fan base. During a game in June, Carrington fouled Clark after Clark received an inbound pass from teammate Kristy Wallace. Clark caught the pass and started toward the basket. Carrington was late getting to Clark due to a screen by Aliyah Boston, and she bumped into Clark. Later that month, Carrington posted on X, saying Clark should do more to speak out about people using her name for \"racism\" and other forms of prejudice. She also called the Fever fans the \"nastiest\" in the league. Carrington even made light of the controversy over Clark's black eye in an Instagram Live video in October. In the video, Carrington and her girlfriend, NaLyssa Smith, who plays on the Indiana Fever with Clark, were in their kitchen when Smith poked Carrington in the eye. \"Ow, you poked me in the eye,\" Carrington said. Smith apologized, and the two laughed. \"Did you do it on purpose?\" Carrington asked. Carrington isn't the first target of Gaines' wrath when it comes to conversations about Clark's presence in the WNBA either. After Clark made a comment about benefiting from White privilege in the WNBA during her interview for Time magazine Athlete of The Year, Gaines got into a heated back-and-forth with journalist Jemele Hill. After Gaines posted on X criticizing Clark for making the comments, Hill started the debate and even ended up making it personal. \"You holler all the time about supporting and ‘protecting’ women, and yet the moment that Caitlin Clark expresses appreciation and respect for the Black women in the WNBA (many of whom she grew up watching and idolizing), suddenly you’re acting like a disappointed parent,\" Hill wrote. RILEY GAINES REPEATEDLY TEARS INTO AOC FOR TAKING PRONOUNS OUT OF X BIO AFTER ADVOCATING FOR TRANS ATHLETES Gaines quickly clapped back, responding to Hill's post by mocking the idea of \"White privilege\" in the WNBA. \"'White privilege' in the WNBA is literally hilarious. Maybe you're like Sunny Hostin & think CC also has tall privilege, pretty privilege, and straight privilege,\" Gaines wrote. \"Theres lots of Black players in the WNBA I love [and] respect too, but I don't admire them because they're Black. I admire them for their game. That's the difference.\" CLICK HERE TO GET THE FOX NEWS APP Gaines then doubled down by sharing Hill's initial post with a screenshot of comments the journalist made in an interview with the Los Angeles Times in May. In that article, Hill insisted it was \"naive\" to say Clark's race and sexuality as a straight woman did not play into her popularity in the WNBA, where the majority of players are Black and many are lesbian. \"Being a long-standing professional race baiter must be SO exhausting,\" Gaines told Hill in response. After Gaines' comment about Hill being a professional race baiter, Hill responded with a message mocking the former swimmer for an incident when she tied with trans athlete Lia Thomas at the 2022 NCAA women's swimming championships. \"Girl, you need to thank Lia Thomas every day of your life for helping you get famous, otherwise you would have been just a decent college swimmer that no one knew. You wrote the book on grifting — not me,\" Hill wrote. Gaines responded by saying, \"How deeply regressive [and] utterly misogynistic for Jemele Hill to tell me to thank a man for the platform I have. Thank him for what? Violating us in the locker room? Stealing a national title from a deserving woman? Indirectly stripping us of our 1A rights? Just say you hate women,\" Gaines wrote in her response. That was the last message in the exchange. Gaines has also picked online fights with other liberal figures, including Rep. Alexandria Ocasio-Cortez, D-N.Y., and Dallas Mavericks minority owner Mark Cuban. Each of Gaines' spats with the liberal figures has been met with roaring engagement from her followers. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Podcast host Riley Gaines jumped in on the backlash against WNBA player DiJonai Carrington after Carrington wore an anti-Trump shirt Friday.","url":"https://www.foxnews.com/sports/riley-gaines-tears-wnba-star-who-gave-caitlin-clark-black-eye-wearing-anti-trump-shirt","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/gaines-clark.jpg?ve=1&tl=1","video":null,"publish_date":"2025-01-25 22:45:30","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","category":"politics","source_country":"us","sentiment":0.02},{"id":283918200,"title":"NKorea Test-fires Sea-to-surface Strategic Cruise Missile: KCNA","text":"North Korea has test-fired sea-to-surface strategic guided cruise missiles, state news agency KCNA reported Sunday, adding that the weapons \"precisely\" hit their targets.\"The war deterrence means of the armed forces of the DPRK are being perfected more thoroughly\", North Korean leader Kim Jong Un said as he oversaw Saturday's test, the agency reported.The missiles hit their marks after travelling along the 1,500-kilometre (930-mile) elliptical and figure-eight orbits, the report said, adding that there was \"no negative impact on the security of neighbouring countries\".KCNA did not say where the test took place.The weapons test by Pyongyang was the first since US President Donald Trump returned to the White House on Monday. Shortly before his inauguration, North Korea fired several short-range ballistic missiles into the sea.Trump, who had a rare series of meetings with Kim during his first term in office, said in an interview aired Thursday that he would reach out to Kim again, calling the North Korean leader a \"smart guy\".The two Koreas remain technically at war since the 1950 to 1953 conflict ended in an armistice, not a peace treaty.Relations between Pyongyang and Seoul have been at one of their lowest points in years, with the North launching a flurry of ballistic missiles last year in violation of UN sanctions.On Sunday, KCNA carried a statement from North Korea's foreign ministry criticising Washington and Seoul for carrying out joint military drills in recent days.\"The reality stresses that the DPRK should counter the US with the toughest counteraction from A to Z as long as it refuses the sovereignty and security interests of the DPRK,\" the statement said, referring to North Korea by its official acronym.\"This is the best option for dealing with the US.\"Such joint military exercises regularly infuriate the nuclear-armed North, which decries them as rehearsals for invasion.In late October, North Korea test-fired what it said was its most advanced and powerful solid-fuel intercontinental ballistic missile (ICBM). It then fired a salvo of short-range ballistic missiles days later.US and South Korean intelligence also believe that North Korea started in October to send thousands of troops to fight against Ukraine and has since suffered hundreds of casualties.Neither North Korea nor Russia has officially confirmed that Pyongyang's forces are fighting for Moscow.","summary":"North Korea has test-fired sea-to-surface strategic guided cruise missiles, state news agency KCNA reported Sunday, adding that the weapons \"precisely\" hit their targets.","url":"https://www.ibtimes.com/nkorea-test-fires-sea-surface-strategic-cruise-missile-kcna-3760974","image":"https://d.ibtimes.com/en/full/4578351/north-korean-leader-kim-jong-un-oversaw-latest-weapons-test.jpg","video":null,"publish_date":"2025-01-25 22:42:20","author":null,"language":"en","category":"politics","source_country":"US","sentiment":0.044},{"id":283916376,"title":"Kelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend three years after the singer's death","text":"Black Friday\n\nKim Kardashian\n\nVictoria Beckham\n\nHarry Styles\n\nAmanda Holden\n\nBritain's Got Talent\n\nPrivacy Policy\n\nSaturday, Jan 25th 2025\n\n5-Day Forecast\n\nAdvertisement\n\nStrictly star Wynne Evans is caught on film making sick sexual jibe about female presenter - plunging the BBC into yet another scandal following 'groping' row\n\nSinead O'Connor leaves £1.7million to her children as she urges them to 'milk her music for what it's worth' in final wishes\n\n'It's been sh** for all of us': Holly Willoughby sobs as she reveals for the first time the true extent horror kidnap and murder plot had on her husband and three children - and how quitting This Morning was 'simple and easy'\n\nKelly Brook reveals she's made her mind up on having kids after an 'honest' admission from her grandma\n\nI know that my father committed INCEST with me while I was asleep - he touched me, filmed me and called me a 'slut'. But here's how I've got my revenge...\n\nX Factor star Cher Lloyd hits out at Simon Cowell in her latest single - 12 years after leaving his record label amid a clash over her career path\n\nBritish social media manager and her fiancé died in Vietnam after drinking 'homemade' limoncello bought from a local restaurant on Christmas Eve\n\nPETER HITCHENS: I have a sneaking suspicion why the Southport child-killer Axel Rudakubana suddenly turned to violence at the age of 13...\n\nI make £1million a month, am willing to get HIV and pay my ex-husband to work for me: BONNIE BLUE'S shocking first interview since sordid 1,000-men sex stunt - where she tells what really happened and boasts 'this is just a warm-up'\n\nBritain's filthiest supermarkets and corner shops named and shamed: Almost 300 fail hygiene ratings... so is YOURS one of them?\n\nLocals blast neighbours who built 'illegal' hair salon in BACK GARDEN of £650k home and say it's a 'nightmare'\n\nBritain's most miserable town. DAVID LEAFE'S childhood Slough had a thriving High Street. Now shops are empty, disgusting acts are common and drugs are everywhere. Here's what went wrong... and it's a tale that blights so many towns\n\nHow a heartbreaking experience forced Jennifer Aniston to come clean about Barack Obama cheating rumors\n\nElon Musk tells Germany's radical far-right AfD party there's too much 'guilt' over the 'sins' of Nazi grandparents - as thousands of people take to the streets of Berlin in protest of the group\n\nFirst study into 'very young' colon cancer patients reveals three risk factors driving deaths in people under 35\n\nThree teenage boys aged 18 and 19 are killed in road crash while another is fighting for life after Seat Ibiza smashes into tree\n\nKelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend three years after the singer's death\n\nI was on Come Dine With Me and became a cult star...I get recognised around the world but there is an awful downside\n\nUS drugs kingpin is arrested in UK after his wife posted pictures of their European holidays - allowing detectives to track them down\n\nInsiders reveal how Lauren Sanchez reacted to the brutal backlash over her inauguration outfit\n\nIs THIS Britain's skinniest home? Thin property is just 2ft wide... but could YOU live there?\n\nThe reason why Meghan Markle 'broke royal protocol' on her first official engagement with the Queen - and Harry's surprising reaction\n\nSecret depravity of the Davos global elite: More sex parties than ever, NDAs for prostitutes, transsexual women… and the most commonly-requested sex act revealed\n\nJustin Baldoni's trove of WhatsApps and videos he believes will torpedo Blake Lively's career for good: The unedited footage, full exchanges and 'pumping' message revealed by ALISON BOSHOFF\n\nKelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend three years after the singer's death\n\nHave YOU got a story? Email tips@dailymail.com \nBy NIOMI HARRIS FOR MAILONLINE \n Published:21:46 GMT, 25 January 2025 |Updated:22:40 GMT, 25 January 2025 \n\nTom Parker's widow Kelsey Parker has revealed she's expecting a baby with her new boyfriend Will Lindsay.\nThe 34-year-old announced the happy news on Saturday, with the pregnancy coming three years after The Wanted singer's death.\nTom passed away in March 2022 from brain cancer aged 33. The pair had two children together, Aurelia, who is now five, and Bodhi, four.\nSpeaking about her baby news in an interview with The Mirror, Kelsey shared: 'Tom and I always said we wanted four – but life had other plans. So yes, this is amazing but also bittersweet.\n'The joys of finding out I’m pregnant and moving forward with my life, while thinking, \"My life could have been so different.\" I’ve felt every emotion under the sun. I’m still getting my head around it but I’m so excited. \nKelsey noted that she knows that by telling people that she's 'putting herself out there', but insisted that she wanted people to be as 'happy' as she was. \n\nTom Parker 's widow Kelsey Parker has revealed she's expecting a baby with her new boyfriend Will Lindsay\n\nThe 34-year-old announced the happy news on Saturday, with the pregnancy coming three years after The Wanted singer's death [Kelsey and Tom pictured in 2021]\n\nTom passed away in March 2022 from brain cancer aged 33. The duo had two children together, Aurelia, who is now five, and Bodhi, four\nThe beauty also said that she believes that the pregnancy would have got Tom's 'blessing', adding that he 'wouldn’t want' her to be living in 'sadness' amid his passing. \nWhile she believes her late husband would have been happy with her moving on, Kelsey told how Tom's mother also gave her blessing 'instantly' and told how breaking the news to his family was an emotional moment.\nShe explained: 'She can’t wait to have another grandchild. All I care about is that both our families and Tom’s family are happy. Noreen is the most amazing lady. After Tom passed, she said to me, \"As long as you’re happy Kels, whatever you do, we will always support you and be happy for you.\" 'We’ve all been through so much together. But I’m here and bringing another baby into the world'.\nKelsey's two other children were also thrilled with the news, with the blonde beauty revealing she filmed the moment she told them so they can look back on the special moment. \nKelsey started dating tree surgeon Will, 27, last year told how her partner lives with her at the home she shared with Tom and the kids, remarking how he 'gradually moved in' when the time 'felt right'. \nThe couple stated that they didn't have a preference about the baby's sex and were currently 'undecided' about whether they wanted to know the news - which is waiting for them on an email.\nElsewhere, Kelsey admitted that she hoped for a 'calm and tranquil' home birth, after her last two labours were 'so traumatic', with Bodhi's birth particularly tough seeing as Tom was diagnosed with his brain tumour when Kelsey was 35 weeks pregnant. \nEarlier this month, Kelsey revealed that her late husband told her to date again through a psychic, while she also hinted at having more children with her new boyfriend.\n\nSpeaking about her baby news in an interview with The Mirror, Kelsey shared: 'Tom and I always said we wanted four – but life had other plans. So yes, this is amazing but also bittersweet'\n\nThe beauty also said that she believes that the pregnancy would have got Tom's 'blessing', adding that he 'wouldn’t want' her to be living in 'sadness' amid his passing \n\nWhile she believes her late husband would have been happy with her moving on, Kelsey told how Tom's mother also gave her blessing 'instantly' and told how breaking the news to his family was an emotional moment\n\nKelsey's two other children were also thrilled with the news, with the blonde beauty revealing she filmed the moment she told them so they can look back on the special moment\n\nKelsey started dating tree surgeon Will, 27, last year told how her partner lives with her at the home she shared with Tom and the kids, remarking how he 'gradually moved in' when the time 'felt right' (Kelsey and Will pictured) \n\n Kelsey Parker praises her boyfriend Will Lindsay for 'bringing her back to life' \nThe widow said that spiritualists have been telling her that it was OK for her to find love again.\nShe explained that she was told to 'get the wedding ring off' because she was blocking potential in her pathway.\nKelsey, who is now dating tree surgeon Will, told The Sun: 'I'm quite spiritual. I had been seeing spiritual people who told me that Tom was coming through, saying: 'Get the wedding ring off as you're blocking yourself, you need to move forward and meet someone.'\nShe then revealed that she and Tom had plans to have more children before he was diagnosed with the grueling disease, and it could still be on the cards in her new relationship.\nShe said: 'I do think that could be on the cards for us; 'Tom and I spoke about having more kids because I wanted four.\n'When he was first diagnosed, I wanted him to go and freeze his sperm, but he wouldn't. I really wanted him to because I really believed he was going to get better.'\nThe update came after she praised her boyfriend Will for 'bringing her back to life' following the tragic death of her late husband.\nShe said that her new partner loves 'every part of her' as she shared a gushing tribute to him on Instagram late last year.\n\nEarlier this month, Kelsey revealed that her late husband told her to date again through a psychic, while she also hinted at having more children with her new boyfriend \n\nHe update came after she praised her boyfriend Will for 'bringing her back to life' following the tragic death of her late husband \n\nKelsey posted a blurred image of herself and Will sharing a kiss with their arms wrapped around each other in a passionate embrace.\nThe photo was accompanied by an emotional message, which said: 'December… but this year with someone who loves every part of me and has brought me back to life after the storm I've been through.'\nKelsey also wrote in the caption: 'December hits differently this year... After the storm, I've found someone who loves every piece of me and reminds me what it feels like to be alive again. \n'My first Christmas with love back in my life, and I couldn't be more grateful.' \nTom ParkerKelsey Parker\n\nShare or comment on this article: \nKelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend three years after the singer's death\n\nAdd comment\n\nEnter search term:\n\nEXCLUSIVEStrictly star Wynne Evans is caught on film making sick sexual jibe about female presenter - plunging the BBC into yet another scandal following 'groping' row\n\nSinead O'Connor's cause of death revealed as she leaves £1.7million to her children\n\nKelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend three years after the singer's death\n\nAMANDA PLATELL: Harry said he'd never settle his court case. Now he has... and I have a good idea why\n\n'It's been sh** for all of us': Holly Willoughby sobs as she reveals the true extent horror kidnap and murder plot had on her husband and three children\n\nThe Masked Singer fans and judges left in shock as huge TV presenter is unveiled as Teeth - after viewers hit out at 'impossible' clues\n\nKatie Price shows off results of her latest surgical procedure as she shares dramatic snaps wrapped up in bandages\n\nJustin Baldoni's lawyer says Blake Lively is 'petrified' of the 'truth' being exposed as she doubles down on gag order request\n\nX Factor star Cher Lloyd hits out at Simon Cowell in her latest single - 12 years after leaving his record label amid a clash over her career path\n\nBoost your health and happiness: Top 10 brands to kick-start your wellness journey\n\nBella Hadid puts on a chic display in edgy black jacket and silken skirt in NYC\n\nTV golden girl who's called off wedding for FOURTH time revealed as friends tell me they're 'unconvinced': RICHARD EDEN\n\nMaura Higgins reveals that the I'm A Celeb group chat is 'still going' as she teases potential for huge career move after jungle success\n\nDanny Jones makes candid I'm A Celeb confession as he sets sights on new career path\n\nMum's the word! Here are the top 10 brands for both mother and baby this month\n\nGladiators contestant leaves host Bradley Walsh and viewers stunned as they make a VERY X-rated comment just minutes into the episode\n\nKelly Brook reveals she's made her mind up on having kids after an 'honest' admission from her grandma\n\nBradley Walsh is forced to bring Gladiators to a halt as contestant suffers a panful injury and has to be taken off for medical attention\n\nJustin Baldoni receives sweet birthday note from mother amid legal battle with Blake Lively and Ryan Reynolds\n\nGive your brood a boost! Discover how to enhance your homelife with these top 10 brands for families\n\nArnold Schwarzenegger enjoys a cheeky smooch with a woman and a feast of sausages at Bavarian celebration at Austrian ski resort\n\nThe Traitors star Linda reenacts THAT epic Death Match clash with Fozia as they take part in viral social media trend following the explosive final\n\nHolly Willoughby says she 'always knew she'd come back to TV' in her first interview in over a year amid return to the spotlight\n\nGladiators fans proclaim new star Cyclone is 'terrifying' and a 'good smack talker' as she makes dramatic debut\n\nLet Europe's beauty unfold before you: Expertly curated coach tours are taking the stress out of travel - just LOOK at these incredible holidays\n\nGeri Horner joins husband Christian and Frank Lampard at the Coventry vs Watford EFL match - amid ongoing Spice Girls feud claims\n\nEXCLUSIVEKyle Walker STOPS Lauryn Goodman relocating to Italy ahead of his move to AC Milan and gives WAG ultimatum if she tries\n\nAnna Wintour, 75, wraps up in royal blue coat as she steps out during Paris Fashion Week appearance after sparking surgery rumours\n\nLaura Woods gives birth! Sports presenter welcomes her first child with fiancé Adam Collard \n\nEXCLUSIVEHow a heartbreaking experience forced Jennifer Aniston to come clean about Barack Obama cheating rumors\n\nMaura Higgins shares 'stressful' life update following I'm A Celeb stint: 'There's so much to get done'\n\nMark Wahlberg reveals the secret to his shock bald transformation in new movie Flight Risk\n\nThe Veronicas star Jessica Origliasso and fiancée Alex Smith look every inch the matching couple as they attend the 2025 Australian Open\n\nJennifer Lopez glams up for manager's birthday after eyeing $20M home in Ben Affleck's Brentwood area amid LA fires\n\nLove Island winner Molly Smith launches new Move With Molly fitness plans - and you could see results in just six WEEKS (get 45% off now)\n\nEXCLUSIVETraitors' Alexander Dragonetti issues an update on his relationship status - after being declared a heartthrob by fans\n\nKate Moss looks the epitome of supermodel cool in a vintage velvet coat and leopard-print boots during Paris Fashion Week\n\nClaudia Winkleman reveals the one Traitors moment that made her break down in tears - and how she almost gave the game away\n\nEXCLUSIVETraitors winner Leanne Quigley revealsshe is planning to spend prize winnings on a lavish wedding - and is eyeing up the castle as a venue\n\nREVEALED: The best contour wands for defined and lifted cheekbones - and an unmissable beauty deal with 15% off\n\nEXCLUSIVETraitors star Charlotte Berman breaks her silence after viewers insisted she was 'robbed' by explosive last-minute Seer twist\n\nEXCLUSIVECynthia Erivo recalls 'tearful' moment she and Ariana Grande found out they were nominated for Oscars: 'We were a mess'\n\nWaterloo Road star, 21, who has VERY famous sister looks unrecognisable as she dazzles on the red carpet - but can YOU guess who it is?\n\nThe Traitors cast let their hair down at boozy London wrap party after Faithfuls Leanne and Jake bagged the £94,600 prize money in tense final\n\nHUGE mobile phone offer: Save up to £932 on the new Google Pixel 9 Pro XL with Vodafone - but there's a catch\n\nLove Island: All Stars fans convinced they know who is next to be dumped as they vow to 'vote out' bombshell after shock recoupling\n\nRebecca Adlington reveals she had couples therapy with husband Andy Parsons to cope with 'dark cloud' of her 'heartbreaking' miscarriages\n\nHow David Lynch's surprise affinity with fast food chain Bob's Big Boy inspired his greatest cinematic works\n\nIt's not all glittering paychecks for stars of Strictly: How popular dancers have ended up in debt or nearly losing their homes - but others like Oti Mabuse have really made it work\n\nEXCLUSIVEI was on Come Dine with me and became a cult star...I get recognised around the world but there is an awful downside\n\nLove Island's Matilda Draper looks radiant in a stunning wedding dress after loved-up display with boyfriend Roman Hackett\n\nCharlotte Crosby puts her palatial mansion on the market for £1.4million with birth of her second child just days away\n\nEXCLUSIVEBetrayed by Boyzone: I helped make the band £10m EACH with Louis Walsh and they never said thank you - then they said we ripped them off\n\nEXCLUSIVETommy Fury's father Big John quits his son's sports business as he gets closer to ex-fiancee Molly Maye-Hague after THAT New Year's kiss\n\nBeauty lovers say this sculpting gel makes them look 'TEN years younger' - and we have an exclusive 20% off discount code\n\nKatie Price dons all-blue outfit as she jets off to Turkey for 'tweaks' to her £10K facelift - after sparking concern over drastic weight loss\n\nLeanne Quigley breaks her silence after Traitors win with emotional tribute to her 'future wife' Sophie after partner's devastating health struggles\n\nLove Island's Molly Smith reveals who she's 'shocked' to see on this year's All-Stars and which friend 'lied' about going on the show\n\nEXCLUSIVEMarried At First Sight star 'really upset and disheartened' as they're brutally axed from upcoming reunion episode 'for being boring'\n\nA bottle of this lavender pillow spray is sold every 79 SECONDS with users swearing they 'fall asleep in minutes' (and it's on sale)\n\nFilm deemed 'unreleasable' now finally set to hit the cinemas and people are stunned\n\nBrie Larson covers up new pixie cut with quirky snood as she leaves London theatre after making West End debut in Elektra\n\nJake Quickenden shares heart-warming clip of 'perfect' baby boy Kit after slamming trolls' vile attacks on his firstborn's looks\n\nCrime drama with 'the best twist since Broadchurch' is finally free to stream on ITV - and it's the perfect weekend binge-watch\n\nKaty Perry nails winter chic in cosy outfit as Ellie Goulding rocks tight leather trousers at star-studded Chiltern Firehouse party\n\nEXCLUSIVEHuge twist in Blake Lively vs Justin Baldoni case as tide turns AGAINST the actress and her husband Ryan Reynolds\n\nEXCLUSIVEWeight loss jabs made me feel so sick I thought I was going to die, reveals Danielle Mason who vows to NEVER use them again\n\nEXCLUSIVEJustin Baldoni's trove of WhatsApps and videos he believes will torpedo Blake Lively's career for good, by ALISON BOSHOFF\n\nJude Bellingham 'seen for the first time with new girlfriend Ashlyn Castro - and she's already met his parents'\n\nScott Mills defends BBC pay after 'working my whole life' for dream role as he takes over Radio 2 Breakfast Show from friend Zoe Ball\n\n14324013 Naomi Watts, 56, looks decades younger than her years as she enjoys a scenic stroll through New York City\n\nHow Kyle Walker 'hopes move to Italy will FINALLY put Lauryn Goodman scandal behind him' after 'traumatic' year \n\nAlready missing The Traitors? There are dozens more series ready to binge right now - here's how to get your fix\n\nVicky Pattison 'very hurt and upset' over the backlash to her deepfake sex tape doc and was just 'trying to do some good'\n\nThe Traitors fans spot contestant in family friendly ad after their racy OnlyFans photos left BBC bosses stunned\n\nLeanne Quigley and Jake Brown win The Traitors as the Faithfuls take home the £94,600 prize money in excruciating final\n\nKylie Jenner strips down to black bra and underwear for sexy Khy photo-shoot\n\nEXCLUSIVESavage X Fenty collection is 50% off using this shopping hack - including bras, sets and loungewear pieces\n\nOlivia Colman and Cynthia Erivo match in all-black ensembles as they lead the Brits at star-studded Sundance Film Festival\n\nHow last year's winner of The Traitors is still sleeping in his childhood bedroom and hasn't spent a penny of his winnings on himself\n\nRyan Reynolds makes surprise appearance at Hugh Jackman's NYC concert as Justin Baldoni legal battle heats up\n\nBlake Lively claims Justin Baldoni is STILL waging a 'retaliation campaign' against her amid bitter legal battle\n\nJustin Baldoni's wife Emily breaks her silence to wish him a happy 41st birthday amid Blake Lively legal fight\n\nHugh Jackman wows crowd with his one-man show in New York after going public with new girlfriend Sutton Foster\n\nJustin Baldoni hits back at Blake Lively and Ryan Reynolds' gag order and blames HER for 'media feeding frenzy'\n\nAngelina Jolie puts on brave face with son Knox as she's seen for first time since Maria Oscars snub\n\nJennifer Lopez celebrates manager's birthday after eyeing $20M Brentwood home near Ben Affleck amid LA fires\n\nRingo Starr's son Zak Starkey puts his feet up as he rests at home amid the discovery of a blood clot in his leg - days after cancelling show\n\nOlly Alexander tells upcoming UK Eurovision act to 'get a good therapist' as he shares his advice after his zero points horror\n\nEXCLUSIVERevealed: Peaches Geldof's widow's new love. He raised two sons alone after her heroin overdose. Now his life has been changed \n\nEXCLUSIVETruth about why the Boyzone fallout is STILL toxic: Friends tell KATIE HIND why they 'despise' Louis Walsh for what he did and the rivalry that tore them apart\n\nNeed another Traitors fix? The US version is back... and it's one of our TV experts' picks of the hottest shows and films to watch this weekend\n\nSir Lenny Henry set for surprise return to the comedy circuit after 15-year stand-up hiatus: 'There are plans in motion'\n\nLove Island: All Stars' Ronnie Vint and Harriett Blackmore 'secretly shared a kiss' just weeks before entering the villa \n\nApprentice hopeful accused of smoking a 'suspicious cigarette' in now-deleted video ahead of new series\n\nTimothee Chalamet's sister Pauline 'hits out' at Kylie Jenner in scathing post\n\nMiley Cyrus has no 'interest' in reconciling with her father Billy Ray and has no relationship with him\n\nThe Traitors host Claudia Winkleman reveals she's been inundated with messages about Alexander from friends after announcing he's single\n\nEXCLUSIVEGood Morning Britain's Alex Beresford and wife Imogen pose for sweet snaps at their baby shower as they celebrate the imminent arrival of their first child\n\nLove Island's Elma Pazar 'promised secret signal to TOWIE pals before heading to All Stars Villa'\n\nEXCLUSIVEInside Ryan Reynolds desperate bid to save his image amid wife Blake Lively's $400 million legal battle with Justin Baldoni\n\nColeen Nolan discusses heartfelt plans for her sister Linda's funeral and shares details of her final resting place\n\nTV host Alex Jones shares the highlights of her family holiday on the Algarve\n\nKing Charles was 'deeply worried' about Princess Anne's mystery horse accident that left monarch's sister hospitalised with a concussion\n\nSteven Gerrard and wife Alex share major family news just weeks after daughter Lilly-Ella announces pregnancy\n\nEXCLUSIVEAngelina Jolie and Brad Pitt's son Pax, 21, involved in ANOTHER e-bike crash after riding around with no hands\n\nShe's an iconic romcom legend whose voice was once dubbed by Glenn Close... can you guess who?\n\nMartha Stewart takes major swipe at Barbra Streisand while discussing her upcoming bombshell memoir\n\nSarah Jessica Parker, 59, is a wrinkle-free beauty as she promotes her documentary at Sundance\n\nThe Traitors final: Fans slam the Seer twist for 'RUINING' the show as Charlotte and Frankie battle it out to convince players they are Faithfuls\n\nBilly Ray Cyrus' son Trace makes thinly-veiled dig at brother Braison for spending time with 'unhealthy' dad\n\nSteph McGovern 'rushed to medics after crashing into a CLIFF on Celebrity Bear Hunt - with host Holly Willoughby close to tears\n\nKate Moss looks chic in a black satin coat and £800 Bvlgari bag as she steps out in Paris for Fashion Week\n\nKerry Katona reveals she's 'cancelled her facelift after children begged her not to go through with it'\n\nDrew Barrymore shares what she really thinks about turning 50 this year as she reveals if she is dating again\n\nThe Traitors winner Meryl Williams reveals she's having another boob job after shrinking her 32FF bust -a year after forehead reduction surgery\n\nRobbie Williams makes UK chart history as he achieves record Number 1 after film biopic Better Man flops at box office\n\nAll the clues Freddie IS Francesca's secret son as Traitors fans brace themselves for shocking finale twist\n\nNatalie Dormer looks sensational in a black power suit as she joins her husband and former soap star Kelvin Fletcher at the White Hat Ball\n\nBrad Pitt sports silver beard as he is seen for the first time since finalizing Angelina Jolie divorce\n\nAndie MacDowell admits she is benefitting from 'reverse nepotism'... after opening up about health battle\n\nEXCLUSIVEMarilyn Manson breaks silence after he was cleared in domestic violence and sexual assault cases\n\nThe Traitors' Lisa Coupland shows off her glamorous new look as she arrives at the series finale screening\n\nThe Traitors star Leanne goes full glam as she is joined by final remaining villain Charlotte as the cast arrive at a London screening of BBC final\n\nTori Spelling gives shocking answer when asked if her home was looted during evacuation from the LA fires\n\nMaybe she's born with it... maybe it's Mounjaro! Gemma Collins debuts new look as she gives update on her weight loss journey \n\nCher, 78, could be mistaken for Kim Kardashian, 44, as she dons a cowgirl hat at New York airport\n\nMarilyn Manson will NOT be charged in domestic violence and sexual assault cases\n\nTroubling reason Michael Jackson biopic's release date has been delayed by six months\n\nScarlett Johansson reveals she has started giving her 10-year-old daughter dating advice\n\nJesy Nelson says she was 'shocked' to discover she was pregnant but was 'instantly happy' as she details her tough twin pregnancy\n\nJennifer Aniston speaks out about wild Barack Obama affair rumors in resurfaced video\n\nKatie Price shares update from her hospital bed as she prepares to go under the knife AGAIN in Turkey for 'tweaks' to her £10K facelift \n\nBen Ofoedu and his new girlfriend risk an awkward run in with his ex Precious Muir at the Henley Festival 2025 launch party\n\nEkin-Su Culculoglu leaves Love Island: All Stars contestants CRINGING with her sloppy kisses in racy challenge\n\nBizarre reason Sandra Bullock has been dragged into Ryan Reynolds, Blake Lively and Justin Baldoni drama\n\nMatthew McConaughey's daughter Vida, 15, is her model mother Camila Alves' mini me\n\nBen Affleck admits he was 'disturbed' by Jennifer Lopez's admiration for Kevin Costner in resurfaced interview\n\nPlayboy alum Kendra Wilkinson, 39, refuses to call her weight gain a 'failure'\n\nScarlett Johansson addresses husband Colin Jost's 'vulgar' SNL joke about her body\n\nBilly Ray Cyrus announces new album with son Braison after his other son Trace says star is 'not healthy'\n\nHollyoaks star Jessica Fox looks unrecognisable as she debuts dramatic new haircut\n\nJake Quickenden defiantly insists 'I won't let others ruin my happiness' as he proudly shares snaps of newborn despite vile trolls' attacks on his firstborn's looks\n\nRyan Reynolds' forgotten romance: A look back at the actor's first celebrity flame as his marriage to Blake Lively hits the spotlight\n\nMyleene Klass shows off her washboard abs in grey underwear as she reveals incredible Instagram hack\n\nColeen Rooney and husband Wayne surprise son Kit with HUGE darts themed balloon display and cake to celebrate his ninth birthday\n\nI was on Dragons' Den - my legs turned to jelly and my heart sank after moment on set we never prepared for\n\nRiverdale star Lili Reinhart, 28, reveals shock health battle with 'mystery' chronic disease\n\nWhy Prince Harry won't be pocketing as much of his £10million payout as he hoped... and why Donald Trump could be the ultimate winner. Another sensational royal scoop from RICHARD EDEN\n\nAnt McPartlin's ex-wife Lisa Armstrong 'takes their £2.3million five-bed west London mansion off the market' - after slashing £250,000 off the asking price\n\n'Catwoman' Jocelyne Wildenstein's fiancé Lloyd Klein makes his first public appearance since her death at 79 - as he cuts a sombre figure at PFW Dior show\n\nKate Moss showcases her supermodel physique in a satin mini dress as she leads the stars at Dior's Paris Fashion week menswear show\n\nLove Island All Stars SPOILER: Ronnie is left fuming over accusations he called relationship with Harriett a 'showmance'\n\nJessica Alves forced to cancel all US TV appearances over 'fears for her safety' amid President Trump's crackdown on 'gender ideology'\n\nMystery as Kate Beckinsale deletes all her Instagram posts - weeks after being cruelly trolled over her weight\n\nPamela Anderson, 57, is back to wearing bombshell makeup... after being Oscar snubbed for Last Showgirl\n\nSam Thompson larks about with his sister Louise - after he opened up about his 'amazing' support system following his shock split from Zara McDermott\n\nKanye West reveals his eye-watering net worth thanks to his music and ownership of Yeezy brand - two years after losing '$2billion in one day' \n\nNick Knowles' fiancée Katie Dadzie, 34, flaunts her jaw-dropping figure in a skimpy bikini as she packs on the PDA with the shirtless DIY SOS host, 62\n\nClaudia Winkleman showcases her signature sense of style in all-black as she arrives at a London screening of The Traitors final\n\n'Greatest teen drama ever' that shot its cast to fame is finally available to stream for free as fans hail it 'the ultimate nostalgia trip'\n\nKate Moss kisses pal Gwendoline Christie on the cheek and she puts on an animated display on the FROW at Dior Homme show for Paris Fashion Week\n\nAward-winning BBC comedy 'axed before its time' returning to screens for new series - but there's a problem for diehard fans\n\nKate Moss is reunited with her exes Jefferson Hack and Jamie Hince as she makes a glamorous exit from best friend Rosemary Ferguson's star-studded birthday bash\n\nThe Masked Singer fans 'rumble' Kingfisher as Strictly Come Dancing star - insisting 'the clues all point to him'\n\nLove Island: All Stars Ekin-Su and Curtis hit the rocks as he spends the night on the daybeds after her sloppy smooches with other contestants\n\nRobert Pattinson turns heads with his awkward attempts at a smile before opting for a steely pout at the Dior show amid Paris Fashion Week\n\nBilly Ray Cyrus' ex-wife Firerose trashes the singer after son Trace reveals his dad is 'struggling'\n\nLily Allen reveals a famous rapper slid into her DMs after he split from his TikTok creator ex - amid her break-up from husband David Harbour\n\nLove Island's Jessy Potts puts on a VERY leggy display at You're Cordially Invited screening - after savage swipe at ex Joey Essex\n\nAmanda Holden and Alan Carr reveal the revolting thing they discovered in a bath while transforming a run-down house on their TV show\n\nLove Island's Matilda Draper puts on a loved-up display with boyfriend Roman Hackett as they film TOWIE\n\nBRYONY GORDON: I've got cleavage that has a strange power... one only women will understand\n\nBella Hadid flashes her very toned and SHINY tummy in a crop top after making a splash on Yellowstone\n\nKardashian fans go wild trying to figure out the hidden meaning to a small detail in new poster\n\nDavid and Victoria Beckham join the slew of famous faces at Rosemary Ferguson's star-studded 50th birthday party in London\n\nKate Moss cements her supermodel status as she exudes sensual charm in elegant structured jackets for stunning new Elisabetta Franchi campaign\n\nLisa Snowdon shows off her incredible figure in skimpy bikinis as she celebrates her 53rd birthday in the Caribbean\n\nRobbie Williams set to make UK chart history after film biopic Better Man flops at box office\n\nEXCLUSIVEThe Traitors' Mollie Pearce reveals winner Harry Clark has deceived her AGAIN as she aims to become the first female champion of Dancing On Ice since 2013\n\nWill Ferrell reveal the surprising role he had in the OJ Simpson trial as his co-star Reese Witherspoon opens up about 'changing women's lives' \n\nFerne McCann breaks down in tears live on Lorraine after being ambushed with surprise message ahead of Dancing On Ice performance\n\nEXCLUSIVEKyle Walker's wife Annie Kilner is taking private jet to Italy to be with him in public show of unity when he is unveiled to fans of AC Milan\n\nI'm a Traitors addict. Here are the hidden clues you've missed that have convinced me THIS surprise player is going to win: CLAUDIA CONNELL\n\nBBC drops first look at legendary TV show as it returns to screens after a whopping 25 years off screens - capturing a brand new audience\n\nGladiators star announces exciting baby news in sweet Instagram post as co-stars rush to congratulate\n\nThis Morning's Dermot O'Leary leaves Alison Hammond open-mouthed as he snubs her with unfortunate slip of the tongue just minutes into show\n\nPeter Andre issues heart-wrenching plea to 'call those you love' as he admits 'I'm having a moment' in emotional post amid his mum's battle with Parkinson's and Alzheimer's\n\nKym Marsh, 48, shows her incredible curves in a black gown as she joins lookalike daughter Emilie, 28, at You're Cordially Invited screening\n\nMillie Mackintosh reveals she forgot about her daughter's first nativity at school and admits she 'dropped the ball' as she opens up on alcohol battle\n\nHollywood intimacy coordinator speaks out on THAT Blake Lively and Justin Baldoni video from It Ends With Us set\n\nCraig Revel Horwood announces Strictly tour show is CANCELLED - leaving thousands of fans gutted as Storm Eowyn batters the UK\n\nPregnant Poppy Delevingne reveals her baby bump for first time as she and billionaire boyfriend Archie Keswick arrive at same bash as ex James Cook and lookalike girlfriend\n\nKaty Perry looks glamorous in a leggy mini dress as she tucks into a giant croissant to celebrate her time in Paris\n\nJeremy Kyle announces new memoir as he promises to dish the dirt on his ITV axing - six years after his controversial show was taken off air\n\nGood Morning Britain fans blast ITV for 'unbelievably dangerous' broadcast as weather reporter 'thrown around by wind' during Storm Eowyn\n\nNot so Frost-y anymore:Sadie and ex Darren Strowger look cosy as they are spotted brushing shoulders at second party of the week\n\nMexican movie Emilia Pérez is slapped with brutal reviews as fans brand it 'the worst film ever' after it dominated Oscar nominations with 13 nods\n\nAndie MacDowell, 66, reveals the REAL reason she moved out of LA to a sleepy southern town\n\nWindswept Coleen Rooney heads to the gym after revealing husband Wayne has taken on a 'new job' following Plymouth Argyle axe\n\nAriana Grande reveals what she did to prepare for her Wicked audition - after actress admitted 'she couldn't stop crying' following Oscar nomination\n\nBombshell claims that threaten Ryan Reynolds' image as 'nicest guy in Hollywood': Justin Baldoni's $400M Blake Lively lawsuit takes aim at her husband\n\nJoan Collins, 91, looks sensational as she relaxes in swimwear alongside husband Percy Gibson, 59, in Cancun\n\nGwendoline Christie rocks trendy oversized shades as she steps out in Paris during Fashion Week\n\nBrooklyn Beckham cuts a suave figure as he enjoys romantic date night with wife Nicola Peltz after spending the day helping victims of LA fires\n\nThe Block billionaire Adrian Portelli breaks his silence on the shock axing of Today show star Alex Cullen - as he extends a surprising lifeline to the sacked TV star\n\nWinterwatch leaves viewers blushing with 'rudest chat ever' as Michaela Strachan and Chris Packham lower the tone with 'pure filth' joke live on air\n\nJamie Foxx SPLITS from girlfriend Alyce Huckstepp after making THAT offensive song about dating white women\n\nAriana Grande celebrates first Oscar nomination in $7,100 party dress in London with Wicked co-star and lover Ethan Slater\n\nFinally over Harry? Olivia Wilde cuddles up to actor Dane Diliegro as she is spotted gazing at him during a basketball game - two years after her split from ex Styles\n\nOscar-nominated movies you can enjoy from the comfort of your sofa! All the 2025 contenders that are already available to stream \n\nLiam Payne honoured with plaque on Celvedon Pier in memory of the singer - and it holds a special link to One Direction\n\nLindy Klim stuns in satin jumpsuit as she steps out solo at Australian Open event after split from her husband of six years Adam Ellis\n\nJesy Nelson happily reveals she's 'gone up to maternity pjs now' while showing off her blossoming baby bump - as she prepares to welcome twins \n\nStrictly's Karen Hauer and Neil Jones leave fans in hysterics as they pose for VERY bizarre snaps amid rivalry during show's live tour\n\nTammy Hembrow puts her wedding rings back on as she and Matt Zukowski prove they are still a happy couple at GUESS event on Gold Coast - after public spat at Australian Open\n\nLottie Moss says she was 'bored' during her time in the Costa Rican jungle on Celebrity Bear Hunt because she had 'no one to talk to'\n\nAlan Carr leaves Amanda Holden wheezing with VERY rude joke about her bedroom antics in first look at new BBC renovation series\n\nAdvertisement\n\nMORE DON'T MISS\n\nOlivia Rodrigo shows off her toned bikini body while hitting the beach with Tate McRae and Iris Apatow\n\nKrishnan Guru-Murthy reveals he still feels anger at his consultant father being spat on for being an immigrant as he reflects on the racism he faced growing up\n\nMaren Morris flashes taut tummy and fit physique in black string bikini as she enjoys girls' trip in Mexico\n\nThe Traitors fans claim the hit BBC show is rigged as Leanne has unbelievable luck just one day before the finale\n\nA-List stars already 'crying' over their Oscar nominations while one calls it 'bittersweet'\n\nDaylight robbery in France's capital: Fury over Emily in Paris walking tour with 'glass of fizz and pastry' for an eyewatering price\n\n'I'm coming out in hives!' The Traitors fans are left 'shaking' as show ends on a HUGE cliffhanger after Frankie's shocking move\n\nBarry Goldberg dead at 83: Bob Dylan's keyboardist and Newport band member passes away in hospice\n\nUnreleased Tina Turner track makes its radio debut two years after singer's death... but critics says it's simply not The Best\n\nKaren Gillan looks ready to celebrate motherhood on her first night out since the birth of her baby daughter Clementine\n\nThe Traitors fans brand Charlotte a 'backstabber' as she throws her ally Freddie 'under the bus' in a VERY tense breakfast\n\nMy Emmerdale star mum is envious of my successful £100k a month OnlyFans career\n\nLegendary singer dies aged 85 after being diagnosed with incurable lung cancer\n\nLove Island: All Stars fans CRINGE for Elma as she accidentally says 'I love you' to Ronnie in bed just hours before his ex Harriett's bombshell arrival\n\nReese Witherspoon looks effortlessly chic in a black dress and blazer as she poses with dapper Will Ferrell at the You're Cordially Invited UK screening\n\nThe Traitors fans share hilarious memes as they mourn the loss of 'the worst traitor in history' Freddie after his 'epic fail'\n\nSAS Rogue Heroes star Gwilym Lee lifts the lid on the Bohemian Rhapsody set as he reflects on 'incredible' experience working on Queen biopic\n\nA$AP Rocky's potential jurors quizzed over Rihanna and her lingerie line amid gun-firing case\n\nCHRISTOPHER STEVENS reviews High Potential on Disney +: Crime-fighting Mrs Mop who makes Sherlock look like the class dunce...\n\nWhy Hollywood star Matt Damon would be popping some champagne corks after watching racing from Tamworth\n\nRihanna sets pulses racing in sexy black lingerie to promote Savage X Fenty\n\nLabyrinth sequel slammed by fans who are raging at Robert Eggers' follow-up to the David Bowie cult classic\n\nMatty Healy's younger brother Louis, 23, shows off uncanny resemblance to The 1975 star as he displays his tattoos in edgy black and white photo shoot\n\nDragons' Den judges left speechless after 'heart-wrenching' pitch from Ukrainian refugee who fled her home country with just her laptop and £5k \n\nLove Island: All Stars' fans slam Gabby for 'silly' comment as she implies that Catherine and Nas should have been dumped from the Villa\n\nBradley Walsh set to 'front new TV series with a surprising twist' and its very different from his other shows\n\nGuy Pearce nabs Australia's lone Academy Awards acting nomination... after split with partner Carice van Houten is confirmed\n\nThe BRIT Awards 2025: Charli XCX leads female dominated nominations with FIVE nods including Album Of The Year\n\nInside Molly-Mae Hague's second birthday party for daughter Bambi with adorable tiger theme and homemade cake as she shares sweet post: 'You changed my world forever'\n\nJohn Barrowman forced to 'give away' tickets to his tour as he attempts to relaunch his career after failed Celebrity SAS stint\n\nBen Affleck pulls strained faces as he arrives at his LA office amid claim ex Jennifer Garner wants him to 'grow up'\n\nMichelle Yeoh, 62, looks decades younger in a tight dress at the premiere of her show Star Trek: Section 31\n\nTallia Storm sparks romance rumours with Love Island hunk with cosy TikTok as his ex is linked with dramatic All Stars return\n\nGK Barry cuts a casual figure while protecting her adorable pet pooch from the rain as she steps out following a radio appearance\n\nJeff Bezos' surprising reaction to men ogling fiancée Lauren Sanchez\n\nHBO fans are sent into a meltdown as popular show is set to end with upcoming season four\n\nKatie Price's IVF documentary branded 'attention seeking dribble' by ex Alex Reid's partner amid their own seven-year battle to conceive\n\nKendrick Lamar announces Grammy-award winner is joining his star-studded Super Bowl halftime show\n\nDancing on Ice judge Oti Mabuse says it's 'tougher' for stars with previous experience to compete on the skating show amid fix claims\n\nMaya Jama sizzles in figure-hugging red gown and Davina McCall flashes her legs in chic white minidress in first look at The Masked Singer\n\nZendaya fans outraged after Challengers star was snubbed for an Oscar nod... as movie misses major nomination\n\nCarrie Underwoodbreaks silence after Donald Trump inauguration performance with telling message\n\nFormer child star claims she was told to lose 15lbs and 'strap down' her chest at age 12\n\nEXCLUSIVEDiane Warren 'proud' to land 16th Oscar nod as fans say 'she better win this time!' after Malibu home burned\n\nMolly-Mae Hague steps out in her pyjamas as she waves off ex-fiancé Tommy Fury outside her £4m Cheshire home - before reuniting for daughter Bambi's birthday\n\nCAROLINE BULLOCK: Demi 'Gimme' Moore is having a pre-Oscar's pity party... but this 'popcorn' actress doesn't get a kernel of my sympathy\n\nDavid Beckham enjoys a pint at the pub as he learns about his 'long lost twin brother' in Stella Artois Super Bowl 2025 advert\n\nKylie Jenner holds a red rose as boyfriend Timothée Chalamet gets 2nd Oscar nomination\n\nEXCLUSIVECarrie Underwood's inauguration performance sparks major issue with American Idol\n\nThe Beatles land first BRIT Award nomination in 42 years for their last ever song Now and Then - featuring John Lennon's vocals thanks to AI\n\nAndie MacDowell, 66, reveals shock health diagnosis as she discusses aging in Hollywood\n\nPauline Quirke's son Charlie breaks his silence in emotional update after the Birds Of A Feather star's dementia diagnosis\n\nKatherine Ryan fans say she's 'absolutely spot on' after she voiced disgust at the 1,057 'desperate' men who queued hours to sleep with Bonnie Blue\n\nCoronation Street blasted by charity for 'ignoring' its advice on 'unrealistic and distressing' kidney transplant storyline\n\nPregnant Amy Jackson showcases her growing baby bump in topless snap as she goes 'skinny dipping' during luxury holiday\n\nPregnant Michelle Keegan shows a glimpse of her baby bump in a grey tracksuit as she promotes her Very collection \n\nThe striking hidden messages in the nine best 'revenge dresses' worn by celebrities for their most difficult, high profile moments and what they REALLY mean\n\nKit Harington chases Mark Wahlberg around the streets of London on the set of new Apple film Family Plan 2\n\nIconic 1970s movie star, 80, is gearing up for West End return over 50 years after she debuted on Broadway - but can YOU guess who it is?\n\nMillie Bobby Brown flaunts her toned figure in tiny string bikini and displays her trendy style in Matrix-inspired black leather look in sizzling snaps\n\nChristine McGuinness shocks with X-rated joke about Celebrity Hunted stars - leaving partner Duncan James blushing\n\nDon't reign on her parade! Queen Letizia dazzles in red power suit amid gloomy weather on school visit to Madrid\n\nLucien Laviscount reveals he's taken up French lessons for Emily In Paris ahead of anticipated fifth season\n\nWould you wear this to the beach? Aussie model risks major wardrobe malfunction in a white bikini\n\nCrown Prince and Princess of Norway enjoy ski trip with Prince Sverre Magnus - as Mette-Marit's eldest son returns to Norway following 'rehab stint'\n\nNoel Fielding slowly regains social media presence with new post after revealing his future on Bake Off amid health concerns\n\nColdplay release 45 minute film to celebrate the release of tenth album Moon Music - as Chris Martin calls it 'the best thing we have ever been a part of'\n\nBBC confirms spin-off series for two of its most popular shows - and they're just weeks away from hitting screens\n\n'I cannot tell my kids I'm leaving them, it's too soon': Footballer's wife makes 'final push' to raise money to pay for cancer treatment after fourth diagnosis\n\nLove Island: All Stars' Olivia Hawkins blames her shock dumping on flirty exchanges with Luca Bish\n\nHailey Bieber's two-word message to fans about state of her marriage as she puts on a leggy show amid breakup rumors\n\nThe Traitors star Minah breaks her silence on brutal banishment and reveals what she really thinks of her rival Charlotte\n\n2025 Grammy winners 'leaked' ahead of awards show - and one major artist is set for a shock snub\n\nBruce Willis, 69, makes a rare public appearance in LA as he battles frontotemporal dementia\n\nMichelle Keegan insists 'Brassic has not been axed' despite bosses confirming it won't be returning after season seven\n\nBilly Ray Cyrus' son makes dramatic plea after 'trainwreck' performance at Trump inauguration: 'You're not healthy Dad and everyone is noticing'\n\nJulia Haart dances in her kitchen as she celebrates keeping $58million home and nearly $10million in cash in huge divorce win\n\nBlake Lively and Ryan Reynolds make shock request after Justin Baldoni's lawyer released bombshell video\n\nFKA twigs puts on a daring display in TINY black shorts as she departs Hotel Costes with a mystery man in Paris\n\nJudi Dench, 90, reveals she can no longer go out alone due to the severity of her sight loss as she shares fears she could 'fall over'\n\nSting's wife Trudie Styler puts on a brave face after the singer cancelled awards appearance due to ill health\n\nWhoopi Goldberg unveils makeover in Paris after weight loss drugs helped her slim down from 300lbs\n\nDick Van Dyke, 99, shares his secret to staying fit as he details his exercise routine in a new interview\n\nLeonardo DiCaprio to reunite with Martin Scorsese on years-in-the-making thriller Devil In The White City\n\nLorraine Kelly, 65, admits she still struggles with 'working class cringe' despite 40 years of TV success as she reveals the big name that's left her the most star-struck\n\nRihanna emotionally leads heartfelt tributes to Lynn Ban after death at 52: 'Can't believe I'm writing this'\n\nKhloe Kardashian makes rare comment on Tristan Thompson's co-parenting as she reveals if she's single\n\nBenedict Cumberbatch reveals he was KIDNAPPED while on location in South Africa: 'It made me patient to live a life less ordinary'\n\nThe Tudors star Jonathan Rhys Meyers reveals he lost his Malibu home in devastating LA fire\n\nJustin Baldoni's lawyer previously sued him for allegedly stealing a movie script from a man with cystic fibrosis\n\nGiddy Justin Baldoni seen with wife hours before releasing bombshell Blake Lively video amid their lawsuits\n\nThe Traitors fans rejoice as 'the worst player in show history' is murdered leading Frankie to break down in tears\n\nLove Island: All Stars' Grace Jackson reveals the REAL reason she ended romance with Marcus Rashford \n\nHolly Willoughby is happier than ever as she 'jokes around and chats' on Dancing On Ice set following Phillip Schofield's departure\n\nEXCLUSIVEMy boyfriend won The Traitors and this is how I feel about his lies\n\nSir Rod Stewart, 80, and his son Alastair, 19, are in high spirits as they sing and snap selfies at Celtic vs Young Boys in Glasgow\n\nChris Brown lawsuit: Warner Bros. Discovery stands behind docuseries as singer's lawyer rips corporation\n\nKardashians hairstylist Jen Atkin moving out of California after losing her $8M Malibu home in LA fires\n\nGuardians of the Galaxy star Chris Pratt reveals his home is 'miraculously still standing' after his ex Anna Faris lost her house in LA fires\n\nAmy Schumer reveals how comments about her 'moon face' led to shock health diagnosis\n\nThe Traitors Charlotte TURNS on teammate Minah in most dramatic roundtable yet as fans declare they are 'rooting for a faithfuls win'\n\nA-List singer performed for Robert F. Kennedy Jr. during surprise appearance at inauguration ball\n\nSharon Horgan admits she regrets not ending her marriage earlier as 'it was so clear that it wasn't right' and reveals she is the only one parenting her daughters\n\nMolly-Mae Hague breaks down in tears whilst watching old videos of herself with her daughter Bambi as she admits she 'wishes she knew the best times were round the corner'\n\nEXCLUSIVEAnna Maynard insists she has 'thick skin' as she speaks candidly about online trolling and how fitness has 'completely changed' her mental health\n\nSelena Gomez fans react to rumors fiance Benny Blanco will play live-action Tangled heartthrob\n\nLynn Ban dead at 52: Bling Empire star and celebrity New York jewelry designer passes away weeks after ski accident\n\nNicola Coughlan shows support to fellow Derry Girls star Dylan Llewellyn as she joins Mel C at Channel 4's Big Boys screening ahead of series three\n\nArnold Schwarzenegger is donating $1M to LA fire relief as new blaze breaks out forcing tens of thousands from their homes\n\nTina Turner song set to be released for the first time after lying undiscovered for 40 YEARS - 19 months after the iconic hitmaker's death\n\nJoni Mitchell, 81, looks radiant on very rare public outing with a male pal in Beverly Hills\n\nMel B calls for action over words in impassioned speech on domestic abuse at the World Economic Forum in Davos\n\nA new Traitor is recruited with just TWO days to go before finale as fans fear he'll be the next victim in Charlotte's 'evil' web\n\nSelena Gomez, 32, teases new music despite previously saying she's 'too old for the pop star life'\n\nSelling Sunset star Nicole Young on break from show amid her feud with Chrishell Stause\n\nLove Island: All Stars is hit by a shock dumping as TWO fan favourites are axed from the villa after being branded the 'least compatible' by viewers\n\nBilly Ray Cyrus says 'you just had to be there' after trainwreck outing at Trump inaugural ball\n\nJessica Simpson flaunts her revenge body in a low-cut swimsuit after splitting from Eric Johnson\n\nThe Traitors fans brand Leanne's final week decision 'idiotic' as she attempts strategic move after traitor Minah was banished\n\nOscars bosses make huge announcement over 2025 Academy Awards despite backlash amid horrific LA fires\n\nLove Island's Harriett Blackmore set to cause chaos by confronting Ronnie Vint as she and Montel McKenzie are latest bombshells to shake up the villa\n\nAlly Lewber confirms James Kennedy split after it's revealed he won't face charges following his domestic violencearrest\n\nBachelor star Brad Womack says Ellen DeGeneres eventually apologized after calling him a 'jerk' on her show\n\nBarry Michael Cooper dead at 66: Writer of New Jack City, Sugar Hill and Above The Rim passes away\n\nMikey Madison puts on leggy display in powder blue coord during NYC outing amid Anora Oscar buzz\n\nRingo Starr's son Zak Starkey cancels London performance after shock health diagnosis\n\nLove It or List It viewers slam 'miserable' and 'impossible to please' mother-of-five for refusing to move house\n\nJoJo Siwa goes Instagram official with her Aussie girlfriend in PDA-packed post\n\nUB40's Robin Campbell and Jimmy Brown insist that 'all the money in the world' would not get them to reunite with former bandmate Ali Campbell\n\nJames Kennedy will NOT face charges after domestic violence arrest... amid split claims with Ally Lewber\n\nEXCLUSIVEBling Empire's Leah Qin pays tribute to 'genuinely sweet' Lynn Ban after co-star dies following skiing accident\n\nLove Island star rushed to hospital with nasty injury amid rumours he is set to make a return to All Stars\n\nFuture of Noel Fielding's Apple TV+ series The Completely Made-Up Adventures of Dick Turpin is 'revealed' after the star pulled out of series \n\nFriends of Aubrey Plaza's late husband Jeff Baena speak out after his shock death\n\nPretty in pink! Queen Letizia of Spain looks chic in a rose-coloured blazer from high-street brand as she joins her husband King Felipe at a tourism fair in Madrid\n\nBlake Lively and Justin Baldoni's costar Jenny Slate bombarded by cruel trolls amid their bitter legal battle\n\nBella Hadid is still in her Yellowstone era as she rocks oversized bomber jacket with shearling trim in NYC\n\nMeg Ryan teases 'iconic' reunion with When Harry Met Sally co-star Billy Crystal... see them now\n\nCHRISTOPHER STEVENS reviews Grantchester on ITV1: One look at Grantchester's new vicar and Geordie's knees turned to jelly\n\nAdele's 'haunted house' claim scares off buyers of her old £6m mansion making the luxury home 'unsellable', property's owner says\n\nHarry Potter star Miriam Margolyes takes a swipe at Australia and reveals the one thing she doesn't like about the country\n\nThe Traitors fans send their 'prayers for Minah' as viewers fear the villain's time could be up as accusations start flying\n\nEternal reveal plans to release their first new album in 30 years with a new member - after a trans rights row with ex-bandmate Louise Redknapp \n\nThe six-figure sum Sir Michael Parkinson left to his beloved wife Lady Mary as his will is signed off - two years after his death aged 88\n\nITV confirms Jonathan Ross will return to present Oscars LIVE while Conan O'Brien hosts star-studded ceremony in LA\n\nLottie Tomlinson and fiancé Lewis Burton are seen for the first time with their newborn daughter as they enjoy winter walk after revealing sweet name\n\nMob Wives star Natalie DiDonato found safe in Nevada after sparking missing person report\n\nTaylor Swift is praised by a burlesque legend for her unique approach to a sexy routine\n\nJodie Marsh confronts two 'intimidating and aggressive' strangers on her Chelmsford farm after they 'travelled 125 miles to film through her windows'\n\nNaomi Watts clutches onto her driver for support as she tries not to slip on the icy New York streets while heading to The Drew Barrymore Show\n\nMajor US star to join new series of Channel 4's Taskmaster - and fans can't wait to witness the 'chaos'\n\nBenedict Cumberbatch shares his bewilderment at being branded a sex symbol as he admits to 'worrying about ageing' in candid confession\n\nStephanie Davis reveals the sweet meaning behind her newborn son's name after giving birth to her baby boy following a 'traumatic' pregnancy\n\nKatie Price 'alarms neighbours' over mounting rubbish outside her new £5,000 a month rental - just six months after moving in\n\nEastEnders star Lacey Turner reveals her baby daughter's unusual name after welcoming her third child with husband \n\nBobby Norris reveals he faced vile homophobic abuse from a man at Stratford station\n\nIt Ends With Us author Colleen Hoover DEACTIVATES her Instagram as Blake Lively and Justin Baldoni legal saga continues\n\nRicky Gervais pays tribute to his canine co-star Anti as After Life dog dies age 13\n\nEXCLUSIVEInside Tyra Banks' secret Aussie life: Supermodel reveals plans for TV comeback Down Under\n\nZoe Saldana reveals why she initially turned down the offer to work with Nicole Kidman on Lioness\n\nToday's headlines\n\nStrictly star Wynne Evans is caught on film making sick sexual jibe about female presenter - plunging the...\n\nSinead O'Connor leaves £1.7million to her children as she urges them to 'milk her music for what it's worth'...\n\n'It's been sh** for all of us': Holly Willoughby sobs as she reveals for the first time the true extent...\n\nKelly Brook reveals she's made her mind up on having kids after an 'honest' admission from her grandma\n\nI know that my father committed INCEST with me while I was asleep - he touched me, filmed me and called me a...\n\nX Factor star Cher Lloyd hits out at Simon Cowell in her latest single - 12 years after leaving his record...\n\nBritish social media manager and her fiancé died in Vietnam after drinking 'homemade' limoncello bought from...\n\nPETER HITCHENS: I have a sneaking suspicion why the Southport child-killer Axel Rudakubana suddenly turned...\n\nI make £1million a month, am willing to get HIV and pay my ex-husband to work for me: BONNIE BLUE'S shocking...\n\nBritain's filthiest supermarkets and corner shops named and shamed: Almost 300 fail hygiene ratings... so is...\n\nLocals blast neighbours who built 'illegal' hair salon in BACK GARDEN of £650k home and say it's a...\n\nBritain's most miserable town. DAVID LEAFE'S childhood Slough had a thriving High Street. Now shops are...\n\nHow a heartbreaking experience forced Jennifer Aniston to come clean about Barack Obama cheating rumors\n\nElon Musk tells Germany's radical far-right AfD party there's too much 'guilt' over the 'sins' of Nazi...\n\nFirst study into 'very young' colon cancer patients reveals three risk factors driving deaths in people...\n\nThree teenage boys aged 18 and 19 are killed in road crash while another is fighting for life after Seat...\n\nKelsey Parker is pregnant! The Wanted star Tom's widow reveals she's expecting a baby with her new boyfriend...\n\nI was on Come Dine With Me and became a cult star...I get recognised around the world but there is an awful...\n\nUS drugs kingpin is arrested in UK after his wife posted pictures of their European holidays - allowing...\n\nInsiders reveal how Lauren Sanchez reacted to the brutal backlash over her inauguration outfit\n\nIs THIS Britain's skinniest home? Thin property is just 2ft wide... but could YOU live there?\n\nThe reason why Meghan Markle 'broke royal protocol' on her first official engagement with the Queen - and...\n\nSecret depravity of the Davos global elite: More sex parties than ever, NDAs for prostitutes, transsexual...\n\nJustin Baldoni's trove of WhatsApps and videos he believes will torpedo Blake Lively's career for good: The...\n\nGrade I listed 14th-century castle with its own village goes on sale for eyewatering sum for the first time...\n\nWH Smith 'to sell ALL of its High Street shops' in massive deal 233 years after opening flagship store\n\nLaura Woods gives birth! Presenter welcomes first child with Love Island star fiancé Adam Collard - and...\n\nI've visited every country in Europe - this is the 'cute place most people forget about' and these are the...\n\nBoy, 14, is charged with murder of 12-year-old schoolboy Leo Ross as his family say: 'Not only has his life...\n\nTommy Fury's father Big John quits his son's sports business as Tommy gets closer to ex-fiancee Molly-Mae...\n\nBlake Lively claims Justin Baldoni is STILL waging a 'retaliation campaign' against her amid legal battle\n\nTraitors star Alexander Dragonetti issues update on his relationship status - after being branded a...\n\nClaudia Winkleman reveals the one Traitors moment that made her break down in tears - and how she almost...\n\nSingle woman left stunned after receiving cryptic note midway through her date\n\nPaddy McGuinness blunder forces Warburtons to ditch batch of loaves after TV visit to one of its production...\n\nTrump explodes at Denmark PM in 'aggressive' phone call fight over the fate of Greenland\n\nJennifer vanished 19 years ago. Now eerie footage enhanced by NASA is the key to finding her\n\nMarried At First Sight star 'really upset and disheartened' as they're brutally axed from upcoming reunion...\n\nCrime drama with 'the best twist since Broadchurch' is finally free to stream on ITV - and it's the perfect...\n\nBetrayed by Boyzone: I helped make the band £10m EACH with Louis Walsh and they never said thank you - then...\n\nPlane passenger publicly berated by furious mom after refusing to swap seats with her toddler\n\nThe tragedy that tore a community apart: When neighbours in Southport hear children screaming as they play,...\n\nDisabled pensioner Alan Barnes who stands just 4ft 6ins tall tells how being attacked by drug addict outside...\n\nBill Gates' autism bombshell and how breakthrough Christmas dinner with Trump shaped their plans for the...\n\n'Ed sees himself as Greta Thunberg!' Labour insiders tell DAN HODGES they now think Starmer made a HUGE...\n\nJust one in ten people think Labour is doing a good job in government, poll finds - as Sir Keir Starmer sees...\n\nLORD ASHCROFT: What do we think of Two-Tier Keir and Rachel from Accounts so far? RUBBISH!\n\nAMANDA PLATELL: Harry said he'd never settle his court case. Now he has... and I have a good idea why\n\nBill Gates says divorcing wife Melinda is his biggest failure and left him 'miserable for years'\n\nStiletto sales surge as office staff fall head over heels\n\nMORE HEADLINES\n\nCancer doctor wins gruelling 268-mile ultramarathon after a picture from last year's race exposed her cheating ex-boyfriend's affair\n\nWH Smith 'to sell ALL of its High Street shops' in massive deal 233 years after opening flagship store\n\nThe reason why Meghan Markle 'broke royal protocol' on her first official engagement with the Queen - and Harry's surprising reaction\n\nPictured: Future child killer Axel Rudakubana attending drama class just six years before his murderous rampage in Southport - as fellow pupils said 'it was clear and obvious that something was wrong in his brain'\n\n'It's been sh** for all of us': Holly Willoughby sobs as she reveals for the first time the true extent horror kidnap and murder plot had on her husband and three children - and how quitting This Morning was 'simple and easy'\n\nTrump explodes at Denmark PM in 'aggressive' phone call fight over the fate of Greenland\n\nThree teenage boys aged 18 and 19 are killed in road crash while another is fighting for life after Seat Ibiza smashes into tree\n\nSecrets of why Melania Trump 2.0 is going to do things differently this time... with a vow that may make her more unpredictable than her husband\n\nHeartbreaking statement made by husband after 'grotesque' wife is jailed for abusing him 'almost night after night'\n\n'Her world has ended': Grieving mother of 'murdered' schoolgirl, 6, found dead in her home with her father has been left crushed at the loss of her 'happy and smiley' child, friend says\n\nWhy your Place in the Sun dream could still come TRUE: As Spain tries to slap Brits with a 100% tax on holiday homes, foreign property expert and TV presenter LAURA HAMILTON reveals why the plan is already backfiring\n\nPETER HITCHENS: I have a sneaking suspicion why the Southport child-killer Axel Rudakubana suddenly turned to violence at the age of 13...\n\nSecret depravity of the Davos global elite: More sex parties than ever, NDAs for prostitutes, transsexual women… and the most commonly-requested sex act revealed\n\nMexico risks Trump's wrath as it BLOCKS packed illegal migrant deportation flight from landing\n\nDisabled pensioner Alan Barnes who stands just 4ft 6ins tall tells how being attacked by drug addict outside his home 10 years ago 'changed my life'\n\nJennifer vanished 19 years ago. Now eerie footage enhanced by NASA is the key to finding her\n\nMy heart-thumping terror on the day I came face to face with a huge polar bear that tried to EAT ME ALIVE\n\nTrump's 'ice maiden' chief of staff launches brutal takedown of Elon Musk as she REFUSES to give him a West Wing office and issues stark warning over being 'co-president'\n\nInside the first week of Trump's mammoth migrant round up… and the rapists and murderers heading home\n\nBritish social media manager and her fiancé died in Vietnam after drinking 'homemade' limoncello bought from a local restaurant on Christmas Eve\n\nWoman slashed in neck and man knifed in stomach fight for life after double stabbing horror\n\nInstant karma! Vandals KO'ing themselves, justice unleashed on a woman-beater, an ostrich that is not taking your nonsense and other times the universe levelled the scores... all caught on film\n\nCosts in Prince Harry's case against Mail are 'manifestly excessive', judges rule\n\nFour fe","summary":"Tom Parker's widow Kelsey Parker has revealed she's expecting a baby with her new boyfriend Will Lindsay.","url":"https://www.dailymail.co.uk/tvshowbiz/article-14325505/Tom-Parker-widow-Kelsey-expecting-baby-new-boyfriend-pregnant.html","image":"https://i.dailymail.co.uk/1s/2025/01/25/21/94516617-0-image-m-49_1737841531238.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/12/16/7402239122814028975/1024x576_MP4_7402239122814028975.mp4","publish_date":"2025-01-25 22:40:14","author":"Editor,Niomi Harris","authors":["Editor","Niomi Harris"],"language":"en","source_country":"GB","sentiment":0.175},{"id":283916736,"title":"Trump says he may consider rejoining World Health Organization","text":"US President Donald Trump said on Saturday he may consider rejoining the World Health Organization, days after ordering a US exit from the global health agency over what he described as a mishandling of the Covid-19 pandemic and other international health crises.\n“Maybe we would consider doing it again, I don’t know. Maybe we would. They would have to clean it up,” Trump said at a rally in Las Vegas.\nThe US is scheduled to leave the WHO on January 22, 2026. Trump announced the move on Monday after he was sworn in for a second term in the White House.\nThe US is by far the biggest financial backer of the WHO, contributing around 18 per cent of its overall funding. The WHO’s most recent two-year budget, for 2024-2025, was US$6.8 billion.\n\nTrump told the crowd in Las Vegas he was unhappy that the US paid more into the WHO than China, which has a much bigger population.\nHe added that he will ask Saudi Arabia to make an investment of about US$1 trillion in the US, up from the US$600 billion the Saudis have pledged to invest.\nSaudi Arabian Crown Prince Mohammed bin Salman told Trump in the past week that the kingdom wants to put US$600 billion into expanded investment and trade with the US over the next four years.","summary":"The US president’s remarks come just days after he ordered the United States to leave the global health agency.","url":"https://www.scmp.com/news/world/united-states-canada/article/3296302/trump-says-he-may-consider-rejoining-world-health-organization","image":"https://cdn.i-scmp.com/sites/default/files/d8/images/canvas/2025/01/26/e2a82712-6b7f-480e-aaa5-0d4b7b3f811e_7e96081a.jpg","video":null,"publish_date":"2025-01-25 22:39:44","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"cn","sentiment":-0.129},{"id":283919974,"title":"Florida man arrested for allegedly calling for Trump assassination on Facebook; Secret Service investigating","text":"The Secret Service is investigating after a Florida man was arrested in West Palm Beach and charged with calling for the assassination of President Donald Trump on Facebook. Shannon Depararro Atkins, 46, of West Palm Beach, was arrested after allegedly threatening the life of the president, West Palm Beach Police Chief Tony Araujo confirmed during a press conference Saturday. Atkins is charged with felony intimidation, drug possession and smuggling contraband in a county detention center, according to jail records. TRUMP ASSASSINATION ATTEMPT VICTIMS WITH LIFE-ALTERING INJURIES SEEK ACCOUNTABILITY: ‘IT WILL COME TO LIGHT’ A tip was called in to the FBI National Threat Operations Center late Sunday, reporting Atkins was making violent threats against the president on Facebook. A Palm Beach detective began working the case Monday and found \"disturbing\" posts, according to Araujo. Some of the posts included, \"Lincoln, JFK, Reagan, Martin Luther King and Trump - unfortunately, one is still alive\"; \"Bullets, please. Jesus, save America\"; and \"I've been banned from X because I said 'I hope and pray someone kills him. We haven't had an assassination in years.'\" The department secured a probable cause warrant and began surveillance, arresting Atkins near one of his homes at 7:30 p.m. Friday. Officers found three bags of cocaine in Atkins' pocket at the time of the arrest, according to Araujo. While being interviewed, he admitted to writing the Facebook posts but said he was joking, authorities said. \"Folks, this is not a joke. Nothing of that sort is a joke,\" Araujo said during the press conference. TRUMP SHOOTING: TIMELINE OF ASSASSINATION ATTEMPT The Secret Service was notified and is reviewing the case to determine whether there will be federal charges, the department said. \"The U.S. Secret Service does not comment on matters involving protective intelligence,\" the agency wrote in an email to Fox News Digital Saturday. \"What we can say is that the Secret Service investigates all threats against our protectees.\" Authorities confirmed the FBI was also involved in the investigation. Araujo said, in today's climate, people cannot make threats, even jokingly. CLICK HERE TO GET THE FOX NEWS APP \"We have incident after incident, example after example, of when these threats become real, and we take these very seriously,\" he said. \"Did we avert something? You never know. I do know that we developed probable cause, we arrested Mr. Atkins and he's going to have to answer the charges.\" Atkins' bond was set at $5,000 for the drug charges, but bond was denied for the threats against Trump, according to jail records.","summary":"A Florida man was arrested after allegedly calling for the assassination of President Donald Trump on Facebook. The Secret Service is investigating.","url":"https://www.foxnews.com/us/florida-man-arrested-calling-trump-assassination-social-media-posts-secret-service-investigating","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/01/931/523/29d393e7-mug.png?ve=1&tl=1","video":null,"publish_date":"2025-01-25 22:38:29","author":"Alexandra Koch","authors":["Alexandra Koch"],"language":"en","category":"politics","source_country":"us","sentiment":-0.49},{"id":283916366,"title":"LORD ASHCROFT: What do we think of Two-Tier Keir and Rachel from Accounts so far? RUBBISH!","text":"What do you think of it so far?' Eric Morecambe used to cry halfway through a sketch on Morecambe & Wise. 'Rubbish!' the audience would yell back cheerfully. \n\nFinding out what the voters made of their first six months of Keir Starmer has been a bit like that, minus the laughs.\n\nMost people have better things to do than think about politics, especially having endured a drawn-out general election campaign. But what gets through is telling.\n\nIn my research, when we ask people what stories they remember, they mention winter fuel allowance cuts, rising small-boat migration, tax rises, the struggling economy, broken promises and the lavish supply of free accommodation, tickets, clothes and spectacles we now know the Prime Minister and his colleagues enjoyed while decrying their opponents' cronyism.\n\nThough Keir Starmer gets some credit for dealing decisively with the summer riots, and some accept his arguments against a national inquiry on grooming gangs, there remains a widespread feeling that for this government, issues connected to immigration, culture and religion are simply not for discussion. \n\nThe revelations from last week's Southport killings trial will only add to that perception.\n\nThe concept of 'Two-Tier Keir' and double standards in law enforcement has also taken hold – in my focus groups, Labour voters often talked about criminals being released early from prison while others were locked up for things they wrote on Facebook.\n\nApart from the train drivers and those receiving generous public sector pay awards, few think things are getting any better. \n\nI found more than four in ten voters saying they had been negatively affected by one of the Government's decisions so far, including nearly a quarter of those who voted Labour.\n\nOnly one in 20 said the party's actions had had a positive effect on their household. And while many voted for change, a majority – again including a quarter of Labour voters – say the country is still heading in the wrong direction. \n\nJust one in 50 think the economy is doing well. Though most think this is down to the Tories or factors beyond any government's control, nearly one in three say it is largely down to Labour – or 'Rachel from Accounts', as Chancellor Ms Reeves is now widely known.\n\nPeople fear her hike in employers' National Insurance and other burdens on business will mean lower growth and higher prices, worsening rather than relieving the cost of living. \n\nMajorities in all political and demographic groups are pessimistic about Britain's future. Not only that, few feel that the Government has a sense of purpose, or have any confidence in the Prime Minister to get a grip.\n\nThere is little sense that a plan exists to tackle the country's lingering crises in the economy, immigration and public services. (Whether or not they like Donald Trump or his agenda, how many will have looked wistfully across the Atlantic this week at a new administration so fiercely determined to shake things up and get things done?)\n\nInstead, ministers seem more interested in things that barely feature on voters' priority lists.\n\nTheir fixation on reaching net zero greenhouse gas emissions is a prime example. As I found, most think achieving net zero will mean higher costs for them and their households, and only a minority think doing so is worth the cost or would significantly help to limit climate change.\n\nMost people also oppose allowing 16 and 17-year-olds to vote, which the Government plans to legislate for this year.\n\nThe ostensible reason for the change is to encourage youngsters to participate in democracy, but just over a third believe that the real motive is to harvest more votes for Labour.\n\nDespite these many complaints, Starmer's one big advantage is the divided forces ranged against him. \n\nVery few say they have yet heard anything from new leader Kemi Badenoch and the Conservatives. At this stage, most assume they are regrouping and biding their time – and rightly so, given the way they left things.\n\nAsked who is currently providing the most effective opposition, voters are nearly twice as likely to name Nigel Farage and Reform – with their five MPs – as the Tories.\n\nStarmer retains a lead when we ask who would make the best prime minister – but only 31 per cent actually choose him.\n\nCrucially for Labour, while only a quarter of their 2024 voters say the Government is doing some good things, a further six in ten say they are still prepared to give them some time despite the lack of progress.\n\nAs many in my focus groups have argued, it would be tough to turn around a business in just six months, let alone a whole country after a series of political traumas and 14 years of another party's rule.\n\nThis – and the Tory-Reform schism – explain why Labour remains fractionally ahead when we ask people how likely they currently think they are to vote for each party next time round.\n\nThat said, our analysis shows that the number of voters prepared to give the Government any benefit of the doubt has fallen by ten points since the election.\n\nAnd the average time these people are prepared to give them before deciding if they are up to the job is now 32 months, down from 40 months in the summer.\n\nThe longer time goes on with little to show for the change they craved, the more vulnerable Labour will be when the Government is really tested.\n\nIn Ernest Hemingway's debut novel The Sun Also Rises, first published in 1926, one of the characters asks another how he went bankrupt.\n\n'Two ways,' he replies. 'Gradually and then suddenly.'\n\nIt's easy to see confidence in Labour following suit.\n\nLord Ashcroft is an author, businessman, philanthropist and pollster. His research is available at LordAshcroftPolls.com","summary":"LORD ASHCROFT: Finding out what the voters made of their first six months of Keir Starmer and Rachel Reeves has been a bit like an episode of Morecambe and Wise, minus the laughs","url":"https://www.dailymail.co.uk/debate/article-14325449/ashcroft-Keir-Starmer-Rachel-Reeves.html","image":"https://i.dailymail.co.uk/1s/2025/01/25/21/94515985-0-image-m-65_1737841043480.jpg","video":null,"publish_date":"2025-01-25 22:36:55","author":"Editor,Lord Ashcroft","authors":["Editor","Lord Ashcroft"],"language":"en","source_country":"GB","sentiment":-0.251},{"id":283922506,"title":"Air Force pulls class with Tuskegee Airmen video after DEI order","text":"The Air Force has pulled and is reviewing a basic military training course that includes videos on the history of pioneering Black and female pilots during World War II, following President Donald Trump’s order to halt diversity, equity and inclusion programs.\n\nThe unofficial Facebook page Air Force amn/nco/snco on Friday night posted an excerpt of an internal Air Force message, which said videos on the Tuskegee Airmen and Women’s Airforce Service Pilots, or WASPs, had been removed from the service’s BMT course.\n\n“In accordance with NEW DEIA [diversity, equity, inclusion and acceptance] Guidance the lesson plans listed below have been changed/alternated to meet the guidance,” the leaked internal message said, adding that the revised lessons should be used “immediately,” with the final word underlined and in bold.\n\nAn Air Force official told Air Force Times the videos themselves were not targeted for removal, but BMT classes that include diversity materials were pulled and are now under review to make sure they are in compliance with this week’s executive orders.\n\nOne of those classes, a one-day program titled “Airmindedness,” included videos on the Tuskegee Airmen and WASPs, as well as an inspirational-style recruiting video called “Breaking Barriers.”\n\n“Historical videos were interwoven into Air Force curriculum and were not the direct focus of course removal actions,” the official said. “Additional details on curriculum updates will be provided when they’re available.”\n\nTrump repeatedly blasted DEI programs on the campaign trail, and signed an executive order on his first day ending such initiatives, which he called illegal, discriminatory and wasteful. Trump’s newly confirmed Defense Secretary Pete Hegseth is a vocal critic of the military’s diversity programs, which he alleges have diverted its attention from fighting wars and made the military less lethal.\n\n“The Department of the Air Force will fully execute and implement all directives outlined in the Executive Orders issued by the President, ensuring that they are carried out with utmost professionalism, efficiency and in alignment with national security objectives,” an Air Force spokesperson said in an email.\n\nThe Air Force issued a memo on Wednesday to put Trump’s executive order in practice, which ordered commands and units to pull down all public websites, social media accounts and other media for DEI offices; withdraw any DEI documents, plans or orders; and cancel training and contracts for DEI.\n\nThe service also shuttered its barrier analysis working groups, which sought to expand opportunities for members of underrepresented groups to become pilots and reach other goals in the Air Force.\n\nThe “Breaking Barriers” video that was part of the now-pulled class includes clips of aircraft — from early Wright Flyers to stealth B-2 bombers — and noteworthy airmen as it discusses the history and accomplishments of the Air Force. Later, the video displays a cockpit image of now-retired Brig. Gen. Jeannie Leavitt, the first female fighter pilot in U.S. history.\n\n“It wasn’t that long ago, they said man couldn’t fly,” the video’s narrator said. “In 1947, we broke the sound barrier. The Tuskegee Airmen broke the color barrier. America’s women broke the gender barrier.”\n\n“Some walls are inside your head,” the narration continued, underscoring images of civil rights activists and the Berlin Airlift. “Some walls are in the minds of others: Intolerance, ignorance, oppression.”\n\nWorld War II aviation pioneers\n\nThe Air Force, like all military services, takes tremendous pride in its history, and the Tuskegee Airmen of the 332nd Fighter Group are among its most storied.\n\nThe Red Tails, as they were nicknamed, have been depicted on screen numerous times, most recently in the miniseries “Masters of the Air.” Gen. CQ Brown, then the Air Force chief of staff and now chairman of the Joint Chiefs of Staff, was named an honorary Tuskegee Airman in 2021 and awarded their signature red jacket. Additionally, the Air Force’s newest jet trainer, the T-7, was dubbed the Red Hawk, with its twin tails painted red as a tribute to the Tuskegee Airmen.\n\nTelling the story of the Tuskegee Airmen and their achievements is all but impossible, however, without addressing the history of segregation in the armed forces and the prejudice Black troops encountered.\n\nThe Tuskegee Airmen were the first and only Black airmen to fly in World War II, during a time when the U.S. military was segregated and opportunities for Black troops were limited. They were exceptionally skilled pilots, who flew distinctive red-tailed P-47 Thunderbolt and P-51 Mustang fighters over Europe, becoming known in the process as some of the best bomber escorts in the Army Air Forces. Their combat record was so successful that it helped prompt the newly formed Air Force, and eventually the entire military, to desegregate in the years following World War II.\n\nDuring his first administration, President Trump promoted one of the last surviving Tuskegee Airmen, Charles McGee, who was 100 at the time, to brigadier general and honored him as a guest during the 2020 State of the Union. Hours earlier, Trump pinned a brigadier general star on McGee’s right shoulder in an Oval Office ceremony. McGee passed away nearly two years later.\n\n“After more than 130 combat missions in World War II, [McGee] came back to a country still struggling for civil rights and went on to serve America in Korea and Vietnam,” Trump said in the 2020 speech. “General McGee, our nation salutes you.”\n\nIn a 2017 interview with Air Force Times and other reporters, McGee said bomber pilots the Tuskegees escorted gave them the nickname Red Tails, and had no idea they were Black.\n\n“We were trained well, we were prepared for the opportunities, and although we were segregated, fortunately the record we established helped the Air Force … to say, ‘We need to integrate,’” McGee said in 2017. “We accomplished something that helped lead the country. We didn’t call it civil rights. It was American opportunity.”\n\nThe contributions of the WASPs to World War II, meanwhile, were largely overlooked for decades, but have received growing acknowledgement and appreciation in recent years. With the vast majority of the nation’s male pilots overseas fighting the war, the Army Air Forces was stretched thin back home. So, it began to enlist the experience of hundreds of qualified female pilots.\n\nCommanding General Hap Arnold in 1942 formed a squadron of women to ferry training aircraft from factories to bases, and set up another detachment of women to train more pilots. In 1943, those units were merged into a group called Women’s Airforce Service Pilots, which yielded the WASP nickname.\n\nThe WASPs first flew only lighter or smaller planes, but soon showed they could also handle heavier bombers and high-speed fighters. Their own training also became more advanced. More than 1,000 WASPs graduated from training during the war, and they ferried more than half of the U.S.’ combat aircraft. They also towed gunnery targets for practice, and instructed pilots how to use their instruments at the Eastern Flying Training Command, according to the Air Force Historical Support Division.\n\nAs the tide of war shifted against Nazi Germany and its once-feared Luftwaffe in 1944, Arnold and other leaders felt the crisis requiring female pilots had started to subside. A House committee that studied the WASPs concluded that “training women was a waste of resources and should be terminated,” the Air Force’s history said. The military shut down WASP training by the end of 1944.\n\nThe War Department’s director of women pilots, Jacqueline Cochran, argued in a 1945 memo to Arnold that WASPs “were as efficient and effective as the male pilots in most classes of duties, and were better than the men in some duties,” such as towing gunnery targets.\n\nThe WASPs’ records were classified and sealed for decades and largely forgotten, until the Air Force in the 1970s began opening up pilot training opportunities to women again. At that time, former WASPs began to speak up about their accomplishments, and in 1977, President Carter signed a bill granting them veteran status with select benefits.","summary":"The military and other agencies have scrambled to comply with President Trump's sweeping executive order barring DEI programs.","url":"https://www.militarytimes.com/news/your-air-force/2025/01/25/air-force-pulls-class-with-tuskegee-airmen-video-after-dei-order/","image":"https://www.armytimes.com/resizer/v2/QKIGFOAIEBFXXOZIYNMFYD5KCE.jpg?width=1200&auth=a95e6b91f0793d57431d5c65f9cb17f009e5a4b737d7b8dd3113753de9a11a0c","video":null,"publish_date":"2025-01-25 22:35:12","author":"Stephen Losey","authors":["Stephen Losey"],"language":"en","source_country":"us","sentiment":-0.044},{"id":283913058,"title":"Johnson invites Trump to address joint session of Congress","text":"House Speaker Mike Johnson (R-Louisiana) invited President Donald Trump to address a joint session of Congress in March, marking his first opportunity to deliver remarks to lawmakers since being sworn into office.\n\n“Your administration and the 119th Congress working together have the chance to make these next four years some of the most consequential in our nation’s history,” Johnson wrote in a letter Saturday to Trump. “To that end, it is my distinct honor and great privilege to invite you to address a Joint Session of Congress on Tuesday, March 4, 2025, in the Chamber of the U.S. House of Representatives, to share your America First vision for our legislative future.”","summary":"The address is typically a vehicle for an incoming commander in chief to outline a vision for the coming four years and lay out a legislative agenda.","url":"https://www.washingtonpost.com/politics/2025/01/25/trump-congress-joint-session/","image":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M5BP3OYEJXYGTPCAKRRPE2P2CM.JPG&w=1440","video":null,"publish_date":"2025-01-25 22:32:11","author":"Maegan Vazquez","authors":["Maegan Vazquez"],"language":"en","source_country":"us","sentiment":0.008},{"id":283915598,"title":"Legal Analysts Respond to Donald Trump Firing Inspectors General","text":"Several legal analysts have reacted to President Donald Trump's decision to fire several inspectors general Friday night, with some raising concerns over the legality of the move.Newsweek reached out to the White House for confirmation and several legal scholars for comment via email on Saturday.Why It Matters Inspectors general are independent officials within federal agencies who investigate claims of waste, fraud and abuse of power. They conducts audits, evaluations, and special reviews, among other responsibilities.The dismissals appear to be in violation of federal law, which requires Congress to receive reasons for the termination of a Senate-confirmed inspector general 30 days in advance. However, not all legal analysts agree it is a violation.The removal and potential appointment of new inspectors general reflect a shift in leadership and raise concerns about the independence of key oversight positions under the Trump administration.What To KnowA source familiar with the situation confirmed to Newsweek that some inspectors general have been fired. The exact number remains unclear, with most estimates exceeding a dozen. NBC News reported at least 12, The Washington Post cited 14, and Reuters reported 17.Prior to the termination, the Council of the Inspectors General on Integrity and Efficiency (CIGIE) reported there were 74 federal inspector generals. The council's website states: \"The President nominates IGs at Cabinet-level departments and major agencies with Senate confirmation. These IGs can only be removed by the President. The agency heads appoint and can remove IGs at designated Federal entities. Both houses of Congress must be notified if an IG is removed by the President or an agency head.\"Newsweek has also reached out to the CIGIE for comment via email on Saturday afternoon.The Post reported that inspectors general were notified of their immediate termination via email by the White House personnel director.In a letter dated January 24 to Sergio Gor, head of the presidential personnel office, chairman of the CIGIE, Hannibal 'Mike' Ware, wrote: \"At this point, we do not believe the actions taken are legally sufficient to dismiss Presidentially Appointed, Senate Confirmed Inspectors General.\"The letter cites the 2022 amendments to the Inspector General Act of 1978, which states that the president must notify Congress 30 days prior to removing inspectors general.\"It's a widespread massacre,\" one of the fired inspectors general told the Post. \"Whoever Trump puts in now will be viewed as loyalists, and that undermines the entire system.\"What People Are Saying John Choon Yoo, a law professor at University of California at Berkeley, told Newsweek in an email on Saturday: \"President Trump is well within his power to remove members of the executive branch at will. In Seila Law v. CFPB (2020), the Supreme Court held that Congress could not protect officers of the United States from removal by the President...In Seila Law, the Court said that the only officers that Congress might be able to protect are those that are members of multi-body commissions, like the FCC or the SEC.\"He added: \"The Inspectors General do not have that status; they are simple members of the executive branch agencies. Even if Congress attempts to place conditions on their removal, those conditions are unconstitutional. Any Inspector General that attempts to challenge their removal in court—they would still have to leave office and just sue for back pay—will be wasting their money in lawyers fees.\"Tristan Snell, a lawyer who helped lead the prosecution of Trump regarding Trump University, wrote on X, formerly Twitter, Saturday morning: \"Trump fires 17 inspectors general - all the internal govt enforcement officials for every major government agency and department This was ILLEGAL - firing an IG requires 30 day notice to Congress. CONGRESS MUST ACT TO REINSTATE THEM, NOW.\"Barbara McQuade, MSNBC legal analyst and former U.S. attorney for the Eastern District of Michigan under the Barack Obama administration, wrote in a Saturday morning X post: \"Trump has fired 12 inspectors general without providing the 30-day notice to Congress required by law. He really is pushing the legal limits of his power and daring Congress to stop him.\"Democratic Senator Elizabeth Warren, a former Harvard Law professor, wrote in an X post: \"It's a purge of independent watchdogs in the middle of the night. Inspectors general are charged with rooting out government waste, fraud, abuse, and preventing misconduct. President Trump is dismantling checks on his power and paving the way for widespread corruption.\"Sidney Powell, Trump's former lawyer, wrote early Saturday on X: \"Existing IGs are virtually worthless. They may bring a few minor things to light but accomplish next to nothing. The whole system needs to be revamped. They are toothless and protect the institution instead of the citizens.\"What Happens Next It is unclear which inspectors general were terminated and if their roles will be filed. Neither the White House nor Trump have released an official statement.","summary":"\"President Trump is well within his power to remove members of the executive branch at will,\" law professor John Choon Yoo told Newsweek.","url":"https://www.newsweek.com/legal-analysts-respond-donald-trump-firing-inspectors-general-2020897","image":"https://d.newsweek.com/en/full/2573580/donald-trump.jpg","video":null,"publish_date":"2025-01-25 22:29:20","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","category":"politics","source_country":"US","sentiment":-0.29},{"id":283911292,"title":"Musk Makes Unexpected Appearance At AfD Event In Germany","text":"Elon Musk made a surprise appearance during Germany’s Alternative für Deutschland (AfD) election campaign event in Halle, eastern Germany, on Saturday, speaking publicly in support of the far-right party for the second time in as many weeks.\nAddressing a hall of 4,500 people alongside the party’s co-leader, Alice Weidel, Musk spoke live via video link about preserving German culture and protecting the German people. “It’s good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything,” Musk said. Last week, the US billionaire caused uproar after he made a gesture that drew online comparisons to a Nazi salute during President Donald Trump’s inauguration festivities.\nOn Saturday, Musk emphasized, “children should not be guilty of the sins of their parents, let alone their great grandparents,” apparently referring to Germany’s Nazi past. “There is too much focus on past guilt, and we need to move beyond that,” he added.\nMusk, who spoke of suppression of speech under Germany’s government, has previously attacked German Chancellor Olaf Scholz on social media. For his part, Scholz stated on Tuesday that he does not support freedom of speech when it is used for extreme-right views.\nMusk expressed his support for the far-right party, saying, “I’m very excited for the AfD, I think you’re really the best hope for Germany’s fight for a great future for Germany.” Weidel thanked him, stating that the Republicans were making America great again, and called on her supporters to make Germany great again.\nEarlier this month, Musk hosted Weidel in an interview, stirring concern about election meddling. Despite the winter weather, anti-far-right campaigners were out in force on Saturday, with about 100,000 gathering around Berlin’s Brandenburg Gate and up to 20,000 in Cologne, including people of all ages carrying colorful umbrellas.\nMusk’s appearance at the AfD event has sparked significant controversy and debate. Supporters of the AfD praised Musk for his endorsement, while critics expressed concern over his alignment with the far-right party. The event has further polarized public opinion, highlighting the deep divisions within German society.\nAs the AfD continues its election campaign, Musk’s involvement is likely to remain a contentious issue. The billionaire’s support for the far-right party raises questions about the influence of high-profile figures on political movements and the potential impact on democratic processes. The coming weeks will reveal how Musk’s endorsement affects the AfD’s campaign and the broader political landscape in Germany.\nALSO READ: UK Poll: Voters Advise Starmer To Strengthen Ties With Europe Over Trump","summary":"Elon Musk made a surprise appearance at an AfD event in Germany, sparking controversy with his support for the far-right party and comments on German culture.","url":"https://www.newsx.com/world/musk-makes-unexpected-appearance-at-afd-event-in-germany/","image":"https://www.newsx.com/wp-content/uploads/2025/01/MUSK.webp","video":null,"publish_date":"2025-01-25 22:29:01","author":"Swati Pandey","authors":["Swati Pandey"],"language":"en","source_country":"in","sentiment":0.145}]}