{"offset":0,"number":50,"available":3666,"news":[{"id":387328990,"title":"Mahama thanks US for airlifting Ghana Army engineers to Jamaica for reconstruction work","text":"President John Dramani Mahama has expressed gratitude to the United States for supporting Ghana in airlifting army engineers to Jamaica to assist with post hurricane reconstruction efforts.\n\nSpeaking ahead of the deployment, President Mahama thanked Donald Trump, as well as the government and people of the United States, for making the mission possible.\n\nHe explained that transporting the troops and their equipment to Jamaica had been one of the biggest challenges in carrying out the operation.\n\nAccording to the president, the United States stepped in to provide airlift support, making it possible for the engineers to travel from Accra to Kingston.\n\nHe noted that a C 17 aircraft was arranged to carry the troops along with their supplies for the mission.\n\nPresident Mahama said the Ghanaian engineers were being sent to support the people of Jamaica as they recover from the effects of the hurricane.\n\nHe described the mission as a symbol of friendship and cooperation between Ghana and Jamaica.\n\nHe wished the troops a successful operation and a safe return home, and prayed for God’s protection over the Ghana Armed Forces.\n\nThe president expressed hope that the mission would further strengthen the bond between Ghana and Jamaica.\n\nPresident Mahama ended by thanking the United States once again for its support and reaffirmed Ghana’s commitment to international cooperation and humanitarian assistance.\n\nBy: Jacob Aggrey","summary":"President John Dramani Mahama has expressed gratitude to the United States for supporting Ghana in airlifting army engineers to Jamaica to assist with post hurricane reconstruction efforts. Speaking ahead of the deployment, President Mahama thanked Donald Trump, as well as the government and people of the United States, for making the mission possible. He explained &#8230;\n\n\nThe post Mahama thanks US for airlifting Ghana Army engineers to Jamaica for reconstruction work appeared first on Ghanaian Times.","url":"https://ghanaiantimes.com.gh/mahama-thanks-us-for-airlifting-ghana-army-engineers-to-jamaica-for-reconstruction-work/","image":"https://ghanaiantimes.com.gh/wp-content/uploads/2025/12/WhatsApp-Image-2025-12-17-at-15.38.15.jpeg","video":null,"publish_date":"2025-12-17 16:09:56","author":"Admin1","authors":["Admin1"],"language":"en","source_country":"gh","sentiment":-0.18},{"id":387329162,"title":"Thailand: Cambodia must announce ceasefire 'first' to stop fighting","text":"BANGKOK — Thailand said on Tuesday that Cambodia must be first to announce a truce to halt fighting between them after more than a week of deadly clashes in a reignited border conflict.“As the aggressor onto Thai territory, Cambodia must announce the ceasefire first,” Thai foreign ministry spokesman Maratee Nalita Andamo told reporters in the capital Bangkok, adding that Cambodia must also cooperate in de-mining efforts at the border “sincerely.”Renewed fighting between the Southeast Asian neighbors this month has killed at least 34 people, including soldiers and civilians, and displaced around 800,000 others, officials said.In Cambodia, 17 civilians in all have been killed, the country’s interior ministry said.Each side has blamed the other for instigating the clashes, claiming self-defense and trading accusations of attacks on civilians.Cambodia did not immediately respond to Thailand’s statement.United States President Donald Trump, who intervened in the border conflict earlier this year, last week claimed that the two countries had agreed to a ceasefire beginning Saturday night.Cambodian Prime Minister Hun Manet said his country supported the ceasefire initiative of Malaysia, current chairman of the Association of Southeast Asian Nations, with Washington’s participation.But fighting has continued daily since Dec. 7, spreading to seven provinces on each side of the border, and Bangkok denied Trump’s claim of an agreed truce.Cambodia, which is outgunned and outspent by Bangkok’s military, said on Monday that Thai forces had expanded their attack “deep into” Cambodian territory.Phnom Penh accused Thai forces of bombing Siem Reap province, home to the centuries-old Angkor temples — the country’s top tourist draw — for the first time in the latest round of clashes.The fighting, with artillery, tanks and Thai jets, has killed 16 Thai soldiers, one Thai civilian and 15 Cambodian civilians, officials said.Emergency talksPhnom Penh had not reported any military death in the latest fighting.The conflict stems from a territorial dispute over the colonial-era demarcation of their 800-kilometer (500-mile) border and a smattering of ancient temple ruins situated on the frontier.Five days of fighting in July killed dozens of people before a truce was brokered by the US, China and Malaysia, and then broken within months.In October, Trump backed a follow-on joint declaration between Thailand and Cambodia, touting new trade deals after they agreed in Malaysia’s capital Kuala Lumpur to prolong their truce.But Thailand suspended the agreement the following month, after Thai soldiers were wounded by landmines while on patrol at the border.Bangkok has accused Cambodia of laying fresh mines, and allegation denied by Phnom Penh.Southeast Asian foreign ministers are due to meet in Malaysia on Dec. 22 for emergency talks aimed at finding a diplomatic solution.Thailand said on Tuesday that between 5,000 and 6,000 Thais remain stranded in the Cambodian border town of Poipet after Phnom Penh closed its land border crossings with its neighbor on Saturday.Cambodia’s interior ministry said the border closures were a “necessary measure” to reduce risks to civilians amid the ongoing combat, adding that air travel remained an option for departures.","url":"https://www.manilatimes.net/2025/12/18/world/asia-oceania/thailand-cambodia-must-announce-ceasefire-first-to-stop-fighting/2245443","image":"https://www.manilatimes.net/manilatimes/uploads/images/2025/12/17/871042.jpg","video":null,"publish_date":"2025-12-17 16:07:00","author":"Agence France-Presse","authors":["Agence France-Presse"],"language":"en","source_country":"ph","sentiment":0.172},{"id":387326728,"title":"Susie Wiles, White House Chief of Staff, Criticizes Bondi and Opines on Trump in Vanity Fair","text":"WASHINGTON (AP) — Susie Wiles, President Donald Trump’s understated but influential chief of staff, criticized Attorney General Pam Bondi’s handling of the Jeffrey Epstein case and offered an unvarnished take on her boss and those in his orbit in interviews published Tuesday in Vanity Fair that sent the West Wing into damage control.\n\nThe startlingly candid remarks from Wiles, the first woman to ever hold her current post, included describing the president as someone with “an alcoholic’s personality,” and Vice President JD Vance as a calculating “conspiracy theorist.” The observations from Wiles, who rarely speaks publicly given the behind-the-scenes nature of her job running the White House, prompted questions about whether the chief of staff might be on her way out.\n\nWiles pushed back after the piece’s publication, describing it as a “hit piece” that lacked context, and White House press secretary Karoline Leavitt said the “entire Administration is grateful for her steady leadership and united fully behind her.”\n\nAs for Trump, he told the New York Post that he hadn’t read the piece. When asked if he retained confidence in Wiles, he said, “Oh, she’s fantastic.”\n\nTrump also agreed that he does have the personality of an alcoholic, describing himself as having “a very possessive personality.”\n\nA senior White House official, who spoke on condition of anonymity to describe internal thinking, dismissed the notion that Wiles might leave because of the profile, saying if they were rattled by negative news coverage “none of us would work here.”\n\nWiles’ candor was so unusual that Rahm Emanuel, who served as chief of staff to former President Barack Obama, said that when he first read her comments, he thought it was a spoof. He said he could not recall a chief of staff giving such a candid interview, at least “not while you hold the title.”\n\nEmanuel said the role often involves public remarks that promote the president’s agenda, but not sharing personal views about “everything, everybody” in the White House.\n\nHis advice to Wiles: “Next time there’s a meal, bring a food taster.”\n\nCandor from the ‘ice maiden’ who stays behind the scenes\nThe interviews with Vanity Fair were themselves uncharacteristic for Wiles, who cut her reputation as someone who brought order to the president’s chaotic style and shunned the spotlight so much that at Trump’s 2024 election night victory party, she repeatedly shook her head and avoided the microphone as Trump tried to coax her to speak to the crowd.\n\n“Susie likes to stay sort of in the back,” said Trump, who has repeatedly referred to her as the “ice maiden.”\n\nMost members of his Cabinet, along with former and current White House officials, posted statements praising Wiles and criticizing the media as dishonest.\n\nBut neither Wiles nor the members of the administration who came to her defense Tuesday disputed any details in the two-part profile, including areas where she conceded mistakes and seemed to contradict the administration’s official reasoning for its bombing of alleged drug boats in the waters off the coast of Venezuela.\n\nThough the Trump administration has said the campaign is about stopping drugs headed to the U.S., Wiles appeared to confirm that the campaign is part of a push to oust Venezuela’s authoritarian leader, Nicolás Maduro, saying Trump “wants to keep on blowing boats up until Maduro cries uncle.”\n\nWiles pushed back but without any denials\nAfter the comments were published, Wiles disparaged it as a “disingenuously framed hit piece on me and the finest President, White House staff, and Cabinet in history.”\n\n“Significant context was disregarded and much of what I, and others, said about the team and the President was left out of the story,” she wrote in a social media post. “I assume, after reading it, that this was done to paint an overwhelmingly chaotic and negative narrative about the President and our team.”\n\nTrump, in an interview with the New York Post, said he was not offended by Wiles’ remarks, including her description of him as someone with “an alcoholic’s personality” that she recognizes from her father, the famous sports broadcaster Pat Summerall.\n\nThe president, who is a teetotaler and had a brother who struggled with alcohol, said: “I’ve said that many times about myself. I’m fortunate I’m not a drinker. If I did, I could very well, because I’ve said that — what’s the word? Not possessive — possessive and addictive type personality. Oh, I’ve said it many times, many times before.”\n\nVance, speaking in Pennsylvania on Tuesday about the president’s economic agenda, said he hadn’t read the Vanity Fair piece. But he defended Wiles and joked, “I only believe in the conspiracy theories that are true.”\n\n“Susie Wiles, we have our disagreements. We agree on much more than we disagree, but I’ve never seen her be disloyal to the president of the United States, and that makes her the best White House chief of staff that I think the president could ask for,” Vance said.\n\nHe said his takeaway was that the administration “should be giving fewer interviews to mainstream media outlets.”\n\nThe chief of staff criticizes the attorney general\nWiles, over the series of interviews, described the president behind the scenes very much as he presents himself in public: an intense figure who thinks in broad strokes yet is often not concerned with the details of process and policy. She added, though, that he has not been as angry or temperamental as is often suggested, even as she affirmed his ruthlessness and determination to achieve retribution against those he considers his political enemies.\n\nWiles described much of her job as channeling Trump’s energy, whims and desired policy outcomes — including managing his desire for vengeance against his political opponents, anyone he blames for his 2020 electoral defeat and those who pursued criminal cases against him after his first term.\n\nOn Epstein, Wiles told the magazine that she underestimated the scandal involving the disgraced financier, but she sharply criticized how Bondi managed the case and the public’s expectations.\n\nWiles criticized Bondi’s handling of the matter, going back to earlier in the year when she distributed binders to a group of social media influencers that included no new information about Epstein. That led to even more calls from Trump’s base for the files to be released.\n\n“I think she completely whiffed on appreciating that that was the very targeted group that cared about this,” Wiles said of Bondi. “First she gave them binders full of nothingness. And then she said that the witness list, or the client list, was on her desk. There is no client list, and it sure as hell wasn’t on her desk.”\n\nBondi did not address the criticism when she released a statement supporting Wiles.\n\nWiles also said at one point that Trump’s tariffs had been more painful than expected. She conceded some mistakes in Trump’s mass deportation program and suggested that the president’s retribution campaign against his perceived political enemies has gone beyond what she initially wanted.\n\nBy MICHELLE L. PRICE, DARLENE SUPERVILLE and BILL BARROW Associated Press\nBarrow reported from Atlanta.","summary":"WASHINGTON (AP) — Susie Wiles, President Donald Trump’s understated but influential chief of staff, criticized Attorney General Pam Bondi’s handling&#8230; Continue reading Susie Wiles, White House Chief of Staff, Criticizes Bondi and Opines on Trump in Vanity Fair\n\n\nThe post Susie Wiles, White House Chief of Staff, Criticizes Bondi and Opines on Trump in Vanity Fair appeared first on The National Herald.","url":"https://www.thenationalherald.com/susie-wiles-white-house-chief-of-staff-criticizes-bondi-and-opines-on-trump-in-vanity-fair/","image":"https://www.thenationalherald.com/wp-content/uploads/2025/12/AP25350529584783-scaled.jpg","video":null,"publish_date":"2025-12-17 14:37:50","author":"Achilleas Kouremenos","authors":["Achilleas Kouremenos"],"language":"en","category":"politics","source_country":"us","sentiment":0.222},{"id":387329362,"title":"Syria will join the US-led international coalition to combat the Islamic State group ISIS","text":"On Monday 10 November, Syrian President Ahmed al-Sharaa travelled to Washington DC for talks with US President Donald Trump, resulting in the much-needed lifting of sanctions against the recovering country.\n\nFollowing the historic meeting – the first time a Syrian president has visited the White House – the US agreed to a 180-day suspension of the Caesar Act, which limited and added risk to foreign investment in Syria, which is essential to the rebuilding of post-war Syria.\n\nAnnouncing the lifting of these sanctions, US Secretary of State Marco Rubio outlined the terms of the agreement with restrictions remaining in place on ‘certain transactions involving the governments of Russia and Iran, or the transfer of provisions of Russian-origin or Iranian-origin goods, technology, software, funds, financing or services’.\n\nDuring the meeting between the two presidents it was also agreed that Syria will join the US-led international coalition to combat the Islamic State group ISIS. A remarkable development given that Shaara was previously part of the terrorist group Al Qaeda and had a $10 million bounty on his head.\n\nSpeaking afterwards, Trump alluded to Shaara’s ‘rough’ past but threw his support behind the Syrian leader, saying he believes Shaara has what it takes to turn Syria’s fortunes around.\n\nThis US support will be crucial in the rebuilding of Syria, especially given the past strained diplomatic relations between the two countries. Shaara has been keen to stress that Syria is now a geopolitical ally of the US and no longer seen as a threat.\n\nOther outcomes of the discussions include the US agreeing Syria can reopen its Embassy in Washington, as well as Shaara committing to integrating Kurdish Syrian Defence Forces into the Syrian army. However, the Syrian government has refused to commit to normalisation with Israel, despite pressure from the US.\n\nAdvertisement\n\nWhile the lifting of the Caesar Act sanctions is positive, the fact that there is a time limit could cause potential problems for Syria as it tries to encourage foreign investment.\n\nConstant review will be needed, plus a repeal with conditions could deter companies from investing in Syria through fear of being sanctioned themselves.\n\nShaara has visited several wealthy Gulf countries to encourage investment to help Syria recover from 14 years of war. He had a meeting with Russia’s President Putin to discuss developing Syria’s oil fields and other projects in the energy, transport and tourism sectors, as well as inviting investment into renewable energy sources while at the UN climate summit in Brazil.\n\nAccording to Central Bank of Syria Governor Abdulkader Husrieh, more than 22 American companies, including Visa, Mastercard, and Halliburton, are interested in entering the Syrian market and taking part in reconstruction, energy, and transport projects.\n\nHowever, Western businesses are rightly tentative about investing in Syria given the fragile political state of the country and safety concerns: more than 2,500 have been killed in sectarian violence since Shaara seized control with main targets being Alawites, the sect of the ousted Syrian President, Bashar al-Assad.\n\nPrior to the Washington meeting, Syria carried out pre-emptive strikes on Islamic state cells, with a statement issued saying the move was part of ‘ongoing national efforts to combat terrorism and confront plots targeting the country's security and citizens’.\n\nLast month, the World Bank estimated it will cost $216bn to rebuild Syria so securing foreign investment must remain at the forefront of government minds.\n\nBut for Western businesses, investing in Syria poses a delicate balance of opportunity and risk.\n\nShare this article","summary":"On Monday 10 November, Syrian President Ahmed al-Sharaa travelled to Washington DC for talks with US President Donald Trump, resulting in the much-needed lifting of sanctions against the recovering country. Following the historic meeting – the first time a Syrian president has visited the White House – the US agreed to a 180-day suspension of [&#8230;]","url":"https://www.eureporter.co/world/syria/2025/12/17/syria-will-join-the-us-led-international-coalition-to-combat-the-islamic-state-group-isis/","image":"https://www.eureporter.co/wp-content/uploads/2025/12/1536x864_cmsv2_e676cf48-9ecd-53ae-bd6e-841a340e1fcd-9543714-1000x600.webp","video":null,"publish_date":"2025-12-17 14:31:14","author":"EU Reporter Correspondent","authors":["EU Reporter Correspondent"],"language":"en","category":"politics","source_country":"co","sentiment":0.164},{"id":387320338,"title":"Warner Bros asks investors to reject takeover bid from Paramount Skydance","text":"NEW YORK (AP) — Warner Bros. is telling shareholders to reject a takeover bid from Paramount Skydance, saying that a rival bid from Netflix will be better for customers.\n\n“We strongly believe that Netflix and Warner Bros. joining forces will offer consumers more choice and value, allow the creative community to reach even more audiences with our combined distribution, and fuel our long-term growth,” Warner Bros. said Wednesday. “We made this deal because their deep portfolio of iconic franchises, expansive library, and strong studio capabilities will complement—not duplicate—our existing business.”\n\nParamount went hostile with its bid last week, asking shareholders to reject the deal with Netflix favored by the board of Warner Bros.\n\nParamount is offering $30 per Warner share to Netflix’s $27.75.\n\nParamount’s bid isn’t off the table altogether. While Wednesday’s letter to shareholders means Paramount’s is not the offer favored by the board at Warner Bros., shareholders can still decide to tender their shares in favor of Paramount’s offer for the entire company — including cable stalwarts CNN and Discovery.\n\nUnlike Paramount’s bid, the offer from Netflix does not include buying the cable operations of Warner Bros. An acquisition by Netflix, if approved by regulators and shareholders, will close only after Warner completes its previously announced separation of its cable operations.\n\nParamount has claimed it made six different bids that Warner leadership rejected before announcing its deal with Netflix on Dec. 5. Only after that did it take its offer directly to Warner’s shareholders.\n\nBeyond a greenlight from shareholders, both takeover bids face tremendous regulatory scrutiny. A change in ownership at Warner would drastically reshape the entertainment and media industry — impacting movie making, consumer streaming platforms and, in Paramount’s case, the news landscape.\n\nCritics of Netflix’s deal say that combining the massive streaming company with Warner’s HBO Max would give it overwhelming market dominance, whereas the Paramount+ streaming service is far smaller.\n\nBids from both Netflix and Paramount have raised alarm for what they could mean for film and TV production. While Netflix has agreed to uphold Paramount’s contractual obligations for theatrical releases, critics have pointed to its past business model and reliance on online releases. Yet Paramount and Warner Bros. are two of the “big five” legacy studios left in Hollywood today.\n\nParamount’s attempt to buy Warner’s cable networks and news business would also bring CBS and CNN under the same roof. In addition to further accelerating media consolidation, that could raise questions about shifts in editorial control — as seen at CBS News both leading up to and following Skydance’s $8 billion purchase of Paramount, which it completed in August.\n\nU.S. President Donald Trump has already been vocal about his future involvement in the deal, indicating that politics will play a role in regulatory approval.\n\nTrump previously said that Netflix’s deal “could be a problem” because of the potential for an outsized control of the market. The Republican president also has a close relationship with Oracle’s billionaire founder Larry Ellison — the father of Paramount’s CEO, whose family trust is also heavily backing the company’s bid to buy Warner.\n\nAffinity Partners, an investment firm run by Trump’s son-in-law Jared Kushner, previously said it would investing in the Paramount deal, too. But on Tuesday, the firm announced that it would be dropping out of the bid.\n\nStill, Trump also has a tendency to make decisions based on gut and his personal mood. He has continued to publicly lash out at Paramount over editorial decisions at CBS’ “60 Minutes.”\n\n“For those people that think I am close with the new owners of CBS, please understand that 60 Minutes has treated me far worse since the so-called “takeover,” than they have ever treated me before,” Trump wrote on his platform Truth Social on Tuesday. “If they are friends, I’d hate to see my enemies!”","summary":"Paramount is offering $30 per Warner share to Netflix’s $27.75.","url":"https://www.mercurynews.com/2025/12/17/warner-bros-paramount-hostile/","image":"https://www.mercurynews.com/wp-content/uploads/2025/12/Warner_Bros_CNN_11577_09495d-1.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-17 12:32:50","author":"Associated Press","authors":["Associated Press"],"language":"en","source_country":"us","sentiment":0.157},{"id":387328434,"title":"Warner Bros Discovery board rejects rival bid from Paramount","text":"LOS ANGELES, Dec 17 (Reuters) - Warner Bros Discovery's board spurned Paramount Skydance's $108.4 billion hostile takeover bid on Wednesday, calling the offer \"illusory\" as it accused the studio giant of misleading shareholders about its financing. Paramount has been in a race with Netflix to win control of Warner Bros, and with it, its prized film and television studios, HBO Max streaming service and franchises like \"Harry Potter.\" After Warner Bros accepted the streaming giant's offer, Paramount launched a hostile offer to outdo that bid. In a letter to shareholders on Wednesday, the Warner Bros board wrote that Paramount had \"consistently misled\" Warner Bros shareholders that its $30-per-share cash offer was fully guaranteed, or \"backstopped,\" by the Ellison family, led by billionaire and Oracle co-founder Larry Ellison. \"It does not, and never has,\" the board wrote of the guarantee of Paramount's offer, noting that the offer posed \"numerous, significant risks.\" The board said it found Paramount's offer \"inferior\" to the merger agreement with Netflix. Netflix's $27.75 per share offer for Warner Bros' unit is a binding agreement that requires no equity financing and has robust debt commitments, the board wrote. The board also said the offer could be terminated or amended at any time prior to the deal's completion, which is not the same as a binding merger agreement. Warner Bros has not yet set a date for a shareholder vote on the deal but it is expected to happen sometime in spring or early summer, its Chairman Samuel Di Piazza said in an interview with CNBC. The Ellisons have cited their relationship with U.S. President Donald Trump as a reason why the deal would face an easier regulatory path. NETFLIX WELCOMES MOVE Paramount did not immediately respond to a Reuters request for comment, while Netflix welcomed the move. \"The Warner Bros Discovery Board reinforced that Netflix's merger agreement is superior and that our acquisition is in the best interest of stockholders,\" its co-CEO Ted Sarandos, said in a statement. Netflix is already talking with the U.S. Department of Justice and the European Commission, its other co-CEO Greg Peters told CNBC, while expressing confidence in how regulators would view the deal. Warner Bros shares were down 1.2% at $28.5 in early trading, while Netflix gained 2.5% and Paramount fell 4.8%. Netflix has told Warner Bros it would keep releasing the studio's films in cinemas in a bid to ease fears that its deal would eliminate another studio and major source of theatrical films, according to people familiar with the matter. Paramount last week took its case directly to Warner Bros shareholders, arguing it has arranged \"air-tight financing\" to support its bid, with $41 billion in new equity assured by the Ellison family and RedBird Capital, and $54 billion of debt commitments from Bank of America, Citi and Apollo. Warner Bros board countered that Paramount's latest offer includes an equity commitment \"for which there is no Ellison family commitment of any kind,\" but rather the backing of \"an unknown and opaque\" Lawrence J. Ellison Revocable Trust, whose assets and liabilities are not publicly disclosed and are subject to change. \"Despite having been told repeatedly by WBD how important a full and unconditional financing commitment from the Ellison family was...the Ellison family has chosen not to backstop the PSKY offer,\" the Warner Bros board wrote. \"A revocable trust is no replacement for a secured commitment by a controlling shareholder.\" WARNER BROS QUESTIONS PARAMOUNT'S CREDITWORTHINESS Paramount has submitted a total of six bids to acquire the entire Warner Bros studio, including its television networks, including CNN and TNT Sports. It has previously said the Ellison family trust - which Paramount says contains more than $250 billion in assets including about 1.16 billion shares of Oracle - is more than adequate to cover the equity commitment. Warner Bros has raised questions about Paramount's financial condition and creditworthiness. The offer relies on a seven-party, cross-conditional structure, with the Ellison Revocable Trust providing just 32% of the required equity commitment while capping its liability at $2.8 billion, Warner Bros said. It noted that the trust's assets could be withdrawn at any time. \"The PSKY offer provides an untenable degree of risk and potential downside for WBD shareholders,\" the board wrote. CONCERNS ABOUT PARAMOUNT'S DEBT LEVELS The Warner Bros board noted that Netflix has an investment-grade rating and a market value exceeding $400 billion. Paramount, in contrast, has a $15 billion market capitalization and a credit rating \"a notch above 'junk,' Warner Bros said on Wednesday. A combination would leave Paramount with a debt ratio of 6.8 times its operating income \"with virtually no current free cash flow.\" The bidder would also impose what Warner Bros said would be \"onerous operating restrictions\" on the company, during the potentially lengthy period between signing and closing, including limits on new content licensing deals. Paramount's plan to achieve $9 billion in \"synergies\" across the two studios was described as \"ambitious\" from an operational standpoint, the Warner Bros board noted, and would represent a new round of job losses that \"would make Hollywood weaker, not stronger.\" Warner Bros Discovery's board dismissed Paramount's charges of unfairness - set forth in a filing by Paramount last week - saying it held dozens of calls and meetings with the studio's principals and advisors, including four in-person meetings and meals with CEO David Zaslav and Paramount CEO David Ellison, or his father, Larry Ellison. \"After each bid, we informed PSKY of the material deficiencies and offered potential solutions,\" the Warner Bros board wrote. \"Despite this feedback, PSKY has never submitted a proposal that is superior to the Netflix merger agreement.\" (Dawn Chmielewski reported from Los Angeles, Milana Vinn reported from New York, additional reporting by Aditya Soni; Editing by Sayantani Ghosh, Raju Gopalakrishnan and Arun Koyyur) By Dawn Chmielewski and Milana Vinn","url":"https://www.marketscreener.com/news/warner-bros-discovery-board-rejects-rival-bid-from-paramount-ce7d50dfda8ef621","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-12/2025-12-08T151648Z_1_LYNXMPELB70WY_RTROPTP_4_WARNER-BROS-DIS-M-A-NETFLIX-PARAMOUNT-SKYDAN.JPG","video":null,"publish_date":"2025-12-17 12:05:54","author":"Reuters","authors":["Reuters"],"language":"en","category":"entertainment","source_country":"fr","sentiment":0.104},{"id":387328490,"title":"Endeavour Mining Proves it is Worth its Weight in Gold","text":"It’s not exactly news that the yellow metal has been shooting for the stars. Of course, economic uncertainty plays a huge part in this. Global conflicts such as the Russia-Ukraine war, trade disputes and political instability have made investors flock to gold as a traditional inflation hedge.Psst: there's another major reason for the price hike: central banks worldwide are hoarding the shiny stuff like it's going out of fashion! This is especially true in emerging markets such as China, India and Poland. Well, you can’t blame them. These institutions are diversifying their foreign reserves away from the US dollar to mitigate risk and reduce reliance on a single currency. Get this: the World Gold Council says central banks have already snapped up a massive 634 tonnes of gold so far in 2025! We are of course looking at you, Donald Trump.It also helps (depending on whose side you’re on) that the US dollar has kind of lost its groove lately. Gold and the US dollar often sit on opposite ends of a seesaw due to their traditional inverse relationship. The US Dollar Index (DXY) has taken a serious hit, dropping by over 9% so far in 2025.Golden hourThis is great news for major players like Endeavour Mining, whose Q3 25 results showed a record gold price of 3,247/oz US Dollar. That’s 36% upwards from its 2,342/oz US Dollar figure in Q3 24.Endeavour Mining’s gold production reached 264 koz in Q3 25, taking the annual contribution to a solid 911 koz. That yearly figure is a nice jump from the 741 koz recorded around the same time last year. The big wins in 9M 2025 came from snapping up low-cost Lafigué mine and the Sabodala-Massawa BIOX expansion in Q3 24.Striking goldGold prices aiming for the sky have meant that the All-in Sustaining Cost (AISC) climbed upwards. For Q3 25 the AISC stood at $1,569 per ounce, including a $131/oz increase driven by higher royalty fees, with gold prices being elevated lately. Naturally, profits are way up by 375% compared to last year. Q3 brought in $159m, bringing the total to $556m YTD in 2025.This helped them generate a massive $166m in FCF for the quarter alone, keeping them well on track to meet the top half of their 2025 production guidance.Streets are paved with…Higher gold prices are putting a little extra \"jingle\" in Endeavour Mining shareholders' pockets. The company's stock has been on fire over the last year, soaring a massive 155%.In addition, the company also returned a total of $33m to shareholders this year, including $83m through share buybacks and $150m through dividends (implying an annualized dividend yield of around 2%). It also plans to announce the next phase of its returns program and the H2 25 dividend in January 2026.Better yet, twelve analysts covering the stock have set an average target price of CAD 76. The stock could potentially jump another 54% from its current levels.Stumbling blocksThe company sure will have to dodge some serious wrecking balls. Macroeconomic risks for Endeavour Mining are exposed to volatile gold and oil prices, and fluctuating interest and foreign exchange rates. Operationally, the company is at the mercy of weather gods. On the environmental side, there’s the constant worry about messing up local ecosystems and water sources, all while trying to keep up with new regulations. Talk about a high stakes balancing act!","url":"https://www.marketscreener.com/news/endeavour-mining-proves-it-is-worth-its-weight-in-gold-ce7d50dfda8bf62d","image":"https://cdn.zonebourse.com/static/resize/0/0/https://img.zonebourse.com/reuters/2021-04-30T142909Z_1_LYNXMPEH3T0XP_RTROPTP_3_MERCADOS-ARGENTINA-BOLSA.JPG","video":null,"publish_date":"2025-12-17 11:27:43","author":"Maya Patel","authors":["Maya Patel"],"language":"en","source_country":"fr","sentiment":0.1},{"id":387323050,"title":"Pakistani military chief in spotlight over Trump’s Gaza plan","text":"ISLAMABAD - Pakistan’s most powerful military chief in decades faces the toughest test of his newly amassed powers as Washington pushes Islamabad to contribute troops to the Gaza stabilization force, a move analysts say could spark domestic backlash.Field Marshal Asim Munir is expected to fly to Washington to meet U.S. President Donald Trump in the coming weeks for a third meeting in six months that will likely focus on the Gaza force, two sources said, one of them a key player in the general’s economic diplomacy.Trump’s 20-point Gaza plan calls for a force from Muslim nations to oversee a transition period for reconstruction and economic recovery in the war-torn Palestinian territory, decimated by over two years of Israeli military bombardment.","summary":"Field Marshal Asim Munir is expected to fly to Washington to meet U.S. President Donald Trump in the coming weeks for a third meeting in six months.","url":"https://www.japantimes.co.jp/news/2025/12/17/asia-pacific/pakistan-asim-munir-trump-gaza/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/17/512171.JPG?v=3.1","video":null,"publish_date":"2025-12-17 11:26:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.142},{"id":387320348,"title":"Opinion: When policing becomes political, public safety suffers","text":"Over the past few months, a troubling pattern has emerged across America’s major cities. As President Donald Trump’s administration dispatches federal agents and National Guard troops to jurisdictions — often over the objections of local residents and leaders — police departments are being forced to navigate an increasingly precarious position. If they embrace federal intervention, they risk being seen as acting against the will of the communities they serve. If they fail to align with Washington’s agenda, they invite political backlash for not showing unquestioning loyalty to the “thin blue line” that unites law enforcement.\n\nThis no-win situation is yet another symptom of the growing politicization of law enforcement and public safety. And as a retired police lieutenant who spent more than two decades on the force, I see this trend as an existential threat to the legitimacy our profession relies on to be effective.\n\nAnyone who has worked in this field knows that policing can only function through community trust and cooperation. Our ability to uphold safety depends on the public’s belief that police are there to protect them — not to serve as an occupying force or an arm of political power. Federal encroachment on local policing blurs that line, creating a tightrope act that’s proving difficult for departments to balance.\n\nIn the Chicago area, federal law enforcement’s heavy-handed tactics have put local police directly in the crossfire, both literally and figuratively. After federal agents repeatedly deployed tear gas in residential neighborhoods — exposing at least 40 Chicago police officers and countless bystanders — a federal judge issued a temporary restraining order blocking the use of certain types of force against protesters. In nearby Broadview, federal agents have also tear-gassed local police officers outside an Immigration and Customs Enforcement facility that has drawn regular protests. The village’s police chief has accused ICE agents of making false police reports, and his department has opened at least three criminal investigations into incidents involving ICE agents.\n\nLosing public trust\n\nIn Washington, D.C., local police are facing sharp criticism after failing to document a shooting by a federal agent during an October traffic stop. While the Metropolitan Police Department was not responsible for the shooting, its decision not to include the gunfire in a subsequent incident report has raised serious questions about transparency and accountability. One officer even testified that a superior instructed him not to document the incident in court records. Whether that decision stemmed from confusion, pressure or fear of political repercussions, the result is the same: a loss of public trust that hinders the department’s ability to do the job effectively.\n\nSimilar problems have emerged in Portland, where police leaders have testified that federal intervention has made their jobs harder, not easier. During a recent federal trial over the legality of sending National Guard troops to the city, a local police commander told the court that protests swelled in size and intensity following Trump’s deployment order. He also documented “startling” incidents of excessive force by federal officers, including the use of tear gas and pepper balls affecting both protesters and local police. His testimony reinforced concerns among local officials who have warned that federal involvement is creating unnecessary danger for officers and the public alike.\n\nThese episodes point to rising tensions between local and federal law enforcement, which are only complicating the broader public safety landscape. Each new confrontation creates additional risks for the community and forces local police to divert attention from their core work of preventing and solving crime. That strain appeared to surface again in Chicago in October, when Border Patrol agents clashed with protesters and local police were accused of not providing adequate backup to secure the scene — a claim the city’s police superintendent has denied.\n\nPartisan posturing\n\nSome departments have also sought to carve out some much-needed middle ground in the face of this emerging conflict. After millions of Americans took to the streets for October’s “No Kings” protests, several large agencies publicly thanked demonstrators for keeping the peace and reaffirmed their commitment to protecting First Amendment rights.\n\nRather than buy into an “us versus them” framing, police in cities such as Chicago, Seattle, San Diego and New York issued statements that remained community-focused and free of partisan posturing. These departments seemed to recognize that the protesters were people whose trust and support they need to be effective and whose freedoms they are sworn to uphold. At a time of rising polarization, this sort of engagement reminds the public that police ultimately serve the community, not any political entity. But the politicized nature of federal interference only makes that message harder to maintain.\n\nAt its core, policing depends on legitimacy — the belief that officers act fairly, lawfully and in service of the people. Once that belief falters, public trust falters with it. The more law enforcement is pulled into partisan battles, the harder it becomes for officers to foster cooperation. Instead of building partnerships, they’re left trying to police through division.\n\nIf leaders truly want to act in the interest of public safety, they should start by ensuring that police remain insulated from politics. That means respecting the boundaries between federal and local authority, holding law enforcement to high standards of transparency and accountability, and trusting communities to shape their own safety priorities. At the end of the day, policing works best when departments can focus on their core mission — keeping communities safe —without the added distraction of politics.\n\nRetired Lt. Diane Goldstein is a 21-year police veteran and executive director of the Law Enforcement Action Partnership, known as LEAP, a nonprofit group of police, judges and other law enforcement professionals. ©2025 Chicago Tribune. Distributed by Tribune Content Agency.","summary":"'The more law enforcement is pulled into partisan battles, the harder it becomes for officers to foster cooperation.'","url":"https://www.mercurynews.com/2025/12/17/opinion-when-policing-becomes-political-public-safety-suffers/","image":"https://www.mercurynews.com/wp-content/uploads/2025/12/SJM-Z-COL-GOLDSTEIN-1217-JPEG-POLICING.jpg?w=1600&resize=1600,900","video":null,"publish_date":"2025-12-17 11:15:16","author":"Diane Goldstein","authors":["Diane Goldstein"],"language":"en","category":"politics","source_country":"us","sentiment":-0.38},{"id":387323052,"title":"Children of U.S. deportees make lonely journeys to unfamiliar homes","text":"MIAMI - Six-year-old Andy was anxious when he arrived at Miami’s international airport.This was no year-end vacation to visit his relatives in Guatemala.Andy was moving to his ancestral country to reunite with his father, recently deported as part of U.S. President Donald Trump’s aggressive policy to expel undocumented migrants.","summary":"Escorted to Guatemala by a nonprofit, one group of children face new lives in mostly impoverished rural areas where some will be unable to continue their education.","url":"https://www.japantimes.co.jp/news/2025/12/17/world/society/us-deported-migrants-children/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/17/512099.jpg?v=3.1","video":null,"publish_date":"2025-12-17 08:35:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","source_country":"jp","sentiment":-1},{"id":387318840,"title":"Japan's exports rise 6pc in November as shipments to US bounce back","text":"Bangkok, Dec 17 (AP) Japan’s exports climbed 6 per cent in November from a year earlier, with shipments to the United States rising for the first time since March as uncertainties over tariffs abated following a trade deal with the Trump administration.\n The preliminary data released Wednesday showed Japan’s total imports rose 1.3 per cent last month over a year earlier, leaving a surplus of 322.2 billion yen (about USD 2.1 billion).\n Exports to the US rose nearly 9 per cent from the year before as shipments of cars, chemicals and cameras helped make up for declines in machinery and iron and steel. Imports of US oil nearly tripled, along with sharp increases in imports of grain and other food products.\n Japan’s deal on tariffs with President Donald Trump’s administration, setting the baseline import duty for most products at 15 per cent instead of the earlier plan for a 25 per cent tariff, helped boost passenger car shipments by 8 per cent when measured by the number of vehicles. But the value of those cars, trucks and buses inched up only 1.5 per cent, reflecting the reluctance of automakers to pass costs from higher tariffs onto consumers.\n Imports from the US climbed more than 7 per cent, though Japan still logged a trade surplus of 739.8 billion yen (USD 4.7 billion), up 11 per cent from a year earlier.\n Japan’s exports to the European Union surged about 20 per cent last month from a year earlier, supported by growth in demand for machinery, vehicles and other manufactured goods.\n But tensions with Beijing after Prime Minister Sanae Takaichi commented on the defence of Taiwan took a toll, with exports to China falling 2.4 per cent on weaker shipments of chemicals, machinery and vehicles.\n Despite a nascent recovery in trade with the US, its largest trading partner, higher tariffs are likely to continue to weigh on exports, Norihiro Yamaguchi of Oxford Economics said in a report.\n Still, he forecast that Japan’s exports will likely improve in the coming year.\n “Spillovers from robust US AI-related spending will likely support exports as well,” Yamaguchi said. (AP) SKS SKS","summary":"","url":"https://www.news18.com/agency-feeds/japans-exports-rise-6pc-in-november-as-shipments-to-us-bounce-back-9775311.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_Business_Section_Default_Image_1600x900-2025-07-454f4d093355309283e1b9f3be42698a.jpg","video":null,"publish_date":"2025-12-17 07:00:07","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":0.244},{"id":387318732,"title":"Jared Kushner Withdraws From Paramount's Bid To Buy Warner Bros Discovery","text":"A private equity firm owned by Jared Kushner, President Donald Trump’s son-in-law, has stopped supporting Paramount’s attempt to buy Warner Bros. Discovery, the firm confirmed on Tuesday. After Warner agreed to be bought by Netflix in early December, Paramount made a competing offer, trying to go directly to Warner’s shareholders with more money.\nParamount is offering $30 per Warner share, compared to Netflix’s $27.75. Warner, one of the five major Hollywood studios, owns Warner Bros. Pictures, HBO, the DC Comics universe, and the Harry Potter franchise. Experts say whoever buys Warner could gain a big advantage in the streaming industry, either helping Netflix pull further ahead or making Paramount a new major player. Paramount, which is much smaller than Netflix, said it went around Warner’s top managers because they didn’t seriously consider previous offers.\nParamount made its new offer public and gave Warner shareholders the chance to sell their shares directly at a set price. The company wants to buy all of Warner’s assets, including cable networks like CNN, which Netflix left out of its offer. Paramount told shareholders its offer might be more likely to get approval from the Trump administration. The president has said the Warner and Netflix deal “could be a problem” because of the size of the combined companies. Kushner’s decision to pull his firm’s financial support removes a possible advantage for Paramount in winning Trump’s favour. The amount Kushner’s Affinity Partners was contributing was not revealed in Paramount’s latest SEC filings.\n“With two strong competitors trying to secure the future of this unique American asset, Affinity has decided not to pursue the opportunity anymore,” the firm said in a statement. “The investment situation has changed a lot since we first got involved in October. We still believe Paramount’s offer makes sense strategically.”\nParamount’s bid is still supported by wealth funds from Saudi Arabia, Abu Dhabi, and Qatar. Paramount, which owns CBS, MTV, and the streaming service Paramount+, is now led by David Ellison, whose father is a major Trump donor. But Trump recently criticized the Ellisons because of how CBS News’ “60 Minutes” treated him.\n“If they are friends, I’d hate to see my enemies!” Trump said Tuesday on Truth Social. Warner is reviewing Paramount’s offer and will soon tell shareholders if it’s better than selling to Netflix.","summary":"Paramount's bid is still supported by wealth funds from Saudi Arabia, Abu Dhabi, and Qatar.","url":"https://www.news18.com/business/jared-kushner-withdraws-from-paramounts-bid-to-buy-warner-bros-discovery-ws-kl-9775077.html","image":"https://images.news18.com/ibnlive/uploads/2025/10/warner-bros-discovery-2025-10-0aef780f33a55a744caaa9e7d3f128a4.jpg","video":null,"publish_date":"2025-12-17 05:42:51","author":"Mohammad Haris,News18","authors":["Mohammad Haris","News18"],"language":"en","category":"entertainment","source_country":"in","sentiment":-0.01},{"id":387323064,"title":"Trump orders blockade of sanctioned oil tankers leaving and entering Venezuela","text":"WASHINGTON - U.S. President Donald Trump ordered on Tuesday a 'blockade' of all sanctioned oil tankers entering and leaving Venezuela, in Washington's latest move to increase pressure on Nicolas Maduro's government, targeting its main source of income.It is unclear how Trump will impose the move against the sanctioned vessels, and whether he will turn to the Coast Guard to interdict vessels like he did last week. The administration has moved thousands of troops and nearly a dozen warships — including an aircraft carrier — to the region.'For the theft of our Assets, and many other reasons, including Terrorism, Drug Smuggling, and Human Trafficking, the Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION,' Trump wrote on Truth Social. 'Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.","summary":"It is unclear how his administration will impose the blockade against the sanctioned vessels.","url":"https://www.japantimes.co.jp/news/2025/12/17/world/politics/trump-blockade-tankers-venezuela/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/17/512013.JPG?v=3.1","video":null,"publish_date":"2025-12-17 05:26:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.024},{"id":387323088,"title":"Japan’s exports to U.S. rise for first time since Trump's April tariffs","text":"Japan’s exports to the U.S. have risen for the first time since U.S. President Donald Trump announced baseline tariffs in early April, the latest indication that economies are faring better than expected in a more protectionist global trade environment.The turnaround in shipments to the U.S. helped power the biggest gain in overall exports since February. That supports the Bank of Japan’s view that uncertainties over the impact of the duties have eased, helping pave the way for a widely expected interest-rate hike later this week.The gains in U.S. exports also helped outweigh a fall in the value of merchandise heading to China. While it’s still unclear how much the ongoing diplomatic dispute between Beijing and Tokyo might affect trade, data on shipments will be closely watched for any signs that friction is weighing on commerce between Asia’s two largest economies.","summary":"A turnaround in shipments to the U.S. helped power the biggest gain in overall exports since February, paving the way for a widely expected interest-rate hike later this week.","url":"https://www.japantimes.co.jp/business/2025/12/17/economy/export-increase-november/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/17/512004.jpg?v=3.1","video":null,"publish_date":"2025-12-17 05:04:00","author":"Erica Yokoyama,Web Master,Yoshiaki Nohara","authors":["Erica Yokoyama","Web Master","Yoshiaki Nohara"],"language":"en","source_country":"jp","sentiment":-0.159},{"id":387318850,"title":"MCX Silver Touches Record High, Global Prices Cross $65; What Investors Should Know","text":"Silver Price Today Hits Fresh Record High: Silver prices surged to new all-time highs on Wednesday, December 17, rallying more than 4 percent on the MCX and extending a sharp breakout that has drawn global attention. The surge followed weaker US labour data, which revived expectations of interest-rate cuts by the Federal Reserve, pressured the dollar, and lifted demand for precious metals.\nAround 9:20 am, MCX silver jumped 3.38 percent to Rs 2,04,445 per kg, touching a lifetime high. In contrast, MCX gold (February) slipped 0.21 percent to Rs 1,34,129 per 10 grams, highlighting a divergence between the two precious metals.\nGlobal silver tops $65 for the first time\nIn international markets, spot silver climbed 2.8 percent to a record $65.63 an ounce, marking the first-ever move above the $65 level. Spot gold, meanwhile, edged 0.4 percent higher to $4,321.56 an ounce by 0230 GMT, supported by a weaker US dollar.\nThe rally was underpinned by US data showing the unemployment rate rose to 4.6 percent in November, strengthening expectations of further monetary easing. A softer labour market, combined with the Federal Reserve’s dovish stance following its final quarter-point rate cut of the year, boosted demand for non-yielding assets such as silver.\nGeopolitical tensions add to safe-haven demand\nGeopolitical risks also played a role in the rally. US President Donald Trump ordered a blockade of all sanctioned oil tankers entering and leaving Venezuela, intensifying pressure on President Nicolas Maduro amid rising military activity in the region. This escalation lifted safe-haven buying and added momentum to silver prices.\nA currency trader based in Singapore said the unemployment data had clearly supported precious metals and weakened the dollar, prompting investors to seek alternative asset classes as a hedge against risk.\nThe dollar index hovered near a two-month low, making dollar-priced bullion more attractive to overseas buyers.\nIs it the right time to buy silver? Experts weigh in\nSilver’s sharp rally has left investors debating whether this is the right time to enter the market. Analysts remain divided, though many agree silver’s dual role as both a precious and industrial metal gives it a unique edge in the current macro environment.\nRajkumar Subramanian, Head – Product & Family Office at PL Wealth, said silver is increasingly emerging as a strategic diversifier for Indian investors. He noted that while silver carries higher volatility than gold, it also offers significantly greater upside during commodity upcycles, driven by rising industrial demand and growing retail participation. According to him, demand in India is being fuelled by solar manufacturing, electric vehicles, electronics and digital infrastructure.\nCaution advised despite strong fundamentals\nTaking a more cautious stance, Apurva Sheth, Head of Market Perspectives and Research at SAMCO Securities, said silver’s strong run may be nearing exhaustion. He pointed out that while silver has already delivered robust returns, rising yields and expectations of higher inflation could see gold outperform silver over the medium term. Investors building exposure to precious metals, he said, may be better served prioritising gold at this stage.\nLong-term outlook remains supportive\nDespite near-term caution, long-term structural factors continue to support silver. NS Ramaswamy, Head of Commodity & CRM at Ventura, said supply tightness and shifting demand dynamics could push prices much higher. He noted that silver could potentially rally to $100 an ounce—around Rs 3 lakh per kg—but warned that the metal is known for sharp rallies followed by steep corrections. He added that a catch-up in supply would signal “Peak Silver”.\nRamaswamy also highlighted silver’s growing role as a “next-generation metal”, driven by rising usage in electronics, renewable energy, artificial intelligence, data centres and electric vehicles, along with its inclusion in the US critical mineral list.","summary":"Silver prices surged to new all-time highs on Wednesday, December 17, rallying more than 4 percent on the MCX","url":"https://www.news18.com/business/savings-and-investments/mcx-silver-touches-record-high-global-prices-cross-65-what-investors-should-know-9774948.html","image":"https://images.news18.com/ibnlive/uploads/2025/12/Untitled-design-2025-12-15T172932.364-2025-12-4e1eca0ccd2afb5476cef5ee6025626e.jpg","video":null,"publish_date":"2025-12-17 04:52:21","author":"Aparna Deb,News18","authors":["Aparna Deb","News18"],"language":"en","source_country":"in","sentiment":0.155},{"id":387317922,"title":"Australia urged to take ‘Al Capone approach’ to hate preachers, extremists","text":"Washington: Leading international experts on Islamic extremism have urged Australia to more aggressively target and deport hate preachers or potential terror threats, including by pursuing their tax and immigration records in what they called the “Al Capone approach”.\n\nMeanwhile, Trump administration officials and Republican figures pinned the blame for Sunday’s massacre in Bondi on high levels of Muslim immigration, just as President Donald Trump widened his travel ban to include several other Muslim-majority nations.\n\nLorenzo Vidino, director of George Washington University’s extremism program, cautioned against faulting law enforcement agencies for “dropping the ball”, despite one of the alleged Bondi perpetrators being on the radar of authorities.\n\n“He was at the periphery of a lot of things. If there are things they could have charged this guy with, they would have,” he said. “But being a radical is not a crime, hanging out with radicals is not a crime, going to radical mosques is not a crime.”","url":"https://www.smh.com.au/world/north-america/australia-urged-to-take-al-capone-approach-to-hate-preachers-extremists-20251217-p5noeq.html","image":"https://static.ffx.io/images/$zoom_0.2589%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_9%2C$y_31/t_crop_custom/q_86%2Cf_auto/4666dc3208f5171f4e7dd882226f8ad551668021","video":null,"publish_date":"2025-12-17 04:51:08","author":"Michael Koziol","authors":["Michael Koziol"],"language":"en","category":"politics","source_country":"au","sentiment":-0.608},{"id":387323068,"title":"Trump to tell Americans ‘the best is yet to come’","text":"WASHINGTON - U.S. President Donald Trump will boast of his achievements in an address to the nation Wednesday as voters sour on his handling of the economy after nearly a year back in power.Republican Trump is also expected to tease policies for 2026, following a blitz of hard-line protectionist and nationalist policies at the start of his second term.With next year’s U.S. midterm elections looming, the 79-year-old faces mounting anger among Americans about the high cost of living.","summary":"U.S. President Donald Trump will boast of his achievements in an address to the nation Wednesday as voters sour on his handling of the economy after nearly a year back in power.","url":"https://www.japantimes.co.jp/news/2025/12/17/world/politics/trump-us-address/","image":"https://www.japantimes.co.jp/japantimes/uploads/images/2025/12/17/512084.jpg?v=3.1","video":null,"publish_date":"2025-12-17 04:34:00","author":"The Japan Times,Web Master","authors":["The Japan Times","Web Master"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.142},{"id":387318866,"title":"FIFA slashes price of some World Cup tickets to USD 60 after global fan backlash","text":"Geneva, Dec 17 (AP) FIFA slashed the price of some World Cup tickets for teams’ most loyal fans following a global backlash and some will get $60 seats for the final instead of being asked to pay $4,185.\nIt was a rare climbdown by the soccer body and its president Gianni Infantino after soaking up waves of criticism for World Cup strategies, including top-dollar prices and closer political alignment with U.S. President Donald Trump.\nFIFA said Tuesday that $60 tickets will be made available for every game at the tournament in North America, going to the national federations whose teams are playing. Those federations decide how to distribute them to loyal fans who have attended previous games at home and on the road.\nThe number of $60 tickets for each game is likely to be from 400 to 750 per team, in what FIFA is now calling a “Supporter Entry Tier” price category. FIFA is using 16 host cities, including 11 NFL stadiums in the United States, plus two in Canada and three in Mexico.\nFIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are “designed to further support traveling fans following their national teams across the tournament.” However, the Football Supporters Europe group, which represents grassroots fan groups, said the limited price cut was “an appeasement tactic due to the global negative backlash.” “This shows that FIFA’s ticketing policy is not set in stone, was decided in a rush, and without proper consultation,” the group said in a statement.\nThe World Cup in North America will be the first edition that features 48 teams — up from 32 — and is expected to earn FIFA at least $10 billion in revenue while being the most expensive ever for fans.\nDespite the outcry over prices, FIFA says it has already received more than 20 million ticket requests in its latest sales phase.\nThe FSE group said that even with Tuesday’s announcement, “the vast majority would still have to pay extortionate prices, way higher than at any tournament before.” Initial pledge for cheap ticketsFans worldwide reacted with shock and anger last week on seeing FIFA’s ticketing plans that gave participating teams no tickets in the lowest-priced category. Their standard allocation is 8% of stadium capacity per team.\nThe cheapest prices ranged from $140 to $265 for group-stage games that did not involve co-hosts the United States, Canada and Mexico. The $265 games involve Lionel Messi’s Argentina, Portugal with Cristiano Ronaldo and well-supported teams like Brazil and England.\nFIFA had set those prices despite the co-hosts having pledged eight years ago — when they were bidding for the tournament — that hundreds of thousands of $21 tickets would be made available for games before the knockout rounds.\nThe hospitality program in modern NFL venues, and now managed in-house instead of outsourced to an agency, is expected to earn FIFA billions of dollars rather than hundreds of millions.\nEuropean criticismCriticism from fans, especially in Europe, had been increasing for several months over plans for “dynamic pricing” plus extra fees on a FIFA-run resale platform — both features which are common in the U.S. entertainment industry but not to soccer fans worldwide.\nFan anger intensified last week when it became clear loyal supporters would have no access to the cheapest category tickets and that fans who wanted to reserve a ticket for all of their team’s potential games — through the final — would not get refunded until after the tournament.\nIn another climbdown Tuesday, FIFA said it would waive its administrative fees when refunds are made after the July 19 final.\nFans with disabilitiesEven before the FIFA statement, the supporter group FSE called Tuesday for a re-think on World Cup policy for fans with disabilities.\nIt said FIFA’s resale platform was offering disability access seats at multiple times face value with no assurances those tickets actually would be sold to people with a disability. Those fans also can no longer get free tickets for companions as they could at the last World Cup in Qatar.\nIn Qatar, Infantino started an eve-of-tournament speech with a tirade at perceived critics of the host nation, FIFA and himself that included the line “today I feel disabled.” “True inclusion requires action,” FSE said Tuesday, reminding Infantino of that speech. “It’s time for FIFA to move away from populistic statements and respect its own commitments.” (AP) TAP","summary":"","url":"https://www.news18.com/agency-feeds/fifa-slashes-price-of-some-world-cup-tickets-to-usd-60-after-global-fan-backlash-9774941.html","image":"https://images.news18.com/ibnlive/uploads/2025/07/News18_Sports_Section_Default_Image_1600x900-2025-07-4ca3f8a0fffd320c759cb5b8267edc70.jpg","video":null,"publish_date":"2025-12-17 04:15:10","author":"News18","authors":["News18"],"language":"en","source_country":"in","sentiment":0.008},{"id":387316988,"title":"Trump Ramps Up Pressure On Maduro, Orders Complete Blockade Of All ‘Sanctioned' Venezuela Oil Tankers","text":"Washington: President Donald Trump said Tuesday he is ordering a blockade of all “sanctioned oil tankers” into Venezuela, ramping up pressure on the country’s authoritarian leader Nicolás Maduro in a move that seemed designed to put a tighter chokehold on the South American country’s economy.Trump’s escalation comes after U.S. forces last week seized an oil tanker off Venezuela’s coast, an unusual move that followed a buildup of military forces in the region. In a post on social media Tuesday night announcing the blockade, Trump alleged Venezuela was using oil to fund drug trafficking and other crimes and vowed to continue the military buildup until the country gave the U.S. oil, land and assets, though it was not clear why he felt the U.S. had a claim.“Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,” Trump said in a post on his social media platform. “It will only get bigger, and the shock to them will be like nothing they have ever seen before — Until such time as they return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us.”Pentagon officials referred all questions about the post to the White House.Venezuela’s government released a statement Tuesday accusing Trump of “violating international law, free trade, and the principle of free navigation” with “a reckless and grave threat” against the South American country.“On his social media, he assumes that Venezuela’s oil, land, and mineral wealth are his property,” the statement said of Trump’s post. “Consequently, he demands that Venezuela immediately hand over all its riches. The President of the United States intends to impose, in an utterly irrational manner, a supposed naval blockade on Venezuela with the aim of stealing the wealth that belongs to our nation.”Maduro’s government, according to the statement, plans to denounce the situation before the United Nations.The U.S. buildup has been accompanied by a series of military strikes on boats in international waters in the Caribbean and eastern Pacific. The campaign, which has drawn bipartisan scrutiny among U.S. lawmakers, has killed at least 95 people in 25 known strikes on vessels.Trump has for weeks said that the U.S. will move its campaign beyond the water and start strikes on land.The Trump administration has defended the strikes as a success, saying they have prevented drugs from reaching American shores, and pushed back on concerns that they are stretching the bounds of lawful warfare.The Trump administration has said the campaign is about stopping drugs headed to the U.S., but Trump’s chief of staff Susie Wiles appeared to confirm in a Vanity Fair interview published Tuesday that the campaign is part of a push to oust Maduro.Wiles said Trump “wants to keep on blowing boats up until Maduro cries uncle.”Tuesday night’s announcement seemed to have a similar aim.Venezuela, which has the world’s largest proven oil reserves and produces about 1 million barrels a day, has long relied on oil revenue as a lifeblood of its economy.Since the Trump administration began imposing oil sanctions on Venezuela in 2017, Maduro’s government has relied on a shadowy fleet of unflagged tankers to smuggle crude into global supply chains.The state-owned oil company Petróleos de Venezuela S.A., commonly known as PDVSA, has been locked out of global oil markets by U.S. sanctions. It sells most of its exports at a steep discount in the black market in China.Francisco Monaldi, a Venezuelan oil expert at Rice University in Houston, said about 850,000 barrels of the 1 million daily production is exported. Of that, he said, 80% goes to China, 15% to 17% goes to the U.S. through Chevron Corp., and the remainder goes to Cuba.In October, Trump appeared to confirm reports that Maduro has offered a stake in Venezuela’s oil and other mineral wealth in recent months to try to stave off mounting pressure from the United States.“He’s offered everything,” Trump said at the time. “You know why? Because he doesn’t want to f—- around with the United States.”It wasn’t immediately clear how the U.S. planned to enact what Trump called a “TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela.”But the U.S. Navy has 11 ships, including an aircraft carrier and several amphibious assault ships, in the region.Those ships carry a wide complement of aircraft, including helicopters and V-22 Ospreys. Additionally, the Navy has been operating a handful of P-8 Poseidon maritime patrol aircraft in the region.All told, those assets provide the military a significant ability to monitor marine traffic coming in and out of the country.Trump in his post said that the “Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION,” but it wasn’t clear what he was referring to.The foreign terrorist organization designation has been historically reserved for non-state actors that do not have sovereign immunities conferred by either treaties or United Nations membership.In November, the Trump administration announced it was designating the Cartel de los Soles as a foreign terrorist organization. The term Cartel de los Soles originally referred to Venezuelan military officers involved in drug-running, but it is not a cartel per se.Governments that U.S. administrations seek to sanction for financing, otherwise fomenting or tolerating extremist violence are usually designated “state sponsors of terrorism.”Venezuela is not on that list.In rare cases, the U.S. has designated an element of a foreign government as an “FTO.” The Trump administration in its first term did so with the Iranian Revolutionary Guard Corps, an arm of the Iranian government, which had already been designated a state sponsor of terrorism.","summary":"In a post on social media announcing the blockade, Donald Trump claimed that Venezuela was using oil to fund drug trafficking and other crimes and vowed to continue the military buildup until the country gave the U.S. oil, land and assets, though it was not clear why he felt the U.S. had a claim.","url":"https://www.republicworld.com/world-news/trump-ramps-up-pressure-on-maduro-orders-complete-blockade-of-all-sanctioned-venezuela-oil-tankers","image":"https://img.republicworld.com/all_images/trump-ramps-up-pressure-on-maduro-orders-complete-blockade-of-all-sanctioned-venezuela-oil-tankers-1765941938535-16_9.webp","video":null,"publish_date":"2025-12-17 03:25:54","author":"Associated Press Television News","authors":["Associated Press Television News"],"language":"en","category":"politics","source_country":"in","sentiment":0.167},{"id":387316978,"title":"Bondi Beach Mass Shooting: Gunman To Be Charged Soon, Australia PM Says, As Funerals Of Victims Begin","text":"Sydney: One of two men suspected of carrying out Australia's deadliest mass shooting in three decades will be charged later on Wednesday, Prime Minister Anthony Albanese said, as the funerals of the Jewish victims of Sunday's attack began.The alleged father-and-son perpetrators opened fire on a Jewish Hanukkah celebration on Sydney's famed Bondi Beach on Sunday, in an attack that shook the nation and intensified fears of rising antisemitism and violent extremism.Sajid Akram, 50, was shot dead by police at the scene, while his 24-year-old son, named in local media as Naveed, emerged from a coma on Wednesday after also being shot by police.\"He will be charged formally, if he hasn't been so already, I would expect that will take place over the coming hours,\" Albanese said in a podcast interview on Wednesday morning.Investigators expect to question the son once medication wears off and legal counsel is present, New South Wales Police Commissioner Mal Lanyon said. He remains in a Sydney hospital under heavy police guard. The men accused of carrying out Sunday's attack had travelled to the southern Philippines, a region long plagued by Islamist militancy, weeks before the shooting that Australian police said appeared to be inspired by Islamic State.U.S. President Donald Trump told a Hanukkah event at the White House late on Tuesday he was thinking of the victims of the \"horrific and antisemitic terrorist attack\".\"We join in mourning all of those who were killed, and we're praying for the swift recovery of the wounded,\" he said.A funeral for Rabbi Eli Schlanger, an assistant rabbi at Chabad Bondi Synagogue and a father of five, was held on Wednesday. He was known for his work for Sydney’s Jewish community through Chabad, a global organization fostering Jewish identity and connection. Schlanger would travel to prisons and meet with Jewish people living in Sydney's public housing communities, Jewish leader Alex Ryvchin said on Monday.Albanese is facing criticism that his centre-left government did not do enough to prevent the spread of antisemitism in Australia during the two-year Israel-Gaza war.\"We will work with the Jewish community, we want to stamp out and eradicate antisemitism from our society,\" Albanese told reporters.The government and intelligence services are also under pressure to explain why Sajid Akram was allowed to legally acquire the high-powered rifles and shotguns used in the attack. The government has already promised sweeping reforms to gun laws.Akram's son, meanwhile, was briefly investigated by Australia's domestic intelligence agency in 2019 over alleged links to Islamic State, but there was no evidence at the time he posed a threat, Albanese said.Albanese said Ahmed al-Ahmed, 43, the man who tackled one of the shooters to disarm his rifle and suffered gunshot wounds, was due to undergo surgery on Wednesday. Al-Ahmed's uncle, Mohammed al-Ahmed in Syria, said his nephew left his hometown in Syria's northwest province of Idlib nearly 20 years ago to seek work in Australia.\"We learned through social media. I called his father and he told me that it was Ahmed. Ahmed is a hero, we're proud of him. Syria in general is proud of him,\" the uncle told Reuters.The family of 22-year-old police officer Jack Hibbert, who was shot twice on Sunday and had been on the force for just four months, said in a statement on Wednesday he had lost vision in one eye and faced a \"long and challenging recovery\" ahead. \"In the face of a violent and tragic incident, he responded with courage, instinct, and selflessness, continuing to protect and help others whilst injured, until he was physically no longer able to,\" the family said.Health authorities said 22 people were still in several Sydney hospitals.Other shooting victims included a Holocaust survivor, a husband and wife who first approached the gunmen before they started firing, and a 10-year-old girl named Matilda, according to interviews, officials and media reports.Matilda's father told a Bondi vigil on Tuesday night he did not want his daughter's legacy to be forgotten.\"We came here from Ukraine … and I thought that Matilda is the most Australian name that can ever exist. So just remember the name, remember her,\" local media reported him as saying.In Bondi on Wednesday, swimmers gathered on Sydney's most popular beach and held a minute's silence.\"This week has obviously been very profound, and this morning, I definitely feel a sense of the community getting together, and a sense of everyone sitting together,\" Archie Kalaf, a 24-year-old Bondi man, told Reuters. “Everyone's grieving, everyone's understanding and processing it in their own way.”","summary":"One of the shooters, Sajid Akram, 50, was shot dead by police at the scene, while his 24-year-old son, named in local media as Naveed, emerged from a coma on Wednesday after also being shot by police.","url":"https://www.republicworld.com/world-news/bondi-beach-mass-shooting-gunman-to-be-charged-soon-australia-pm-says-as-funerals-of-victims-begin","image":"https://img.republicworld.com/all_images/bondi-beach-mass-shooting-gunman-to-be-charged-soon-australia-pm-says-as-funerals-of-victims-begin-1765941316169-16_9.webp","video":null,"publish_date":"2025-12-17 03:15:21","author":"Thomson Reuters","authors":["Thomson Reuters"],"language":"en","category":"politics","source_country":"in","sentiment":-0.82},{"id":387317180,"title":"Rob Reiner’s son charged with two counts of murder","text":"Nick Reiner has been charged with two counts of first-degree murder after the deaths of his parents, actor and director Rob and his photographer wife, Michele.\n\nLos Angeles district attorney Nathan Hochman said no decision had been made on whether to seek the death penalty in the case.\n\nRob Reiner, 78, and Michele Singer Reiner, 68, were found dead from apparent stab wounds in their home in Brentwood, Los Angeles, on Sunday.\n\nTheir 32-year-old son was arrested a few hours later, around 14 miles from the scene and taken into custody.\n\nHe is being held without bail.\n\nHe has not entered a plea and did not appear in court on Tuesday as expected because of unspecified health reasons, according to his lawyer Alan Jackson.\n\nHe is expected to appear before a judge on Wednesday.\n\nMr Hochman said: “Their loss is beyond tragic and we will commit ourselves to bringing their murderer to justice.\n\n“He also faces a special allegation that he personally used a dangerous and deadly weapon, that being a knife.\n\n“These charges carry a maximum sentence of life in prison without the possibility parole or the death penalty.”\n\nHe added: “Prosecuting these cases involving family members are some of the most challenging and most heart-wrenching cases that this office faces because of the intimate and often brutal nature of the crimes involved.”\n\nReiner has long been one of the most prolific directors in Hollywood and his work includes some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, A Few Good Men, When Harry Met Sally and The Princess Bride.\n\nNick worked with his father on the 2016 film Being Charlie, which was loosely inspired by Nick’s experience of addiction and attending rehab.\n\nThe film, which he co-wrote, was directed by Rob and follows the son of a US governor, Charlie, played by Nick Robinson, as he battles with drug abuse.\n\nIn an interview with US publication People Magazine, Nick explained that the film was not about him; however, parts of the story he had experienced himself including going to rehab throughout his teenage years and his own experiences of homelessness and spending “weeks” on the streets for refusing to return to a rehab facility.\n\nA group of the Reiners’ friends, including actors Billy Crystal, Albert Brooks, Martin Short and Larry David, as well as director Barry Levinson, released a statement describing them as “a special force together – dynamic, unselfish and inspiring”.\n\nThe statement, released to The Associated Press, said: “Rob was a passionate, brave citizen, who not only cared for this country he loved, he did everything he could to make it better and with his loving wife Michele, he had the perfect partner.\n\n“Strong and determined, Michele and Rob Reiner devoted a great deal of their lives for the betterment of our fellow citizens.\n\n“To be in his hands as a film maker was a privilege but that is only part of his legacy.”\n\nOther tributes have poured in for the couple, including from former US president Barack Obama, former US House of Representatives speaker Nancy Pelosi, and singer Sir Elton John, who featured in the sequel to his 1984 mockumentary film Spinal Tap, Spinal Tap II: The End Continues, released in September this year.\n\nFormer US first lady Michelle Obama has said she and her husband Barack were meant to see the couple the night they were killed.\n\nSpeaking on Jimmy Kimmel Live, Ms Obama said: “We’ve known them for many, many years, and we were supposed to be seeing them that night.\n\n“Let me just say this, unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever want to know.”\n\nHer comments come after US President Donald Trump criticised the Reiners and alleged that their deaths were politically motivated.\n\nIn a post on Truth Social, Mr Trump suggested Rob and Michele Reiner died “reportedly due to the anger he caused others through his massive, unyielding and incurable affliction with a mind crippling disease known as Trump derangement syndrome”.","summary":"Nick Reiner is charged following the death of his parents, actor and director Rob and his photographer wife Michele.","url":"https://www.standard.co.uk/news/uk/barack-obama-michelle-obama-nancy-pelosi-nick-robinson-elton-john-b1262884.html","image":"https://static.standard.co.uk/2025/12/17/01/4a0ae3d9ec98cd861080e8cf77c9d403Y29udGVudHNlYXJjaGFwaSwxNzY2MDE4Njg3-2.82804745.jpg?width=1200","video":null,"publish_date":"2025-12-17 02:47:17","author":"Rob Freeman","authors":["Rob Freeman"],"language":"en","category":"politics","source_country":"gb","sentiment":0.409},{"id":387317024,"title":"Trump Widens Travel Ban, Adds 5 More Countries to Original List of 12 and Restrictions to Additional 20","text":"Washington: The Trump administration announced Tuesday it was expanding travel restrictions to an additional 20 countries and the Palestinian Authority, doubling the number of nations affected by sweeping limits announced earlier this year on who can travel and emigrate to the U.S.The Trump administration included five more countries as well as people traveling on documents issued by the Palestinian Authority to the list of countries facing a full ban on travel to the U.S. and imposed new limits on 15 other countries.The move is part of ongoing efforts by the administration to tighten U.S. entry standards for travel and immigration, in what critics say unfairly prevents travel for people from a broad range of countries. The administration suggested it would expand the restrictions after the arrest of an Afghan national suspect in the shooting of two National Guard troops over Thanksgiving weekend.People who already have visas, are lawful permanent residents of the U.S. or have certain visa categories such as diplomats or athletes, or whose entry into the country is believed to serve the U.S. interest, are all exempt from the restrictions. The proclamation said the changes go into effect on Jan 1.In June, President Donald Trump announced that citizens of 12 countries would be banned from coming to the United States and those from seven others would face restrictions. The decision resurrected a hallmark policy of his first term.At the time the ban included Afghanistan, Myanmar, Chad, the Republic of Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen and heightened restrictions on visitors from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.On Tuesday, the Republican administration announced it was expanding the list of countries whose citizens are banned from entering the U.S. to Burkina Faso, Mali, Niger, South Sudan and Syria. The administration also fully restricted travel on people with Palestinian Authority-issued travel documents, the latest U.S. travel restriction against Palestinians. South Sudan was also facing significant travel restrictions already.An additional 15 countries are also being added to the list of countries facing partial restrictions: Angola, Antigua and Barbuda, Benin, Ivory Coast, Dominica, Gabon, Gambia, Malawi, Mauritania, Nigeria, Senegal, Tanzania, Tonga, Zambia and Zimbabwe. The restrictions apply to both people seeking to travel to the U.S. as visitors or to emigrate there.The Trump administration said in its announcement that many of the countries from which it was restricting travel had “widespread corruption, fraudulent or unreliable civil documents and criminal records” that made it difficult to vet their citizens for travel to the U.S.It also said some countries had high rates of people overstaying their visas, refused to take back their citizens whom the U.S. wished to deport or had a “general lack of stability and government control”, which made vetting difficult. It also cited immigration enforcement, foreign policy and national security concerns for the move.The Afghan man accused of shooting the two National Guard troops near the White House has pleaded not guilty to murder and assault charges. In the aftermath of that incident, the administration announced a flurry of immigration restrictions, including further restrictions on people from those initial 19 countries who were already in the U.S.The news of the expanding travel ban is likely to face fierce opposition from critics who have argued that the administration is using national security concerns to collectively keep out people from a wide range of countries.“This expanded ban is not about national security but instead is another shameful attempt to demonize people simply for where they are from,” said Laurie Ball Cooper, vice president of U.S. Legal Programs at the International Refugee Assistance Project.Advocates for Afghans who supported the United States’ two-decade long war in Afghanistan also raised alarms Tuesday, saying the updated travel ban no longer contains an exception for Afghans who qualify for the Special Immigrant Visa. That’s a visa category specifically for Afghans who closely assisted the U.S. war effort at great risk to themselves.No One Left Behind, a longtime agency advocating for the Special Immigrant Visa program, said it was “deeply concerned” about the change. The organization said it appreciated the president’s commitment to national security but allowing Afghans who’d served the U.S. to enter the U.S. - after extensive vetting - also contributes to the country’s security.“Though intended to allow for review of inconsistent vetting processes, this policy change inadvertently restricts those who are among the most rigorously vetted in our history: the wartime allies targeted by the terrorists this proclamation seeks to address”, the organization said in a statement.Countries that were newly placed on the list of banned or restricted countries said late Tuesday that they were evaluating the news. The government of the island nation of Dominica in the Caribbean Sea said it was treating the issue with the “utmost seriousness and urgency” and was reaching out to U.S. officials to clarify what the restrictions mean and address any problems.Antigua and Barbuda’s ambassador to the United States, Ronald Saunders, said the “matter is quite serious” and he’ll be seeking more information from U.S. officials regarding the new restrictions.The Trump administration also upgraded restrictions on some countries - Laos and Sierra Leone - that previously were on the partially restricted list and in one case - Turkmenistan - said the country had improved enough to warrant easing some restrictions on travelers from that country. Everything else from the previous travel restrictions announced in June remains in place, the administration said.The new restrictions on Palestinians come months after the administration imposed limits that make it nearly impossible for anyone holding a Palestinian Authority passport from receiving travel documents to visit the U.S. for business, work, pleasure or educational purposes. The announcement Tuesday goes further, banning people with Palestinian Authority passports from emigrating to the U.S.In justifying its decision Tuesday, the administration said several “U.S.-designated terrorist groups operate actively in the West Bank or Gaza Strip and have murdered American citizens”. The administration also said the recent war in those areas had “likely resulted in compromised vetting and screening abilities”.ALSO READ: EAM Jaishankar Holds Talks With Israeli PM Netanyahu On Deepening Cooperation In Wide-Ranging Sectors","summary":"The Trump administration expanded its travel restrictions to 20 additional countries and the Palestinian Authority, doubling earlier bans introduced this year. This includes a full travel ban for five new countries and partial limits for 15 others, addressing concerns about security, corruption, and unreliability in civil documentation.","url":"https://www.republicworld.com/world-news/trump-widens-travel-ban-adds-5-more-countries-to-original-list-of-12-and-restrictions-to-additional-20","image":"https://img.republicworld.com/all_images/trump-signs-bill-to-release-jeffrey-epstein-files-after-fighting-it-for-months-1763604823295-16_9.webp","video":null,"publish_date":"2025-12-17 02:23:13","author":"Associated Press Television News","authors":["Associated Press Television News"],"language":"en","category":"politics","source_country":"in","sentiment":0.119},{"id":387318262,"title":"From $4,185 To $60: FIFA Slashes Price Of Some World Cup Tickets After Massive Global Backlash","text":"Geneva: FIFA slashed the price of some World Cup tickets for teams' most loyal fans following a global backlash and some will get $60 seats for the final instead of being asked to pay $4,185.It was a rare climbdown by the soccer body and its president Gianni Infantino after soaking up waves of criticism for World Cup strategies, including top-dollar prices and closer political alignment with U.S. President Donald Trump.FIFA said Tuesday that $60 tickets will be made available for every game at the tournament in North America, going to the national federations whose teams are playing. Those federations decide how to distribute them to loyal fans who have attended previous games at home and on the road.The number of $60 tickets for each game is likely to be from 400 to 750 per team, in what FIFA is now calling a “Supporter Entry Tier” price category. FIFA is using 16 host cities, including 11 NFL stadiums in the United States, plus two in Canada and three in Mexico.FIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are “designed to further support traveling fans following their national teams across the tournament.”However, the Football Supporters Europe group, which represents grassroots fan groups, said the limited price cut was “an appeasement tactic due to the global negative backlash.”“This shows that FIFA’s ticketing policy is not set in stone, was decided in a rush, and without proper consultation,” the group said in a statement.The World Cup in North America will be the first edition that features 48 teams — up from 32 — and is expected to earn FIFA at least $10 billion in revenue while being the most expensive ever for fans.Despite the outcry over prices, FIFA says it has already received more than 20 million ticket requests in its latest sales phase.The FSE group said that even with Tuesday's announcement, “the vast majority would still have to pay extortionate prices, way higher than at any tournament before.”Fans worldwide reacted with shock and anger last week on seeing FIFA’s ticketing plans that gave participating teams no tickets in the lowest-priced category. Their standard allocation is 8% of stadium capacity per team.The cheapest prices ranged from $140 to $265 for group-stage games that did not involve co-hosts the United States, Canada and Mexico. The $265 games involve Lionel Messi's Argentina, Portugal with Cristiano Ronaldo and well-supported teams like Brazil and England.FIFA had set those prices despite the co-hosts having pledged eight years ago — when they were bidding for the tournament — that hundreds of thousands of $21 tickets would be made available for games before the knockout rounds.The hospitality program in modern NFL venues, and now managed in-house instead of outsourced to an agency, is expected to earn FIFA billions of dollars rather than hundreds of millions.Criticism from fans, especially in Europe, had been increasing for several months over plans for “dynamic pricing” plus extra fees on a FIFA-run resale platform — both features which are common in the U.S. entertainment industry but not to soccer fans worldwide.Fan anger intensified last week when it became clear loyal supporters would have no access to the cheapest category tickets and that fans who wanted to reserve a ticket for all of their team's potential games — through the final — would not get refunded until after the tournament.In another climbdown Tuesday, FIFA said it would waive its administrative fees when refunds are made after the July 19 final.Even before the FIFA statement, the supporter group FSE called Tuesday for a re-think on World Cup policy for fans with disabilities.It said FIFA's resale platform was offering disability access seats at multiple times face value with no assurances those tickets actually would be sold to people with a disability. Those fans also can no longer get free tickets for companions as they could at the last World Cup in Qatar.In Qatar, Infantino started an eve-of-tournament speech with a tirade at perceived critics of the host nation, FIFA and himself that included the line “today I feel disabled.”“True inclusion requires action,” FSE said Tuesday, reminding Infantino of that speech. “It’s time for FIFA to move away from populistic statements and respect its own commitments.”","summary":"FIFA did not specify exactly why it so dramatically changed strategy, but said the lower prices are “designed to further support traveling fans following their national teams across the tournament.”","url":"https://www.republicworld.com/sports/from-4185-to-60-fifa-slashes-price-of-some-world-cup-tickets-after-massive-backlash","image":"https://img.republicworld.com/all_images/from-4185-to-60-fifa-slashes-price-of-some-world-cup-tickets-after-massive-backlash-1765937680201-16_9.webp","video":null,"publish_date":"2025-12-17 02:14:57","author":"Associated Press Television News","authors":["Associated Press Television News"],"language":"en","source_country":"in","sentiment":-0.02},{"id":387318400,"title":"Thailand mahu Kemboja umum gencatan senjata dulu bagi hentikan pertempuran","text":"BANGKOK: Thailand tegas mahu Kemboja umum gencatan senjata terlebih dulu bagi hentikan pertempuran antara kedua-dua negara itu selepas lebih seminggu pertempuran berdarah susulan konflik sempadan yang kembali memuncak.\n\n\"Sebagai pihak yang menceroboh wilayah Thailand, Kemboja mesti umumkan gencatan senjata terlebih dulu,\" kata jurucakap Kementerian Luar Thailand, Maratee Nalita Andamo, kepada pemberita di Bangkok.\n\nTambah beliau, Kemboja juga perlu bekerjasama secara 'ikhlas' dalam usaha penyahaktifan periuk api di kawasan sempadan.\n\nPertempuran yang kembali tercetus bulan ini antara dua negara jiran Asia Tenggara itu mengorbankan sekurang-kurangnya 34 orang, termasuk anggota tentera dan orang awam, serta menyebabkan kira-kira 800,000 penduduk kehilangan tempat tinggal, menurut pegawai.\n\nDi Kemboja, seramai 17 orang awam dilaporkan terbunuh, menurut Kementerian Dalam Negeri.\n\nKedua-dua pihak saling menyalahkan antara satu sama lain sebagai pencetus pertempuran, dengan masing-masing mendakwa bertindak mempertahankan diri sambil bertukar-tukar tuduhan serangan terhadap orang awam.\n\nKemboja tidak memberikan sebarang maklum balas segera terhadap kenyataan Thailand itu.\n\nPresiden Amerika Syarikat (AS), Donald Trump, sebelum ini turut mendakwa kedua-dua negara sudah bersetuju melaksanakan gencatan senjata bermula malam Sabtu.\n\nPerdana Menteri Kemboja, Hun Manet, berkata negaranya menyokong inisiatif gencatan senjata yang dicadangkan oleh Malaysia selaku pengerusi blok serantau ASEAN, dengan penyertaan Washington.\n\nBagaimanapun, pertempuran berterusan setiap hari sejak 7 Disember, merebak ke tujuh wilayah di kedua-dua sisi sempadan, dan Bangkok menafikan dakwaan Trump mengenai persetujuan gencatan senjata.\n\nKemboja, yang mempunyai kekuatan ketenteraan lebih kecil dan perbelanjaan pertahanan lebih rendah berbanding Thailand, pada Isnin berkata tentera Thailand sudah meluaskan serangan mereka 'jauh ke dalam' wilayah Kemboja.\n\nPhnom Penh menuduh tentera Thailand mengebom wilayah Siem Reap, yang menempatkan kuil purba Angkor berusia berabad-abad yang juga menjadi tarikan pelancongan utama negara itu, buat kali pertama dalam pusingan pertempuran terbaharu.\n\nPertempuran itu, yang membabitkan penggunaan artileri, kereta kebal dan jet pejuang Thailand, mengorbankan 16 anggota tentera Thailand, seorang orang awam Thailand dan 15 orang awam Kemboja, menurut pegawai.\n\nPhnom Penh tidak melaporkan sebarang kematian anggota tenteranya dalam pertempuran terbaharu itu.\n\nKonflik berkenaan berpunca daripada pertikaian wilayah susulan penandaan sempadan era penjajahan sepanjang 800 kilometer (km) serta kewujudan beberapa runtuhan kuil purba di kawasan sempadan.\n\nMenteri-menteri luar ASEAN dijadualkan mengadakan mesyuarat pada 22 Disember di Malaysia bagi rundingan kecemasan yang bertujuan mencari penyelesaian diplomatik.\n\nThailand pada Selasa berkata antara 5,000 hingga 6,000 warga Thailand masih terkandas di bandar sempadan Poipet di Kemboja selepas Phnom Penh menutup lintasan sempadan darat dengan negara jiran itu pada Sabtu.\n\nKementerian Dalam Negeri Kemboja berkata penutupan sempadan itu adalah satu langkah penting bagi mengurangkan risiko terhadap orang awam di tengah-tengah pertempuran yang berterusan. - AFP","summary":"BANGKOK: Thailand tegas mahu Kemboja umum gencatan senjata terlebih dulu bagi hentikan pertempuran antara kedua-dua negara itu selepas lebih seminggu pertempuran berdarah susulan konflik sempadan yang kembali memuncak.","url":"https://www.bharian.com.my/dunia/asean/2025/12/1486054/thailand-mahu-kemboja-umum-gencatan-senjata-dulu-bagi-hentikan","image":"https://assets.bharian.com.my/images/articles/bh17cist-o_BHfield_image_listing_featured.var_1765937636.jpg","video":null,"publish_date":"2025-12-17 02:14:01","author":null,"language":"en","source_country":"my","sentiment":0.088},{"id":387317926,"title":"‘We always bring Jared’: Trump’s son-in-law can’t escape the president’s inner circle","text":"For a man who vowed to stay out of the political spotlight, Jared Kushner is finding himself very much in its glare.\n\nHe helped clinch a ceasefire agreement and secure the release of hostages in Gaza. He has sat across from Vladimir Putin and Volodymyr Zelensky – separately – in a bid to negotiate a peace deal over Ukraine. And his private equity firm has backed a bid in the politically charged battle for an entertainment empire.\n\nSuch engagement might have been expected in Donald Trump’s first administration, where Kushner served as a senior adviser. But it’s a far cry from the future that the president’s son-in-law envisioned just last year, when he told a Miami crowd that he’d stay out of government affairs even if offered a job.\n\nNow he’s a linchpin of some of the biggest issues confronting the White House, underscoring a defining feature of Trump’s inner orbit: You never really leave.","url":"https://www.smh.com.au/business/companies/we-always-bring-jared-trump-wants-his-son-in-law-in-the-middle-of-everything-20251217-p5noau.html","image":"https://static.ffx.io/images/$zoom_0.28422739272380776%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_137%2C$y_88/t_crop_custom/q_86%2Cf_auto/e4825f2987f071ff718a63a9bcac1d88c9d12c79","video":null,"publish_date":"2025-12-17 02:00:53","author":"Justin Sink","authors":["Justin Sink"],"language":"en","category":"politics","source_country":"au","sentiment":-0.439},{"id":387316858,"title":"Fed Governor Christopher Waller Reportedly Set For Trump Interview On Chair Role","text":"With Jerome Powell on his way out, US President Donald Trump is set to interview Christopher Waller on Wednesday for the US Federal Reserve Chairman position, reports the Wall Street Journal.Waller, who currently serves as the US Federal Reserve governor, has been a staunch advocate for rate cuts this year - something that aligns with Donald Trump's ideological position on the economy.This comes on the back of Trump reportedly interviewing Kevin Warsh last week, with the former US Fed Governor emerging as one of the leading candidates to become the next US Fed Chairman.Trump is also considering Kevin Hassett, the director of the National Economic Council as well as Waller, who is being interviewed this week, as per WSJ..'Won't Address On Economy, Monetary Policy,' Says Fed Chair Jerome Powell As Trump Set To Name His Successor.The report points out that Waller is viewed favourably on Wall Street as he has put out reasonable arguments for rate cuts. He notably dissented in favour of a rate cut in July, when the US Fed decided to hold rates steady.A native of Nebraska, Waller was roped into Fed's board by Donald Trump during the end of his first term in 2020. However, the report points out that Waller is an underdog in the race for the US Fed Chair as he doesn't appear to have the same level of personal relationship with Trump as Hassett or Warsh.Moreover, Trump's close aids believe Waller was disloyal for voting for a haf-percentage rate cut in September 2024, before Trump became President. Treasury Secretary Scott Bessent confirmed on Tuesday that Trump, who is expected to interview a few candidates this week and the next, will announce his decision sometime in January.In what could be an early indicator, Bessent also described both Warsh and Hassett as 'extreme-qualified' candidates..Quarter-Point Rate Cut Not Enough, Says US President Donald Trump; Calls Jerome Powell A 'Deadhead","summary":"This comes on the back of Trump reportedly interviewing Kevin Warsh last week, with the former US Fed Governor emerging as one of the leading candidates to become the next US Fed Chairman.","url":"https://www.ndtvprofit.com/world/fed-governor-christopher-waller-reportedly-set-for-trump-interview-on-chair-role","image":"https://media.assettype.com/bloombergquint/2025-09-23/ruytzzek/Trump-UNGA.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:47:43","author":"Anas Ali","authors":["Anas Ali"],"language":"en","category":"politics","source_country":"in","sentiment":0.05},{"id":387317932,"title":"Trump orders blockade of ‘sanctioned oil tankers’ into Venezuela","text":"Washington: President Donald Trump has said he is ordering a blockade of all “sanctioned oil tankers” into Venezuela, ramping up pressure on the country’s president, Nicolas Maduro, in a move that seems designed to put a tighter chokehold on the South American country’s economy.\n\nTrump’s escalation comes after US forces last week seized an oil tanker off Venezuela’s coast, an unusual move that followed a build-up of military forces in the region.\n\nAnnouncing the blockade in a social media post on Tuesday night (Wednesday AEDT), Trump alleged Venezuela was using oil to fund drug-trafficking and other crimes and vowed to continue the military build-up until the country gave the US oil, land and assets, though it was not clear why he felt the US had a claim.\n\n“Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,” Trump said in a post on his social media platform. “It will only get bigger, and the shock to them will be like nothing they have ever seen before – Until such time as they return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us.”","url":"https://www.smh.com.au/world/north-america/trump-orders-blockade-of-sanctioned-oil-tankers-into-venezuela-20251217-p5nofp.html","image":"https://static.ffx.io/images/$zoom_0.5295%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/1871654d16dcd3e2b8e49af783418f5b8cbd98e5","video":null,"publish_date":"2025-12-17 01:21:06","author":"Michelle Price","authors":["Michelle Price"],"language":"en","category":"politics","source_country":"au","sentiment":0.196},{"id":387316908,"title":"Warner Bros. Plans to Reject Paramount Bid on Funding, Terms","text":"Warner Bros. Discovery Inc. is planning to reject Paramount Skydance Corp.’s hostile takeover bid due to concerns about financing and other terms, people familiar with the matter said.After deliberating and reviewing Paramount’s bid, Warner Bros.’ board will urge shareholders to reject the tender offer, said the people, who asked not to be identified discussing confidential information. The board still views the company’s existing agreement with streaming leader Netflix Inc. as offering greater value, certainty and terms than what Paramount has proposed, they said.Warner Bros.’ response to Paramount’s tender offer could be filed as early as Wednesday, the people added. No final decision has been made and the situation remains fluid, they said. Representatives for Warner Bros. and Paramount declined to comment..One major sticking point is Warner Bros.’ concern about the financing proposed by Paramount, which is led by David Ellison.The equity is backstopped by a trust that manages the wealth of his father, software billionaire Larry Ellison. Because it’s a revocable trust, assets can be taken out of it at any time, and Warner Bros. may have no recourse if that happens, the people said. One of Paramount’s backers dropped out of the deal Tuesday. Affinity Partners, led by President Donald Trump’s son-in-law Jared Kushner, told Bloomberg News it was withdrawing from the proposed transaction, citing the involvement of “two strong competitors.”.Netflix Vs Paramount: Warner Bros Merger Fight Draws Fire Across US Political Divide.Earlier Tuesday, President Trump criticized Paramount, saying on social media that he’s been treated “far worse” by the company’s CBS division since the Ellison family took control earlier this year. The Ellisons have touted their friendly ties to the president.Warner Bros.’ board is also concerned about the company’s ability to conduct business for the year or more it could take for a sale to win regulatory approval. Paramount isn’t offering the company enough flexibility to run its business or manage its balance sheet, the people said. Paramount said in a filing last week that it had addressed Warner Bros. concerns about the company’s flexibility in refinancing debt as well as payment of a $5 billion break up fee that would be backstopped by the Ellison family. .Paramount has adjusted terms of its bid in response to Warner Bros.’ requests in other ways. Some $1 billion in financing from China’s Tencent Holdings Ltd. was withdrawn over concerns the funding could lead to national security issues with US regulators. Warner Bros. agreed this month to sell its studios, streaming business and HBO to Netflix for $27.75 a share, or about $83 billion including debt, capping off a multiweek bidding war between Netflix, Paramount and Comcast Corp. Warner Bros. separately plans to spin off cable networks like CNN and TNT to its shareholders before the Netflix deal closes.Paramount, which owns MTV and the Paramount+ streaming service, has offered to buy all of Warner Bros. for $30 a share, or more than $108 billion, including debt. Three days after Netflix and Warner Bros. announced their deal, Paramount took its offer directly to shareholders by launching a public tender offer for Warner Bros. shares. .Paramount has said that its $30-a-share offer for Warner Bros. isn’t its “best and final,” implying it has room to raise its bid. Shares of Warner Bros. closed at $28.90 in New York, suggesting some investors expect the company to fetch a higher price. Warner Bros.’ agreement with Netflix bars it from soliciting proposals from other bidders but it’s allowed to entertain proposals that come in. In the event of a superior proposal, it’s required to give Netflix the opportunity to match the better offer to try to keep their existing deal intact, according to their agreement. .Will Continue Theatre Releases: Netflix Co-CEO Dismisses Fears Of 'Harming' Warner Bros Value","summary":"President Trump has criticized Paramount, saying on social media that he’s been treated “far worse” by the company’s CBS division since the Ellison family took control.","url":"https://www.ndtvprofit.com/world/warner-bros-plans-to-reject-paramount-bid-on-funding-terms","image":"https://media.assettype.com/bloombergquint/2025-12-17/ls3190q1/446053586.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:19:52","author":null,"language":"en","category":"entertainment","source_country":"in","sentiment":-0.26},{"id":387316882,"title":"Asian Stocks Slip After US Jobs Data, Oil Rises: Markets Wrap","text":"Asian stocks posted a modest decline at the open after sluggish US jobs data did little to boost bets on further interest-rate cuts from the Federal Reserve. MSCI’s regional equities gauge dropped 0.1%, extending its losses to a third consecutive day. That’s after the S&P 500 also fell for a third day Tuesday, while the Nasdaq 100 added 0.3%. Tesla Inc. shares fell more than 1% in extended trading after the company’s sales in California were poised to be suspended for 30 days. Treasuries steadied along with the dollar after slipping during US trading.West Texas Intermediate crude oil rose more than 1% after President Donald Trump said he was ordering a \"total and complete blockade of all sanctioned oil tankers\" going into and leaving Venezuela.Nonfarm payrolls increased 64,000 in November after declining 105,000 in October amid a contraction in federal employment. The unemployment rate was 4.6% last month, up from 4.4% in September and the highest since 2021.The US central bank is seen as less likely to put much weight on the data due to disruptions caused by the US government shutdown. Traders assigned a 20% chance of a rate reduction in January. Investors will now focus on inflation data due Thursday and remarks from several Fed officials who are expected to speak throughout the week.\"While the labor market reports were soft, the data need to be treated with caution following the government shutdown,\" said ANZ Group Holdings Ltd. analysts Brian Martin and Daniel Hynes. \"Uncertainty surrounding the timing of the FOMC’s next move is unlikely to be resolved until the data flow normalises next year.\" A separate report out on Tuesday showed retail sales were little changed in October as a decline at auto dealers and weaker gasoline receipts offset stronger spending in other categories. And figures from S&P Global showed US business activity expanded in December at the slowest pace in six months, while a measure of input prices jumped to a more than three-year high. .Signs the US jobs market is sluggish, but not quickly deteriorating saw traders refraining from boosting bets on near-term rate cuts.Meanwhile, the Trump administration has also threatened retaliation against the European Union in response to efforts to tax American tech companies, singling out prominent companies, including Accenture Plc, Siemens AG and Spotify Technology SA, as possible targets for new restrictions or fees.In Asia, investors will be focused on Chinese stocks in Hong Kong after they neared key bearish technical levels on Tuesday as fading tech gains and renewed economic growth concerns fueled a sharp selloff. A gauge of Chinese shares listed in the US fell for a fourth straight day. .US Stock Market Today: Dow, S&P 500 Falter As Jobs Data Shows Sluggish Economy.Warner Bros. Discovery Inc. is planning to reject Paramount Skydance Corp.’s hostile takeover bid due to concerns about financing and other terms, people familiar with the matter said.China Vanke Co. unveiled a revised bond-extension proposal for creditors to vote on, as the distressed developer makes another attempt to gain support for a plan to avert default.China’s Luckin Coffee Inc. is considering making a bid for Nestle SA’s Blue Bottle Coffee to boost its brand profile and expand in the premium coffee segmentSBI Shinsei Bank Ltd. will start trading in Tokyo on Wednesday after raising ¥322 billion ($2.1 billion) in Japan’s second-biggest initial public offering of the year.Treasury Wine Estates Ltd. announced a company-wide overhaul, including asset sales and cost cuts, as the Penfolds producer tackles weakening demand in its key markets..Oil Jumps After Trump Orders Blockade Of Tankers Off Venezuela.Some of the main moves in markets:StocksS&P 500 futures fell 0.2% as of 9:13 a.m. Tokyo timeHang Seng futures fell 0.1%Japan’s Topix fell 0.3%Australia’s S&P/ASX 200 fell 0.4%Euro Stoxx 50 futures fell 0.6%CurrenciesThe Bloomberg Dollar Spot Index was little changedThe euro was little changed at $1.1746The Japanese yen was little changed at 154.85 per dollarThe offshore yuan was little changed at 7.0357 per dollarThe Australian dollar was little changed at $0.6629CryptocurrenciesBitcoin was little changed at $87,669.79Ether rose 0.2% to $2,956.27BondsThe yield on 10-year Treasuries was little changed at 4.15%Japan’s 10-year yield was unchanged at 1.950%Australia’s 10-year yield was little changed at 4.73%CommoditiesWest Texas Intermediate crude rose 1.6% to $56.14 a barrelSpot gold rose 0.2% to $4,312.52 an ounce.Stock Market Today: All You Need To Know Going Into Trade On Dec. 17","summary":"MSCI’s regional equities gauge dropped 0.1%, extending its losses to a third consecutive day.","url":"https://www.ndtvprofit.com/markets/global-stock-market-news-december-17-dow-jones-nikkei-hang-seng-s-and-p-500-nasdaq","image":"https://media.assettype.com/bloombergquint/2025-12-17/w0mxngl8/market-wrap-dec-17.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:14:09","author":null,"language":"en","source_country":"in","sentiment":-0.156},{"id":387316840,"title":"Tata And Infosys To Bear Brunt Of Trump’s $100,000 H-1B Worker Fee","text":"President Donald Trump’s $100,000 price tag for new H-1B workers hired from outside the US could have punishing effects for the IT outsourcing and staffing industries that have long been a target of both parties.The fee is the biggest restriction the Trump administration has imposed so far on employment of skilled foreign workers.A Bloomberg News analysis found it could have a disproportionate impact on multinational staffing firms that act as middlemen for companies seeking H-1B workers. Those middlemen include Tata Consultancy Services Ltd., Infosys Ltd., and Cognizant Technology Solutions Corp.Almost 90% of new H-1B hires at those three companies between May 2020 and May 2024 were approved at US consulates. The workers would have cost each of them hundreds of millions more if the fee had been in effect. More than 93% of new Infosys H-1B hires in that timeframe—upwards of 10,400 workers—would have been hit with the $100,000 fee, according to the Bloomberg analysis, adding up to more than a billion dollars in visa charges.Tata would have had to pay the fee for 6,500 workers over that period, or 82% of newly approved H-1B workers. Cognizant would be faced with the charge for more than 5,600 employees, or 89% of new H-1B hires..Even if legal challenges are successful in quickly blocking the fee, industry observers expect it will to lead to a steep drop in visa demand and drive placement of more workers overseas.“We’re already seeing that happen,” said immigration attorney Jonathan Wasden, who represents many IT employers. “The fear is that if you have truly exceptional talent overseas, those people are definitely going to be missing out.”Some firms say that the fee will have little effect on their operations in the short run.“The recently announced Proclamation is expected to have limited near-term impact on Cognizant’s operations,” said Cognizant spokesman Jeff DeMarrais. “Over the past several years, we have significantly reduced our reliance on visas, using them only for select technology roles that supplement our U.S. workforce.”.Large tech and IT firms have traditionally dominated the H-1B program, the primary pathway to US careers for foreign workers with at least a bachelor’s degree. They claim most of the 85,000 visa slots available each year.Both Republican and Democratic lawmakers have claimed that companies use the program as a cheap alternative to American workers, although H-1B employees must be paid a “prevailing wage” for their industry and early-career H-1B workers typically garner well above the US median wage.Workers from outside the US, rather than recent international graduates of US colleges already in the country, accounted for more than four out of 10 new H-1B hires approved over the past four years, according to data analyzed by Bloomberg News..Social Media Screening For Visas: What Is Trump Administration Looking For In Applicants' Handles.IT employers took advantage of an online lottery process set up by Trump officials in 2020, allowing them to register H-1B workers for a low fee and without a detailed petition. The number of entries grew at breakneck speed, topping 758,000 eligible registrations in fiscal 2024.DHS officials under President Joe Biden attributed the skyrocketing entries to IT consultants gaming the system before revamping the lottery last year. Trump’s $100,000 fee is an even more punishing tool to block those companies from the program.White House spokeswoman Taylor Rogers said in a statement it will give American businesses seeking high-skilled workers more certainty and discourage companies “from spamming the system and driving down wages.”.States and business groups have filed separate challenges to the Trump fee, including one led by the US Chamber of Commerce. A hearing is set for this week in that case on a motion to block the fee or rule on its lawfulness.Many employers aren’t waiting to see how litigation plays out before adjusting their hiring plans.The IT consulting industry had already pulled back on new H-1Bs since 2024 and the fee will push more jobs overseas, said Steve Hall, chief AI officer at Information Services Group Inc., a tech research firm that advises clients on IT outsourcing.US-based corporations will likely boost investments in India, the source of most H-1B workers, over the next half decade, he said.“If you want to access the world’s best talent, you have to go where the talent is,” he said.Most of the 10 biggest H-1B employers declined to comment on how the fee will shape hiring plans.An Infosys spokesman highlighted October comments from CEO Salil Parekh, who said that a minority of the company’s US workforce requires sponsorship for employment. The company’s work with clients will continue “without any disruption to their services today and into the future,” Parekh said.IBM Corp., which hired 88% of its H-1B workers from abroad, said it shifted its approach to high-skilled immigration over time, according to spokesperson Miki Carver.“Our focus remains on ensuring we have the right skills to meet clients’ evolving needs,” Carver said..The fee was a step in the right direction, but employers will figure out how to adapt, said Ron Hira, a political scientist at Howard University and critic of the H-1B program. The visa lottery next April will be an early measure of its success, he said.“Will that be a higher skill, higher wage cohort? That’ll be the first sign,” Hira said.Some of the biggest H-1B employers plan to opt out of registering workers in the lottery who would require visa processing at consulates, said Finn Reynolds, director of market research at legal tech startup Lawfully. He added that such a hiring shift will likely be industry-wide until there’s more certainty on the $100,000 fee.Those new costs—combined with a proposed Trump lottery overhaul—could drive down entries in next year’s lottery by anywhere from 30% to 50%, Lawfully projects. Businesses will have to weigh the costs of the fee and workers’ odds in the restructured selection process, Reynolds said.“The Trump administration’s $100,000 fee, combined with the weighted-lottery rule, has created an entirely new set of incentives that will reshape market behavior vis-a-vis the H-1B lottery,” he said..Securing US Citizenship For Your Newborn? Trump Administration Announces Fresh Visa Curbs — Details Inside","summary":"The fee is the biggest restriction the Trump administration has imposed so far on employment of skilled foreign workers.","url":"https://www.ndtvprofit.com/business/tata-and-infosys-to-bear-brunt-of-trumps-100000-h-1b-worker-fee","image":"https://media.assettype.com/bloombergquint/2025-12-17/wkg5yvhm/445939969.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:11:18","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.295},{"id":387316900,"title":"Japan Mulls Income Tax Hike From 2027 To Help Fund Defense","text":"Japanese Prime Minister Sanae Takaichi’s ruling coalition is discussing raising income taxes from 2027 to help pay for higher defense spending, breaking a three-year stalemate on the issue as mounting geopolitical risks make it more urgent to secure funding sources.The Liberal Democratic Party is proposing raising the income tax rate by 1 percentage point across all income brackets from January 2027 to help finance defense spending, according to a recent draft of its tax reform plans. The effective income tax rate would remain unchanged for now, as a reconstruction surtax introduced after the 2011 earthquake would be cut by the same amount, the proposal said.Last week the LDP’s coalition partner Japan’s Innovation Party was still considering whether to support the idea, according to local media.The ruling parties are in the final stages of compiling their tax reform package for the next fiscal year. Once signed later this week, it will be sent to the cabinet for approval, and then taken up for parliamentary debate early next year..The decision would allow the government to lock in its long-delayed blueprint for funding expanded defense outlays. Under former Prime Minister Fumio Kishida, Japan agreed in 2022 to lift defense spending to 2% of gross domestic product by fiscal 2027, resulting in total outlays of ¥43 trillion ($277 billion) over the following five years. Japan initially planned to allocate about 1.8% of GDP this year, using 2022 as a base figure.Takaichi announced earlier this year she would move the goal forward by two years to the current fiscal year, using ¥1.1 trillion from an extra budget to close the gap in budgeted funding. This fiscal year Japan is set to spend more than ¥10 trillion on defense, including the extra budget outlays.Last year, the government decided to start raising tobacco and corporate taxes from April 2026 while shelving a decision on when to begin raising the income tax due to public opposition..Japan's MUFG Is Said To Near Deal For Stake In Shriram Finance.The move comes as some in Japan have begun to question the extent to which the nation can rely on the US for its security needs, an arrangement that stretches back to the end of World War II. Earlier this year, President Donald Trump urged allies to spend 5% of GDP on defense, although Trump welcomed Takaichi’s pledge to fast-track the increase in defense spending to 2% when he visited Japan in October.Japan may soon face calls to revisit its defense spending target. Separately, Trump has also pressed Japan to shoulder more of the costs related to its hosting of US military bases, calling the current arrangement unfair. The two sides are expected to begin talks next year over the host nation support treaty, which expires in March 2027. Japan currently pays an average of ¥211 billion a year.Japan’s focus on GDP as a measure for defense spending implies higher nominal outlays, as the economy has expanded to a record ¥609 trillion in nominal terms last year. That marks nearly a 9% increase from fiscal 2022, the reference year for the current goal..Discussions over defense spending come as geopolitical tensions escalated since Takaichi said in parliament last month that a Taiwan crisis might constitute a “survival-threatening situation” for Japan, a description that could provide a legal justification for Tokyo to deploy its military alongside other countries if they chose to respond. Strains rose further this month after Japan said at least one Chinese fighter jet locked its fire-control radar onto Japanese aircraft. Beijing countered that Japanese jets interfered with its military exercises.Japan’s annual tax reform process, a central fixture of domestic politics, typically begins with a draft prepared by the ruling parties. In addition to income tax changes, the coming overhaul may expand the scope of an additional income tax on the super rich by halving the tax-exempt threshold to ¥165 million, while raising the rate to 30% from the current 22.5%. The measure, slated for fiscal 2027, is expected to help offset roughly ¥1.5 trillion in lost revenue stemming from lower gasoline taxes.The super rich in Japan often benefit from the comparatively lower 20% tax rate for asset sales.Expected tax system reform measures for next fiscal year:Extending mortgage tax breaks by five yearsAllowing those under 18 to invest through the tax-free NISA or “Nippon Individual Savings Account” accountsDoubling the tax-free cap on company meal subsidies to ¥7,500 a monthIntroducing incentives for large-scale corporate investment, including immediate expensing and tax credits of up to 7% of investment valueExcluding large companies from wage-growth related tax breaksRaising the departure tax to ¥3,000 from ¥1,000 from July 2026Ruling parties often use the reform process to secure opposition backing for budgets by incorporating some of their policy demands. Reflecting a prior agreement with the Democratic Party for the People, the LDP is also weighing an increase in the tax-free income ceiling to ¥1.78 million from ¥1.6 million, according to Nikkei newspaper. Takaichi’s coalition holds a razor-thin majority in the lower house after adding three independent lawmakers last month, but it still lacks control of the upper chamber. The weak position in parliament has made the ruling party more open to incorporating opposition demands to ensure the budget’s smooth passage. Takaichi’s cabinet still has solid public support, but her party hasn’t fared so well in surveys, limiting its room to sideline opposition voices.Some of the proposed measures would reduce tax revenue, likely adding strain on public finances and stoking concerns over fiscal sustainability. Benchmark government bond yields have been hovering near multi-decade highs.After rolling out the largest extra budget since pandemic restrictions were lifted, Takaichi and Finance Minister Satsuki Katayama said total bond issuance this fiscal year would stay below last year’s level, in an apparent attempt to reassure investors concerned about the nation’s debt levels..Japan’s Two-Year Yield Hits Highest Since 2008 On Rate-Hike Bets","summary":"The ruling parties are in the final stages of compiling their tax reform package for the next fiscal year.","url":"https://www.ndtvprofit.com/world/japan-mulls-income-tax-hike-from-2027-to-help-fund-defense","image":"https://media.assettype.com/bloombergquint/2025-12-17/vtu39hmz/446076902.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:04:55","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.298},{"id":387316824,"title":"Oil Jumps After Trump Orders Blockade Of Tankers Off Venezuela","text":"Oil rose from the lowest level since 2021 after President Donald Trump ramped up pressure on Venezuela with a blockade of tankers, while signs of a swelling global glut continue to hang over the market.West Texas Intermediate climbed above $56 a barrel after tumbling almost 6% over the previous four sessions. Brent settled just below $59. Trump said he was ordering a blockade of sanctioned oil ships going into and leaving the South American nation, according to a social media post on Tuesday.The move represents an escalation and follows the seizure of an oil tanker last week by US forces off Venezuela. Trump said he was also designating the regime of President Nicolas Maduro a foreign terrorist organization.Meanwhile, signs of market weakness are emerging from the Middle East to the US, as investors brace for a glut that the International Energy Agency predicts will be the biggest since the pandemic. Oversupply is being driven by OPEC+ returning idled output at a rapid rate and other producers pumping more, putting oil on track for a yearly loss. Traders are also weighing the odds of a possible peace deal in Ukraine, which could pave the way for fewer restrictions on Russian crude exports..WTI for January delivery gained 1.4% to $56.06 a barrel at 8:16 a.m. in Singapore.Brent for February settlement closed 2.7% lower at $58.92 a barrel on Tuesday..Trump Orders Blockade Of Sanctioned Oil Tankers In Venezuela","summary":"West Texas Intermediate climbed above $56 a barrel after tumbling almost 6% over the previous four sessions. Brent settled just below $59.","url":"https://www.ndtvprofit.com/markets/oil-jumps-after-trump-orders-blockade-of-tankers-off-venezuela","image":"https://media.assettype.com/bloombergquint/2025-12-17/bjoynjct/oil-venezuela.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 01:04:21","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.006},{"id":387317912,"title":"Trump’s two Americas are getting further apart","text":"The US unemployment rate is now at its highest since the pandemic, but the White House says “the best is yet to come”.\n\nThe disparity between the facts and their interpretation highlights how the 43-day shutdown of the US government, during which the Bureau of Labor Statistics (BLS) ceased collecting data, has left the reliability of the much-anticipated and much-delayed jobs report for October and November open to question and interpretation.\n\nWhat is undeniable, however, is that an unemployment rate that started the year at 4 per cent, when Donald Trump regained the presidency, is now at 4.6 per cent and has been creeping up in 10 basis point increments since mid-year. The US has lost more than 270,000 jobs this year.\n\nThe White House seized on an increase in private sector jobs in November, where 64,000 jobs were added, as a sign of progress, even as the unemployment rate rose to its highest level in more than four years and the number of people working part-time while wanting full-time employment rose to 8.7 per cent, a percentage point higher than at the same time last year. The unemployment rate for black Americans, at 8.3 per cent, is the highest since 2021.","url":"https://www.smh.com.au/business/the-economy/trump-s-two-americas-are-getting-further-apart-20251217-p5noch.html","image":"https://static.ffx.io/images/$zoom_0.6390607407407407%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_78%2C$y_81/t_crop_custom/q_86%2Cf_auto/e434731fd7d4eba7c1f798f33aa5aaaa22863267","video":null,"publish_date":"2025-12-17 00:59:20","author":"Stephen Bartholomeusz","authors":["Stephen Bartholomeusz"],"language":"en","category":"politics","source_country":"au","sentiment":-0.102},{"id":387316872,"title":"Trump Orders Blockade Of Sanctioned Oil Tankers In Venezuela","text":"President Donald Trump said he was ordering a “TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS” going into and leaving Venezuela, ratcheting up pressure on Caracas amid a US military buildup in the region and the threat of land strikes.“Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,” Trump wrote on social media Tuesday. “It will only get bigger, and the shock to them will be like nothing they have ever seen before — Until such time as they return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us.”Trump said he was also designating the regime of Venezuelan President Nicolas Maduro as a “FOREIGN TERRORIST ORGANIZATION.” And he accused the “illegitimate” regime of “using Oil from these stolen Oil Fields to finance themselves, Drug Terrorism, Human Trafficking, Murder, and Kidnapping.”Oil rose from the lowest level since 2021 on the US president’s post. West Texas Intermediate climbed above $56 a barrel after tumbling almost 6% over the previous four sessions. The move represents an escalation of the Trump administration’s pressure on Maduro, whom it has accused of presiding over a narco-trafficking operation. Last week, the US seized a sanctioned oil tanker off Venezuela’s coast.Earlier, an armada of four supertankers originally headed for Venezuela reversed course following the seizure of the sanctioned tanker, named The Skipper.The Pentagon has also conducted more than 20 strikes against purported drug-trafficking vessels in waters near Venezuela and Colombia, killing dozens, and Trump has suggested numerous times that the US could strike countries on land and that Maduro should be removed from power.The Maduro government has characterized the US actions as a grab for Venezuela’s oil reserves, the biggest in the world.The socialist-run country’s economy has been strained since Trump tightened oil-trading restrictions earlier this year. The government’s supply of dollars, almost all tied to crude sales, had already fallen 30% in the first ten months of 2025. The squeeze has pressured the exchange rate and driven up prices, with annual inflation expected to top 400% by year’s-end, according to private estimates from local economists who requested anonymity for fear of reprisal.While state oil company Petroleos de Venezuela SA, or PDVSA, controls the petroleum industry in the country, it works with international partners including Houston-based Chevron Corp. to drill in many parts of the country. Under the current arrangement, Chevron pays Venezuela a percentage of the oil it produces with PDVSA in joint ventures, under a license issued by the US Treasury that exempts the American company from sanctions.Chevron lowered the price of Venezuelan crude offered to US refiners following the seizure of The Skipper. The company’s operations in Venezuela continue in full compliance with laws and regulations applicable to its business, as well as the sanctions frameworks provided for by the US government, Chevron said in a statement at the time.In recent months, Maduro has called on his citizens to unite against what he said were US threats and to enlist in the citizen militia, which he says already has more than 8 million members. He’s also deployed troops, ships, aircraft and drones to the border with Colombia, some states in the coast and an island.Earlier this week, Maduro called the US seizure of the tanker “criminal and illegal.”White House Chief of Staff Susie Wiles, speaking in an interview with Vanity Fair published Tuesday, indicated that Trump’s motivations for his actions in Venezuela revolved around pressuring Maduro.Trump “wants to keep on blowing boats up until Maduro cries uncle,” she said. “And people way smarter than me on that say that he will.”.Why Donald Trump Is Suing BBC For $5 Billion: Controversy Over Panorama Documentary Explained","summary":"Oil rose from the lowest level since 2021 on the US president’s post.","url":"https://www.ndtvprofit.com/economy-finance/trump-orders-blockade-of-sanctioned-oil-tankers-in-venezuela","image":"https://media.assettype.com/bloombergquint/2025-12-17/80begug1/446075066.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 00:58:15","author":null,"language":"en","category":"politics","source_country":"in","sentiment":-0.248},{"id":387327770,"title":"Trump support drove wedge between former Mets star teammates, says sports radio star Mike Francesa","text":"New York sports radio icon Mike Francesa claims differing views on President Donald Trump created a divide within the Mets clubhouse. Francesa said on his podcast Tuesday that a feud between shortstop Francisco Lindor and outfielder Brandon Nimmo, who was recently traded to the Texas Rangers, was ignited by politics. Francesa did not disclose which player supported Trump and which didn't. \"The Nimmo-Lindor thing, my understanding, was political, had to do with Trump,\" Francesa said. \"One side liked Trump, one side didn’t like Trump.\" CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Francesa added, \"So, Trump splitting up between Nimmo and Lindor. That’s my understanding. It started over Trump… As crazy as that sounds, crazier things have happened.\" Fox News Digital has reached out to the Mets for a response. DODGERS LAND ALL-STAR CLOSER IN RECORD-BREAKING DEAL AFTER BACK-TO-BACK WORLD SERIES WINS: REPORTS Nimmo was traded to the Rangers on Nov. 23 after waiving the no-trade clause in his 8-year, $162 million contract earlier that month. The trade of Nimmo has been just one domino in a turbulent offseason for the Mets, which has also seen the departure of two other fan-favorites, first baseman Pete Alonso and closer Edwin Diaz. All three players had been staples in the Mets' last two playoff teams in 2022 and 2024, playing together as the team's core dating back to 2020. In return for Nimmo, the Rangers sent second baseman Marcus Semien to the Mets. Nimmo is 32 years old and is coming off a year that saw him hit a career-high in home runs with 25, while Semien is 35 and hit just 15 homers in 2025. CLICK HERE TO DOWNLOAD THE FOX NEWS APP Many of the MLB's high-profile free agents have already signed this offseason. The remaining players available include Kyle Tucker, Cody Bellinger, Bo Bichette and Framber Valdez. Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.","summary":"Sports radio host Mike Francesa claimed political differences over President Donald Trump caused a feud between Mets players Francisco Lindor and Brandon Nimmo.","url":"https://www.foxnews.com/sports/trump-support-drove-wedge-between-former-mets-star-teammates-says-sports-radio-star-mike-francesa","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/12/brandon-nimmo-and-francisco-lindor_trump_02.jpg","video":null,"publish_date":"2025-12-17 00:55:41","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":0.076},{"id":387315732,"title":"Trump expands US travel ban to include Syria, Palestine  - Bahamas Spectator – Bahamas &amp; Caribbean News,","text":"United States President Donald Trump has added five countries to the list of nations whose citizens are banned from entering the US, including Palestine and Syria.\n\nThe White House announced the expansion of the ban on Tuesday, as it intensifies its crackdown on immigration.\n\nTuesday’s order imposed a travel ban on six new countries – Palestine, Burkina Faso, Mali, Niger, South Sudan and Syria – in addition to the 12 initially made public in June.\n\nThe decree did not refer to Palestine, which Washington does not recognise as a state, by name or even as the occupied Palestinian territory.\n\nInstead, it describes the Palestine category as “Palestinian Authority Documents” and refers to Palestinians as “individuals attempting to travel on PA-issued or endorsed travel documents”.\n\nThe decision comes weeks after Trump declared a “permanent pause” on migration from what he called “all Third World Countries” in response to the shooting of two National Guard troops in Washington, DC.\n\n“Several US-designated terrorist groups operate actively in the West Bank or Gaza Strip and have murdered American citizens. Also, the recent war in these areas likely resulted in compromised vetting and screening abilities,” the White House said.\n\n“In light of these factors, and considering the weak or nonexistent control exercised over these areas by the PA, individuals attempting to travel on PA-issued or endorsed travel documents cannot currently be properly vetted and approved for entry into the United States.”\n\nDemocratic Congresswoman Rashida Tlaib, who is of Palestinian descent, slammed the ban, accusing Trump and his top aide Stephen Miller of pushing to alter the demographics of the country.\n\n“This administration’s racist cruelty knows no limits, expanding their travel ban to include even more African and Muslim-majority countries, even Palestinians fleeing a genocide,” she said in a social media post.\n\nThe move to ban Palestinians from entering the US comes as Israel continues its daily deadly attacks in Gaza and the occupied West Bank, where Israeli settlers have killed at least two US citizens this year.\n\nMeanwhile, the ban on Syrians coincides with rapprochement between Washington and Damascus after Syrian President Ahmed al-Sharaa visited the White House in November.\n\n“While the country is working to address its security challenges in close coordination with the United States, Syria still lacks an adequate central authority for issuing passports or civil documents and does not have appropriate screening and vetting measures,” the White House said.\n\nOn Thursday, US Director of National Intelligence Tulsi Gabbard cited the mass shooting that killed 15 people at a Jewish festival in Australia to laud Trump’s immigration restrictions.\n\n“Islamists and Islamism is the greatest threat to the freedom, security, and prosperity of the United States and the entire world. It is probably too late for Europe – and maybe Australia,” she wrote on X.\n\n“It is not too late for the United States of America. But it soon will be. Thankfully, President Trump has prioritized securing our borders and deporting known and suspected terrorists, and stopping mass, unvetted migration that puts Americans at risk.”\n\nTrump’s Republican allies have been increasingly using Islamophobic rhetoric, and calling for Muslims to be blocked from entering the country.\n\nOn Sunday, Senator Tommy Tuberville called Islam a “cult”, baselessly accusing Muslims of aiming to “conquer” the West.\n\n“Stop worrying about offending the pearl clutchers,” he wrote in a social media post. “We’ve got to SEND THEM HOME NOW or we’ll become the United Caliphate of America.”\n\nWhen Trump first ran for president in 2015, he called for a complete ban on Muslims entering the US, and when he started his first term, he imposed a travel ban on several Muslim-majority countries.","url":"https://bahamasspectator.com/trump-expands-us-travel-ban-to-include-syria-palestine/","image":"https://bahamasspectator.com/app/uploads/2025/12/ap_6932d1cfefa76-1764938192-QVbu0o.jpg","video":null,"publish_date":"2025-12-17 00:45:13","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":0.067},{"id":387315736,"title":"Trump orders ‘total’ blockade of sanctioned Venezuelan oil tankers  - Bahamas Spectator – Bahamas &amp;","text":"United States President Donald Trump has ordered “a total and complete” blockade of all sanctioned oil tankers entering and leaving Venezuela.\n\n“For the theft of our Assets, and many other reasons, including Terrorism, Drug Smuggling, and Human Trafficking, the Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION,” Trump wrote on Truth Social.\n\n“Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela,” he said.\n\nTrump’s comments come a week after US forces seized a sanctioned oil tanker off the coast of Venezuela and as Washington has ordered a huge build-up of US military forces off the Venezuelan coast in an operation said to target drug smuggling.\n\nThe US military has killed at least 90 people since September in attacks on dozens of vessels in the eastern Pacific Ocean and Caribbean Sea near Venezuela, in what international law experts have criticised as extrajudicial killings.\n\nWashington claimed the vessels were involved in drug trafficking but has provided no evidence to support its allegations.\n\nCaracas has long said the deployment of US forces to the region was aimed at allowing “external powers to rob Venezuela’s immeasurable oil and gas wealth“.\n\nDespite holding the world’s largest proven oil reserves, Venezuela has faced severe restrictions on its exports in recent years under US sanctions first imposed during the first Trump presidency.\n\nThis is a breaking news story. More to follow shortly.","url":"https://bahamasspectator.com/trump-orders-total-blockade-of-sanctioned-venezuelan-oil-tankers/","image":"https://bahamasspectator.com/app/uploads/2025/12/breaking-news@2x-1738224819-T5QaJV.png","video":null,"publish_date":"2025-12-17 00:45:07","author":"Cb_usr","authors":["Cb_usr"],"language":"en","category":"politics","source_country":"bs","sentiment":-0.153},{"id":387316846,"title":"Stock Market Today: All You Need To Know Going Into Trade On Dec. 17","text":"Good morning!The GIFT Nifty is trading marginally lower near 25,937 indicating a negative open for the benchmark Nifty 50.US and European index futures are trading lower during Asian trading hours.S&P 500 futures trade 0.08% lowerEuro Stoxx 50 futures trade 0.02% lower.India's benchmark indices extended losses for a third session on Tuesday, weighed down by a sharp depreciation in the Indian rupee and persistent outflows from foreign investors. Ongoing global uncertainties further dampened sentiment, keeping market participants cautious.The BSE Sensex shed 533.50 points, or 0.63%, to settle at 84,679.86, while the Nifty 50 closed 167.20 points or 0.64% lower at 25,860.10..Trade Setup For Dec. 17: Nifty Support Seen At 25,750 After Slipping For Three Sessions.Signs that the US jobs market is slowing — but not weakening sharply — kept traders from ramping up bets on near-term Federal Reserve rate cuts, weighing on stocks while bonds traded unevenly.Investors treated the data cautiously, with the release seen as distorted by lingering effects of the longest government shutdown in US history. The S&P 500 slid for a third consecutive session, while Treasury yields edged slightly lower. Interest-rate swaps point to just a 20% chance of a Fed cut in January, with a reduction now fully priced in by mid-2026..Asian stocks opened slightly lower after weak US jobs data failed to lift expectations of further interest-rate cuts by the Federal Reserve.MSCI’s regional equity index slipped 0.1%, marking a third straight day of declines. The cautious tone followed a mixed session on Wall Street, where the S&P 500 fell for a third consecutive day, while the Nasdaq 100 edged up 0.3%. Tesla Inc. shares dropped more than 1% in extended trading, after reports that its sales in California could be suspended for 30 days. US Treasuries and the dollar were little changed after slipping earlier in the session..Asian Stocks Slip After US Jobs Data, Oil Rises: Markets Wrap.Oil rebounded from its lowest level since 2021 after President Donald Trump stepped up pressure on Venezuela by ordering a blockade of oil tankers, even as concerns about a growing global supply glut continued to weigh on the market.West Texas Intermediate rose above $56 a barrel after sliding nearly 6% over the previous four sessions, while Brent settled just under $59. Trump said the US would block sanctioned oil vessels entering and leaving the South American nation, according to a social media post on Tuesday.Gold was little changed after weak US jobs data failed to shift expectations around further interest-rate cuts. Bullion hovered near $4,305 an ounce, following a modest drop in the previous session that ended a five-day rally. Recent data pointed to a cooling US labor market, though investors expect the Federal Reserve to place less emphasis on the figures due to distortions from the government shutdown..Finance Minister Nirmala Sitharaman to speak at India Economic Conclave in New DelhiPrime Minister Narendra Modi’s second day in Ethiopia, travels to Oman laterSEBI Chairman Tuhin Kanta Pandey to address media in Mumbai..Glenmark Pharma: Arm signed a pact with Hansoh pharma to develop and commercialise Aumolertinib. Aumolertinib is an inhibitor indicated to treat non-small cell lung cancer.NBCC: The company received an order worth Rs 345 crore order. The order is worth Rs 333 crore from IIT mandi for construction of academic blocks and another order worth Rs 12 crore from Kandia SEZ for annual maintenance work.Saregama India: The company to acquire 51% stake in Bhansali Productions in tranches by 2030. Bhansali Productions will exclusively sell all future films' music to the company.HCLTech: Partnered with NSE academy to deliver a series of joint certificate programs in tech, finance sectors.Protean eGov Tech: Board approved the acquisition of 4.95% stake in NSDL Payments Bank for Rs 30.2 crore.Thermax: Arm First Energy incorporated step-down arm First Energy 15.TCS: Arm ListEngage MidCo LLC forms wholly owned arms TCS North America Corp, Trident LE LLC in the US.Kaynes Tech: Arm Partners with Mitsui & Co, AOI Electronics to bolster semiconductor manufacturing operations in India.Waaree Renewable Tech: Signed long-term power purchase pact for 300 MW inter-state transmission system solar power project.Acme Solar: Arm commissioned additional capacity of 8MW out of 100 MW wind power project in Gujarat.Vikram Solar: The board approved capex worth Rs 4,371 crore for phase-1 of battery energy storage system roadmap. The capex worth Rs 4,371 crore to be undertaken via Arm VSL Powerhive. The capex to be funded via both equity and debt.NTPC Green Energy: Arm started commercial operations of 243.66 MW out of 1255 MW Khavda-I Solar PV Project in GujaratLupin: Nagpur Injectable unit received EIR report from US FDA with Voluntary Action Indicated classification. US FDA had inspected the Nagpur unit from Sept 8 to Sept 16.Ola Electric: Founder-promoter Bhavesh Agarwal undertaken a one-time monetisation of a small portion of his personal stake to fully repay a Rs 260-crore promoter-level loan, leading to the release of all previously pledged 3.93% shares. Post the transaction, the promoter will continue to hold up to 34% stake, with no dilution of control or long-term conviction. The action is taken to eliminate all promoter pledges, which can introduce avoidable risk and volatility. The transaction is being executed entirely at the promoter’s personal level and would have no impact on Ola Electric’s operations, governance, or strategic direction.Pace Digitek: Board approved the formation of three wholly owned subsidiaries.CESC: Arm signed pact with Toolfab for supply of Towers for wind turbine generators. The company supplies 91 towers for 300 MW wind power projects within 12 months.Diamond Power Infra: Received letter of Intent for Rs 57.6 crore order from Rajesh power for supply of cables.Ahluwalia Contracts: Received Rs 888 crore order from Bihar state tourism development Corp for EPC works. Received order for the construction of Ram Janmabhoomi tirtha Kshetra at Sitamarhi District.Coal India: Coal ministry extended additional charge for the post of Chairman, MD to B. Sairam for six Months.Wockhardt: Arm incorporated three wholly owned arms Wockhardt Swiss AG Wockhardt suisse USA holding Corp & Wockhardt Suisse USA.Niraj Cement Structurals: Received Rs 131 crore order from PWD for road maintenance works.GMM Pfaudler: Sold Hyderabad property for Rs 54.5 crore to Topsun Power.Kajaria Ceramics: Shareholders approved the appointment of Ashok Kajaria as Chairman and Rishi Kajaria as a Managing director.Aditya Birla Real Estate: Commission approved the acquisition of paper and pulp manufacturing business of Aditya Birla Real Estate by ITC.Can Fin Homes: The board approved interim dividend of Rs 7 per share for financial year 2026, sets Dec. 19 as record date.Eclerx: The company reduced buyback size to 6.3 lakh from 6.6 lakh declared earlier. The company increased share buyback price to Rs 4,800 per share from Rs 4,500 per share declared earlier.RailTel Corp: Received LoA for Rs 26.9 crore order to implement advanced IT infra at VO Chidambaranar Port.Waaree Energies: Arm incorporated two wholly owned arms Windora Energy & Agni Vayu Energy.Sequent Scientific: The board approved the appointment Of Haribabu Bodepudi as managing director and Group chief executive officer and Rajaram Narayanan as Wholetime director for two years.Indian Overseas Bank: The government to sell 38.5 crore shares (2% equity) with an oversubscription option of 19.2 crore shares. The government to sell up to 3% equity via OFS at a floor price of Rs 34 per share. .Buy, Sell Or Hold: Bharat Dynamics, Coal India, Restaurant Brands Asia, IREDA, ICICI Bank — Ask Profit.ICICI Prudential AMC: The public issue was subscribed to 39.17 times on day 3. The bids were led by Qualified institutional investors with 123.87 times the subscription, non-institutional investors who subscribed 22.04 times, retail investors with 2.53 times the subscription and Shareholders who subscribed 9.75 times.KSH International: The public issue was subscribed to 0.15 times on day 1. There were no bids were led by Qualified institutional investors, non-institutional investors who subscribed 0.06 times and retail investors who subscribed 0.27 times..Park Medi World: The public issue was subscribed to 8.52 times on day 3. The bids were led by Qualified institutional investors (12.07 times), non-institutional investors (15.93x), retail investors (3.32x).Nephrocare Health Services: The public issue was subscribed to 14.08 times on day 3. The bids were led by Qualified institutional investors (26.82 times), non-institutional investors (24.77 times), retail investors (2.36 times), Employees (2.81 times)..SBFC Finance: Massachusetts Institute of Technology – FDI sold 1.36 crore shares (1.25%), Tata Aia Life Insurance Company bought 82.31 lakh shares (0.77%), Aranda Investments bought 71.33 lakh shares (0.66%) at Rs 105.14 apiece at Rs 105.14 apiece.Gallantt Ispat: Gallantt Industry bought 12.07 lakh shares (0.5%) at Rs 590 apiece, while Krone Finstock Private Limited sold 12.07 lakh shares (0.5%) at Rs 590 apiece.Karnataka Bank: B Sumanthkumar Reddy bought 19.09 lakh shares (0.51%) at Rs 200.52 apiece.Ola Electric Mobility: Bhavish Aggarwal sold 2.62 crore shares (0.6%) at Rs 34.99 apiece. .Valuation Fears? Cash Holdings Of Top Mutual Funds Jump In November.Steel Exchange India: Promoter Umashiv Garments created a pledge for 1.45 crore shares. Promoter Vizag Profiles Private Limited created a pledge for 17.1 crore shares.Geojit Financial Services: Promoter BNP Paribas Sa sold 4.1 crore shares.Usha Martin: Promoter Peterhouse Investments sold 2 lakh shares.Jindal Drilling & Industries: Promoter Sudha Apparels Ltd bought 2.91 lakh shares..US Stock Market Today: Dow, S&P 500 Falter As Jobs Data Shows Sluggish Economy.List of securities shortlisted in Short-Term ASM Framework Stage - I: Shakti Pumps (India), Transformers and Rectifiers (India).Consolidated list of securities shortlisted in ASM Framework: Kaynes Technology India, Rico Auto Industries, Shakti Pumps (India), VLS Finance, Transformers and Rectifiers (India).Ex-buyback: eClerx Services.Ex-Rights Issue: Krishival FoodsBoard Meeting: GMR Power & Urban Infra (Fundraising), KPI Green Energy (Fundraising), Spandana Spoorty (Fund Raising), Urgo Capital (Fund Raising).Share to exit anchor Lock-in: Tenneco Clean Air (3%).US Oil Futures Drop Below $55 A Barrel For First Time Since 2021.Nifty December futures down to 25,932 at a premium of 72 points.Nifty December futures open interest up by 1.69%.Nifty Options on Dec 23: Maximum Call open interest at 27,000 and Maximum Put open interest at 25,000.Securities in ban period: Bandhan Bank..FPIs Continue Selling Spree, Sell Shares Worth Rs 2,382 Crore.Rupee ended at a record closing low of 91.03 against the US dollar. The local currency as of Tuesday, fell over 1% in the last five trading sessions.Rupee fell over 2.6% in the last one month, it also continues to be the worst performing Asian currency falling nearly 6% in 2025 so far..Silver Surge In 2025 Not Only Dwarfs Nifty, But Steals Gold's Glitter","summary":"Stocks in the news, big brokerage calls of the day, complete trade setup and much more.","url":"https://www.ndtvprofit.com/markets/stock-share-market-today-all-you-need-to-know-going-into-trade-on-december-17-2025-nse-nifty-50-bse-sensex","image":"https://media.assettype.com/bloombergquint/2025-06-21/nvh2gh5d/beautiful-cryptocurrwncy-concept.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true","video":null,"publish_date":"2025-12-17 00:30:00","author":"Vrathik Jain","authors":["Vrathik Jain"],"language":"en","source_country":"in","sentiment":-0.301},{"id":387319760,"title":"Trump orders blockade of ‘sanctioned oil tankers’ into Venezuela, ramping up pressure on Maduro","text":"WASHINGTON (AP) — President Donald Trump said Tuesday he is ordering a blockade of all “sanctioned oil tankers” into Venezuela, ramping up pressure on the country’s authoritarian leader Nicolás Maduro in a move that seemed designed to put a tighter chokehold on the South American country’s economy.\n\nTrump’s escalation comes after US forces last week seized an oil tanker off Venezuela’s coast, an unusual move that followed a buildup of military forces in the region. In a post on social media Tuesday night announcing the blockade, Trump alleged Venezuela was using oil to fund drug trafficking and other crimes and vowed to continue the military buildup until the country gave the U.S. oil, land and assets, though it was not clear why he felt the U.S. had a claim.\n\n“Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,” Trump said in a post on his social media platform. “It will only get bigger, and the shock to them will be like nothing they have ever seen before — Until such time as they return to the United States of America all of the Oil, Land, and other Assets that they previously stole from us.”\n\nThe buildup has been accompanied by a series of military strikes on boats in international waters in the Caribbean and eastern Pacific. The campaign, which has drawn bipartisan scrutiny among U.S. lawmakers, has killed at least 95 people in 25 known strikes on vessels.\n\nThe Trump administration has defended it as a success, saying it has prevented drugs from reaching American shores, and they pushed back on concerns that it is stretching the bounds of lawful warfare.\n\nThe Trump administration has said the campaign is about stopping drugs headed to the U.S., but Trump’s chief of staff Susie Wiles appeared to confirm in a Vanity Fair interview published Tuesday that the campaign is part of a push to oust Maduro.\n\nWiles said Trump “wants to keep on blowing boats up until Maduro cries uncle.”\n\nTuesday night’s announcement seemed to have a similar aim.\n\nVenezuela, which has the world’s largest proven oil reserves and produces about 1 million barrels a day, has long relied on oil revenue as a lifeblood of its economy.\n\nSince the Trump administration began imposing oil sanctions on Venezuela in 2017, Maduro’s government has relied on a shadowy fleet of unflagged tankers to smuggle crude into global supply chains.","summary":"Trump's escalation comes after US forces last week seized an oil tanker off Venezuela’s coast, an unusual move that followed a buildup of military forces in the region. \n\n\nThe post Trump orders blockade of &#8216;sanctioned oil tankers&#8217; into Venezuela, ramping up pressure on Maduro appeared first on Boston.com.","url":"https://www.boston.com/news/politics/2025/12/16/trump-orders-blockade-of-sanctioned-oil-tankers-into-venezuela-ramping-up-pressure-on-maduro/","image":"https://bdc2020.o0bc.com/wp-content/uploads/2025/12/Trump_56183-6940e1b948ada-768x432.jpg","video":null,"publish_date":"2025-12-17 00:24:05","author":"Associated Press","authors":["Associated Press"],"language":"en","category":"politics","source_country":"US","sentiment":0.217},{"id":387315884,"title":"Trump orders ‘total’ blockade of sanctioned Venezuela oil tankers","text":"United States President Donald Trump has ordered “a total and complete” blockade of all US-sanctioned oil tankers entering and leaving Venezuela.\n\n“Venezuela is completely surrounded by the largest Armada ever assembled in the History of South America,” Trump said in a post on his social media platform Truth Social on Tuesday evening.\n\n“For the theft of our Assets, and many other reasons, including Terrorism, Drug Smuggling, and Human Trafficking, the Venezuelan Regime has been designated a FOREIGN TERRORIST ORGANIZATION,” Trump said.\n\n“Therefore, today, I am ordering A TOTAL AND COMPLETE BLOCKADE OF ALL SANCTIONED OIL TANKERS going into, and out of, Venezuela,” he said.\n\nThe Venezuelan government issued a statement in response to the announced blockade saying it rejected Trump’s “grotesque threat”.\n\nEarlier, Venezuela’s President Nicolas Maduro said “the world will rise up against piracy and oil plunder” over the US administration’s “theft” last week of a tanker vessel carrying Venezuelan crude oil, the Agencia Venezuela News site reported.\n\nUS forces seized the Skipper oil tanker off the coast of Venezuela and were reported to have brought the vessel to the US state of Texas to unload its oil cargo.\n\nUS Congress Joaquin Castro, a Democrat representing Texas, called Trump’s blockade plan “unquestionably an act of war.”\n\n“A war that the Congress never authorized and the American people do not want,” Castro said in a post on social media.\n\nCastro added that US lawmakers will have an opportunity on Thursday to vote on a resolution “directing the President to end hostilities with Venezuela”.\n\n“Every member of the House of Representatives will have the opportunity to decide if they support sending Americans into yet another regime change war,” Castro said.\n\nVenezuela turns to UNSC for help\n\nTrump’s blockade comes amid a huge buildup of US military forces off the Venezuelan coast, in an operation said to target drug smuggling.\n\nThe US military has killed at least 90 people since September in attacks on dozens of vessels in the eastern Pacific Ocean and Caribbean Sea near Venezuela, in what international law experts have criticised as extrajudicial killings.\n\nWashington claimed the vessels were involved in drug trafficking but has provided no evidence to support its allegations.\n\nVenezuela’s United Nations representative, Samuel Moncada, delivered a letter to the President of the UN Security Council (UNSC) on Wednesday, “formally denouncing” the US seizing Venezuela’s Skipper oil tanker last week and “kidnapping” its crew.\n\n“This is an act of state piracy carried out through the use of military force, which constitutes a blatant theft of assets that do not belong to the United States of America, but are part of the legitimate international trade of a member state of the United Nations,” the letter stated.\n\nThe Reuters news agency has reported that only tankers chartered by US oil giant Chevron had left Venezuela’s ports and sailed into international waters carrying Venezuelan crude since the seizure of the Skipper. Chevron has US government authorisation to operate in Venezuela through joint ventures with state-run oil company PDVSA and can export its oil to the US, Reuters reported.\n\nStrict US sanctions on Venezuelan oil exports, imposed during Trump’s first administration and tightened at the beginning of his second term, have added to the country’s dire economic struggles.\n\nEarlier this month, a US court also ordered the forced sale of Venezuelan oil company Citgo in the US to pay off billions of dollars in debts.\n\nOfficials in Caracas have said for months that the deployment of US forces to the region was aimed at allowing “external powers to rob Venezuela’s immeasurable oil and gas wealth“. The South American country holds the world’s largest proven oil reserves.","summary":"The order comes a week after the US military seized an oil tanker off Venezuela&#039;s coast.","url":"https://www.aljazeera.com/news/2025/12/17/trump-orders-total-blockade-of-sanctioned-venezuelan-oil-tankers?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/11/AFP__20250808__692V79U__v1__HighRes__ComboUsVenezuelaPoliticsTrumpMaduro-1762158474.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-12-17 00:11:26","author":"Apps Support,Lyndal Rowlands","authors":["Apps Support","Lyndal Rowlands"],"language":"en","category":"politics","source_country":"QA","sentiment":-0.375},{"id":387328470,"title":"Trump to sign order easing restrictions on marijuana this week, media reports say","text":"Dec 17 (Reuters) - U.S. President Donald Trump is expected to sign an executive order on Thursday reclassifying marijuana to ease federal restrictions, according to CNN, which cited a source familiar with the planning and a senior White House official. The official added that the timing could shift, CNN reported late on Tuesday. NBC, citing four people with direct knowledge of the plans, said the order would fast-track the reclassification and could come as soon as this week. Representatives for the White House did not immediately respond to a Reuters request for comment. Trump told reporters on Monday he was considering the move, sending shares of cannabis-related companies higher. Such companies include Cronos Group, SNDL, Aurora Cannabis, Tilray Brands, Canopy Growth, Organigram Global and Trulieve Cannabis. Under the U.S. Controlled Substances Act, marijuana is listed as a Schedule I substance like heroin, ecstasy and peyote, implying it has a high potential for abuse and no currently accepted medical applications. The Department of Health and Human Services, under the previous Biden administration, recommended moving marijuana to the Schedule III classification that includes drugs such as Tylenol mixed with codeine, ketamine and testosterone. The federal Drug Enforcement Administration must review the recommendation and will decide on reclassification, which could potentially lower taxes for the industry and make it easier to secure funding. Local authorities in some regions of the United States have already loosened regulations on marijuana, allowing medical or recreational use. (Reporting by Christian Martinez, Bhargav Acharya and Susan Heavey; editing by Jasper Ward and Mark Heinrich)","url":"https://www.marketscreener.com/news/trump-expected-to-sign-executive-order-to-fast-track-reclassification-of-cannabis-nbc-news-reports-ce7d50ded18ef221","image":"https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-12/2025-12-15T083512Z_1_LYNXMPELBE0E7_RTROPTP_4_USA-CANNABIS-STOCKS.JPG","video":null,"publish_date":"2025-12-17 00:08:28","author":"Reuters","authors":["Reuters"],"language":"en","category":"politics","source_country":"fr","sentiment":-0.436},{"id":387314634,"title":"OTTI’S EDUCATION REFORMS AND GLOBAL ECONOMIC OPPORTUNITIES ","text":"Otti’s strategic education policy can lead to refining of semiconductors and advanced technologies that is more rewarding, argues\n\n CHUKWUEMEKA UWANAKA \n\n“In terms of partnership, we don’t believe in grants and aid, rather we seek partnership, believing that there is a lot of value that we can add working together” Gov. Otti (September 26, 2025) \n\nThe quote above by Governor Alex Otti of Abia State, during the September 2025 two-day visit by the United States of America (U.S.) Ambassador to Nigeria, Ambassador Richard Mills alongside U.S. Embassy officials to Abia State, provides some context on how the state government’s education sector reforms can align the state with contemporary global economic opportunities, if strategically matched. Given the contemporary changes in U.S. foreign policy on the continent from development assistance to more commercial diplomacy, as well as changes in the domestic environment, there also exists an opportunity for Gov. Otti to nudge the people and economy of the state towards a more intellectually driven and rewarding pathway.\n\nBut what were key points of U.S. Ambassador’s visit to Abia State? \n\nWhile acknowledging the positive outcomes from Gov. Otti’s governance approach, as well as the high value the U.S. places on its partnership with Abia and the Southeast zone of Nigeria, Ambassador Mills emphasized that he was in the state to explore existing opportunities in the state, and deepen partnerships. In his words, ‘there are tremendous opportunities here for our business, our commercial interests, and Nigeria’s’.\n\nAnd some of the key points of the visit demonstrated this focus on economic diplomacy, in line with foreign policy goals of U.S. President, Donald Trump. The delegation visited the Aba Independent Power Project (IPP), developed by Geometric Power, Nigeria’s only integrated electric power company. Facilities inspected by the American delegation included Geometric Power turbines produced by U.S. firm General Electric (GE), the world’s biggest and oldest electricity equipment manufacturing firm, as well as the Aba IPP digital SCADA facilities.\n\nWhat then does this pattern of economic diplomacy and focus on technology-based products and services have to do with Otti’s education sector reforms in Abia State?\n\nThe recent mid-2025 reports by the Semiconductor Industry Association (SIA), Deloitte and Mckinsey on global semiconductor labour gaps, provide global economic opportunities that Gov. Otti’s education sector reforms can strategically harness, for efficient return on investment (ROI). The high points of the reports are that by 2030, the global semiconductor industry will require additional one million skilled workers, which by current trends, are not available. The reports highlight a shortage of 67,000 workers in the U.S. , a shortage of over 100,000 engineers in Europe, and a shortfall of over 200,000 engineers in the Asia-Pacific region. Also, the industry will require at least 100,000 middle-tier managers and 10,000 higher-tier leaders—many of whom must come from outside the industry, all by 2030.\n\nWhile U.S.-based companies hold roughly 46.3 percent of global semiconductor market share, they handle 12 percent of global manufacturing, with Taiwan handling 65 percent, China 15 percent, and South Korea 12 percent, as demonstration of manufacturing concentration. This concentration is also as each global region has developed different skill sets, making it challenging for human resource mobility across markets. The industry also competes with other tech sectors for talent, and 92 percent of tech leaders report challenges finding skilled workers. Essentially, while markets are expanding, with global semiconductor sales rising to $627.6 billion in 2024, and demand continues to rise to an expected $2 trillion in 2032, the talent pool is shrinking.\n\nIt is this challenging but viable human resource gap that provides avenues for closer economic partnerships with the U.S., as well as global economic opportunities for the people and economy of Abia State, if Gov. Otti is able to strategically align his education sector reforms accordingly. For a bit of context, China had $438.7 billion, Taiwan $116.3 billion and South Korea $131.6 billion worth of exports respectively to the U.S. in 2024, consisting largely of semiconductor-based and high-tech products such as integrated circuits, computers, electronic accessories, machine parts, broadcast equipments, electricals, motor vehicles & accessories. These countries are able to attract the type of significant investment and access to U.S.$30 trillion economy that Gov. Otti desires for Abia, because it has the human resource and subsequently industrial base that competitively manufactures high-tech products for the U.S.\n\nIn principle, aligning the state’s educational sector towards producing some of the skilled human talent required by the global semiconductor industry by 2030, is a viable proposition. As it is with such tasking propositions, there can be short, medium and long term approaches. For short-medium term, the Core Curriculum Minimum Academic Standard (CCMAS) and Trans-National Education (TNE) policies of 2023 by the National Universities Commission (NUC), provide the policy framework for training and international linkages that allow for training of tertiary education students in Abia, with skill set at the level required by semiconductor industry.\n\nAs CCMAS allows universities to enhance their curricula with some level of specialization, the Abia government can pool resources with public and private universities in the state, and modify relevant curriculum in engineering and computing, to meet the training standards of global semiconductor industry. With the TNE policy, the state government can establish cost-effective partnerships with foreign universities such as the National Taiwan University (NTU), whereby qualified students from Abia are also enrolled in the Global Undergraduate Program in Semiconductors (GUPS) at NTU, for joint-degrees. Virtual labs can be deployed for training.\n\nAlso, bulk negotiation with NTU on GUPS for Abia students will bring discount, as Taiwan, encourages educational diplomacy. Furthermore, provision can be made for the trade test certification of skilled tech talent involved in tech repairs, to be converted to some level of academic credit as prior learning, for efficient enrollment into the GUPS.\n\nGiven the costs involved, a more feasible short-medium term approach may require pooling the engineering, computing, mathematics and physics students with the best test scores from Abia State University (ABSU), Rhema University, Clifford University, Spiritan University and Gregory University – established by the founder of Skill ‘G’, a leading science, technology and innovation firm, at a central hub possibly provided by Skill G. At this location, training will be provided in chip design, silicon assembling, packaging, testing and other determined fields of semiconductor. The students selected via test scores from their first two years of study, can spend most of the remaining 2-3 years of study on practical learning and industrial attachment at this up-scaled facility, after which they will be awarded their degrees.\n\nSkill G has a good record in tech training, development and deployment. Its partnership with Israeli firms comes in handy, given that Israel is one of the leading countries in semiconductors, especially in chip design, R&D and manufacturing equipment. Annapurna Labs, which is the semiconductor arm of Amazon Inc, is originally an Israeli company that was acquired by the $2.4 trillion U.S. tech giant, and is a demonstration of Israel’s strength in the global semiconductor industry. Gov. Otti’s hosting of Israeli Ambassador to Nigeria Michael Freeman in May 2024 in Abia, where partnership opportunities for Abians and Israelis were explored, provides an official platform for cost-effective upgrading of existing Skill G facilities with equipment and training pathways for the training of Abia students in semiconductor areas, and work placement for the graduates.\n\nAbia has experienced semiconductor and technology professionals who can coordinate this proposition. There is Prof. Ndubisi Ekekwe, academic, engineer, founder of the Intel FGPA certified semiconductor firm FASMICRO, who has supported other countries in semiconductor development, and holds industry patents. There is also Chinenye Mba-Uzoukwu, former Microsoft General Manager (Anglophone West Africa) overseeing a seven-country portfolio as a member of the Microsoft EMEA executive management team, who is currently Principal Secretary and Chief Strategy Officer to Governor Otti. Though Gov. Otti had both appointed them to the leadership of Abia State Technological Skills Acquisition Center in September 2025, a lot more can be done with their skills and experience.\n\nAs sustainable long-term pathways requires reforms at feeder system, the May 2025 recruitment of 5,300 teachers and lecturers, and plans announced by the state in July 2025 to recruit 4,000 more teachers due to a surge in education demand, should be strategically aligned with some emphasis on producing semiconductor talent. An exchange program can be infused into both the recruitment and education system that enables a minimum of 10 percent of teachers to be recruited from Taiwan, Israel, South Korea, Vietnam, India and China, i.e from countries that have functional semiconductor industry. There are people from these and other educationally advanced countries that desire international teaching and gap year life experience, to support knowledge sharing and train-the-trainers opportunities. \n\nDr. Kalu Idika Kalu (KIK), Nigeria’s former Finance Minister, can support the Abia government in establishing official and economic linkages with some of these strategic Asian countries. He served as the World Bank Country Economist in the East Asia and Pacific Programme Department covering the Division that included China, Japan, Korea, Taiwan, and Hong Kong. In his almost a decade stint, he supported the economic policy and governance initiatives of these countries that enhanced their integration and economic partnerships with the U.S.- similar to what Gov. Otti is aiming for.\n\nAnd ‘culture eats strategy for breakfast’, as popularly emphasized in business strategy. Semiconductor education and training are very competitive, and require an educational culture that is already competitive to be feasible. Abia’s high national cutoff mark for national examinations is one of the indicators of its competitive education culture. Abians have similar intense work, study ethic and business acumen (hustle culture) as Taiwanese, South Koreans, Indians, Chinese, so it is a viable concept. The founders and CEOs of leading semiconductor and tech firms TSMC, Nvidia, AMD, Google, IBM and Microsoft, such as Dr. Morris Chang, Jensen Huang, Dr. Lisa Su, Sundai Pichai, Dr. Arvind Krishna and Satya Nadella, have origins from Taiwan and India. \n\nOtti has the expanded worldview and experience to lead in this new vision and iteration for Abia. The Geometric Power Project that was one of the key events during USA Ambassador visit to Abia was a project Otti was involved in its financing during his banking career. Similar to how he evaluated business plans as a banker, his educational policy should be a social investment that targets certain market gaps, in this case global semiconductor industry, for sufficient ROI. Similar to how certain trade and economic patterns evolved among for example Abiriba businesses that gave them a profitable worldview, Otti’s strategic education policy can lead to an iteration of new worldview on semiconductors and advanced technologies that are more rewarding.\n\nAnd Gov. Otti should be able to personally relate to pathways. The BOFID Decree 25 of 1991 was part of structural economic policies designed by Dr. KIK and others. This policy framework created Nigeria’s current liberal financial industry for the likes of Zenith Bank, Fidelity Bank, UBA, Access and Diamond Bank, where Otti was CEO. Otti continued his trajectory in founding Signature Bank, which launched operations on November 21, 2022. Similar to how Signature Bank had the 40 million unbanked and underbanked Nigerians as its market gap, the one million semiconductor industry human resource gap by 2030, is a market gap Otti should prepare Abia residents to harness.\n\nAs Tim Cook, the CEO of U.S. tech giant Apple Inc explained, the manufacturing and supply chain investment of America’s second largest company in China is due to the large talent pool of engineers and technology specialization in China, not necessarily because of cheap labor. This talent pool was developed through the strategic education and socioeconomic policies of Deng Xiaoping as leader of China, and sustained by successors. The pattern is similar for South Korea, Taiwan and other countries, who have billions in positive trade relations with the $30 trillion U.S. economy. This is largely through semiconductor-based supply chain products such as integrated circuits, computers, electronic accessories, machine parts, broadcast equipment, electricals, motor vehicles & accessories. Therefore, one of the major avenues for Gov. Otti to achieve his desired increased U.S. investment in Abia is through strategic education policy and programs, that develop a quantum of high skilled tech talent. With the recent Semiconductor Industry Association report identifying a human resource gap of one million by 2030, the onus is on Gov. Otti to align his current education policies to produce talent that meets global semiconductor needs. That way, his aspiration of attracting more investment from major U.S. companies- not foreign aid, becomes more feasible.\n\nDr. Uwanaka writes from African University of Science and Technology, Abuja. chukweks@yahoo.com","summary":"Otti’s&#160;strategic education policy can lead to&#160;refining of&#160;semiconductors and advanced technologies that&#160;is&#160;more rewarding, argues &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;CHUKWUEMEKA UWANAKA &#160; “In terms of partnership, we don’t believe in grants and aid, rather we seek","url":"https://www.thisdaylive.com/2025/12/17/ottis-education-reforms-and-global-economic-opportunities/","image":"https://global.ariseplay.com/amg/www.thisdaylive.com/uploads/Alex-Otti-7.jpg","video":null,"publish_date":"2025-12-16 23:40:13","author":"Adeyinka Salami,Governor Alex Otti","authors":["Adeyinka Salami","Governor Alex Otti"],"language":"en","category":"business","source_country":"ng","sentiment":0.083},{"id":387318088,"title":"Trump bars Palestinians 'with PA-issued travel document' from entering U.S.","text":"U.S. President Donald Trump barred Palestinians from entering the United States, the White House said on X. According to the White House, Trump \"signed a Proclamation further restricting and limiting the entry of foreign nationals to protect the security of the United States.\"","summary":"The new proclamation cites the Palestinian Authority's 'weak or nonexistent control,' adding that 'several U.S.-designated terrorist groups operate actively in the West Bank or Gaza Strip and have murdered American citizens'","url":"https://www.haaretz.com/us-news/2025-12-17/ty-article/trump-bars-palestinians-with-pa-issued-travel-document-from-entering-u-s/0000019b-2907-d5c5-a3df-bfe780670000","image":"https://img.haarets.co.il/bs/0000019a-2630-d4d3-a3fa-6f7589e30004/f9/17/80ce5cad4df9942fac7b393506e4/435799-2.jpg?precrop=1603,1603,x0,y0","video":null,"publish_date":"2025-12-16 22:45:27","author":"Ben Samuels","authors":["Ben Samuels"],"language":"en","category":"politics","source_country":"il","sentiment":-0.215},{"id":387317660,"title":"Don Lemon Goes Ballistic and Claims Trump Has a 'Small' Manhood in Vicious Takedown Following Prez's 'Vile' Response to Rob Reiner's Death","text":"Don Lemon has once again made his feelings about Donald Trump very clear, accusing the president of having a \"small p----,\" RadarOnline.com can reveal.\n\nThe former CNN personality went off on the controversial politician following his \"vile\" response after Rob Reiner and his wife, Michele, were found dead inside his home.What Did Don Lemon Say About Donald Trump?\"You know what, Donald Trump? F--- you,\" Lemon raged on an episode of his show, The Don Lemon Show. \"Just f--- all the way off. What an a----- and a small-minded, small d--- s--- to do. You are an immature child. You are a bigot, a f------ racist, and a small p---- a------\"\n\nThe 59-year-old then branded Trump \"hateful and delusional.\" Lemon then mentioned Charlie Kirk and claimed the 79-year-old was \"grifting\" off the activist's death.\n\n\"You don't give a s--- about respecting someone when they die... You don't care. You care about yourself,\" Lemon added. \"You care about yourself. And you are preaching and promoting hate. It's just vile. It makes me sick that you are president of the United States. It's embarrassing. You are embarrassing to this country.\"\n\nLemon even took it a step further, claiming Trump's voice sounds like he's \"vomiting every time you talk.\"Donald Trump Branded a 'High School Bully'\"And then you wonder where all the hate comes from in this country? It comes from you,\" Lemon continued. \"You are the promoter of hate in this country... You have zero respect for the office you hold... f--- you. Piece of s---.\"\n\nViewers in the comments section were quick to agree with Lemon, as one ranted, \"He is a high school bully, with laughably obvious self-esteem issues, who feels the need to constantly tear people down to make himself feel better about his inadequacies.\"\n\nAnother added, \"He needs to resign. The narcissistic, corrupt excuse for a human in office is an absolute embarrassment,\" and one reacted, \"Today Don Lemon speaks for me because I’m so tired of this bulls---.\"\n\nAfter the iconic director and his wife were found slaughtered, Trump took to Truth Social to respond, in a statement that shook social media.Donald Trump's 'Vile' Statement About Rob Reiner's Death\"Rob Reiner, a tortured and struggling, but once very talented movie director and comedy star, has passed away, together with his wife, Michele, reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease known as TRUMP DERANGEMENT SYNDROME, sometimes referred to as TDS,\" the former reality star blasted on the conservative platform.\n\nTrump then claimed the Stand By Me director drove \"people CRAZY by his raging obsession of President Donald J. Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before.\"\n\n\"May Rob and Michele rest in peace!\" he concluded his statement.\n\nCritics tore apart Trump's response, including a statement from former MAGA mouthpiece, Marjorie Taylor Greene, who begged the president to have \"empathy.\"Marjorie Taylor Greene Slams Donald Trump\"Rob Reiner and his wife were tragically killed at the hands of their own son, who reportedly had a drug addiction and other issues, and their remaining children are left in serious mourning and heartbreak,\" Greene said on X. \"This is a family tragedy, not about politics or political enemies.\"\n\nShe added: \"Many families deal with a family member with drug addiction and mental health issues,\" and that, \"It’s incredibly difficult and should be met with empathy, especially when it ends in murder.\"\n\nTrump later defended his comments, calling Reiner \"very bad for our country.\"After Reiner and his wife's lifeless bodies were found inside their California mansion, their troubled and former drug addict son, Nick, was arrested for their murder.\n\nHe is expected to be charged with two counts of first-degree murder with a special allegation that he used a knife.","summary":"Don Lemon is clearly no fan of Donald Trump, as he destroyed the president following his sick comments about Rob Reiner.","url":"https://radaronline.com/p/don-lemon-trump-rant-video-manhood-rob-reiner-death/","image":"https://media.radaronline.com/brand-img/0BtY_OZrX/0x0/don-lemon-donald-trump-rant2-1765921519755.jpg","video":null,"publish_date":"2025-12-16 22:45:00","author":"Bryan Brunati","authors":["Bryan Brunati"],"language":"en","source_country":"us","sentiment":-0.296},{"id":387314142,"title":"Rob Reiner’s son Nick Reiner to be charged with murdering his parents","text":"Nick Reiner will be charged with murdering his parents, Hollywood director Rob and his photographer wife Michele, Los Angeles County district attorney Nathan Hochman said.\n\nThe pair were found dead from apparent stab wounds in their home in Brentwood, Los Angeles, on Sunday.\n\nTheir son Nick, 32, was arrested on suspicion of the killing and taken into custody later that night.\n\nSpeaking at a press conference on Tuesday, Mr Hochman said: “Today, I’m here to announce that our office will be filing charges against Nick Reiner, who is accused of killing his parents, actor director Rob Reiner and photographer producer Michele Singer Reiner.\n\n“These charges will be two counts of first degree murder with a special circumstance of multiple murders.\n\n“He also faces a special allegation that he personally used a dangerous and deadly weapon, that being a knife.\n\n“These charges carry a maximum sentence of life in prison without the possibility parole or the death penalty.\n\n“No decision at this point has been made with respect to the death penalty.”\n\nHe added: “Currently, Nick Reiner is being held without bail.”\n\nMr Hochman said once the charges are filed on Tuesday afternoon and after he has gone through medical clearance, Nick Reiner will be brought to court where he will be arraigned and will enter his pleas.\n\nHe added: “Now, prosecuting these cases involving family members are some of the most challenging and most heart-wrenching cases that this office faces because of the intimate and often brutal nature of the crimes involved.”\n\nPaying tribute to the victims, Mr Hochman said: “Rob Reiner was a brilliant actor and director, an iconic force in our entertainment industry for decades.\n\n“His wife, Michele Singer Reiner was an equally iconic photographer and producer.\n\n“Their loss is beyond tragic, and we will commit ourselves to bringing their murderer to justice.”\n\nReiner, who turned 78 in March, has long been one of the most prolific directors in Hollywood and his work includes some of the most memorable films of the 1980s and 1990s, including This Is Spinal Tap, A Few Good Men, When Harry Met Sally and The Princess Bride.\n\nNick worked with his father on the 2016 film Being Charlie, which was loosely inspired on Nick’s experience of addiction and attending rehab.\n\nThe film, which he co-wrote, was directed by Rob and follows the son of a US governor, Charlie, played by Nick Robinson, as he battles with drug abuse.\n\nIn an interview with US publication People Magazine, Nick explained that the film was not about him, however parts of the story he had experienced himself including going to rehab throughout his teenage years and his own experiences of homelessness and spending “weeks” on the streets for refusing to return to a rehab facility.\n\nTributes have poured in for the couple including from former US president Barack Obama, former US House of Representatives speaker Nancy Pelosi, and singer Sir Elton John, who featured in the sequel to his 1984 mockumentary film Spinal Tap, Spinal Tap II: The End Continues, released in September this year.\n\nFormer US first lady Michelle Obama has said she and her husband Barack were meant to see the couple the night they were killed.\n\nSpeaking on Jimmy Kimmel Live, Ms Obama said: “We’ve known them for many, many years, and we were supposed to be seeing them that night.\n\n“Let me just say this, unlike some people, Rob and Michele Reiner are some of the most decent, courageous people you ever want to know.”\n\nShe added: “They were the kind of people who were ready to put their actions behind what they cared about, and they cared about their family, and they cared about this country, and they cared about fairness and equity, and that is the truth. I do know them.”\n\nHer comments come after US President Donald Trump criticised the Reiners and alleged that their deaths were politically motivated.\n\nIn a post on Truth Social, Mr Trump suggested Rob and Michele Reiner died “reportedly due to the anger he caused others through his massive, unyielding and incurable affliction with a mind crippling disease known as Trump derangement syndrome”.\n\nMr Trump added: “He was known to have driven people crazy by his raging obsession of President Donald J Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness, and with the Golden Age of America upon us, perhaps like never before.\n\n“May Rob and Michele rest in peace!”","summary":"The pair were found dead from apparent stab wounds in their home in Brentwood, Los Angeles, on Sunday.","url":"https://www.standard.co.uk/culture/film/barack-obama-los-angeles-nick-robinson-nancy-pelosi-brentwood-b1262870.html","image":"https://static.standard.co.uk/2025/12/16/21/d34926811c1454140448cccb74d4cbb1Y29udGVudHNlYXJjaGFwaSwxNzY2MDA2OTk3-2.82804745.jpg?width=1200","video":null,"publish_date":"2025-12-16 22:23:07","author":"Rosie Shead","authors":["Rosie Shead"],"language":"en","source_country":"GB","sentiment":0.18},{"id":387313484,"title":"Rob Reiner was more than a Hollywood legend. He helped shape California politics","text":"This story was originally published by CalMatters. Sign up for their newsletters.\n\nThe rest of the country may remember Hollywood legend Rob Reiner for his work in front of and behind the camera, but in California, he leaves behind a political legacy that endures beyond his films and movie and television roles.\n\nReiner, a longtime Democratic activist, donor and fundraiser, played a critical role in the legalization of same-sex marriage in California, and he was a driving force behind California’s signature early-childhood development program, First 5. \n\nReiner, 78, was found stabbed to death along with his wife, Michele Singer Reiner, inside their Brentwood home Sunday. \n\nPolice investigators announced Monday that their son Nick Reiner, 32, had been arrested and was being held on suspicion of their murder. Rob and Nick Reiner once worked together on a semi-autobiographical film about Nick Reiner’s lifelong struggles with addiction.\n\n“I can’t believe it,” former California Gov. Gray Davis told CalMatters on Monday in a phone interview. “I mean, Rob and Michele have been part of Sharon and I’s life for over 30 years.” Sharon Davis is the former governor’s wife.\n\nDavis said he’ll never forget when Rob Reiner in 1991 invited him — then California’s elected controller — to hang out on the set of Reiner’s “A Few Good Men.” Davis got to watch for hours as actors such as Tom Cruise, Kevin Bacon, Demi Moore and Jack Nicholson did their scenes.“I thought: I am so proud to live in a state where quality filmmaking takes place,” Davis said. \n\nBut a few years later, the two became something akin to coworkers. Davis was elected governor the same night in 1998 that Reiner’s Proposition 10 ballot initiative passed. The initiative created a new tax on tobacco that funded the programs for children younger than 5 that are now in every California county.\n\nDavis said the two were at the same Election Night party in 1998 as the results came in. Davis said he and his administration later worked with Reiner to ensure the First 5 program got implemented. Davis appointed Reiner to chair the program’s California Children and Families Commission, a position he held until 2006. Reiner resigned amid allegations he was using taxpayer funds to promote his Proposition 82, an unsuccessful ballot initiative that sought to tax the wealthy to fund preschool for all children.\n\n“Rob was not just a talker. He was a doer,” Davis said. “A lot of other people would give a nice speech, they would come to a press conference and then they thought their job was over, and certainly we appreciate that. I mean, they have other things to do. But the difference was Rob called you up and said, ‘What can I do next?’ ”\n\nMike Roos, a former California legislator, political strategist and lobbyist, worked closely with Reiner on the Prop. 10 campaign. He said they got to know each other, and it was clear to Roos that Reiner loved his children dearly.“This has been just one of the most horrible things I could ever imagine, knowing him and knowing his love and the investment that he made in every one of those kids in that family,” Roos said, “but particularly how he cared and talked so thoughtfully about the struggles that Nick had in that period of time when I knew him.”\n\nLater, Reiner would help found the American Foundation for Equal Rights. The group paid for the legal fight against Proposition 8, the 2008 ballot measure that banned same-sex marriage in California. The U.S. Supreme Court overturned Prop. 8 in 2013. \n\nKris Perry, the former executive director of First 5 and a lead plaintiff in the case that got Prop. 8 overturned, said Rob and Michele Reiner also stood by her and her wife, Sandy Stier, as they and the other plaintiffs defended their right to marry in the landmark case. \n\n“They continued over a five-year period to champion the cause by speaking out themselves, bringing more support to the case, doing media interviews, and, more importantly, being kind and generous … year after year after year,” Perry said. “They cared about us as people throughout that entire process. They left this indelible impression on all of us of what it means to be a real leader, to not only make something possible, but to stand beside people during the fight.”\n\nShe said Reiner wasn’t just a figurehead at First 5, either. He attended Children and Families Commission meetings every month and was deeply involved in discussions of “how to invest, where to get results, how to hold people accountable,” she said.\n\nGov. Gavin Newsom over the weekend said Reiner’s impressive body of professional work, which included “When Harry Met Sally,” “Stand By Me” and “The Princess Bride,” taught “generations how to see goodness and righteousness in others — and (encouraged) us to dream bigger.”“That empathy extended well beyond his films,” Newsom said in a statement. “He made California a better place through his good works. Rob will be remembered for his remarkable filmography and for his extraordinary contribution to humanity.”\n\nThe Reiners donated about $2.7 million to help Democrats over their lifetime, The New York Times reported, including $100,000 to support then-President Joe Biden’s 2024 reelection. He later joined actor George Clooney in urging Biden to drop out, saying, “We need someone younger to fight back.”\n\nNot everyone had nice things to say about Reiner. President Donald Trump, whom Reiner frequently criticized, called Reiner a “tortured and struggling but once very talented movie director and comedy star” in a social media post. He claimed Reiner’s death was linked to a “mind crippling disease known as TRUMP DERANGEMENT SYNDROME.” \n\nDemocratic U.S Rep. Laura Friedman, who represents the Hollywood area, said in an interview she “really felt sick over seeing Donald Trump’s post about this terrible murder.” \n\nFriedman, a former film and television producer, said Reiner’s art reflected his politics. She said he advocated for being decent to each other and against bigotry — unlike Trump who she said has a “unique ability to divide Americans and make people angry.”\n\nReiner, she said, often used humor to “bring us together … and do it in a way that was somehow gentle and loving at the same time.”\n\nCalMatters is a nonpartisan and nonprofit news organization bringing Californians stories that probe, explain and explore solutions to quality of life issues while holding our leaders accountable.","summary":"Rob Reiner may be best known for his Hollywood films, but he was also a Democratic political force in California.","url":"https://timesofsandiego.com/politics/2025/12/16/rob-reiner-hollywood-legend-helped-shape-california-politics/","image":"https://timesofsandiego.com/wp-content/uploads/2025/12/AP12020703692-scaled.jpg","video":null,"publish_date":"2025-12-16 22:22:34","author":"Damian Dovarganes,Ryan Sabalow • CalMatters","authors":["Damian Dovarganes","Ryan Sabalow • CalMatters"],"language":"en","source_country":"US","sentiment":0.007},{"id":387318056,"title":"Israel's strategic arsenal is empty - but at least we got revenge on the Turks","text":"Israel scored a huge diplomatic win this week. According to a report in Haaretz, it managed to prevent Turkey's participation in Tuesday's conference in Doha, where representatives of some 45 countries met to discuss plans for the multinational force that is supposed to deploy in Gaza in the second stage of U.S. President Donald Trump's peace plan for the Strip.","summary":"","url":"https://www.haaretz.com/opinion/2025-12-17/ty-article-opinion/.premium/israels-strategic-arsenal-is-empty-but-at-least-we-got-revenge-on-the-turks/0000019b-2878-d8f0-a9db-6dfc20d20000","image":"https://img.haarets.co.il/bs/00000199-aa1a-dc12-a5df-bb1b84d20000/15/4a/6a09a5d6462b931b71fe4ee3f33a/316506.jpg","video":null,"publish_date":"2025-12-16 22:22:26","author":"Zvi Bar'el","authors":["Zvi Bar'el"],"language":"en","source_country":"il","sentiment":0.122},{"id":387315888,"title":"Trump expands US travel ban to include Syria, Palestine","text":"United States President Donald Trump has added five countries to the list of nations whose citizens are banned from entering the US, including Palestine and Syria.\n\nThe White House announced the expansion of the ban on Tuesday, as it intensifies its crackdown on immigration.\n\nTuesday’s order imposed a travel ban on six new countries – Palestine, Burkina Faso, Mali, Niger, South Sudan and Syria – in addition to the 12 initially made public in June.\n\nThe decree did not refer to Palestine, which Washington does not recognise as a state, by name or even as the occupied Palestinian territory.\n\nInstead, it describes the Palestine category as “Palestinian Authority Documents” and refers to Palestinians as “individuals attempting to travel on PA-issued or endorsed travel documents”.\n\nThe decision comes weeks after Trump declared a “permanent pause” on migration from what he called “all Third World Countries” in response to the shooting of two National Guard troops in Washington, DC.\n\n“Several US-designated terrorist groups operate actively in the West Bank or Gaza Strip and have murdered American citizens. Also, the recent war in these areas likely resulted in compromised vetting and screening abilities,” the White House said.\n\n“In light of these factors, and considering the weak or nonexistent control exercised over these areas by the PA, individuals attempting to travel on PA-issued or endorsed travel documents cannot currently be properly vetted and approved for entry into the United States.”\n\nDemocratic Congresswoman Rashida Tlaib, who is of Palestinian descent, slammed the ban, accusing Trump and his top aide Stephen Miller of pushing to alter the demographics of the country.\n\n“This administration’s racist cruelty knows no limits, expanding their travel ban to include even more African and Muslim-majority countries, even Palestinians fleeing a genocide,” she said in a social media post.\n\nThe move to ban Palestinians from entering the US comes as Israel continues its daily deadly attacks in Gaza and the occupied West Bank, where Israeli settlers have killed at least two US citizens this year.\n\nMeanwhile, the ban on Syrians coincides with rapprochement between Washington and Damascus after Syrian President Ahmed al-Sharaa visited the White House in November.\n\n“While the country is working to address its security challenges in close coordination with the United States, Syria still lacks an adequate central authority for issuing passports or civil documents and does not have appropriate screening and vetting measures,” the White House said.\n\nOn Thursday, US Director of National Intelligence Tulsi Gabbard cited the mass shooting that killed 15 people at a Jewish festival in Australia to laud Trump’s immigration restrictions.\n\n“Islamists and Islamism is the greatest threat to the freedom, security, and prosperity of the United States and the entire world. It is probably too late for Europe – and maybe Australia,” she wrote on X.\n\n“It is not too late for the United States of America. But it soon will be. Thankfully, President Trump has prioritized securing our borders and deporting known and suspected terrorists, and stopping mass, unvetted migration that puts Americans at risk.”\n\nTrump’s Republican allies have been increasingly using Islamophobic rhetoric, and calling for Muslims to be blocked from entering the country.\n\nOn Sunday, Senator Tommy Tuberville called Islam a “cult”, baselessly accusing Muslims of aiming to “conquer” the West.\n\n“Stop worrying about offending the pearl clutchers,” he wrote in a social media post. “We’ve got to SEND THEM HOME NOW or we’ll become the United Caliphate of America.”\n\nWhen Trump first ran for president in 2015, he called for a complete ban on Muslims entering the US, and when he started his first term, he imposed a travel ban on several Muslim-majority countries.","summary":"US adds five Arab and African countries to travel ban list as right-wing politicians intensify Islamophobic rhetoric.","url":"https://www.aljazeera.com/news/2025/12/16/trump-expands-us-travel-ban-to-include-syria-palestine?traffic_source=rss","image":"https://www.aljazeera.com/wp-content/uploads/2025/12/ap_6932d1cfefa76-1764938192.jpg?resize=1920%2C1440","video":null,"publish_date":"2025-12-16 22:22:22","author":"Apps Support","authors":["Apps Support"],"language":"en","category":"politics","source_country":"QA","sentiment":0.067},{"id":387319118,"title":"Donald Trump is going to cost GOP after 'disgusting' Rob Reiner attack, warns Stephen A. Smith","text":"Stephen A. Smith has issued a stark warning to the Republican Party, arguing that Donald Trump's recent attacks on the late Rob Reiner will hurt the GOP politically.\n\nThe controversy ignited earlier this week following the shocking deaths of the Hollywood director and his wife, Michele, who were found murdered in their Los Angeles home. \n\nIn the immediate aftermath, Trump took to Truth Social and spoke to reporters in the Oval Office, blaming Reiner's death on 'Trump Derangement Syndrome' and describing the director as a 'deranged person' who was 'very bad for our country.'\n\nSmith, reacting to the President's comments on his show Straight Shooter with Stephen A. Smith, argued that this lack of empathy is a political liability.\n\n'It's stuff like this that's going to end up costing the GOP,' Smith said. 'And I want to state [that] it's not because of them. Plenty of them have come up and spoke out against the president. But it's disgusting rhetoric like this - there's no place for it.'\n\n'When Charlie Kirk got assassinated, people like myself and various others were like: 'Yo! He got killed. Don't come to us with the rhetoric that you believe he was spewing online or when he was going to college campuses'. \n\n'All of that is up for debate in terms of what he said, how offensive it was and all that other stuff. I'm not talking about that. I'm talking about prioritizing a core level of decency.'\n\n'When somebody gets killed, that ain't the time to be sticking out your chest and basically indicating that they brought it on themselves - when there should never be any place for violence,' Smith said. \n\n'And you think that our commander-in-chief, the president of the United States of America, would know this better than anybody. But, evidently, this man does not.'\n\nBeyond the moral failing, Smith voiced frustration that Trump's inflammatory behavior makes it impossible to have necessary discussions about his actual policy record.\n\n'This is the kind of stuff that pisses me off. Because, guess what, I want a healthy debate about Trump, in terms of, are the tariffs working? Did he do the right thing with the border? How's the economy? What about the Affordable Care Act? That's what I would like to be debating and discussing,' Smith explained. \n\n'So, when a president talks about how great he is and all these things that he's done, I'd like to focus on that. And when he's right, I'd like to give him credit for that and when he's wrong I'd like to say he's wrong.'\n\nSmith concluded that no matter the policy achievements, the President's conduct remains a stumbling block.\n\n'But it's stuff like this, where all of that gets shoved aside because of the classlessnes, the juvenile tendencies, the lack of statesmanship that he exercises and puts on display time and time again.'\n\nSmith's comments come in response to a series of attacks launched by Trump against Reiner just hours after the director and his wife were found dead.\n\n'Well, I wasn't a fan of his at all. He was a deranged person. As far as Trump was concerned,' Trump told a reporter in the Oval Office on Monday.\n\n'I think he hurt himself, career-wise, he became like a deranged person, [with] Trump derangement syndrome. So I was not a fan of Rob Reiner at all, in any way shape or form. I thought he was very bad for our country.'\n\nPrior to that, Trump had wrote that Reiner, a 'once very talented movie director and comedy star,' passed away, 'reportedly due to the anger he caused others through his massive, unyielding, and incurable affliction with a mind crippling disease' known as TDS - or Trump Derangement Syndrome. The term is used by conservatives to describe disdain for the Republican President.\n\nTrump's post continued: 'He was known to have driven people CRAZY by his raging obsession of President Donald J Trump, with his obvious paranoia reaching new heights as the Trump Administration surpassed all goals and expectations of greatness.'\n\nThe vicious statement about the couple's death highlighted Trump's tendency to attack public figures following their passing. The Republican has also ridiculed the late Senator John McCain and General Colin Powell after they died. \n\nReiner famously supported liberal causes and Democratic candidates, even downplaying concerns over Joe Biden's age. 'Look, he's old!' the 78-year-old director explained in a February 2024 interview before Biden dropped out. \n\nReiner also loudly opposed Trump, calling him 'mentally unfit' and repeatedly claiming the Republican is an autocrat in interviews over the years. \n\n'Donald Trump is the single most unqualified human being to ever assume the presidency of the United States,' Reiner told Variety in a 2017 interview. \n\nThe couple's son Nick, 32, is in custody and has been booked for murder after Reiner and Michele were found knifed to death.\n\nThey allegedly had their throats slit after a heated argument with a relative, understood to be Nick, turned deadly at their $13.5 million Los Angeles mansion on Sunday afternoon.\n\nReiner made many of the best-known movies of the 1980s and 1990s, including Stand By Me and The Princess Bride, legal thriller A Few Good Men, and romantic comedy When Harry Met Sally.","summary":"The controversy ignited earlier this week following the shocking deaths of the Hollywood director and his wife, Michele, who were found murdered in their Los Angeleshome.","url":"https://www.dailymail.co.uk/sport/othersports/article-15390217/donald-trump-rob-reiner-los-angeles-murder.html","image":"https://i.dailymail.co.uk/1s/2025/12/16/22/104787837-0-image-m-16_1765923345712.jpg","video":"https://videos.dailymail.co.uk/video/mol/2025/12/15/8858587286539027237/1024x576_MP4_8858587286539027237.mp4","publish_date":"2025-12-16 22:16:46","author":"Editor,James Cohen","authors":["Editor","James Cohen"],"language":"en","category":"politics","source_country":"jp","sentiment":-0.513},{"id":387327744,"title":"Shedeur Sanders getting more Pro Bowl votes than Jalen Hurts, Lamar Jackson, Joe Burrow and other top QBs","text":"Shedeur Sanders is currently 10th in Pro Bowl voting among quarterbacks. Sanders has played in just five games for the 3-11 Cleveland Browns, throwing for five touchdowns with six interceptions, and just 946 total yards. He 1-3 as a starter. The Pro Bowl players are determined by a vote of fans, coaches and fellow players, with each group's vote counting as one-third toward determining the selections. By these criteria, Sanders ranks ahead of established NFL superstar quarterbacks Lamar Jackson, Joe Burrow and reigning Super Bowl MVP Jalen Hurts. Not to mention Baker Mayfield, Bryce Young, C.J. Stroud, and Bo Nix, whose team is alone atop the NFL at 12-2, have also received fewer votes than Sanders. CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM Fellow rookies Jaxson Dart and Cam Ward are also getting out-voted by Sanders, despite playing in more games and putting up bigger numbers thus far. Sanders was the 144th pick in this year's draft and went into training camp as the Browns' fourth-string quarterback. Yet, he has been one of the league's biggest stories since the draft in April. The son of NFL legend Deion Sanders was originally projected to contend for the No. 1 overall pick in the draft, but ended up sliding all the way to the fifth round. SHEDEUR SANDERS DELIVERS BOLD MESSAGE AHEAD OF FIRST START WITH BROWNS Then after an offseason overshadowed by multiple traffic violations, Sanders gradually climbed his way up the Browns' depth chart amid the trade of veteran Joe Flacco to the Bengals and fellow rookie Dillon Gabriel suffering a concussion. Sanders is expected to start for the Browns throughout the remainder of the season, as he looks to bolster his Pro Bowl case. Despite the rough career start and regular criticism by the media, Sanders has earned the favor of a subset of Pro Bowl voters. He also has a big believer in President Donald Trump. Trump called out \"stupid\" NFL owners for passing on Sanders in the draft earlier this year. Then after Sanders earned his first win in his first start against the Raides last month, Trump gave the quarterback another shoutout. CLICK HERE TO DOWNLOAD THE FOX NEWS APP \"Shedeur Sanders was GREAT. Wins first game, career start, as a pro (for Cleveland). Great Genes. I TOLD YOU SO!\" Trump wrote on Truth Social. Sanders responded to Trump's praise to reporters, saying \"He's definitely been a supporter for a minute, so I’m just thankful for him, from even taking time out his day to be able to speak out, his support.\" Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.","summary":"Cleveland Browns quarterback Shedeur Sanders, the 144th draft pick, has received strong support from President Donald Trump after climbing from fourth-string.","url":"https://www.foxnews.com/sports/shedeur-sanders-getting-more-pro-bowl-votes-than-jalen-hurts-lamar-jackson-joe-burrow-other-top-qbs","image":"https://static.foxnews.com/foxnews.com/content/uploads/2025/10/nfl-browns-shedeur-sanders-102625-2.jpg","video":null,"publish_date":"2025-12-16 21:46:04","author":"Jackson Thompson","authors":["Jackson Thompson"],"language":"en","source_country":"us","sentiment":0.213}]}