{"offset":0,"number":50,"available":5428,"news":[{"id":254139820,"title":"Big Georgia county to start charging some costs to people who challenge the eligibility of voters","text":"An election board in one of Georgia's largest counties has voted to start charging people who challenge the eligibility of voters for the cost of notifying the challenged voters. The Cobb County Board of Elections and Registrations voted 4-1 on Tuesday to adopt the rule. Debbie Fisher, a Republican member of the board, was the only vote against the rule. Republican activists are challenging thousands of voters in Georgia as part a wide-ranging national effort coordinated by Donald Trump's allies to take names off voting rolls. Most of the people they are targeting have moved away from their old address, and the activists argue that letting those names stay on the rolls invites fraud. But Democrats and liberal voting rights activists argue Republicans are challenging voters either to remove Democrats or to sow doubt about the accuracy of elections in advance of 2024 presidential voting. Democrats have been pushing to start charging for each challenge filed, in part as an effort to deter people from targeting hundred or thousands of voters using software programs such as EagleAI or IV3 that facilitate mass challenges. A 2021 Georgia law specifically says one person can challenge an unlimited number of voters in their own county. In suburban Atlanta's Cobb County, a onetime Republican bastion that now produces Democratic majorities, the board voted only to charge for the cost of printing the challenge notice and for postage to mail it, likely to be less than a dollar per challenge. But that could add up. Cobb County Elections Director Tate Fall has estimated that it cost about $1,600 to mail out notices from one batch of 2,472 challenges filed last month. Democrats have also wanted counties to charge challengers for staff time to research and process challenges. But Daniel White, a lawyer for the board, said Tuesday that he concluded that the board couldn't do that unless state law is changed to grant specific authorization. However, he said he concluded the board has the inherent power to charge for sending notices, in the same way a court has the inherent power to charge someone for serving notice of a lawsuit on the defendants. “If you’re talking about 3,000 voters being challenged and notice having to go out to 3,000 voters being challenged, that really increases your costs,\" White said. But Republicans opposed the measure. Fisher called it “egregious\" and “just wrong” to charge people for exercising their challenge rights. Cobb County Republican Party Chairwoman Salleigh Grubbs said the board is failing to do its job of ensuring clean voter rolls, while challengers are stepping in to help. “When the Board of Elections is trying to charge people for doing the job they should be doing, that’s a disgrace,\" Grubbs said. The board also adopted other rules around challenges, saying it won't accept challenges against people who have already been moved to the inactive voter list. For people who have moved, federal law says Georgia can only cancel an inactive registration if a voter doesn’t respond to a mailing and then doesn’t vote in two following federal general elections. That process takes years. Challengers have been targeting inactive voters for quicker removal. Counties are making rules in part because the state hasn’t issued guidelines to counties on handling challenges. That's leading to differences in how counties handle the same types of challenges. An Associated Press survey of Georgia’s 40 largest counties found more than 18,000 voters were challenged in 2023 and 2024, although counties rejected most challenges. Hundreds of thousands more were challenged in 2020, 2021 and 2022. A new law that took effect July 1 could lead to a surge in challenges by making it easier for challengers to meet the legal burden to remove someone. Some groups have sued to block the Georgia measure, arguing it violates federal law.","summary":"An election board in one of Georgia’s largest counties has voted to start charging people who challenge the eligibility of voters for the cost of notifying the challenged voters","url":"https://www.independent.co.uk/news/georgia-ap-atlanta-democrats-republican-b2596573.html","image":"https://static.independent.co.uk/2024/08/15/00/US_Voter_Challenges_Georgia_69227.jpg?width=1200","video":null,"publish_date":"2024-08-14 23:49:00","author":"Jeff Amy","authors":["Jeff Amy"],"language":"en","source_country":"gb","sentiment":-0.297},{"id":254139436,"title":"Trump attacks Harris on the economy as he campaigns in North Carolina","text":"Trump attacks Harris on the economy as he campaigns in North Carolina With polls tightening, former President Donald Trump used a campaign appearance in Asheville, North Carolina, Wednesday to try and capitalize on one of his perceived strengths, the economy, while attempting to tie his new opponent, Vice President Kamala Harris, to current economic conditions. Caitlin Huey-Burns reports from Asheville.","summary":"With polls tightening, former President Donald Trump used a campaign appearance in Asheville, North Carolina, Wednesday to try and capitalize on one of his perceived strengths, the economy, while attempting to tie his new opponent, Vice President Kamala Harris, to current economic conditions. Caitlin Huey-Burns reports from Asheville.","url":"https://www.cbsnews.com/video/trump-attacks-harris-on-the-economy-as-he-campaigns-in-north-carolina/","image":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/08/14/6b010dc4-1938-456e-a426-e06550ce980c/thumbnail/1200x630/3d47502667e17ba5f1f13614ec710009/0814-en-chb.jpg?v=d8f7565ef3e8b72561ee316b5993cbf9","video":null,"publish_date":"2024-08-14 23:44:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.329},{"id":254139384,"title":"Desperate Donald Trump shakes Tic Tacs to mock Joe Biden despite POTUS quitting race 3 weeks ago","text":"Desperate Donald Trump mockingly brandished a miniature pack of TicTacs as a jab at Joe Biden during a rowdy rally in North Carolina, even though the President had bowed out from the re-election race three weeks prior. At 78 years young, Trump took a humorous swipe at 'Bidenflation' by showcasing an unusually small container of TicTacs in Asheville on the past Wednesday evening. In a striking visual comparison, he presented two distinct sizes of TicTac boxes to illustrate inflation's impact on everyday shopping items. \"This is the greatest commercial they ever had,\" declared Trump, as he whipped out the TicTac box from his pocket. With a flourish, he showed off the diminutive pack and proclaimed: \"This is inflation.\" Even though POTUS Biden had withdrawn from the presidential contest over three weeks earlier, Trump, who famously used the same Tic Tac technique at an earlier rally in Minneapolis, didn't hesitate to take digs at him, reports the Mirror US. Turning the heat up, Trump tore into Democratic contender Kamala Harris with vitriolic criticism, claiming she was only in the fray because \"their fighter was losing.\" He didn't mince words saying: \"You know why she hasn't done an interview? She's not smart. She's not intelligent. And we've gone through enough of that with this guy, crooked Joe.\" To add further insult, he claimed: \"The American dream is dead. America isn't great.\" With the Democratic National Convention fast approaching next week, where VP candidate Harris and her running mate, Minnesota Gov. Tim Walz, will be firmly in the spotlight, Trump couldn't resist unleashing a series of impromptu tirades against them. \"It's a fake ticket that never earned a single Democrat primary vote,\" he declared. \"It's a fake platform that offers no specifics about how to do the people's businesses and a fake promise to change the government, even though she's been in charge of that government for almost four years and hasn't done a damn thing,\" Trump vented at the rally. Trump claimed Harris \"copies.\" He claimed her economic policies \"will probably be a copy of my plan.\" The rally took place in Asheville, North Carolina, a Democratic city surrounded by staunchly Republican mountain counties. Trump assured North Carolinians of his plans to \"bring back manufacturing\" in the state and alleged that China and other Asian countries are being overly incentivised by the US. North Carolina, which gave Trump his narrowest statewide margin of victory four years ago, is predicted to be a battleground once again in 2024. Trump breezed through North Carolina's primary election this year, securing 74% of the vote against Nikki Haley's 23%. However, a more challenging race is expected against Harris in North Carolina come November.","summary":"Donald Trump pulled out a small pack of TicTacs at a rally in North Carolina as he mocked President Joe Biden, three weeks after the incumbent dropped out of the race","url":"https://www.mirror.co.uk/news/us-news/desperate-donald-trump-shakes-tic-33466879","image":"https://i2-prod.mirror.co.uk/news/us-news/article33466874.ece/ALTERNATES/s1200/4_live_-president-trump-to-deliver-remarks-on-the-economy-in-asheville-nc-8_14_24-5-41-55-screenshot.jpg","video":null,"publish_date":"2024-08-14 23:43:48","author":"Joseph Wilkes,Yelena Mandenberg","authors":["Joseph Wilkes","Yelena Mandenberg"],"language":"en","catgory":"politics","source_country":"GB","sentiment":-0.303},{"id":254139452,"title":"IndyCar ‘Super Sub’ Conor Daly Hopes Juncos Hollinger Becomes Fulltime","text":"Share to Facebook Share to Twitter Share to Linkedin Conor Daly takes a selfie with a fan during qualifying for the NASCAR Xfinity Series Pennzoil 250 on ... [+] July 20, 2024, at Indianapolis Motor Speedway in Indianapolis, Indiana. (Photo by Michael Allio/Icon Sportswire via Getty Images) Icon Sportswire via Getty Images It’s been two seasons since Conor Daly has had a full-time IndyCar ride with Ed Carpenter Racing in 2022. Daly began the 2023 season with ECR before he lost his ride after the Chevrolet Detroit Grand Prix in June, replaced injured driver Simon Pagenaud at Meyer Shank Racing for four races after that. Daly’s IndyCar efforts in 2024 were limited to just two races – the 108thIndianapolis 500 for Dreyer & Reinbold Racing and the second race of the Hy-Vee IndyCar Race Weekend at Iowa Speedway when he filled in for injured driver Jack Harvey at Dale Coyne Racing. With an open schedule, Daly filled in the gaps with an ARCA Menards Series race at Mid-Ohio, an eighth-place finish on June 21, a NASCAR Craftsman Truck Series race at Lucas Oil Indianapolis Raceway Park on July 19 (29th), and a 14th place finish for Sam Hunt in the Pennzoil 250 NASCAR Xfinity Series race on July 20. Daly will finally get a chance to return to full-time duty this weekend in the Bommarito Automotive Group 500 at World Wide Technology Raceway. Team owner Ricardo Juncos announced on August 14 that Daly will take over the No. 78 Chevrolet Indy car for the remaining five races of the 2024 season. “It's been chaotic this year,” Daly said on August 14. “There's been not a ton of races, but really good moments from the 500 to Xfinity race at Indy. There's been a lot of times where I've actually had a big smile on my face this year, which is nice. MORE FOR YOU It’s ‘Over’—Leak Sparks Serious U.S. Crypto Crackdown Fears As The Bitcoin Price Bounces Back New Samsung Galaxy S24 Ultra Price Lands As Pixel 9 Releases Trump Vs. Harris 2024 Polls: Harris Up 5 In Latest Survey “This kind of I think restores that same smile because it's a great chance to just go racing in a field that I love to be a part of, but also love to be competitive in. Yeah, it will be a lot of work for sure. That's what racing is all about, putting in the work. “Yeah, I'm excited to do it.” Daly replaces Agustin Canapino of Argentina, who was released from Juncos Hollinger Racing on August 7. It also reunites the team owner and driver from their success in the Road to Indy developmental series earlier in Daly’s career. “I am extremely pleased to reunite with Ricardo Juncos after our success together in the Road To Indy,” Daly said on August 14. “Ricardo took a chance on me when I was young, and it made a huge difference in my career. There are a lot of people on this team that I’ve worked with before and I that gives me a lot of confidence. “What Brad Hollinger and Ricardo have built here is extremely impressive in a short amount of time and I consider myself very lucky to get to compete for the rest of the season and earn the necessary points for this No. 78 Chevrolet. “There are a lot of partners in this effort, and I appreciate the support behind me to get back in the race seat.” Daly also believes Juncos is making a commitment for the future. “This is a huge deal for me because I appreciate the fact that Ricardo committed to this,” Daly said. “If we really want to score the points that we want to score, do as good as we can do, to get some races in a row is really helpful. To be able to work with the team, to be able to test a couple weeks ago at St. Louis was really helpful. “Obviously I'm still extremely new to the whole hybrid side of it. At Portland, that will definitely be more in play for sure, so that will be a challenge.” Both the team owner and the driver are hopeful this can turn into a fulltime opportunity for the NTT IndyCar Series veteran in 2025. Daly is familiar with key members of the team working with the driver in the past. IndyCar team owner Ricardo Juncos (Photo by Brian Spurlock/Icon Sportswire via Getty Images) Icon Sportswire via Getty Images “I think he's kind of back in the team, right?” Juncos said. “It is a welcome back. “I remember Conor maybe in 2003 go-kart time, then in Indy Pro (now INDY iShares India 50 ETF NXT) in 2010, one of our best championships ever. I think together we have a lot of good things. Now he's kind of coming back obviously many years later. “I think Conor obviously has a lot of experience in IndyCar. I remember when he was fighting against Rinus VeeKay, two Juncos cars in the Indy 500. I think he has a lot of experience, for sure is a big plus. “He also worked before with some of my technical guys and engineers in the past when he ran for Carlin. I think the combination can be quite a good thing to see.” The driver from Noblesville, Indiana is a fan favorite in IndyCar and believes a return to some familiar faces can help both sides make some progress. “I think this is going to be a great situation purely because, as Ricardo mentioned, the familiar faces that are there,” Daly said. “Even (engineer) Alan Mc Donald who was there my very first IndyCar street race at Schmidt Peterson back in the day which was a lot of fun at Detroit. “A lot of great people, a lot of people from the Carlin days when we qualified on pole together. Everything about it is kind of primed for hopefully a great few weeks to cap it off for them in a really positive way.” Including a GT Gate World Challenge race with his races in ARCA, NASCAR Truck and Xfinity, Daly has driven for six different teams in 14 months. “Well, it's definitely been an interesting year,” Daly admitted. “From the months of last September till the beginning of May, I did more NBA All-Star Games than I did IndyCar races. “I thought that was kind of a wild thing. “Now I get to do six weeks in a row in racing in essentially three different series all the way to the end of September with our last Truck race. “This is what I do, though. I try to work hard just providing myself opportunities. I want to be involved in a competitive situation. This happened to come up. Obviously, I want to be as competitive as possible for Ricardo, for this team. There's points to score that need to be scored. I want to be that guy. I think with this group for sure it's highly possible.” During a media conference on August 14, Juncos also said rumors of Devlin DeFrancesco’s family buying out either himself or partner Brad Hollinger are “rumors.” “As of now, I'm not with Brad Hollinger doing anything,” Juncos said. “Of course, we have different options and different people that approaching us. “You mentioned DeFrancesco is one of those. “Right now, I can tell you just rumors, like many others, but nothing is set yet.” As for Daly, he realizes despite his desire to return to full-time IndyCar duty, there are no guarantees. But he is determined to make the most out of his latest opportunity with Juncos in the final races of the 2024 NTT IndyCar Series season. “If you followed my career, it's been quite a tornado,” Daly said. “There's a new ‘Twisters’ movie out. But it's been crazy, it's been up and down. “I think when it's been up, I'm very, very proud of it. When it's been tough, there's always things that either I will take responsibility for, or I will understand why. “In the end, it feels really good to hear him say that. Again, I think I'm not at the young end of my IndyCar career. Like, I know that. I have so much that I want to do. I have so much that we train every day for, for these chances to come about. “Even if it was one race, I would go about it the same way. But this is an opportunity to go and find success together. This team is right on the verge of getting trophies and bringing home some champagne to the race shop. I would love to be the guy to do that. “I'm excited, but my life exists for the next six weeks, then who knows what happens. That is the way I've had to live, which is usually tougher for maximum, maximum performance. I'm going to do the best I can, put everything I've got into it and show them I really want to bust my butt to deliver some results for these guys.” Conor Daly prior to the NASCAR Xfinity Series Pennzoil 250 at Indianapolis Motor Speedway on July ... [+] 20, 2024 in Indianapolis, Indiana. (Photo by James Gilbert/Getty Images) Getty Images Follow me on Twitter. Check out my website. Bruce Martin Following Editorial Standards Print Reprints & Permissions","summary":"Conor Daly has competed in six different racing series in the past 14 months. He hopes his latest opportunity with Juncos Hollinger is a full-time IndyCar return.","url":"https://www.forbes.com/sites/brucemartin/2024/08/14/indycar-super-sub-conor-daly-hopes-juncos-hollinger-becomes-fulltime/","image":"https://imageio.forbes.com/specials-images/imageserve/66bd3f841c03bf8774146f6a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","video":null,"publish_date":"2024-08-14 23:43:26","author":"Bruce Martin,Contributor","authors":["Bruce Martin","Contributor"],"language":"en","source_country":"US","sentiment":0.085},{"id":254139684,"title":"Unveiling Kamala Harris’ secrets: An in-depth look at her silence on policies and plans even after a month of being the nominee, as revealed by SCOTT JENNINGS","text":"Elites in the Democratic party are truly shameless. They’d already committed an egregious affront to democracy by covering up President Joe Biden’s infirmity for months and then hand-picking his successor. It was even worse that Vice President Kamala Harris, their anointed nominee, had never won a single vote in a presidential primary contest. And it’s an ongoing insult that Harris has yet to submit to a single interview or news conference in the 24 days that she’s been her party’s new standard-bearer. But it’s the latest news from Harris world that is truly too much to stomach. Campaign insiders are now suggesting to the media that she wants to ‘break’ from Biden’s failed stewardship of the US economy. You know, the same economy she’s helped to run the past four years. In a ‘policy’ speech this week, they claim she’ll roll out her scheme for lowering costs, taming inflation and restoring the American dream. Well, don’t hold your breath. Even the New York Times isn’t fooled. ‘[Harris] will lay out an approach relatively light on details… it will rarely break from Mr. Biden on substance,’ the Times reported Wednesday. How exciting! It’s now abundantly clear that the Harris 2024 campaign strategy is to treat the American people as if they’re mushrooms… keep them in the dark and feed them crap. Almost 80 days out from the election (and only a month from the start of early voting in some states), Harris is yet to reveal an iota of what she actually wants to do as president. And the sad reality is that this cynical plan of silence just might work – especially if Donald Trump continues his current unfocused approach to his campaign. Every sensible Republican recognizes that Trump’s been off track since his speech at the Republican National Convention in July, when he delivered the longest convention address in history – rambling between a teleprompter script and off-the-cuff remarks. The former president’s meandering has only increased since Harris became the Democratic nominee. Trump has been too busy lobbing counterproductive comments about Harris’s race, instead of successfully framing the narrative against her litany of past policy failures, as he so expertly did with Biden. If the polls are any indication, Trump’s current tactics are not working. He has gone from a lead to a deficit in many major swing state polls – and Harris has even surged to an advantage on the question of who is more ‘trusted’ to handle the U.S. economy. To most Republicans, the most effective attack line against her is obvious: It’s common sense versus radical nonsense. In 2020, Harris was rated the second ‘most politically left’ senator in the 116th Congress by the non-partisan government transparency group Gov Track. The only senator rated as more radically liberal than Harris was the proud democratic socialist Bernie Sanders. When Harris unsuccessfully ran for the Democratic party nomination in 2020, as a proud progressive, she advocated for banning fracking, decriminalizing illegal border crossing, eliminating the private healthcare system and defunding the police. Now, unnamed spokespeople for her campaign claim she no longer supports any of that. As vice president, Harris was tasked with easing the global factors driving an unprecedented number of migrants to the U.S. border. The result was the worst illegal immigration crisis in American history – and an estimated 10 million border crossings since Biden was inaugurated. In her role as Vice President and loyal Biden lieutenant, Harris cast the tie-breaking vote in the Senate in February 2021 to pass the nearly $2 trillion COVID stimulus bill that sent inflation soaring. Since then, prices have been a runaway freight train of misery for the American people. If Harris’s record proves anything it is that she’s a rank political opportunist. When Trump proposed eliminating federal taxes on tips for service industry workers, Harris said she’d do the same despite backing a bill that allowed the IRS to crack down on those very same workers. Harris’s position on the Israel-Hamas war is just as murky. As the newly named Democratic party nominee, she snubbed the Israeli Prime Minister Benjamin Netanyahu by refusing to preside over his address to a joint session of Congress in July. Officially, she hasn’t broken with the Biden administration’s policy of providing arms to Israel in support of their war against terror. And yet, she did recently meet with Hamas-friendly protestors and, according to the activists present, said she was open to imposing an arms embargo on the Jewish state. Her spokesperson denied it, but with no public questioning of Harris, how can we know the truth? So far, the Vice President hasn’t explained her ‘evolution’ from one of the most progressive senators in America in 2020 to a determined moderate in 2024. She intends to run a sheltered, sanitized campaign, built on vague platitudes and little scrutiny. And the only thing so far standing between Harris’s duplicitous strategy and the White House is an ABC News debate on September 10. Trump must be as focused for these 90 minutes as he’s ever been in his life. His entire campaign is riding on it. Trump must expose Harris for the radical progressive that she really is. If he falters, there won’t be much time to correct the trajectory of the race before votes are cast.","summary":"Internewscast Journal\n\nInternewscast\n\n\nElites in the Democratic party are truly shameless. They&#8217;d already committed an&#8230;\n\n\nThis Post: Unveiling Kamala Harris&#8217; secrets: An in-depth look at her silence on policies and plans even after a month of being the nominee, as revealed by SCOTT JENNINGS first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/unveiling-kamala-harris-secrets-an-in-depth-look-at-her-silence-on-policies-and-plans-even-after-a-month-of-being-the-nominee-as-revealed-by-scott-jennings/","image":"https://i.dailymail.co.uk/1s/2024/08/14/22/88537679-13744057-image-a-6_1723669794501.jpg","video":null,"publish_date":"2024-08-14 23:41:14","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.404},{"id":254139680,"title":"J.D. Vance supports the idea of postmenopausal women caring for their grandchildren","text":"J.D. Vance seems to hold the opinion women who are too old to have kids exist on this Earth solely to help younger generations take care of their kids. Donald Trump‘s running mate agreed with that basic sentiment during an April 2020 appearance on “The Portal” podcast, when host Eric Weinstein claimed grandmothers raising their grandkids is “the whole purpose of the postmenopausal female.” The Republican Senator from Ohio was talking about the benefits of having his wife’s mother help take care of their newborn son when Weinstein made his claim … and Vance agreed. While the interview is over 4 years old at this point, it’s getting resurfaced now … on the heels of Vance’s “childless cat lady” controversy. Also in the April 2020 podcast, Vance agrees when Weinstein says grandparents helping raise their grandkids is a “weird, unadvertised feature of marrying an Indian woman.” J.D. and his wife Usha share 3 kids together … Ewan, Vivek and Mirabel … and he says his mother-in-law took a sabbatical from her job as a biology professor in California to move in with them in Ohio and take care of their kid for a year. Vance argues it’s not what liberals want people to do in this country … but he feels “it’s just what you do.” Naturally, folks on social media are outraged over Vance’s resurfaced comments … and it will be interesting to see if this rises to “childless cat lady” levels.","summary":"Internewscast Journal\n\nInternewscast\n\n\nJ.D. Vance seems to hold the opinion women who are too old&#8230;\n\n\nThis Post: J.D. Vance supports the idea of postmenopausal women caring for their grandchildren first appeared on Internewscast Journal","url":"https://internewscast.com/entertainment/j-d-vance-supports-the-idea-of-postmenopausal-women-caring-for-their-grandchildren/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-JD-Vance-Agrees-Grandmas-Raising-Kids-Is-1024x576.png","video":null,"publish_date":"2024-08-14 23:39:11","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.373},{"id":254139394,"title":"Lil Pump Is Releasing a ‘Pro-Trump’ Song ‘With the Support of the Trump Team’","text":"As we approach the presidential election, Lil Pump will be voicing his support for Donald Trump in song. The “Gucci Gang” rapper took to X on Tuesday (Aug. 13) to reveal that he will no longer be performing a diss track aimed at both President Joe Biden and Vice President Harris during Trump’s next rally, as he previously announced. “not dropping a diss song,” he wrote alongside a photo of himself wearing a red “Make America Great Again” hat. “I know some ppl wanted it but it would hurt what we are fighting for which is to get President Trump in office. Can’t stoop down to the liberals level. IM DROPPING A PRO TRUMP SONG WITH THE SUPPORT OF THE TRUMP TEAM!! YES THIS IS BIG!! MAGA” After Harris was announced as the hopeful replacement for President Biden as the Democratic nominee, Pump took to X and to voice his opinion, tweeting, “Kamala Harris isn’t even black… she’s Indian. She locked up over 1,500 people for weed related crimes and then laughed about it years later. The worst VP in American History. Trump 2024.” He later shared a video proclaiming, “I swear on my dad’s grave, if this stupid-a– bi— Kamala Harris wins the f—ing election, I’m moving out of America, boy. I swear on everything.” Earlier this year, Pump showed off his newest tattoo on his left upper thigh, a recreation of the instantly viral mugshot taken when Trump was arrested and booked in Fulton County, Georgia last August after surrendering to authorities in connection with his indictment over alleged attempts to overturn the results of the 2022 election in the state; the indictment is one of four — totaling 91 felony charges — that the current GOP presidential front-runner is facing as he makes his third bid for the White House.","summary":"The track does not yet have a release date.","url":"https://www.billboard.com/music/rb-hip-hop/lil-pump-releasing-a-pro-trump-song-1235753457/","image":"https://www.billboard.com/wp-content/uploads/2020/11/Lil-Pump-jan-25-2020-billboard-1548-1604693256.jpg","video":null,"publish_date":"2024-08-14 23:39:01","author":"Rania Aniftos","authors":["Rania Aniftos"],"language":"en","source_country":"US","sentiment":-0.33},{"id":254140052,"title":"Second gentleman Doug Emhoff addresses antisemitism at Chicago fundraiser for Harris campaign","text":"Second gentleman Doug Emhoff, husband of Vice President Kamala Harris, was in Chicago on Wednesday, just days ahead of the Democratic National Convention. In remarks to about 50 people at a West Loop fundraiser, Emhoff condemned antisemitism, while U.S. Sen. Ben Cardin, D-Md., stressed the importance of maintaining strong ties with Israel. The fundraiser was in the home of Lee Rosenberg, a senior adviser to Gov. JB Pritzker, the first of three stops on Emhoff’s trip to help raise money for his wife’s presidential campaign. Emhoff began by telling the crowd how excited he was for Harris to officially accept her party’s presidential nomination next week. Delegates already nominated Harris in an online roll call last week. “She’s a great leader, and she’s going to be a great president,” Emhoff said. Emhoff, who is Jewish, praised Harris for her work since the Oct. 7 attack on Israel by Hamas terrorists. “The Kamala Harris I knew when I met her, I didn’t have to explain to her who I was,” Emhoff said. “She knew who I was, who I was as a Jewish person. “Since that horrific day of Oct. 7 … I saw first-hand from my vantage point, the work that she and President Biden did right away. It was really comforting to me … to see her spring into action that way.” Emhoff spoke about how unfortunate it was for the Biden and Harris administration to inherit the issues they did from Donald Trump’s administration and assured attendees that Harris would continue to combat antisemitism. “When they got to office, post-Trump, there’s so many things that Biden and Harris inherited. ... One of those things was hate,” he said. “You could see it, you could feel it. ... You could feel the antisemitism brewing,” Emhoff added, citing the 2018 shooting at the Tree of Life synagogue in Pittsburgh that left 11 dead and six wounded. Sen. Cardin said the United States needs “an administration that recognizes America’s global responsibilities and can form the type of alliances for our national security, and that’s the Harris/Walz ticket.” Harris “understands the importance of that relationship” with Israel, Cardin added. “On Oct. 7, I saw what the Biden and Harris administration did ... and made it clear that Israel has a responsibility to defend itself and the United States will always be there for Israel.” Emhoff outlined the consequences of another Trump presidency, saying that Donald Trump was “unfit for office.” “He cannot be anywhere near the White House,” Emhoff said. “There should be no nostalgia for that presidency. He’s weak and Kamala Harris smells weakness. She can see a fake tough guy from a mile away.” Emhoff made a second fundraising stop in Chicago on Wednesday before heading to north suburban Glencoe.","url":"https://chicago.suntimes.com/news/2024/08/14/dnc-chicago-kamala-harris-campaign-doug-emhoff-fundraiser-antisemitism-israel","image":"https://cst.brightspotcdn.com/dims4/default/6ac6549/2147483647/strip/true/crop/5127x2927+0+246/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fd1%2Fd9%2F36895af277bff087ce3471930eab%2Fap22","video":null,"publish_date":"2024-08-14 23:36:27","author":"Cindy Hernandez","authors":["Cindy Hernandez"],"language":"en","source_country":"us","sentiment":-0.054},{"id":254139166,"title":"Trump ramps up rallies as Harris leads in several battleground states","text":"Trump ramps up rallies as Harris leads in several battleground states Former President Donald Trump discussed the economy at a rally in North Carolina Wednesday but didn't provide many specifics on his policy proposals. The rally comes as Vice President Kamala Harris leads polls in several battleground states. CBS News political correspondent Caitlin Huey-Burns reports from Asheville, North Carolina, where Trump spoke. And CBS News political director Fin Gomez and Axios national politics reporter Sophia Cai join \"America Decides\" to discuss the state of 2024 race.","summary":"Former President Donald Trump discussed the economy at a rally in North Carolina Wednesday but didn't provide many specifics on his policy proposals. The rally comes as Vice President Kamala Harris leads polls in several battleground states. CBS News political correspondent Caitlin Huey-Burns reports from Asheville, North Carolina, where Trump spoke. And CBS News political director Fin Gomez and Axios national politics reporter Sophia Cai join \"America Decides\" to discuss the state of 2024 race.","url":"https://www.cbsnews.com/video/trump-ramps-up-rallies-as-harris-leads-in-several-battleground-states/","image":"https://assets1.cbsnewsstatic.com/hub/i/r/2024/08/14/6b467380-f6f5-48d2-a392-01338b781a52/thumbnail/1200x630/28e56563943f041aa2ea1ea7aa232435/gettyimages-2166183800.jpg?v=d8f7565ef3e8b72561ee316b5993cbf9","video":null,"publish_date":"2024-08-14 23:31:00","author":null,"language":"en","catgory":"politics","source_country":"US","sentiment":-0.214},{"id":254139614,"title":"Big Georgia county to start charging some costs to people who challenge the eligibility of voters","text":"ATLANTA (AP) — An election board in one of Georgia’s largest counties has voted to start charging people who challenge the eligibility of voters for the cost of notifying the challenged voters. The Cobb County Board of Elections and Registrations voted 4-1 on Tuesday to adopt the rule. Debbie Fisher, a Republican member of the board, was the only vote against the rule. Republican activists are challenging thousands of voters in Georgia as part a wide-ranging national effort coordinated by Donald Trump’s allies to take names off voting rolls. Most of the people they are targeting have moved away from their old address, and the activists argue that letting those names stay on the rolls invites fraud. But Democrats and liberal voting rights activists argue Republicans are challenging voters either to remove Democrats or to sow doubt about the accuracy of elections in advance of 2024 presidential voting. Democrats have been pushing to start charging for each challenge filed, in part as an effort to deter people from targeting hundred or thousands of voters using software programs such as EagleAI or IV3 that facilitate mass challenges. A 2021 Georgia law specifically says one person can challenge an unlimited number of voters in their own county. In suburban Atlanta’s Cobb County, a onetime Republican bastion that now produces Democratic majorities, the board voted only to charge for the cost of printing the challenge notice and for postage to mail it, likely to be less than a dollar per challenge. But that could add up. Cobb County Elections Director Tate Fall has estimated that it cost about $1,600 to mail out notices from one batch of 2,472 challenges filed last month. Democrats have also wanted counties to charge challengers for staff time to research and process challenges. But Daniel White, a lawyer for the board, said Tuesday that he concluded that the board couldn’t do that unless state law is changed to grant specific authorization. However, he said he concluded the board has the inherent power to charge for sending notices, in the same way a court has the inherent power to charge someone for serving notice of a lawsuit on the defendants. “If you’re talking about 3,000 voters being challenged and notice having to go out to 3,000 voters being challenged, that really increases your costs,” White said. But Republicans opposed the measure. Fisher called it “egregious” and “just wrong” to charge people for exercising their challenge rights. Cobb County Republican Party Chairwoman Salleigh Grubbs said the board is failing to do its job of ensuring clean voter rolls, while challengers are stepping in to help. “When the Board of Elections is trying to charge people for doing the job they should be doing, that’s a disgrace,” Grubbs said. The board also adopted other rules around challenges, saying it won’t accept challenges against people who have already been moved to the inactive voter list. For people who have moved, federal law says Georgia can only cancel an inactive registration if a voter doesn’t respond to a mailing and then doesn’t vote in two following federal general elections. That process takes years. Challengers have been targeting inactive voters for quicker removal. Counties are making rules in part because the state hasn’t issued guidelines to counties on handling challenges. That’s leading to differences in how counties handle the same types of challenges. An Associated Press survey of Georgia’s 40 largest counties found more than 18,000 voters were challenged in 2023 and 2024, although counties rejected most challenges. Hundreds of thousands more were challenged in 2020, 2021 and 2022. A new law that took effect July 1 could lead to a surge in challenges by making it easier for challengers to meet the legal burden to remove someone. Some groups have sued to block the Georgia measure, arguing it violates federal law. Jeff Amy, The Associated Press","summary":"ATLANTA (AP) — An election board in one of Georgia&#8217;s largest counties has voted to start charging people who challenge the eligibility of voters for the cost of notifying the challenged voters. The Cobb County Board of Elections and Registrations voted 4-1 on Tuesday to adopt the rule. Debbie Fisher, a Republican member of the [&#8230;]","url":"https://toronto.citynews.ca/2024/08/14/big-georgia-county-to-start-charging-some-costs-to-people-who-challenge-the-eligibility-of-voters/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/03/25/TitleCards_CityNews_1920x1080.jpg","video":null,"publish_date":"2024-08-14 23:30:43","author":"Jeff Amy,News Staff","authors":["Jeff Amy","News Staff"],"language":"en","source_country":"ca","sentiment":-0.297},{"id":254138952,"title":"Suspect wanted for breaking into Trump campaign office in Virginia named, pictured","text":"WASHINGTON — Virginia police on Wednesday released the name and photo of the suspect wanted for burglarizing a Donald Trump presidential campaign office. Toby Shane Kessler, 39, broke into the Ashburn office, about an hour’s drive west of DC, on Sunday and has not been located by authorities, the Loudoun County Sheriff’s Office said. “The burglary occurred at approximately 8:11 pm and was captured by surveillance video inside the office,” the office’s statement said. “The LCSO’s investigation determined that Mr. Kessler forced entry into a back door of the location and spent a brief period of time inside before leaving. He appears to have left nothing behind, and it is still unclear what, if anything, he took with him.” The sheriff’s department said it is “working with other law enforcement agencies to locate Mr. Kessler and is asking [for] the public’s assistance.” “Mr. Kessler has a history of criminal behavior and appears to have been in the Washington metropolitan area at least since 2018. He has a California driver’s license,” the office said. Kessler faces an arrest warrant on one charge of burglary. Although the suspect’s motives are unclear, the press release described him as having “no fixed address,” which likely means he’s homeless. Political break-ins during elections have famously impacted US politics before and the Sunday incident immediately sparked questions about the motive — and occurred one day after the Trump campaign said it had been hacked by Iran’s government. In June 1972, operatives linked to then-President Richard Nixon’s campaign burglarized a Democratic office in the Watergate complex in DC — sparking the scandal that forced Nixon to resign in August 1974. In the 2016 campaign, Trump’s then-Democratic foe Hillary Clinton’s campaign staff were hacked and embarrassing emails were released, allegedly at the behest of the Russian government.","summary":"Toby Shane Kessler, 39, broke into the Ashburn office, about an hour's drive west of DC, on Sunday and has not been located by authorities, the Loudoun County Sheriff's Office said.","url":"https://nypost.com/2024/08/14/us-news/toby-shane-kessler-named-as-suspect-wanted-for-breaking-into-trump-campaign-office-in-virginia-officials/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/police-release-name-photo-suspect-87780572.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/p0QFWDvE-RyIcpnTz.mp4","publish_date":"2024-08-14 23:30:12","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.766},{"id":254139594,"title":"Arizona Supreme Court rules fetuses can be called ‘unborn human’ on ballot initiative","text":"The Arizona Supreme Court ruled Wednesday that fetuses can be described as an “unborn human being” in pamphlets informing voters before they decide whether to add a right to an abortion to the state’s constitution. The state’s top court ruled that the phrase, which describes what fetuses become after they have developed in a mother’s womb, “substantially complies” with the impartiality requirement under Arizona law. A full decision is said to be on the way, according to the brief order from the seven-member bench. Chief Justice Ann Scott Timmer and Justice James Beene dissented. Arizona for Abortion Access, the campaign that is backing the ballot initiative, sued to change the language in information pamphlets to merely say “fetus,” arguing the term was more impartial. “We are deeply disappointed in this ruling, but will not be deterred from doing everything in our power to communicate to voters the truth of the Arizona Abortion Access Act,” the group wrote in a statement, calling on residents to vote “YES” on the measure during the November general election. Abortions in Arizona are currently subject to a 15-week ban due to a law passed by Republican lawmakers in 2022 following the Supreme Court decision that allowed states to create gestational limits on such procedures, overturning nearly five decades of precedent under Roe v. Wade. The law provides exceptions for the life of the mother but not for rape or incest. The ballot measure, if approved, would amend the state constitution to allow abortions up to around 23 or 24 weeks after conception and would restrict the state from adopting or enforcing any law that would prohibit access to the procedure. Vice President Kamala Harris, the Democratic nominee, has made reproductive rights a central point of her campaign, and a recent HighGround Public Affairs survey shows her about 3 percentage points ahead of former President Donald Trump, with Harris receiving 44.4% of the support and Trump receiving 41.6%.","summary":"The Arizona Supreme Court ruled Wednesday that fetuses can be described as an &#8220;unborn human being&#8221; in pamphlets informing voters before they decide whether to add a right to an abortion to the state&#8217;s constitution. The state&#8217;s top court ruled that the phrase, which describes what fetuses become after they have developed in a mother&#8217;s [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3122119/arizona-supreme-court-rules-fetuses-called-unborn-human-ballot-initiative/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24226071845198.webp","video":null,"publish_date":"2024-08-14 23:30:12","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.37},{"id":254139588,"title":"Harris campaign deceptively trims Trump post about Elon Musk interview","text":"On Wednesday, Kamala Harris’ campaign page shared a Truth Social post from Donald Trump. In it Trump blamed “the complexity of modern day equipment” for making his voice sound “somewhat different and strange” during a live interview on X with Elon Musk. But while the Harris campaign shared what looked like a screenshot of the post, they cut off the last line, where Trump explained that he released “an actual, and perfect, recording of the conversation.” Exactly why the original broadcast sounded so odd is not totally clear — the Trump campaign did not respond to a request for comment Wednesday about what led to the sound quality issues and what tech they used to fix it. But the Harris campaign’s post left out key context that Trump had released a cleaner version of the recording, making the post look purely like an excuse. “Trump blames his confused, slur-filled disaster of an interview with Elon Musk on ‘the complexity of modern day equipment,’” the KamalaHQ account wrote alongside the truncated post on Threads. [Image: What Trump shared on Truth Social. https://cdn.vox-cdn.com/thumbor/oMJj4R-i_jGcD-ujJcm_R5Q27vA=/0x0:1214x622/1214x622/filters:focal(607x311:608x312)/cdn.vox-cdn.com/uploads/chorus_asset/file/25573011/Screenshot_2024_08_14_at_7.13.35_PM.png] [Image: What the Harris campaign posted. https://cdn.vox-cdn.com/thumbor/J6pXDPKJu9cCXLZo3tyIVxOkO78=/0x0:1236x1096/1236x1096/filters:focal(618x548:619x549)/cdn.vox-cdn.com/uploads/chorus_asset/file/25573009/Screenshot_2024_08_14_at_7.13.24_PM.png] It’s not the only example of subtle narrative tweaks the campaign has made to put itself in a more favorable light, or Donald Trump in a less favorable one. On Tuesday, Axios reported that the campaign has bought several ads linking to news stories from outlets like The Associated Press, CNN, and USA Today that show up at the top of Google search results pages. While these sponsored links send users to real news articles, the headline and text of the ads are written by the campaign, though it’s presented by Google in a way that appears like the outlet itself wrote it. Google allows for this and the Harris campaign is certainly not the first to use this tactic. But Facebook actually got rid of a similar feature in 2017 after The Wall Street Journal flagged examples of advertisers changing news site headlines in promoted content. Google’s ad library shows the Trump campaign has not run ads on Google Search. The headlines are far more glowing than would appear on most news sites. “VP Harris Protects Democracy - Trump Defends Jan 6 Comments,” reads one Harris-sponsored headline linking to The Independent. It’s not clear which specific article it linked to, but The Independent wasn’t happy. A spokesperson said it would seek for the ads to be removed and that it’s “entirely wrong for anyone to put fake headlines under The Independent brand. We object fiercely and believe it is undermining of what politics and journalism should be about.” Trump, of course, has made far grander, more numerous, and more deceptive statements over the course of his campaign. Just recently, he falsely said Harris “A.I.’d” a crowd of thousands that showed up to see her at a rally in Michigan. He also created a false narrative that Harris “happened to turn Black” as she aspired to higher office. Harris attended the historically black college Howard University, and her father is Jamaican-American. The Harris campaign has generally favored the informal language and style of modern social media — quickly adopting the “brat” aesthetic in a nod to Charli XCX’s popular album, for example. It’s raising a new set of questions about how to fairly present information and how viewers process internet content. Is an incomplete quote in what looks like a social media screenshot different from a carefully cropped soundbite in an attack ad? For Harris’ campaign, the answer seems to be no. The Harris campaign declined to comment.","url":"https://www.theverge.com/2024/8/14/24220601/harris-campaign-trump-truth-social-elon-musk-interview-audio","image":"https://cdn.vox-cdn.com/thumbor/_VEM0h8JH5xvAbDsaRb0XT_SJO8=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/25545958/STK466_STK205_STK175_ELECTION_2024_TRUMP_HARRIS_CVIRGINIA_C.jpg","video":null,"publish_date":"2024-08-14 23:25:34","author":"Lauren Feiner","authors":["Lauren Feiner"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.274},{"id":254138818,"title":"The only change Kamala Harris offers on Bidenomics is the label","text":"Kamala Harris is “hoping to distance herself from President Biden’s unpopularity on the economy,” her stenographers at Axios report. Get set for some epic gaslighting, as Harris tries to escape the blame not just for policies she backed these last 3½ years, but core Democratic stances. In her stump speech, she keeps vowing to bring down grocery bills on Day 1 in the Oval Office — and inflation, too. But if it were that easy, why not just tell her current partner in crime, the sitting president, how to do it? The fact is, the Federal Reserve has carried the weight on slowing inflation, by slamming interest rates through the roof . . . and thereby killing job growth and slowing the economy to near-recession levels. The Biden-Harris contribution has been exclusively on the goosing-inflation end, by putting Uncle Sam on a long-term track of spending $2 trillion more a year than he takes in. Remember: The economy started roaring back from the COVID shutdowns in the last quarter of 2020. Then Biden-Harris sought to grab credit for the rebound by ramming through their American Recovery Act, which dumped billions in new spending on an already-hot economy — and so triggered the record-breaking rise in prices, hitting 9% before the Fed began its clampdown. And while Harris has disowned some of her most extreme past positions, she hasn’t said a word about slowing spending. She certainly won’t let go of any of the green pork at the heart of the big-spending “Inflation Reduction Act.” And while she says she no longer wants to end all fracking, she won’t reverse the Biden era war on fossil fuels generally — the freezes on new drilling permits, the regular “no”s to new pipelines, the ever-tighter emissions standards for everything from power plants to factories to cars. On inflation, all Harris can offer is nickel-and-dime household savings the same as Biden-Harris have been gaslighting voters about for the last two years: Basically pretending it’s all about “shrinkflation,” hidden “junk fees” and other corporate skullduggery. She says strengthening the middle class will be a central goal of her presidency, but so did Joe. What, big picture, will she do differently? Harris has nothing, because the entire Democratic Party has nothing. The Trump-Vance ticket offers a pretty clear path to the prosperity the nation saw in Donald Trump’s first term, until COVID hit. Above all, as Trump noted Wednesday in North Carolina, free up America’s energy producers. We were energy-independent when he left office, with exports booming. Biden, enforcing his party’s core agenda, turned the curve down. Cheap energy is by far the best way to boost American manufacturing and the economy generally; it was a huge reason working-class wages rose rapidly under Trump, for the first time in decades. Other parts of Trumponomics helped: a major war on destructive federal regulations (also reversed once Democrats took over), tax relief (which Harris will end on her watch); pushing agencies across the board to prioritize growth over special interests. Harris has copied one single Trump proposal: no tax on tips. Good: Now Democrats can’t block it (even though their “Inflation Reduction Act” included a major IRS crackdown on reporting tips). But even if Harris wanted to copy the Trump policies that offer major hope for a booming, low-inflation US economy, her own party wouldn’t let her. Kamala Harris, even if she completely breaks with her Hollywood Democrat past, is literally just a replacement Dem — a (slightly) fresher face on a disastrous agenda. Any “distance” she offers from Bidenomics is just a new label on the same old, same old.","summary":"Kamala Harris is \"hoping to distance herself from President Biden's unpopularity on the economy,\" her stenographers at Axios report.","url":"https://nypost.com/2024/08/14/opinion/the-only-change-kamala-harris-offers-on-bidenomics-is-the-label/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/KAM1212.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-14 23:21:13","author":"Post Editorial Board","authors":["Post Editorial Board"],"language":"en","source_country":"us","sentiment":0.17},{"id":254138746,"title":"On Trump criticism, Vance tells Fox News former president's 'off the cuff' comments 'part of his appeal'","text":"EXCLUSIVE - Byron Center, MI - Donald Trump's running mate has an answer for the blunt advice from allies and fellow Republicans that the former president should stick to policy and messaging instead of questioning Vice President Kamala Harris' crowd sizes at her rallies, her race, or attacks on her intellect. \"I think one of the things people actually love about Donald Trump in politics is he’s not unwilling to speak off the cuff. He says what’s actually on his mind. He’s not always filtered. I think that’s a good thing and part of his appeal,\" GOP vice presidential nominee Sen. JD Vance said Wednesday in a national exclusive interview with Fox News Digital. But Vance, speaking ahead of a campaign event in battleground Michigan, also emphasized that \"if you look at this race, we’re talking about policy. That’s 90% of what we’re doing. And I think that’s going to keep on happening.\" Harris has been riding a wave of momentum - witnessed in public opinion polling, in her soaring fundraising, and in her large crowds she's attracting on the campaign trail - in the three and a half weeks since she replaced President Biden atop the Democrats' 2024 ticket. TRUMP CAMPAIGN PLANS COUNTER-PROGRAMMING DURING DEMOCRATS' CONVENTION While criticizing Harris over key issues such as border security, crime and inflation, Trump has also continuously slammed Harris and insulted her during speeches, news conferences, and in social media posts. Sources in Trump's political orbit tell Fox News that top advisers to the former president are quietly aiming to persuade Trump to tamp down the insults to Harris and the questioning of the vice president's racial identity and instead focus on branding her an ultra-liberal and spotlighting her stance on the border, crime and inflation TRUMP ARGUES HARRIS IS MORE LIBERAL THAN BERNIE SANDERS - HERE'S WHAT THE VERMONT SENATOR TOLD FOX NEWS Trump allies are also publicly pitching Trump to refocus his attention. \"You’ve got to make this race not on personalities,\" former House Speaker Kevin McCarthy said Monday in an interview on Fox News' \"America's Newsroom.\" \"Stop questioning the size of her crowds and start questioning her position.\" McCarthy emphasized that Trump has \"a short time frame to do it, so don’t sit back. Get out there and start making the case.\" Trump's top rival from the Republican presidential primaries earlier this year - former UN ambassador and former South Carolina Gov. Nikki Haley, during an interview with Bret Baier Tuesday on Fox News' \"Special Report,\" also had some unsolicited advice for her former boss. Haley, who reiterated that she wants Trump to win the presidential election, emphasized that \"the campaign is not going to win talking about crowd sizes. It's not going to win talking about what race Kamala Harris is. It's not going to win. Talking about whether she's dumb. It's not. You can't win on those things. The American people are smart. Treat them like they're smart.\" WHAT NIKKI HALEY TOLD FOX NEWS BRET BAIER ABOUT TRUMP Following his interview with Fox News Digital, Vance was also asked about the criticism of Trump from fellow Republicans as he took questions from reporters at the conclusion of his campaign event at a trucking company in this southwestern Michigan town just south of Grand Rapids. \"To the people who say that Donald Trump should do something different, they had an opportunity to make Donald Trump do something different by challenging him over three separate primaries, every single one of which he won. I think Donald Trump has earned the right to run the kind of campaign that he wants to run,\" Vance emphasized. CLICK HERE TO GET THE FOX NEWS APP But the senator added that \"if you listen to what Donald J Trump says, if you look at what I say, we are prosecuting the case against Kamala Harris on policy.\" And taking aim at Harris, Vance charged that \"we’d much rather have an American president who is who he is, who’s willing to offend us, who’s willing to tell us the truth, who isn’t a fake who hides behind a teleprompter.\" Get the latest updates from the 2024 campaign trail, exclusive interviews and more at our Fox News Digital election hub.","summary":"On GOP criticism of Trump, running mate Sen. JD Vance tells Fox News Digital former president&apos;s &apos;off the cuff&apos; comments part of his appeal, but adds addressing policy &apos;90% of what we&apos;re doing&apos;","url":"https://www.foxnews.com/politics/trump-criticism-vance-tells-fox-news-former-presidents-off-cuff-comments-part-his-appeal","image":"https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/08/931/523/JD-Vance-Byron-Corner-MI-August-14-2024-scaled.jpg?ve=1&tl=1","video":null,"publish_date":"2024-08-14 23:14:19","author":"Paul Steinhauser","authors":["Paul Steinhauser"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.015},{"id":254138808,"title":"Iran Hackers Target Harris And Trump Campaigns: Google","text":"Google on Tuesday confirmed that hackers backed by Iran are targeting the campaigns of US presidential rivals Kamala Harris and Donald Trump.A hacker group known as \"APT42\" linked to Iran's Islamic Revolutionary Guard Corps went after high-profile individuals and organizations in Israel and the United States, including government officials and political campaigns, according to a threat report released by Google.Democratic presidential candidate Kamala Harris's campaign said Tuesday it had been targeted by foreign hackers, days after rival Donald Trump's campaign suggested that it had been hacked by Iran.\"In July, the campaign legal and security teams were notified by the FBI that we were targeted by a foreign actor influence operation,\" a Harris campaign official told AFP.\"We have robust cybersecurity measures in place and are not aware of any security breaches of our systems resulting from those efforts.\" Google's threat analysis group continues to see unsuccessful attempts from APT42 to compromise personal accounts of individuals affiliated with President Joe Biden, Vice President Harris and Trump, the report said.The hacking group works by gleaning information about targets and tailoring \"phishing\" efforts to dupe victims into revealing log-in information for accounts like Gmail.Examples given in the report included posing as a think tank or other credible contact to lure victims to fake video meeting landing pages, where log-in credentials are needed to take part.While technical tools abound in hacker arsenals, some opt for \"social engineering\" tactics that trick people into clicking on booby-trapped links or logging in to realistic replicas of legitimate web pages.Google said it disrupted APT42 attempts to hack the campaigns of Biden and Trump in 2020.In May and June of this year, the Iranian hacker group's targets included personal email accounts of about a dozen people affiliated with Biden or Trump and Google blocked numerous attempts by APT42 to log in to their accounts, according to the report.Google also reported that the group got into the personal Gmail account of an influencial political consultant.\"APT42 is a sophisticated, persistent threat actor and they show no signs of stopping their attempts to target users and deploy novel tactics,\" Google said.\"This spring and summer, they have shown the ability to run numerous simultaneous phishing campaigns, particularly focused on Israel and the United States.\"Google urged high-risk individuals associated with the coming election to remain vigilant and to take advantage of ramped-up defenses offered by the internet firm. The US State Department warned Iran on Monday of consequences over election interference following the Trump campaign's announcement that it had been hacked.The Trump campaign has suggested that Iran was behind the breach, which resulted in private documents being sent to reporters, including research the campaign used to vet running mate J.D. Vance.It warned media outlets against reprinting the documents, saying that such action would be \"doing the bidding of America's enemies.\"The tone was different from 2016, when Trump said at a news conference that he hoped Russia would \"find\" Hillary Clinton's emails, remarks widely viewed as encouraging further hacks of his election opponent.US intelligence concluded that Russia intervened in the 2016 election to support Trump, who has rejected the findings.","summary":"Google on Tuesday confirmed that hackers backed by Iran are targeting the campaigns of US presidential rivals Kamala Harris and Donald Trump.","url":"https://www.ibtimes.com/iran-hackers-target-harris-trump-campaigns-google-3739804","image":"https://d.ibtimes.com/en/full/4541809/google-says-hacker-group-linked-irans-islamic-revolutionary-guard-using-phishing-tactics.jpg","video":null,"publish_date":"2024-08-14 23:12:17","author":"Glenn Chapman","authors":["Glenn Chapman"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.338},{"id":254138628,"title":"Google confirms an Iranian group is trying to access emails linked to both US presidential campaigns","text":"NEW YORK (AP) — Google said Wednesday that an Iranian group linked to the country’s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company’s threat intelligence arm said the group is still actively targeting people associated with Biden, Trump and Vice President Kamala Harris, who replaced Biden as the Democratic candidate last month when he dropped out. It said those targeted have included current and former government officials, as well as presidential campaign affiliates. The new report from Google’s Threat Analysis Group affirms and expands on a Microsoft report released Friday that revealed suspected Iranian cyber intrusion in this year’s U.S. presidential election. It sheds light on how foreign adversaries are ramping up their efforts to disrupt the election that is now less than three months away. Google’s report said its threat researchers detected and disrupted a “small but steady cadence” of the Iranian attackers using email credential phishing, a type of cyberattack where the attacker poses as a trusted sender to try to get an email recipient to share their login details. John Hultquist, chief analyst for the company’s threat intelligence arm, said the company sends suspected targets of these attacks a Gmail popup that warns them that a government-backed attacker might be trying to steal their password. The report said Google observed the group gaining access to one high-profile political consultant’s personal Gmail account. Google reported the incident to the FBI in July. Microsoft’s Friday report had shared similar information, noting that the email account of a former senior adviser to a presidential campaign had been compromised and weaponized to send a phishing email to a high-ranking campaign official. The group is familiar to Google’s threat intelligence arm and other researchers, and this isn’t the first time it has tried to interfere in U.S. elections, Hultquist said. The report noted that the same Iranian group targeted both the Biden and Trump campaigns with phishing attacks during the 2020 cycle, as early as June of that year. The group also has been prolific in other cyber espionage activity, particularly in the Middle East, the report said. In recent months, as the Israel-Hamas War has aggravated tensions in the region, that activity has included email phishing campaigns targeted at Israeli diplomats, academics, non-governmental organizations and military affiliates. Trump’s campaign said Saturday that it had been hacked and that sensitive internal documents were stolen and distributed. It declared that Iranian actors were to blame. The same day, Politico revealed it had received leaked internal Trump campaign documents by email, though it wasn’t clear whether the leaked documents were related to the suspected Iranian cyber activity. The Washington Post and The New York Times also received the documents. While the Trump campaign hasn’t provided specific evidence linking Iran to the hack, both Trump and his longtime friend and former adviser Roger Stone have said they were contacted by Microsoft related to suspected cyber intrusions. Stone’s email was compromised by hackers targeting Trump’s campaign, a person familiar with the matter said. Google and Microsoft wouldn’t identify the people targeted in the Iranian intrusion attempts or confirm that Stone was among them. Google did confirm that the Iranian group in its report, which it calls APT42, is the same as the one in Microsoft’s research. Microsoft refers to the group as Mint Sandstorm. Harris’ campaign has declined to say whether it has identified any state-based intrusion attempts, but has said it vigilantly monitors cyber threats and isn’t aware of any security breaches of its systems. The FBI on Monday confirmed that it’s investigating the intrusion of the Trump campaign. Two people familiar with the matter said the FBI also is investigating attempts to gain access to the Biden-Harris campaign. The reports of Iranian hacking come as U.S. intelligence officials have warned of persistent and mounting efforts from both Russia and Iran to influence the U.S. election through their online activity. Beyond these hacking incidents, groups linked to the countries have used fake news websites and social media accounts to churn out content that appears intended to sway voters’ opinions. While neither Microsoft nor Google specified Iran’s intentions in the U.S. presidential race, U.S. officials have previously hinted that Iran particularly opposes Trump. U.S. officials also have expressed alarm about Tehran’s efforts to seek retaliation for a 2020 strike on an Iranian general that was ordered by Trump. Iran’s mission to the United Nations, when asked about the claim of the Trump campaign, denied being involved. “We do not accord any credence to such reports,” the mission told The Associated Press. “The Iranian government neither possesses nor harbors any intent or motive to interfere in the United States presidential election.” The mission did not immediately respond to a request for comment Wednesday about Google’s report. ___ Associated Press writer Michael Weissenstein contributed to this report. ___ The Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content. Ali Swenson, The Associated Press","summary":"NEW YORK (AP) — Google said Wednesday that an Iranian group linked to the country’s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company&#8217;s threat intelligence arm said the group is still actively targeting [&#8230;]","url":"https://toronto.citynews.ca/2024/08/14/google-confirms-an-iranian-group-is-trying-to-access-emails-linked-to-both-us-presidential-campaigns/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/c9f2e38a7243c740472c2c15cc61c0e05c270ec4ecdfd4bc32d96bac497de57f.jpg","video":null,"publish_date":"2024-08-14 23:09:43","author":"Ali Swenson,News Staff","authors":["Ali Swenson","News Staff"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.565},{"id":254138764,"title":"Biden scolds reporters and advises them to write according to his views after asserting victory over inflation","text":"President Joe Biden shushed reporters at an event Wednesday for social media influencers at the White House. The president joined 100 TikTokkers for the White House’s first-ever ‘Creator Economy Conference’ in the Indian Treaty Room. He started off the event by asking, ‘Now, is that the real press or the fake press back there?’ a phrase commonly used by his ex-rival, former President Donald Trump. Biden continued by telling the White House reporters stationed in the back of the room that they should cover the economy more positively. ‘We’re going to have a soft landing,’ he answered when asked if the U.S. had beaten inflation. ‘My policies are working. Start writing that way, OK?’ Later, at the White House press briefing, Jared Bernstein, chair of the United States Council of Economic Advisers, was asked what the president meant by that jab. ‘Well, what do you think he meant by “start writing that way?”‘ Bernstein said. ‘That’s the first that I’ve heard that he said that, I can only interpret it to mean that he think that’s not being done.’ Also at the influencers event, Biden talked about how his grandchildren were getting their news through social media instead of through traditional sources. ‘With all due respect, they don’t read the same newspapers or watch the same television I do,’ the president said. ‘They listen to all of you. They listen to all of you,’ he told the social media stars. ‘That fact is that you are the future. You are the future,’ he continued. ‘And there are more people who want to go into your business than any other these days,’ Biden added. ‘You think – when I retire, where do you think I’m going? I got contacts, man. I – you all think I’m kidding.’ He commended the social media influencers for breaking through ‘in ways that I think are going to change the entire dynamic of the way in which we communicate.’ ‘And that’s why I invited you to the White House, because I’m looking for a job,’ the president said to laughs. Biden, who dropped out of the presidential race last month, made a number of retirement and old-age jokes throughout his appearance. ‘Now, I know I only look like I’m 40,’ he said at one point, adding, ‘You can smile.’ He noted that he’d been in politics for ‘800 years.’ ‘I wanted to say something else to you and I can’t remember what it was now,’ the 81-year-old also said. The president bopped between being critical and then more friendly to the press. ‘The national press. They’re good people. They don’t – they’re not that crazy about me, but I like them,’ he said at one point. But then when he got to the Q&A section of the even, he told the ‘non-press’ – the influencers in the room – that he would only take questions from them. That didn’t stop White House reporters from trying. A reporter shouted a question toward Biden about the Venezuelan election. ‘I’m not talking to you guys,’ Biden responded. When she tried again, Biden let out a ‘shush.’ ‘Yes. I’m not going to answer your question. I’m talking to them first – OK? The audience first. OK?’ the president said, before telling reporters they should writing more positive stories on inflation.","summary":"Internewscast Journal\n\nInternewscast\n\n\nPresident Joe Biden shushed reporters at an event Wednesday for social media&#8230;\n\n\nThis Post: Biden scolds reporters and advises them to write according to his views after asserting victory over inflation first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/biden-scolds-reporters-and-advises-them-to-write-according-to-his-views-after-asserting-victory-over-inflation/","image":"https://i.dailymail.co.uk/1s/2024/08/14/21/88535641-0-image-a-1_1723665970201.jpg","video":null,"publish_date":"2024-08-14 23:08:29","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":-0.222},{"id":254139672,"title":"Google confirms an Iranian group is trying to access emails linked to both US presidential campaigns","text":"By ALI SWENSON NEW YORK (AP) — Google said Wednesday that an Iranian group linked to the country’s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company’s threat intelligence arm said the group is still actively targeting people associated with Biden, Trump and Vice President Kamala Harris, who replaced Biden as the Democratic candidate last month when he dropped out. It said those targeted have included current and former government officials, as well as presidential campaign affiliates. The new report from Google’s Threat Analysis Group affirms and expands on a Microsoft report released Friday that revealed suspected Iranian cyber intrusion in this year’s U.S. presidential election. It sheds light on how foreign adversaries are ramping up their efforts to disrupt the election that is now less than three months away. Google’s report said its threat researchers detected and disrupted a “small but steady cadence” of the Iranian attackers using email credential phishing, a type of cyberattack where the attacker poses as a trusted sender to try to get an email recipient to share their login details. John Hultquist, chief analyst for the company’s threat intelligence arm, said the company sends suspected targets of these attacks a Gmail popup that warns them that a government-backed attacker might be trying to steal their password. The report said Google observed the group gaining access to one high-profile political consultant’s personal Gmail account. Google reported the incident to the FBI in July. Microsoft’s Friday report had shared similar information, noting that the email account of a former senior adviser to a presidential campaign had been compromised and weaponized to send a phishing email to a high-ranking campaign official. The group is familiar to Google’s threat intelligence arm and other researchers, and this isn’t the first time it has tried to interfere in U.S. elections, Hultquist said. The report noted that the same Iranian group targeted both the Biden and Trump campaigns with phishing attacks during the 2020 cycle, as early as June of that year. The group also has been prolific in other cyber espionage activity, particularly in the Middle East, the report said. In recent months, as the Israel-Hamas War has aggravated tensions in the region, that activity has included email phishing campaigns targeted at Israeli diplomats, academics, non-governmental organizations and military affiliates. Trump’s campaign said Saturday that it had been hacked and that sensitive internal documents were stolen and distributed. It declared that Iranian actors were to blame. The same day, Politico revealed it had received leaked internal Trump campaign documents by email, though it wasn’t clear whether the leaked documents were related to the suspected Iranian cyber activity. The Washington Post and The New York Times also received the documents. While the Trump campaign hasn’t provided specific evidence linking Iran to the hack, both Trump and his longtime friend and former adviser Roger Stone have said they were contacted by Microsoft related to suspected cyber intrusions. Stone’s email was compromised by hackers targeting Trump’s campaign, a person familiar with the matter said. Google and Microsoft wouldn’t identify the people targeted in the Iranian intrusion attempts or confirm that Stone was among them. Google did confirm that the Iranian group in its report, which it calls APT42, is the same as the one in Microsoft’s research. Microsoft refers to the group as Mint Sandstorm. Harris’ campaign has declined to say whether it has identified any state-based intrusion attempts, but has said it vigilantly monitors cyber threats and isn’t aware of any security breaches of its systems. The FBI on Monday confirmed that it’s investigating the intrusion of the Trump campaign. Two people familiar with the matter said the FBI also is investigating attempts to gain access to the Biden-Harris campaign. The reports of Iranian hacking come as U.S. intelligence officials have warned of persistent and mounting efforts from both Russia and Iran to influence the U.S. election through their online activity. Beyond these hacking incidents, groups linked to the countries have used fake news websites and social media accounts to churn out content that appears intended to sway voters’ opinions. While neither Microsoft nor Google specified Iran’s intentions in the U.S. presidential race, U.S. officials have previously hinted that Iran particularly opposes Trump. U.S. officials also have expressed alarm about Tehran’s efforts to seek retaliation for a 2020 strike on an Iranian general that was ordered by Trump. Iran’s mission to the United Nations, when asked about the claim of the Trump campaign, denied being involved. “We do not accord any credence to such reports,” the mission told The Associated Press. “The Iranian government neither possesses nor harbors any intent or motive to interfere in the United States presidential election.” The mission did not immediately respond to a request for comment Wednesday about Google’s report. ___ Associated Press writer Michael Weissenstein contributed to this report. ___ The Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.","summary":"By ALI SWENSON NEW YORK (AP) &#8212; Google said Wednesday that an Iranian group linked to the country&#8217;s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company&#8217;s threat intelligence arm said the group is [&#8230;]","url":"https://www.twincities.com/2024/08/14/google-confirms-an-iranian-group-is-trying-to-access-emails-linked-to-both-us-presidential-campaigns-2/","image":"https://www.twincities.com/wp-content/uploads/2020/08/TCFallback.jpg","video":null,"publish_date":"2024-08-14 23:07:42","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.56},{"id":254138706,"title":"US inflation drops to a 3-year-low, clearing way for rate cuts","text":"By Christopher Rugaber | Associated Press WASHINGTON — Year-over-year inflation reached its lowest level in more than three years in July, the latest sign that the worst price spike in four decades is fading and setting up the Federal Reserve for an interest rate cut in September. Wednesday’s report from the Labor Department showed that consumer prices rose just 0.2% from June to July after dropping slightly the previous month. Measured from a year earlier, prices rose 2.9%, down from 3% in June. It was the mildest gain since March 2021. The ongoing inflation slowdown could affect the presidential campaign, given that former President Donald Trump has highlighted rampant inflation as a key failing of the Biden administration and its energy policies. Vice President Kamala Harris has said she would soon unveil new proposals to “bring down costs and also strengthen the economy overall.” The government said nearly all of July’s inflation reflected higher rental prices and other housing costs, a trend that, according to real-time data, is easing. As a result, housing costs should rise more slowly in the coming months, contributing to lower inflation. The report showed that inflation is steadily falling closer to the Fed’s 2% target — though not too quickly, which might suggest that the economy is weakening, said Tara Sinclair, an economist at George Washington University and a former Treasury Department official. “It’s a comforting report, both because it is going in the right direction and because it is not doing anything too dramatic,” Sinclair said. “It is exactly what we wanted to see.” In July, grocery prices rose just 0.1% and are a scant 1.1% higher than they were a year earlier, a much slower pace of growth than in previous years. Yet many Americans are still struggling with food prices, which remain 21% above where they were three years ago. Gas prices were unchanged from June to July and have actually fallen 2.2% in the past year. Clothing prices also dropped last month; they’re nearly unchanged from 12 months earlier. New and used car prices fell in July, too. Used car prices, which had skyrocketed during the pandemic, have tumbled nearly 11% in the past year. Some food prices, including for meat, fish and eggs, are still increasing faster than before the pandemic. Dairy and fruit and vegetable prices, though, fell in July. Even as inflation — the rate of price increases — keeps slowing, many people are still struggling with daily costs that, on average, are still about 20% higher than they were three years ago. That’s true even though average U.S. wages have surpassed inflation for more than a year. Ariel Borchuk, who lives in the Harlem area of New York City, complained that the government’s inflation reports don’t mean anything to “regular people” like himself. “Everything,” he said, “is expensive. What more do you need to know?” Borchuk, 48, who works in the catering business, had just grabbed a hot fried chicken sandwich for $7.99 at a grocery store on Manhattan’s Upper East Side. It’s something he says he really can’t afford. Borchuk said he’s been cooking more at home and eating out less and buying more of his groceries at Costco, where he said he can get good deals. Austan Goolsbee, president of the Federal Reserve’s Chicago branch, said Wednesday in an interview with The Associated Press that the July data shows that inflation is clearly on track to return to the central bank’s 2% target. He also noted that there are signs that the job market is weakening even while the Fed’s key rate remains at its highest level in decades. Goolsbee’s remarks suggested that he would support a series of rate cuts in the coming months. At a White House event Wednesday, President Joe Biden was asked whether the nation had defeated inflation. “Yes, yes, yes,” he said. “I’ve told you we’re going to have a soft landing,” he added, referring to an economy in which inflation is tamed without a steep recession. For nearly a year, cooling inflation has provided gradual relief to America’s consumers, who were stung by the price surges that erupted three years ago. Inflation peaked two years ago at 9.1%, the highest level in four decades. In July, excluding volatile food and energy costs, so-called core prices climbed a mild 0.2% from June, after a 0.1% increase the previous month. And compared with a year earlier, core inflation slowed from 3.3% to 3.2% — the lowest level since April 2021. Core prices are closely watched by economists because they typically provide a better read of where inflation is headed. When the central bank lowers its benchmark rate, over time it tends to reduce the cost of borrowing for consumers and businesses. Mortgage rates have already declined in anticipation of the Fed’s first rate reduction. Many companies have slowed their price increases as consumers have become more resistant to paying more. Mark Barrocas, CEO of SharkNinja, a small appliance-maker in Needham, Massachusetts, said the company raised its prices 5% to 7% in 2021 and 2022 but hasn’t done so since. For some items, it recently reduced prices to where they were before the earlier hikes took effect. Inflation has eased substantially in the past two years as global supply chains have been repaired, a spate of apartment construction in many large cities has cooled rental costs and higher interest rates have slowed auto sales, forcing dealers to offer better deals to potential car buyers. Consumers, particularly lower-income ones, are also becoming more price-sensitive, forgoing high-priced items or shifting to cheaper alternatives. This has forced many companies to rein in price hikes or even offer lower prices. AP Writers Anne D’Innocenzio in New York and Fatima Hussein in Washington contributed to this report.","summary":"When the central bank lowers its benchmark rate, over time it tends to reduce the cost of borrowing for consumers and businesses. Mortgage rates have already declined in anticipation of the Fed's first rate reduction.","url":"https://www.mercurynews.com/2024/08/14/us-inflation-drops-to-a-3-year-low-clearing-way-for-rate-cuts/","image":"https://www.mercurynews.com/wp-content/uploads/2024/08/sjm-Prices_201376496.jpg?w=1024","video":null,"publish_date":"2024-08-14 23:07:42","author":"The Associated Press","authors":["The Associated Press"],"language":"en","source_country":"us","sentiment":-0.258},{"id":254139374,"title":"Google confirms an Iranian group is trying to access emails linked to both US presidential campaigns","text":"By ALI SWENSON NEW YORK (AP) — Google said Wednesday that an Iranian group linked to the country’s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company’s threat intelligence arm said the group is still actively targeting people associated with Biden, Trump and Vice President Kamala Harris, who replaced Biden as the Democratic candidate last month when he dropped out. It said those targeted have included current and former government officials, as well as presidential campaign affiliates. The new report from Google’s Threat Analysis Group affirms and expands on a Microsoft report released Friday that revealed suspected Iranian cyber intrusion in this year’s U.S. presidential election. It sheds light on how foreign adversaries are ramping up their efforts to disrupt the election that is now less than three months away. Google’s report said its threat researchers detected and disrupted a “small but steady cadence” of the Iranian attackers using email credential phishing, a type of cyberattack where the attacker poses as a trusted sender to try to get an email recipient to share their login details. John Hultquist, chief analyst for the company’s threat intelligence arm, said the company sends suspected targets of these attacks a Gmail popup that warns them that a government-backed attacker might be trying to steal their password. The report said Google observed the group gaining access to one high-profile political consultant’s personal Gmail account. Google reported the incident to the FBI in July. Microsoft’s Friday report had shared similar information, noting that the email account of a former senior adviser to a presidential campaign had been compromised and weaponized to send a phishing email to a high-ranking campaign official. The group is familiar to Google’s threat intelligence arm and other researchers, and this isn’t the first time it has tried to interfere in U.S. elections, Hultquist said. The report noted that the same Iranian group targeted both the Biden and Trump campaigns with phishing attacks during the 2020 cycle, as early as June of that year. The group also has been prolific in other cyber espionage activity, particularly in the Middle East, the report said. In recent months, as the Israel-Hamas War has aggravated tensions in the region, that activity has included email phishing campaigns targeted at Israeli diplomats, academics, non-governmental organizations and military affiliates. Trump’s campaign said Saturday that it had been hacked and that sensitive internal documents were stolen and distributed. It declared that Iranian actors were to blame. The same day, Politico revealed it had received leaked internal Trump campaign documents by email, though it wasn’t clear whether the leaked documents were related to the suspected Iranian cyber activity. The Washington Post and The New York Times also received the documents. While the Trump campaign hasn’t provided specific evidence linking Iran to the hack, both Trump and his longtime friend and former adviser Roger Stone have said they were contacted by Microsoft related to suspected cyber intrusions. Stone’s email was compromised by hackers targeting Trump’s campaign, a person familiar with the matter said. Google and Microsoft wouldn’t identify the people targeted in the Iranian intrusion attempts or confirm that Stone was among them. Google did confirm that the Iranian group in its report, which it calls APT42, is the same as the one in Microsoft’s research. Microsoft refers to the group as Mint Sandstorm. Harris’ campaign has declined to say whether it has identified any state-based intrusion attempts, but has said it vigilantly monitors cyber threats and isn’t aware of any security breaches of its systems. The FBI on Monday confirmed that it’s investigating the intrusion of the Trump campaign. Two people familiar with the matter said the FBI also is investigating attempts to gain access to the Biden-Harris campaign. The reports of Iranian hacking come as U.S. intelligence officials have warned of persistent and mounting efforts from both Russia and Iran to influence the U.S. election through their online activity. Beyond these hacking incidents, groups linked to the countries have used fake news websites and social media accounts to churn out content that appears intended to sway voters’ opinions. While neither Microsoft nor Google specified Iran’s intentions in the U.S. presidential race, U.S. officials have previously hinted that Iran particularly opposes Trump. U.S. officials also have expressed alarm about Tehran’s efforts to seek retaliation for a 2020 strike on an Iranian general that was ordered by Trump. Iran’s mission to the United Nations, when asked about the claim of the Trump campaign, denied being involved. “We do not accord any credence to such reports,” the mission told The Associated Press. “The Iranian government neither possesses nor harbors any intent or motive to interfere in the United States presidential election.” The mission did not immediately respond to a request for comment Wednesday about Google’s report. ___ Associated Press writer Michael Weissenstein contributed to this report. ___ The Associated Press receives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP’s democracy initiative here. The AP is solely responsible for all content.","summary":"By ALI SWENSON NEW YORK (AP) &#8212; Google said Wednesday that an Iranian group linked to the country&#8217;s Revolutionary Guard has tried to infiltrate the personal email accounts of roughly a dozen people linked to President Joe Biden and former President Donald Trump since May. The tech company&#8217;s threat intelligence arm said the group is [&#8230;]","url":"https://www.bostonherald.com/2024/08/14/google-confirms-an-iranian-group-is-trying-to-access-emails-linked-to-both-us-presidential-campaigns-2/","image":"https://www.bostonherald.com/wp-content/uploads/2018/11/Herald_BridgePhoto.jpg","video":null,"publish_date":"2024-08-14 23:07:42","author":"Associated Press","authors":["Associated Press"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.56},{"id":254138716,"title":"Walz accepts invite for VP debate on Oct. 1","text":"Minnesota Gov. Tim Walz on Wednesday accepted an invitation from CBS News for a vice presidential debate against Ohio Sen. JD Vance on Oct. 1. Walz responded to the network's proposal in a post on X for the two candidates to face off onstage weeks before Election Day. “See you on October 1, JD,\" Walz wrote in his own post seven minutes after the CBS tweet. A Harris campaign official followed up in a statement saying the campaign had “accepted CBS’ invitation to a Vice Presidential Candidate Debate on October 1. Governor Walz looks forward to debating JD Vance -- if he shows up.” A spokesperson for Vance did not immediately respond to a request for comment Wednesday, and Vance did not answer shouted questions on the tarmac in Boone County, Kentucky, about the CBS invitation. CBS said Wednesday that it had invited the two vice presidential candidates to debate and that it proposed four dates as options: Sept. 17, Sept. 24, Oct. 1 and Oct. 8. \"We look forward to their responses,\" the network said. A spokesperson for CBS News did not immediately respond to a request for comment about whether Vance had responded. Former President Donald Trump said last week that his campaign had agreed to participate in a vice presidential debate on CBS News, adding that Vance, “has really stepped up. He’s doing a fantastic job.” No debate date was specified. Trump and Vice President Kamala Harris have agreed to a Sept. 10 debate hosted by ABC.","summary":"CBS News said it had invited both Minnesota Gov. Tim Walz and Ohio Sen. JD Vance to debate on one of four proposed dates. Vance has yet to respond.","url":"https://www.nbcnews.com/politics/2024-election/walz-accepts-invite-vp-debate-oct-1-rcna166657","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-08/240814-tim-walz-ac-634p-bcb84c.jpg","video":null,"publish_date":"2024-08-14 23:07:40","author":"Zoë Richards","authors":["Zoë Richards"],"language":"en","catgory":"entertainment","source_country":"us","sentiment":-0.297},{"id":254138450,"title":"Trump campaigns on defense as he plans second attention-grabbing press conference","text":"Donald Trump announced Wednesday morning that he would host a press conference this week — his second in seven days, after a previous one said little of substance. The Republican nominee for president has called to meet the press on Thursday at his Bedminster club in New Jersey, hoping to avoid a slew of negative headlines that followed last week’s, where he repeated previous lies and offered nothing new. The announcment comes as he was in North Carolina attempting to head off what appears to be a Kamala Harris surge that has put a number of red-leaning swing states back into sudden contention. Trump, now almost one month out from the GOP convention, once planned to storm through the rest of the summer pummeling ex-opponent Joe Biden all the way, riding on a wave of support buoyed by a shocking assassination attempt and the four-day Trumpfest that was the GOP convention in July. Instead, he enters mid-August facing a massively shaken-up campaign. Biden is no longer his opponent, having dropped out and endorsed his vice president, while Harris has roundly consolidated the Democratic field and is heading into her own party’s convention with a Democratic Party more unified than it has been at any time through the past two presidential election cycles. Her selection of Tim Walz, the governor of Minnesota, as her running mate has only furthered to fuel her momentum as the affable midwestern politician has fallen into the role of attacking Harris’s opponents, Trump and running mate JD Vance, with ease. Now, as Trump plots his second attempt to regain a positive national spotlight (or at least transfer some negative attention to Harris). The ex-president rallied on Wednesday in North Carolina, a state where he won in the past two elections but now sees Harris gaining and cutting his polling lead down to single digits. He also clearly had hoped to recapture some momentum with a flashy interview advertised on Twitter/X with the site’s Trump-endorsing CEO, Elon Musk — but technical difficulties and a lack of focus in the interview led to the appearance being widely panned. Trumpworld sources were radio silent on Wednesday as the Bedminster presser loomed ahead. Reports from Trump insiders have indicated for days now that the ex-president is privately panicking over the sudden plunge in his polling, or what could more accurately be described as Harris rocketing back into competition. On CNN on Tuesday, Mar-a-Lago whisperer Maggie Haberman of the New York Times reported that the reality of running against a Black woman has stymied Trump, who has found himself unable to find an attack that lands effectively. “She is a woman, and she is a Black woman. And both of those factors have proven very challenging for him in the past,” Haberman opined. “He has seemed to really struggle with women opponents, women critics, and particularly Black women who are critics.” On Wednesday, Trump’s problems with women voters appeared on the verge of growing even worse. New audio from 2020 obtained by Heartland Signal, a left-leaning news outlet, depicted Vance telling a radio host that the only purpose of women after hitting menopausal age was to provide support for child-rearing. The ex-president is likely to face questions about this latest audio on Thursday as well as the ongoing campaign by Democrats to characterize his running mate as “weird” and on the extremes of social conservative viewpoints. Trump, in private conversations, has been seen to chafe at the label and defensively claim that Democrats are only leveling it at Vance, not him.","summary":"Ex-president’s second press conference comes on the heels of widely-panned Elon Musk conversation and rallies in states he won in 2016 and 2020","url":"https://www.independent.co.uk/news/world/americas/us-politics/trump-press-conference-bedminster-2024-campaign-b2596529.html","image":"https://static.independent.co.uk/2024/08/14/19/2165919869.jpg?width=1200","video":null,"publish_date":"2024-08-14 23:06:32","author":"John Bowden","authors":["John Bowden"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.404},{"id":254138574,"title":"Former Georgia GOP leader tells citizens it ‘doesn’t mean you’re Democrat’ to vote for Kamala Harris","text":"Former GOP Georgia Lt. Gov. Geoff Duncan has continued to nudge Republicans into supporting Vice President Kamala Harris, recently appealing to their party loyalty in saying it won’t make them a Democrat if they vote for her. Duncan released an op-ed in May stating he was voting for President Joe Biden. “I think it’s important to reinforce the fact to Republicans around the country that just because you vote for Kamala Harris in 2024, doesn’t mean you’re Democrat,” Duncan told CNN anchor Jim Acosta. “It just means you’re a patriot,” Duncan continued. “You’re doing your duty as an American to step up to the plate and reclaim this country’s future.” Duncan was a major figure as former President Donald Trump attempted to overturn the 2020 presidential election results. “The mountains of misinformation are not helping the process; they are only hurting it,” he told CNN in December 2020. “I voted for President Trump. I campaigned for him. And, unfortunately, he did not win the state of Georgia.” He also said this week he believes “the 10% in the middle that are gonna determine this election are all types of makes and models.” “There’s some lifelong Republicans like me that are extremely conservative, but just have seen Donald Trump act in ways that should never be rewarded with another job called ‘president,’ and some folks that are just moderates and everything in between,” Duncan added. Duncan is a key figure among Republican support for Harris, which also includes former Republican Govs. Jim Edgar of Illinois, Bill Weld of Massachusetts, and Christine Todd Whitman of New Jersey. Harris’s campaign launched “Republicans for Harris” earlier this month in an effort to draw some conservative votes away from the GOP. The “campaign within a campaign” mostly aims at voters who refused to vote for Trump in the primaries, instead backing former U.N. Ambassador Nikki Haley. Haley stated she will vote for Trump. “Republicans for Harris” recently held an online rally in which speakers mostly blasted Trump but said they don’t necessarily agree with Harris’s policies either.","summary":"Former GOP Georgia Lt. Gov. Geoff Duncan has continued to nudge Republicans into supporting Vice President Kamala Harris, recently appealing to their party loyalty in saying it won&#8217;t make them a Democrat if they vote for her. Duncan released an op-ed in May stating he was voting for President Joe Biden. &#8220;I think it’s important [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3121700/former-georgia-gop-leader-citizens-it-doesnt-mean-youre-democrat-vote-kamala-harris/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/05/AP24078591260411-scaled.jpg","video":null,"publish_date":"2024-08-14 23:06:29","author":"Ross O'keefe","authors":["Ross O'keefe"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.175},{"id":254138310,"title":"Taxes on tips: A very American issue for a very tight election","text":"Donald Trump and Kamala Harris agree on very little, but the two presidential rivals have found common ground in calling for the elimination of taxes on tips — a populist move that many criticize as economically irresponsible. Trump was the first to announce his plan earlier this summer, while Harris surprised supporters with a similar policy this past week. It’s no coincidence that both candidates made their pledges in Nevada — a crucial battleground state which has the highest relative number of waiting staff in the United States, according to the US Labor Department. Tipping culture in the United States is fundamentally different from most other countries, as customers are encouraged to tip generously on everything from take-out coffee to cocktails. A tip ranging between 15 and 20 percent of the price is considered normal at most restaurants. It is still legal in some US states for employers to pay tipped workers as little as $2.13 per hour — well below the federal minimum wage of $7.25 — so long as their tips make up the difference. With such a significant chunk of service-sector wages coming from tips, it’s not surprising that the policy has such broad appeal — even if many economists and think tanks do not like it. “There’s no particular reason that, in general, people in the service industry should pay lower taxes than somebody on the factory line, or somebody that’s providing nursing care,” Marc Goldwein, the senior vice president of the nonpartisan Committee for a Responsible Federal Budget (CRFB), told AFP.","summary":"Donald Trump and Kamala Harris agree on very little, but the two presidential rivals have found common ground in calling for the elimination of taxes on tips &#8212; a populist move that many criticize as economically irresponsible. Trump was the first to announce his plan earlier this summer, while Harris surprised supporters with a similar [&#8230;]","url":"https://dailytimes.com.pk/1217451/taxes-on-tips-a-very-american-issue-for-a-very-tight-election/","image":null,"video":null,"publish_date":"2024-08-14 23:05:49","author":"Sajid Salamat","authors":["Sajid Salamat"],"language":"en","catgory":"politics","source_country":"pk","sentiment":-0.139},{"id":254138090,"title":"Tim Walz picks Oct. 1 as date for VP debate with JD Vance","text":"WASHINGTON — Democratic vice presidential candidate Tim Walz said Wednesday that he intends to debate his Republican counterpart JD Vance on Oct. 1. Minnesota’s governor announced his preferred debate date after CBS offered four dates between Sept. 17 and Oct. 8. “See you on October 1, JD,” Walz posted on X. Vance, an Ohio senator, has indicated that he’s eager to debate Walz, though it was not immediately clear if there would be any wrangling over the date before a final agreement. The vice presidential debate is expected to focus on policy differences between the 40-year-old Republican and the 60-year-old Democrat — as well as Vance’s allegation that Walz committed “stolen valor” by misstating his military record. Former President Donald Trump, the Republican presidential nominee, and Vice President Kamala Harris, the Democratic candidate, are expected to have at least one debate — Sept. 10 on ABC. Trump, 78, has agreed to do additional debates on Sept. 4 on Fox News and Sept. 25 on NBC, but Harris, 59, has not confirmed those dates. “I am happy to have that conversation about an additional debate, or after Sept. 10, for sure,” Harris said last week.","summary":"The vice presidential debate is expected to focus on policy differences between the Republican Ohio senator, 40, and the 60-year-old Democratic Minnesota governor.","url":"https://nypost.com/2024/08/14/us-news/tim-walz-picks-oct-1-as-date-for-vp-debate-with-jd-vance/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/newspress-collage-kirtt16ni-1723676416743.jpg?quality=75&strip=all&1723662038&w=1200","video":"https://cdn.jwplayer.com/videos/4FzKLXyY-RyIcpnTz.mp4","publish_date":"2024-08-14 23:01:18","author":"Steven Nelson","authors":["Steven Nelson"],"language":"en","source_country":"us","sentiment":-0.251},{"id":254138576,"title":"Harris only has to wait out 36 days until early voting, and the press is letting her","text":"In the 24 days Kamala Harris has spent as first de facto and then the definitive Democratic presidential nominee since President Joe Biden withdrew from reelection, the vice president has sat down for zero interviews and publicly spoken to the press for a total of 70 seconds. During that minute-long gaggle after a Michigan rally last week, Harris said she hoped to schedule, maybe, a single interview by the end of the month. After four years of Democrats lambasting former President Donald Trump as an existential threat to our fragile democratic experiment, the press seems positively indifferent to the notion that a candidate who has not received a single national primary vote in either 2020 or 2024 is heading to a presidential election without even one on-the-record interview with one of its own. In other words, Harris knows all she has to do is ride out the shortest campaign in modern history and that the media will evidently cover for her. Sure, CNN’s John Berman admirably pushed back on the Harris campaign when it lied about her schedule in response to queries about her evasion of the media, and the Washington Post editorial board said that Harris must speak with journalists “if she hopes to prevail.” But evidently, that’s not really true. Somewhat innocuously, if not irritatingly, the Democratic hagiographers in the corporate media have peddled the party line that Republicans are “weird,” Harris is “brat,” and her candidacy marks the greatest thing since sliced bread. More maliciously, most in the media have ignored that Harris is a radical who presided over a quadrupling of the influx of illegal immigrants into the United States and an average annual inflation rate of nearly 6% and advocated nationalizing some 30% of the economy before that. But Harris is running out the clock because she can. The president announced he could concede to the palace coup 25 days ago, announcing both his withdrawal and his endorsement of Harris on July 21. Harris has spent these past three-and-a-half weeks eschewing the press with the feeble excuse of the flurry of kickstarting a presidential campaign with fewer than 100 days until Election Day, and the Democratic National Convention next week has bought her essentially another fortnight of the media playing ball and pretending it’s normal for a party to depose the democratically elected candidate with a second-stringer who can’t lob softballs from Rachel Maddow, let alone beach balls from the Pod bros. CLICK HERE TO READ MORE FROM THE WASHINGTON EXAMINERAfter the DNC, Harris only has four weeks before early voting begins. The most crucial state of the Electoral College map, Pennsylvania, leads the calendar with early voting beginning on Sept. 16. Missouri allows select voters to begin casting early ballots the day after, and Minnesota, South Dakota, and Virginia all begin accepting early votes on Sept. 20. Biden gave his party fewer than half as many days to replace him than even Lyndon Johnson did in 1968, and that was in an alien era when Election Day was no misnomer rather than our current reality of a 50-day election season. Only 57 days will have elapsed between Biden backing Harris as his coronated replacement and the start of early voting, and to date, Harris has spent nearly half of those days avoiding answering but one question from the press. And the perfectly compliant media may be fine with accommodating Democrats, but they ought not delude themselves into believing they’re enabling anything remotely democratic.","summary":"In the 24 days Kamala Harris has spent as first de facto and then the definitive Democratic presidential nominee since President Joe Biden withdrew from reelection, the vice president has sat down for zero interviews and publicly spoken to the press for a total of 70 seconds. During that minute-long gaggle after a Michigan rally [&#8230;]","url":"https://www.washingtonexaminer.com/opinion/3122080/harris-wait-36-days-early-voting-press-letting-her/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24221754693422.webp","video":null,"publish_date":"2024-08-14 23:00:08","author":"Tiana Lowe Doescher","authors":["Tiana Lowe Doescher"],"language":"en","source_country":"US","sentiment":-0.118},{"id":254138612,"title":"Another ‘Nasty’ Woman Strikes Fear in Trump","text":"Misogyny has been central to Donald Trump’s identity, rise and political movement, but it is now central to his distemper, as Kamala Harris’s remarkable campaign rollout has frustrated and unnerved him. Part of his brand has been that even churlishness is better than anything that even hints at girlishness. Trump praises autocrats (male autocrats, that is), calling them “strong,” “smart” and “savvy” — he even once described Kim Jong-un as “honorable.” Surely, visions of unrestrained power dance in his head. But when Trump talks about women who in any way challenge his power, his rhetoric drips with sexism. In recent days, he has referred to Harris as “incompetent,” “nasty” and “not smart.” Behind closed doors, he has reportedly referred to her, repeatedly, using the B-word.","summary":"Authoritarian tendencies and misogyny rise together.","url":"https://www.nytimes.com/2024/08/14/opinion/kamala-harris-sexism-trump.html","image":"https://static01.nyt.com/images/2024/08/15/multimedia/14blow-zbtq/14blow-zbtq-facebookJumbo.jpg","video":null,"publish_date":"2024-08-14 23:00:06","author":"Charles M. Blow","authors":["Charles M. Blow"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.26},{"id":254138092,"title":"Google claims that Iran has also targeted Harris and Biden","text":"An Iranian-backed actor that was known to have attempted to infiltrate accounts linked to people affiliated with former President Donald Trump has also targeted individuals in President Biden and Vice President Kamala Harris’s orbit as well, Google claimed on Wednesday. The search-engine behemoth cautioned that it expects the Iran-backed actor, APT42, to ramp up its cyber efforts amid escalating tensions between Israel and Iran after having already targeted dozens of key officials. “APT42 is a sophisticated, persistent threat actor and they show no signs of stopping their attempts to target users and deploy novel tactics,” the tech giant wrote in a blog post. “This spring and summer, they have shown the ability to run numerous simultaneous phishing campaigns, particularly focused on Israel and the US,” Google added. Last Saturday, the Trump campaign confirmed that it was the victim of an attack from Iranian actors that Microsoft had revealed without identifying the specific victim. Multiple news organizations including Politico and the Washington Post claimed to have received Trump campaign material that appeared to have been part of the hack. Specifically, those outlets claimed to have been sent a 271-page document that appeared to be vetting material about Republican vice presidential nominee JD Vance. It included his potential vulnerabilities and was developed by Brand Woodward, a law firm that does work for a handful of Trump advisers. Microsoft didn’t mention APT42 specifically, but revealed that an Iranian group with ties to the Islamic Revolutionary Guard Corps sent a spear phishing email to a campaign official. Google described APT42 as being affiliated with the IRGC and engaging in phishing schemes targeting accounts “associated with the US presidential election.” The US was on the receiving end of 31% of APT42’s attacks, according to Google, and Israel weathered the same percentage. Attacks against Israel appeared to have spiked in April and May. Google further claimed to have eliminated “APT42-created Google Sites pages” that pretended to be a “petition from the legitimate Jewish Agency for Israel calling on the Israeli government to enter into mediation to end the conflict.” Iran has long been believed to be interested in hampering Trump’s reelection prospects, driven by a desire for revenge over his ordering of the strike that killed Iranian Gen. Qasem Soleimani back in 2020 as well as his predilection for hefty sanctions against the regime. Google confirmed that APT42 has also taken aim at Biden and Harris, but suggested those efforts have not been successful. “Today, TAG [Google’s Threat Analysis Group] continues to observe unsuccessful attempts from APT42 to compromise the personal accounts of individuals affiliated with President Biden, Vice President Harris and former President Trump, including current and former government officials and individuals associated with the campaigns,” the search engine company wrote. The company further explained that it scuttled efforts by APT42 to attack accounts affiliated with the Trump and Biden campaigns back in the 2020 cycle and that it has done so this year as well. “In May and June, APT42 targets included the personal email accounts of roughly a dozen individuals affiliated with President Biden and with former President Trump,” Google wrote. Tactics of the group include disbursing phishing links in emails to high-profile officials and setting up bogus websites that look legitimate to gain information that can be used to help break into accounts. Google noted that accounts without multi-factor authentication were most vulnerable to those kinds of attacks. In addition to the hacks, Iran has been accused of backing efforts to assassinate Trump, including a recent federal complaint filed against Pakistani national Asif Merchant, 46, for plotting assassinations in New York City. While the court documents didn’t name Trump as the specific target, US Attorney General Merrick Garland later confirmed that was the case. Back in 2021, the director of National Intelligence declassified an assessment that Iran targeted Trump during the 2020 election cycle. “We assess that Iran carried out a multi-pronged covert influence campaign intended to undercut former President Trump’s reelection prospects – though without directly promoting his rival,” the document read. “We assess that Supreme Leader Khamenei authorized the campaign.” Last month, the Office of the Director of National Intelligence re-upped its concerns about Iranian meddling and told reporters that it hasn’t “observed a shift in Iran’s preferences” this cycle. It did not elaborate on the alleged campaign against Trump. Iran has publicly denied the allegations of election meddling.","summary":"An Iranian-backed actor that was known to have attempted to infiltrate accounts linked to people affiliated with former President Donald Trump has also targeted individuals in President Biden and Vice President Kamala Harris's orbit as well, Google claimed Wednesday.","url":"https://nypost.com/2024/08/14/us-news/google-claims-that-iran-has-also-targeted-harris-and-biden/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87777717.jpg?quality=75&strip=all&w=1200","video":null,"publish_date":"2024-08-14 22:59:53","author":"Ryan King","authors":["Ryan King"],"language":"en","source_country":"us","sentiment":-0.486},{"id":254138046,"title":"Trump claims Kamala Harris has ‘laugh of a crazy person’ and says he wants her sketch artist","text":"Former President Donald Trump (right) asked what happened to Kamala Harris’ (left) laugh and launched other personal attacks in his North Carolina rally (Pictures: REX/AP) Ex-President Donald Trump attacked Vice President Kamala Harris’ laugh and said he wanted to use the artist that sketched her magazine cover. Trump in his North Carolina rally veered off his campaign’s new focus on his economy plan and launched numerous personal attacks on Democratic nominee Harris. ‘What happened to her laugh?’ said Trump on Wednesday afternoon. ‘I haven’t heard that laugh in about a week.’ He added: ‘That’s the laugh of a crazy person, I will tell you. ‘They told her, “Don’t laugh, don’t laugh,” No, her laugh is career-threatening.’ Trump cast himself as smarter than his 2024 opponent. ‘You know why she hasn’t done an interview? She’s not smart. She’s not intelligent,’ he said. Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.","summary":"Ex-President Donald Trump asked what happened to his opponent Kamala Harris' 'career-threatening' laugh in his North Carolina rally.","url":"https://metro.co.uk/2024/08/14/donald-trump-kamala-harris-laugh-crazy-person-sketch-artist-north-carolina-21425153/","image":"https://metro.co.uk/wp-content/uploads/2024/08/SEC_217421363-00aa.jpg?quality=90&strip=all","video":null,"publish_date":"2024-08-14 22:58:51","author":"Jessica Kwong","authors":["Jessica Kwong"],"language":"en","source_country":"gb","sentiment":-0.201},{"id":254138776,"title":"Anna Paulina Luna, a congresswoman, responds to critics who criticized her patriotic swimsuit photos and her previous appearance in Sports Illustrated.","text":"CONGRESSWOMAN Anna Paulina Luna has fired back at people who called out her patriotic bathing suit in a resurfaced video. Luna, at the age of 35, responded to critics who were criticizing her appearance by telling them to “get over it” after many were taken aback by the steamy video. Despite the reactions, the congresswoman emphasized that the footage portrayed her as “biologically a woman.” The video, uploaded without a specific date on X, depicted the Florida congresswoman proudly displaying her figure in a red, white, and blue one-piece swimsuit with the slogan of Donald Trump, “Make America Great Again.” She stood in front of an American flag to film the video, pairing the look with knee-high socks. “I’m confirming that I have indeed worn swimsuits and you can tell I am biologically a woman #MAGA,” the Republican wrote on X. She added, “I was also in featured by Sports Illustrated and MAXIM. Designed swimsuits and women’s shirts.” The unexpected surfacing of the video left viewers surprised, with the original poster commenting, “Anna Paulina Luna would be better off working at a local Hooters, rather than holding a position in Congress!” Another user said they enjoyed the bathing suit in the video. “Everyone is mad about this while I’m just over here wishing someone would drop the link so I can buy one too!” they said. The MAGA bathing suit is solid by American AF for $34.95. A third asked, “So this is real then?” Some praised the Republican, saying, “MAGA women are hot. I like our side,” others criticized the risque video. “Anna Paulina Luna is a married congresswoman with children and still can’t help but dishonor her family and the country by stripping down half-naked for the world to see. Please don’t claim she’s a Christian either,” wrote Christian activist Morgan Ariel. Right-wing political commentator Richard Hanania commented on the video saying, “I’ve heard that this is a member of Congress.” “GET OVER IT” Luna went on as people continued to ridicule her for her appearance in the video as a wife, mother, and member of Congress. “There are better to do with your time than digging up modeling photos of me from almost a decade ago,” she continued. I’m confirming that I have indeed worn swimsuits and you can tell I am biologically a woman #MAGAAnna Paulina Luna “The left is attempting to make this a thing yet can’t define a woman. Very low IQ behavior. Get over it.” Alongside the post, she shared an image of a quote that read, “Great minds discuss ideas: average minds discuss events: small minds discuss people.” PATH TO CONGRESS Before Luna represented Republicans in Florida, she joined the Air Force at 19. She spent six years in the military, including five in active duty. In May 2021, Luna launched her candidacy for the 2022 Republican primary. She was elected as US representative for Florida’s 13th congressional district during the 2022 election.","summary":"Internewscast Journal\n\nInternewscast\n\n\nCONGRESSWOMAN Anna Paulina Luna has fired back at people who called out&#8230;\n\n\nThis Post: Anna Paulina Luna, a congresswoman, responds to critics who criticized her patriotic swimsuit photos and her previous appearance in Sports Illustrated. first appeared on Internewscast Journal","url":"https://internewscast.com/news/anna-paulina-luna-a-congresswoman-responds-to-critics-who-criticized-her-patriotic-swimsuit-photos-and-her-previous-appearance-in-sports-illustrated/","image":"https://www.the-sun.com/wp-content/uploads/sites/6/2024/08/NINTCHDBPICT000659869581.jpg?strip=all&w=607","video":null,"publish_date":"2024-08-14 22:54:24","author":"Internewscast","authors":["Internewscast"],"language":"en","source_country":"us","sentiment":0.2},{"id":254138508,"title":"Donald Trump's campaign playbook is a mess","text":"On Monday afternoon, former President Donald Trump’s former campaign manager, Kellyanne Conway, was on Fox Business discussing the state of Trump’s campaign with former Trump adviser Larry Kudlow. You’d assume the two Trump allies would have been heaping lavish praise on their favorite candidate. Instead, it was some tough love. Conway was pointed in criticizing Trump’s attacks on Vice President Kamala Harris, which have centered on everything from her intelligence to her race. “The winning formula for President Trump is very plain to see,” said the first woman to run a winning presidential campaign. “It’s fewer insults, more insights, and that policy contrast.” Kudlow agreed. “Again,” he said, “I think personal insults of her are not a good idea, really not a good idea. It’s a distraction, it’s unnecessary, it’s off-message.” Conway offered some optimism for an upcoming interview between Trump and X owner Elon Musk, suggesting it would be a great opportunity for Trump to showcase his “policy contrast.” Bless her heart. The Trump/Musk glitch-ridden livestream, in which Trump waxed poetic about Harris’ so-called resemblance to his wife Melania, among other nonsensical things, was not the contrast Conway was hoping for. Instead, it was a fact-resistant, grievance-riddled, sloppy mess of an interview between two thin-skinned billionaires who were all too happy to learn they hated the same people. Needless to say, it was light on policy. Since President Joe Biden dropped off the Democratic ticket and Harris stepped on, Trump’s 2.0 campaign has been plagued by unforced errors, lackluster messaging, whiffed attempts at defining her, lame name-calling, and embarrassing contrasts in enthusiasm and momentum. He’s tried, for some inexplicable reason, litigating her race, suggesting she only recently “happened to turn Black.” He’s tried insulting her competence and her intelligence. He’s bizarrely accused her of faking her massive crowd sizes with artificial intelligence — and we all know how important crowd size is to him. And on Tuesday, an official Trump campaign account on X posted a racist meme about migrants. As for her running mate, Minnesota Gov. Tim Walz, they’ve tried attacking his service record. They’re calling him “Tampon Tim,” for his state’s law requiring public schools to provide free menstrual products to students. Trump has tried calling him “Comrade Walz.” If recent polls are any indication, none of this is working to boost Trump’s campaign, especially in the all-important swing states, where Harris keeps getting better and better news — like the latest Cook Report, which has Harris up or tied with Trump in all but one swing state. Or the recent New York Times/Siena College poll, showing Harris is tightening the margins with one of Trump’s core constituencies — white working-class voters in swing states. Policy areas ripe for contrast But despite Conway’s nudges, as well as mounting criticism from other Republicans like former South Carolina Gov. Nikki Haley, and even Peter “Pimp Ladies” Navarro, Trump seems determined to avoid real policy arguments. What’s surprising — and likely infuriating for many Republicans up for reelection in down-ballot races — is that there are plenty of policy areas to go after. Trump and Vance have attempted to pin the migrant crisis at the border on Harris, but thus far haven’t successfully pressured her to answer for her role inside the Biden administration. They’ve hammered the economy, with Trump even predicting a looming depression, but not to any visible impact on her numbers. But they’ve ignored some obvious low-hanging fruit when it comes to Walz, a huge missed opportunity to put the new Dem ticket on defense. First, abortion. While Republicans are rightly painted as extremists on women’s reproductive rights — representing only a fringe minority of voters who want abortion completely banned — Minnesota’s laws are outside the mainstream, too. A new statute in Minnesota does not include any specific prohibitions on abortion at any stage of pregnancy. A majority of voters believe abortion should be legal, with some restrictions, including on weeks. A majority of abortion rights supporters say how long a woman has been pregnant should matter in determining legality, and support for legal abortion diminishes at later stages of pregnancy. Minnesota doesn’t require parental consent for minors. National polling shows overwhelming support for parental consent. Minnesota’s progressive transgender laws — making the state a “trans refuge,” where children can receive gender-affirming intervention and the courts can have “temporary emergency jurisdiction” during cross-state custody disputes if a child has been unable to get gender-affirming care, is not nationally popular. A majority of voters oppose gender-affirming care for minors, as well as trans women participating in sports against biological girls. On taxes — remember taxes? Republicans used to care about them. A lot. Minnesota’s got the highest corporate tax rate in the U.S. It’s also got the sixth-highest individual income tax top rate. It seems like this might matter to people. How about a meme or a riff on any of this stuff? Do Walz and Harris want to make America more like Minnesota? It’s a fair question that neither have had to answer because Trump prefers doling out dumb nicknames to drilling down on policy contrasts. Whether he just doesn’t care about the policy, or he’s too old and tired to get substantive and specific, Trump’s campaign is suffering because he refuses to take it — and voters — seriously. And they’re responding in kind. S.E. Cupp is the host of “S.E. Cupp Unfiltered” on CNN. Send letters to letters@suntimes.com. Get Opinions content delivered to your inbox.","url":"https://chicago.suntimes.com/columnists/2024/08/14/donald-trump-campaign-mess-kamala-harris-tim-walz-abortion-transgender-issues-se-cupp","image":"https://cst.brightspotcdn.com/dims4/default/567bdae/2147483647/strip/true/crop/1930x1102+0+110/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fb2%2F76%2F068cf0af47d08e50ed568cf1f602%2Fap24","video":null,"publish_date":"2024-08-14 22:53:10","author":"S. E. Cupp","authors":["S. E. Cupp"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.327},{"id":254137954,"title":"Kamala Harris tries to distance herself from President Biden in yet another policy flip-flip: ‘Everything about her campaign is fake’","text":"Vice President Kamala Harris is furiously trying to “distance” herself from President Biden’s record — while also disavowing the far-left policies she heartily embraced just a few years ago. The result is a campaign run entirely on style over substance since Harris took the Democratic mantle from Biden last month. And Democratic campaign operatives warn that she risks voters catching on — and realizing she’s selling only cynical political opportunism. “It’s a marketing strategy that is TV-esque,” one senior Democratic aide said. “With such a short timeline now, policy matters less than personality. “She’s going to almost exclusively look at a voter like a consumer — and sell, sell, sell!” the aide quipped. “Do I think that’s a long-term strategy? No,” the aide admitted. “But I think the plan is win and figure it out.” Another Democratic campaign operative told The Post Wednesday that Harris was wisely trying to break with Biden’s economic policies due to his “horrible” polling numbers — and is prepared to jettison any of their administration’s talking points that don’t have “strong” public support. At the same time, Harris, 59, is also seemingly rejecting a host of her own progressive pet projects that she touted during her failed 2020 presidential bid — including support for Medicare for All, banning fracking and legalizing illegal immigration. Critics attacked Harris from both sides of the party four years ago — with the Biden campaign mocking her Medicare flip-flop in particular as a “have-it-every-which-way” plan, and aides for Democratic socialist Sen. Bernie Sanders (I-Vt.) slamming her policy stances as having been “cobbled together to address various poll numbers,” Politico reported. Now, she’s trying to burnish her moderate credentials by talking about inflation and the high cost of goods head on, while also embracing Trump’s pledge to not tax tips for service and hospitality workers in key battleground states like Nevada. “As far as Harris distancing from Biden, she was going to do that,” the campaign operative said, noting that Democrats have been energized by the opportunity to redefine the 2024 race. “It wasn’t called Harrisflation,” the operative added, referencing the “Bidenflation” moniker that Republicans have branded on the 81-year-old president as the US surged in 2022 to a 40-year high in consumer prices. Meanwhile the hits she’s taken for being aloof on policy and dodging major media interviews for almost a month after Biden’s departure has been strategic on her part, the senior Democratic aide said, giving her a chance to “to get her story straight later.” Harris advisers spilled to Axios on Wednesday that the presidential pick, who was elevated to presumtive nominee solely by winning over party bosses, isn’t afraid to lean into the policy reversals. “It’s no different than [Gov.] Kathy Hochul’s about-face on congestion pricing,” Rockland County Republican Rep. Mike Lawler told The Post, ripping Harris as a “fraud.” “Nobody believes that the economy is in a better position than it was under Donald Trump,” he said. Republican vice presidential candidate JD Vance told reporters on Wednesday that Harris’ revamped campaign — with its peddled talking points about “joy” and “fun” — was just as fake as the dances she has showed off at campaign events. “Everything about her campaign is fake,” Vance said. On Friday, she is expected to “take on corporate price-gouging” and discuss her own plans to lower the costs of food, housing and health care for the middle class during a planned campaign rally in Raleigh. Harris is also reportedly crafting a new image around her relatively humble California roots — the daughter of a working single mom — to curry favor with voters, saying the Harris agenda is about an effort to “win the future.” A slight plurality of voters trust Harris on economic issues over Trump, a Financial Times survey found earlier this week, while a larger plurality believe they will be in better financial shape under the former president. Still, some of the Biden economic agenda is expected to stick to Harris. White House press secretary Karine-Jean Pierre confirmed during the daily press briefing that the record was “both” of theirs. “I’m not going to get into polling,” she said. “What I will tell you is Bidenomics has been something that both the president and the vice president has worked on.” The Democratic operative who spoke with The Post said that some of the economic messaging points may be “easier to defend,” but that “Biden’s immigration record will stick to her.” “It’s easier to defend Biden’s record on the economy,” the operative explained. “You can point to jobs, you can point to the stock market, lowering the costs of drugs. … Immigration is much more difficult.” Another stumbling block could be her past promises to eliminate gas-powered vehicles by 2035, but she has signaled to some energy trade groups in Pennsylvania that she wouldn’t kill the domestic gas and oil industry, according to Reuters. Chet Thompson, the president of the American Fuel & Petrochemical Manufacturers, told the outlet he would still maintain caution. “Until the vice president says otherwise, we have to believe she still stands for everything that was in her 2019 policy plan and for every policy she cosponsored as a senator,” he said. Harris and Biden are slated to appear in Prince George’s county, Md., for an event also touting their administration’s efforts to lower costs — their first joint appearance since he dropped out.","summary":"Democratic campaign operatives warn that she risks voters catching on — and realizing she's selling only cynical political opportunism.","url":"https://nypost.com/2024/08/14/us-news/kamala-harris-latest-flip-flip-is-to-distance-herself-from-biden/","image":"https://nypost.com/wp-content/uploads/sites/2/2024/08/87770781.jpg?quality=75&strip=all&w=1200","video":"https://cdn.jwplayer.com/videos/CmqIPmG6-RyIcpnTz.mp4","publish_date":"2024-08-14 22:52:48","author":"Josh Christenson","authors":["Josh Christenson"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.392},{"id":254138766,"title":"Illinois State Fair attracts Democrats ahead of Democratic National Convention in Chicago","text":"SPRINGFIELD, Ill. (WLS) — Democrats from around the state gathered at the State Fair in Springfield Wednesday for an election season rally that takes on special meaning this year. In just five days the Democratic National Convention will get underway in Chicago, giving party members extra reason for excitement. ABC7 Chicago is now streaming 24/7. Click here to watch Governor’s Day for Democrats is always a big rah-rah party rally, but with Vice President Kamala Harris now carrying the banner for November, Wednesday was a chance to further fuel the enthusiasm for next week and November. More than 1,000 Democrats from across Illinois gathered at the state fair breakfast to reconnect and focus on the future with fresh motivation. “The excitement is palpable. Women are so engaged right now, even Gen Z’ers, who normally aren’t paying attention, they are super excited about this candidacy,” said Comptroller Susana Mendoza. Governor JB Pritzker and others reminded the crowd what’s at stake with the Democratic Convention getting underway next week. “We are just days away from hosting delegates and party leaders from across this nation for the 2024 Democratic National Convention and we are 83 days away from hearing the two words, this country has waited 248 years, to hear. Madam President,” Governor Pritzker said. Party leaders also talked about winning more seats in the state house, challenging attendees to do the work needed to win. “If you want to go backwards, you put your car in R,” Senator Tammy Duckworth said. “If you want to go forward, to put it in D.” Attendees said the annual rally took on a different feeling this time. “This is just, I mean, you just get chills, just hearing people talk, people excited. I feel like that. This is definitely different,” said Tammie Leigh-Brown of Macomb, Ill. “I think it’s just been an exciting three weeks, because the party has been completely energized. It seems like a completely different race,” said State Rep. Theresa Mah (D-SW Chicago). There was also a nod to President Joe Biden who stepped aside opening the door for Kamala Harris, “It’s incredible that a man and the character of Joe Biden stepped up and made a selfless decision for America,” Senator Dick Durbin said. But Wednesday it was about generating excitement for the new head of the ticket. Lieutenant Governor Juliana Stratton was wearing a shirt saying Kamala is for everybody “Kamala is for everybody and she is ready to shatter the highest glass ceiling and fight for all of us, and we in Illinois have her back because Democrats deliver,” Lt. Gov. Stratton said. Governor Pritzker said he is excited that the Chicago DNC host committee has raised $95 million, $10 million more than their goal. And he did not seem concerned if enthusiasm for Harris may be peaking soon. “When Donald Trump was ahead in the polls, that was too soon,” he said. The rally was also a call to action for Democrats across the state to get involved. “We are going to organize. We are going to, that’s right, put the boots on the ground and make sure that the fight isn’t over, that we finish it in November,” said IL Democratic Party Chair and State Rep. Lisa Hernandez. Thursday will be Republican Day at the fair, where they will get a chance to rally the party faithful around their candidates, with the forecast for November looking much different than a month ago.","summary":"Internewscast Journal\n\nInternewscast\n\n\nSPRINGFIELD, Ill. (WLS) &#8212; Democrats from around the state gathered at the&#8230;\n\n\nThis Post: Illinois State Fair attracts Democrats ahead of Democratic National Convention in Chicago first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/illinois-state-fair-attracts-democrats-ahead-of-democratic-national-convention-in-chicago/","image":"https://internewscast.com/wp-content/uploads/2024/08/rewrite-this-title-Democrats-rally-at-Illinois-State-Fair-days.jpg","video":null,"publish_date":"2024-08-14 22:52:22","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":0.065},{"id":254138578,"title":"Kansas joins multistate challenge against ‘Bidenbucks’ voter registration scheme","text":"Kansas and a coalition of several Republican-led states joined a lawsuit to block the Biden administration from using taxpayer-funded federal agencies to register new voters and decried it an “unlawful” overreach that could result in millions of new Democratic registrants. The lawsuit, filed in the U.S. District Court for the District of Kansas, claims the Biden administration’s 2021 Executive Order 14019, which mandates federal agencies to engage in voter registration activities, oversteps the authority granted to the executive branch and infringes on state sovereignty. “Just as it’s illegal for a Democrat administration to do this, it would be illegal for a Republican administration to do this,” Republican Kansas Attorney General Kris Kobach told the Washington Examiner. “We have a system where the government itself must follow the law, and it doesn’t matter who’s sitting in the White House.” The plaintiffs argue that this executive order, dubbed “Bidenbucks” by its critics, transforms federal agencies into de facto voter registration organizations, a role that, according to the lawsuit, should be reserved for states. They assert that this federal overreach undermines the integrity of state-run voter registration systems and threatens the balance of power between state and federal governments. Based on analysis from the left-wing think tank Demos, which backs the order, the initiative could lead to “approximately 3 million new or updated voter registrations per year.” This surge in voter registrations could potentially swing the election in favor of the Democrats in what is expected to be a closely contested race between former President Donald Trump and Vice President Kamala Harris. The complaint argues that the executive order may lead to more Democratic registrants by citing the historically left-leaning nature of federal agencies, which is evident from the majority of federal employees’ political donations going to Democratic candidates in past elections. This suggests that the federal bureaucracy, responsible for implementing the order, could favor the Democratic Party, according to the complaint. But time is of the essence for this challenge, as there are only about three weeks left before early voting in some states begins, meaning much of the potential damage caused by “Bidenbucks” may already be done. “If one of the courts were to issue a preliminary injunction, it might have some impact on this upcoming election in November,” Kobach said, contending that if their lawsuit was successful, it would more likely affect future elections rather than 2024. As the former secretary of state for eight years in the Sunflower State, Kobach said he feels confident his state and others are right to challenge Biden’s get-out-the-vote effort, which he said “also motivated me to be part of this lawsuit.” The case, known as Montana v. Biden, seeks to have the district court immediately declare the executive order unconstitutional and to vacate and enjoin all agency actions implementing it. In addition to Kansas and Montana, other states that have joined in the complaint include Iowa, Mississippi, Nebraska, North Dakota, Oklahoma, South Carolina, and South Dakota. The problems caused by the Biden executive order have left visible impacts previously reported on by the Washington Examiner earlier this summer. For example, one participating site for the get-out-the-vote initiative was the Community Health Center of Southeast Kansas, which is the largest federally qualified health center in the state that services 70,000 people, including in Oklahoma. Footage reviewed by the Washington Examiner showed examples in which personnel at the health center touted their work turning out voters who ultimately rejected a 2022 anti-abortion referendum. The Montana case also builds on a similar petition by Pennsylvania state lawmakers to the Supreme Court in April, asking the justices if they have the right to challenge the executive order on the basis that it serves as an incursion on legislative duty. The Supreme Court has yet to take up that challenge and signaled it would not consider the appeal until late September. On Wednesday, the case was assigned to U.S. District Judge Daniel D. Crabtree, who is an appointee of former President Barack Obama. It’s not immediately clear whether and when the court will act on the request to enjoin the “Bidenbucks” initiative.","summary":"Kansas and a coalition of several Republican-led states joined a lawsuit to block the Biden administration from using taxpayer-funded federal agencies to register new voters and decried it an &#8220;unlawful&#8221; overreach that could result in millions of new Democratic registrants. The lawsuit, filed in the U.S. District Court for the District of Kansas, claims the [&#8230;]","url":"https://www.washingtonexaminer.com/news/justice/3121907/kansas-joins-multistate-challenge-bidenbucks-voter-registration-scheme/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/AP24226719719922.webp","video":null,"publish_date":"2024-08-14 22:51:54","author":"Kaelan Deese","authors":["Kaelan Deese"],"language":"en","source_country":"US","sentiment":-0.504},{"id":254137798,"title":"Donald Trump's Asking Barron for Advice on Young Voters, Ex-Official Says","text":"Former White House Chief of Staff Mick Mulvaney says Donald Trump is turning to his youngest son, Barron, for advice on attracting support from younger voters in his presidential campaign.Mulvaney, NewsNation contributor and former Republican politician, told a Tuesday evening panel on the network that the former president is seeking input from his 18-year-old son on the mindset of voters his age and how to garner their support.Barron Trump is the former president's only child with former first lady Melania Trump. He is increasingly getting more involved in his father's political scene, having received a standing ovation at a campaign rally in July. Previously not in the public political eye, Barron is still much more removed than some of Trump's other children, like Donald Jr. and Eric.Weeks after his public political debut in July, Gen Z political influencer Bo Loudon called Barron one of his \"best friends,\" in a post praising his father, the GOP presidential candidate.Loudon, whose parents are conservative commentator Gina Loudon, who was on the 2020 Trump campaign media advisory board and co-chair of Women for Trump, and former Missouri state Senator John William Loudon, has over 200,000 followers on Instagram and 120,000 on X, formerly Twitter.Earlier this month, Trump thanked Barron for helping facilitate an introduction to Adin Ross, a 23-year-old streamer who spoke with Trump in a live interview about his presidential bid for over an hour.In a post to Truth Social a day later, Trump said that the interview \"EXPLODED, but in a very positive way,\" on the platform Kick, which Ross often uses to stream himself playing video games.Mulvaney said that Trump has \"always empowered the youngest, 'the weakest,' the bottom—he's always listened to everybody on the totem pole, he's going to listen to Barron.\"He cited anecdotes of Trump taking this approach with business endeavors in the 1970s and 1980s, as well as in more recent years in the political arena, asking Air Force enlistees, \"what do you think we should be doing, why are we here, how do you feel about this, etcetera, etcetera.\"Mulvaney, who previously served as director of the Office of Management and Budget and is a former South Carolina representative, added, \"give him credit, he's not 18 years old anymore, Trump is not, so asking an 18-year-old how 18-year-olds think is probably not the stupidest thing he's ever done.\"Newsweek reached out to the Trump campaign for comment via email on Wednesday.Gen Z voters, a group that includes those age 18 to 27, are expected to play a big role in the election matchup between Trump and Vice President Kamala Harris, who entered the campaign nearly 100 days before Election Day following President Joe Biden's exit from the race. For many Gen Z voters, this will be their first time casting ballots in a presidential election.Before dropping out, Biden had been trailing Trump among young voters. The race between Harris and Trump in this age group is much tighter, with both candidates actively seeking to win their support.","summary":"Mick Mulvaney, who served as Donald Trump's White House chief of staff, said the GOP candidate is seeking advice from his youngest son on attracting young voters.","url":"https://www.newsweek.com/donald-trump-asking-barron-advice-young-voters-ex-official-1939503","image":"https://d.newsweek.com/en/full/2450246/barron-trump.jpg","video":null,"publish_date":"2024-08-14 22:51:34","author":"Mandy Taheri","authors":["Mandy Taheri"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.001},{"id":254137676,"title":"Debut of X’s AI Image Generator with Minimal Restrictions on Political Content","text":"An upgraded version of X’s artificial intelligence chatbot Grok can now generate images — of almost anything. And some users have noticed just how few guardrails this latest language model has, compared to its competitors. The model, Grok-2, appears to carry few limitations on creating fake images of political figures. Since its rollout Tuesday in beta, X users have shared Grok-generated images of everything from former President Donald Trump locking lips with Elon Musk to Trump and Vice President Kamala Harris giving a thumbs up to the camera from a pilot’s cockpit as the two seemingly recreate 9/11. Most of the images are high quality but not quite photorealistic, and many of them are easily identified as having been computer-generated. Some, however, may pass for a real photo at first glance. The rollout adds to already-heightened concerns about the use of generative AI to spread false information ahead of the election. X has come under particular scrutiny for its role in hosting misinformation, with Musk — X’s owner and most followed user — having made dozens of posts this year sharing false or misleading claims about the upcoming U.S. election. X has also been a hub for deepfake videos and AI images of political figures, with false media of President Joe Biden, Trump and Harris often going viral whether as a joke or due to genuine attempts to fool potential voters. Last month, Musk reposted a fake Harris campaign ad without labeling it as misleading. When asked for comment, X’s press email returned its usual automated message: “Busy now, please check back later.” Musk has touted X’s AI models as a key part of the company’s future. Grok-2 and its smaller sibling Grok-2 mini will be made available through the platform’s enterprise API later this month, according to an xAI blog post. “Since announcing Grok-1 in November 2023, xAI has been moving at an extraordinary pace, driven by a small team with the highest talent density,” the post stated, adding that the launch of Grok-2 puts the company “at the forefront of AI development.” Grok’s major competitors in the AI space, such as OpenAI’s ChatGPT, Google’s Gemini and Meta AI, have policies that prompt them to decline requests to create potentially misleading images of public figures. But through Grok, users have been able to generate images of former President Barack Obama doing a line of cocaine, Harris pointing a gun under a false declaration that Democratic candidate Will Stancil won his Minnesota House race, and Musk crawling on all fours on a leash held by Trump. In tests conducted by NBC News, Grok showed very few guardrails. When prompted, it created numerous images that included hate symbols or racist imagery alongside well-known individuals including Trump. For both Trump and Harris, Grok would produce images showing the candidates holding weapons, but in other instances, Grok appeared to handle images with Harris more sensitively. Grok would not generate images of Harris with extremist imagery, but it did for Trump. Others online seem to be having fun with the new tool, generating more lighthearted images while also testing just how far they could push the boundaries. One image of “Baroque Obama,” depicting Obama wearing a white powdered wig and donning a luxurious coat with a lace cravat, has the former president playing the cello in an elaborately furnished room. Another punny image of “Buzz Lightbeer” showed Toy Story’s superhero action figure Buzz Lightyear holding up a pint of beer with a smile. Such images may bring up questions about Grok’s training data — which it has not made public — especially as many popular AI language models have been hit with lawsuits alleging that they used copyrighted images (and other kinds of copyrighted data) to train its algorithms. Grok has also come under scrutiny recently after five secretaries of state sent a letter to Musk alleging that the AI assistant misled users about ballot deadlines in numerous states, repeating the same false information for more than a week.","summary":"Internewscast Journal\n\nInternewscast\n\n\nAn upgraded version of X’s artificial intelligence chatbot Grok can now generate&#8230;\n\n\nThis Post: Debut of X&#8217;s AI Image Generator with Minimal Restrictions on Political Content first appeared on Internewscast Journal","url":"https://internewscast.com/news/us/debut-of-xs-ai-image-generator-with-minimal-restrictions-on-political-content/","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2024-08/240814-x-phone-ch-1424-1af875.jpg","video":null,"publish_date":"2024-08-14 22:45:50","author":"Internewscast","authors":["Internewscast"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.073},{"id":254138392,"title":"Trump insists ‘it was Iran’ when pressed about FBI verdict on campaign hack","text":"Former President Donald Trump continued to blame Iran for hacking his campaign after he was asked what the FBI has concluded about the data breach. After early voting in Florida, Trump spoke to the media on Wednesday and took questions about the cyberattack his campaign sustained last week. Upon being pressed if an FBI investigation had said “specifically that it was Iran” that was responsible for the hack, Trump responded, “I don’t want to say exactly, but it was Iran.” The former president reiterated the claim several times during his interactions with the press, echoing his assessment of the data breach after it took place last week. “We were just informed by Microsoft Corporation that one of our many websites was hacked by the Iranian Government,” Trump said in a post to Truth Social on Saturday evening. “Never a nice thing to do!” Trump confidant Roger Stone was also allegedly targeted by Iranian hackers two months ago in an effort to break into the former president’s campaign, according to a CNN report released Tuesday. “Mr. Stone was contacted about this matter by Microsoft and the FBI and continues to cooperate with both,” Grant Smith, an attorney for Stone, told the outlet. Politico, the New York Times, and the Washington Post initially reported they had been sent vetting materials about Sen. J.D. Vance (R-OH), Trump’s running mate, from “Robert.” Iranian hackers allegedly gleaned the documents from Trump campaign emails. The FBI has yet to release details about its investigation into the incident.","summary":"Former President Donald Trump continued to blame Iran for hacking his campaign after he was asked what the FBI has concluded about the data breach.  After early voting in Florida, Trump spoke to the media on Wednesday and took questions about the cyberattack his campaign sustained last week. Upon being pressed if an FBI investigation [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3121938/trump-insists-iran-when-pressed-about-fbi-verdict-campaign-hack/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Trump-Iran.webp","video":null,"publish_date":"2024-08-14 22:34:03","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.494},{"id":254137484,"title":"Vance agrees that raising grandchildren is ‘whole purpose of postmenopausal female,’ unearthed audio shows","text":"JD Vance agreed with the notion that raising grandchildren was “the whole purpose of the postmenopausal female,” an unearthed 2020 podcast shows. Vance also seemed to concur when the host suggested that having grandparents help raise children was a “weird, unadvertised feature of marrying an Indian woman.” It's the latest in comments from the Republican nominee for vice presdident about women and \"traditional\" roles that have drawn ire. Vance has faced intense criticism in recent weeks for previous sexist comments, including his remarks about \"cat ladies.\" Now, his appearance on ThePortal podcast with host Eric Weinstein in April 2020 has been thrust back into the limelight Vance spoke about his wife’s Indian family, noting that they emigrated to the US about a year before his wife, Usha Vance, was born. He said at the time, her parents were “devoted” to Usha and their grandchild as well as to “future grandchildren.” The couple has three children, born in 2017, 2020 and in 2021. “You can sort of see the effect it has on him to be around them like they spoil him,” he said of his first child. “There's sort of all the classic stuff that grandparents do to grandchildren, but it makes him a much better human being to have exposure to his grandparents.” He added: “And the evidence on this is like super clear.” “That’s the whole purpose of the postmenopausal female in theory,” Weinstein said at the time. “Yes,” Vance agreed. “When your child was born, did your in-laws, and particularly your mother-in-law, show up in some huge way?” Weinstein asked Vance. “She lived with us for a year,” former President Donald Trump’s running mate noted. “I didn't know the answer to that. So that's a weird, unadvertised feature of marrying an Indian woman,” Weinstein responded. “It’s in some ways, the most transgressive thing I've ever done against sort of the hyper-neo-liberal approach to work and family,” Vance said. “My wife had this baby seven weeks before she started the clerkship, [she’s] still not sleeping any more than an hour and a half in a given interval. And her mom just took a sabbatical. She's a biology professor in California, just took a sabbatical for a year and came and lived with us and took care of our kid for a year.” He added that it was “painfully economically inefficient.” “Why didn't she just keep her job, give us part of the wages to pay somebody else to do it?” he asked. “That is the thing that the hyper-liberalized economics wants you to do. The economic logic of always prioritizing paid wage labor over other forms of contributing to a society is to me ... a consequence of a sort of fundamental liberalism that is ultimately gonna unwind and collapse upon itself.” “It's the abandonment of a sort of Aristotelian virtue politics for a hyper-market-oriented way of thinking about what's good and what's desirable,” he added. “If people are paying for it and it contributes to GDP and it makes the economic consumption numbers rise, then it's good, and if it doesn't, it's bad ... that's sort of the root of our political problem.” The Independent has contacted the Vance campaign for comment. The Director of Rapid Response for Kamala Harris, Ammar Moussa, wrote on X: “I’m sorry - who is out here just out here talking about the ‘postmenopausal female’ and their role in society?” Democratic Illinois Congressman Sean Casten added: “Are you a post-menopausal woman? Did you quit your job to look after your grandkids? Because if you didn’t, you are not meeting your ‘whole purpose’ according to JD Vance.” Vance has faced criticism for a number of unearthed comments from his past, most notably telling Fox News host Tucker Carlson in 2021 that the US was being run by “a bunch of childless cat ladies who are miserable at their own lives and the choices that they’ve made, and so they want to make the rest of the country miserable, too.” “It’s just a basic fact — you look at Kamala Harris, Pete Buttigieg, AOC [Alexandria Ocasio Cortez] — the entire future of the Democrats is controlled by people without children,” he said. “And how does it make any sense that we’ve turned our country over to people who don’t really have a direct stake in it?” Harris has two stepchildren and Buttigieg, the transportation secretary, adopted twins in August 2021.","summary":"Vance also seemed to agree when a podcast host suggested that having grandparents help raise children was a ‘weird, unadvertised feature of marrying an Indian woman’","url":"https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-children-women-audio-b2596492.html","image":"https://static.independent.co.uk/2024/08/14/23/SEI217406098.jpg?width=1200","video":"https://cdn.jwplayer.com/videos/08MQbDlB-4VHSaSK0.mp4","publish_date":"2024-08-14 22:31:44","author":"Gustaf Kilander","authors":["Gustaf Kilander"],"language":"en","catgory":"politics","source_country":"gb","sentiment":-0.114},{"id":254136948,"title":"Trump Keeps Watching Clip of Himself Being Shot at: ‘May Legit Have PTSD’","text":"Those close to Donald Trump fear the former president “may have legit PTSD” from the assassination attempt at a Pennsylvania rally last month. That’s according to a Vanity Fair report published Wednesday that claimed those in Trump’s inner circle have noticed that he’s become fixated on a seven-second clip that shows the moment he nearly lost his life. “He’s been watching that seven-second clip of how close he was to getting shot right in the head—over and over and over again,” said a Republican close to the campaign, reported Vanity Fair.","summary":"Vincent Alban/ReutersThose close to Donald Trump fear the former president “may have legit PTSD” from the assassination attempt at a Pennsylvania rally last month. That’s according to a Vanity Fair report published Wednesday that claimed those in Trump’s inner...","url":"https://nation.lk/online/trump-keeps-watching-clip-of-himself-being-shot-at-may-legit-have-ptsd-273770.html","image":"https://nation.lk/online/site/assets/img/broken.gif","video":null,"publish_date":"2024-08-14 22:30:03","author":null,"language":"en","source_country":"lk","sentiment":-0.493},{"id":254138402,"title":"Tim Walz’s China ties fuel GOP attacks he’ll go soft on foreign adversary","text":"Republicans are doubling down on accusations that Gov. Tim Walz’s (D-MN) long history with China presents political liabilities for the Democratic vice presidential candidate to take on the foreign adversary should he be elevated to the White House. As a 1989 college graduate and Army National Guard member, Walz embarked to China through a Harvard University-affiliated program to teach English and U.S. history and later operated a business organizing trips for U.S. students. Walz has visited the country 30 times over the decades by his own estimation, and he went back for his honeymoon with his wife. Now, Republicans are scrutinizing how his extensive time in the communist nation may have influenced his foreign policy stances or whether he may be reluctant to confront Chinese aggression as vice president. “I’m not sure what taking over 30 trips to China, including for his honeymoon, says about Tim Walz’s posture towards China,” Rep. Mark Green (R-TN), House Homeland Security Committee chairman, told the Washington Examiner. “But perhaps if the Harris-Walz campaign were willing to take questions from reporters, we could find out.” The Harris-Walz campaign did not respond to a request for comment. The campaign has previously rejected such criticisms and instead pointed to Walz having condemned China’s human rights record. “Republicans are twisting basic facts,” campaign spokesman James Singer recently told Reuters. He added that Walz “fought for human rights and democracy and always put American jobs and manufacturing first.” Republicans labeled Walz joining the Democratic ticket as a gift to China. As the GOP finds its footing on campaign attacks for someone previously unknown on the national stage, the criticism of China appears to be here to stay. Sen. Tom Cotton (R-AK), a China hawk who sits on the Senate Intelligence and Armed Services committees, suggested Walz’s numerous trips to China were funded by Beijing and represented an “attempt to cultivate future U.S. leaders.” Walz and his allies, however, see his extensive relationship as a benefit to combat China. Walz’s 1989 trip to China occurred when the infamous pro-democracy Tiananmen Square protests broke out, straining China’s relations with many other countries, including the United States. After returning to the U.S., Walz and his wife started Education Travel Adventures to facilitate summer trips for high schoolers in the U.S. At a congressional hearing in 2009 marking the 20th anniversary of the Tiananmen Square massacre, which Walz intentionally coincided with his wedding anniversary, Walz testified it was vital to remember the role protesters played against their government. “To watch what happened at the end of the day on June 4 was something that many of us will never forget, we pledge to never forget, and bearing witness and accurate telling of history is absolutely crucial for any nation to move forward,” Walz told the Congressional-Executive Commission on China, which he was a member of. When Walz first began visiting China, U.S.-China relations were not as adversarial, as the two nations actively tried bolstering ties for economic interests. Still, since his first trip to the country roughly 3 1/2 decades ago, Walz has, at times, made eyebrow-raising remarks for conservatives that are receiving fresh scrutiny — not unlike his liberal record as governor that Republicans have homed in on. Although Walz has long advocated improving U.S.-China relations, he has also been critical of human rights abuses and the Chinese government while showing affection for its people. He told a Nebraska newspaper in 1990 that if China “had the proper leadership, there are no limits on what they could accomplish.” He heralded its citizens as “kind, generous, capable people” who “just gave and gave and gave to me.” Morgan Ortagus, a State Department spokeswoman under former President Donald Trump, opined that if “Walz has his way, our China policy will be the weakest in generations.” “This should and will scare our Asian allies,” Ortagus posted to social media, referring to China’s aggression toward Taiwan. “The threat of China will be the next administration’s No. 1 national security challenge. The Harris-Walz campaign must answer real and serious questions on their CCP policy.”","summary":"Republicans are doubling down on accusations that Gov. Tim Walz’s (D-MN) long history with China presents political liabilities for the Democratic vice presidential candidate to take on the foreign adversary should he be elevated to the White House. As a 1989 college graduate and Army National Guard member, Walz embarked to China through a Harvard [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/presidential/3121833/tim-walz-china-trips/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Tim_Walz_887_2.webp","video":null,"publish_date":"2024-08-14 22:27:55","author":"Ramsey Touchberry and Cami Mondeaux","authors":["Ramsey Touchberry and Cami Mondeaux"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.166},{"id":254137658,"title":"Cornel West’s signature-gathering effort scrutinized in Maine","text":"Representatives of former Harvard University professor Cornel West’s third-party bid for president told the secretary of state that the campaign’s decentralized nature likely attributed to petitioners allegedly exceeding the maximum number of petition signatures set in state law and people saying they were misled. West representatives described the campaign as relying heavily on volunteers, especially in Maine, which allows anyone to collect signatures for someone trying to gain access to the presidential ballot and submit them to a municipality for verification. Campaign Manager Ceyanna Dent said that the West campaign, unlike most other campaigns, does not have state directors or paid staff in each state, making it difficult to control what happens on the ground, or know how many signatures are submitted. “We are a grassroots, people-powered campaign, so a lot of the petitioning process is decentralized and without state leads,” Dent said. “Our petitioners are everyday folk. They are working-class people.” Dent and other West campaign officials were addressing Secretary of State Shenna Bellows during a hearing on two separate challenges to the campaign’s petitions to appear as a third party candidate on Maine’s presidential ballot. A separate challenge to Robert F. Kennedy Jr.’s petitions was withdrawn on Tuesday for undisclosed reasons. The challenges appear to be part of a nationwide effort by Clear Choice Action, a group led by Biden allies, to prevent a third-party spoiler in what is expected to be a very tight presidential race. The Washington Post reported the group planned to “develop research and push storylines in the media” to discourage people from voting for third-party candidates. “They are frankly the same exact challenges we have seen from these folks and their allies in at least a half-dozen other states,” said attorney Mike McCorkle, who represented the West campaign. “They are couched in part on insinuations and allegations about activities in other states that have not been borne up under investigation.” It’s unclear what impact West’s candidacy will have on the presidential race in Maine, which uses ranked choice voting in presidential elections, minimizing the spoiler effect of third-party candidates. And West does not appear to be pulling much support in Maine. A poll conducted by the University of New Hampshire Survey Center in July found 4% of Maine respondents said they planned to vote for Kennedy and 1% for West, compared with 48% for Vice President Kamala Harris and 40% for former President Donald Trump. The Pine Street State Poll found about 4% of those surveyed were undecided. Portland resident Nathan Berger lists 16 specific challenges, including that the West campaign exceeded the 5,000 maximum signature limit by 983 signatures, while also claiming that thousands of those signatures violate state statute for having incorrect dates, duplicate entries, missing information and improper notarization. “Dr. West submitted nearly 1,000 signatures too many,” said attorney David Fox, who represented Berger. “That should really be the end of the analysis.” Anne Gass, of Gray, and Sandra Marquis, of Lewiston, accused the West campaign of defrauding voters by telling them the nominating petitions were to prevent “improper financial dealings by members of Congress and address corporate corruption.” Attorneys representing Gass and Marquis presented at least three witnesses, who were told the petition was to prohibit stock trading by federal officials. They were all surprised when they were contacted by an attorney telling them they had actually signed a petition for West to appear on the ballot. Falmouth resident Meryln Poulin said she and her fiance were approached after biking to the Shaw’s supermarket in Falmouth. Poulin said she waited outside with bikes and observed the petitioner approach several customers before approaching her. “The circulator never mentioned Cornel West,” Poulin said. “I was shocked that was what I had done.” McCorkle apologized to each witness and said the campaign did not intend to deceive people, effectively placing the blame on volunteer canvassers for not following the rules. But he also suggested that people should read any petition before signing. Wednesday’s hearing lasted nearly four hours and included a detailed review of signatures the challengers claimed should not have been validated by municipalities or the secretary of state’s office. Bellows did not issue a ruling on Wednesday. State law requires a decision within five business days of the hearing, which was left open until the end of Friday so the parties can address lingering questions and submit final arguments in writing. Bellows’ decision could be appealed to Superior Court. Bellows recently garnered nationwide headlines for ruling that former President Donald Trump was ineligible for Maine’s ballot because of his role in the Jan. 6 riots at the U.S. Capitol, only to reverse course after the U.S. Supreme Court ruled in a similar case that state officials do not have the authority to exclude a presidential candidate from the ballot.","summary":"The independent candidate's eligibility for the presidential ballot is facing 2 separate challenges.","url":"https://www.centralmaine.com/2024/08/14/cornel-wests-signature-gathering-effort-scrutinized-in-maine/","image":"https://w2pcms.com/wp-content/uploads/sites/10/2024/07/Election_2024_Ballot_Deception_38585.jpg?w=1000","video":null,"publish_date":"2024-08-14 22:27:18","author":"Randy Billings","authors":["Randy Billings"],"language":"en","catgory":"politics","source_country":"US","sentiment":0.082},{"id":254137838,"title":"Tim Walz raises $3 million in Denver, capping “interesting” first week as Kamala Harris’ VP pick","text":"Minnesota Gov. Tim Walz joked about his “interesting” first week as Kamala Harris’ running mate on the Democratic presidential ticket and criticized Donald Trump’s background on Wednesday during a Denver fundraiser that collected $3 million for the campaign. “This week has been interesting,” Walz told roughly 150 attendees in the backyard of the 33,000-square-foot Phipps Mansion, owned by Democratic megadonor Tim Gill. “That’s a Minnesota word, ‘interesting’ — so you Minnesotans know, it has multiple meanings.” He recounted being selected by Harris last week and then soon being put on a plane to a rally in Philadelphia — where he was told: “Here, you’ve got 45 minutes to read this speech off the teleprompter.” “Perhaps I neglected to tell you,” Walz recounted to laughs and cheers, “I’ve never used a teleprompter in my life.” The fundraiser was part of Walz’s first solo trip since joining the Harris ticket, a three-day, five-state swing. During his 15-minute in Denver in the early afternoon, Walz praised Harris’ “politics of kindness” and joked with Gov. Jared Polis, his former congressional counterpart and baseball teammate. He also criticized Trump, the Republican nominee, drawing a contrast between Harris’ background — both as a prosecutor and as a former McDonald’s employee — and the former president’s. Walz said he recently asked labor leaders in California if they could see Trump making a McFlurry. He paraphrased a Harris rally line, saying the vice president had gone after “fraudsters” and “predators,” adding: “We know who that might be.” He said there was “no safety net” when speaking in front of the large crowds that are common on a presidential campaign trail. Polis, who’d introduced him, chimed in: “Are you saying they’re not all AI?” That was a reference to a false claim Trump made in recent days — that the Harris campaign had used artificial intelligence to inflate crowd sizes in a picture from a recent campaign stop in Michigan. “I assure you, in Detroit, that wasn’t AI, and I’ll also assure you that every one of the ballots they’re going to cast will not be AI,” Walz replied, to cheers. Trump was recently in Colorado, making a stop in Aspen Saturday during a multistate Mountain West swing that he said raised $28 million. Since Harris picked Walz, Republicans have focused their attacks most heavily on aspects of his more than two decades of National Guard service, but little was said about the topic at the Denver fundraiser. The $3 million raised for the Harris Victory Fund on Wednesday was announced by Gill. Also in attendance were former U.S. Reps. John Salazar and Ed Perlmutter, current U.S. Rep. Joe Neguse, Colorado Secretary of State Jena Griswold, former Denver Mayor Wellington Webb and former state House Speaker Alec Garnett, now Polis’ chief of staff. Walz spoke broadly about Democratic priorities and ideals — like supporting “common-sense gun legislation” and addressing climate change and poverty — though he provided few specific policy proposals. Polis said he’d told Walz not to spend any campaign cash on winning Colorado, which has turned reliably blue in recent years and went for Biden by 13.5 percentage points over Trump in 2020. Polis said Harris and Walz’s presence on the ticket would be enough to support Democrats’ down-ballot efforts, meaning to preserve a state House supermajority and win a similar margin in the state Senate. Still, Walz urged attendees to keep working in the 83 days that remained until Election Day. “Sleep when you’re dead,” he said. Stay up-to-date with Colorado Politics by signing up for our weekly newsletter, The Spot.","summary":"Minnesota Gov. Tim Walz joked about his \"interesting\" first week as Kamala Harris' running mate on the Democratic presidential ticket and criticized Donald Trump's background on Wednesday during a Denver fundraiser that collected $3 million for the campaign.","url":"https://www.denverpost.com/2024/08/14/denver-fundraiser-tim-walz-presidential-race-kamala-harris-jared-polis/","image":"https://www.denverpost.com/wp-content/uploads/2024/08/TDP-Z-2166104778_201231700.jpg?w=1024","video":null,"publish_date":"2024-08-14 22:26:47","author":"Seth Klamann","authors":["Seth Klamann"],"language":"en","source_country":"US","sentiment":-0.106},{"id":254138400,"title":"Harris invests in $90 million introduction to voters as campaign kicks the can on policy agenda details","text":"Vice President Kamala Harris is investing heavily in her introduction to the country as critics say she’s dodging releasing her policy blueprint. After booking $50 million worth of ads last month, the vice president is launching a $90 million bid over the next three weeks, according to a report from the Associated Press. The advertising push, her largest yet, will share Harris’s personal story with voters, with a special focus on seven swing states. Voters in Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin will hear attacks on former President Donald Trump’s “dangerous, extreme agenda” as Harris touts her tenure as California attorney general. Harris’s presidential campaign got off to a late start after she stepped into President Joe Biden’s shoes with just over 100 days to go until Election Day. The day after Biden’s historic campaign exit, Harris announced her intention to head the top of the Democratic ticket, leaving her only a narrow window of time to tell voters why she should lead the nation. Although the Democratic presidential nominee has stayed busy stumping in swing states, making her latest battleground tour across Pennsylvania, Wisconsin, Michigan, Arizona, and Nevada last week, Harris has declined to make traditional media appearances to make her name and policy agenda known to voters. After facing criticism for not engaging with the press, Harris recently promised to sit down for an interview before the end of August. However, she continues to face pushback on her lack of interaction with the media. “Would it kill you guys to have a press conference? Why hasn’t she had a press conference?” CNN host Jim Acosta questioned Harris communications director Michael Tyler on Wednesday. Tyler deflected with a laugh, reminding Acosta that Harris agreed to do an interview before the end of the month and is speaking directly to voters in rallies across the country. “A campaign rally is not a press conference,” Acosta responded. “One interview before the end of the month, I mean, that’s not a lot.” The CNN host continued to push the Harris campaign to hold a press conference before August’s end, but Tyler deferred on the timing. “We will commit to directly engaging with the voters who are going to decide this election,” he told the network. Even during the flurry of rallies and events she has held in recent weeks, the vice president has given little insight into specifics of what a Harris presidency would entail. While she is set to unveil her economic blueprint in North Carolina on Friday, Harris’s campaign website has yet to create an issue page. The Washington Post’s editorial board worried on Sunday that “if she hopes to prevail, Ms. Harris needs to present her ideas.” On the opposite side of the political spectrum, Trump is using Harris’s relatively vague stance on policy as a campaign talking point. The former president has claimed that Harris is afraid to discuss her record and is deliberately leaving voters in the dark about her policy agenda. The Harris camp argues that the vice president’s positions will mirror her boss’s agenda. “I don’t think we should overstate the mystery here — she’s been part of these policy proposals for the last four years,” Michael Linden, a former staff member in the White House budget office under Biden, told the New York Times.","summary":"Vice President Kamala Harris is investing heavily in her introduction to the country as critics say she&#8217;s dodging releasing her policy blueprint.&#160; After booking $50 million worth of ads last month, the vice president is launching a $90 million bid over the next three weeks, according to a report from the Associated Press.&#160; The advertising [&#8230;]","url":"https://www.washingtonexaminer.com/news/campaigns/3121676/harris-invests-90-million-introduction-voters-campaign-kicks-can-policy-agenda-details/","image":"https://www.washingtonexaminer.com/wp-content/uploads/2024/08/Kamala-Harris.-.webp","video":null,"publish_date":"2024-08-14 22:25:23","author":"Emily Hallas","authors":["Emily Hallas"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.058},{"id":254137932,"title":"Former 'Trump cheerleaders’' praise for Harris warns of 'trouble' for ex-president: conservative","text":"Many Republicans — from former Donald Trump advisers, to former and current lawmakers — have turned on the former president since his attempt to overturn the 2020 election. NPR noted earlier this week that former Rep. Denver Riggleman (R-VA) has called the MAGA leader an \"inveterate liar,\" while during Vice President Kamala Harris' Arizona rally last week, GOP Mesa, AZ mayor John Giles declared that he refuses to back his Party this election cycle — which he \"no longer\" recognizes. Aside from GOP lawmakers, even controversial, right-wing commentators like podcaster Joe Rogan — according to a Wednesday Mediate report — have praised Harris since the vice president accepted the 2024 Democratic presidential nominee last week. READ MORE: Harris campaign praised for 'killing Trump with condescension' after clever response to 'meltdown' Referring to Harris' Atlanta rally, Rogan said: \"I do have to say that one speech she gave right after they decided she was going to be the nominee, that one speech where she said, 'if you’re going to say something, why don’t you say it to my face?' It was great timing.\" Mediate reports: Rogan earned the ire of Trump recently after he praised independent candidate Robert F. Kennedy Jr., a previous podcast guest, and argued he’s the 'only one' in the race who makes sense. While Rogan stopped short of an official endorsement, some reported his words as if they were. Trump took to Truth Social to fantasize about Rogan being booed at the next UFC event he’s at — Rogan has long been a fight commentator. The news outlet also notes that although Rogan called Harris' address to the Atlanta crowd a \"banger of a speech,\" the former Trump fan \"also theorized that Harris has been heavily coached.\" Nonetheless, conservative columnist Peter Wehner noted: \"The fact that past Trump cheerleaders like [former Fox News host] Megyn Kelly and Rogan are turning on Trump underscores the trouble he's in. Buckle up, MAGA world; it'll get worse.\" READ MORE: How Harris’ rise has made 'pathetic' Trump 'revert to his feral ways': conservative","summary":"Many Republicans — from former Donald Trump advisers, to former and current lawmakers — have turned on the former president since his attempt to overturn the 2020 election. \n\nNPR noted earlier this week that former Rep. Denver Riggleman (R-VA) has called the MAGA leader an \"inveterate liar,\" while during Vice President Kamala Harris' Arizona rally last week, GOP Mesa, AZ mayor John Giles declared that he refuses to back his Party this election cycle — which he \"no longer\" recognizes. \n\nAside from GOP lawmakers, even controversial, right-wing commentators like podcaster Joe Rogan — according to a Wednesday Mediate report — have praised Harris since the vice president accepted the 2024 Democratic presidential nominee last week.\n\nREAD MORE: Harris campaign praised for 'killing Trump with condescension' after clever response to 'meltdown'\n\nReferring to Harris' Atlanta rally, Rogan said: \"I do have to say that one speech she gave right after they decided she was going to be the nominee, that one speech where she s","url":"https://www.alternet.org/joe-rogan-kamala-harris/","image":"https://www.alternet.org/media-library/image.jpg?id=53178637&width=1200&height=600&coordinates=0%2C0%2C0%2C171","video":null,"publish_date":"2024-08-14 22:23:20","author":"Maya Boddie","authors":["Maya Boddie"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.424},{"id":254137342,"title":"Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for the 'hardest concert of her career' as she returns for final leg of Eras Tour after foiled terror attack in Vienna","text":"Home News Royals U.S. Sport Showbiz Femail Health Science Money Travel Podcasts Shopping Best Buys My Profile Logout Login Discounts TUI Booking.com ASOS Just Eat Deliveroo boohoo Very Nike Virgin Media Uber Eats Boots B&Q Amazon John Lewis My Profile Logout Login Headlines Showbiz Kim Kardashian Victoria Beckham Harry Styles Amanda Holden Britain's Got Talent My Profile Logout Login Privacy Policy Feedback Wednesday, Aug 14th 2024 1AM 18°C 4AM 17°C 5-Day Forecast Advertisement Teenage Euros star Lamine Yamal's father is rushed to hospital in a 'serious condition' after being 'stabbed multiple times in a car park when brawl broke out' Rise of the XL Bully CAT: Warning over hairless felines with 'exaggerated' features that are being bred in the UK despite serious health issues Elon Musk and JK Rowling could be handed five-year prison sentences and fined up to £214,000 if Olympic boxer Imane Khelif wins criminal cyberbullying case Why Kate’s year has been tougher than anyone realises - and why she’s starting to glow again: REBECCA ENGLISH The sixteen rookie errors almost every gardener makes, and how to correct them, by the Mail's gardening experts Secret Putin files reveal British targets Russian navy would hit with NUCLEAR MISSILES in the event of a war with NATO WHO declares Mpox outbreaks a global health emergency: Fears raised virus which has killed 500 people in Africa could now spread worldwide Was Tommy Fury blindsided by Molly-Mae? Boxer shared snap of the couple enjoying dessert date just hours before she announced their break-up - as footage re-emerges of her cheating fears DEAR JANE: My husband tried to CHEAT with my daughter (his stepchild)... but I can't divorce him for an infuriating reason How to protect your investments from a recession in America as the world braces amid growing fears of 'Kamala Crash' You're letting people track your iPhone due to little-known features - here's how to turn them off The Pitt-Clooney bromance is back on! Brad and George Clooney rekindle their bond having drifted apart over a wedding snub and Angelina's 'rivalry' with Amal (as new interview features apparent subtle dig at Jolie) How the world's frozen billionaires will avoid being resurrected poor: Their severed heads are pumped with 'anti-freeze' and brains put on ice. Now they have a way to beat their biggest fear... My toe-curlingly embarrassing faux pas with an aubergine emoji... and other tales from 25 years of the emoji Easyjet cancels 232 flights over next three days from holiday destination loved by British tourists as cabin crew go on strike Urgent manhunt for suspected child sex offender with a large face tattoo who escaped police while in hospital - as cops offer £5,000 reward Mother dying from massive post-birth haemorrhage was just given ginger biscuit by hospital because staff believed she was just dehydrated Brave little girl, eight, beats robber with a baseball bat as he wrestles with her father after attempting to rob their store Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for the 'hardest concert of her career' as she returns for final leg of Eras Tour after foiled terror attack in Vienna How Harry and Meghan's tour of Colombia will take in historic town of freed African - but fears rise that the Sussexes' 'are being manipulated' by the country's government The exercise pill? Discovery of the body's 'activity switch' could lead to drug that gets us moving, scientists say Moment holiday-loving drug dealer is snared by police at the airport after he sent pictures sunning himself on a privately chartered boat in Turkey to one of his lackeys The rock by Gloria's side during her darkest times: How Stephen Way supported Gloria Hunniford during death of her daughter Caron Keating and struggles through covid pandemic Tennis legend Martina Navratilova, 67, adopts two young boys with partner Julia Lemigova, a year after admitting welcoming a new child was unlikely after her cancer fight Previous Next Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for the 'hardest concert of her career' as she returns for final leg of Eras Tour after foiled terror attack in Vienna Have YOU got a story? Email tips@dailymail.com By Geraint Llewellyn For Mailonline Published:23:08 BST, 14 August 2024 |Updated:23:22 BST, 14 August 2024 e-mail 8 shares View comments Taylor Swift will reportledy be joined on stage at Wembley by pal Ed Sheeran on Thursday, with a source branding her latest Eras Tour show 'the hardest concert of her career'. The singer, 34, was forced to cancel three gigs in Vienna last week due to a foiled terror plot, shortly after three young girls were murdered at a Taylor Swift themed dance class in Southport, Merseyside. Wembley will mark Taylor's first show since both incidents, which have reportledy left her 'shaken to the core' and will be supported by long term friend Ed, 33, with whom she has written many songs. It's also been claimed that the songstress will likely be planning on making a speech on stage in a bid to 'unify' her fans. Telling The Sun: 'Everything Taylor does is for her fans and she will be putting on the best show of her life when she returns to Wembley.' Taylor Swift, 34, will reportledy be joined on stage at Wembley by pal Ed Sheeran, 33, on Thursday, with a source her latest Eras Tour show 'the hardest concert of her career' The singer, was forced to cancel three gigs in Vienna last week due to a foiled terror plot , shortly after three young kills were murdered at a Taylor Swift themed dance class in Southport, Merseyside 'Hate never wins and Taylor absolutely stands for that. Her shows are about love, unity and acceptance, and this is a message she will always want to convey.' MailOnline have contacted Taylor and Ed's reps for comment. Taylor was due to perform in front of an estimated 170,000 fans on August 8, 9, and 10 at Vienna's Ernst-Happel-Stadion, which was set to be reinforced with more security measures before the three shows were cancelled. 'Taylor has been devastated by this. She is devastated for the fans who have been waiting for years to see her,' an insider told The Mirror, in the first indication of Swift's reaction following the news. 'But the thought of what could have happened if the concerts had been targeted by a terror attack is horrifying, and she would never risk the safety of her fans. 'The memory of what happened at Ariana Grande's concert in Manchester is still very vivid in everyone's minds. But she has told her team that she wants to try to return to Vienna as soon as possible in the future. She is very conscious of how disappointed her fans in Austria are.' The hitmaker has not made any public statements since the alleged plot was uncovered. The arrest of a third suspect was announced last week. Wembley will mark Taylor's first show since both incidents, which have reportledy left her 'shaken to the core' and will be supported by long term friend Ed with whom she has written many songs It's also been claimed that the songstress will likely be planning on making a speech on stage in a bid to 'unify' her fans Taylor was due to perform in front of an estimated 170,000 fans on August 8, 9, and 10 at Vienna's Ernst-Happel-Stadion (pictured) before the three shows were cancelled The teen, like the two others arrested earlier, was reportedly radicalized by the Afghanistan-based ISIS-K. Read More Taylor Swift surprises Vienna fans with Eras Tour film TV premiere Police say the main suspect, a 19-year-old man, planned to attack the tens of thousands of Swifties who gathered outside the Ernst Happel Stadium, with knives and machetes. The suspect, allegedly put together explosives as well in order to 'kill as many people as possible,' officials said. 'The group is considered the greatest external terrorist threat to the continent,' claimed UN undersecretary for counterterrorism Vladimir Vorokov, who said the group had increased its recruitment efforts on the continent, according to ABC News. The hitmaker previously posted an emotional message today after a knife attack at a dance class themed around her songs which left three children dead and six others critical. A 17-year-old boy remains in custody accused of murder and attempted murder and is being questioned following the incident in Southport, Merseyside, on Monday. Eight other children were injured with five of them - aged between six and 11 - in a critical condition alongside two female adults who 'bravely tried to protect them'. The hitmaker previously posted an emotional message today after a knife attack at a dance class themed around her songs which left three children dead and six others critical The attack happened at a Taylor Swift themed yoga and dance workshop The American singer wrote on Instagram: 'The horror of yesterday's attack in Southport is washing over me continuously and I'm just completely in shock. 'The loss of life and innocence, and the horrendous trauma inflicted on everyone who was there, the families, and first responders. 'These were just little kids at a dance class. I am at a complete loss for how to ever convey my sympathies to these families.' A JustGiving page - set up by Taylor Swift fans - has already raised nearly £50,000 to help families affected by the tragedy and pay for the two funerals. Ed SheeranTaylor Swift Share or comment on this article: Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for the 'hardest concert of her career' as she returns for final leg of Eras Tour after foiled terror attack in Vienna e-mail 8 shares Add comment Bing Site Web Enter search term: Search Advertisement DON'T MISS Was Tommy Fury blindsided by Molly-Mae? Boxer shared snap of the couple enjoying dessert date just hours before she announced break-up Jaden Smith puts on VERY amorous display with thong-clad influencer Khleopatre on yacht - one week after date with longterm partner Sab Zada Bianca Censori dons busty strapless dress as she spends quality time with Kanye West's kids and her family Hard to miss Why Kate's year has been tougher than anyone realises - and why she's starting to glow again: REBECCA ENGLISH Taylor Swift wears a £2,500 plaid co-ord as she parties until 3:00am after laying on two coaches for her crew and hiring out Annabel's for thank you bash EXCLUSIVE'It's like being on a film set!' How Max George and Maisie Smith fell in love with Malta on a romantic trip for two Ad Feature EDEN CONFIDENTIAL: Kim Kardashian's request to have honeymoon with Kanye West at castle owned by actor Dominic West was rejected Molly-Mae Hague is supported by Manchester United ace Luke Shaw's girlfriend Anouska Santos as pals arrive at her home following shock split EXCLUSIVEThe REAL reason Ryan Reynolds saved wife Blake Lively's new film It Ends with Us from 'disaster' - as Justin Baldoni drama reaches fever pitch Take a bite and sip of sunshine: Here's your top 10 guide to food and drink this summer Ad Feature 'He will cheat!' Stark warning from Tommy Fury's ex to Molly-Mae Hague is unearthed following the Love Island couple's shock split Jeff Brazier reveals he and son Freddie signed up for gruelling Celebrity Race Across The Word in a bid to help the 19-year-old find 'greater self worth' Was this Tommy Fury's last-ditch attempt to keep his relationship with Molly-Mae Hague going? Star made HUGE public love declaration weeks before split How Harry and Meghan's tour of Colombia will take in town of freed African - but fears rise they 'are being manipulated' by country's government Junior Andre, 19, makes his red carpet debut with glamorous girlfriend Jasmine Orr, 23, at the UK premiere of Alien: Romulus Tommy Fury enjoyed a cosy dessert date with Molly-Mae Hague and their daughter Bambi just HOURS before the couple's shock split Kim Kardashian signs deal with Disney's 20th Television to develop scripted shows - and her first series is with pal La La Anthony Lauren Sanchez and Jeff Bezos share a kiss in front of the Trevi Fountain and romantic dinner for two during loved-up night out in Rome Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for 'hardest concert of her career' as she returns for final leg of Eras Tour Blake Lively brushes off It Ends With Us drama as she raves about her BFF Taylor Swift's Eras Tour Nonplussed How Molly-Mae Hague changed after Love Island: Inside her transformation from glam reality star to chic 'rich wife' Celebrity Race Across The World review: The celebrities welcomed like prodigals in the back of beyond, writes CHRISTOPHER STEVENS Kaley Cuoco ENGAGED to Tom Pelphrey: Big Bang Theory star reveals diamond ring - one year after welcoming daughter What will happen to Tommy Fury and Molly-Mae's £9m fortune? From £4million Cheshire home to millions they have earned from boxing to huge deals Ashley Roberts suffers an awkward fashion faux pas as she battles the muggy weather in a skintight grey dress at screening of Alien: Romulus Molly-Mae Hague and Tommy Fury's romance: How love-split couple had first date in a Love Island hot-tub - before welcoming baby Bambi and getting engaged Scott Mills reveals he was forced to HALT filming for Celebrity Race Across The World after struggling with an 'awful' illness Molly-Mae SPLITS from fiancé Tommy Fury: Star confirms end of five-year romance Pregnant Mollie King exudes radiance as she showcases her growing baby bump in a chic brown dress while leaving BBC Radio One studios LIVEMolly Mae and Tommy Fury split: Latest updates as fans share their devastation after the couple announced their break-up in heartbreaking statements First look: Vicky McClure tears up as she learns about her great-grandfather's WWII ordeal - while retracing his steps on Who Do You Think You Are? EXCLUSIVEEamonn Holmes, 64, is locking horns with girlfriend Katie Alexander, 42, on two major issues Jennifer Garner looks somber on LA outing - as daughter Violet attempts to fix Ben Affleck's marriage to Jennifer Lopez Katie Price displays the results of her sixth facelift and 17th boob job in a tiny £890 Louis Vuitton bikini and £520 Prada hat amid bankruptcy woes So long stains! This cleaning gadget removes dirt and stains on carpets and upholstery in SECONDS - now on sale with a double discount SHOPPING Tommy Fury breaks his silence on split from fiancée Molly Mae Hague as he says he is 'heartbroken' they have decided to end their relationship Jess Impiazzi puts on a very leggy display in a glittering thigh-slash evening dress as she attends the UK Gala screening of Alien: Romulus Katherine Ryan turns heads in a quirky sheer skirt and thigh-high silver boots as she cosies up to husband Bobby Kootstra at Magic Mike event Jojo Siwa claims Nickelodeon 'blackballed' her after she came out as queer three years ago... as network HITS back Martina Navratilova, 67, adopts two young boys with partner Julia Lemigova, a year after admitting welcoming a new child was unlikely after her cancer fight How friends revealed Molly Mae and Tommy Fury had hit 'rocky' patch weeks before shock split today All over This Morning fans blast Josie Gibson for 'tuning out and staring into space' - accusing her of 'playing Candy Crush' when she thinks the cameras are off Charlie Sheen's daughter Sami, 20, reveals she's undergone her 'dream' nose job less than a year after getting breast implants Cailee Spaeny flaunts her figure in a sheer gown as she cosies up to co-stars Archie Renaux and Spike Fearn at the UK premiere of Alien: Romulus Heading to France? Grab unmissable perks with P&O Ferries All Aboard Rewards - score half price Club Lounge access, a FREE case of wine and more SHOPPING Liam Payne and his girlfriend Kate Cassidy look strained as they step out after fans accused him of making a 'misogynistic' comment about her How Stephen Way supported Gloria Hunniford during death of her daughter Caron Keating and struggles through covid pandemic EXCLUSIVEHeidi Klum, 51, breaks silence on TOPLESS pictures from beach kiss with Tom Kaulitz, 34 - and reveals why she has NO plans to cover up Netflix confirms the fate of The Gentlemen after Theo James gangster thriller scoops string of rave reviews Molly-Mae Hague and Tommy Fury fans express their complete shock at unexpected split and fume they'll not get to see 'the wedding of the year' Brad Pitt and George Clooney rekindle their bond having drifted apart over a wedding snub and Angelina's 'rivalry' with Amal EXCLUSIVE'Catwoman' Jocelyn Wildenstein, 82, seen enjoying luxury Miami Beach vacation with fiancé a year after claiming she was 'broke' All the signs Molly-Mae Hague and Tommy Fury were set to split: From the boxer's WILD holiday to influencer ditching her engagement ring Andra Day's temporary tattoo for her new film The Deliverance is STILL on her forearm over two years later Lindsay Lohan's dramatic new look: How the star transformed her style from wild party girl to red carpet icon All change Molly-Mae Hague poses for her last ever photo with Tommy Fury as they attend her sister Zoe's wedding - WEEKS before confirming their relationship is over EXCLUSIVEPaul Hollywood splashes out on helicopter with furious neighbours blasting Bake Off star for disturbing their sleepy Kent village Vanessa and Nick Lachey share their son's heart-warming response to Hawaii move after shock NCIS axe Julia Fox pays homage to iconic Olympics look with bizarre wraparound sunglasses Caused quite the buzz with her latest look EXCLUSIVERyan Reynolds opens up about father's Parkinson's battle and how parenthood with Blake Lively 'healed' him Iggy Azalea is not 'afraid to think outside the box' when it comes to her memcoin and Unreal Mobile successes Liam Payne leaves fans in shock as he makes 'misogynistic and hypocritical' comment to girlfriend Kate Cassidy EXCLUSIVEHow Violet Affleck has battled to fix dad Ben's marriage to Jennifer Lopez - after teen supported her estranged stepmom by wearing her dress Salma Hayek, 57, puts on a leggy display in printed dress while husband Francois-Henri Pinault, 62, shows off his sculpted form in Spain Tuesday. Blake Lively 'felt fat-shamed' by Justin Baldoni on It Ends With Us set and was 'uneasy' over kissing scene - amid feud rumors What HAS Katie Price had done to her face? Bloody bandages and weeping incisions reveal the extent of the surgery she's had Emily In Paris star Lucien Laviscount reveals his perfect Parisian date would be a sunset walk along the Seine to see the Eiffel Tower lights EXCLUSIVEJessica Alves reveals she is 'living a fairytale' with personal trainer and 'heir to a $50m company' boyfriend Dalton Phillips Lindsay Lohan shows off her toned legs in a dolphin print minidress on the set of Freaky Friday 2 EXCLUSIVEFuture King of Norway's stepson 'headed to an after-party' after alcohol and cocaine-fuelled assault on his girlfriend which neighbours could hear The touching reason why Jeff Brazier signed up to Celebrity Race Across the World revealed Sofia Vergara, 52, says she got a 'bionic' knee thanks to 'old age and s***' adding peri-menopause is causing her to forget things Good food, good wine and great friends? Get the gang together, get outside and embrace the spirit of Italy this summer (and put delicious pizza on the menu) Ad Feature 'Taylor Swift' spotted checking out the sights of London on a boat down the River Thames ahead of her sold out Wembley shows It Ends With Us star Justin Baldoni got 'screwed' creatively and the film crew are 'NOT all siding with Blake Lively' it is claimed Sofia Vergara makes barbed remark about ex-husband Joe Manganiello's claim they split over having kids: 'What am I gonna do, call him?' EXCLUSIVEGloria Hunniford's husband dies aged 85 as Loose Women star pays tribute to 'a gentleman who will leave the most enormous void' David Hasselhoff breaks down in tears as he meets his first grandchild after his daughter Taylor gave birth to a baby girl EXCLUSIVEChanelle Hayes shows off the results of her impressive 9st weight loss in a busty pink bikini as she soaks up the sun in Spain after tying the knot Heidi Klum, 51, flashes the flesh in a nude tank top with jeans CUT out under her butt... after going topless on the beach Megyn Kelly slams 'nasty' Charlize Theron years after she portrayed journalist in Bombshell movie - claiming she 'stole' her 'very intimate story' BBC Breakfast's Carol Kirkwood gives rare health update after struggling through weather report - and is flooded with support from concerned fans Chloe Ayling and actress playing her in BBC drama make first joint appearance on This Morning - and are forced to shut down trolls' conspiracies Gail Porter playfully flexes her muscles as she celebrates some good news with friends in a Soho café Hoda Kotb left stunned as Today cohost Jenna Bush Hager explains why she has a 'black eye' and isn't wearing her wedding ring Jonnie Irwin's widow Jessica Holmes' father dies as she says 'my heart breaks again' just months after losing her TV star husband to cancer battle Zoe Kravitz wows in lace look for Esquire - as she reacts to iconic meme of her riding the back of Channing Tatum's bike George Clooney is auctioning himself off as a dinner date in NYC next month - and fans are bidding a FORTUNE for the alone time Jon & Kate Plus 8 star Collin Gosselin, 20, reveals he was 'discharged' from the Marines and blames estranged mom Christine Baranski reveals Mamma Mia 3 is in the works: 'We'll all be on some fabulous Greek or Croatian island having a blast!' Love Is Blind UK hosts Emma and Matt Willis look every inch the loved-up couple on ITV's This Morning as one-off reunion special is announced EXCLUSIVEInside Taylor Swift's swanky thank you party at private members' club: Singer treats her 200-strong crew to a free bar and parties to 3am Naomi Campbell, 54, says her 'biggest joys' are raising her two 'beautiful' children and admits motherhood has 'taught her a lot in life' Tasha Ghouri shows off her tan in a patterned green bikini as her Strictly Come Dancing debut nears Harry and Meghan will visit Colombia's first 'free town' on their latest tour amid claims they are being used as 'pawns' to distract from Government scandals EXCLUSIVEMichelle Collins, 62, reveals the reason her husband Mike Davidson, 40, proposed after detailing how it took her decades to find love Reporter calls out Blake Lively over 'uncomfortable' interview that 'made her want to QUIT her job' amid It Ends With Us drama awry. Love Island's Millie Court flaunts her bottom in a bikini as boyfriend Liam Reardon mocks the cheeky snap Billionaire Kim Kardashian is now selling her USED swimsuits online... but is anyone buying the XS items? Demi Moore's daughter reacts after cruel trolls brand sisters 'unattractive' and 'clones' of dad Bruce Willis in viral dance video Britney Spears, 42, reveals what she did last year that made her feel a 'huge difference' in her personality: 'I became this cool character' Emily In Paris' Lily Collins looks sleek in a chic plunging dress as she joins the main cast of the Netflix show ahead of the series four premiere Inside Crown Princess Mette-Marit's scandalous past: Future Queen of Norway previously apologised for her 'youthful rebellion and wild life' Antiques Roadshow guest can't stop shaking as she learns 'really shocking' value of dish dumped in the loft for 20 years A Place In The Sun's Jonnie Irwin left nearly £1million to widow Jessica Holme in his will after his death from lung cancer Future King of Norway's stepson admits to assaulting his girlfriend 'after an argument' while 'intoxicated with cocaine and alcohol' Eamonn Holmes asks stunned GB News co-host 'if she has one boob bigger than the other' in outrageous probe just minutes into live show Strictly pro Lauren Oakley puts on a leggy display in shorts as she arrives for rehearsals alongside Nadiya Bychkova and Michelle Tsiakkas Snoop Dogg joins Adele and Jimmy Fallon in mocking Raygun after breakdancer became a viral sensation following Olympic Games flop Billie Piper is a vision in liquid gold dress as she poses for sultry photoshoot taken by pal Jaime Winstone Ban the beret! Emily in Paris fans who recreate the show's outfits in the capital admit they're 'embarrassed' after backlash from locals Gemma Owen looks incredible in a silk dress and £1,115 YSL heels on holiday in Marbella with her glamorous lookalike mum Louise EXCLUSIVEKyle Walker and Annie Kilner put their marriage crisis to one side over his affair with Lauryn Goodman - as he treats WAG to birthday barbecue How Top Gear crash changed Freddie Flintoff forever: Horror injuries, nightmares that left him 'crying every two minutes' and ten months out of public The Jamaican-born footballer, 28, who is romancing Madonna: Meet the new boyfriend of the pop icon, 65, who is 37 years her junior Freddie Flintoff praised for 'incredible' kindness towards autistic teen - who admits he's only eaten Pringles since leaving Manchester for India George Clooney reveals the one person he will NEVER work with again as he brands them a 'miserable f***' EXCLUSIVEJaymi Hensley breaks his silence after the tragic passing of his 'beautiful' fiancé Oliver Marmon who plummeted to his death from a hotel window Legendary ITV reality show returning to screens next week for sun-soaked international series Loose Women's Coleen Nolan brutally brands co-star Christine Lampard 'ugly' and swipes 'are you still talking?!' Sian Welby reveals when she will return to Capital Breakfast as she makes announcement while 'sat in her pants' after welcoming her first child six weeks ago EXCLUSIVEBobby Brazier is seen for the first time since he broke his silence on the Strictly scandal and detailed 'bickering' with his dance partner Katie Holmes reveals how she'll cope with Suri Cruise flying the nest after quietly nurturing teen's secret dream for showbiz stardom Suki Waterhouse says she 'manifested' being chosen as an opening act for close friend Taylor Swift's Wembley Eras Tour show Heart-rending moment Freddie Flintoff tells youngsters he may never feel better again as he opens up on the terrifying Top Gear crash Will Young, 45, reveals he is 'enjoying dating again' and has 'rediscovered his libido' after fears of falling in love and getting his heart broken Nancy Dell'Olio, 62, puts on a VERY busty display in revealing bikini while relaxing in a pool in Puglia during her self-proclaimed Brat Summer Nick Carter is 'suing his rape accuser Melissa Schuman for $2.5M as he claims she has intentionally defamed him to revive her 'dwindling career' Team GB's Olympians enjoy celebratory lunches, cakes and pamper sessions as they return to normality after Paris success Lily James sends temperatures soaring in a bikini as she poses for a sizzling mirror selfie during her trip to Kenya Bearded William is trying to be the David Beckham of the Royal Family, and it just won't do: AN WILSON Guitar legend Jeff Beck left his entire £28million fortune to second wife Sandra before his sudden death from meningitis, his will documents reveal Inside Freddie Flintoff's inner circle as he opens up on his Top Gear crash trauma: Doting wife Rachael has 'seen the worst of him' The heartbreak behind Union J: X Factor band has been marred by devastating tragedies as bandmate Jaymi Hensley's fiancé Oliver Marmon dies after fall The Chase star Anne Hegerty says there are NO downsides to money and fame and declares she 'loves being rich' Ashley Benson and husband Brandon Davis enjoy time off parenting duties as they head to dinner six months after welcoming their daughter Louise Thompson looks happy and confident as she poses in blue swimsuit while on holiday in Ibiza after detailing her health woes Kim Kardashian puts on a busty display as she meets Ivanka Trump and Jared Kushner for dinner at Nobu The reality star was spotted on Tuesday Future Queen of Norway whose son faces jail after being charged with assaulting 'lover' has 'contacted victim' EXCLUSIVEGordon Ramsay, 57, and his son Oscar, 5, look delighted on the Cars movie ride at Disneyland on family day out with his wife Tana and baby Jesse Bikini-clad Gabrielle Union looks incredible as she poses for selfies with Emma Weymouth and husband Dwyane Wade on a superyacht in Saint Tropez Fans go wild as Oasis release new material: Band debut alternative version of Sad Song by Liam Gallagher to mark 30 years of Definitely Maybe Camila Cabello flashes her cleavage in a vest top as she parties with mystery man in Ibiza while ex Shawn Mendes enjoys evening in London Dr Alex George reveals his tips on how to handle pressure ahead of A-level results day Good Morning Britain viewers 'switch over to BBC' and bombard show with complaints as 'banal' report leaves them fuming Jessica Alves finally finds love with personal trainer boyfriend Dalton Phillips as the pair put on a loved-up display for a date night in Mayfair Fitness guru Kayla Itsines shows off her figure in a black bikini and packs on the PDA with her husband Jae Woodroffe during cosy swim in Sicily Les Dennis wades into Strictly Come Dancing bullying row - admitting 'it's the hardest thing ever and they want to push you' Pregnant Sophie Cachia denies 'wild' theory that her ex Jaryd is the father of her third child as she urges fans to 'leave his personal life out' of it EXCLUSIVE'Annie Kilner is not innocent and has had her own affairs': Now Lauryn Goodman's grandmother joins WAG war From England manager...to property mogul! Ex-Three Lions boss Gareth Southgate now owns 16 properties after buying five new homes Kylie Jenner says she's going to become a pop singer four years after iconic 'Rise and Shine' wake-up song went viral Sweet Swifties!Taylor fans give away their Wembley tickets for free to those who missed out on singer's cancelled concerts in Vienna Wembley prepares for the arrival of Taylor Swift: Fans will be banned from 'Tay-gating' gatherings outside stadium during Eras Tour dates Good Morning Britain host announces extended break from show after sparking 8,000 Ofcom complaints - as Trisha Goddard takes over Madonna, 65, holds hands with new boyfriend Akeem Morris, 28, ahead of 66th birthday celebrations in Italy Country star Sheryl Crow apologizes to fans after 'devastating' blow at Zach Bryan concert Kanye West's wife Bianca Censori and sister Angelina pose in racy looks at rapper's Vultures 2 listening party Freddie Flintoff leaves fans in tears as he reveals he suffers 'nightmares and flashbacks' from his horror Top Gear crash Married At First Sight's Sara Mesa reveals shock amount she was paid for starring on Channel Nine show: 'Chump change!' Olivia Rodrigo flaunts her incredible abs in glittering bra and skirt while hitting the stage for GUTS World Tour in LA X Factor star Jaymi Hensley's fiance wrote poignant post looking forward to their wedding before he died in 30ft hotel window fall five weeks before the date Matt Damon is every inch the doting father as he heads out shopping with his two daughters and wife Luciana at Bondi Junction Olivia Attwood insists women should 'stop pretending' they can 'have it all' as she reveals she is putting her career first over starting a family Kylie Jenner addresses rumour she took Ozempic to lose weight - as she stuns in snaps to celebrate British Vogue cover Adam Peaty reveals how the Ramsays and religion saved him: Olympic hero wants more children with his 'brilliant' girlfriend Holly Love Actually fans can buy property on same London street where Mark tells Juliet he loves her using his giant cards Real Housewives of Dubai: Chanel Ayan learns her 'forensic' age is much older than her real age EXCLUSIVEInside the Spice Girls feuds that have ripped the band apart since before they released Wannabe - as insider reveals they may never perform again REVEALED: The horrific facial injuries that forced Freddie Flintoff to quit Top Gear and retreat from public eye for 18 months John Cena passionately kisses wife Shay Shariatzadeh as he joins Awkwafina and Simu Liu at starry premiere of their new film Jackpot! Pirelli Calendar 2025: Hunter Schafer bares all on the beach while Padma Lakshmi goes braless in a sheer dress - but it's not just the girls stripping off! Priyanka Chopra sizzles in daring sheer outfit as she supports husband Nick Jonas at The Good Half premiere in LA EXCLUSIVESimone Biles' birth mum Shanon tells why she abandoned Olympic hero daughter as she begs for forgiveness after estrangement Real Housewives of New York City newcomer Rebecca Minkoff bristles at Scientology question and boasts of $100M company in season 15 EDEN CONFIDENTIAL: Kirstie Allsopp's cousin Jamie revives the family's brewery - and it's on site of bar linked to a Donald Trump scandal Surreal Life: Villa of Secrets: Chet Hanks celebrates two years of sobriety while opening up on the cocaine binge that set him on the straight and narrow Freddie Flintoff's Field of Dreams On Tour: He's lost the persona, but cricket can bring back his glow, writes CHRISTOPHER STEVENS Simon Cowell 'has ALREADY secretly married partner Lauren Silverman after three year engagement' claims his ex Sinitta Kevin Hart makes shock drug confession as he comes clean about the night he cheated on wife Eniko Jennifer Garner takes Fin to pottery making and coloring studio in LA - after Jennifer Lopez took her stepson Samuel shopping amid Ben Affleck divorce Look, no tan lines! Heidi Klum jets back from topless romp in St Barts for red carpet fun with Sofia Vergara at first America's Got Talent live show America's Got Talent: Hakuna Matata Acrobats earn the first ever Live Shows Golden Buzzer by Sofia Vergara 'We have a really hard time with it': Chloe Madeley reveals she rows with her ex-husband James Haskell over co-parenting their daughter Bodhi William and Kate pay tribute to pizza-seller they met on engagement after he dies of cancer, aged 47 - sending a letter to the father-of-two's widow EXCLUSIVEBreast cancer survivor Christina Applegate, 52, seen puffing on cigarette in LA amid MS health battle Patrick Mahomes lets slip how Taylor Swift made Travis Kelce change his style before the new NFL season Elizabeth Banks shimmers in silver gown as she leads stars at Skincare premiere in NYC alongside Christina Hendricks Tori Spelling lands wholesome job with Kristin Cavallari amid cashflow crisis after considering topless modeling on OnlyFans It Ends With Us star Justin Baldoni hires crisis manager amid major drama with Blake Lively Fans rush to Kanye West's defense after his wife Bianca and sister Angelina pose in racy looks... amid rumors rapper is forcing her to wear X-rated outfits Craig Doyle becomes visibly emotional as he receives his first batch of feedback on Celebrity MasterChef after revealing how he cooks for his entire family Will Young recalls VERY unlikely experience at Buckingham Palace during lunch with the Queen . England star John Stones is engaged! Manchester City ace reveals he will marry entrepreneur girlfriend Olivia Naylor after romantic proposal Inside Madonna's 66th birthday celebrations as the Queen of Pop throws a lavish party in Italy after having a 'big health scare' during world tour Ciara rocks two sizzling leather outfits as she shows dog Bronco around NYC and visits top of Empire State Building BBC viewers praise Freddie Flintoff in 'brilliant' new series as Top Gear presenter reveals full extent of his life-changing crash injuries for first time Charlotte Crosby risks a VERY cheeky quip about judge Gregg Wallace as she makes energetic debut on Celebrity MasterChef Vanessa and Nick Lachey forced to relocate family after CBS axed her NCIS Hawaii series Kehlani alleges ex Javaughn Young-White is abusive as she requests restraining order... after he filed for full custody of daughter while claiming singer was in a SEX CULT Jamie Borthwick sparks romance rumours with EastEnders co-star Jazzy Phoenix as he confirms they are spending time together Jade Goody and Jeff Brazier's rarely-seen son Freddie, 19, joins his dad on Celebrity Race Across The World as he discusses his plans for the future Strictly bosses 'brace for criticism amid bullying probe as investigation now looks at whether concerns on show were adequately escalated' Kylie Jenner and Timothée Chalamet exit her private jet after romantic getaway for her 27th birthday Special day Ryan Phillippe's look-alike son Deacon, 20, heads out on shirtless hike in LA - before returning to NY for college Richard Osman poses alongside Oscar-winning film director Steven Spielberg as work continues on his adaptation of The Thursday Murder Club Brad Pitt stages GQ photo shoot at the French winery he and Angelina Jolie are battling over in court X-Factor star's arrest nightmare after fiancé falls out a hotel window and dies: Union J's Jaymi Hensley is cleared by police over death of Oliver Marmon Chris Pratt's wife Katherine Schwarzenegger displays her baby bump in a white tank top as the couple expect 3rd child George Clooney reveals he's 'irritated' with Quentin Tarantino for talking 's**t' about his movie career - and Brad Pitt finds it hilarious Pamela Anderson's son Brandon Thomas Lee loses country club membership after tense confrontation on golf course Tragic final photo reveals X-Factor star 'Jaymi' Hensley posing with his fiancé Oliver Marmon ahead of the pair's wedding That'll take some topping! Ed Sheeran is mobbed at Hertfordshire supermarket as hundreds gather to watch him serve up pizza Jenna Ortega looks incredible in a netted semi-sheer gown as she joins co-stars Michael Keaton, Monica Bellucci and Justin Theroux at Beetlejuice 2 photocall Blake Lively goes into damage control by FINALLY addressing the domestic violence in It Ends With Us amid criticism over 'tone deaf' film promo Weed-smoking Snoop Dogg 'angered Muslim guests by stinking out entire floor of a five-star London hotel' days before he left for the Olympics Jessica Biel gets back to work on her new series in NYC amid husband Justin Timberlake's DWI scandal Alien: Romulus first critics reactions are in as they praise director Fede Alvarez's film that takes the franchise in 'a crazy new direction' Conor McGregor gifts fiancée Dee Devlin £105,000 necklace for her 37th birthday as he puts on lavish celebration aboard their £3million yacht Kylie Jenner reveals the OTHER baby name she called son Aire - that wasn't Wolf - as she puts naming struggle down to postpartum depression Snoochie Shy is the first star to be eliminated from Celebrity MasterChef as the radio DJ admits she had a 'disaster in the kitchen' Olivia Wilde shows off her incredible abs in form-fitting gym-wear as she leaves a Los Angeles fitness studio after intense workout Coronation Street icon reveals she is eager to join rival soap opera EastEnders just four years after quitting Weatherfield Eamonn Holmes roars 'don't lecture me - give me a break!' at livid GB News guest as Union Jack flag debate takes explosive turn Katie Piper stuns in a green bikini during Spanish summer break as she reveals her 'secret' to staying safe in sun was inspired by Loose Women co-star X-Factor star's fiancé is killed after falling out of hotel window: Union J's Jaymi Hensley's partner Oliver Marmon dies five weeks before they were due to marry REVEALED: Sussexes' outgoing chief of staff was hired to 'guide' Harry 'through his next phase' before departing three months later Amanda Abbington 'is being supported by her ex-partner Martin Freeman amid ongoing Strictly Come Dancing scandal' EXCLUSIVETom Cruise's secret FURY at Olympics jump - as its revealed actor, 62, IGNORED 'worrying' pleas to scale back on death-defying stunts Justin Baldoni addresses 'friction' on set of It Ends With Us amid feud rumors with Blake Lively: 'That creates the beautiful art' Joanna Lumley left heartbroken as Peter Pan's Scottish 'home' faces closure due to mounting running costs and dwindling visitors Move over Kim! Billionaire Kylie Jenner becomes the FIRST member of her family to grace the cover of British Vogue Binky Felstead looks incredible in nude swimwear as she enjoys a fun-filled getaway with her friends in Cannes Hard to miss Katie Holmes steps out in NYC after making rare comments about daughter Suri Cruise heading off to college Going solo Blake Lively fans blast It Ends With Us actress over 'tone deaf' and 'shallow' interview with costars Not happy Richard E Grant surprises fans at the Edinburgh Fringe as he arrives to support his old friend Miriam Margolyes at her sex-fuelled show Ben Affleck seen smiling after reuniting with Jennifer Lopez at LA home... as 'estranged' couple's wedding anniversary is only a week away Chart-topping Netflix show bags a second season after string of rave reviews as show creator gushes 'I can't wait!' Popular Advertisement Follow DailyMail Subscribe Daily Mail Follow @dailymail Follow DailyMail Follow MailOnline Follow Daily Mail MORE DON'T MISS Kate Ferdinand looks incredible in a skimpy brown thong bikini as she hits the beach during sun-soaked holiday in Portugal Brad Pitt and George Clooney claim they are too famous to go to the HOSPITAL as they joke they are on their own if they get a 'knife wound' Bluesfest calls it quits after 35 years: Byron Bay music festival announcement shocks All over RHONJ star Teresa Giudice's daughter Gia, 23, sparks furious debate after saying she's 'financially independent' despite still living at home RHOC star Katie Ginella sued by man in $5 million lawsuit over alleged stolen 'Golf Shot' idea as she's accused of committing 'fraud' Lindsay Lohan's mom Dina, 61, accused of trying to look YOUNGER than her daughter, 38, in 'embarrassing' selfies - after undergoing neck surgery and facelift Salma Hayek, 57, is a busty beauty in a purple bikini top as she enjoys her summer vacation on a luxury yacht Looking good Katy Perry under investigation for possible environmental damage to Spanish dunes where she filmed music video Lifetimes George Clooney and Brad Pitt finally settle their 'mullet war' and reveal who wore the divisive '80s hairstyle best more than 40 years on Dua Lipa shows off her figure in a bikini snaps and reveals she tops her jacket potatoes with CAVIAR as she gives glimpse into her Cornwall trip Amanda Holden, 53, and lookalike daughter Lexi, 18, soak up the sun by a pool as they copy photographer Slim Aarons' iconic backgammon shot Selling Sunset's Chelsea Lazkani gets choked up over split from husband Jeff in emotional season eight trailer The downtime worth its weight in gold: Team GB's Olympians return to normality as they make the most of home cooked meals and nights out Pregnant Rachel Fuda accuses Teresa Giudice of 'manufactured' friendships with costars after RHONJ 'Off the Rails' special EXCLUSIVESopranos star Michael Imperioli lifts the lid on future plans for a reboot of the hit HBO show - as he reveals his own 'fascinating' idea f Lioness Mary Earps becomes the first female footballer to get a wax figure at Madame Tussauds Back of the net Inside Julia Bradbury's, 53, battle with breast cancer as former BBC presenter claims the disease 'saved my life' Teri Hatcher, 59, reveals she has given up on dating after being thrown of dating app Hinge as she arrives at radio studios in white ensemble Laura Anderson reveals she felt 'attacked' by ex Gary Lucy when he publicly announced their split while she was pregnant A Very Royal Scandal first look: New Amazon Prime series sees Michael Sheen transform into Prince Andrew for 'car crash' interview Lauryn Goodman enjoys a day out with children in first sighting since she 'leaked bombshell messages from Kyle Walker' Frankie Valli, 90, goes viral as frail star struggles to lip sync on stage and fans beg: 'Let the man retire' Sparked concern during a recent performance As future King of Norway's stepson is charged with assault, how family is plagued with drama - from their own Megxit to Princess meeting Epstein Emma Weymouth, Marchioness of Bath, 38, shows off her toned figure in a yellow bikini as she soaks up the sun with her husband, 50, in St Tropez Big Brother legend Nadia Almada fights back tears and issues heart-wrenching apology to her younger self for 'fat-shaming and objectifying her looks' Only Murders In The Building season 4 trailer sees Selena Gomez, Steve Martin and Martin Short starring with Eva Longoria and Melissa McCarthy EXCLUSIVENick Pasqual's ex shows off vivid stabbing scars as she comes face to face with the How I Met Your Mother actor in courtroom showdown Dr Dre reveals the sport he's considering entering the 2028 Olympics with and slams breakdancing performance at Paris games Shirtless Mark Wright shows off his and wife Michelle Keegan's incredible garden transformation Love Is Blind UK announces explosive reunion episode - with Netflix couples revealing truth behind their engagements in just weeks EXCLUSIVEKylie Jenner's fans think they spy her boyfriend Timothee Chalamet in the background of one of her new Instagram photos Bikini-clad Cara Delevingne looks smitten with girlfriend Minke as she celebrates her 32nd birthday with romantic holiday Channel 4 confirms return of boundary-breaking dating show that shocked viewers with swinging and threesome scenes - and it's looking for bold couples to take part Dan Walker confirms his return to work after painful health battle - and teases brand new project Taylor Swift waxwork unveiled at Hamburg's Panoptikum museum - but do you think it looks like her? Paddy McGuinness discovers hidden connection to US President Joe Biden as he delves into his ancestry Heather Rae El Moussa enjoys Caribbean vacation with husband Tarek... amid Flip Off co-star Christina Hall's nasty divorce drama Blake Lively's castmates and It Ends With Us author also want 'nothing to do with' director Justin Baldoni after MAJOR drama on set Pregnant Georgia May Jagger, 32, poses in a sunflower field with her mother Jerry Hall, 67, three weeks after announcing she is expecting her first child Pop Idol's Michelle McManus shows off her incredible NINE stone weight loss after going on a journey of 'self love and self worth' EXCLUSIVEGold medal Olympian Keely Hodgkinson flaunts her toned frame in a bikini on Marbella getaway after skipping the closing ceremony Charlotte Crosby reveals she was reduced to tears on Celebrity MasterChef as she details her 'emotional' time filming Mollie King is seen for the first time since announcing she is expecting her second child with cricketer fiancé Stuart Broad Country singer Parker McCollum and his wife Hallie Ray Light welcome their first child and reveal his VERY unique name The Gilded Age actress Carrie Coon confesses HBO period drama not something she would choose to watch herself Mark Wahlberg, 53, makes the rare move of posing with his wife of 15 years and three of their four children at The Union premiere This Morning sparks outrage with 'useless and patronising' money-saving segment as viewers fume at being 'lectured by millionaires' Brie Larson puts on a leggy display in pink tweed mini skirt as she discusses her role in Lessons in Chemistry with co-star Aja Naomi King Line Of Duty and Motherland star Anna Maxwell Martin shows off striking new look in first pics from David Mitchell's new BBC comedy Ludwig Damon Albarn's father Keith dies aged 85: Art and design expert passes away after being diagnosed with cancer Damon Albarn's father Keith Albarn has died aged 85. Sheridan Smith seen for the first time in character as murder campaign mum Ann Ming to film ITV true crime drama Julianne Hough models a sheer outfit before telling GMA who her dream Dancing With The Stars partner is (hint: there is a Taylor Swift link) Disney Channel star is arrested for domestic battery after public fight with her boyfriend Katie Price shares busty bikini snap before frolicking in the sea with boyfriend JJ Slater during Isle of Wight trip - after vowing to stop going on holiday Mia McKenna-Bruce reveals the adorable way her now-husband Tom Leach proposed to her with the help of a tick-box card and a pile of crumpets Inside JLo's battle to save her family: How star is keeping Ben Affleck'skids close with shopping sprees, holidays and lending her designer dresses Lucien Laviscount reveals he was only meant to be in TWO episodes of Emily In Paris as he details 'heartbreaking' fourth series David Beckham fans baffled as he 'shows off his BMX skills' at the Olympics - but all is not as it seems! Look closer Hollyoaks star reveals they've quit soap amid string of huge cuts - admitting they're now unemployed as they put out call for work I Tom Daley is branded a 'true warrior' by husband Dustin Lance Black as he pays heartfelt driver to the Olympic diver after he announced retirement Pregnant Megan McKenna shows off her baby bump in a bralette as she whips up a 'wild' dinner Richard Madeley and Judy Finnigan's daughter Chloe reveals her parents have 'really struggled' during their 38-year marriage EXCLUSIVEJessica Alves blasts Barclays for closing her account 'because she has OnlyFans' - despite not featuring any pornographic material Country legend hospitalized during trip home to honor her career Where are the Celebrity MasterChef winners now? From Greg Rutherford to Lisa Snowdon and Nadia Sawalha as new season gets underway Antiques Roadshow guest doubles over and gasps 'I'm going to cry!' as expert reveals mind-boggling value of teapot passed down from grandmother Millie Mackintosh looks unrecognisable in moisturising gold face mask as she takes part in 'morning shed' trend Shifters is a HIT! Play with Maya Jama and Idris Elba as producers is hailed 'beautiful, funny and moving' as audiences gush over West End transfer EXCLUSIVEBachelor vet Ashley Iaconetti reveals how Tom Cruise inspired her 2nd son's name, what her cravings are and if she will have another child Katie Price poses for loved-up snaps with boyfriend JJ during Isle of Wight trip - after vowing to stop going on holiday before bankruptcy hearing Halle Berry is left shrieking in shock as Mark Wahlberg surprises her with a Wahlburgers food truck at her doorstep Jennifer Lopez's close bond with Ben Affleck's son Samuel revealed as they hug on shopping spree... after warring couple reunited at actor's home From Kendall Jenner's patriotic outfit to Princess Anne's £23 bucket hat... The best celebrity outfit choices at the Paris Olympics The Bachelor is named for season 29... and he is a familiar face from a past season Julia Fox goads ex Kanye West as she steps out in a Gap dress amid rapper's ongoing bitter feud with the brand Janet Jackson leaves Scott Mills speechless as she reveals who her surprising A-list cousins are Halle Berry dares to bare in see-through lace dress at premiere of Netflix movie The Union in LA EXCLUSIVEPrince Harry and Meghan Markle's new chief of staff 'quits after only three months' on the eve of their 'quasi-royal tour' of Colombia Love Is Blind UK's Sabrina leaks entire Netflix romance edited out of show - admitting 'there's so much you don't see' Home and Away veteran Lynne McGranger sparks concern as she shares photos of shock injuries Rihanna and ASAP Rocky swim with children Riot Rose, one, and RZA, two, as they enjoy Barbados vacation Ferne McCann displays her amazing figure in a brown bikini as she shares sizzling snaps from her family holiday to France Kanye West's wife Bianca Censori dances suggestively with female partygoer as rapper DJs in LA Getting close EXCLUSIVEGeri Halliwell goes to war with Mel B: Ginger pulls the plug on Spice Girls reunion because she can't 'bear to share the stage with bandmate' Fans go wild after finding out what happened to Shun and Dai after the end of Netflix's new Japanese dating show The Boyfriend Lydia Bright flaunts her jaw-dropping figure in a white bikini before slipping into a black swimsuit as she poses for sizzling snaps in Italy Beloved BBC star quits show after five years - announcing plans to 'go out with a bang' in just weeks as they pay tribute to fans Helen Skelton shows off her toned abs in a sports bra and leggings as she goes walking in the Lake District with friends Prince Harry 'wants to elevate Meghan Markle to status accorded to her' with their quasi-royal tour of Colombia, royal author claims EXCLUSIVEKatherine Ryan says she won't do Strictly because she's 'not ready to cheat on my husband' as she talks about the dreaded curse EastEnders spoilers: Sonia is arrested for murder Junior's love secret is revealed, Teddy moves in to infamous No1, Albert Square and Sonia and Reiss are arrested EXCLUSIVEFrasier star Kelsey Grammer's plans for Grand Designs-style makeover of his £1m cottage are blocked for being too big Vince Vaughn cosies up to glamorous wife Kyla before partying with co-stars Meredith Hagner and Charlotte Lawrence at the Bad Monkey premiere Good Morning Britain fans thrilled as 'terrific' Trisha Goddard joins as host - but fume that Richard Madeley 'needs replacing' Rochelle Humes wows in a skimpy orange bikini as she poses for racy snaps on a yacht during lavish Ibiza getaway Ridley Scott makes a rare red carpet appearance as he steps out for the LA premiere of Alien: Romulus - over 40 years after directing the original Mark Wahlberg's lookalike son, Michael, 18, flashes tattoo on rare family red carpet at The Union premiere What Katy did next! Bikini-clad Perry plummets feet first into the ocean with fiancé Orlando Bloom after leaping from a helicopter Carol McGiffin, 63, marks 16th anniversary with husband Mark Cassidy, 42, as she shares bikini-clad throwback EXCLUSIVERevealed: How Katie Price's ex social worker has now become her 'rock' - after being 'sacked from council job for getting too close' to her John Mulaney talks about his secret marriage with Olivia Munn for the FIRST TIME - and brings his new mother-in-law to Late Night interview EPHRAIM HARDCASTLE: Meghan Markle in tricky lifestyle brand launch as Netflix won't air her cooking show until 2025 Awkward Mariah Carey, 55, makes a rare sighting with her mini-me daughter Monroe, 13, as they arrive by private jet in Sardinia Celebs go celibate! Emily Ratajkowski is the latest star to say she is 'decentring' men and putting romance on the back burner Pregnant Lala Kent supports pal Brittany Cartwright after she accused ex Jax Taylor of charity scam Blake Lively and Justin Baldoni witnessed arguing while filming It Ends With Us in New Jersey Maya Jama wows in a summery white dress as she leaves first night of new play Shifters after she was revealed as one of the project's producers Coronation Street star sparks rumours he is set to leave the cobbles after fans spot clues on social media about his next moves Kylie Jenner spends 'best' birthday with Timothee Chalamet and shares snaps of lavish celebrations... following Travis Scott's latest arrest drama Taylor Swift's ex and presidential candidate Robert F. Kennedy Jr's son Conor Kennedy engaged to Brazilian singer Giulia Be Channing gushes on Zoe: Channing Tatum calls fiancee Zoe Kravitz 'the love of my life' while promoting their new movie Blink Twice on The Tonight Show Kym Marsh breaks her silence on Strictly scandal and 'defends' former partner Graziano Di Prima after he was axed for abusing Zara McDermott EDEN CONFIDENTIAL: Nigella Lawson's favourite fashion label owes more than £500k after going bust - with creditors branding firm 'immoral' Amanda Holden is every inch the doting mother as she pays tribute to her daughter Hollie, 12, in a sweet Instagram post EXCLUSIVEJeremy Clarkson puts up huge tent in the grounds of his £1million Cotswolds pub so he can sell alcohol to punters while building work continues Matt Damon says he 'could never imagine living like' pal Ben Affleck and is glad to be 'boring with no scandals' Kevin Costner hugs son Cayden, 17, in RARE family sighting as they grab lunch in Santa Barbara following Italian yacht voyage Dancing With The Stars alum Sharna Burgess reveals what it's really like being a stepmother to Megan Fox's kids Anthony Bourdain biopic in the works with award season darling Dominic Sessa in talks to star Porsha Williams left heartbroken after death of beloved young family member who starred in spin-off Bravo reality show ITV fans claim gripping Irish crime thriller is 'better than Kin' as viewers brand the BBC series a 'poor man's version' of classic show Rihanna is FINALLY readying release of ninth studio album after eight-year drought - and 'headlining Glastonbury' to celebrate: 'The wait is almost over' Kylie Jenner's BFF Anastasia 'Stassie' Karanikolaou shows off surgery-enhanced bikini body while swimming with sharks Dean Gaffney says he will be 'haunted forever' as he recalls finding mother Marion dead in an heartbreaking tribute marking one year since her tragic passing Liam Payne, 30, treats girlfriend girlfriend Kate Cassidy, 24, to a romantic dinner date as they step out hand-in-hand in Manchester Mel Gibson, 68, looks unrecognizable at Vince Vaughn's Hollywood Walk of Fame ceremony in LA All change Lauryn Goodman leaks bombshell messages 'from Kyle Walker and vows to dispel obsessive gold digger narrative' FINAL three Strictly Come Dancing contestants confirmed: Nick Knowles, Paul Merson and GB hockey sensation Sam Quek set for new series Comedian looks UNRECOGNISABLE in a baseball cap and shades on rare outing following 'show AXE after one series' - but can you guess who? Vicky Pattison says the price of her upcoming dream wedding in sun-soaked Italy has left her 'heartbroken' Julianne Hough talks failed relationships with Ryan Seacrest and Brooks Laich - after admitting she was in an 'addiction loop' Paloma Faith insists co-parenting 'doesn't exist' as women still do the bulk of child-rearing and admits being a single mother is 'exhausting' Made in Korea FIRST LOOK: Five British boys attempt to make it as the next big band in the K-Pop world in new BBC series narrated by Vick Hope Queen Elizabeth's secret royal flight traditions are revealed - from guzzling a glass of her favourite tipple, to asking for a particular mint on take-off Jennifer Lopez 'spends time with Ben Affleck at his Los Angeles house' after taking his son shopping amid intense divorce speculation EXCLUSIVEBianca Censori's friends fear she is drinking to cope with her marriage to Kanye West as they make plans to 'save' her Alex Jones looks incredible in khaki green swimwear as she enjoys a last minute getaway with husband Charlie Thomson and their three children Olivia Culpo shares more snaps from her June wedding day with Christian McCaffrey: 'Happily ever after' Took to Instagram on Monday Vince Vaughn supported by wife Kyla and two kids Locklyn, 13, and Vernon, 11, during RARE family outing at actor's Hollywood Walk of Fame ceremony Sammy Winward's daughter Mia, 19, flaunts her curves in a racy mini dress after her mother 'cut her off from the family' after she set up OnlyFans account Kate has turned the Breton into her own comfort blanket! LIZ JONES on how the Princess of Wales's favourite striped top shows her resolve Noel Gallagher's guitars that he used to record Oasis masterpiece Definitely Maybe to go under the hammer with other music treasures TV star looks unrecognisable as he promotes new tour after previously claiming he 'lost his ability to be funny' Spencer Matthews admits his body feels like it's been 'put in the tumble dryer' as he battles 'horrendous' attacks during his marathon challenge A look at Spice Girls Geri Halliwell and Mel B's feud as Ginger pulls the plug on pop reunion because she can't 'bear to share the stage with bandmate' Netflix fans thrilled as animated series of beloved film franchise gets the green light: 'It's about time' Delighted Jack Whitehall 'becomes one of Britain's richest comedians' thanks to HUGE Netflix gig after becoming a father and raking in '£2.3M' in 2023 CHRISTOPHER STEVENS reviews last night's TV: Meet the hero dedicated to saving tigers in the real-life Jungle Book Stacey Solomon strips down to a skimpy white bikini as she plays with son, Rex, 5, by the pool on a sunny family getaway Ashley Tisdale displays her baby bump as she shares candid post about being in her third trimester of pregnancy Celebrity MasterChef: Ian 'H' Watkins admits he's NEVER cooked for anyone while Edith Bowman discusses lead up to show ahead of new series Wynonna Judd's daughter Grace Kelley looks sullen in latest mugshot after being arrested for a second time this year Bindi Irwin hits back at fans after being accused of 'Photoshopping' wildlife image of red panda sitting on her lap at Australia Zoo EXCLUSIVEBobby Brazier, 21, says Strictly fame saw him 'spending lots of money' and 'thriving' off attention of older women - after addressing scandal Tom Daley fans go wild over viral Speedos video with Team GB's Jack Laugher and Noah Williams after Olympics closing ceremony Ronnie Wood's son Tyrone marries Iron Maiden guitarist's daughter in 'intimate and emotional' second ceremony at country estate Boosie Badazz concert shooting: Two people killed at outdoor show in Pacific Junction, Iowa At The Pull Up Car Show and Music Festival Sarah Paulson cuts a fashionable figure during outing with Appropriate co-stars Ella Beatty and Michael Esper Simone Biles jokes she needs to be sent home from the club as she shares video from wild Olympics celebrations after three gold medals in Paris EXCLUSIVEBen Affleck and Matt Damon are not afraid of Hulk Hogan taking action over sex tape film - as insiders reveal why they are refusing to contact him Today's headlines Most Read Spain and Barcelona superstar Lamine Yamal's dad, 35, is 'stabbed in a car park' and 'in a serious condition... Rise of the XL Bully CAT: Warning over hairless felines with 'exaggerated' features that are being bred in... Elon Musk and JK Rowling could be handed five-year prison sentences and fined up to £214,000 if Olympic... Why Kate's year has been tougher than anyone realises - and why she's starting to glow again: REBECCA... The sixteen rookie errors almost every gardener makes, and how to correct them, by the Mail's gardening... Secret Putin files reveal British targets Russian navy would hit with NUCLEAR MISSILES in the event of a war... World Health Organization declares ultra-deadly monkeypox strain a public health emergency of international... Was Tommy Fury blindsided by Molly-Mae? Boxer shared snap of the couple enjoying dessert date just hours... DEAR JANE: My husband tried to CHEAT with my daughter (his stepchild)... but I can't divorce him How to protect your investments from a recession in America as the world braces amid growing fears of... You're letting people track your iPhone due to little-known features - here's how to turn them off Brad Pitt and George Clooney rekindle their bond having drifted apart over a wedding snub and Angelina's... How the world's frozen billionaires will avoid being resurrected poor: Their severed heads are pumped with... My toe-curlingly embarrassing faux pas with an aubergine emoji... and other tales from 25 years of the emoji Easyjet cancels 232 flights over next three days from holiday destination loved by British tourists as cabin... Urgent manhunt for suspected child sex offender with a large face tattoo who escaped police while in... Mother dying from massive post-birth haemorrhage was just given ginger biscuit by hospital because staff... Brave little girl, eight, beats robber with a baseball bat in her dad's liquor store Taylor Swift will be 'joined onstage by HUGE UK star' at Wembley for the 'hardest concert of her career' as... How Harry and Meghan's tour of Colombia will take in historic town of freed African - but fears rise that... The exercise pill? Discovery of the body's 'activity switch' could lead to drug that gets us moving,... Moment holiday-loving drug dealer is snared by police at the airport after he sent pictures sunning himself... How Stephen Way supported Gloria Hunniford during death of her daughter Caron Keating and struggles through... Tennis legend Martina Navratilova, 67, adopts two young boys with partner Julia Lemigova, a year after... Ukraine gets the green light to fire British weapons in Russia, MoD says - but Kyiv is barred from blasting... Mother of Romanian man Ioan Pintaru suspected of stabbing tourist, 11, in Leicester Square says she is... Mysterious new Stonehenge discovery deepens puzzle over the origins of the monument Brave cyclist, 59, reveals how he fought off hammer-wielding gang who tried to steal his £6,000 e-bike by... What's Kamala Harris hiding? She's been the nominee for a MONTH - yet still refuses to reveal a single... EDEN CONFIDENTIAL: Kim Kardashian's request to have honeymoon with Kanye West at Irish castle owned by actor... How friends revealed Molly Mae and Tommy Fury had hit 'rocky' patch weeks before shock split today: from... Tommy Fury breaks his silence on split from fiancée Molly Mae Hague as he says he is 'heartbroken' they have... What will happen to Tommy Fury and Molly-Mae's £9m fortune? From Love Island pair's £4million Cheshire home... How Molly-Mae Hague changed after Love Island: Inside her transformation from glam reality star to chic... All the signs Molly-Mae Hague and Tommy Fury were set to split: From the boxer's WILD holiday to influencer... Was this Tommy Fury's last-ditch attempt to keep his relationship with Mo","summary":"The singer, 34, was forced to cancel tree shows in Vienna due to a foiled terror plot just weeks after three young girls were murdered at a Taylor Swift themed dance class in Southport, Merseyside.","url":"https://www.dailymail.co.uk/tvshowbiz/article-13744407/Taylor-Swift-ed-sheeran-wembley-eras-tour-vienna.html?ns_mchannel=rss&ns_campaign=1490&ito=1490","image":"https://i.dailymail.co.uk/1s/2024/08/14/23/88538361-0-image-m-19_1723673066675.jpg","video":"https://videos.dailymail.co.uk/video/mol/2024/08/08/9020870406921567343/1024x576_MP4_9020870406921567343.mp4","publish_date":"2024-08-14 22:22:58","author":"Editor,Geraint Llewellyn","authors":["Editor","Geraint Llewellyn"],"language":"en","catgory":"entertainment","source_country":"GB","sentiment":0.038},{"id":254137148,"title":"Musk’s new Grok upgrade allows X users to create largely uncensored AI images","text":"On Tuesday, Elon Musk's AI company xAI announced the beta release of two new language models, Grok-2 and Grok-2 mini, available to subscribers of his social media platform X (formerly Twitter). The models are also linked to the recently released Flux image synthesis model, which allows X users to create largely uncensored photorealistic images that can be shared on the site. \"Flux, accessible through Grok, is an excellent text-to-image generator, but it is also really good at creating fake photographs of real locations and people, and sending them right to Twitter,\" wrote frequent AI commentator Ethan Mollick on X. \"Does anyone know if they are watermarking these in any way? It would be a good idea.\" In a report posted earlier today, The Verge noted that Grok's image generation capabilities appear to have minimal safeguards, allowing users to create potentially controversial content. According to their testing, Grok produced images depicting political figures in compromising situations, copyrighted characters in inappropriate contexts, and scenes of violence when prompted. The Verge found that while Grok claims to have certain limitations, such as avoiding pornographic or excessively violent content, these rules seem inconsistent in practice. Unlike other major AI image generators, Grok does not appear to refuse prompts involving real people or add identifying watermarks to its outputs. Given what people are generating so far—including images of Donald Trump and Kamala Harris kissing or giving a thumbs-up on the way to the Twin Towers in an apparent 9/11 attack—the unrestricted outputs may not last for long. But then again, Elon Musk has made a big deal out of \"freedom of speech\" on his platform, so perhaps the capability will remain (until someone likely files a defamation or copyright suit). People using Grok's image generator to shock brings up an old question in AI at this point: Should misuse of an AI image generator be the responsibility of the person who creates the prompt, the organization that created the AI model, or the platform that hosts the images? So far, there is no clear consensus, and the situation has yet to be resolved legally, although a new proposed US law called the NO FAKES act would presumably hold X liable for the creation of realistic image deepfakes. With Grok-2, the GPT-4 ceiling still holds Looking beyond images, in a release blog, xAI claims that Grok-2 and Grok-2 mini represent significant advancements in capabilities, with Grok-2 supposedly outperforming some leading competitors in recent benchmarks and what we call \"vibemarks.\" It's always wise to approach those claims with a dose of skepticism, but it appears that the \"GPT-4 class\" of AI language models (those with similar capability to OpenAI's model) has grown larger, but the GPT-4 barrier has not yet been smashed. \"There are now five GPT-4 class models: GPT-4o, Claude 3.5, Gemini 1.5, Llama 3.1, and now Grok 2,\" wrote Ethan Mollick on X. \"All of the labs are saying there is room left for continued giant improvements, but we haven’t seen any models truly leap above GPT-4… yet.\" xAI says it recently introduced an early version of Grok-2 to the LMSYS Chatbot Arena under the name \"sus-column-r,\" where it reportedly achieved a higher overall Elo score than models like Claude 3.5 Sonnet and GPT-4 Turbo. Chatbot Arena is a popular subjective vibemarking website for AI models, but it's been the subject of controversy recently when people disagreed with OpenAI's GPT-4o mini placing so highly in the rankings. According to xAI, both new Grok models show improvements over predecessor Grok-1.5 in areas like graduate-level science knowledge, general knowledge, and math problem-solving in benchmarks that have similarly proved controversial. The company also highlighted Grok-2's performance on visual tasks, claiming state-of-the-art results in visual math reasoning and document-based question answering. The models are now available to X Premium and Premium+ subscribers through an updated app interface. Unlike some of its competitors in the open weights space, xAI isn't releasing the model weights for download or independent verification. This closed approach stands in stark contrast to recent moves by Meta, which recently released its Llama 3.1 405B model for anyone to download and run locally. xAI plans to release both models through an enterprise API later this month. The company says this API will feature multi-region deployment options and security measures like mandatory multifactor authentication. Details on pricing, usage limits, or data handling policies have not yet been announced. Photorealistic image generation aside, perhaps Grok-2's biggest liability is its deep link to X, which gives it a tendency to pull inaccurate information from tweets. It's a bit like if you had a friend who insisted on checking the social media site before answering any of your questions, even when it wasn't particularly relevant. As Mollick pointed out on X, this close link can be annoying: \"I only have access to Grok 2 mini right now, and it seems like a solid model, but often seems ill-served by its RAG connection to Twitter,\" he wrote. \"The model is fed results from Twitter that seem irrelevant to the prompt, and then desperately tries to connect them into something coherent.\"","summary":"With Grok's new AI image generator, X users put Musk's \"freedom of speech\" to the test.","url":"https://arstechnica.com/information-technology/2024/08/musks-new-grok-upgrade-allows-x-users-to-create-largely-uncensored-ai-images/","image":"https://cdn.arstechnica.net/wp-content/uploads/2024/08/trump_catgirls_1-760x380.jpg","video":null,"publish_date":"2024-08-14 22:22:14","author":"Benj Edwards","authors":["Benj Edwards"],"language":"en","catgory":"politics","source_country":"US","sentiment":-0.219},{"id":254137068,"title":"Crypto group’s campaign spending angers Republicans: From the Politics Desk","text":"Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill. In today’s edition, political reporter Katherine Doyle explains why some Republicans are miffed by a crypto group's campaign spending. Plus, chief political analyst Chuck Todd looks at the Republicans who are begging Donald Trump to stay on message. Sign up to receive this newsletter in your inbox every weekday here. Crypto group’s campaign spending angers Republicans By Katherine Doyle JACKSON HOLE, Wyo. — A leading pro-cryptocurrency political group is dumping millions of dollars into high-profile Senate races in Arizona and Michigan to back Democrats against Donald Trump-endorsed candidates, angering top Republicans who viewed the industry as an ally, not an opponent. Fairshake PAC and its affiliated super PAC announced plans to spend $3 million backing both Ruben Gallego in Arizona and Elissa Slotkin in Michigan, two contests that will play a major role in determining which party wins control of the closely divided Senate this fall. The campaign comes as top Republicans have sought to broker closer ties to members of the crypto industry amid a hostile regulatory environment. Fairshake pointed to Slotkin’s and Gallego’s current A-ratings from Stand With Crypto, a nonprofit advocating for the crypto industry. While both Democrats have expressed skepticism of the industry in the past, they crossed party lines this year to support a major crypto bill. The group also plans to spend $12 million in an attempt to unseat Democratic Sen. Sherrod Brown in Ohio, chair of the powerful Committee on Banking, Housing and Urban Affairs, who is viewed by industry advocates as a crypto skeptic. Still, the spending in favor of Democrats in other critical races has rubbed some in the GOP the wrong way. They warn that the group risks losing sway with Republicans after working to cultivate hard-won relationships and question the durability of Gallego’s and Slotkin’s crypto support. The spending was a hot topic of conversation as Republicans descended on Jackson Hole this week, alongside investor Marc Andreessen and representatives from Coinbase and other crypto groups, to attend consecutive retreats hosted by the Congressional Leadership Fund super PAC and House Speaker Mike Johnson, R-La. Andreessen and his business partner, Ben Horowitz, have endorsed Trump in the presidential race and criticized the Biden administration’s regulatory agenda. Together, Andreessen and Horowitz are among Fairshake’s most significant donors. “Republicans are WTF about what’s going on with Fairshake, and I think that’s a pretty bad omen for the industry, that people are walking around wondering why our main trade association is pointing its arsenal at our friends,” said one industry leader, who was granted anonymity to speak freely. “A lot of people are walking around the CLF conference astonished that this is the strategic chess move that the industry has made.” Read more from Katherine → Republicans are stuck with Trump’s obsessions By Chuck Todd Nearly a month into Vice President Kamala Harris’ serving as the Democrats’ new standard-bearer, the question of who has the weaker presidential nominee for down-ballot candidates is back up for debate. As of this writing, it’s now Republicans in battleground states and districts who are begging their nominee to change course. And so far, Trump isn’t listening. A good example of this gentle public nudging of Trump to change his approach comes from Vivek Ramaswamy, the former presidential candidate who has been making the media rounds calling for a more focused and even subdued Trump campaign. Here’s what he said recently on NPR: “Who’s going to secure the border? Who’s going to grow the economy? Who’s going to stay out of World War III? And, more intangibly ... who’s going to restore national pride in this country? I think Donald Trump has a strong case on all of those counts, and I think he and the Republican Party will be well-served to focus on the policy contrasts.” And yet, in just about every public forum Trump has been involved in since Harris’ ascension, he has been incapable of pivoting to a message that’s anywhere close to the advice from Ramaswamy. This wouldn’t be hard for a normal candidate. And yet for Trump, it has been quite hard. In talking with folks who know him well, it’s clear he can’t get over losing to Joe Biden in 2020. His only personal hope of moving past the Biden defeat in 2020 was to defeat him in 2024. Now, Biden has denied him that opportunity. He also doesn’t seem to respect Harris as an opponent, and voters are picking up on that. Disdain from one candidate can turn swing voters against that campaign and toward the target. The best example of that? Hillary Clinton, who clearly never viewed Trump as a worthy opponent in 2016. The “deplorables” comment only reinforced that view. Well, Trump is falling into the same trap. It’s possible the less respect he shows for Harris, the less scared the public will be to give her a chance. Read more from Chuck → That’s all from the Politics Desk for now. If you have feedback — likes or dislikes — email us at politicsnewsletter@nbcuni.com And if you’re a fan, please share with everyone and anyone. They can sign up here.","summary":"A crypto group's move to spend millions of dollars backing Democrats in key Senate races has upset Republicans who have sought to forge ties with the industry.","url":"https://www.nbcnews.com/politics/crypto-group-spending-angers-republicans-politics-desk-rcna166655","image":"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1500w,f_auto,q_auto:best/rockcms/2024-03/240304-bitcoin-al-0838-973d52.jpg","video":null,"publish_date":"2024-08-14 22:20:02","author":"The Politics Desk","authors":["The Politics Desk"],"language":"en","catgory":"politics","source_country":"us","sentiment":-0.096},{"id":254136830,"title":"Trump, Harris criticize each other over economic policies","text":"Trump, Harris criticize each other over economic policies Former President Donald Trump and Vice President Kamala Harris are both honing in on the economy this week. Trump has blamed the Biden administration for high prices while Harris' campaign has criticized the state of the economy when Trump left office. Harris is set to roll out a major economic plan on Friday. This comes after inflation cooled in July, falling to its lowest level in three years. CBS News chief election and campaign correspondent Robert Costa and senior White House correspondent Weijia Jiang have more.","summary":"Former President Donald Trump and Vice President Kamala Harris are both honing in on the economy this week. Trump has blamed the Biden administration for high prices while Harris' campaign has criticized the state of the economy when Trump left office. Harris is set to roll out a major economic plan on Friday. This comes after inflation cooled in July, falling to its lowest level in three years. CBS News chief election and campaign correspondent Robert Costa and senior White House correspondent Weijia Jiang have more.","url":"https://www.cbsnews.com/video/trump-harris-criticize-each-other-over-economic-policies/","image":"https://assets2.cbsnewsstatic.com/hub/i/r/2024/08/14/676bea75-d843-49c4-af6a-56102a6fa09a/thumbnail/1200x630/b57d11611584611eb3e824e57eda58f6/cbsn-fusion-trump-harris-criticize-each-other-over-economic-policies-thumbnail.jpg?v=d8f7565ef3e8b72561ee316b5993","video":null,"publish_date":"2024-08-14 22:18:41","author":null,"language":"en","source_country":"US","sentiment":-0.145},{"id":254137034,"title":"Police identify suspect in break-in of Trump campaign office in Virginia","text":"ASHBURN, Va. (AP) — Police in northern Virginia said Wednesday they were looking for a homeless man they suspect broke into an office of Donald Trump’s presidential campaign. The Loudoun County Sheriff’s Office said it has issued an arrest warrant for Toby Shane Kessler, 39, of no fixed address, on a burglary charge in connection with the break-in. The sheriff’s office says Kessler was captured on surveillance video Sunday night forcing his way through a back door into the office building in Ashburn. The office is being leased by the Trump campaign and serves as headquarters for the Virginia 10th District Republican Committee. The suspect’s face was captured clearly on the surveillance video. According to the sheriff’s office, Kessler spent a brief time in the office and it’s unclear whether he took anything. They do not believe he left anything behind. Thomas Julia, a spokesperson for the sheriff’s office, said Wednesday that it’s too early to say whether there was any political motivation to the break-in and that authorities will know more once Kessler is arrested. The sheriff’s office said Kessler has a history of criminal behavior and appears to have been in the Washington metropolitan area since at least 2018. He has a California driver’s license. Last month, Kessler was charged in neighboring Fairfax County with entering property with intent to damage, a misdemeanor, according to online court records. The attorney representing him in the Fairfax case did not immediately return a call Wednesday evening seeking comment. Kessler’s name does not appear as a defendant in Loudoun County court records. The Associated Press","summary":"ASHBURN, Va. (AP) — Police in northern Virginia said Wednesday they were looking for a homeless man they suspect broke into an office of Donald Trump&#8217;s presidential campaign. The Loudoun County Sheriff&#8217;s Office said it has issued an arrest warrant for Toby Shane Kessler, 39, of no fixed address, on a burglary charge in connection [&#8230;]","url":"https://toronto.citynews.ca/2024/08/14/police-identify-suspect-in-break-in-of-trump-campaign-office-in-virginia/","image":"https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2024/08/d80f10e6aadc1d09f86b77544ba926668ede4925c507767aab0deac7964666bb.jpg","video":null,"publish_date":"2024-08-14 22:15:39","author":"News Staff,The Associated Press","authors":["News Staff","The Associated Press"],"language":"en","catgory":"politics","source_country":"ca","sentiment":-0.859}]}